{"Case Number":"42668","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=37.435048,+-90.958457(42668)&iwloc=A&hl=en\"> mufon case (42668) map </A>","files":["/var/www/straped/mufon/html2text/42668.html.txt","/var/www/straped/mufon/org/42668.html"],"Disposition":"Unresolved","divs":["Sighting DetailsI saw this UFO several times during the month of August 2012, in the Sutton's Bluff State Park, and it has consistently been between 10 and 15 degrees above the horizon. The UFO isn't fancy at all. It's merely a white dot that is not to be confused with Venus. The only difference between Venus and this UFO is the motion of them. Venus, as we all know, travels in a very large circle so slowly we cannot observe that motion at any given second or even in a span of 20 seconds or more. The UFO I have observed for many minutes at a time can easily be seen moving gracefully in a smooth, meandering, yet unpredictable, pace. Its movements might convince an observer that it is under intelligent control. The object's motion doesn't strike me as entirely random or totally erratic-looking. It's like it is being strategic about its position; and what that strategy is is beyond me. There is no way to tell if it is moving forward and backward in relation to me. All I can discern is side-to-side and up-and-down motion in that plane. I have yet to observe its brightness level ever to change, unless something like a cloud or haze gets between me and the UFO. And, I have yet to see it disappear on its own. It has always been I who have left the scene or driven into a valley where I lose the UFO amongst the tall trees. While driving in the hilly, curvy Missouri Ozarks, it's difficult to track anything anyway. And, by the way, there is no sound associated with this UFO. The first time I saw it, it spooked me, because I could see it moving slowly in my passenger-side mirror. I thought it was a person sneaking up behind me with a little flashlight. You know, very few things in the sky even show up in one of those convex mirrors. It has to be pretty bright or large to reach our eyes after hitting a convex mirror. That's why its movement spooked me. I didn't realize it was something in the sky instead of on the ground until I got out and looked with my naked eyes. I was, after all, parked on a gravel road sloping downward. The next day I told Dad what I had seen, but because he has heard me claim so many strange sightings lately, I told him I probably just mistook Venus for a UFO. I knew better, being an amateur astronomer and hearing that classic statistic many times which states that the number-one cause of explainable UFO sightings is the planet Venus. Yes, I made sure it wasn't Venus. For one thing, Venus doesn't appear to move in a rear-view mirror unless the mirror is moving, which it wasn't at the time. It was obvious, even in a convex mirror, that this object was moving and not just moving in a straight line. Like I said, its movements almost look as though there is thought behind them. Wind was blowing the trees that night, and this can also make Venus appear as though it is moving. But, it didn't just flit between a few leaves due to wind alone. No, this object which may not even be as bright as Venus moved one direction for over the width of a large tree, then maybe three minutes later, moved back the opposite direction, as well as up and down, and it carried out all these careful movements smoothly and slowly. One might say its movement was ballet-like compared to the break-dancing of the leaves. Does anyone out there know what this light is? Is it something the government has to help monitor the park? I didn't see any wires or pole holding it up, and it looked like it was so great a distance from me, I couldn't tell how close or far it actually was. It appeared to me that the object was less than a mile away. The movement kind of suggests it was closer rather than farther than a mile. For it to be miles away, it would have to be moving at tremendous speeds and with breakneck changes in direction. So, if it was within a mile of me, might it be a Missouri Conservationist secret spy drone? Does that little light help it see or something? It doesn't look bright enough to illuminate anything at that distance. It's a mystery to me. If you live in the area, I invite you to visit Sutton's Bluff, or rather, the well-constructed highway that connects the park to State Highway 21. The government spent a lot of money on that road, building parking lots and paved medians to pull off the road and park on. I've always been impressed with that area that stretches for miles into the boonies out toward Doe Run lead mines. Visit Sutton's Bluff at night so you too can take in this spooky sight. I tried to take photos and video, but my camera doesn't do too well without a lot of light. Even after digital enhancement, my photos showed nothing of value. I may have a video clip if anyone wants to digitally enhance it."],"Latitude":"37.435048","Log Number":"US-09192012-0018","City":"Centerville","Sighting Duration":"00:30:00","Object Features":"None","Region":"Missouri","Summary":"Meandering UFO Seen Repeatedly Near Suttons Bluff","Object Shape":"Star-like","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","trends":["There have been no other sightings in Centerville","This sighting has never been favorited."],"Date of the Event":"08/10/2012 04:30 UTC","Tags":"City","Country":"United States","Date Submitted":"09/19/2012 10:02 UTC","Longitude":"-90.958457"}