{"Summary":"ufo squad 50+ flying in, we flashed them, they stopped overhead, still there is formation over full sky. dance to 1600 lumens flash light, feel communication, feels like love","Object Features":"None, Unknown","Weather Factors":"Unknown","Latitude":"46.166672","Object Flight Path":"Stationary,Other","Disposition":"Unresolved","Date Submitted":"09/20/2012 07:13 UTC","Case Number":"42679","Viewing Distance":"Unknown","Region":"Montana","Longitude":"-113.301462","Date of the Event":"09/18/2012 05:59 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=46.166672,+-113.301462(42679)&iwloc=A&hl=en\"> mufon case (42679) map </A>","trends":["There has been one other sighting in Anaconda","There were no other sightings in Anaconda on or around September 18th 2012"],"Tags":"City","files":["/var/www/straped/mufon/html2text/42679.html.txt","/var/www/straped/mufon/org/42679.html"],"divs":["Sighting Details Hello MUFON: I live at Georgetown Lake, MT. I have seen ufos all my life. I have mental contact at times with them. We were resting on the deck in the evening, about 3 weeks ago. Frank and I saw a massive squadron of 50+ ufos fly over the house. We flashed them with a 1600 lumens flashlight and they stopped overhead. Since then, they are still overhead in a concentric and geometric layout. I am working at a sky drawing but it is difficult to position the sky on a canvas. A full sky photographer is needed. Several nights ago I took 32 consecutive pics of the same ufo in about a half hour of time. I zoomed them an printed them out at CVS Pharmacy. Then I used the jewelers loupe to further enlarge the ufo photos. I was amazed! Every pic is different in shape, color, sharpness etc. The ufo must morp. I also have pics of the energy fields around the ufo. This particular ufo came close to our home about 5 am. I happened to see it and began the pics with my LG cell Phone. We also saw an enormous orange slice in the lower sky, with veins and a rich orange hide that was not the moon. More interesting was the Plaides formation of a very small dipper. I thought the dipper was oddly placed. I flashed the stars in the dipper and each one danced for us. I can show you the ufo squadron layout and get all the ufos to dance with the flashing light, ther must be hundreds of them to flash with. I am feeling that these aliens are supportive of me and will let us know what is up. I must get my mind atuned to be receptive to their messages. The ufo squadron is still there and communicating every night. Due to heavy smoke from tree fires in the area, every night is not a likely viewing until early morning when the air is coolest. Please reply ASAP."],"Country":"United States","Sighting Duration":"Undisclosed","Log Number":"US-09202012-0011","City":"Anaconda","Object Shape":"Boomerang, Cone, Chevron, Circle, Cylinder, Diamond, Disc, Flash, Oval, Sphere, Square, Rectagular, Star-like, Triangle","Source":"MUFON"}