{"City":"Ocean Isle Beach","Case Number":"42673","Date of the Event":"09/18/2012 10:00 UTC","Disposition":"Unresolved","trends":["There have been 5 other sightings in Ocean Isle Beach","There were no other sightings in Ocean Isle Beach on or around September 18th 2012"],"Country":"United States","Date Submitted":"09/20/2012 10:15 UTC","Latitude":"33.918406","Weather Factors":"Unknown","Source":"MUFON","divs":["Sighting DetailsMy mother, step father, and I witnessed 4-6 (maybe more) UFOs out over the ocean during our vacation to Ocean Isle Beach, NC. They erratically flashed white, pulsating, similar to the size and shape of a plane's anti-collision lights. However, their speed couldn't even really be quantified. They appeared quickly, one by one, after the first. Then they all began travelling at break-neck speeds from one end of the horizon to the other in the matter of minutes. They were not flying in a straight line, they actually appeared to \"jump\" from one spot to the next. They grew apart, with the original one clear at the other end of the sky. Then, in what almost seemed like an effort at communication, to regroup perhaps, they STOPPED in mid-air, all 4 mind you, and all 4 LIT UP BRIGHT ORANGE. 4 HUGE, orange orbs in the sky. If you were to hold your hand out in front of your face, they would measure about half an inch. After this \"glowing\" of about 10-20 seconds, they disappeared and then came back in a tighter formation. From here, they started bouncing all over the sky, and eventually all 4 of them disappeared. I began walking away, shocked, and ran back to the room. I turned around, came back, and there was one of them back in the sky. It jumped around for a while, then bam, disappeared again. Flares? No. Planes? Absolutely not. UNIDENTIFIED flying objects? Indeed."],"Sighting Duration":"00:40:00","map":"<A HREF = \"http://maps.google.com/maps?q=33.918406,+-78.390258(42673)&iwloc=A&hl=en\"> mufon case (42673) map </A>","Viewing Distance":"Unknown","Summary":"~4-6 twinkling star-like objects stop in mid-air then glow bright orange then return to twinkling","Region":"North Carolina","Object Shape":"Diamond, Fireball, Star-like","Object Features":"None","Log Number":"US-09202012-0005","Tags":"City","Longitude":"-78.390258","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/42673.html.txt","/var/www/straped/mufon/org/42673.html"]}