{"Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 2 other sightings in Caribou","There were no other sightings in Caribou on or around September 20th 2012"],"Object Flight Path":"Path then hovering","divs":["Sighting DetailsI was picking up after my kids and got a little too hot,so i stuck my head out my window and noticed that the sky was extremely clear for my area.I remembered A NASA video on tat said that you could see the milky way on clear night with just your eyes.So i looked and sure enough you can. But i noticed that some of the stars were in formation patterns of 3.The one on top and bottom seem to dodge from side to side, but the middle one was completely stationary.I didn't see a pattern like the big or little dipper so i kept looking and notice that on of the stars stood out.I thought wow the north star so i kept looking and noticed that it was flat so i curled my index finger and thumb together like you would do to look at an eclipse,and noticed that the North Star looked like a horizontal line of pure light! and it was wobbling in a circular pattern and stopping.It even appeared to get closer then wobble back up.I got angry because i don't own a good digital camera and went in side and tried to tell my wife, But she was sound asleep.No one to share with but here.Too upset to go to bed.I hope that when another event like this happens i can have something to show.sorry. >8("],"Region":"Maine","Object Shape":"Disc","City":"Caribou","Sighting Duration":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/42672.html.txt","/var/www/straped/mufon/org/42672.html"],"Weather Factors":"Unknown","Latitude":"46.849561","Longitude":"-68.013328","Date Submitted":"09/20/2012 02:39 UTC","Log Number":"US-09202012-0004","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=46.849561,+-68.013328(42672)&iwloc=A&hl=en\"> mufon case (42672) map </A>","Case Number":"42672","Object Features":"None","Date of the Event":"09/20/2012 01:35 UTC","Summary":"I stuck my head out my window,noticed the sky was clear and wanted to see the milky way and i noticed that some of the stars were moving.","Tags":"City","Country":"United States"}