{"Case Number":"42677","map":"<A HREF = \"http://maps.google.com/maps?q=34.053218,+-111.086741(42677)&iwloc=A&hl=en\"> mufon case (42677) map </A>","trends":[],"Log Number":"US-09202012-0009","Date of the Event":"09/19/2012 07:45 UTC","Object Flight Path":"Path with directional change,Path then hovering","Latitude":"34.053218","divs":["Sighting DetailsI was at home and heard a military helicopter landing so I went outside to watch. My girlfriend looked out the door and pointed out a mysterious light in the sky. I told her I thought it was the north star or another bright star when she said \"no its moving\". I took a closer look and sure enough it was moving very erratically within about a 10\" dia. circle initially. It was far off in the distance so actual travel distance could have been very large. After viewing the moving light several other similar lights would come into and leave the sky. These others had a lot of distance relative to the \"main\" craft. My girfriend and I had all kinds of feelings and both of us got goose bumps watching the event. Were they watching us, were we going to be under attack...? were some of the feelings we had. I called the local police and reported the siting. Eventially the main craft stabalized and very slowly descended below the horizon. The other craft disipated also. I am a commercial airplane and helicopter pilot also a aerospace systems engineer and have never witnessed a phenomenon in the sky like this before. Only on one other occasion did I see a light maneuvering in the sky back around the year 2000 but it wasn't the magnitude of this event. I was able to justify that event in my mind as a possible goverment or military high altitude manuevering aircraft. I always try to rule out siteings by makeing sure they are not satellites, aircraft, cosmic activity, bugs etc.. In this case the event lasted long enough to make a high level of confidence ruling that this was some type of UFO activity."],"Weather Factors":"Unknown","City":"Undisclosed","Sighting Duration":"Undisclosed","Longitude":"-111.086741","Source":"MUFON","Country":"United States","files":["/var/www/straped/mufon/html2text/42677.html.txt","/var/www/straped/mufon/org/42677.html"],"Viewing Distance":"Over 1 Mile, Unknown","Date Submitted":"09/20/2012 03:10 UTC","Region":"Arizona","Object Shape":"Unknown","Summary":"Zig-zaging flight pattern, erratic positioning. High rates oa acceration. Changing light colors and intensity.","Disposition":"Unresolved","Object Features":"Unknown","Tags":"City"}