{"Viewing Distance":"101-500 Feet","Object Shape":"Other","Object Flight Path":"Other","City":"Lake Havasu City","Summary":"have seen many jets chasing objets in sky but the 1 i am reporting to you was huge","divs":["Sighting Details moved to lake havasu the summer of 2008 and have seen many objects in the skys here being chased by jets. me and my kids would watch the skys and would count the jets chasing these things with no luck at all. we counted 1 night 9 jets chasing 2 differnt things and it was like a game to the objects. one night in november 2008 my oldest son went out to check the skies. he came running back in and said he was never going out again. i grabbed our camera and went out the front. i looked and didnt see anything so i went to the side of the house and still didnt see anything. i looked twords the lake and saw stars and then i understud what scared my son. when you looked up and to the right and left you saw no stars this thing was huge. only after looking real hard could i even tell somewthing was above me no more then 200 feet above me. at times it looked like waves and i couldnt see either end but i could see it moving real slow. i tried to take pitures but the camera battery was dead and i had just taken it off the charger. it was above me for at east 5 mineuts and only when i heard the sound of jets in the distance did this thing start to move faster. it didnt take this thing more then 5 seconds to go from being right above me to being out of sight. i couldnt even begin ti guess the size other then to say it had to be miles long and since i couldnt even see the ends i couldnt even give you the shape and i have seen blimps in my 50 years on this earth and if anyone would say it was a blimp i would have to say it had to be at least 50 blimps all tied together and yet it didnt make a sound at all.not when it was hovering nor when it took off. in the 4 years i have lived here in lake havasu i have noticed that from about october to march every year we see jets chasing differnt light and objects in the skies all the time but again this one was huge like having our whole little city in the air on one ship."],"Date Submitted":"09/21/2012 12:18 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/42694.html.txt","/var/www/straped/mufon/org/42694.html"],"trends":["There have been 30 other sightings in Lake Havasu City","There were no other sightings in Lake Havasu City on or around November 10th 2008"],"Case Number":"42694","Region":"Arizona","Longitude":"-114.340254","Object Features":"Other","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Weather Factors":"Unknown","Latitude":"34.526373","Date of the Event":"11/10/2008 12:00 UTC","Log Number":"US-09212012-0007","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.526373,+-114.340254(42694)&iwloc=A&hl=en\"> mufon case (42694) map </A>","Source":"MUFON"}