{"files":["/var/www/straped/mufon/html2text/42692.html.txt","/var/www/straped/mufon/org/42692.html"],"Weather Factors":"Unknown","Object Shape":"Sphere, Unknown","divs":["Sighting DetailsStargazing in my Bedroom on my bed. First noticed when it's orbit came into viewing distance directly after constellation of Orion moved in the night sky. Orion's belt was above the object but seemed to be in line with it. I had no idea what I thought it was. Twice as big as star or planet. Then noticed that it did not move but remained in orbit so i assumed it could be a satelite or spacejunk. The light was mostly white, however, it looked as if it was shifted and i was only seeing say the back of an object from the front. but it could just see enough. at first i thought it might be a hologram of something because i saw a little bit of dim light directly in the opposite direction. then i thought it might be a tube or part of a space station. It also might be a white hole, but i would think that would be a lot brighter, but it had that sort of affect of like a rip in space or a space window. But however these are just guesses. the light sometimes turned a little red and blue but was mostly white. looked like two lighted sticks side by side? not sure hard to focus on i had my glasses on but the light was just distorted somehow. Lets call it object A. sometimes i would see a smaller ball of light flash out of no where really close to the object A but around the object I could see flashes of pure white light in a ball behind clouds. then came the less bright white orbs, they would blink and move across the night sky all around the craft. Lets call these objects B. One was so odd, that it went directly to my horizon which was a large hill with trees. The blinking white orb bounced off the tops of trees like it was counting them or something?!?! the orb must of been not to far away then. In fact all of these objects where pretty low to the ground. Maybe it was mapping the area? Anyway, in the middle of this childish game by a white orb, the craziest thing of the whole night happened, i saw a flash of light from off somewhere to the right zoom away into the night. lets call this Object C. This was something not man made as it went way way way to fast . it was like if I blinked i would have missed it. my best guess this had to have been some kind of alien craft. It came from somewhere i was not looking, so i could not tell you what it looked like, just that it looked like an object going faster than the speed of light. but still even after that happened, almost oblivious to the fact, the white orb continued bobbing up and down while blinking on the horizon. I saw many more orbs, but the last one i saw decided to go at Object A. This was a change in behavior because before it looked liked they had been methodically studying it by moving around it but not ever getting that close. So this white blinking orb was going to go at this stationary in orbit space window, and the blinking orb went right through it but changed from white to bright yellow to light yellow to unseen or destroyed. so I was like WOW. I am 34 years old, college graduate from Ohio State. Sorry for the long description just wanted to let you know what I saw. I also watched for it the next night and the stationary object A was still there, but there was a lot of could cover. I can see it from 400 t0 daylight. I see it in daylight and i cant make it out, turns more greyish. i would imagine my window to see it is shortening but perhaps i can give a heads up to anyone else to give it a try. thanks and take care, Chris Blume"],"Date of the Event":"09/20/2012 12:00 UTC","Region":"Ohio","Country":"United States","Tags":"City","Source":"MUFON","Log Number":"US-09212012-0005","Viewing Distance":"Unknown","trends":["There have been no other sightings in Minford","This sighting has never been favorited."],"Disposition":"Unresolved","Case Number":"42692","Sighting Duration":"06:00:00","Longitude":"-83.042077","Object Flight Path":"Stationary,Straight-line path","Summary":"Unkown object in orbit with a TON of activity around it.","City":"Minford","Object Features":"Unknown","Latitude":"38.726511","Date Submitted":"09/21/2012 08:42 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.726511,+-83.042077(42692)&iwloc=A&hl=en\"> mufon case (42692) map </A>"}