{"divs":["Sighting DetailsI am so relieved to find this site to report this sighting. I was on upper deck of a Ferry heading to Nanaimo. After about half hour I headed to car deck 4 where my car was parked. A little restless, I stood watching the sea by the small rail by my car. Ferry travelling full speed. Had my ipod on and was totally taking in the beauty of the ride. We were probably half hour or so out from Nanaimo so essentially really still out on ocean. As I panned the scenery, and looked into middle if sky to my right, about three quarter mile up, I noticed something clearly odd and extremely bright and luminous \"sitting\" in front and about me in the middle of the sky! At first I was just trying to figure out what it was, it seemed like a plane in that it was of that size but it was not moving. As I stared at it I could see it was a craft of some kind and not some cloud. It had shape but not definition. At this point it is still not making me think UFO, just still wondering what the hell is that thing. I looked to my left, I swear for a split second and when I looked back all I saw WAS A CLEAR BLUE SKY WITH NOTHING ANYWHERE IN IT. THAT was when I realized I had seen a UFO. I had been staring and trying to figure out the thing for at least a minute and then there was nothing to see in the sky. This was akin to seeing something in the sky almost as big and out of place as a house. As I became aware it was a ufo I looked around the deck where I was standing and nobody else obviously even saw what I just observed. That freaked me out - this thing I saw was HUGE and I assumed anyone could see it. This has been a really exciting but shocking experience for me and I struggled to grasp what has happened. There are UFOs here everyone. I was quite unsettled about this the last two days and my cell was 'lost' four days prior. The way this thing disappeared was creepy for me to witness. It was instantaneously I realised it was not from Earth. I have never seen anything else glow like this thing."],"Country":"Canada","Date Submitted":"09/21/2012 11:25 UTC","Log Number":"CA-09212012-0006","map":"<A HREF = \"http://maps.google.com/maps?q=49.167704,+-123.936285(42693)&iwloc=A&hl=en\"> mufon case (42693) map </A>","Tags":"City","Object Flight Path":"Stationary","Source":"MUFON","trends":["There have been 4 other sightings in Nanaimo","There were no other sightings in Nanaimo on or around September 18th 2012"],"City":"Nanaimo","Longitude":"-123.936285","Date of the Event":"09/18/2012 02:15 UTC","Disposition":"Unresolved","Region":"British Columbia","Summary":"Looked like a craft, well camouflaged to look like a cloud but WAY too bright and luminous to be ignored in a clear blue sky.","Viewing Distance":"501 Feet - 1 Mile","Latitude":"49.167704","Case Number":"42693","files":["/var/www/straped/mufon/html2text/42693.html.txt","/var/www/straped/mufon/org/42693.html"],"Object Features":"Unknown","Object Shape":"Sphere, Star-like","Sighting Duration":"Undisclosed","Weather Factors":"Unknown"}