{"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.112612,+-76.561495(42702)&iwloc=A&hl=en\"> mufon case (42702) map </A>","Object Flight Path":"Other","files":["/var/www/straped/mufon/html2text/42702.html.txt","/var/www/straped/mufon/org/42702.html"],"Log Number":"US-09212012-0013","Source":"MUFON","Case Number":"42702","Summary":"I WENT TO SIT MY GRANDSON FOR A LITTLE WHILE.GOT THERE EARY.WAS LOOKING AT THE BIRDS FLYING AROUND.THEN I LOOKED UP.","Date Submitted":"09/21/2012 03:40 UTC","Sighting Duration":"Undisclosed","Region":"Maryland","City":"Pasadena","Weather Factors":"Unknown","Object Shape":"Other","Object Features":"Wings","Disposition":"Unresolved","Viewing Distance":"Unknown","divs":["Sighting DetailsMY SON INLAW CALLED ME IF I COULD WATCH MY GRANDSON TILL MY ABBY CAME HOME.I TOLD HIM I WOULD MEET HIM AT THEIR CONDO.I GOT THERE EARLY,ABOUT 4 :15 PM.I WAS SITTING WATCHING THE BIRDS FLYING AROUND REALLY FAST.I THOUGHT THAT STRANGE,BECAUSE IT HAD BEEN REAL HOT FOR DAYS.MY EYES WHERE LOOKING UP AND I THOUGHT,MAN THAT BIRD IS REALLY HIGH UP.IT LOOKED LIKE BIRD WINGS,SLIGHTLY BENT DOWN THROUGH THE WINGS.THERE WAS CLOUDS JUST TO THE RIGHT OF IT,BUT IT WAS NO WHERE NEAR IT.IT TURN NOSE UP,THEN IT DID NOT LOOK LIKE A BIRD,OR PLANE.I GUESS YOU CAN SAY,IT SEEN TO LOOK LKIE TWO(2)BOOMERANGS TOGETHER.IT LOOK TO ME IT WAS GOING TO TURN OFFF AND COME BACK DOWN,THIS MY MIND SAID.THEN,GONE,NOT THERE ANYMORE.I WAITED FOR A LONG TIME LOOKING AT THAT SPOT IN THE SKY.I DID NOT WANT MY EYES TO MOVE.IT WAS GONE!I KEPT LOOKING THAT MAYBE THE CLOUD COVERED IT UP.I JUST KEPT LOOKING AT THE SPOT.IT COULD NOT HAVE BEEN A PLANE.WE LIVE NEAR BWI AIRPORT,WORKED THERE FOR AWHILE.NEVER SEEN ANYTHING LIKE IT.MY SON INLAW CAME HOME AND I TOLD HIM WHAT I SAW AND WHERE IT AT.SOME YEARS AGO WHEN I WAS ABOUT 19 ABOUT 9:30 AT NIGHT, IWAS JUST GOT OUT OF MY FRIENDS CAR AND STARTED TO WALK THE ANOTHER FRIENDS CAR,YOU MAY NOT BELIVE THIS,I HEARD,LOOK UP WE ARE REAL,I DID,IT WAS TWO BRIGHT DOTS GOING ACROSS THE NIGHT SKY.ONE A LITTLE HIGHER THAN THE ONE BELOW.THE OTHER ONE WAS DOWN AND BACK FROM THE TOP ONE.THEY WHERE VERY BRIGHT,LIKE A CAN NOT SAY THEY WHERE LIKE SILVER COLOR.I HAVE FOR YEARS WENT BACK THERE LOOKING FOR THEM.SEEN MANY A PLANE,BUT NOT THEM. THANKS FOR READING THIS BEFORE YOU DELETE THIS. JIMMYP"],"Tags":"City","Latitude":"39.112612","trends":["There have been 8 other sightings in Pasadena","There were no other sightings in Pasadena on or around August 31st 2012"],"Longitude":"-76.561495","Date of the Event":"08/31/2012 04:20 UTC"}