{"Tags":"City","Date Submitted":"09/21/2012 04:24 UTC","Object Features":"Other","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Case Number":"42704","trends":["There have been 3 other sightings in Wayne","There were no other sightings in Wayne on or around September 20th 2012"],"files":["/var/www/straped/mufon/html2text/42704.html.txt","/var/www/straped/mufon/org/42704.html"],"Weather Factors":"Unknown","Log Number":"US-09212012-0015","Object Shape":"Triangle","Summary":"Triangular, with red and white lights blinking. It was probably a military test aircraft","City":"Wayne","Viewing Distance":"Unknown","Country":"United States","Disposition":"Unresolved","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.078998,+-75.387169(42704)&iwloc=A&hl=en\"> mufon case (42704) map </A>","Latitude":"40.078998","divs":["Sighting DetailsI was driving home when I noticed 4 yellowish white lights (like the landing lights on planes) The 4 lights kept going, and after I went further down the road I parked. Right above me was a flying triangle. I noted that the triangle had a light at each corner, and a red light in the middle. The yellow-white lights flashed every second or so, and the red lights on the top and bottom flashed in between the yellow flash pattern. I live in an active flight pattern and see multiple 747's and 737's and helicopters, but this was different. The triangle continued across the sky, but I managed to take some photos with my cell camera. Not the best quality, but I got a photo. The triangle continued across the sky, silently. Normally with any plane or helicopter there is a sound of a jet engine or a propeller, but I heard nothing. I kept looking at it until it flew into the tree line. I'm convinced it's terrestrial, because it was flying like the B-2 spirit, but I could defiantly see a grey equilateral triangle against the black sky. The only thing that doesn't make sense is that where I am, not even half a mile there is interstate 76, and I live in a densely populated area. Lockheed Martin does have some buildings about 1-2 miles from where I was, but this was the first time I saw anything like this."],"Date of the Event":"09/20/2012 09:15 UTC","Region":"Pennsylvania","Longitude":"-75.387169"}