{"Date Submitted":"09/21/2012 10:55 UTC","Latitude":"54.56277","divs":["Sighting DetailsI was having a drink in my local GA club, I was on my second pint of beer and went outside to smoke a cigarette. I looked to the NE and saw what I percieved to be an airplane, but then thought to myself it was in a weird flight path. I generally know how planes come and go here. It looked like a bright white orb. It gathered my curiosty somewhat when just before it entered into the clouds the centre of it turned blue. Then within that cloud I saw about nine white orbs. As they left the clouds and went into clear sky they suddenly turned orange and seemed to speed up a little. As they flew onward they did leave trails, kind of like sparks. At times I also seen other colours, blues, red and yellow. They never changed direction but did gather speed. They certainly flew faster than any aircraft I know and yet when I had first spotted the white orb it seemed to be rising slowly into the sky. I did get another witness but he only seen the last part of this episode and yet was amazed at the little he saw. This is the most incredible thing I have ever seen and yet it left me feeling numb instead of excited. I would appreciate other witnesses comming forth."],"map":"<A HREF = \"http://maps.google.com/maps?q=54.56277,+-6.018049(42718)&iwloc=A&hl=en\"> mufon case (42718) map </A>","Object Features":"None","Viewing Distance":"Unknown","Region":"","Summary":"A white orbish light turned blue then broke into multible orange lights with tails and traversed the sky, about 9 or maybe ten","Disposition":"Unresolved","Log Number":"IE-09212012-0029","Object Shape":"Sphere, Unknown","Object Flight Path":"Straight-line path","City":"Belfast","trends":["There have been 11 other sightings in Belfast","There were no other sightings in Belfast on or around September 21st 2012"],"Tags":"City","Sighting Duration":"Undisclosed","Date of the Event":"09/21/2012 10:54 UTC","Country":"United Kingdom","Longitude":"-6.018049","files":["/var/www/straped/mufon/html2text/42718.html.txt","/var/www/straped/mufon/org/42718.html"],"Source":"MUFON","Weather Factors":"Unknown","Case Number":"42718"}