{"Viewing Distance":"501 Feet - 1 Mile, Unknown","City":"Montclair","Date Submitted":"09/21/2012 08:05 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.812156,+-74.213793(42712)&iwloc=A&hl=en\"> mufon case (42712) map </A>","Object Flight Path":"Straight-line path","Object Features":"None","Sighting Duration":"Undisclosed","Region":"New Jersey","Tags":"City","Log Number":"US-09212012-0022","Object Shape":"Sphere, Star-like","Source":"MUFON","Weather Factors":"Unknown","Case Number":"42712","trends":["There has been one other sighting in Montclair","There were no other sightings in Montclair on or around September 21st 2012"],"files":["/var/www/straped/mufon/html2text/42712.html.txt","/var/www/straped/mufon/org/42712.html"],"Longitude":"-74.213793","Country":"United States","Summary":"About 20-30 white and red objects seen moving slowly through sky","Latitude":"40.812156","Date of the Event":"09/21/2012 06:30 UTC","Disposition":"Unresolved","divs":["Sighting DetailsI was coming out of a PathMark supermarket with my 7 year old daughter. When we got to my car she was looking at a plane in the sky, and then said \"Daddy, what are those? They look like the Big Dipper\" I looked around and at first a few small white objects, and a bright red one. Then I looked slightly to the left and saw a large \"swarm\" of them. There had to be at least 20-30 of the objects. Most of them were bright white, and a smaller number of them were a vivid red. They appeared to be illuminated by the sun. They appeared solid, and as globe or orb shaped objects, though it was hard to see because they were so high. I had also felt the white ones might have been rectangular, but it was hard to tell. They looked like the planet Jupiter in size, so slightly larger than stars, which are always small points of light. You could see there was round orb shapes. The sun was starting to set, but it was still light out. At their brightest they seemed to have a halo, or outline around them. They were moving very slowly towards the East. Some of them also moved around into different formations. Most of the time forming straight lines and forming V shapes and what my daughter thought was the Big Dipper. Some of the objects moved very close together, and then farther apart. I saw at least to pairs that looked like they were touching each other and then moved apart. They did not appear to be balloons, as they were not bobbing and were going against the wind, which was blowing SSE. They were very steady, almost hovering. They also remained in position and small groups of them moved at a time. As they moved to the east the whole group of them got somewhat closer together. They were more spread out when we saw first them, with the first small group we saw appearing to join the main group. I attempted to call my ex wife and my son at home to get them to go out and look. By the time I got them on the phone the objects were fading from view. They hadn't moved very far in the sky, but were getting dimmer. Each object did not appear to be getting smaller, just harder to see. At arms length they only moved about 8-10 inches before fading out. Finally while talking to my ex I only counted seven of them. The red ones were gone first. Neither my son or ex saw anything in the sky when they went out. But there was a woman sitting in her car that was also looking up at the sky. These look pretty much like the small objects filmed over Mexico City that I have seen. It was quite an amazing sight."]}