{"Tags":"City","Case Number":"42715","Object Flight Path":"Hovering then path,Path with directional change","divs":["Sighting DetailsMy name is Karl Michaelis, I early in the morning on January 24, 2012 I was feeling very angry and focused on my thoughts knowing that my family didn't know me well enough to get me something that demonstrates they know me. I crouched down, then focused on \"Our brethren\" saying aloud and in my head in unison \"I know you are there and listening. My birthday is my one day I feel is special but I know it wouldn't be... I can feel it. If I am worth the risk would you show yourselves to me? I know at ten I will probably not be outside but if you could ensure that my dad and brother see you as well as come get me along with my camera, I would also greatly appreciate it . I understand that you run the risk of being attacked, but if you could find it within you to do so... It would mean a lot to me personally. It would be the best present I could hope for, thank you for your time in listening to me and safe travels.\" After my family did what I knew they would, I was enraged so much to the point that family members and friends alike could feel a vibration coming from me. Then as I was working on my school work my brother ran to my bedroom window saying \"Karl! Karl! You NEED to get out here right now!\" I replied \"Why what's going on?\" He replied \"Something is out here flying around you need to come see THIS! Bring your camera!\" I jumped out with my camera and began taking pictures at 22:05 the event lasted for about 25 min's (Shortest) 35 min's (Max). It moved up and down left and right I would say it was about a Mile and a half away but was defiantly big, not because the light was bright but because I could size it up fairly well. I have 35 pic's from this event."],"Weather Factors":"Unknown","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.626629,+-112.125827(42715)&iwloc=A&hl=en\"> mufon case (42715) map </A>","Source":"MUFON","files":["/var/www/straped/mufon/html2text/42715.html.txt","/var/www/straped/mufon/org/42715.html"],"Region":"Arizona","Longitude":"-112.125827","Log Number":"US-09212012-0026","Object Shape":"Circle, Sphere","Sighting Duration":"00:30:00","Latitude":"33.626629","Date Submitted":"09/21/2012 09:19 UTC","Summary":"Requested Presences","Viewing Distance":"Over One Mile","City":"Phoenix","Date of the Event":"01/24/2012 10:05 UTC","Country":"United States","Disposition":"Unresolved","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around January 24th 2012"]}