{"Viewing Distance":"501 Feet - 1 Mile, Unknown","Weather Factors":"Unknown","Object Features":"Unknown","Longitude":"-73.965967","divs":["Sighting DetailsLocation: Sea Bright beach in Sea Bright, NJ Time: Approx 8:20pm Weather: Very cloudy My friend A who was visiting wanted to go to the beach to see the sunset, so I took her. It was quite cloudy so there wasn't much to see. We then ended up walking around the town a bit then eventually head back to the beach. We shortly after that went back to the car to remove the sand from our shoes. When I finished I looked up at the sky as something caught my eye. It was the brightest, biggest, and closest object in the sky. I never saw anything like it in my life and I've lived in the area for an extremely long time. I could tell it wasn't a plane as it was not only too close to be a plane, but I saw planes in the sky at the time as that's usual to see at that beach due to an airport being nearby. It looked very star-like and couldn't tell its shape because all I saw was a very bright white light. I watched with A as it became brighter, then darker, completely disappearing, then progressively becoming brighter again. It did this for a little while until it out of no where rose into the sky vertically and shot up into the clouds and above. We shortly saw it reappear in the sky. I can't remember if it was still as close, or in the same place, but at this point I got out of the car to run toward it and try to get as close as possible. I couldn't get any closer due to the water in the ocean and it happened to be above the ocean which appeared to be a mile or few away with how big and bright it was. I saw it 'blink'; becoming brighter, then dark, then brighter again. It ended up disappearing a few times and reappearing in different locations of the sky as well as shielding itself in the clouds. Sometimes we saw it move horizontally and I'm not entirely sure, but I believe I saw red and green blinking lights when it did this, and I believe I saw an outline of a three-dimensional pyramid shape on the top and bottom. I also saw it either morphing into an airplane, or disappearing at that exact time so it seemed to have good cloaking abilities. The both of us watched this for about a half hour until we no longer saw it anymore in the sky, and couldn't find it reappearing anywhere else. Also, while on the beach as I got as close as possible to it, I heard this strange ambient-like sound that sounded a bit metallically. I certainly cannot explain it, didn't know what was causing it, or where it was coming from, but it was certainly a sound I've never in my life heard on the beach before."],"Object Flight Path":"Hovering then path,Straight-line path","files":["/var/www/straped/mufon/html2text/42724.html.txt","/var/www/straped/mufon/org/42724.html"],"Log Number":"US-09222012-0004","Source":"MUFON","Date Submitted":"09/22/2012 01:34 UTC","Date of the Event":"09/20/2012 08:20 UTC","Sighting Duration":"Undisclosed","Country":"United States","Summary":"Blinking lights fading in and out, disappearing/reappearing, shooting up vertically, and reapparering at a different part of the sky.","Region":"New Jersey","Object Shape":"Star-like, Triangle, Other, Unknown","trends":["There has been one other sighting in Sea Bright","There were no other sightings in Sea Bright on or around September 20th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.352375,+-73.965967(42724)&iwloc=A&hl=en\"> mufon case (42724) map </A>","Latitude":"40.352375","Tags":"City","Disposition":"Unresolved","Case Number":"42724","City":"Sea Bright"}