{"Viewing Distance":"101-500 Feet","Object Shape":"Triangle","trends":["There has been one other sighting in Brooktondale","There was one other sighting in Brooktondale on or around March 13th 1997"],"divs":["Sighting DetailsHeading home from a night biology class I noticed the triangle shaped lights coming from Ithaca toward Slaterville initially thinking that an airplane from Ithaca airport was heading to Binghamton airport. I noticed the bright lights as I came over Ellis Hollow Rd. but was too far away to know exactly what I was seeing. As I turned left onto Slaterville Rd. I kept an eye on it but at this point I was kind of parallel with the craft. I took a right turn up Buffalo Hill Rd. and thought that I had lost it... about half way up the road, I saw the lights begin to come across the treetops and I immediately turned off the radio and rolled down my window... again, I thought I was witnessing an airplane falling from the sky. When I heard nothing, I pulled off the road so I could turn off my engine and exit my car to watch and listen. NO SOUND, NO WIND, NO SMELL, and NO signs of life. This thing was huge but again, I was skeptical. It seemed to stand still yet at the same time it progressed at a fast pace. So still thinking it was a plane with engine failure, I hurried back into my car to try to get to the top of the road and watch it fall. Since I was in school for registered nursing, I felt the need to be helpful. Once at the top of the road, it was gone! This craft had to be roughly 300-1000ft from wing tip to wing tip, it did not drop out of the sky and I did not see anything go up... needless to say, I came home and quietly told my partner who was watching my kids from my first marriage. I didnt report it, but I did listen to radio news for anything in regards to this. As I became more familiar with the internet I searched for sightings in this area and only found the Arizona incident. I still run a search on occasion to see if anyone else came forward. I just want to know what the hell I saw... it was not an airplane or anything of the like. Have you heard anything or how can I find out about this? I was a full fledged christian involved in all types of retreats, until this experience, I now follow ancient alien theory."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.389246,+-76.321171(42736)&iwloc=A&hl=en\"> mufon case (42736) map </A>","Object Flight Path":"Straight-line path","Date of the Event":"03/13/1997 10:00 UTC","Disposition":"Unresolved","Longitude":"-76.321171","Region":"New York","Latitude":"42.389246","Weather Factors":"Unknown","Log Number":"US-09222012-0016","files":["/var/www/straped/mufon/html2text/42736.html.txt","/var/www/straped/mufon/org/42736.html"],"Date Submitted":"09/22/2012 01:25 UTC","Source":"MUFON","Summary":"{cak} Saw triangle shaped lights thought an airplane was crashing and realized it was much too large. Afraid to speak about it but never really took that route again.","Country":"United States","City":"Brooktondale","Tags":"City","Case Number":"42736","Object Features":"Wings","Sighting Duration":"Undisclosed"}