{"Log Number":"US-09222012-0015","Object Flight Path":"Unknown","Summary":"Traveling on 580 near Lawrence Livermorre lab I looked up and noticed something in night sky that was zipping back and forth in pics you will see where it goes up second later next pic its going down","Case Number":"42735","Object Shape":"Disc","Latitude":"37.688185","Object Features":"Unknown","divs":["sighting detailswe were traveling from castro valley to tracy on 11\\12\\11 about 8:23 pm just passing lawrence livermore lab. it was lightly raining when i looked up and saw a bright white light that was zipping back and forth like fluttering then it hovered then it turned into a bright red light then was gone. i have a few pictures but if you blow up picture 8 you will see it is nothing we own it has diamond lights around it and it looks like dull metal exterior with 2 metal legs one on each side under it. i know we have nothing that can zip back and forth like this nor do we have something that can be heading downwards 1 sec then the next second it going up you will see this in pictures 3 & 5 pic 4 didnt come out .i taking pictures oneafter another. the best of these pictures is # 8 blow it up and you will be amazed at what you see."],"Region":"California","Country":"United States","City":"Livermore","Viewing Distance":"Unknown","Date of the Event":"11/12/2011 08:22 UTC","Disposition":"Unresolved","trends":["There have been 20 other sightings in Livermore","There were 2 other sightings in Livermore on or around November 12th 2011","This sighting has never been favorited.",""],"Date Submitted":"09/22/2012 01:11 UTC","Weather Factors":"Unknown","Source":"MUFON","Longitude":"-121.710996","map":"<A HREF = \"http://maps.google.com/maps?q=37.688185,+-121.710996(42735)&iwloc=A&hl=en\"> mufon case (42735) map </A>","files":["/var/www/straped/mufon/html2text/42735.html.txt","/var/www/straped/mufon/more/42735_submitter_file1__32.jpg","/var/www/straped/mufon/more/42735_submitter_file2__5.jpg","/var/www/straped/mufon/more/42735_submitter_file3__8.jpg","/var/www/straped/mufon/org/42735.html"],"Tags":"City","Sighting Duration":"Undisclosed"}