{"Latitude":"41.834859","Object Features":"None","Summary":"We observed an object coming in from the ssw and it bounced around in the sky irratically like it was lost","files":["/var/www/straped/mufon/html2text/42741.html.txt","/var/www/straped/mufon/org/42741.html"],"Viewing Distance":"101-500 Feet","Date Submitted":"09/22/2012 05:15 UTC","trends":["There have been 3 other sightings in Niles","There were no other sightings in Niles on or around January 15th 2011"],"Tags":"City","Longitude":"-86.249277","map":"<A HREF = \"http://maps.google.com/maps?q=41.834859,+-86.249277(42741)&iwloc=A&hl=en\"> mufon case (42741) map </A>","Sighting Duration":"00:15:00","Disposition":"Unresolved","Region":"Michigan","Country":"United States","Date of the Event":"01/15/2011 09:42 UTC","Source":"MUFON","Object Flight Path":"Hovering then path","divs":["Sighting Details It was about 9:40 PM on a very warm nite in January in Niles MI. I was waiting to start my shift and noticed a strange light coming in from the SSW and hollard at a fellow employee \"are you seeing this\"? Well this thing came in right over the parking lot and hovered for about 5 min or so. It must have been less than or around 100 feet up or so, fluttering around, up and down, side to side, to and fro. I recall 2 bright lights and I think I saw a little green and red light off to each side. The plant exhaust system was on so we couldn't hear so well. By this time there was about 10 people or more watching. Onn person took a picture with his cell phone but he said it didn't show much. After about 5 min or so it moved to thenortheast about a quarter mile or so and then west and down behind the trees maybe near the AMTRAK area. I was excited because I never saw an object like that. One person speculated it was a somebodys remote control toy. But at 9:45 PM, and the range it flew, I don't know!"],"Weather Factors":"Unknown","City":"Niles","Case Number":"42741","Object Shape":"Square, Rectagular","Log Number":"US-09222012-0021"}