{"trends":["There have been 129 other sightings in Albuquerque","There was one other sighting in Albuquerque on or around September 22nd 2012"],"Disposition":"Unresolved","Weather Factors":"Unknown","Summary":"Sliver Orb was spotted 5 dregrees south of moon position","Log Number":"US-09222012-0029","Longitude":"-106.555922","map":"<A HREF = \"http://maps.google.com/maps?q=35.07442,+-106.555922(42749)&iwloc=A&hl=en\"> mufon case (42749) map </A>","City":"Albuquerque","Object Flight Path":"Stationary","Date Submitted":"09/22/2012 11:14 UTC","Region":"New Mexico","Object Shape":"Cone, Disc","Latitude":"35.07442","Case Number":"42749","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Date of the Event":"09/22/2012 06:41 UTC","Tags":"City","divs":["Sighting DetailsWe were leaving for the store when I looked up and saw the moon in the evening sky then saw a bright silvery orb to the right of the moon. I went to get 35mm Camera, Husband took video and we also took 6 megapixel images. I also took some with my smart phone using the theodolite app. The orb was viewed through the scope lens of a Bushnell Telescope as there are no eye pieces for the scope. The orb appeared to have cross section lines that were barely visible from the scope lens. My husband tried to call the MOFON phone numbers but stated that they were non working numbers. My Husband then tried to contact Mr. Burleson of the New Mexico Chapter and left a message. We went to the grocery store and the Orb was sill visible but the lighted reflection from the setting sun had faded and it then gave off a dim whitish glow. when we returned from the store both the moon and the Orb have moved with the earth rotation but they were still relative to each other in the sky. We also looked to see if there was a weather balloon launch but found no information of such at this time."],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/42749.html.txt","/var/www/straped/mufon/org/42749.html"],"Country":"United States","Object Features":"Patterned Surface"}