{"Disposition":"Unresolved","City":"Greenfield","map":"<A HREF = \"http://maps.google.com/maps?q=39.788343,+-85.761553(42745)&iwloc=A&hl=en\"> mufon case (42745) map </A>","Case Number":"42745","Object Features":"Wings, Other","files":["/var/www/straped/mufon/html2text/42745.html.txt","/var/www/straped/mufon/org/42745.html"],"Object Shape":"Triangle","Region":"Indiana","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Latitude":"39.788343","Date Submitted":"09/22/2012 08:33 UTC","Summary":"Six black triangles cruised overhead the neighborhood at a very slow pace. One ejected some sort of green object that fell to the ground.","Country":"United States","Log Number":"US-09222012-0025","Longitude":"-85.761553","Date of the Event":"04/04/2011 12:00 UTC","trends":["There have been 7 other sightings in Greenfield","There were no other sightings in Greenfield on or around April 4th 2011"],"Tags":"City","Weather Factors":"Unknown","Source":"MUFON","divs":["Sighting Details My friend and I were hanging out that night and eventually we went outside to smoke a cigarette. I looked off towards I-70 facing northwest and saw a bright light off in the distance. It was heading towards us at a very slow rate headed southwest towards Shelbyville. The bright white light on the front of it shut off once it got over the neighborhood airspace. We saw in great detail what it looked like as it cruised above us. It was below cloud cover and looked to be in estimation about 500 feet. It was about 50-100 feet in length. In relation to a car that drove by us it probably was going around 40 miles per hour. The speed limit is 30 in the neighborhood and the ship was slightly faster than the car. The ship was a large black triangle with a green light on the port side and a red light on starboard at the back angles of the triangle. The red and green lights were on constantly, while there were white blinking lights on the bottom of the ship that were in the middle of port and starboard sides. When it passed over us and cruised off into the distance we could see there were three horizontal fins on the top of it near the back. One large one in the middle, and two smaller ones on both sides of the large fin. It looked like a very advanced piece of technology that was lit up like a Christmas tree. It faded out of distance and another one approached from the same direction (Northeast). Same approach as the first one; Bright light until it was over the neighborhood. Looked identical to the first. Only this time where it was coming from in the northeast there was lightning. No thunder or anything. Just lightning. I also saw search lights facing the clouds and lightning from where this object came from. Someone else saw them apparently and were on the ground with search lights. It looked to be like they were flying out of a portal of heat lightning or something. Just speculation there. But I do know there was no storm in the area after checking the radar after the event. A total of six black triangle ships flew overhead of us. They were all completely silent. As one would fade off into the distance in the southwest another one would be getting close to our neighborhood from the northeast. The fourth one ejected some sort of green object. It dropped very quickly to the ground and my friend and I reacted at the same time when we saw it drop to the ground. We talked back and fourth throughout the entire event. \"Dude what the hell are those things,\" and \"Those are flying way too slow to be man made\" are examples of the conversation we had. The small cylinder from fourth ship fell behind some houses or behind our neighborhood. We couldn't see exactly where it landed though. At that point it went from a very interesting, mesmerizing, and mind boggling experience to a slightly anxiety inducing one. There was no explosion or anything from whatever fell and honestly I did not want to go investigate in fear of finding something I did not want to find. The event lasted about 15-20 minutes. As the last one passed us heading southwest we could see a plane in the west headed towards the squadron of triangles. It was flying very fast in comparison to these ships and was also about the same altitude. We speculated that was some sort of military fighter flying in to intercept but it flew off out of our view towards the ships and we never saw anything further from it. I had my phone recording the whole thing as all of them were flying over us. I was able to show a few people the footage. About 2 months later the file got corrupted and was unable to play. It was the only video file that got corrupted on my entire phone. Here are the facts: Six black triangles flew over us at midnight. They were lit up like a Christmas tree. They were completely silent. Something fell down to earth from one of them. They were coming from a patch of clouds that were producing heat lightning. Ground based search lights manned by people were point at the clouds they were coming from. The video file of them was corrupted around 2 months later. My friend and I were psychologically affected. My girlfriend said we looked like we'd seen a ghost after the event. After the event I remember breathing heavily and feeling very shocked or freaked out. Almost in a panic. I remember having difficulty sleeping that night. It was a experience I will never forget, and it is definitely not made up because I would not have wasted the time it took to type all of this up for you. Sketch of the triangle ships is included."],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile"}