{"Disposition":"Unresolved","Object Features":"Unknown","Case Number":"42740","Tags":"City","Region":"New York","Country":"United States","Date Submitted":"09/22/2012 04:58 UTC","Object Shape":"Circle, Oval, Sphere","divs":["sighting detailsat approximately 10:00 pm 9\\21\\2012,i was standing on my deck smoking a cigarette, when i noticed off to the east, a large red\\orange orb, but as it moved closer the shape changed a bit, the colors seed to be pulsating. absolutely silent it moved very slow, right over rt. 9&20 east greenbush ny.basically right over my head. then it stopped what seemed to be over the hudson river. hover for apprx. 2 min atleast then it changed direction and moved quickly to the north, then vanished. this would be the first of three sightings last night.so after that , i wasn't sure what i just seen, so i stayed out side hoping to see this again, and about a hour later what do you know i see the same exact thing. this time with my camera phone ready, i video taped it with my blackberry, but the video is so poor quality, that it's useless. anyways the orb did almost the same exact thing it did last time except it seemed to hover for less time over the river. then vanished in thin air to the north again. 2 hours past and i see the same orb moving over the trees again just over the bi way, this time closer to me and there was a second bright red\\orange orb this time. i was shaking. they both were at the same altitude , then the orb that was following had a slowly rose up a bit over the other one. they now were both hovering over the river. then took the same path to the north. in between the second and third sighting, i did witness a military helicopter flying north east. i live real close to the hudson river, and i live underneath a flight path highway. i am 38 years old, and i have never seen anything like this before."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.720653,+-73.998663(42740)&iwloc=A&hl=en\"> mufon case (42740) map </A>","Weather Factors":"Unknown","Sighting Duration":"03:00:00","files":["/var/www/straped/mufon/html2text/42740.html.txt","/var/www/straped/mufon/org/42740.html"],"Latitude":"40.720653","Log Number":"US-09222012-0020","Object Flight Path":"Path with directional change,Path then hovering","Longitude":"-73.998663","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Summary":"10pm approx.9/21/12 witnessed large red/orange orb. It moved in from the east real slow , got to really watch it , it was going so slow. hovered for aprox. 1 minute over hudson river, then moved somewhat quickly to the north so it changed direction.","trends":["There have been 579 other sightings in New York","There were 2 other sightings in New York on or around September 21st 2012"],"City":"New York","Date of the Event":"09/21/2012 10:10 UTC"}