{"Date of the Event":"09/22/2012 12:00 UTC","Country":"United States","City":"Flint","Date Submitted":"09/22/2012 07:41 UTC","trends":["There have been 40 other sightings in Flint","There were no other sightings in Flint on or around September 22nd 2012","This sighting has been favorited 10 times.",""],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/42744.html.txt","/var/www/straped/mufon/more/42744_submitter_file1__GEDC01332.JPG","/var/www/straped/mufon/org/42744.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.019417,+-83.681326(42744)&iwloc=A&hl=en\"> mufon case (42744) map </A>","Longitude":"-83.681326","Latitude":"43.019417","Log Number":"US-09222012-0024","Disposition":"Unresolved","Case Number":"42744","Object Features":"Unknown","Viewing Distance":"Unknown","Object Flight Path":"Unknown","divs":["Sighting DetailsI was outside at 7:00 pm and noticed a beautiful, large rainbow. The skies have been overcast with dark clouds on and off most of the day, with intermittent rain in the area (although not here in my town). I decided to take a picture of the beautiful rainbow which was SOUTHEAST of my house. (Note: This was 7:00 PM, and the sun was setting directly BEHIND my house in the West). The moon was clearly visible rising in the East next to the rainbow (and kind of \"in-between\" the clouds.) When I downloaded the picture on my computer, there was a HUGE, GLOWING object to the left of the rainbow which was NOT visible to the naked eye. The large, glowing object was DUE EAST of our house......and the sun was setting in the West- so this is NOT a picture of the sun (although that is what it appears to be......) I have no idea what this object may have been. The setting Sun was clearly visible on the horizon in the West.......and the moon is clearly visible in the picture to the right of the rainbow (although surrounded by clouds)."],"Source":"MUFON","Summary":"Large, glowing object in photo","Region":"Michigan","Object Shape":"Fireball, Unknown"}