{"Case Number":"42747","map":"<A HREF = \"http://maps.google.com/maps?q=36.909871,+-76.186004(42747)&iwloc=A&hl=en\"> mufon case (42747) map </A>","Disposition":"Unresolved","Country":"United States","files":["/var/www/straped/mufon/html2text/42747.html.txt","/var/www/straped/mufon/org/42747.html"],"Date of the Event":"09/21/2012 09:19 UTC","Region":"Virginia","Weather Factors":"Unknown","Object Features":"None","Viewing Distance":"Unknown","trends":["There have been 24 other sightings in Norfolk","There were no other sightings in Norfolk on or around September 21st 2012"],"Tags":"City","City":"Norfolk","Summary":"While driving vicinity of Lesner Bridge on Shore Drive, spotted 8-10 orange-yellow-red orbs.","Date Submitted":"09/22/2012 09:35 UTC","divs":["sighting detailswhile driving vicinity of lesner bridge on shore drive, virginia beach, va, spotted 8-10 orange-yellow-red orbs. at first the apparent orbs appeared to be possible flares, but the lights not all moved in the same direction as would flares. additionally, the apparent orbs moved generally all in the same direction but not maintaining constant distances from each other. the apparent orbs were easily seen about 50-60 degrees up from the horizon. they were so easily seen that several cars were observed on shore drive (a relatively busy road) pulling off to the side to observe and take videos\\photos with cell phones. there was no noise associated with the apparent orbs. movement was not erratic nor extremely fast, as the objects were observed for approximately eight minutes. there were no typical military light patterns; only the orange-yellow pulsating glow from each of the apparent orbs. when returning home and watching the news, although we saw numerous witnesses stopped on shore drive, there was no indication of the occurrence on the local television news nor reports via local online news sources on 9\\22. i had never experienced any such sightings in my life."],"Sighting Duration":"00:08:00","Longitude":"-76.186004","Object Flight Path":"Path with directional change","Source":"MUFON","Latitude":"36.909871","Object Shape":"Circle","Log Number":"US-09222012-0027"}