{"Log Number":"US-09232012-0006","Country":"United States","Date of the Event":"09/22/2012 07:40 UTC","divs":["Sighting DetailsWhile driving South on Greenfield Rd. (Mesa, Az)at aprox. 7:40 p.m. I observed what looked like a possible aircraft on fire and quickly descending. A fireball with a tail as it was going down. The fire diminished on and off and when the object was not appearing to be burning and glowing, there were visible red lights. When the object lit up again - it was still descending - three pieces separated - seemed to burst off the object- the pieces dropped slowly, as these pieces were dropping you could see them burn out and disappear with a bit of visible smoke left in their trail. The main objects flame went out again, then lit up again - as it lit up this time, suddenly it was surrounded with 3-4 bright, glowing objects - that appeared out of nowhere = I've never seen anything like it. The objects vanished, at this point the original object , too, vanished. We pulled over to phone the police to report a possible plane crash and as we parked and looked again there were then three bright glowing objects hovering then they were just gone. Just disappeared as quickly as they appeared. I phoned the police and tried to stress how strange and weird the event was. Also, I stressed that it was to the south and a bit west of my location - unable to gauge distance - The gal I was speaking to said an officer would be out. I awaited an officer to come take my report. I saw an officer drive by a couple of times but he never stopped to speak with me. The officer then parked across the road from where I was waiting and spoke with a young man. He never approached me so we left. This young man could possibly be a fifth witness - perhaps he phoned in the event as well?"],"Viewing Distance":"Unknown","Summary":"Looked like burning aircraft descending and losing parts that trickled down then suddenly, other bright objects surrounded it - objects disappeared , flames/pieces from original object dissipated/disappeared","Longitude":"-111.736501","Date Submitted":"09/23/2012 02:16 UTC","trends":["There have been 73 other sightings in Mesa","There were 3 other sightings in Mesa on or around September 22nd 2012"],"Latitude":"33.397441","Source":"MUFON","City":"Mesa","Region":"Arizona","files":["/var/www/straped/mufon/html2text/42756.html.txt","/var/www/straped/mufon/org/42756.html"],"Object Features":"Unknown","Case Number":"42756","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.397441,+-111.736501(42756)&iwloc=A&hl=en\"> mufon case (42756) map </A>","Object Shape":"Fireball, Flash","Object Flight Path":"Stationary,Other","Tags":"City","Weather Factors":"Unknown","Disposition":"Unresolved"}