{"Object Features":"Patterned Surface","trends":["There have been 26 other sightings in Corpus Christi","There were no other sightings in Corpus Christi on or around September 21st 2012"],"Weather Factors":"Unknown","Date of the Event":"09/21/2012 11:40 UTC","Date Submitted":"09/23/2012 02:09 UTC","divs":["sighting detailsi was walking my friend's dogs while she was out of town at 11:40 pm. i looked up at a dark and cloudless sky to see a rather large craft \"float\" or glide through the air. the lights aboard the craft were not typical aviation lights...they were neither red or white nor were they blinking. the orange lights \"glowed\" and were arranged in a polyhedron, or a series of isosolese triangles. the craft appeared to be located about a few thousand feet high and about a mile away at a 40 degree angle. it traveled for 4 - 5 minutes before apparently stopping its eastward direction...then it disappeared from view. i strained my ears for some sort of sound, but detected none. finally, i should mention that i could see a faint \"matrix\" or outline of a body beyond the patterned lights. i don't know why i look up, but i love to stargaze. when i saw it, i stood transfixed and amazed at the silent and \"non-mechanical\" movement. when the object disappeared from view, i hurried back to the house to get my camera\\phone."],"files":["/var/www/straped/mufon/html2text/42755.html.txt","/var/www/straped/mufon/org/42755.html"],"City":"Corpus Christi","Case Number":"42755","map":"<A HREF = \"http://maps.google.com/maps?q=27.68829,+-97.394303(42755)&iwloc=A&hl=en\"> mufon case (42755) map </A>","Object Flight Path":"Straight-line path,Path then hovering","Source":"MUFON","Region":"Texas","Longitude":"-97.394303","Sighting Duration":"Undisclosed","Country":"United States","Tags":"City","Viewing Distance":"Over One Mile","Object Shape":"Circle, Triangle","Disposition":"Unresolved","Log Number":"US-09232012-0005","Latitude":"27.68829","Summary":"ufo moving steadily, quietly decked with orange glowing,non-blinking lights arranged in a geometric pattern."}