{"Object Features":"Unknown","Summary":"4 lights descending in a weird pattern, like a leaf, and flashing randomly.","Weather Factors":"Unknown","Longitude":"-111.768492","divs":["Sighting DetailsWe drove to the Target on Southern and Gilbert, and as we parked the car, my husband pointed out that there were some lights towards the south. At first I dismissed him telling him that they were airplanes. But when I noticed that their flight pattern was erratic compared to an airplane or helicopter (an airplane was just flying by and I could compare the flight pattern), then I realized we were experiencing at an UFO sighting. It took about 5-8 minutes for the lights to completely disappear. The seemed to be falling like a leaf and sort of flashing. My husband spotted trails behind these objects. After about 8 minutes, we couldn't see them anymore as they disappeared behind a building. The picture attached was taken when only two lights remained. I cropped the second image to show the two remaining lights. There was another family that stopped by and looked at that general direction."],"Date of the Event":"09/22/2012 07:30 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.382097,+-111.768492(42753)&iwloc=A&hl=en\"> mufon case (42753) map </A>","Object Flight Path":"Path then hovering","Source":"MUFON","City":"Mesa","Disposition":"Unresolved","Case Number":"42753","Object Shape":"Egg, Oval","Country":"United States","Viewing Distance":"Over 1 Mile, Unknown","files":["/var/www/straped/mufon/html2text/42753.html.txt","/var/www/straped/mufon/more/42753_submitter_file1__20120922192321.jpg","/var/www/straped/mufon/more/42753_submitter_file2__20120922192321cropped.jpg","/var/www/straped/mufon/org/42753.html"],"Region":"Arizona","Log Number":"US-09232012-0003","trends":["There have been 73 other sightings in Mesa","There were 3 other sightings in Mesa on or around September 22nd 2012","This sighting has been favorited 1 time.",""],"Latitude":"33.382097","Date Submitted":"09/23/2012 01:07 UTC","Tags":"City"}