{"Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Region":"Wyoming","Date of the Event":"09/22/2012 03:30 UTC","trends":["There have been 5 other sightings in Gillette","There were no other sightings in Gillette on or around September 22nd 2012"],"Object Shape":"Boomerang, Triangle","Disposition":"Unresolved","Latitude":"44.26689","map":"<A HREF = \"http://maps.google.com/maps?q=44.26689,+-105.512632(42762)&iwloc=A&hl=en\"> mufon case (42762) map </A>","files":["/var/www/straped/mufon/html2text/42762.html.txt","/var/www/straped/mufon/org/42762.html"],"Longitude":"-105.512632","Viewing Distance":"N/A","Country":"United States","Log Number":"US-09232012-0012","divs":["Sighting DetailsAt about 3:30AM my neighbor got home from work; my husband went outside to talk to him and I fell back asleep. I started getting phone calls about 15 minutes later because they swore they saw a UFO in the sky. I told them they were crazy but went outside to check it out anyways. For a few minutes I thought it was just an airplane that was really far away; then I started seeing what it was doing. The first one that I saw was a VERY bright light that was moving VERY slow, I watched and was getting bored because it wasnt doing much of anything. All of a sudden it would shoot straight up (what appeared to me to be a few inches) to the point that it was noticeable. It would stay in one place for a while, then shoot off to another side very quickly. Next off to our right, we saw another bright light that was changing brightness, moving, and this one appeared to be move plane like as well until the times it got VERY bright, you could CLEARLY see what looked like a rounded edge and a dark shadow below the light. This light (#2) moved fast short distances like the other one. I called a family member a few miles away, she saw it as well as one of her friends. This was the only one out of all 3 \"lights\" that I could actually see a shape on. Next, #3 was seen, straight above us (very far) was another bright light. I just seemed to sit there, change brightness, randomly move fast to one side or another, up and down etc. You know when you stare at something so long that it starts to get fuzzy, and starts to get white lines coming off of it? Well that is what these looked like, but all the time! We could blink, look away, look back and the same patterns of lights would be there. One minute they would be bright as could be, the next they would just be a tiny speck. The coolest thing about the event: (#1) the first one we saw, and the biggest, appeared to have a \"big\" shooting star looking thing come straight from the middle and away from it! It was huge compared to any \"shooting star\" I have ever seen and came right from the middle so I refuse to believe it was a shooting star. Next we noticed tiny orange lights in the sky as well. They appeared to just sit still, but then would move off to a side very quickly and we wouldnt see them again. I dont know about anyone else but random orange lights in the sky while this stuff is going on freaked me out! We were all on the phone with people up to 50 miles away, and they all saw the same thing we did. One person, who was at his house out of town (very dark) saw it better than we did. We were outside from 330AM until a little past 7. After all the stars were gone, the sun about to come up.. we still saw the lights, still moving, just looked further away. We lost sight when the sun come up. I do not know how to explain half of the stuff that happened, it was so strange. I have always made fun of people who talked about aliens or other people being out there, and now I feel like an idiot. I have a video, and a few pictures as well that I can send"],"Source":"MUFON","Date Submitted":"09/23/2012 09:37 UTC","Case Number":"42762","City":"Gillette","Summary":"Starting @ 3:30AM: lights, random direction changes etc.","Tags":"City","Object Features":"Unknown"}