{"files":["/var/www/straped/mufon/html2text/42760.html.txt","/var/www/straped/mufon/org/42760.html"],"Latitude":"32.487092","Country":"United States","Longitude":"-85.126823","Object Features":"Unknown","City":"Phenix City","trends":["There has been one other sighting in Phenix City","There were no other sightings in Phenix City on or around September 23rd 2012"],"Tags":"City","Object Shape":"Bullet, Missile, Other","Summary":"Appeared as a star blinking white then blue & the middle light changed red then blue it was silent and stationary","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=32.487092,+-85.126823(42760)&iwloc=A&hl=en\"> mufon case (42760) map </A>","Date Submitted":"09/23/2012 05:14 UTC","divs":["Sighting DetailsI went outside to smoke and it was after 4 in the morning. My routine is I look up at the stars and when doing so I noticed what first showed as a star with one directly underneath it and it was what could best be described as blinking lights from what is supposed to be a star, however it was lower than the stars appear and quiet with no sound at all. Upon walking closer to this it then showed a third light and they went blue and the one in the middle went to red. The light pattern would switch and I came inside to get my camera in an attempt to take pictures or video, neither of which worked because of how dark it is outside. Also to the left of this was what appeared to be the initial 2 lights one directly above another just like the formation I singled in on, however that one did not show a red light in the middle, it was blinking as if mimicking a twinkling star. I see the sky formation around the same time on a regular basis and there is no star where either of these appeared. I returned inside due to being scared, wondering if it would try to interact."],"Sighting Duration":"00:10:00","Source":"MUFON","Region":"Alabama","Log Number":"US-09232012-0010","Date of the Event":"09/23/2012 04:12 UTC","Object Flight Path":"Stationary","Disposition":"Unresolved","Case Number":"42760"}