{"divs":["Sighting Detailsmy wife was at the stop at the top of our street when she looked at what she thought was realy bright star formations suddenly they started to reposition and she got concerned and drove around the block to come back and show me i was watching tv indoors. I walked out side and sure enough there was wave of bright orange lights in snc travelling south east across the sky. We alerted our immediate neighbours and 7 of us watched as they kept coming. Individual observation times varied but the whole thing lasted for about 15 min.then all disapeared at the exact same spot in the sky . We have lots of airccraft trafic being between ohare and midway airports and i witnessed one plane make an evasive turn and therafter all aircraft seemed to fly much lower than usual from ohare. we normally only get low aircraft when they landing at midway. I didnt feel threatened by them but alerted neighbours to confirm we wern't nuts. It reminded me of those old war films when people would look up at wave after wave of aircraft overhead i called both my kids who were in different towns and said were witnessing lots of ufo's but they saw nothing. An awsome experiance."],"Region":"Illinois","City":"Brookfield","Object Shape":"Star-like","Disposition":"Unresolved","trends":["There have been 3 other sightings in Brookfield","There was one other sighting in Brookfield on or around September 23rd 2012"],"Longitude":"-87.876157","map":"<A HREF = \"http://maps.google.com/maps?q=41.824514,+-87.876157(42788)&iwloc=A&hl=en\"> mufon case (42788) map </A>","Object Flight Path":"Stationary,Straight-line path,Path with directional change","Date of the Event":"09/23/2012 07:30 UTC","Tags":"City","Object Features":"Dome","Log Number":"US-09242012-0012","Weather Factors":"Unknown","Latitude":"41.824514","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Date Submitted":"09/24/2012 10:25 UTC","Summary":"stationary formation of stars changing to moving orange lights, forming lines equally spaced and traveling at same speed then fading out","Source":"MUFON","Case Number":"42788","Country":"United States","files":["/var/www/straped/mufon/html2text/42788.html.txt","/var/www/straped/mufon/org/42788.html"]}