{"Region":"Pennsylvania","Object Shape":"Sphere","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Date Submitted":"09/24/2012 11:54 UTC","Source":"MUFON","City":"Erie","Disposition":"Unresolved","Object Flight Path":"Path then hovering","Tags":"City","Latitude":"42.162287","Date of the Event":"09/23/2012 08:30 UTC","Case Number":"42789","Log Number":"US-09242012-0013","files":["/var/www/straped/mufon/html2text/42789.html.txt","/var/www/straped/mufon/org/42789.html"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.162287,+-80.036757(42789)&iwloc=A&hl=en\"> mufon case (42789) map </A>","Weather Factors":"Unknown","divs":["Sighting DetailsI was walking out of a convenience store to my car a little before 8:30pm on September 23, and I noticed 3 very bright red lights in the sky, hovering in a triangle formation. I couldn't figure out what they were; it was very cloudy, so I realized these couldn't be stars or planets because they were below the cloud cover. As I continued to watch them, I noticed they were moving, flying up, down, left, right; and they moved independent of each other, so they were not connected to one aircraft. As I watched the three red lights, a fourth one came flying from over the store into my field of vision very fast, then stopped on a dime near the other three and just hovered there next to them. Then all 4 of them hovered, and would individually fly slowly to the left and down in my field of vision. Then, 2 of them flew very, very close together, like they were almost touching, then separated again. Then, one by one, they each appeared to flicker out--which probably means they flew higher up into the cloud cover and out of my sight. I watched this group for about 3 or 4 minutes. I sat there in my car a few more minutes, and sure enough, two more red lights flew from over the store into my field of vision, so they were flying from south to north. I called my parents, who live a block away from the store, and they ran outside and saw these ones. As I was talking to them on the phone, another one flew from south to north and joined these other two. They hovered and flew subtly back and forth, independently, for several minutes. Then, just like before, two of them flew so close together that they appeared to touch. Then, they each flickered out, one by one, disappearing into the clouds. A friend of mine, who lives 1 block north of the store, said that a group of people were standing in a parking lot across the street from his house, and they were pointing and shouting things about the sky. He regrets not going outside to look for himself. I don't know if these events are related to these UFO's, but the Internet stopped working for several hours all over the east side of Erie, and a firefighter friend of mine reported that the power went out in half of the borough of Wesleyville, which is where I saw these objects. I personally witnessed these two groups of red UFO's for about 10 minutes total, but they were already in the sky when I came out of the store, so I don't know how long they were visible before I saw them. I don't know if the second group of 3 UFO's were the same ones I saw minutes earlier (in the first group of 4), or if there were 7 different UFO's .There was no sound associated with this event. I am 37 years old, and I've never seen anything like this before. I am a church music director, and I was coming home from working with my church's youth group when I saw these UFO's."],"Object Features":"Unknown","trends":["There have been 39 other sightings in Erie","There were no other sightings in Erie on or around September 23rd 2012"],"Longitude":"-80.036757","Summary":"Bright red/orange spherical lights, moving then hovering in triangular formation"}