{"Sighting Duration":"Undisclosed","trends":["There have been 5 other sightings in Bel Air","There were no other sightings in Bel Air on or around September 22nd 2012"],"City":"Bel Air","Source":"MUFON","Tags":"City","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","divs":["Sighting DetailsWe were laying in reclinable outdoor chairs on my mom's balcony. It was right above us flying very fast from west to east . I am a skywatcher. I have seen many meteors,fireballs,u.f.os, satelites.... but this was very strange. It was orange,lit up like fire on one side then the other side lit up like fire,and the side that did light first would go out. It did that the whole time it flew over us. It disappeared to the east.It didn't leave a trail,smoke,or anything. I don' t know what it was.I was hoping someone else saw it so I could get answers. I am not one of those kooks who see anylight in the sky and automatically think it is driven by a alien, but I believe that there are aliens.Just not everything in the sky is a alien lol. I entered a report to you guys a year ago,the man who helped me was very helpful,the thing I saw a year ago was the ISS, the thing I saw saturday night was totally opposite of the ISS,or any satelite I've ever seen. I live in Richmond,Va. but was visiting Bel Air,Md. My mom is a skywatcher,but she never saw anything like that either. Hope to get answers Thank-you"],"Date of the Event":"09/22/2012 12:00 UTC","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/42785.html.txt","/var/www/straped/mufon/org/42785.html"],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=39.529577,+-76.342(42785)&iwloc=A&hl=en\"> mufon case (42785) map </A>","Longitude":"-76.342","Latitude":"39.529577","Country":"United States","Log Number":"US-09242012-0009","Case Number":"42785","Date Submitted":"09/24/2012 08:13 UTC","Region":"Maryland","Object Shape":"Cylinder, Fireball","Summary":"I just want to know if anyone else saw what my mom and I saw.??????","Weather Factors":"Unknown","Object Features":"None"}