{"Object Features":"Unknown","Weather Factors":"Unknown","Case Number":"42787","map":"<A HREF = \"http://maps.google.com/maps?q=28.468772,+-98.176207(42787)&iwloc=A&hl=en\"> mufon case (42787) map </A>","Source":"MUFON","Tags":"City","trends":["There have been 2 other sightings in Three Rivers","There were no other sightings in Three Rivers on or around September 24th 2012"],"City":"Three Rivers","Summary":"Lights moved from my right of object to left. After about a minute, object simply disappeared, as if a switch was flipped.","Sighting Duration":"00:01:00","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/42787.html.txt","/var/www/straped/mufon/org/42787.html"],"Viewing Distance":"Over One Mile","Latitude":"28.468772","Date Submitted":"09/24/2012 08:51 UTC","Object Shape":"Unknown","Date of the Event":"09/24/2012 04:35 UTC","Country":"United States","Longitude":"-98.176207","divs":["sighting detailsi work in the oilfield here in texas. at about 0435 on september 24, 2012, i was standing by my truck being loaded at the pioneer cgp #41. i looked to the approximate north and noticed a light that was not there any of the other times i had been to this location. i thought it might be a tower, but as i said, i have been to this location many times and the light was never there before. for a split-second i thought it was an aircraft, but i immediately dismissed that notion, since the object was stationary and the lights behaved strangely. instead of the blinking lights you normally see on an aircraft, this object's lights moved slowly from the object's right to its left. it must have been over a mile away from me, and fairly high up (i was probably looking at it at a 40-degree angle from the horizon), as i couldn't make out any details of the object itself. the object simply hovered there for around a minute, after which time it simply vanished, instantly, as though turned off by a light switch. i honestly felt a bit dumbstruck by what i was seeing and i couldn't take my eyes off of it. by the time i thought to get the attention of one of the other people around, it was gone. i asked a couple of the other people if they had seen anything, but they had not. directions to the location where i was when i saw the object: start in three rivers, tx travel north on i-37 to farm to market road 99 (fm 99) travel east on fm 99 until fm 99 curves north and fm 1091 continues east go east on fm 1091 and follow past county road 233 +\\- 1 mile past county road 233 is a caliche (dirt) road turning south. go south on that dirt road and you will come to the pioneer cgp #41. (in google earth it will appear as a large, white, square with storage tanks and other things.)"],"Region":"Texas","Log Number":"US-09242012-0011","Object Flight Path":"Stationary"}