{"City":"Hudson","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/42791.html.txt","/var/www/straped/mufon/org/42791.html"],"Object Shape":"Sphere, Unknown","Case Number":"42791","Latitude":"28.338055","trends":["There have been 7 other sightings in Hudson","There were no other sightings in Hudson on or around September 23rd 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=28.338055,+-82.648179(42791)&iwloc=A&hl=en\"> mufon case (42791) map </A>","Date Submitted":"09/24/2012 12:20 UTC","Viewing Distance":"101-500 Feet, Over 1 Mile","divs":["Sighting DetailsI had Seen some strange pulsating lights in the sky on the night of septemper 22, 2012. the objects were about a mile apart and appeared to be strobing or pulsating green, red and blue lights. When i went to get my binoculers and took a closer look they began to strobe what appeared to bed red,green, and blue lights in a pattern. we all witnessed this for about 45 minutes while they remained stationary. At around 10:30 pm they began to move west at a high rate of speed out over the gulf of mexico. After this initial movement they started to move erractically north to south in a matter of seconds. Then we witnessed two or three white blinking lights coming from behind them seemingly out of nowhere and they all moved into a triangle formation and started moving southwest and roatating. At this time we witnessed two red lights coming from the Northwest that never changed color or blinked. And appeared to move south east into a cluster of clouds infront of the moon. After these two objects appeared the other UFOs we had been observing disintergrated or were rendered invisable. The next night of September 23, 2012 my curiosity was peaked by the previous nights events so i went out around the same time this next night. after searching the sky for about 20 minutes one of the same lights appeared in the western sky this time much closer to the horizon strobing and pulsating green, red, and blue lights. i attempted to communicate useing a strobing flash light feature on my Iphone when i did this mysterious cloud formation engulfed it and began moving due east from its previous posistion directly over my house and 'met up' with a cloud cluster that appeared to be very low in the sky i'd say about 500 to 1000 feet in the air. i began to strobe my phone light and after a few minutes the clouds began to break apart to reveal several more objects that were of the general size and shape and just appeared to hover. when a cloud would come closer to the objects they sppeared to move side to side and the clouds would part. about 45 minutes into this encounter a larger cloud parted and revealed what seemed to be a cluster of dim white lights with no decirnable shape and would blink and go dim periodically. while looking through my binoculars they appeared to be one big mass but it was very hard to tell. i was about to get ready to go into my house for the night because by this time i had been outside observing for 2 or more hours a black mass with no lights and made no sound flew over my neighborhood at about 300ft. it appeared as if it was a cluster of black balloons but they did not ascend into the sky. they appeared to stay on the same course very slowly until i witnessed them dissappear right infront of my eyes. Needless to say this had me in complete shock. i have never witnessed such an unblieveable display. i felt like the mufon and the ufo community should know my story and maybe hear some feedback with others with similar expierences and i will deinfately be watching the skies. All the photos i attpemted the objects appeared too far away."],"Date of the Event":"09/23/2012 12:00 UTC","Summary":"These events were witnessed on september 22 and 23 of 2012.","Disposition":"Unresolved","Longitude":"-82.648179","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Source":"MUFON","Region":"Florida","Object Features":"Appendage(s)","Tags":"City","Log Number":"US-09242012-0016","Country":"United States","Sighting Duration":"Undisclosed"}