{"Log Number":"CA-09242012-0023","Longitude":"-114.012207","divs":["Sighting DetailsSitting on the back deck of my house, admiring my favourite Glittering star in the south. Was a clear dark night full of stars, not bad for a City night. Just to the right of my gaze a very very large bright light turns on in the sky. It stays on for about three to four seconds then dimms out. I keep my eyes fixed on the location for two minutes when the light flashes on again and stays lit for three to four second then dimms out once more. I am filled with amazement as this is not a normal star or satalite and definetly not a plane. then this light turns on again for a third time after another two minutes, it stays lit for another three to four seconds then goes out. almost as if it were a light switch being turned on then off. the light was in the very high altitude amongst the stars and double the size of the space station when it would fly over. It was stationary and always in the same location. It appeared only three times then never happened again. The light; when it turned on, sort of powered on from a dim to intense light then it powered off in reverse almost as if it were turned on and off with a dial."],"City":"Calgary","Tags":"City","Object Shape":"Flash, Star-like","Latitude":"50.953038","trends":["There have been 76 other sightings in Calgary","There were no other sightings in Calgary on or around July 20th 2011"],"Date of the Event":"07/20/2011 12:00 UTC","files":["/var/www/straped/mufon/html2text/42799.html.txt","/var/www/straped/mufon/org/42799.html"],"Sighting Duration":"Undisclosed","Region":"Alberta","Disposition":"Unresolved","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=50.953038,+-114.012207(42799)&iwloc=A&hl=en\"> mufon case (42799) map </A>","Object Features":"Unknown","Date Submitted":"09/24/2012 08:40 UTC","Country":"Canada","Object Flight Path":"Stationary","Source":"MUFON","Weather Factors":"Unknown","Summary":"observed a very large bright light turn on three times in the dark clear sky from my rear deck, then turn off ...","Case Number":"42799"}