{"Weather Factors":"Unknown","Tags":"City","Case Number":"42795","Latitude":"41.286063","map":"<A HREF = \"http://maps.google.com/maps?q=41.286063,+-84.3495(42795)&iwloc=A&hl=en\"> mufon case (42795) map </A>","Object Flight Path":"Stationary","Object Features":"Dome, Window(s), Unknown","divs":["Sighting DetailsJust south of campus, heading north, I was returning to my dorm after a hanging out with some friends when I encountered the UFO. First, I heard a humming noise, then I looked up and saw this enormous, disk-shaped, Saturn-like ship. This hasn't been my first sighting, but by far, the closest encounter. I studied it from underneath in an awe-like terror. I was completely alone on this particularly long, dark, eerie stretch of country road. I tried to use my cell phone to call my friends whom I had just left, but upon activating it, the phone went haywire, and produced odd glitching noises and corrupt data on the screen. Even upon removal of the battery, the phone remained powered and \"glitchy\". I felt I was being watched. I felt endangered standing directly underneath this craft. I ran. Faster than I ever could have ran, but I couldn't make it. I felt like I was being pursued back to my dorm, and then I felt a large percussion-like blow to my chest and head, as if I had been pounced on or tackled. A snarling beast was upon me. I was in sheer terror as I felt being dragged back to the area where the ship was. I blacked out. The only things I can remember shortly after that was being ushered in near broad daylight back to my dorm. My body was limp and powerless, yet somehow, I was being manipulated in my movements. I felt two small entities beside me. I heard them. They spoke to me, telepathically. They told me not to be afraid, and not to struggle. They were invisible; avoiding all detection from anyone who might see them. My RA in particular whom I encountered in the hallway. I struggled to tell him what was happening, but he was fearful, and locked himself in his room. They laid me down in my bed and then departed. About 4:00 pm, my roommate came in and asked where I had been, and whether I had spent the night at my friend's apartment. I insisted that I hadn't, and I something strange had happened to me, and I couldn't recall making it back into the dorm. I had missed all of my classes, and all meals; a very unusual occurrence for me, who was a very serious student and punctual individual, with dreams of one day becoming a psychologist. He curiously added that he had been in and out of the dorm room throughout the day, and hadn't noticed my presence until just then. It didn't quite register at the time, but I eventually recalled more details after waking up from that painful, hazy sleep and realized that I had been abducted. It was difficult to tell people about my experience. It was difficult to trust anyone with that information. I was fearful they would come back, or continue abducting and harassing me. The following night, I was at the same apartment, this time, trying to make sense of the night before. My story enraged my fellow students, for some reason, and they kicked me out of the apartment with a hasty, violent attitude. With no choice but to head back to the dorm, I walked the long, dark country road, only to encounter once again, the mysteriously blackened streetlights and the ominous humming tone, of the large, dark disk-shaped craft, hovering in the exact same area as the night before. This time, I wasted no time and made haste directly back to my dorm. Making it safely back this time, my roommate happened to be awake. Shaking in my bunk, we made small talk and I eventually told him I had seen it again. In the following weeks, I became seriously ill; nausea, vomiting, diarrhea, weakness, chills, depression...but most prominent and disturbing was the constant sensation of my skin burning and feeling extremely sensitive, as well as the frequent and excessive loss of hair by my usual routine of combing my hair. Very painful. I was bed-stricken for nearly two and a half weeks when I noticed a small protrusion in my side, which only became bigger and more painful as time went on. Eventually, the pain was bothersome enough to the point in which I went to the local E.R.. I was examined, and the growth was quickly attributed and dismissed to an unhealthy diet. Now, me being from the city, I'm used to eating greasy and unhealthy food from time to time, and still maintain an awareness and overall healthy diet regimen. I dismissed the doctors conclusion as nonsense, and demanded an x-ray. He refused, and I was sent home with a prescription for Advil, despite my symptoms that very much so echoed the sufferings of a radiation poisoning victim. It is my understanding that Defiance has a history that correlates with UFO's and extraterrestrial beings, old military bases housing Area 51 evidence, and even Indian burial grounds and haunting. I would like to see the town investigated more. The tap water is not fit for consumption, and I also witnessed a man's suicide just outside my dorm. People just aren't natural in those parts....I don't know if I'd ever go back there again. A local that worked at the guitar shop in town told me of a time when he lived in the area JUST about where I had my experience....He was using a Ouija board when he heard sounds outside, and grabbed his flashlight. According to him, he say two figures; one on two legs, huge claws, snarling teeth, and the other on all fours, like a master's dog...even more hideous. He felt the Ouija board may have opened a rift to another dimension. Given our experiences happened in the same general area, I wouldn't be surprised."],"Longitude":"-84.3495","Viewing Distance":"21-100 Feet","Log Number":"US-09242012-0020","trends":["There have been 5 other sightings in Defiance","There were no other sightings in Defiance on or around November 10th 2009"],"Sighting Duration":"Undisclosed","Region":"Ohio","Object Shape":"Disc, Saturn-like","Summary":"Sighting, then abduction. Loss of time. Crippling sickness. Subcutaneous protrusion.","Source":"MUFON","Date of the Event":"11/10/2009 12:00 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/42795.html.txt","/var/www/straped/mufon/org/42795.html"],"City":"Defiance","Disposition":"Unresolved","Date Submitted":"09/24/2012 04:13 UTC"}