{"map":"<A HREF = \"http://maps.google.com/maps?q=40.749534,+-73.97743(42792)&iwloc=A&hl=en\"> mufon case (42792) map </A>","City":"New York","Latitude":"40.749534","Source":"MUFON","Tags":"City","Region":"New York","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/42792.html.txt","/var/www/straped/mufon/org/42792.html"],"Log Number":"US-09242012-0017","Sighting Duration":"Undisclosed","Date of the Event":"09/22/2012 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"09/24/2012 01:52 UTC","Summary":"Unitedified flying objects over East River, Queens New York, Manhattan, New York City","Object Features":"Unknown","Disposition":"Unresolved","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around September 22nd 2012"],"Longitude":"-73.97743","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Object Shape":"Fireball, Sphere","Case Number":"42792","divs":["sighting detailsat approximately 8:30 september 22, 2012, my girlfriend and i were on our balcony looking across at queens long island city. we have an unobstructed view across the river between 39th street all the way to the 59th street bridge. suddenly about 10 white\\yellowy-orange circles flew from south to north across the sky almost playfully. some moved in front of the new high rise apartment buildings at an elevation of approximately the 25th floors, then some lined up and moved in a uniformed line way up into airspace climbing almost vertically and out over long island, others climbed straight up over lic and moved towards each other almost dancing with each other before gliding apart and moving further up and out east and disappeared. we were in awe when suddenly another set of about 10 circles flies into view doing almost the same things with one holding back and moving in front of the apartment complexes moving in what seemed to be right by apartment windows and then vanished. the lights of these objects did not waver. they were not affected by wind in anyway. never before has either one of us seen this nor are we believers in ufo's as far as being maned by aliens but this was a ufo and did not fly in a way natural to this planet as i know it. very very odd. have not seen any reports online of anyone else seeing this. i have video which i will upload"],"Country":"United States"}