{"Sighting Duration":"00:00:15","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=36.060748,+-115.961111(42805)&iwloc=A&hl=en\"> mufon case (42805) map </A>","Object Features":"None","Object Shape":"Sphere","City":"Pahrump","Tags":"City","files":["/var/www/straped/mufon/html2text/42805.html.txt","/var/www/straped/mufon/org/42805.html"],"Source":"MUFON","Latitude":"36.060748","Weather Factors":"Unknown","Summary":"object brightened then faded within 13 seconds","trends":["There have been 12 other sightings in Pahrump","There were no other sightings in Pahrump on or around September 19th 2012"],"Object Flight Path":"Stationary","Case Number":"42805","divs":["Sighting DetailsI have watched these objects for the last couple of years, only recently recording them. When they appear, they look like a new star where none was before, then they brighten to about the same brightness of jupter or venus, and zoom away in about 10 seconds. I have recorded this on the 19th, 21st, and 24th of Sept 2012. The objects appeared on the 20th, 22nd, and 23rd, but was unable to get them on tape. They appear mainly in the north at this time, but tonight the first one appeared in the north at approximately 45 degrees, then about two or three minutes later, one appeared in the west at approximately the same angle. Usually they stay in the same position during the entire duration. I am unable to tell if they are travelling away from me, but looking at the recordings, it appears that they do. My wife also witnessed the object on the 21st while I recorded it. I would send the recordings with this, but my internet will not allow me to download the files due to the size. I would be glad to meet with anyone and show them what I have as I would like to know what the things are."],"Viewing Distance":"Over One Mile","Country":"United States","Log Number":"US-09242012-0029","Date of the Event":"09/19/2012 08:15 UTC","Date Submitted":"09/24/2012 11:47 UTC","Region":"Nevada","Longitude":"-115.961111"}