{"Disposition":"Unresolved","Sighting Duration":"00:05:02","Date of the Event":"09/21/2012 12:08 UTC","trends":["There have been 45 other sightings in Long Beach","There were no other sightings in Long Beach on or around September 21st 2012"],"Region":"California","Source":"MUFON","Date Submitted":"09/24/2012 09:54 UTC","Latitude":"33.772329","Log Number":"US-09242012-0026","Viewing Distance":"21-100 Feet","Case Number":"42802","Tags":"City","Longitude":"-118.207235","Country":"United States","divs":["Sighting Details1. I was in Long Beach (CA) across from Queen Mary waiting for the Space Shuttle to fly by with hundreds of people. 2. I noticed the UFO after the event when I went back to review my recording.Hundreds of people and I believe no one noticed the UFO. 3. When I first noticed the UFO my first thought was this UFO is a craft from another world.Its close and clear in the video! 4. In the video its hovering waiting for the Space Shuttle to fly by.It begins on the right with 2 very bright lights on. Then the Space Shuttle blocks it as its flying by. Then the UFO emerges behind the Space Shuttle with 1 light turned on.(The UFO turns off a light as the Space Shuttle flies by, close to it.) 5. During the event I believe no one noticed the UFO(All eyes were fixed on the Space Shuttle).After the event, when I was home to review my recording I was very excited and pleased that I captured a UFO on film! The UFO is very close and clear. You need to see this video footage. Its awesome! 6. I didn't know a UFO was watching us,waiting for the Space Shuttle until later during the day."],"Object Features":"Other","Object Shape":"Cylinder, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=33.772329,+-118.207235(42802)&iwloc=A&hl=en\"> mufon case (42802) map </A>","City":"Long Beach","Weather Factors":"Unknown","Object Flight Path":"Stationary","Summary":"I filmed UFO hovering beside Space Shuttle as it flew over Queen Mary.","files":["/var/www/straped/mufon/html2text/42802.html.txt","/var/www/straped/mufon/org/42802.html"]}