{"Date Submitted":"09/24/2012 09:24 UTC","Summary":"glowing lights in the night sky","Tags":"City","Disposition":"Unresolved","Country":"United States","Longitude":"-87.829717","Viewing Distance":"Unknown","Object Shape":"Sphere","Latitude":"41.840088","Region":"Illinois","trends":["There have been 3 other sightings in Brookfield","There was one other sighting in Brookfield on or around September 23rd 2012"],"Object Flight Path":"Straight-line path","divs":["sighting detailsat midnight saturday\\sunday 9\\23\\12 i was letting my dog out for the last time before going to bed.about 5 min. later iwent to the door to let her back in & thats when i noticed these lights floating in the sky. at first i thought they might be chinese lanterns but ruled that out because of the deliberate pattern. they all were going at the same rate of speed. this was over chicago & if they were chinese lanterns they would have been blowing all over. i estimated there must have been 15 to 20 of these objects & from where i stood they were say 30 to 40 degrees above the horizon. so after standing there staring i called my wife out to see these objects. we both walked out into the yard where we watched them for 5 min. or so. they seemed to be moving in a nw to se direction. not very fast or very slow, just an even speed except a couple of them sped up to catch up & get next to each other near the front of the line.we stayed outside watching them until they either winked out or just turned over lake michigan. they had a yellow\\orangish glow & it was very hard to tell how far away they were. thats about all my wife &i can recall."],"Object Features":"None","City":"Brookfield","Log Number":"US-09242012-0025","Weather Factors":"Unknown","Date of the Event":"09/23/2012 12:00 UTC","Case Number":"42801","files":["/var/www/straped/mufon/html2text/42801.html.txt","/var/www/straped/mufon/org/42801.html"],"Source":"MUFON","Sighting Duration":"00:06:30","map":"<A HREF = \"http://maps.google.com/maps?q=41.840088,+-87.829717(42801)&iwloc=A&hl=en\"> mufon case (42801) map </A>"}