{"Object Shape":"Sphere","Region":"North Carolina","Log Number":"US-09252012-0004","Case Number":"42809","City":"Undisclosed","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Date of the Event":"09/24/2012 12:00 UTC","files":["/var/www/straped/mufon/html2text/42809.html.txt","/var/www/straped/mufon/org/42809.html"],"Object Flight Path":"Path with directional change","Tags":"City","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Summary":"Helicopters and ships","trends":[],"Object Features":"None","Date Submitted":"09/25/2012 06:28 UTC","divs":["Sighting DetailsTime: 8:30 PM Garner, NC (Off of RT 50) Location: Outside my house because I heard helicopters flying low (on my yard) Clear night with the moon in front of my house. Started off hearing a helicopter passing the house first when I was outside on the back porch and went from the back to the front and the first helicopter was passing my house on the right side heading to McGee's crossroads. The second helicopter was to the left of my house in the East. It was slowing hovering so I decided to walk to the middle of the yard towards the street, as I did that a couple was walking down the hill passing my house and showed them and they saw the 3 objects also flying and the helicopter watching it and flying near them. This was going on about 15 minutes. As I continued to look near the moon. I huge object that was clear and but metallic was passing the sky (it was reflecting the moons brightness, so all I could see was this thing moving) it stopped over my house ..right above me.. and I saw one red light on the corner of it. At this point, I got really unnerving and went into the house and locked the door.. I continued to hear the helicopter for the next 10 minutes. Again, this object appeared to be cloaked but only saw it due to the moon's light."],"Longitude":"-79.01105","map":"<A HREF = \"http://maps.google.com/maps?q=35.762653,+-79.01105(42809)&iwloc=A&hl=en\"> mufon case (42809) map </A>","Country":"United States","Latitude":"35.762653","Source":"MUFON"}