{"Summary":"Quite confusing","Country":"United States","Object Features":"Other","Case Number":"42819","divs":["Sighting DetailsI pulled out of my parking lot driving north to get something to eat about 6:45 when I saw something in the sky to the west of me. I watched it while I was driving but trees kept getting in the way so I pulled over into a lot and watched the object. My first thought was that it was a plane crashing. It had a oval like silver body with what looked like two white trail clouds coming out of it which with the body formed a triangle. Because of the trails I thought then it might be a meteor. I watched the object for a period of 4-5 minutes when it dawned on me that the object wasn't moving at all. It had the appearance of a falling object but it never moved. I started fumbling in my purse for my phone to call my husband and get his advice on what it was but I couldn't find it. I looked away for about 2 seconds to check the pocket only to find the phone wasn't there. I looked back up in the sky and the object had dissapeared and a jet was in the sky headed to where the object was. The object left no trail, or visible marks in the sky, it just dissapeared. Dissapointed, I continued to drive north and pulled into a parking lot hoping maybe I could see it from a different angle. I still couldn't see it but noticed a black unmarked SUV with tinted windows and a plain white license plate (not marked with a state) that just BOX CAR on it. I could just see a man inside looking to the west so I started slowly driving towards him so I could ask if he had seen what I had seen. He looked into his rear view mirror and sped off when he saw me coming."],"trends":["There have been 59 other sightings in Tulsa","There were no other sightings in Tulsa on or around September 25th 2012"],"Weather Factors":"Unknown","Log Number":"US-09252012-0013","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Source":"MUFON","Tags":"City","City":"Tulsa","Disposition":"Unresolved","Longitude":"-95.904201","Date Submitted":"09/25/2012 09:09 UTC","Region":"Oklahoma","map":"<A HREF = \"http://maps.google.com/maps?q=36.025327,+-95.904201(42819)&iwloc=A&hl=en\"> mufon case (42819) map </A>","Date of the Event":"09/25/2012 06:45 UTC","Object Shape":"Fireball, Triangle","Latitude":"36.025327","files":["/var/www/straped/mufon/html2text/42819.html.txt","/var/www/straped/mufon/org/42819.html"],"Object Flight Path":"Unknown"}