{"Region":"New York","Disposition":"Unresolved","Object Features":"Unknown","Date Submitted":"09/25/2012 09:29 UTC","Latitude":"42.131914","Summary":"It resembled three blimp-like shapes combined into one w/a notable exhaust system made of 3 circles in the form of a triangle at back of central cavity. Two linesÂ of small white/blue lined each side of central body. VERY LOUD","map":"<A HREF = \"http://maps.google.com/maps?q=42.131914,+-73.782248(42811)&iwloc=A&hl=en\"> mufon case (42811) map </A>","Date of the Event":"09/09/2012 08:30 UTC","Object Shape":"Blimp, Other","Case Number":"42811","trends":["There have been no other sightings in Livingston","This sighting has never been favorited."],"City":"Livingston","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/42811.html.txt","/var/www/straped/mufon/org/42811.html"],"Longitude":"-73.782248","Object Flight Path":"Straight-line path","Source":"MUFON","Sighting Duration":"Undisclosed","Log Number":"US-09252012-0005","divs":["sighting detailswhile swimming, i stopped to watch whatever was about to fly overhead since i could hear something approaching. it flew directly overhead and sounded like a loud jet engine flying very very low. the shape had no common features with airplanes, moreover, there is no major airport nearby which would explain such a low flying aircraft. i watched as a very chunky round shape, like a catcher's mit, flew directly overhead, at a uninterrupted pace, and in a direct line. more precisely, it could be described as 3 blimp-like bodies bound into one chunky rounded whole, with lights running along both sides of the craft where the central body met the two exterior oblong sides. i could not see any windows along the body or of a cockpit. it flew directly east and did not change course. most notably of all was the lack of a characteristic airplane nose, and its exhaust system, which i saw perfectly clearly, was comprised 3 circles in an equalateral triangle formation set at the back center of the craft. i believe a flamelike exhaust [hardly visible] was coming out. its sound was consistent with aircraft -- ie the sound increased as it approached and reduced with distance. i lost site of the object because i decided to leave the pool and go inside. one there, two friends inside asked me if a plane had just flown over the house, since they heard the loud engines as it passed overhead. i replied that it actually was some sort of ufo - or at least a type of airplane i had never seen. and i drew them a picture, which is what i have described above. since then, i have encountered one other person familiar with the story of the object i saw, in the sense that he answered my query about seeing a ufo sometime in early sept. by asking \"the one that flew by at 8:30 pm?\" i hadn't said the time of my sighting -- which in my memory was between 8 - 8:30 pm -- so i am deducing the possibility it was another siting of the same object. but specifically in my case that evening (in the second week of september, wish i could be more specific), there was 1 visual \\ auditory witness (myself) and 2 auditory witnesses."],"Country":"United States","Tags":"City"}