{"Country":"United States","Summary":"Found on Digital image 9 mo. later","Source":"MUFON","divs":["sighting details my name is charlie. i'm not, nor have i ever been a ufo hunter. i'm just a landscape photographer, and a part time amataure astronomer\\astrophotographer. on ded 26th shortly after dark i stepped outside my front door to catch a few shots of venus in close relation to the crescent moon. i fired off 7 frames with my digital camera apx. 30 sec apart. i was adjusting my camera settings between frames trying to get as much definition as possible from the moon. went in, transfered my photo's to my laptop, put my camera away and thought no more about them. 9 mo. later i got a new computer, and when i transfered my photo's i found on the 3rd frame of what i believe to be a ufo. to say the least i was in shock! the first thing i did was check the frame before, and the frame after. i found nothing unusual. then i checked the time\\date stamp and found that the frame before was 26 sec. before and the frame after was 33 sec. after. then i was really convinced that it was a real ufo. surly if it was something man made it would have been on one of the other frames as well. i am attaching these 3 photo's. also these are untouched, and haven't been altered in any way."],"Longitude":"-121.456615","map":"<A HREF = \"http://maps.google.com/maps?q=38.434819,+-121.456615(42816)&iwloc=A&hl=en\"> mufon case (42816) map </A>","trends":["There have been 83 other sightings in Sacramento","There were no other sightings in Sacramento on or around December 26th 2011","This sighting has been favorited 1 time.",""],"Object Flight Path":"N/A","Viewing Distance":"Over One Mile","Object Features":"Unknown","Latitude":"38.434819","Disposition":"Unresolved","Date of the Event":"12/26/2011 06:46 UTC","files":["/var/www/straped/mufon/html2text/42816.html.txt","/var/www/straped/mufon/more/42816_submitter_file1__IMG2202.JPG","/var/www/straped/mufon/more/42816_submitter_file2__IMG2203.JPG","/var/www/straped/mufon/more/42816_submitter_file3__IMG2204.JPG","/var/www/straped/mufon/org/42816.html"],"Tags":"City","City":"Sacramento","Date Submitted":"09/25/2012 05:26 UTC","Object Shape":"Cigar","Sighting Duration":"00:01:00","Case Number":"42816","Region":"California","Log Number":"US-09252012-0010","Weather Factors":"Unknown"}