{"Viewing Distance":"Over One Mile","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around September 25th 2012"],"Object Shape":"Disc, Saturn-like, Star-like","Sighting Duration":"Undisclosed","City":"Portland","Date Submitted":"09/26/2012 12:24 UTC","Disposition":"Unresolved","Source":"MUFON","Country":"United States","divs":["Sighting DetailsMy boyfriend and I were leaving my apartment to make a run to the grocery store across the street from our complex. We got out into the parking lot when I noticed something flashing in the sky. At first glance I thought that we may have been witnessing a dying star due to its initial redness in color. This theory was quickly debunked by noticeable movement of the object. We based the movement of the object on the tree lines that were directly in our line of sight. It quickly became apparent that the object was hovering, then moving up and down, side to side, in a slow but erratic sort of flight path. We walked down the street to where we could get a better view of the object. It seemed to be moving faster and with more definition, but still maintaining its approximate position in the sky. The lights would flash red, then white, then red, then white as if we were constantly seeing different sides and angles of the object. It was also apparent at this time that the object appeared to be disc shaped. There were planes in the sky by which to compare the object. There were no similarities in flight paths, object behavior, or patterns in the flashing lights that we witnessed. We again walked to an area of the street where we thought we could get a better view of the object. By this point, it had completely disappeared from sight. We returned to where we saw the object before, but nothing was left in the sky to be seen. This was a clear night. No clouds in the sky, moderate temperatures. Planes were evident as I am certain other common flight craft would be as well."],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/42823.html.txt","/var/www/straped/mufon/org/42823.html"],"Log Number":"US-09262012-0002","Object Features":"Other","Summary":"Hovering object in sky, rotating & pulsating lights observed in Southwest Portland","map":"<A HREF = \"http://maps.google.com/maps?q=45.464812,+-122.754455(42823)&iwloc=A&hl=en\"> mufon case (42823) map </A>","Region":"Oregon","Object Flight Path":"Stationary,Other","Latitude":"45.464812","Longitude":"-122.754455","Date of the Event":"09/25/2012 08:05 UTC","Tags":"City","Case Number":"42823"}