{"Source":"MUFON","Object Features":"None","divs":["Sighting DetailsI watch the night sky frequently every night from about dark til 3to 4 hours later because I smoke outside my home. for the last few years i have been noticing brighter than normal lights in the sky sporatically but usually in the same location in the sky. what ever they are, they are not stars and they do not move for the duration that I observe them but they also do not belong there. I have seen some very strange things over the years. when I was 16 I saw three orbs that looked like they were playing tag, come from the left of our car go directly in front of us to the right. the closest point was about 10 to 15 feet in front of us. Since then I have always looked up at the sky. Inever saw anything like that up close again but none the less very wrong things. I will be 52 in a few weeks and have never stopped looking. Now here in the present these lights have come back yet again. 1 big one to the west and one to the north east and they just stay there. Doesnt anyone else see these two big lights tonight? It is now 11:47 and I must sleep due to our business. You may call me between the hours of 6-9 pm til friday night and I could explain a little better if you would like. If you here of anyone else that sees this PLEASE let me know. I would like to now whats up also. Thanx Nick PS I need to get a better camera. Any Suggestions? these do not show up on my camera but I see them plain as day."],"Log Number":"US-09262012-0003","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=46.661191,+-90.89222(42824)&iwloc=A&hl=en\"> mufon case (42824) map </A>","Disposition":"Unresolved","Date Submitted":"09/26/2012 12:52 UTC","Object Flight Path":"Hovering then path","Weather Factors":"Unknown","Date of the Event":"11/15/2011 12:00 UTC","Latitude":"46.661191","Region":"Wisconsin","City":"Washburn","files":["/var/www/straped/mufon/html2text/42824.html.txt","/var/www/straped/mufon/org/42824.html"],"Object Shape":"Sphere","Summary":"Two Stationary very bright lights resembling oversized stars then one darted left and away and disapeared inabout 1second","Sighting Duration":"Undisclosed","Case Number":"42824","trends":["There have been no other sightings in Washburn","This sighting has never been favorited."],"Country":"United States","Viewing Distance":"Unknown","Longitude":"-90.89222"}