{"Log Number":"US-09262012-0016","Disposition":"Unresolved","Latitude":"45.629546","Region":"Washington","City":"Vancouver","Object Flight Path":"Hovering then path","Date Submitted":"09/26/2012 05:16 UTC","Object Features":"Dome","Date of the Event":"07/11/1962 07:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.629546,+-122.629286(42838)&iwloc=A&hl=en\"> mufon case (42838) map </A>","Country":"United States","Object Shape":"Disc","Weather Factors":"Unknown","Longitude":"-122.629286","Viewing Distance":"101-500 Feet, N/A","Tags":"City","divs":["Sighting DetailsI lived near my parents, after being married. My friend and sister came over and we walked through Evergreen Park (4th Plain, in Vancouver, Wa). It was just barely getting dark -- date, time and year above are approximate. We got through the park, and started across open field (one acre) which would lead to my parents house (it was their field also). When we barely got out of the wooded park and into open field, this object (saucer like) hovered above us. We were frightened and started to run. My sister, Melba (now deceased) fell while running. It continued to hover, she got up and we all ran to my parents house. I told my dad to come outside (a BIG guy, in height and weight). He came outside, we all stood on the side porch, and then the object took off VERY, VERY FAST northward. While it hovered, before my dad got outside, it had lights flashing in sequence, clockwise. My friend that sawe it, Sandy Johnston, still in Vancouver, is still alive. Every once in awhile I ash her if she remembers that. She says she doesn't talk about it because her kids already \"think she is crazy\". She is not. We are both sane. After seeing several UFO shows today, I wanted to tell my story. I have kept it also \"to myself\", fearing people would think I was crazy, also. But, someone needs to know about my (out)experience also."],"Sighting Duration":"Undisclosed","Summary":"Hovered over us in open field, then we ran to house, it hovered again. When my dad came out, it shot VERY FAST NORTH.","Case Number":"42838","trends":["There have been 54 other sightings in Vancouver","There were no other sightings in Vancouver on or around July 11th 1962"],"files":["/var/www/straped/mufon/html2text/42838.html.txt","/var/www/straped/mufon/org/42838.html"],"Source":"MUFON"}