{"Region":"California","Date Submitted":"09/26/2012 06:07 UTC","divs":["Sighting DetailsMy event took place many years ago, I am writing to lend validity to two of the stories I saw on your show on Destination America. The stories of Cliff and Denise in Pennsylvania. What caught my attention was the fact they both said the craft skipped or fluttered across the sky very slowly. The one I saw I have always described as 'hopping' acros the sky, silently.Cliff is accurate when describing the size of the craft, it is bigger than a football field. Since I grew up with a pool, I almost always swam at night before going to bed, this was the last time I ever did that alone. I started at the shallow end and intended to swim to the deep end and back without taking a breath, something I paracticed quite often. I came back up in the shallow end facing the house, turned to rest against the side of the pool, and there it was: a huge black triangle, with a white light at each corner, 'hopping'slowly and silently in the night sky. I remember becoming cold, scared to death, yet unable to take my eyes off of it. I backed out of the pool, grabbed my towel and headed inside, with my eyes on it the whole time. Being the seventies, in Catholic dominated Orange County, I kept my mouth shut until I had moved out and married. Told my husband about it, of course he did not believe me until we were watching something on tv one night and there was film footage out of Belguim showing exactly what I saw. I remember my satisfaction as I turned to him and said: I told you so. Just felt a connection to their stories and wanted to say something. Since then, I always look up, see many things, but only a couple of other events have been completely unexplainable. I believe that most things are explainable, so I go with my instincts to decide what is misconception and what is unidentified. Once you see one, you always look for more...."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.92435,+-117.89884(42840)&iwloc=A&hl=en\"> mufon case (42840) map </A>","files":["/var/www/straped/mufon/html2text/42840.html.txt","/var/www/straped/mufon/org/42840.html"],"Summary":"Last time I ever swam at night alone, went under water and when I came up it was there.","Object Shape":"Triangle","Longitude":"-117.89884","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Case Number":"42840","Country":"United States","City":"Brea","Log Number":"US-09262012-0018","Weather Factors":"Unknown","Source":"MUFON","Date of the Event":"06/25/1976 12:00 UTC","trends":["There have been 8 other sightings in Brea","There were no other sightings in Brea on or around June 25th 1976"],"Viewing Distance":"101-500 Feet","Object Features":"None","Tags":"City","Latitude":"33.92435","Disposition":"Unresolved"}