{"divs":["Sighting DetailsI was taking my daughter to a rehearsal that started at 6:00 pm. On the way a bright object in the sky caught my eye. At the same time my 13yo daughter said \"hey Dad what is that\"? There was a high altitude jet with a trail we could use a a reference. As I observed it thinking it was a small aircraft it abruptly disappeared. I asked my daughter if she saw where it went. She saw exactly what I saw, it just vanished. There are three airports within ten miles of where we saw the object. Duluth International Airport and Sky Harbor airport in Minnesota and the Richard I Bong airport in Superior, WI. The sighting was almost exactly between them. We have almost constant air traffic in our area. The object was at I would guess 1500 to 2000 ft in the air and clearly not moving as it was in close proximity by sight line (not altitude) to the trail of the commercial plane. Also. It was situated wher it was directly reflecting the evening sun. I thought it maybe had just moved to a position where it wouldn't be reflecting anymore. Which is something the small aircraft sometimes do. But, it was close enough that we still should have been able to see I'd very much like to know if anyone else witnessed the same event."],"Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 4 other sightings in Superior","There were no other sightings in Superior on or around September 26th 2012"],"Tags":"City","Source":"MUFON","Longitude":"-92.10282","Case Number":"42846","Object Flight Path":"Stationary","City":"Superior","Country":"United States","Log Number":"US-09262012-0024","Weather Factors":"Unknown","Object Shape":"Sphere","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/42846.html.txt","/var/www/straped/mufon/org/42846.html"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=46.727964,+-92.10282(42846)&iwloc=A&hl=en\"> mufon case (42846) map </A>","Region":"Wisconsin","Latitude":"46.727964","Object Features":"None","Summary":"Very shiny stationary object observed for a short time.","Date of the Event":"09/26/2012 05:52 UTC","Date Submitted":"09/26/2012 09:00 UTC"}