{"Object Features":"Window(s)","Weather Factors":"Unknown","Log Number":"US-09262012-0020","Source":"MUFON","Date Submitted":"09/26/2012 06:25 UTC","divs":["Sighting DetailsI'll never forget it. It happened over 40 years ago. I was just twenty years old and a new bride. I was home alone. It was a crisp Fall, still night. I decided to step outside for some fresh air. I stood on the front steps for a few minutes. There was an open lot next door to the home...so I leaned over to looked up to the sky. Looking up and behind me. I saw these lights, I stared at them and in my mind... then on my lips I said is that a plane...what is that. My eyes were fixed, couldn't take my eyes off of it. I wanted to get a closer look by going inside and going upstairs to the backroom to look out of the second floor window, hoping it would'nt go away before I got up there. When I got to the backroom it was still there and it really didn't seem to be moving or if it was it was very slow. I stared and was really not sure what I was seeing but I felt like it wasn't a plane, helicopter or blimp. It sat there, there was no sound. There was lots of lights. I remember thinking a plane doesn't have so many lights. It seemed circular or disc- like. I watched it for what seemed like 10 minutes or so. I couldn't move or call anyone. There was no one around. There was no one outside that I could say to \"did you see that\" After about 10 to 12 minutes it suddenly disappeared as if to ascend not fly away but ascend. I was amazed. Again I remember saying what was that. I don't think it was a plane til this day. I thought the next day I might hear something about it on the radio, from neighbors, anybody. Didn't really know what to do about it but to tell family and friends. Never reported anything. Thought about calling a radio station but back then I was not aware of what else to do with my experience. I was watching a program with my son today. \"Mufon\" UFO Sightings and my experience came right back to me. I went to your website and decided to put it on paper or rather document it. I did this mainly for me. This happened so long ago but it is apart of me. To share it feels good. You can take it for what it's worth.This truly happened and it is my story. Sincerely, D. Duncan"],"Sighting Duration":"Undisclosed","Date of the Event":"10/01/1971 10:30 UTC","files":["/var/www/straped/mufon/html2text/42842.html.txt","/var/www/straped/mufon/org/42842.html"],"Country":"United States","Summary":"I never forget even after all these years. Saw the lights. Stared at them. Said...is that a plane..Went inside, upstairs, back room to get a better look. What is that? No sound. No movement. Odd","Object Shape":"Disc","map":"<A HREF = \"http://maps.google.com/maps?q=39.979758,+-75.234173(42842)&iwloc=A&hl=en\"> mufon case (42842) map </A>","Region":"Pennsylvania","Latitude":"39.979758","Longitude":"-75.234173","Viewing Distance":"Over One Mile","City":"Philadelphia","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around October 1st 1971"],"Object Flight Path":"Path then hovering","Tags":"City","Case Number":"42842","Disposition":"Unresolved"}