{"divs":["Sighting DetailsAt 8:45PM, In Muncie, Indiana, at approximately 180ft Northwest of the intersection of Reserve and Centennial Avenue, As I was outside walking to a nearby gas station on Centennial, I looked up to the stars because I always do.Looking up I saw a single fire colored circular orb of light in the sky travel Northeast for a distance of about 100ft then it traveled backward stopping for a moment close to its original Northwest position. I thought it was an airplane on fire at first glance before I saw it travel backward, but it was not a plane at all and upon closer look I thought it was akin to a fireball.It made a spiral jerking motion as though it were wavering before it continued forward fluidly again in the opposite direction for a distance of about 275 Ft and simply vanished like it was never there.It did not travel into the distance becoming dimmer, it literally vanished as if the light had been extinguished without any trace.I felt excited and anxious and overwhelmed with questions. I was accompanied in this sighting by a random neighbor who happened to be driving and actually pulled over in his vehicle to park and observe this phenomenon."],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/42851.html.txt","/var/www/straped/mufon/org/42851.html"],"Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Date Submitted":"09/27/2012 01:03 UTC","Object Features":"None","Longitude":"-85.399007","Disposition":"Unresolved","Log Number":"US-09272012-0003","Source":"MUFON","trends":["There have been 13 other sightings in Muncie","There were no other sightings in Muncie on or around September 26th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.223969,+-85.399007(42851)&iwloc=A&hl=en\"> mufon case (42851) map </A>","Latitude":"40.223969","Region":"Indiana","Country":"United States","Case Number":"42851","Date of the Event":"09/26/2012 08:40 UTC","Summary":"Fire Colored Circular Orb","City":"Muncie","Viewing Distance":"20 Feet or Less","Tags":"City","Object Shape":"Fireball, Sphere"}