{"Date Submitted":"09/28/2012 03:20 UTC","divs":["Sighting DetailsI was on break at 555 monster rd sw in renton washington outside at 9 something at night.we first seen a plane,color unknown,being escortedd to boeing field,which is to the north and east of our job location..I thought it out of place and commented on the escorted big plane because it would seem there would not be enough room for both to land considering how close that smaller jet,,non milatary was following..Please excuse my writting,I am not good with paragraph construction ect. Then a few minutes later,while listening to the washington huskies outsidee possibly winning an upset game, a orange planet,know it soundss crazy maybe,but this fire ball planet size thing appeared cleary above the treeline..just sat there in the sky..seemed like frickin fire around a blackish blue planet for lack of a better wword..when it was all done,,din;t fly away or nothing,just gone..there was like 2 minutes left to the game and it was not won yet,and a pure orange trianle appeare4d and also dissapeared in the saame location ass the Planet looking thing,,wow that was almost chilling you know..I will answer the questions now to the left that says make sure i answer these..at work on break outside 3 miles or so sw of boeing field in seattle. i notice object case it was a firey ball the size of the moon if not bigger by 50 percent.a planet with fire all around it,very differnt,wow. sat in sky,on like fire but like with a solid middle,like fire was all around something solid in the middle.I am just in a daze i guess.never seen anythinb like that in my life,but it WAS real..the object was there then gone,no dramtic exit or whatever,just there then gone..The orange triangle object afterward seemed really exact in its sides. i mean the were all equall in length. not as scary or whatever as the firery planet,that was BIGGGGG.like a planet.."],"Summary":"glowing yellow firey ball,then a see theu very bright orange almost see thru triangle,,wow factor was wierd,,almost spookey,but no idea what it was.","Log Number":"US-09282012-0001","Object Shape":"Circle, Fireball, Sphere","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Date of the Event":"09/27/2012 09:16 UTC","Country":"United States","City":"Renton","Weather Factors":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=47.452125,+-122.236271(42867)&iwloc=A&hl=en\"> mufon case (42867) map </A>","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/42867.html.txt","/var/www/straped/mufon/org/42867.html"],"Region":"Washington","Object Flight Path":"Stationary","Tags":"City","Latitude":"47.452125","Case Number":"42867","Longitude":"-122.236271","trends":["There have been 4 other sightings in Renton","There were no other sightings in Renton on or around September 27th 2012"],"Object Features":"Other"}