{"Date Submitted":"09/27/2012 10:49 UTC","Sighting Duration":"00:18:04","Viewing Distance":"20 Feet or Less","Source":"MUFON","Tags":"City","Date of the Event":"09/27/2012 02:37 UTC","Log Number":"US-09272012-0015","Disposition":"Unresolved","trends":["There have been 30 other sightings in Lake Havasu City","There was one other sighting in Lake Havasu City on or around September 27th 2012"],"Object Features":"None","Longitude":"-114.381038","Latitude":"34.515628","Weather Factors":"Unknown","Case Number":"42863","Country":"United States","Object Flight Path":"Stationary","Object Shape":"Unknown","City":"Lake Havasu City","Summary":"LOOK AT NEXT","Region":"Arizona","divs":["Sighting Detailsit was about 2:40 in the moring i heard this earie sound my dogs barked i looked outside i doint think they saw me they where making a clicking noise to each other i think there where 3 therte may have been more. one of them were 15 inches outside my window i tried to keep my dog from barking he then was very on edge i tried to make them thing i never saw them. they make a clicking noise to talk to each other. i have heard and seen them before i have never told any one but i would like to know if anyone did see a ufo last night .in my area they really did not seem like they were going hurt me. i think one of them where hurt. during this time i saw them and tried to be very quit.looking at the qustions i did follow themm . so at that time i woke up from the dog and rolled me aciggrette.and listen. my rections was i wanted meet them . but they did not put off the same vibe that i have encoutered before. i just had to tell someone i have nev er had them this close before.but i do know they can muliped u .so can u telle if an yone seen or hard about aufo in my area. iaM TRYING TO MAKE A SENCE ABOUT THIS. PLEASE GIVE ME YOUR OPION. THANKS KAYLA GRAVELET"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.515628,+-114.381038(42863)&iwloc=A&hl=en\"> mufon case (42863) map </A>","files":["/var/www/straped/mufon/html2text/42863.html.txt","/var/www/straped/mufon/org/42863.html"]}