{"divs":["Sighting DetailsJumping on a trampoline, around 7pm Sept. 28th 2012 Right next to N I 635 in Kc, Kansas, my girlfriend spotted what seemed to be a helicopter heading in from the SE. She prompted me to stop jumping and take a look. As we watched the spot light come closer, the object took shape. This was no helicopter. The dark figure was pyramid shaped with what seemed to be a \"heat-wave\" like aura around the body. This thing looked BIG. Atleast 100 feet across. It was probably, at it's closest, 1 mile away. Around the bottom edge of the pyramid was a spot light of some sort.The spot light rotated around the ship in full 360s. There was no beam, but the light seemed to be spotting while it stopped traveling, every so often. After spotting around for a couple seconds, the object continues towards our direction. This went on for about a minute and a half. About a mile away from us now, the object took a different path towards the South West, away from us. As the ship started in its new direction, it took to a new shape, an oblong oval type of shape. At this point the ship left our site behind the trees. We instantly raced to the car to chase this down. After about 10 minutes of driving on I 635 S there was no single evidence of any aircraft, except for the low flying plane headed in the same direction as the object,while we were leaving to chase the object. This ship had no sounds from our distance, but at its size should have been roaring. After sharing our exp. with a friend, we were noted that there is a rumor that our govt. was given sorts of drones from Higher powers, or the \"dark eye\" I don't know what to believe, and I never thought i would ever witness anything like this. I have seen hundreds of ufo videos and sightings and nothing compares to this. I have been very skeptical to believe many of these videos, but now I can truly say, \"These things are out there!\" Sorry I captured no video due to my petrified aw, and excitement. Hopefully others witnessed this in such a large city area. I don't want to be the crazy one!"],"Weather Factors":"Unknown","Case Number":"42879","files":["/var/www/straped/mufon/html2text/42879.html.txt","/var/www/straped/mufon/org/42879.html"],"Date of the Event":"09/28/2012 07:02 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=39.122478,+-94.681257(42879)&iwloc=A&hl=en\"> mufon case (42879) map </A>","Region":"Kansas","Longitude":"-94.681257","Object Shape":"Oval, Other","Object Features":"Other","Source":"MUFON","Summary":"Pyramid shaped object floating. Spot light emitted from bottom edge, rotated 360 degrees stopping here and there. morphed to oblong oval shape when leaving sight.","Latitude":"39.122478","Disposition":"Unresolved","City":"Kansas City","Date Submitted":"09/29/2012 12:27 UTC","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Tags":"City","Country":"United States","Log Number":"US-09292012-0002","trends":["There have been 27 other sightings in Kansas City","There were no other sightings in Kansas City on or around September 28th 2012"],"Sighting Duration":"00:03:10"}