{"Country":"United States","Object Shape":"Cylinder, Sphere, Other","Log Number":"US-09282012-0005","Tags":"City","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/42871.html.txt","/var/www/straped/mufon/org/42871.html"],"Viewing Distance":"Unknown","Longitude":"-71.127027","Case Number":"42871","map":"<A HREF = \"http://maps.google.com/maps?q=42.378306,+-71.127027(42871)&iwloc=A&hl=en\"> mufon case (42871) map </A>","Summary":"Multiple lights, spheres, cylinder","Latitude":"42.378306","Sighting Duration":"Undisclosed","Region":"Massachusetts","trends":["there have been no other sightings in boston \\ cambridge","This sighting has never been favorited."],"divs":["Sighting DetailsThe time was just before sunset, and the first object was a red ball. While I was watching it, it turned around, went behind itself, and was gone. I stopped in the middle of the bridge I was crossing, near MIT, and tried to find it again, but could not. I turned around, looking to see if it had moved to another part of the sky, only to see a second strange object. This one I first thought was a plane reflecting the sunset; it was long and orange. But it wasn't moving either, at first. Then it got longer, then shorter again, and then began to move in a small circular pattern. Then it stopped and began to get longer and shorter again. When I got to the end of the bridge, it was hidden behind a building. I walked further to see if I could catch it again, but it was gone. By this time the sun was beginning to set and the stars were coming out. I saw one bright light, which I at first assumed to be a planet. But then, I noticed a small red light attached to its right side. The red light went out, and a blue one appeared in its place; this one too soon faded away. Shortly thereafter, I lost sight of it and did not see it again."],"Date Submitted":"09/28/2012 03:05 UTC","Date of the Event":"02/20/2003 12:00 UTC","Disposition":"Unresolved","City":"Boston / Cambridge","Object Flight Path":"Stationary,Other","Source":"MUFON","Weather Factors":"Unknown"}