{"Object Shape":"Chevron, Circle, Sphere","Disposition":"Unresolved","Date Submitted":"09/29/2012 12:16 UTC","Date of the Event":"09/28/2012 08:25 UTC","City":"Reed City","trends":["There have been no other sightings in Reed City","This sighting has never been favorited."],"Object Flight Path":"Path with directional change","Log Number":"US-09292012-0001","Tags":"City","Sighting Duration":"Undisclosed","Longitude":"-85.51005","Country":"United States","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/42877.html.txt","/var/www/straped/mufon/org/42877.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.875017,+-85.51005(42877)&iwloc=A&hl=en\"> mufon case (42877) map </A>","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Latitude":"43.875017","Region":"Michigan","Summary":"Four white circles with three turning into a triangle shape.","divs":["Sighting DetailsI was driving southbound on old U.S. 131 at the southern edge of Reed City, MI. My girlfriend and I observed four round lights going across the road to the SE. One light was slightly ahead of the other three. The lead light on the remaining three objects circled around to the right of the trailing three lights. Then, the first three lights formed a triangle with the remaining light fading from view. The lights were extremely close and we should have seen the trailing object but it disappeared. After the objects formed a triangle the two objects behind the lead object disappeared even though they were still close. Then, the lead object disappeared as it flew far out in the SE direction. The lights when seen crossing the highway weren't very high off the ground. I'd say under a 1,000 ft. They were very bright. We pulled off the road by the Michigan State Police headquarters and watched them. We didn't know what they were except that we had never seen anything like it. It definitely was not a plane or helicopter. No sound was heard. I'd say we watched it for 3 minutes or so."],"Case Number":"42877"}