{"Source":"MUFON","Region":"Maine","Date of the Event":"08/17/1982 12:00 UTC","Case Number":"42875","Disposition":"Unresolved","Log Number":"US-09282012-0009","trends":["There have been no other sightings in dover foxcroft","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Latitude":"45.289294","City":"dover foxcroft","map":"<A HREF = \"http://maps.google.com/maps?q=45.289294,+-69.296399(42875)&iwloc=A&hl=en\"> mufon case (42875) map </A>","Viewing Distance":"Over One Mile","Summary":"Sebec lake , maine . August 17,1982. I and 3 friends were sleeping out on a private beach and saw a disc shaped redish orange glowing ufo enter the atmosphere and come down to the tree tops hover and leave to space.","Date Submitted":"09/28/2012 10:52 UTC","divs":["Sighting DetailsI saw a UFO while at Sebec lake in maine on August 17th 1982 . I was staying the summer up at my friends parents camp on the lake. Both he and I were 16 years old and best of friends at the time. The only way into this end of the lake were logging roads, that was about an 8 mile journey and done at a fairly slow pace, as one had to negotiate very bad road conditions and so in turn the trip could take 45 minutes just to get from the main road into the camp. There were only about 5 or so camps on this hole end of the lake and when one stood on the shore and looked out across the lake , \"about 3 miles\" there were no camps or houses or even roads on the opposite shore. We decided to camp out for the night on a private beach the owners of the handfull of camps jointly owned. The only way to get to this beach without bashing through the thick maine woods was to take a small 10ft boat from camp to the beach which had to be done in day light because of all the rocks that had to be avoided to get into the beach. It was myself , and my friend , both 16 years old and his younger brother and his friend which I believe they were 12 at the time. We got to the beach after dinner and laid out our sleeping bags on the beach. No tents . we were all a little concerned about all the bear foot prints on the beach but thought a good fire would keep them at bay. We went on to share a 6 pack of beer we had lets say (found) at the camp. We gave the younger guys one beer each and myself and my friend each had two. We went about our evening collecting wood so we wouldn't need to go into the thick black woods in the night, so as not to deal with any of natures creatures. Stories and fun were had and sometime around midnight we decided to get into our sleeping bags and turn in for the night. It must only have been about 5 minutes that I lay there with my eyelids closed, though still very much awake and still thinking of all the bear tracks.Then suddenly my friend bursts out,\" what the hell is that\" , I opened my eyes and sat up quickly, when way up in the sky in amongst the stars was a burning redish orange funny shaped ball like figure . At this time we all jumped to our feet and were quite amazed at this object even though it was very far away , as one would see in most video that gets taken these days. We were trying to make sense of this and explain to our own brains what it was that we were seeing. It was up in the sky ,with stars seen all around it , so for the next minute or two we tried to explain it away to ourselves that we must be seeing an asteroid or comet or anything the human mind could accept. But then in one felt swooping motion it moved down into a closer position to us and thats when alot of the talking came to a stop. It still had sky and stars behind it but now had come close enough to become both much larger and take its disc like shape with good clairity. We now new that we were dealing with the likelyhood of this being a ufo .The two youger kids at this point were not doing real well with taking this all in and tears began to run down there face as this was becoming very challenging for the human senses to take in. Then after a couple minutes of hovering about mid level in the sky it then moved again and settled down just above the trees on the other side of the lake. The size was amazing. It must have been a quarter to a half mile in size and now had a plot of trees and mountian behind it , which in turn left no chance for the mind to explain it away. It sat and hovered for 3 or 4 minutes all the while defying the senses as there was no sound and an even more unreal thing for the senses was that though it continued to glow this firery redish orange it didn't admit any light onto the trees below. At this time one of the younger kids with us had completely broke down and could no longer deal with the sensorey overload that had been placed upon him and dove into the bottom of his sleeping bag crying in fear , as I looked to his young friend, his face was also wet with tears but stood unable to move trembling in shock. Both myself and my friend were too in shock and could do nothing but let our jaws hit the sand for the first minute or two as it lay before our eyes. At some point we started to wave our arms and call for them to come to us , I guess in the hopes of contact. This was done with much fear as we did not know if this could also bring harm to us all.After a few minutes it then , in a very smooth motion, rose and swooped upward and stopped again maybe a 2000ft in the air and now had sky and stars behind it. It sat there for only 45 seconds or so and then in the classic big arcing motion swooped into outer space in the count of only two seconds. We were stuck on this beach until morning as we couldnt navagate the little boat past the rocks and there was no way to walk back. There was no sleeping , at the first light we made our way back to the camp and told my friends parents who wrote it in the camp log but thought we were just silly kids . Ive known ever sense that there are UFO's not of our doing and way beyond our science. They do exist."],"files":["/var/www/straped/mufon/html2text/42875.html.txt","/var/www/straped/mufon/org/42875.html"],"Object Flight Path":"Hovering then path,Path then hovering","Tags":"City","Weather Factors":"Unknown","Object Shape":"Disc","Object Features":"Dome","Country":"United States","Longitude":"-69.296399"}