{"map":"<A HREF = \"http://maps.google.com/maps?q=33.314921,+-111.908599(42870)&iwloc=A&hl=en\"> mufon case (42870) map </A>","Summary":"Flew directly over our heads. Silouetted by full or nearly full moon.","Date of the Event":"03/13/1997 08:15 UTC","Object Flight Path":"Straight-line path","Tags":"City","Region":"Arizona","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 52 other sightings in Chandler","There were no other sightings in Chandler on or around March 13th 1997"],"divs":["Sighting DetailsMy family was celebrating my daughter's birthday. My daughter, son and sister-in-law were in our back yard smoking. My son yelled to me \"Dad, you need to come out and look at this\". I went outside where he was pointing to the eastern sky. An enormous object, v-shaped with several lights on the bottom, was approaching in a path that took it directly over our heads. The moon was either full, or nearly full, so we all got a very good look at it. I thought it appeared to resemble a stealth bomber, or an immense flying wing. It's altitude seemed to be no more than two thousand feet, if that. It made no sound, just gliding along. I estimate it's size to be nearly a full city block from wing tip to wing tip. It continued on a course from east to slightly northwest. It's speed stayed constant during the time we viewed it, which wasn't very fast at all. I did not notice any markings or windows, only 5 or six lights, evenly spaced along the bottom of the craft. I no longer live at that location, but lived there from July of 1996 until September of 2005. I will furnish the other witness information if requested. Since there were so many other witnesses, we did not come forward at that time. Now I see all the show's claiming the bunk about the dropping of flare's being the possible culprit, and we all saw what it really was! I was a police officer and police supervisor for 31 years, and also a Vietnam veteran. I worked for the Chandler Municipal Court in Chandler, AZ. during the time of this incident. At the time, I felt the object might be a secret military project because of it's size and the fact that it flew without any detectable means of propulsion. It did appear to be man made, or made by an inteligent entity of some kind! Since the sighting, I have watched a number of shows describing this incident. The description of former Governor Simington's seems to accurately describe the craft I saw."],"Object Shape":"Boomerang","Longitude":"-111.908599","Object Features":"Wings","Disposition":"Unresolved","Country":"United States","Source":"MUFON","Case Number":"42870","Latitude":"33.314921","Sighting Duration":"Undisclosed","Date Submitted":"09/28/2012 02:54 UTC","City":"Chandler","Log Number":"US-09282012-0004","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/42870.html.txt","/var/www/straped/mufon/org/42870.html"]}