{"Longitude":"-87.643455","Date of the Event":"09/28/2012 09:15 UTC","Summary":"4 bright orange circular ufos witnessed by 4 individuals over Lake Michigan in Chicago","Tags":"City","divs":["Sighting DetailsI was in my bus facing east at a red light waiting to make a turn north bound onto Lake Shore Drive from Addison St. I usually check the corner to see if anyone is waiting there for other buses when I noticed an elderly gentleman looking up in the sky. I looked up and saw 4 bright orange circular objects very slowing flying directly toward the front of my bus coming from over Lake Michigan. Three were in a v shape with the 4th probably an arms length directly in front of the point of the v. I said out loud, \"What the hell is that?\" Then the four objects changed position, three in a straight line to my right with the fourth off to the left making the shape similar to a whaling harpoon. Then they rotated again, this time one disappeared, then another, until I only saw two. I turned the corner and was pulling out my cell phone to take a picture of the last two when someone in back of me spoke. As the company I work for frowns upon cell phones, I slipped the phone back in my pocket and continued driving to the next block. I was so excited about the siting I couldn't help but ask the young man if he saw \"4 glowing orange orbs\" in the sky and he excitedly responded yes. He told me he was from Upper state New York and had seen many lights in the sky but never that close. He asked me what I thought they were and I said I think I knew and he responded \" It was a ufo.\" to which I replied \"Or four. So you saw them, I saw them and the man at the bus stop saw them. Good, at least I know I'm not going crazy.\" At the point we began a very quick conversation about ufos and alien life, UFO Hunters and Ancient Astronauts. Then he had to exit at his stop, we shook hands happy to meet another believer. I proceeded south bound back to Addison, where I noticed a 20 something Asian girl looking up at the sky, so I glanced up again and saw only one orange glowing object, which then blinked out and disappeared. I made my turn onto Addison westbound and did not see the objects again. To say I was excited and thrilled to have witnessed these beautiful objects and their manuevars is an understatement. Moreover, I am glad three other people saw them at the same time. I can only hope someone in one of the highrises on Lake Shore Drive saw them and captured a picture."],"Date Submitted":"09/29/2012 01:11 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.948632,+-87.643455(42880)&iwloc=A&hl=en\"> mufon case (42880) map </A>","Source":"MUFON","Log Number":"US-09292012-0003","files":["/var/www/straped/mufon/html2text/42880.html.txt","/var/www/straped/mufon/org/42880.html"],"trends":["There have been 221 other sightings in Chicago","There was one other sighting in Chicago on or around September 28th 2012"],"Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Region":"Illinois","Country":"United States","Object Features":"None","Viewing Distance":"501 Feet - 1 Mile","Case Number":"42880","Object Shape":"Circle, Sphere","Disposition":"Unresolved","City":"Chicago","Latitude":"41.948632"}