{"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=30.379314,+-91.06664(42895)&iwloc=A&hl=en\"> mufon case (42895) map </A>","trends":["There have been 27 other sightings in Baton Rouge","There were no other sightings in Baton Rouge on or around September 12th 2011"],"Weather Factors":"Unknown","divs":["sighting detailswhile staying at the marriot courtyard, baton rouge at approxmiately 5:15pm on september 12, 2011, i was on balcony (having smokebreak) on second level. observed stationary object (long triangular, delta shape, gold-colored object, 5 circular shapes where engines would logically be placed in back of craft). circular orificies were not completely hollow, but same color as rest of the object. color of object: it was gold in color, but when looking at the sun, which was 15 degrees to the sw of object, i determined it was reflecting the exterior environment because it was exact color of the sun itself. size of object: at least 1.2 kilometers long. it was at an altitute of approximately 30,000 feet. the techonology of this craft was beyond anything us military or nasa has ever produced. reason: size, hover and what comes next: unfortunately, did not have my slr hd camera at the time of this incident. at first i thought the object was a hoax (blimp, advertisement, huge experimental kite, etc.) but after 10 seconds of viewing this object, it was apparent it was not a hoax of any sort. the expense of creating such a hoax would have been in the millions of dollars due to the huge size of the object. object could only be seen if looking directly up, which isn't normal for human viewing. when i first came out on the balcony i did not see it until i sat down and happened to look up due to something catching my eye (the object). after approximately one minute, the object began to have an aura and pulsate from its center. eventually the glow was golden and was even brighter than the sun itself. the entire object was enveloped in the glow. there was no heat and no sound during this glowing aura phase. after the glow disappated after approximately 1 minute, the object had changed shape into a boomerang\\wedge shape. instead of the delta long triangular shape with 5 circles (engines?) in back, it was a triangle\\wedge with the 5 circles directly underneat. when i researched this incident, i saw exactly what others had depicted in drawings of the wedge shaped object illustrated in the phoenix lights incident. the entire front end had disappeared. it was hovering, same gold color as the sun, making no sound. 1 minute later, the craft suddenly took off vertically, with no sound, but definately broke the sound barrier. a tiny contrail was all that remained."],"Date Submitted":"09/29/2012 04:14 UTC","Object Shape":"Triangle","Latitude":"30.379314","Case Number":"42895","City":"Baton Rouge","Date of the Event":"09/12/2011 05:15 UTC","Summary":"Long delta, triangular craft - Hovered, no Sound, Changed Shape to Wedge","Disposition":"Unresolved","Log Number":"US-09292012-0019","Object Flight Path":"Hovering then path","Source":"MUFON","Region":"Louisiana","Tags":"City","Longitude":"-91.06664","files":["/var/www/straped/mufon/html2text/42895.html.txt","/var/www/straped/mufon/org/42895.html"],"Object Features":"None","Viewing Distance":"Over One Mile","Sighting Duration":"00:03:30"}