{"Object Features":"Unknown","divs":["Sighting DetailsThe first night of Nascar in Dover brought unexpected visitors to the area. My Wife and I were on the front porch of our home facing North, situated behind the track, just across the field of visiting RV's for this weekends race. We noticed orange lights originating from the north west, rising over neighbors homes and slowly making their way over our house, one by one. My Wife recorded it on her phone as I attempted to view them better through binoculars. The image was blurry although still orange and I could make out no other distinguishing characteristics other than the light. To the naked eye, each orb seemed to pulse mimicking some sort of aircraft, but there were no flashing lights, no navigation lights and these things made no sound at all! One of them got to the far end of our complex and completely disappeared! This lasted about 15 minutes as they slowly rose above the tree tops and neighbors houses, again, one by one, made their way across our neighborhood and either disappeared or slowly extinguished their lights. We were ready to head back inside when one emerged from the west, almost directly behind the Dover Downs Hotel and made its way over Rt. 1, took a slight right turn and followed a parallel path to the highway until we could see it no more. I said I would check the web if anyone saw this phenomenon today, but so far I have come up empty. Did anyone else see these?"],"Case Number":"42897","Object Shape":"Fireball","City":"Dover","Latitude":"39.2148","Longitude":"-75.502265","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/42897.html.txt","/var/www/straped/mufon/org/42897.html"],"Object Flight Path":"Path with directional change","Tags":"City","Country":"United States","trends":["There have been 7 other sightings in Dover","There were no other sightings in Dover on or around September 28th 2012","This sighting has been favorited 2 times.",""],"Region":"Delaware","map":"<A HREF = \"http://maps.google.com/maps?q=39.2148,+-75.502265(42897)&iwloc=A&hl=en\"> mufon case (42897) map </A>","Sighting Duration":"Undisclosed","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"09/29/2012 07:16 UTC","Summary":"Multiple bright orange orb like objects","Date of the Event":"09/28/2012 09:40 UTC","Log Number":"US-09292012-0021","Disposition":"Unresolved"}