{"Region":"North Carolina","Object Shape":"Sphere","Sighting Duration":"00:08:00","trends":["There has been one other sighting in Reidsville","There were no other sightings in Reidsville on or around September 8th 2012"],"files":["/var/www/straped/mufon/html2text/42890.html.txt","/var/www/straped/mufon/org/42890.html"],"Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=36.361909,+-79.657285(42890)&iwloc=A&hl=en\"> mufon case (42890) map </A>","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"09/08/2012 10:00 UTC","Disposition":"Unresolved","Summary":"Approximately 20 red glowing spheres moving under cloud cover all remining smae distance apart.","Tags":"City","Longitude":"-79.657285","Date Submitted":"09/29/2012 11:11 UTC","Weather Factors":"Unknown","Log Number":"US-09292012-0014","divs":["Sighting Details(I am reporting this for a friend who wants to remind anonymous.) Sighting Around 10 PM on Saturday, September 8, 2012, the witness observed through her window two orange-red spheres moving toward the SSE. As she watched , others appeared and moved with the first two maintaining the same space between each. They moved as if they were in a procession. After about 7 or 8 appeared she called her neighbor to ask her to see if she could see them. The red spheres were going over her neighbor's house at the time. The neighbor was able to go outside and see the last sphere moving off toward the S. The witness estimates that she saw a total of about 20, all moving as if in a procession and maintaining equal separation. The sighting lasted for a total of 5-10 minutes. While she had her initial sighting though a window, she did open the window and her observation of the spheres continued. She cannot say how high the spheres were but they were below the over-cast sky. Their apparent size seemed to be about the same size as the moon overhead. There were no sounds and no blinking lights. The witness is familiar with routine air traffic because one of the landing patterns for the Greensboro airport (GSO) causes planes to pass over her house. Also, the spheres had no visible parts. The witness that night called the police to see if there were any reports of sightings. No reports had been made. Later, the witness did call two local venues for receptions, weddings, etc. and both said that nothing was released such as balloons or lanterns. Witness The witness is a 78 year old retired teacher. She has never been interested in sci-fi books or movies. She has a B.A. degree and a M. Ed. degree."],"Object Features":"Unknown","Latitude":"36.361909","Case Number":"42890","Country":"United States","Source":"MUFON","City":"Reidsville"}