{"Log Number":"US-09292012-0020","Region":"Colorado","Date of the Event":"09/29/2012 09:15 UTC","Date Submitted":"09/29/2012 06:32 UTC","trends":["There have been 28 other sightings in Arvada","There were no other sightings in Arvada on or around September 29th 2012"],"Weather Factors":"Unknown","City":"Arvada","Latitude":"39.786815","Disposition":"Unresolved","Object Features":"None","Sighting Duration":"Undisclosed","Tags":"City","Longitude":"-105.1064","Object Shape":"Circle, Diamond, Egg, Flash, Oval, Teardrop","divs":["Sighting DetailsI went to the store this morning before work, and as I was walking back to my car, I was admiring the beautiful clear blue Colorado sky (as I often do), when something glinted and caught my eye. As I stood by my car about to get in, I looked at the shiny dot a little harder, and realized that is NOT a plane reflecting the sun. That is... something... that I don't know what it is! I watched it for a LONG time. It did move , but very VERY slowly, and stayed the same shape and size. There were other people in the parking lot, and I am hoping and praying someone else noticed it as well, but I must admit, I did not say anything, I wish I had, and I should have. Everyone spends too much time looking down now-a-days. The object was a tiny, shiny silver dot that sometimes looked elliptical in shape like a lemon, there was another, even tinier dot, that non-intermittently would move from top to bottom. I wish WISH WISH that my pictures had come out better, because how it is now, all you can see is the tiny silver dot, and nothing else. But believe me when I say, this was remarkable!! This is not the first time I have seen a UFO, but it IS the first time I got a picture of it. Again, I wish it was better, because there is no way I could use this pic as it is as evidence of anything."],"Source":"MUFON","Summary":"Object seen in daylight Arvada, CO","map":"<A HREF = \"http://maps.google.com/maps?q=39.786815,+-105.1064(42896)&iwloc=A&hl=en\"> mufon case (42896) map </A>","files":["/var/www/straped/mufon/html2text/42896.html.txt","/var/www/straped/mufon/org/42896.html"],"Case Number":"42896","Object Flight Path":"Hovering then path","Viewing Distance":"Over 1 Mile, Unknown","Country":"United States"}