{"Object Features":"Window(s)","Log Number":"US-09292012-0015","Viewing Distance":"21-100 Feet","trends":["There has been one other sighting in Greenlawn","There were no other sightings in Greenlawn on or around February 1st 1965"],"Object Shape":"Disc","Object Flight Path":"Unknown","Date of the Event":"02/01/1965 12:00 UTC","Latitude":"40.849412","Weather Factors":"Unknown","Tags":"City","City":"Greenlawn","files":["/var/www/straped/mufon/html2text/42891.html.txt","/var/www/straped/mufon/org/42891.html"],"Case Number":"42891","Longitude":"-73.370134","Summary":"Object observed through bedroom window in neighbors yard","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Region":"New York","Source":"MUFON","Date Submitted":"09/29/2012 11:49 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.849412,+-73.370134(42891)&iwloc=A&hl=en\"> mufon case (42891) map </A>","divs":["Sighting DetailsAs a child I was awoken from my sleep by a noise as well as bright lights shining into my bedroom. The head of my bed was on a south wall whereby I could see out a north window which was directly in front of my bed. I observed an object hovering over a neighbor's tree. It was in my sight for only 20 seconds or so and then just disappeared. It was disc in shape with very bright lights around it. The feeling I had during the 20 seconds or so was that I was being watched by this object. From that night on for many months, I was awoken by my mind feeling like it was racing out of control with an almost buzzing sound as well. I would have to get up and walk around to make it stop. I never mentioned any of this to my parents as I felt it was all too strange and they'd think I was either crazy or making up stories. My grandmother moved in with us approximately 6 months after my encounter with this object. I had to give up my bedroom to her and move into another on the other side of the house. I never experienced the racing feeling or buzzing again once in my new bedroom. However, my grandmother would express concern to my mother that she felt she was being watched through the windows at night. I never did speak to my grandmother about this and in hindsight certainly wish that I had. After all these years later, I still remember this occurrence and the months following very clearly and thought I'd share."]}