{"Viewing Distance":"Unknown","Object Features":"Unknown","trends":["There has been one other sighting in Cuyahoga Falls","There were no other sightings in Cuyahoga Falls on or around September 29th 2012"],"Object Flight Path":"Other","Tags":"City","Disposition":"Unresolved","Object Shape":"Fireball","Log Number":"US-09292012-0024","City":"Cuyahoga Falls","Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/42900.html.txt","/var/www/straped/mufon/org/42900.html"],"Date Submitted":"09/29/2012 08:52 UTC","Region":"Ohio","Longitude":"-81.509469","divs":["Sighting DetailsMy wife and I were driving down State Rd in Cuyahoga Falls towards North Hill of Akron. My wife noticed the object first. It was about 45 degrees up in the air from level sight. The first thought was that it was Mars since it was orange and pulsated like a planet. It was considerably larger than Mars normally is and much more orange in color. What made me realize it was not mars was that as we drove the object was not moving, however the car was approaching closer. It did keep a relatively stationary position like stars or planets do when you are driving. We pulled on to a side street and parked the car to get a better view. The object was smaller then what it was when we first noticed it. We then continued south on State Rd. When we reached Cuyahoga Falls Ave and State Rd intersection we could no longer see the object. I just checked the location of where the object was with google sky maps to see if it was Mars. It is 8:48 pm est and Mars just came above to horizon. Mars location is also not the same location as the object we saw earlier."],"Latitude":"41.160265","map":"<A HREF = \"http://maps.google.com/maps?q=41.160265,+-81.509469(42900)&iwloc=A&hl=en\"> mufon case (42900) map </A>","Case Number":"42900","Summary":"An orange ball all of light that pulsated like a planet then dissapeared","Date of the Event":"09/29/2012 07:45 UTC","Weather Factors":"Unknown","Sighting Duration":"00:05:00"}