{"files":["/var/www/straped/mufon/html2text/42910.html.txt","/var/www/straped/mufon/more/42910_submitter_file1__IMG0968.JPG","/var/www/straped/mufon/more/42910_submitter_file2__IMG0969.JPG","/var/www/straped/mufon/more/42910_submitter_file3__IMG0970.JPG","/var/www/straped/mufon/org/42910.html"],"divs":["sighting details9\\29\\2012 8:05pm my sons were outside playing with friends, when they noticed about 6 - 8 strange round lighted objects moving slowly through the night sky. no sound. no flashing or blinking lights. objects size appeared bigger than a star, but smaller than the sun. my son called me from down the street, to tell me to go look outside. i was able to spot them from our backyard. i saw 6 lights. they first appeared to be moving in a straight line,but then changed to a zig-zag pattern. i ran inside to get my husband. when we got back out to look there were only 4 lights visible, but they were moving out of sight range, towards lake erie, about 1\\2 mile away. i was able to get a photo of the last light with my cell phone before it moved out of range. total observation time 10 minutes (about 8 minutes first by the boys, then 2 minutes by me & my husband). we got into the car and tried to see where they went, but were unable to locate them again. after we came home i looked online to see if anyone else had reported seeing anything, and found this site. i also contacted our local police department to report seeing something unusual, and was told \"it was probably chinese flying lanterns, not ufo's\". the police advised me that they are really popular around here, especially down by the beach. also it's a saturday night,and there may even be a wedding party that are sending them out. holy cow. what an idiot i am. it probably was. it was way more exciting when we thought it was ufo's. oh well... i wonder how many of the other reports on here are flying lanterns? i'll bet more than just a few. take a look at the photos of flying lanterns online, and see how easily it could be mistaken for \"strange lights\" from far away. i'll post the pictures i took anyway, just for the heck of it."],"Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Country":"United States","Longitude":"-78.824766","trends":["There have been 56 other sightings in Buffalo","There were no other sightings in Buffalo on or around September 29th 2012","This sighting has never been favorited.",""],"Region":"New York","Object Shape":"Circle","City":"Buffalo","Summary":"Round lights observed moving slowly overhead toward Lake Erie until out of sight","Source":"MUFON","Date of the Event":"09/29/2012 08:05 UTC","Sighting Duration":"Undisclosed","Date Submitted":"09/30/2012 12:49 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.754575,+-78.824766(42910)&iwloc=A&hl=en\"> mufon case (42910) map </A>","Disposition":"Unresolved","Case Number":"42910","Log Number":"US-09302012-0003","Object Flight Path":"Path with directional change","Latitude":"42.754575","Object Features":"None"}