{"files":["/var/www/straped/mufon/html2text/42917.html.txt","/var/www/straped/mufon/org/42917.html"],"trends":["There have been no other sightings in Urumqi","This sighting has never been favorited."],"Object Shape":"Disc, Oval, Star-like","Case Number":"42917","Weather Factors":"Unknown","Object Features":"Unknown","Summary":"Several semi-stationary, hovering disk shaped craft at various altitudes resembling stars at distance seen in earlier, clearer sightings this month.","Disposition":"Unresolved","Viewing Distance":"Over One Mile","City":"Urumqi","Longitude":"87.616823","Date of the Event":"09/30/2012 12:00 UTC","Tags":"City","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=43.825645,+87.616823(42917)&iwloc=A&hl=en\"> mufon case (42917) map </A>","divs":["Sighting DetailsI am a US citizen and businessman working in China for the past year now. Since March of this year, I've had numerous (about 8-10 to date, since March of this year) unexplainable UFO sightings here in Western, China. Most recently this morning was the latest. As has occurred several times this month, I have awoken during the early morning hours between 2am and 5am to look out my apartment window and observe in the eastward sky toward the mountains in the distance often times starlite during these hours. This morning, I noticed numerous similar objects (craft) appearing as stars hovering that I've witnessed in earlier sightings this month after they were spotted. Some of these objects appeared to glide horizontally on occasion from my viewpoint with fluid motion while all maintained a level altitude at their respective altitudes, distances and locations, scattered, throughout Eastern sky. All of these sightings have occurred in the Easterly direction facing the mountains here in Western China. During this sighting, all of the objects were at a further distance and altitude than the previous sightings this month, but they were unmistakable from the earlier sightings. This latest sighting was also marked, by the only plane (I think) I've ever seen with respect to any sightings traversing the sky Eastward on a flight path at a seemingly, higher altitude during this sighting. During these sightings, especially the earlier ones this month, one craft has always been at a little lower altitude and distance than the others. It is from the earlier sightings that I could see a little better resemblance of the disc-like shape, different colored flashing lights and hovering, fluid motion of the craft for long periods of time. All of my sightings have lasted for 50 minutes to 2 or 3 hours, especially in the early morning hourse depending on how long the crafts are visible before fading away into the distance before sunrise. In all of my sightings here this month, it is clear these craft are not using any type of conventional propulsion system based on the limited, but striking manner of short path movements that I have observed. During several other sightings in August and one this month, I have been accompanied by my girlfriend, who on one occasion noticed a similar disc-shaped craft at night three weeks ago and a friend who witnessed several craft when I brought his attention to another late night sighting here, in August. While observing these sightings, one cannot avoid admiring the technological achievement these craft exhibit and studying it. From which planet and star system did they come if indeed these are extraterrestrial in origin? How many light years away? Were these craft acquired through a mutual contact program with some level of government involvement and if so, who is flying them and why? Are these craft the product of reverse engineering? What is the manner of their propulsion system and how do they operate? I think a lot of what I have been able to observe here would be missed by the casual observer unless they noticed and carefully observed these objects for the length and number of times I have now even at the seemingly increased distances. They could easily be mistaken for stars and brushed off, but I guarantee without a doubt now that they are not. Unfortunately, I don't have video or photo of any of these sightings here yet, but if I did it would be a valuable addition to the field of Ufology."],"Log Number":"CN-09302012-0010","Latitude":"43.825645","Date Submitted":"09/30/2012 06:30 UTC","Object Flight Path":"Stationary","Region":"Xinjiang","Source":"MUFON","Country":"China"}