{"trends":["There have been 30 other sightings in Lake Havasu City","There was one other sighting in Lake Havasu City on or around September 27th 2012"],"Object Flight Path":"Straight-line path,Path with directional change","Log Number":"US-09302012-0009","Date Submitted":"09/30/2012 05:57 UTC","Longitude":"-114.242872","Region":"Arizona","map":"<A HREF = \"http://maps.google.com/maps?q=34.461774,+-114.242872(42916)&iwloc=A&hl=en\"> mufon case (42916) map </A>","Latitude":"34.461774","Case Number":"42916","Object Features":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/42916.html.txt","/var/www/straped/mufon/org/42916.html"],"Weather Factors":"Unknown","Object Shape":"Circle, Star-like","Date of the Event":"09/27/2012 12:00 UTC","Sighting Duration":"00:00:10","Source":"MUFON","City":"Lake Havasu City","Viewing Distance":"Over One Mile","Disposition":"Unresolved","Country":"United States","divs":["Sighting DetailsI observed this flying object while I was having a conversation outside with my friend. It was sometime between 12:10 and 12:15 A.M. While talking to my friend a fast moving starlike object far in the distance was moving within my eye sight. At first I thought it was a jet or maybe something military. About 5-7 seconds after noticing the object I started to really pay attention to it. After about another 5-7 seconds of watching the object drive in a straight line from west to east. It made an aburpt 90 degree turn and traveled quickly to the south. I couldn't even guess the speed the object was traveling when it changed direction, it was out of sight in less than a second when it made the abrupt turn. What made me realize it might not be an object of known origin aside from its fast speed, was because the turn made no arching shape. For something to travel that fast, it could never make the turn that it did. I have seen many military jets in my area, NOTHING has ever traveled that fast near the city I live in. Thinking back on the event now, when the object was flying in a straight line from west to east. At the height it was flying, it still seemed to fly much faster than any military jet I have ever seen. My friend unfortunetely didn't get to witness the event. I didn't realize what I was witnessing until it changed direction, and traveled away at a breakneck speed. I was kind of a skeptic of UFO sightings until I actually became a witness."],"Summary":"Seen a starlike object in the sky. The object made an abrupt 90 degree turn, and then traveled away at an incredible speed,"}