{"Summary":"Looked like fireball, sudden directional change light slowly faded off until we couldn't see it.","Object Shape":"Fireball, Flash, Star-like","Country":"United States","Weather Factors":"Unknown","Date Submitted":"10/01/2012 01:07 UTC","Case Number":"42945","Tags":"City","Viewing Distance":"Unknown","Log Number":"US-10012012-0002","trends":["There have been 35 other sightings in Milwaukee","There were no other sightings in Milwaukee on or around September 29th 2012"],"divs":["Sighting DetailsMy neighbors and I were having a neighborhood party and were sitting around a fire pit. Around 8pm on September 29, 2012 my mom pointed out to me that it looked like a fire ball was coming towards us. My neighbor said it was probably a helicopter or something, but helicopters usually aren't on fire and coming that fast. I originally thought it was some sort of meteorite, until this fireball suddenly changed directions and went back up into the sky. I have NEVER believed in legitimate UFO's until last night. This fire ball which was coming at a slight curve towards the North coming from the South in the western sky stopped and headed in a straight path towards the sky seeming like it was going away from earth. We all watched it fade off until this fireball couldn't be seen at all. I came back to my dorm room and found out my roommate had seen the same exact fireball object thing. All of us who saw it after could not believe that NO ONE took any proof. It'll just have to be something we all keep with us personally for the rest of our lives."],"Longitude":"-87.896674","Sighting Duration":"Undisclosed","Date of the Event":"09/29/2012 08:15 UTC","Region":"Wisconsin","Source":"MUFON","City":"Milwaukee","files":["/var/www/straped/mufon/html2text/42945.html.txt","/var/www/straped/mufon/org/42945.html"],"Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=43.044302,+-87.896674(42945)&iwloc=A&hl=en\"> mufon case (42945) map </A>","Disposition":"Unresolved","Latitude":"43.044302","Object Features":"Unknown"}