{"map":"<A HREF = \"http://maps.google.com/maps?q=43.807763,+-88.674832(42959)&iwloc=A&hl=en\"> mufon case (42959) map </A>","trends":["There have been no other sightings in Rosendale","This sighting has been favorited 1 time."],"Weather Factors":"Unknown","Date Submitted":"10/01/2012 08:48 UTC","Source":"MUFON","divs":["Sighting DetailsIt was early in the evening when a few of us were out for a ride when one of us said, \"do you see that!?\" I looked over and saw a bright fireball in the sky. I then said, \"Tell me I am not the only one who sees it!\" I then told my friend to stop the car so we could get out and take a better look. It was a clouldless day and the sun was low in the horizon. When we all got out we stood together on the side of the road and stared in aww. We all observed the one fireball slowly begin to seperate into 7 fireballs with 3 fireballs emerging in two directions in a horizontal line above the horizon from the orginal fireball. All were perfectly spaced. There was no sound. We all agreed that the objects were about 10 miles away to the West but still appeared to be a size of basketballs in the sky. We stood and watched for about three minutes. Once the fireballs had all seperated they began to spin in a pinwheel fashion maintaining their perfectly spaced seperation. The rate of speed of the pinwheel efffect began to increase very quickly and all of asudden they came back together into the orginal fireball and in the blink of an eye it shot to the Northwest and was out of sight. we all agreed what we saw and were in a kind of shock. We looked at each other in silence and said no one will believe us. I have told people over the years and remember it like it was yesterday. Before or after this incident I have never seen anything even close to this event!"],"files":["/var/www/straped/mufon/html2text/42959.html.txt","/var/www/straped/mufon/org/42959.html"],"Viewing Distance":"Over One Mile","City":"Rosendale","Date of the Event":"07/01/1995 12:00 UTC","Case Number":"42959","Object Flight Path":"Hovering then path","Tags":"City","Latitude":"43.807763","Object Shape":"Fireball","Longitude":"-88.674832","Sighting Duration":"Undisclosed","Summary":"Observed fireball in sky seperate into several and spin like a pinwheel","Disposition":"Unresolved","Country":"United States","Region":"Wisconsin","Log Number":"US-10012012-0016","Object Features":"None"}