{"Source":"MUFON","Log Number":"US-10012012-0013","City":"Philadelphia","Weather Factors":"Unknown","Case Number":"42956","Latitude":"39.996142","Sighting Duration":"00:01:00","trends":["There have been 216 other sightings in Philadelphia","There were 2 other sightings in Philadelphia on or around September 30th 2012"],"Date of the Event":"09/30/2012 08:33 UTC","Region":"Pennsylvania","Object Shape":"Star-like","Object Features":"Unknown","divs":["Sighting DetailsIt was the Puerto Rican Festival in Phila, PA and the streets of Philly were filled with parades and noise and festive pride and it had just begun to get dark out when I decided to hang on the corner of my mothers' block with some family members when four of us noticed a single light the size of a basketball hovering directly above us and changing color as it went. It went from yellow to orange to red-orange to kind of like a fuschia and kept changing in that order and it traveled calmly down the small street we were on (american street) and towards the railroad tracks that is on the other end of the road but inside a huge mile long ditch that run under bridges. It hovered straight towards the tracks and it seemed as if the light was going to land since it lowered a few feet and when we realized we were looking at a UFO, my father and I tried to chase it to see if we can get a better look and it vanished. It was as if the light just turned off. We didnt see anythign else in the sky to indicate it flew away, we did not see it fly away. It was there one second and gone the next."],"Country":"United States","Viewing Distance":"21-100 Feet, 101-500 Feet","files":["/var/www/straped/mufon/html2text/42956.html.txt","/var/www/straped/mufon/org/42956.html"],"Object Flight Path":"Path with directional change,Path then hovering","Summary":"I was standing on a corner with family and saw a color changing light hovering above me.","Longitude":"-75.135095","Date Submitted":"10/01/2012 07:05 UTC","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=39.996142,+-75.135095(42956)&iwloc=A&hl=en\"> mufon case (42956) map </A>","Tags":"City"}