{"Sighting Duration":"Undisclosed","divs":["Sighting DetailsFrom the viewpoint near the meeting points of Barry, Allegan and Kalamazoo county border lines in Michigan five to six pulsating red lights moved from north horizion to south in a generally straight line path. About 1,500 feet up, the lights were clearly independant of each other moving in various vectors, but in order like 'ducks in a row' spanning about three miles in total. As the red light dimmed during its pulse the smallest flickering 'fire like' light could be noticed. I thought they were chinese lanterns launched from Kalamazoo that night until I noticed the speed and magnitude of the light. The glow was about the size of a four seat prop plane. No sound was heard from the lights. The objects moved through the sky about as fast as jet approaching for landing at Kalamazoo airport. Shortly after crossing the Kalamazoo county border the red lights faded during the course of two to three pulsations. No object or condensation trail was visible in the totally clear sky and full moon light."],"Object Flight Path":"Straight-line path","Disposition":"Unresolved","Region":"Michigan","Latitude":"42.446936","Longitude":"-85.640904","Date of the Event":"09/29/2012 09:49 UTC","Summary":"Five to six pulsating red lights about 1,500ft. moved from north to south. Red lights faded out, no condensation trail or object seen in moon light.","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 3 other sightings in Plainwell","There were no other sightings in Plainwell on or around September 29th 2012"],"Country":"United States","Date Submitted":"10/01/2012 06:20 UTC","Source":"MUFON","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/42955.html.txt","/var/www/straped/mufon/org/42955.html"],"Weather Factors":"Unknown","City":"Plainwell","Object Features":"None","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.446936,+-85.640904(42955)&iwloc=A&hl=en\"> mufon case (42955) map </A>","Case Number":"42955","Log Number":"US-10012012-0012"}