{"map":"<A HREF = \"http://maps.google.com/maps?q=41.691819,+-71.894953(42969)&iwloc=A&hl=en\"> mufon case (42969) map </A>","Summary":"{dr}Very bright orange-red light slowly ascending then dimming","Case Number":"42969","Longitude":"-71.894953","Sighting Duration":"Undisclosed","Object Shape":"Unknown","Date of the Event":"09/29/2012 07:25 UTC","Log Number":"US-10022012-0007","trends":["There have been 2 other sightings in Plainfield","There were no other sightings in Plainfield on or around September 29th 2012"],"Weather Factors":"Unknown","Country":"United States","divs":["Sighting Details At about 1920 hours on 29 September 2012 I was at St. Pauls church, 27 Babcock Ave. Plainfield, CT 06374, I and two other people observed a very bright orange light slowly ascending in the western sky. The light was first seen at about 15 degrees elevation due to interference from trees. The three of us continued to observe the light for about 10 minutes. There were no discernable navigation lights visible, no white, green or red strobes. The light proceeded very slowly to about 35 degrees elevation and stopped for about one minute. After that the light descended at an angle of 5-10 degrees reletive to horizontal then again appeared to stop. At this time the light either receeded directly away or dimmed in place. The initial noticing of the light was due to its reletivly extreme brightness and motion. Both myself and one of the other observers are former submarine sailors and I am a former member of Civil Air Patrol. Neither of us had any idea of what the light source could be. The light was dimming and was lost to sight behind the trees."],"Region":"Connecticut","Disposition":"Unresolved","Object Flight Path":"Path with directional change,Path then hovering","Source":"MUFON","files":["/var/www/straped/mufon/html2text/42969.html.txt","/var/www/straped/mufon/org/42969.html"],"Object Features":"None","Viewing Distance":"Unknown","Tags":"City","Latitude":"41.691819","City":"Plainfield","Date Submitted":"10/02/2012 11:55 UTC"}