{"Object Shape":"Circle, Disc, Oval","map":"<A HREF = \"http://maps.google.com/maps?q=47.095349,+-114.053659(42966)&iwloc=A&hl=en\"> mufon case (42966) map </A>","Country":"United States","Summary":"saw a silver-grey circular object, chunky and angular, not smooth or sleek gliding soundlessly east to west over arlee, MT","Latitude":"47.095349","trends":["There have been no other sightings in Arlee","This sighting has never been favorited."],"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/42966.html.txt","/var/www/straped/mufon/org/42966.html"],"Object Flight Path":"Straight-line path","Source":"MUFON","Date Submitted":"10/02/2012 09:38 UTC","Longitude":"-114.053659","Tags":"City","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Case Number":"42966","Log Number":"US-10022012-0004","Date of the Event":"09/30/2012 12:00 UTC","Sighting Duration":"Undisclosed","City":"Arlee","Object Features":"Other","Region":"Montana","divs":["Sighting DetailsI was in my back yard outside of Arlee, MT doing chores. It was late PM maybe 5 or 6. There had been constant chris-crossing chemtrails over the area for days and I had been watching them. At this time as I was coming back from shutting up the greenhouse I stopped and looked up to see a few more high-flying jets shooting out chemtrails and then I noticed a jet going west with NO contrail or chemtrail and another one going east. As I was pondering the lack of anything coming out of those jets while other ones at the same time and seemingly the same altitude were spewing massive chemtrails, I lowered my gaze and saw an object gliding thru the air from east to west. Not flying like a jet or plane. There was something different about how it moved and with absolutely no sound. That's what caught my attention. THere's been a lot of fires around and so frequent small planes or helicopters as spotters or ferrying fire personnel are overhead so I was familiar with what was moving up there and this most certainly wasn't anything I had seen. Ever. It was a dark silver-grey and circular. Ish. Hard to define the shape because it seemed angular and chunky. And appeared large, maybe the size of 3 commuter planes at that distance. Flat bottom. No wings, no tailfin, no sleek jet or plane look. It stayed at the same altitude and just glided thru the air. No zig-zags. No lights. My sighting consisted of just myself squinting really hard to see and saying what the ? over and over.No camera, no binos and husband in the house. Over the next day I watched the skies again trying to judge from the planes and jets at what altitude it might have been at and it was definitely not as high as the transcontinenal jets but perhaps as high as the local commuter ones. This only lasted a minute or two because suddenly one of my cats started screaming as if being attacked somewhere on the other side of the house and I had to run."],"Weather Factors":"Unknown"}