{"Summary":"{dr}Red flame around it with white center that changed to bright white only. Flew over 29 Palms marine base and dissapeared.","Object Features":"Other","Date of the Event":"09/17/2011 09:52 UTC","Region":"California","trends":["There have been 6 other sightings in Joshua Tree","There were no other sightings in Joshua Tree on or around September 17th 2011","This sighting has never been favorited.",""],"Latitude":"34.146339","Longitude":"-116.293821","Disposition":"Unresolved","Object Flight Path":"Path with directional change","Log Number":"US-10022012-0014","Weather Factors":"Unknown","Object Shape":"Circle, Disc, Fireball","Case Number":"42978","City":"Joshua Tree","files":["/var/www/straped/mufon/html2text/42978.html.txt","/var/www/straped/mufon/more/42978_submitter_file1__ufo.jpg","/var/www/straped/mufon/more/42978_submitter_file2__ufo2.jpg","/var/www/straped/mufon/more/42978_submitter_file3__ufo3.jpg","/var/www/straped/mufon/more/42978_submitter_file4__ufo5.jpg","/var/www/straped/mufon/org/42978.html"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.146339,+-116.293821(42978)&iwloc=A&hl=en\"> mufon case (42978) map </A>","Tags":"City","Date Submitted":"10/02/2012 05:09 UTC","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","divs":["sighting details on the night of 9\\17\\2011, around 9:52 pm, i was sitting in the back yard of a friends house with them. (there were 4 of us that witnessed the event) my male friend and were sitting on the couch talking and facing north. it was a clear night, no clouds. this allowed for a clear view of joshua tree valley over to the top of the hill on the north side. there was no air traffic in the area. i noticed a light come into view to my left at about a 45 degree angle from the bottom of this valley. the valley is maybe 2 miles across from where we were sitting to the top of the north side hill. i didnt know what ti was at first then i jumped to my feet and exclaimed, \"look! here we go!\" the others immediatly saw the object as i pointed to it. we were unable to miss it. the object was traveling west to east over the north side of the valley. the object at first had a glowing flame like aura around a white center. by the time the object got to the point of being straight in front of us, it no longer glowed red and appeared as a bright white circular disk. by then we had our camera phones out and 2 of us were taking pictures of it. there was no sound from it through the entire event. when it reached 3\\4 across the valley from west to east, it dipped down then changed directions heading to the north east and dissapeared out over the 29 palms marine base. as a guess, the object was traveling at approximately 30 to 40 miles per hour while it was on its west to east trajectory. after 30 minutes to an hour, i noticed normal aircraft in their normal flight patterns to the north and very high up. i was extremely excited to witness such a blatant event. i remained excited the rest of the night and continued to watch the skies in the area on and of till i went to bed without any further sightings."],"Sighting Duration":"Undisclosed"}