{"City":"Undisclosed","Latitude":"36.785581","Tags":"City","Date Submitted":"10/02/2012 12:40 UTC","Sighting Duration":"01:00:00","Date of the Event":"10/01/2012 09:30 UTC","Summary":"{dr}Star like, moving slightly rt, lt, up, down. Changed color redish brown to blue, to white star like.","Case Number":"42971","files":["/var/www/straped/mufon/html2text/42971.html.txt","/var/www/straped/mufon/org/42971.html"],"Viewing Distance":"Over One Mile","Object Flight Path":"Stationary,Other","trends":[],"Disposition":"Unresolved","Log Number":"US-10022012-0009","Region":"California","Country":"United States","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.785581,+-119.409402(42971)&iwloc=A&hl=en\"> mufon case (42971) map </A>","Longitude":"-119.409402","Source":"MUFON","Weather Factors":"Unknown","divs":["Sighting DetailsOct. 1st, 2012 - Petaluma CA. Going to bed around 9:30 PM - opened up bedroom window to let air in. Window faces the southeast. Saw a blue(ish)object moving in a strange manner. Thought it was a plane in trouble but it stopped and seemed to hover about a mile or more up. No sound. Color then changed to white like a typical star in the sky then to reddish brown then back to white, but I noticed what looked like a small red light behind and down to the left of the object, not blinking. It looked like it might be attached? Assumed this could be a weather balloon but there was no breeze that evening and this object stayed in the same spot. I watched this object for about an hour. Its movements varied slightly from side to side and up and down but not in a smooth pattern. It appeared to change shape at one point. Hard to describe. Like a typical star but then it appeared to have a triangular spire on top of it for a few minutes. Then changed back to star like. A couple of planes did fly over but the altitude of the planes were much lower than the object. I wondered if the pilots could see this. I finally just fell asleep because it just didnt go away and I didnt feel threatened. I wasnt freaked out by this sighting. I was calm, curious and a little amazed that I was seeing something I couldnt explain. I got up in the morning and went to work and told a co-worker. She told me to look on the local paper to see if anyone had reported anything. I found on Petaluma360.com a notice from Sept. 22nd about a sighting with several objects. The description was incredibly similar to the sighting I witnessed, but I only saw the one object."],"Object Shape":"Star-like"}