{"Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Region":"Maine","Longitude":"-70.193844","Tags":"City","Latitude":"44.10119","trends":["There have been 4 other sightings in Lewiston","There were no other sightings in Lewiston on or around June 10th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=44.10119,+-70.193844(42970)&iwloc=A&hl=en\"> mufon case (42970) map </A>","Case Number":"42970","Summary":"{dr}While driving my car my attention to the road was distracted by sunlight reflecting off a silver circular object in the sky in front of me.","Object Shape":"Circle","Sighting Duration":"Undisclosed","Source":"MUFON","Object Flight Path":"Straight-line path","Disposition":"Unresolved","divs":["Sighting DetailsWhile driving toward home on East Avenue at about 9:00 am heading West, I was momentarily distracted by sunlight reflecting off an object in the sky in front of me. Looking through the windshiled of the car, it was silver in color and was round. It appeared to be a solid ball. The object was just gliding horizontally forward at a steady pace through the sky away from me. There was no noise and no emission of any kind. I watched it for about 15 seconds until it disappeared over the horizon ahead of me. My fist thought was it reminded me of a baloon moving swiftly through the air, however this oject was moving at a speedy steady pace, not wavering up or down. I have seen many air shows at the Brunswick Naval Air Station over the years and my best guess as to the size is difficult, however, based on memory and the approximate height and distance from me, my best guess it would be about the size of a volkswagon beetle or a little bigger perhaps. The speed was about 250-300 miles per hour and I base that estimate on the speed of the Blue Angel Demo when one of the jets flew by at 150 miles per hour as indicated by the commentator over the loudspeaker. The object was moving about twice that speed. The height was approximately 500 feet, way above the tree line and just above the contour of the ground in front of it. The reason Im reporting this here is because I have never seen anything like this before and I dont talk about it, but ocassionally think about it because it was so strange to see. In my opinion,it was a controlled object and moving way too low to be a satellite."],"City":"Lewiston","Log Number":"US-10022012-0008","Date of the Event":"06/10/2011 12:00 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/42970.html.txt","/var/www/straped/mufon/org/42970.html"],"Date Submitted":"10/02/2012 12:02 UTC","Object Features":"None"}