{"Region":"Florida","Date of the Event":"10/02/2012 06:30 UTC","City":"Land O' Lakes","Weather Factors":"Unknown","Summary":"{dr}Bright light/star-like object falling/ascending from sky","Latitude":"28.214076","Longitude":"-82.428349","files":["/var/www/straped/mufon/html2text/42972.html.txt","/var/www/straped/mufon/org/42972.html"],"Sighting Duration":"Undisclosed","Object Features":"None","Case Number":"42972","Viewing Distance":"Over One Mile","Source":"MUFON","Date Submitted":"10/02/2012 12:41 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=28.214076,+-82.428349(42972)&iwloc=A&hl=en\"> mufon case (42972) map </A>","Tags":"City","trends":["There have been 8 other sightings in Land O' Lakes","There were no other sightings in Land O' Lakes on or around October 2nd 2012"],"Log Number":"US-10022012-0009","divs":["Sighting DetailsThis morning I took the dogs outside at 6:30, give or take five minutes. As I waited for them to finish their business I noticed a very bright star-like object descending from the sky. At first it may have been hovering or I simply just noticed it in my view. Then it moved like a falling object but seemed to be more controlled like it was descending very rapidly, straight down, no angle to the descent at all. No trail or anything. It was very cloudy west toward the Gulf of Mexico. It seemed to be that far away from me in Land O Lakes (fifteen miles away I guess.) I noticed a jet flying north from the south, which obviously was a plane from Tampa Intl. I kinda got the impression that the object dipped into cloud cover because of the plane. The jet passed by the exact same general area and elevation. I waited for the object to reappear but I never saw it emerge from the clouds. At least five minutes passed before I returned inside the house. Note: I have previously reported some sightings of odd lights, etc. while I lived north of my current residence. One of my disappointments about the new location was not frequently seeing any strange things in the sky as often or as easily as my old neighborhood since Im more in Land O Lakes and before I was north on the outskirts."],"Disposition":"Unresolved","Object Flight Path":"Straight-line path","Object Shape":"Sphere, Star-like","Country":"United States"}