{"trends":["There have been 3 other sightings in Taylorsville","There were no other sightings in Taylorsville on or around October 2nd 2012","This sighting has never been favorited.",""],"Object Flight Path":"Path with directional change","divs":["Sighting DetailsUnidentified Flying Object over Salt Lake Valley - October 2nd 2012 At approximately 1:20 p.m. I spotted a rounded silver object hovering over the northern portions of the Salt Lake Valley from the vantage point of 4700 south and 2700 west. The object was first spotted moving Easterly in direction and when an approaching jet liner (based off of the markings of the jet it was a Delta jet) the object changed direction to a more Southerly route at which point I entered the house and called another individual out to see the object that I could not identify to see if they could make out what the object might have been. The object proceeded to move slowly in the southerly direction towards the middle of the valley (taking approximately 3 or so minutes to reach the middle area, approximating its location in the sky in correlation to the ground I would say the object was hovering high above 2100 south and 1300 west) at which point the object began to at a much more rapid pace move in a more Easterly direction towards the Wasatch mountains. Along with the other individual we continued to watch the object move towards (and what looked like eventually OVER the mountains) until we could no longer make out the object in the sky. We both observed the object with binoculars and with our naked eyes and all we could make out with the binoculars was the fact that the object was silver and definitely metallic in appearance (as it was shimmering like a star at night would) and that it was rounded like an orb. We both continued to observe the object for as long as we could make out the object and keep track of its direction, it continued to move east at what seemed like a much quicker speed than it did when it was heading in the southerly direction. We continued to observe the object for approximately another 2 or 3 minutes or until about 1:30 p.m. at which point the object was no longer discernible from the crisp blue sky. How I first came to notice the object is while I was watching the aforementioned commercial jet flying through the sky leaving a small vapor trail behind it. As the jet flew across the northern sky from east to west I noticed something shimmering in the sky moving opposite of the jet (again the markings on the plane were clearly Delta in origin) from west to east. When the object and the jet were about equidistant apart (from the ground perspective anyway) the object changed direction and headed from north to south eventually changing direction again and heading east. At first sight of the object and after initial observation and skepticism about what this could be I ran into the house and called another individual out to see the object as well. We both went back outside to the same spot I first noticed the object in and with the binoculars we both took turns observing the object. Neither of us could see any markings or indicators that it was just a jet high up in the atmosphere only that the object was just a small, semi-rounded, silver and metallic in appearance object leading us to question if the object was an unidentified flying object or not."],"Object Shape":"Circle, Disc, Oval, Star-like","Viewing Distance":"Over 1 Mile, Unknown","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"10/02/2012 01:20 UTC","Log Number":"US-10022012-0013","Case Number":"42976","Source":"MUFON","Latitude":"40.674739","Summary":"{dr}UFO moved from north to south approached jet changed direction","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.674739,+-111.95996(42976)&iwloc=A&hl=en\"> mufon case (42976) map </A>","files":["/var/www/straped/mufon/html2text/42976.html.txt","/var/www/straped/mufon/more/42976_submitter_file1__ObjectLocation.jpg","/var/www/straped/mufon/more/42976_submitter_file2__20121002132052.jpg","/var/www/straped/mufon/more/42976_submitter_file3__ObjectPath.jpg","/var/www/straped/mufon/more/42976_submitter_file4__ObjectPathRealPhoto.jpg","/var/www/straped/mufon/org/42976.html"],"Longitude":"-111.95996","City":"Taylorsville","Date Submitted":"10/02/2012 04:40 UTC","Country":"United States","Object Features":"None","Region":"Utah","Disposition":"Unresolved"}