{"Object Flight Path":"Path with directional change","trends":["There have been 7 other sightings in Phoenixville","There were no other sightings in Phoenixville on or around October 1st 2012"],"files":["/var/www/straped/mufon/html2text/42989.html.txt","/var/www/straped/mufon/org/42989.html"],"Weather Factors":"Unknown","City":"Phoenixville","Date Submitted":"10/03/2012 01:58 UTC","Summary":"{dr}Massive circular craft","Sighting Duration":"Undisclosed","Country":"United States","Region":"Pennsylvania","Latitude":"40.135222","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsI had just started a Bon fire in my back yard, my girlfriend was in the house cooking. While standing in my yard I noticed a large bright craft coming throught the trees. As it mad its way into my full view I noticed it seemed to look like a very large oversized jet with white lights at least three on each side of what at first appeared to be wings, as well as red lights on the under belly of the craft. As this object started to pass above me I remember thinking this plane is huge. Just at that moment Im not sure exactly what happend! This object appeared to change shape or the cloudes moved around and away from it. The craft may have rotated or changed direction at this point, it was all so breath taking i was just in shock of what i was seeing. I could have possable been seening some sort of cloaking technology.The next thought I had was that this was no plane but a gigantic circular craft with a smaller circle within that began to rotate. The craft did have bright white lights an on its outer rim maybe 6 or more and the inner circle had red lights at least two but at the angle of my view felt like there was three that spun with the inner circle. This all happened in seconds. Next I turned an ran to get my girlfriends attention so I was not the only witness to this incredible experiance. Really wish I would have pulled out my phone. After getting my girlfriend with panic in my voice I said look a UFO and she was able to see the craft as it was flying away at a fast steady past not super fast tho. She did say it looked unusual but the craft had moved a good distance by now. So she by no means had the same up close expearance I had. I also remember seeing what looked like two virtacal white lights witch appeared to be lager the the craft. It looked like what would seem to me to be some sort of exsaust for the craft. After words there was alot of plane activity in the sky, and the just paled in comparison to what I had just saw. They also where fling much higher. I really hope me coming forth with this report will help other come forward as well."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.135222,+-75.509483(42989)&iwloc=A&hl=en\"> mufon case (42989) map </A>","Source":"MUFON","Tags":"City","Object Shape":"Circle, Disc, Oval, Other","Log Number":"US-10032012-0003","Longitude":"-75.509483","Object Features":"Unknown","Disposition":"Unresolved","Date of the Event":"10/01/2012 12:00 UTC","Case Number":"42989"}