{"Weather Factors":"Unknown","Region":"Texas","files":["/var/www/straped/mufon/html2text/42987.html.txt","/var/www/straped/mufon/org/42987.html"],"Summary":"{dr}Saw what assumed was a star that caught my eye because after a second it started blinking, moving up and down and around in no certain order. Parts or asumed wings lighted up, flashed first horizontal then flashed on top like an antenna or vertical","Country":"United States","Date Submitted":"10/03/2012 01:02 UTC","Latitude":"32.807395","Log Number":"US-10032012-0001","Object Features":"Dome, Appendage(s)","Sighting Duration":"Undisclosed","City":"Dallas","Disposition":"Unresolved","Object Flight Path":"Stationary","divs":["Sighting DetailsI have grainy pictures of an object that at first thought was regular star. Then horizontal flashes, then vertical flashes. while object remained still in the night sky. got camera took pics. Best camera had low battery. Grabbed iphone took pics (object was far away but can scan in iphone image and certainly UFO also changes shapes in split seconds 1 frame to another. Also have short video when object startedbasically dancing around. Also no noise at time but iphone picks up a steady banging noise? Lasted for around an hour so far away got tired of going outside and looking at it. So never saw it take off or exit. Pictures are not the best but everybody I show them too gets freaked out and dosent want to talk about it. Thats why i am contacting you is to talk. I will only send when you guys contact me. Not looking for attention just need someone to talk to about this."],"Case Number":"42987","Date of the Event":"10/01/2012 04:30 UTC","Longitude":"-96.766913","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.807395,+-96.766913(42987)&iwloc=A&hl=en\"> mufon case (42987) map </A>","Source":"MUFON","trends":["There have been 116 other sightings in Dallas","There were no other sightings in Dallas on or around October 1st 2012"],"Viewing Distance":"Unknown","Object Shape":"Disc, Flash, Oval, Star-like, Unknown"}