{"Log Number":"US-10032012-0007","Weather Factors":"Unknown","Disposition":"Unresolved","Date of the Event":"09/19/2012 09:20 UTC","Longitude":"-78.11492","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/42993.html.txt","/var/www/straped/mufon/org/42993.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.924764,+-78.11492(42993)&iwloc=A&hl=en\"> mufon case (42993) map </A>","Object Shape":"Oval, Sphere, Star-like","Case Number":"42993","Region":"North Carolina","Country":"United States","Source":"MUFON","Object Features":"None","City":"Oak Island","trends":["There have been 5 other sightings in Oak Island","There were no other sightings in Oak Island on or around September 19th 2012"],"Date Submitted":"10/03/2012 09:14 UTC","Object Flight Path":"Stationary,Path with directional change","Latitude":"33.924764","Sighting Duration":"00:00:20","Tags":"City","divs":["Sighting DetailsWe were at Oak Island on the beach fishing when my wife actually noticed them first, when she saw them she immediately pointed, asked me what it was and I turned to see, in the southwestern sky, at about 2 oclock in position, there were two bright red lights. One was very large, oval in nature, dare I even say saucer-isk in shape. The other was tiny and round. The larger one would make maybe 20 to 30 of the smaller ones in size and was stationary. But they smaller one was to the left of the larger, moving down and to the left, it then circled back up and to the right, back towards the large object. Once it reached the big one they appeared to merge and then the large one just dimmed out really fast as if someone turned off a switch. As it was over the ocean horizon I couldnt swagger an estimation of how far away they were. From what I have found out so far they were a little to the left of a star called Arcturus and a little above it in elevation. There was no sound and the entire event maybe lasted 15-20 seconds from the time I turned around. This was at 9:20pm on the night of Sept. 19. We didnt have a camera with us as it was night and we didnt think we would need one. We were both awestruck as we have never seen anything like this before and have no idea what they could have been. If it was a manmade aircraft I have no idea what kind it could have been as these did not act as a typical aircraft would."],"Summary":"{dr}2 objects seen, one small moving away from very large stationary one.then circling back to large one merging with it. big one"}