{"Tags":"City","Country":"United States","divs":["Sighting Details1. We were at my house having a party and my friend went out side when she discovered the lights in the sky. She came screaming in the house to me and then me, her and my son went out side and thats when I seen the 5 lights, when one disappeared. We stayed out there for about 5 minutes when my son took a picture on his camera. As we watched one of them take on a directional pattern in the sky, very slowly, I ran back in the house to get my husband. When we came out, the forth one I was watching disappeared before our eyes and then 3 remained in a sort of large triangular pattern. One of them went to the right and disappeared, the next one, which is the forth one went to the left and disappeared, then the last one took a slow horizontal pattern going to the left and it went behind something and casted a shadow as if it was moving behind something. when that light went behind what was ever up there you could see something was there then it came out from behind it, continued left and then vanished. The lights were extremely bright orange, never blinking, hovering for sometime. We had 6 people all that were there and saw it. We were yelling people came out of there house and we also spoke with other people who seen it that night without us. My son took pictures and when we enlarged them, a trail is seen leaving them. This was definately unidentified objects and we would like to share our story and picture with you. Wait til you see them blown up...."],"Viewing Distance":"Unknown","Date Submitted":"10/03/2012 10:53 UTC","Region":"California","files":["/var/www/straped/mufon/html2text/42996.html.txt","/var/www/straped/mufon/more/42996_submitter_file1__Ufos19.29.12JaketookinSantaPaulaCA.JPG","/var/www/straped/mufon/more/42996_submitter_file2__Ufos29.29.12JaketookinSantaPaulaCAzoomedtothemax.JPG","/var/www/straped/mufon/more/42996_submitter_file3__Ufos39.29.12JaketookinSantaPaulaCAzoomed.JPG","/var/www/straped/mufon/org/42996.html"],"Object Features":"None","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Object Shape":"Boomerang, Circle, Cylinder, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=34.33561,+-119.092992(42996)&iwloc=A&hl=en\"> mufon case (42996) map </A>","Date of the Event":"09/29/2012 07:45 UTC","Sighting Duration":"Undisclosed","Log Number":"US-10032012-0010","Weather Factors":"Unknown","Longitude":"-119.092992","Case Number":"42996","Disposition":"Unresolved","Summary":"{dr}6 orange lights high in the sky..many witnessess and picture","Latitude":"34.33561","trends":["There has been one other sighting in Santa Paula","There were no other sightings in Santa Paula on or around September 29th 2012","This sighting has been favorited 1 time.",""],"Source":"MUFON","City":"Santa Paula"}