{"Disposition":"Unresolved","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"10/03/2012 09:39 UTC","Date of the Event":"06/03/2012 03:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.547594,+-114.47829(43006)&iwloc=A&hl=en\"> mufon case (43006) map </A>","Object Shape":"Boomerang, Cylinder, Sphere, Triangle","Region":"Idaho","Latitude":"42.547594","Viewing Distance":"20 Feet or Less","trends":["There have been 9 other sightings in Twin Falls","There were no other sightings in Twin Falls on or around June 3rd 2012"],"Summary":"{dr}multiple UFO sightings","Object Features":"Unknown","Object Flight Path":"Hovering then path,Path with directional change","Tags":"City","Country":"United States","Source":"MUFON","Case Number":"43006","Log Number":"US-10032012-0019","files":["/var/www/straped/mufon/html2text/43006.html.txt","/var/www/straped/mufon/org/43006.html"],"City":"Twin Falls","divs":["Sighting DetailsPlease let me start off by saying I am not crazy, insane or have had any history of mental problems. I currently reside in Twin Falls Idaho. I am 36 years old, I dont recall seeing anything odd or strange in the skies until about 3 months ago. Since my first sighting it has been nonstop. I know what I am seeing is real. I have witnesses and photos. i even called dispatch on a daytime sighting in which I do have a photo of, thank God. I have reported 2 of my sightings to the national UFO Reporting Center, but that was before I found mufon. I just wish I had answers because this is consuming my life . I guess Ill just jump right in to it. The very first sighting occurred the first week of June 2012. I was sitting on my back porch around 2 or 3 in the morning. I could not sleep I was smoking a cigarette and messing around on my phone, when out of the corner of my eye I caught a bright brilliant flash in the sky. I looked up at what appeared to be the planet Venus. It was the same shape and as bright but slowly traveling through the air way below our atmosphere , lower than planes fly but high above the treeline. it was traveling in a zig zag pattern. it would zig then flash like a bright..bright.. camera flash, then fade almost so you could not see it any more than Zag, and flash bright again. This was no satellite reflecting the sun, nor was it a tumbling meteor, it made no sound and it was lower than planes fly. it flashed brilliantly bright about 5 times, traveling from north to south. Just as soon as it disappeared to the south it repaired traveling back to the north, flashing, the dimming out and then re-appearing in a different area in the sky with a brilliant flash . For the next 4 nights I went outside and watched the star like flashing objects but all were extremely higher in the sky. That was the very first experience and now here is where it gets strange.... I spoke to my cousin who lives in Hailey Idaho about my experience, she had had some experiences of her own. she came for a visit and she and I were out in my backyard around 12:30 am. I was pointing to the stars in the sky telling her where I had seen what I saw the previous nights, when all of the sudden she said look! look! there! A strange, misty, fog seemed to have formed above my house. She pointed out two large deep red sphears each about the size of a small car, traveling slowly above the treeline towards us in a foggy mist. They were flying side by side at first, as they flew directly over us they separated apart from each other, then they came back together and crissed crossed 1 another. The strangest thing is that it was so quiet out side, no sound,the air was dead, it felt like void, I dont know if you can understand this but everything around me felt empty. Its weird I know Im trying to make sense of it myself. That was that night ...the next night we were sitting out in my back yard again looking at the sky when a V shaped cloud flew past our faces. this was after my cousin said her ears were ringing and actually started to bleed. I have more to tell you and I know this sounds bizarre, or fabricated but I am willing to take a lie detector test. there is so much more I want to tell you especially about the day time sighting when I called dispatch. I have a picture of that 1. it was not Just a light in the sky, but a metallic object, hovering above my house. My cousin isnt my only witness. I have pointed things out to my roommate. She is scared because these things I have shown her were in the daytime. Although my family believes me and other people have seen what I have seen, I still feel all alone because there is no 1 to answer my questions. Its not like I can go to the police and report these things. I did that once and they made me feel hallucinogenic. I feel like there is no support, no answers to my questions, , .... why me,? why now? and most importantly what is in our skies? What I have told you here is true. I have worked my whole life, I have been a boss, an assistant Manager, and have friends family and employers, that can vouche for my character. Thank you for taking the time to read my report, sincerely ,Concerned in Idaho"],"Longitude":"-114.47829"}