{"Case Number":"43015","City":"Seattle","Longitude":"-122.305589","Log Number":"US-10042012-0009","map":"<A HREF = \"http://maps.google.com/maps?q=47.728439,+-122.305589(43015)&iwloc=A&hl=en\"> mufon case (43015) map </A>","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/43015.html.txt","/var/www/straped/mufon/more/43015_submitter_file1__CIMG0485.JPG","/var/www/straped/mufon/more/43015_submitter_file2__CIMG0483.JPG","/var/www/straped/mufon/more/43015_submitter_file3__CIMG0486.JPG","/var/www/straped/mufon/org/43015.html"],"Object Features":"Unknown","Latitude":"47.728439","Date of the Event":"09/30/2012 11:57 UTC","Tags":"City","Object Shape":"Oval","divs":["Sighting DetailsOn the morning of Sept. 30, 2012, I saw a jet leaving persistent trails, which I regularly document- both the jet and trails, as I feel they are not a naturally occurring event. In this instance, I grabbed my camera, a 10.5 megapixel Casio Elexim, with 30X optical zoom and took four shots, in the space of one minute, of the jet as it passed over my house as I faced West. On the second shot, I saw a dark object above the jet in my viewfinder, and clicked off two more shots as I followed the jet on near full zoom. The second camera shot captured what I had seen in the viewfinder, the third only sky, which I deleted, and the fourth was the jet which had momentarily turned off its spray. I checked my pics to make sure the photo which contained the dark object was not a piece of dirt on my lense, even though I had seen it in my viewfinder. The first, third and fourth shots had no object. I took all shots within a 25 second period and only one had the object. I want to note that I had somehow got the time code messed up on my camera and the dates and times on the photos are incorrect...they say 2008 and in the AM. All photos are actually Sept.30th, 2012 just before noon. I was quite puzzled by what this dark object could be. It was far too large and high up to be a bird. I was disappointed in its lack of shape, but its edges are equivalent to the edges of the jet, given its distance, I am left to ask the same thing I did in my head upon sighting....\"What the heck is that?\" Pic # 485 contains the object. #483 was taken just before, and #486 is just after."],"Sighting Duration":"Undisclosed","Date Submitted":"10/04/2012 07:57 UTC","Region":"Washington","trends":["There have been 110 other sightings in Seattle","There were no other sightings in Seattle on or around September 30th 2012","This sighting has never been favorited.",""],"Summary":"{dr}Dark object just above chem-trail jet momentarily visible","Source":"MUFON","Weather Factors":"Unknown","Country":"United States","Disposition":"Unresolved","Object Flight Path":"Straight-line path"}