{"trends":["There have been no other sightings in Emporia","This sighting has never been favorited."],"Weather Factors":"Unknown","Tags":"City","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=36.580134,+-77.548383(43011)&iwloc=A&hl=en\"> mufon case (43011) map </A>","Log Number":"US-10042012-0005","Country":"United States","divs":["Sighting DetailsThe first time it was like balls of lights dancing in the sky. They were streaking past and returning in the direction in which they came. They all were not all moving in a straight line. Some would move in a circle like motion while others would move then stop then move again and stop then change directions. I was a little boy at that time and I stood there watching for several minutes just to see what was going on. The movement of the lights seemed to have had some kind of musical movement rythm with them so I was amazed because I had never seen anything like that before. I began watching the sky every day and night because I wanted to see that again. I cant remember how long it was exactly but it happened again. This time it was different. It started with the lights dancing in the sky and then came a large glowing object that was making some noise. My best description would be that of a jelly fish. Picture a hegh jelly fish in the sky moving as it does in the water. It made some swoching type of sound and looked like everytime it made that sound the tentacles would move and it spit out a light ball that start moving just like the others. Some balls of light were going around the sphere like object while others just seem to go away. Some of the light balls had tails but not all including those that traveled around the object. Then it all just disappeared. I began to watch the sky often and not long after that there was another sighting that was totally different from the first two. This was dark rock shaped object that seemed to travel right over my head. It was hug and had no lights on it. What caught my attention was the balls of lights around it. This object moving southward at a very slow pace when it was over me. The bottom appeared to be rough looking like that of a granite rock. All of a sudden it began to pick up speed not that of a streaking light but faster than what it was. I remember asking myself where are you going and why are you leaving. Then all of a sudden there were about six or seven military planes moving quickly in the same direction and they all just went out of sight. Now I also have other sightings that has some similarity to some the sightings Ive seen on UFO hunters and some the the stories Ive seen here on this site. I will share those later. I hope this shared information will help in future investigations."],"Longitude":"-77.548383","Date of the Event":"10/23/1968 12:00 UTC","Case Number":"43011","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/43011.html.txt","/var/www/straped/mufon/org/43011.html"],"Sighting Duration":"Undisclosed","Object Shape":"Disc, Sphere","Summary":"{dr}I have multiple sightings to share. They were in the late sixties and early seventies.","Region":"Virginia","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","City":"Emporia","Source":"MUFON","Date Submitted":"10/04/2012 01:58 UTC","Object Features":"Other","Latitude":"36.580134"}