{"Country":"United States","Tags":"City","Region":"Michigan","Object Flight Path":"Path with directional change","Case Number":"43012","Date Submitted":"10/04/2012 03:38 UTC","divs":["Sighting Detailsi was with a friend riding a bicke back from the partey store when i just happend to check out the moon . and three orunge lights where moving all arond and i new right away that it was no air plane . these things were moving from one side of the skiey to the other with crazey speed no plane could match! the orunge lights were coming out of a bright red and biger round light in the middle.moving all around up and down across the skiey fast crazey fast! no human could ever stand the Gs these things were pulling! at first i thought i was going crazey but my friend right next to me was seeing everything i was. we both could not beleve what we were seeing but had no choice. it whent on for about 15 min befor they seemd to fly back to the biger red light with blazing speed and merged with it! and after that happend it got so low we lost track of the damn thing! we both looked at each other and sed we would never feel the same after that. i dident hsve my phone on me to get footige . i have seen simailare footige on you tube but all that stuff is just to slow to be the same. but one or to videos i seen were damn close ."],"Latitude":"42.282136","Disposition":"Unresolved","Summary":"{dr}round fast up and down and all around and orunge","Object Shape":"Circle, Sphere, Star-like","City":"Wayne","files":["/var/www/straped/mufon/html2text/43012.html.txt","/var/www/straped/mufon/org/43012.html"],"Source":"MUFON","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","trends":["There has been one other sighting in Wayne","There were no other sightings in Wayne on or around September 20th 2012"],"Longitude":"-83.371462","map":"<A HREF = \"http://maps.google.com/maps?q=42.282136,+-83.371462(43012)&iwloc=A&hl=en\"> mufon case (43012) map </A>","Log Number":"US-10042012-0006","Object Features":"Other","Date of the Event":"09/20/2012 08:30 UTC","Weather Factors":"Unknown"}