{"Date of the Event":"09/29/2012 11:10 UTC","Summary":"{dr}just looked out front window and seen about 10 lights in sky off the clouds not on ground, it was right about the clouds","Tags":"City","Longitude":"-75.06878","divs":["sighting detailsi was about to go to bed i looked out the window, seen lights grabbed my partner to look. it was a little after 11pm and these lights had no reflections off ground seemed above clouds, moving eratically. almost a diagonal then it would like burst outward and then come back in . watched it for atlkeast 10 minutes. grabbed the camera took pictures and video but it was really dark. partner kept telling me it was nothing but i keep remebering it .. never seen anthing like it. it was not a plane, not a helicopter nor anything i ever seen. i then loked the next day and people had video of it online youtube the exact thing i saw but i couldnt get a clear picture.. here is exactly what i saw! please it cant be any beam of ligt from the ground bc i would have seen a light path form ground i believe.... anyway here is exactly what i saw! and i was not the onnly one who seen this!!!!!! please let me know what this is ! [link moved to fi section\\cms\\tg]"],"Object Features":"None","files":["/var/www/straped/mufon/html2text/43020.html.txt","/var/www/straped/mufon/org/43020.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.055551,+-75.06878(43020)&iwloc=A&hl=en\"> mufon case (43020) map </A>","trends":["There have been 216 other sightings in Philadelphia","There were 2 other sightings in Philadelphia on or around September 29th 2012"],"City":"Philadelphia","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Region":"Pennsylvania","Log Number":"US-10042012-0011","Weather Factors":"Unknown","Disposition":"IFO","Object Flight Path":"Path with directional change","Case Number":"43020","Object Shape":"Sphere","Country":"United States","Source":"MUFON","Date Submitted":"10/04/2012 04:35 UTC","Latitude":"40.055551"}