{"trends":["There have been 20 other sightings in Augusta","There were no other sightings in Augusta on or around October 4th 2012","This sighting has been favorited 1 time.",""],"Tags":"City","Object Flight Path":"Stationary","Log Number":"US-10042012-0013","City":"Augusta","Longitude":"-82.017314","Object Features":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.401728,+-82.017314(43022)&iwloc=A&hl=en\"> mufon case (43022) map </A>","Summary":"{dr}Would materialize and dematerialize on film.","divs":["Sighting DetailsI was inside of my house with my little sister when I heard this low, waa waa, noise. I went outside, saw several amber-goldish orbs in the sky, then immediately went to grab my camera, a Fujifilm finepix s4000 camera, set it to record video in 720p HD and hit record. It is important to mention i litterally put brand new AA batteries in it from an 8 pack I had bought earlier. I managed to capture 51 seconds of film before my camera completely died, it was set to record for a maximum of 9 minutes 41 seconds. When I first saw the objects, I thought they might have been radio tower lights from off in the distance on a hill or something, but quickly ruled that out, along with stars, planets, airplanes and helicopters because it was completely overcast AND raining, and had been for several hours prior. These objects were well over 10 degrees over treetops, and I also ruled out the possibility of street lamps because these lights were simply too high. The UFOs hovered near an extremely tall power pole made of steel, (Id estimate about 500 tall) These objects also were over the top of this pole, so higher then 500 altitude. The objects would materialize and then dematerialize with NO sound, NO movement other then blinking in and out. During the sight, It almost felt as if I was being pulled outside to film whatever it was. I dont believe anyone else heard this sound but me, but everyone felt the house shake from it. After the event, I felt the need to express what I had just witnessed to anyone who can relay information about this phenomenon to me. I was watching these objects for exactly 2 hours, 25 minutes, and 29 seconds, I timed it on my telephone under a stopwatch function until they eventually, to be described, as \"turned off their lights,\" they just faded away into the blackness of night. I was startled to see one so close to my house for the first time. This is not the first time I have been privy to witness such an amazing event, but this is the first time they have ever been so close to home."],"Date of the Event":"10/04/2012 03:43 UTC","Region":"Georgia","Sighting Duration":"02:25:29","Country":"United States","Latitude":"33.401728","files":["/var/www/straped/mufon/html2text/43022.html.txt","/var/www/straped/mufon/org/43022.html"],"Case Number":"43022","Disposition":"Unresolved","Weather Factors":"Fog, Rain","Object Shape":"Sphere, Unknown","Date Submitted":"10/04/2012 05:49 UTC","Viewing Distance":"501 Feet - 1 Mile"}