{"Region":"Alabama","Sighting Duration":"Undisclosed","Date of the Event":"10/05/2012 05:12 UTC","Object Shape":"Star-like","City":"Centreville","Object Flight Path":"Path with directional change","Object Features":"Unknown","Longitude":"-87.138607","Log Number":"US-10052012-0005","Summary":"{dr}Bright star like object hovering in sky","Country":"United States","files":["/var/www/straped/mufon/html2text/43038.html.txt","/var/www/straped/mufon/org/43038.html"],"Case Number":"43038","Latitude":"32.944568","Viewing Distance":"Unknown","trends":["There have been no other sightings in Centreville","This sighting has never been favorited."],"Tags":"City","divs":["Sighting DetailsWent outside about 4:48am to take trash bins to street. I was almost to the trash cans, about 15-20 feet from my front door when I noticed a bright star like object moving in my general direction. I instantly ran back to the front steps of my home and grabbed my camera from my bag (I always take my camera outside with me day or night). I tried to focus on the object but it was too far away and too high up to focus on the object. I stood in the driveway and continued to visually track the object as it moved in my direction. I continued to visually track the object as it passed in a north westward direction in front of my home. Since I couldnt focus on the object, I began to flash my camera multiple times to illicit a reaction. The object continued to hover overhead in its flight path before simply going dim. I sat on my front steps and lit a cigarette. About 8 minutes later I again observed the star like object, this time at a lower altitude, much closer to my house, this time moving in a south westward then north eastward flight path. I was able to capture the object on the video setting of my camera (Nikkon 3100). As it continued its flight path I switched to the still frame mode of my camera in an attempt to photograph the object. I was unable to get a still photograph, but as indicated I was able to record the object for about 55 seconds. During the entire event I felt as if the object was aware of my presence. I lost sight of the object only after it passed over a distant tree line. Note. Sightings of this can have been frequent since about June of this year with my family and I as witnesses. Interestingly to note is that this sighting comes exactly 1 month after a major sighting in this state that covered multiple counties an multiple witnesses."],"Disposition":"Unresolved","Source":"MUFON","Weather Factors":"Unknown","Date Submitted":"10/05/2012 11:58 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.944568,+-87.138607(43038)&iwloc=A&hl=en\"> mufon case (43038) map </A>"}