{"Viewing Distance":"Unknown","trends":["There have been no other sightings in columbia","This sighting has never been favorited."],"Object Features":"Other","files":["/var/www/straped/mufon/html2text/43045.html.txt","/var/www/straped/mufon/org/43045.html"],"Log Number":"US-10052012-0012","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Object Shape":"Other","City":"columbia","Latitude":"33.296362","Date of the Event":"12/19/1980 12:00 UTC","Summary":"(dr}it sat still then went dim to brightthen shot off fast","map":"<A HREF = \"http://maps.google.com/maps?q=33.296362,+-93.212749(43045)&iwloc=A&hl=en\"> mufon case (43045) map </A>","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Case Number":"43045","Source":"MUFON","divs":["Sighting DetailsI saw this many times over the years and seem to no when and where to look its like im drawn to look for it.my husband and myself were sleeping one nightin magnolia ak. At our home we woke up to a sound like an airplane coming down with a loud roar waiting on it to crashi buried my head into my husbands backas i felt him stiffen too.the sound stopped-we looed around and it looked like daylight outand then never said one word, we went right back to sleepbut when we woke up in the morning we both jumped out of bed and started yeling what the hell was that last night.it was so weird we never said a word that night.went right back to sleep,but it scared both of us so bad we just stiffened up until we woke up. We told our friends, they laughed and said that was probally dropping us back off.. this has always botherd me, is it possible we were abducted? I was a sceptic till then from 1980 till this day i still the light from time to time and i now live in texas.there is more i can tell you that has happened.just not enough space to do it on here. Thank you,ive needed someone to tell that dont laugh at me."],"Longitude":"-93.212749","Country":"United States","Date Submitted":"10/05/2012 05:47 UTC","Region":"Arkansas","Disposition":"Unresolved","Tags":"City"}