{"Longitude":"-77.854261","map":"<A HREF = \"http://maps.google.com/maps?q=39.300101,+-77.854261(43047)&iwloc=A&hl=en\"> mufon case (43047) map </A>","Case Number":"43047","City":"Ranson","Region":"West Virginia","Disposition":"Unresolved","Object Features":"Other","Object Shape":"Circle","Tags":"City","Date of the Event":"09/29/2012 12:30 UTC","Latitude":"39.300101","Viewing Distance":"Unknown","Source":"MUFON","Weather Factors":"Unknown","Summary":"{dr}Three UfOs one behind the other making s-like movements","files":["/var/www/straped/mufon/html2text/43047.html.txt","/var/www/straped/mufon/org/43047.html"],"Date Submitted":"10/05/2012 09:46 UTC","Object Flight Path":"Other","Country":"United States","Sighting Duration":"Undisclosed","Log Number":"US-10052012-0013","trends":["There have been 3 other sightings in Ranson","There were no other sightings in Ranson on or around September 29th 2012"],"divs":["Sighting Details1. It was around 12:30 pm and my family and I were eating lunch at McDonalds. We were sitting at a booth and I was watching some scavenging birds encircling an open grassy area across the street. 2. I started to look around to get an idea as to how many birds there were and happened to look further up...thats when I noticed three objects following one another making \"s\" like movements in the sky. I initially thought they were more birds but the seemed to be much higher and not flying around in circles. 3. I had to squint a little to make sure my eyes were not playing tricks on me because I noticed that they had no wings or tail. Im guessing they were 500-1000 feet up and moving at a slow, smooth, and steady pace. But, they were one behind the other, only seeing their underside they appeared to be dark gray in color, and were moving as if they were making an \"s\". Not sure of any other way to explain that. 4. I felt awe and disbelief. My mother and brother had seen UFOs before and I never had. I kept trying come up with a logical explanation as to what they could be, but nothing in mind mind could match the description of what I had seen. My significant other doesnt believe in anything like this so I felt I would be much safer explaining this to my mother and brother. 5. I lost sight of the object because it crossed over the building and out of my line of sight."]}