{"Tags":"City","Summary":"{dr}Myself and family members witnessed. 9PMish. I & brother first witnessed along Gulf Blvd. Huge (energy/plasma). They huttled and more followed. All asceneded.","divs":["sighting detailsmyself and family members witnessed. 9pmish (7\\10\\12) at indian rocks beach fl. was not flares nor commercial\\military. this was alive: resembled cell life, plasma or energy. my brother and i (33yrs old & 28 yrs old,) walked a few blocks away from my rental cottage to a pizzeria named \"slyce pizza\", we spoke about things and headed back. within seconds during our walk to the cottage, my brother put his arm before me to stop me and stared up and asked \"what the hell are those?\" i then looked up and new immediately we were witnessing something extraordinary. i reached for my g2 t-mobile cell phone and tried to call, take pictures and video record all at once, i literally forgot how to use my phone. finally i composed myself and managed to video record, and take pictures. i ran back to the cottage and showed everyone my footage. i then went back outside (15 mins later or so) and recorded another orb which came from the same direction and then it disappeared. the first sighting between my brother & i was truly amazing. we witnessed over 10, they sort of hurtled together, then at their left and much higher their were clusters of tiny blinking orbs, it seemed they were communicating. then the larger and closer orbs ascended, they would spontaneously move at great speeds. more followed from a the same flight path. the owner of the cottage rentals also said he saw them which was a few blocks away. during my first sighting i called my family in the cottage and told them to go outside and look towards the left side of the beach and they too witnessed the first sighting (mostly the end and they did witness the second sighting.e 1 hour before my brother & i witnessed the orbs, i was waiting for him on the road at gulf blvd. he was driving in from st petersburg. at the time of my wait, my girlfriend joined me for 15 mins or so. we chatted about things and i said \"it would be nice to see a ufo.\" if i only knew! my brother finally arrived and practically begged me to walk to the pizzeria. i told him i cooked and save his money, but he was relentless so i went with him. had he not convinced me to go, i wouldve missed it. \"i also believe chem-trails are possibly being sprayed to cover the skies because these inner-deminsional beings are here and do not care who sees them.\""],"Case Number":"43056","map":"<A HREF = \"http://maps.google.com/maps?q=27.888024,+-82.850087(43056)&iwloc=A&hl=en\"> mufon case (43056) map </A>","Disposition":"Unresolved","Object Shape":"Disc, Sphere, Unknown","Region":"Florida","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Flight Path":"Path then hovering","Longitude":"-82.850087","Log Number":"US-10062012-0006","Date Submitted":"10/06/2012 08:34 UTC","Object Features":"Unknown","Viewing Distance":"21-100 Feet, 101-500 Feet, Unknown","trends":["There have been 2 other sightings in Indian Rocks Beach","There were no other sightings in Indian Rocks Beach on or around August 10th 2012"],"Date of the Event":"08/10/2012 09:10 UTC","Source":"MUFON","Latitude":"27.888024","files":["/var/www/straped/mufon/html2text/43056.html.txt","/var/www/straped/mufon/org/43056.html"],"City":"Indian Rocks Beach","Country":"United States"}