{"Disposition":"Unresolved","Object Flight Path":"Straight-line path","Summary":"{dr}Stealth Bomber shape, 300-550 Ft high, seemed 15-25 Ft wide, quiet","Object Shape":"Boomerang","Case Number":"43054","Longitude":"-122.088718","Source":"MUFON","Country":"United States","divs":["sighting detailsi was on my back porch around 11 pm smoking a cigarette on 10\\5\\2012. i live in hayward, ca. i look up and see out of the north or northwest and coming my direction a strange flying wing shaped object, like a stealth bomber is shaped. it was dark colored, maybe black or dark grey, but around the edges it seemed to not show lights but reflect sort of, sort of a shimmering of light, maybe from the street light or maybe from the object itself. i dont know. it also had this weird sort of \"wobbling\" haze or distortion around the outer edges. it was completely quiet, not a sound at all. i only saw it for around 5-8 seconds and then it flew out of my view (trees blocked view). at first i thought it might be a bird but the only birds around here that fly like that at night are big white herons (or egret, im not sure what kind of bird they are, we have them at the hayward shoreline). when i see the birds they are plainly birds and flying maybe 100-200 feet high. as i was watching it i was compelled to blink my eyes and shake my head a little just to make sure i wasnt seeing things. this was definitely the weirdest thing i have ever seen fly overhead."],"trends":["There have been 14 other sightings in Hayward","There were no other sightings in Hayward on or around October 5th 2012"],"Tags":"City","Date of the Event":"10/05/2012 11:00 UTC","files":["/var/www/straped/mufon/html2text/43054.html.txt","/var/www/straped/mufon/org/43054.html"],"Sighting Duration":"Undisclosed","Log Number":"US-10062012-0004","map":"<A HREF = \"http://maps.google.com/maps?q=37.665312,+-122.088718(43054)&iwloc=A&hl=en\"> mufon case (43054) map </A>","City":"Hayward","Object Features":"Wings","Latitude":"37.665312","Date Submitted":"10/06/2012 03:06 UTC","Weather Factors":"Unknown","Region":"California","Viewing Distance":"101-500 Feet"}