{"Summary":"{dr}cigar shaped object silverish in color observed for 5-9 mins, disappeared","Log Number":"US-10062012-0002","map":"<A HREF = \"http://maps.google.com/maps?q=45.082332,+-123.423451(43051)&iwloc=A&hl=en\"> mufon case (43051) map </A>","Longitude":"-123.423451","trends":["There have been no other sightings in Sheridan","This sighting has never been favorited."],"Tags":"City","files":["/var/www/straped/mufon/html2text/43051.html.txt","/var/www/straped/mufon/org/43051.html"],"Viewing Distance":"Over One Mile","Object Features":"Insignia","City":"Sheridan","Disposition":"Unresolved","Date Submitted":"10/06/2012 01:39 UTC","Latitude":"45.082332","Country":"United States","Date of the Event":"10/05/2012 09:55 UTC","Weather Factors":"Unknown","divs":["Sighting DetailsMy brother was driving, I was in the passenger seat heading to the coast. I noticed an object to my right(NW)and mentioned to my brother that it looked odd...like a cigar that was silver with no apparent wings...UFO...ha ha. My brother acknowledged seeing the object and continued to drive. I observed the object for 5-9 mins in my side passenger window move to the front windshield in plain view to both my brother and I. I was drinking a coffe at the time and when I took another sip and looked out to see the object...it was gone completely. I only took my eyes off the object for about 5 seconds at the most. It was directly in front of my view, and then was gone. We scanned the sky to see where it may have gone but neither of us could see it again. I dont know what it was, but it did not have the characteristics of a plane or helicopter. I have never before seen anything like this nor have I ever seen anything just vanish from my view. I was skeptic, and still am. I really dont know what to think. One second it was right there, the next it was gone. I would like to know what it may have been."],"Object Flight Path":"Straight-line path","Object Shape":"Cigar","Region":"Oregon","Sighting Duration":"Undisclosed","Case Number":"43051","Source":"MUFON"}