{"Case Number":"43052","Disposition":"Unresolved","Longitude":"-118.321525","Log Number":"US-10062012-0003","files":["/var/www/straped/mufon/html2text/43052.html.txt","/var/www/straped/mufon/more/43052_submitter_file1__BoomerangUFO.jpg","/var/www/straped/mufon/org/43052.html"],"Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Boomerang","Object Features":"None","Region":"California","Source":"MUFON","trends":["There have been 39 other sightings in Burbank","There were no other sightings in Burbank on or around October 5th 2012","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Country":"United States","Object Flight Path":"Hovering then path","Summary":"{dr}Boomerang UFO in Broad Daylight","Latitude":"34.190242","Date Submitted":"10/06/2012 01:49 UTC","Tags":"City","Date of the Event":"10/05/2012 04:55 UTC","divs":["Sighting DetailsI was taking a break from writing and went out to our rooftop for some fresh air ,which has an excellent view of the mountains north of Burbank. I saw this white object in the sky. It was very apparent. At first I thought maybe an airplane but it didnt appear to be moving so I called my wife. We grabbed our cameras and began to take video and photos of the object. I expected to see an airliner in the pictures, but it wasnt. It hovered in one spot for about 5 minutes, and then headed Northwest over the mountains. It was communicated to me, telepathically, that an orb had been released. It wasnt until we reviewed our photos later that we actually saw the orb in a photo. I felt calm and excited, as I have a connection with them and see craft frequently. Just the night before I saw a large craft hover silently over me without any lights while I was walking my dogs. This was the first time I ever caught them on camera and I wanted to share. We lost sight of the object when it was very distant from us. I am not sure if it dematerialized or just left my range of sight."],"map":"<A HREF = \"http://maps.google.com/maps?q=34.190242,+-118.321525(43052)&iwloc=A&hl=en\"> mufon case (43052) map </A>","City":"Burbank"}