{"Country":"United States","Weather Factors":"Unknown","Disposition":"Unresolved","City":"Harrisburg","Tags":"City","Log Number":"US-10062012-0016","Case Number":"43067","divs":["Sighting DetailsIt was 11pm and I was sitting in front of my computer that in front of my window watching a movie online when I noticed what looked like a star in the sky. I really didnt think anything of it for a minute or two but it just started to bug me for some reason and I found myself just staring at it. It only took 3 mins for me to notice that this star was the only one in the sky and by all logic that should be impossible you should be able to see more stars and be able to make out star formations. I sat watching it then I started to notice it was moving extremely slowly like if I was to use a term the pace of a snail but what made me really curious was that it would pulsate. It was like it would get bright for a second then get dim and dimmer until it just completely disappeared. At this point my mind was trying to disprove what I was seeing, I thought if this is really a star and it just clouds passing by then it would reappear but it didnt it was gone. It disappeared for 10-13 minutes then just suddenly reappeared out of nowhere. I then thought ok it might really be a star but the position it was in had changed it was much farther and higher then before but again I looked at it very carefully and it dimmer this time and it seemed to keep moving very slowly higher at that point I noticed something I didnt the 1st time as the moon rose it rose at the exact same position. I went to get a 12inch ruler to make sure and it line up perfectly as the moon rose I think I watch this for more then 20 mins before it disappeared again this time it didnt reappear."],"Longitude":"-76.875418","Latitude":"40.27619","Date of the Event":"10/06/2012 11:04 UTC","Date Submitted":"10/06/2012 11:49 UTC","Object Features":"None","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Other","Viewing Distance":"Unknown","Object Shape":"Star-like","Summary":"{dr}Glowing star-like object that pulsated then dimmed, then disappeared then reappeared higher then before.","Region":"Pennsylvania","trends":["There have been 26 other sightings in Harrisburg","There were no other sightings in Harrisburg on or around October 6th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.27619,+-76.875418(43067)&iwloc=A&hl=en\"> mufon case (43067) map </A>","files":["/var/www/straped/mufon/html2text/43067.html.txt","/var/www/straped/mufon/org/43067.html"],"Source":"MUFON"}