{"map":"<A HREF = \"http://maps.google.com/maps?q=30.08463,+-95.41049(43064)&iwloc=A&hl=en\"> mufon case (43064) map </A>","trends":["There have been 18 other sightings in Spring","There were no other sightings in Spring on or around September 14th 2012"],"Log Number":"US-10062012-0013","Object Features":"None","Viewing Distance":"Over One Mile","Case Number":"43064","Date of the Event":"09/14/2012 10:00 UTC","Object Flight Path":"Straight-line path","Sighting Duration":"00:01:00","Latitude":"30.08463","divs":["sighting detailsi was in my backyard a few weeks ago about 10 pm and spotted a bright white light with a blinking white light. my wife has seen the same thing 4 other times. it always appears in the same location, it comes from the south and flies north. i am a commercial pilot and fly for a major airline. i live close to houston bush intercontinental airport. i know what an airplane looks like flying in the night sky and this was no airplane. it had no navigation or red beacon lights as all airplanes are required to have. when i first saw it i thought it was the international space station or a satellite (i have seen both from my backyard many times). this was bigger, about the size of an aspirin. then i saw the flashing white light and thought it was an airplane but it had no red\\green navigational lights. i see airplanes flying at low and high altitude from my backyard and you can see the navigational lights and know that its an airplane. this was totally different. im wondering if it is some kind of spy drone. it made no noise and it was difficult to judge the altitude but i would guess it was at least 50,000 ft. it was traveling in a straight line and about the speed of a satellite. i lost sight of it as it flew over the horizon and behind the trees. we look for it almost every night. my wife tried taking pictures but its too high in the sky to get a clear shot of it. i wish i had a camera with a high power telescopic lens."],"City":"Spring","Summary":"{dr}bright white light with flashing white light. Traveling in straight line from south to north.","Source":"MUFON","Tags":"City","Longitude":"-95.41049","Region":"Texas","Date Submitted":"10/06/2012 06:46 UTC","files":["/var/www/straped/mufon/html2text/43064.html.txt","/var/www/straped/mufon/org/43064.html"],"Country":"United States","Object Shape":"Circle, Star-like","Disposition":"Unresolved","Weather Factors":"Unknown"}