{"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/43077.html.txt","/var/www/straped/mufon/org/43077.html"],"Region":"Alberta","Date Submitted":"10/07/2012 12:27 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=53.260789,+-113.579852(43077)&iwloc=A&hl=en\"> mufon case (43077) map </A>","Case Number":"43077","divs":["Sighting DetailsLast night, Saturday, October 6, 2012, I was driving my sister and my nephew home after our Thanksgiving dinner at about 8:15pm. My nephew, who is 5, asked what the bright orange light was that was just sitting in one spot in the sky. It looked like it was either coming straight toward us or staying in one spot so we thought maybe it was something crashing (looked like it was on fire) or maybe even a meteor that would end it all. But then it moved to the east a bit and got really big and bright, then it looked like it slowly went back into the sky and then just disappeared. We thought maybe it disappeared behind some clouds...but there weren't any clouds, we could see all the stars! 2 minutes later when we got to my sister's place, it reappeared! But this time it was closer and moving north east across the sky very slowly and it was definitely a circle shape. It was round with one brighter light on the outer edge of the circle that was rotating around. The very centre of the object was dark...so it looked like a donut. It went across but went behind some trees so we couldn't see it anymore so we're not sure how it left after that. We told my nephew it was probably a hot air balloon to not scare him and sent him inside. Needless to say, we were pretty freaked out. Where we saw it was not even 10km away from the Edmonton International Airport, but it was definitely not an airplane. How would the airport not detect such an object in their flying space? I don't know."],"Tags":"City","Object Features":"Unknown","trends":["There have been 2 other sightings in Leduc","There were no other sightings in Leduc on or around October 6th 2012"],"Viewing Distance":"501 Feet - 1 Mile","Longitude":"-113.579852","Date of the Event":"10/06/2012 08:15 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path","Object Shape":"Circle, Disc","Log Number":"CA-10072012-0010","Weather Factors":"Unknown","Summary":"Round bright orange object flying across Leduc, AB. Had one flashing light on outer edge that rotated around.","Source":"MUFON","City":"Leduc","Country":"Canada","Latitude":"53.260789"}