{"Disposition":"Unresolved","Country":"United States","trends":["There have been 5 other sightings in Rock Hill","There were no other sightings in Rock Hill on or around October 7th 2012"],"Sighting Duration":"00:10:00","City":"Rock Hill","Region":"South Carolina","Date Submitted":"10/07/2012 11:54 UTC","Summary":"{cak} upside down shaped triangle with 9 blue lights around edge and 1 red in middle","Source":"MUFON","Date of the Event":"10/07/2012 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.942339,+-80.989082(43076)&iwloc=A&hl=en\"> mufon case (43076) map </A>","Log Number":"US-10072012-0009","files":["/var/www/straped/mufon/html2text/43076.html.txt","/var/www/straped/mufon/org/43076.html"],"Object Features":"Unknown","Longitude":"-80.989082","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Tags":"City","Weather Factors":"Unknown","Object Shape":"Triangle","divs":["Sighting DetailsMy sister, a friend of mine B, and myself were getting ready to go into a bar for the night. B and I were walking a bit faster than my sis and so I told B lets for her. When we turned around to call for my sis, in the sky were very bright blue lights, and we asked each other what the bleep is that??? There were people that were coming out of the club that were all pointing and asking if everyone was really seeing this. At least 10 people were out there watching. Okay so at first when we sighted it, it is an upside down triangle shape and is only showing 9 bright blue lights around the edge of the object, suddenly a bright red light appeared in the middle, it wasnt moving just stationary. All of a sudden the blue lights were blinking in what seemed to be a random pattern, then the red light began blinking. At times all the lights would completely stop, sometimes we thought it even disappeared, this all continued as it moved... The movement was super slow, first up higher in the sky, then back lower. At this time we were like okay maybe its a tower... but then it moved from left then right, and came back to its original position, remember blinking randomly off and on through all of this action. And then all lights stayed on and it descended into the treeline. So everyone that was gathered by this time were all completely blown away with what we had just witnessed. Several people tried to get video and pictures and were mostly saying you couldnt see it on the screen. I have always been a huge skeptic of UFO or Alien anything but now I just dont even know how to express how I feel about it and definitely believe there is something out there and were not alone... I plan to try and go back once I think I can handle it and look for more evidence on the ground. I was so freaked I called 911 and the dispatch listened and believed me and told me to tell the police, when I was connected with them, where I thought it may have landed. When I explained to the police they said it wasnt a police issue. So now Im here sharing with you my story of my first UFO sighting."],"Case Number":"43076","Object Flight Path":"Stationary,Straight-line path,Path with directional change","Latitude":"34.942339"}