{"Source":"MUFON","files":["/var/www/straped/mufon/html2text/43078.html.txt","/var/www/straped/mufon/org/43078.html"],"Longitude":"-77.300012","Object Shape":"Star-like, Unknown","Log Number":"US-10072012-0011","Sighting Duration":"00:05:00","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=43.148175,+-77.300012(43078)&iwloc=A&hl=en\"> mufon case (43078) map </A>","Object Features":"Unknown","Disposition":"Unresolved","trends":["There has been one other sighting in Walworth","There were no other sightings in Walworth on or around October 6th 2012"],"Date of the Event":"10/06/2012 10:30 UTC","Case Number":"43078","Region":"New York","City":"Walworth","Tags":"City","Summary":"{cak} 3 red objects traveling east over Walworth, NY","Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile","Latitude":"43.148175","Date Submitted":"10/07/2012 12:30 UTC","Weather Factors":"Windy, Medium","divs":["Sighting DetailsI was traveling south down route 350 in Walworth on my way home. I saw a red light pulsating in the sky to my left and ahead of me. I then saw a second red pulsating light to my right and ahead of me. I watched the two when I saw a third one coming from west to east behind the second. By this time I had reached Gananda and Waterford Rd so I turned right and pulled over to the side of the road. I tried to video the third object as it went over me on my iPhone, but it is not very good quality as the image seems so small you cannot really see it. As it disappeared behind me and out of sight due to the street light at the entrance of Gananda I got back in the car. I then saw a fourth object coming over on the same path as the first three. I watched it as I drove home and lost sight of it when I pulled in my driveway. The objects were all red and pulsating. It just looked like light and sometimes they would disappear from sight and then re appear. I mentioned it effected me because I felt very tingly and had tons of energy after I saw them. I was on my way home from work and was actually very tired and wanting to just go to bed. They did not seem to be too high over me, but I can say that they made no sound at all. The video I took I would be happy to submit but would prefer it not be public."]}