{"Weather Factors":"Unknown","trends":["There has been one other sighting in Kiel","There were no other sightings in Kiel on or around August 11th 2012"],"files":["/var/www/straped/mufon/html2text/43075.html.txt","/var/www/straped/mufon/org/43075.html"],"Log Number":"DE-10072012-0008","Case Number":"43075","Object Flight Path":"Path with directional change","Date Submitted":"10/07/2012 11:47 UTC","Date of the Event":"08/11/2012 11:30 UTC","Latitude":"54.295603","Object Features":"Unknown","Disposition":"Unresolved","Summary":"White, silent object moved slowly over city and then slowly turned east and disappeared into atmosphere.","Region":"Schleswig-Holstein","Source":"MUFON","Country":"Germany","Sighting Duration":"Undisclosed","City":"Kiel","divs":["Sighting DetailsMy wife and I had just returned home to our apartment in the city of Kiel, Germany. I was excited because the Perseid meteor showers were peaking and therefore I wanted to stay outside and see if I could catch a glimpse of a meteorite or two. I did a little research in the upstairs portion of the apartment to see exactly where I should look for the meteors. I determined I should face my chair to the West and look directly up into the heavens. I then went outside at around 10:15 P.M. or so. Looking into the sky I found the meteors to be shooting at about 2-5 per 10 minutes and their displays were weak due to the lights of the city polluting the viewing space. There were, however, a few good ones and I decided to call my wife from the living room so she could witness a couple falling. My wife came out of the house at roughly 11:10 P.M. and lit a cigarette. By this time I had moved the chairs so that they faced in a southerly direction. I instructed her to look straight up for the best chance of viewing a meteor but she increasingly grew bored and was looking forward more than up. I then got up to put two cigarette butts into the ashtray and as I looked down my wife became very excited. \"Look! There's one!\" she exclaimed. I looked to the southern sky and passing past the corner of the house was a bright, shining light about the size of a golf ball. I instantly dismissed it as an aircraft and laughed. Then I looked again and the object was flying too slow to be an aircraft. The light was not of electric nature as it was constantly illuminated, never flickered and penetrated the atmospheric obscurities with an impressive nature. The object was completely silent and was flying a direct course to the east. After 1-2 minutes the object past in the line of sight of a tree in our yard. We then changed our positions and began facing the east. At this point in time, the object shifted direction and made what appeared to be a 10-15 degree shift. It did not turn like a plane, it simply glided into the new direction of true east (verified later by compass). The object kept its luminosity and silent status during this time. After another minute and half or so the object appeared to accelerate and within the blink of an eye it ascended into the heavens leaving only a faint light trail that disappeared almost instantly. I am a Meteorologist and she is a Psychologist, and in this instant all of our possible scientific explanations were being discussed. In the time since we have both researched and studied in our free time what exactly could have happened and nothing really fits. This incident was not only strange, but also simply unexplainable by normal scientific solutions. The object was grow"],"Tags":"City","Longitude":"10.156206","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=54.295603,+10.156206(43075)&iwloc=A&hl=en\"> mufon case (43075) map </A>"}