{"files":["/var/www/straped/mufon/html2text/43086.html.txt","/var/www/straped/mufon/org/43086.html"],"Longitude":"-74.98308","Region":"Pennsylvania","Source":"MUFON","City":"Feasterville-Trevose","Weather Factors":"Unknown","Disposition":"Unresolved","Date of the Event":"09/07/2012 08:30 UTC","Object Features":"None","divs":["sighting detailsa friend and i were in my backyard chatting when we noticed two glowing red orbs appear a bit below normal plane level in the middle of the open sky. it was a starry night with no clouds. shocked, i took out my cell phone and began filming. my friend also took his out but his camera was worse than mine and couldnt get much of an image so he stopped recording. i began recording about 15 seconds into the event. when i first saw the objects i had no idea what they might be or how to describe them besides a brilliantly glowing set of red\\orange orbs. my friend who was with me has a bit of a science background and about a minute into the event he began speculating that we could be looking at some sort of plasma. at first i thought my video was poor quality due to the obviously terrible lighting conditions. but after doing much research i think i may have actually gotten some valuable footage due to the relatively close proximity of the object to me and my smartphone having a half decent camera. whereas most videos i have seen the objects appeared to be much further away. how i wish i had a better camera around. the movement of the objects appeared very strange. one appeared to be motionless and hovering in place. while the other began to slowly circle it like the hand of a clock going counter clockwise. at first the objects had a steady unwavering glow and after about 2 minutes began to flicker out of both eye and camera sight. the camera doesnt do justice to the brilliant glow of these objects. after much research i am convinced that what i saw was certainly neither a military flare or a sky lantern. i am posting this in hopes that i might aid to a real investigation into this world wide phenomenon. apparently pennsylvania is one of the hottest areas for this kind of activity from what i have read. thanks in advance to any investigators who dedicate some of their time from this and any information would be greatly appreciated. lets find out what is in our skies! p.s. sorry about all the profanity in the video, i was freaked out\\excited and didnt realize how much i started cursing."],"Latitude":"40.158464","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"00:02:15","Date Submitted":"10/08/2012 01:20 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.158464,+-74.98308(43086)&iwloc=A&hl=en\"> mufon case (43086) map </A>","Tags":"City","Object Flight Path":"Stationary,Hovering then path","Summary":"{cak} Two glowing red orbs hovering over a field near my home captured on video","trends":["There have been 3 other sightings in Feasterville-Trevose","There were no other sightings in Feasterville-Trevose on or around September 7th 2012","This sighting has been favorited 1 time.",""],"Object Shape":"Circle, Fireball","Case Number":"43086","Log Number":"US-10082012-0003"}