{"Country":"United States","Object Shape":"Circle","Case Number":"43082","Date Submitted":"10/07/2012 07:10 UTC","trends":["There have been 12 other sightings in St Charles","There were no other sightings in St Charles on or around October 6th 2012"],"Disposition":"Unresolved","Date of the Event":"10/06/2012 10:20 UTC","Log Number":"US-10072012-0015","Longitude":"-88.311389","files":["/var/www/straped/mufon/html2text/43082.html.txt","/var/www/straped/mufon/org/43082.html"],"Tags":"City","Sighting Duration":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.918889,+-88.311389(43082)&iwloc=A&hl=en\"> mufon case (43082) map </A>","City":"St Charles","Latitude":"41.918889","Weather Factors":"Unknown","divs":["Sighting DetailsI was coming home from attending church and having donner with friends afterwords. Entering my neighborhood, I noticed other neighbors stopped in the middle of their driveway and the road. I then looked up and saw about 7-9 bight red lights in the sky,red unlike any aircraft I had ever seen. There were no other colors or blinking lights common with aircraft, only red. As I got to the back of my neighborhood where we abutt corn fields for about 1.5 miles, I had clear view and in addition to the origonal 7-8 I counted 7 more red light lined up in row almost exactly where southbound commercial jets line up to descend, turn east the land at OHare airport. The ones I first saw did not appear to move at all. The ones on row form barely moved and looked to be much closer together then any commercial jets would ever normally be in that flight path. I stopped the car and tryed to take some pictures with no success. I have watched many jets come in and these lights apeared to be barely moving. They may have been farther off then I thought, but in compairing to the size of the lights I saw and the many commercial jet lights I have watched, the red lights should have turned to the east to land at OHare but never did. They lights were very distinct and bright,glowing not illuminating or spotting out. as I watched the row to try and determine how much they were moving, if moving at all, a bank of clouds moved in from the east and I lost sight of the lights in a moment. I dont think there was much wind at ground level, not too many stars in sight, and I dont remember any other air traffic at that time. My first reaction was enjoying the lights and thinking that they may be military helicopters that would come thundering past. Then I wondered if this was some military operation gaurding the skys for Obama while he campained somewere. I do not believe in ufos so my intention after seeing these lights was to get the facts. I have scoured the web for more info and found slightly similar reports but not many. I did talk to one ufo hotline and they said there were many reports across the glob similar to mine. Maybe some star exploded, I dont know. I am just looking for facts."],"Object Features":"Unknown","Object Flight Path":"Stationary","Viewing Distance":"Over One Mile","Region":"Illinois","Summary":"{cak} I saw 14-15 red lights over the far west suburbs of Chicago last night."}