{"Disposition":"Unresolved","Object Shape":"Unknown","Sighting Duration":"Undisclosed","Country":"United States","Weather Factors":"Unknown","Source":"MUFON","Object Flight Path":"Stationary","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Unknown","trends":["There have been 17 other sightings in Thousand Oaks","There was one other sighting in Thousand Oaks on or around June 17th 2009"],"Summary":"{cak} Large low hovering object with only part of the object in visable. The rest was glared out somehow.","Case Number":"43081","files":["/var/www/straped/mufon/html2text/43081.html.txt","/var/www/straped/mufon/org/43081.html"],"Latitude":"34.220678","map":"<A HREF = \"http://maps.google.com/maps?q=34.220678,+-118.855684(43081)&iwloc=A&hl=en\"> mufon case (43081) map </A>","Longitude":"-118.855684","Date of the Event":"06/17/2009 12:00 UTC","Region":"California","Log Number":"US-10072012-0014","Tags":"City","divs":["sighting detailsi was driving home (it was three years ago, so dont even remember the date, but reading a similer post from 2009 in the same area, was reasured that i wasnt the only one who saw it). as i came up a rise in the the road, my eyes caught a glare like a \"glimmer\" in the sky closely above the houses to my left. about 1\\2 a football distance away from me above the houses, i saw a part of an odd object that didnt seem to belong there in the sky. (it was only a portion of the whole object though, like viewing a giant side panel which was the length of an entire house and the rest being sort of phased out or faded into the blue sky) very low, and floating or hovering (barely moving in an east direction - super slow). it was dark and varied in patches of greys like gun metal panels melded together. it had no smooth edges or surface like our modern day airplanes! i said out loud to myself upon seeing it; \"what the heck?!\". i caught myself swerving, so corrected my wheel, slowed down and looked again, it was gone! i thought it moved over the ridge, so i stepped on it, and drove up to the top of the hill quickly, thinking that it was so big, i would surely see it over the hill - but it was gone! i remember feeling chills and having a racing heart when i saw it! i was shocked, but not afraid. i only saw it for about 4 or 5 seconds at most, but being an artist, have a trained eye for detail. will submit a drawing or more details upon request."],"City":"Thousand Oaks","Object Features":"Patterned Surface","Date Submitted":"10/07/2012 07:00 UTC"}