{"Region":"Vilnius Region","Viewing Distance":"101-500 Feet","Country":"Lithuania","divs":["Sighting DetailsAt around 7:27 P.M. I noticed a small light come up over the hill due south of my apartment. There is a major airport in that direction, but the light was not on the usual flightpath and looked wrong. There were no blinking lights. I observed it rise over that hill and waited to see if aircraft lights would become visible as it changed angle. At this point it changed direction slightly so as to fly straight toward my apartment building. It moved too rapidly to be an airplane and as it neared it was clearly not a plane: it was too low in the sky, against a backdrop of low clouds, it was too fast, and it had no blinking lights. The next thought was that it might be a Chinese lantern, a candle attached to a paper bag, but it moved much faster than the breeze and wasn't appreciably high, didn't seem high enough to catch any winds not apparent at ground level. As it neared it was clearly a small orb of light, and I thought I saw a dark triangle above it in the darkening sky, but couldn't resolve that. There were no wings or other protruding structures as far as I could make out, and it was still light enough to be able to see such things. It consisted purely of an orb which had a flickering quality like candlelight, and I happened to have a candle lit on my desk next to the window which reinforced that impression. My next thought was it might be a meteor, so I decided when it passed over the roof to go to the living room and try to observe its path for impact or dissolution from the balcony. On the balcony it appeared directly overhead and had a sprt of fulminous, redder core surrounded by a corona or halo of more diffused orange light. It traveled due north less than 500 feet above the ground, and probably more like 200 feet. After a few seconds it began to flicker more, and then bobbed out, still below the clouds. It then relit itself, or blinked several times before disappearing in the distance. It did not extinguish itself in the manner of a shooting star nor did it appear to be losing altitude at all. It appeared to be changing to a higher altitude when it was no longer observed. About a minute later I heard a jet coming in for a landing at Vilnius International Airport, traveling the normal flight path roughly from the NW to the SSE. I had no special feelings about the object, except I wondered whether it had somehow turned in order to fly over me, and I wondered why it flickered out when it did, exactly when I said to a fellow observer that it might disappear soon. When I noticed it I wondered if it were a UFO and thought about filming it, but decided to merely observe instead. My only action was to cross the apartment to the balcony and observe it, and to alert two other people with whom I live of the object. Both observed it as well. One felt it must be a military aircraft. I pointed out there was no sound at all, and apparently no wings or helicopter rotors. My feeling is it was either ball lightning, a silent-running drone aircraft with non-regulation lights or another red-orange orb of unknown origins currently being reported around the world. There was no missing time or anything of that nature, and home electronics appeared unaffected."],"Case Number":"43080","Sighting Duration":"Undisclosed","Summary":"A reddish-orange light appeared behind apt bldgs approx 1 km due S, climbed, changed direction to fly over my apt bldg then disappeared to N in series of flickers below clouds in overcast sky. As it was directly overhead seen with corona and core.","Longitude":"25.280024","Date of the Event":"10/07/2012 07:27 UTC","Weather Factors":"Unknown","City":"Vilnius","Latitude":"54.689386","Date Submitted":"10/07/2012 05:58 UTC","Log Number":"LT-10072012-0013","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=54.689386,+25.280024(43080)&iwloc=A&hl=en\"> mufon case (43080) map </A>","files":["/var/www/straped/mufon/html2text/43080.html.txt","/var/www/straped/mufon/org/43080.html"],"Source":"MUFON","Object Shape":"Fireball, Sphere","trends":["There have been no other sightings in Vilnius","This sighting has never been favorited."],"Object Flight Path":"Path with directional change","Tags":"City","Object Features":"None"}