{"Tags":"City","Log Number":"US-10082012-0003","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around October 7th 2012"],"Case Number":"43085","Region":"Arizona","Object Flight Path":"Straight-line path","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/43085.html.txt","/var/www/straped/mufon/org/43085.html"],"Viewing Distance":"Over One Mile","Latitude":"32.227593","map":"<A HREF = \"http://maps.google.com/maps?q=32.227593,+-110.919169(43085)&iwloc=A&hl=en\"> mufon case (43085) map </A>","City":"Tucson","Object Shape":"Unknown","Summary":"{cak} Very faint, 2nd time witnessed, crosses sky much faster than plane, 1st time direction nw disappeared behind clouds","Sighting Duration":"Undisclosed","Country":"United States","Longitude":"-110.919169","Source":"MUFON","Weather Factors":"Unknown","Date Submitted":"10/08/2012 12:31 UTC","divs":["Sighting DetailsThe first time I saw the speck of light was either the 3rd or 4th of September at about 8:15pm. I was walking my dog out by the desert and I just happened to be starring at the sky. I noticed what I thought was a faint star on the southeast horizon moving. It was so faint that I wasnt sure if I had imagined it or not. I kept looking in the direction of the object but with more focus now and I found it again. It flew in a straight path heading nw. I would loose behind the clouds occasionally but then pick it up on the other side. I finally lost it in the glow of Tucsons city lights about 30 seconds after I first spotted it. I figured it wasnt an airplane because the light didnt flash and it appeared to be so high. It looked like the faintest of stars moving across the sky. I figured it must have been a satellite, however, I was told the next day that satellites appear stationary in the sky. Anyhow, 30 seconds or so seems like a long time so I waited for what I knew to be a plane to come into view just to time its flight across the sky. Once I found a plane it appeared to be much closer but still remained in my field of view well over a minute before I stopped timing it. Ive been looking in the sky every night since the 1st sighting and tonight I saw it again. This time I could only see it for 11 seconds and instead of loosing it in the lights of the city, it just disappeared. It was heading in the opposite direction and cleared a quarter of the sky in that time period. I tried to film it with my phone this time but it was too faint. As excited as I was to see it again, I started to wonder what the chances are that a person gets to see a UFO twice. I dont know what it was but Im very skeptical that it was a plane. However, I do live next to a military base so perhaps it was so high altitude spy plane whose afterburners were glowing like the SR71."],"Disposition":"Unresolved","Date of the Event":"10/07/2012 07:44 UTC"}