{"trends":["There have been 134 other sightings in Kansas City","There were no other sightings in Kansas City on or around October 7th 2012","This sighting has been favorited 1 time.",""],"Object Features":"Unknown","Latitude":"39.288307","Sighting Duration":"Undisclosed","Country":"United States","Log Number":"US-10082012-0001","City":"Kansas City","divs":["sighting detailsi was walking south on the west side of the adt call center when i saw what i first thought were fireworks above the baseball game at tiffany hills park. i noticed these lights were not falling and disintegrating. they were balls\\orbs of yellow-orange light. they hovered for about 20 seconds. after this they began moving as a unit to the west, some of the lights would move and alter the original formation. the lights would dim to the point of being almost completely invisible, blending in with the cloud behind it. after about 10 seconds of being nearly invisible, the lights gradually illuminated. after reaching full illumination they began moving eastward, again as a unit. they moved back over the tiffany hills park area and slowly climbed in elevation. they would then climb back down in elevation some, and reascend. this happened for another 30 seconds or so, reaching a higher elevation upon each ascent. during this eastward move the lights would more frequently dim and illuminate. towards the end of the sighting they had moved southeastward and were impossible to see, due to the fact that the lights had again turned off and they were so far away. they were miles away from me the last time i could see them. i had never seen anything like this. they were definitely not collection of airplanes, and they looked to cover hundreds of feet of sky space."],"Region":"Missouri","Date Submitted":"10/08/2012 12:01 UTC","files":["/var/www/straped/mufon/html2text/43084.html.txt","/var/www/straped/mufon/more/43084_submitter_file1__ufo.png","/var/www/straped/mufon/org/43084.html"],"Source":"MUFON","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.288307,+-94.671533(43084)&iwloc=A&hl=en\"> mufon case (43084) map </A>","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Disposition":"Unresolved","Summary":"{cak} About 30 yellow-orange lights moving as a unit, sometimes changing formation hovering, moving west, then east, and changing elevation and direction. Lights would sometimes dim, then turn back on slowly, occured over Tiffany Hills Park during a game","Case Number":"43084","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Date of the Event":"10/07/2012 08:05 UTC","Object Shape":"Other, Unknown","Longitude":"-94.671533"}