{"Latitude":"54.898805","Date Submitted":"10/08/2012 04:16 UTC","Case Number":"43094","Tags":"City","Date of the Event":"10/08/2012 07:20 UTC","Log Number":"GB-10082012-0011","files":["/var/www/straped/mufon/html2text/43094.html.txt","/var/www/straped/mufon/org/43094.html"],"Country":"United Kingdom","Longitude":"-1.426312","Object Flight Path":"Path then hovering","City":"Sunderland","Weather Factors":"Unknown","Sighting Duration":"00:04:00","Source":"MUFON","trends":["There have been 8 other sightings in Sunderland","There were no other sightings in Sunderland on or around October 8th 2012"],"Region":"","divs":["Sighting DetailsWhere were you and what were you doing at the time? I was going downstairs in my home. What made you first notice the object? The very bright Orange light it gave off. What did you think the object was when you first noticed it? An aircraft Describe the object and its actions and motions in detail. It came from the North and had a slightly curved flight path. It was travelling at an impressive speed and then vanished from view, I then went in to my back garden and could observe the object that was stationary for about 10 seconds and then slowly moved out of view. Describe your feelings, reactions and actions, during and after sighting the object. I was baffled and very interested. I was trying to figure out what it could have been but I haven't reached a conclusion. How did you lose sight of the object? It slowly moved out of view relative to the position I was standing by going over the roof of my home. I then ran through the house which took about 10 seconds and was nowhere to be seen, the night is very clear and there's no wind at all. The object still had the brightness it did when I first seen it."],"map":"<A HREF = \"http://maps.google.com/maps?q=54.898805,+-1.426312(43094)&iwloc=A&hl=en\"> mufon case (43094) map </A>","Viewing Distance":"Unknown","Object Features":"None","Object Shape":"Circle, Sphere","Disposition":"Unresolved","Summary":"Orange with Red light in the centre"}