{"Weather Factors":"Unknown","Country":"United States","Log Number":"US-10082012-0012","map":"<A HREF = \"http://maps.google.com/maps?q=46.188975,+-123.818079(43095)&iwloc=A&hl=en\"> mufon case (43095) map </A>","Sighting Duration":"Undisclosed","Tags":"City","Date of the Event":"09/07/2012 10:30 UTC","divs":["sighting detailsmy friend felix & i were sitting in an astoria city park chatting, when i noticed an unusual site in the sky as it became visible after passing over the building to the north of us that was obscuring our view to the north. it was a triangular craft with 3 amber lights on the bottom. it seemed quite high to me, probably about at passenger jet height, 30,000 ft. if it was at that height it would have been larger than a jetliner, maybe twice as big. although, it could have been lower. no sound was detected. after it came into view it traveled across the sky in a southwest direction until it disappeared. we watched it travel across 1\\2 to 2\\3 of the sky in about 3 or 4 seconds, no time to take a picture. we both noticed that it seemed to disappear, we should have been able to watch it for another couple of seconds as it headed for the horizon, but all of a sudden we couldnt see it any more. we were both quite excited after seeing it, giving high fives, and amazed at what we had seen. i was wondering if anybody else had reported a similar sighting, because if it was quite high, many people could have seen it. we have been having unusually clear skies in the nortwest lately! we figured we saw it about 10:30 at night."],"Source":"MUFON","Summary":"Sitting in Fort george park, my friend & i witnessed a triangle shaped craft high in the sky with three amber lights in the corners, it seemed quite high, maybe jet altitude, no noticeable sound, traveled across the sky about 3 or 4 seconds & disappeared.","files":["/var/www/straped/mufon/html2text/43095.html.txt","/var/www/straped/mufon/org/43095.html"],"Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Latitude":"46.188975","Object Shape":"Triangle","trends":["There has been one other sighting in Astoria","There were no other sightings in Astoria on or around September 7th 2012"],"Region":"Oregon","Date Submitted":"10/08/2012 04:39 UTC","Object Flight Path":"Straight-line path","Longitude":"-123.818079","Disposition":"Unresolved","Case Number":"43095","City":"Astoria"}