{"Viewing Distance":"Unknown","Country":"United States","Date of the Event":"10/07/2012 05:00 UTC","Disposition":"Unresolved","Tags":"City","Sighting Duration":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","divs":["sighting detailsi was at the silver lake reservoir meadow flying a kite with my 7 year old daughter. we both noticed a bright star-like object high in the sky - 75 degrees above the horizon to the north east. it was slightly pink at times, but mostly a solid, bright white light. it looked like venus or jupiter, but in the daytime. at 5:00 pm in early october, it's still quite bright outside in l.a. it was also a clear day with no clouds and no smog. i have the sky safari app on my iphone, so i checked it to see if there was an unusually bright planet or celestial body in the sky, but there was nothing in that part of the sky. there's really no way we would be able to see any planets or stars at that time of day, but i wanted to rule it out. the object stayed seemingly perfectly still for at least 20 minutes. i took some pictures as best as i could, using the kite as a guide since i could not see the object in the viewfinder directly. it is directly to the left of the kite in the photo. it was only when looking into the sky for a few moments that i could see the object. if i looked away, i would loose it, and it took about a minute to find it again. what struck me is that it did not move, so it could not have been in orbit or a plane. i knew the spacex dragon was launched that day, but it would have moved across the sky. this was stationary. several planes flew past while we were there, and they were much closer. on a side note, the day before - saturday 10\\6 - los angeles was covered with chemtrails\\contrials, more than i had seen in quite some time. it was completely overcast from that activity all day on saturday, but sunday was very clear. i took the picture with a canon powershot sx200, iso 800, f\\5.6, shutter 1\\2000. the unaltered photo is uploaded."],"Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=34.094891,+-118.262714(43099)&iwloc=A&hl=en\"> mufon case (43099) map </A>","Object Features":"None","Case Number":"43099","City":"Los Angeles","trends":["There have been 404 other sightings in Los Angeles","There was one other sighting in Los Angeles on or around October 7th 2012"],"Latitude":"34.094891","Longitude":"-118.262714","Date Submitted":"10/08/2012 07:21 UTC","Summary":"Star like object was observed stationary, high in the sky for about 20 minutes in bright daylight conditions","Log Number":"US-10082012-0016","files":["/var/www/straped/mufon/html2text/43099.html.txt","/var/www/straped/mufon/org/43099.html"],"Region":"California","Object Shape":"Star-like"}