{"Tags":"City","Region":"Texas","Object Shape":"Cigar, Cylinder","City":"Killeen","Country":"United States","Disposition":"Unresolved","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","Case Number":"43107","Longitude":"-97.724496","map":"<A HREF = \"http://maps.google.com/maps?q=31.125909,+-97.724496(43107)&iwloc=A&hl=en\"> mufon case (43107) map </A>","files":["/var/www/straped/mufon/html2text/43107.html.txt","/var/www/straped/mufon/more/43107_submitter_file1__2012100819.13.31.jpg","/var/www/straped/mufon/more/43107_submitter_file2__2012100819.12.57.jpg","/var/www/straped/mufon/more/43107_submitter_file3__2012100819.13.46.jpg","/var/www/straped/mufon/org/43107.html"],"trends":["There have been 16 other sightings in Killeen","There was one other sighting in Killeen on or around October 8th 2012","This sighting has been favorited 1 time.",""],"divs":["sighting detailslooking west at the sunset several of us noticed large, flat, bright auras that moved about slowly. directly located over fort hood, tx. there were up to 8 total lights\\auras. there were several very long vapor trails in the sky that were clearly from jets to provide great differentiation. these auras were slightly brighter in the middle and moved slowly up and down. the auras were bright and very discernible. all but one disappeared over the trees into the sunset. the other one went up slightly and then there was nothing. i told my friend i was shocked that jets from san antonio had not arrived yet when all of a sudden a jet flew within a mile of us from behind us and you could see the outline in the sunset, but there was no sound from the jet...... obviously no pictures the jet as we saw it and it was quickly behind the trees at a low elevation. all pictures taken at my sons soccer game in harker heights, tx. duration about 5 minutes. all pics around 7:13 p.m. central camera is still the objects had a hazy shape, but were bright. 31 normal sky. 57 best."],"Weather Factors":"Unknown","Date Submitted":"10/08/2012 11:45 UTC","Summary":"Large, flat, bright auras that moved about slowly.","Source":"MUFON","Log Number":"US-10082012-0024","Date of the Event":"10/08/2012 07:12 UTC","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Object Features":"None","Latitude":"31.125909"}