{"Object Features":"None","files":["/var/www/straped/mufon/html2text/43104.html.txt","/var/www/straped/mufon/org/43104.html"],"Summary":"Two UFOs put on show after following another UFO","Tags":"City","Region":"Michigan","Sighting Duration":"00:20:00","divs":["Sighting Details My girlfriend and I were on our way home from the store when we spied our usual strange light in the sky. We see this light often, it normally stays stationary, is within the atmosphere, and varies its position only slightly after months, in the western sky. But the night in question, we witnessed not only this same light, but also a second identical light in the north east. It moving over the trees, at no more than 100 feet up. It was moving maybe 60-100 mph and I could see the stars moving behind it. We followed it for maybe five minutes, lost it, found it again, then stopped the car as we noticed it slowing down. It went in the opposite direction it was going, about maybe 40-60 feet, before it stopped. This object was bright like a star, yet had several white and red blinking lights on it that blinked with no pattern. This object stayed in this position for upwards of 60 plus minutes, ie., the entire episode (about half a mile to a mile of where we sat). We sat with the car off and watched it for several minutes. My girlfriend had a better view of our usual light in the western sky. She witnessed that object disappear below the horizon. We went back to watching the object in the north east, waiting for it to move again. It was still blinking. The light of the object itself (ie not its exterior lights) only very slightly pulsed. Then we noticed a very thin, subtle blue line or \"beam\" of light coming from the craft, going down at an angle to an unknown location. This was faint and seemed to soon disappear. This is the only aspect of this experience that I am unsure of, this beam. Everything else was right there before my eyes. After maybe 15 more minutes, while hoping and praying aloud for it to do something, my girlfriend noticed a light coming up over the horizon to the left in the north. It was bright yellow at first and erratically flying towards the east then faded to a red color and went down in a leaf motion behind the treeline. I caught a glimpse of it just before it went below the treeline. About 2 minutes after this one disappeared another object appeared out of nowhere directly to the north of our location. It was a pulsing gold to amber color and descended at a slower than falling speed. After descending a short distance a second object appeared directly above it and both objects descended in unison. The second one took a moment to brighten, then both objects were identical and the second one moved to the left so they were almost side by side with one being slightly higher than the other and both objects stopped and hovered there for about one minute. These two objects I saw very clearly. They were pulsating lights in a disc-like or perhaps oval shape. They pulsated irregularly, and the color of the light would change from a bright white to a golden-amber or light orange color as it pulsed. One pulsed very brightly, then faded to a red color as it descended toward the horizon and was gone. The other followed after about 30 seconds in the same manner. The pulses varied, but they tended to be 2-5 seconds apart. The original object in the north east did not move after almost 45 minutes, but did continue to hover and pulse irregularly. We decided to go home."],"Longitude":"-86.037896","Object Shape":"Disc, Unknown","Latitude":"42.768926","Case Number":"43104","Object Flight Path":"Path with directional change,Path then hovering,Other","Weather Factors":"Unknown","City":"Allegan","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.768926,+-86.037896(43104)&iwloc=A&hl=en\"> mufon case (43104) map </A>","Source":"MUFON","Date of the Event":"10/07/2012 09:15 UTC","Log Number":"US-10082012-0021","Disposition":"Unresolved","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","trends":["There have been 2 other sightings in Allegan","There were no other sightings in Allegan on or around October 7th 2012"],"Date Submitted":"10/08/2012 09:22 UTC"}