{"Longitude":"-103.685404","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","trends":["There has been one other sighting in Limon","There were no other sightings in Limon on or around October 7th 2012"],"Object Features":"Unknown","Region":"Colorado","Case Number":"43111","map":"<A HREF = \"http://maps.google.com/maps?q=39.266266,+-103.685404(43111)&iwloc=A&hl=en\"> mufon case (43111) map </A>","Country":"United States","Date of the Event":"10/07/2012 07:20 UTC","files":["/var/www/straped/mufon/html2text/43111.html.txt","/var/www/straped/mufon/org/43111.html"],"City":"Limon","Latitude":"39.266266","Sighting Duration":"Undisclosed","Tags":"City","Object Shape":"Circle, Flash, Triangle","Source":"MUFON","Date Submitted":"10/09/2012 10:42 UTC","divs":["sighting detailsaround 7pm driving on i 70 west from ks, my 23 yr old nephew asked me to look ne by a cloud, me and my 18 yr old daughter noticed what he did...an object that would flash a bright light every 5 seconds ..at first i thought it was my eyes playing tricks w\\ me like when you stare at the sun too long..but with each flash it would be in a different spot like it would disappear and reappear not far from it's original spot..it did this 5 x's, each time it flashed\\ moved it had a reddish color at the base of it and was gone. it reappeared 2 min later just a few hundred feet to the west (not far from its original spot) and just hovered...it started going straight up slowly and \"poof\" was gone. about 2 min later there were about 2 jets in the area. we did not see it anymore that evening. my daughter was scared and now sleeps on the sofa instead of her room, scared of being abducted, me and my nephew who always beleived in ufo's but never seen one, were amazed, and it felt like an adrenaline rush came over me. why did it not land? is there a universal code that they are abiding by that they cant land but just watch us or mess with us until a given time? i now watch the skies more than ever!"],"Summary":"roundish/triagle shaped object w/ flashing light","Log Number":"US-10092012-0004","Disposition":"Unresolved","Object Flight Path":"Path with directional change"}