{"Latitude":"39.962095","Country":"United States","Date of the Event":"10/08/2012 12:00 UTC","Weather Factors":"Unknown","Viewing Distance":"Unknown","divs":["Sighting DetailsFor the last several months I have been seeing these lights in the sky that was brought to my attention by my son. I said there were probably choppers but kept an eye out and up from that point forward. From my front porch i have a pretty good view of the NE sky and these lights look like stars so i bought a telescope to see if they were, when i finally got 1 in focus(there's always 3 larger white in the middle)it seemed almost as if I was looking at the moon and the shape was a cookie with a bite taken out of it which was bookended by 2 smaller light thats seemed to pulsate. When I got 1 of the smaller 1's in focus it didn't pulsate but was moving so fast it just looked that way. When i got back to the white 1 on the surface there were shadows that moved in and out as if they would populate then expel. AT 11pm they were way off in the distance and of the course of the next few hours they moved in unison from NNE to the SW to W and as they moved there was a wake left behind them in the clouds. By 12:45am they were almost overhead and the wind started to pickup my dog came to door looked directly at them and started to bark(my dog doesn't bark)he told me i better get my but in the house and i did. I don't know what's going on but it going on above us. Side note this whole time there were planes in the area but they acted as if they didn't see the\"stars\". If you live in the NE OR NW part of the city strt looking up and YOU WILL SEE THEM ASWELL..."],"files":["/var/www/straped/mufon/html2text/43112.html.txt","/var/www/straped/mufon/org/43112.html"],"Log Number":"US-10092012-0005","Source":"MUFON","Object Shape":"Circle, Sphere","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.962095,+-75.156269(43112)&iwloc=A&hl=en\"> mufon case (43112) map </A>","Longitude":"-75.156269","Date Submitted":"10/09/2012 01:12 UTC","Disposition":"Unresolved","City":"Philadelphia","Summary":"For the last several months I have been seeing these strange lights in the sky that look like stars but are traveling across the night sky.","trends":["There have been 216 other sightings in Philadelphia","There was one other sighting in Philadelphia on or around October 8th 2012"],"Region":"Pennsylvania","Sighting Duration":"Undisclosed","Object Features":"Unknown","Case Number":"43112"}