{"Latitude":"43.134708","Log Number":"US-10092012-0010","Weather Factors":"Unknown","Source":"MUFON","divs":["Sighting Detailsi had just arrived home from working my second shift job. i arrived home at 1130, grabbed a bite to eat and went outside around 1am to have a cigarette. it was a beautiful star filled night and we have a huge backyard so as i normally do i look up at the stars just for fun. it was a full moon, though i believe it was relatively low in the sky that night if i remember. as i was looking up at the stars something caught my eye to my northeast. i thought it was a plane coming at first. it was a hug black object, almost boomerang shaped and it was so hug that i could trace it in the dark because it was covering up the stars in the sky as it moved. it was moving very slowly and made no noise as it passed by and had no navigation lights on it either. it almost looked like a stealth bomber but it was so low and had no exhaust emission that i believe it was not an air-force aircraft. i watched it move slowly until it was out of my viewing range. it sent chills down my spine and i had a really strange feeling about it as soon as it happened. i feel that this was no normal aircraft for many reasons. no blinking lights, no noise, and it was very low in the sky. it was just so huge and the reason i can tell that is because the way it covered up so many of the stars in the sky and it being so bright out, i could make out every characteristic of the craft. i just want my story out there and maybe someone else has seen a similar object. my best friend is a Staff Sargent in the US Air Force so i am familiar with most planes, even drones like my friend works on. this was no plane and being so far from a major airport and air base makes that out of the question in my mind. i would like any information your group may provide and wouldn't mind joining the MUFON network as i am now a firm believer in the existence of objects out of this world. thank you Jared Kjos"],"files":["/var/www/straped/mufon/html2text/43119.html.txt","/var/www/straped/mufon/org/43119.html"],"Object Flight Path":"Straight-line path","Disposition":"Unresolved","Tags":"City","Sighting Duration":"Undisclosed","Longitude":"-90.699184","Case Number":"43119","trends":["There have been 2 other sightings in Boscobel","There were no other sightings in Boscobel on or around May 5th 2012"],"Viewing Distance":"501 Feet - 1 Mile","Region":"Wisconsin","City":"Boscobel","Date of the Event":"05/05/2012 01:00 UTC","Object Shape":"Boomerang","Object Features":"Wings","map":"<A HREF = \"http://maps.google.com/maps?q=43.134708,+-90.699184(43119)&iwloc=A&hl=en\"> mufon case (43119) map </A>","Summary":"Huge Dark Black Object","Country":"United States","Date Submitted":"10/09/2012 04:26 UTC"}