{"Longitude":"-88.085315","Disposition":"Unresolved","Date of the Event":"05/29/2012 04:30 UTC","Case Number":"43113","Log Number":"US-10092012-0006","Region":"Illinois","divs":["Sighting DetailsI have had my fair share of ufo activity this summer. One night this summer I was outside on my deck around 230 am and saw a constant \"star\" looking object, but it was moving around. I watched it all night just moving around over me in the sky. I continued to watch it for up to 5 nights and would not leave until 530, 6 am. I live in Olney, Illinois which is literally in the middle of nowhere, On the 5th night I decided to go out in the country alone to only hope something would happen. As I was driving around I notice a orange light in my rear view mirror, I assumed it was a street light but after 20 mins or so of driving around making turns I realized it could not have been because it was always in the middle of the road and kept the same distance the whole time. I then drove for over 2 hours all around the country with this orange orb behind me. I finally grew some courage and parked my car and got out and just watched it behind me. I told \"them\" that I didnt want to take pictures in hope of making some kind of contact, it got to be 430am when this small orange orb turned into a big bright light, I pulled out my phone and took 2 pictures of what was behind me, next thing I know it just disappears. These pictures were just the beginning of it all, the rest of the summer I continued to watch things move in the sky that I have never seen before."],"City":"Olney","map":"<A HREF = \"http://maps.google.com/maps?q=38.730881,+-88.085315(43113)&iwloc=A&hl=en\"> mufon case (43113) map </A>","Tags":"City","Object Features":"Unknown","Date Submitted":"10/09/2012 01:19 UTC","Country":"United States","Object Shape":"Sphere","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/43113.html.txt","/var/www/straped/mufon/org/43113.html"],"Weather Factors":"Unknown","Source":"MUFON","Latitude":"38.730881","Summary":"Orange Orb follows me, then brighten's and disappears","Viewing Distance":"101-500 Feet","trends":["There have been no other sightings in Olney","This sighting has been favorited 1 time."],"Sighting Duration":"Undisclosed"}