{"Weather Factors":"Unknown","Tags":"City","Object Features":"None","Date Submitted":"10/09/2012 10:24 UTC","Region":"Tennessee","Log Number":"US-10092012-0015","Date of the Event":"09/09/2012 06:30 UTC","divs":["sighting details9\\9\\2012- i had just gotten on i-24 east bound at briley pkwy heading towards murfreesboro when i noticed 3 triangular lights. they stayed the same distance apart until old hickory blvd. i am not sure how far that is. they were just above my direct line of site. i first thought they were planes. they were to close to be in a holding pattern. i did see one plane come in towards nashville. it flew past them but at a slightly lower altitude.it was going west. i stayed in the slow lane and watched to see if the triangular pattern would change, if they were planes, i assumed they would get farther apart. they did not chane the distance between the three lights. when i got to old hickory blvd i needed to change lanes . i checked my mirror glanced back, then changed lanes. maybe 10-15 seconds. i looked back to see them and they were gone. this object did not bother me in any way. no wired feelings or reaction. just that it looked out of place. the only wired thing is my cell phone had a different ring tone that i did not set it for. sounds crazy but it sounded like an old fashioned phone ringing. it's back to the normal ring. that happened once. it had to be a coincidence. i was just wondering if anyone else reported it."],"trends":["There have been 72 other sightings in Nashville","There were no other sightings in Nashville on or around September 9th 2012"],"Country":"United States","Viewing Distance":"Unknown","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/43122.html.txt","/var/www/straped/mufon/org/43122.html"],"Source":"MUFON","Longitude":"-86.659357","map":"<A HREF = \"http://maps.google.com/maps?q=36.098613,+-86.659357(43122)&iwloc=A&hl=en\"> mufon case (43122) map </A>","Latitude":"36.098613","Sighting Duration":"Undisclosed","Disposition":"Unresolved","City":"Nashville","Case Number":"43122","Summary":"3 lights in steady triangle formation. Going east between nashville/ Murfreesboro tn 6:30 pm. Then disappeared . 9/9/12 6:30 - 7:00 pm","Object Flight Path":"Straight-line path"}