{"Disposition":"Unresolved","Date of the Event":"06/07/2012 09:10 UTC","Source":"MUFON","Object Features":"Unknown","Region":"Nevada","Country":"United States","Latitude":"36.118026","Case Number":"43125","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around June 7th 2012"],"Date Submitted":"10/10/2012 01:05 UTC","Longitude":"-115.169706","Summary":"V shape 4 running lights","Object Flight Path":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.118026,+-115.169706(43125)&iwloc=A&hl=en\"> mufon case (43125) map </A>","files":["/var/www/straped/mufon/html2text/43125.html.txt","/var/www/straped/mufon/org/43125.html"],"Viewing Distance":"101-500 Feet","City":"Las Vegas","Weather Factors":"Unknown","divs":["Sighting DetailsI have reported this to you and a person called told me he was from my area and someone will contact me soon. So far nothing.Ifeel that if someone sees this picture it will speak for itself. I was visiting Las Vegas for my daughters marrage while my wife and i were crossing a ped bridge i stoped to take a picture of the city at night with my cell phone all i saw was the city and clear sky, i took the shot and continued on later that night i reviewed my photos and to my surprise this object was in the photo,after reviewing it it appears that four objects in a V formation whatever they are i did not see them when i was taking the picture. I believe that they were going too fast for the human eye but my camera caught them. I had asked before and i ask you again if you would supply me with a cell phone number i would be glad to send you the picture and you decide what i saw,I havenot taken it out of my phone so you would see it just like i took it.Iam a retired Philadelphia police officer and in all my years this is the weirdest thing i have ever seen, iam home most of the time so call any time but please do not have that last person that called me call again i would rather have someone with a true intrest in this photo call like i said see the picture and you decide no harm done i would appriciate it if you would tell me one way or another if your intereseted in my photo. Again the only way i can send you the photo is by cell phone so please supply one."],"Sighting Duration":"00:00:05","Tags":"City","Object Shape":"Boomerang","Log Number":"US-10102012-0002"}