{"Disposition":"Unresolved","Region":"Nevada","Longitude":"-115.045013","Sighting Duration":"Undisclosed","Summary":"White lights covered entire saucer/bell shaped craft. Flashed slowly, sequencing as it hovered, then up slightly, over, and behind a huge tree. Seemed the size 50 feet diameter.","Object Flight Path":"Hovering then path,Path with directional change","Latitude":"36.093827","Date of the Event":"10/09/2012 05:45 UTC","Case Number":"43126","Log Number":"US-10102012-0003","City":"Las Vegas","Date Submitted":"10/10/2012 01:12 UTC","Tags":"City","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around October 9th 2012"],"Object Shape":"Disc","Viewing Distance":"101-500 Feet","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=36.093827,+-115.045013(43126)&iwloc=A&hl=en\"> mufon case (43126) map </A>","Object Features":"Patterned Surface","Weather Factors":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/43126.html.txt","/var/www/straped/mufon/org/43126.html"],"divs":["sighting detailsoctober 9 2012: i felt a burning in my right wrist. it felt like i was bit by something, then it radiated even stronger. i went to the bathroom to check and put cold water on it. i looked out the bathroom window and saw the saucer\\bell shaped craft at 5:45 am. there was no doubt what it was or looked like! it had white lights all over it, that flashed sequentially at about a 1 1\\2 seconds per flash. it was hovering first, parallel out our bathroom window at about 45 degree angle. it then went slightly up and to the south, then up, and over to the right, kinda in the flight path of a \"c\" on its side. i saw it flash the sequence about 10 times before it went behind a huge tree on the next block over. i immediately went to the back yard and climbed the above ground pools ladder, the tallest place i had access to, and when i got out there, i just couldn't see anything. the stars were still out and very visible as it was about 5:55 am by the time i was outside. the ship didn't show, or was translucent. all i could see was the white lights all over it and there were 100's of lights, all flashing at the same time about a slow second apart. there was no sound, of engine, of wind, of anything. i was so excited to tell my husband to get out of bed to see it. by the time he got up which was fast, it had gone behind the tree. i went outside, and he went back to bed. seeing what i saw was overwhelming, exciting, and disappointing, that i didn't get to get a camera. i immediately drew a picture and recounted on my own, the sighting. i'm hoping that somebody else saw what i described and was able to capture it on camera, that reads this. it was huge and very obviously nothing else you can explain away. it very slowly went behind the huge tree on block behind us and slightly to the north. please let someone else have seen this sighting! elizabeth"]}