{"Object Features":"Unknown","Source":"MUFON","Log Number":"US-10102012-0001","Case Number":"43124","Latitude":"39.955135","Summary":"Approximately a dozen blinking lights hovering in the sky & behind the clouds. They abruptly and sporadically changed from bright-dull and continuously disappeared, then reappeared. Event occurred for at least 20-25 minutes between ~10:35-11:00.","trends":["There have been 216 other sightings in Philadelphia","There was one other sighting in Philadelphia on or around October 8th 2012"],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=39.955135,+-75.156319(43124)&iwloc=A&hl=en\"> mufon case (43124) map </A>","Region":"Pennsylvania","Date of the Event":"10/08/2012 10:40 UTC","Date Submitted":"10/10/2012 12:45 UTC","divs":["Sighting DetailsBeginning at approximately 10:35-10:40, my I along with three very credible individuals whom I am extremely close with observed strange lights in the sky. Initially, I discredited the others' reactions regarding the lights by assuming it was simply lightning. However, these lights multiplied and began blinking on and off in a fashion completely incongruent with lightning. Then I tried discrediting them by saying they are probably spotlights or projectors casting light into the sky; however, I live no in the suburbs and no where near a nightclub or facility which would cast a dozen lights into the sky. I absolutely eliminated this possibility by noting how the lights were being cast by objects behind and above the clouds. (Shortly after the sighting, my brother and his friend arrived and told me they observed the same event miles away in the Neshaminy area). We all observed these circle-shaped lights hovering and flying in 100% unnatural patterns - sometimes at extremely fast speeds and sometimes around the same speed as an airplane - the 10-15 lights moved in very sporadic movements and it seemed as though they randomly accelerated and decelerated. Then the would deliberately fly into a rough horizontal axis at clouds' height and continue to blink randomly on and off. After momentarily remaining in that formation, they would become faint and almost disappear behind the clouds, then become bright again and gather together in the center. They remained together blinking sporadically on and off and they would frequently disappear and reappear in various formations. What is also iteresting is that there were at least two or three different ordinary airplanes flying toward these lights during the event, but at various different times beginning approximately halfway through the sighting and the last airplane flew by closer to the end of the lights' presence. It is undoubtable these lights were under intelligent control and were apparently products of extremely advanced technology, as it is impossible they were stars, lightning, the moon, the sun, other visible planets, or any other explainable natural phenomenon which is attributed to our solar system. It is also impossible they were objects which we are familiar with in the United States or anywhere else in the world; they were absolutely not airplanes, helicopters, jets, hot air balloons, weather balloons, kites, spotlights, lights from projectors, remote controlled devices, or government aircraft test flights. This event took place on the night of October 8, 2012 and I along with other witnessed from approximately 10:35 or 10:40 until around 11:00. We also recorded the event for a total of over 13 minutes on my iPhone, naturally, the videos do not do the event justice, as the lights in question are relatively fainter in the video when compared to the in-person sighting. This sighting was the first and only one I have seen; I have no doubt at all about what I and the five others who were with me observed. Further, I have no doubt that they were not natural, as they flew and hovered at extreme speeds, intelligently in deliberate formations while blinking on and off randomly. This was a chilling event for me and truly shook me, it is more than I can comprehend or explain with the knowledge I have of the workings of the world, technology, physics, and natural phenomenons. I initially did not want to believe the reality of what I was witnessing last night; however, there is no other reasonable explanation which will at the moment satisfy me as to what it is that occurred over Philadelphia. This specifically took place around the Northeast from the Neshaminy area; the lights were seemingly very high above ground as they were behind and above the clouds. Please, if anyone else witnessed this specific October 8 event or was able to capture a higher quality video, share. Additionally, if anyone has a reasonable explanation regarding this event, I would greatly appreciate your input and knowledge."],"Longitude":"-75.156319","City":"Philadelphia","Sighting Duration":"Undisclosed","Country":"United States","Object Shape":"Circle, Sphere","Viewing Distance":"Over 1 Mile, Unknown","files":["/var/www/straped/mufon/html2text/43124.html.txt","/var/www/straped/mufon/org/43124.html"],"Object Flight Path":"Stationary,Other","Tags":"City","Weather Factors":"Unknown"}