{"Object Features":"None","divs":["Sighting DetailsA few weeks back I saw something I think was a UFO. It was early evening and I was in the parking lot at the local Lowes. I happened to look directly up and saw a VERY bright light in the sky. It was standing still. Then the light started dimming and the bright light became a charcoal-gray, triangle-shaped craft, with a light located directly beneath each of its 3 points. The triangle shape was longer front to back and narrower side to side, making it look thinner than an equilateral triangle. It just hovered, rock-steady and made no noise at all. The three lights changed color: sometimes white, sometimes red or blue. In the center of the craft's underside was a much larger light but it was a very dim red color and it never brightened It then moved north, straight into a cloud and I noticed at the back of the craft a bright bluish-white light which I think might have been the engines that somehow worked without making noise or smoke. After the UFO flew into the cloud I didn't see it anymore. I really wish people would take these things more seriously because they are really creepy."],"Weather Factors":"Unknown","Latitude":"43.00508","Date Submitted":"10/10/2012 11:00 UTC","trends":["There have been 4 other sightings in Amherst","There were no other sightings in Amherst on or around September 20th 2012"],"Tags":"City","Region":"New York","Object Shape":"Triangle","Summary":"Large Triangle-Shaped Craft Hovering Silently Over Lowe's Parking Lot","Country":"United States","Case Number":"43128","Object Flight Path":"Hovering then path","Source":"MUFON","Viewing Distance":"Unknown","Log Number":"US-10102012-0005","map":"<A HREF = \"http://maps.google.com/maps?q=43.00508,+-78.822409(43128)&iwloc=A&hl=en\"> mufon case (43128) map </A>","Date of the Event":"09/20/2012 12:00 UTC","Longitude":"-78.822409","files":["/var/www/straped/mufon/html2text/43128.html.txt","/var/www/straped/mufon/org/43128.html"],"City":"Amherst","Disposition":"Unresolved","Sighting Duration":"Undisclosed"}