{"Weather Factors":"Unknown","trends":["There has been one other sighting in Mazatlan","There were no other sightings in Mazatlan on or around April 26th 2009"],"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/43127.html.txt","/var/www/straped/mufon/org/43127.html"],"Date Submitted":"10/10/2012 06:44 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=23.236111,+-106.415278(43127)&iwloc=A&hl=en\"> mufon case (43127) map </A>","Source":"MUFON","divs":["Sighting DetailsIt was sunday april 26 of 2009 I was coming back from a wedding I was on board a plane in a comercial flight from Mazatlan, to Tijuana, as we were taking off, I was sitting on a window sit, and viewing down at the city I was focusing on the cars in the street, and I remember viewing up at the clouds for the purpose of calculating the time I had to enjoy the view of the city, then as I was viewing I see some clouds passing fast below the plane, in that time I was confused and I cut not understand, but at the same time viewing the city, and then in a instant a disc materialized, and I cut not see under the disc I cut not belive wat I was seeing I focus more to confirm that it was a disc and it was biger then a frisbee in my hand,when I was convinced I turnd to my frend next to me and I told him to view down the window and see the disc, at firts he cut not see anything and then in a instant he viewed the disc, he cut not belive wat was out there, he ask me wat was that? and I told him it was a flying saucer, we were much much impressed, I told him that wen we land I was going to report wat I viewed but at the same time we stop talking and we went to sleep. Arriving in Tijuana I rememer as I was pasing the captain I tried to tell him but cut not do it a feeling of fear came over me and that it was not important to report wat I viewed. after 14 days I was waching the history channel and a UFO came on and I jump from my bed and cut rememer, I had forgot, but in that instant I cut tell the story, it was a beautiful perfect disc, no movement, a lot of shain, it was the same shain or more as the UFO in the walt disney movie flight of the navigator I call my frend from the plane and I ask him if he rememer and he cut not rememer any thing of the flight or the flying saucer, something is not ok!! can understand way did I have fear to report or that I forgot for 14 days an did not tell any body in that time or that my frend cant rememer any thing of the flight or the flying saucer. Sorry for my writing!!! can not write good in English but I know its more important to tell my experience"],"Object Shape":"Circle, Disc","Country":"Mexico","Tags":"City","Latitude":"23.236111","Case Number":"43127","Region":"Sinaloa","Viewing Distance":"21-100 Feet","Longitude":"-106.415278","Summary":"shine disc under plane, first invisible, viewing the city of mazatlan, then I see a reflection of the clouds and the disc matrialized","Date of the Event":"04/26/2009 12:00 UTC","Object Flight Path":"Stationary","Object Features":"None","Log Number":"MX-10102012-0004","City":"Mazatlan","Sighting Duration":"Undisclosed"}