{"Weather Factors":"Unknown","Case Number":"43136","Region":"South Carolina","Date of the Event":"10/10/2012 07:35 UTC","Source":"MUFON","trends":["There have been 5 other sightings in Rock Hill","There were no other sightings in Rock Hill on or around October 10th 2012"],"Log Number":"US-10102012-0013","City":"Rock Hill","Summary":"round to disc shaped","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=34.943443,+-81.019456(43136)&iwloc=A&hl=en\"> mufon case (43136) map </A>","Object Shape":"Circle, Disc, Sphere","Tags":"City","Date Submitted":"10/10/2012 08:32 UTC","Longitude":"-81.019456","Country":"United States","Disposition":"Unresolved","divs":["Sighting DetailsSpotted by wife and daughter as they pulled into drive which faces west. Object in SW sky at approx. 2 o'clock. Asked me to look at it and explain. at first thought it was a chinese lanturn. wife went in house, as daughter and I watched, it slowly sank in the sky, than shot off to the south, stopped turnned blue to white, shot up and blinked out for a few seconds, than came back blue, turned a brilliant red and moved slowly north. stopped again than shot off rapidly to the NW. I was awe struck, my daughter was terrified, she is but 11 and scared of the unexplainable.We are in the flight path of Charlotte Duglass Airport in Charlotte, NC and their were planes in the sky and this my frind was no plane, although it was aout the same distance from the ground as incoming and departing flights, maybe just a bit higher in the sky. I will turn 51 next and have never seen anything like it in my life. I have seen space shuttles launch and land and have seen the space station go over with the sun lighting it just before a dawn launch, as the shuttle has to catch it and none of this compares to what we wittnessed."],"Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/43136.html.txt","/var/www/straped/mufon/org/43136.html"],"Object Features":"Unknown","Latitude":"34.943443","Sighting Duration":"Undisclosed"}