{"files":["/var/www/straped/mufon/html2text/43146.html.txt","/var/www/straped/mufon/org/43146.html"],"Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=32.741297,+-117.172294(43146)&iwloc=A&hl=en\"> mufon case (43146) map </A>","Case Number":"43146","divs":["Sighting DetailsOn Tuesday October 9, I saw 3 separate lights or crafts in the evening sky here in San Diego, California which did not have collision lights. I was viewing this sighting from about one mile north of the San Diego International airport. There were considerable clouds at that time; so I could only see about 30 percent of the sky. The clouds were broken and irregularly spaced. The first sighting was at 7:35pm and it was of a single light. The second sighting was only 12 minutes later at 7:47pm and it contained 2 lights or crafts. The second, or later sighting, was much closer and was at the same level as the low clouds. These 2 lights or crafts had just passed over my house, or I assume they had passed over my house; but anyway, they were already a little north and a little east of my house, almost overhead and traveling NNE. These 2 crafts were close to each other. If I stuck my hand out in front of me, 3 fingers would represent the distance between the crafts. One craft or light was ahead of the other one and it was brighter. They were traveling faster than the jets do in this area. I saw them for 10 seconds before they went into the clouds. They were traveling NNE, which would make them cross the normal jet traffic which goes west to east before turning around to come back to the San Diego Airport to land. I did not see any commercial aircraft in the area during this second sighting. The first sighting was a single light almost overhead, but a little east. This light or craft was very high. It could have been mistaken for a satellite, but it was not a satellite. It was traveling too fast to be a satellite. I saw this sighting for about 10 seconds also before it was hidden by cloud cover. I did not hear any noise from any of the crafts. I should have heard noise from the second sighting since they was so close; almost directly overhead when I first saw them."],"Longitude":"-117.172294","Disposition":"Unresolved","Summary":"3 straightline white lights with no collision lights","Country":"United States","Object Shape":"Sphere","City":"San Diego","Date of the Event":"10/09/2012 07:35 UTC","Object Features":"None","Log Number":"US-10112012-0005","trends":["There have been 151 other sightings in San Diego","There was one other sighting in San Diego on or around October 9th 2012"],"Object Flight Path":"Straight-line path","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Tags":"City","Sighting Duration":"00:12:00","Latitude":"32.741297","Date Submitted":"10/11/2012 02:34 UTC"}