{"Case Number":"43149","City":"Austin","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Circle, Sphere","Object Features":"Unknown","Summary":"Several lights hovering near cloud, broke apart and went in different directions, reformed, disappeared","Weather Factors":"Unknown","Region":"Texas","Log Number":"US-10112012-0008","Country":"United States","Sighting Duration":"00:05:00","map":"<A HREF = \"http://maps.google.com/maps?q=30.312514,+-97.756677(43149)&iwloc=A&hl=en\"> mufon case (43149) map </A>","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around October 10th 2012"],"divs":["Sighting DetailsI was traveling southbound on Mopac Expressway between 2222 and Enfield. I saw what at first glance appeared to be a spotlight shining onto a low cloud. However, there was not the typical 'beam' that one sees and the light was made up of several (at least 5) separate points of light arranged in a triangle. The points broke apart and meandered across the underside of the cloud in what appeared to be a random pattern at abnormal velocities before reforming into the triangle. The triangle of lights then disappeared, although a single light source (faded and not as visible as before) was observed leaving the underside of the cloud before fading even further. My first reaction was that this was, like I said, a spotlight from some event shining up at the sky, but there weren't any beams and the light seemed to be emanating from the cloud rather than being a reflection. Also, the movement was too fast and random to be a bunch of ground spotlights. There wasn't any noise that I could hear (driving with windows up). The event lasted from when I first noticed it at 9:40 pm until 9:45 pm. I did not observe any aircraft in the area."],"Date Submitted":"10/11/2012 04:07 UTC","Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Date of the Event":"10/10/2012 09:40 UTC","Longitude":"-97.756677","files":["/var/www/straped/mufon/html2text/43149.html.txt","/var/www/straped/mufon/org/43149.html"],"Latitude":"30.312514","Disposition":"Unresolved"}