{"Log Number":"US-10112012-0021","Tags":"City","Source":"MUFON","Latitude":"39.775176","Summary":"car size stainless steel looking i was in a boat alone 15 seconds i turned and look away look back and gone","files":["/var/www/straped/mufon/html2text/43162.html.txt","/var/www/straped/mufon/org/43162.html"],"Object Flight Path":"Stationary","Longitude":"-86.156824","City":"Indianapolis","Object Features":"Other","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.775176,+-86.156824(43162)&iwloc=A&hl=en\"> mufon case (43162) map </A>","Weather Factors":"Unknown","Region":"Indiana","trends":["There have been 126 other sightings in Indianapolis","There were no other sightings in Indianapolis on or around June 11th 2003"],"divs":["Sighting Detailsi had to share this and i\"ll try to keep it short.... it was june 2003 and Indianapolis was getting a new airport being built. i had just recently moved to indy and found a pond to fish on the backside of the airport in an industrial area. i got to the pond right at 4:00 pm and put my 10 ft. jon boat in the pond. i fished down 1 edge of the 100 yard long pond and caught 2 bass. you fish for bass slowly so it had to be right at 4:30 now. as i was crossing the water to the other side an object catches my eye. It was a straight up and down cylinder shape with a beveled cone shap wrapped around the lower middle of the cylinder. it seemed the size of a volkswagen on end and about 30 degrees to the horizon, maybe 400 feet away and treetop level. the object was soundless and looked stailes steel in color. this was broad daylight and it was a little shiny. the craft seemed to be moving while hovering but i never saw it move side to side. hard to explain but it looked like the metal was liquid but not really liquid. strange i know but hard to explain. the sighting lasted about 15 seconds and my boat was heading to hit to shore on the other side of the pond... i was thinking to myself that if i take my eyes off this thing it gonna be gone. i turn to correct my boat from crashing into the bank and yes i turned around to nothing. i hate to sound cliche but i know it was 4:30 when i saw this object and its now 6:30..i dont get it.. i got the heck out of there and never went back."],"Disposition":"Unresolved","Object Shape":"Cross, Cylinder, Saturn-like, Square, Rectagular, Other","Date of the Event":"06/11/2003 05:30 UTC","Case Number":"43162","Sighting Duration":"Undisclosed","Date Submitted":"10/11/2012 05:33 UTC","Viewing Distance":"101-500 Feet"}