{"Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Weather Factors":"Unknown","Latitude":"35.387937","Date Submitted":"10/11/2012 04:25 UTC","Case Number":"43161","Tags":"City","Date of the Event":"04/05/2011 10:19 UTC","Region":"North Carolina","Viewing Distance":"21-100 Feet","Summary":"came thur my back yard low to ground hovered then it went up and stayed in area got lots of pics","Disposition":"Unresolved","Log Number":"US-10112012-0020","files":["/var/www/straped/mufon/html2text/43161.html.txt","/var/www/straped/mufon/org/43161.html"],"trends":["There have been no other sightings in Bostic","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Longitude":"-81.812296","divs":["Sighting DetailsWhen I spotted it I was sitting in my back room I heard this humming noise and I thought it was the helicopter coming back thur the back of my yard again. When I stepped out my back door to look I had the shock of my life.I called 9-11 the police were dispatched.I was looking at I want to say A large round Sauser like thing that was shiney moving towards my house very slow it had lights that were going off and on Red Blue White and Green. I ran to find my camera in hopes to get a least one shot I was amazed that I was able to get alot of shots even though it would not stay still. I was so happy to get what I did. When the police arrived I was laughed at at first till I showed them the pictures. There is some kind of actitivty around here because I have seen this thing more than once but not up close like I did this time I had to zoom out to to get some of my pictures. so it looks like little spots but when inlarged you can see the shapes and lights."],"map":"<A HREF = \"http://maps.google.com/maps?q=35.387937,+-81.812296(43161)&iwloc=A&hl=en\"> mufon case (43161) map </A>","Object Shape":"Circle, Disc, Oval","City":"Bostic","Object Features":"Dome, Window(s)","Country":"United States"}