{"Sighting Duration":"00:02:00","Latitude":"37.460843","Log Number":"US-10112012-0024","Longitude":"-98.687502","Object Shape":"Square, Rectagular","Date Submitted":"10/11/2012 06:10 UTC","Tags":"City","Region":"Texas","City":"Marble Falls","divs":["sighting details i had a sandwich delivery route traveling within the central to southwest part of texas at the time. my wife was riding with me on this route which i usually ran by myself. it was about 9 to 10 pm & a very clear dark night with no moon i can remember. i was driving north on us hwy 281 about 10 miles south of marble falls,tx. we were entering a hwy. area that had been cut out of a rocky hill with about 40 ft. on both sides & was uphill on entry & downhill on exit. probably about 1\\4 mile in length when the hwy. returned to a normal shouldered hwy. of that time. no other autos in front or in rear of us. as we neared the crest of the cut out hill a huge object very slowly passed over us that was a lot larger than the width of the hwy. hard to tell how wide it was as it was so low that the sides of the cut out hill hid what we couldn't see. it was as a guess about 20 t0 30 feet above the cut out hill moving south at an almost stopping speed. it had rectangular windows like in homes that were lit but a low level of yellowish light. we could se nothing inside but the dim lights. it made no sound, no vibrations, no power trail & did not interfer with any of the electricals of the truck. i was driving about 60mph so as it passed over us i looked in my outside rear view mirrors to make sure of what we saw but by that time going downhill & saw nothing else. i asked my wife if she saw what i just saw & she said \"yes. what was that?\" \"i don't know but very strange.\" a bit shaken by this we drove into marble falls a few minutes later & stopped at a store to get a soda & gather our thoughts. we mentioned nothing of this to the store clerk & stood outside a few minutes looking south first then all directions but saw nothing but stars. we never talked about it to anyone for many years & occasionally among ourselves. she passed away 12 or 13 years ago so i'm the only one to relate what i definately saw that night. have always wondered if it was something our military was working on as it was not that far to ft. hood military base."],"Summary":"Saw unknown huge craft pass slowly over my small 1 ton sandwich delivery truck.","Viewing Distance":"21-100 Feet","files":["/var/www/straped/mufon/html2text/43165.html.txt","/var/www/straped/mufon/org/43165.html"],"Object Features":"Window(s)","map":"<A HREF = \"http://maps.google.com/maps?q=37.460843,+-98.687502(43165)&iwloc=A&hl=en\"> mufon case (43165) map </A>","trends":["There have been 5 other sightings in Marble Falls","There were no other sightings in Marble Falls on or around September 10th 1983"],"Country":"United States","Source":"MUFON","Disposition":"Unresolved","Weather Factors":"Unknown","Date of the Event":"09/10/1983 10:00 UTC","Object Flight Path":"Straight-line path","Case Number":"43165"}