{"Disposition":"Unresolved","Region":"Colorado","Object Features":"None","Case Number":"43164","Object Shape":"Chevron","Summary":"Black chevron, not stealth bomber, raised silently into cloud deck east of Presidential Debate hotels","City":"Aurora","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"10/11/2012 05:48 UTC","Log Number":"US-10112012-0023","Latitude":"39.736092","Date of the Event":"10/05/2012 05:05 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.736092,+-104.82995(43164)&iwloc=A&hl=en\"> mufon case (43164) map </A>","Longitude":"-104.82995","Source":"MUFON","divs":["Sighting Details5:10 PM or so, leaving Red Lion Hotel, noticed Obama security detail moving out of hotel, northward on Havana Blvd. When we were allowed to move after street cleared, we were driving north on Havana, just prior to I-70. Saw movement out of right peripheral vision. Saw, far off in distance, beyond edge of Aurora housing, a chevron, shaped exactly like an extremely large V, moving extremely slowly into the cloud deck. Cloudy day, cloud deck at approximately 1500 feet. Did not make a sound, object either extremely large or quiet, no sound noted. Odd, thought it was stealth bomber initially, but NO cockpit, forward area noted. The ship was shaped exactly like a large letter V, no external appendages or structure, no forward structure noted. No wings noted, no control surfaces or windows noted. No signals, no nav. lights noted. Details hard to make out, it seemed seemless. I did not make out any rivets or other protrusions. Initial impression is, of course, I was impressed. Felt proud US had such technology. Odd feeling when I realized this was not the stealth bomber and odd when I noted no cockpit, wings, light or sound. Object moved diagonally and upwards, like a conventional flight path, but quite slowly. Object entered cloud deck and disappeared. Estimated that I lost sight of object into cloud deck where object was somewhere above Watkins, CO."],"Country":"United States","trends":["There have been 48 other sightings in Aurora","There were no other sightings in Aurora on or around October 5th 2012"],"files":["/var/www/straped/mufon/html2text/43164.html.txt","/var/www/straped/mufon/org/43164.html"],"Viewing Distance":"Over One Mile"}