{"Case Number":"43173","Country":"United States","Date Submitted":"10/11/2012 10:17 UTC","divs":["Sighting Details4 people camping witnessed a red square light turn on about 10pm. about 4 miles from Wickenburg AZ. we determined it wasn't on a pole or a light on a building. It was viewable for about one minute. we talked about it and concluded it was going to remain a mystery. About 5 minutes later it just turned back on, only this time it was moving very slow in the sky. there was a highway between the object and our camp sight. this object appeared to be as big as a tractor trailers on the highway As the object moved it disappeared behind the silouette of the mountain. So we estimated that with the mountain being about three miles beyond the highway that this object was massive. We thought it may be about 10 stories square. there was no silouette or any other outline of any additional craft once the light went behind the mountain. I mention this because we wanted to rule out a blimb. this sighting was one month prior to the phoenix light sighting. There was a report last week of a red light sighting in the wickenburg area on the coast to coast radio program which made me want to inform you there are now four more people who have seen unidentified flying objects. I will report my first ufo sighting from 1983 from Liberal Kansas when I get a chance."],"files":["/var/www/straped/mufon/html2text/43173.html.txt","/var/www/straped/mufon/org/43173.html"],"Longitude":"-112.721982","Summary":"one month b4 phoenix lights sighting.4 whitnesses, slomoving red object","City":"Wickenburg","map":"<A HREF = \"http://maps.google.com/maps?q=33.978291,+-112.721982(43173)&iwloc=A&hl=en\"> mufon case (43173) map </A>","Object Features":"None","trends":["There have been 7 other sightings in Wickenburg","There were no other sightings in Wickenburg on or around October 15th 1997"],"Object Shape":"Square, Rectagular","Source":"MUFON","Viewing Distance":"Over One Mile","Log Number":"US-10112012-0032","Date of the Event":"10/15/1997 12:00 UTC","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Tags":"City","Latitude":"33.978291","Sighting Duration":"Undisclosed","Region":"Arizona","Weather Factors":"Unknown"}