{"Country":"United States","Weather Factors":"Unknown","Log Number":"US-10122012-0001","Summary":"Intense orange-red single point of starlike size light moving across sky coming close to airplanes","Case Number":"43175","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=30.333224,+-81.650221(43175)&iwloc=A&hl=en\"> mufon case (43175) map </A>","Viewing Distance":"Unknown","divs":["Sighting DetailsI was sitting on my deck, when I noticed an unusual light in the sky just after dusk. The light looked similar to how mars looks in color when it is visible but it was much more intense. The point of light moved from SW to NE, it took a few minutes from the time I first noticed it come into view to my left until it was gone over the horizon to my right. The object seemed to be moving at a speed similar to airplanes in the sky. The object seemed to nearly collide with one of two identical looking airplanes that were following the same flight path only 5 seconds apart. The object either passed over or through the trailing aircraft. Due to the fact that they were right over me the difference in altitude between the planes and the object was not apparent. The planes altitude was low enough that I could clearly see space between their various lights, whereas the single unwavering light was many times more intense than those of the airplanes. I was filled with dread as the object seemed to surely be on a collision course with the two airplanes which were flying from SE to NW and sure enough the trailing plane and the light did intersect from my vantage point. However nothing happened and the planes and the light never strayed from their courses until they were out of sight. I lost sight of the planes' lights long before they would have gone over the horizon, but the unwavering light source remained as intense from the moment I saw it until it went over the horizon. After the light passed two helicopters appeared in the vicinity and airplane traffic seemed to lessen for a while."],"files":["/var/www/straped/mufon/html2text/43175.html.txt","/var/www/straped/mufon/org/43175.html"],"Latitude":"30.333224","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Source":"MUFON","Object Flight Path":"Straight-line path","Region":"Florida","Object Features":"Unknown","Date Submitted":"10/12/2012 12:07 UTC","Longitude":"-81.650221","Object Shape":"Unknown","City":"Jacksonville","trends":["There have been 66 other sightings in Jacksonville","There were no other sightings in Jacksonville on or around October 11th 2012"],"Date of the Event":"10/11/2012 12:00 UTC"}