{"Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=40.560792,+-79.927596(43170)&iwloc=A&hl=en\"> mufon case (43170) map </A>","Country":"United States","Object Flight Path":"Straight-line path","Tags":"City","Longitude":"-79.927596","Case Number":"43170","Log Number":"US-10112012-0029","Date of the Event":"10/06/2012 08:36 UTC","Viewing Distance":"Unknown","City":"Allison Park","divs":["Sighting Details Saturday night Oct.6 at 8:36 pm my husband and I had just pulled into the driveway. As we were walking into the house my husband stopped and said, \"what is that?\" I looked up and coming from the northwest was a round, orange object. At first we thought someone had tossed a firecracker in the air and we were waiting for it to drop. (That is how close it felt) It did not drop and slowly proceeded to cross over our house heading off to the south east. It took about 4 minutes to get to the point that we could not see the light. The orange light with a red glistening halo around it was continually visible the entire time. It never dulled. We were too mezmerized to go for a camera at seeing this strange object. What was even stranger is that it made NO sound. There was no discernable motor noise or vapor trail of any kind. We were just ready to turn and go inside when a second one came from the same direction and headed out the same way. Again it had no sound and was an orange orb with a red glistening halo. We are both in our 60s and have never experienced seeing any thing this strange in the night sky."],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Latitude":"40.560792","Date Submitted":"10/11/2012 09:04 UTC","Source":"MUFON","trends":["There have been no other sightings in Allison Park","This sighting has been favorited 1 time."],"Region":"Pennsylvania","Summary":"Sited 2. Four minutes apart. Orange/red orb. Pulsating aura. Straight NW to SE path. NO sound","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/43170.html.txt","/var/www/straped/mufon/org/43170.html"],"Object Shape":"Sphere"}