{"Tags":"City","Disposition":"Unresolved","Longitude":"-105.005203","Source":"MUFON","Object Shape":"Triangle","Summary":"Large triangle object with illuminated bottom cruising our suburban neighborhood","Region":"Colorado","Object Features":"None","Date Submitted":"10/12/2012 03:40 UTC","files":["/var/www/straped/mufon/html2text/43178.html.txt","/var/www/straped/mufon/org/43178.html"],"Viewing Distance":"501 Feet - 1 Mile","City":"Highlands Ranch","Object Flight Path":"Straight-line path","divs":["sighting detailsafter arriving home, i came outside my garage facing west to observe the seeing quality of the night sky (as i often do as an amateur astronomer). looked to the north above a tree in my yard and noticed a very distinct triangle shape gliding rapidly to the west (<) i'm guessing roughly above and parallel to town center dr. the craft was difficult to track and was lost to the background of the clouds after about 5s. object was dark grey or black in color with several white\\greyish lights on the bottom to compose the illumination i saw. the light arrangement on the bottom was difficult to fully discern, as was the rear of the craft, almost as if it was camouflaged against the silver clouds that night. the distinct v shape in front was the only thing allowing me to briefly follow it. utter silence - no sound heard at all despite its fast speed and effortless flight. my limited observation was over really fast, but it was no plane, heli, jet, balloon, etc that i'm used to seeing in the area, night or day. really wish i knew what this was!"],"Weather Factors":"Unknown","Case Number":"43178","Date of the Event":"10/07/2012 08:00 UTC","Sighting Duration":"Undisclosed","Country":"United States","Latitude":"39.54661","map":"<A HREF = \"http://maps.google.com/maps?q=39.54661,+-105.005203(43178)&iwloc=A&hl=en\"> mufon case (43178) map </A>","Log Number":"US-10122012-0003","trends":["There have been 9 other sightings in Highlands Ranch","There was one other sighting in Highlands Ranch on or around October 7th 2012"]}