{"trends":["There have been 2 other sightings in Liberal","There were no other sightings in Liberal on or around January 10th 1983"],"Viewing Distance":"21-100 Feet","Case Number":"43174","Object Features":"Unknown","Date Submitted":"10/11/2012 11:21 UTC","City":"Liberal","Date of the Event":"01/10/1983 12:00 UTC","Source":"MUFON","Longitude":"-100.912199","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Disposition":"Unresolved","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=37.048661,+-100.912199(43174)&iwloc=A&hl=en\"> mufon case (43174) map </A>","Log Number":"US-10112012-0033","Region":"Kansas","Tags":"City","divs":["Sighting DetailsWhile moving cross country from Omaha NE to Scottsdale AZ I was driving near Liberal Kansas when I became hypnotized some what to blinking lights at what seemed to be a power plant, ? power relay station. It was the only bright lights on a boring stretch of highway. If I were to have to find this location again in my life I would not have any trouble. It did have blinking lights that seemed random and I was trying to determine what the blinking lights were mounted on or what the structure was and why the lights were blinking the way they did. I was about a mile from the plant when several of the blinking lights seemed to take on colors other than yellowish orange lights of the plant. Then they formed a circle of lights and moved at high rate of speed towards me driving on the road and continued on to the town I had driven through about 5 minutes earlier. It made no noise that I could here. I slowed my speed of about 65 mph and rolled down the window and could not take my eyes of the most beautiful object I had ever seen. I stuck my head out the window and heard nothing of a sonic boom. This thing was moving fast! The thing that made it so memorable was the pattern of the blinking lights of the object. I could not make out a color of the craft, it was night. It could have been transparent for all I knew but the lights were moving around the object in straight lines but some were rolling along in a forward direction and some moving in reverse. Some were moving north west and some south east. Almost like a gyroscope. I only had a few seconds to see this so I would estimate there were 10-12 rows of lights moving in all different directions as this object flew through the sky. I would say it was about 50 to 75 feet round and flew about 100feet of the ground. In about 10 15 seconds it was hovering over the town lights of the town North East from me and was back to blinking in a random pattern. I cannot remember how long I watched it there blinking. I thought about reporting it but I was in a hurry, young, it was late, who would believe me. I shared this story with friends over the years but feel like no one has reported a sighting of anything looking like this. the colors of the lights were red yellow green blue white orange. maybe 8 10 different colors. I have heard reports of flying object hoovering over power plants and power supplies. Do you think they steal power?"],"Weather Factors":"Unknown","Object Shape":"Circle","Summary":"blinking lights turned into ball of spinning lights and traveled 10 miles in 10 seconds and then hoovered again","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/43174.html.txt","/var/www/straped/mufon/org/43174.html"],"Latitude":"37.048661"}