{"Viewing Distance":"501 Feet - 1 Mile","Latitude":"33.10717","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.10717,+-117.331737(43186)&iwloc=A&hl=en\"> mufon case (43186) map </A>","Object Flight Path":"Path with directional change,Other","divs":["Sighting DetailsIt was very early 3 am, I for no reason woke up and went out side into the driveway of my house. It was a still morning , there was what is known as coastal eddy at the time. A thick layer of fog or cloud cover with a ceiling of about 500 feet. there was another fog that could be seen off in the distance with a visibility of about a mile and a half. It was approximately 7 min. after 3am, digital alarm clock read 3:03 went I got up and went outside. I was standing in my driveway when I noticed a red glow above and to the right, I then saw the craft emerge from the fog layer above. as it emerged I could clearly see a spheroid object, essentially a cube with the corners shaved off, I have sent drawing of it to the director's email. Out from each side, top, bottom, right left front back, of course I couldn't the far side, but I could make out that there was a flame on that side too. The nature of the flames(plasma jets) were unlike that of rockets, they were thicker as in more dense it whipped around slowly but was not exausting as our jets do, pushing out thrust, these jets as I say whipped around slowly like a cat's tail except for the front jet that was being pushed by the head wind as it moved through the air. The local news reported several sightings during that time, it was reported to be a natural phenomenon and not a ufo"],"Summary":"looked up saw red glow out of low clouds came craft with plasma like curling flames","Longitude":"-117.331737","Date Submitted":"10/12/2012 01:19 UTC","files":["/var/www/straped/mufon/html2text/43186.html.txt","/var/www/straped/mufon/org/43186.html"],"Date of the Event":"08/12/2003 03:07 UTC","Country":"United States","Weather Factors":"Unknown","Disposition":"Unresolved","trends":["There have been 14 other sightings in Carlsbad","There were no other sightings in Carlsbad on or around August 12th 2003"],"Case Number":"43186","City":"Carlsbad","Source":"MUFON","Sighting Duration":"00:00:30","Region":"California","Log Number":"US-10122012-0012","Object Features":"Other, Unknown","Object Shape":"Sphere, Square, Rectagular, Other"}