{"trends":["There have been 29 other sightings in Levittown","There were no other sightings in Levittown on or around October 5th 2012"],"Object Shape":"Other","Date of the Event":"10/05/2012 05:30 UTC","Sighting Duration":"05:50:03","map":"<A HREF = \"http://maps.google.com/maps?q=40.138498,+-74.871789(43182)&iwloc=A&hl=en\"> mufon case (43182) map </A>","City":"Levittown","Log Number":"US-10122012-0008","Source":"MUFON","Viewing Distance":"Unknown","divs":["sighting detailson 10\\5\\2012 i was in my back yard taking photos (between 5:30 and 5:50 am). i belong to a paranormal and was taking photos of orbs. i started to take some shots to the north of my house, when i noticed the light anomaly. i knew it was very different from any of the lights that i have seen during an investagation but i still thought that the light was something paranormal. i took about 9 photos of a bright ciggerett shaped object that was moving in the sky (in the north).the light moved in different direction and it pulsated as it moved. there was no sound. i down loaded the files on to my computer and when i enlarged the photos you could see that the object was made up, of what looked like circles (or rings)connected to each other in a single row which was illuminated by the bright light. i was very excited thinking, that i have just taken a photo of a different type of light energy. i called my sister who is the co-founder of our group. when she saw it she said the word ufo. so that is when i got into contact with mufon. i know that if any one could found out just what this is it's mufon. i followed the object until it went down behind the trees in the distance and caught the last shot of it, as it came back up over the roof line of my house."],"Longitude":"-74.871789","Latitude":"40.138498","files":["/var/www/straped/mufon/html2text/43182.html.txt","/var/www/straped/mufon/org/43182.html"],"Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Country":"United States","Date Submitted":"10/12/2012 10:54 UTC","Summary":"Took photos of a bright ciggerett shapped objected","Region":"Pennsylvania","Case Number":"43182","Tags":"City","Object Features":"Window(s), Patterned Surface","Disposition":"Unresolved"}