{"Summary":"Starlike UFO seen for several mintues over Murrysville-Plum Borough","City":"Pittsburgh","Case Number":"43180","Object Shape":"Circle, Disc, Fireball, Flash, Oval, Sphere, Star-like","Date of the Event":"10/11/2012 12:00 UTC","divs":["Sighting DetailsI'll just paste an email I sent to a buddy of mine.... Ken, something incredible happened last night. I was out walking the dog and as I turned to go in something caught my eye in the sky over the YMCA. I called my Mother out and a neighbor; we stood and watched as a ball of light, best described as looking like a star that was very close, was moving slowly and silently across the sky directly in front of me. There wasn't a noise. Then my Mother called out 'wooo' as it moved up then down very fast. It then started to move the opposite direction on a straight line...still no noise. The brightness just cut off and all that was there was a red glow and poof \"gone\" ...all of the years I've been looking in the sky and have seen nothing, zilch...I accidentally catch a glimpse of something amazing. I now know what people go through when they're afraid to say anything because my neighbor suggested I call the air force, police or the news and I just couldn't because I didn't want to be a seen as kook...extra-terrestrial? -don't know...unidentified? ...definitely! Murrysville has been a hot spot over the years and I'll attach a YouTube link for you to see. Wow, I feel like my UFO Cherry has been popped. I am now going to invest in my astronomy body braced binoculars and it is now my official hobby. I'm only telling you this story because you're the only I can tell that listens and 'hears' on this subject. Hope you're well, Angelo"],"Weather Factors":"Unknown","Country":"United States","Source":"MUFON","Longitude":"-79.701893","Log Number":"US-10122012-0006","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Object Features":"Unknown","Latitude":"40.454768","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","Region":"Pennsylvania","trends":["There have been 122 other sightings in Pittsburgh","There were no other sightings in Pittsburgh on or around October 11th 2012"],"Tags":"City","Sighting Duration":"00:07:00","files":["/var/www/straped/mufon/html2text/43180.html.txt","/var/www/straped/mufon/org/43180.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.454768,+-79.701893(43180)&iwloc=A&hl=en\"> mufon case (43180) map </A>","Date Submitted":"10/12/2012 08:53 UTC"}