{"Summary":"I was taking pictures of isle of man on journey to Northern ireland when i took about 4 pictures of the isle of man. in these pictures there is a time window of about 5 mins but the object was there and gone within a 23 second window, seen in photos","Object Flight Path":"Stationary,Hovering then path","divs":["Sighting DetailsMy wife, daughter and myself where taking a ferry from Liverpool to Belfast. As it was there first time going to Belfast i decided to take photos of the 8 hour journey for our family album. As we passed the Isle of Man, i took about 7-8 photos of my wife and daughter as we passed the Isle, and some of the actual Isle of Man itself. It wasnt until i got back from Belfast and uploaded my photos to my Ps3, that i noticed that something was in the middle of the screen on one of the photos. I checked the other photos to see if there was a mark on my phone camera, but tere was nothing. I also checked the other photos to see if the same mark appeared in them, but nothing was there. I dont know what i is or where it went to as there is about a 25 second gap between it being there and then nothing."],"Object Features":"Unknown","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=54.236107,+-4.548056(43197)&iwloc=A&hl=en\"> mufon case (43197) map </A>","Log Number":"GB-10122012-0023","City":"Isle Of Man","Longitude":"-4.548056","Date Submitted":"10/12/2012 10:11 UTC","Country":"Isle of Man","Viewing Distance":"Unknown","Disposition":"Unresolved","Tags":"City","Sighting Duration":"00:01:00","Region":"","Case Number":"43197","trends":["There have been no other sightings in Isle Of Man","This sighting has never been favorited."],"Latitude":"54.236107","Source":"MUFON","files":["/var/www/straped/mufon/html2text/43197.html.txt","/var/www/straped/mufon/more/43197_submitter_file1__2012100713.33.01.jpg","/var/www/straped/mufon/more/43197_submitter_file2__2012100713.32.38.jpg","/var/www/straped/mufon/more/43197_submitter_file3__2012100713.32.49.jpg","/var/www/straped/mufon/more/43197_submitter_file4__2012100713.28.08.jpg","/var/www/straped/mufon/org/43197.html"],"Date of the Event":"10/07/2012 01:33 UTC","Object Shape":"Disc, Oval"}