{"Summary":"brilliant white light with an even brighter purple pulsating circle at the center... it was moving incredibly fast as it faded out into the distance---straight out into space..not towards the horizon---into a small red dot, then disappeared","Date Submitted":"10/12/2012 03:27 UTC","files":["/var/www/straped/mufon/html2text/43190.html.txt","/var/www/straped/mufon/org/43190.html"],"Object Features":"Unknown","Sighting Duration":"00:02:00","Weather Factors":"Unknown","Log Number":"US-10122012-0016","Region":"New Jersey","Country":"United States","divs":["sighting detailsi'd just stepped outside to wait for my boyfriend to start grilling his chicken when i saw in the n\\ne sky a brilliant white star shaped light, very high up, moving incredibly fast outwards, slightly towards the ne. i thought maybe it was an airplane spotlight but i didn't see any blinking tail\\wing lights...then my boyfriend cam outside (he does not believe in this stuff) and he said \"what is that!\" and we both stared at it as it moved so fast out out out. it had a circle at the center that was a lavender\\violet color... then it quickly transformed into a small red dot that slowly faded out into space... gone. but then immediately following we saw every plane in the sky go completely bonkers...flying in circles, flying straight up or straight down... they all seemed to be scattering...confused about what to do. then we saw at least 2 military planes booking it towards the west. i flipped out because i've always wanted to see a ufo...always. but never have. i felt joyful, excited and eager. eager for what? i don't know. but i'm ready. <3"],"Viewing Distance":"Over One Mile","Disposition":"Unresolved","Object Shape":"Circle, Sphere, Star-like","Object Flight Path":"Path then hovering","trends":["There have been 12 other sightings in New York","There were no other sightings in New York on or around October 11th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.720973,+-74.004613(43190)&iwloc=A&hl=en\"> mufon case (43190) map </A>","Source":"MUFON","Longitude":"-74.004613","Tags":"City","Date of the Event":"10/11/2012 12:00 UTC","Case Number":"43190","Latitude":"40.720973","City":"New York"}