{"Sighting Duration":"00:01:20","City":"Harper Woods","Object Shape":"Circle, Sphere","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsToday @ 625pm from Windsor, Ontario, Canada on my way hom, i was looking across the river to Detroit Michigan towards the downtown area and JUST a little to the left (EAST) of downtown Detroit from my position, I first noticed the 5 objects and immediately made the other people around me aware of them as well. The objects were round and close together but didnt seem to be in a pattern from my position. They each had a large bright light shining off them that seemed to cover them entirely where you couldnt see what the objects were made of, but it could be possible that they were made of light although i remember thinking that they seemed like objects that had some type of mass but i could be wrong. As i was looking at these objects just sitting there not moving in the sky and all of us asking eachother what they were or could be & having no answers or any clue & just in shock n awe by what we were seeing, we starting asking out loud if they were ufos! & at that time, one by one they just started disappearing!! The lights didnt dim & they didnt do anything, it was just that one second one would be there, then the next second it was gone! One after another, just like that! Then they were all gone, & we waited in anticipation for them to come back but they didnt unfortunately, & none of us got it on video it all just happened soo fast unfortunately so im hoping someone else out there did, that would be just wonderful! :) I've made alot of calls already to try & find out what these were & to just report them, & although everyone is very intrigued by this, i havent found any answerd yet, there were ALOT of airplanes flying around that area around that time too & there was a FEW that had those thick contrails coming from them but i dont know if that really means anything though. Thank you :) & if u witnessed a similar situation please please share! :)"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.444971,+-82.944842(43201)&iwloc=A&hl=en\"> mufon case (43201) map </A>","Source":"MUFON","Latitude":"42.444971","Date of the Event":"10/12/2012 06:26 UTC","Region":"Michigan","Tags":"City","Weather Factors":"Unknown","trends":["There have been 2 other sightings in Harper Woods","There were no other sightings in Harper Woods on or around October 12th 2012"],"Object Features":"Other","Disposition":"Unresolved","Summary":"5 objects with 1 big light on each one, in stationary position & each disappeared one by one","Object Flight Path":"Stationary","Country":"United States","Log Number":"US-10132012-0001","files":["/var/www/straped/mufon/html2text/43201.html.txt","/var/www/straped/mufon/org/43201.html"],"Case Number":"43201","Date Submitted":"10/13/2012 12:14 UTC","Longitude":"-82.944842"}