{"Case Number":"43208","Summary":"Awake at 1 a.m. looked out window and saw on horizon bright lights - 5 min. - then 4 a.m. same lights east","Latitude":"39.020308","Disposition":"Unresolved","Date of the Event":"10/12/2012 01:05 UTC","Longitude":"-80.607776","Source":"MUFON","Viewing Distance":"Unknown","Log Number":"US-10132012-0008","divs":["Sighting DetailsAwake at 1 a.m. looked out east bedroom window and saw extradonairly white, blinking lights - thought it was a constellation but only one other star in the sky and it was smaller and much duller looking - never knew a constellation would be so bright - at least 7 small blinking lights in two arcs above and about 5 blinking lights under those making a sort of eyes and mouth effect. Looked for 5 minutes or so, went back to bed - woke at about 4-5 a.m. and looked out east window again and the same configuration was now directly east! Might have been a little higher in the sky that time. Watched for about 5 minutes and it didn't seem to move. Went back to bed. My son told me not to put it on Facebook to find out if anyone else in the area had seen it - might be thought somewhat mad. I live in the country, in a hollow, and so the horizon is above the hills surrounding the home. Because it is isolated, it is very easy to see stars and constellations on a clear night. Last night was rather foggy and there was frost on the front yard when I awoke."],"Weather Factors":"Unknown","Country":"United States","Object Features":"None","trends":["There have been no other sightings in Alum Brdge","This sighting has never been favorited."],"Tags":"City","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/43208.html.txt","/var/www/straped/mufon/org/43208.html"],"Sighting Duration":"Undisclosed","Region":"West Virginia","Object Flight Path":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.020308,+-80.607776(43208)&iwloc=A&hl=en\"> mufon case (43208) map </A>","Date Submitted":"10/13/2012 12:26 UTC","City":"Alum Brdge"}