{"Latitude":"40.741227","Tags":"City","Object Flight Path":"Path with directional change","Summary":"SHOT IN FRONT OF MY CAR ON ROAD, DRIVING 35 MPH LIGHT WAS HORIZONAL AND TRAVELED IN SAME DIRECTION AS MY CAR. IT LOOKED LIKE A HIGH PITCH SOUND WAVE ON A GRAPH. 50 FT. LONG FASTER CAN MY CAR. IT WAS SOLID AND NO GLOW OFF IT. CONSTANTLY MOVING.","Region":"New York","files":["/var/www/straped/mufon/html2text/43202.html.txt","/var/www/straped/mufon/org/43202.html"],"Object Shape":"Other","trends":["There have been no other sightings in East Patchogue","This sighting has never been favorited."],"Viewing Distance":"20 Feet or Less","divs":["Sighting DetailsI WAS DRIVING HOME FROM A GIRLS POCKETBOOK PARTY . DROPPED OFF A FRIEND IN YAPHANK NY . I WAS DRIVING WEST ON SOUTH COUNTRY RD IN BROOKHAVEN , TOWARD BELLPORT. AFTER BEVERDAM RD. A WHITE LIGHT STREAK COMING FROM THE SOUTH CROSSED THE ROAD IN FRONT OF MY CAR. THEN ON MY RIGHT SIDE OF THE CAR IN THE WOODS THE LIGHT TURNED GREEN. A LONG TUBE WAS SWIMMING HORIZONTALLY THROUGH THE TREES. ABOUT 50 FEET LONG GUESSING A FOOT WIDE. I THOUGHT IT WAS A LIGHT SHOW FROM A HOUSE BUT AS I TRAVELED ALONG THE ROAD I KNEW THAT IS IMPOSSIBLE. IT MOVED FAST BUT I COULD SEE IT CLEARLY , IT WAS TRAVELING IN A WAVE FORMATION . IF YOU LOOK AT A HIGH PITCH SOUND WAVE ON A GRAPH THAT IS EXACTLY WHAT IT LOOKED LIKE. IT MOVED FAST AND STEADY ,WAVES UP AND DOWN . IT SEEMED TO HAVE A DIRECTION AND SEEMED TO MOVE AROUND A TREE NOT THROUGH IT. THAT IS WHAT SEEMED VERY STRANGE TO ME. AS IF A ZIG ZAG MOVEMENT . IT THEN WENT TOO DEEP INTO THE WOODS AWAY FROM THE ROAD. AT FIRST I THOUGHT IT WAS A LARGE LASER SHOW MAYBE FROM SOMEBODIES HOME. THEN WHEN THE LIGHT TOOK A SHARP TURN AND HAD A BEGINNING AND END THAT I COULD CLEARY SEE. I KNEW THIS WAS NOT A SHOW OR AN ORDINARY BEAM OF LIGHT. IT WAS SOLID AND TRAVELED WITH ME FOR MANY SECONDS. THE LIGHT WAS CONSTANT AND THICK EASY TO SEE. IT ABSOLUTELY COULD NOT BE MISTAKEN FOR A REFLECTION OR SOMETHING IN MY VISION . IT WAS CLEARLY A MOVING TUBE OF LIGHT. WHEN I GOT HOME I PUT A POST ON FB , TWO PEOPLE IN BOHEMIA NY 15 MIN. AWAY FROM MY SIGHTING SAW BRIGHT LIGHTS IN THE SKY, ROB TOOK A PICTURE OF IT . THE COINCIDENCES IS THAT IS WAS ABOUT THE SAME TIME I SAW THE LIGHT.. THE OTHER GIRL IS A FRIEND OF MINE SHE POSTED AT 9:00 PM TOO , I SAW THE LIGHT AT 9:30PM. FOR THREE OF US TO HAVE SEEN SOMETHING AT THE SAME TIME AND NEITHER OF US KNEW ABOUT EACH OTHER THERE MUST BE A CONNECTION . I AM ASKING IF ANYBODY ELSE IN TOWN SAW IT."],"Date Submitted":"10/13/2012 12:53 UTC","Case Number":"43202","City":"East Patchogue","Object Features":"Other","Source":"MUFON","Longitude":"-72.963","Log Number":"US-10132012-0002","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Country":"United States","Date of the Event":"10/12/2012 09:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.741227,+-72.963(43202)&iwloc=A&hl=en\"> mufon case (43202) map </A>"}