{"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Case Number":"43204","Date of the Event":"10/12/2012 07:00 UTC","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Country":"United States","Log Number":"US-10132012-0004","Date Submitted":"10/13/2012 02:39 UTC","Latitude":"33.545532","Region":"Arizona","Viewing Distance":"Over 1 Mile, N/A","Object Shape":"Bullet, Missile, Fireball, Sphere","City":"Glendale","Source":"MUFON","files":["/var/www/straped/mufon/html2text/43204.html.txt","/var/www/straped/mufon/org/43204.html"],"trends":["There have been 52 other sightings in Glendale","There was one other sighting in Glendale on or around October 12th 2012"],"divs":["Sighting DetailsWhile smoking a cigarette from my back yard, I saw what appeared to be a plane that then burst with light that formed an orange trail like that of a roman candle. I asked my girlfriend if she saw it, to which she said no. We continued to look at the sky, then saw two bright objects. The first object went straight left. The other object then appeared, coming straight down. After meeting, the first object then began to descend rapidly. Both objects began to glow and leave the bright orange trail again. I thought maybe they were missiles, or planes that caught fire. The first object then looked like it was coming straight towards us. Then, suddenly, it stopped, leveled out, then started heading horizontally to the right. There were at least two planes present when this was happening- they HAD to have seen this occurrence. Eventually, they stopped being \"on fire\" and spiraled down the west horizon. We lost track of the objects because of the suburban house in our way."],"Longitude":"-112.177887","Summary":"Two bright objects that randomly left bright orange-ish trails, zig-zagged, and descended out of sight","map":"<A HREF = \"http://maps.google.com/maps?q=33.545532,+-112.177887(43204)&iwloc=A&hl=en\"> mufon case (43204) map </A>","Disposition":"Unresolved","Object Features":"Unknown","Tags":"City"}