{"Date Submitted":"10/13/2012 11:18 UTC","Object Features":"None","Summary":"Multiple UFO's Sighted Just outside of McClure , Ohio (Near Bowling Green, Oh)","Country":"United States","Region":"Ohio","Object Shape":"Cylinder, Star-like, Triangle","trends":["There have been 5 other sightings in Bowling Green","There were no other sightings in Bowling Green on or around November 13th 1994"],"Weather Factors":"Unknown","Log Number":"US-10132012-0007","files":["/var/www/straped/mufon/html2text/43207.html.txt","/var/www/straped/mufon/org/43207.html"],"Case Number":"43207","Disposition":"Unresolved","Longitude":"-83.641553","Viewing Distance":"21-100 Feet","Sighting Duration":"01:00:00","map":"<A HREF = \"http://maps.google.com/maps?q=41.377264,+-83.641553(43207)&iwloc=A&hl=en\"> mufon case (43207) map </A>","Latitude":"41.377264","Tags":"City","Object Flight Path":"Stationary,Other","City":"Bowling Green","Date of the Event":"11/13/1994 12:00 UTC","Source":"MUFON","divs":["sighting detailsriding with a college friend late one night. we were driving south to bowling green state university. - country road near mcclure , ohio. around 3am. -traveling about 60mph and 1st, a bright white low altitude light flies over the car - traveling in opposite direction. 2nd huge ufo is observed by both myself and college friend who was driving. ufo was hovering above the tree tops - out in this corn field \\ above a small cluster of trees...maybe 200 yards from the country road. 3 red pulsating lights from the lower left to the top right - ufo lit up like a cristmas tree...very bright every color of the spectrum represented. no sound , no windows -or rockets...just glowing and pulsating. - observed for about 10 minutes. 3rd. ufo dissappears - 4th, on the opposite side of the road (western sky) 4 more ufo's appear...they were high in the sky...white light like stars...they moved a little to the left or right and then were turning on a dime. also, dropping and falling like yo-yo's. impossible areal acrobatics. these lights followed our car ..as we got closer to the city of bowling green...the lights got higher in the sky ..later my friend and i stood outside the university dorm building and witnessed a large black triangle sail over the university campus maybe 4:20am. no sound - faint and very low altitude. dim red lights at each point of the triangle craft. triangle blackened out the stars above. it appeared directly overhead and moved into the dark of night going in a southwestly direction. finally, the next afternoon local news (toledo 11 news) did stories on the sightings...aparantly, many people in the nw ohio and sw michigan area also saw lights in the sky that night. - this event happened the day before veteren's day in november of 1994. i'll never forget it - it changed my sense of self and of reality in general. also, ever since - i've had a sense of \"missing them...\" - i sometimes feel \"divorced\" from them - like they came and then abandoned me ...i wish everyday that they would come back and visit me again...i have a sense that they've abducted me from my sleep...many times.i have very faint \"memories\" of interacting with them - the tall reptoids are smart, kind and compassionate. but the little ones are cold and robotic. i have faint \"memories\" also of seeing a different world..looking out from the window of their ship. the atmosphere is pink and their are whispy clouds like on earth. looking down from the window of the ship. i recall little white \"sugar cube\" buildings on the ground below...ground looks like a desert - like the sand dunes i once saw in near yuma, arizona. perhaps i'm just imagining the \"abduction...\" i don't know. i'll never really know - but the physical sightings i saw on the country road in nw ohio were as real and plain as the nose on your face...at the same time...i really don't know what the heck \"they are\" ....i've been over and over with that night in my mind. in the end , i'm left with only questions -and no answers. i just wanted to tell my story honestly. i wish i could talk about what happened - and my 'feelings' connected with this matter - i always have this sense about them - i wish i had some support or community where i could discuss this topic and try to bring greater bredth and depth of understanding about the phenomenon. i'm not a writer or a good \"speller\" so ...so sorry."]}