{"Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","Tags":"City","Date Submitted":"10/13/2012 01:27 UTC","Case Number":"43209","Latitude":"38.588001","Region":"Illinois","files":["/var/www/straped/mufon/html2text/43209.html.txt","/var/www/straped/mufon/org/43209.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.588001,+-89.89485(43209)&iwloc=A&hl=en\"> mufon case (43209) map </A>","trends":["There have been 4 other sightings in O'Fallon","There were no other sightings in O'Fallon on or around October 12th 2012"],"City":"O'Fallon","Log Number":"US-10132012-0009","Country":"United States","Longitude":"-89.89485","Object Shape":"Fireball, Sphere","divs":["sighting detailsmy woman was driving my car from the bank atm towards our home at 11:25. i was sitting on the passenger side. then, she stopped at a stop sign when i noticed two strange red\\orange kind of pulsating lights around 150 meters from our car, and around from 45 feet to 80 feet above the ground. next, she made a right turn, she passed the rail road when i asked her to pull over. she pulled over, i opened the sunroof and we witnessed more lights following the path of the first two lights. then, she started freaking out and she told me to close the sunroof, and i told her to resume driving home (which is located about 5 minutes from the initial sightings). then, as she was driving, i decided to call 911 in order to let the local authorities know about the incident. after that, we arrived home and she parked quickly. at this point she was crying after i noticed that the lights were coming towards us, so i told her that we should get inside the house. then, the all the lights started to hover at the same time, which was completely freaky. then, i saw the lights vanishing or dimming from the dark sky. next, we saw an air plane. finally, we got inside the house and i called her mom to calm her down, as she was having a panic attack. i grabbed my gun and cautiously started checking the rooms. very freaky stuff!"],"Summary":"Over 15 red/orange lights following each other in straight path for 5 min., changing direction, hovering, and then vanishing from sky.","Object Features":"Unknown","Sighting Duration":"00:06:00","Disposition":"Unresolved","Source":"MUFON","Object Flight Path":"Path with directional change,Path then hovering,Other","Date of the Event":"10/12/2012 11:30 UTC"}