{"trends":["There has been one other sighting in Laguna Woods","There were no other sightings in Laguna Woods on or around October 12th 2012"],"Date Submitted":"10/13/2012 08:42 UTC","Object Flight Path":"Path then hovering","Sighting Duration":"Undisclosed","Object Shape":"Blimp, Disc","Country":"United States","Case Number":"43218","City":"Laguna Woods","map":"<A HREF = \"http://maps.google.com/maps?q=33.618801,+-117.72314(43218)&iwloc=A&hl=en\"> mufon case (43218) map </A>","Region":"California","divs":["sighting detailson my way home from work. friday 10-12-12 at 7:28 pm. southbound on the 241 toll rd from newport beach, ca., coming down the hill toward pacific park exit, aliso viejo. to my left outside driver window saw an object w\\ 2 rows of 8 white lights, horizontal pattern and a red light rotating around the top. the lights would blink out and reappear. the two rows of lights would resemble 4 cars parked next to each other and 4 cars stacked on top of them all with headlights on except the spacing of the lights were identical and fairly close together. each row of lights operated independently. they would fade as an entire row and after one of the rows of lights faded, the other row would fade on or off after. additionally both rows of lights would fade on or off simultaneously. this activity went on for several minutes. blinking on or off every 10-12 seconds until i drove out of sight due to the terrain. the object seemed to hover in place except when the lights would blink out it appeared to change position in a horizontal linear path as the lights would blink back on. the blinking was not fast but a quick fade on and off."],"Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Source":"MUFON","Latitude":"33.618801","Log Number":"US-10132012-0018","Date of the Event":"10/12/2012 07:23 UTC","Longitude":"-117.72314","Tags":"City","Summary":"Southbound on the 241 toll rd from newport , coming down the hill toward Pacific Park exit, to my left ouside driver window saw an object w/ 2 rows of 8 lights, horixontal pattern and a red light roatating around the top, would blink out and reappear.","Object Features":"Dome","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/43218.html.txt","/var/www/straped/mufon/org/43218.html"]}