{"files":["/var/www/straped/mufon/html2text/43210.html.txt","/var/www/straped/mufon/org/43210.html"],"divs":["Sighting DetailsThis event takes place over about a 4 hour time frame. It started around 9:00 pm (october 12, 2012) then ended around 1:00 am (october 13, 2012). I saw three strange occurrences and then a few smaller occurrences. At about 9 pm I stepped outside of my apartment (grand rapids) to talk on the phone with my friend. After a few minutes of talking I noticed a bright light in the South west sky. At first i thought it was either a star or a plane, but realized that it was moving to fast and was not blinking like a plane. I also could not hear any sound from it. The object was also huge. It looked like it could be the size of an orange from the distance i saw it. I asked my friend if he could see the bright object as well and he could. He was about 15 miles away in Kentwood. The object must have been moving really fast because the whole thing lasted about 5 minutes (if that). It moved in a straight line from SW to the NE. It did not seem to follow the curve of the Earth like a plane might but continued straight (in the direction under Orion). The object really didnt change too much in size as it passed but when it got to a certain point in the sky, it turned red the shrunk or moved away rapidly. It almost looked like a red shift. It is hard to describe, but it looked like it vanished, but not over the horizon. It was moving really fast. I've seen planes move over head in the past and they go slow. I've also seen satellites but they were always really faint. This was the brightest thing in the sky. Also it left no trail or streak (like a comet or a meteorite). So basically it moved in a straight line, it was huge, and it was bright. It moved really fast, left no trail, made no sound and it turned red and vanished. It was exciting, and I was shocked when I saw the bright object. I love to look at the sky and stars but have never seen this before. Immediately after seeing this my friend told me to look back in the SW and SE sky. We noticed a lot of planes (about 10) all roughly the same distance from us. It was strange because those were not there before and they were all heading away from the airport. About 45 min later, I was still talking to my friend about the huge bright light we saw. I was looking to the North, Still in the same location I was before, and I saw this bright triangular thing (about the size of a quarter) move across a short distance in the sky. This lasted maybe about 5 seconds But i could clearly see the shape. Basically it was like having a triangular light bulb in the sky. My friend couldnt see though. It was almost like a flash. The triangle came from the west (in the north) and moved north east. As it moved (in the 5 seconds or so that i saw it) its lights turned off but i could still see the triangular outline of it. Then it was gone. At first I thought it might have been an air force stealth fighter, I dont know, maybe they scrambled jets because of the first bright light. But I didnt think a stealth fighter would illuminate like a light bulb. Basically the triangle moved in a straight line, was illuminated then \"switched off\" its lights. In terms of color, I guess the object was black, but that might have been a result of it suddenly going dark. At this point I felt a sort of rush. I never thought i would see such strange activity. Throughout this I just stood and watched this and the other event happen. After watching this I went back inside because i was getting cold. I told my wife but she thought pretty much laughed at me. At around midnight (now the 13th) I went back outside to see if anything else was happening. I am not on the phone with anyone and there is no on else out side on my street. I knew that it was a good night to see stars and planets any way so I stood out side trying to come to terms with what i saw earlier. Just to explain, I stargaze a lot. I am big into to astronomy and space. I have never seen anything like this or the other two occurrences before. Well, I am outside looking North East into the sky. I can see a few meteors hitting streaking by but one caught my eye. It moved from the high east (Like over 80 degrees in the sky). it was streaking towards the north and down. As it came down it stopped, did a loop and went back in the direction it came from but with out a streak. It was too far away for physical details and only lasted a few seconds but it was shocking. I bring this up because it is the reason I saw the third surprising event. As I am looking up (NE) I notice a dim dark red light appear in the sky (lower than cloud cover if there were clouds). It seemed to come out of nowhere, but i wasn't focusing on it at the start. When I did focus on it it was moving over head of my location heading south west. It was moving slower than the first object but was definitely not a plane. It was close and i could make out details. As it passed over it was actually two circles (looked about the size of a basketball) in a line almost touching each other. I think they might have been connected. This seemed close, like really close (lower than a plane would fly). As it passed over, almost directly overhead i could clearly make out some details. The thing was a dark dark red. I thought it might have been translucent ( not invisible or directly see through though). There was a circle in the middle of each of the bigger circles and straight lines running from the outside edge to the center on both. the center was like a lighter or greyer red than the rest of the object. the object didnt give off a bright light or anything. It was like a really dim glow. it didnt cast red down on me or make the rest of the area red. it just glowed red. Anyway it passed over fairly slow and lasted about 2 to 3 minutes. It then just sort of disappeared in the SW. I lost it behind the High-rise buildings in grand rapids. This sighting was almost terrifying and exhilarating at the same time. Ive never seen this before. I felt like I couldn't move or talk, mainly i guess because i was excited. after that I went back inside and tried to tell my wife again but she had fallen asleep. I believe in aliens simply because it is a big universe , but i have a tendency to be skeptical about UFO's, i guess until last night. I am not sure entirely what else to say. I would give more detail of where i saw it but I dont want to say where i live. All i will say is that this happened within the city of Grand Rapids and that I do not have a tendency to confuse things with other things or jump to conclusions."],"City":"Grand Rapids","Disposition":"Unresolved","trends":["There have been 45 other sightings in Grand Rapids","There were 3 other sightings in Grand Rapids on or around October 12th 2012"],"Viewing Distance":"Unknown","Log Number":"US-10132012-0010","Country":"United States","Object Shape":"Circle, Fireball, Triangle","Case Number":"43210","Longitude":"-85.663836","Date of the Event":"10/12/2012 09:30 UTC","Source":"MUFON","Summary":"First saw huge star like object move, then saw triangle, then saw two orbs","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.97054,+-85.663836(43210)&iwloc=A&hl=en\"> mufon case (43210) map </A>","Object Flight Path":"Straight-line path,Path with directional change,Other","Weather Factors":"Unknown","Tags":"City","Date Submitted":"10/13/2012 02:09 UTC","Object Features":"Patterned Surface, Other","Latitude":"42.97054","Region":"Michigan"}