{"Disposition":"Unresolved","Sighting Duration":"Undisclosed","trends":["There have been 49 other sightings in Huntington Beach","There were no other sightings in Huntington Beach on or around October 11th 2012","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Longitude":"-117.981169","Case Number":"43219","Date of the Event":"10/11/2012 06:07 UTC","Object Flight Path":"Straight-line path","Date Submitted":"10/13/2012 09:24 UTC","Source":"MUFON","divs":["Sighting DetailsA UFO I sighted and photographed in Huntington Beach at sunset 10-11-2012 After the first full day of rain in many months I decided to avoid the interstate coming home from Irvine and enjoyed a nice drive along the water instead. I took these shots with my iPhone right at sunset using new iPhone software which improves the camera performance and adds a Hi Def feature that produces 2 shots for each one you take... the first is regular and the second is an average of three shots that are summed in to one after the contrast and brightness are compared to produce the best spread of picture quality. It's a good thing I got two, because if all I got was the second one I think people would have thought the orb was a reflection of the sun somehow because it's positioned exactly in line with the center of the sun vertically in that shot. The first shot gives you some idea how fast it was traveling in relation to cloud cover in the 6 to 7 seconds it took to get the second shot off. I managed to get the car window down at a stop light at the intersection of PCH and Newland (GPS Tagged) and squeeze two shots off before I had to get back to driving. Details: I like cameras that data stamp the images. The image property dialog for the photos shows they were taken at 6:07 PM, and the specific location of the photos is Latitude 33; 38; 38.9999999999999 by Longitude 117; 58; 51.0000000000001. I had been following the coastline heading generally west-north-west from Newport Beach after leaving work at an automotive business in Irvine at 5:45. For the last 3 months I've been driving a new 2013 KIA Soul, which has impressively large windows around the front giving me a much larger view of the sky than I'm used to. Because of that I've been enjoying a much better view everywhere I drive, and chose to drive along the beach going home that night because of the highly reflective spectacular views we get after an all day downpour. This was the first day of rain we've had since the beginning of the year. When I got to this intersection I had already thought it would be nice to get a shot of the sunset using my iPhone which was connected to a charger in a tray within reach. I was trying to anticipate whether I'd have enough time to boot up the function before the light changed, and had begun to look at the sunset with a critical eye when I noticed the anomaly. My first impression was it must be a reflection, so I used the window switch to automatically lower the window completely. As the window lowered the object remained and I noticed movement. My mind was still very much on taking a picture of the sunset so it was fortunate I didn't freeze and just sit there wondering what it was. Instead it just seemed important enough to get that shot no matter what, so I grabbed the phone and opened the camera function. As I looked back at it I probably focused on it the first time, and that's when I got confused about what it could be while I got the first shot. At first I actually thought it fit the basic shape and dimensions of a gigantic hot air balloon with a saucer shaped gondola close below it. It had a round orb shape that was somehow separated from a crescent below, and the whole thing was glowing like it was lit up from within, but the movement was not synchronized to any other movement such as the air current or cloud layers. It was traveling AGAINST the direction of the clouds movement at a rock steady pace. I've seen enough air traffic around the Los Angeles basin to know this was not a wing light or anything augmented by the other required flashers you see in typical air traffic. This object was also far out over the water and heading toward LA, and it was just too big and too evenly lit to be a normal airborne object. It was going a bit too fast to be the Goodyear blimp which I've seen a thousand times, and at the same time I had the impression this thing was making temporary stops along a very precise linear route as I watched it. Eyes tend to do that when they look for a reference point to compare movement, so it may have been a false perception of jitter. I also kept glancing at my camera because it takes 7 seconds for the iPhone 4 to cycle through calculating the Normal & HD versions of each picture you take with the new software revision. The 7 seconds seemed shorter but I was distracted. Planes approaching LAX also follow a normal approach pattern that invariably makes them line up evenly spaced approaching the airport in a slow decent that brings the planes closer to the ground at this point, and the landings are timed to be within a window of about an hour going in to sunset so the residents around the airport aren't constantly annoyed by landings at night. As a result the most traffic occurs around the onset of twilight and stays packed with an average of 20 or 30 planes in landing patterns until the area clears up around sunset. I only saw one other airplane in the sky, much further north. It was sputtering out short vapor trails or chem-trails. That was interesting in that the short chem-trail was lit up nicely by the sun's setting rays and did a great job of lighting up the spray to make it look like a fire trail behind the plane which looked like a small dot in front of it. The lack of wind to disperse the chem-trail showed the lack of air movement, and the plane doing the spraying was going very slowly by comparison, which really contrasted the relatively high speed of linear movement the UFO object was involved in. I couldn't help but think that if the UFO had a very reflective body it would reflect the sun in this particular match of brilliance, but not clear through to the top as though it was transparent, but on the other hand if you wanted to \"cloak\" an object... what if you had something that could project a reflection on one side over to the other? Depending on the angle of view to an observer I suppose 90% would see a reflection of the open sky in a fair match of the prevailing color, but at sunset you risk having one specific angle that exposes the point of light created by the sun, if you happen to be in just the right angle to see that part of the sky reflected in the object. I do think it's very strange not just to have a ball of glowing light, but it obviously has a dark separation which makes it look like a bisected circle or even a second smaller object just below a larger one. This slash in an otherwise perfect circle looked hazy like it could have been a strand of cloud cover or even a blurring object obscuring the sphere. It's remarkable that the same obscuring is seen in both photos, which tends to eliminate the possibility of cloud cover. It even reminds me of the rings of Saturn. I think we can rule out the Stars and Planets in this case, and also the assorted man made airborne things other than perhaps the few things that relate to the general shape; balloons and parachutes or paragliders, but in each of those cases the speed and size would tend to rule them out as well. It is a very strange shape, and the swath of cloud colored darkness bisecting the ball does look like a strange kind of cloaking touch when magnified. I managed to just get the second shot off when the traffic light changed and as much as I'd have liked to stay, I had to get going, so after I began to move forward I looked back to try to spot it for a third shot, and it disappeared by dimming itself out. I lost track of it. This whole experience only took around 45 to 60 seconds, so I feel very lucky to have gotten a pair of pretty clear shots off. I can count my number of focused nighttime shots without flash that looked sharp on one hand. It's also a bonus to have this kind of new HD \"averaging\" software that can extrapolate a good range of contrast and sharpness by comparing a range of results for the best final shot. I'm really impressed by this simple phone cam, you know? For once!... Not an overly blurry and streaked image. This is actually very realistic and true, down to the swath of dark across it, and the glow it had. Very strange."],"Country":"United States","files":["/var/www/straped/mufon/html2text/43219.html.txt","/var/www/straped/mufon/more/43219_submitter_file1__IMG0139.JPG","/var/www/straped/mufon/more/43219_submitter_file2__IMG0140.JPG","/var/www/straped/mufon/more/43219_submitter_file3__IMG0141.JPG","/var/www/straped/mufon/more/43219_submitter_file4__IMG0142.JPG","/var/www/straped/mufon/org/43219.html"],"City":"Huntington Beach","map":"<A HREF = \"http://maps.google.com/maps?q=33.644348,+-117.981169(43219)&iwloc=A&hl=en\"> mufon case (43219) map </A>","Object Shape":"Circle, Disc, Saturn-like, Sphere","Latitude":"33.644348","Log Number":"US-10132012-0019","Summary":"Large glowing bisected orb in line flight toward Los Angeles photographed","Object Features":"Unknown","Tags":"City","Region":"California","Viewing Distance":"Over One Mile"}