{"Sighting Duration":"Undisclosed","Region":"Virginia","Country":"United States","Source":"MUFON","Date of the Event":"10/13/2012 12:00 UTC","City":"Blacksburg","Tags":"City","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=37.22932,+-80.42387(43226)&iwloc=A&hl=en\"> mufon case (43226) map </A>","Object Flight Path":"Straight-line path","trends":["There has been one other sighting in Blacksburg","There were no other sightings in Blacksburg on or around October 13th 2012"],"Weather Factors":"Unknown","Latitude":"37.22932","Longitude":"-80.42387","files":["/var/www/straped/mufon/html2text/43226.html.txt","/var/www/straped/mufon/org/43226.html"],"Summary":"A 3 lighted obect was chased by 6 fighter jets","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Case Number":"43226","Date Submitted":"10/13/2012 11:25 UTC","divs":["sighting detailstoday, 10\\13\\12 at the virginia tech- duke football game i witnessed something i cannot explain. i have never seen or reported anything like this before, but this was simply amazing i was sitting in the upper deck with my daughter and friend just after halftime. another dan pointed up to the sky. there were 6-7 fighter jets flying with streams behind them. there were four in a straight line in fairly close formation. another jet was way off to the east. and two more were side by side directly behind the four. several people were pointing up. while i was watching the jets i noticed a strange object. it had three lights. two on top and a third below. it was flying north at the same speed or slightly slower than the jets. it crossed the sky and many people made comments about it. suddenly the object just took off and zipped away. we could still see the fighters but the object vanished. i forgot about until later this evening. i told my wife about and we decided to \"google\" it. i did not find any reports of this incident today but i found a couple of similar storied from last year and. a youtube video from earlier this month with the same light pattern i described. just thought i'd report this and see what other people think."],"Log Number":"US-10132012-0025","Object Shape":"Square, Rectagular, Triangle"}