{"Longitude":"145.160394","map":"<A HREF = \"http://maps.google.com/maps?q=-37.801189,+145.160394(43225)&iwloc=A&hl=en\"> mufon case (43225) map </A>","Object Shape":"Circle, Other","Region":"Victoria","Sighting Duration":"Undisclosed","Case Number":"43225","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/43225.html.txt","/var/www/straped/mufon/org/43225.html"],"Date Submitted":"10/13/2012 11:16 UTC","Date of the Event":"10/14/2012 12:35 UTC","Tags":"City","Summary":"Black doughnut UFO Daylight Sighting & Red Orb","Object Flight Path":"Path with directional change","Latitude":"-37.801189","Source":"MUFON","divs":["Sighting DetailsI was on my daily walk in the eastern suburb of Melbourne. Looking down my street I noticed a strange object flying slowly from north to south. When I first spotted the object it was directly to my east. The object was black in colour and the exact shape of a doughnut.... large circle with a hole in the centre. Generally it was moving slowly toward the south however I did notice it twice looped back to the north in a circle motion and resumed a southerly direction. Down the street from me is a police officers home and I asked him what it was as he was in his front yard. He was just as confused as myself. Taking distance into consideration the object was comparable to the size of the houses I could see at a similar distance on a hill. I took a total of 5 photos but strangely nothing showed in the photos except one photo when the object was at a distance to me. I also observed a red sphere travelling in the same direction, at a similar altitude however it was much smaller. I would guess the size of a basket ball. It did not reflect light. I took a photo as it was in line directly above a power pole to find the object but it also did not show in the photo."],"Weather Factors":"Unknown","trends":["There has been one other sighting in Blackburn North","There were no other sightings in Blackburn North on or around October 14th 2012"],"City":"Blackburn North","Object Features":"None","Log Number":"AU-10132012-0024","Viewing Distance":"101-500 Feet","Country":"Australia"}