{"Object Shape":"Star-like","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Object Features":"Unknown","Source":"MUFON","Tags":"City","Region":"South Carolina","Viewing Distance":"Over One Mile","Longitude":"-82.28214","Date Submitted":"10/14/2012 01:52 UTC","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Latitude":"34.420068","Case Number":"43231","map":"<A HREF = \"http://maps.google.com/maps?q=34.420068,+-82.28214(43231)&iwloc=A&hl=en\"> mufon case (43231) map </A>","City":"Donalds","Country":"United States","Summary":"Bright object observed directly overhead movining in NNE direction with no flashing lights as do airplanes even when viewed with12X25 binoculars.","files":["/var/www/straped/mufon/html2text/43231.html.txt","/var/www/straped/mufon/org/43231.html"],"divs":["Sighting DetailsI had just returned to my camper after hunting that evening when I glanced up as I sat down and noticed a very bright object directly above me. My first impression it was a very bright star but I quickly realized it was moving rapidly to the North Northeast. I had my binoculars on me from hunting, but could see little more detail other than that the light seemed eliptical with the widest part perpendicular to its flight path. As it approached the horizon I noticed an airplane directly ahead of the object and it seemed to be overtaking the airplane, though it was hard to be sure since I could not be sure both were at the same altitude. I could see the airplane's wingtip lights (red and green) and its flashing white light. This object hard only a very bright white light that was of constant intensity. If this was an airplane with its landing lights on, then the lights should have dimmed or disappeared as it moved toward the horizon away from me, but the light remained a constant brightness the entire time and no wingtip lights ever became visible. The airplane appeared to a large jet (passenger or military) flying at high altutude probably around 30,000 and the object seemed to be near the same altitude but I can't be certain. I am sure that it was not significantly higher or lower; I doubt there could have been more than 5,000 ft. above or below the airplane's altitude. I'm basing that on the similarity of their trajectory as they approached the horizon and decrease in size with distance. Also, there was absolutely no noise from the object but that might be expected given the altitude it was traveling. I'm not saying this was necessarily an alien craft, but it certainly did not appear to be a conventional aircraft. I don't believe it was the sun's relection off the object as the sun had set for a while and there was no such reflection off the jetplane. Also, there was no change in color or intensity of the light from the object. So if you have any ideas what the object was other than a UFO, please me know."],"Date of the Event":"10/11/2012 07:30 UTC","Log Number":"US-10142012-0004","trends":["There have been no other sightings in Donalds","This sighting has never been favorited."]}