{"Disposition":"Unresolved","Object Shape":"Cross","Viewing Distance":"Over One Mile","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.487967,+-86.126203(43239)&iwloc=A&hl=en\"> mufon case (43239) map </A>","files":["/var/www/straped/mufon/html2text/43239.html.txt","/var/www/straped/mufon/org/43239.html"],"divs":["Sighting DetailsI was taking my son to school on the morning of October 11, 2012. I travel from the West of Kokomo to take him there (my 7 year old daughter also rides along each morning). On Thursday the 11th, after I had made it into city limits, I was going east on West Boulevard. As we approached Dixon Rd, my son and daughter both were noticing the many jets and contrails that were visible on the eastern horizon. It was a crisp morning, and the contrails of the jets were all staying short in length, thus all looking like comets in the sky. We had noticed 3 jets that by chance had formed a large triangle in the sky, directly east of us. This is when I first saw the unidentified object. As I looked at the triangle pattern of the jets, I noticed a brighter light approach from the south. At first I thought it was another jet. But this object appeared quite a bit closer than the planes and maybe lower altitude. I made this assumption of distance based on the fact that the object left no contrail whatsoever, and the apparent speed was much faster than the planes. I need to add that the sun was just below the horizon, so many of the planes would brighten from time to time as the angle of the sun and plane became just right to reflect towards my observing point. This object was brighter than the brightest reflection I had noticed that morning, and it was unwavering. I don't know if it was reflected light, or light being emitted by the object, but it was a golden sort of color. As I mentioned before, the apparent speed was faster, so my attention went from the 3 jets to this object. I watched for about 20 seconds as it approached the area of the sky that the planes occupied. It didn't change direction, but it didn't stay perfectly straight either. The object dipped or swerved a couple of times as I watched. It just seemed to have a quickness to it, unlike what is typically seen in planes during normal flight. I have NEVER seen anything I couldn't explain after long observation and research. But what happened next, I have yet to find explanation for. Since I was driving, I unfortunately had a line of trees come between us and the object for about 10 seconds. My son and I were both saying \"hurry up!\" to the car in front of us, so we could continue watching. The planes came back into to view, but the object was not there. However the direction it was traveling should have taken it past the trees and into my view anyway. But it had not passed by. Because I had not seen the object travel on in its expected path, I kept scanning that spot of the sky as I continued on towards my son's school. About 2 minutes after the original sighting, right in the area I had last seen the object, I saw a faint light, but bright enough to see in a brightening sky. I looked at it, and it brightened quickly to what I would say was a Venus brightness, and then faded out and was gone! But as it had started to fade, I saw what looked like a cross shape in the light. It was not moving at all. It was not an airliner; it was way too big. But I made sure to continue watching for movement to confirm it wasn't a plane that had reflected light. But if it was, it was large enough that I would have seen the plane against the now bright blue sky once the reflected light faded, (if it was reflected). I have done this in the past: seen a slow moving light that caught my attention and then faded, and just continued to watch it until I could resolve the body of a jet in the sky; but this simply faded away and disappeared completely. This \"cross\" was at least 3 times as big as any airliner silhouette I have ever seen against the sky. By that I mean in this area, not near a large airport where planes are descending and ascending. I had yelled \"there it is!\" at my son as I saw it come into view the second time, but he did not see that appearance. So how does this make me feel? First I must explain: I have always loved astronomy. I have owned an 8 inch Schmidt-cassegrain and various refractors and mak-cass's. I have spent many evenings and nights simply looking up at the sky, or using my scope looking for Messier objects. My understanding of the vast distances of space, and the small scale of our little solar system, made me a UFO skeptic; even if alien civilizations existed, they simply couldn't find us, or if they did, get here. I also like to observe iridium flares. I understand them, and know them when I see them; whether I looked for a scheduled one, or happened to witness one I didn't know was coming. I have NEVER seen anything strange or unexplainable. Remember the \"Kokomo Boom\"? I was walking into work the night it happened. I didn't hear the boom because I had just walked into the factory. But I did see the bright flares right before I went inside. I have seen them many times; the military flares. I have heard some were saying they saw a \"plane crashing\". That is the kind of emotional reaction I have not been given to. I saw the flares dropping in their typical pattern, and thought no more of it. The boom would have scared the heck out of me, but I would have never associated it with a UFO. What I saw has made an impact on me. For the first time, I cannot explain it. I felt as if I was watching something go into another \"dimension\" when I saw the light and the structured shape disappear. I even took it as a \"sign\" when I noticed on a forum yesterday, that daylight UFO sightings have been on the rise. I almost feel as if what I saw, was someone or something trying to get us to see them, but not en mass so as to cause hysteria. I never thought I would even entertain thoughts like that. But I now realize that honest people all over the world, have seen things they just can't explain, and would like to someday have answers. I am now one of them. I know this may be a boring sighting by comparison. With no video or photos or contact. But I am a skeptical person who was 100% sure all UFOs were explainable. I know what I saw; I have never seen anything like that before; I believe I watched something disappear from sight. I wanted it documented this way, as to preserve the incident. So I found this website after a search. That is how much it affected me; that I, a skeptic, would feel compelled to preserve it."],"Object Features":"Unknown","Log Number":"US-10142012-0008","Object Flight Path":"Path with directional change","Latitude":"40.487967","Case Number":"43239","Date of the Event":"10/11/2012 07:50 UTC","Source":"MUFON","City":"Kokomo","trends":["There have been 61 other sightings in Kokomo","There were no other sightings in Kokomo on or around October 11th 2012"],"Date Submitted":"10/14/2012 05:40 UTC","Weather Factors":"Unknown","Summary":"Witnessed bright object travel from SE direction to approximately due East of my location, then disappeared, reappeared after short time, but only for seconds.","Region":"Indiana","Sighting Duration":"Undisclosed","Longitude":"-86.126203","Country":"United States"}