{"Longitude":"-118.220078","trends":["There have been 13 other sightings in Glendale","There were no other sightings in Glendale on or around October 14th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.201633,+-118.220078(43240)&iwloc=A&hl=en\"> mufon case (43240) map </A>","Case Number":"43240","Latitude":"34.201633","Object Shape":"Star-like","Tags":"City","Summary":"Starlike in the line below orion's belt, flashing crazy colors moving slow and randomly, 2 nights in a row","Date of the Event":"10/14/2012 02:01 UTC","Log Number":"US-10142012-0009","files":["/var/www/straped/mufon/html2text/43240.html.txt","/var/www/straped/mufon/org/43240.html"],"Source":"MUFON","Sighting Duration":"08:00:00","Viewing Distance":"Over 1 Mile, Unknown","City":"Glendale","Object Flight Path":"Path with directional change,Unknown","Object Features":"Other","Country":"United States","Weather Factors":"Unknown","Disposition":"Unresolved","Date Submitted":"10/14/2012 05:56 UTC","divs":["Sighting DetailsMe and a friend were outside my home up in the hills near Glendale community college in Glendale, California, two nights in a row now, when it gets dark and the stars come out, there's this bizzare starlike object, looks so different from all other stars in many ways: 1) it's lower (closer to horizon) than all other stars, 2) it's brighter and constantly changing colors randomly, red, green, blue, purple, 3) me and my friend were staring at it for a while, ten fifteen minutes straight and both came to the conclusion that it is not stationary, moving so slightly that u had to stare at it a while to notice the movement, goes left, stops, right, stops, towards us, stops, back, stops, all so slowly, always changing color. We pointed it out to a visitor arriving and he noticed movement as well. Just so bizzare, what is this please tell me? It has been two nights in a row now. It's still out there, anyone can see it. If u draw a line down towards the horizon starting from orion's belt, it's right along that line..."],"Region":"California"}