{"Tags":"City","Source":"MUFON","Latitude":"49.229624","files":["/var/www/straped/mufon/html2text/43247.html.txt","/var/www/straped/mufon/org/43247.html"],"Object Shape":"Circle, Fireball","Summary":"Witnessed two balls of fire cross in front of our home and after they disappeared a third ball of fire crossed the same path..","Disposition":"Unresolved","Log Number":"CA-10142012-0020","City":"Nanaimo","Date of the Event":"10/13/2012 07:30 UTC","Case Number":"43247","Country":"Canada","map":"<A HREF = \"http://maps.google.com/maps?q=49.229624,+-123.984022(43247)&iwloc=A&hl=en\"> mufon case (43247) map </A>","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Sighting Duration":"Undisclosed","Longitude":"-123.984022","Region":"British Columbia","divs":["Sighting DetailsWe were at home watching World Series Baseball when we noticed two large round balls of fire heading from East to West over the ocean we face in Nanaimo, B.C. At first we thought it might be fireworks or falling stars.When we went out on our front deck with binoculars, the two balls remained the same distance apart at all times, and appeared to descend towards the ocean and then veered northward to the West until they disappeared out of our sight range into the atmosphere. At this point we were shocked and questioning what we had just witnessed when a third ball of flame came from the exact location of the first two balls and seemed to followed the exact same path as the first two. The following day, today Sunday, we decided to see if other people had witnessed what we had seen and found 7 other people had blogged onto the Vibe sight. Our son encouraged us to send in our report to you. We believe that because our home is located half way up a mountain that we had an advantageous view."],"Weather Factors":"Unknown","Date Submitted":"10/14/2012 02:55 UTC","Object Flight Path":"Path with directional change,Path then hovering","trends":["There have been 4 other sightings in Nanaimo","There were no other sightings in Nanaimo on or around October 13th 2012"],"Object Features":"None"}