{"Date of the Event":"10/11/2012 04:50 UTC","trends":["There have been no other sightings in Chatham","This sighting has never been favorited."],"Latitude":"42.38859","Disposition":"Unresolved","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=42.38859,+-73.558564(43249)&iwloc=A&hl=en\"> mufon case (43249) map </A>","City":"Chatham","Viewing Distance":"Over One Mile","Object Features":"None","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/43249.html.txt","/var/www/straped/mufon/org/43249.html"],"Sighting Duration":"00:02:15","Case Number":"43249","Date Submitted":"10/14/2012 05:05 UTC","Summary":"Spotted a pin head shaped reflextive object hovering at altitude","Object Shape":"Sphere","Tags":"City","Longitude":"-73.558564","Source":"MUFON","Country":"United States","Log Number":"US-10142012-0022","divs":["Sighting DetailsAt 4:50 pm on the day of 11 October, 2012. Driving home from work, i had to take the south bound lane of the Taconic State parkway, after getting on the parkway at the Chatam enterance off route 203, i had spotted 2 jets with very short con trails and watched them as i drove. It was colder that day then others during the week, there were no clouds and sunny. The airline traffic witnessed was flying on a southernly path, as i looked to see the airliners the third time, i witnessed a shiny, round, very reflective object in the sky at aproximately a 60 degree asmuth, that was very reflective. The object showed no con trail as the airliner flights had displayed, the object was very small almost resembling a round polished silver push pin head. I thought this was odd. and watched as i slowed my car, the object did not appear to move, i had rolled my window down and looked at the object for aproximately 30 seconds and from unobstructed views. The third time i looked for the object it was not anywhere to be seen. I was not sure what to think of the object when i first saw it. I have a naval background where i worked as an operations specialist for 4 years and in charge of intell for my ship. I have been trained to observe and report. I lost sight of the object between observing and trying to keep the car on the road as i slowed down, the parkway does not have an emergency break down lane to pull over to. i could not get my phones camera to operate quick enough to try to get a picture."],"Region":"New York"}