{"Weather Factors":"Unknown","Log Number":"US-10142012-0024","Viewing Distance":"Over One Mile","Date Submitted":"10/14/2012 07:35 UTC","Source":"MUFON","City":"Roseville","Tags":"City","Country":"United States","Object Features":"Unknown","Latitude":"38.758914","Summary":"In the car at a stop light - multiple witnesses. Near foothills/pleasant grove","Case Number":"43251","Disposition":"Unresolved","Longitude":"-121.283296","divs":["Sighting DetailsI was on Pleasant Grove, in the left-hand turn lane, waiting at a red light. I had two friends in my car with me - we were going to pick up another friend who lives in Roseville and go to BJ's for some beer, as it was a Saturday night. Me and my buddy were mid-conversation when we noticed 12 or so orange lights in the sky. We suddenly became excited and showed our other friend and began speculating any logical explanation. As we were talking the car next to us rolled down their window and asked us if we saw the lights, and seemed very excited as well. Our first assumption was UFO's - immediately. There were about 7-8 in a pattern, close together, and then another 4-5 behind them, in another clump. The formation wasn't jet-like formation, they were distanced some, but the grouping made it obvious they were together. Since we only saw them for a minute or two, we didn't get a good reference on their speed or movement. They looked stationary; and when we were coming back from our friends house only 4-5 minutes later, they were nowhere to be found in the sky at all."],"Region":"California","trends":["There have been 31 other sightings in Roseville","There were no other sightings in Roseville on or around October 13th 2012"],"Object Flight Path":"Stationary","Object Shape":"Sphere, Star-like","Date of the Event":"10/13/2012 09:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.758914,+-121.283296(43251)&iwloc=A&hl=en\"> mufon case (43251) map </A>","Sighting Duration":"00:02:00","files":["/var/www/straped/mufon/html2text/43251.html.txt","/var/www/straped/mufon/org/43251.html"]}