{"Case Number":"43254","files":["/var/www/straped/mufon/html2text/43254.html.txt","/var/www/straped/mufon/org/43254.html"],"City":"Chesterfield","Sighting Duration":"00:00:50","Date Submitted":"10/14/2012 10:38 UTC","Object Features":"Other","Latitude":"37.380446","Date of the Event":"10/14/2012 12:00 UTC","Object Shape":"Circle, Sphere, Star-like, Other","Longitude":"-77.515345","map":"<A HREF = \"http://maps.google.com/maps?q=37.380446,+-77.515345(43254)&iwloc=A&hl=en\"> mufon case (43254) map </A>","Weather Factors":"Unknown","Region":"Virginia","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path,Path with directional change,Other","Log Number":"US-10142012-0026","divs":["sighting detailsi was on board a flight to richmond, va and was looking out the window at the lights of the city as it grew darker and darker. we were about 10-12 minutes away from landing, and i noticed a strange series of 5-8 bright yellow\\orange\\white lights in a horizontal line that were hovering above some buildings in the city. they suddenly formed into a circle, and then continued to form in a straight vertical line. all at once, they shot straight up into the sky, leaving behind a jet trail. if i heard others correctly on that side of the plane (right side, same as me), they were asking \"what was that?,\" \"did you see that?\" so i'm pretty sure that i was not the only one. i felt nervous, especially sense i was on an airplane that was already turbulent. i tried to think of military tests, fireworks, airshows, etc, but i haven't been able to form a reasonable conclusion to what i saw tonight on the airplane."],"Country":"United States","Disposition":"Unresolved","Tags":"City","trends":["There have been 7 other sightings in Chesterfield","There were no other sightings in Chesterfield on or around October 14th 2012"],"Summary":"Horizontal string of bright lights above buildings (I was in airplane), formed circular pattern, became vertical, and shot straight up into the sky.","Source":"MUFON"}