{"map":"<A HREF = \"http://maps.google.com/maps?q=41.210202,+-77.188125(43257)&iwloc=A&hl=en\"> mufon case (43257) map </A>","City":"Undisclosed","Source":"MUFON","Tags":"City","Object Shape":"Sphere","Date Submitted":"10/14/2012 11:42 UTC","Summary":"As I was driving home a number of lights in the sky were noticed reflecting off of clouds","Longitude":"-77.188125","Latitude":"41.210202","trends":[],"Object Features":"None","Log Number":"US-10142012-0029","files":["/var/www/straped/mufon/html2text/43257.html.txt","/var/www/straped/mufon/org/43257.html"],"Weather Factors":"Unknown","Date of the Event":"10/14/2012 10:40 UTC","Sighting Duration":"00:21:00","Viewing Distance":"Over One Mile","Case Number":"43257","Country":"United States","divs":["Sighting DetailsI was driving home from dropping a friend off. As I was going up the street I was lookin over the sky of northeast philadelphia I noticed a group of 6 to 10 circular lights flashing off of white clouds in the nighttime sky. They were pulsating and then moving forward and out of sight and the reappearing. I pulled my car over into a side street in a industrial park in NE philly to use my cellphone too video record, but my video would not work. I noticed a man come out of some office in an industrial office and I said to him \"look up there look up at those lights in the sky\". He walked away from the trees so he could see what I was looking at and he immediately said OH Wow whats that. The lights continued flashing and zooming and then disappearing for another 10 minutes or so. The gentleman thought that maybe there were some lights flashing from the city of PHiladelphia reflecting off of the sky. Since it was late Sunday Night I thought that would be unusual because I never saw that before. When I was a kid I saw lights in the sky from floodlights when they were opening shopping centers, but something was weird about these lights. I then drove home and a couple of minutes later I heard helicopters coming over my head but they were not where the lights were but they were heading toward the lights in the sky. It appeared to me that there was some type of experiment going on and a number of lights were being flashed from somewhere in space and they happened to be reflecting off of these white clouds in the night sky. Earlier that evening when I was walking near this area at dusk I noticed a lot of aircraft flying around spreading contrails all through the blue sky and after about a half hour of these planes seeding the sky there were a lot of white smoky clouds created around 6 PM in this Montgomery county NE Philly area. I felt as if these lights were being directed at these cloud formations."],"Region":"Pennsylvania","Object Flight Path":"Hovering then path","Disposition":"Unresolved"}