{"Case Number":"43266","Source":"MUFON","Date Submitted":"10/15/2012 02:13 UTC","Weather Factors":"Unknown","Country":"United States","divs":["sighting detailsi was at home--coney island, brooklyn. preparing to do some written work but went on the terrace for some air. the terrace faces east giving me visability of north\\east--can see lower manhattan and downtown brooklyn from the distance. actually i went to the terrace to see if they were there as for i told a neighbor about these occurances and promised to call her if i saw them again. years ago i thought they were airplane lights--when i lived facing west. at that time these lights would hoover over the harbor between coney island and staten island. but a plane does not take 45 minutes to fly from staten island to coney island. the last sighting had the 1 to 6 objects disappearing briefly and then appearing. five would shine brightly and 1 would always be sort of dim. they would move around slowly and make formations--a vee, a line and especially triangles! my feeling when seeing these occurances was alway excitement as for i feel that there is other life in the universe and i would love to be informed of this by scientist and the govenrment. on thursday evening when i saw this occurance when i washed up for the evening i noticed a rash on my chest that has since went away. also i noticed 6 bumps on my right thigh that replicated one of the formations that these lights were making (could be mere coincidence). on sunday when i saw these lights again i was for some reason very annoyed as for i want answers\\confirmation. during this sighting after 3-hours 2 of the items went down out of site and the others simply vanished. i know someone that actually was closer to the site of the occurance and saw an actual flying craft; round in shape. he was able to obtain a photograph. i do not have privy to the photograph. i was outdone--it looks like an actual flying saucer."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.784148,+-73.966141(43266)&iwloc=A&hl=en\"> mufon case (43266) map </A>","Object Features":"Unknown","Object Shape":"Circle","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/43266.html.txt","/var/www/straped/mufon/org/43266.html"],"trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around October 14th 2012"],"Log Number":"US-10152012-0009","City":"New York","Object Flight Path":"Path with directional change","Date of the Event":"10/14/2012 12:00 UTC","Longitude":"-73.966141","Disposition":"Unresolved","Region":"New York","Sighting Duration":"Undisclosed","Summary":"Orb like lights large and small; 3-6 objects at a time; very bright appearing to be airplane lights but they are not. They appear and disappear for short periods of time and then bloom again. They are very blatant.","Latitude":"40.784148","Tags":"City"}