{"Viewing Distance":"Over One Mile","Tags":"City","Source":"MUFON","Latitude":"33.546828","Region":"California","Weather Factors":"Unknown","Date Submitted":"10/15/2012 02:32 UTC","files":["/var/www/straped/mufon/html2text/43267.html.txt","/var/www/straped/mufon/org/43267.html"],"Object Shape":"Cross","trends":["There have been 12 other sightings in Laguna Beach","There were no other sightings in Laguna Beach on or around October 14th 2012"],"Case Number":"43267","Object Features":"Appendage(s)","City":"Laguna Beach","map":"<A HREF = \"http://maps.google.com/maps?q=33.546828,+-117.77908(43267)&iwloc=A&hl=en\"> mufon case (43267) map </A>","Country":"United States","Object Flight Path":"Straight-line path","Summary":"Single con trail got my eye and I observed a silvery aircraft with donuts on a rope. Below it where three black things that did not emit trail, as if escorting the craft heading NW according to my compass watch. It came from the ESE , contrail evaported","Disposition":"Unresolved","Longitude":"-117.77908","Date of the Event":"10/14/2012 03:11 UTC","Log Number":"US-10152012-0010","Sighting Duration":"Undisclosed","divs":["Sighting DetailsSingle con trail got my eye and I observed a silvery aircraft with donuts on a rope. Below it where three black things that did not emit trail, as if escorting the craft heading NW according to my compass watch. It came from the ESE , contrail evaported quickly. Mild Santa Ana condition with clear skies. Extremely high altitude since the silvery aircraft was just within my vision where I could make it out. It was the three black Jacks in triangle formation escorting the advance Hypersonic aircraft. It would not surprise me if no else reported it since it was invisible to me when the con trail stopped right above me at Fishermans Cove. It covered the sky in about 90 seconds. It was descending more than likely since it was no longer producing the donuts on a rope contrail. These became obvious in shape as it almost flew overhead. Speculating it was headed to the restricted zone."]}