{"Latitude":"33.245815","Date of the Event":"10/13/2012 10:15 UTC","Sighting Duration":"Undisclosed","Longitude":"-111.816797","Tags":"City","Object Features":"Wings","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Date Submitted":"10/15/2012 04:16 UTC","Country":"United States","Disposition":"Unresolved","Viewing Distance":"Over One Mile","Object Shape":"Boomerang","files":["/var/www/straped/mufon/html2text/43260.html.txt","/var/www/straped/mufon/org/43260.html"],"Region":"Arizona","Weather Factors":"Unknown","Log Number":"US-10152012-0003","City":"Chandler","divs":["Sighting DetailsMy wife and mother were sitting in our back patio following a family baby shower for my daughter. Everyone else had left and we were simply visiting and talking. My mother was facing west and my wife and I facing east. It was a very dark night and no clouds or atmospheric conditions were present. While we were talking, my mom looked to the west and had a puzzled look on her face. She turned her head back to my wife and I and continued her conversation. A couple of minutes later, my mom looked to the west again and stated \"what in the world are those?\". So I stood up and turned around facing west. I was totally amazed to see 5 very bright orange lights. There were 2 at a higher level, 2 below, and 1 centered at the bottom. The formation looked like a \"5 dice\" except the center one was at the bottom. All were hovering and with no sound or movement. We watched them for about 3 minutes together. My wife by my side and my mother still seated. My mother estimated she noticed them about 8 minutes earlier. As an airline rated pilot and a highly experienced civilian and military aviator, I had never seen bright orange lights like this in the sky. Especially ones that were so bright, almost like airline landing lights. i looked for other aircraft including fighter intercepters, none were in the vicinity. I immediately ruled out Chinese lanterns or any other low level object. These were in the same location as the 1997 Phoenix lights in the area just south of Phoenix's South Mountain. Since the Phoenix approach for landing is just north of where they were, I know from the angle in the sky that they were anywhere from 2,500 feet of the lowest light to about 6,000 feet for the highest two. Using every possible reasoning and experience I couldn't think of any known bright orange lights like these either military or civilian. I have over 6,000 hours of flying time and have never seen a \"UFO\" until now. After about 3 minutes of watching them, the top two objects lights quickly dimmed off. Then the next bottom level two. The very bottom light stayed lit for about 30 seconds but this one started moving towards us slowly. I used the top of our backyard fence as a movement reference. Once all 5 lights were dimmed, we continued to watch the sky in the same general westerly direction. Then my wife and I saw moving from south to north at the same altitude of the highest two lights a grey object. It was silent and with no lights. The lights of the city exposed the object as it accelerated with a small cloud at the front of its nose. Originally it was cigar shaped until it made a right bank and jinked, then left bank again. It was shaped like a triangle but more like a modified wing, not a rigid triangle shape. As the object accelerated, I was shocked at the speed of acceleration. Judging the distance it covered in the time of 8 seconds that both my wife and I saw it, I estimated it flew about 8miles north in that 8 seconds without any sound. That is faster than the speed of sound. Since it flew over the Phoenix airport area, normal civilian aircraft are restricted to 250 knots by FAA regulation. My wife is a nurse practitioner and I am a highly respected professional pilot. I've seen documentaries on UFO sightings, but the video footage never gives enough evidence for what the person saw. I wish I had very clear video of what we saw, but I knew my camera phone would have just been blurry. So it was best that I simply analyzed what we saw. If we only saw the lights, that would have been a huge mystery without any solid explanation. However, the flying grey object flying with a vapor cloud on its nose and with high acceleration convinced me that this was not something that was normal...at all. I always believed that people have seen UFO's and I had no reason to discredit what they saw. But seeing this amazing site and the fact I have extensive aviation experience makes me much more of a believer of something going on. I will now watch the skies in that same area and have a tri-pod and good digital camera ready. But, even without video proof, I know what my wife and I saw which is good enough for me."],"Summary":"5 Bright Orange lights South of Phoenix, Arizona followed by large craft flying north","Case Number":"43260","map":"<A HREF = \"http://maps.google.com/maps?q=33.245815,+-111.816797(43260)&iwloc=A&hl=en\"> mufon case (43260) map </A>","trends":["There have been 52 other sightings in Chandler","There were no other sightings in Chandler on or around October 13th 2012"],"Source":"MUFON"}