{"Country":"United States","Latitude":"28.048285","trends":["There have been 26 other sightings in Lakeland","There were no other sightings in Lakeland on or around June 20th 1968"],"Longitude":"-81.942334","map":"<A HREF = \"http://maps.google.com/maps?q=28.048285,+-81.942334(43279)&iwloc=A&hl=en\"> mufon case (43279) map </A>","Tags":"City","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/43279.html.txt","/var/www/straped/mufon/org/43279.html"],"Object Flight Path":"Stationary,Path then hovering","Weather Factors":"Unknown","Summary":"At the age of ten my mother and I saw a UFO at tree top level hovered over us","Log Number":"US-10152012-0022","Source":"MUFON","divs":["Sighting DetailsIn the summer of 1968 at the age of 10 we lived in a rural area of Lakeland Florida, My mother and I were walking home from a neighbors house when an metalic disc shaped object came up on our right from the nearby wooded area at the end of our road. Before it got to us I noticed a dome shape on top it was moving very slow with no sound what so ever, as it got overhead it stopped we both looked up and saw a lighted circular bottom where lights rotated with different colors. As it hovered a yellowish, orange light shined down on me and my mother. It remained overhead for what seemed like an eternity it was proably only a few minutes. It was approximatly 30 to 40 feet in diameter, it had no down blast or heat, and the only sound it made was a low rhythmic oscillating hum like Wha,wha,wha,wha,etc.it was just a few feet higher that the telephone pole that was within 20 feet of us. As my mother and I regained our compossure she screamed for my brother to come see the object, when she did the light went out and the object took off to our left in a blink of an eye it had disappeared. Ever since that day I have looked up to the sky to see another one but I have never had another encounter."],"Date of the Event":"06/20/1968 09:00 UTC","Region":"Florida","Sighting Duration":"Undisclosed","City":"Lakeland","Case Number":"43279","Viewing Distance":"20 Feet or Less","Object Features":"Dome","Date Submitted":"10/15/2012 07:28 UTC","Disposition":"Unresolved"}