{"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=29.451942,+-98.501042(43274)&iwloc=A&hl=en\"> mufon case (43274) map </A>","Viewing Distance":"Over One Mile","Country":"United States","Region":"Texas","Object Shape":"Sphere","Date of the Event":"04/02/1999 09:00 UTC","City":"San Antonio","files":["/var/www/straped/mufon/html2text/43274.html.txt","/var/www/straped/mufon/org/43274.html"],"Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Source":"MUFON","Sighting Duration":"00:01:00","Disposition":"Unresolved","Longitude":"-98.501042","Date Submitted":"10/15/2012 06:30 UTC","divs":["Sighting DetailsOn that particular night, I was 14 years old, I remember being that age, but uncertain what month of the year it was, I was walking my dog, had just left my house when I look up at the clear sky at the stars, I noticed one of the \"stars\" was moving in a straight path northwestward and thought oh cool! that must be a satellite because it had a linear path, then the ball star looking object stopped completely for a second or two, and immediately started making these very pronounced and almost perfectly shaped circular loops inS the opposite direction to the southeast, then after few of these, it accelerating greatly at a ridiculous speed and flew off linearly to the southeast only to disappear completely from my vision, almost as if it ascended and travelled horizontally at a blurry speed, it travelled the entire horizon in about 2 seconds flat, I couldn't believe what I had seen. I felt happy and giddy because I immediately thought that we aren't alone in the universe. I've never seen anything move so fast or switch directions so fast in all my life and to this day whenever I see a moving object in the sky I always watch it with tenacity to see if it will do something strange, but unfortunately haven't seen anything like this encounter since, everything else has been identifiable. Ever since that encounter there are times when I have these strange dreams with aliens in them, and I am lying down and these little blue humanoid almost childlike beings with large eyes and small bodies come and take my hand for me to come with them. Not sure if this is my own mind making this up or it has any relation to what I saw. I've had other alien dreams but don't really feel like typing anymore. I wish I had shared this story long ago when I first experienced it but I don't think I even had a computer back then."],"Summary":"Starlike object flies so fast in the night sky. Erratic flight very fast speeds.","Case Number":"43274","Log Number":"US-10152012-0017","Weather Factors":"Unknown","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around April 2nd 1999"],"Object Features":"Unknown","Latitude":"29.451942"}