{"Sighting Duration":"00:15:01","Viewing Distance":"20 Feet or Less","Date of the Event":"06/15/2008 01:01 UTC","City":"Chicago","Object Features":"Window(s)","Longitude":"-87.675178","Case Number":"43275","Object Flight Path":"Stationary","Country":"United States","divs":["Sighting Details my friend and I got off a bus, then turned around and the bus had vanished. My friend was panicked but since I had been teleported, I did not know if it was an hallucination or real. since she say it, there were 2 of us, it must be a real event. I reassured her that the bus was probably just down the block after teleportation. I have read almost all of Jacques Vallee and he does a good job. Except his conclusion is wrong. All the abductions I have read do not have a 'complete' teleportation. My conclusion is we are dealing with two types of entites. UFO people who have bodies and spacecraft like us. (ours are primitive) And other types of beings who DO NOT have bodies and flow thru our religions and literature. They are capable of teleportation and I speculate they have teleported ufo's to protect them from our jets. A simple example of these anamolous beings in mentioned in Vallee. An apparition of the Blessed Virgin Mary witnessed by 10000 people, including sceptics and non-beleivers. I have no idea of their composition or how they do their stuff. We need to divide these experiences into these two separate catagories. I have witnessed spiritual healing and I have never seen it mentioned UFO literature. Also I am not a Catholic but acknowledge this amazing apparition. So the separation is between living Extraterrestial beings with spaceships, and anomalous and amazing unexplainable events which are obviously real."],"Tags":"City","trends":["There have been 221 other sightings in Chicago","There were 3 other sightings in Chicago on or around June 15th 2008"],"Latitude":"42.015883","Weather Factors":"Unknown","Disposition":"Unresolved","Summary":"large bus teleported","files":["/var/www/straped/mufon/html2text/43275.html.txt","/var/www/straped/mufon/org/43275.html"],"Date Submitted":"10/15/2012 06:34 UTC","Source":"MUFON","Object Shape":"Unknown","Log Number":"US-10152012-0018","Region":"Illinois","map":"<A HREF = \"http://maps.google.com/maps?q=42.015883,+-87.675178(43275)&iwloc=A&hl=en\"> mufon case (43275) map </A>"}