{"Object Features":"Window(s), Patterned Surface, Appendage(s), Wings","Longitude":"-117.027765","Object Shape":"Chevron, Cylinder, Disc, Flash, Oval, Sphere, Triangle","Date of the Event":"09/10/2011 08:30 UTC","files":["/var/www/straped/mufon/html2text/43282.html.txt","/var/www/straped/mufon/org/43282.html"],"Sighting Duration":"Undisclosed","Date Submitted":"10/15/2012 08:18 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.965023,+-117.027765(43282)&iwloc=A&hl=en\"> mufon case (43282) map </A>","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","City":"Poway","trends":["There have been 7 other sightings in Poway","There were no other sightings in Poway on or around September 10th 2011"],"Case Number":"43282","Summary":"Varied activity -->my suspicion: human,plant,animal replacement.Atmosphere change","Disposition":"Unresolved","Source":"MUFON","Log Number":"US-10152012-0025","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","divs":["sighting detailsi am not only reporting one sighting. these are ongoing activities that are escalating and i strongly feel a team of experts needs to set up an station in my back yard for at least 3 consecutive days. the team can then take varied types of samples (i.e. water air soil and recordings (i.e. visual light ,ir,uv,etc.) i was\\am in my own house -the same house of about 30 years-. i was going about my business of every day routine. the odd events that made me start noticing something was not \"normal\" were mainly two: 1) the driving pattern & lights of cars as i see them in the streets in the back (east) direction from my house. 2)when laser light (for playing w\\cat) beam trajectory was visible across the space inside my house dinning room & living-room. varied activity -->my suspicion: human-plant-animal replacement & atmosphere modification. on going activity --> possibly for many years. manipulating objects, animals, plants (whole plant as well as cell mutations) & humans. way of gaining control: by varied sizes of air \"pollution\" dust. dust colors:ochre,white,rusted red(like blood)& mostly black(iron-fe-color) the fe dust can be so fine that make \"standing\" environments in which you can project lights,holograms ,etc. or use electromagnetic standing waves. many times these \"walls\" can be used as \"reflecting mirrors\" for different kinds of rays. these electromagnetic standing waves can also be used in conjunction w\\ diverse type of electromagnetic fields & perform wave summations w\\ different purposes. humans,animals,plants,water...everything is polluted w\\ this black [fe] compound dust. the dust particles are coated w\\ an oily substance to prevent them from reacting w\\ oxygen...but when they react the black turns blood red. the \"dust\" accumulation in different places can be manipulated once it reaches a critical amount. for instance: create fires of extremely high intensity, car accidents , people acting \"out of character', electrocuting swimmers(causes of death)...etc."],"Tags":"City","Latitude":"32.965023","Region":"California","Country":"United States"}