{"Date of the Event":"10/15/2012 06:48 UTC","City":"Shorewood","Source":"MUFON","Viewing Distance":"Over One Mile","Case Number":"43286","map":"<A HREF = \"http://maps.google.com/maps?q=41.52103,+-88.195929(43286)&iwloc=A&hl=en\"> mufon case (43286) map </A>","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"N/A","Tags":"City","Disposition":"Unresolved","Latitude":"41.52103","files":["/var/www/straped/mufon/html2text/43286.html.txt","/var/www/straped/mufon/org/43286.html"],"Object Shape":"Star-like","Date Submitted":"10/15/2012 10:05 UTC","Summary":"Eleven white lights vertically staggered, stationary. Dissolved one by one.","Log Number":"US-10152012-0029","Object Features":"Unknown","Country":"United States","Longitude":"-88.195929","trends":["There have been 4 other sightings in Shorewood","There were no other sightings in Shorewood on or around October 15th 2012"],"divs":["Sighting DetailsI was out on a walk with my dog and we stopped to take a break at our usual location, a retention pond a mile or so from my home, directly behind a large warehouse. I was sitting down facing west(towards the pond)atop a more hilly ridge surrounding it. My dog who I was holding on a leash walked behind me causing me to turn around my left shoulder and observe to the east, eleven white lights stacked vertically in the sky. They we're roughly one and a half to two miles away from me and my initial reaction was to count them. I counted eleven. My second reaction was to call my mother because she's had multiple past UFO sightings, and also because I knew she was in the area at the time and I hoped she could possibly see them as well. Unfortunately she did not answer her phone though. At this time the sighting had been taking place for nearly half a minute and roughly half of the initial eleven lights were gone. I began to focus in on the remaining five or six lights and observed them all start to dissolve away. I looked as hard as I could at the last remaining two, watching as close as I could possible, and saw one turn out its white light, and then the other do the same. I could still see the silhouette of what looked like little pod-like objects where the light just was. Next the craft that had first turned out its light beamed off faster than anything I have ever seen before to the southeast going up, the second followed just the same. It is important to note that where these lights were over is a field just to the north of i-80. This is also right at the meeting point of i-55 and i-80. I believe the light from the highway is what allowed me to be able to see the objects silhouetted. The whole thing mildly shook me up and was my first experience with the paranormal."],"Region":"Illinois"}