{"Date of the Event":"09/17/2012 05:20 UTC","Disposition":"Unresolved","divs":["Sighting DetailsWhen this happened I was inside my house. My dad was working outside with his welding mask on when he noticed something moving in the sky. He noticed about 50 objects that appeared to be emitting high intensity light. He took off the welding mask and had more of a hard time seeing the objects, that's when he called me. At first, my dad thought they were birds but then we noticed the speed of them and realized birds couldn't possibly move that fast, also, birds don't emit light. I went outside with my camera and took high resolution (4608x3072, 300pi) pictures of the sight. The lights were first sighted by my dad coming from the north and they started heading south through the course of 45 minutes. These lights were not in a straight path south, they appeared to be moving incredibly quickly, like bacteria under a microscope. The objects performed extremely fast changes in direction, they changed direction without arcing like typical planes. We were both extremely confused and somewhat uneasy. We eventually lost sight of the objects since they headed down towards Mexico."],"files":["/var/www/straped/mufon/html2text/43283.html.txt","/var/www/straped/mufon/more/43283_submitter_file1__DSC0262.jpg","/var/www/straped/mufon/more/43283_submitter_file2__DSC0263.jpg","/var/www/straped/mufon/more/43283_submitter_file3__DSC0264.jpg","/var/www/straped/mufon/more/43283_submitter_file4__DSC0265.jpg","/var/www/straped/mufon/org/43283.html"],"City":"Mission","Log Number":"US-10152012-0026","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Latitude":"26.36858","Source":"MUFON","Object Shape":"Egg, Sphere, Unknown","Region":"Texas","Sighting Duration":"Undisclosed","Country":"United States","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=26.36858,+-98.347002(43283)&iwloc=A&hl=en\"> mufon case (43283) map </A>","Summary":"May fast lights, moving as fast and like bacteria in sky.","Viewing Distance":"Unknown","Date Submitted":"10/15/2012 09:09 UTC","Object Features":"Unknown","Longitude":"-98.347002","Case Number":"43283","trends":["There have been 5 other sightings in Mission","There were no other sightings in Mission on or around September 17th 2012","This sighting has never been favorited.",""]}