{"Tags":"City","Object Shape":"Star-like","Longitude":"-75.030931","divs":["Sighting DetailsI was approx. 13 or 14 years old. It was a hot clear August night in Mohawk NY. A friend and I decided to spend the night at another friends house who had an in-ground pool. Around 11 PM we decided to go for a dip and cool off. We were swimming for about 20 minutes just messing around. I jumped off the diving board and swam all the way to the other end under water. When I stood up in the shallow end I wiped my eyes and opened them to focus. I saw what appeared to be a shooting star but wasnt moving extremely fast like a shooting star. I turned around to tell my friends and when I looked again, here comes another in the same path! I remember saying \"I just saw 2 shooting stars in the same place!\" that is when the third came! This one stopped on a dime, thats when I realized that all 3 of them had stopped and I also noticed that they looked a little different than the stars around them. The 3 of us watched in amazement as the traingular outline that they formed began to slowly spin, rotated about 3 times and took off just as fast as they came! We ran to the house and called Unsolved Mysteries lol (kids). Now, Being from upstate NY I saw alot of crazy things especially in the sky (which I will also eventually report when I get more time). This was the very most bizarre! If I am not mistaken I believe this happened right around the time of the Town of Columbia NY crop circle which was about 2 miles away on route 28."],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/43280.html.txt","/var/www/straped/mufon/org/43280.html"],"Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","Summary":"3 shooting star like objects followed each other, formed a triangle, hovered and spun, then flew off very rapidly","Case Number":"43280","Latitude":"42.958784","Date Submitted":"10/15/2012 07:38 UTC","Log Number":"US-10152012-0023","Object Flight Path":"Hovering then path,Path then hovering","Disposition":"Unresolved","Country":"United States","Region":"New York","City":"Mohawk","map":"<A HREF = \"http://maps.google.com/maps?q=42.958784,+-75.030931(43280)&iwloc=A&hl=en\"> mufon case (43280) map </A>","Date of the Event":"08/03/1990 12:00 UTC","Sighting Duration":"Undisclosed","Source":"MUFON","trends":["There have been no other sightings in Mohawk","This sighting has never been favorited."]}