{"Latitude":"35.406226","files":["/var/www/straped/mufon/html2text/43281.html.txt","/var/www/straped/mufon/org/43281.html"],"Country":"United States","Disposition":"Unresolved","trends":["There have been 78 other sightings in Oklahoma City","There were no other sightings in Oklahoma City on or around May 14th 2012"],"Date of the Event":"05/14/2012 12:00 UTC","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=35.406226,+-97.724579(43281)&iwloc=A&hl=en\"> mufon case (43281) map </A>","Longitude":"-97.724579","Object Features":"Unknown","Date Submitted":"10/15/2012 08:06 UTC","Viewing Distance":"21-100 Feet","divs":["Sighting DetailsI was headed south on mustang rd from reno ave to go pick up my fiance from work at 11pm. It was very dark outside and in the section of the road i was driving on there arent any buildings, mostly farm land and trees. I happened to notice out of the corner of my eye a red light so i turned my head to observe what it was and slowed the car down to about 45mph from 60mph. At first glance i thought it was just a radio tower until i saw the two red lights behind the front one forming a triangle shape. At that time i slowed the car down to about 15 to 20 mph to get a better look. I had the window of the car down so i know it was not a reflection. I kept my eye on it as i approached my destination and when i got there i immediately parked the car and got out to watch the object further. During this period of time i tried to listen for any kind of noise to see if i could tell if it was a plane or a helicopter but i could not hear anything. The object then slowly did a 180 degree turn while staying in place hovering and then proceeded to slowly move east south east. After that i never saw it again. the next day I noticed on facebook a few people writing similar stories to mine about the object the night before. I have to admit I was completely amazed and confused about what i saw and I am constantly made fun of by the people i tell this story to and they say im crazy... I can honestly say that i know what i saw and i would take a lie detector test to prove im not making it up. I will never forget the event that happened and I hope that i can get the answers im looking for someday."],"Log Number":"US-10152012-0024","Summary":"i was driving and saw it hovering. it was black and triangular with a red light on each point of the triangle. after hovering it did a full 180 degree turn and slowly headed east.","City":"Oklahoma City","Region":"Oklahoma","Tags":"City","Case Number":"43281","Source":"MUFON"}