{"Log Number":"US-10162012-0004","Longitude":"-77.028266","Date Submitted":"10/16/2012 01:00 UTC","Weather Factors":"Unknown","City":"Washington","Source":"MUFON","Case Number":"43291","divs":["Sighting DetailsThis is going to sound crazy I know, but please follow up on this. Even if there is an explanation, you are going to be impressed with this. I was watching the Hannity show on Fox (a replay at 9:15 PST from an earlier EST broadcast from 8 or 9pm) and while Hannity was interviewing Ann Coulter, there was a live background behind her in a major city (I did not catch the city and could not rewind to the beginning of the segment). There were several clear instances of regular aircraft passing behind skyscrapers behind Miss Coulter, they were clearly helicopters, but at 18 mins and 30 secs into the hour long program, something flies behind the skyscrapers many times the speed of the conventional aircraft and making several abrupt elevation movements. Please, please, please take a look into this. It may well have an earthly explanation, but I am sincerely telling you that it is worthy of investigation. If it is not a UFO then you will be impressed with it as a textbook optical illusion. Video attached is off of my TV for reference. I apologize for the poor quality. - Joe Wise 702 340 1251"],"Region":"District of Columbia","Object Flight Path":"Path with directional change","Object Shape":"Unknown","Summary":"on live TV a very noticeable event that is obviously a real object, but change in direction and speed is not likely known aircraft or meteorite","Sighting Duration":"00:00:30","files":["/var/www/straped/mufon/html2text/43291.html.txt","/var/www/straped/mufon/org/43291.html"],"Latitude":"38.904872","Date of the Event":"10/15/2012 09:18 UTC","Disposition":"Unresolved","Country":"United States","trends":["There have been 54 other sightings in Washington","There were no other sightings in Washington on or around October 15th 2012","This sighting has been favorited 1 time.",""],"Object Features":"Unknown","Tags":"City","Viewing Distance":"N/A","map":"<A HREF = \"http://maps.google.com/maps?q=38.904872,+-77.028266(43291)&iwloc=A&hl=en\"> mufon case (43291) map </A>"}