{"trends":["There have been 70 other sightings in Edmonton","There were no other sightings in Edmonton on or around October 16th 2012"],"Viewing Distance":"Over 1 Mile, Unknown","Summary":"stationary edge of a wheel orange-yellow light behind light overcast","Case Number":"43295","City":"Edmonton","Object Shape":"Other","Object Features":"Unknown","Sighting Duration":"00:05:00","Country":"Canada","Date Submitted":"10/16/2012 04:07 UTC","Disposition":"Unresolved","Weather Factors":"Unknown","Tags":"City","Longitude":"-113.504815","Date of the Event":"10/16/2012 12:00 UTC","Log Number":"CA-10162012-0008","divs":["Sighting DetailsI was leaving a friend's apartment, just north of downtown Edmonton. The area has numerous low-rise apartments, so visibility is fairly good to the sky. Being just north of the city, the light pollution isn't quite so bad. Last week, for instance, I was clearly able to see the Northern Lights from this location during the large CME on October 8th. The direction of the sighting DOES correspond with the Edmonton City Centre Airport, and could very well be something going on up there, so consider that along with this report. Tonight is about 10 degrees Celcius, and there's a light overcast with some light showers in the area. The cloud cover is translucent enough to vaguely see a couple of stars through it. As I walked through the park adjacent to the Ukranian Orthodox Church on 109 Avenue, I noticed a yellow-orange light to the northeast, approximately a quarter of the way up from the horizon. It was steady, did not move, and made no sound. It was mostly obscured by the overcast, which definitely passed in front of the light (cloud was visibly passing in front of it). My best description would be that it was about the shape (and angle) of the showcase-showdown wheel on the Price is Right, or that it was like the top of a giant engagement ring. I watched for about five minutes, and it didn't move. As I was on foot, and this light was clearly further off than at least the clouds, I wasn't about to chase it. I started off southwards toward downtown (where I live). 107 Avenue is very well-lit, as it's a fairly main artery, and by the time I reached there, the object had faded into the light pollution. I was checking every few steps, and could see that the light pollution was too much as I got nearer downtown. As I said, this light (which was brightest in the middle) was to the northeast, which is the direction of the airport. Given the overcast and the similarity to the colour of the streetlights, I suppose it could have been some sort of weird light reflection, but it truly seemed large and out of place. I'm submitting this in hopes that someone may have seen the same thing and had a working camera on them, as I did not. Also, when I got home about 30 minutes later, I checked twitter for any similar mention, even tweeting what I had seen. It looks like I'm the only one at this point. I realize this report is short on evidence, but I saw something, and if it helps corroborate someone else's sighting, then that would be great."],"Latitude":"53.552987","Source":"MUFON","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=53.552987,+-113.504815(43295)&iwloc=A&hl=en\"> mufon case (43295) map </A>","Region":"Alberta","files":["/var/www/straped/mufon/html2text/43295.html.txt","/var/www/straped/mufon/org/43295.html"]}