{"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=37.460103,+-82.461988(43313)&iwloc=A&hl=en\"> mufon case (43313) map </A>","Disposition":"Unresolved","Summary":"Horizontal inkpen shape in sky hovering. Many jets kept flying by it. I saw 3 within 15-mins. My cousin and others watched it for hours and they saw more than 16 jets fly by it.","Latitude":"37.460103","Tags":"City","City":"Pikeville","divs":["Sighting DetailsMy cousin called my mom and told her that he and his employee had been watching a strange object in the sky for about an hour. The object was brought to their attention by the man next door. Whom, he had never spoken with. The man said he had been watching the object from his porch for about 30 minutes. When I spoke with my cousin he described the object to me and also said that airplanes kept flying by it. I then got in my car and drove to see it for myself. I arrived and could not see it with the naked eye but I could see it with binoculars. I witnessed about 3 airplanes fly past the object. It remained motionless and looked like a silver inkpen floating horizontally in the sky.It did not appear to have a flight path to me as I was there only briefly but my cousin stated that it had been closer and was moving from the right to the left (I am not sure what direction that would be but it could easily be figured out). There were 4 other witnesses there also. I had called my father who is an official in the state government and related what I had seen to him after I left the scene because I had to go pick up my child from a practice. My father later told me that as he was relating my story to one of his employees, the employee recieved a facebook message from his cousin in a town 30 miles away (South Williamson, KY) that had a picture of the object. I haven't seen the picture myself. I videoed the object and witnesses but you cannot see anything as the object was so very far away. My cousin took pictures while it was closer before I arrived but you cannot see anything on those but we hope that maybe with the right equipment they can be blown-up and maybe be seen. After I picked up my child from her practice she wanted to go see it but after calling my cousin he stated that you could no longer see it as it had moved beyond the tree-line.It was obviously being watched by our government because of all the planes flying by it. My cousin states that they do not usually fly over the area and definitly not that many. I could not make out what kind of planes they were but we got video of some of them and you can see a lot of vapor trails from them. I don't know what it is. Maybe extraterrestrial, maybe a drone or satalite from a foriegn country that invaded our airspace. I don't have any idea but I believe that those airplanes were diffinitly interested in it.While I was there my cousin said they had seen 16 fly by it."],"Date of the Event":"10/16/2012 04:30 UTC","Viewing Distance":"Unknown","Sighting Duration":"00:17:00","Date Submitted":"10/16/2012 09:22 UTC","Object Shape":"Cylinder","files":["/var/www/straped/mufon/html2text/43313.html.txt","/var/www/straped/mufon/org/43313.html"],"Object Features":"None","Case Number":"43313","Source":"MUFON","Log Number":"US-10162012-0024","trends":["There have been 3 other sightings in Pikeville","There were no other sightings in Pikeville on or around October 16th 2012"],"Weather Factors":"Unknown","Region":"Kentucky","Longitude":"-82.461988","Object Flight Path":"Stationary"}