{"Date Submitted":"10/16/2012 08:47 UTC","Weather Factors":"Unknown","Log Number":"US-10162012-0022","divs":["Sighting DetailsMy neighbor's small daughter noticed a very bright star that shown in the middle of the day, that didn't move, and brought it to my attention. The sky was clear, free of clouds, and blue. Visibility was unlimited. The temperature was in the upper 60's. I had 4 visitors at the time and they all called to me to come out and look up at something strange. I got binoculars and was stunned to see a bright object that looked cylindrical, with two bright white fluorescent tubes on its sides, hanging very high in the sky. I have an 8\" Meade SCT telescope and observed it at about 150 power and it was extremely clear, unmoving, or barely moving, hanging very high in the atmosphere. It was so high, it didn't appear to have shape except through binoculars. It moved ever so slightly that I used the telescope's controls to keep it centered, but it never moved more than 10 degrees from the original position in an hour and a half. I used my Canon digital camera and took about 50 photos of the object through the telescope and then shot some video also. It oscillated between dim to very bright, (sunlike), on a frequency that varied but was of about 30 seconds. If it was a balloon it would have drifted with the prevailing winds, if it was a satellite, it would have moved west to east in its orbit, and been out of sight in about 10 minutes, if it was a plane it could not stay up without moving that long. A helicopter would have run out of gas and could not have hovered that long. None of those things fit this description. It appeared to be cylindrical in shape, semi transparent, and had two very bright lines of light, vertically on its outside edges. Being an amateur astronomer, I know my planets and heavenly bodies and it was none of those. After about 2 hours of observing it through my telescope I came in to post my photos on facebook and during that time my wife came in and said it had disappeared. I am experienced with taking pictures through my telescope and I know about reflections, planets looking like ufo's and such. This wasn't even close to any of those events, and I have 5 other witnesses to prove it. They all saw it through my telescope and observed it for over an hour.."],"Sighting Duration":"02:30:00","Source":"MUFON","Object Flight Path":"Hovering then path","Country":"United States","Tags":"City","Summary":"Cylindrical, bright object, brilliant in daylight, hovering high in clear sky","Object Shape":"Cylinder, Star-like","Longitude":"-82.658575","Region":"Kentucky","map":"<A HREF = \"http://maps.google.com/maps?q=37.30485,+-82.658575(43311)&iwloc=A&hl=en\"> mufon case (43311) map </A>","Latitude":"37.30485","Case Number":"43311","files":["/var/www/straped/mufon/html2text/43311.html.txt","/var/www/straped/mufon/org/43311.html"],"Object Features":"Other, Unknown","Viewing Distance":"Over 1 Mile, Unknown","Date of the Event":"10/16/2012 02:25 UTC","Disposition":"Unresolved","trends":["There has been one other sighting in Virgie","There was one other sighting in Virgie on or around October 16th 2012"],"City":"Virgie"}