{"Region":"California","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.808329,+-119.853528(43316)&iwloc=A&hl=en\"> mufon case (43316) map </A>","Sighting Duration":"Undisclosed","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","files":["/var/www/straped/mufon/html2text/43316.html.txt","/var/www/straped/mufon/org/43316.html"],"City":"Fresno","Object Shape":"Triangle","Log Number":"US-10172012-0003","divs":["Sighting DetailsMy boyfriend went to throw out the trash at around 7:40 and he was taking long to come up. 5 to 10 minutes had passed so I went to the front on my porch upstairs and looked for him. I saw him talking to the neighbor so I started looking in the sky. I notice a lot of planes flying above for like 5 minutes. Then I looked at my boyfriend again and looked up in the sky and saw no planes. Then I saw this dark triangular shaped object slowly fly over my apartment complex, between 2 trees and then out of view. There were 4 blinking red lights on the back of the craft. I was amazed because I heard nothing from it. It was sort of like cruising over. It was in my view for a good minute maybe. So then I ran downstairs to my boyfriend and neighbor and told them what I saw. I asked if they saw anything or heard any plane and they said no, so I know I wasn't trippin when I didn't hear anything come from this thing. It was huge, too huge to be a plane flying that low and silent. The other planes I saw flying around were higher up and their size didn't compare. I got this adrenaline running thru me when I saw it, like, am I really seeing this. I am amazed still, like 2 hours later. I've attached a drawing (very poor drawing)of what I saw."],"Object Flight Path":"Straight-line path","Longitude":"-119.853528","Date of the Event":"10/16/2012 08:00 UTC","Summary":"Triangular shaped silent craft with 4 red flashing lights in back crusing in straight path over my apartment.","Latitude":"36.808329","Case Number":"43316","Weather Factors":"Unknown","Disposition":"Unresolved","Date Submitted":"10/17/2012 01:28 UTC","trends":["There have been 63 other sightings in Fresno","There were no other sightings in Fresno on or around October 16th 2012"],"Object Features":"Unknown"}