{"Object Shape":"Circle","City":"Mission Viejo","Weather Factors":"Unknown","Object Flight Path":"Stationary","divs":["Sighting DetailsI am a deputy Sheriff. My wife & I went to dinner with our teenaged sons. We drank water and tea. Afterward we went to the attached supermarket, while the kids sat in the car. When we came out people were looking at the sky in amazement. There were hundreds, maybe over a thousand crows flying in a northerly direction toward us and landing on the rooftops, ground and trees around us. I never saw so many birds at one time. I was thinkning it looked like the movie, \"The Birds\", and the man standing next to me said, \"This is like Hitchcock\". I don't know how long it had been going on before we walked outside, but we watched them fly in, in a thick flock for at least a minute before we started walking to our car. When we got to the car they were still coming in and you could see them flying in from over the hillside in the distance, although the numbers of flying birds was dwindling. Our kids were texting their friends. My wife was asking them if they had been watching the crows, and I noticed a small glowing spot in the sky off in the direction the crows were flying from. It looked kind of like the sun at around sunset, but much smaller. It was much smaller than the moon, but much bigger than a star. I ran through my head what it might be, a plane, a meteor, a star, a balloon. It sounds strange, but it looked more like a hole in the sky, with a light shining through, than it did an actual object in the sky. I told my wife to look, but she didn't hear me, because I could hear her continuing to tell the kids about the crows. I turned to tap her elbow, and told her to look. When we turned back to look, it was gone. There was nothing it could have gone behind, it was just gone. Even if it had been a fighter jet, it couldn't have disappeared that quickly."],"Viewing Distance":"Over One Mile","Date of the Event":"10/16/2012 12:00 UTC","Tags":"City","Log Number":"US-10172012-0005","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.608313,+-117.667625(43319)&iwloc=A&hl=en\"> mufon case (43319) map </A>","Longitude":"-117.667625","Latitude":"33.608313","Region":"California","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Date Submitted":"10/17/2012 05:25 UTC","Source":"MUFON","Summary":"was watching hundreds of crows flying toward us, then noticed a glowing ball. I turned to tell my wife to look and it was gone","files":["/var/www/straped/mufon/html2text/43319.html.txt","/var/www/straped/mufon/org/43319.html"],"Object Features":"None","trends":["There have been 10 other sightings in Mission Viejo","There were no other sightings in Mission Viejo on or around October 16th 2012"],"Case Number":"43319"}