{"Source":"MUFON","City":"Rising Sun","Object Shape":"Fireball, Sphere, Star-like","Date Submitted":"10/17/2012 03:44 UTC","Sighting Duration":"03:00:00","files":["/var/www/straped/mufon/html2text/43331.html.txt","/var/www/straped/mufon/org/43331.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.699847,+-76.060887(43331)&iwloc=A&hl=en\"> mufon case (43331) map </A>","Object Flight Path":"Other","Case Number":"43331","Weather Factors":"Unknown","trends":["There have been 3 other sightings in Rising Sun","There were no other sightings in Rising Sun on or around October 17th 2012"],"Longitude":"-76.060887","Region":"Maryland","divs":["Sighting DetailsI live in northeast MD and see strange lights on semi regular basis while looking for shooting stars. I was on my front porch around 1am last night doing my usual star gazing thing when i noticed a light off to my left. It was quite far off in the distance but still appeared a lot brighter than some of the surrounding stars (sans Jupiter). And at first I thought it was a star, until it flashed red-green and began to move. It would appear to zoom for a second and stop very often, often changing directions in a split second. It did several figure 8 movements and would sometimes bob a bit when it stopped (stop and then dip back a small amount), After 30 minutes or so I began to notice that after stopping abruptly sometimes a smaller dimmer light would shoot in the direction it was moving before it stopped or vice versa. The object seemed to be able to move in any given direction at any speed at any time it wanted, often accelerating extremely fast and reversing direction without losing any speed. On several occasions the thing dropped what had to be several hundred feet in jumps, almost like a toy on a string but at insane speeds. And for hours i watched it zip around the sky and exhibit some of the strangest flight patterns I have ever seen, doing things impossible for conventional aircraft to even attempt, usually getting a bit brighter before doing so. I knocked on the door of my house to get the attention of my roommates who came outside briefly but were daunted by the cold and retreated indoors, but did see the object. After they went inside I began asking it questions (mostly asking myself aloud) and after doing so, got the uncanny feeling I was being watched. Personally I think there was something much closer to me, keeping an eye on me. I continued to sit there for a long while before eventually grabbing some night vision goggles and a friend to help check my yard out (at this point the presence i felt near me was intense enough for me to peel my eyes off of the object). I hadn't thought to grab it because whenever I had tried to use it film UFOs in the past they wouldn't show up due to the immense distance. (Its designed for in home use) It did show up on the night vision but not very well, a spec of light no larger than a pixel on its display. It wasn't long after that I noticed other lights doing similar things all around the night sky. 6 or 7 in total, all staying for the most part in their own little area but all dipping and diving like the first one. It was a bit scary to be honest, I'd never seen anything on that scale in my life and it shocked me. The whole event lasted three or four hours before I just left them to do their thing, it was cold and I was tired and they weren't going anywhere anytime soon."],"Viewing Distance":"Over One Mile","Tags":"City","Latitude":"39.699847","Country":"United States","Object Features":"Unknown","Disposition":"Unresolved","Log Number":"US-10172012-0017","Summary":"One, then several lights flying oddly and spitting more lights.","Date of the Event":"10/17/2012 02:00 UTC"}