{"Date Submitted":"10/17/2012 08:17 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.669935,+-73.583878(43339)&iwloc=A&hl=en\"> mufon case (43339) map </A>","Source":"MUFON","Region":"Quebec","Date of the Event":"09/02/2012 06:15 UTC","trends":["There have been 7 other sightings in Laval","There were no other sightings in Laval on or around September 2nd 2012"],"Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/43339.html.txt","/var/www/straped/mufon/org/43339.html"],"Tags":"City","Country":"Canada","Longitude":"-73.583878","Object Shape":"Circle, Disc","Weather Factors":"Unknown","Summary":"Observed a white circular object reflecting the sun. Moving fast, perfectly round.","City":"Laval","divs":["sighting detailsnote: submitted by field investigator. on sept. 2,2012, i was sitting outside in my backyard playing with my dog and as i sat back i noticed a white orb over top of my roof at a 60 degree angle west of where i was sitting. i looked twice to make sure nothing was wrong with my eyesight and realized that i was really seeing what i was seeing. i would describe it as white orb ( or disk) that was moving at a constant pace coming from the east and going towards the west. it was around 6:15 pm. the sighting lasted for not more than a minute until it disappeared behind the roof in front of my house. it seemed like the sun was reflecting on its surface. i was sure it was not a plane or helicopter because of its perfectly round shape and also because of its speed. i was not sure if it could have been a weather balloon since there is a small airport not far from where i live and there is one across the river in terrebonne. i was so intrigued by what i saw that i looked on the internet for reports of ufo sightings and this is when i found your association so this is why i contacted you. \\lr"],"Disposition":"Unresolved","Sighting Duration":"Undisclosed","Log Number":"CA-10172012-0025","Latitude":"45.669935","Object Features":"None","Viewing Distance":"Unknown","Case Number":"43339"}