{"Case Number":"43337","Log Number":"US-10172012-0023","Date Submitted":"10/17/2012 08:02 UTC","trends":["There have been 2 other sightings in Marion","There were no other sightings in Marion on or around October 14th 2012"],"Latitude":"42.061183","files":["/var/www/straped/mufon/html2text/43337.html.txt","/var/www/straped/mufon/org/43337.html"],"Viewing Distance":"Over One Mile","Object Flight Path":"Hovering then path","Region":"Iowa","map":"<A HREF = \"http://maps.google.com/maps?q=42.061183,+-91.605469(43337)&iwloc=A&hl=en\"> mufon case (43337) map </A>","Object Shape":"Diamond, Star-like","Disposition":"Unresolved","Source":"MUFON","Object Features":"Unknown","City":"Marion","Weather Factors":"Unknown","Longitude":"-91.605469","divs":["Sighting DetailsStationary bright star-like object in the SW sky at approximately 7:45 p.m. Sunday night, October 14, 2012. Clear beautiful night, as I starred at what i thought was a planet, it began to move north, then changed direction east. Halfway across the sky, it stopped and snowflake type things fell out of the bottom like a deposit of some sort and it started on it's path again, only to stop one more time and more of the snowflake type things fell out of the bottom, then started moving east again and disappeared into the night sky. I am an avid sky watcher. I see satellites almost every day (mornning and night), lots of falling stars, meteors and space junk and I have never ever seen anything like this before. It was so bright and so deliberate in it's actions. I really couldn't believe my eyes. I ran in the house and called my sister, because it was just unbelievable. I am a colleague of Steve Junge's and would prefer to only discuss this with him if possible. Thank you."],"Summary":"Stationary star-like object, then started moving east, stopped twice and emitted snowflake like things out of bottom and continued path","Tags":"City","Sighting Duration":"Undisclosed","Date of the Event":"10/14/2012 07:45 UTC","Country":"United States"}