{"Latitude":"33.62324","Sighting Duration":"Undisclosed","Region":"Arizona","Longitude":"-112.109348","Object Flight Path":"Straight-line path","Country":"United States","Disposition":"Unresolved","Log Number":"US-10172012-0016","map":"<A HREF = \"http://maps.google.com/maps?q=33.62324,+-112.109348(43330)&iwloc=A&hl=en\"> mufon case (43330) map </A>","Weather Factors":"Unknown","trends":["There have been 417 other sightings in Phoenix","There were 2 other sightings in Phoenix on or around October 12th 2012"],"Date of the Event":"10/12/2012 08:30 UTC","Object Shape":"Cylinder","Source":"MUFON","Date Submitted":"10/17/2012 02:47 UTC","Object Features":"Unknown","Tags":"City","City":"Phoenix","divs":["Sighting DetailsI was in the house watching T.V my friend dolores uphold was on the patio in her wheel chair she was facing south, something made her turn around and she saw the lights first. she yelled for us to come out . we did so my self my husband and my son, we had no idea had never seen anything like it, we thought must be ufo bright orange lights moving slowly n.w. to n.e.they were flying in rows but different speeds sometimes a couple of them would almost merge together then separate again there was about six accross and too many to count but between fifty and one hundred we watched as they slowly moved we were in the back yard and when it looked like we could see the last of them we ran to the front yard and watced them as they were leaving i thought they would just keep going and i called my daughter to watch for them , she lives north of us then they just started to disapear. their was one larger one that followed about 50 yards behind the rest it also disapeared, I was amazed,my friend had goose bumps an was very excit6ed,we still can t get over it. we haven t heard any thing else about it but my husban was playing poker last night and mentioned it one lady said she also saw them but was on the freeway and couldn t stop."],"files":["/var/www/straped/mufon/html2text/43330.html.txt","/var/www/straped/mufon/org/43330.html"],"Summary":"observed bright orange lights in the sky going eorth east to north west","Viewing Distance":"501 Feet - 1 Mile","Case Number":"43330"}