{"Summary":"Object brightened, dimmed, brightened at left end, other end remained less bright.","Case Number":"43338","City":"Valle de Bravo","map":"<A HREF = \"http://maps.google.com/maps?q=19.160005,+-100.135265(43338)&iwloc=A&hl=en\"> mufon case (43338) map </A>","Date of the Event":"10/17/2012 02:54 UTC","Country":"Mexico","Sighting Duration":"Undisclosed","Region":"Mexico","divs":["Sighting Details1. Starting to cook outside. 2. Our maid first called the object to my attention. She saw it while cleaning the veranda on the lake side of the house. 3. It was and is not clear what it was. Appeared long rectangular or cylindrical; not totally clear even with binoculars because of the distance. 4. First saw it, it appeared in front of mountain and slightly higher. After going for camera and binoculars, it was slightly behind tree line of mountains, moved very slowly to the right. When I got camera, it was partly obscured by trees. Appeared very bright at left end, which then dimmed a bit, then appeared to brighten appreciably again, then descend very slowly out of sight. 5. Felt it was something I had not seen before anywhere. Took me a bit by surprise. Not shaped like an aircraft or a helicopter, blimp or ultralight, sea plane or paragliders that frequent the area. The location was not one where paragliders go. Did not make me feel odd, or uncontrolled. 6. Object appeared to slightly descend behind the tree line, out of site. Did not see it emerge after observing the area or panorama for several minutes."],"files":["/var/www/straped/mufon/html2text/43338.html.txt","/var/www/straped/mufon/more/43338_submitter_file1__IMG6907.JPG","/var/www/straped/mufon/more/43338_submitter_file2__IMG6908.JPG","/var/www/straped/mufon/more/43338_submitter_file3__IMG6909.JPG","/var/www/straped/mufon/org/43338.html"],"trends":["There have been no other sightings in Valle de Bravo","This sighting has never been favorited."],"Weather Factors":"Unknown","Object Shape":"Cylinder, Square, Rectagular","Date Submitted":"10/17/2012 08:00 UTC","Longitude":"-100.135265","Latitude":"19.160005","Source":"MUFON","Object Flight Path":"Path then hovering","Disposition":"Unresolved","Object Features":"Unknown","Log Number":"MX-10172012-0024","Tags":"City","Viewing Distance":"Over One Mile"}