{"Object Flight Path":"Hovering then path","Summary":"blue object larger than airplane low in sky turned red than phased back to blue","Region":"","divs":["Sighting DetailsI contacted you in August of this year I believe around the 17th about something strange I experienced on August the 3rd 2012. On September the 2nd of this year I was driving in my car taking my wife to work, she was on a night shift this particular night,I was driving threw a small place called Crook in county Durham and we were just entering a small place called Howden le wear when I saw what I believe to be the same thing-object I had seen a month earlier, it was low above the horizon in the south-south east a neon blue-electric blue star like bright light, I could not believe what I was seeing it is such an unusual colour there is nothing else like it. I pointed it out to my wife and much to my relief she could see it too; before I say anymore I want to say that I had questioned my sanity after seeing what I saw on August the third I had spent weeks looking up on medical web sites for a possible explanation. I am the only person who has reported what I saw that night and it was so odd and bizarre and lighting up the place that although I saw it I couldnt come to terms with it for weeks afterwards. What I and my wife saw on Sunday the 2nd of September was about a mile away, it was about ten degrees or less above the horizon and as we drove through a little place called low grange we were now closer and had a clearer view of the southern skyline the object appeared from here to be round it turned orange-red witnessed by my wife then blue again ; a passenger airplane came from higher up from the south west and appeared to be smaller in size than the object the plane was from our view point to the right and quite a bit higher up you would think that the pilots must have seen it. It must have been around 21.00-21.15 when we first sited the object it hovered and moved very slowly actually was in the same general area I had my sighting a month earlier. The sighting lasted about 15 minutes. I wanted to go in the direction of the object but my wife was frightened and needed to get to work, when I drove back after I had dropped my wife at work I looked every where for the object driving to where we had last seen it and driving in the direction it appeared to be hovering-moving slowly but I never saw it again."],"Date Submitted":"10/17/2012 06:04 UTC","Object Shape":"Circle, Sphere, Star-like","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/43334.html.txt","/var/www/straped/mufon/org/43334.html"],"Date of the Event":"09/02/2012 09:12 UTC","Sighting Duration":"00:15:00","Object Features":"Unknown","trends":["There have been no other sightings in Middlestone","This sighting has never been favorited."],"Source":"MUFON","Tags":"City","Longitude":"-1.609283","Viewing Distance":"Unknown","Case Number":"43334","Weather Factors":"Unknown","Latitude":"54.674714","Log Number":"GB-10172012-0020","City":"Middlestone","Country":"United Kingdom","map":"<A HREF = \"http://maps.google.com/maps?q=54.674714,+-1.609283(43334)&iwloc=A&hl=en\"> mufon case (43334) map </A>"}