{"Date Submitted":"10/17/2012 04:06 UTC","Case Number":"43332","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","City":"La Quinta","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Source":"MUFON","Log Number":"US-10172012-0018","Disposition":"Unresolved","trends":["There have been 3 other sightings in La Quinta","There were no other sightings in La Quinta on or around October 17th 2012"],"divs":["Sighting DetailsHe adding to daughters school,daughter mentioned Venus, I quoted really bright this morning. Venus is \"moving Dad\"then two more appeared, the first round object disappeared with two spheres following in line behind the now disappeared first object. First object re appears and starts to accelerate with a small tiny vapor type trail,first object then can't be seen anymore. Second and third object joined with a forth sphere now in line he added east aprox time 7.02 am. Middle object now exits curve apex of flight and heads out straight towards open space, Really starts to accelerate and starts to turn orange color till out of sight. Fourth object disappeared other two objects remaining in line headed east till no longer seen again. Fifth object appears, small Cessna type aircraft in vicinity that was headed south east. Fifth object travels aprox 5 seconds east then disappeared. At the start of it all thought we were seeing Venus, then object was moving to be joined by other objects,then thought maybe meteors breaking apart but objects were joined by others that appeared and disappeared. The thought of comet shoemaker levy ran as a thought but then the above mentioned description occured, Sincerely, Gary N"],"Object Shape":"Egg, Sphere","Latitude":"33.663357","Date of the Event":"10/17/2012 07:01 UTC","Tags":"City","Region":"California","Longitude":"-116.31001","Summary":"myself an daughter 5 obj. disappeared, left arc turned orange,extreme bright round. appear then disappear,change arc of flight ,vapor trail short then disappear","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.663357,+-116.31001(43332)&iwloc=A&hl=en\"> mufon case (43332) map </A>","Weather Factors":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/43332.html.txt","/var/www/straped/mufon/org/43332.html"],"Object Features":"Unknown"}