{"Viewing Distance":"Over One Mile","City":"Prescott","Sighting Duration":"00:05:00","divs":["sighting detailsaround 6:30pm on october 14, 2012, i was driving down 89a headed west from prescott valley, az to prescott az. my girlfriend and i were on our way to the store. the sun was setting and the horizon was super bright. in the distance over the hill i saw two star-like objects hovering over the hills south of granite mountain. my girlfriend saw them as well and we began to try and figure out what they were. as a helicopter pilot in the area, i'm aware of what air traffic looks like and what normal flight operations are like in the area. when i saw these objects i had no idea what they could be. as we continued west on 89a we passed under the granite dells off-ramp and i lost sight of the objects. i scanned the sky and i found one much closer. maybe 2000ft off the ground just hovering. i knew again it wasn't an aircraft. it was more of an ellipse shape with a solid part. it's hard to explain, but it was almost like seeing a ball spin around an axis rapidly leaving a white trail behind it forming an ellipse shape. twice it stopped spinning on this \"axis\" and it just hovered. when it stopped it would look like a star in the sky. remember this is when the sun beginning to set and the sky is more blue\\yellow still. after about 5 minutes of watching this happen and while i was still staring at the star-like object in the sky, suddenly it just faded out into nothing. we couldn't believe it."],"Longitude":"-112.466302","Log Number":"US-10172012-0019","trends":["There have been 25 other sightings in Prescott","There were no other sightings in Prescott on or around October 14th 2012"],"Source":"MUFON","Object Flight Path":"Hovering then path","Disposition":"Unresolved","Object Features":"None","Summary":"2 starlike objects. Lost sight, then I saw one ellipse several hunderd feet higher and closer. It changesd shape from ellipse back to star a couple times, then I watch as it dissapeared.","files":["/var/www/straped/mufon/html2text/43333.html.txt","/var/www/straped/mufon/org/43333.html"],"Country":"United States","Region":"Arizona","map":"<A HREF = \"http://maps.google.com/maps?q=34.549334,+-112.466302(43333)&iwloc=A&hl=en\"> mufon case (43333) map </A>","Case Number":"43333","Object Shape":"Oval, Star-like","Date Submitted":"10/17/2012 04:12 UTC","Date of the Event":"10/14/2012 06:30 UTC","Tags":"City","Latitude":"34.549334","Weather Factors":"Unknown"}