{"Sighting Duration":"00:00:20","Tags":"City","Region":"Ontario","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=44.1218,+-77.811(43348)&iwloc=A&hl=en\"> mufon case (43348) map </A>","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/43348.html.txt","/var/www/straped/mufon/org/43348.html"],"City":"Codrington","Log Number":"CA-10182012-0004","Summary":"looked up at sky and saw star formations after several minutes one broke away and moved away at rapid speed","Object Features":"Unknown","Weather Factors":"Unknown","Latitude":"44.1218","Longitude":"-77.811","trends":["There have been no other sightings in Codrington","This sighting has never been favorited."],"Country":"Canada","Object Shape":"Star-like","Source":"MUFON","divs":["Sighting DetailsI was up early in the morning and let my dogs out. This was around 5:50 a.m.. I was standing on my deck on the western side of the house. The sky was still dark out and I looked at the stars in a south western direction. I was looking at these star formations for several minutes when suddenly one of the stars began to move from where it was. It had been positioned brightly in the sky and remained still up until now. I thought that this was very strange considering that it had no airplane lights blinking or flashing......just a solid bright light. It moved rapidly away from where it had begun. This object covered a huge distance in no time at all. In a matter of moments, it was gone from sight like moved south and up. I was shocked and amazed at the velocity and brightness of the object. To me, it seemed like it was pretending to be a star. I called Trenton Air Base in Ontario Canada at around 6:00 a.m. in the morning. Identified myself and gave contact information. I reported what I saw and they took my information. The officer in charge said that they would inquire with other radar facilities. Anyways, I do not know what this thing was but it was not a plane, satellite, star or meteor. The speed was very impressive..far exceeding what I have seen in the air."],"Date Submitted":"10/18/2012 03:39 UTC","Date of the Event":"10/16/2012 05:55 UTC","Object Flight Path":"Hovering then path","Case Number":"43348"}