{"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/43347.html.txt","/var/www/straped/mufon/org/43347.html"],"divs":["Sighting DetailsI walk my dog nightly and have seen my fair share of questionable things in the sky, but I have never witnessed so much activity in one evening. Between 8:45pm and 9:45pm on October 17th, a cloudless night in the mid eighty degree range, I saw two fireball looking objects in the sky SW of my home. These are common objects seen once or twice every couple of weeks in the same area as the fabled \"Phoenix Lights\" of 1997. Military flares? Maybe. But do military flares float stationary for 10 to 15 minutes at a time? Not so sure about that. Additionally on this night, I saw many other object across the Western sky. They were the same amber-orange color as the hovering lights but these didn't just hover. Thet would shine brightly, appearing to briefly pulsate, then disappear and reappear in an entirely different location nearby the original location. This would happen between one to five times (seemingly with the same object?). When the object would reappear it wasn't always in the same plane either. Sometimes it would be horizontally even, sometimes it would go diagonally upward, sometimes downward. But it happened, probably TWENTY PLUS TIMES over the course of the hour I spent outside. It gave me chills seeing this happen over and over again."],"Sighting Duration":"Undisclosed","Date Submitted":"10/18/2012 01:47 UTC","Source":"MUFON","Date of the Event":"10/17/2012 08:45 UTC","Latitude":"33.643319","Object Shape":"Fireball","Weather Factors":"Unknown","Country":"United States","Object Features":"Unknown","trends":["There have been 11 other sightings in Surprise","There were no other sightings in Surprise on or around October 17th 2012"],"City":"Surprise","map":"<A HREF = \"http://maps.google.com/maps?q=33.643319,+-112.393618(43347)&iwloc=A&hl=en\"> mufon case (43347) map </A>","Longitude":"-112.393618","Log Number":"US-10182012-0002","Summary":"Multiple sightings: SW, W, NW valley.. Anyone else see this?","Viewing Distance":"Over 1 Mile, Unknown","Tags":"City","Region":"Arizona","Case Number":"43347","Object Flight Path":"Stationary,Hovering then path"}