{"Longitude":"-118.560397","Object Shape":"Boomerang","files":["/var/www/straped/mufon/html2text/43344.html.txt","/var/www/straped/mufon/org/43344.html"],"Source":"MUFON","Weather Factors":"Unknown","Object Flight Path":"Hovering then path","Region":"California","Date Submitted":"10/17/2012 11:48 UTC","Viewing Distance":"Over One Mile","Latitude":"34.290398","Tags":"City","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Date of the Event":"10/25/1980 06:45 UTC","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around October 25th 1980"],"Country":"United States","Summary":"In the NW sky, left of the moon hovering 5 minutes, then 90 deg right turn, dissappeared","divs":["Sighting DetailsIn the early morning of Oct 5, 2012, around 6:40, I woke up and went outside to have a smoke. Being an amateur photographer and a UFO enthusiast, I grabbed my camera before going out as I do every time. I immediately looked for the moon just to observe it, and looked away for about a minute. When I looked back up, I noticed a white dot that was not there before, in addition to a growing mass of clouds all around it. I wasn't sure yet if it were moving and couldn't decide if I should try to get a picture or just witness it. My next thought was that I needed a witness because it did appear to be hovering. I ran inside and woke up my spouse frantically telling him to come outside. He jumped out of bed and ran outside, not even taking time to dress, and stood there for about 2 more minutes and observed it with me. I was working my camera trying to find the object while zooming in, snapping several pictures, all time-stamped at 6:45 am. However, at this time, the object noticeably began to move in an upward direction, then made a right turn towards the direction of the moon. We then watched as it slowly disappeared, but cloud cover remained. Admittedly, there were naturally made clouds in the sky, but what was in the spot of the object and now covering the moon, seemed thinner and not as stable. Meaning, they dissipated rapidly compared to the others in the area. Within 2 minutes of the object disappearing, an almost perfect square-shaped area of the sky (including the moon) became perfectly clear, almost like the clouds were just wiped away. I took pictures of the sky before during and after all of this, to show exactly how clear it became. I as certain about the next statement as I have ever been about anything in my life and that is this; I felt absolutely sure that I would need my camera that morning, and that at different times throughout that day and every since, I have felt a presence."],"Case Number":"43344","Log Number":"US-10172012-0030","City":"Los Angeles","map":"<A HREF = \"http://maps.google.com/maps?q=34.290398,+-118.560397(43344)&iwloc=A&hl=en\"> mufon case (43344) map </A>","Object Features":"Dome, Wings, Other"}