{"Latitude":"41.662808","Longitude":"-72.887621","Log Number":"US-10172012-0026","files":["/var/www/straped/mufon/html2text/43340.html.txt","/var/www/straped/mufon/org/43340.html"],"Tags":"City","Country":"United States","Summary":"Witnessed 5 orange lights with yellow centers traveling from the east heading in a nw direction.","Case Number":"43340","Disposition":"Unresolved","Region":"Connecticut","Date Submitted":"10/17/2012 08:34 UTC","City":"Bristol","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","trends":["There have been 8 other sightings in Bristol","There were no other sightings in Bristol on or around August 25th 2012"],"Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was in my back yard letting my dog run around and happen to look in the sky and noticed a orange colored ball with a yellow center traveling from the east. As I stood watching it, I noticed that there were no FAA lights flashing and that it did not make any kind of sound. The object seemed to be moving slowly and steadily toward the northwest.I couldn't tell the elevation exactly but I estimated it to be over 500' and less than 1000' in the sky. As I watched it moving toward my direction I could see a that there was a second ball identical to the first to the right and a little further back. Same elevation and same speed and same direction. Now i stood there watching these objects for about a minute or two, the first object was traveling behind a pine tree. I could see it go behind the tree so I looked away to the second object and saw a third identical ball same distance behind the second as the second was to the first. Same speed, same elevaton, and same direction. I looked back at the first to see if I could still see it behind the three, and the first had disappeared behind the pine tree. I then turned back and watched the second and the third. As I stood there watching the second and the third heading toward the pine tree, a fourth had appeared and the second object was now going behind the pine tree. Now all four of these object were still traveling the same direction, same elevation , and same speed. equally distanced apart, and one behind the other. The second object disapeared like the first and I could still the third and forth objects moving in the sames direction. the third object was now approaching the pine tree and a fifth object then appears equally behind the fourth. I turned to see if the the third had disappeared like the first two and the third did continue beyond the pine tree. I was completely amazed and shocked at the same time. I didn't know what to make of this situation. I did think to grab my cell phone and tried to take a couple of pictures and two did come out ok. I wish I thought to use the camcorder instead though. I was able to take two pictures of the last two objects before they disappeared behind the pine tree. Only the third object did continue past the pine tree until i couldnt see it anymore becuase of trees across from my home."],"Object Shape":"Circle, Fireball, Star-like","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.662808,+-72.887621(43340)&iwloc=A&hl=en\"> mufon case (43340) map </A>","Object Features":"None","Date of the Event":"08/25/2012 08:16 UTC"}