{"Disposition":"Unresolved","Object Flight Path":"Stationary","divs":["Sighting DetailsI live in West Seattle a neighborhood SW of the downtown core of Seattle, Wa and on the morning of October 18th 2012 I was sitting on my porch Like I do most mornings to have my cup of coffee which faces west but got up to take a look @ Venus which is on the east facing side of the house when a light appeared almost directly overhead, I initially thought it was the ISS ( International Space Station ) flying over but upon further inspection I realized the object I was looking at was NOT the ISS it was in fact an unidentified flying object. As I looked at the object I noticed that it was not moving and was as bright as VENUS itself. I watched the object as it sat stationary nearly directly overhead for about 30 seconds at which time the object rapidly changed color from White to Blue and held this color for approximately one minute, I was torn whether to go inside and grab my binoculars to get a better view or stay put and watch the object. I decided to stay put and watch the object as I continued to watch the object it once again rapidly changed from Blue to Green and in the span of 3 seconds it changed color yet again to Yellow before turning to Orange and then fading out completely from view in a time frame that I can only explain as immeasurable ( THAT FAST )... I stood in the exact spot I had initially seen the object appear from to see if the object would reappear but it did not, I came inside and tried to make sense of what I had just witnessed when after about 15 minutes I realized that this was not the first time I had seen an object in that part of the sky, It was in fact the fifth time JUST this past year I had seen other unexplained objects around the same time frame and nearly the same spot of sky. I have throughout the years seen objects that have left me scratching my head but this morning's account is by far the most impressionable and unforgettable.I don't know what I saw this morning or the other four times this past year but after today I will be making a concerted effort to try and document any future encounters with unidentified objects I see in the southern part of the sky. Please do not hesitate to contact me wit any questions regarding this encounter in fact I welcome any calls, e-mails or visits. ~ Patrick Kelly Seattle, Wa A True Believer"],"Date of the Event":"10/18/2012 05:51 UTC","Log Number":"US-10182012-0008","Weather Factors":"Unknown","Case Number":"43352","Source":"MUFON","Date Submitted":"10/18/2012 09:22 UTC","files":["/var/www/straped/mufon/html2text/43352.html.txt","/var/www/straped/mufon/org/43352.html"],"trends":["There have been 110 other sightings in Seattle","There were no other sightings in Seattle on or around October 18th 2012"],"Object Features":"Other","Longitude":"-122.378723","Country":"United States","Summary":"Appearing object that changed colors and disappeared","City":"Seattle","Tags":"City","Sighting Duration":"00:03:00","Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=47.542593,+-122.378723(43352)&iwloc=A&hl=en\"> mufon case (43352) map </A>","Latitude":"47.542593","Viewing Distance":"Unknown","Region":"Washington"}