{"Object Flight Path":"Stationary","Object Shape":"Cigar, Egg","Viewing Distance":"501 Feet - 1 Mile","Latitude":"39.931688","Date Submitted":"10/18/2012 08:19 UTC","files":["/var/www/straped/mufon/html2text/43350.html.txt","/var/www/straped/mufon/org/43350.html"],"Date of the Event":"10/17/2012 03:45 UTC","Tags":"City","Disposition":"Unresolved","Log Number":"US-10182012-0006","Sighting Duration":"00:06:00","Country":"United States","divs":["Sighting DetailsWas walking the kids to school at 8:30 a.m. when we saw it the first time. We have about 20 people who saw it, including 7 adults. (the rest were kids) It was seen in the southern sky between two chemtrails. It just sat in one place for 15 minutes...It would get bright about every minute. Very bright. Then, it just disappeared. I didn't have a camera on me at that time. At 3:45, I picked the kids up from school and had my camera on me. I looked for it all day. As me and the kids were talking about what we saw that morning, there it appeared in the ENE sky. As soon as I saw it, I turned on my camera and started recording. Again, it just sat in one spot and would get very bright, then dim out. We watched it for about 6 minutes. But, it was closer than it was in the morning. We could see the shape of it through the haze left by the chemtrails. It was gray in color. It appeared to be oval shaped, but seemed a squared off on one side. Then, it just disappeared. I have the video going for all 6 minutes, but can only see it up to 4 minutes because I zoomed in and couldn't tell if I was getting it on camera anymore. On way home, my son saw it again. By the time I got the camera on, it turned into a white, cigar shaped object and slowly moved away. Almost shaped like a plane, but we could see no wings. Just then, a black helicopter flew right over our house. I have that on video tape too. It looked like it said sheriff on the side, but I could be mistaken. Whatever it said, it was written in yellow."],"Summary":"Seen at 8:30 a.m. and 3:45 p.m. hovers in one spot. Glows bright, then dims out. First sat for 15 minutes, then 6 the second sighting.","City":"Chambersburg","Weather Factors":"Unknown","Longitude":"-77.661185","Object Features":"Unknown","Region":"Pennsylvania","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.931688,+-77.661185(43350)&iwloc=A&hl=en\"> mufon case (43350) map </A>","trends":["There have been 4 other sightings in Chambersburg","There was one other sighting in Chambersburg on or around October 17th 2012"],"Case Number":"43350"}