{"City":"Bayside","Weather Factors":"Unknown","Disposition":"Unresolved","Case Number":"43355","Sighting Duration":"Undisclosed","Latitude":"40.841744","Object Features":"Unknown","Object Flight Path":"Stationary","Source":"MUFON","Longitude":"-124.063881","Date Submitted":"10/18/2012 01:50 UTC","divs":["sighting detailsdark at 6 a.m. this morning, i went onto the porch and saw a large, bright, fire-like , round light shining between some trees over our rural valley that is almost completely dark at night except for an occasional light in a house window. i thought, why haven't i noticed this before? is it a forest fire on the mountain? but no fire is perfectly still and round, a glowing radiance, like this is. i tried to determine where it was but couldn't really because the light was so bright. it shone between some trees, so it was behind a rise northeast of our house, and it was either hovering over the valley northeast of us or possibly hovering\\stationary on a mountain further east by a few miles. as i watched it, the light seemed brighter and larger, may have moved toward me, and lasted maybe 10 minutes. it struck me as a perfect, glowing radiance with star-like light prongs coming off all around the circumference. very beautiful. i went inside briefly, and when i came back outside the light was gone."],"files":["/var/www/straped/mufon/html2text/43355.html.txt","/var/www/straped/mufon/org/43355.html"],"Object Shape":"Fireball","trends":["There have been no other sightings in Bayside","This sighting has never been favorited."],"Region":"California","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.841744,+-124.063881(43355)&iwloc=A&hl=en\"> mufon case (43355) map </A>","Viewing Distance":"Unknown","Summary":"Vivid, radiant, flame-colored, round light hovered about 10 minutes between some trees in front of a mountain in rural Jacoby Creek Valley. Never there before.","Country":"United States","Date of the Event":"10/18/2012 06:00 UTC","Log Number":"US-10182012-0011"}