{"divs":["Sighting DetailsI was sitting in my apartment when my friend called me to go look outside. I walked out there to smoke a cigarette with my fiance and I saw what she was describing. Almost directly by the North Star, there was this weird thing darting around the sky, blinking red, orange, and yellow lights fairly rhythmic. I thought it could be a plane and was very skeptic but as a paid more attention it was a disk-shaped, shiny, silver thing. It looked as if the surface of the metal had almost target-like carvings, just circles carved in the metal. It wasn't going in a straight direction; it was moving up, then darting down, then backwards, forwards, and DEFINITELY not a plane's typical flight pattern. It would fly around at amazing speeds. Then, we noticed three more around the same area. One was above the first thing we saw, another was right across from it, and another was behind us in the sky when we looked around. They ALL were flying the same way, blinking the same lights, almost like they were communicating to each other by the rhythm. Then, all of them took off to the left of the North Star and I didn't see them again that night. Maybe 5 minutes after that, what looked like government planes or jets were flying in the same direction as those things. I have no idea what to think about it but I know those flying objects were definitely not planes."],"Latitude":"37.550055","City":"Richmond","map":"<A HREF = \"http://maps.google.com/maps?q=37.550055,+-77.430898(43354)&iwloc=A&hl=en\"> mufon case (43354) map </A>","Date of the Event":"10/16/2012 11:15 UTC","Longitude":"-77.430898","trends":["There have been 39 other sightings in Richmond","There were no other sightings in Richmond on or around October 16th 2012"],"Disposition":"Unresolved","Weather Factors":"Unknown","Country":"United States","Tags":"City","Viewing Distance":"Unknown","Object Shape":"Disc","Log Number":"US-10182012-0010","Date Submitted":"10/18/2012 11:48 UTC","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/43354.html.txt","/var/www/straped/mufon/org/43354.html"],"Sighting Duration":"Undisclosed","Region":"Virginia","Source":"MUFON","Case Number":"43354","Summary":"Disk-shaped, bright red, orange, and yellow lights, the actual thing seemed a metallic silver","Object Features":"Insignia"}