{"Summary":"I was taken to the Aluetian Islands to collect fish. Then we were fired upon.","Date Submitted":"10/18/2012 10:28 UTC","Date of the Event":"01/15/1995 03:00 UTC","Object Shape":"Disc, Other, Unknown","Latitude":"40.465334","Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=40.465334,+-79.922574(43353)&iwloc=A&hl=en\"> mufon case (43353) map </A>","Source":"MUFON","Log Number":"US-10182012-0009","Weather Factors":"Unknown","Object Features":"Dome, Window(s), Appendage(s), Other","Disposition":"Unresolved","Country":"United States","Sighting Duration":"00:30:00","trends":["There have been 122 other sightings in Pittsburgh","There were no other sightings in Pittsburgh on or around January 15th 1995"],"Tags":"City","Case Number":"43353","files":["/var/www/straped/mufon/html2text/43353.html.txt","/var/www/straped/mufon/org/43353.html"],"Viewing Distance":"20 Feet or Less","divs":["sighting details at might my spirit\\electrical body was taken aboard a craft navigated by white zeta reticulians. they took me under the water by the aluetian island chain by attu island. they captured fish; sting rays, and a killer whale. they showed me where they put them on the ship. it looked like the inside of a stainless steel block of swiss cheese filled with water. the killer whale entered and all the fish darted to their own holes determined by the size of the fish. i was looking through a porthole when one of them communicated with me sounding like a little boy who had just inhaled a helium balloon, \"we gotta get out of here!\" instantly i was back in the main control room watching through a monitor us coming up out of the water and skipping across the aluetian island chain. the next day on channel eleven news. they reported a nuclear bomb testing up at the alutian islands. there was no testing they fired at us. while we were under the water. the u.s. military has accidently drilled into an underground base of grays inside the aluetian island chain. i was with the whites. now the combined u.s. military\\gray star wars defense system is keeping the good compassionate whites away from the earth. i first thought the good aliens were trying to save the fish from the nuclear bomb testing until i found out there was no test. that was just a cover story for an excuse for blowing up a nuke."],"City":"Pittsburgh","Longitude":"-79.922574","Region":"Pennsylvania"}