{"Date Submitted":"10/18/2012 04:18 UTC","Object Shape":"Boomerang, Disc","Longitude":"0.57258","Source":"MUFON","Country":"United Kingdom","Object Features":"Unknown","Viewing Distance":"21-100 Feet","Summary":"Began fixed in sky, moved freely","City":"canvey island","Weather Factors":"Unknown","Tags":"City","Date of the Event":"10/18/2012 07:38 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=51.529385,+0.57258(43356)&iwloc=A&hl=en\"> mufon case (43356) map </A>","Sighting Duration":"00:12:00","Case Number":"43356","Disposition":"Unresolved","Region":"","trends":["There have been no other sightings in canvey island","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/43356.html.txt","/var/www/straped/mufon/org/43356.html"],"Latitude":"51.529385","divs":["Sighting DetailsI went to the door to have a smoke and saw 2 white semi-transparent lights sitting in the sky, a larger one above a smaller light. The smaller light began moving from right to left extremely quickly, fading when it reached a certain point then coming back. Then the bigger light began moving to the left in segments, About 10 feet each time, The lower one staying in it's pattern with it. Then the bigger light enlargened to a disc shape and began free-flying across the sky, over my house and the general nearby area, The small light also flew around freely although it didn't change to a disc shape. It was far too big to be a plane or a helicopter, moved too smoothly to be from a light and it was silent. It was as if the light was above the clouds. After around 10 minutes of flying over the area, the bigger disc shaped light flew to the west and vanished and the smaller light flew to the south east and vanished. I can't think of any explanation at all for it, It couldn't have been any form of plane or helicopter as it was silent, and it would have been interrupted by the various telephone wires if it were someone shining a high powered torch in the sky. From the size of the larger light, It would be around 50 feet wide if it was on the ground. It was shaped like half a circle. The smaller light would be around 20 feet and was the same sort of shape."],"Log Number":"GB-10182012-0012","Object Flight Path":"Straight-line path,Path with directional change,Other"}