{"Object Shape":"Unknown","Log Number":"US-10182012-0015","Longitude":"-79.077928","Date Submitted":"10/18/2012 05:22 UTC","divs":["Sighting DetailsOn the internet in room, had just started up the computer when I heard a high pitch ringing and felt a super high pressure build in my head almost like an even wave of pressure, no changes or fluctuations once it started, from left to right. I could feel it as it moved over the complex. I remember thinking it was super weird but felt oddly calm, like more calm then the few minutes before I started hearing the ringing. Suddenly drowsy and I passed out at the computer. woke up two hours later, spread eagle in front of computer, fully awake and alert but really disoriented almost like I was drunk. Immediately felt a presence and heard noises in living room and went out to say hi and ask if they heard the ringing too(still happening at this point). remembered what time it was and stopped in the hallway before getting to the living room. Had a sudden great fear of the whatever was in the other room as I stood in the hallway, retreated to the backrooms and turned on every light in the place before entering the living room. No presence but still ringing, it stopped 15 min later"],"Weather Factors":"Unknown","Viewing Distance":"Unknown","Object Flight Path":"Hovering then path,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=35.917838,+-79.077928(43359)&iwloc=A&hl=en\"> mufon case (43359) map </A>","City":"Carrboro","Date of the Event":"10/02/2012 02:45 UTC","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/43359.html.txt","/var/www/straped/mufon/org/43359.html"],"Region":"North Carolina","Source":"MUFON","Latitude":"35.917838","Country":"United States","Case Number":"43359","trends":["There has been one other sighting in Carrboro","There were no other sightings in Carrboro on or around October 2nd 2012"],"Tags":"City","Object Features":"Unknown","Sighting Duration":"Undisclosed","Summary":"High pitch ringing, high pressure felt, sudden great drowsiness, two hours later in chair with all lights still on, presence in house felt"}