{"Sighting Duration":"Undisclosed","Viewing Distance":"20 Feet or Less","Disposition":"Unresolved","Object Shape":"Boomerang, Circle, Disc, Fireball, Oval, Sphere, Star-like","Latitude":"42.137604","City":"Erie","map":"<A HREF = \"http://maps.google.com/maps?q=42.137604,+-80.083859(43351)&iwloc=A&hl=en\"> mufon case (43351) map </A>","Summary":"Aliens running across the highway. UFO's landing on the side of the highway. being shot at by aliens. Multible nights and being chased by UFO craft.","Date of the Event":"10/17/2012 01:03 UTC","Tags":"City","Source":"MUFON","Date Submitted":"10/18/2012 09:14 UTC","divs":["Sighting Details My job requires me to drive at night. Undisclosed In the past couple of months I myself my girlfriend, and my son. Have witnessed Aliens; the Grays; small ones running across Route 80 between 1 am and 3 am. They made my girlfriend's vision foggy. They affected her mind.They looked like skinny Ethiopians running with backs perfectly straight perpendicular to the ground not leaning forward like a person running and there arms stayed at there side completely still no movement, not swinging like a normal person would run. Red lights landing in the trees brought us to the attention. I thought it was an explosion at first. The red lights rose up again out of the trees and split into two and followed us down the highway for five miles. If I put on the breaks so would the UFO. If I gave it gas so did the UFO. Now at 1 am in the past two nights 16th and 17th big bright green orbs have been coming straight down out of space aimed directly at my truck. They caused a tractor trailer to slam on his breaks last night in the middle of the highway and nearly crash. I feel they are shooting at me or something. It comes out of the sky and heads directly towards my truck. My job requires me to travel this route. I'm afraid but I'm also starting to get mad. There is a small area where these things happen at least once a week. there is something going on in that area. A white light also landed on the side of the road a couple of feet by my truck. Just like the green lights coming out of the sky but this one was white. Route 80 and 322 intersecting 79 by Meadville. If it happens again tonight I'm taking my friend Friday with his gieger counter and if there's no radiation detected I'm going into the woods after them. I want one of there ugly gray heads mounted above my fireplace."],"Object Features":"None","Longitude":"-80.083859","files":["/var/www/straped/mufon/html2text/43351.html.txt","/var/www/straped/mufon/org/43351.html"],"Log Number":"US-10182012-0007","Region":"Pennsylvania","trends":["There have been 39 other sightings in Erie","There were no other sightings in Erie on or around October 17th 2012"],"Country":"United States","Object Flight Path":"Other","Weather Factors":"Unknown","Case Number":"43351"}