{"Tags":"City","trends":["There have been 30 other sightings in Santa Rosa","There were no other sightings in Santa Rosa on or around October 18th 2012"],"Country":"United States","Summary":"appeared 1st like a string of balloons but would hover change directions mostly circular","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Circle, Sphere, Star-like","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Region":"California","Date of the Event":"10/18/2012 09:10 UTC","Sighting Duration":"Undisclosed","Latitude":"38.472837","Log Number":"US-10182012-0018","Source":"MUFON","divs":["Sighting DetailsI dropped one of my children off at school and came home with my other child. My youngest thinks that airplanes and helicopters are Santa flying over to check on them either being good or naughty. Its cute and silly so I think nothing of it. Upon walking up to the front door we both hear an airplane ( there's an airport nearby) and says,\" santa!\" So i look up dont see anything so i scan the horizon. Not seeing an airplane but instead a series of objects headed from the west in a semi easterly direction but shooting east stopping hovering, headed back west, stopping, but the whole pattern dispersed came back together shot away other objects (same size and color) were drawn to one object from a far off direction circle eachother then shoot off in different directions. The overall pattern seemed a westerly to eastern direction but in a circular pattern overhead. Twice an object shot another similar sized object from same color which would either vanish a short distance away or take up an orbital pattern like the other objects. While observing my child and i heard a helicopter ( usually the med evac from a nearby hospital or sheriff helo) but 2 small airplanes flew in from a westerly direction headed east which most planes fly north to south in this area. The planes flew under these objects. The only other size comparison i have would be migratory geese flying to the nearby park headed south For winter. These birds also were below these hovering objects."],"Object Features":"None","files":["/var/www/straped/mufon/html2text/43362.html.txt","/var/www/straped/mufon/org/43362.html"],"Date Submitted":"10/18/2012 08:12 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.472837,+-122.656807(43362)&iwloc=A&hl=en\"> mufon case (43362) map </A>","Case Number":"43362","City":"Santa Rosa","Disposition":"Unresolved","Longitude":"-122.656807"}