{"Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Disposition":"Unresolved","divs":["Sighting DetailsMy wife and I were out walking the dog in Mountain Park not far from our house on June 11th 2007, where an underground water tank is, covered by earth and sod many years ago. I made the comment that this would be a great place for a UFO to land and I looked up and there was a UFO almost directly above us. The reason I mention this first recent encounter to you, is because I did not have a camera with me during this first encounter and I was not able to take any photographs of this object. So, I decided to go back to this same place at approximately the same time of day and I did so, for about fifty times, until almost two years and a month later, to which this sighting and photographs were taken on July 3rd 2009. This report chronicles this second event which I term as the fly by. I was sitting on a bench with my dog above the underground water tank and saw the object and said out loud what the sh-- is that, grabbed my dog by the leash and hurriedly waked a little ways down the path to get out of the way of the trees. I tied my dog to a small tree, got my Casio camera out of my pocket, turned it on and began to take pictures of the object. The object was about 22 degrees up from the horizon and it looked like a black bowling ball rolling toward me. I started to feel very euphoric and when it came closer to me I decided to just experience the object and not take anymore pictures. I remember thinking that this must be what it feels like to witness a star wars production but even better, because this was for real. As the object approached closer to me, (it was moving to the south toward my position and also to the east toward my position) I could hear the wind whistle around the object, for at least as I recall six to ten seconds. The object had no wings and yet was moving through the air at approximately 35 miles per hour. It made no other noise other than, what I just mentioned. As the object approached yet closer to me, the object appeared to be more of a fish shape, somewhat elongated and relatively but not drastically thin at its width. I also perceived that there was an internal arm, just under the outer skin of the object and perceived this feature when the object seemed to be heading into the trees but then, the internal arm shifted forward and the object accelerated upward to just miss the top of the trees. I also perceived at its closest point to me, before it went above the trees, that the very front of the object resembled in slight way a horses head and neck, only in the sense that, how anatomically that these parts project up and away from a horses main body. I then took a very short video of the object as it was headed away from me but could not see the object well enough to keep it on the cameras screen. The weather at the time of the sighting, which was at 8:35PM, was clear and the winds were calm."],"Object Shape":"Sphere, Other","Region":"Oregon","files":["/var/www/straped/mufon/html2text/43373.html.txt","/var/www/straped/mufon/org/43373.html"],"Longitude":"-122.716516","Tags":"City","Date Submitted":"10/19/2012 02:38 UTC","Summary":"I was sitting with my dog on a bench and looking to the northwest and spotted an object that looked like a black rolling bowling ball easily distinguishable from a bird or other ordinary object","Case Number":"43373","City":"Lake Oswego","Viewing Distance":"21-100 Feet","Latitude":"45.413477","Source":"MUFON","Log Number":"US-10192012-0003","Sighting Duration":"Undisclosed","Date of the Event":"07/03/2009 08:35 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.413477,+-122.716516(43373)&iwloc=A&hl=en\"> mufon case (43373) map </A>","Country":"United States","trends":["There have been 4 other sightings in Lake Oswego","There were no other sightings in Lake Oswego on or around July 3rd 2009"],"Object Features":"Appendage(s)"}