{"Country":"United States","Date Submitted":"10/19/2012 10:01 UTC","Date of the Event":"10/18/2012 07:30 UTC","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Sphere","Region":"Illinois","Log Number":"US-10192012-0006","Source":"MUFON","divs":["sighting detailsi was throwing out my garbage at work around 730pm. as i was heading back into the building i noticed a reddish-orange glow in the sky moving at a slow pace (speed of small aircraft maybe). conditions at the time were cloudy with light drizzle. as the object went over the treeline i turned to walk inside and i saw another one coming from the same direction. there were five total heading in the same direction. they seemed to be equally spaced apart as well. the colors went from red to orange, but a transitional not blinking. for how low these things were,if they were some kind of terrestrial aircraft i would expect to hear engine noise. bit nothing, no noise at all. also i was unable to observe if they vanished into the sky because of the treeline that runs behind my workplace. i took a couple videos of this event . i was unable to capture all five. the eeriest thing is that when i went back inside to tell my friends what i saw, one of them pulls out her phone and shows me a picture her cousin took yesterday in downtown joliet. there was still daylight at the time of her picture but it shows 4 bright glowing discs in a line. that event occurred 10\\17\\12. i tried to attach my videos along with the picture but this site is not giving me the option too."],"Object Features":"Unknown","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/43377.html.txt","/var/www/straped/mufon/org/43377.html"],"Summary":"5 orbs traveling SW to NE in Lockport in a straight line, equally distanced.","Tags":"City","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.593585,+-88.054247(43377)&iwloc=A&hl=en\"> mufon case (43377) map </A>","Sighting Duration":"Undisclosed","Case Number":"43377","Longitude":"-88.054247","Latitude":"41.593585","trends":["There have been 4 other sightings in Lockport","There was one other sighting in Lockport on or around October 18th 2012"],"City":"Lockport"}