{"Summary":"five UFO's went past the three of us","Region":"Illinois","Object Flight Path":"Hovering then path,Path then hovering","Country":"United States","Date of the Event":"10/18/2012 07:29 UTC","Log Number":"US-10192012-0002","divs":["Sighting Details2012 Oct 18 - 7:28pm - Three of us were standing (facing west) in front of St.Dennis Church having a cigarette. (1214 Hamilton, Lockport, IL) We see an orange light coming from the south heading north. It appeared from behind a tree line. It was about 40d above the horizon. It looked like a ball of slowly pulsating orange light. No blinking or flashing lights on it. It's speed was like that of a regular jet. - About two seconds later a second orange orb appears from behind the tree line and follows the same path heading north as the first one. It's speed and color were the same as the first one. - About three or four seconds later, a third light appears out of the same spot and was heading in the same direction. This third one seemed to stop briefly and then continued north. My friend Ray took a movie of it with his cell phone. - About 4 or 5 seconds later, a fourth orb appears from the same spot and heads north. I took a pic with my crappy cell phone camera. - About ten seconds after that, a fifth orange orb appears. It appeared from the same spot, heading north, traveling at the same speed as the others. This 5th orb suddenly doubles or triples it's speed. It shoots across the sky and catches up to the fourth orb. This fifth orb then abruptly slows down to the speed that the others seemed to be traveling at. - All five orbs were the same color; they all pulsated the same way; and they were completely silent. - My cell camera pic was of the fourth orb. This pic shows that the fourth orb was made up of four smaller orbs - a white orb followed by an orange orb followed by a yellowish gold orb followed by an orange orb. My eyes did NOT see these smaller four orbs - I only saw a larger orange orb. Additional Facts: - Practically every day the skies above lockport are filled with chemtrails that stretch from horizon to horizon and some times the chemtrails form a grid pattern in the sky. - The unmarked black helicopters are frequently seen flying above us. - Lockport is located near the D.O.E.'s Argonne National Labs and FermiLab. - Unmanned drone airplanes have been seen in this area as well."],"Weather Factors":"Unknown","Date Submitted":"10/19/2012 01:42 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.58571,+-88.057571(43372)&iwloc=A&hl=en\"> mufon case (43372) map </A>","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Object Shape":"Oval, Sphere","Object Features":"None","Disposition":"Unresolved","Source":"MUFON","City":"Lockport","Tags":"City","files":["/var/www/straped/mufon/html2text/43372.html.txt","/var/www/straped/mufon/org/43372.html"],"trends":["There have been 4 other sightings in Lockport","There was one other sighting in Lockport on or around October 18th 2012"],"Case Number":"43372","Longitude":"-88.057571","Latitude":"41.58571"}