{"Source":"MUFON","City":"Brasilia","trends":["There have been 2 other sightings in Brasilia","There were no other sightings in Brasilia on or around June 15th 1988"],"Longitude":"-48.10052","Weather Factors":"Unknown","Case Number":"43388","Viewing Distance":"Unknown","Latitude":"-15.834416","Summary":"Disk apparently very large and very distant bordered by white lights and with a dome on the top","Date Submitted":"10/19/2012 02:16 UTC","Object Shape":"Disc","Object Flight Path":"Stationary","Log Number":"BR-10192012-0017","Disposition":"Unresolved","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/43388.html.txt","/var/www/straped/mufon/org/43388.html"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=-15.834416,+-48.10052(43388)&iwloc=A&hl=en\"> mufon case (43388) map </A>","Country":"Brazil","Region":"Distrito Federal","divs":["Sighting DetailsI'm Italian and the UFO was seen by my Brazilian wife in the late 80s when she was about 16. Since my English is very basic I prefer to follow the steps listed here in the form to tell the story... 1. Where were you and what were you doing at the time? Outdoor, in front of my house talking with my sisters and a friend of ours 2. What made you first notice the object? I simply looked to the sky above my house and noticed the object 3. What did you think the object was when you first noticed it? I have not been able to give an explanation 4. Describe the object and its actions and motions in detail. the object was a very large and distant disk, apparently solid and bordered by several white lights and with a dome on the top. The object remained stationary for about one hour then simply disappeared 5. Describe your feelings, reactions and actions, during and after sighting the object. I ran into the house to call my parents who came out and watched the UFO without finding an explanation 6. How did you lose sight of the object? after one hour of stationary flight suddenly disappeared"],"Object Features":"Dome","Date of the Event":"06/15/1988 10:30 UTC"}