{"divs":["sighting details17\\10\\2012 - 9.30pm driving home from dog training with my cousin we saw a bright white spherical object that appeared to be quite large hovering in the sky, near\\over the army barracks in chilwell, nottingham. we pulled over and took photographs of the object which just remained still and in the same place in the sky for the duration of the sighting. it didn't flash or pulse, it was just a big light. quite eerie. a helicopter came from the north east at approximately the same altitude as the ufo and flew directly towards the object, as if to investigate what it was. the ball of light was about 3 times the size of the white light on the helicopter and they were both about 500 feet, approximately, in the air. as the helicopter approached the ball of light and got within what looked like approximately 200-300 feet away from it, the ball of light just disappeared! it was like somebody had just turned off a light. it was very strange. we did see a large ball of bright red light, that was still and didn't pulse about the size of a tennis ball, that was approximately 100 feet above the ground to the right of the willington turn-off on the a38 dual carriageway in derby, on the way to dog training at 6.50pm. again this ball of bright red light was just hovering and did not move. we observed it whilst driving for approximately 4 minutes. it disappeared when we turned off at the willington junction. it was there and we could see it from the roundabout and it just disappeared! conditions were good and dry."],"Object Shape":"Sphere","trends":["There have been 2 other sightings in Beeston","There were no other sightings in Beeston on or around October 17th 2012"],"Latitude":"52.908622","Log Number":"GB-10192012-0011","Date Submitted":"10/19/2012 12:07 UTC","Source":"MUFON","Object Flight Path":"Stationary","Country":"United Kingdom","map":"<A HREF = \"http://maps.google.com/maps?q=52.908622,+-1.252755(43382)&iwloc=A&hl=en\"> mufon case (43382) map </A>","Viewing Distance":"101-500 Feet","Object Features":"Unknown","Date of the Event":"10/17/2012 09:30 UTC","Region":"","Weather Factors":"Unknown","Longitude":"-1.252755","Summary":"Stationary White Light That Disappeared When Approached By Helicopter","Sighting Duration":"Undisclosed","Disposition":"Unresolved","City":"Beeston","Case Number":"43382","files":["/var/www/straped/mufon/html2text/43382.html.txt","/var/www/straped/mufon/org/43382.html"],"Tags":"City"}