{"Summary":"myself and 2 friends were fishing from the end of lighthouse. observed craft moving east to west very slowly then turned north.","Tags":"City","Date of the Event":"08/20/1997 12:00 UTC","divs":["Sighting Detailsmyself and 2 friends were fishing from watch hill light house point. we had been fishing since early afternoon and stayed well past dark. we first noticed a series of lights in triangle formation moving from east to west into long island sound very slowly. initially we thought it to be a large comercial fishing boat as it apeared to be very far away and just above the water. at this time it was only remarkable because we had been fishing at this particular location dozens of times and never seen anything this large. after watching for several minutes the craft had moved almost directly south of us then changed direction and headed directly towards us (due north). we watched the craft for several minutes more as it moved towards us. at this time it became obvious that something was not right. the closer it came to our location, the higher above the water it appeared until it was obvious that the object wasn't in the water at all but in the air. if this was a boat of any kind it would have run itself aground well before then, as we were standind at the literal base of an operational light house marking a reef close to shore. the craft continued on this heading until it was directly above us at which time all of the lights blinked out and it was gone from sight. this craft never made a sound that any of us heard. and i belive that aside from the three of us there was at least one more witness to the event. a small boat had been on the east side of the point fishing since late afternoon. the boat was less than 100 yards away and in our line of sight through the whole incident. this is absolutly the truth and i would be willing to submit to a polygraph test to prove it!!!"],"Date Submitted":"10/19/2012 01:37 UTC","Source":"MUFON","City":"Westerly","Log Number":"US-10192012-0016","Case Number":"43387","Sighting Duration":"Undisclosed","trends":["There have been 2 other sightings in Westerly","There were no other sightings in Westerly on or around August 20th 1997"],"Latitude":"41.309131","Region":"Rhode Island","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Longitude":"-71.858092","Object Shape":"Triangle","Country":"United States","Object Features":"Unknown","Object Flight Path":"Path with directional change,Path then hovering","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/43387.html.txt","/var/www/straped/mufon/org/43387.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.309131,+-71.858092(43387)&iwloc=A&hl=en\"> mufon case (43387) map </A>","Disposition":"Unresolved"}