{"Weather Factors":"Unknown","Longitude":"-105.142396","Object Shape":"Triangle","trends":["There have been 39 other sightings in Lakewood","There were no other sightings in Lakewood on or around October 13th 2012"],"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/43386.html.txt","/var/www/straped/mufon/org/43386.html"],"Date Submitted":"10/19/2012 01:30 UTC","Sighting Duration":"Undisclosed","divs":["Sighting DetailsTaking a break in the garden at nursing home were I am nurse. Just looking up enjoying cool evening when it came into view. I know it wasn't normal air traffic from DIA. You don't believe it when something like this craft comes into view. I am Very VERY familier with military and general avaition type planes. This was unique ! Flat black. maybe 7 small red lights in random pattern on bottom surface. It's wing span was two to three times the wingspan of the airliners coming over at the same altitude. the effect was like the movie Preditor when the creature came out of the water and it's cloaking wasn't working properly. Not the electrical effect on the surface but just the mottled effect of a melfunctioning pattern matching effect. Was not Stealth Bomber ! Full Triangle. It's motion was smooth, silent and linear. Sighting lasted for maybe less than one minute. I just happened to be looking in the right place at the time. I had to smile to myself as I took it to be \"ours\" and was surprised at the technology involved. Definitly leading edge stuff whoever owned the technology :) Basicaly it appeared to either go into more cloud or the cloaking effect switched back on. I had cell phone in my hand but stood there like a dummy not wanting to look away."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.750064,+-105.142396(43386)&iwloc=A&hl=en\"> mufon case (43386) map </A>","Object Flight Path":"Straight-line path","Case Number":"43386","Tags":"City","Object Features":"Other","Log Number":"US-10192012-0015","Latitude":"39.750064","Summary":"Observed Triangular black craft traveling just under clouds at 2500 broken. Craft was perfect triangle and looked like it was having cloaking trouble. Speed est 200 mph.","Region":"Colorado","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Date of the Event":"10/13/2012 07:30 UTC","Source":"MUFON","City":"Lakewood"}