{"Object Shape":"Sphere","Latitude":"52.910717","files":["/var/www/straped/mufon/html2text/43383.html.txt","/var/www/straped/mufon/org/43383.html"],"Case Number":"43383","Disposition":"Unresolved","Sighting Duration":"Undisclosed","trends":["There have been 2 other sightings in Beeston","There were no other sightings in Beeston on or around September 22nd 2012"],"Region":"","Source":"MUFON","Date of the Event":"09/22/2012 12:00 UTC","Country":"United Kingdom","map":"<A HREF = \"http://maps.google.com/maps?q=52.910717,+-1.26008(43383)&iwloc=A&hl=en\"> mufon case (43383) map </A>","Viewing Distance":"Over One Mile","Object Features":"None","Summary":"Daytime Sighting of 5 Crafts Near Power Station That Landed & Took Off & Met Other UFO's The Day After Sighting That Landed Near Power Station","Longitude":"-1.26008","Log Number":"GB-10192012-0012","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","City":"Beeston","Date Submitted":"10/19/2012 01:04 UTC","divs":["sighting detailsi am submitting a double sighting to you that we had in the east midlands uk, namely toton, nottingham and sawley, long eaton nottingham on 2 consecutive days. pics are bad but i know there is technology for you to zoom in better than my awful iphone can! 22\\09\\12 - approx 6pm. weather cool, smoggy\\cloud. total daylight. after driving from dropping my daughter off at grandparents i headed home to toton, from stapleford in nottingham. as i hit the top of the hill to go in to toton, stapleford lane, i could see 2 very dull grey spherical objects hovering to the left of the cooling towers at radcliffe-on-trent power station! one large and one smaller. the large one seemed to be stationary and the smaller one which was above the larger one was moving very slowly in a straight line, right behind the cooling towers and then hovering in between two of the cooling towers. at this point the large object proceeded to move. they moved in straight lines. i rang my cousin who saw the objects with me the night before and asked me to collect her to go and see if they were still there. it took me approx 6 minutes to fetch her and get back to the position at the top of stapleford lane. both objects were still in view and had continued at the same altitude almost along the flight path in to east midlands airport. they were too low to be aircraft, they were too close to the cooling towers, they were spherical and grey in shape and were able to move slowly and stop in mid-air then continue to move without gaining or loosing altitude. we called over 2 girls walking up the road. the two objects got to a tree line south west of the control tower, (from our positioning), at ema. in front of our eyes another grey sphere just appeared and joined the larger one whilst the smaller flew off to the south and just vanished. the other 2 stopped and hovered above the tree line for a few seconds then descended in to the tree line. seconds later three ascended from the tree line where the two had landed. 1 flew to where the one disappeared and 1 of the others descended back in to the tree line. the other continued to ascend & descend in to the tree line for about 15 mins. another sphere then just materialised from thin air to the left of the cooling towers again, then moving to the tree line. we saw 1 vanish and reappear & amazing, bright white lights dancing about in the tree line. truly amazing!"],"Weather Factors":"Unknown"}