{"Date of the Event":"09/21/2012 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=52.878759,+-1.298019(43391)&iwloc=A&hl=en\"> mufon case (43391) map </A>","Country":"United Kingdom","Case Number":"43391","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been no other sightings in Long Eaton","This sighting has never been favorited."],"Date Submitted":"10/19/2012 03:41 UTC","Disposition":"Unresolved","Latitude":"52.878759","Object Features":"Unknown","Log Number":"GB-10192012-0018","Longitude":"-1.298019","Object Flight Path":"Stationary,Straight-line path,Path then hovering","files":["/var/www/straped/mufon/html2text/43391.html.txt","/var/www/straped/mufon/org/43391.html"],"Object Shape":"Sphere, Star-like, Other","Region":"England","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Summary":"3 Crafts Spotted Near Power Station. Largest Lands While Other 2 Appear To Keep Watch!","divs":["sighting details21\\09\\2012 - weather clear, no cloud, cold. dark. on returning from willington in derbys\\leics? at approx 10pm as we were driving past radcliffe-on-trent power station, (we spotted the objects from the dual carriage way leading up to the castle donnington\\m1\\sawley roundabout and then observed them a little better at sawley. we observed them for approximately 5 miles before we got to sawley), we saw 3 objects. 2 bright white lights both spherical in shape and the main object had 4\\5 round bright white lights connected horizontally. these objects appeared to be hovering around or very close to the cooling towers at the power station. the biggest object was moving slowly and silently and then descended very slowly to about 50-60 feet above the ground. as we were trying to film through bushes, it was hard to be precise but it appeared to land. one of the smaller objets was moving slowly near the cooling tower about 150 feet in the air and the other singular object hovered above the large one. - we were totally captivated! when i was trying to film this amazing event i just felt like i couldn't hold the camera up i just wanted to watch with my eyes, i felt so in awe!! 3 of us saw this event. all deciding it was too strange to be anything what we know of. the objects were too close to the cooling towers to be aircraft. we ruled that out quite quickly as this sighting was under the approach towards east midlands airport. these objects mad no noise at all and moved slowly were able to stop and hover and descend. more to follow on separate sighting submission as witnessed a mass sighting the following day in the same location. videos are bad but i know there is technology for you to zoom in better than my awful iphone can!"],"Tags":"City","City":"Long Eaton","Source":"MUFON"}