{"Tags":"City","Object Shape":"Sphere","Log Number":"CA-10192012-0019","map":"<A HREF = \"http://maps.google.com/maps?q=50.91208,+-114.090906(43392)&iwloc=A&hl=en\"> mufon case (43392) map </A>","Sighting Duration":"Undisclosed","trends":["There have been 76 other sightings in Calgary","There were no other sightings in Calgary on or around October 15th 2012"],"Longitude":"-114.090906","Object Features":"Unknown","divs":["Sighting DetailsIt was dusk... 7:15 pm. I went outside to enjoy the warm evening. My back door and patio face east and we watch a lot of planes and helicopters as their flight paths are visible. I observed an extremely bright light and continued watching for a few minutes expecting it to bank and turn towards the airport. My home is in the deep south of the city, the airport is in the extreme north so we see a lot of airtraffic and are very familiar with what planes and helicopters look like. When it didn't start to change directions or move at all (it just hovered and glowed) I went into the house to get my binoculars. I have powerful star gazing binoculars on a tripod. It was so bright that it hurt my eyes to view through these bincoluars and began to appear fuzzy around the edges. I went back into the house to get a weaker pair of binoculars and when I returned, my best friend and husband were watching also. As I looked through the 2nd pair of binoculars it began moving very slowly in a northward direction and then completely changed colours to an orange or very bright yellowy red. Just as we were all remarking about how bizarre it was, it vanished! It did not make a sound which added to my curiousity because we can hear airplanes and helicopters from our vantage point. Our home is on the top of a hill so our view is pretty wide-ranging and sound travels without obstruction. I was changing binoculars back and forth looking to see if it had moved and couldn't find it anywhere. There were very few clouds in the sky. It was not dark out yet. I am absolutely sure of what I saw... sure of the date and time... and am very familiar with what normal air traffic looks like. I have scoured the internet this week trying to see if anyone else reported this but to no avail. I did not video it because to me, it would just be another glowing, hovering light in the sky proving nothing."],"City":"Calgary","Viewing Distance":"501 Feet - 1 Mile","Summary":"Observed extremely bright hovering orb which then moved slowly and changed colours... then vanished.","Region":"Alberta","Latitude":"50.91208","files":["/var/www/straped/mufon/html2text/43392.html.txt","/var/www/straped/mufon/org/43392.html"],"Country":"Canada","Date of the Event":"10/15/2012 07:15 UTC","Object Flight Path":"Straight-line path,Path then hovering","Disposition":"Unresolved","Date Submitted":"10/19/2012 03:45 UTC","Case Number":"43392","Weather Factors":"Unknown","Source":"MUFON"}