{"Region":"Texas","Case Number":"43393","Tags":"City","Source":"MUFON","Sighting Duration":"Undisclosed","Country":"United States","Disposition":"Unresolved","Date Submitted":"10/19/2012 04:29 UTC","Object Features":"Unknown","Viewing Distance":"Over One Mile","Log Number":"US-10192012-0020","Latitude":"29.89099","trends":["There have been 4 other sightings in Port Arthur","There were no other sightings in Port Arthur on or around October 18th 2012"],"Object Shape":"Boomerang, Bullet, Missile, Cone, Circle, Egg, Oval, Triangle","Summary":"Shape Changing Object","Weather Factors":"Unknown","Date of the Event":"10/18/2012 09:00 UTC","Longitude":"-93.937537","Object Flight Path":"Unknown","divs":["Sighting DetailsI was outside at work in the same area where 2 months prior I had seen a UFO in the sky. I was between Office Depot and Wal-mart taking a break around 9:00 p.m. when in the corner of my I noticed something in the sky. I looked over to my left in the distance and noticed an object in the sky which immediately dissipated. I thought at first I was seeing things. Then it reappeared, this time much brighter and bigger. It was in the shape of a crescent or something similar and then it got smaller and disappeared once again. Then it reappeared and it was a cone shape almost, skinny and strange looking. Now the thing is it had the same glow as the moon so I looked around the rest of the sky and didn't see any stars so I assumed the clouds were moving over the moon, however when a cloud covers the moon it doesn't do it in straight lines! I watched it for a few minutes and it continued changing into different shapes. I pulled out my cell phone to take a picture of it but unfortunately my battery had run out which it always does. Unfortunately I had to go back into work, but the strangest thing happened when I got home. I turned on my computer and checked facebook when a friend of mine in California had posted he had seen a UFO, then others started replying from across the country. One from Mississippi said that he and a few others had seen something as well, then one in Louisiana in a town that isn't too far from where I live. Eventually my friend in California told me what he had seen and it sounded almost exactly what I had seen! I told him to report it to MUFON and I hope he has and if not I'll ask him again. Something is happening in the skies lately and I have been seeing strange objects for months now."],"map":"<A HREF = \"http://maps.google.com/maps?q=29.89099,+-93.937537(43393)&iwloc=A&hl=en\"> mufon case (43393) map </A>","files":["/var/www/straped/mufon/html2text/43393.html.txt","/var/www/straped/mufon/org/43393.html"],"City":"Port Arthur"}