{"divs":["Sighting DetailsI was driving down I-485 on the outer loop heading toward I-77, about to take exit 67 to get off on Arrowood road, where I observed and object in the sky. Just ahead of me my attention was drawn to the object becouse I had seen a commerical airplane heading south right over exit 67, thats when I noticed this object to the right of the plane. it seemed to be just hovering in one spot but was vibrating and made small jerky movements to each side.It seemed like it was refecting sunlight but was too intense for the amount that was giving off. The object looked like it was fading in and out of sight, it hade kind of a haze around it that i could only compare to a very hot day in the desert and a mirage was coming off the street. The color was silverish chrome looking it was hard to make out a shape of the object because of the haze around it but looked to be like a dics shape with small domes. It finally faded out of sight like it was blinking on and off. then I could not see it anymore but just when i had thought that it was gone it appeared again just below and to the right of where it originally was and then like a light switch it was gone. At this time I was make my turn and curving to the left to get onto arrowood rd. I looked behind me and in my mirrors to see if I could see it but could not see it anymore. The time it took for all of this to happen was about 25 seconds. My feelings about this episode was that i was very surprised but shocking calm about the hole thing. for one it happened in broad daylight 11:30am would be closest to the exact time. I was in the military for 13 years and seen every aircraft out their but never seen anything like this."],"Source":"MUFON","trends":["There have been 68 other sightings in charlotte","There were no other sightings in charlotte on or around October 16th 2012"],"Latitude":"37.732422","Date Submitted":"10/19/2012 10:39 UTC","Tags":"City","Country":"United States","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Object Flight Path":"Path then hovering","Log Number":"US-10192012-0025","Disposition":"Unresolved","Object Features":"Dome","Region":"North Carolina","Case Number":"43398","map":"<A HREF = \"http://maps.google.com/maps?q=37.732422,+-81.203025(43398)&iwloc=A&hl=en\"> mufon case (43398) map </A>","Date of the Event":"10/16/2012 11:30 UTC","Summary":"Silver reflective ufo viewed over I-485 / I-77","files":["/var/www/straped/mufon/html2text/43398.html.txt","/var/www/straped/mufon/org/43398.html"],"City":"charlotte","Object Shape":"Disc","Longitude":"-81.203025","Weather Factors":"Unknown"}