{"Source":"MUFON","Region":"Illinois","Weather Factors":"Unknown","trends":["There have been 21 other sightings in Springfield","There were no other sightings in Springfield on or around October 19th 2012"],"Country":"United States","Longitude":"-89.643738","City":"Springfield","Date Submitted":"10/19/2012 02:54 UTC","Object Features":"None, Unknown","Sighting Duration":"Undisclosed","Tags":"City","divs":["Sighting DetailsIt was 0405 in the AM of 12 Oct 2012. I was in bed but had not fallen asleep yet this I am 100% positive. I was doing routine matinence on my PC when I heard what at first sounded like a car coming down the street from far away. The sound began to increase to a more high pitched hum. I am prior military and am familiar with most aircrafts we have in our military...this sounded nothing like any aircraft I had ever heard. It seemed to come from the West going SE at perhaps 30-40 mph. I never aw the craft however it produce a wind of about 50 mph that cause the house to make cracking noises and blew the blinds in as if it was a hurricane type wind. My dog was laying on the bed and she immediately went under it...SHE HAS NEVER DONE THAT IN HER LIFE. I tried to look out as it passed directly over my house but I seen nothing. I could hear the craft as it got further away and finally out of ear shot...The whole thing start to finish was less than one minute. I called the local police station this afternoon (10-19-12) and asked if there was any other reports. I was told no but if it happened again to call them...ummm ok. That is all I can report. I have never filed a report before and am of sound mind."],"files":["/var/www/straped/mufon/html2text/43390.html.txt","/var/www/straped/mufon/org/43390.html"],"Case Number":"43390","Object Flight Path":"Straight-line path","Object Shape":"Unknown","Summary":"Heard noise strong wind forced blinds in","Disposition":"Unresolved","Date of the Event":"10/19/2012 04:05 UTC","Log Number":"US-10192012-0019","Viewing Distance":"20 Feet or Less","map":"<A HREF = \"http://maps.google.com/maps?q=39.787651,+-89.643738(43390)&iwloc=A&hl=en\"> mufon case (43390) map </A>","Latitude":"39.787651"}