{"Case Number":"43407","Disposition":"Unresolved","trends":["There have been 173 other sightings in Tucson","There were 2 other sightings in Tucson on or around October 19th 2012"],"Longitude":"-110.983859","Tags":"City","Latitude":"32.279775","Date of the Event":"10/19/2012 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.279775,+-110.983859(43407)&iwloc=A&hl=en\"> mufon case (43407) map </A>","Date Submitted":"10/20/2012 12:19 UTC","Source":"MUFON","Viewing Distance":"Unknown","Object Shape":"Unknown","Sighting Duration":"00:01:00","Object Flight Path":"Straight-line path","Region":"Arizona","City":"Tucson","Weather Factors":"Unknown","Log Number":"US-10202012-0007","files":["/var/www/straped/mufon/html2text/43407.html.txt","/var/www/straped/mufon/org/43407.html"],"Summary":"Invisible craft flew overhead heading south with a loud roaring sound","Country":"United States","Object Features":"Unknown","divs":["sighting detailsi was sitting in the backyard by the pool watching a movie on my laptop under an umbrella table and enjoying the weather. i live directly underneath the flight path for davis monthan afb and see and hear a-!0 warthogs flying over all day long as this is one of the main training facilities for this particular aircraft. suddenly i heard what sounded like an enormous jet with numerous afterburners coming out of the north and heading to the south on the airbase flight path, but the sound was deafening and unlike any jet sound that i have ever experienced. the sky was clear and i had seen numerous flights during my time outside, but when i looked up this time the sky was empty - i did not see any aircraft at all ! i looked and looked but could see nothing at all despite the fact that i could hear the jet roaring and it was obvious that it was heading on the regular afb flightpath directly overhead. i started to freak out because this is the 3rd time this year that this has happened. my eyesight is 20\\20 and the fact that i could not see the aircraft really shook me up because this unseen craft sounded like it was very close to the ground, well below the established 'normal' flightpath for any aircraft flying over the city. i am reporting this because case number 43390 also reported the same thing so i know that this has been witnessed by others. i can only speculate that it is one of our aircraft flying with a cloaking capability that i know to exist in our government and has for several decades now."]}