{"Case Number":"43408","Date Submitted":"10/20/2012 01:02 UTC","Disposition":"Unresolved","Object Flight Path":"Hovering then path,Straight-line path","trends":["There have been 16 other sightings in Edmond","There was one other sighting in Edmond on or around October 19th 2012"],"Date of the Event":"10/19/2012 09:20 UTC","Longitude":"-97.496261","Source":"MUFON","Latitude":"35.711067","Summary":"bright fire like light shaped like an hourglass with red center","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.711067,+-97.496261(43408)&iwloc=A&hl=en\"> mufon case (43408) map </A>","Object Features":"None","Tags":"City","divs":["Sighting Detailsi was driving north in edmond, oklahoma and saw 3 orange lights in the sky in the shape of a triangle straight in front of me a ways down the road, i drove about another mile and became fairly close to them and realized there was 4 of them. They were very bright and glaring like the color of fire and shaped somewhat like an hourglass with a bright red band in the middle. They were drifting northeast kind of slowly so i pulled over and got out of my car and stood there and watched them. As i was standing there another car with a man and a lady pulled up and got out of their car to watch them as well. The man and woman asked if i had seen the lights a few minutes earlier; i said i had not. The man and woman told me they noticed 8 of them a little while earlier and the lights were formed to make the shape of the big dipper. As we stood there to watch the lights they continued to drift northeast and up into the sky following one another not closely but not spread out too far apart and they all took the same path. One by one they got higher until they were out of sight. They made no noise and there was no wind that night."],"Object Shape":"Other","Viewing Distance":"Unknown","Region":"Oklahoma","Weather Factors":"Unknown","Log Number":"US-10202012-0008","City":"Edmond","Country":"United States","files":["/var/www/straped/mufon/html2text/43408.html.txt","/var/www/straped/mufon/org/43408.html"]}