{"Object Flight Path":"Hovering then path","Source":"MUFON","Summary":"Thursday, October 18, 2012 approximately 2:12 p.m. Arizona time I observed, while looking through a pair of Canon binoculars, an off-white disk-shaped object in the northern sky over the Santa Catalina Mountains in Tucson for about 6 minutes.","map":"<A HREF = \"http://maps.google.com/maps?q=32.224813,+-110.924789(43400)&iwloc=A&hl=en\"> mufon case (43400) map </A>","divs":["Sighting DetailsThursday, October 18, 2012 approximately 2:12 p.m. Arizona time I observed, while looking through a pair of Canon binoculars, an off-white disk-shaped object in the northern sky over the Santa Catalina Mountains in Tucson. It did not move from the location but banked several times while holding its position. I watched this object for approximately 6 minutes and when I turned to look for someone else to show the object to, it was gone. Friday, October 12, 2012 at approximately 4:11 p.m. Arizona time I observed an object, again in the northern sky over the Santa Catalina Mountains of Tucson. Looking at it with only the naked eye, I could only tell the object appeared round in shape and did not move from the location for approximately 3-4 minutes. It disappeared for a about 2 minutes, then reappeared further north next to a wispy cloud for about 3 minutes or so then disappeared."],"Object Shape":"Disc","trends":["There have been 173 other sightings in Tucson","There was one other sighting in Tucson on or around October 18th 2012"],"Date Submitted":"10/20/2012 12:24 UTC","Object Features":"None","Weather Factors":"Unknown","Case Number":"43400","Tags":"City","Disposition":"Unresolved","Latitude":"32.224813","files":["/var/www/straped/mufon/html2text/43400.html.txt","/var/www/straped/mufon/org/43400.html"],"Longitude":"-110.924789","Region":"Arizona","Country":"United States","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Date of the Event":"10/18/2012 02:12 UTC","Log Number":"US-10202012-0001","City":"Tucson"}