{"Sighting Duration":"Undisclosed","Date Submitted":"10/20/2012 06:49 UTC","Case Number":"43414","Tags":"City","Object Features":"Other","Source":"MUFON","files":["/var/www/straped/mufon/html2text/43414.html.txt","/var/www/straped/mufon/org/43414.html"],"trends":["There have been 3 other sightings in Nederland","There were no other sightings in Nederland on or around May 5th 2000"],"Latitude":"29.981232","Region":"Texas","City":"Nederland","Disposition":"Unresolved","Summary":"Passed right over me. No noise. Area inside ring of lights blacker than black","Weather Factors":"Unknown","Date of the Event":"05/05/2000 03:57 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=29.981232,+-94.027411(43414)&iwloc=A&hl=en\"> mufon case (43414) map </A>","divs":["Sighting DetailsI was sitting in an auxillay (F pickett) guntower at The M.W. Stiles Unit. I poured a cup from my thermos, and stepped outside on the run. I looked around, then looked up, and there it was. Bigger'n crap. 100yds across ? Passed over me SE to NW. No more than 300 feet off the ground. Beautiful clear sky. This means it went right by the Jeff Co. Airport. And it was in no hurry. The lights blinked off and on at random. The light were on the outer rim of the craft. It made absolutely no noise as it passed over. It did not rotate as it passed, either. I do remember a train was passing about 200 yards away, and it seemed the horn and engine noise from the train (and most other noise) seems to get dim on my right, and then on my left, as the craft passed over. It just slid on outs sight. Like when someone throws the balance in the speakers from left to right. After it had passed, sound became normal again. I looked in the papers, the local TV, radio programs, etc. Nothing reported. I started looking at all the pics on the internet, watching History Channel documentaries, etc. Never did any pic come close until now. It looks exactly like the one submitted by MUFON Case #28030. Thats why I am speaking out now. After 12 years, I feel much better. Somebody should tell that person they ain't crazy. I saw one of what they saw. I asked the Roving if he had seenanything when he passed by in a few minutes. He looked at me like a scarred rabbit and said no. I started yelling at him and jumping up and down on the catwalk, asking him how could he NOT see the gi-freaking-normous UFO that just drifted by ? He got madder, and finally drove off. The guy in C picket just smiled like hell, and said he was not admitting anything. I am retired Military, and I have NEVER seen stuff like that. That crap was NOT ours. I have a sketch i made at the time, but it looks like crap."],"Log Number":"US-10202012-0014","Country":"United States","Object Flight Path":"Straight-line path","Longitude":"-94.027411","Object Shape":"Circle, Disc","Viewing Distance":"21-100 Feet"}