{"Object Shape":"Circle","Tags":"City","Latitude":"42.771163","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Source":"MUFON","Object Flight Path":"Hovering then path","Longitude":"-84.445238","Region":"Michigan","City":"East Lansing","Summary":"Plane flew by a light in the sky, one of the objects shined a light at the other (Couldn't tell from which direction) and kept going","files":["/var/www/straped/mufon/html2text/43418.html.txt","/var/www/straped/mufon/org/43418.html"],"divs":["Sighting DetailsI was walking my dog, I have seen a lot of weird things when I walk my dog but I just can't pick it up because my iPhone won't pick up something so faint. I saw an orb just floating in the air, and I was watching a plane fly towards it. I the next thing I know there is a large light on one of the objects, like I said I couldn't tell which object was shining the light. For some reason the plane stayed in the same spot longer, but it didn't stop. It looked like it slowed down, but it didn't at the same time. It's very hard to explain, it's like the plane was flying through peanut butter or mud, like it had drag. After the light shined for a few seconds the UFO just started to fly north, it was slower than the plane so at first I just assumed it was a helicopter but it was extremely high up, and I could be wrong but I don't think planes and helicopters can fly at the same height. They both just went on with their path, the plane heading West while the UFO went North. It made me sweat, and say outloud, \"What the F***\". I have seen other things too, I will just throw this in because it could be a plane: This one happened a few nights ago, the UFO was glowing from faint green to VERY bright white. It was fading in and out between those colors with about 5 seconds in between, when it went to green it almost disappeared. I watched it do it a few times, then it really did just go away (the light) and reappeared further away, the object was moving at about plane speed but when the light turned off and it reappeared it was made further distance than it was making earlier."],"Viewing Distance":"Unknown","Log Number":"US-10202012-0016","Date of the Event":"10/08/2012 12:00 UTC","Case Number":"43418","trends":["There have been 8 other sightings in East Lansing","There was one other sighting in East Lansing on or around October 8th 2012"],"Date Submitted":"10/20/2012 09:32 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.771163,+-84.445238(43418)&iwloc=A&hl=en\"> mufon case (43418) map </A>","Disposition":"Unresolved","Object Features":"Unknown","Country":"United States"}