{"Latitude":"34.314633","Object Features":"Other","trends":["There have been 5 other sightings in Payson","There were no other sightings in Payson on or around December 31st 2011"],"Viewing Distance":"21-100 Feet","files":["/var/www/straped/mufon/html2text/43413.html.txt","/var/www/straped/mufon/org/43413.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.314633,+-111.019125(43413)&iwloc=A&hl=en\"> mufon case (43413) map </A>","Summary":"Saw glowing, lozenge-shaped object with several additional bright, round lights on either end","Log Number":"US-10202012-0013","Region":"Arizona","City":"Payson","Case Number":"43413","Sighting Duration":"Undisclosed","Tags":"City","divs":["Sighting DetailsI live on the East Verde River 12 miles from Payson, AZ. On New year's Eve, 2011, I was at a gathering at our next door neighbor's house. I was sitting with my back to a wall of windows that looked out over the river; the river was not visible from the house, as it is about 15 ft. below house level. My neighbor was sitting on the other side of the room, and had a view out the window. He suddenly cried out, \"Oh, s***\" and jumped up. I turned around to look out the window. I saw a bar of bright, white light that was hovering over the river, about 30 ft. from the house, below the roof level of the house across the river. It also had approimately 5 very bright, round lights at the left end (which I would call the front end, considering the direction in which it ultimately moved), and a lesser number of the same type of lights at the rear. I heard no sound whatsoever,and viewed the object for maybe 10 seconds, during which it remained stationary. My first thought was that it was a helicopter, but I very quickly realized that the object was silent, and had no obvious effect on objects around it (it did not reflect light off the ground, trees, etc). The neighbor who first witnessed it had run outside, and states he saw it \"take off up the river\", which would have been in an approximately northern direction, still below treetop height.I ran outside also, but it was gone, so I didn't observe it \"take off\". My neighbor told me that his first thought upon seeing it was that it was a small plane about to crash. The strange thing was that after the occurrence, after we went back inside, we didn't tell everyone that we had \"seen a UFO\"; we felt very calm afterwards, I had a sense of well-being about the sighting. There were 2 more witnesses; my neighbor's sister, who was also inside the house, and the next morning my neighbor across the road, who was on the top floor of her house at the time, asked me if I had seen the \"streak of light\" move up the river the night before. Interesting to note: Our location is about 70 miles northeast of Phoenix, and the Phoenix local news on January 1, mentioned that people had reported seeing unusual lights in the sky the night before, and showed some photos of greenish looking balls and streaks of light in the skies over Phoenix. Of course, they were dismissed as \"meteors\". We do have quite a few meteor sightings in the Phoenix area, it seems. The East Verde River at our location is not very wide, maybe 20-30 feet across."],"Date Submitted":"10/20/2012 06:30 UTC","Country":"United States","Disposition":"Unresolved","Longitude":"-111.019125","Object Shape":"Other","Weather Factors":"Unknown","Source":"MUFON","Date of the Event":"12/31/2011 09:00 UTC","Object Flight Path":"Hovering then path"}