{"Object Features":"None","Longitude":"-86.128993","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was in route to Galveston from Kokomo with my brother when I seen what I thought to be a falling star. The star was so bright and moving so fast in a downward diagnal fall. When I noticed this I told my brother to check out the falling star. By the time that he could look over the windshield the object went up into space and was gone in seconds. When this object did this it was going so quickly that it left tracer like tail and it was overwhelming at how big the tail was in a big upward loop. Seeing this tail gave me a much more idea at how big the sky really is. Then I was speechless because I had never in my life seen such a thing. Now heres the crazy thing. I have seen this same object a total of three times. The last time I seen it it was as if it was riding along side my car but far away at same speed we were going. The only thing that was different this last time is that it speed up and went on ahead of me and I could tell that there was a bright green light coming from it but It was hard to tell where the light was coming from. It all three times goes straight up into the sky and disappears. Would love to speak to someone about this. May have seperate incident that could be associated with this but may not. Would love to speak with someone on this incident as well because this incident has scared me to death and fear it happening to me again. Thank you. Every time that I've witnessed this object has been early morning hours."],"Date Submitted":"10/21/2012 01:59 UTC","Weather Factors":"Unknown","Log Number":"US-10212012-0006","trends":["There have been 61 other sightings in Kokomo","There were no other sightings in Kokomo on or around April 23rd 2012"],"Object Flight Path":"Path with directional change","Region":"Indiana","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.492327,+-86.128993(43426)&iwloc=A&hl=en\"> mufon case (43426) map </A>","Summary":"Notice a bright light falling from sky then shot up in to the sky and disappears. Have seen this object 3 times and I tell you it's not from here.","City":"Kokomo","Country":"United States","Viewing Distance":"Unknown","Tags":"City","Object Shape":"Triangle","Date of the Event":"04/23/2012 03:01 UTC","Disposition":"Unresolved","Latitude":"40.492327","files":["/var/www/straped/mufon/html2text/43426.html.txt","/var/www/straped/mufon/org/43426.html"],"Case Number":"43426"}