{"Region":"Massachusetts","Log Number":"US-10212012-0005","map":"<A HREF = \"http://maps.google.com/maps?q=42.191645,+-73.374079(43425)&iwloc=A&hl=en\"> mufon case (43425) map </A>","Object Flight Path":"Straight-line path","Summary":"Saw twin,right next to each other,light trails,that appeared to be from a silent ,fast moving ufo","Source":"MUFON","Latitude":"42.191645","Tags":"City","City":"Great Barrington","files":["/var/www/straped/mufon/html2text/43425.html.txt","/var/www/straped/mufon/org/43425.html"],"divs":["Sighting DetailsI was walking our two dogs, by myself at 10pm on October 20th, in great Barington MA.,while visiting at the girlfriends parents home in the country.I stay very aware of my surrounding at night being out in the country and not wanting to have my dogs run into any wildlife that might not be completely friendly.We were walking back to the house,up the front lawn,its a large front lawn and a pretty much wide open space,and slopes uphill.I was looking uphill and from my right I saw a light, at first it registered as maybe a firefly,or shooting star,that's what went through my head in the first instant my eye caught the movement of light in the sky,but then just as quickly, I knew it was not. This was two lines of light,side by side, red,glowing and moving very fast from right to left,tilting or heading slightly \"downhill\",of horizontal.They did not appear to be very high. It was a starry night and it just didn't seem even half as high as the local small planes fly. Ok, back to the two lights, they also seemed like exhaust ,or rear ports of energy, and because they were moving fast left a \"trail\" of their light a couple inches long,from my perspective that is.Also the weirdest thing was, it was silent,you always hear people say,or read that they said, how things made no noise,but, until it happens to you ,you don't know how disconcerting that is, this thing was obviously moving very f'ing fast and was leaving a glowing light in its wake from what seemed like two rear ports, wich was the only thing I saw,whatever was in front of the twin red lines of gloweyness trailing across the sky was invisible,or dark or just not lit up , so was not visible.But seeing this light streek across the sky that fast and low was a new experience. Seeing something not normal, not a regular aircraft,or shooting star, or meteorite was thrilling.Wait, I just thought of something, could this have been a drone?Flying low,unlit,stealthy,except for exhaust ports? Maybe something with twin jets,(do drones have twin jets?)could have moved that fast across the sky.Well it's still a unidentified flying object.and it was heading towards our local,small aircraft type,airport.I still thought it was different and weird enough to write in to you about.Thank you."],"Disposition":"Unresolved","Weather Factors":"Unknown","Country":"United States","trends":["There have been no other sightings in Great Barrington","This sighting has never been favorited."],"Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","Case Number":"43425","Object Shape":"Unknown","Date Submitted":"10/21/2012 01:59 UTC","Longitude":"-73.374079","Sighting Duration":"Undisclosed","Date of the Event":"10/20/2012 10:15 UTC"}