{"Log Number":"US-10212012-0004","Sighting Duration":"Undisclosed","Viewing Distance":"20 Feet or Less","Object Flight Path":"Straight-line path","Region":"Indiana","Date Submitted":"10/21/2012 12:53 UTC","Tags":"City","Latitude":"39.556322","Case Number":"43423","Summary":"9 bright starlike objects floating across the sky","divs":["Sighting DetailsMy husband and I were on our porch talking and suddenly I saw a white starlike thing in the sky above our house. I pointed it out and then immediately seen another one behind it. He called out to his grandmother who was there at the time and she then saw it. As we kept watching them float past our house (it was really high up so at first it looked like a star, a moving one) we saw a couple more seconds later. I saw that my neighbor was out on his porch so my husband called him out to look at what we were seeing. We counted 9 total that were slowly moving. We looked around and saw no airplanes in sight nor did they resemble baloons because of how bright they were. My neighbors wife came out with binoculars and she said she saw more than 9. They were moving at a slow pace but shortly after we saw the first one we saw them head south and we couldnt view them any longer. This is absolutely the first ufo we ever saw or whatever it was. It really challenged my thinking because we knew these weren't something thats normal but yet didn't resemble the typical saucer-like ufo. So the 5 of us talked about it and called the local police station to report it. I looked online and saw similar objects as the ones we saw but in comparison what we saw seems to be floating in one direction not bunched up together but fairly close to one another. They weren't moving in any pattern or left to right either. I hope some others report this as well."],"Disposition":"Unresolved","Object Shape":"Star-like","Longitude":"-85.164746","files":["/var/www/straped/mufon/html2text/43423.html.txt","/var/www/straped/mufon/org/43423.html"],"Object Features":"Unknown","City":"Connersville","Date of the Event":"10/04/2012 08:05 UTC","Weather Factors":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.556322,+-85.164746(43423)&iwloc=A&hl=en\"> mufon case (43423) map </A>","Source":"MUFON","trends":["There have been 11 other sightings in Connersville","There were no other sightings in Connersville on or around October 4th 2012"]}