{"Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/43436.html.txt","/var/www/straped/mufon/org/43436.html"],"Object Shape":"Boomerang, Chevron","Latitude":"27.144217","divs":["Sighting DetailsI was laying in a lawn chair looking straight up into the sky (Head SW-feet NE) from 3:45 AM until 6:30 to watch meteor shower. About 4:30 AM I saw a slight glow appear above and slightly NW...I thought it was a wispy cloud, knew not a meteor - very clear sky - then as it was almost directly overhead it took an obvious clear shape like an outline - no doubt about the outline - between chevron and boomerang in shape- I watch sea birds pass overhead during all hours, it was not a bird, but was approximately the size a large water bird would be if flying at normal height, but this was much higher. It appeared transparent with a slight bluish glow, I say transparent because as it passed overhead the outline was exceptionally clear, but the stars seemed to \"wobble\" instead of blacking out like they should have as it flew between them and me. Also when it was directly overhead, you could see 3 very black circles on the underside of each \"wing\".It disappeared from view...literally, the glow \"went out\" just a short distance SE of me. Since it was not a plane, bird, or anything else I a familiar with, it remains unidentified."],"Date of the Event":"10/21/2012 04:30 UTC","Region":"Florida","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=27.144217,+-80.200601(43436)&iwloc=A&hl=en\"> mufon case (43436) map </A>","trends":["There have been no other sightings in Port Salerno","This sighting has never been favorited."],"Longitude":"-80.200601","Disposition":"Unresolved","Case Number":"43436","Sighting Duration":"Undisclosed","Object Features":"Other","Summary":"appeared as a glow - thought a small drifting cloud in clear sky - was definite object","Country":"United States","City":"Port Salerno","Log Number":"US-10212012-0015","Date Submitted":"10/21/2012 05:49 UTC"}