{"City":"Lakeville","Tags":"City","Object Features":"Wings","Region":"Minnesota","Source":"MUFON","Object Shape":"Boomerang, Triangle","trends":["There have been 5 other sightings in Lakeville","There were no other sightings in Lakeville on or around October 1st 2000"],"Longitude":"-93.215551","Date of the Event":"10/01/2000 12:00 UTC","Object Flight Path":"Path with directional change,Path then hovering","Weather Factors":"Unknown","divs":["Sighting Details My 18 year-old son and I were on the back deck using our telescope. It was relatively new, and we could see Jupiter and Saturn, as well as the Pleiades, moon and other objects. We were ready to stop to take a smoke break, when I saw a flash in the scope. I looked to the East and there was this craft similar to a boomerang and triangle mix slowly coming towards us. We just stood there and never spoke. I am going to estimate that is came within 40 or 50 feet above our heads and hovered. There were white lights under the wings and they appeared to be flush against the wings. They were not search lights. They did cast some light though. It hovered maybe 3-4 minutes. Then it slowly started going up and towards the SE. It kind of flew backwards. I think it got about 4 or 5 blocks away from us and it went straight up and was gone. This craft made no noise whatsoever. It almost felt like being in a vacuum. We heard nothing. I had never seen a craft like this before...and have not seen one since. But I do find myself looking. I have mixed feelings about what we saw. But after all this time is is still gnawing away at my gut. My son and I were afraid to report this, not wanting to appear to be whackos or something so were kept quiet all these years. In an attempt to relax the hold it kind of had on us,we have discussed it only twice. It is hard to talk about and describe. We told nobody. I will never forget what I saw. I find myself searching the night sky, computer sites and pictures of craft to see if I can find it. When my son and I spoke last we decided that I would make a report, describing what happened. I was not a UFO believer. I am now. I can make a sketch of it if need be. It is like it just happened yesterday. Just let me know. If it was military, please let me know so I can finally put this to rest."],"Case Number":"43438","Disposition":"Unresolved","Viewing Distance":"21-100 Feet","Sighting Duration":"Undisclosed","Date Submitted":"10/21/2012 06:31 UTC","Country":"United States","Log Number":"US-10212012-0017","map":"<A HREF = \"http://maps.google.com/maps?q=44.646242,+-93.215551(43438)&iwloc=A&hl=en\"> mufon case (43438) map </A>","files":["/var/www/straped/mufon/html2text/43438.html.txt","/var/www/straped/mufon/org/43438.html"],"Latitude":"44.646242","Summary":"This flying boomerang shape, white lights flat against the craft. Not search lights 7 lights under the wings. Approached from east& hovered.Silent."}