{"map":"<A HREF = \"http://maps.google.com/maps?q=42.129735,+-85.816914(43431)&iwloc=A&hl=en\"> mufon case (43431) map </A>","Longitude":"-85.816914","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Date Submitted":"10/21/2012 01:40 UTC","Case Number":"43431","trends":["There have been no other sightings in Lawton","This sighting has never been favorited."],"Country":"United States","Tags":"City","Latitude":"42.129735","Source":"MUFON","Object Shape":"Cigar","Log Number":"US-10212012-0010","City":"Lawton","Viewing Distance":"21-100 Feet","Date of the Event":"08/23/2012 04:05 UTC","files":["/var/www/straped/mufon/html2text/43431.html.txt","/var/www/straped/mufon/org/43431.html"],"Object Features":"Other","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Region":"Michigan","Summary":"no sound, no windows, no lights, no id letters, atypical tail, atypical side","divs":["Sighting DetailsEvent 1. Driving west on u ave just off of US 131. August 23 at 4 pm daylight. Observed low flying atypical object at tree line height coming from NW. Thought it might hit trees as it crossed in front of me. Crossed my driving path. Very low. No sound. No windows. Dull metal.Long cigar shape. Blackish gray in color. Tail not like any of our jets-shaped like bottom half of a square. Where there would normally be a wing there may have been a bulge not sure but there was an open square cylindar shape at that location. No air liscense id letters or numbers. Flew very smoothly. No lights. It flew across right in front of my car and continued SE. Shortly after it crossed in front of me I felt a strong wind pushing my car from the side and heard a whistling noise and that was one of our jets flying like a bat out of you know were very very low over my car flying toward the other flying object. When I got home, I tried to make a cup of coffee. The coffee pot would not work at all that day. Next day and ever since it has worked. However, there was no effect on my car's ability to run. Event 2. two weeks prior on my street in front of my home at about 8p.m.: I was driving on my street two houses from my home. I observed a very low flying orange ball. At first I thought it was the light on a plane flying over. I was concerned because it was right at tree line height. I thought it would hit them. I stopped the car engine, rolled down the window...no sound from the object. I strained my eyes to see if I could see any thing attached to the ball of light. I could just make out a line coming off off the ball of light on either side as if to make a triangle. The light dipped lower into the trees traveled a short distance that I could not see it in then I saw it in the trees again and it went a little lower. The trees blocked me from seeing anything else."]}