{"trends":["There have been 7 other sightings in Norwalk","There were no other sightings in Norwalk on or around June 23rd 2011"],"Object Flight Path":"Straight-line path","Viewing Distance":"20 Feet or Less","Weather Factors":"Unknown","Object Shape":"Disc","Object Features":"Dome","Source":"MUFON","Summary":"U.F.O flew silently about 35 feet above my head then disapeared behind unknown building.","Country":"United States","Date of the Event":"06/23/2011 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.119687,+-73.399557(43440)&iwloc=A&hl=en\"> mufon case (43440) map </A>","Latitude":"41.119687","Longitude":"-73.399557","Log Number":"US-10212012-0017","Disposition":"Unresolved","Case Number":"43440","Tags":"City","Date Submitted":"10/21/2012 08:04 UTC","Sighting Duration":"00:00:23","divs":["Sighting DetailsMy father was driving into the entrance of the \"Toys R Us\" toy store to simply buy a gift for my younger brother when I suddenly noticed something fly up from the roof of the store! My first thought was that it was a frisbee but I had read numerous books on U.F.O's and this clearly seemed to be the classic shape of a flying saucer with a short dome on its top!I thought it was too good to be true, but I told my dad to park quickly.As soon as he had, I opened the door and jumped out just in time to see it fly slowly and silently over my head!it was lower than it was when I saw it from the car.Now it was about 25 feet from the ground and it still was descending!It was 23 feet from the ground and I thought it was going to land when it began its ascent.I was running right behind it and pointing excitedly when my older brother exclaimed that he too saw it. My parents and my younger brother never saw it though.I was still following it when a car drove in front of me and cut off my vision. I ran around the car as fast as I could ,but when it got out of my path I only saw it for a fraction of a second before it descended about three feet and disappeared behind a building.I stared at the place where it had flown for a few moments, then turned back to my family and asked if they had seen what I had.To my dismay only my brother had spotted it. I was very excited the rest of our visit and kept looking for anything unusual in the sky but I did not see anything like that for the rest of the day or any time after."],"Region":"Connecticut","files":["/var/www/straped/mufon/html2text/43440.html.txt","/var/www/straped/mufon/org/43440.html"],"City":"Norwalk"}