{"Source":"MUFON","Tags":"City","Log Number":"US-10212012-0024","Latitude":"39.697097","map":"<A HREF = \"http://maps.google.com/maps?q=39.697097,+-74.257543(43447)&iwloc=A&hl=en\"> mufon case (43447) map </A>","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-74.257543","files":["/var/www/straped/mufon/html2text/43447.html.txt","/var/www/straped/mufon/org/43447.html"],"Object Features":"Appendage(s), Wings","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Region":"New Jersey","divs":["Sighting DetailsHey I have a pretty cool video attached that u guys should see! I am a pizza delivery driver and I was on delivery when I came across a weird but noticeably bright blue star over one of the main streets I always drive down. I've never seen this star ever in the night sky before going down this road .. And I've been a delivery driver in this area for 2 years. As I continued down the road, it started to slowly move down closer and closer into my vision. I couldn't really make what definite shape this thing was but it had three horizontal, blue changing to bright green lines, extending from a center redish orange sphere in the middle . The way the lights were displayed around the center light, made it look like it could have been disc shaped. I quickly pulled over to the side of the road to video tape it with my iPhone. Unfortunatly, the video quality isn't very good. it catches the ufo moving and floating along like no plane or helicopter. I wasn't able to attach the full video because the file size is too large to send from my phone. The video will show the ufo hovering for a few moments then start moving around the tree lines behind the street light in the video. After it starts moving it changed to a bright green color and started getting away from me . I tryed to catch up with it and video tape it at the same time in the other half of the video I couldn't send ..but it was moving quickly over the houses towards the other side of town and I lost visual. Hope u guys get back to me asap..it freaked me out quite a bit haha..never seen anything like this before in my neighborhood."],"Case Number":"43447","Date Submitted":"10/21/2012 11:00 UTC","Sighting Duration":"Undisclosed","Object Shape":"Circle, Disc, Oval, Sphere, Square, Rectagular, Star-like, Triangle","Disposition":"Unresolved","trends":["There have been no other sightings in Stafford Township","This sighting has never been favorited."],"Country":"United States","Date of the Event":"10/21/2012 12:00 UTC","Weather Factors":"Unknown","City":"Stafford Township","Summary":"I sent email with video to your director. I was delivering pizza"}