{"Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Object Features":"Unknown","Case Number":"43459","Log Number":"CA-10222012-0008","Date Submitted":"10/22/2012 01:07 UTC","Latitude":"44.372117","Region":"Nova Scotia","trends":["There have been no other sightings in Bridgewater","This sighting has never been favorited."],"City":"Bridgewater","Country":"Canada","Tags":"City","Source":"MUFON","files":["/var/www/straped/mufon/html2text/43459.html.txt","/var/www/straped/mufon/org/43459.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=44.372117,+-64.52088(43459)&iwloc=A&hl=en\"> mufon case (43459) map </A>","Disposition":"Unresolved","Object Flight Path":"Stationary","Object Shape":"Star-like","Weather Factors":"Unknown","Summary":"Stationary, bright, starlke object emiting colored lights.Dissappeared after several hours. Planes in the area but did not disturbe object.","Date of the Event":"10/18/2012 08:30 UTC","divs":["Sighting DetailsMy wife and I were star gazing when on the evening of October 18, 2012, when we both observed a stationary object similar to a very bright star. It was a very clear night with very little cloud cover, so we watched the object for several hours, off and on, until it dissappeared. We were not watching when it vanished. It would flash red, green and amber lights at different times. It stayed stationary for several hours before it vanished. We checked the sky in every direction but we did not see it any more that night. It was in a north easterly direction very far away. We tried a set of binoculars to see if we could see it any better but it was so far away that it didn't help much. There were many planes in the same general area that night but the object didn't move. The next night we saw it again, but it was in the noth west. The object acted as before. Stayed stationary, flashing several lights one at a time radomly, and there were quite a few planes in the general area. After several hours it dissappeared. Two nights after that it was back in the north east direction exactly as it was before."],"Longitude":"-64.52088"}