{"Date of the Event":"05/28/2007 12:00 UTC","Viewing Distance":"21-100 Feet","Region":"Arizona","files":["/var/www/straped/mufon/html2text/43455.html.txt","/var/www/straped/mufon/org/43455.html"],"Summary":"I stepped outside from cabin and looked up to see a bright orb. Ran back inside to get camera and to my surprise, it was still there.","divs":["sighting detailsphoto #1). \"christopher creek dual orbs\" was taken of the full moon after dinner. two orbs were accidently caught on film under the full moon about 8pm. please note that the light in the lower, right is a light pole. photo #2). \"orb over trees\" was taken much later that night. i was sitting on the back porch and decided to stand up, step out from under the awning, stretch and take a look at the stars. when i looked up, there was a bright orb over the trees. i ran back in the cabin we rented, grabbed my camera, ran back out and quickly snapped the pic, to which i stated, \"gotcha!\" note: along the top of the photo is a bright light\\reflection? it is either the flash coming of the cabin overhang, or it was another orb much closer to me (and i did not know it). *please note: i attended your event at the adult center in roswell, new mexico and briefly discussed this with donald r. burleson, ph.d., john m. fegel and the international director from ohio (sorry, his name escapes me). i do have video and digital photos of other events as well..."],"Disposition":"Unresolved","Object Features":"Patterned Surface","Log Number":"US-10222012-0003","Tags":"City","Object Shape":"Circle, Sphere","trends":["There has been one other sighting in Christopher Creek","There was one other sighting in Christopher Creek on or around May 28th 2007"],"Latitude":"34.057668","Object Flight Path":"Stationary","City":"Christopher Creek","Sighting Duration":"Undisclosed","Date Submitted":"10/22/2012 02:19 UTC","Weather Factors":"Unknown","Case Number":"43455","Longitude":"-111.090891","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.057668,+-111.090891(43455)&iwloc=A&hl=en\"> mufon case (43455) map </A>","Country":"United States"}