{"Summary":"Two Moving Star Like Lights That Slowed And Vanished; Apparent Military Planes Afterwards","files":["/var/www/straped/mufon/html2text/43454.html.txt","/var/www/straped/mufon/org/43454.html"],"Object Features":"Unknown","Viewing Distance":"Unknown","Log Number":"US-10222012-0002","Longitude":"-77.0279","Source":"MUFON","Sighting Duration":"00:09:00","map":"<A HREF = \"http://maps.google.com/maps?q=38.899524,+-77.0279(43454)&iwloc=A&hl=en\"> mufon case (43454) map </A>","Date of the Event":"10/20/2012 08:30 UTC","Latitude":"38.899524","Country":"United States","Tags":"City","Disposition":"Unresolved","City":"Washington","Object Flight Path":"Path then hovering","trends":["There have been 54 other sightings in Washington","There were no other sightings in Washington on or around October 20th 2012"],"divs":["Sighting Details1. I was outside smoking a cigarette, looking up at the night sky, to try to see early evening Orionids. 2. There were two objects, roughly half as bright as Jupiter, slowing moving through the sky at about an 85 degree angle. I noticed one first, and then the other one approaching it. They seemed to hover briefly and then they both vanished. They did not join together, they just vanished. 3. I thought the first object was a flaring satellite, because I've seen them before. But I never saw two of them moving almost in tandem. If they were on a sheet of paper, they would have been about an inch apart. 4. The objects moved about five inches (on paper) towards the local zenith and began to fade from view. 5. I was curious about them, because I've never seen two satellites close together. They moved slower than satellites, too. I tried to find information about what satellites would be visible at that time (roughly 8:35PM), but didn't find any. This is does not mean they weren't satellites, but it was odd. I didn't feel fear or anything like that, just curious and puzzled. 6. They faded from view in about three to five seconds. They appeared to be stationary when this happened. 7. Approximately three to five minutes later, one or two loud planes, possibly military, went overhead in roughly the area where the objects were. I say one or two, because one came from the east and went overhead towards the west. It either executed a turn out of sight and came back, or another plane came from the west and flew through the approximate area where I saw the objects. After this was when I tried to find information about satellites. I think the planes may have been military because they sounded different from passenger planes and were at a very high, but unknown altitude, clearly not coming in for a landing at DCA. I have not seen any coverage in local news media."],"Region":"District of Columbia","Object Shape":"Circle, Star-like","Case Number":"43454","Weather Factors":"Unknown","Date Submitted":"10/22/2012 02:03 UTC"}