{"Disposition":"Unresolved","Date Submitted":"10/22/2012 10:07 UTC","Tags":"City","Log Number":"US-10222012-0015","files":["/var/www/straped/mufon/html2text/43468.html.txt","/var/www/straped/mufon/org/43468.html"],"Object Flight Path":"Straight-line path","Object Features":"None","City":"Deer Trail","Source":"MUFON","trends":["There have been 2 other sightings in Deer Trail","There were no other sightings in Deer Trail on or around October 21st 2012"],"Summary":"Read my detailed description..","Sighting Duration":"00:06:00","divs":["Sighting DetailsOctober 21, 2012----Between 9 and 10 pm.. I was standing on my North facing porch smoking a cigarette, this is my routine every evening, As I was looking at the stars, a very fast moving cigar shape(the inner part was a light grey with a bright white outer glow)caught my attention and It moved from south to north, in about 1.5 sec. The first thing I thought was that it could have been a meteor, a strange one.. I have been watching meteors for about a year here and whats consistant with the ones I have seen is that you only see them in short bursts as they burn, along with the arc from entering the atmosphere, All I have seen have slight arcs. The cigar I saw had no arc and was still bright when it went behind a tree across the street. All this happened right after I lit the cig. So I changed position on the porch( I moved 6 feet to my left, lateral movement.. This was about 2 min. later... From the North travelling South at a 45 degree angle came red lights at what seemed the same altitude and speed as the White Cigar.. The red lights looked like there were two balls that intersected and glowing red. Just before the Red lights passed me they just went out.. The time that I saw the Red lights 2 sec. I had more visible space. No trees.. The 45 degree angle I am refering to is that if you put the point of the angle due North as I was looking then the white cigar passed to my right and the Red balls passed to my left..."],"Country":"United States","Latitude":"39.611966","Object Shape":"Cigar, Sphere","Viewing Distance":"Unknown","Longitude":"-104.04396","Case Number":"43468","map":"<A HREF = \"http://maps.google.com/maps?q=39.611966,+-104.04396(43468)&iwloc=A&hl=en\"> mufon case (43468) map </A>","Date of the Event":"10/21/2012 12:00 UTC","Weather Factors":"Unknown","Region":"Colorado"}