{"Viewing Distance":"Unknown","divs":["sighting detailsi was watching the sky looking west over the gulf of mexico from my parking lot here at home. i had been seeing some unusual lights in the sky for more than a few months so my brother and i were headed to the beach for some sky watching. i pointed a light out to my brother and he then pointed to another part of the sky and asked me if that was what i was referring to. when i looked in the direction he pointed to, i immediately noticed a boomerang shaped craft with six lights on what appeared to be the bottom of it. it was moving north\\northeast just above the tree tops. the first thing that came to mind was the phoenix lights sighting in 1997 although this craft did not seem to be as big. as with the craft seen in phoenix, this one was totally 100% silent. when we got to the beach, we observed a red orb\\fireball pulsate in a magnificent magenta color and then just vanish. in addition to that, i saw a silver disc shaped object fall out of the sky into a backyard. the color\\texture of the disc reminded me of a ball of mercury. my brother and i then saw a silver streak run through the sky east of the coastline. what is going on here in naples?"],"Log Number":"US-10222012-0011","City":"Naples","Object Shape":"Boomerang","Latitude":"26.27351","Disposition":"Unresolved","Object Features":"None","Case Number":"43462","Summary":"Black boomerang with six lights on the bottom. Reminded me of the Phoenix lights craft.","Region":"Florida","trends":["There have been 34 other sightings in Naples","There were no other sightings in Naples on or around October 20th 2012"],"Object Flight Path":"Straight-line path","Longitude":"-81.750502","Date Submitted":"10/22/2012 02:37 UTC","Source":"MUFON","Date of the Event":"10/20/2012 12:00 UTC","Country":"United States","Sighting Duration":"Undisclosed","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=26.27351,+-81.750502(43462)&iwloc=A&hl=en\"> mufon case (43462) map </A>","files":["/var/www/straped/mufon/html2text/43462.html.txt","/var/www/straped/mufon/org/43462.html"],"Weather Factors":"Unknown"}