{"divs":["Sighting Detailsmy dad and the rancher (Don) he worked for were out checking the fence and springs (water) and came across the first cow. She was laid on her side missing her eyes,udders, and rectum and had some small holes in her side, around all the injury's it looked like the skin, not hair, was burned. There was no blood outside the carcass. She was in a clear spot in the field and had three dinner plate size dents in the ground like a tri-pod around her, and the grass was yellow in a circle. The horses they were riding wouldn't get close nor would the two cow dogs (the horses and dogs were used to dead animals and normally would have walked right up to it or rolled in it in the dogs case )or other cows. next day. Another cow was found on a friends ranch 4-5 miles north west of the first. My dad didn't see that cow but was told she was in similar condition. day three. Don was out checking on the cows and found the 3rd cow again on her side. With tounge,sex organs, udders, ears, and lower jaw skin missing. no tracks or dents in the ground, and same as the first none of the animals would get near it. All gates into the field have locks and chains on them. We DO NOT have large predators only a few coyotes. there were no other animals or people tracks around these cows. the coyotes, hawks, crows, and magpies wouldn't even get near them for a couple of weeks. These cows were alive and healthy one day and destroyed the next. When this happened it was a huge deal for the town. But now not many people will talk about it. I have detailed info on the first cow because my dad saw it. I don't have as much info on the second two only word of mouth. Also for about a month after this there were rumors of people seeing ufo's."],"trends":["There have been no other sightings in Chilcoot","This sighting has been favorited 2 times."],"Object Shape":"Triangle","Source":"MUFON","Log Number":"US-10222012-0014","map":"<A HREF = \"http://maps.google.com/maps?q=39.797321,+-120.139397(43465)&iwloc=A&hl=en\"> mufon case (43465) map </A>","Object Flight Path":"N/A","Date Submitted":"10/22/2012 07:51 UTC","Object Features":"Unknown","Sighting Duration":"Undisclosed","Disposition":"Unresolved","City":"Chilcoot","Region":"California","Case Number":"43465","Weather Factors":"Unknown","Longitude":"-120.139397","Date of the Event":"05/01/1979 01:30 UTC","Latitude":"39.797321","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","files":["/var/www/straped/mufon/html2text/43465.html.txt","/var/www/straped/mufon/org/43465.html"],"Tags":"City","Summary":"Three cows killed over a 3 night period."}