{"Object Flight Path":"Path with directional change","Region":"South Australia","divs":["Sighting DetailsAt the time of sighting I was driving my van, and first noticed a very bright and blazing blue light that crossed the road I was driving at about 3 kms from me and approx. 100 feet high and about travelling approx. 80kph. I first thought it was a light plane going to attempt an emergency landing. It then suddenly veered to its left and was flying towards me but now over a field adjoining the road and getting lower all the time to the ground. I stopped the car, grabbed my mobile hone and was prepared to dial emergency 000. As it flew past my vehicle I could clearly see its shape, the body of a small aircraft but no wings. The blue light on the front was still blazing brightly but no other lights. When in full view it appeared to turn hazy & it was hard to see whether the color was black or dark grey. It was a full moon which was behind the craft. I was quite relaxed and not nervous during the entire sighting which totaled about 6 minutes. As it passed by (no more than 100 feet from my position) I alighted from my vehicle, went around the back of it and looked to the sky where the object appeared to go. But there was not s sign of a anything in the entire sky. I drove home and told myself it had not happened for 48 hours and got on with my daily routine. After that time I wanted to tell everyone in the world what I saw."],"City":"Gawler East","Sighting Duration":"07:49:00","Viewing Distance":"21-100 Feet","Date Submitted":"10/23/2012 07:47 UTC","trends":["There have been no other sightings in Gawler East","This sighting has never been favorited."],"Tags":"City","Source":"MUFON","Latitude":"-34.624888","Country":"Australia","Date of the Event":"09/26/2012 07:48 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=-34.624888,+138.749827(43474)&iwloc=A&hl=en\"> mufon case (43474) map </A>","files":["/var/www/straped/mufon/html2text/43474.html.txt","/var/www/straped/mufon/org/43474.html"],"Object Features":"None","Weather Factors":"Unknown","Summary":"passed alongside my vehicle about 80kph in straight direction","Disposition":"Unresolved","Longitude":"138.749827","Case Number":"43474","Log Number":"AU-10232012-0005","Object Shape":"Cylinder, Other"}