{"files":["/var/www/straped/mufon/html2text/43478.html.txt","/var/www/straped/mufon/org/43478.html"],"Region":"Minnesota","trends":["There have been 5 other sightings in Brooklyn Park","There were no other sightings in Brooklyn Park on or around August 20th 1997"],"Case Number":"43478","City":"Brooklyn Park","Tags":"City","divs":["Sighting Detailsi was riding home with a friend and we turned off co rd 81 to the east. my friend stoped the car and said look. he pointed at the object. what i saw looked like a big steel ball berring floating about 100 to 125 feet off the ground and about 350 in front of us. we sat their watching it just hang motionless for a couple mins. we were geting excited that we may be wittnessing a ufo. then we heard a hellicopter and then we saw it. im pretty shure it was an apache hellicopter. it moved up to the ufo to about 25 feet from it and it fired at it with a cannon i think. 5 or 6 shots and then it fired a automatic gun at it. it seemed to have no noticable efect. then after maybe 20 seconds the ufo just dissapeared like a soap bubble that popped. the hellicopter turned in our direction momentarily then flew off in the direction it had come from. my friend and i asked each other several times if we realy just saw what happened. my hart was racing and i was very excited. my friend and i left and resumed onto my house. when we got their we told my then fiancee what we saw. ive only ever told her and a few other friends about this."],"Weather Factors":"Unknown","Latitude":"45.08006","map":"<A HREF = \"http://maps.google.com/maps?q=45.08006,+-93.355957(43478)&iwloc=A&hl=en\"> mufon case (43478) map </A>","Log Number":"US-10232012-0009","Disposition":"Unresolved","Object Shape":"Sphere","Viewing Distance":"101-500 Feet","Date Submitted":"10/23/2012 01:14 UTC","Object Flight Path":"Stationary","Object Features":"None","Date of the Event":"08/20/1997 12:00 UTC","Country":"United States","Source":"MUFON","Sighting Duration":"00:05:00","Summary":"ufo hovering millitary hellicopter arived and shot at ufo ufo vanished hellicopter leaves in direction it came","Longitude":"-93.355957"}