{"Viewing Distance":"21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=33.955313,+-84.083415(43486)&iwloc=A&hl=en\"> mufon case (43486) map </A>","trends":["There have been 14 other sightings in Lawrenceville","There were no other sightings in Lawrenceville on or around October 23rd 2012"],"Date Submitted":"10/23/2012 10:47 UTC","Object Shape":"Boomerang","Source":"MUFON","Log Number":"US-10232012-0017","Country":"United States","Object Flight Path":"Path with directional change","Summary":"I saw a flashing red & white light with 2 white lights on the right side slowly moving","files":["/var/www/straped/mufon/html2text/43486.html.txt","/var/www/straped/mufon/org/43486.html"],"Case Number":"43486","Latitude":"33.955313","Date of the Event":"10/23/2012 12:00 UTC","Weather Factors":"Unknown","Longitude":"-84.083415","Sighting Duration":"00:05:00","Tags":"City","City":"Lawrenceville","Disposition":"Unresolved","divs":["Sighting DetailsI was laying down on my bed watching tv, and my bed is right next to my window which blinds were open. I notice a red flashing light outside in the sky, but I first I didn't really pay much attention because there's alot of helicopter & airplane sightings around my area. I then realize the lights are flashing very low & helicopters that usually pass by are far away & in clouds so I knew it couldn't be that nor an airplane. So I open my blinds to see more clearly outside & I see a red flashing light with 2 white glowing lights on the right side the lights looked as if they were around a plate shaped object. I was shocked at what I was seeing so I lay back down & I still see that the lights were moving very slowly. As I saw it moving i heard kind of a vibrating buzzing noise. It wasn't that loud though, it sounded a little distant. While I was seeing the unidentified object about 500ft under the horizon line across the street & I see it move slowly toward my direction & goes behind my house. I couldn't really see the much of the size or shape because it was dark outside."],"Region":"Georgia","Object Features":"Dome, Unknown"}