{"Country":"United States","Viewing Distance":"Over 1 Mile, Unknown","Object Flight Path":"Straight-line path","Source":"MUFON","Case Number":"43487","Weather Factors":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.048467,+-118.21046(43487)&iwloc=A&hl=en\"> mufon case (43487) map </A>","City":"Los Angeles","Log Number":"US-10232012-0018","Disposition":"Unresolved","Longitude":"-118.21046","Date of the Event":"10/23/2012 03:01 UTC","files":["/var/www/straped/mufon/html2text/43487.html.txt","/var/www/straped/mufon/org/43487.html"],"Sighting Duration":"Undisclosed","Latitude":"34.048467","trends":["There have been 404 other sightings in Los Angeles","There was one other sighting in Los Angeles on or around October 23rd 2012"],"divs":["sighting detailstook goldline train into l.a. chinatown to eat. i then walked to los angeles state historic park to rest. i found a hill and laid under the shade of a tree and opened up my book. i put my book down and looked straight up and saw the same white circular disk shaped object i saw and reported on 9\\29\\12 at the same time, around 3pm! no mistake it was the same object, very high up and slowly moving to the northeast just like the last one. however i had 360 degree clearance in the open space of the park so i just sat and studied it. winds were southwesterly. this time it seemed higher and seemed to move slower. for a moment it seemed not to be moving at all. it also seemed to waver side to side a bit and it flashed. i always carry my small camera and i just snapped away zoomed all the way in. i zoomed out and took a few shots with the tree leaves in frame. it had a brilliance to it unlike conventional aircraft at high altitude were they look dull white to grey. this object seemed to have its own light and this time it either flashed or reflected extra light. there was regular air traffic at the time, light craft, commercial jets flying in and out of lax, burbank and santa monica and there were even large military off to the northwest but this thing was way above anything i'm used to seeing in the area. this object also matches other sightings i saw listed in silverlake, koreatown and one that took place in redondo beach i believe. i have one more day off tomorrow so i'm going to look for it again."],"Date Submitted":"10/23/2012 10:48 UTC","Summary":"2nd sighting of bright white disc over Los Angeles, very high up, flashed or reflected light.","Object Features":"Unknown","Region":"California","Object Shape":"Circle, Disc"}