{"Date Submitted":"10/23/2012 11:00 UTC","Object Features":"Wings","trends":[],"Source":"MUFON","Summary":"Dark V shaped flying object with single turquoise light hovers and flies above treeline","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-99.893263","files":["/var/www/straped/mufon/html2text/43488.html.txt","/var/www/straped/mufon/org/43488.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=31.974699,+-99.893263(43488)&iwloc=A&hl=en\"> mufon case (43488) map </A>","Tags":"City","Log Number":"US-10232012-0019","Weather Factors":"Unknown","divs":["Sighting Details1. I was driving with my boyfriend and daughter in Hurst, taking the Trinity Blvd exit. The sighting was in the forested area to the right of the exit, near the Trinity River. 2.I noticed just a bright turquoise light floating in the sky, and no other lights around it. Whatever it was coming off of was very dark. 3.I questioned whether it was a military aircraft or drone. 4. The object hovered very low, too low for any plane..right above some trees. It emitted a single turquoise light that was quite noticeable and unique. The object seemed to hover and slowly fly, but I was driving away and when I looked back I couldn't see it anymore. 5. During the sighting I felt creeped out and worried because I wondered why a military plane would be in Hurst. I mentioned it and my boyfriend saw the exact same thing and had the same questions that I did. I posted a status on Facebook and my cousin informed me there had been similar sightings in DFW this past weekend, so I went online and found this website. I have goosebumps thinking about it and seeing similar sightings online. When I type in the description to Google, most results include the word \"UFO.\" 6. We had to drive away from the object and turn left away from it over a bridge. As soon as we turned it was out of sight."],"Case Number":"43488","Sighting Duration":"Undisclosed","Object Shape":"Boomerang","Object Flight Path":"Hovering then path","Latitude":"31.974699","Country":"United States","Region":"Texas","Disposition":"Unresolved","Date of the Event":"10/23/2012 12:00 UTC","City":"Undisclosed"}