{"Date of the Event":"10/23/2012 12:00 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.25306,+-82.47461(43498)&iwloc=A&hl=en\"> mufon case (43498) map </A>","Log Number":"US-10242012-0008","divs":["Sighting DetailsWas driving down U.S. rt 50 towards McArthur after working on a house we bought. it was close to 8pm. My Boyfriend was in a truck ahead of me. Initially, I didn't pay attention to the lights because I must of thought it was a street lamp (there are no street lamps in the area, but i grew up in cities) or maybe I assumed it was an airplane, I just didn't think to look at it - it was dark so I concentrated on the rd. After a minute maybe, I saw there were two lights, I'm sure there had been all along, but I was now looking at it, trying to rationalize what it was - At first I thought it was an airplane changing direction, then it looked like an airplane flying towards us. I did not see an aircraft or other body, just the lights. As I was trying to figure out the direction (because if it was an airplane it would have to be a jet based on the distance between the lights) the left side dimmed, and one light was left. Then it came back after 2 or 3 seconds and the right side dimmed. I can't remember if both came back on or what, but basically the lights disappeared off to the right (west north west)I assumed they went behind a cloud and I thought it was strange because they didn't reappear. I had slowed down from 55 mph to probably 30 mph or so, there was a car behind me so I didn't want to make them too angry. I just thought it was kind of a weird thing, but didn't think too much of it. I wondered if my boyfriend saw it in the car ahead of me, but thought probably not because he is one of the least observant people i know. Also his truck is in really rough shape and his headlights don't work well, so I assumed he would be watching the rd. When we pulled up to the driveway where we currently live about 10 minutes later, A good song was on the radio, so I turned it up, jumped out of the car and started dancing in the driveway...just to tease him a little. He was exhausted. I forgot about the lights. But as soon as he walked up to me, he said \"did you see the UFO?\" and I was like YES!!!! So the actual event really only lasted a minute or two, with me paying attention to it for less than a minute before it disappeared. We both saw the same thing in two separate vehicles. Initally he said he thought it was the radio tower nearby. I never thought that because of the color and the position. the lights were the color of dim headlights, or low burning embers from a fire. they were larger (and higher in the air) than any headlights would be from a car. the lights were a few inches apart (4 maybe?) in my line of vision but i don't have any good indication of distance or how far the object was away from us. my boyfriend said he was surprised the lights didn't show through the clouds or reappear like airplanes do, because the clouds were really more wispy and transparent than solid clouds. So neither of us really know what we saw. Apparently after doing a web search though when we got home there had been a UFO siting during the day a few counties away in Northern KY (pike county) there was an image taken, but we have no idea if it was the same thing or not. Their siting was during the day and we saw no craft or whatever, just the lights. Also had the radio on, so no idea about noise."],"Region":"Ohio","Summary":"witnessed two yellowish orange balls or lights in the sky drving down rt 50, sometimes one would go dim they disappeared shortly","Tags":"City","Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/43498.html.txt","/var/www/straped/mufon/org/43498.html"],"Longitude":"-82.47461","Case Number":"43498","City":"McArthur","Viewing Distance":"Unknown","Latitude":"39.25306","Weather Factors":"Unknown","Date Submitted":"10/24/2012 10:52 UTC","Object Flight Path":"Stationary,Hovering then path,Other","Object Features":"Unknown","Disposition":"Unresolved","Object Shape":"Fireball, Sphere","trends":["There has been one other sighting in McArthur","There were no other sightings in McArthur on or around October 23rd 2012"]}