{"trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around October 23rd 2012"],"Object Features":"Unknown","divs":["Sighting DetailsWe were prepping a building to be painted. i was looking at the top level of the building when i saw a bright shinny dot in the sky coming from the south headed north. i pointed it out to the 4 other people working with me and we all started watching. it met up with 2 other dots that were standing still. the one that was moving stopped to make a perfect triangle with the other 2. the one on the east side bottom started flashing like crazy. planes flew by during the event and you could tell that whatever they were they were much higher than the planes. then after about 5 minutes of hovering in a triangle with the one flashing, they all took off in different directions real fast passing the plane that had when by a minute before. the one on the west bottom of the triange went west. the one on the bottom east side that was flashing went east. and the one on the top seemed to disappear straight up."],"Viewing Distance":"Over One Mile","Country":"United States","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.835952,+-104.811763(43494)&iwloc=A&hl=en\"> mufon case (43494) map </A>","Longitude":"-104.811763","Summary":"3 of them came together to make a triangle, one of them started flashing alot. then they went in different directions","Latitude":"38.835952","Date of the Event":"10/23/2012 09:35 UTC","Weather Factors":"Unknown","Log Number":"US-10242012-0004","City":"Colorado Springs","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Date Submitted":"10/24/2012 08:26 UTC","files":["/var/www/straped/mufon/html2text/43494.html.txt","/var/www/straped/mufon/org/43494.html"],"Case Number":"43494","Region":"Colorado","Source":"MUFON","Object Shape":"Star-like"}