{"Weather Factors":"Unknown","divs":["Sighting DetailsOn the levee of the Mississippi in New Orleans with another guy taking pictures of the sunrise when we both spot a disc shaped shadow like object fly just above the bridge across the river. We were talking about photography when i spotted an unusual disc shaped object that looked like a shadow (or transparent) moving about twice the speed of a car across the river just above the bridge. It looked like it was going the same direction as the road flying about 2-300 feet above the bridge moving south. It was a shadowy misty disc shaped object that had a definate dark shape and outline against the bright morning sky. There were a few planes way up in the air flying over. The planes had blinking navigation lights. The object we saw just flew quietly over the river and faded away into the distance. The object was following the direction of the bridge south and moving in a definite trajectory and direction. There was the outline and shape of a disc. It looked to be about 200 feet across maybe more. From my view it was about the size of my thumbnail at about 15 degrees above the horizon. It was a definite disc shaped object that looked cloaked. Kinda like what you'd see on TV. We could see the dark shadowy disc moving smoothly through the sky over the river. The sighting lasted about 20 seconds and it was out of sight. This morning we saw several unusual lights flying over. One we thought was a satellite or star like object was moving over the city way up there & actually got brighter for a few seconds as it passed over us, then dimmed and kept going."],"Log Number":"US-10242012-0005","files":["/var/www/straped/mufon/html2text/43495.html.txt","/var/www/straped/mufon/org/43495.html"],"City":"New Orleans","Latitude":"29.959137","Date Submitted":"10/24/2012 08:54 UTC","Object Flight Path":"Straight-line path","Case Number":"43495","map":"<A HREF = \"http://maps.google.com/maps?q=29.959137,+-90.060676(43495)&iwloc=A&hl=en\"> mufon case (43495) map </A>","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"10/24/2012 12:00 UTC","Object Shape":"Disc, Oval","Object Features":"Unknown","Disposition":"Unresolved","Longitude":"-90.060676","trends":["There have been 26 other sightings in New Orleans","There were no other sightings in New Orleans on or around October 24th 2012"],"Region":"Louisiana","Tags":"City","Summary":"Disctintive Disc shaped shadow/ object flew across river above brigde.","Sighting Duration":"Undisclosed","Source":"MUFON"}