{"map":"<A HREF = \"http://maps.google.com/maps?q=40.265965,+-79.377203(43496)&iwloc=A&hl=en\"> mufon case (43496) map </A>","Longitude":"-79.377203","Region":"Pennsylvania","City":"Latrobe","Country":"United States","Sighting Duration":"Undisclosed","Object Features":"Other","Latitude":"40.265965","Weather Factors":"Unknown","Source":"MUFON","Object Shape":"Star-like","Date of the Event":"10/24/2012 06:15 UTC","Object Flight Path":"Hovering then path","Disposition":"Unresolved","Case Number":"43496","trends":["There have been 4 other sightings in Latrobe","There were no other sightings in Latrobe on or around October 24th 2012"],"Viewing Distance":"Over One Mile","Tags":"City","Log Number":"US-10242012-0006","divs":["Sighting DetailsI walked out onto my porch to check the temperature outside. Out of the corner of my eye I saw a bright light. It would have appeared to most as though it was the north star but I knew that it was not. It kept my attention (for some reason) and I could not take my eyes off of it. Although, I wanted to grab my phone to record the event. It was bright white in appearance with a slight red hue to the side of it. It was extremely bright compared to the other stars in the sky. I thought whether it was a plane, helicopter, star, or jet. It was not because it just hovered there. But, as I watched it grew brighter and brighter and was probably close to 10 times brighter than the other stars in the sky. It all of a sudden, began to dim its lights until they were so weak that it was just as bright as the stars around it. Once it got to this illumination it quickly went in a (from where I stood) about a 1 foot circle then stopped almost exactly where it was before. After it stopped where it was before, it began to illuminate very bright again and almost appeared to slowly be moving towards my direction. It then all of a sudden very quickly dimmed its lights and was completely gone from view. I stood there in awe waiting for awhile but it never came back into view. It was in my opinion something strange and unusual."],"Date Submitted":"10/24/2012 09:58 UTC","files":["/var/www/straped/mufon/html2text/43496.html.txt","/var/www/straped/mufon/org/43496.html"],"Summary":"bright light in sky dimmed went in circle brightened then dimmed and disappeared"}