{"Tags":"City","Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile","Latitude":"35.70174","files":["/var/www/straped/mufon/html2text/43490.html.txt","/var/www/straped/mufon/org/43490.html"],"Case Number":"43490","Longitude":"-97.496246","Region":"Oklahoma","Date Submitted":"10/23/2012 11:50 UTC","Object Shape":"Boomerang, Fireball","Summary":"8 Fireballs in sky look like the Big Dipper","Weather Factors":"Unknown","divs":["Sighting DetailsWe were coming home from downtown Edmond on Broadway when my wife and I saw 8 bright orange objects on the horizon towards the Northwest over Deer Creek, OK that looked like the Big Dipper. They were too large for stars and we knew that there are no large antenna towers in that area. We immediately decided to turn down Coffee Creek Avenue to be able to face them while we drove. We pulled off the road and got out of our truck to observe that the objects that we thought were not moving, but indeed were moving together, slowly across the sky. The round objects looked like fireballs that were bigger than a commercial plane but perfectly round. Two of the lead fireballs faded away, as if they just turned off a gas light. Then two more turned off their lights. We could see the remaining fireballs were coming our way, so we got back in our truck and turned right onto N. Kelly Avenue. We went a little ways and saw that the 4 fireballs were now very close and we wanted to try to get a picture of them, so we pulled over at Cross Timbers Elementary school. We noticed a guy was also in the parking lot looking up into the sky, so we went over to talk to him. We told him that we just saw 8 fireballs that looked like the Big Dipper but 4 of them disappeared. All of us watched as the orange fireballs moved directly overhead of where we were. They looked like they were only going 15mph but we figured out that they had crossed 15 miles in 10 minutes to get to us, so they were really doing about 90mph. We estimate that they were about 2,000 feet above us and they made no sound at all. Two more faded quickly out of sight, which left two remaining and I took a picture of one of them with my cell phone. Then those two went straight up in the sky to about 40,000 feet and then their lights went out too. Later, when we zoomed in on the picture from my cell phone, we could see that the orange fireballs were in reality white boomerang shaped objects. It seems the fire they emitted, was merely to get our attention."],"map":"<A HREF = \"http://maps.google.com/maps?q=35.70174,+-97.496246(43490)&iwloc=A&hl=en\"> mufon case (43490) map </A>","Country":"United States","Disposition":"Unresolved","Object Features":"Wings","trends":["There have been 16 other sightings in Edmond","There was one other sighting in Edmond on or around October 19th 2012"],"Source":"MUFON","Date of the Event":"10/19/2012 09:30 UTC","Sighting Duration":"Undisclosed","City":"Edmond","Log Number":"US-10232012-0021"}