{"Object Features":"None","Date of the Event":"10/24/2012 07:30 UTC","Source":"MUFON","Region":"Ohio","Longitude":"-84.04022","map":"<A HREF = \"http://maps.google.com/maps?q=40.439494,+-84.04022(43508)&iwloc=A&hl=en\"> mufon case (43508) map </A>","Disposition":"Unresolved","trends":["There have been no other sightings in Jackson Center","This sighting has been favorited 1 time."],"files":["/var/www/straped/mufon/html2text/43508.html.txt","/var/www/straped/mufon/org/43508.html"],"Latitude":"40.439494","Object Shape":"Fireball, Sphere","divs":["Sighting DetailsI was in church at a prayer meeting. A lady came in and got me to go outside and see something. Her husband had gone outside a few minutes earlier and had come in to get her to see this thing. Then she came to get me. It was approx. 7:30 pm eastern daylight time. The sky was dark and there were at least 2 airplanes visible with flashing lights. I witnessed an orange orb, looked kind of like a fireball traveling in a straight line across the sky from the southern horizon nearly straight north and disappear or fade out when it was about 75% across the sky. It was moving at a steady speed but not real fast. With in a minute of that one disappearing another one came up from the same area and traveled the same path. This was followed by another, that being the third one I witnessed. The gentleman who first saw the orbs had seen 4 of them before I came out, all doing the same thing. That would be a total of 7 that were witnessed. They made no detectable sound and seemed in some ways more of a natural event rather than an intelligent designed thing. It was however strange that 7 witnessed objects all did the same thing in a very ordered pattern. They seemed to not affect anyone or anything. I had no idea what they could be and they left no real impact on me other than scratching my head in wonder. This occured near Ohio state route 274 about 4 miles east of interstate 75 in shelby county Ohio."],"Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Date Submitted":"10/24/2012 11:39 UTC","Summary":"at least 7 orange orbs traveled from southern horizon in a straight projectory","Object Flight Path":"Straight-line path","Log Number":"US-10242012-0018","City":"Jackson Center","Case Number":"43508","Tags":"City","Country":"United States","Weather Factors":"Unknown"}