{"files":["/var/www/straped/mufon/html2text/43503.html.txt","/var/www/straped/mufon/org/43503.html"],"Disposition":"Unresolved","Latitude":"41.666598","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=41.666598,+-71.538454(43503)&iwloc=A&hl=en\"> mufon case (43503) map </A>","trends":["There has been one other sighting in Coventry","There were no other sightings in Coventry on or around December 24th 2011"],"Tags":"City","Longitude":"-71.538454","Summary":"3 armed triangle Aurora Borialis Emissions","divs":["Sighting DetailsComing home from a 2nd shift on Christmas Eve, I used the major highway to go home, heading North, this is when I first observed the object approaching me from a N NE direction perhaps 5 to 10 miles away, I thought that it was odd, because I didn't notice any blinking lights as planes usually have, but because it is a typical flight path it didn't really set off any red flags in my mind, and it was still a ways off. As I moved North NE, it move South SW, and the distance between us closed, and it really appeared odd, still having no blinking lights, and appearing to be of a universal luminosity across the body of the object. I got off the highway, and was now moving in a westerly direction, and the object was still moving in a southerly direction, the distance between us still closing. NOTE: at 11:30pm on Christmas eve, there was virtually almost no cars on the road ways. To continue, as I was off the highway, still observing the object, I knew it was something very strange, and seen that it's flight path would take it right over top of me or at least close enough to make a positive ID, and given it's low altitude, I would be able to finally conclude if this was indeed some sort of aircraft or something else. I pulled over on this major road way (but as mentioned no cars) and got out of my car to watch. The object flew almost directly over me, perhaps 200 to 300 feet off center, of being directly over top of me. My best estimates put the object at maybe 100 feet in diameter, it was triangular in shape, with three arms or extensions from the center mass, making up the whole object, the center mass was very small, as if the whole object was made up of just the three arms. each arm was somewhat slender and appeared to be almost as an elongated diamond shape. The object did not spin or rotate. The exact detail of the object was obscured by the luminosity of light coming from the bottom of the craft. The entire under surface of the craft illuminated or emitted a light unlike anything i've ever seen on earth. The best comparison is the Aurora Borialis lights as I've seen on TV, but it was comprised of golds, oranges, and reds. The lights streamed straight down from the craft as in a 90 degree angle, and not illuminating in spherical lightbulb sense, the lights seemed to change in variance from color to different lengths, as mentioned just like the aurora borialis. The craft traveled at an estimated speed of about 50 to 70 mph, and was approximately 500 to 700 feet above the ground. The sky was very clear that night, and given the distances, speeds, lighting, and size of the craft, there was no possibility for mistaken this for anything other than a UFO, and to my surprise, not anything like any stereo typical UFO. I haven't told many people about this event, maybe two other people, for fear of being ostracized, all I can say this is probably one of, if not the most amazing thing i've ever seen in my life, and thought it should be on the books that it happened."],"Country":"United States","City":"Coventry","Source":"MUFON","Log Number":"US-10242012-0013","Weather Factors":"Unknown","Date Submitted":"10/24/2012 03:17 UTC","Sighting Duration":"Undisclosed","Date of the Event":"12/24/2011 11:30 UTC","Object Shape":"Star-like, Triangle, Other","Region":"Rhode Island","Case Number":"43503","Object Features":"None","Object Flight Path":"Straight-line path"}