{"Country":"United States","Latitude":"44.271783","Sighting Duration":"00:00:03","files":["/var/www/straped/mufon/html2text/43502.html.txt","/var/www/straped/mufon/org/43502.html"],"Tags":"City","Case Number":"43502","Object Features":"None","Date Submitted":"10/24/2012 01:48 UTC","Region":"New Hampshire","Viewing Distance":"N/A","trends":["There have been no other sightings in Lisbon","This sighting has never been favorited."],"Log Number":"US-10242012-0012","Source":"MUFON","Date of the Event":"10/24/2012 11:30 UTC","Longitude":"-71.852187","divs":["Sighting Details I was in bed at the time and was awoken by the light flashes. There was no traffic on our road (no headlights) and no people outside with flash lights or something like that. Multiple bright white flashes were observed in the sky. The first set (possibly 2 or more) were after 11 pm and may have been as late as midnight. I did not check the clock for the time of the first set. The second set of brilliant flashes were observed between 3 and 3:15 am Oct 24. Because of the night conditions (eyes adjusted to dark conditions), the flashes overwhelmed my eyesight for several seconds. It was similar to lightning but no sound and no clouds. I went outside (3:12am) to try to spot the source of the light. I could not find any object to associate with the flashes. Each time the color was a white flash and it filled the whole sky. Sky was perfectly clear. All of the constellations and planets were visible. There was one plane traveling east in the distance (it looked like a commercial flight from its height and direction). I could see two small meteor trails in the distance (east) during the time outside. Did any meteors breakup over the northern NH or southern eastern Canada area? Was this simply leftovers of the meteor showers from the weekend? Or something else? I checked all of the major news outlets on the Internet and did not find anything that might match up with what I saw."],"City":"Lisbon","Object Shape":"Flash","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.271783,+-71.852187(43502)&iwloc=A&hl=en\"> mufon case (43502) map </A>","Summary":"no object seen; but brilliant white flashes observed that filled the sky","Object Flight Path":"N/A","Disposition":"Unresolved"}