{"Object Flight Path":"Path with directional change","Longitude":"-118.035345","Disposition":"Unresolved","Case Number":"43511","Source":"MUFON","Date of the Event":"10/24/2012 12:00 UTC","trends":["There have been no other sightings in Arcadia","This sighting has been favorited 1 time."],"Object Shape":"Saturn-like","files":["/var/www/straped/mufon/html2text/43511.html.txt","/var/www/straped/mufon/org/43511.html"],"City":"Arcadia","Object Features":"Dome","Summary":"10 UFOs Flying in Formation over Arcadia park","divs":["Sighting DetailsWas playing tennis in Arcadia park. While looking up at the sky for a moment, I noticed what I first thought to be a strange flock of birds flying in formation. Then I realized they were not birds. It was 7-10 saucer shaped UFOs flying in what looked like a deliberate formation keeping perfectly equi-distant from one another. They were saucer shaped with a dome at the center. The domes looked oily black and the saucer rim was silver like brushed aluminum or the color of brillo. As they flew they were tipped on a slight angle so the dome was the most visible portion and the saucer rim was only visible in part. They changed flight formation a few times from straight line to zig-zag pattern. The center UFO seemed to be the lead ship to dictate the formation and all other UFOs followed it's cue. It went from non-formation but equidistant to straight line where they seemed to be almost touching edges. From the close together straight line formation they broke into a vertical zig-zag formation. They then returned back to a tight straight line. The center saucer oscillated slightly and dipped down for a moment. As it pulled down it was as though it pulled the others down with it slightly like weight pulls down a trampoline from the center of point of stress. The center UFO then pulled up above the others. As the center ship pulled up, the rest of the UFOs followed and formed a V on either side of it. This all happened in a few short minutes. I got distracted by my tennis partner who mentioned a shot I missed and kept asking what I was looking at. He wasn't looking at the same point. I looked down at him for a moment to say \"Don't you see them?!\" by the time I looked back up, they were all gone. Shortly thereafter there were several Chinook helicopters flying past. Coincidentally President Obama was headed to LAX later that afternoon. Not sure if the helicopters were there as part of the presidential activity or if they were observing the UFOs. I've had another sighting in this same park last summer (2011) of a matte black UFO that hovered above. It morphed and almost looked like a deck of cards shuffling itself as it changed shape. It had rectangular panels - looked mathematical. That sighting was witnessed by another person. We tried to video record it with our phones but the recording devices were not powerful enough to get any good detail."],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.139729,+-118.035345(43511)&iwloc=A&hl=en\"> mufon case (43511) map </A>","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Latitude":"34.139729","Region":"California","Country":"United States","Weather Factors":"Unknown","Log Number":"US-10252012-0002","Date Submitted":"10/25/2012 01:22 UTC"}