{"Object Features":"Unknown","Disposition":"Unresolved","Summary":"We observed a brightly lit object in the SW skys of Kansas. It was moving very slow and low to the ground. It was headed north we were headed south. It passed beside and over us. the front of it was straight across, no nose. No sound.","City":"Sawyer","Source":"MUFON","divs":["Sighting DetailsMy grandchildren and I were traveling south on a Hwy. It was around 9pm. I was driving and noticed in the SW sky a row of bright white lights with a red light in the center of the row. They were not blinking. I told the children look, what in the world was that! I told them I have never seen a plane that looks like that. The whole time it was heading towards us. I also said that I have never seen a big plane fly in this area. I also said that is not a plane. I could not believe my eyes it was moving so low to the ground and very slowly. It finally got to us and went beside us and over us at the same time.There was no noise coming from it, just silence. I continued to drive but slowed down. I told the chidren to be my eyes and to press their faces into the windows and to see what they could see. My grand-daughter was in the front seat and my grandson in the back seat.My grand-daughter [13] said it does not have a nose it is just straight across. Since it was headed North my grandson[12] had the best opportunity to view it.He was able to look up out the back window and see the underneath side of it as it passed over us and then watched it head north.My grandson said it is shaped like a triangle and has a red blinking light in the center of it and white lights on each point I wanted to turn my car around and chase it. I was unable to that because my 96 year old grandmother was expecting me to tuck her in. We were all very excited and could not believe what we had just seen. Before we went to my grandmothers, I stopped at the gas station, my neighbors pulled in behind me. I was still very excited and said to them please tell me you just saw what we saw! They said YES. They were behind us by about a mile or two on the highway. They also were very confused by what they had seen and said that was not a plane. We did not talk for long but they also said there was no nose on the object. I had to get to Grandma's. When I got to Grandma's I called the police and reported it. I ask has anybody else called in? They said no. Although I did receive a call back 30 mins. or so later from the police asking me for more details. Hmmmmm?"],"Country":"United States","Date of the Event":"10/24/2012 09:15 UTC","Latitude":"37.497242","Longitude":"-98.682311","Date Submitted":"10/25/2012 04:01 UTC","Sighting Duration":"Undisclosed","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=37.497242,+-98.682311(43513)&iwloc=A&hl=en\"> mufon case (43513) map </A>","Viewing Distance":"21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Object Flight Path":"Path with directional change","Case Number":"43513","Region":"Kansas","files":["/var/www/straped/mufon/html2text/43513.html.txt","/var/www/straped/mufon/org/43513.html"],"Object Shape":"Triangle","Weather Factors":"Unknown","Log Number":"US-10252012-0004","trends":["There have been no other sightings in Sawyer","This sighting has never been favorited."]}