{"Case Number":"43515","Object Shape":"Triangle","City":"Marshall","Summary":"triangle with four rows of lights. very bright lights. hovering at tree level. slowly heading west then it was gone.","Object Flight Path":"Hovering then path","Date Submitted":"10/25/2012 05:08 UTC","Viewing Distance":"101-500 Feet","Longitude":"-84.967146","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=42.274118,+-84.967146(43515)&iwloc=A&hl=en\"> mufon case (43515) map </A>","Weather Factors":"Unknown","Latitude":"42.274118","Source":"MUFON","Log Number":"US-10252012-0006","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/43515.html.txt","/var/www/straped/mufon/org/43515.html"],"Sighting Duration":"Undisclosed","Region":"Michigan","Tags":"City","trends":["There have been 5 other sightings in Marshall","There were no other sightings in Marshall on or around October 24th 2012"],"divs":["Sighting DetailsMy husband and I were coming home from Firekeepers casino around 4:20 am on Oct 24 2012. traveling east on Mi ave when I happened to notice a bright light just over the trees on the north side of Mi ave. I asked my husband if the city put up some kind of tower? He looked at it and said he did not think so. The closer we got to it you could see it was triangle with rows of bright lights,the object was silver in color.There were three lights on the first row,four on the next row of lights and maybe four lights on the next row.The lights were very bright but a funny looking light. The light didnt seem to shine down like it was a spot light,I was just so bright. We watched as it hoovered over the trees for about 40 seconds. I told my husband to turn around and he told me to get a picture. We turned south on Mulberry st and turned in the first drive way. We could see it had started to move very slowly and as we got closer to it, it started to move faster than it was gone. I looked at my husband just stunned. We traveled east about a mile and could not find it again. My husband asked me where did it go? We were both in shock. We had never seen anything like it before."],"Date of the Event":"10/24/2012 04:25 UTC","Country":"United States"}