{"Date of the Event":"10/23/2012 06:15 UTC","Object Features":"Unknown","Latitude":"47.618611","Case Number":"43518","map":"<A HREF = \"http://maps.google.com/maps?q=47.618611,+-52.751944(43518)&iwloc=A&hl=en\"> mufon case (43518) map </A>","trends":["There have been 2 other sightings in St John's","There were no other sightings in St John's on or around October 23rd 2012"],"Source":"MUFON","Date Submitted":"10/25/2012 10:56 UTC","Log Number":"CA-10252012-0009","divs":["Sighting DetailsMy boyfriend and I always bring our husky up to the rugby fields every evening for a run. We have a pretty good view of part of the city and sky so I'm always stargazing. The evening of October 23rd had calm weather with clear skies and a few clouds. I was looking up to the sky and spotted a plane (small spec of light with noticeable blinking lights) soaring across the sky. On the right side of the plane, what I thought was a planet because it was distinguishably brighter than the other stars, was also moving. I concentrated on this ball of light, lined it with a tree below the horizon and noticed that it was slowly moving to the right (east direction). This ball of light was larger and much brighter than the other stars or planes(almost like a headlight or floodlight), and did not have any blinking lights. The object did not ascend or descend, nor did it get smaller or larger in size, just slowly moved across the sky above the horizon for a minute and then it was like someone turned off a light and it was gone. It quickly faded out but I could see a small, faint red spot and than nothing. I grew up in Gander, Newfoundland which is based around an airport, so I've seen many airplanes and helicopters in the day and night skies. These objects have distinguishable lights and sounds. St.John's also has an airport and I go to that field every night and have spotted airplanes in the sky at night(again with those distinguishable blinking lights and sounds), but have never seen a light that bright, that large, and move across the sky like that before. It was very fascinating to see!!"],"Summary":"Glowing ball of light/orb slowly moved across the sky (at night)","Weather Factors":"Unknown","Object Shape":"Sphere, Star-like","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","City":"St John's","Region":"Newfoundland and Lab","Longitude":"-52.751944","Country":"Canada","files":["/var/www/straped/mufon/html2text/43518.html.txt","/var/www/straped/mufon/org/43518.html"],"Disposition":"Unresolved","Tags":"City"}