{"Object Features":"None","Case Number":"43519","Longitude":"-86.707594","City":"La Porte","Source":"MUFON","Weather Factors":"Unknown","divs":["Sighting Details At 730 in the evening, my roommates and i observed three UFOs in the sky in the same general area of the last two sightings. They were over and near clear lake indiana. The first UFO i believe is the same one i saw the previous times. It was stationary in the same part of the sky where i have saw it before. The other two UFOs were solid white unblinking objects that were more east of the first and traveled slowly towards the east.My roommate commented that one seemed to blink out when a plane came near and lit up when the planes were gone. They were well below the flight path of the planes we see coming out of the direction of Chicago. One hovered by my view by a tree at treetop level near the lake. The two brighter lights winked out and disappeared but the shimmery red pulsating one stayed there for awhile. I called a friend of mine up to look over the lake.curiously he couldn't see it even though i had it in sight. I kept the object in sight but somehow i lost it on the way of two blocks. When i got to my friends house we looked at the sky but couldn't see it. But what we saw eventually saw was a bright light coming towards us. It turned to the east and winked out.It was well below the flight path of any plane, and the sky was clear and filled with stars. It was warm and slightly windy as well.All the objects were silent. The only noise i heard was the traffic and the wind."],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Sighting Duration":"Undisclosed","trends":["There have been 32 other sightings in La Porte","There were no other sightings in La Porte on or around October 24th 2012"],"files":["/var/www/straped/mufon/html2text/43519.html.txt","/var/www/straped/mufon/org/43519.html"],"Summary":"Three ufos over clear lake indiana","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.617489,+-86.707594(43519)&iwloc=A&hl=en\"> mufon case (43519) map </A>","Latitude":"41.617489","Disposition":"Unresolved","Region":"Indiana","Date of the Event":"10/24/2012 07:30 UTC","Date Submitted":"10/25/2012 12:37 UTC","Country":"United States","Log Number":"US-10252012-0010","Object Shape":"Sphere"}