{"Source":"MUFON","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path","Date of the Event":"10/08/2012 09:30 UTC","Log Number":"US-10252012-0011","map":"<A HREF = \"http://maps.google.com/maps?q=37.936856,+-84.655264(43521)&iwloc=A&hl=en\"> mufon case (43521) map </A>","Disposition":"Unresolved","Weather Factors":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/43521.html.txt","/var/www/straped/mufon/org/43521.html"],"Object Features":"Unknown","City":"Versailles","Object Shape":"Circle, Sphere","divs":["Sighting Details It started when my daughter called me saying she and her cousin had seen a UFO. She was very emotional about what she and her cousin had witnessed. I assumed that it was just a helicopter or airplane. I decided I would rush to where they were and prove them wrong, so I grabbed my camera and took off. I am not a believer of UFO's, so I wanted to prove to my daughter what she saw was explainable. However while driving I came around a sharp curve in the road close to where she was at and I saw a bright light in the sky hovering between two barns. I reached for my camera to turn it on but it would do nothing. Then object suddenly flew low over top of me in my car, I was trying to turn the camera on and look at the object at the same time. I could barley hear the sound of it. It sounded a little like a car running. The lights were very bright. It was about the size of my car, a Nissan Versa. When i got my iPhone out to use it the screen was scrambling. A short time later when I was able to use the phone, I called the father of my daughter and told him to come outside that I had just seen the UFO. So he got in the car with me and we started our search. When we found the object in the sky we followed it around several roads and kept as close as we could to it. We tried recording the object with my digital camera but we couldn't catch anything. The few pictures I took turned out strange and warped. I have attached the only two pictures that show anything. My brother and I have tried re-creating the pictures to make sure they were not from a shaky hand or or bumpy road but to no avail. Any information you can tell me about these pictures or of what is in the pictures would be greatly appreciated."],"Viewing Distance":"20 Feet or Less","Latitude":"37.936856","Longitude":"-84.655264","Region":"Kentucky","Date Submitted":"10/25/2012 07:55 UTC","Summary":"Saw and followed a UFO w/ 3 others.","Case Number":"43521","trends":["There have been no other sightings in Versailles","This sighting has never been favorited."],"Tags":"City"}