{"Region":"California","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","City":"Los Angeles","Log Number":"US-10252012-0015","Object Flight Path":"Straight-line path","divs":["sighting detailslast night, october 24th, myself and some friends decided to carve pumpkins and watch the good old classic british horror film 'shaun of the dead'... at around 11:10pm the conversation moved outside as some of us smoke, so we all stepped out onto the balcony. one of us pointed into the night sky and said - ...\"wtf is that!?\"... we looked and the three of us who were outside all saw it glide across the sky for a good 30 seconds maybe... from left to right. through the la smog layer, against the clear starry night we could see a jumbo-jet sized, silent, triangle\\delta-shaped\\boomerang with lights underneath it... faint lights, at least 10 or so with one larger light at the front... none of them flashing - which by law you have to have the flashing beacons... this did not... heading in a southerly direction... someone at lax must have painted that or seen it from a plane... surely!?!? we called the whiteman air base and they confirmed they'd seen it also and that they had received three calls already. this was no blimp or plane - it appeared to be fairly high up - but not of the 35k height of commercial air traffic... moving just as fast though... appeared to glide rapidly... silent... no flashing lights."],"Weather Factors":"Unknown","Object Features":"None","trends":["There have been 404 other sightings in Los Angeles","There was one other sighting in Los Angeles on or around October 24th 2012"],"Country":"United States","Disposition":"Unresolved","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.093479,+-118.335219(43525)&iwloc=A&hl=en\"> mufon case (43525) map </A>","Date Submitted":"10/25/2012 10:39 UTC","Summary":"Triangle/Boomerang/Delta-Shape of 10 or more lights... silent gliding over Hollywood. This was no blimp or plane!","Latitude":"34.093479","Date of the Event":"10/24/2012 11:10 UTC","files":["/var/www/straped/mufon/html2text/43525.html.txt","/var/www/straped/mufon/org/43525.html"],"Longitude":"-118.335219","Object Shape":"Boomerang, Triangle","Sighting Duration":"Undisclosed","Case Number":"43525"}