{"Date Submitted":"10/26/2012 01:30 UTC","Sighting Duration":"Undisclosed","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=39.464766,+-76.733652(43531)&iwloc=A&hl=en\"> mufon case (43531) map </A>","divs":["Sighting DetailsMy husband and I were on the patio playing darts as normal on a weekend he was home. I had grown up a sky observer so I always make a note of airport traffic when we move to familiarize myself with such things. One thing I learned fast as a kid is planes, no matter the altitude, you can always see blinking lights. I have flown many times and watched on my own as well....blinks blinks blinks. This night was different. I noticed two lights, from my vantage point in Millerville PA, they stayed perfectly the same distance apart the entire time I watched them. I pointed out to my husband and we both watched, oddly because every other plane in the sky, no matter the altitude, was blinking. Then, outta no where, two red blinking lights appear to be trying to catch up with them. BLinking, same altitude. It was so odd to me, because the lights did not even seem to be in the correct path from or to the airport in the first place, hugged the landscape, but I could still guesstimate the distance. weird. I have found a few seconds of video from the opposite direction from another source the same date"],"Case Number":"43531","Object Features":"None","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/43531.html.txt","/var/www/straped/mufon/org/43531.html"],"Summary":"always look at sky, see BWI traffic. THIS WAS NOT THAT. same distance, blinking lights in","trends":["There have been no other sightings in baltimore","This sighting has never been favorited."],"Tags":"City","Source":"MUFON","Log Number":"US-10262012-0005","Weather Factors":"Unknown","Object Shape":"Other, Unknown","Region":"Pennsylvania","Date of the Event":"10/06/2012 12:00 UTC","Latitude":"39.464766","City":"baltimore","Country":"United States","Viewing Distance":"Unknown","Longitude":"-76.733652"}