{"Viewing Distance":"20 Feet or Less","Sighting Duration":"00:01:00","Object Shape":"Diamond","Tags":"City","Summary":"It was a ship landing on the ground, dimond shape with lights surround it and in the top of it.","Region":"California","Case Number":"43537","Source":"MUFON","Log Number":"US-10262012-0011","Latitude":"36.787691","Country":"United States","City":"Undisclosed","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/43537.html.txt","/var/www/straped/mufon/org/43537.html"],"Date of the Event":"03/14/2011 02:15 UTC","trends":[],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=36.787691,+-119.414532(43537)&iwloc=A&hl=en\"> mufon case (43537) map </A>","divs":["Sighting DetailsI was driving from AZ to CA, Not exactly sure what time was it but it was about 2:00 to 2:30 am, The freeway was totally empty with no cars but me and some trucks in other side of the freeway wich is far from where i was, from a distance I notice a blinking light same color as a police light color which is blue, red and yellow, I thought its a police car as i drive close to it it was different and it has more lights surround it, The object was landing next to the freeway about 5 feets away from the freeway which is pretty close, The shape of it its like diamond the top looks like a cone it was dark i couldn't see the color of the object but it has light surrounding the cone and the are same size as a light bulb but the top of the cone it has a light look like a glass ball and in the inside 3 lights yellow,red and blue. It was very clear i pass by the object i was very scared for what i saw, I never believed in a UFO, i was scared to tell anyone don't know who to tell, people don't believe me so i just ignored it at that time, The object didn't move and even when i pass the object i look back in the mirror and its still there.The even happened last year in the summer time."],"Longitude":"-119.414532","Object Flight Path":"N/A","Weather Factors":"Unknown","Date Submitted":"10/26/2012 04:12 UTC"}