{"Country":"Canada","City":"Ottawa","Viewing Distance":"501 Feet - 1 Mile","Region":"Ontario","Object Features":"Unknown","Longitude":"-75.519864","Summary":"UFO seen clearly above ottawa west on way to work night shift.","Latitude":"45.483217","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Date of the Event":"10/21/2012 10:30 UTC","divs":["Sighting DetailsThe current date is October 22, 2012. The date of the sighting occured October 21, 2012 at approximately 2230 hours. I'm a security guard and work the night shift. On my way to work travelling southbound on the Champlain bridge Ottawa Ontario I noticed something strange out of the corner of my eye. A bright object in the sky moving erratically in no general pattern. At first I thought of spot lights or someone shining a flashlight. Although these could be possiblitities, I do not believe them to be the truth. The light i saw looked like a typical flying saucer except upside down. I didn't realize this until I started sketching diagrams of what i saw. This light appeared to keep a steady altitude in the low lying clouds that were starting to cover the west end of ottawa travelling east. It was almost like the object was using the low lying clouds as cover to remain undetected. If it wasn't for the fact that I happen to be starring right at it as i came over the bridge I would have never noticed it. Saying this it was quite visible to the naked eye if you were looking right at it. It moved quite quick then slowed down then changed pattern and continued this for approximately 20 minutes. I then arrived at work and was unable to continue my investigation. It was very odd. I keep an open mind, but i do believe science can explain almost everything. It takes a lot to convince me that something strange is happening. This \"UFO\" was indeed an occurance that I can't explain."],"Disposition":"Unresolved","Source":"MUFON","Date Submitted":"10/26/2012 12:07 UTC","trends":["There have been 55 other sightings in Ottawa","There were no other sightings in Ottawa on or around October 21st 2012"],"Tags":"City","Case Number":"43535","map":"<A HREF = \"http://maps.google.com/maps?q=45.483217,+-75.519864(43535)&iwloc=A&hl=en\"> mufon case (43535) map </A>","Weather Factors":"Unknown","Object Shape":"Disc, Sphere","files":["/var/www/straped/mufon/html2text/43535.html.txt","/var/www/straped/mufon/org/43535.html"],"Log Number":"CA-10262012-0009"}