{"Longitude":"-88.360474","trends":["There have been 4 other sightings in Hartland","There were no other sightings in Hartland on or around October 26th 2012"],"Date of the Event":"10/26/2012 08:00 UTC","divs":["Sighting DetailsAs my mom and I were driving on our way home from the grocery store my mom suddenly slowed down the car and pointed up in the sky saying \"whats that\"? When I first looked at it I thought it was the northern star because of how bright and big it was. Then as I looked towards the right of the object I noticed a red pulsating light. At first I thought it was just a plane going past, but then I realised that it wasnt moving. My mom stopped the car and we just sat their in awe. We were watching it for a good couple minutes and I decided to whip out my Ipod and film everything we were seeing. As the few minutes went by the bright light suddenly began to fade immensly. I screamed at my mom, \"The lights going away, its dimming\"! And then it started to slowly move to the left. My mom and I began to follow it with our car. All of a sudden it shot so fast behind a tree, that we had to speed up greatly to get in view of it again. When it shot super fast it looked like a mdoern day deciption of a UFO. It was very slim and oval like. When we got in view of it again, on the other side of the tree, it was now giving off the very same bright light that it was giving off when we first saw it. My mom decided to pull up in a little parking area and get closer to it. I on the other hand was freaking out. I told her no. I was afraid of getting abducted because of all the stories I have read about things like that happening. But my mom was not scared, she was facinated and incomplete awe. As we were wathching it she was telling me, \"I have never seen anything like it.\" As we were sitting their, the UFO was going in all sorts of directions, kind of like it was scanning the are. Then all of a sudden it stopped, and soon enough it started coming towards us. I was freaking out and telling my mom to \"Go, get out of here! Go!\". I was literally crying tears of freight. But within a few minutes it began to turn around and slowly turn around and go the opposite direction. The white light began to immensly dim again but the red light was still pulsating through all of this. At one point when we were so close to it, it looked as thoughs omething was hanging down from it. My mom thinks that maybe it turned and as we could only see the red light, the white end light of it was hanging down as it turned. We really are not sure what it was hanging. While we were sitting their watching all of this occur, I remeber telling my mom a few times \"Look how big it is! it looks like a car\". And let me tell you it was huge! I also remember a hearing it when we were very close to it. As it was coming closer I began to hear it even louder. It sounded like the noise a helicopter gives out. But the thing was..it was NOT a helicpoter. As it was going the other direction, my mom backed out of the parking space we were in and began to follow it. It was moving at a farily steady pace at this point. As we were on the street of our house already, my mom stopped the car at the side of the road and we just sat their watching it. The bright light began to dimmer again, and the red light went away. As we sat their I remember there was one point in which the light was gone completely and we couldnt see it anymore. But then it lit up again. We watched it as it went higher and higher up into the sky. It sat in the same exact spot for the rest of the night until we went to bed. If any other person didn't see what we saw and just looked up in the sky at the moment, they would have thought it was a little star because thats what it looked like. A little dim flickering star up in the night sky. This experience will stay with my mom and I for the rest of our lives. I have always believed in UFO's..but my mom on the other hand, has not. She doesnt believe in UFO's, ET's, or even the paranoraml. She is a \"I'll believe it when I see it\" type person. And after tonight..she whole heartedly believes that wer are not alone in this universe. A few times throughout the video we shot, you can clearly hear us saying, \"Its just a helicopter\", then \"No, its not\". We were in denial and didnt know what the heck the thing was. It was def not a plane or a helicopter. There were planes flying throughout the sky while we were watching the UFO. They looked NOTHING alike. All in all, my mom and I know what we saw last night..and no one can take away that experience form us."],"City":"Hartland","Object Shape":"Disc, Oval, Star-like","Latitude":"43.104957","files":["/var/www/straped/mufon/html2text/43548.html.txt","/var/www/straped/mufon/org/43548.html"],"Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering,Other","Case Number":"43548","Country":"United States","Object Features":"Dome","Tags":"City","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Weather Factors":"Unknown","Summary":"UFO Sighting Seen On October 26, 2012 In Wisconsin","map":"<A HREF = \"http://maps.google.com/maps?q=43.104957,+-88.360474(43548)&iwloc=A&hl=en\"> mufon case (43548) map </A>","Date Submitted":"10/27/2012 09:53 UTC","Source":"MUFON","Viewing Distance":"101-500 Feet","Log Number":"US-10272012-0004","Region":"Wisconsin"}