{"map":"<A HREF = \"http://maps.google.com/maps?q=52.134258,+-122.148347(43544)&iwloc=A&hl=en\"> mufon case (43544) map </A>","Disposition":"Unresolved","Country":"Canada","Date of the Event":"08/10/2007 09:45 UTC","Object Shape":"Sphere","Weather Factors":"Unknown","Source":"MUFON","divs":["Sighting DetailsI was living in Williams Lake BC working as a mining technologist. The town has quite a few First Nation natives and car thieves are prominent due to social economic hardships. I used to rig my little 1980 Toyota Tacoma so it wouldn't get stolen. It was a Friday after work and I had walked out to my back driveway to set my home made truck alarm. As I walked towards the truck, I looked to the northeast and saw this bright light moving slowly to the south. I thought it was an airplane. Then it stopped and hovered. I thought it was a helicopter. It was about 2 to 5 miles away, so I couldn't really tell. It was abnormally bright though. I rigged my truck to prevent it from being stolen and locked the drivers door. I looked over to the light again which was still there. The sun was setting in the west and I was looking at the object with a darkening sky in the east. Then the object shot off at an amazing speed. Because it was bright and the sky was dark, I could make out a streak that it had left in the sky, sort of like a camera flash streaking. It shot off to the south in an shallow angle. These things don't disappear, they just move extremely fast. I couldn't believe my eyes. I know what I had seen was real, but this thing was faster than lightning. I felt my hair tingling on my neck and realized this was a very unordinary event. It kept watching for more, and there were these lights in sky that would light up every couple of minutes or so for a few seconds. They were like fireflies at a high elevation. I went out the next night on Saturday, but all I could see were these firefly lights in the sky, nothing too amazing. On Sunday night, I had my little Sony 4 Megapixel camera just in case. It was pretty worthless in the dark evening. It was about 11 pm and I was just turning to go into the house when I looked up and coming right above was this triangular shaped obejct. There was a moon out, and I could recognize it's shape. It also had five lights on the bottom of the craft. I turned on the camera on movie mode, but I only caught my voice filled with adrenaline. The object made no sound whatsoever and I am cursing a blue streak I am so freaked out by this thing. It comes over me, it must have been a mile high and it is moving so slow. It's like I am on the bottom of a pool and looking up at a floating object. I managed to take a video, but there is basically just sound. Next week I went out and bought a Video camera with the night vision shot in it for $2000 Canadian. I had adrenaline in me that whole weekend after seeing at least two UFO's. I went to work Monday and mentioned it to my boss who was just a little skeptical. But who wouldn't be? After work, I caught the company bus home and mentioned it to some summer students. They said they were out at Lac La Hache partying late at night and witnessed an object that zig zagged in the sky for hours while they drank their booze. Nice kids in their late teens early twenties. A welder in the maintenance shop at the Gibraltar Mine also witnessed a UFO that weekend. So I knew I wasn't alone. I'll have to look for the video, my computer has crashed a few times, but I'll see what I can find."],"Log Number":"CA-10262012-0017","Summary":"Watched a bright light for 10 minutes. Took off at amazing speed of acceleration.","Object Features":"None","Sighting Duration":"Undisclosed","Longitude":"-122.148347","files":["/var/www/straped/mufon/html2text/43544.html.txt","/var/www/straped/mufon/org/43544.html"],"Case Number":"43544","Viewing Distance":"Over One Mile","Tags":"City","Region":"British Columbia","Object Flight Path":"Hovering then path","Latitude":"52.134258","City":"Williams Lake","Date Submitted":"10/26/2012 11:48 UTC","trends":["There have been 2 other sightings in Williams Lake","There were no other sightings in Williams Lake on or around August 10th 2007"]}