{"Date of the Event":"10/26/2012 11:30 UTC","Tags":"City","divs":["Sighting DetailsI was on my back deck letting my dog out and I looked up in the sky and noticed two bright lights in the sky. One was I learned afterwards was jupiter and the other was just as bright as jupiter but moving towards the SW from the East. I thought it was a star at first as since it was moving towards me it appeared stationary but quickly realized it was not a star. The light was moving slowly as though someone was dangling it from a stick as they moved it. It was moving slightly side to side as it came towards me. I wanted to go and get my camera but I knew it would dissappear before I got back so I stayed outside and watched it as it came towards me. It descended down for a few moments as though looking at me and then ascended back up and continued on to the SW. Usually a plane is not as bright as a star or planet but this object was. The light it was emitting when is was coming towards me shimmered and shined just like Jupitor, I really thought the other light was going to move also but did not since it was jupitor. As the object passed there were lights on it which flashed in sequence like a plane but I could still see some of the bright light that was on the front of the object. The object couldn't have been more than 500' off the ground but yet made no noise whatsoever. The object basically floated across the sky and dissappeared to the SW."],"Disposition":"Unresolved","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Latitude":"38.807352","Log Number":"US-10272012-0002","map":"<A HREF = \"http://maps.google.com/maps?q=38.807352,+-94.889743(43546)&iwloc=A&hl=en\"> mufon case (43546) map </A>","Region":"Kansas","trends":["There have been 9 other sightings in Gardner","There were no other sightings in Gardner on or around October 26th 2012"],"Summary":"Bright white orb moving towards me from East then to SW","Object Features":"Wings","Object Shape":"Sphere","City":"Gardner","Case Number":"43546","Object Flight Path":"Path with directional change","Longitude":"-94.889743","Country":"United States","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/43546.html.txt","/var/www/straped/mufon/org/43546.html"],"Source":"MUFON","Date Submitted":"10/27/2012 01:15 UTC"}