{"Summary":"UFO at Gibraltar Mine","Longitude":"-122.289717","trends":["There have been no other sightings in McLeese Lake","This sighting has never been favorited."],"Tags":"City","divs":["Sighting DetailsI was working at the Gibraltar Mine in British Columbia 52 deg 30' 57'' North 122 deg 14' 56\" West on Google Earth. It was March 3, 2007. I was out monitoring pit wall activity and I had noticed a couple of eagles flying around. I took the video of them and did not look at the video for the next couple of months. My camera card was full, so I put everything onto the computer and went through the pictures and videos. This was the first time I noticed the orb in the picture. You have to remember that it was winter time in Canada up in the mountains. The elevation is close to 1300 meters or almost a mile high. There are eagles, owls, ravens and a few seagulls in the area, but there are no small white birds whatsoever. As you will see in the video, a small white object comes into the picture and approaches one of the eagles. It then flies off. This happens at 38 seconds into the video. Make sure to use the full screen of your computer to see this. It does not fly such as a bird would. This area is known to have many ufo sightings and a fella by the name of Don Aaltonen detailed two separate UFO stories from the mine from around the 1970's."],"Country":"Canada","Object Shape":"Sphere","Source":"MUFON","Region":"British Columbia","Sighting Duration":"Undisclosed","Case Number":"43550","Latitude":"52.415371","Date of the Event":"03/07/2007 11:03 UTC","files":["/var/www/straped/mufon/html2text/43550.html.txt","/var/www/straped/mufon/org/43550.html"],"Object Flight Path":"Path with directional change","Viewing Distance":"101-500 Feet","City":"McLeese Lake","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=52.415371,+-122.289717(43550)&iwloc=A&hl=en\"> mufon case (43550) map </A>","Disposition":"Unresolved","Date Submitted":"10/27/2012 10:52 UTC","Weather Factors":"Unknown","Log Number":"CA-10272012-0006"}