{"Latitude":"32.230783","Region":"Arizona","Summary":"Red circle with triangle cut in back moved from over head to the south east, moved slower than metors but faster than ISS","Date Submitted":"10/27/2012 05:06 UTC","Longitude":"-110.924379","Viewing Distance":"Unknown","Object Shape":"Circle, Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=32.230783,+-110.924379(43554)&iwloc=A&hl=en\"> mufon case (43554) map </A>","Date of the Event":"10/20/2012 10:20 UTC","Disposition":"Unresolved","Source":"MUFON","Log Number":"US-10272012-0010","Case Number":"43554","Weather Factors":"Unknown","divs":["Sighting DetailsI had just come back outside of my house to watch for meteors after going inside to get a cigarette. I looked upwards towards the stars when I saw a bright red object moving in the sky, it was almost directly over head moving to the southeast. I watched it move in a straight line from over head to East South East near the horizon. It seamed to me that it faded out of sight in about half a second just above a power pole. When I first saw it a bright red circle, but after I focused on it I could see it had a triangle shape cut in the back of it (the back would be the opposite side to its direction of travel). I was outside looking for meteors but this object left no trail behind it and was moving too slow to be a meteor. But it was moving faster than the International Space Station. I have lived in Tucson for 11 years and another of my interest is aviation. With this I could tell it was not a aircraft or helicopter because of its speed, direction of travel and there were no collision warning light to been seen on it. It was not moving through any of the air-flight corridors nor was it a known military aircraft. After it had disappeared I though maybe it could be a satellite. A few days before this my neighbor had downloaded a satellite tracking app for his cell phone. So I called him outside so we could check. The only ones shown were two in the area where the object had disappear. Both was moving along the horizon, one was head to the west and the other to the east."],"trends":["There have been 173 other sightings in Tucson","There were 2 other sightings in Tucson on or around October 20th 2012"],"files":["/var/www/straped/mufon/html2text/43554.html.txt","/var/www/straped/mufon/org/43554.html"],"Tags":"City","City":"Tucson","Country":"United States","Object Features":"Other","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed"}