{"Date of the Event":"08/10/1994 10:00 UTC","Sighting Duration":"00:01:00","Case Number":"43551","divs":["Sighting DetailsIn August 1994 I was on a training exercise at FT Carson CO and saw an unexplained object in the sky while i was on guard. My job in the army at that time was a short range air defense missile gunner and our primary skills is to be able to visually identify aircraft by name type and hostile or friendly, as stinger gunners we always looked at passing aircraft and identified and called out aircraft as part of our craft. When i first saw this object in the sky, I thought nothing of it and attempted to identify so I watched for a few seconds and as I watched how it maneuvered I knew this was not commercial air when it hovered I knew it was not a jet not even a harrier and the speed it was moving could not be a AH-64 nor did the size match the way it split was not aircraft flying in formation. The sighting only lasted about 30 seconds to a minute. the craft was on an incoming path as it got closer the single light got bigger at about a 10-15 mile range it stopped the single light then moved to the right covering about 10 miles then moved to the left covering about 20 miles then came to center about 10 miles then split into 3 lights at the same time one went right to the previous position one went left to the previous position and the center moved came straight tward our position crossed over head and continued about 3-5 miles stopped then came back over head and went back to its previous position all three lights came together and it flew away heading south west about 1-2 min later 3 AH-64s flew overhead flying in the direction the other craft was traveling then about 30 seconds after they past 2 F-16s flew in that direction it appeared that the F-16s and the apaches were chasing or trying to follow the other craft. about 20 minutes or so both sets of air craft flew back where they came from. From what I saw I know this was not normal and I have been waiting for a show on this event to be aired."],"Disposition":"Unresolved","Region":"Colorado","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Country":"United States","Latitude":"38.743544","Summary":"the object flew tward me then went to the right then doubled the distance to the left then back to center then split into 3 one went back to the left position one went to the right position and one flew overhead they then came together in the samlocation","Date Submitted":"10/27/2012 11:19 UTC","Viewing Distance":"101-500 Feet, Over 1 Mile","trends":["There has been one other sighting in Fort Carson","There were no other sightings in Fort Carson on or around August 10th 1994"],"files":["/var/www/straped/mufon/html2text/43551.html.txt","/var/www/straped/mufon/org/43551.html"],"Source":"MUFON","Object Shape":"Unknown","Weather Factors":"Unknown","Log Number":"US-10272012-0007","City":"Fort Carson","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.743544,+-104.786162(43551)&iwloc=A&hl=en\"> mufon case (43551) map </A>","Object Features":"Unknown","Longitude":"-104.786162"}