{"Object Shape":"Unknown","Weather Factors":"Unknown","Latitude":"40.803964","map":"<A HREF = \"http://maps.google.com/maps?q=40.803964,+-81.519209(43552)&iwloc=A&hl=en\"> mufon case (43552) map </A>","Log Number":"US-10272012-0008","Sighting Duration":"Undisclosed","Date Submitted":"10/27/2012 11:30 UTC","Country":"United States","trends":["There have been 5 other sightings in Massillon","There were no other sightings in Massillon on or around July 15th 2012","This sighting has never been favorited.",""],"Case Number":"43552","Disposition":"Unresolved","Tags":"City","Object Features":"Unknown","Region":"Ohio","Date of the Event":"07/15/2012 03:15 UTC","divs":["Sighting DetailsI was driving down the road from my house and I noticed a house that had installed wind turbines on their roof. I thought this was really interesting so I decided I wanted to get a picture of it. I pulled to the side of the road took a few pictures. A few of the turbines were turning so I decided to take a short video (using my Ipad). I recorded a few seconds of video and left. I was showing the video to a co worker a few days later and noticed something streak across the sky, I barely noticed it at all. I started looking at the video frame by frame and there is an object flying at incredible speed across the sky in the video. The wind turbine(s) are turning and once you notice the object it is clear that it is flying at incredible speed. I suppose the object could be a jet flying at some incredible speed and I have the video so the date and time are probably tagged in its properties (I was looking but I can't find it). The object is moving far to fast to discern any features. I was really stunned when I noticed it in the video, I had not noticed it when I was recording the video. The object just disappeared across the sky. I have tried to attach the video below, hopefully it is there. Please let me know what you think."],"Summary":"Showed up on video I recorded","Longitude":"-81.519209","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/43552.html.txt","/var/www/straped/mufon/org/43552.html"],"City":"Massillon","Viewing Distance":"Unknown","Source":"MUFON"}