{"Date Submitted":"10/28/2012 01:49 UTC","files":["/var/www/straped/mufon/html2text/43564.html.txt","/var/www/straped/mufon/org/43564.html"],"Country":"United States","City":"Lancaster","Object Flight Path":"Hovering then path","Latitude":"37.613732","Disposition":"Unresolved","Source":"MUFON","Sighting Duration":"Undisclosed","trends":["There have been 5 other sightings in Lancaster","There were no other sightings in Lancaster on or around July 2nd 2011"],"divs":["Sighting DetailsIt was a quiet night on the night of July 2, 2012. I will never forget. I live next door to my mom. I walked out of my basement and looked out to see two orange orbs in the sky. Approximately 55 degrees in the sky. The sky was very clear that night. Twenty foot away on my moms back porch was family sitting around enjoying the weather. As soon as I saw the lights, I knew that this wasnt right. I screamed what is that in the sky. We all tried to explain the lights that stood motionless. They were not blinking at all. They had the same exact color. After watching with six other people for approximately three minutes the once motionless orbs were moving through the sky doing all these impossible turns and complete stops. There is nothing that can move like this. There is no way anhelicopter or plane could move like this. After the movement was over they came to a stop again. Just like fire flies slowly getting bright and slowly dimming again these silver, white sparkles, about fiftheen of them pulsated and the next thing you know there was nothing. We all stood there in shock and in the NE sky approximately where \"they\" were spotted. A very faint green light shot from the north-east back towards the North. Just like that the whole thing was over. 1. I was at home with family, July get together. not under the influence, clear mind. 2. The lights were right in our view. After this was over my mom said its almost like they wanted us to see them. They were showing off, fireworks were going off on the next street. Let me assure you this was no firework. 3. When I first saw the object, I thought that it was a set of stars that I had never seen. I like watching the skies for falling stars and this was just out of place. 4. The two orbs were diagonal to each other matching orange, very bright. Making no noise, no movement to extreme speeds. Almost like they were showing off there moves. When they stopped pretty close together all of these what I would call sparkles would go from dim to bright and back to dim within 20 seconds. 5. My feelings when I saw this was just pure amazement. I was like what is that. Someone said cellphone tower lights and I said there over there. When everyone saw them start moving we really just watched the whole thing together no one could figure this out. I was so confused. I knew we had saw something that we simply couldn't explain. On the day of July 2, 2012 exactly one year later, I ended up in jail. Lets just put it like this, I had a lot of questions and no answers. I thought that this was going to drive me crazy trying to figure this out. 6. We lost sight of the orange orb lights during the silvery sparkle grand finale. Then the very faint green light shot off into the night and it was over. To whoever reads this understand that while watching this event it's almost like your in a trance like state trying to understand whats going on. There are no pictures only memories that will last forever, thank for reading this and hopefully someone else saw something around the same time. Feel free to email, thanks"],"Case Number":"43564","Weather Factors":"Unknown","Object Features":"None","Summary":"two matching orange, red orbs motionless for about three minutes. Moving in sky with ease and speed, complete stops on a dime, at end flashes and disappeared","Log Number":"US-10282012-0004","Longitude":"-84.57796","Viewing Distance":"Over 1 Mile, Unknown","Date of the Event":"07/02/2011 10:30 UTC","Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=37.613732,+-84.57796(43564)&iwloc=A&hl=en\"> mufon case (43564) map </A>","Region":"Kentucky","Tags":"City"}