{"City":"Girard","Country":"United States","Date of the Event":"10/25/2012 07:30 UTC","Tags":"City","divs":["Sighting Detailsi was at work. It was between 7:30pm and 7:45pm on October 25,2012. Im not sure of the exact minute but I had an appointment waiting for me in the chair, being numbed with topical anesthetic and I know I started working on him around 7:45. It was just before I started working on him, I went outside to smoke a cigarette with my employee Jake. we began chatting when he brought my attention to some red lights just about the tree line in front of us and across the street. Jake said \"what the hell is going on there?\".It took me a second to see what he was talking about. I thought he was pointing at the power lines in front of us, when I suddenly caught something moving between the tree limbs in the distance beyond the power lines. There were four red lights moving toward us from west to east. When I saw them, I said \" must be a formation of helicopters\"....(Vienna air base is nearby to the south I believe, and we're always seeing c130's and occasionally black hawk choppers). I've also been interested in aircraft since childhood and am familiar with most things flying. I've even seen a formation of six APACHE attack choppers on 911......anyway, they were approximately the altitude and speed a chopper would fly at if it were at it's cruising height and speed and they were moving at a constant rate of speed . All four objects appeared to be in a v formation with one in the middle, one on the left and two on the right. As they got closer, I noticed NONE of the red lights were flashing, and there weren't any white lights on the objects which is usually the case with a chopper. Nothing was flashing. just a consistent red light underneath each one. jake and I were trying to rationalize what we were seeing when I decided to rush inside and grab binoculars. Initially I thought, 'get the camera', but I decided on binoculars because I wanted to see the shape of the object, not the lights. They were low in the sky but just out of sight and it was too dark to see the actual body of the object. I thought, if i used the camera, it would take too much time to focus and shoot. Since it was dark with ambient light from the store in front of us, I was afraid I wouldn't get ANYTHING, and would never know what made those red lights. It took 5 or ten seconds to grab the binoculars. I went out and trained em on the first object who's light was fading by then. However, as i watched it fade I could faintly make out a shape above the light blocking out the sky.it looked like a silhouette of a ball shaped object above the light. I didn't believe my eyes. So I then moved the binoculars to the second object to try and get a look before it's light dimmed also. It was THEN that i saw the shape of these objects due to the way the light reflected off of the bottom of them. It was a circular but flat bottom! Almost unbelievable! I could ALSO SEE THAT THE SIDES WENT UPWARD as if this was a ball with a flat bottom. I couldn't believe I was actually seeing my FIRST UFO SIGHTING! I'm still having a hard time reconciling this in my mind. At this point, after seeing the first and second objects through binoculars, I handed Jake the binoculars. I wanted him to see how the bottom looked with the light reflecting off of it. I knew he would always second guess himself if he couldn't see it for HIMSELF. However, he couldn't get the binoculars trained on it in time and the fourth light slowly faded out. All FOUR OBJECTS lights didn't go out completely until each object reached the same point in the sky where the first one disappeared. As if there were some invisible cloud that obscured the light. Except, there weren't any clouds anywhere in the sky that night. It was clear as a bell. In fact, Jake had said \"maybe it went behind a cloud\". I said, \"jake, there aren't any clouds at all!\" He agreed. I think Jake was trying to rationalize it because we both were having a hard time with this. After all this had taken place, Jake and I stood there in AWE and disblief at what we both witnessed. We talked for another fifteen minutes about it . We kept trying to rationalize what just happened. I said, \"jake? I think we just witnessed our very first UFO sighting!\" Jake said \" that was f*cking bizarre!\" and \"i don't know what we just saw!\" We both agreed that we witnessed something highly irregular and completely unexplainable. As i write this, I'm still completely at a loss about the incident. I have read books my whole life on the subject and have seen my fair share of UFO videos. I believe I've seen similar ones to this, although, i've never seen anything in real life. This was exhilarating,"],"Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Case Number":"43577","Object Features":"Other, Unknown","trends":["There have been 6 other sightings in Girard","There were no other sightings in Girard on or around October 25th 2012"],"Region":"Ohio","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=41.167405,+-80.712946(43577)&iwloc=A&hl=en\"> mufon case (43577) map </A>","Latitude":"41.167405","Date Submitted":"10/28/2012 09:01 UTC","Object Shape":"Circle, Sphere","Log Number":"US-10282012-0016","Summary":"formation of four flying towards us slowly, looked through binoculars to verify as each light slowly faded off as they rose.","Source":"MUFON","files":["/var/www/straped/mufon/html2text/43577.html.txt","/var/www/straped/mufon/org/43577.html"],"Longitude":"-80.712946","Weather Factors":"Unknown"}