{"Object Shape":"Cylinder","map":"<A HREF = \"http://maps.google.com/maps?q=43.856138,+-71.288244(43575)&iwloc=A&hl=en\"> mufon case (43575) map </A>","Date Submitted":"10/28/2012 07:45 UTC","Region":"New Hampshire","Disposition":"Unresolved","Viewing Distance":"Over One Mile","Country":"United States","divs":["Sighting DetailsI looked out the bedroom window to the west and thought I was observing a planet in the morning sky. Then I noticed it was moving, got the binoculars and it was in the same place, moving slowly, west to south. Through the binoculars, I observed what looked like 2 or 3 pieces of object joined together in a cylinder like shape. Thought it might be the space station at first but it moved far too slowly. Seemed to drift more like a weather balloon? Also observed pinpoint sparks of light flashing occasionally around it (not ON the object but a distance away in a circular manner). There was no sound, and it was visible in the same general vicinity for 15-20 minutes. I couldnt make out anything specific through the binoculars about its shape, only that it looked like there were several components to it. It may have been reflecting the morning sunlight; just looked very bright. Eventually it drifted out of view of my window. We wondered if it may have been a weather balloon of some sort because of the impending Hurricane coming up the coast."],"Source":"MUFON","Sighting Duration":"Undisclosed","Latitude":"43.856138","Longitude":"-71.288244","Summary":"Observed in western morning sky unknown object moving very slowly for approx. 15 min.","trends":["There have been no other sightings in Tamworth","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/43575.html.txt","/var/www/straped/mufon/org/43575.html"],"Log Number":"US-10282012-0014","Date of the Event":"10/27/2012 06:45 UTC","Object Flight Path":"Path with directional change","City":"Tamworth","Object Features":"Appendage(s)","Weather Factors":"Unknown","Tags":"City","Case Number":"43575"}