{"Date of the Event":"07/20/1995 10:30 UTC","Object Shape":"Flash, Unknown","Region":"Washington","trends":["There have been no other sightings in West Richland","This sighting has never been favorited."],"Latitude":"46.28319","Viewing Distance":"21-100 Feet","Case Number":"43588","Object Features":"Unknown","Log Number":"US-10292012-0005","files":["/var/www/straped/mufon/html2text/43588.html.txt","/var/www/straped/mufon/org/43588.html"],"Disposition":"Unresolved","Longitude":"-119.350293","City":"West Richland","Sighting Duration":"00:02:00","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=46.28319,+-119.350293(43588)&iwloc=A&hl=en\"> mufon case (43588) map </A>","Summary":"Bright blinding light, all sound muffled, light vanished suddenly.","divs":["Sighting DetailsMy brother, his friend, and myself were in the back yard of our house shortly after dark. We were roughhousing and sparring and stopped to catch our breath. Suddenly there was a blinding flash of light just above our house. Initially we thought a transformer had blown but the nearest one was several hundred feet away. The entire yard was whitewashed in light. I could barely make out the silouhette of my brother standing five feet from me. There was also a complete muffling of all sound (resembled talking under water - even our own voices were muffled to us.) This lasted about two minutes in which no one was sure how to react. The confusion caused by the light and lack of sound prevented me from fleeing the area. As suddenly as it started the light faded and my vision returned to normal instantly with no noticeable side effects. Sound returned just as quickly. We went back inside for the rest of the night and agreed not to tell anyone because of how bizarre it was and how people would think of us. About 15 years later I was riding to the store with my brother and another friend. We got on the topic of UFOs somehow and I decided to mention what I remembered. Over the years I had thought back to the event but convinced myself I had a false memory. I still decided to share the story at that point. I only got half way through it when my brother took over and completed it exactly as I remembered it. I was immediately chilled by knowing that what I remembered was absolutely real. I have since begun sharing the story with friends and family."],"Weather Factors":"Unknown","Country":"United States","Source":"MUFON","Date Submitted":"10/29/2012 06:36 UTC","Object Flight Path":"Stationary"}