{"map":"<A HREF = \"http://maps.google.com/maps?q=26.290018,+-80.095301(43585)&iwloc=A&hl=en\"> mufon case (43585) map </A>","Sighting Duration":"Undisclosed","Summary":"basically it blended with the sky and there were no lights at all idont know if some planes fly with no lights but it came to my concern cause it was triangular","Object Shape":"Diamond, Triangle","City":"Pompano Beach","Latitude":"26.290018","Log Number":"US-10292012-0002","Source":"MUFON","divs":["Sighting Detailsto whom may concern i was walking home around 2am and i seen the craft in the sky moving about the same speed of an airplane but there were no lights. i wanted to write a report because this isnt the first time i seen a ufo around this area (having that i seen two others). im not sure about this recent sighting but i know for infact that the last two were vary facinating and unusual. i would say about four years ago i walking to that same adress that i typed in{mc danolds) which is a block away from my house and i seen a massive ufo flying north from mcdanolds towards boca in that direction but anyways it looked like it was on fire. i think it was kinda shaped like the typical oval(ufo) and maybe im mis caculating but it was proberly like 130 ft above the ground (tall as the empire state bld) because it was so big and close. then recently i was driving home with my cousin from work sround (4-12-2012 5pm) before pullng in the drive way we seen a huge rectanler ufo appear and i only seen it for two seconds and then it dissapeared it was also cloudy but the two seconds that i seen it can say it was the size of our goodyear blimp but it was rectangular and it was proberly like 500ft-mile from the ground and thats all i can recall besides it was dark colored.....ps please exuse my writing"],"Object Features":"Unknown","Longitude":"-80.095301","Country":"United States","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Disposition":"Unresolved","Date of the Event":"10/28/2012 12:00 UTC","Region":"Florida","Viewing Distance":"101-500 Feet","Case Number":"43585","Tags":"City","Date Submitted":"10/29/2012 02:27 UTC","files":["/var/www/straped/mufon/html2text/43585.html.txt","/var/www/straped/mufon/org/43585.html"],"trends":["There have been 11 other sightings in Pompano Beach","There were no other sightings in Pompano Beach on or around October 28th 2012"]}