{"Country":"United States","Longitude":"-118.192497","Date Submitted":"10/29/2012 03:43 UTC","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Latitude":"33.770821","Object Flight Path":"Path with directional change","Date of the Event":"10/28/2012 07:50 UTC","divs":["Sighting DetailsAlright so this takes place in Long Beach, CA at around 7:50pm. The clearest day it's been in months. I'm watching the Broncos Saints game and my roommate asks me if I'd like to join him in a cigarette. I accepted and we walk out onto the balcony. After about a minute of being out there I see a red-orange light just rising up in the sky, my initial thought was an emergency flare but it wasn't coming down. I interrupted my roommates story and said \"I'm sorry but WTF is that?\" He first thought it was a police helicopter cause of the light and it's altitude. But then I mentioned it was too quiet and the light was too dull and wasn't directed anywhere. It kept coming closer and closer to us, the light became much bigger. Within moments it was going to directly fly over my apartment. I pull out my phone to record a video but the patio light was on and couldn't pick it up on my phone. I opened the door behind me and flipped the switch to turn off the light. I look back and the light makes a left turn heading south then fades out into a little dot. And that was it, it disappeared. We stuck around for another 15 minutes in hope of a return. I've been debating if I should call the police because we are SPOOKED, yet excited. Looking for other reports or sightings but haven't come up with anything."],"Disposition":"Unresolved","Source":"MUFON","files":["/var/www/straped/mufon/html2text/43586.html.txt","/var/www/straped/mufon/org/43586.html"],"Summary":"Saw a pulsating red flare like object rise in the sky, came towards us, changed direction and it be","Case Number":"43586","trends":["There have been 45 other sightings in Long Beach","There were no other sightings in Long Beach on or around October 28th 2012"],"Log Number":"US-10292012-0003","Region":"California","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.770821,+-118.192497(43586)&iwloc=A&hl=en\"> mufon case (43586) map </A>","City":"Long Beach","Sighting Duration":"00:00:50","Object Shape":"Fireball","Object Features":"Unknown"}