{"Tags":"City","divs":["Sighting Details I was walking my dog, randomly looked up and saw 2 sets of 3 huge orangish lights, those flickered off like stadium lights would when you flip the switch (it was happening in slow motion), at first I thought nothing of it, I heard a plane in the distance and figured that was what it was but then I saw the small airplane go by and I remembered my father telling me a story of something similar so I reached for my phone to call him, no answer, all of a sudden another set of 4 lights appeared on the other side of the sky, by the time those flickered off my father returned my call and assured me I wasn't crazy because what I described was exactly what he had seen a few short months earlier, except he only saw one set of the lights. It was huge, I'm stil not sure how far away it was, my boyfriend thinks it was an airplane, but we live close to the airport and that was not a plane, planes don't just stand still and disappear, they glide through the sky. I know the pilot had to of seen it, if theres a way for you to find out who was in that plane leaving MYR or flying over Myrtle at 8:41pm on that night I'd contact him, he had to of had a closer look. I still cannot believe it, all the years of thinking my father was a nut case seeing things, turns out I'm seeing them too. I keep looking at the stars wondering now if they are really stars or if there is something else out there."],"Object Shape":"Sphere","Region":"South Carolina","Source":"MUFON","Latitude":"33.683504","Log Number":"US-10292012-0004","files":["/var/www/straped/mufon/html2text/43587.html.txt","/var/www/straped/mufon/org/43587.html"],"Disposition":"Unresolved","City":"Socastee","Date of the Event":"10/24/2012 08:41 UTC","trends":["There has been one other sighting in Socastee","There were no other sightings in Socastee on or around October 24th 2012"],"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.683504,+-78.998368(43587)&iwloc=A&hl=en\"> mufon case (43587) map </A>","Weather Factors":"Unknown","Object Flight Path":"Stationary","Date Submitted":"10/29/2012 04:29 UTC","Summary":"2 sets of 3 huge orangish glowing bulbs, flicker off, then 4 appear and flicker off.","Viewing Distance":"Unknown","Longitude":"-78.998368","Case Number":"43587","Sighting Duration":"Undisclosed","Country":"United States"}