{"files":["/var/www/straped/mufon/html2text/43589.html.txt","/var/www/straped/mufon/org/43589.html"],"Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path","Country":"United States","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-10292012-0006","Object Shape":"Disc","Source":"MUFON","Date Submitted":"10/29/2012 10:10 UTC","trends":["There have been 26 other sightings in Lakeland","There were no other sightings in Lakeland on or around October 27th 2012"],"divs":["sighting detailsi was traveling on the polk parkway on saturday night, 10\\27\\12, around 8:30pm. it was dark. my 2 children were in the back seat. i was headed toward i4 on the parkway and something bright caught my eye ahead. it was fairly low, but not dangerously low. very bright. my first thought was that it was a plane with fire coming out of the engines or something. i continued to watch it and as we got closer i realized that it was not a plane and it was nothing i've ever seen before. i kept thinking i was going to see a pole or something attached to the bottom, like it was some sort of sign, but as we got closer i realized that this was no sign and it wasn't a typical airplane. it was disk shaped, tilted sometimes, level others. it seemed to have a light on top, with a skirt of lights all around the bottom. the lights pulsated and were very bright. we pulled over the car and took a few pictures. it did seem to be moving slowly, then would stay stationary, then move again. it wasn't darting around, just seemed to be loitering above. after about 5 or 10 minutes we continued on our way home. we all three saw it. no one felt weird or sick or nervous or scared, just intrigued."],"Tags":"City","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=28.043265,+-81.948294(43589)&iwloc=A&hl=en\"> mufon case (43589) map </A>","Case Number":"43589","Date of the Event":"10/27/2012 09:30 UTC","Longitude":"-81.948294","Summary":"Disk like object seen with lights on top and around perimeter of bottom","Region":"Florida","Disposition":"Unresolved","City":"Lakeland","Latitude":"28.043265"}