{"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/43581.html.txt","/var/www/straped/mufon/org/43581.html"],"City":"Rapid City","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=44.083603,+-103.221955(43581)&iwloc=A&hl=en\"> mufon case (43581) map </A>","Date Submitted":"10/28/2012 11:14 UTC","Longitude":"-103.221955","Disposition":"Unresolved","Weather Factors":"Unknown","Object Shape":"Other","Latitude":"44.083603","Case Number":"43581","Summary":"Black UFO with red ring of light on the bellly of the craft flew over us while we were traveling on the highway.","Tags":"City","Source":"MUFON","trends":["There have been 10 other sightings in Rapid City","There were no other sightings in Rapid City on or around July 30th 2010"],"Log Number":"US-10282012-0019","Region":"South Dakota","Object Flight Path":"Straight-line path","divs":["Sighting DetailsI first noticed a bright light in the distance near the horizon, while my boyfriend and I were traveling west on I90. It was dusk. I ignored it and began to look out of the passenger window instead. After a few minutes, my boyfriend, who was the driver, slapped my leg and said, \"What is that?!\". I looked out of the front window and a large black craft was flying right in front of us and then directly over our vehicle. It was traveling east. I got an amazing and close look at it. I took flying lessons in the early 90's, and have not seen anything like it. It was very close to the ground. On the belly of the craft was a red ring of light. The craft was shaped sort of like a stealth, but with rounded edges and a tail that is not pointed, but rounded. I have not found a craft that looks like this anywhere on the internet. It is now 2012. I would have to draw the outline of it to really explain it to people. After it flew over us, I watched it fly in a straight line going east. I did not hear any noise and it seemed to fly fairly slowly."],"Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"07/30/2010 12:00 UTC","Object Features":"Unknown"}