{"files":["/var/www/straped/mufon/html2text/43592.html.txt","/var/www/straped/mufon/org/43592.html"],"Country":"United States","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around October 29th 2012"],"Sighting Duration":"Undisclosed","Object Shape":"Fireball","Log Number":"US-10292012-0009","divs":["sighting detailsi was taking my 15 yr old daughter to school this morning at approx. 7:27am. as soon as i stepped out the front door, i could see what appeared to be a comet\\meteor type object with a long tail streaking by across the sky. my sight path was just above the phone lines across the street. it was moving quite rapidly and had a northeasern flight path. it was tear dropped shaped and slightly rounded at the front, leading us to believe it was a comet\\meteor. the entire object appeared to be on fire. the tail was quite long and measuring the tail by holding up my fingers to the object, it was about 4 inches. i have no idea how far away i was from the object. there was no sound. the sky was quite clear and no other objects were in the sky. my daughter and i stood and watched it for about 2 minutes and were joined by my 9 yr old daughter. i returned from taking my daughter to school at approx. 7:36 and it was no longer visible from my house. i called my husband,who was traveling east on i-10 to work, around 7:50 and he couldnt see anything in the sky. my 15 yr old daughter had her phone and took a picture and videoed it as well. she couldn't tell if the object would show up on video or not. will post video if you can see object when she gets home from school."],"Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","Tags":"City","Weather Factors":"Unknown","Summary":"Large Comet like object traveling very fast. It looked to be on fire with a long tail","Region":"Texas","City":"Houston","Disposition":"Unresolved","Longitude":"-95.520485","Case Number":"43592","Date Submitted":"10/29/2012 11:11 UTC","Object Features":"None","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=29.75514,+-95.520485(43592)&iwloc=A&hl=en\"> mufon case (43592) map </A>","Date of the Event":"10/29/2012 07:27 UTC","Latitude":"29.75514"}