{"Longitude":"-86.908065","Object Shape":"Disc","Date of the Event":"09/15/2011 12:00 UTC","Region":"Quintana Roo","Object Features":"Window(s)","Sighting Duration":"Undisclosed","divs":["Sighting Details So I went on a Carnival cruise, one of the stops was Cozumel. Once there we took an excursion to a smaller island. Passion Island on the north shore of Cozumel. Awesome white sand beaches, \"romantic\" very nice. I even proposed to my wife there. Okay, here's where it gets interesting. When I got back home from the cruise I wanted to go back and check out all the places where I had been with google maps. When I came across the north shore of Passion Island, pretty much at the exact spot where we had spent half the day, I saw a Unidentified Submerged Object, disc shaped with what appears to be windows all around it. It's about 30-40ft in diameter, the huts that we rented on the beach were at least 10ft in diameter, I'm pointing out one of the huts with my mouse pointer in one of the pictures so that you can get an idea of the size of this \"thing\". I remember from swiming on that beach that it drops off pretty significatly about 25-30 ft in. It gets deep real fast. Anyway, the object is still there on google maps if you want to check it out for yourself, Cozumel is an island east of Cancun, and Passion Island is on the nort shore of Cozuel, just scan the northen shore of Passion Island and you'll see it. Thanks for reading!"],"Object Flight Path":"Stationary","trends":["There have been no other sightings in Cozumel","This sighting has never been favorited."],"Disposition":"Unresolved","Date Submitted":"10/29/2012 12:05 UTC","Latitude":"20.431006","Country":"Mexico","files":["/var/www/straped/mufon/html2text/43594.html.txt","/var/www/straped/mufon/org/43594.html"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=20.431006,+-86.908065(43594)&iwloc=A&hl=en\"> mufon case (43594) map </A>","Viewing Distance":"Unknown","Weather Factors":"Unknown","Tags":"City","Log Number":"MX-10292012-0011","Case Number":"43594","City":"Cozumel","Summary":"USO on GOOGLE earth!!!"}