{"Viewing Distance":"Over One Mile","Log Number":"US-10292012-0013","Country":"United States","Weather Factors":"Unknown","Object Flight Path":"Stationary,Hovering then path","trends":["There have been 24 other sightings in North Myrtle Beach","There were no other sightings in North Myrtle Beach on or around October 22nd 2012"],"Object Shape":"Fireball, Star-like","Date of the Event":"10/22/2012 08:00 UTC","Summary":"looking out over the ocean from beach, reddish orang n yellow lights appeared 5 secs later vanished, then reappeared and left one slide approxseveral miles in the blink of an eye then all 3 vanishing-happened twice--this also happened on the 24th","Case Number":"43596","Tags":"City","Date Submitted":"10/29/2012 01:32 UTC","Latitude":"33.815418","Longitude":"-78.691984","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Region":"South Carolina","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=33.815418,+-78.691984(43596)&iwloc=A&hl=en\"> mufon case (43596) map </A>","City":"North Myrtle Beach","divs":["Sighting Details I WAS ON THE BEACH IN NORTH MYRTLE BEACH, SC JUST RELAXING AFTER DARK, AS I WATCHED OUT OVER THE OCEAN 3 REDDISH ORANGE LIGHTS APPEARED OVER THE OCEAN, AS I WATCHED SECS LATER THEY VANISHED, THEN MOMENTS LATER REAPPEARED AND AS I WATCHED THE ONE ON MY LEAFT SLID OR ACCELERATED THEN CAME 2 A DEAD STOP. THEN ALL DISAPPEARING AGAIN THIS HAPPENED AGAIN SECS LATER THEN ALL GONE ON WENSDAY, 2 NYTES LATER MY LADY FRIEND AND I WERE A LITTLE FURTHER DOWN ON THE BEACH ACESS SIITING IN MY CAR. AS WE TALKED I LOOKED 2 MY LEFT AND I GRABBED MY FRIEND SHOWING THEY WERE THERE OVER THE OCEAN 2 SIDE BY SIDE , ALMOST ON THE SHORELINE THEN THEY VANISHED. ONE REAPPEARED A LITTLE FURTHER DOWN THE SHORE . NONE REAPPEARING AFTER THAT. I WENT ONLINE AND FOUND THERE HAVE BEEN MAY SIMILIAR SIGHTINGS OF THE SAME THING ALL OVER.I HAVE NEVER WITNESSED ANYTHING LIKE THIS WITH SO MANY WITNESSES IT DI NOT SEEM 2 B FROM HERE. I CAN NOT SAY ABSOLUTELY WHAT IT WAS. BUT IT WAS VERY STRANGE AND A BIT UNNERVING."],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/43596.html.txt","/var/www/straped/mufon/org/43596.html"]}