{"City":"Isle of Palms","Tags":"City","Object Flight Path":"Unknown","Source":"MUFON","Latitude":"32.804277","map":"<A HREF = \"http://maps.google.com/maps?q=32.804277,+-79.747626(43590)&iwloc=A&hl=en\"> mufon case (43590) map </A>","Date Submitted":"10/29/2012 10:17 UTC","Case Number":"43590","Log Number":"US-10292012-0007","files":["/var/www/straped/mufon/html2text/43590.html.txt","/var/www/straped/mufon/org/43590.html"],"Viewing Distance":"Unknown","Object Shape":"Other","Longitude":"-79.747626","Summary":"Unidentifiable picture on digital camenra over the ocean. Not visualized with naked eye.","Country":"United States","Region":"South Carolina","divs":["Sighting DetailsI took a picture on the coast of South Carolina last weekend. I was with a friend at the beach. I was attempting to take a picture with a Canon EOS digital camera in the pitch blackness and catch the tide coming in in the darkness. I took a series of pictures, but in one of the pictures, this showed up. I would like to know if this is an issue with my camera, reflection or any other phenomenon or if this could possibly more than that. I am not a professional photographer or UFO expert. I took the picture in the presence of a crecent moon, to the far right of me but not anywhere near the photo direction. I didn't visualize anything on the horizon or anywhere else in the enviroment that could have persuaded the picture in this way. This showed in the picture. I don't have adequate software to zoom in and not lose resolution but I have attached also the zoom that I can do on my computer. It looks like water coming off of the object once zoomed. Maybe this in nothing at all, but I'm very curious. Does anyone have any ideas?"],"Sighting Duration":"Undisclosed","Object Features":"Dome","Weather Factors":"Unknown","Disposition":"Unresolved","Date of the Event":"10/20/2012 12:00 UTC","trends":["There have been 2 other sightings in Isle of Palms","There were no other sightings in Isle of Palms on or around October 20th 2012"]}