{"Case Number":"43606","Object Flight Path":"Straight-line path","Log Number":"US-10302012-0002","Longitude":"-122.695185","Date of the Event":"10/29/2012 05:15 UTC","Viewing Distance":"101-500 Feet","Object Shape":"Sphere","divs":["sighting detailsi was at home, time was between 5:10-5:15 p.m. sun oct 29 in the back patio area of my home. my girlfriends 4yrs old grand daughter pointed to the sky and said what is that? my back was turned, and when i stood up and turned around, i seen a bright\\glowing orange sphere in the sky. i thought for a second that it was a balloon. the object looked liked a balloon but i noticed that it was not floating but moving very rapidly from a south westerly to north easterly trajectory. the object's altitude and speed remained constant. i watch for about 5 seconds then ran inside (about 10 feet) through patio door and got my cell phone. i ran back out but the object was far enough away that it was small but still visible. while i could still the object, i don't know if i lost sight of it or what, but it seemed to vanish. i wanted to record the event but only had enough time to quickly snap a picture. the orange dot in the picture is hardly visible, and if blown-up looses quality. i did not have time to select the type of picture i wanted to take. i watched the sky for about 20-30 minutes but did not see anything else. after looking at the picture on the computer, i notices there is a black sphere (spot on camera lens?) in front of the orange object"],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=38.442953,+-122.695185(43606)&iwloc=A&hl=en\"> mufon case (43606) map </A>","Region":"California","Object Features":"None","City":"Santa Rosa","Sighting Duration":"00:00:30","Source":"MUFON","Summary":"seen bright/glowing orange sphere moving across sky approx. 100 mph","Tags":"City","Weather Factors":"Unknown","trends":["There have been 30 other sightings in Santa Rosa","There were no other sightings in Santa Rosa on or around October 29th 2012"],"files":["/var/www/straped/mufon/html2text/43606.html.txt","/var/www/straped/mufon/org/43606.html"],"Country":"United States","Date Submitted":"10/30/2012 02:54 UTC","Latitude":"38.442953"}