{"Latitude":"34.350586","divs":["Sighting DetailsOn October 23, 2012 at about 4:00 PM Eastern Standard Time, I was on my front porch along with my best friend. My two children were in the driveway at the time as well. My 8 year old daughter first saw a large black object a bit above the tree line accross the street and she pointed it out to us. It was slowing moving towards my house and we got a good look at it directly above the street in front of my house. It looked to be a dull, black color with a curved, wing like shape on either side. The wings did not move though. It looked to be a solid object with no noise. It slowly ascended NE. There were obvious lights blinking randomly on the front, sides, and back throughout our observation. We watched it slowly ascend until it seemed to be close to the height of where a commercial airplane could be. There were some faint clouds very high up in the sky and eventually this object ascended into them. Before it became unnoticable, it looked like a black spec. I have three short videos of this object that I videod with my cell phone. My daughters described this as a \"spaceship\" and my friend and I had never seen anything like this and felt it was a UFO."],"Region":"Georgia","Case Number":"43607","trends":["There have been 3 other sightings in Ball Ground","There were no other sightings in Ball Ground on or around October 23rd 2012"],"files":["/var/www/straped/mufon/html2text/43607.html.txt","/var/www/straped/mufon/org/43607.html"],"Disposition":"Unresolved","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.350586,+-84.350518(43607)&iwloc=A&hl=en\"> mufon case (43607) map </A>","Object Shape":"Other","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Log Number":"US-10302012-0003","Tags":"City","Summary":"We saw a black, bird like shaped object that made no noise along with blinking lights in the sky.","Country":"United States","Source":"MUFON","Object Features":"Wings","Date of the Event":"10/23/2012 04:00 UTC","Viewing Distance":"101-500 Feet","Date Submitted":"10/30/2012 08:11 UTC","City":"Ball Ground","Longitude":"-84.350518"}