{"Viewing Distance":"Unknown, N/A","Object Features":"Unknown","Region":"Oregon","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/43616.html.txt","/var/www/straped/mufon/org/43616.html"],"Disposition":"Unresolved","Country":"United States","Log Number":"US-10302012-0012","Object Shape":"Unknown","trends":["There has been one other sighting in Rose Lodge","There were no other sightings in Rose Lodge on or around July 8th 2002"],"Summary":"Everything outside in small neighborhood lite up like and cast shadows","City":"Rose Lodge","Date Submitted":"10/30/2012 05:58 UTC","Case Number":"43616","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=45.013454,+-123.914025(43616)&iwloc=A&hl=en\"> mufon case (43616) map </A>","Date of the Event":"07/08/2002 12:00 UTC","Sighting Duration":"Undisclosed","Longitude":"-123.914025","divs":["Sighting Details It was sometime back in the summer of, I think 2002. One afternoon me and a friend of mine where driving into small towm of Otis to my house from Lincoln City Oregon.The radio in my car started to make weird sounds as we recalled as it has been decade since the time of this event we put our heads together and try to recall exactly what kind of souds it make because I can only be sure enough it wasnt your regular radio static.We joked alittle about how it reminded us of something we saw it the movie \"Signs\" that came out around that time. We get to my house and turn on the tv. I have been watching the news alot since 911 wasnt that long ago and I wanted to keep up on current events.It was still after noonish and we had it on Fox news. I pointed out that I have seen all the events that they were airing the day before. We decided play video games on another tv on the other side of the house. I turn the tv on and its on the same channel as its on in the other side of the house, Fox news, but its not airing the samethings that were on the day before like I pointed out to my friend. I go to the other side of the house and look at the date on the bottom of the screen and it says I believe July 7th. It was the 8th. The second tv had the date right on the bottom. We flip the channels on both the tvs and everythings the same, all but whats on Fox news... Werid. That evening there seemed to be a stir up of crickets, birds, frogs outside. It was late by this point. Me and my friend decide to go to bed. Im lying there in bed when all of a sudden theres a bright light outside. My friend noticed it as well. We both jump up and look out the windows. Everything is either lite up or casting a shadow. I run to multiple windows and try to look above my house as it seems thats where the source of the light is coming from. From one room to another every which was of the outside is lite up. By the time we can both agree this is very very strange we never had a chance to run straight outside and look back at the house. We both wish we would have to this day. Its one of those things were you relive it in your head and you make that choice to do whatever you did diffrent, but what we would have saw we have no idea to this day. I wasted too much time trying to wake my brother up and by the time he was up he was half asleep and mad that I had woke him. It was suddenly gone.. The whole time this was happening there was no sound coming from the source of the light. And the thing about the tvs was they had the same satilite box. The only event that took place after all this was acouple helicopters flying around which had lights but not like what was lighting outside up and they made plenty of noise.. I have since seen acouple things in nights sky, and before this happend, But this Ufo sighting is my strangest, probably because I never really saw what it was..."],"Object Flight Path":"Unknown","Latitude":"45.013454"}