{"Region":"New York","Object Flight Path":"Stationary","Date of the Event":"10/25/2012 04:40 UTC","Object Features":"Patterned Surface","divs":["Sighting DetailsI was driving on a clear day. Coming off of an off ramp from I-990 at the University at Buffalo. I noticed, above the tree line, a long, stationary cigar shaped object in the sky, below the moon. It was a very clean looking white, with a blue pattern around the midsection. It had no distinct features. It did not appear to be moving, though it was difficult to tell while driving. As I rounded in the off ramp, it was occluded by the tree line temporarily. As I came out of the tree line able to see the sky again, the object was gone. I'm not a pilot, but I have spent a lot of time studying aircraft (I'm an aerospace engineering major and have studied them a lot in my down time) and I could not identify it as any known aircraft myself. It was very large in size, I'd say somewhere bigger than a business jet but smaller than or about a Boeing 373 in size. I did not see any sort of smoke trail, dust trail or any visible evidence of the object moving (or an aircraft moving, mind you). I looked around the sky for airplanes (they're a common sight, there is a decently large airport nearby) and could not find any. I did not feel fear or apprehension, just curiosity. Seeing planes around the campus is a very common sight, so they rarely catch my eye anymore. However, this object was so distinctly different that it caught my eye, and remains, as defined, a flying object I could not identify."],"Tags":"City","Disposition":"Unresolved","Object Shape":"Cylinder","Log Number":"US-10302012-0013","Longitude":"-78.8","Latitude":"42.978333","trends":["There have been 4 other sightings in Amherst","There were no other sightings in Amherst on or around October 25th 2012"],"Sighting Duration":"00:00:20","Weather Factors":"Unknown","City":"Amherst","Case Number":"43617","Date Submitted":"10/30/2012 06:02 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.978333,+-78.8(43617)&iwloc=A&hl=en\"> mufon case (43617) map </A>","Source":"MUFON","files":["/var/www/straped/mufon/html2text/43617.html.txt","/var/www/straped/mufon/org/43617.html"],"Viewing Distance":"501 Feet - 1 Mile","Summary":"Cigar shaped UFO hovered near UB and disappeared","Country":"United States"}