{"Summary":"slow flashing light that spread out into 5-7 lights then back to one and disappeared","Country":"United States","Region":"Indiana","Tags":"City","files":["/var/www/straped/mufon/html2text/43627.html.txt","/var/www/straped/mufon/org/43627.html"],"Source":"MUFON","Log Number":"US-10312012-0005","Date Submitted":"10/31/2012 09:56 UTC","Case Number":"43627","map":"<A HREF = \"http://maps.google.com/maps?q=39.553398,+-85.808667(43627)&iwloc=A&hl=en\"> mufon case (43627) map </A>","Object Features":"None","Object Shape":"Circle","City":"Shelbyville","Object Flight Path":"Path then hovering","Sighting Duration":"Undisclosed","Date of the Event":"09/05/2012 09:30 UTC","Latitude":"39.553398","Disposition":"Unresolved","Longitude":"-85.808667","Weather Factors":"Unknown","divs":["Sighting DetailsMy girlfriend and I stepped outside our front door to have a cigarette and while talking i noticed a light bigger than any plane passing over the tree line. It began to disappear and reappear as it slowly moved south east. I kept watching for about a minute and it began to disappear and reappear in another place along its path of movement and then back. We both thought this was unusual. It then flashed in two places back and forth and i told my girlfriend to quickly go inside and get her phone. She came back out and handed me the phone. I told her to keep her eye on it while I turned the iphone to a camera. As soon as I began to film it disappeared one more time and then it morphed into five or more lights in somewhat of a straight line. This startled us both. My girlfriend became scared and I did too. This was not typical of any plane or helicopter. The lights then came back together to one light and disappeared a final time. I kept filming and walked toward the event. Nothing else happened. Nothing flew off. the lights just disappeared. The sky was clear and on the film you cant see any stars so it shows how bright the lights had to have been in order for the phone to capture them. I wish someone could analyze this footage for me and make some sense of it."],"trends":["There have been 3 other sightings in Shelbyville","There were no other sightings in Shelbyville on or around September 5th 2012"],"Viewing Distance":"501 Feet - 1 Mile"}