{"Tags":"City","Disposition":"Unresolved","Sighting Duration":"01:30:00","Viewing Distance":"Unknown","Object Flight Path":"Path then hovering","trends":["There have been 2 other sightings in New Richmond","There were no other sightings in New Richmond on or around October 31st 2012"],"Country":"United States","Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=45.124731,+-92.535056(43626)&iwloc=A&hl=en\"> mufon case (43626) map </A>","Object Features":"None","Log Number":"US-10312012-0004","Longitude":"-92.535056","City":"New Richmond","Summary":"Very bright light in eastern sky 30 degrees above horizen. Moving slowly, multiple light sources on botton of craft.","Region":"Wisconsin","Source":"MUFON","Weather Factors":"Unknown","divs":["Sighting Details I have been an amateur star gazer for 10 years and I'd like to think I know the early morning starts and planets well in the northern sky. At 5:45am CST I noticed a bright object in the eastern sky from my driveway. It was very dark because of fallout from Sandy (storm). Object was very bright, brighter than any of the morning planets and stars I have ever seen. I also live a long the final for Minneapolis International airport runway 30L and 30R. This was not landing lights, it was to bright and non-directional. I got in my car to go to work in St. Paul, Mn and was glancing up to see if the object was still there. I did a motion experiment at the gas station I fill up at 5 minutes from my house on the Highway 94. The object was moving very slowly east to west as best as I could tell. I arrived at work at 6:20am and used some low power binoculars to view the object from the parking lot in East St. Paul, Mn. I was able to resolve multiple light sources on the bottom of the craft and it was a round shape. The object was no longer visible at 6:55am CST. I do not know what I saw but it was unlike anything I have witnessed in the sky before."],"files":["/var/www/straped/mufon/html2text/43626.html.txt","/var/www/straped/mufon/org/43626.html"],"Latitude":"45.124731","Case Number":"43626","Date Submitted":"10/31/2012 08:50 UTC","Date of the Event":"10/31/2012 05:45 UTC"}