{"City":"Temple","Weather Factors":"None","trends":["There have been 10 other sightings in Temple","There were no other sightings in Temple on or around November 15th 1999"],"map":"<A HREF = \"http://maps.google.com/maps?q=31.098234,+-97.342782(4362)&iwloc=A&hl=en\"> mufon case (4362) map </A>","Date of the Event":"11/15/1999 10:30 UTC","Object Shape":"Square, Rectagular","Source":"MUFON","files":["/var/www/straped/mufon/html2text/4362.html.txt","/var/www/straped/mufon/org/4362.html"],"Date Submitted":"11/15/1999 10:30 UTC","Viewing Distance":"Unknown","Sighting Duration":"00:00:45","Latitude":"31.098234","divs":["Sighting DetailsI was on the south side of my house. I let my dog out to go pee. Then my dog started wimpering and was looking up at something and it was not me. I looked up to the position my dog was looking at and I saw the UFO silently flying over head. No sound was coming from what I could hear, but the stars were disapearing as the object flew over head and then that stars came back as it was flying by. Extreamly Large, Dark in color, noticed one forward portal or low light centered forward and one aft, and centered. UFO was coming from the west to the east in direction. Immediatly I called the Temple Airport about a craft flying there and asked if one was in flight. They had nothing on radar. Informed me to call Fort Hood. I called West Fort Hood Military Air Field, and they said nothing had been flying in the last couple hours, and the planes don't travel that rout. Then stated there was nothing on radar either and no flights in two hours. Then the person on the phone asked me what was my name, phone number, and address. I then said , \"No Thanks\" and hung up. Why were they wanting to know that info? I knew I saw something special and have told a few people about it thru the years. I'm also retired military, one of the best marksmen this country has produced and am highly decorated. I know what I saw, and it was not from here, unless there is something very secret going on and I just happen to see it due to an animals instinctive actions. Father Of A Fallen Hero, Gary W. Qualls www.Quallsmemorialfund.org"],"Country":"United States","Case Number":"4362","Object Features":"None","Disposition":"Unknown","Tags":"City","Summary":"High flying rectangular dark UFO, small light forward and aft, centered, no sound, Stars dissapeared as the craft flew overhead. My dog was the one to notice it and was wimpering looking upward. Unusual for an animal to do that then that's when I saw it.","Log Number":"US-02032006-0020","Region":"Texas","Longitude":"-97.342782","Object Flight Path":"Straight-line path"}