{"Object Features":"Other","Source":"MUFON","Latitude":"35.801616","Summary":"Stationary bright white object with spinning bands of blue, green, red-pink and golden lights rapidly rotating around the exterior. No sound. Blinked out.","Region":"North Carolina","files":["/var/www/straped/mufon/html2text/43622.html.txt","/var/www/straped/mufon/org/43622.html"],"City":"Raleigh","Sighting Duration":"Undisclosed","trends":["There have been 31 other sightings in Raleigh","There were no other sightings in Raleigh on or around February 8th 2012"],"Date Submitted":"10/30/2012 11:01 UTC","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Case Number":"43622","Weather Factors":"Unknown","Tags":"City","Disposition":"Unresolved","Object Shape":"Sphere","Log Number":"US-10302012-0018","Longitude":"-78.670907","map":"<A HREF = \"http://maps.google.com/maps?q=35.801616,+-78.670907(43622)&iwloc=A&hl=en\"> mufon case (43622) map </A>","Date of the Event":"02/08/2012 12:00 UTC","divs":["sighting detailsi walked out my front door in west raleigh, nc zip 27607 with the dog about 8 or 9 pm on february 8 or 9, 2012. it was a dark clear night so i looked up to see the stars, looking due east. i immediately noticed a stationary bright white object, much larger than any star, hovering just above the tree line (9 or 10:00 position on a clock) maybe 1\\2 to 3\\4 mile away (aspirin or penny size). it was clearly a solid object and had a slight whitish halo around it. it seemed internally lit (white) and had bands of colors spinning or pulsing rapidly around the exterior (blue, green, red-pink and golden yellow). it made no sound. i did not see another object in the eastern sky. i suddenly felt uneasy, called the dog and we went inside. i continued to look at it through the glass of the storm door. i called my husband to come and look; but he did not. i went to call him, get my camera and walked back to the door. it then just blinked out. i went outside to see if it had moved elsewhere in the sky but did not see it. i told a few friends about what i saw and have been looking for an explanation. i have researched phases of the moon, february night sky from the hubble site, satellites, lighted blimps and sculptures, archives of local newspapers and tv stations. i watched and re-watched ufo files and hunters programs looking for my object. i found some youtube videos that were similar but not exactly what i saw. someone from raleigh commented on one youtube that 6 months before the posting in august (also timing his sighting to early february) he had seen a stationary bright object with rotating colors that blinked out. i reviewed the mufon-nc site and recently found the ufo sightings site. just tonight i found ufo report id: 100396 (your mufon case 35595 of 2-7-12). three photos are posted. the second photo looks very much like my object, but 'mine' was larger\\closer. so, here goes, i am filing this report. please let me know if there is an explanation for the object. i am willing to answer your questions."],"Object Flight Path":"Stationary","Country":"United States"}