{"City":"Fort Myers","Log Number":"US-10312012-0012","map":"<A HREF = \"http://maps.google.com/maps?q=26.646288,+-81.869998(43634)&iwloc=A&hl=en\"> mufon case (43634) map </A>","Longitude":"-81.869998","Date Submitted":"10/31/2012 10:41 UTC","Case Number":"43634","Viewing Distance":"Unknown","divs":["sighting detailsfirst saw a bright orange orb over the trees. it then turned whitish yellow and continued to climb until it was way higher than any plane could fly. it was going slowly but kept ascending until we could not see it anymore. we followed it with our eyes for about 1min until we could no longer see it because it was so high. then we started to say it could be a plane or satellite when all of a sudden we saw another same orange glowing orb. it looked like it was fiery. we continued to watch it and noticed that not far from it was an airplane. this was good because we could compare and contrast the two. after seeing the airplane near the orb it was clear that this was absolutely something different. we watched the second orb for about 40 secs until it just seemed to fizzle out\\disappear. it did not ascend as high as the first one. this one simply faded out before it was not even as high as the airplane, while the other one climbed and we watched it until it was out of our atmosphere. no sounds except from the airplane."],"Object Flight Path":"Straight-line path","Source":"MUFON","Latitude":"26.646288","files":["/var/www/straped/mufon/html2text/43634.html.txt","/var/www/straped/mufon/org/43634.html"],"Region":"Florida","Country":"United States","Weather Factors":"Unknown","Summary":"Bright orange glowing orb flew for a long time and then vanished into space","Disposition":"Unresolved","Object Features":"Unknown","trends":["There have been 41 other sightings in Fort Myers","There were no other sightings in Fort Myers on or around October 31st 2012"],"Tags":"City","Object Shape":"Circle, Fireball","Sighting Duration":"Undisclosed","Date of the Event":"10/31/2012 09:15 UTC"}