{"Object Features":"Appendage(s)","Date of the Event":"10/05/2011 05:29 UTC","Object Flight Path":"Unknown","City":"Bakersfield","Case Number":"43636","Sighting Duration":"00:01:30","Disposition":"Unresolved","Region":"California","Source":"MUFON","Date Submitted":"11/01/2012 12:47 UTC","Object Shape":"Bullet, Missile, Disc","trends":["There have been 32 other sightings in Bakersfield","There were no other sightings in Bakersfield on or around October 5th 2011"],"Latitude":"35.355072","Weather Factors":"Unknown","Country":"United States","Longitude":"-119.000924","Viewing Distance":"Over One Mile","divs":["Sighting DetailsOn Oct 5, 2011 I was taking pictures of a rainbow after a storm. I like taking pictures of clouds and the sky in general, so when I saw the rainbow over my worksite against dark clouds, I thought it would make a nice photo. I was using just an average cell phone, no smart technology or an advanced cell phone. These pictures were taking early evening, 1729-1730 hours, with the sun west, behind me. At that time I didn't notice anything unusual in the sky except the rainbow. After taking the pictures I left the area to continue working. In the last photo you can see a golf cart that I use at work. Later, I would download the pictures onto my computer. This past weekend the cable was down so I was online looking at photos that I had taken. I came across these three photos and the first picture I noticed something high up in the rainbow. It looked like something shiny and straight. As I magnified the picture my jaw just dropped as the object came into view. Being ex-navy I have seen plenty of military aircraft, even Russian Bear Bombers flying overhead when I was on a Westpac cruise in 87. But this doesn't appear to be an aircraft or a helo! Just to the right of this craft are what appear to be three orbs that form a triangle. You can also notice there are two distinct structures protruding from the craft. Now I have no knowledge of how to clarify a picture online, so what I did with the picture (not shown in these photos) was to change the contrast and brightness and color tones to see if they craft might be part of the cloud structure and would wash away when applying these enhancers. Much to my amazement the craft and the orbs still appear and look to be solid objects in the sky. You will notice that there is no other object over the building or any discoloration in the clouds that look like this type of white streak in the sky. The second photo shows something now just above the building, but am sure it's not as close as it looks but some distance away. It appears to be similar to the craft seen in the first photo but I cannot get any clarity or see any structure on the object. But if you look in the same area where the craft was first seen, you can seen a similar streak in the sky but smaller, and orbs on both the left and right of this streak. The third pic you can see there's now an object closer to the rainbow similar to the object in the second photo. There is no clarity in that photo, similar to the second photo. In the second and third photo this object just above the building and then below the rainbow were not there when the first picture was taken. So I am not sure if the object is from the first photo or another object separate from the first craft. I don't believe the object is part of the cloud formation as it would have been there when I took the first photo. I have seen two other UFO's before, visually, but this is the first time ever taking a picture of what I believe, especially in the first photo, is a craft that does not appear to be of human design. Thank you for reading and if anyone can give these pictures more clarity I would love to see what they look like, especially the first picture."],"Log Number":"US-11012012-0001","map":"<A HREF = \"http://maps.google.com/maps?q=35.355072,+-119.000924(43636)&iwloc=A&hl=en\"> mufon case (43636) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/43636.html.txt","/var/www/straped/mufon/org/43636.html"],"Summary":"Rainbow UFO after storm"}