{"Object Shape":"Boomerang, Circle","Weather Factors":"Unknown","Country":"United States","Object Features":"Unknown","trends":["There has been one other sighting in Gilbert","There were no other sightings in Gilbert on or around October 31st 2012"],"Latitude":"33.923714","Disposition":"Unresolved","Sighting Duration":"04:15:00","Viewing Distance":"Unknown","City":"Gilbert","Region":"South Carolina","files":["/var/www/straped/mufon/html2text/43639.html.txt","/var/www/straped/mufon/org/43639.html"],"Summary":"Bright light appeared pulsating , moving all directions and hovering","Log Number":"US-11012012-0004","map":"<A HREF = \"http://maps.google.com/maps?q=33.923714,+-81.342175(43639)&iwloc=A&hl=en\"> mufon case (43639) map </A>","Date Submitted":"11/01/2012 12:17 UTC","Tags":"City","divs":["Sighting DetailsThis evening before dark went to an open field to film and photograph a UFO I have seen several times in the last week. The object appeared, lights pulsating in different colors. The object moved in all directions and would hover in mid air. Was low in the sky. Also witnessed a bright white star like object and a lot higher up in the sky. It moved from side to side and up and down, also hovered. When I returned home the object was very close to my home and lower in the air and had more moving activity. Instead of looking round, its shaped seemed to look like a boomerang and had bright white lights that looked separated. It would move down at an angle and then move straight across then stop. It also changes to more of a solid light. While watching this object, another one appeared moving the same with reddish and white light pulsating and flashing. They are somewhat distant from each other. When planes fly by the object, it does not move. The third object was only witnessed by myself. While writing this report I have been taking breaks to look at the objects outside. A fourth object has appeared and is flashing different colors and moving all directions and hovering. It is to the right in the sky to the third object. It moves at a fast pace then stops. The last two objects appeared in the last two hours."],"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Date of the Event":"10/31/2012 07:45 UTC","Case Number":"43639","Longitude":"-81.342175","Source":"MUFON"}