{"Object Flight Path":"Hovering then path","Object Features":"Unknown","Source":"MUFON","Region":"Kansas","Longitude":"-94.922447","Object Shape":"Other","Case Number":"43643","trends":["There have been 9 other sightings in Gardner","There were no other sightings in Gardner on or around October 31st 2012"],"Country":"United States","Viewing Distance":"101-500 Feet","Tags":"City","Disposition":"Unresolved","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.818091,+-94.922447(43643)&iwloc=A&hl=en\"> mufon case (43643) map </A>","Date of the Event":"10/31/2012 04:30 UTC","City":"Gardner","Weather Factors":"Unknown","Summary":"Reflected the sunlight in the same manner that a mirror would","Latitude":"38.818091","files":["/var/www/straped/mufon/html2text/43643.html.txt","/var/www/straped/mufon/org/43643.html"],"divs":["Sighting DetailsI was driving from Lenexa towards Princeton, Kansas with my son. We were on our way to meet somebody and were planning to be in Princeton at 5:00pm. At about 4:30, the sky had a few wispy clouds and the sun was bright. I noticed a spot in front of us and slightly to the left. It was large and very bright, in the same manner that a shard of glass against the sun is bright due to reflection. I wouldn't describe it as disk shaped, but rather an elongated upside down soup bowl. Several years ago, I was driving home from a trip in Virginia and I witnessed a very bad car wreck. When I first saw the car, it was upside down in the air in the oncoming lane. I was incredulous as I watched it bounce several times, before coming to a stop. I'm a Paramedic and I stopped. One occupant of the vehicle was life flighted out. It was one of those things you don't readily forget. While this object was clearly not a car, my first thought was the aforementioned car accident and the car's initial position in the air when I first noticed it. I wondered if maybe it was an aircraft that was having problems. However, while I initially thought that it was moving downward, it certainly did not appear to be moving quickly. As a result, I assumed that maybe it was a significant distance from us and I just wasn't in a position to be perceptive to it's actual speed or position. I asked my son if he could see it. Despite looking, he never was able to see it. Due to the sun, it blended in fairly well with the bright sky around it. After a period of time, about a minute, I decided that the object was not falling as I had initially thought. However, I couldn't determine any particlular direction of travel at all. I was attempting to watch the object and drive simultaneously without having an accident. (We were Southbound on I-35.) I was eager to get closer to it's location to determine what it was. After another minute, I realized that it seemed to be getting smaller. At that point I decided that it must have started moving away from us. From that point on, I started to have difficulty keeping track of it. It was, in fact, moving away from us and, therefore, becoming smaller and harder to watch. The reflective glare also began to wane. Intermittant periods of glare and outline followed the rest of the time, until the glare disappeared completely. After that, all I could see was a small, black dot, which I watched until I lost track of it. Shortly afterwards, a small, private plane flew over us. As a result, I could compare what I had just seen with the plane. The color, the ouline, the movement and direction were nothing alike. I wondered about the possibly of a passenger jet, but it seems like in order for a passenger jet or normal aircraft to elicit a reflection of that degree, I would need to be against the broad side, which was not the case, as it was moving away from me. Also, I watched it for a lengthy period and other conventional aircraft have always seemed, to me, that they move at a greater speed."],"Date Submitted":"11/01/2012 11:19 UTC","Log Number":"US-11012012-0008"}