{"Tags":"City","files":["/var/www/straped/mufon/html2text/43641.html.txt","/var/www/straped/mufon/org/43641.html"],"Case Number":"43641","Summary":"Sighting of Moon sized red circular object Parlin, NJ","Source":"MUFON","Weather Factors":"Unknown","Object Features":"None","Sighting Duration":"00:00:10","Date of the Event":"07/15/1955 12:00 UTC","divs":["Sighting DetailsMy mother who is 81 recently told me and my wife of a sighting my late father and her had back in the mid 1950's. My father worked in the chemical mixing area at the DuPont Film plant on Cheesequake Road in Parlin, NJ. As the story goes my mother came to pick up my father after his shift ended at midnight and they left the plant and were driving down Cheesequake Road toward Bordentown Avenue. All of the sudden they saw a large dull Red light at a 45 degree angle in front of there car. They thought it was the moon, but it was visible out of one of the other windows (She could not remember which one). The light only stuck around for about 10 seconds and then vanished. When I asked her how big the light was she said the size of the full moon, but reminded me the moon was seen out of another window and was not full at the time. I asked about the color and she said that it was just a dull red. That is all she wanted to say about what they saw. I never pushed it or proceeded any farther with the questioning. I wish I knew about this earlier when my father was alive so I could of asked him about the sighting. I am sure if there was anything more to add he would have told me. I asked my mother if she would be willing to answer questions in a phone interview and was told \"NO\". She is afraid she will be seen as a quack. I guess back when she was growing up you were taught to keep your mouth closed about things like this. I have already sent a copy of this report earlier this fall to Ken Pfiefer."],"trends":["There have been no other sightings in Parlin","This sighting has been favorited 1 time."],"Log Number":"US-11012012-0006","City":"Parlin","Longitude":"-74.321024","Date Submitted":"11/01/2012 05:13 UTC","Region":"New Jersey","Disposition":"Unresolved","Object Shape":"Circle","Object Flight Path":"Hovering then path","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=40.453073,+-74.321024(43641)&iwloc=A&hl=en\"> mufon case (43641) map </A>","Latitude":"40.453073","Country":"United States"}