{"Case Number":"4365","Source":"MUFON","City":"Midland","divs":["sighting detailsi need to know if anyone can give me confirmation on something i saw 1.23.06 at 22:35 central. small flashes of light very near to sirius in canis maj. it went on from the time i noticed it until around 22:45. i've contacted several ovservatories; only one replied and wasn't observing in that direction. it looked like some battle taking place far away. there may be a plausable explaination but in all my years of observing the heavens, i have never seen anything like it. the flashes of white light were located from my vantage point very close to sirius in the souther sky. they were faint but i was still able to see them with the naked eye in town. at first when i glanced up i thought they were on a jet but as i watched. they were random, not moving, like little explosions far away. very quick probably not lasting for more than .03-.05 seconds. i am 99 percent sure i also saw a green\\blue streak, very faint that looked about 1\\4 of an inch long. these were not meteors, not irridum flares, not like anything i have seen before. seriously, (no pun intended) it looked like something you would watch on tv like a space battle far away. my location is in west texas and i have witnesses. i checked the star charts and satellite locations and was unable to explain it."],"Region":"Texas","Object Features":"Unknown","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/4365.html.txt","/var/www/straped/mufon/org/4365.html"],"Latitude":"31.997346","map":"<A HREF = \"http://maps.google.com/maps?q=31.997346,+-102.077915(4365)&iwloc=A&hl=en\"> mufon case (4365) map </A>","Sighting Duration":"Undisclosed","Log Number":"US-02032006-0023","Date of the Event":"01/23/2006 10:35 UTC","Country":"United States","Tags":"City","Viewing Distance":"Over 1 Mile, Unknown","Summary":"Flashes of light around Sirius","Object Flight Path":"Stationary,Unknown","Weather Factors":"Unknown","Object Shape":"Flash, Unknown","Longitude":"-102.077915","Date Submitted":"01/23/2006 10:35 UTC","trends":["There have been 9 other sightings in Midland","There were no other sightings in Midland on or around January 23rd 2006"]}