{"Object Flight Path":"Path with directional change,Path then hovering","Case Number":"43655","Log Number":"US-11022012-0001","Region":"Illinois","Date of the Event":"11/01/2012 02:30 UTC","City":"Rockford","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/43655.html.txt","/var/www/straped/mufon/org/43655.html"],"Country":"United States","Object Shape":"Other","Summary":"Star like object with rotating colors that hovered long enough for me to take pictures and a video.","Date Submitted":"11/02/2012 12:22 UTC","Disposition":"Unresolved","Latitude":"42.272881","Longitude":"-89.086795","Source":"MUFON","Viewing Distance":"Unknown","Weather Factors":"Unknown","trends":["There have been 20 other sightings in Rockford","There were no other sightings in Rockford on or around November 1st 2012"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.272881,+-89.086795(43655)&iwloc=A&hl=en\"> mufon case (43655) map </A>","Tags":"City","divs":["Sighting Details At 2 o'clock in the morning I was awake, trying to find something in my bedroom. It was around that time when I decided to make a trip to the bathroom before continuing on with my search. Before I left the bathroom I looked out the window to see what the moon looked like. While standing there and looking out the window I noticed what I thought was an airplane coming from the southeast. There is the Rockford airport southeast of our town and one can see planes coming and going from that area. The object moving toward our town had white lights and a noticeable display of color pulsating around it. The object then stopped and hovered in the sky. For whatever reason I did not sense it to be a helicopter and it obviously was not a plane. Curiosity got the better of me so I hurried back to my bedroom and grabbed my camera that also has video capability and rushed out to the back of my yard. Whatever the object was, it was still in the air but had moved slightly to the west from it's original location. There was a tree that just lost all of it's leaves in front of it. It should be stated this object was way up in the air and I could not tell you how far it was from the ground or our town for that matter. Since I had just put snow fencing in the backyard I decided to stand in back of the fencing and not walk around the house and garages to see past the tree. After finding an open spot between the branches I started taking pictures of the object hovering in the sky. What happened next totally surprised me. The object I was looking at resembled a extra large star but with pulsating colors. The first still shot taken with my camera showed some kind of bluish form in the sky. The shots proceeding that one started out as a simple thick white line that resembles a short portion of an lightening bolt. Then the pictures started showing something that I nicknamed \"space worm\", with this worm like object being made up of sections of color. I am estimating this object stayed around for a good hour, allowing me to take still pictures and a couple videos of it. The chill of the morning started to set in with me so I left whatever it was to slowly disappear as the cloud coverage took over. The last two photos submitted show the original picture as I saw it from the camera and then taking this same picture and enlarged to show the detail of whatever it was up in the sky."]}