{"Country":"United States","Latitude":"32.840005","Summary":"Bright Orange Orb in Texas Sky","Log Number":"US-11022012-0003","Longitude":"-97.225613","files":["/var/www/straped/mufon/html2text/43657.html.txt","/var/www/straped/mufon/org/43657.html"],"Source":"MUFON","Date Submitted":"11/02/2012 12:54 UTC","Weather Factors":"Unknown","Object Features":"None","Object Flight Path":"Hovering then path","Viewing Distance":"101-500 Feet","Region":"Texas","Disposition":"Unresolved","trends":["There have been 5 other sightings in North Richland Hills","There were no other sightings in North Richland Hills on or around October 31st 2012"],"Tags":"City","Sighting Duration":"00:01:00","Object Shape":"Sphere","divs":["Sighting DetailsI was walking with my family, Halloween night doing the normal trick or trick event. I have recently made it a point to always watch the sky's to see if I see anything strange and sure enough I have. While walking down the street, which happened to be empty at that exact moment I noticed a bright orange light in the sky above me. I could tell immediately that it was something not usually there so I just stared at it, when I did, the light actually started to dull and slowly move across the sky. I really focused in on it, it was just far enough to be blurry. As it moved across it could see that it looked like the light because erratic and then the light went out and it could no longer be seen. To me, it seemed content shining in the sky till someone(me) actually saw it then it left. Maybe its narcissistic to assume it had anything to do with me but it was strange. It was very bright at first almost shining but it was orange and different than the color of the white stars. I could clearly see it move and seemed about as high as a helicopter flying. When it moved it moved slow, not fast at all and didn't travel very far before it vanished."],"Case Number":"43657","City":"North Richland Hills","map":"<A HREF = \"http://maps.google.com/maps?q=32.840005,+-97.225613(43657)&iwloc=A&hl=en\"> mufon case (43657) map </A>","Date of the Event":"10/31/2012 08:30 UTC"}