{"map":"<A HREF = \"http://maps.google.com/maps?q=42.865558,+-71.03833(43664)&iwloc=A&hl=en\"> mufon case (43664) map </A>","Weather Factors":"Unknown","Tags":"City","Latitude":"42.865558","Object Flight Path":"Hovering then path,Path then hovering","Object Features":"Appendage(s)","Sighting Duration":"00:02:00","Longitude":"-71.03833","divs":["Sighting DetailsMy boyfriend and I were driving in my Mustang from his house to mine on Rte. 108, Newton, NH. He points and says look at that light a second after I had noticed it directly straight ahead of us hovering over the treeline, it dipped down then shot straight up and then came toward us, it was about aspirin size, very bright white light. As I was watching this I pulled over in a wide driveway on the left side of the road still facing the direction the light was coming, it stopped as if it was performing just for us, it was a front row seat, if it had continued any further I would have had to look up to see it, it hovered there for several seconds and then the light went out and we could see nothing but black around it, no lights whatsoever and then a second later 7 horizontal lights came on nearly perpendicular to our view. In the photoshop sketch I made and attached, this is exactly what it looked like--the size in my perspective of vision. My boyfriend got my camera out of my purse got out of the car to take a video. He says the camera showed that it was recording, but there is no recording only two black still shots. He told me later that when he got out of the car that it sounded like a plane. When he got out of the car, as if on cue, the UFO flew off going directly over us out of my site from the front seat of the vehicle. My boyfriend got back in the car and said that it flew out of site. This is what he wrote later that night: I saw a sizzling bright white light too bright for anything in the sky dip down below the tree line stay there for about 40 seconds, then fly strait back up, split into a row of 5 lights (maybe 7) then fly verticaly over head, as it passed i could see it dark hull against the bluish sky and it was diamonds shape with the row of lights on the angle in fromt and 1 light in the back angle, I thought it might be a plane at that point but it was too huge"],"Summary":"Bright aspirin size light came toward us, I pulled my car over, light stopped in view out of windshield, hovered, light went out, 1 second blackness then 7 bright horizonal lights came on, hovered for a minute and then flew off.","Source":"MUFON","trends":["There has been one other sighting in Newton","There were no other sightings in Newton on or around November 1st 2012","This sighting has been favorited 1 time.",""],"City":"Newton","Region":"New Hampshire","Date of the Event":"11/01/2012 09:15 UTC","Log Number":"US-11022012-0010","Date Submitted":"11/02/2012 01:54 UTC","Case Number":"43664","files":["/var/www/straped/mufon/html2text/43664.html.txt","/var/www/straped/mufon/more/43664_submitter_file1__UFO.jpg","/var/www/straped/mufon/org/43664.html"],"Country":"United States","Viewing Distance":"501 Feet - 1 Mile, Unknown","Disposition":"Unresolved","Object Shape":"Bullet, Missile, Diamond, Square, Rectagular"}