{"Latitude":"37.676546","City":"Daly City","Longitude":"-122.488558","Tags":"City","Object Flight Path":"Path with directional change","Date of the Event":"11/02/2012 09:25 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.676546,+-122.488558(43673)&iwloc=A&hl=en\"> mufon case (43673) map </A>","trends":["There have been 16 other sightings in Daly City","There were no other sightings in Daly City on or around November 2nd 2012"],"Case Number":"43673","Disposition":"Unresolved","Object Features":"Wings","Sighting Duration":"00:00:15","Date Submitted":"11/03/2012 01:32 UTC","Country":"United States","Object Shape":"Boomerang, Triangle","Log Number":"US-11032012-0002","Source":"MUFON","Region":"California","Summary":"was in back yard,saw a falling star.then a triangle craft with lights flew over my house.","Viewing Distance":"501 Feet - 1 Mile","divs":["sighting detailsi went outside in the back yard to smoke. i looked up at the stars, it is a fairly clear night. a falling star came straight down to the west.so i waited for another to fall.within about ten seconds from my left to right looking to the west, a triangle shaped craft with lights{i think 7 } flew in a north westerly direction.i was standing close to the house so it appeared from behind several roofs. the first thing that came to mind was wow, it's true!there was no sound. as it flew away i saw the \"wings\" expand outward, i thought, why is it doing that? then i saw a commercial aircraft coming in on its flight path to land at sfo.then i thought i wonder if those pilots will see it.it appeared bigger than a normal commercial aircraft.as there paths were about cross it seemed to become invisible. that might be because of distance to me,or a cloud, or it really did become invisible. i waited for the commercial craft to pass over head, and i could hear its engines.to tell you the truth i feel very lucky to have witnessed this craft.unless the u. s. air force is about to reveal that we have had these type of crafts for some time.i am also thinking why was it so in the open for any one to see. this is about 9:25 p.m. 11\\2\\12.i would say it was flying at the same height as most aircraft going up the coast.i know what i saw, and it was real."],"files":["/var/www/straped/mufon/html2text/43673.html.txt","/var/www/straped/mufon/org/43673.html"],"Weather Factors":"Unknown"}