{"Latitude":"28.084302","Source":"MUFON","Weather Factors":"Unknown","Tags":"City","divs":["sighting detailsi was driving north on county road #1 in dunedin\\palm harbor area to work. i was thinking as i drove,\"what a nice morning. i wonder where the moon is.?\" i then looked out my open drivers' side window,and looked up to my left,there was the moon. i thought,\"wow,it would make a great picture. it would be great to see a ufo right about now.\" but,something like that doesn't just happen.\" then i again looked right up at the moon,to my astonishment,a very bright spherical object with a pinkish hue around the edges appeared to fly off the surface of the moon!!!it was ascending slightly at the 11 oclock angle. i about flipped out! i saw this for about 3 sec,glanced at the road again ,then right away looked up,it was still there,ascending about 11oclock,after about 2-3 sec,as i'm looking right t it,it disappeared instantly! that was it,i was stunned and elated at what i had just observed! also,upset that i couldn't have obtained a picture as i was driving at the time. i tried to find my cell phone in my purse while i was driving but couldn't find it. when i was stopped at the light at alderman and us 19.i tried to call my work,but my cell phone battery said\"low battery.' so i just put it down. i did call another nurse at my work place in st. pete to tell her of this incident and asked her to tell another co-worker friend of mine about it as well. i called teri lynge that evening to report it to her,we spoke very briefly. i did look at the mufon website in order to report it,but when i clicked on the \"report ufo\" icon,a blank screen came up,no cursor either. i tried twice more to click on it,but the same blank screen came up. i was very tired by then and had to go to sleep as i get up at 0547am in the morning. however,i am psyched beyond all measure to have seen this,i believe it happened because my mind is open!!!! for this."],"Date Submitted":"11/03/2012 03:28 UTC","Case Number":"43676","Longitude":"-82.754713","Sighting Duration":"Undisclosed","Region":"Florida","Log Number":"US-11032012-0005","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Viewing Distance":"Unknown","Date of the Event":"11/01/2012 07:40 UTC","City":"Palm Harbor","Object Shape":"Sphere","Country":"United States","Object Features":"Other","files":["/var/www/straped/mufon/html2text/43676.html.txt","/var/www/straped/mufon/org/43676.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=28.084302,+-82.754713(43676)&iwloc=A&hl=en\"> mufon case (43676) map </A>","trends":["There have been 8 other sightings in Palm Harbor","There were no other sightings in Palm Harbor on or around November 1st 2012"],"Summary":"A BRIGHT WHITE FLOURESCENT SPHERICAL SHAPE ufo WITH PINK HUE COMPLETELY surrounding it flew directly off moon surface"}