{"Weather Factors":"Unknown","Region":"California","Object Shape":"Other, Unknown","Latitude":"32.800699","Viewing Distance":"Over One Mile","Date of the Event":"10/31/2012 08:50 UTC","Summary":"October 31, 2012","Country":"United States","City":"El Cajon","Longitude":"-116.929981","Date Submitted":"11/03/2012 03:23 UTC","trends":["There have been 41 other sightings in El Cajon","There were no other sightings in El Cajon on or around October 31st 2012","This sighting has been favorited 2 times.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=32.800699,+-116.929981(43674)&iwloc=A&hl=en\"> mufon case (43674) map </A>","Source":"MUFON","Case Number":"43674","divs":["Sighting DetailsMe and my sister were on our way home from a piano class on Wednesday October 31, 2012 (Halloween night). I was driving east on freeway 8 around 8:50pm. As I was approaching Main St. exit I saw a straight line of blue lights in the sky. To begin with, I've had many UFO sighting. I always look up at the sky especially if there are any obvious strange lights. I had to look twice when I saw these lights. I had to quickly pull over on the side of the freeway (after almost crashing because of the sighting). And for safety reasons it was the best thing to do. I started to record this event. I sat in my car for about an hour and fifteen minutes. As I observed these lights I noticed at first there was almost a pattern to the lights. They were blinking on and off. Then I noticed this line started to move altogether side to side but very quietly. Watching it move was a different experience. I cannot explain it. There was absolutely no noise. But above these lights I saw a small round object. This object was very small compared to the line of lights that i had seen. This object had no lights and no noise. It was just there right above the line of lights. My first reaction to seeing these lights is, \"It's a UFO it has to be.\" As it started to become foggy I was no longer able to see the small object but the lights remained put. My camera was able to capture a fair image of this event. I do not know what the distance was from where I was at to where the lights were. From what I saw it was a good view and these lights were pretty high in the sky. My sister being my witness was also able to identify what I was seeing. What I have on video are my true feelings. I hope I am not mistaken. Thank You"],"Log Number":"US-11032012-0003","Disposition":"Unresolved","Object Features":"Unknown","Tags":"City","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/43674.html.txt","/var/www/straped/mufon/org/43674.html"]}