{"Date of the Event":"10/29/2012 12:00 UTC","Date Submitted":"11/02/2012 11:38 UTC","Log Number":"US-11022012-0016","Country":"United States","Object Shape":"Fireball","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Summary":"I was possibly abducted after seeing a small red star I thought was pretty I was laying looking out window I sat up itfell like a shooting star","Source":"MUFON","Object Flight Path":"Hovering then path","Longitude":"-97.604397","Latitude":"38.854854","Weather Factors":"Unknown","trends":["There have been 8 other sightings in Salina","There were no other sightings in Salina on or around October 29th 2012"],"files":["/var/www/straped/mufon/html2text/43671.html.txt","/var/www/straped/mufon/org/43671.html"],"Tags":"City","Case Number":"43671","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=38.854854,+-97.604397(43671)&iwloc=A&hl=en\"> mufon case (43671) map </A>","divs":["Sighting DetailsI was laying in bed looking out my window when I notice a little red star for some reasone I found pretty. I propped myself up on one elbow hoping to get a better look when I suddenly fell. I had just enough time to think \" wow I am lucky to see another shooting star when everything went black and I couldn't move. No kitchen lights no light from window no matter how much I blinked. On a side note I have suffered from sleep paralysis since I was a kid. I am used to it and it does not scare me anymore. I have never seen aliens or ufos no matter how much I wished during s.p. This time I was awake, couldn't see and was terrified. Before this I was obsessed with ufod, aliens, abductions. I had bought a book on how to contact aliens but couldn't read thru it do to boredom. I hadn't read it in a month. So back to where we were in my panicked paralyzed state I kept thining over and over (I couldnt talk) \"I changed my mind! Im not ready!\" I felt floaty but am not dure if I went anywhere. I felt myself back on the couch and able to see a few seconds later move. I was still panicked and got up for the day around four. No clue if I went anywhere or if I am missing time but I am suddely scared of ufos and aliens and pics of them. I didn't have any strange marks or anything but it has left me terrified. Oh and there were no stars in the sky only clouds"],"Region":"Kansas","Viewing Distance":"Unknown","City":"Salina"}