{"Disposition":"Unresolved","Log Number":"US-11032012-0009","Latitude":"43.292716","divs":["Sighting DetailsI have started to report this before, but changed my mind and deleted it. It is on my mind all the time and would just like a reasonable explanation. My husband and I have a campsite on shore of Lake Ontario. I received a camera for Christmas last year so I could take pictures of Eagles and other wildlife near our camp. I carry the camera with me all the time and take pictures in succession one after another in case some don't come out and I can delete them when I download them. We were watching a line of storms moving across the lake. Some of the storms were producing waterspouts and I wanted to get pictures of them. It was about 8am and I took camera and went outside. I saw what I thought was a ship. We don't see ships that large as we are not on the shipping lanes. I thought perhaps the ship was there because it was trying to avoid the storms, but it eventually turned and went into the worst of them. I took pictures of it and tried to get an angle that would show the storms in background. I just thought it would make a great picture. When I went back in my husband asked me if I got pictures of the ship and wasn't it amazing how the sunlight reflected on it. The light seemed to be reflecting on all sides. It was just glowing. I thought it was strange the way it looked and when I looked at pictures on my computer they really looked strange. We were facing north and sun would be on our right. The whole object was illuminated and showed no signs of being affected by the rough water or storms. It also looked very square which didn't make sense for a ship or barge. It was traveling east-north east and then turned north and just disappeared. Maybe it just got too far away. I am not sure. I hope I am not wasting your time and will include photos that I can. Thank You . I am not crazy! I have more pictures than these if you would like them. As an after thought Oswego,NY is just to the east."],"Summary":"Over lake Ontario during line of storms and waterspouts","Case Number":"43681","Source":"MUFON","Region":"New York","map":"<A HREF = \"http://maps.google.com/maps?q=43.292716,+-76.806348(43681)&iwloc=A&hl=en\"> mufon case (43681) map </A>","Object Features":"Unknown","Country":"United States","Object Flight Path":"Path with directional change,Unknown","Sighting Duration":"Undisclosed","Date of the Event":"09/24/2012 12:00 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/43681.html.txt","/var/www/straped/mufon/more/43681_submitter_file1__waterspoutsoverlake005.JPG","/var/www/straped/mufon/more/43681_submitter_file2__waterspoutsoverlake013.JPG","/var/www/straped/mufon/more/43681_submitter_file3__waterspoutsoverlake018.JPG","/var/www/straped/mufon/more/43681_submitter_file4__waterspoutsoverlake018.JPG","/var/www/straped/mufon/more/43681_submitter_file5__waterspoutsoverlake032.JPG","/var/www/straped/mufon/more/43681_submitter_file6__waterspoutsoverlake024.JPG","/var/www/straped/mufon/more/43681_submitter_file7__waterspoutsoverlake017.JPG","/var/www/straped/mufon/org/43681.html"],"trends":["There have been no other sightings in Wolcott","This sighting has been favorited 1 time."],"Viewing Distance":"Unknown","Longitude":"-76.806348","Date Submitted":"11/03/2012 06:37 UTC","Tags":"City","City":"Wolcott","Object Shape":"Square, Rectagular"}