{"Region":"Michigan","Disposition":"Unresolved","Date Submitted":"11/03/2012 08:06 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.78113,+-85.140814(43683)&iwloc=A&hl=en\"> mufon case (43683) map </A>","files":["/var/www/straped/mufon/html2text/43683.html.txt","/var/www/straped/mufon/org/43683.html"],"Source":"MUFON","Log Number":"US-11032012-0011","divs":["Sighting DetailsMy husband was coming home and saw the first object which looked like a big red, yellow and blue flaming ball coming from the northwest. As he drove through town he saw a man standing outside his car looking at the object on main street. He called me and told me to go out and look and I saw a big red ring with a yellow center pulsing cross over my house then arc to the south west over Jordan lake and fade out. As I was going to go in I noticed a second one coming from the north east and called my daughter on the other side of town. She came out and saw the big red light but then the trees blocked her sight. My husband was now home and my mother came outside we saw the red light fade out and then we could see a big grey circle with a solitary red light going around the outter edge. The light finally stopped on one spot then the object faded out going south over the lake. Niether made any noise and they were way too fast to be a balloon. The fading effect might have been from entering clouds."],"Case Number":"43683","Date of the Event":"11/01/2012 07:00 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Country":"United States","trends":["There have been 3 other sightings in Lake Odessa","There were no other sightings in Lake Odessa on or around November 1st 2012"],"Object Features":"None","Summary":"2 large redlights with yellow centers that pulsed and made an arc over town","Weather Factors":"Unknown","Object Shape":"Circle, Disc, Fireball, Other","Latitude":"42.78113","City":"Lake Odessa","Object Flight Path":"Path with directional change","Longitude":"-85.140814"}