{"Country":"United States","City":"Detroit","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Case Number":"4368","Object Flight Path":"Hovering then path","Object Features":"None","Date of the Event":"05/04/1965 12:00 UTC","Sighting Duration":"Undisclosed","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.336997,+-83.042164(4368)&iwloc=A&hl=en\"> mufon case (4368) map </A>","Log Number":"US-02032006-0026","Region":"Michigan","Weather Factors":"Does Not Apply","Object Shape":"Sphere","Disposition":"Unresolved","Date Submitted":"05/04/1965 12:00 UTC","divs":["Sighting Detailswe came out of a store about 3pm and looked up and saw a ufo, it was like looking at a mountian from a distance ( u could tell it was huge ) if u held a beach ball at arms lenthg it would just cover the object it had no markings at all, and sat in the sky with no sound or power exhust of any kind. i nuged the guy to my left with my arm so as not to let the ship see and said in a very low voice, go get somebody and before the guy to my left could turn around to go get someone the ufo shurderd and flew away at a 30 degree angle with unreal speed and gave the inpression that it dispeared i think i followed with my eyes as far as i could, until it became a dot in the distance then i lost it. it was a round and siver, it was metal with no seams or markings like a steel ball, it had to be hunders of meters from top to bottom and it was powered, the way it shurdered was like a jet engine trimbles when it is powered up and the aircraft is not moving forward. , it could see us and hear us,it gave the inpression that it was maned, its leaving the area was not a mistake, it left as i told clint to go get somebody. the three of us will never forget it, even all these years later. one of the men that saw the ufo is a fireman for detroit and the outher is a network administrator. i am a electronice and computer tech and a network admin."],"Longitude":"-83.042164","trends":["There have been 56 other sightings in Detroit","There were no other sightings in Detroit on or around May 4th 1965","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/4368.html.txt","/var/www/straped/mufon/org/4368.html"],"Summary":"three of us saw a ship, very large no markings and no sound, it was still and hovering in the sky but it was so big and siver in color, it moved with a motion that i have never seen in my life time, all three of us saw it and the size of the object huge","Latitude":"42.336997"}