{"Summary":"10 Orange/red UFOs sighted. Moving west, sighted to the south/southwest.","Object Shape":"Fireball, Teardrop","map":"<A HREF = \"http://maps.google.com/maps?q=38.791748,+-90.509604(43691)&iwloc=A&hl=en\"> mufon case (43691) map </A>","Viewing Distance":"101-500 Feet, Unknown","Sighting Duration":"Undisclosed","Longitude":"-90.509604","Log Number":"US-11042012-0006","files":["/var/www/straped/mufon/html2text/43691.html.txt","/var/www/straped/mufon/org/43691.html"],"City":"St Charles","Source":"MUFON","Object Features":"Unknown","Latitude":"38.791748","Disposition":"Unresolved","Case Number":"43691","trends":["There have been 12 other sightings in St Charles","There were no other sightings in St Charles on or around November 3rd 2012"],"Object Flight Path":"Straight-line path","Region":"Missouri","Date Submitted":"11/04/2012 10:07 UTC","Tags":"City","Weather Factors":"Unknown","divs":["Sighting DetailsI was in the basement, checking my fantasy football team. It was getting late, around 2130, and i decided to go up to bed. Before i did, i stepped out back on to the deck to have a smoke. As soon as i stepped out, i noticed 7 orangish glowing, baseball size UFOs flying in a formation. I at first thout it was a plane but there was no noise at all. There were Four in the front and three behind. I started to beat on the wall of the house to wake up my girlfriend to come and see. As she was coming out, i noticed three of the same looking UFOs moving in a strait line, one behind the other formation. She seen those but not the front 7. As they were moving west, they dwindeled out to the point where we could no longer see them. That was the last i seen of them. Ive seen combat, watched friends of mine die at my feet, and never have been afraid of anything or any challenge but this almost made me piss my pants. Not knowing what the hell it was and always hearing about this sort of thing, kind of makes me not want to beleive but i know what i saw and i will stand by my word, no matter what. I know what i saw and i know im not losing my mind."],"Date of the Event":"11/03/2012 09:49 UTC","Country":"United States"}