{"Source":"MUFON","City":"Elk Grove","Object Features":"None","Summary":"Pulsating Orbs over shopping area","Date Submitted":"11/04/2012 04:42 UTC","Log Number":"US-11042012-0012","files":["/var/www/straped/mufon/html2text/43697.html.txt","/var/www/straped/mufon/org/43697.html"],"Date of the Event":"11/03/2012 12:00 UTC","Longitude":"-121.363148","Tags":"City","Viewing Distance":"21-100 Feet","divs":["sighting detailsi was leaving a store around 8pm and looked up for the moon. i noticed orange\\yellow pulsating lights ascending from the north\\east part of the sky. first i thought they were the street lights but there were too many of them and they were forming patterns, there were about 12 orange\\yellow orbs. they were orange in the middle and yellow around them. they looked like pulsating balls of energy. i watched them for for five minutes across the street before calling my wife. i told her to go outside and look east but her view from our home was obstructed and too far away. they formed into two circle patterns and then broke away from each other and then reformed into two circles again. i watched them for another 5 minutes and came home. i grabbed the video camera and went back to the store, all but two had left. i tried to record them but they wouldn't show up on the camera. and then a few minutes later they both extinguished. also when i arrived back for the second time their was an ambulance and firetruck in the parking lot where i had seen them and the paramedics had loaded someone into the ambulance. the orbs had been right over where the ambulance and firetruck were and i'm not sure if that was just a coincidence. my feeling of the objects was just amazement and awe."],"Case Number":"43697","Weather Factors":"Unknown","Country":"United States","Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.417589,+-121.363148(43697)&iwloc=A&hl=en\"> mufon case (43697) map </A>","Object Shape":"Sphere","Disposition":"Unresolved","trends":["There have been 19 other sightings in Elk Grove","There were no other sightings in Elk Grove on or around November 3rd 2012"],"Region":"California","Latitude":"38.417589"}