{"Longitude":"-121.969325","Date Submitted":"11/04/2012 02:11 UTC","Weather Factors":"Unknown","Latitude":"37.781307","files":["/var/www/straped/mufon/html2text/43690.html.txt","/var/www/straped/mufon/org/43690.html"],"Log Number":"US-11042012-0005","Object Flight Path":"Stationary,Path then hovering","Sighting Duration":"Undisclosed","trends":["There have been 5 other sightings in San Ramon","There were no other sightings in San Ramon on or around October 31st 2012"],"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Object Shape":"Disc","Disposition":"Unresolved","Summary":"I thought it was plane landing on freeway but it stopped and hovered as I passed it.","Case Number":"43690","City":"San Ramon","Date of the Event":"10/31/2012 10:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.781307,+-121.969325(43690)&iwloc=A&hl=en\"> mufon case (43690) map </A>","Tags":"City","Object Features":"Patterned Surface","divs":["sighting details10\\31\\12 i was headed northbound on 680 through san ramon ca between alcosta and bollinger exits. at 10:10pm. i had noticed a white, red and blue lights of what i thought was a plane. i had not seen a flight path right over freeway so i wondered if they were going to do an emergency landing. as i got closer i was shocked to realize that i was passing the object and could now see the belly if it. it had five lights in a pentagon formation that lit up the underside. it looked as if it were stopped right above san ramon valley blvd that runs parallel to freeway. it was very low, a little above the tree line. as i was driving i had to keep my eyes on the road but kept glancing at it. i decided to get off at exit exit and flip around. as i neared exit i looked back and could only see 3 white lights now that faded quickly. it was gone before i could turn around. i called my aunt then and told her what i saw. there was light traffic at the time yet at least five cars got off on same exit as i did but they all turned the other way. i remember thinking at the time i saw it if anyone in the other cars had seen it as well."],"Region":"California","Country":"United States","Source":"MUFON"}