{"files":["/var/www/straped/mufon/html2text/43699.html.txt","/var/www/straped/mufon/org/43699.html"],"Object Shape":"Fireball, Oval","divs":["Sighting DetailsAround 8pm on November 3rd, my mother called me and said that there was an object with red light along the outside and a white light in the center. I ran outdoors but didn't see anything and came back in. Less than five minutes later, she calls again saying there is another one. My husband, son, and I came outside and in the east going north to south was an orange glowing object. It looked like an orange ball of fire about the size of a pea or pencil erasure. At the bottom, in the center, it was yellow. It wasn't a light, it was a glowing object. Outer edge seemed to undulate a bit. As it moved to the south, it seemed like it was shrinking or going out. It moved behind the trees in my yard and I lost sight of it. A few seconds afterwards, I saw a pinpoint white flash, like a star. This was a very cloudy night, you couldn't see any stars or the moon. This object made no noise. I didn't hear plane or jets far off, only traffic on the roads. My mother lives less than a half a mile east of me and this object flown right betwwen us. (From what my mother said, it was almost right over her). I'd say the sighting lasted a minute or two. I'd guess the speed was slower than a the commercial jets I see around here. My mother said she sent you a report of what she saw, so I won't go into her sighting. My feeling at the time were excitement. This wasn't scared, just intrigued. My son hasn't stopped talking about it. Side Note: I checked the National UFO Reporting Center website for a simular sighting. There was one few about a month ago in Ionia, which is less than twenty miles North of us, going in the same direction. Also, I'm reluctant to add this since it sounds crazy. I told my mom I was going to think at it and she said she would too. Then I hung up and the object started to dim I little while later. I'm sure this means nothing, but you asked about our reactions."],"Summary":"Large orange and yellow fireball moving south over Lake Odessa.","Date of the Event":"11/03/2012 08:00 UTC","Object Features":"None","Longitude":"-85.134048","Object Flight Path":"Straight-line path","Country":"United States","Tags":"City","Region":"Michigan","Latitude":"42.782317","Date Submitted":"11/04/2012 05:28 UTC","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","City":"Lake Odessa","Case Number":"43699","trends":["There have been 3 other sightings in Lake Odessa","There were 2 other sightings in Lake Odessa on or around November 3rd 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.782317,+-85.134048(43699)&iwloc=A&hl=en\"> mufon case (43699) map </A>","Log Number":"US-11042012-0014","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Weather Factors":"Unknown"}