{"map":"<A HREF = \"http://maps.google.com/maps?q=36.123716,+-115.166896(4369)&iwloc=A&hl=en\"> mufon case (4369) map </A>","Date Submitted":"05/18/2005 07:20 UTC","Object Features":"Unknown","Latitude":"36.123716","Longitude":"-115.166896","Weather Factors":"Unknown","Date of the Event":"05/18/2005 07:20 UTC","Region":"Nevada","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Disposition":"Insufficient Data","divs":["Sighting DetailsI was driving north on I-15 just entering Vegas. At this point on the freeway you can veiw the city skyline from a elevated vantage. Looking at the entire city I saw two lights lights above the city coming together from the right and the left at high speed. At the point they met each other they both spun in a tight circle 3 0r 4 times then broke away. One light flew to the right and dove to the ground as if it was landing at nellis. Durring this time the other object seemed to just sit still (as if it was waiting for the first) then BAM! it DARTS to the right and followed the path of the first object to the ground. At first I thought fighter jets due to the speeds. But when I saw them come togeter and SPIN! a circle then seperate from each other as the did, I KNEW this was not normal. After they were gone I looked at the cars driving next to me to see if they noticed it as well. unfortunatly at 65 or 70 miles per hr you can't just ask the driver next to you a question! The only reason I lost sight of them is because it looked to mee they landed. But these were not jets. No Plane can do what I saw. No way!!"],"files":["/var/www/straped/mufon/html2text/4369.html.txt","/var/www/straped/mufon/org/4369.html"],"Source":"MUFON","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Tags":"City","Summary":"FLYING LIGHTS","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around May 18th 2005"],"Country":"United States","Log Number":"US-02032006-0027","City":"Las Vegas","Viewing Distance":"Over 1 Mile, Unknown","Case Number":"4369"}