{"trends":["There have been no other sightings in Coldwater","This sighting has never been favorited."],"Object Features":"None","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","City":"Coldwater","Log Number":"US-11042012-0020","Date of the Event":"09/10/1995 12:00 UTC","Viewing Distance":"21-100 Feet","Object Flight Path":"Stationary","Case Number":"43705","Source":"MUFON","Latitude":"40.479747","Summary":"Nightime, Red light hovering at tree tops, not in the woods, beside the woods.","Object Shape":"Sphere","Date Submitted":"11/04/2012 10:05 UTC","Longitude":"-84.687654","divs":["Sighting DetailsI was driving home from work with a friend in 1995. I worked in Berne, Indiana and she worked in Portland, Indiana. We both lived in Celina, Ohio and had taken the county road from Jay County, Indiana that turned into Ohio Highway 219 in Mercer County, Ohio. There is a small series of curves just past the State Line and we had crossed that, we were heading straight east. This was about midnight and it was clear. I had slowed down to go through the curves because there is a hill at these curves. As I was starting to speed back up, I noticed to the right beside a small patch of woods a red light hovering at the height of the trees. It was not in the woods, but beside it. We seemed to be very close so I stopped the car to look at it. My friend rolled down her window to get a good look at it, what we saw was a red light hovering. It was not moving nor was it making any sound. I looked for lines or a craft but did not see any. It was just a red light that only seemed to blink just a little bit. From where we were at, still on the road, this object was probably 20 feet away at the same level as the tree tops. There was no movement, there were no sounds, not even from the animals. We had stopped for a few minutes to gauge what we were seeing, but I had never seen anything like this before. I had grown up in the area about four miles south of where we were at that moment. Growing up in the country as children you stay outside late at night so this was definitely something I had never seen before. This road was very familiar to me, I had driven it many times in the day and nighttime. After looking at it for a few minutes I got a strange sensation, as though something were warning us to leave. I said to my friend \"I think we better leave now\". I have seen many things in my life that can be called strange, so I was not specifically frightened of it, until I felt as though I was being warned. There were no animal noises at all, usually at that time you could hear crickets or cows, because it was farm country. We heard nothing, no sounds whatsoever. I did not see any craft or tethers or anything to indicate it was mechanical. It was just a round light about the size of a basketball from where we were sitting. It never moved at all. After the warning feeling, I drove on, still heading east toward Ohio Highway 49, and turned north. I have never seen it again. I never forgot that incident since 1995."],"files":["/var/www/straped/mufon/html2text/43705.html.txt","/var/www/straped/mufon/org/43705.html"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.479747,+-84.687654(43705)&iwloc=A&hl=en\"> mufon case (43705) map </A>","Region":"Ohio","Tags":"City","Disposition":"Unresolved"}