{"Case Number":"43708","map":"<A HREF = \"http://maps.google.com/maps?q=28.478617,+-81.449775(43708)&iwloc=A&hl=en\"> mufon case (43708) map </A>","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Disc, Oval","Longitude":"-81.449775","Disposition":"Unresolved","Date of the Event":"11/04/2012 09:40 UTC","Weather Factors":"Unknown","Country":"United States","City":"Orlando","trends":["There have been 112 other sightings in Orlando","There were 2 other sightings in Orlando on or around November 4th 2012"],"Latitude":"28.478617","Object Features":"Unknown","divs":["sighting detailsat approximately 9:40 p.m on november 4, 2012, i merged onto interstate 4 south in orlando, florida at exit 82. shortly after merging with traffic i witnessed horizontal light(s) in the sky approximately 1\\2 to 1 mile ahead of our vehicle. we sped up to get closer to the light(s). the object was not a plane. the object was not a helicopter. the object was flying directly over interstate 4 at the same pace as the traffic below -- approximately 70 mph, and in the same direction. there were approximately 8 square lights emanating from the object. periodically one or more of the lights would turn off and then turn back on a few seconds later. we never got close enough to determine if the object was disc shaped. we followed the object for twenty minutes. during this time period, the object moved left and right and flew on both the north and south sides of interstate 4. however, when the object moved left or right, the lights remained horizontal. the object did not bank or turn. instead, it remained flat, so to speak. when we lost view of the object, it was several miles ahead of us but it had not accelerated swiftly. it simply started moving faster than the traffic below. my son, who is 12 years old was seated in the front of the car. he attempted to video the object with his iphone but the video is very hard to see. i have been a lawyer here in florida for 18 years. i know about the difficulties with eyewitness observations. we really saw this. it was not a plane. it was not a helicopter. it was flying."],"files":["/var/www/straped/mufon/html2text/43708.html.txt","/var/www/straped/mufon/org/43708.html"],"Date Submitted":"11/05/2012 12:12 UTC","Source":"MUFON","Log Number":"US-11052012-0001","Tags":"City","Summary":"Witnessed UFO flying southwest over Interstate 4 in Orlando. Florida","Region":"Florida","Object Flight Path":"Straight-line path,Path with directional change"}