{"Country":"New Zealand","Disposition":"Unresolved","Object Shape":"Sphere","Summary":"Light orb that varies in size seen over Northhead for the past several days. No strobe lights, unorthodox movement.","divs":["Sighting DetailsFirst sighting - Was looking out of my bedroom window at the top of North Head mountain, more of a volcanic hill than a massive mountain. I immediately noticed an orb with about the brightness of a headlight stationary, maybe 30 metres above the top of the hill. I thought it was strange for a star to be there, as I had never noticed one before, and it was completely stationary so I ruled out plane or helicoptor straight away. While I was staring at the light it did something strange, it dropped behind the horizon of the mountain, not too quickly but fast enough for me to know something was very weird. I kept staring at the mountain, confuzed when suddenly it reappeared, lower than it was before just above the hill to the left of its original position. So at this point I had seen it stationary for about a minute, drop down, move to the left and rise up again. I then called my brother who was also in the room to come and check this thing out, but when I returned to to where it was a second ago it was gone. My Brother and I kept staring and then it popped out again from behind the mountain, and started to move to the left very slowly until it was out of view. I had a strange feeling after I saw this, something akin to anxiety like the light I was looking at sort of \"knew\" I was there.. very weird. Second sighting, 2 days later - Since I first saw the object I had been looking at the same area of sky every night, and last night was Guy Fawkes, a fireworks celebration when I saw it again. I'm not an idiot not would I mistake a firework for something that moves and changes like what I saw. Anyway I was looking at the same patch of sky, over the hill having a ciggarete when I saw a small orb, about half the size of the first. I saw it hovering over the mountain, just like the other light. After observing that it was clearly not moving I called my Brother again to see. He looked out and we both observed the thing just hanging there. After about 30 seconds it started to move, in semi-decending path to the left. This alarmed us as I had already ruled out convential flying things like planes and helicoptors for many obvious reasons. The orb was almost out of sight, so I grabbed my camera and ran to another room where I could look out of the window and see it for a few more seconds until it was out of view, I pointed my camera at it and recorded literally 2 poor quality seconds of the light before it went behind a tree. We were both baffled and kinda shocked to say the least. About 45 minutes later, I was still kinda riled up and I couldn't stop looking out of the window in hopes of it's return. I poked my head out of the window to look again and saw a very bright orange orb in the sky, to the left of the position where I saw the objects the other 2 times. This thing was brighter than the brighest stars around, was very high up and did'nt move. I watched it for a good 1 minute puzzling over what it was, or if it was just a star that I never usually paid attention too, then a really weird thing happened. The super bright orange light dimmed, and the smaller object or something identical was revealed, like it was turning off uneeded lights, or engines. The little light then travveled across the sky and my brother and I sat in awe until it was out of view, one thing we noted as we watched it pass was that there seemed to be small, white streaks in the air around it, like it was creating a disturbance in the atmosphere. I felt genuinely scared after that, just a strange primevil fear that I'm not used to feeling. I felt like there was something there, something intelligent that knew I was watching it in a sense. I will keep searching until I see it again, and I will try my best to capture it on Video, or photo."],"Latitude":"-36.828136","Longitude":"174.810006","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=-36.828136,+174.810006(43704)&iwloc=A&hl=en\"> mufon case (43704) map </A>","Viewing Distance":"Over One Mile","trends":["There have been 51 other sightings in Auckland","There were no other sightings in Auckland on or around November 5th 2012"],"Object Features":"Unknown","Date of the Event":"11/05/2012 12:00 UTC","files":["/var/www/straped/mufon/html2text/43704.html.txt","/var/www/straped/mufon/org/43704.html"],"Date Submitted":"11/04/2012 09:07 UTC","Region":"Auckland","Case Number":"43704","Log Number":"NZ-11042012-0019","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","Tags":"City","City":"Auckland","Weather Factors":"Unknown"}