{"Longitude":"-118.352097","Tags":"City","City":"Los Angeles","Country":"United States","Date Submitted":"11/05/2012 03:33 UTC","files":["/var/www/straped/mufon/html2text/43714.html.txt","/var/www/straped/mufon/org/43714.html"],"Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Source":"MUFON","Summary":"Clear night. it flew directly overhead at what appeared to be high speed, no lights, no noise. Seemed to be reflecting moonlight.","Latitude":"34.047653","divs":["Sighting DetailsMy wife and I were in our backyard smoking at around 11:50pm when she noticed the object and pointed it out. She thought it was a bird at first, but she wasn't wearing her glasses. I was, and I followed it as it passed overhead and towards the horizon. It appeared to be reflecting moonlight, which is how we saw it. It's shape was hard to determine, somewhat triangular (as best I can describe). It seemed smooth, but not shiny. It seemed to be moving several times faster than the typical aircraft we see traversing the area. Best way to describe it's speed: If it was small and low (big bird sized at around 100'), then it could have been going as slow as 80 knots. If it was plane-sized and at 1000' or so, I would guess it's speed at 200-300 knots. If it was significantly larger and higher than that, I have no idea how fast it could have been moving. As it moved away from us and towards the horizon, it appeared to curve upward ascending, and then I could no longer see it. It also appeared to be a darker color on top when it curved upwards (sort of like a camouflaged warplane, light on the bottom and dark on top). I couldn't see any details on it and it had no lights of any kind. I thought it could have been a covert drone of some sort. There was background noise from the freeway nearby, which is amplified when the wind comes from the NE, which it was. Of note, the object was moving in a similar direction. But the wind speeds on the ground were less than a knot. So it could have been an unlit aircraft of some sort, and I still may not have heard it. It came from a direction close to where the moon was at the time, making it easy to see as it crossed overhead."],"Weather Factors":"Unknown","Disposition":"Unresolved","Log Number":"US-11052012-0007","Object Shape":"Other, Unknown","Case Number":"43714","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=34.047653,+-118.352097(43714)&iwloc=A&hl=en\"> mufon case (43714) map </A>","Object Flight Path":"Path with directional change","Object Features":"Unknown","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around November 4th 2012"],"Date of the Event":"11/04/2012 11:50 UTC"}