{"Object Shape":"Cigar","Disposition":"Unresolved","Object Flight Path":"Hovering then path","Region":"Alberta","files":["/var/www/straped/mufon/html2text/43710.html.txt","/var/www/straped/mufon/org/43710.html"],"Viewing Distance":"Unknown","Longitude":"-114.058101","Tags":"City","trends":["There have been 76 other sightings in Calgary","There were no other sightings in Calgary on or around September 27th 2012"],"Date Submitted":"11/05/2012 01:10 UTC","Summary":"Witnesssighted a single object approx 45deg angle of unknown distance near his hometown of Landgon AB. Sighting lasted approx 15min . Object was stationary with no lights,sound smelletc. At the end of sighting object moved away in south direction.","map":"<A HREF = \"http://maps.google.com/maps?q=51.045325,+-114.058101(43710)&iwloc=A&hl=en\"> mufon case (43710) map </A>","City":"Calgary","Date of the Event":"09/27/2012 07:30 UTC","Source":"MUFON","Latitude":"51.045325","Log Number":"CA-11052012-0003","Case Number":"43710","divs":["sighting detailson september 27, 2012 at 19:30 hours the witness and his wife spotted a cigar shaped object of unknown origin hovering in the sky at a 45 degree angle to them. the direction of the sighting is unknown at this time. witness indicated the object hover for approximately 15 minutes at which time it began to slowly move in a southerly direction. witness did take a photo of the object but i do not have access to the picture. witness did not indicate seeing any lights, the object made no sound, had no smell, and no animals were affected in his area. he and his wife were both very excited by the sighting but did not feel any type of connection or contact with the object. no electronic equipment was effected by the sighting\\object. witness indicated the object was a cigar shape but no colour or lights were noted by the witness. both witnesses are in their late 50's and had not been using\\taking alcohol or drugs. witnesses eyesight was said to be good. witness was unable to provide accurate information about the size of the object. both witnesses wish to remain annonymous. more information is need to be gathered before this sighting could be considered a ufo. for example the town were they live is very close to calgary a very large metropolitan area with many helicopters\\airplanes etc flying in and out. if the object was at a 45 degree angle and did vanish behind a building it must of been close to them because the town of langdon, were the sighting was made, is very small town and would not have any tall building other than maybe a grain elevator. if this is so then when the object went behind a building as the witness indicated it must of been close to the witness because they indicated it was at a 45 degree angle. i need more information before i could confidently list this sighting as a ufo."],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Features":"Unknown","Country":"Canada"}