{"Log Number":"US-02032006-0029","Case Number":"4371","Weather Factors":"None","Object Shape":"Flash, Triangle","files":["/var/www/straped/mufon/html2text/4371.html.txt","/var/www/straped/mufon/org/4371.html"],"Object Features":"None, Dome, Other","Viewing Distance":"20 Feet or Less","Region":"California","Summary":"Late night, on a narrow road in my small pickup under large trees, I saw right in front of me about a 3 to 4-foot high pyramid shape completely flashing with numerous strobe-like lights. All red white and blue hovering about one foot off the ground.","City":"Mountain View","Latitude":"37.392962","divs":["Sighting Details 1. Mountain View, California, on a long street called Miramonte Dr.(a suburban area}. I got off work at a precision sheet-metal plant about 1:30 in the morning, and was driving my old Courier pickup the long way to my home in San Jose, when I turned left into a narrow side steet that branched off Miramonte and ran under some trees at least half a mile from the nearest main street (EL Camino Real). As the road curved left it was mostly invisible to the houses in the surrounding neighborhood except for a large house about half-a-block on the left as it neared the top of a hill. This small road also crossed a small creek about forty yards before that house on the other side. 2. It flashed bright lights in font of me and refused to move aside. In fact it edged toward me when I noticed up the road at least seven or eight others just like this one, flashing red white and blue lights as if mimicking an emergency vehicle. About four others seemed to be parked along the right side of the fence on the bridge above the creek. They too were all alight, and whether they were moving around or standing still, they all appeared to be hovering just above the ground. I never saw anything like this my whole life. These could not even be experimental vehicles in my opinion, in that only a small child could possible sit comfortably in any one of these. And they made no sound at all, as if they floated without any motors that we're familiar with. 3. I actually thought it was some very intelligent teenager's idea of some high-tech practical joke, or some new advanced public utility or emergency vehicle of some sort. This was after all- Silicon Valley. 4. I knew it was nothing of \"this\" world as it floated just above the ground about a little over three feet high, and shaped just like a pyramid from Egypt. Four sides; while each triangular side appeared to be nearly or precisely equalateral, and able to display maybe fifty different small piercing round or square shaped lights so bright, their shapes at the base were hard to determine. And only red white and blue, and always and equal amount of all three colors on each side, randomly distributed with no apparent pattern aside from the overall pyramid pattern. And always, each flash came on for only an extremely quick flicker just like a strobe-light. Just like you see on bicycles and most emergency vehicles. It would not suprise me if each light flickered red, white, and blue from the same spot each time. No other lights of any other magnitude or color were ever seen. These craft never hovered more than a foot or more above the ground, and none of them took off or went up into the sky, nor ever descended from the sky either (no doubt they did though). None of them appeared to be showing off...just hanging around casually, except for the craft right in front of me which appeared to be guiding itself emotionally by hovering side to side while apparently having the ability to rotate on it's central axis just mildly enough so as not to really scare me but to let me know it was not afraid, and could get serious if I drove any further (which I did not). The other crafts may not have noticed in the very short time I came upon them, but this \"one\" craft before me seemed to be playing point-guard for the rest. Also, they were probably quite sure that the occupants of the nearest house, a two-story, were asleep as it was nearly 2:00 A.M., on a week day. Many large trees surrounded the otherwise sprawling suburb scattered around an occaisional open field or farm or two. 5. I hit the brakes. Stared only for a about two seconds, and decided, \"I'm outa here\"!... Shifted into reverse, did a backwards Y-turn toward my right rear up a slight embankment of earth, and tore off in the oppposite direction up the Miramonte Dr. that I came from. 6. I was about thirty yards from where I backed up when I actually had the nerve to look in my rear view mirror and noticed he was tailing me! Not too closer however when I seemed to be outgaing him as he was getting smaller in my rear-view. Half way to El Camino Real, I noticed it was gone and was certain it had no intention of following me, and just wanted to shoo me away. Thank God! I was always under the impression that this was a geniune UFO, and could have done anything it wanted to. 7. It just disappeared in my rear-view mirror."],"Disposition":"Insufficient Data","Object Flight Path":"Hovering then path,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=37.392962,+-122.078681(4371)&iwloc=A&hl=en\"> mufon case (4371) map </A>","Tags":"City","Country":"United States","Sighting Duration":"00:01:00","Longitude":"-122.078681","Date of the Event":"10/20/1993 01:40 UTC","Date Submitted":"10/20/1993 01:40 UTC","Source":"MUFON","trends":["There have been 10 other sightings in Mountain View","There were no other sightings in Mountain View on or around October 20th 1993"]}