{"Date Submitted":"11/05/2012 03:09 UTC","Longitude":"-122.259314","map":"<A HREF = \"http://maps.google.com/maps?q=38.041867,+-122.259314(43713)&iwloc=A&hl=en\"> mufon case (43713) map </A>","Tags":"City","Source":"MUFON","Object Features":"None","Latitude":"38.041867","Sighting Duration":"00:01:00","Disposition":"Unresolved","Country":"United States","Object Flight Path":"Straight-line path","divs":["Sighting DetailsAt first I heard a sound, a roaring sound that I assumed was the train. It might have been the train. I heard it again, but it seemed a bit closer this time around. I looked out of my window and saw a flying vehicle, no telling whether it looked human-made or extraterrestrial but what I saw was a dark triangular silhouette with three non-blinking orbs on each corner of the triangle. It seemed to be levitating and slowly moving north without propulsion, though there was that accompanying high pitched roar, and a second low pitched roar that can be heard below the first, humming in dissonance. I had to process the event for a minute because \"UFO\" didn't really jump in to my mind until I finally ran out of explanations for what it was. So I walked out of my house, followed it, but it was moving too fast for me to catch up with, and I was walking up hill where the houses start to block my view of the object. I don't think the object has left, because every now and then I hear the roaring-humming noises come in and out in different lengths of time, as if patrolling."],"Summary":"Triangular UFO with Steady White Lights Floating Over Suburban Neighborhood","trends":["There have been 3 other sightings in Rodeo","There was one other sighting in Rodeo on or around November 4th 2012"],"Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/43713.html.txt","/var/www/straped/mufon/org/43713.html"],"Viewing Distance":"Over One Mile","Case Number":"43713","Weather Factors":"Unknown","Date of the Event":"11/04/2012 09:00 UTC","City":"Rodeo","Log Number":"US-11052012-0006","Region":"California"}