{"Weather Factors":"Unknown","Date Submitted":"11/05/2012 09:47 UTC","Disposition":"Unresolved","Object Flight Path":"Hovering then path","divs":["sighting detailsat approximately 11:45pm central time on november 3rd i went out into my front porch to smoke a cigarette. i was looking east when i noticed a bright orange\\red light in the sky. upon a second look i noticed two more identical lights. the lights were aligned like the 3 points of a triangle. i could not see a solid object between the lights but the way they moved together made me believe they were part of a solid object. the lights were above the tree line and appeared to be very close to me. i was worried that while i was sitting there the object\\lights were going to fly over my house. they appeared to be much lower than an airplane would fly. i would estimate that they were approximately 100-200 feet in the air, maybe higher but definitely below the light cloud cover. i remember thinking that when the object flew over, it was so low that i would be able to see all the detail and that frightened me. the lights were gliding very slowly, not wavering from their position in the triangle and moving in a westerly direction. the lights were circular in shape and were about 5 times brighter and larger than the brightest\\largest star in the sky. i watched the lights for about 10 minutes as they moved west, toward me, then they began to slowly fade until they appeared no brighter or larger than the average star. i wish, in retrospect, that i had grabbed my camera but i was too scared\\in awe to go get it while the event was happening. after the lights faded i immediately went inside and woke my husband but it was too late, they were gone. i am a 30 year old mother of two with a 4 year degree from a reputable university. i am an admitted skeptic. i have never witnessed anything like this before."],"Summary":"3 Bright Red Lights in Triangle Shape","Log Number":"US-11052012-0009","Longitude":"-93.652404","Latitude":"41.612806","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.612806,+-93.652404(43716)&iwloc=A&hl=en\"> mufon case (43716) map </A>","Case Number":"43716","trends":["There have been 42 other sightings in Des Moines","There were no other sightings in Des Moines on or around November 3rd 2012"],"Tags":"City","files":["/var/www/straped/mufon/html2text/43716.html.txt","/var/www/straped/mufon/org/43716.html"],"Viewing Distance":"101-500 Feet","Source":"MUFON","Object Shape":"Fireball","Sighting Duration":"00:10:00","Region":"Iowa","Country":"United States","City":"Des Moines","Date of the Event":"11/03/2012 11:45 UTC"}