{"Latitude":"38.108706","Tags":"City","Longitude":"-122.247637","Date Submitted":"11/05/2012 05:25 UTC","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=38.108706,+-122.247637(43726)&iwloc=A&hl=en\"> mufon case (43726) map </A>","Country":"United States","Object Flight Path":"Straight-line path","Sighting Duration":"00:05:00","Disposition":"Unresolved","trends":["There have been 12 other sightings in Vallejo","There were no other sightings in Vallejo on or around November 4th 2012"],"City":"Vallejo","Case Number":"43726","Date of the Event":"11/04/2012 09:35 UTC","Object Shape":"Circle, Square, Rectagular, Triangle","Source":"MUFON","files":["/var/www/straped/mufon/html2text/43726.html.txt","/var/www/straped/mufon/org/43726.html"],"Log Number":"US-11052012-0019","Object Features":"None","Summary":"Loud humming noise outside, went out to investigate and saw a pentagon shaped object flying low with 4 dim lights on each corner (except top)","Weather Factors":"Unknown","divs":["Sighting Details I live in Vallejo. It was my first. I was sitting at my computer and heard a loud humming noise and went outside to investigate to see what looked like a pentagon shaped object flying above with four dim ights on each corner except the top. I stood there in awe before realizing i needed to capture it but by then it was too far to get on camera. I have always believed in extra terrestrials but never seen or experienced for myself. I had a premotional dream just last week about it being December 21, 2012 and we were visited at our door by what looked like people but turned out to be from another galaxy. They were there to save us before the world was to be destroyed. Those in my home were given the go ahead and were allowed to bring one item or pet that was not technical or agressive. It seemed so real. I have premonitions every year or so. This was so real. I felt like it was actually happening. I believe its a possiblity. But after seeing and hearing that last night, i more than believe it."],"Viewing Distance":"Unknown"}