{"Object Shape":"Boomerang, Star-like","Latitude":"40.431734","map":"<A HREF = \"http://maps.google.com/maps?q=40.431734,+-104.701732(43735)&iwloc=A&hl=en\"> mufon case (43735) map </A>","files":["/var/www/straped/mufon/html2text/43735.html.txt","/var/www/straped/mufon/org/43735.html"],"trends":["There have been 19 other sightings in Greeley","There were no other sightings in Greeley on or around November 5th 2012"],"Country":"United States","City":"Greeley","Longitude":"-104.701732","divs":["sighting detailsi was raking leaves out of my yard after dark and was carrying a load to dump in back. i am a meteorologist\\atmospheric scientist so i tend to have my eyes to the sky and as i was pulling the tarp of leaves into our dark backyard i noticed what i thought was a spotlight reflecting light off of haze in the northeast sky. this \"spotlight-like\" motion only lasted for a maybe 5 seconds and it was getting closer & more visible. there were some thin clouds at high altitude that were possibly refracting the light from this object\\objects and making it look like a fuzzy light. as it got closer, i could make out a v-shaped pattern now moving south and in a straight line. my brain, trying to make sense of what i was seeing, at first made me think that i was looking at a light illuminated flock of geese. but that notion only lasted a second as i realized i was looking at something at very high altitudes moving very fast. there were 5-7 star-like dots in a v-pattern holding tight and moving very fast to the south. from when i saw it nearly overhead to losing sight in the southern sky, it only took about 5 seconds to travel that distance. there was a thin cirrus cloud layer above 30,000' and this object was well above that. i am guessing it\\they were over 150,000' in altitude. i have never seen anything like this before and i have previously not believed in ufos, but this made the hair on my neck stand up and gave me chills down my spine."],"Sighting Duration":"00:00:10","Log Number":"US-11062012-0001","Object Flight Path":"Path with directional change","Date of the Event":"11/05/2012 06:15 UTC","Case Number":"43735","Region":"Colorado","Source":"MUFON","Viewing Distance":"Unknown","Disposition":"Unresolved","Tags":"City","Summary":"V-shaped pattern of star-like lights moving very quickly at high altitude","Date Submitted":"11/06/2012 01:39 UTC","Weather Factors":"Unknown","Object Features":"None"}