{"Tags":"City","Object Shape":"Flash","Date of the Event":"05/15/2012 12:00 UTC","trends":["There have been no other sightings in Fall River Mills","This sighting has never been favorited."],"Country":"United States","City":"Fall River Mills","Source":"MUFON","Date Submitted":"11/06/2012 05:13 UTC","files":["/var/www/straped/mufon/html2text/43737.html.txt","/var/www/straped/mufon/org/43737.html"],"Region":"California","Sighting Duration":"Undisclosed","Latitude":"41.004608","Log Number":"US-11062012-0003","Case Number":"43737","divs":["Sighting DetailsI was camping with my parents and brother at a lot we own in the mountains between mt shasta and mt lassen, elevation 3400ft early this summer.its very close to the radio telescope array at hat creek, the first night we were there i saw what i thought was lightning near the horizon, bright flashes that seemed to come from a single point, not a bolt. it was cloudy that night and didnt think much of it except that i didnt hear a trace of thunder, which was odd because the flashes were very bright, lighting up a large portion of the sky and seemed pretty close.My brother and i were the only ones to see it the first night,we assumed it was lightning, he went to bed and i stayed up and watched for about an hour, the flashes didnt appear at the same spot every time or at regular intervals, a flash about every couple of minutes, still no sound.2 nights later we were all sitting around the campfire and it started again, it had rained earlier but it was a fast moving storm and by nightfall the sky had been clear for about 3 hours, no clouds were in the sky in any direction and it was completely clear.again i thought it was lightning, looked like a camera flash but much brighter, first spotted it through the trees(its heavily wooded there), about every minute we'd see the flash, never in the same spot, sometimes below the tree line and some up in the sky. i stood up and walked to a clearing and stood up on a treestump to get a better view.the flashes WERE in the sky,i could see stars all the way to the horizon, and the flashes seemed to be pretty close, all within 2 miles or so and all roughly in the same direction,north.again i must stress how bright they were, some lit up half of the sky and cast shadows where we were, no sound at all. im an avid stargazer, ive seen really impressive meteors, these were not meteors, there were no entry tails and you'd never see this many at a time.this continued for about 1.5 hours until i went to bed.im stumped, when i got home i did some research and it still doesnt add up, theres hardly any air traffic up there, no clouds, no people, no thunder.it scared the hell out of my mom, my dad was worried about forest fires, brother assumed it was lightning.I have witessed a ufo before but have never told anyone, get back to me if you have any imput. i would like to remain anonymous.im not crazy and im not making this up,you have my e mail address"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.004608,+-121.438314(43737)&iwloc=A&hl=en\"> mufon case (43737) map </A>","Weather Factors":"Unknown","Summary":"very bright flashes in the sky like lightning with no clouds or noise, went on for long period","Longitude":"-121.438314","Disposition":"Unresolved","Object Flight Path":"Stationary","Object Features":"None","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile"}