{"Summary":"Multiple starlight lights crossing sky","Log Number":"US-11052012-0027","files":["/var/www/straped/mufon/html2text/43734.html.txt","/var/www/straped/mufon/org/43734.html"],"Viewing Distance":"Unknown","Country":"United States","Object Shape":"Star-like","Date of the Event":"11/05/2012 06:32 UTC","Longitude":"-112.03452","Tags":"City","trends":["There have been 33 other sightings in Maricopa","There were no other sightings in Maricopa on or around November 5th 2012"],"Source":"MUFON","City":"Maricopa","Date Submitted":"11/05/2012 11:21 UTC","Latitude":"33.071189","Object Features":"Unknown","Case Number":"43734","Object Flight Path":"Straight-line path","divs":["Sighting DetailsAt 1832 hours I was outside visiting my mother and smoking a cigarette and and talking to her when I noticed a star like object almost directly above going by at a very fast speed in a northeast direction. I pointed it out to my mother and we watched it for about 10 seconds until it disappeared. Then we saw another one going in the same direction about 30 seconds behind the first one. I used my iphone and got a compass heading on it that was about 68 degrees NE. It was also traveling very fast and looked just like a star and it dissapeared out of sight after about 20 seconds. Both were very high in the sky probably 40-50,000 feet. We both started looking in the sky and about 5 minutes later saw another one coming from the south heading north and it was moving extremely fast like mach 2 type speed. We both continued monitoring the skies and about 10 minutes later we saw two more coming from the south heading north and I got a compass heading on them of about 20 degrees north one trailed the other by about 15 seconds. All of these were high altitude sightings and all of them passed directly overhead of us and all had a star like appearance. We see lots of airplanes being that we are only 35-40 miles South from the Phoenix International Airport so we are familiar with the various paths and altitudes we normally see and these sightings were not the normal aircraft and altitudes we usually see. It is possible these were all satelites that we saw but what makes me wonder if it was is that several of the pairs of lights followed each other by 20-30 seconds on the same exact heading and altitude. I don't think satelites are usually on the same orbit and path and that close to each other but maybe they are. Just never seen so many star like objects in such a short period of time."],"Weather Factors":"Unknown","Disposition":"Unresolved","Sighting Duration":"01:00:00","Region":"Arizona","map":"<A HREF = \"http://maps.google.com/maps?q=33.071189,+-112.03452(43734)&iwloc=A&hl=en\"> mufon case (43734) map </A>"}