{"Date of the Event":"11/05/2012 10:03 UTC","Object Flight Path":"Hovering then path","Source":"MUFON","trends":["There have been no other sightings in Lincolnia","This sighting has been favorited 1 time."],"Log Number":"US-11052012-0026","Country":"United States","Object Shape":"Fireball, Star-like","Object Features":"Unknown","Weather Factors":"Unknown","Longitude":"-77.157519","divs":["Sighting DetailsDriving home from my boyfriends up Cherokee Avenue, was going to make a Right on Montrose to my place but thought that I should go Left and check out my voting place at the Middle School for the morning's voting. I've never voted there before and I'm new to the neighborhood, so wanted to make sure I knew where it was going in the morning. But before I came to my Left turn I saw above the tree line a bright red orb with fuzzy rose colors coming from it hovering. The height of it made me think it might be a radio tower but I've never noticed one there before when I've come home at night. I think I saw a plane moving behind and above the object and that's when I realized the orb must be moving as well because it was staying ahead of the plane. I quickly made my Left turn and stopped my car by someone's house with the motor running, trying to get a better look at the object, I thought it could be a bright blimp or something but i immediately dismissed that because it was so round and small and very bright, seemed to be producing it's own light. I don't know if it was making any noise because I didn't have the windows down and I still had my engine on. It was moving rapidly back the direction that I had come and I couldn't quite get a clear angle on it. It was right below the vantage point of my sunroof and right above my rearview window. I opened my car door but I was suddenly overcome by feeling foolish and I didn't get out; what if another car suddenly came around the corner and hit me in the dark or wondered what I was doing and I would look stupid? I did stick my leg out of the car and poke my head out; looking up I realized it was gone. The plane was still blinking past. I got back in my car and observed that it was 10:03 pm. It was a very puzzling event, albeit a short encounter, but certainly strange. I wonder if anyone else saw it or will report a strange light in the sky tonight."],"Case Number":"43733","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Summary":"Feel foolish but it was truly bizarre to observe; I couldn't identify what I was seeing and I kept expecting it to become something I could recognize, but it didn't. Have no idea.","Tags":"City","files":["/var/www/straped/mufon/html2text/43733.html.txt","/var/www/straped/mufon/org/43733.html"],"Region":"Virginia","Latitude":"38.811744","City":"Lincolnia","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=38.811744,+-77.157519(43733)&iwloc=A&hl=en\"> mufon case (43733) map </A>","Date Submitted":"11/05/2012 10:44 UTC"}