{"Object Shape":"Triangle","Tags":"City","Object Features":"Louvres","Object Flight Path":"Stationary","Case Number":"4373","Summary":"While in my car, sitting still at a Stop sign, I observed a triangle shaped object hovering in the Northern sky. It did not move at all (side to side or away or closer) the entire observation.","Weather Factors":"Unknown","trends":["There have been 41 other sightings in Spokane","There were no other sightings in Spokane on or around August 31st 2003"],"divs":["Sighting DetailsCORNER OF HIGH DRIVE AND 29th AVE. facing due NORTH. While in my car, sitting still at a Stop sign, I observed a triangle shaped object hovering in the Northern sky. It did not move at all (side to side or away or closer) the entire observation. I first noticed the object when I reached to adjust my rear view mirror. I noticed it at the \"top\" portion of my front window, directly ahead of me. The object looked like a FRAM AIR FILTER molded into a triangle shape. The object did not move while I was observing it. I looked and studied the object for several seconds. I saw that it was large and quite far away yet not moving (flying). I aligned the object with the edge of my rear view mirror and sat very still. The object still did not move, not even a tiny bit. The radio was on at the time and after approx. 4-5 minutes I thought I'd turn it off and \"listen\" for any sounds. I looked down for a split second to turn off the radio. When I looked up, the object was gone. Completely gone from anywhere in the sky. This was a beautiful clear Sunday morning with not a cloud in the sky. I opened up my sun roof and look around thoroughly. The object was nowhere in sight. Then suddenly, where the TRIANGLE was hovering a jet airliner came into view from the NE. It flew slowly into view from the right side of my car's front window and headed on a path straight across my window in front of me, obviously headed for a landing at Geiger International Airport. With myself seated in the same position in my car seat and by aligning my vision again with the rear view mirror, I could see that the path of the airplane was exactly where the TRIANGLE would have been only seconds before."],"Region":"Washington","Sighting Duration":"00:05:00","Log Number":"US-02042006-0002","Source":"MUFON","Date of the Event":"08/31/2003 10:00 UTC","Country":"United States","Disposition":"Unresolved","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=47.66303,+-117.419727(4373)&iwloc=A&hl=en\"> mufon case (4373) map </A>","City":"Spokane","Longitude":"-117.419727","files":["/var/www/straped/mufon/html2text/4373.html.txt","/var/www/straped/mufon/org/4373.html"],"Date Submitted":"08/31/2003 10:00 UTC","Latitude":"47.66303"}