{"files":["/var/www/straped/mufon/html2text/43748.html.txt","/var/www/straped/mufon/org/43748.html"],"Summary":"3 staionary \"stars\" suddenly take off w red blinking lights silently moving across sky","Longitude":"-81.375506","Tags":"City","Weather Factors":"Unknown","Region":"Florida","Country":"United States","Date of the Event":"11/06/2012 11:50 UTC","City":"Orlando","Object Flight Path":"Hovering then path","Latitude":"28.547106","divs":["Sighting DetailsI was stepping out in front of my house,for fresh air. It was about 11:50 (approx) PM, Eastern Time. I was looking up at the night-sky, like I usually do, just gazing about. Suddenly, I saw a white \"star\" that seemed to be different from the other stars, for emitting some energetics greater than the rest of the stars, and it somehow seemed different, and I thought to myself it may be a drone. But just right after thinking it, the \"white star\" began moving across the sky silently, with a red light blinking about it, that was previously neither blinking, nor visibly there. I watched it move without ascending or descending, just moving smoothly and entirely silently across the night-sky. Then, I spotted another such \"white star\" parking stationary, and, it too, had such a visible energetics emission. As soon as I spotted it, it too (!!!) began suddenly moving along horizontally, it, too, now flashing a red light! (As if had responded to me spotting it, as crazy as it may sound!) I then looked behind my house, and saw another such white star parking, with the unusual energetics about it. I kid you not, it then also began moving, now also with a red blinking light, moving horizontally, and entirely silently! The height of these things is hard to estimate, perhaps an airplane height, or so. Definitely way above tree-tops. The speed of the three objects seemed exactly the same, about the speed of an airplane, perhaps faster, come to think of it, since the airplanes here do tend to come a bit slower. So, a bit faster than the average airplane. I felt these objects were posing as stars, while observing something. After I saw each one begin moving, as soon as I spotted them as being different, I have reason to suspect they may respond to thoughts. I am not entirely sure, but it surely seemed like it because each one began moving after I saw them. I lost sight of the one behind my house when it moved south into a cloud (after \"parking\" in the west-sky. And I lost sight of the other two in front of my house when one of them flew one from north toward east, and the other from north toward south. So, these two \"split\" into 2 different directions. It seemed to me, the red blinking light on each object, once they were moving, appeared to rotate about the white light, but I am not sure."],"trends":["There have been 112 other sightings in Orlando","There were 3 other sightings in Orlando on or around November 6th 2012"],"Viewing Distance":"Unknown","Object Shape":"Star-like","Case Number":"43748","Source":"MUFON","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Log Number":"US-11072012-0001","map":"<A HREF = \"http://maps.google.com/maps?q=28.547106,+-81.375506(43748)&iwloc=A&hl=en\"> mufon case (43748) map </A>","Date Submitted":"11/07/2012 12:34 UTC","Object Features":"Unknown"}