{"Case Number":"43759","trends":["There have been 35 other sightings in Toledo","There were no other sightings in Toledo on or around August 14th 1972"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.721078,+-83.472339(43759)&iwloc=A&hl=en\"> mufon case (43759) map </A>","Date Submitted":"11/07/2012 02:43 UTC","Viewing Distance":"20 Feet or Less","Object Flight Path":"Stationary","Date of the Event":"08/14/1972 12:00 UTC","Tags":"City","Weather Factors":"Unknown","Longitude":"-83.472339","Log Number":"US-11072012-0011","Source":"MUFON","Latitude":"41.721078","City":"Toledo","Sighting Duration":"Undisclosed","Region":"Ohio","Disposition":"Unresolved","Country":"United States","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/43759.html.txt","/var/www/straped/mufon/org/43759.html"],"Object Shape":"Sphere","Summary":"Hot night. Me- 14y/o;on couch heard knock @back door. when answered. saw the above descrbed UFO and thought \"Oh, they've come back to visit me. Had lost time.","divs":["sighting detailsi was 14 years old in 1972. it was august in a more innocent time and we had no air conditioner.my parents usually locked the screen door and sometimesi tried to sleep on the couch w\\ the door open. at those times, there was very little crime in the area to worry about.i am not exactly sure of the exact date, but it was august and hot! was dozing on the couch that night w\\ my little dog, kilo. between 1-2 am i was awakended by a knock on our back door. the little dog's ears went up.i wentto the back door but didn't see anyone. i unlocked the door and stepped out. for some reason i looked up and hovering over our house was an elliptical object ( a ufo) that appearedto have a white surface and had one very large light in the from underneath illuminating nearly the entire underside, with some left in darkness. i couldn't make out any lights, and i don't remember being the least bit surprised to see this object there. it hovered there silently for an unkown amount of time. i remember thinking,\" oh! they came to say hi to me.\" there might have been an abduction because i lost time and don't remember seeing the object disappear. i also remember feeling that this had happened to me before- although i don't have any other recollections. as far as what i thought the object was wheni first noticed it, i knew what it was. it i know it was not a dream, and i felt like i had been visited before. the only other thing about the visitation that sticks in my mind is that the next morning i told my mother that they had come to visit me in a ufo. instead of calling me crazy, she told me i should have come to wake her up. for some reason the visit seemed entirely natural. to this day i never told anyone else, although i did see a report on line that was written in 1997 where thw person states he saw a ufo in toldo in 1972 or 1973 near ahoospital. we lived about 5-10 miles from the nearest hospital. i had the feeling that they came specifically for me."]}