{"City":"Lynwood","Date Submitted":"11/07/2012 03:06 UTC","Source":"MUFON","Tags":"City","Object Flight Path":"Stationary,Path then hovering","Log Number":"US-11072012-0007","trends":["There has been one other sighting in Lynwood","There were no other sightings in Lynwood on or around August 15th 1972"],"Object Features":"None","Latitude":"33.937863","map":"<A HREF = \"http://maps.google.com/maps?q=33.937863,+-118.20356(43754)&iwloc=A&hl=en\"> mufon case (43754) map </A>","Country":"United States","Date of the Event":"08/15/1972 05:30 UTC","files":["/var/www/straped/mufon/html2text/43754.html.txt","/var/www/straped/mufon/org/43754.html"],"Disposition":"Unresolved","Summary":"my family and neighbors witnessed an object over our house. That eve. I had a dream of an encounter with several entities.","Viewing Distance":"21-100 Feet","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was nine years old living in the projects of Lynwood CA. in 1972. One late afternoon several neighbors began to crowd in front of our building, which was two stories. They were excitedly talking and pointing above our home. We, my parents, brother, uncle and aunt, went outside and saw a glowing, oval object hovering over our roof. My father put me on his shoulders so that I could see better, but it began to float off towards some trees. My father along with other neighbor fathers chased it as long as they could before it disappeared. That evening I awoke suddenly in my dark room I shared with my brother and began to see a glowing coming from the hallway. It got brighter until this stick thin glowing figure with a large, oval head walked by. Then, others began to go the other way and I was terrified they would hurt my mother (who was nine months pregnant and who I feared would die in childbirth)...until one came into my room and began to look around, picking up objects, opening drawers beginning near the door and finally reaching my bed. The whole time I was sitting in shock, not breathing, with the sheets pulled over my nose. It saw me, sat on the side of my bed and looked at me in the eyes. It glowed a greenish hue with large, dark eyes. That was the last thing I remember before I awoke the following morning."],"Longitude":"-118.20356","Region":"California","Weather Factors":"Unknown","Case Number":"43754","Object Shape":"Fireball, Oval"}