{"Latitude":"35.702069","trends":["There have been no other sightings in Taito","This sighting has never been favorited."],"Disposition":"Unresolved","divs":["Sighting DetailsI was out shopping with my wife. We were about to call it a day and were making our way to a coffee shop when i saw the object. At first it looked like a large star but the weather was clear and the sky was bright blue and i have never seen anything like it. I checked with my wife and she said that she could see it. I asked her if it could be a plane (it didn't look like one to me) and she said no. My wife went into the coffee shop because the object wasn't initially moving, she didn't think it was that interesting. I stuck around and the object started moving, hovering, very slowly in roughly a diamond pattern in the sky it was so high in the sky it hurt my neck to look at it. I then saw a plane flying over head in a different part of the sky. This convinced me further that the object I was witnessing was NOTHING like a plane. i tried to take a video with my phone but the object was too far away to show up clearly. I felt that there was something not right about the object, it did not seem to move to any logical pattern but it did seem to be under intelligent control. The object finished it's hovering and then made it's way slowly acrooss the sky at a very high altitude. At two points during my observation the object seemed to become markedly brighter and the second time it looked as though there might be two lights inside the very small sphere although it was too high up to know for sure."],"Country":"Japan","Sighting Duration":"Undisclosed","Longitude":"139.775327","Object Shape":"Sphere, Other","City":"Taito","map":"<A HREF = \"http://maps.google.com/maps?q=35.702069,+139.775327(43751)&iwloc=A&hl=en\"> mufon case (43751) map </A>","Summary":"Orb sighted from Akihabara over Tokyo","Weather Factors":"Unknown","Date of the Event":"11/04/2012 03:20 UTC","files":["/var/www/straped/mufon/html2text/43751.html.txt","/var/www/straped/mufon/org/43751.html"],"Date Submitted":"11/07/2012 02:13 UTC","Source":"MUFON","Object Flight Path":"Hovering then path","Case Number":"43751","Log Number":"JP-11072012-0004","Tags":"City","Object Features":"Unknown","Region":"Tokyo","Viewing Distance":"501 Feet - 1 Mile"}