{"Summary":"bright lighted object with many lights, together formed a honey comb shape slowly travels over me","Tags":"City","Object Features":"Other","City":"Evansdale","map":"<A HREF = \"http://maps.google.com/maps?q=42.469154,+-92.281017(43765)&iwloc=A&hl=en\"> mufon case (43765) map </A>","divs":["Sighting DetailsAround 8:35pm I was traveling south on the interstate a few miles north of Evansdale Iowa. The sky was 100% cloudy, with rain from time to time. Stars and the moon were not visible due to the storm clouds covering the area. As I traveled south a bright colorful light (blue, green mostly) began to flash within the clouds making the surrounding clouds light up with different colors. I thought this very strange and kept watching as suddenly I could clearly make out several round lights begin to take form from within the clouds. Like the sun shining through thick clouds during the day, theses lights seemed to be the same size, giving the illusion that it was no higher up than a water tower, but I knew from the foggy mist overlapping the lights that the object was higher up. The lights were now solid and the pulsing flash had stopped. Theses lights were perfectly spaced from one another giving me the idea that it was one solid object. I could not make out the shape due to the object clearly being deep within the clouds above but the lights were so bright that they shined through with no problem. The object was moving incredible slow about the same speed as you would see a flock of geese travel. I quickly decided to pull over and try to video tape it with my phone. As I got out the object was moving slowly over me heading west, for as low as it seemed to be the object put off no sound. The lights were now brightly white and were round in shape. As I watched the object travel above it presented itself to me with a natural flow, like it belonged in the sky. I began to try and film the object but my phone could not focus on the lights or anything else in the dark. The object then began to disappear in some thicker clouds and the lights began to fade away until I could not see them anymore. I stood on the side of the road for 30 more seconds and the pulses began to appear again but further in the distance."],"Case Number":"43765","Log Number":"US-11072012-0017","Sighting Duration":"Undisclosed","Source":"MUFON","Longitude":"-92.281017","trends":["There has been one other sighting in Evansdale","There were no other sightings in Evansdale on or around November 6th 2012","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/43765.html.txt","/var/www/straped/mufon/more/43765_submitter_file1__ufo.jpg","/var/www/straped/mufon/org/43765.html"],"Region":"Iowa","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Other","Disposition":"Unresolved","Latitude":"42.469154","Date Submitted":"11/07/2012 11:49 UTC","Date of the Event":"11/06/2012 08:35 UTC","Country":"United States","Object Flight Path":"Straight-line path"}