{"Weather Factors":"Unknown","Date of the Event":"03/15/2011 12:00 UTC","Region":"New York","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=43.122014,+-75.291556(43769)&iwloc=A&hl=en\"> mufon case (43769) map </A>","divs":["Sighting DetailsIt was early afternoon on a clear, sunny day in mid March of 2011. I was standing in my backyard talking on the phone enjoying the weather. I happended to look up in the sky, as I often do, and between the tops of two high trees, I noticed a cluster of about six faint objects. They appeared to be a group of stars very close together with their brightness mostly obscured by the daylight in a ESE direction. I didn't think that it was anything out of the ordinary, but as I continued watching these objects, they all started slowly moving away from each other in opposite directions in straight lines. They were very high up, so the speed may have been relatively fast. I watched them for a few minutes until my view was blocked by the trees. What I saw was similar to the photo in the previous Utica area submission but not as bright and there were about six objects. I was not able to get a photo as they were very faint. There may be a very reasonable explaination for what I saw, but I have never seen anything like that in my 32 years."],"Source":"MUFON","Disposition":"Unresolved","trends":["There has been one other sighting in Whitesboro","There were no other sightings in Whitesboro on or around March 15th 2011"],"Log Number":"US-11082012-0004","Latitude":"43.122014","Summary":"Faint cluster of 6 lights very high up, then all moved away in opposite direction","Longitude":"-75.291556","Date Submitted":"11/08/2012 09:22 UTC","Sighting Duration":"Undisclosed","Object Shape":"Unknown","Viewing Distance":"Over One Mile","Case Number":"43769","Object Features":"Unknown","Country":"United States","Object Flight Path":"Hovering then path","City":"Whitesboro","files":["/var/www/straped/mufon/html2text/43769.html.txt","/var/www/straped/mufon/org/43769.html"]}