{"divs":["Sighting DetailsI had just walked outside to put something into the garage and it was after dark even though it was relatively early due to the daylight savings time change. I had just locked up the garage and had walked to the driveway to make sure I had locked up the jeep because I was planning on going in for the night. It was sometime between 6:45pm and 7:15pm because family fued had just been on. Anyway, I had just locked up the jeep and was walking back to the house when I spotted a very bright starlike object shining through the trees to my southeast. I was thinking that it looked different than anything I had ever seen before. I expected it to not move thinking it was just a bright star but when I turned back I noticed it had moved and was still moving in a straight line across the sky like a plane but it did not look like a plane. No red and white blinking lights like planes have. No blue or green blinking lights like some other planes have. Also, it was moving much slower than planes move. Like it was in no hurry at all to go anywhere. I just stood and watched it slowly move across the sky and marveled at how bright and starlike it was. Also noticed that it had a faint humming sound coming from it and also had a faint strobe light that pulsated continuously. I watched it until it went out of sight beyond the trees behind the house towards the lake that is about 5 or 6 blocks away from me. I was not going to report this because I thought it was probably just a drone or something man made but I cant seem to stop thinking about how weird and unusual it looked. Thank you for your time!"],"Sighting Duration":"00:03:00","Date Submitted":"11/07/2012 10:59 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/43764.html.txt","/var/www/straped/mufon/org/43764.html"],"Object Features":"None","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Date of the Event":"11/05/2012 12:00 UTC","Region":"Texas","trends":["There has been one other sighting in Flint","There were no other sightings in Flint on or around November 5th 2012"],"Country":"United States","Summary":"UFO OR DRONE- BRIGHT YELLOWISH-WHITE STARLIKE OBJECT THAT HUMMED AND HAD A WHITE STROBE LIGHT THAT PULSATED CONTINUOUSLY-HAD NO RED LIGHTS LIKE PLANES DO","Case Number":"43764","Source":"MUFON","Object Shape":"Diamond, Star-like","Viewing Distance":"101-500 Feet","Longitude":"-95.348333","City":"Flint","map":"<A HREF = \"http://maps.google.com/maps?q=32.203889,+-95.348333(43764)&iwloc=A&hl=en\"> mufon case (43764) map </A>","Tags":"City","Log Number":"US-11072012-0016","Latitude":"32.203889"}