{"map":"<A HREF = \"http://maps.google.com/maps?q=43.216387,+-71.528112(4377)&iwloc=A&hl=en\"> mufon case (4377) map </A>","files":["/var/www/straped/mufon/html2text/4377.html.txt","/var/www/straped/mufon/org/4377.html"],"trends":["There have been 23 other sightings in Concord","There were no other sightings in Concord on or around August 1st 2005"],"Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Region":"New Hampshire","Date of the Event":"08/01/2005 12:00 UTC","Object Shape":"Unknown","Disposition":"IFO","Tags":"City","Sighting Duration":"Undisclosed","Summary":"Object in sky moving in very strange ways, bright white light with colored flashing lights","Weather Factors":"None, Rain","Case Number":"4377","Longitude":"-71.528112","City":"Concord","Log Number":"US-02042006-0006","Source":"MUFON","Latitude":"43.216387","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Date Submitted":"08/01/2005 12:00 UTC","Object Features":"Unknown","divs":["Sighting DetailsThe first time I noticed the object I was going outside to have a cigarette. I noticed a light in the sky that was bright red it stood out from all the other lights in the sky. I stood outside wondering if it was an oddly colored star, but it started moving westward in the sky slowly at first, then it started flying in ways that no plane or helicopter could possibly move. It seemed to zig-zag back and forth horizontally, now it had really captured my attention and I stood outside for three hours watching the object, I grabbed my binoculors and I could see not only red lights but also green, amber, white, and a small blue flash. The next night I went out to smoke and to my surprise it was there again in the same location, this time I tried to take piictures with my digital camera, but I didn't have much sucess getiing a good picture. I began looking every night and I saw this thing in the sky every night for three months. I tried to get a better view from my telescope but the lenses weren't good enough. I started going out at night trying to follow the object and see how close I could get. I never managed to get too close until one night my sister and I were on our way home from Dover and spotted the object, she had witnessed it from my house with sveral other family members. We decided to go up the mountain road to get a better view. when we got to the top we could see the object closer it was hovering in one spot so we stopped the car and waited, the object had a bright white light shining and started to move closer toward the car, we became frighted and very quickly drove down the mountain. My mother had called the news channel to tell them I had been seeing this object, but I did not call back, I had alreadly been teased at work for telling my coworkers and did not want to have the news crew come out. I have no idea what the object was and I don't have strong enough equiptment to get a better view or any clear pictures. Several times when driving around looking at the object we noticed there were two more identical objects in the same area, they had the same lights and wheneverr there were more then one they seemed to travel in a triangular pattern in the sky."]}