{"Object Flight Path":"Path with directional change","Country":"United States","files":["/var/www/straped/mufon/html2text/43775.html.txt","/var/www/straped/mufon/org/43775.html"],"Object Features":"None","Object Shape":"Unknown","Region":"Texas","divs":["sighting detailswas taking out trash approximately 7 am or so. saw presumed airliner with vapor trail in morning sun shining brightly. thought it would make a nice facebook post so pulled out i phone and snapped a photo (picture 1). too hard to see so i zoomed in and only got vapor trail (picture 2). wanted foreground trees for contrast so zoomed back out some as i re aimed i saw the light above the vapor trail and snapped a photo capturing the image below the vapor trail(picture 3). i watched the light\\object go below the trail then above it and then go below it again and poof it was gone (picture 4 with same trees and vapor trail nut no light\\object) it was up near a commercial plane apparently so i could see no details other than the bright light behind the plain seemingly circling the vapor trail. entire event was probably 3 to 5 seconds. thought i was nuts until i saw for sure i got a photo of it. no telling what it could have been but it did definitely move above and below the reference point of the vapor trail twice before vanishing in a downward motion. the photos i uploaded to fb and saved from there. truly besides being with an i phone they are not the greatest of quality."],"City":"Evant","Sighting Duration":"Undisclosed","Source":"MUFON","Date Submitted":"11/08/2012 02:16 UTC","Longitude":"-98.142745","trends":["There have been 2 other sightings in Evant","There were no other sightings in Evant on or around November 8th 2012"],"Summary":"Saw vaportrail in sunrise. Took photos and light appeared behind aircraft above vaportrail.Went below then above and vanished","Viewing Distance":"Over One Mile","Case Number":"43775","Disposition":"Unresolved","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=31.484173,+-98.142745(43775)&iwloc=A&hl=en\"> mufon case (43775) map </A>","Date of the Event":"11/08/2012 07:00 UTC","Latitude":"31.484173","Log Number":"US-11082012-0009","Weather Factors":"Unknown"}