{"map":"<A HREF = \"http://maps.google.com/maps?q=42.207214,+-86.327535(43787)&iwloc=A&hl=en\"> mufon case (43787) map </A>","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Latitude":"42.207214","Object Flight Path":"Path then hovering","City":"Coloma Charter Township","Longitude":"-86.327535","Source":"MUFON","Region":"Michigan","Summary":"Witnessed with girlfriend six circular objects flying over lake Michigan at about 10:30 pm.","Object Shape":"Circle, Star-like","Object Features":"Unknown","Log Number":"US-11092012-0002","Weather Factors":"Unknown","Country":"United States","Date of the Event":"10/17/2012 10:30 UTC","Date Submitted":"11/09/2012 12:14 UTC","Case Number":"43787","files":["/var/www/straped/mufon/html2text/43787.html.txt","/var/www/straped/mufon/org/43787.html"],"Tags":"City","Viewing Distance":"Over One Mile","trends":["There have been no other sightings in Coloma Charter Township","This sighting has never been favorited."],"divs":["Sighting DetailsMy girlfriend and I were taking a walk on the beach at night watching the stars. While sitting on the beach, we both noticed two circular objects above the water. At first we thought they were stars, but suddenly they started moving above the water in different directions. That is when we started paying close attention to these star like objects. At night it is normal to see planes flying high in the sky leaving or arriving in Chicago. All these planes fly very high, but these objects were flying very low above the water and were moving at very high speeds. We didn't know what to think about these objects, but things really got strange when all of a sudden they were six of them. After serving several years in the military and witnessing all types of planes and helicoptors in flight, it was apparent that we were witnessing some very special type of flying machines. We were both excited and could not believe what we were witnessing, but it was happening and it continued to happen for about half hour. They all seem to surface from the water. We never notice them come from the sky down, but up from the water. We lost sight of them after they seem to go down into the water. In the eight years I have walked on that same beach at night, this is the first time I have ever witnessed anything like that."]}