{"Region":"Ontario","files":["/var/www/straped/mufon/html2text/43799.html.txt","/var/www/straped/mufon/org/43799.html"],"Tags":"City","Viewing Distance":"Over One Mile","Case Number":"43799","Date Submitted":"11/09/2012 04:38 UTC","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=46.26687,+-79.436832(43799)&iwloc=A&hl=en\"> mufon case (43799) map </A>","Weather Factors":"Unknown","divs":["Sighting DetailsI was driving home from work and spotted an orange glowing object which I thought was a little cloud. (Clouds get orange around sun set) However, there were no clouds in the sky that day. This is what made me pay more attention to the object as it hovered without movement for 20 seconds or so. It then suddenly turned bright white as if it had been engulfed with light. That was when it started heading East at remarkable speed. As it traveled, it also began to return to it's original orange glow. At this point I realized that it was not something explainable through conventional means and attempted to take pictures. I was able to get two pictures with my IPhone 3g. Unfortunately, the third photo caused my battery to die and it did not register. The object is a bit difficult to spot in the photos. In the first photo it is seen at roughly 700 pixels from the left and 865 pixels from the top. In the second photo it is spotted at roughly 660 pixels from the left and 965 pixels from the top. There must have been others to have seen it as it was near rush hour and there were many vehicles ahead of me. I made a right turn (At the traffic light visible in the first photo) to try and follow it but I eventually ran out of road and it sailed off into the distance."],"Date of the Event":"11/07/2012 04:46 UTC","trends":["There have been 12 other sightings in North Bay","There were no other sightings in North Bay on or around November 7th 2012"],"Summary":"Orange glowing disk-like UFO over North Bay, Ontario","Sighting Duration":"00:02:00","Disposition":"Unresolved","Longitude":"-79.436832","Log Number":"CA-11092012-0014","Source":"MUFON","City":"North Bay","Object Flight Path":"Hovering then path,Straight-line path","Country":"Canada","Object Shape":"Disc","Latitude":"46.26687"}