{"Weather Factors":"Unknown","Disposition":"Unresolved","City":"Woodbine","Latitude":"30.872483","Log Number":"US-11092012-0005","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/43790.html.txt","/var/www/straped/mufon/org/43790.html"],"Region":"Georgia","map":"<A HREF = \"http://maps.google.com/maps?q=30.872483,+-81.584411(43790)&iwloc=A&hl=en\"> mufon case (43790) map </A>","Longitude":"-81.584411","Viewing Distance":"101-500 Feet","Country":"United States","Object Features":"Window(s)","Object Flight Path":"Path then hovering","Date of the Event":"11/08/2012 12:00 UTC","divs":["Sighting Details At around 9p.m. I was walking my dog when I observed in the distant western sky an elongated lit object slowly headed my way. I initially thought that it must be a large helicopter from the near by Navy base. As it got closer I was struck by the fact that there was no noise from the craft. I continued to watch as it got very close and was at about a 40 degree angle to me. It hovered completely still for maybe 30 seconds. I was amazed by how clearly I could see the object. It was saucer shaped and resembled two diner plates placed facing each other but not touching. There were red, blue , green and white lights blinking along the top and bottom edges. There was no dome feature visible. To me the most amazing detail was the mid-section of the craft. It was clearly divided into three sections that resembled large windows even though I could not see through them and they might have been just a lightly colored metal different from the top and bottom section of the craft. As I continued to watch it suddenly shot off rapidly and horizonally and was only partially visible behind the trees. At this point you could no longer make out any detail. I ran into the house and told my wife and 12 year old grand-son to come outside. Only my grand-son responded. By the time he came outside you could only see what looked like a very small portion of light through the trees. The really strange thing was that about 30 seconds after the craft was no longer visible the largest fireball meteor that I have ever seen shot across the sky and appeared to burn out while it was still high in the sky. My grand-son was very startled by the meteor. I am a U.F.O skeptic who grew up around the military and have seen every type of aircraft but I have never seen anything resembling this craft. It was the classic saucer. I am no longer a skeptic. Flying disks do exist. I don't know where they originate. Even though I know what I saw was unlike anything I've seen in my almost 60 years of life, I still do believe that these craft are extra-terrestrial. I am shaken by what I saw and find myself unable to sleep just thinking over and over about the sighting and trying to remember any new detail that I might have over-looked."],"Object Shape":"Disc","Tags":"City","Case Number":"43790","trends":["There have been no other sightings in Woodbine","This sighting has never been favorited."],"Date Submitted":"11/09/2012 12:49 UTC","Summary":"Elongated lighted object in night sky slowly coming towards my location then hovering . Close. very defined. very eluminated and detailed..","Source":"MUFON"}