{"City":"Lexington","divs":["Sighting Detailsi was watching t.v. late at night when a tower next to me house started acting strange (i suspect the ufo was disrupting it) when i looked out the window to see what was happening i saw a bright light to low to be a star and wasn't being phased out by the city lights i first thought it might be a jumbojet or helicopter a few days earlier i had barrowed a friends digital camera so i dicided to snap a few picture as it started to move to my right while moveing up at the same time slow incline i snaped 3 pictures then continued to observe the object it looked like just a ball of light from far away but when i zoomed in on the picture i saw a dic like object with a dome on top it was a gun metal silver color i wasent surprised at this event at the time iv been obsever to many ufo sightings before this so if anything i was exited im a ufo hunter by trade i continued to watch the ufo until it got in the middle of an open patch of sky about 5 inches from where it started in the sky it flashed once and the a small streak of light can be seen in one of my photos (which have amazing clearity of the object) as the craft left the skys it appeared 2 days in a row and never returned a few days later i found a picture nasa had takin of a ufo near the moon and when i compared the two pictures they are identical."],"Region":"North Carolina","Sighting Duration":"00:46:00","Longitude":"-80.243584","Log Number":"US-02042006-0008","Country":"United States","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.827096,+-80.243584(4379)&iwloc=A&hl=en\"> mufon case (4379) map </A>","Date of the Event":"10/02/2005 01:24 UTC","Summary":"silver disc ,20 ft tall, 30-40 ft wide, 4-6 miles away, 2 miles high, amazing speed","Case Number":"4379","trends":["There have been 3 other sightings in Lexington","There were no other sightings in Lexington on or around October 2nd 2005","This sighting has never been favorited.",""],"Object Shape":"Circle, Disc","Weather Factors":"Windy","Tags":"City","Disposition":"Hoax","files":["/var/www/straped/mufon/html2text/4379.html.txt","/var/www/straped/mufon/more/4379_submitter_file1__ufo1.jpg","/var/www/straped/mufon/more/4379_submitter_file2__ufo2.jpg","/var/www/straped/mufon/more/4379_submitter_file3__ufo3.jpg","/var/www/straped/mufon/org/4379.html"],"Latitude":"35.827096","Date Submitted":"10/02/2005 01:24 UTC","Object Flight Path":"Undisclosed","Source":"MUFON","Viewing Distance":"Unknown"}