{"Weather Factors":"Unknown","City":"Troy","Tags":"City","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.612459,+-83.14266(43802)&iwloc=A&hl=en\"> mufon case (43802) map </A>","Object Features":"Patterned Surface, Other","Summary":"Seen in sw sky of troy mi then heading north/northeast. Object moving very slow and/or hovering and 5 to 6 airplanes heading toward object fromt the east. Total sighting 15 minutes. Cars on Rochester Rd. slowing down/pulling over then police sirens.","files":["/var/www/straped/mufon/html2text/43802.html.txt","/var/www/straped/mufon/org/43802.html"],"Object Flight Path":"Path then hovering","Date Submitted":"11/09/2012 08:29 UTC","Latitude":"42.612459","Date of the Event":"11/09/2012 06:25 UTC","Disposition":"Unresolved","Log Number":"US-11092012-0017","Region":"Michigan","Object Shape":"Cone, Diamond, Teardrop, Triangle","divs":["sighting detailsmy son and i were heading from home to pickup a pizza. 1st saw object in southern sky over treetops as we exited subdivision. object looked extremely large, too large to be an airplane (which is what we thought it was at first). object was dull grey in color and looked cigar shaped from the rear with 5 lights. lost sight of it behind trees. continued south on rochester rd. with no sight of it. as we exited pizza place facing east, saw 5 or 6 airplanes flying from east to west and saw object again behind us over tree tops. object again appeared dull grey in color with 4 noticeable lights on top and was either diamond, teardrop or cone shaped. object moving very slowly in a north east direction. noticed cars slowing down on rochester rd. pulled onto rochester road to do u-turn and object was visible over left shoulder. police cars and sirens flying by southbound and vehicles pulling over and into middle lane. stopped at red light and took photo over my shoulder out the car window. object was very large and not extremely far away. i thought this was very weird, like nothing i had every seen before. my son, 8 years old, was a little freaked out. continued north on rochester rd. to home, could not view object from subdivision (too many trees). noticed many airplanes in sky circling as if waiting to land at airport which is about 40 miles away from our home. none of these airplanes looked like the object we saw. this continued until 7:30 pm. looked on local news website for any reportings of sightings and then went to internet to see if any sightings of ufo in michigan resembling object we has seen. we didn't find much. now i'm typing this description and my son has drawn a picture. i also have the picture i took over my shoulder out the car window with my cell phone. object in picure is in upper right corner. if you zoom in, you can see the cone\\pear shaped object and the lights on it."],"trends":["There have been 18 other sightings in Troy","There were no other sightings in Troy on or around November 9th 2012"],"Case Number":"43802","Longitude":"-83.14266","Country":"United States","Source":"MUFON","Sighting Duration":"00:15:00"}