{"Country":"United States","Date of the Event":"11/06/2012 09:00 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.110279,+-117.091214(43803)&iwloc=A&hl=en\"> mufon case (43803) map </A>","Viewing Distance":"Over One Mile","Case Number":"43803","Sighting Duration":"Undisclosed","Region":"California","Latitude":"33.110279","City":"Escondido","Object Shape":"Fireball","Log Number":"US-11092012-0018","trends":["There have been 28 other sightings in Escondido","There were no other sightings in Escondido on or around November 6th 2012"],"Summary":"red light flew, stopped, hovered, dropped red flare like objects, several, then flew again, then disappeared","Longitude":"-117.091214","Object Features":"Other","Source":"MUFON","divs":["Sighting DetailsI just pulled into the grocery store parking lot and hadn't yet gotten out of my car because i was talking on my cell phone, when i started watching this red light in the sky that struck me as strange, because there was no blinking... and it's flight was at first a little haphazard and i was uncertain as to whether or not it might somehow be something helium on fire, it looked sort of like it was on fire. Then it clearly stopped moving, and stayed perfectly stationary for approximately 20 seconds while it dropped several red objects, that looked like they were burning, and fell a good distance from the ufo, before they disappeared, after it seemed to have finished it's ejections, it took off, very clearly sideways and purposefully with what looked like pretty good speed to me, no longer any question that this object had a propulsion method of some sort, though it was silent, if it were a helicopter at this distance I would have been able to hear it. It changed direction a little haphazardly one more time before it either extinguished it's lights or went out of range for me to see. Later I googled on the internet \"ufo dropping red things, and found several links reporting similar events in Utah almost 2 years ago, but that was all I found that was similar."],"files":["/var/www/straped/mufon/html2text/43803.html.txt","/var/www/straped/mufon/org/43803.html"],"Object Flight Path":"Hovering then path","Disposition":"Unresolved","Tags":"City","Date Submitted":"11/09/2012 10:23 UTC"}