{"Country":"United States","files":["/var/www/straped/mufon/html2text/4381.html.txt","/var/www/straped/mufon/more/4381_submitter_file1__Object.JPG","/var/www/straped/mufon/org/4381.html"],"Date of the Event":"12/09/1965 04:45 UTC","trends":["There have been 27 other sightings in Newark","There were 3 other sightings in Newark on or around December 9th 1965","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Source":"MUFON","Object Features":"None","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=40.741587,+-74.169047(4381)&iwloc=A&hl=en\"> mufon case (4381) map </A>","Latitude":"40.741587","Tags":"City","Object Shape":"Fireball","Date Submitted":"12/09/1965 04:45 UTC","divs":["Sighting DetailsOn the evening of December 9th, 1965, I was waiting in line to go to dinner (I was in a youth facility at the time) While waiting I looked up at the moon (which was on my left) The sky was clear, and while gazing I saw a small object come from what looked to be the left side of the moon. The object was small, but grew in size as it made it's way toward me. It had to be traveling quite fast, as it was right in front of me within less than a minute. The object was a HUGE fireball...It seemed to be quite low in the sky and moved pretty slow considering it's size. I would liken it to a Jet as it comes in for a landing (the speed) The whole group of us were shouting and pointing and trying to figure out what we were seeing. Most thought it was a Meteor, some called it a 'falling star'. I was just in awe...I felt I witnessed something SPECTACULOR and NOT a meteor! That was 41 years ago..I was 15 or 16 at the time, and I have never forgot what I saw...it wasn't until recently that I realized that I just might have witnessed what is now known as the 'Kecksburg UFO' The memory of that evening is still clear in my mind. The object traveled from west to east (from where I was standing) The exact physical address I was at at the time was 499 Belgrove Drive, Kearny New Jersey (facing the Passiac River towards Newark New Jersey) The object seemed to get slower and traveled until it was out of my line of sight."],"Summary":"Object came from the left side of the moon.","Case Number":"4381","Object Flight Path":"Path with directional change","City":"Newark","Region":"New Jersey","Disposition":"Unknown","Log Number":"US-02042006-0010","Longitude":"-74.169047","Viewing Distance":"101-500 Feet"}