{"Disposition":"Unresolved","Object Shape":"Unknown","Object Flight Path":"Stationary","Region":"Texas","Longitude":"-97.337132","files":["/var/www/straped/mufon/html2text/43816.html.txt","/var/www/straped/mufon/org/43816.html"],"Tags":"City","Date of the Event":"11/07/2012 06:15 UTC","Object Features":"Unknown","Country":"United States","Case Number":"43816","Log Number":"US-11102012-0009","Weather Factors":"Unknown","Source":"MUFON","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=31.107734,+-97.337132(43816)&iwloc=A&hl=en\"> mufon case (43816) map </A>","City":"Temple","Sighting Duration":"Undisclosed","Latitude":"31.107734","Date Submitted":"11/10/2012 03:24 UTC","divs":["sighting detailsgoing to dinner with my grandparents in temple, texas. it was dusk, 6:15pm on november 7th, 2012. driving (nne) up the busy i-35n. i was seated in the backseat. i was gazing out of the right back passenger side absentmindedly, directly to my right (ese) i noticed two bright yellow-orange lights the size of a regular plastic thumbtack at about 20-25 degrees above the horizon. the bright lights were exactly level, about an inch apart from each other (naturally, the scale is my perspective) either hovering or moving exactly horizontally either toward or away from my point of reference. it is possible the lights were connected to either side of the same object. i noticed absolutely no wavering in the lights, so i alerted my grandparents. they are very rational business-owning folk, and they first wrote it off as helicopters in training. i pointed out (from my knowledge) that all commercial air vehicles must have blinking lights on the port and starboard, and that the head (or tail) lights of aircraft (including all standard personal and military craft) are always bright white, not the yellow-orange. my grandfather has had his pilots license for 30+ years and he agreed with me. he stated that he had never observed such an obviously large aircraft (or crafts) such as this (these). they have lived within a 15 mile vicinity of the sighting for 10+ years, and confirm there are no human architected objects (antennae, towers, buildings) in the line of sight of these objects. my family were moderately interested, and i was in complete awe of these unidentified objects. five minutes pass with more speculation, no wavering in size nor distance apart. we then noticed black, thin, barely visible trails spanning two inches directly vertically from both lights. ten more minutes pass and no visible change in the size, dimensions, level, orientation, visibility, nor trail (line\\beam?) length...although we had traveled an additional 9 miles nne on the i-35n. we arrived at our destination at ~6:35pm, and the lights were still present, unchanging. we enter the restaurant and continue with our evening. upon exiting the restaurant at ~7:10pm, the object(s) were no longer visible."],"Summary":"Two bright yellow-orange ESE of I-35N, Temple TX. Hovering level with each other, short black vertical trails.","trends":["There have been 10 other sightings in Temple","There were no other sightings in Temple on or around November 7th 2012"]}