{"City":"Oakley","Tags":"City","Disposition":"Unresolved","Object Features":"None","Log Number":"US-11102012-0005","Date of the Event":"11/04/2012 09:20 UTC","Region":"California","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Country":"United States","Summary":"We saw a Solid, Dark, Narrow, Triangular shaped object, lights on each corner, point in the rear, very low in the sky and extremely loud,","Latitude":"37.984695","map":"<A HREF = \"http://maps.google.com/maps?q=37.984695,+-121.734913(43811)&iwloc=A&hl=en\"> mufon case (43811) map </A>","Longitude":"-121.734913","Weather Factors":"Unknown","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/43811.html.txt","/var/www/straped/mufon/org/43811.html"],"Date Submitted":"11/10/2012 04:22 UTC","divs":["Sighting DetailsOakley, California, Sunday, November 4. 2012 at approx. 9:20 pm. We were at home and all heard a very loud rumbling sound, \"it was like a 747 was dropping from the sky.\" We ran to our rear yard and immediately noticed a very large, narrow, Triangular shaped aircraft approx. 100 to 125 ft long and 50 to 75 ft wide. It had a solid smooth surface, straight lines, dark in color, with no writing or makings. There were three lights, one on each corner, it was flying very low and very slow, coming from the east over our housing track, and light enough to see pretty good. As it slowly passed, the aircraft was almost directly above the three of us, and we all said the same thing, \"it has No wings, and it has No rotors\". But, what also struck us as odd, was that the narrow point of the triangle was in the rear, which is opposite of the Stealth Bomber and this aircraft was much narrower. We wondered if this was some new aircraft out of Travis Air Force base which is about 40 miles north of us. Evan so, why would the military be flying anything so loud, and so low at that time of night over housing tracks? We watched for about 2 to 3 more minutes as it continued west, and lost sight of it through the distant trees. Quite a sight to see!"],"Object Flight Path":"Straight-line path","Source":"MUFON","trends":["There have been 4 other sightings in Oakley","There were no other sightings in Oakley on or around November 4th 2012"],"Case Number":"43811"}