{"Region":"North Carolina","Object Shape":"Square, Rectagular, Other","Date of the Event":"11/08/2012 06:25 UTC","Date Submitted":"11/10/2012 03:14 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.890348,+-78.504271(43815)&iwloc=A&hl=en\"> mufon case (43815) map </A>","trends":["There have been 4 other sightings in Sunset Beach","There were no other sightings in Sunset Beach on or around November 8th 2012"],"Country":"United States","Tags":"City","files":["/var/www/straped/mufon/html2text/43815.html.txt","/var/www/straped/mufon/org/43815.html"],"divs":["sighting detailsgoing south on rte #179 in calabash, nc heading towards sunset beach. as we approached the calabash river bridge, i looked towards the se over oyster bay golf course and remarked to my son to look at those stars, they definely were different. there were 4 yellow to orange lights in a perfect trapazoid confiuration and all of a sudden they all went out at once. we viewed them for about 5 seconds. crossed over the bridge, pulled over, my son got out to find the lights - nothing. went to sunset beach about three miles down the road and saw nothing. this took place on november 8th, 2012 at 6:25pm. i am an avid star gazer and have never witnessed anything like this before. i kind of feel uneasy knowing that something is up there unexplainable. i didn't feel easy about letting my dog out that night my son feels excited and somewhat confused. when we got home, we went on a ufo sight and saw that an orb was spotted in sc\\nc border heading to nc. maybe this was something of the same. but i didn't see any orb."],"Latitude":"33.890348","Disposition":"Unresolved","Longitude":"-78.504271","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Source":"MUFON","Log Number":"US-11102012-0008","Weather Factors":"Unknown","City":"Sunset Beach","Viewing Distance":"Unknown","Object Features":"None, Unknown","Summary":"4 bright yellow/orange lights in trapazoid perfect shape after 5 or so seconds lights when out completely.Went looking for it at beach area and nothing.","Case Number":"43815"}