{"Date Submitted":"11/11/2012 01:56 UTC","trends":[],"City":"Undisclosed","Country":"United States","Date of the Event":"11/11/2012 12:00 UTC","Region":"North Carolina","Viewing Distance":"Unknown","Log Number":"US-11112012-0002","files":["/var/www/straped/mufon/html2text/43827.html.txt","/var/www/straped/mufon/org/43827.html"],"Weather Factors":"Unknown","Case Number":"43827","Object Shape":"Star-like, Unknown","Longitude":"-79.01451","Latitude":"35.769193","Disposition":"Unresolved","Source":"MUFON","Object Features":"Unknown","Tags":"City","divs":["Sighting DetailsLetting my dogs outside standing in my yard, I looked up at the stars, I recognized Venus as the brightest body in the sky. Smaller but brighter than all the stars, I noticed this: I observed a star-like white light in the low SE sky at about 12AM. It looked like it twinkled like any star but it was bigger than all other stars. It started moving slowly down slightly for a few seconds. It stayed stationary for a few seconds. Then it moved up for a few seconds. Then it stayed still for a few seconds. Then it went slower in a constant direction. From my perspective standing on the ground, the direction was from lower left to upper right at a slight angle (about 20 degrees from level). I went into the house and told my girlfriend and her grandson. I was curious but not thrilled or excited at this time. I got a video camera that can zoom in 30xs but couldn't get it in my view. (Too small and had no reference in the dark surroundings to aim it properly. I then got a cheap pair of binoculars and focused. Still the object shape was indecipherable. I could make out the flashing lights (red, yellow, blue, and green) inside the white dot that this seemed to be. My girlfriend and her grandson came out to observe the same thing and we were all convinced that this was not a helicopter, plane, or even a blimp. The object appeared to be too high in the sky to be that. Even a blimp half a state away couldn't have flashing lights that powerful to be seen by us. I went into the house at least three times between 12:00 when I first saw it and 12:25. About then the other two returned inside. I stayed and watched for 15 minutes or so. At 12:42AM, I started filling this report. I returned outside to see it still moving very slowly in the same direction as before. Through the binoculars, I focused down to a tight white ball with flashing colored lights around the circumference of it. After entering the house again at about 1:05 to let the dogs back in and to check MUFON and Google Earth on more time, I came out to find it gone."],"Summary":"Star-like, stationary, then moving slowly pulsing red, yellow, blue, and green","map":"<A HREF = \"http://maps.google.com/maps?q=35.769193,+-79.01451(43827)&iwloc=A&hl=en\"> mufon case (43827) map </A>","Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed"}