{"Viewing Distance":"21-100 Feet","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Latitude":"32.690461","Summary":"We saw this glowing object from our back yard for a couple of minutes. ,","City":"San Diego","Region":"California","files":["/var/www/straped/mufon/html2text/43823.html.txt","/var/www/straped/mufon/org/43823.html"],"Object Shape":"Oval","Longitude":"-117.043255","Date Submitted":"11/10/2012 09:51 UTC","Case Number":"43823","Object Features":"Dome","Weather Factors":"Unknown","Date of the Event":"09/11/2007 11:30 UTC","Tags":"City","Sighting Duration":"Undisclosed","Source":"MUFON","Log Number":"US-11102012-0016","map":"<A HREF = \"http://maps.google.com/maps?q=32.690461,+-117.043255(43823)&iwloc=A&hl=en\"> mufon case (43823) map </A>","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around September 11th 2007"],"divs":["Sighting DetailsIt was late at night and I saw a glow of orange light from the back side of the house,so I told my son to come with me outside, He followed me and we saw this beautiful glowing football shaped object, the size of a car to have a reference, next to the electricity post and it had a cylinder shape dome(sort of transparent)being Orange-Red the predominant color. It ranged in color from orange to Bright Yellow for a split second,then Bright white for another split second ,and back to the Orange-Red Color, It seemed like it was spinning horizontally .And it didn't make no noise. than it moved closer to another electric post and after a little bit It slowly went away towards the west .Once it was far, we saw it split in two lights that took different ways.One to the south,and the other one to the North.My Son was able to take a couple of pictures and all we got was a twisted filament of light, like if it was a WORM. Unfortunately we lost those images. The only UFO's similar to this one are the so called PLASMA UFO's for what I've heard, I wonder if you had any other reports for this same lights ever???? Thank You for your Attention."],"Country":"United States"}