{"City":"Greenville","Longitude":"-84.627912","Disposition":"Unresolved","Weather Factors":"Unknown","Object Features":"Dome","Log Number":"US-11112012-0001","Latitude":"40.111036","trends":["There has been one other sighting in Greenville","There were no other sightings in Greenville on or around November 18th 1967"],"Country":"United States","divs":["Sighting DetailsThe farm where we lived was in rural Darke county, 3 miles south of Gettysburg ,Ohio and 6 miles north of Pitsburg, Ohio on Pitsburg-Gettysburg Road. We were neighbors to the Pastor of our local Church of the Brethren. Our family was quite involved with the church so a lot of time passed before we could begin to tell the stories without the ridicule of being called CRAZY and many other things. The Adults were watching the evening news so my sister and I went to play. Me and my younger sister were playing sliding down the stairs on a pillow from our bedrooms down to the family room. We were living with our Grandparents due to divorce of our parents. My sister tired of sliding after a while (even with the pillow it kind of hurt your butt from hitting each wooden step going down). I climbed back to top of stairs to ride down again when these 2 gray colored beings appeared in front of me and I was frozen not able to move. They had touched some kind of small box on the front of their body at waist height. Whatever it was caused me to become froze in the position I was in. I was trying to scream, but nothing happened. These beings were about my same height but had large heads, large eyes(like a deer) small nose and mouth. They were both looking me over bending their heads to the side as the looked me over. They were able to communicate with me through my mind. I could hear them talking to each other and also with others? They appeared to have some type of clothing like a jumpsuit or like and it was the same color as their skin. Only this box thing was a different color and was the size of two cigarette packs put together. I am not sure of how long I was froze ? All I could do was move my eyes around. I even closed them hoping upon opening this would just be a bad dream or something, but they were still there ! They seemed to be able to float in air as the moved to my mothers bedroom and went out through the south window and they floated ( I assume ) down to the ground. I think in about one minute from them leaving I was able to move again and I went to the window and looked out and down seeing the two beings now meeting up with three others. The field they were walking in was cornstalks. My grandfather and I had just finished picking that field of corn (20 acres) earlier that week. The craft was about 500 ft from the house. just north of our neighbors woods. They were walking southwest to the corner of our farm .In the corner was a saucer shaped craft lit up in a metallic color. They seemed to climb a walkway and entered craft. It changed color and rose off ground and left in a southern direction changing to all types of colors as it traveled. In about 30-40 seconds it seemed to go supersonic and was gone. I went downstairs and sat on the floor and watched TV with my grandparents and my mother and sister. I never did say anything to any adult about this till years later, only to my sister whom believes me cause she had seen these beings at times also. I have never been froze like this ever before and it was frightening trying to scream for help and nothing happens !!!! And these beings looking me over was the MOST frightened moment of my life. This is the beginning of several sightings of these beings on our farm and also at the neighbors also . There 4 other adults besides me who saw these and experienced several sightings the next 10-20 years. I finally went around to my old neighbors and told them what had happened to me and what I saw. All of them agreed to what I saw . They each have many stories to tell themselves. They all thought NO one would believe what they saw and say they were CRAZY so they've kept quiet up till now. We are compiling notes and dates so we can accurately fill out reports. The most common thread of all the stories is how frightening each instance was , even as adults. Plus none of us wanted to see what we saw. It still haunts a couple of us. It is like we are marked and or they know how to find us !!!! Because of the many times they have visited us. In summery, there was no sound that I could tell from the craft, but I was inside the second story watching the craft leave from about 500 southwest of the farmhouse. It was A late Nov. fall nite clear no clouds. when Craft took off it was changing into many different colors."],"Object Flight Path":"Hovering then path,Path with directional change","Sighting Duration":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/43826.html.txt","/var/www/straped/mufon/org/43826.html"],"Viewing Distance":"101-500 Feet","Region":"Ohio","Tags":"City","Object Shape":"Disc, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=40.111036,+-84.627912(43826)&iwloc=A&hl=en\"> mufon case (43826) map </A>","Date of the Event":"11/18/1967 12:00 UTC","Case Number":"43826","Date Submitted":"11/11/2012 12:57 UTC","Summary":"@ Grays were upstairs in house. as I went to enter my bedroom from top of stairs ,these two Grays appeared and pressed a box or something attached to their jumpsuit at belt level in front on them causing me to freeze,unable to move."}