{"Sighting Duration":"Undisclosed","Longitude":"-84.183387","Date Submitted":"01/30/2006 12:07 UTC","files":["/var/www/straped/mufon/html2text/4382.html.txt","/var/www/straped/mufon/org/4382.html"],"Source":"MUFON","trends":["There have been 40 other sightings in Dayton","There were no other sightings in Dayton on or around January 30th 2006","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Latitude":"39.767828","Tags":"City","Object Features":"Unknown","Disposition":"Unresolved","Country":"United States","divs":["Sighting DetailsAs I was driving home from work going North on I-75 approximately 2-3 miles north of Downtown Dayton I saw three bright yellow stationary lights in the east. From my vantage point they appeared to be at a roughly 45 degree angle to the horizon. It looked like they were in an echelon formation and the first (most northern) light was smallest, the second larger and the third (most southern) was the largest giving the impression that they were not geometrically 'on-line' in regards to my direction of travel. Furthermore, as I slowed my vehicle and peered (quite dangerously so) out my passenger side window I looked for flashing 'anti-collsion' lights that all known aircraft have and saw none on any of the lights. About 2 minutes into my observation I noticed the largest (closest?) of the lights moving off in a north easterly direction. The others remained stationary or nearly stationary. I followed the moving light (the biggest one) as it slowly moved NE and I began to lose sight of the other two. I decided to take the next exit ramp to get a better vantage point and when I did I momentarily lost sight of all three lights. When I regained a visual I saw a similar light but it had aircraft strobes and anti-collision lights on it and was going in nearly the opposite direction! The area I was now in was a valley and the surrounding buildings and trees obscured further viewing. I made the rest of the trip home without seeing the lights again. I am not one to make half-cocked assumptions and I've never seen a true UFO before. However, these lights intrigued me and I haven't stopped thinking about them since. What were they? I forgot to mention that for the 6-7 minutes I viewed these lights, i traveled about 3 miles north on 75 and about .5 miles east on whatever exit road I took. SIDE NOTE: we do have Wright-PAT close by but I'm a native Daytonian and I am quite sure it was no airforce bird."],"Date of the Event":"01/30/2006 12:07 UTC","Log Number":"US-02052006-0001","Case Number":"4382","Object Flight Path":"Stationary,Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=39.767828,+-84.183387(4382)&iwloc=A&hl=en\"> mufon case (4382) map </A>","City":"Dayton","Summary":"I observed 3 distinct, yellowish lights in the Eastern sky","Object Shape":"Star-like","Region":"Ohio","Viewing Distance":"Unknown"}