{"Date of the Event":"11/09/2012 07:40 UTC","Tags":"City","Summary":"Triangle body with soft glowing white lights.","Object Flight Path":"Straight-line path","divs":["Sighting DetailsMy four year old son and I had just gotten out of our car in a parking lot of a local high school to attend a football game. The game had already started, so we were in the parking lot alone. As we got out of the car, my son saw some lights in the sky, and alerted me to the \"airplane.\" For a moment or two, I did not look up because I was preoccupied with securing my vehicle, and making sure my son was safely near me before walking to the football field. After I took his hand, I glanced upward and saw a very unusual \"airplane\" at about 80 degrees. It was triangle shaped (equilateral) and had softly glowing white light along it's two forward edges. It appeared to be sub-divided by softly glowing light into six smaller equilateral triangles. It was moving at a high rate of speed in a straight-line flight path and I estimate that it was at an altitude of 5000 feet. The object passed directly overhead, and was silent. The object seemed to disappear when it was at about 70 degrees from my position. I estimate the duration of the event at between five and seven seconds."],"Date Submitted":"11/11/2012 10:11 UTC","Country":"United States","Longitude":"-81.648161","Region":"Florida","Disposition":"Unresolved","Latitude":"30.334444","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=30.334444,+-81.648161(43834)&iwloc=A&hl=en\"> mufon case (43834) map </A>","Weather Factors":"Unknown","trends":["There have been 66 other sightings in Jacksonville","There were no other sightings in Jacksonville on or around November 9th 2012","This sighting has never been favorited.",""],"Object Features":"Patterned Surface","Sighting Duration":"Undisclosed","City":"Jacksonville","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/43834.html.txt","/var/www/straped/mufon/more/43834_submitter_file1__SANY0002.JPG","/var/www/straped/mufon/org/43834.html"],"Case Number":"43834","Log Number":"US-11112012-0009","Viewing Distance":"501 Feet - 1 Mile"}