{"Case Number":"43831","Longitude":"-84.498566","Country":"United States","divs":["sighting detailsmy wife and i were on the back patio of our home enjoying an outdoor fire from approximately 8pm until 9:30pm est. sky was dark and clear, with no visible cloud cover. at approx. 8:10pm we observed a stationary cluster of bright white lights that flashed on and off three times, similar to the size and appearance of commercial aircraft running lights. however, these lights were configured in a straight line, and in close proximity to each other. the center light appeared larger than the lights on each side of it. object was approx. 70 degrees above us on the horizon and due west. the height seemed to be very close to that of commercial aircraft flight, but could've been higher... it was hard to judge due to the object only emitting bright light against a dark, clear sky. we noticed that the object did not track across the sky, but stayed in the same place throughout the duration of the viewing. i witnessed a total of three random flashes over the course of approx. 20-30 seconds, while my wife only witnessed one of the flash intervals. the on\\off interval was random, meaning no set pattern of interval. the object stayed in place and did not move. after the three flashes, the object disappeared but we kept scanning the spot for several minutes afterward hoping to see it again."],"Source":"MUFON","Tags":"City","trends":["There have been 43 other sightings in Lexington","There were no other sightings in Lexington on or around November 10th 2012"],"Log Number":"US-11112012-0005","Summary":"Cluster of three stationary white lights in sky. Larger light in middle flanked by smaller on each side. Blinked randomly (3 times) then disappeared.","Viewing Distance":"Over One Mile","Date of the Event":"11/10/2012 08:10 UTC","Weather Factors":"Unknown","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Date Submitted":"11/11/2012 08:42 UTC","Latitude":"38.042954","files":["/var/www/straped/mufon/html2text/43831.html.txt","/var/www/straped/mufon/org/43831.html"],"Object Features":"Unknown","Region":"Kentucky","Object Shape":"Flash, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.042954,+-84.498566(43831)&iwloc=A&hl=en\"> mufon case (43831) map </A>","Object Flight Path":"Stationary","City":"Lexington"}