{"Country":"United States","Object Features":"Dome, Patterned Surface","Case Number":"43835","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Disposition":"Unresolved","Latitude":"29.845275","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=29.845275,+-95.890275(43835)&iwloc=A&hl=en\"> mufon case (43835) map </A>","divs":["sighting detailsi was on my front porch taking pictures of the sunset, with my ipad, which i often do. i usually take a lot of pictures because i like photography. when i showed them to my wife,suzi, we noticed the green sphere like object in the sky and both observed the it was moving back and forth and up and down, we both knew this was not a plane. there also was another, smaller object. the pictures were taken between 2 and 4 seconds apart, so it was moving at a great speed. there is a small airport nearby, and we are very familiar with the landing and flight patterns, also colors of airplanes. there is a green outline in the clouds, and it looks like a green beam going downward. the object changed shape or possible turned over,and went to the south where it seemed to join with a cloaked large object, which can be seen in the last photos, it looks like a cloud, but there is a clear outline of a huge disk, and cloud\\vapor trail coming from the south\\southwest. we put the photos onto our computer and enlarged them and in some of the pictures of the green sphere you can see what looks like windows, and it appears to be acorn shaped, when it changed directions, you can see rows of lights, and on each side there are three lights. since this happened, we have both had feelings of anxiety, and we keep looking at the pictures, we are sending several to you but quite a few more were taken. we last saw it when it seemed to join the larger disk. these objects were not visible with our eyes and we saw them after we looked at them on the ipad. the sky was unusual that evening, there had been a rain\\thunder storm earlier in the day. we have more pictures, but can only send 10 to you on this site."],"Source":"MUFON","Longitude":"-95.890275","City":"Katy","trends":["There have been 21 other sightings in Katy","There were no other sightings in Katy on or around November 3rd 2012"],"Object Shape":"Boomerang, Disc, Sphere, Triangle","Log Number":"US-11112012-0010","Region":"Texas","Date Submitted":"11/11/2012 10:34 UTC","files":["/var/www/straped/mufon/html2text/43835.html.txt","/var/www/straped/mufon/org/43835.html"],"Date of the Event":"11/03/2012 05:30 UTC","Tags":"City","Summary":"I was taking pictures of the sunset with my IPad, which I often do whenever it looks interesting and after looking at the pictures, we noticed the green sphere object."}