{"Country":"United States","Date of the Event":"11/11/2012 11:15 UTC","City":"Pinole","Sighting Duration":"Undisclosed","Source":"MUFON","Date Submitted":"11/11/2012 03:16 UTC","Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Case Number":"43839","Region":"California","Summary":"Ufo flew along chemtrail until plane appeared","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Weather Factors":"Unknown","Longitude":"-122.275536","trends":["There have been 2 other sightings in Pinole","There were no other sightings in Pinole on or around November 11th 2012"],"Log Number":"US-11112012-0014","Tags":"City","files":["/var/www/straped/mufon/html2text/43839.html.txt","/var/www/straped/mufon/org/43839.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.999345,+-122.275536(43839)&iwloc=A&hl=en\"> mufon case (43839) map </A>","divs":["Sighting DetailsI was outside looking at the chemtrails when I saw a small blackish in color object moving rapidly along the length of the chemtrail. I can see planes as they approach and depart from either SFO or Oakland airports and this object was much smaller and seemed to travel at far greater speeds than any planes. It traveled half the distance of my vision from the horizon on my right towards center. ( Eastern direction). When a plane appeared and was crossing its path the small object seemed to flicker and dissappear. This is my 5th sighting like this and I have 3 videos that contain these objects. Unfortunately todays I was unable to video. I also have a dozen photos with these objects in them. Usually along a chemtrail. I called my wife to see the object but she couldnt spot it before it dissappeared. I will attach 1 video of 3. At 00:33 seconds this object appears above storage tank on hill and between chemtrail before camera moves away it flashes light as it passes chemtrail and seems to have a means of propulsion that lights the aft end. I did not edit sound or video in any manner."],"Object Shape":"Sphere","Latitude":"37.999345"}