{"City":"Conyers","Log Number":"US-02052006-0002","map":"<A HREF = \"http://maps.google.com/maps?q=33.66761,+-84.01769(4383)&iwloc=A&hl=en\"> mufon case (4383) map </A>","Case Number":"4383","Tags":"City","Summary":"Looked like a star but seemed to changed shaped moved fast and slow and changed direction","trends":["There have been 5 other sightings in Conyers","There were no other sightings in Conyers on or around April 30th 2005"],"Object Shape":"Star-like, Other","Latitude":"33.66761","divs":["Sighting DetailsI was outside laying on the grass in front of my house looking at the stars. I caught view of a star that seemed different than the others. It seemed to have a more glowing light around it and the more I looked I could see some objects or lights coming from it. Than it began to move slowly and than would speed up and than slow down. I started to realize that this was no star and the strangest part was that it seemed to change into different shapes. I thought I must be going crazy or perhaps that I was really stressed from just losing my job. I tried to rationalize it but it was there in the sky. I ran inside and I told my fiancee to hurry up and come outside and see this and tell me if I was crazy. I told him I didn't know what it was but it was almost hypnotizing and it changed forms. He came out and saw it and he saw it move and he remarked that it could be a sattelite but than it changed direction as he watched and he suddenly remarked that it wasn't any sattelite that he didn't know what it was. he didn't see the forms as I did but he saw it speed up and slow down and become stationary and change direction. He also saw the more glowing light around it. We are also in a flight pattern and have alot of planes in our vicinity but this was no plane. it was single light that could speed up and slow down and come to a dead stop. We watched for a while and my fiancee finally said he did know what it was. I continued to watch a little while longer until I lost sight of it. I've never seen anything like it before. The strangest part was the feeling I felt when I was watching it. I was like mystified by it. I just can't really describe that part at a chance that I'll sound completely off my rocker but i know what I saw."],"Viewing Distance":"Over One Mile","Source":"MUFON","Disposition":"Insufficient Data","Object Features":"Other","Sighting Duration":"Undisclosed","Weather Factors":"None","Date Submitted":"04/30/2005 08:25 UTC","Object Flight Path":"Stationary,Straight-line path,Path with directional change","files":["/var/www/straped/mufon/html2text/4383.html.txt","/var/www/straped/mufon/org/4383.html"],"Date of the Event":"04/30/2005 08:25 UTC","Region":"Georgia","Longitude":"-84.01769","Country":"United States"}