{"Source":"MUFON","Date Submitted":"11/11/2012 06:59 UTC","Region":"Arizona","Weather Factors":"Unknown","Date of the Event":"11/11/2012 02:50 UTC","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/43846.html.txt","/var/www/straped/mufon/org/43846.html"],"Object Features":"Unknown","Disposition":"Unresolved","Summary":"White unknown object in sky traveling West to East direction then changed direction to go North at a faster speed when obsereved going from West to East.","Log Number":"US-11112012-0020","Country":"United States","Object Shape":"Cigar, Circle, Disc, Oval","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around November 11th 2012"],"Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was out in the backyard near downtown Phoenix on Nov. 11, 2012 doing some sketching and listening to music on my iPhone when I looked up and heard and witnessed a Southwest airplane ascending in altitude in a Northeastern direction. This is usual since I live relatively near Phoenix Sky Harbor Airport. However, as I witness the airplane I looked over to the West and witness a white gleaming object traveling in an Eastern direction. It seemed that it changed shapes, from an oval, to disc, then finally to a cigar shape before it left at a high rate of speed in a Northern direction. During the duration of what I was witnessing did the object make any noise. At first, I thought it was a piece of trash up in the sky. Maybe a trash bag. However, it changed direction to head North and left at high rate of speed. I really felt that the unknown object in the sky was strange looking and nothing like I have seen before. I stopped my music and began to take photographs of the object with my iPhone 4 camera with the HRD option on. When it turned Northward it left at a higher rate of speed when I witnessed the object traveling from West to East. NOTE: Photos that are uploaded are at Max zoom on iPhone 4 camera. Object can be seen at the lower left of photos near the telephone pole."],"Longitude":"-112.096874","Case Number":"43846","Object Flight Path":"Path with directional change","Latitude":"33.466248","Tags":"City","City":"Phoenix","map":"<A HREF = \"http://maps.google.com/maps?q=33.466248,+-112.096874(43846)&iwloc=A&hl=en\"> mufon case (43846) map </A>"}