{"Log Number":"US-11112012-0023","Latitude":"42.401807","divs":["Sighting Details1.) I was outside my home, working on my car, getting ready to take it to a shop. 2.) Well first off, I'm always looking up into the sky day or night to find strange objects. I walked out of my home and I saw something strange. 3.) a Fireball period. I've sighted 3 objects total, 2 were flaming balls. The previous time I saw flaming balls, there were a pack of them. At first I was thinking it was a plane, but there was no sound (I live in a quiet neighborhood), no blinking landing lights, and no wingspan. 4.) Was flying low to the ground (trees were in my way), as I went into the street, I was able to view it clearly. It was going higher as it was moving. It was also hovering at times. 5.) It's a UFO of some sort, nothing much to it. You see it, take pictures, observe it, and move on until it disappears, & look for my next sighting. It's very interesting. 6.)It disappeared into the night sky. It went up and up and up. I wish I had a camera to capture my first UFO sighting. just a quick little description of my first: (I followed it for a while) very low to ground and trees, oval shape, black windows, 4 interchanging round lights (from my view), exterior color was silver."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.401807,+-88.178036(43848)&iwloc=A&hl=en\"> mufon case (43848) map </A>","Viewing Distance":"Unknown","Object Shape":"Circle, Fireball","Case Number":"43848","Source":"MUFON","City":"Fox Lake","files":["/var/www/straped/mufon/html2text/43848.html.txt","/var/www/straped/mufon/org/43848.html"],"Object Flight Path":"Path with directional change,Path then hovering","Weather Factors":"Unknown","Longitude":"-88.178036","Summary":"Flaming Balls","Date of the Event":"11/07/2012 06:17 UTC","Disposition":"Unresolved","Tags":"City","Region":"Illinois","Sighting Duration":"Undisclosed","Country":"United States","Object Features":"None","Date Submitted":"11/11/2012 08:56 UTC","trends":["There have been 6 other sightings in Fox Lake","There was one other sighting in Fox Lake on or around November 7th 2012"]}