{"Disposition":"Unresolved","Log Number":"US-11122012-0003","Region":"Maine","Date Submitted":"11/12/2012 05:50 UTC","Sighting Duration":"00:07:00","Summary":"Standing out on fron porch, noticed Venus up higher than this yellowish bright orb","Object Features":"Unknown","Tags":"City","divs":["sighting detailswhile standing on my front porch having a morning cigarette just enjoying the stars before sunrise in maine looking east i saw venus higher up in the sky than this larger appearing bright orange\\yellow light. a few distant tree where semi obscuring this low but very strange light. i moved to the left a bit, then moved to the right and it was stationary and definately unusual in color and relativity to venus. as an artist and star gazer and a person who is pretty keen on stars and shapes and distances, this object realy had my attention. i finished half of my ciggarette and kept looking at the object then in a split second it blinked off as if a string was pulled \"turned off\" on a light bulb. i estimate the size was penny size if you held it up to the sky and roughly 1 mile from me. once the object blinked off i looked for any movement or reaperance of the object. after another 5 minutes or so i saw nothing else but was puzzled what this object was. i have been am avid ufo fallower for more than 30 years and do not react to stars or aircraft as i did with this object. i felt funny after the light just blinked off as if it knew i was there or it was perhaps detected as the sun was slowly coming up. i have never seen anything like that especiall with no noise and that bright and so close to me. i heard no sounds in the early hours at my home when seeing this object. i felt as if i had goosebumps and hair standing up on end when this took place. i was not affraid of what i saw however, i could not explain its quick lights off trick. there are also no houses or towers at the objects angle or elevation. very puzzling to say the least. i will do an experiment nov 13th 2012 at the same time tomarrow morning to see if it is there again. venus glowed at it's regular sunrise to the east position in maine. venus was bright white and solid non blinking. this object was 3 times its size and as i mentioned orange\\yellow solid bright light."],"Case Number":"43859","City":"Westbrook","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/43859.html.txt","/var/www/straped/mufon/org/43859.html"],"Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=43.734898,+-70.338233(43859)&iwloc=A&hl=en\"> mufon case (43859) map </A>","Weather Factors":"Unknown","Date of the Event":"11/12/2012 05:15 UTC","Source":"MUFON","Longitude":"-70.338233","Object Flight Path":"Stationary","trends":["There have been 4 other sightings in Westbrook","There were no other sightings in Westbrook on or around November 12th 2012"],"Country":"United States","Latitude":"43.734898"}