{"Date of the Event":"11/11/2012 08:40 UTC","Object Shape":"Circle, Fireball, Sphere, Star-like","trends":["There have been 9 other sightings in Rockledge","There were no other sightings in Rockledge on or around November 11th 2012"],"Source":"MUFON","Case Number":"43857","Summary":"Green fire like lights about 200 to 500 feet above the ground heading west in Viera, Florida at 8:40 pm November 11, 2012","Sighting Duration":"00:03:00","Log Number":"US-11122012-0001","Date Submitted":"11/12/2012 12:01 UTC","divs":["Sighting DetailsAbout 8:40 pm on November 11, 2012 I was leaving the Walmart in Viera, Florida with my three daughters when my youngest started to yell; she was scared so I pulled over and looked up, I observed about 6 green fire like lights heading west at about 500 feet above the ground.I made a U turn and headed west past Walmart to get a better look at the lights and thought they might be helicopters, when I pulled over and got out of my car they just started to appear everywhere. I noticed the objects multiplying without any sound with bright greenish fire like lights. As soon as I started to record them all their lights went out but I could still make out an object; there was about 50 of them. I dialed 911 and reported the objects to the Brevard County Sheriffs office. I went down the road a bit and spotted a Sheriff directing traffic; I asked him if he saw the lights and he said someone had called 911 and he assumed they might have been helicopters out of Titusvil, Florida but admitted he didn't see nothing and was only telling me what someone thought on the radio. I went home and my daughters made a sketch of what they had seen. My car radio stopped working when they went over, I was listening to 1240 am. Matt"],"Object Flight Path":"Path with directional change,Path then hovering,Other","City":"Rockledge","files":["/var/www/straped/mufon/html2text/43857.html.txt","/var/www/straped/mufon/org/43857.html"],"Longitude":"-80.719408","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=28.289513,+-80.719408(43857)&iwloc=A&hl=en\"> mufon case (43857) map </A>","Region":"Florida","Disposition":"Unresolved","Country":"United States","Latitude":"28.289513","Viewing Distance":"101-500 Feet","Object Features":"Unknown","Tags":"City"}