{"Date Submitted":"11/12/2012 01:44 UTC","Log Number":"US-11122012-0002","Longitude":"-86.419758","Country":"United States","Disposition":"Unresolved","City":"Martinsville","Region":"Indiana","Object Flight Path":"Straight-line path,Path with directional change","Latitude":"39.431605","Summary":"sudden fireballs with apropulsion trail for about 2 min took a n/w direction and acsended vertically and watched them dissapear","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 7 other sightings in Martinsville","There were no other sightings in Martinsville on or around November 10th 2012"],"Tags":"City","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.431605,+-86.419758(43858)&iwloc=A&hl=en\"> mufon case (43858) map </A>","Case Number":"43858","Object Features":"Dome","files":["/var/www/straped/mufon/html2text/43858.html.txt","/var/www/straped/mufon/org/43858.html"],"Sighting Duration":"Undisclosed","Source":"MUFON","divs":["sighting detailsiwas making a pizza delivery run and i had to turn on south main st to get to my destination i came to the stop sign at save-a-lot and these three lights suddenly appeared from the south, they were very large and glowing, i thought they were helicopters from camp atterbury but there were no other lights on these object they did have a propulsion trail flowing downward the three objects were glowing a gold\\copper color. i could see the propulsion trail flowing, not pulsating.so i pulled onto the lot where the old k-mart was in martinsville and i got out of the car and watched the three objects move from the south to the n\\w for about two and a half minutes. there were two together and one was trailing the other two. isaw the shape of all three objects and they were oblong in shape and they all were one solid color of a bright copper shape with a slightly duller propulsion trail of a copper color as well.when the objects decided to leave they turned slightly n\\w and went vertical they disappeared in about three seconds i watched them until the lights disappeared. i was frantically trying to get the camera on my phone to work but i was too excited it was the best sighting i have witnessed yet in my life it was very different....... please contact me thank you."],"Date of the Event":"11/10/2012 07:20 UTC","Object Shape":"Blimp, Fireball"}