{"Object Flight Path":"Straight-line path","Region":"Missouri","Date Submitted":"11/12/2012 11:29 UTC","Disposition":"Unresolved","Country":"United States","Sighting Duration":"Undisclosed","trends":["There have been 134 other sightings in Kansas City","There were 2 other sightings in Kansas City on or around November 11th 2012"],"Object Shape":"Circle, Fireball, Sphere, Star-like","Viewing Distance":"101-500 Feet","Latitude":"39.108226","divs":["Sighting DetailsEye-Witness #1: A family member and I were taking out the trash last night a little after 8pm. As we were going towards the dumpster I had been looking up at the sky because it was a nice night and I thought how clear the sky was. We live near an airport so I am used to seeing planes and I know what they look like and what I saw didn't appear to be a plane. So after putting the trash in the dumpster, as we turn around to head back inside there was a light in front of us traveling in our direction. It went in a straight path right above our heads. When i first saw it I didn't think anything out of the ordinary as I thought it was another plane. But as it got closer(to where it was above our heads) it didn't appear to be a plane as i at first thought. It looked more like a ball of light and it was brighter than a plane should be. It made no sound and it had a tail and almost looked like a comet or a slow moving shooting star streaking through the sky because of the linear path it took and the light trail it left behind. Once it got above our heads, sparks flew off the ball of light and then it just disappeared. I kept searching the sky trying to find the object again and I was thinking (did I just witness an explosion?) Because I thought maybe an engine had exploded and any minute I was going to hear the whistling sound of failing engines or see something falling, but there was no sound and no object. A flock of geese were flying towards where it had disappeared and they were making a lot of noise and they stayed in that area circling around where the object had been. After that me and the family member that was with me hurried back into the apartment because it was our assumption that the object was still there but was somehow cloaked and we couldn't see it. Eye-Witness #2: I live in a 3-story apartment complex. While in the parking lot on my way to the dumpsters to empty trash at approximately 8:20pm my daughter and I witnessed what we believe to be a ufo. It was a clear night so we were looking at the stars in the sky and talking. I heard the engines of a plane in the sky to my left, so I looked and saw a large plane with it's lights on. It had 4 bright lights traveling at a low altitude in a linear direction NW. I also heard and saw a flock of geese at a very low altitude to my left in an 'L' formation. On the way back to our apartment, we looked up at the stars in the sky and right above our heads I observed a glowing white ball of light with a long tail that was a faint yellow-greenish hue. There was no sound and it had a long tubular trail and in the center of the trail it looked like sparks were emitting from it. I took my eyes off of the object for a second to look at my daughter and asked 'Are you seeing this?' and she was looking up at it and she said yes and asked 'What is that? Did that plane explode?' When I looked back at it it was still traveling in a straight path and that's when I saw the flock of geese again behind the trail of the object flying in a triangular formation and they were making a bunch of squawking noises. We both continued to see this object for an additional 5-10 seconds before it vanished in thin air. As we were heading back inside I kept looking back at the geese and noticed they were flying up and down and sideways but still in a triangular formation where the object had been before it disappeared. I had the feeling that something was still there and part of me felt compelled to stay but my daughter was spooked and wanted to hurry and get back inside."],"Weather Factors":"Unknown","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/43861.html.txt","/var/www/straped/mufon/org/43861.html"],"Summary":"Orb-like USA Sighting In Kansas CIty, MO","City":"Kansas City","Tags":"City","Longitude":"-94.577567","Case Number":"43861","Log Number":"US-11122012-0005","map":"<A HREF = \"http://maps.google.com/maps?q=39.108226,+-94.577567(43861)&iwloc=A&hl=en\"> mufon case (43861) map </A>","Source":"MUFON","Date of the Event":"11/11/2012 08:23 UTC"}