{"Sighting Duration":"Undisclosed","Case Number":"43860","Disposition":"Unresolved","Longitude":"-71.6412","Weather Factors":"Unknown","Object Features":"None","Date of the Event":"11/11/2012 06:15 UTC","Object Shape":"Star-like, Triangle","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.319556,+-71.6412(43860)&iwloc=A&hl=en\"> mufon case (43860) map </A>","City":"Northborough","Date Submitted":"11/12/2012 10:17 UTC","files":["/var/www/straped/mufon/html2text/43860.html.txt","/var/www/straped/mufon/org/43860.html"],"Latitude":"42.319556","Region":"Massachusetts","Summary":"Random appearance in the sky, could not decipher the shape, only the lights and the seemingly silent object, colossal in size, was in a car and confirmed by the driver that this was extraordinary and real. Astounding.","Viewing Distance":"Over One Mile","trends":["There have been 2 other sightings in Northborough","There were no other sightings in Northborough on or around November 11th 2012"],"divs":["Sighting DetailsA passenger in a vehicle, heading to a family members house. Bright light was what originally caught my eye and the drivers view as well. Thought it was a tower, or helicopter. It began as an extremely bright white light in the sky, we drove a while and I did not remove my eyes from the object, as we continued to drive it seemed we were nearing the object and that it was stationary. Extremely huge white light, larger than stars (and so assumed to be much closer). I continued to not switch my gaze and as we continued, it appeared that we had driven beneath the it. White light had disappeared, there was dimness, then two orange lights appeared in perfect symmetry across from one another, blinked a few times, in what I would call almost nonsensical pattern, but together. After that- this is the part that made me feel a bit uneasy, a third light appeared, it was red- from what I can remember and in the manner of its positioning created a completely perfect triangular shape with the other two lights. Also, another object appeared to the right side a bit off from the highway beside it, with the same triangular lights. And as far as I could see, to the left side of the highway there were at least two to three more, however, I only experienced the bright white light once, and with the original object of speculation. Felt a bit confused and nearly reluctant as to the scenario, which was altogether astonishing to me. They had appeared out of nowhere, and didn't seem sensible, but spectacular all in the same. The object was lost as we drove along the highway- as far as I know none of the objects went away and stayed completely stationary all the time. We had driven off and I kept my eye on the main piece (the first noticed object) and did for as long as I could."],"Log Number":"US-11122012-0004","Source":"MUFON","Country":"United States","Object Flight Path":"Stationary"}