{"Log Number":"US-11122012-0007","Sighting Duration":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/43863.html.txt","/var/www/straped/mufon/org/43863.html"],"Latitude":"31.208692","Source":"MUFON","Date Submitted":"11/12/2012 12:26 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=31.208692,+-97.297722(43863)&iwloc=A&hl=en\"> mufon case (43863) map </A>","Weather Factors":"Unknown","Object Features":"Unknown","Object Flight Path":"Straight-line path","divs":["Sighting DetailsI was in my front yard looking for an arrow on the ground that I lost while practicing shooting my bow. I happened to look up and noticed what looked like an object on fire. My initial impression was that it was a firework. I dismissed this because the object lasted for several seconds without any sound or visual effect, and there was no smoke trail. The object was very wide and not very tall, so it was not spherical shaped. It moved in a straight path and looked to be falling. I lost sight of the object when it passed behind my house. It appeared that the object was close to the ground because I waited to hear it crash, but I never heard any sounds or felt any vibrations. This occured on Saturday November 10,2012 between 5:30 and 6:00. I know this because the six o'clock news came on right after I got off the phone with my wife. The object was so close and so pronounced that I expected to hear something on the news, but nothing was ever reported. I wonder if I am the only witness to this sighting. Also, I must note that I have indicated that the light was yellow-orange, but I am color blind so that is not reliable. The object was very bright, of that I am certain."],"Longitude":"-97.297722","trends":["There has been one other sighting in Troy","There were no other sightings in Troy on or around November 10th 2012"],"Viewing Distance":"Unknown","Region":"Texas","Disposition":"Unresolved","City":"Troy","Date of the Event":"11/10/2012 05:45 UTC","Summary":"Firey like object descending from the sky appearing to be very close.","Case Number":"43863","Object Shape":"Fireball","Country":"United States"}