{"Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=43.018727,+-83.685936(43864)&iwloc=A&hl=en\"> mufon case (43864) map </A>","Viewing Distance":"101-500 Feet","Longitude":"-83.685936","Date of the Event":"11/11/2012 10:20 UTC","Region":"Michigan","Object Flight Path":"Stationary,Hovering then path,Path with directional change","files":["/var/www/straped/mufon/html2text/43864.html.txt","/var/www/straped/mufon/org/43864.html"],"Country":"United States","Summary":"Triangle stadium lights hovering quiet bluish white nitrous flame from the exhaust","Disposition":"Unresolved","Latitude":"43.018727","trends":["There have been 40 other sightings in Flint","There were no other sightings in Flint on or around November 11th 2012"],"City":"Flint","Weather Factors":"Unknown","Source":"MUFON","Case Number":"43864","Tags":"City","Sighting Duration":"Undisclosed","divs":["Sighting DetailsWas picking my brother up from work I was on the phone and as i was driving we got to a stop light and we seen bright lights over a movie theater by a high way. First we thought the theater had got like some stadium lights for a premiere or something but as the traffic light changed I asked him \"is it on a stand!?\" And he said \"I think so\" and as we was getting closer my first thought was planes don't stay still and there's no attachments and its not a helicopter because I didn't hear the propellers. And as I drive more we get parallel to the movie theaters and lights! And we both seen something that we would never see in a million years but it was a UFO! By now we was in shock and I'm yelling at my brother to take a picture and him having a android his phone doesn't let him take pictures with a 5% battery, and I'm on the phone so I'm yelling and I tell the person I'm on the phone with ill call them back! And as I Stopped in the street I jump out my car to a picture with my iPhone but me just getting off the phone my iPhone camera didn't open up fast enough. So now I am no more than maybe 200ft away looking at a actually UFO! Like the entire ship! NOT! Just a light nor a star! So now, it seems like the UFO has identified us noticing it and it starts to move and I really wanted a pic so everyone could believe me! I jumped back in my car and tried to chase it and before I can get to the end of the movie theatre parking lot \"the rave\" it had disappeared without a sign or a trace! After all that has happened I called the police and asked did anyone else call in about a UFO sighting because i just seen a ufo with bright lights like football stadium lights and we couldn't been the only people to see it but she didn't take me serious."],"Log Number":"US-11122012-0008","Date Submitted":"11/12/2012 02:30 UTC","Object Features":"Wings, Other"}