{"trends":["There have been 229 other sightings in Las Vegas","There were 3 other sightings in Las Vegas on or around November 2nd 2012","This sighting has been favorited 1 time.",""],"Latitude":"36.117976","Viewing Distance":"Over One Mile","Object Shape":"Cylinder, Fireball","Disposition":"Unresolved","divs":["sighting detailson november 2, 2012. i was at work when i got a call from my security guard friend to come outside and see a meteor going across the sky. i go outside and i see this object that looks like a meteor slowly going across the sky at a low altitude, (see jpeg image 225) notice in the upper left-hand corner of the picture an airplane trail that was going in the same direction but at a higher altitude. i snapped a few more pictures of the meteor as it went into the distance,it was at at this time i decided to use the camcorder. i was astounded to see the meteor which was at this point a small dot all of a sudden seem to expand and the trail got fatter and it looked like it was actually coming back towards us (see first youtube video) im not very good with my camcorder, i dont use it often and accidentally turned off the recording hence the video only being 14 seconds. the second video is much longer and actually shows what happens next. if you focus your attention on the trail which has not changed youll notice an object that seems to be coming out of the clouds and slowly straightens itself and go up vertical into the clouds. it may be hard to see but i described this object as like a shiny straight line in the sky and if you look closely in the video you can actually see tiny dots which are airplanes going back and forth so this thing was very large and at a great distance.i really would like some feedback ive tried contacting george knapp and some other people and i have not heard back from anyone i really think there is something to this. i dont know if i witness a single event or two separate events. because i work across the street from the airport it was hard to tell if the meteor made any sound. also i find it odd that these two events no one seemed to call news agencies or our police department.note: i stop filming because my supervisor caught me. [links moved to fi section\\cms\\tg]"],"Sighting Duration":"Undisclosed","Date of the Event":"11/02/2012 06:45 UTC","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.117976,+-115.166206(43865)&iwloc=A&hl=en\"> mufon case (43865) map </A>","Weather Factors":"Unknown","Case Number":"43865","Object Flight Path":"Straight-line path,Path with directional change","Region":"Nevada","Summary":"On of on November 2, 2012 approximately 6:45 AM I took pictures of what appeared to be a meteor flying by going south, I then witnessed a long silvery cylinder UFO in the distance slowly moving up into the clouds","Source":"MUFON","Tags":"City","files":["/var/www/straped/mufon/html2text/43865.html.txt","/var/www/straped/mufon/more/43865_submitter_file1__225.jpg","/var/www/straped/mufon/more/43865_submitter_file2__226.jpg","/var/www/straped/mufon/more/43865_submitter_file3__227.jpg","/var/www/straped/mufon/more/43865_submitter_file4__228.jpg","/var/www/straped/mufon/more/43865_submitter_file5__229.jpg","/var/www/straped/mufon/more/43865_submitter_file6__230.jpg","/var/www/straped/mufon/more/43865_submitter_file7__231.jpg","/var/www/straped/mufon/more/43865_submitter_file8__232.jpg","/var/www/straped/mufon/more/43865_submitter_file9__233.jpg","/var/www/straped/mufon/org/43865.html"],"Date Submitted":"11/12/2012 04:13 UTC","Country":"United States","Longitude":"-115.166206","City":"Las Vegas","Log Number":"US-11122012-0009"}