{"Object Flight Path":"Straight-line path","trends":["There have been 8 other sightings in Leavenworth","There were no other sightings in Leavenworth on or around November 7th 2012"],"City":"Leavenworth","Sighting Duration":"Undisclosed","Region":"Kansas","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=39.277406,+-94.906533(43878)&iwloc=A&hl=en\"> mufon case (43878) map </A>","divs":["sighting detailsi got off of work right at 10:00 pm in lansing, kansas when i got a text message from kansas s\\d steve winans asking me if i could check on a sighting of an object or objects that were observed over northeast kansas. at 10:08 pm i replied to s\\d steve winans that i was on my way to the area where the object or objects were witnessed. as i was driving north on hughes road in leavenworth, ks i was right next to the st. mary's university campus at exactly 10:15 pm on november 7th, 2012. a very large green crescent shaped object flew over hughes road from the east heading west at a low (less than 500 ft. above the ground,) altitude at a high rate of speed. the object was only visible for a few seconds and it flew a level path through the sky. as this object flew overhead my car's engine sputtered for about two seconds and the dashboard\\panel lights inside the car dimmed. the glow from the object illuminated the ground as it flew over the area. i pulled over to the curb on hughes road and got out of my car with my phone to attempt to get a picture. by this moment the object was gone. i immediately sent a text message to s\\d steve winans that i had just witnessed an object, and asked him to call me with the witness' description from the sighting that occurred earlier that night. we did discuss the possible relationship between what was seen earlier that evening and the object that i also witnessed in leavenworth, ks. even though i didn't get a picture, i have attached a sketch of the object i saw over hughes road. i am continuing to research this event and would like to hear from others who have seen this object."],"files":["/var/www/straped/mufon/html2text/43878.html.txt","/var/www/straped/mufon/org/43878.html"],"Object Shape":"Boomerang, Other","Latitude":"39.277406","Disposition":"Unresolved","Country":"United States","Viewing Distance":"101-500 Feet","Log Number":"US-11122012-0022","Date Submitted":"11/12/2012 10:28 UTC","Case Number":"43878","Tags":"City","Date of the Event":"11/07/2012 10:15 UTC","Weather Factors":"Unknown","Summary":"A gree crescent shaped object flew ove the road as I was driving north.","Source":"MUFON","Longitude":"-94.906533"}