{"City":"Seminole","Log Number":"US-11122012-0014","files":["/var/www/straped/mufon/html2text/43871.html.txt","/var/www/straped/mufon/org/43871.html"],"Summary":"there was three fire like glowing oarnge balls","Object Features":"Unknown","Sighting Duration":"Undisclosed","Case Number":"43871","Viewing Distance":"N/A","Latitude":"27.818885","Date Submitted":"11/12/2012 05:43 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=27.818885,+-82.76916(43871)&iwloc=A&hl=en\"> mufon case (43871) map </A>","Source":"MUFON","Disposition":"Unresolved","Country":"United States","Region":"Florida","divs":["Sighting Detailsthis happend before halloween and after the 20th 2012. my neighbor told me there was suppose to be a meteor shower so I walked out to the road and seen nothing as i walked back up to house I seen a oarnge glowing ball that looked alot like fire, it was going slow no trail and no noise . about 4-6 minutes later i seen another so i called the neighbors mom out she thought it was a plaine on fire and to call 911, and the third or first cant rememberi called my brother out and he thought the millitary were maybe shooting flares but after thinking about it he changed his mind. now all three of these went on exact same path. These were about as high as a low plane. and i got to look at them for about three minutes a piece because i walked down street following it and i just could not identfy it. nowi've decided to reach out because i seen mfon on tv today and i really want to know what it is. and quite frankely i really didnt know who togoto. Thanks Daniel B. Just noticed questiions on the left. 5= at first when i seen it i just felt like i had to show pppl it it was so unbelieveable not initially but later on i had that feeling you get when you think about how big the universe is compared to you. 6= i lost sight becaause it went past the tree line. Honestly if you dont know what it is i guess dont worry about it but if you do please email me"],"Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Longitude":"-82.76916","Date of the Event":"10/23/2012 10:15 UTC","trends":["There have been 8 other sightings in Seminole","There were no other sightings in Seminole on or around October 23rd 2012"],"Object Shape":"Fireball, Star-like, Unknown"}