{"Date of the Event":"11/11/2012 12:00 UTC","City":"Undisclosed","Object Shape":"Sphere","Latitude":"36.424202","Weather Factors":"Unknown","trends":[],"files":["/var/www/straped/mufon/html2text/43873.html.txt","/var/www/straped/mufon/org/43873.html"],"Region":"Tennessee","Tags":"City","divs":["Sighting DetailsMe and a friend of mine were getting out of the car at his house and were standing looking at the stars talking about how beautiful they were, I saw a plane with its flashing lights way up in the sky. I told my friend that I hoped we could see a UFO, and he said probably will just be airplanes or satilites, and I said I hope not just keep looking he wanted to go to the end of the house where it was the darkest but something caught me eye moving across the sky and I watched it for a couple seconds,it was a plain white dot and it moved slow but not real slow across the sky. I yelled at my friend to come and see it but he couldn't hear and kept going. I kept watching yelling for him to come and see but he never came, I kept watching and all of the sudden it turned in a 45 degree angle and shot out a burst of flame like a rocket firing. And took off and that was the last I saw of it. When I went to tell my friend what I saw he said he didn't hear me and wished that he did. One Saturday at the first of March he and I went to the Unicoi Mtns in Unicoi TN to camp out for the night on a rock known as Turtle Rock a carving left by John Swift in the 1800's. My friend is a photographer and to we were looking for the lost silver mine of John Swift. We had eatten our dinner and laid out our sleeping bags and wee watching the stars we lay there about half an hour when to the west we saw a light about the size of the head of a pin flash then went about an inch and flashed again turned in a 45 degree angle and again it flashed and again it did the same making a square The object did this for about half an hour and disapeared. On a saturday in June 2009 I had taken my dog to my brothers farm to run and play with his dogs it was a bright sunny day. When we got there there was noone there but his dogs. We got out of the car and went to the shade tree in the yard to sit. My brother had been working on his bailer it was under the shade tree too. I watched the dogs walking around for a few minutes. My brothers dog Brandy was laying about 20 feet in front of me and Bear his other dog was walking around the house further down my dog was smelling around in the grass about 40 feet behind me. All of the sudden Brandy jumps up and barks ferously and then just lays back down, I said Brandy whats the matter about then a strange wind came up and blew the other lawn chairs over and blew the leaves around I got up and was wondering what was that when nothing around me was blowing except right around me and the dogs. I was looking at the sky puzzled when I noticed something falling out of the sky I though what is that then they got closer and I saw they were leaves falling I kept looking upo and I saw jet planes flying in a couple directions barely visable. Then to my amazement I saw A white object going in a zigzag motion away from me as high as the planes then it just zipped across the sky and stopped beside a small cloud almost above me. I watched it and I felt asif it was watching me, I watched it for about a minute then a smaller one appeared and I kept saying where is everyone when you need them....about 10 seconds later another one stopped right beside the othe NOWTHER WERE THREE the last one to come took off and then the second onemtook off but the large one stayed the dogs got under my feet so I took off my sunglasses to look at then (why I don't know) andturned to look at the UFO's again and I couldn't see then, I though they were gone I put back on my sunglasses and looked back up and the UFO was there I took my glasses off again and I couldn't see it. I thought how strange is that. I don't know how long I stared at the UFO or how long I was there or when it disapeared or took off I remember getting my dog in the car and leaving thats it... I have told you abut 3 sightings but I have a couple more One happened yesterday I was in my bedroom sitting on the end of the bed and I turned to look out the window while I was looking I saw a Orb bigger than a basketball go past my window. I was going to clean my nieces beauty shop one night late this summer when I got out of the car I saw out of the corner of my eye a light I turned to looik and a large Orb went past the buildings sign and go over the town I said Noone is going to beleive me on this one either. I do see small orbs going around my house all the time I have a survelience camera but I haven't recorded with it I can't figure out how to. Can you maybe tell me why I see them and noone else does that I know?"],"Date Submitted":"11/12/2012 07:22 UTC","Longitude":"-82.297784","map":"<A HREF = \"http://maps.google.com/maps?q=36.424202,+-82.297784(43873)&iwloc=A&hl=en\"> mufon case (43873) map </A>","Object Flight Path":"Path with directional change","Log Number":"US-11122012-0017","Summary":"watching white circle move across the sky looking almost straight up for a few seconds it went in a straight path then turned and a burst of flame came out an gone it was","Object Features":"None","Disposition":"Unresolved","Viewing Distance":"Unknown","Source":"MUFON","Case Number":"43873","Sighting Duration":"Undisclosed","Country":"United States"}