{"map":"<A HREF = \"http://maps.google.com/maps?q=39.374818,+-74.385403(43875)&iwloc=A&hl=en\"> mufon case (43875) map </A>","Case Number":"43875","City":"Brigantine","Tags":"City","Country":"United States","trends":["There have been 2 other sightings in Brigantine","There were no other sightings in Brigantine on or around September 18th 2012"],"Disposition":"Unresolved","Object Flight Path":"Stationary","Latitude":"39.374818","Source":"MUFON","Date Submitted":"11/12/2012 08:06 UTC","divs":["Sighting DetailsAt 04:15 on September 18t, 2012, I stepped out on the porch to smoke a cigarette, and noticed an out-of-place, twinkling \"star.\" I noticed it because there are usually no stars in that area at that time of the morning, and it was twinkling too much, and too still to be an airplane. Also, airplanes often fly along the coast, but straight out to sea is not a normal flight path. After watching it for several minutes, I finally decided to get the camera, even though I usually don't have much luck with nighttime photography. I zoomed as much as my Nikon Coolpix (point and shoot) camera would let me and then turned it to film to see what I could capture. To my surprise, even viewing it on the camera I could see that there is more color than I could see with the naked eye. I finally downloaded it onto the computer, and realized you can see it's a circle, and there are some various colors (more toward the end.) I will just apologize now, I was not really awake enough to think about a tripod, and well, lets just say I don't have the steadiest hand, but it's not awful and only a little over a minute long. Toward the middle, I do pan do to the rooftops and then back up, for reference. I watched it for 10-20 minutes, and then lost sight of it when I went back to bed. My feelings about it are excitement, and a little bummed that it wasn't something I could see closer. I am really hoping somebody has a few minutes to look at the video and see if it's a known aircraft. I've seen other funny lights, but this is the first time I was ever able to film anything."],"Date of the Event":"09/18/2012 04:15 UTC","Summary":"Stationary multi-colored blinking light over the ocean.","Object Shape":"Circle","Log Number":"US-11122012-0019","Object Features":"Unknown","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Region":"New Jersey","Weather Factors":"Unknown","Longitude":"-74.385403","files":["/var/www/straped/mufon/html2text/43875.html.txt","/var/www/straped/mufon/org/43875.html"]}