{"Object Features":"Other","Date Submitted":"11/12/2012 10:58 UTC","City":"Bethlehem","Object Flight Path":"Path then hovering","Log Number":"US-11122012-0024","Longitude":"-75.362408","divs":["Sighting Detailsdriving in car. noticed object because it was so large and bright.we never thought it was plane or helicopter or jet there was no sound at all.the object moved slow then moved left then right and started to desend slowly .the size of the object was about 50feet or more around.my feeling about the object was i have seen other objects in the past so i didnt get too alarmed.we did pull over to observe the object then we pulled back out onto the road to follow the object. the trees blocked our sight of object. then we went home . later that same night about 1 hour later my wife was sitting on the porch ,we have a great veiw of bethlehem,and she saw the same object again, i didnt,wish i did could have got a picture.we lived in lower bucks penna.we have seen other lights in the sky that are in formation allmost allways 3 in triangle form,around the high speed train tracks. they are high power lines,also at penn warner park, lots of water in that area, weird right.i what to tell the time my wife and i and her neice saw a ufo in 1990 ,1991 in bensalem pa. on rt.13 and park ave.we looked up and saw the craft it was wider than the two lane road and about tree top hight, drove to the end of road about 1 mile then we went into the middle school parking lot where it looked like it was going land ,but then we saw it disapear right in front of our eyes.the police where patrolling the parking lot,they saw us and told us to leave.i have never told anyone since,only family and they think we are crazy anyway."],"trends":["There have been 21 other sightings in Bethlehem","There were no other sightings in Bethlehem on or around November 11th 2012"],"Tags":"City","files":["/var/www/straped/mufon/html2text/43881.html.txt","/var/www/straped/mufon/org/43881.html"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.628232,+-75.362408(43881)&iwloc=A&hl=en\"> mufon case (43881) map </A>","Disposition":"Unresolved","Country":"United States","Sighting Duration":"Undisclosed","Region":"Pennsylvania","Viewing Distance":"101-500 Feet","Summary":"(GS) driving north in my car ,my wife and i saw a large round light hovering to our left very low in the sky, pink then glowing orange ,moving slow then stopped going right then left lost sight of obect","Date of the Event":"11/11/2012 07:00 UTC","Source":"MUFON","Case Number":"43881","Object Shape":"Oval","Latitude":"40.628232"}