{"Case Number":"43887","divs":["Sighting DetailsI have resisted posting anything about it until I saw that someone else also saw them. Sept.21st about 4:00pm or so and still quite light out. Clear skies, a little wind, warm temps. I was sitting on my deck in Virginia Beach just looking out over the lake and on the phone with my husband when I saw at least 6 orange-red orbs go across the skyline and relatively close to me. They did not flicker, pulsate or have any kind of trails...there was no noise. Because of the trees flanking my yard, it was difficult to tell where they came in from and where they were going - but it seemed as though they came from the Lynnhaven Pkwy & Holland area heading toward Mt. Trashmore (south to north I think) - they were flying somewhat low, barely above the tree line and in a row - although they were in a kind of formation; one or two of the orbs would move out of the line, then back in, not in a floating way, but a deliberate movement - they were very easy to see by almost anyone, so I was surprised when there was nothing about it on the news or even the internet afterward. They were not going very fast, the scene lasted about 3 minutes maybe less - during which 2 more orbs came into view and joined the \"procession\" of 6 - then the 2 split off and flew toward the Chesapeake area (west) - while still trying to watch the 6 in front of me I aslo tried to watch the 2 that were flying off - but they just disappeared. Immediately after all the orbs left my eyesight...I saw a large black helicopter fly into the same area and circle several times before flying off toward the Mt. Trashmore area. When I first saw them and throughout the entire 3 minutes, I never really felt frightened or threatened - but did feel confused; what was I seeing? - I kept asking myself. I knew that whatever these orbs were...they were like nothing I had ever seen before. Since the sighting, I keep thinking about them, checking online to see if anyone else had also seem them - and have found out that many have in the month of Sept. Using a photo of my yard that was taken back in April and photoshop, I have attempted to \"draw\" what I saw. The orbs on the photo are about as close to the size I witnessed, but the coloring is not. They were more reddish in the center with orange on the outer part."],"Tags":"City","trends":[],"Disposition":"Unresolved","Date Submitted":"11/13/2012 05:50 UTC","Longitude":"-78.650754","Source":"MUFON","Country":"United States","Object Features":"None","City":"Undisclosed","Log Number":"US-11132012-0005","map":"<A HREF = \"http://maps.google.com/maps?q=37.434243,+-78.650754(43887)&iwloc=A&hl=en\"> mufon case (43887) map </A>","Object Shape":"Sphere","Object Flight Path":"Straight-line path,Other","Weather Factors":"Unknown","Latitude":"37.434243","files":["/var/www/straped/mufon/html2text/43887.html.txt","/var/www/straped/mufon/org/43887.html"],"Summary":"6-8 red-orange orbs Sept. 21st about 4:00pm - very clear sighting","Date of the Event":"09/21/2012 04:15 UTC","Region":"Virginia","Viewing Distance":"21-100 Feet","Sighting Duration":"Undisclosed"}