{"City":"Jonesboro","Tags":"City","Date Submitted":"11/13/2012 09:50 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.657583,+-67.582977(43889)&iwloc=A&hl=en\"> mufon case (43889) map </A>","Log Number":"US-11132012-0006","Case Number":"43889","Date of the Event":"11/28/1989 04:30 UTC","Object Features":"None","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Cone","divs":["Sighting DetailsI was coming in and out of my home putting hunting gear in my truck,at about 4:30 in the morning,around nov 1989, to go to hunters breakfast , while going up and down the steps , I saw an object coming down! like a helicopter would come down, with a white light coming out of the bottom as it shining cone shape down at the ground with lights that lite up, around the middle of the object, they were redish,blueish, yellowish, turning in the middle. with no sound what so ever,it was cone shape,it was about 300ft to 400ft when i see it,going below the tree line and it had two of landed in between jonesboro and centerville maine , knowing that area and hunting alot when I was a kid I realized there was no way that a helicopter had landed there or anything for that matter, getting my girlfriend in the truck with my hair standing up on my head and arms Im driving to the white house for breakfast trying to tell her what I had just seen, we come across a deer buck deer in the road dead and about 100 yards up the road there was another dead buck with cars pulled over ,It even hit me I saying to my girlfriend whats up with this two dead deer I,m thinking and she is too, did that thing I see had something to do with the dead deer ,but that couldn't be possible right. We go into the white house for breakfast trying to explain what I had just seen and there all going ,Your crazy, are you all right , I then just stoped talking about it until now and this is my story I don't know what it was, But I know it wasn't a helicopter I believe in my Heart I see a UFO that morning and no one will tell me different! Thank you for reading Mikel"],"files":["/var/www/straped/mufon/html2text/43889.html.txt","/var/www/straped/mufon/org/43889.html"],"Sighting Duration":"Undisclosed","Latitude":"44.657583","Region":"Maine","Object Flight Path":"Straight-line path","Disposition":"Unresolved","trends":["There have been no other sightings in Jonesboro","This sighting has been favorited 1 time."],"Country":"United States","Summary":"cone shape with a white light coming out of bottom with lights in the middle turning","Weather Factors":"Unknown","Source":"MUFON","Longitude":"-67.582977"}