{"Case Number":"43895","Longitude":"-94.253644","Date of the Event":"11/11/2012 08:42 UTC","Tags":"City","Country":"United States","Weather Factors":"Unknown","Region":"Missouri","Viewing Distance":"Unknown","Log Number":"US-11132012-0012","divs":["Sighting DetailsI was outside of my girlfriend's back porch smoking a cigarette when I looked up at the stars to sky watch like I normally do. I was looking at a very bright star which may have been a planet. When I noticed a object that was massive in size and appeared to be transparent or cloaked in the night sky, no lights but an outline, that looked like the number seven. I thought it was possibly a military drone but realized this object was way too big to be a drone that I have ever seen. This object was about the length of my arm stretched out, and this object had on the end of it a branch off that made it look like a 7. The branch off of the object was about the size of my forearm. This sighting occurred at 8:42 PM exact till 8:45 PM exact on November 11th, 2012. I have also witnessed several UFO's in the past couple of days. The other object I saw November 13th, 2012. This object was triangle in shape, had no lights and also appeared to be transparent. I also saw this sighting off the back porch, and I believe this was a black triangle. The object moved Southeast to Northwest I witnessed this around 1:30 AM, I do not have the exact time. I would love to hear back from Mo Mufon. Thank you a lot."],"trends":["There have been 28 other sightings in Blue Springs","There were no other sightings in Blue Springs on or around November 11th 2012"],"Disposition":"Unresolved","Object Shape":"Other","Summary":"I was outside smoking looked up and saw object shaped like a seven went s. to n. appeared transparent","Source":"MUFON","Sighting Duration":"00:03:00","Date Submitted":"11/13/2012 06:38 UTC","City":"Blue Springs","Latitude":"39.0104","files":["/var/www/straped/mufon/html2text/43895.html.txt","/var/www/straped/mufon/org/43895.html"],"Object Features":"Other","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=39.0104,+-94.253644(43895)&iwloc=A&hl=en\"> mufon case (43895) map </A>"}