{"map":"<A HREF = \"http://maps.google.com/maps?q=40.241073,+-79.568278(43894)&iwloc=A&hl=en\"> mufon case (43894) map </A>","Object Features":"None","Sighting Duration":"00:01:00","files":["/var/www/straped/mufon/html2text/43894.html.txt","/var/www/straped/mufon/org/43894.html"],"Object Flight Path":"Other","City":"Greensburg","Date Submitted":"11/13/2012 06:05 UTC","divs":["Sighting DetailsReceived telephone call from witness who asked that I file this report for him. (Roger Marsh, PA MUFON). Witness statement follows: I was asleep at approximately 2 a.m. when I woke to the sound of my dog barking. It was his style of barking when someone is at our door. The dog was in my bedroom with me at the time. When I looked up, I looked across the bedroom, through an open doorway, and into an adjoining hallway. The only light on at the time was the light available from a computer. In the hall area, less than 20 feet from me, I saw an entity of some sort. The object or entity, from my observation point, seemed to be about two feet wide and less than four feet tall. It looked gray in color. In a matter of about two seconds, it suddenly moved away from me and out of my line of sight. It could have moved into a bathroom where a door was open, or it could have continued down the hallway and out of my sight area. I immediately felt as though an intruder was in my house, and I immediately retrieved my gun, and went into the hallway. At this point, I did not see the entity again. I checked all of my windows and outside doors, and nothing appeared to be disturbed. My dog appeared to calm down again shortly after the incident. I have no history of this type of incident in my past, and do not know exactly what it was I observed; but it did appear to be intelligent."],"Tags":"City","Region":"Pennsylvania","Viewing Distance":"20 Feet or Less","Country":"United States","Source":"MUFON","Weather Factors":"Unknown","Log Number":"US-11132012-0011","Longitude":"-79.568278","Case Number":"43894","Latitude":"40.241073","Date of the Event":"11/13/2012 02:00 UTC","trends":["There have been 21 other sightings in Greensburg","There were no other sightings in Greensburg on or around November 13th 2012"],"Object Shape":"Square, Rectagular","Disposition":"Unresolved","Summary":"Woke from dog barking and saw entity in my hallway."}