{"Date Submitted":"11/13/2012 03:44 UTC","Summary":"I took eleven photographs with one to four round, dark circles above the clouds.","Object Shape":"Circle","Region":"California","Disposition":"Unresolved","Case Number":"43891","trends":["There have been 49 other sightings in Huntington Beach","There was one other sighting in Huntington Beach on or around September 20th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.663757,+-117.997106(43891)&iwloc=A&hl=en\"> mufon case (43891) map </A>","Weather Factors":"Unknown","City":"Huntington Beach","Object Flight Path":"Stationary","divs":["Sighting DetailsSept. 20th 2012 I took a series of 17 photos on my patio between 9:32AM & 9:55AM. I had my Olympus EPL-3 on a tripod with the camera pointing almost straight up to the south slightly. There were two layers of white clouds that morning; a lower puffy layer & a higher more wispy layer; I thought I would take a few shots; it was a beautiful day. I was drinking coffee & not paying too much attention as I took the 17 shots; adjusting the settings between manual; auto; etc. After finishing my coffee I took the camera in the house to review the results. The first five had just clouds; but then the next 11 shots had one to four of these circular objects in them. The first was at 9:35 & the last at 9:54; the last photo I took did not have any objects. Thinking I had dirt on my lens; I checked every part of the camera & found no dirt or spots; I then took some test shots; again no circles. Reviewing the photos I saw that the objects seem to be hovering above the puffy layer of clouds & imbedded in the wispy layer of clouds. One photo has puffy clouds in front one of the objects. In others the wispy layer of clouds seems to be swirling around the objects. For one photo I used the \"Dramatic\" setting on my camera; in increases contrast of objects like clouds; birds; airplanes etc; you can see the four objects very distinctly. I am sending three of the photos I took; but they are not full resolution. I don't have a new computer; so my photo editing program reduces the resolution when I cropped them; the contrast needs to increased to see the objects clearly on the first two; the third one is the \"Dramatic\" tone photo. Actually the highest resolution screen I have is the one on my Olympus camera; in other words my camera has a higher resolution than my computer can handle. I do have 17 high-resolution images(11 of these with the objects) saved on disk."],"Source":"MUFON","Log Number":"US-11132012-0008","files":["/var/www/straped/mufon/html2text/43891.html.txt","/var/www/straped/mufon/org/43891.html"],"Date of the Event":"09/20/2012 09:35 UTC","Latitude":"33.663757","Viewing Distance":"Unknown","Longitude":"-117.997106","Sighting Duration":"Undisclosed","Country":"United States","Tags":"City","Object Features":"None"}