{"Source":"MUFON","Viewing Distance":"Unknown","Disposition":"Unresolved","Date Submitted":"11/14/2012 06:48 UTC","Object Features":"Other, Unknown","divs":["Sighting DetailsBETWEEN 7 & 9 P.M.,NOV.13TH 2012, I WENT OUTSIDE TO SMOKE.IN THE SKY ABOVE I SAW A ROW OF MANY LIGHTS IN A PERFECT V-SHAPE MOVING ALONG IN THE SKY. THE LIGHTS WHERE LIKE A DULL YELLOWISH WHITE, ALMOST TRANSPARENT-LIKE. THE STARS WERE BRIGHTER THAN THE LIGHTS. @ 1ST I TRIED TO ADJUST MY EYES. I THOUGHT MAYBE BIRDS @ 1ST, BUT THEY WERE WHITE & IT WAS TOO DARK FOR THAT TO BE. THEN I THOUGHT MAYBE A PLANE, BECAUSE THERE IS AN AIRPORT CLOSE BY & PLANES GO BY ALL DAY, BUT IT WAS WAY 2 MASSIVE TO BE A PLANE. I WATCHED AS IT KEPT MOVING, IN A STRAIGHT SLOW PACE, FURTHER & FURTHER AWAY. I AGAIN TRIED TO ADJUST MY EYES & THOUGHT I LOST IT WHEN I SEEN IT AGAIN,STILL MOVING FORWARD & AWAY FROM ME. IT WAS AS IF IT WAS TRANSPARENT @ TIMES. AS IT GOT FURTHER AWAY & STARTED TO DISAPPEAR OVER THE HOUSES I JUMPED ON A FENCE TO TRY TO CONTINUE TO WATCH IT & IT WAS GONE. MY FRIENDS THEN CAME HOME & SEEN ME ON THE FENCE,WONDERING WHAT I WAS DOING. I WAS IN SHOCK OF WHAT I HAD JUST SEEN & COULDN'T EXPLAIN TO THEM. IT FREAKED ME OUT & I WAS TRYING TO PROCESS & MAKE SENSE OF IT ALL. I IMMEDIATELY GOT ONLINE TO SEE IF ANYONE ELSE HAD REPORTED ANYTHING. TODAY I WAS DIRECTED TO THIS 'NETWORK' . THIS IS MY REPORT"],"Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=39.540051,+-119.744899(43909)&iwloc=A&hl=en\"> mufon case (43909) map </A>","City":"Sparks","Case Number":"43909","trends":["There have been 23 other sightings in Sparks","There were no other sightings in Sparks on or around November 13th 2012"],"Longitude":"-119.744899","Weather Factors":"Unknown","Region":"Nevada","Latitude":"39.540051","Log Number":"US-11142012-0011","Sighting Duration":"00:01:00","Country":"United States","Tags":"City","files":["/var/www/straped/mufon/html2text/43909.html.txt","/var/www/straped/mufon/org/43909.html"],"Date of the Event":"11/13/2012 12:00 UTC","Summary":"WENT OUTSIDE TO SMOKE.SAW LIGHTS IN A PERFECT V-SHAPE MOVING STRAIGHT AHEAD.NO SOUND.DISAPPEARED OVER HOUSES","Object Shape":"Boomerang, Other"}