{"Object Flight Path":"Stationary,Unknown,N/A","Disposition":"Unresolved","Country":"United States","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","City":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.80878,+-116.410109(43907)&iwloc=A&hl=en\"> mufon case (43907) map </A>","Region":"Nevada","Case Number":"43907","files":["/var/www/straped/mufon/html2text/43907.html.txt","/var/www/straped/mufon/org/43907.html"],"Date of the Event":"01/15/2011 12:00 UTC","divs":["Sighting DetailsOne cannot simply turn on the computer and look at the map and expect to get a clear picture. It takes at least a 64bit computer with HD Graphics. It is literally work to get the images dialed in to where afterwards I shake and can't believe what I'm seeing. To the point that now I'm for the first time sharing with confidence that it is truly there especially after sharing with close relatives. One of which is a Nuclear Scientist who has above top secret clearance with FortHood,Tx. working with a contractor on 3rd generation military computers. So I am with good company in respect but he offers little answer to the pictures I have saved and shared. Maybe due to his field I'm sure and possibly this is new to them as well. Before he had been not willing to talk as much as he has talked as of late. Where his first assignment after college was Roswell by the way. Yet the more important matter is that I have real,full solid images downloaded in HD clarity that appear absolutely not of this world. Huge earth tunneler with a drill bit the size of Manhattan on the front on the floor up by Alaska and multiple, in a straight row, craft ascending vertically in front of an island south of Florida with full on colors of the propulsion contrails leaving colors trails that seem colors unbeknownst before. Lastly, the shape of one craft is to a T the shape of the very known \"batwing\" rising up off the floor of the ocean with sand and silt clearly underneath it as it rises upwards. There are thousands of other words in my 1 year of researching that now I see I have a full book worth of descriptions about hundreds of other observances. I would very much like to meet with someone who can validate this as fact and then move onward to the point that I can find nor have seen anything that comes close to the awesomeness of these pictures and can with confidence say that this is probably \"the it\" story for all the other cases. Other than Fox's Mexico Airforce live story, this is beyond that. This almost seems like this was here a long time ago, and we were blown back into the stone age. That is my conclusion as to the evidence of war and damage amongst the structures. Only with the Terrametric tech. can it be seen now, but not without the know how to angle and render like I have come to understand. I'd like to now come forth and have this validated and more so, the professionals who with authority can make this known to all as this is open source on the net that the government can not take away once it realizes what we all can see...down there in the deep blue. Thanks, Anthony Strauss"],"Weather Factors":"Unknown","Source":"MUFON","Log Number":"US-11142012-0009","trends":[],"Tags":"City","Object Shape":"Boomerang, Disc, Star-like, Triangle, Other, Unknown","Latitude":"38.80878","Longitude":"-116.410109","Object Features":"Wings, Other, Unknown","Summary":"After one year of research, and I a Chef by trade, I can fully assert and show others who now believe that numerous, buildings and craft can be seen with the Terrametrics TruView under the ocean surface.","Date Submitted":"11/14/2012 02:59 UTC"}