{"Case Number":"43917","Sighting Duration":"Undisclosed","Object Features":"Unknown","Longitude":"-120.467239","City":"Nipomo","Date of the Event":"11/15/2012 12:00 UTC","Date Submitted":"11/15/2012 04:11 UTC","Log Number":"US-11152012-0002","Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/43917.html.txt","/var/www/straped/mufon/org/43917.html"],"Latitude":"35.048075","Source":"MUFON","Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.048075,+-120.467239(43917)&iwloc=A&hl=en\"> mufon case (43917) map </A>","Region":"California","divs":["Sighting DetailsI was driving home after working late and I was driving tbrough an area where there had been a previous report of a red object flying so I always try to stay vigilant in the area. As I am driving through a construction site, I noticed a blue and red object flying relatively low to the ground. It was flying from northeast to Southwest. At first, I though it could be a helicopter, but it made no sound and it was flying too low to be an airplane. It emitted a white light for about 3 seconds and continued flying. I though to myself that no airplane or helicopter would have just blue and red lights but I though it could be possible. Then as I saw the side of the object as it flyed past me, I saw something that I am knew was not \"standard\". It had a panel of three square blue lights and it blinked in sequence from left to right. Like one, two, three, slight pause .. one, two, three. That's when I knew it was a UFO. I watched it for 5 minutes and I never saw the blinking sequence lights or the white light again. It was just red. It went behind some trees and I lost it. When it blinked in sequence, I felt like it knew I was watching. I hope to see it again."],"trends":["There have been 3 other sightings in Nipomo","There were no other sightings in Nipomo on or around November 15th 2012"],"Weather Factors":"Unknown","Summary":"Object with red and blue lights with sequential pattern","Disposition":"Unresolved","Tags":"City","Country":"United States"}