{"Date of the Event":"10/01/2012 03:59 UTC","Region":"New York","Country":"United States","Summary":"Extremely bright light would hover in one place, and then would very quickly move from side to side, hiding behind clouds when possible, occured from 2am until 530am over an indstrial park.","divs":["Sighting Details The sighting of the UFO took place in Scotia, in the state of New York. I was sitting in my car with my husband in a nice quiet place that is a large stretch of land near the Mohawk River. We like to go out there because it is a nice secluded place. As we sat in my car in the middle of a large field, I pointed out this strangely bright light in the sky. Of course my husband didn't believe that I thought it was something other than a planet, mainly because I always see these types of things. He had in fact believed me this time when he himself had stopped talking in mid conversation when the light began to move away from the clouds it was behind and got extremely bright. I always carry a couple of pairs of binoculars with me because I always keep an eye out for UFOs. We both grabbed a pair and when we looked into them we were both in disbelief. We had both seen and described the exact same object. It was a very bright white light that stayed still in the sky for a few moments. We continued to watch this object and it began to move from left to right in a free motion. When the object would change directions, we could see the shape of the object without being completely blinded by the bright light. We had seen an object shaped like a triangle, but when focused a little more it was clear as day the shape of a pyramid. The craft had to engine, no wings, nothing comming off of it. Behind the craft it seemed as if there was almost like a sail on a boat near it. The colors that came off of it and the colors of the object itself were endless. It was rainbow color and the main light that it would \"search\" around with when it moved from side to side was a bright white light. My husband is a risk taker, and thought it would be interesting to attempt to get its attention. I didnt think this was such a good idea because if this was infact a UFO, which there is no doubt in my mind that it was, we hadnt the slightest clue about what these beings were capable of. But he carried anyways and pulled the laser pointer off of his keychain. He got out of the car and started shining the LED red laser pointer at the object in the sky when the head light was facing away from us. It turned its position around extremely fast as if someone had tapped it on its shoulder. The object stay still in the sky for the next 10 to 15 minuets approximately because he had stopped shining the laser on it. It quickly and freely hovered from one big cloud to the next, as if it was hiding and felt like it was seen. Again the object moved away from the clouds, and was in the open sky moving from left to right again. My husband shined the light on it again this time in a rapid side to side motion and started saying \"maybe we can get it to move closer.\" I was also curious so i agreed to continue with his actions while i looked through the binoculars. We had both gotten out of the vehicle and were now standing in the middle of the field. The came closer and closer to above where we had been observing it from. It was like the object had moved so quickly where we had blinked an eye and they were ten times closer. Him and I had gotten extremely frightened and we didnt really think that the object would come closer. As he continued to shine and flash the laser light at the object it came closer and closer and lower to where we were. To be completely honest him and I started running, almost sprinting towards my car that was parked on the other side of the field. We were really scared for our lives because we did not know what this was, who was occupying it, or what was about to take place. Neither him nor I even agreed to run, we had both started running away by instinct. I am very in touch with clairvoyance, and I have a very abnormal level of intuition. My dreams have a alot to do with what occurs in my every day reality. I have been a whitness to serveral UFO sightings, and I also frequently have dreams involving such nature. This started ever since I can remember being a little one. So that is how I knew that this was some sort of UFO that was not a normal aircraft. We had gotten back into my car and locked the doors to look up and see no object. A dark cloud had filled the sky. We caught our breath, and regrouped what the heck just happend. We both looked at eachother and reassured eachother that that had just took place and that neither of us were crazy. We were about to leave the area after waiting to see if it would appear again, when the object had moved out of the dark cloud again. It started doing the same thing that it had been previously doing when we had first whitnessed it. The sun began to come up and it moved from cloud to cloud, as the sun got brighter. After attempting to keep track of which cloud the craft was \"hiding\" behind, it had disappeared when all of the clouds had passed. The sky was clear, and there was no trace of the object that we had been watching all night. This is not the first time that i have experienced a sighting. Hope my story gets out there because everyone should be aware that there are other types of beings out there, and that its not something to fear, but just to aknowledge. Thanks for reading."],"Longitude":"-73.964292","Log Number":"US-11152012-0011","Date Submitted":"11/15/2012 07:40 UTC","Disposition":"Unresolved","trends":["There have been no other sightings in Scotia","This sighting has been favorited 1 time."],"Weather Factors":"Unknown","Source":"MUFON","Latitude":"42.826465","Tags":"City","City":"Scotia","Case Number":"43926","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=42.826465,+-73.964292(43926)&iwloc=A&hl=en\"> mufon case (43926) map </A>","Sighting Duration":"04:00:00","Object Features":"Other","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/43926.html.txt","/var/www/straped/mufon/org/43926.html"],"Object Shape":"Triangle"}