{"Region":"Florida","Country":"United States","Summary":"May be a newer B2 Stealth","Disposition":"Unresolved","Latitude":"29.230664","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Case Number":"43922","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=29.230664,+-81.061075(43922)&iwloc=A&hl=en\"> mufon case (43922) map </A>","Object Shape":"Triangle","Date Submitted":"11/15/2012 03:28 UTC","trends":["There have been 13 other sightings in Daytona Beach","There were no other sightings in Daytona Beach on or around October 22nd 2010"],"Log Number":"US-11152012-0007","Object Features":"Other","Object Flight Path":"Straight-line path","Date of the Event":"10/22/2010 07:30 UTC","City":"Daytona Beach","Source":"MUFON","files":["/var/www/straped/mufon/html2text/43922.html.txt","/var/www/straped/mufon/org/43922.html"],"Weather Factors":"Unknown","divs":["Sighting DetailsI'm slow to report this because I've convinced myself of what it was. It occurred in late evening in October 2010. I can't remember the exact date but think it was around the 23rd to 27th of October. The reason I'm reporting it now is because I think there will eventually be other similar reports and it might be good to know approximately when these sightings began and where they were first seen. At the time, the wind was out of the Northwest, it was a partly cloudy evening. The prevailing clouds were all moving slowly to the Southeast from the Northwest. As I scanned the Southeast sky from my back yard, here in Daytona Florida, at dusk; I noticed a rapidly moving V or A shaped cloud pushing quickly from the Southeast to the Northwest, against the prevailing winds. It came in off the ocean from the direction of the Bahama's and within a matter of seconds it flew directly over my head, and in the direction of Alabama or Mississippi. A roll of clouds in the shape of an A, or V (or arrowhead) was all that was visible except for a faint outline that conformed to the shape of our Stealth B2 bombers. The unusual thing was that they have apparently added some sort of cloaking to the underneath of the craft. It was almost invisible to the eye. There was the outline that looked like a Stealth B2, but the night (early evening) sky was all that could be seen where the body of the craft should have been. Also; the roll of clouds at the front of the craft was unusual, considering how fast it was moving. It's hard to estimate the altitude it was flying, but I would guess at 2500 to 5000 ft. If I were to hold a matchbook cover at arms length and held it with one corner of the matchbook as the nose of the craft; that's how large it appeared from my perspective. It took less than 20 seconds for it to disappear on the NW horizon. I've timed commercial aircraft flying that same apparent distance and they usually take from one to two minutes to cover that same distance when they are cruising at about the same altitude. There wasn't a sonic boom, but it certainly seemed as if the thing was traveling well over the speed of sound. It made no sound at all. The roll of clouds in front made me think of what I've read concerning T.T. Brown's AG discoveries. (The AG well in front of a craft allegedly causes a cloud to form if the humidity is high.) I'm speculating about that, but it fits what I saw. I'm wondering if other, similar sightings have been reported. Somehow, I think we'll be told about it in a few years to come, but it's probably a top secret new version of the B2."],"Longitude":"-81.061075"}