{"files":["/var/www/straped/mufon/html2text/43923.html.txt","/var/www/straped/mufon/org/43923.html"],"Source":"MUFON","Country":"United States","Object Shape":"Boomerang","Viewing Distance":"101-500 Feet","Disposition":"Unresolved","Latitude":"38.838722","City":"Colorado Springs","map":"<A HREF = \"http://maps.google.com/maps?q=38.838722,+-104.812363(43923)&iwloc=A&hl=en\"> mufon case (43923) map </A>","Case Number":"43923","Date Submitted":"11/15/2012 05:04 UTC","divs":["Sighting DetailsOn the 13th of September of 2001, I was standing out front of my house which was just west of the Citadel Mall in Colorado Springs at approx. 1130 PM looking up at the stars and hoping to see one of several U.N. jets flying around during the no fly time surrounding 911---There were a few small clouds drifting East by South East as they normally do and not long after a patrolling jet crossed the mountain skyline heading North, I notice a large cloud stretching from the far north end of the block to the south end traveling against the normal cloud movement heading west directly towards Pikes Peak. I noticed what looked to be a leading metallic edge proceeding the cloud in the shape of the Air force's old flying wing---there was no noise coming or going and the cloud cover seemed to be emitting from just behind the leading edge and not trailing, but staying up and moving with the object--it was the size of an entire city block. I approximate its speed to a landing C-130, (100MPH) give or take a few and just to the west of me and I had to cross the street to see, the \"Cloud\" changed to a course that would take it directly over N.O.R.A.D., but then I lost sight. I witnessed the Flying Wing over my home town in Kansas when I was a boy and the extreme noise of it was what had made me look up. This object: A fast moving cloud with a metallic leading airfoil that could change directions while moving against prevailing clouds made not a sound. I have seen lower cloud formations move in opposite directions in a LOW verses High atmospheric overtake, but never witnessed one that that could change its heading in such a smooth maneuver while maintaining its speed and while maintaining a constant shape---Nor one with a metallic leading airfoil. Also, this \"Cloud\" was traveling in the opposite direction at what appeared to be the same altitude as the prevailing clouds. I made a lame attempt to report this as our government at the time asked that all things strange and out of sorts needed reported at the time no matter what, but I did not push the matter as George W. was only concerned with Non-existent Weapons of Mass Destruction, misinformation and misdirections at the time."],"Log Number":"US-11152012-0008","Object Features":"None","Object Flight Path":"Path with directional change","Longitude":"-104.812363","Date of the Event":"09/13/2001 11:33 UTC","Tags":"City","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Region":"Colorado","Summary":"city block size flying wing with trailing cloud cover past low overhead with no noise against prevailing cloud movement.","trends":["There have been 106 other sightings in Colorado Springs","There was one other sighting in Colorado Springs on or around September 13th 2001"]}