{"divs":["Sighting Details1. Where were you and what were you doing at the time? I was walking through the backyard with my husband. 2. What made you first notice the object? My husband, Jess Killion, yelled \"Wait! Look!\" and pointed up and to the North. 3. What did you think the object was when you first noticed it? Very close bright stars hanging in the night sky - which was clear. 4. Describe the object and its actions and motions in detail. Two dark glowing golden orange balls that hovered in the sky. After almost 15 seconds of observation, the bottom one disappeared, then the top one seconds after. 5. Describe your feelings, reactions and actions, during and after sighting the object. Shock and confusion. I, nor my husband, do not know what they were. 6. How did you lose sight of the object? The objects no longer glowed. They disappeared. My husband had mentioned flares, but there were no jets in sight at the time and the skies were clear. He even admitted \"Those things did not look like flares. I don't know what they were.\" Within several minutes while we stood there and discussed what we saw, a large jet (with a light on it's tale), flew over our location and headed north to where we saw the orbs."],"Date of the Event":"11/15/2012 08:05 UTC","trends":["There have been 19 other sightings in Peru","There were no other sightings in Peru on or around November 15th 2012"],"Country":"United States","Object Features":"Unknown","City":"Peru","Source":"MUFON","Object Flight Path":"Stationary","Sighting Duration":"00:00:15","Disposition":"Unresolved","Weather Factors":"Unknown","Summary":"2 dark glowing golden orange balls hovering to the North","Viewing Distance":"Unknown","Latitude":"40.753153","Region":"Indiana","Date Submitted":"11/15/2012 08:37 UTC","Longitude":"-86.061933","Object Shape":"Star-like","Log Number":"US-11152012-0015","map":"<A HREF = \"http://maps.google.com/maps?q=40.753153,+-86.061933(43930)&iwloc=A&hl=en\"> mufon case (43930) map </A>","files":["/var/www/straped/mufon/html2text/43930.html.txt","/var/www/straped/mufon/org/43930.html"],"Case Number":"43930","Tags":"City"}