{"Object Flight Path":"Hovering then path,Path with directional change","Tags":"City","files":["/var/www/straped/mufon/html2text/43932.html.txt","/var/www/straped/mufon/org/43932.html"],"Summary":"Sighting of an object at the black mailbox at Area 51","Log Number":"US-11152012-0017","Object Features":"Dome","Longitude":"-115.74278","Object Shape":"Disc, Oval","Region":"Nevada","divs":["Sighting DetailsAs a small group of tourists we had just left Rachel Nevada (Lil Ale'in) and stopped at the black mailbox en route to the Area 51 entrance. Earlier in the day we saw a helicopter in the area and two people in our group insisted that we were being followed by another man in a blue car. While we were doing our tourist thing at the black mail box, one of the group members shouted something that caused all of us to turn around. Two or three people began snapping photo's of a shiny object in the sky. It hovered for a few seconds, seemed to move back and forth in different directions and after 30 seconds or so took off in an incredible speed. I could not hear noise coming from the object but it certainly freaked me out. Obviously, everyone was pretty excited, but strangely enough one lady in our group from Germany got physically ill almost immediately after the sighting. When we got to the entrance to area 51 she got diarrhea directly in view of the men in the white truck that sit on the hill. I thought you should have these pictures but I really don't want any publicity. I can assure you of one thing...I will never go back to Area 51."],"map":"<A HREF = \"http://maps.google.com/maps?q=37.64472,+-115.74278(43932)&iwloc=A&hl=en\"> mufon case (43932) map </A>","Viewing Distance":"Over 1 Mile, Unknown","Disposition":"Unresolved","Country":"United States","Latitude":"37.64472","Case Number":"43932","Weather Factors":"Unknown","trends":["There have been 9 other sightings in Rachel","There were no other sightings in Rachel on or around November 8th 2012"],"Source":"MUFON","Date of the Event":"11/08/2012 02:30 UTC","Sighting Duration":"Undisclosed","Date Submitted":"11/15/2012 09:14 UTC","City":"Rachel"}