{"Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile, Unknown","Weather Factors":"Unknown","Source":"MUFON","Date Submitted":"11/15/2012 11:36 UTC","Latitude":"39.707414","Object Features":"None","City":"Glendale","Disposition":"Unresolved","Date of the Event":"11/05/2012 12:00 UTC","Country":"United States","Summary":"One Large yellow light cirlcling to the NE with 4 or 5 smaller lights (white)","Longitude":"-104.933317","Object Shape":"Circle, Cylinder, Disc, Oval, Sphere","Log Number":"US-11152012-0021","divs":["Sighting DetailsI work as a Cart Attendant at the Glendale Super Target Store in Glendale, Colorado. My job is to collect carts from the parking lot and bring them inside the store. On November 05, 2012 at around 7pm I went out to collect carts. I was on the North side of the lot, when looking up I saw one large yellow light wich appeared to be a helicopter. What disturbed me was that the light was going back and forth on a west to east axis in an unnatural pattern, I assumed that it may have been a a police helictopter. What made me second guess this assumption was that there were 4 to five smaller lights, the size of stars that were swirling and following the same east to west direction of the larger yellow light. I went in bringing carts to the store for 3 or 4 runs wich usually takes me 15 minutes for that amount of cart runs. I observed them for the last of the 3 to 4 runs, then they were gone. I knew something was unusual about this but put it out of mind. The next night when watching election coverage on Denver's Fox 31 KDVR, I read a blurb on the bottom of the screen saying \"UFOS OVER DENVER REMAIN UNEXPLAINED\". That is when I realized I saw something that was not ordiniary."],"Object Flight Path":"Path then hovering","Region":"Colorado","Tags":"City","trends":["There has been one other sighting in Glendale","There were no other sightings in Glendale on or around November 5th 2012"],"Case Number":"43936","files":["/var/www/straped/mufon/html2text/43936.html.txt","/var/www/straped/mufon/org/43936.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.707414,+-104.933317(43936)&iwloc=A&hl=en\"> mufon case (43936) map </A>"}