{"Object Shape":"Square, Rectagular","map":"<A HREF = \"http://maps.google.com/maps?q=31.03143,+-81.730504(43931)&iwloc=A&hl=en\"> mufon case (43931) map </A>","Case Number":"43931","Source":"MUFON","Log Number":"US-11152012-0016","Longitude":"-81.730504","Disposition":"Unresolved","Tags":"City","Sighting Duration":"Undisclosed","Date Submitted":"11/15/2012 08:41 UTC","Weather Factors":"Unknown","divs":["Sighting DetailsI was driving South on hwy 17 when I saw a black rectangular object cross over the road. My first thought was that a brid glided over the road. But then it occurred to me that it wasn't a bird, and a few seconds later as I got closer the the point where it crossed another one flew over the road, at which point it was closer. I wasn't sure what I saw. After I thought about it there were no visible engines, no wings, no horizontal stabilizers, no cockpit canopy, no rotor blades. Just a black rectangular shaped object of which I have never seen before. I cannot explain what I saw. It was flying as if it was follwing the creek or the marsh. When I got to the area they crossed I looked toward the East but I was unable to see them again. This was in broad daylight. The altitude was approximately 800-1000 ft. I still cannot believe what I saw. I was watching a ufo program which reminded me of the event. I wanted to put this on record so that maybe I could find out if some one had seen the same thing I saw. From where I was he objects would have been heading in the direction of Atkinson, Ga."],"Latitude":"31.03143","files":["/var/www/straped/mufon/html2text/43931.html.txt","/var/www/straped/mufon/org/43931.html"],"Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been no other sightings in White Oak","This sighting has never been favorited."],"Date of the Event":"10/20/2012 11:30 UTC","Summary":"two black, unwinged, no engines, no wings, no tail about 1/4 mile apart, one behind the other flew ovr hwy 17 in White oak ,ga","Region":"Georgia","City":"White Oak","Object Features":"None","Country":"United States"}