{"trends":["There have been 13 other sightings in Muncie","There were no other sightings in Muncie on or around February 6th 2006"],"Tags":"City","Disposition":"Insufficient Data","divs":["Sighting DetailsI was out at my mom's house to take her some groceries I picked up for her. She lives in the country and the stars are very bright. As I was looking up at the sky, admiring the view, I noticed a far-away object that at first I thought was a star, but then noticed it kept changing color. Then I noticed it moving funny - in short little straight lines and stopping - moving back and forth in short little spurts and stopping to pause after most of the movements. Sometimes it would go over and then up and down, but it usually went one direction and then stopped. When I noticed it, it was about at \"10:00 o'clock\" position in east. ( straight up being 12:00) However, it moved very slowly to the south until by 10:00 pm it was almost due south at roughly the same distance from the horizon. My mom saw it, and when I came home, I pointed it out to my two children and one grandchild. We watched it for awhile, but soon decided it wasn't going to do anything more and ceased watching about 10:00 pm. I think it must have been some sort of weather satellite or something but the movement is what really baffles me."],"Object Shape":"Unknown","Date of the Event":"02/06/2006 07:15 UTC","Case Number":"4394","Longitude":"-85.38334","Object Features":"Unknown","Log Number":"US-02072006-0003","Weather Factors":"Unknown","Source":"MUFON","Latitude":"40.201337","Country":"United States","Date Submitted":"02/06/2006 07:15 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Viewing Distance":"Over 1 Mile, Unknown","files":["/var/www/straped/mufon/html2text/4394.html.txt","/var/www/straped/mufon/org/4394.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.201337,+-85.38334(4394)&iwloc=A&hl=en\"> mufon case (4394) map </A>","Sighting Duration":"Undisclosed","Region":"Indiana","Summary":"bright object that turned red, blue, green, yellow","City":"Muncie"}