{"trends":["There have been 6 other sightings in Salisbury","There were no other sightings in Salisbury on or around November 7th 1977"],"Viewing Distance":"21-100 Feet","Tags":"City","divs":["Sighting DetailsFewer than a handful of people know about my close encounter. However, the event had such an impact upon me, that it still gives me cold chills whenever I think about it. I thought it was time to pass on the information to someone who might be able to make heads or tails out of it. At the time of the encounter, I lived with my wife in a little apartment just outside the city limits of Salisbury, North Carolina. I was employed as art director at the corporate headquarters for Pic 'n' Pay Shoe Stores, located in Charlotte. I commuted back and forth to work, a distance of 50 miles one way. I don't remember the exact date. I do remember that it was sometime in early November 1977. The day had been miserable, with a cold steady rain. When I left work, it was already getting dark. The drive home usually lasted about an hour in clear weather. I knew the drive home in all the slop and rush-hour traffic was going to be a \"bear!\" My apartment was located near an old, abandoned drive-in theatre off Highway 601. As I sat at the stoplight at the intersection of Statesville Boulevard and what is now known as North Jake Alexander Boulevard, I noticed in the distance to my right what at first appeared to me to be \"heat\" lightning. It struck me as being rather odd in that it was cold (mid-30s) and the flashes were different in color -- alternating among reds, yellows, blues, and greens. Then I thought that maybe something was going on at the old drive-in theatre, but as I drove along Jake Alexander, the area affected by the flashes seemed to be centered over the intersection of Jake Alexander and Highway 601, just south of the old drive-in. As I got closer to the intersection, I slowed down and rolled down the window slightly to try to pick up any thunder or any other kind of noise. The only sounds were the wind pushing rain through the crack and the car's engine. About 50 feet from the stop sign, I pulled my car over to the shoulder of the road and stopped. The flashing was now directly over me. I shut off the engine and listened. There was nothing but brilliant flashes of different colors followed only by wind and rain. I was dumbfounded. As the clouds were very low, I could not make out any distinct shape -- only glowing clouds alternating colors. It made absolutely no sense. I remember at the time several vehicles coming up beside me over the next few minutes as they stopped for the stop sign. Each time I would roll down my window enough to get my left arm out and point straight up at the clouds. No response. I must have sat there riveted to my seat, watching the greatest, noiseless light show I had ever witnessed. The colors seemed to dance all over the place above me, in no particular order or sequence. I thought to myself, \"I have got to share this with someone!\" I started the car and turned right towards my apartment. If anyone would believe me, my wife would. Or so I thought. I bounded through the door like a kid at Christmas, telling my perplexed wife about what I had just seen. You would have thought I had lobsters coming out of my ears as she just looked and stared. And though I pleaded with her to grab a coat and follow me back to the car, she said there was no way in hell that she was going out in a cold rain to look at flashes of light. I practically dove back through the door and headed the car back towards the intersection. However, the lightshow had gone. There was nothing in its place but darkness and the tiny glow from the flashing intersection light. Well, that's it. I wish I had more to tell, but that's the extent of my story. I will tell you this though, the event had a tremendous impact upon my life and how I have looked at the world ever since."],"Log Number":"US-02072006-0004","Source":"MUFON","Object Shape":"Flash, Unknown","Object Flight Path":"Stationary","Latitude":"35.672133","Summary":"There was really no distinct shape, just flashes of different colored lights in the low-hanging clouds. And, except for the wind and the rain, absolutely no other sound.","Longitude":"-80.469166","Region":"North Carolina","Date of the Event":"11/07/1977 07:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.672133,+-80.469166(4395)&iwloc=A&hl=en\"> mufon case (4395) map </A>","Country":"United States","files":["/var/www/straped/mufon/html2text/4395.html.txt","/var/www/straped/mufon/org/4395.html"],"City":"Salisbury","Object Features":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"11/07/1977 07:00 UTC","Weather Factors":"Windy, Rain, Medium","Disposition":"Unknown","Case Number":"4395"}