{"Sighting Duration":"Undisclosed","Longitude":"-121.810206","Summary":"(GS) Investigating a sound, went outside and saw triangle craft slowly pass overhead. It hovered on the horizon.","City":"Davis","Country":"United States","Region":"California","divs":["sighting detailsmy dog was kind of acting up, and she had done so a few nights before. she seemed anxious, and seemed to want me to take her out. she had done this a few nights before, and i had taken her out. when i went outside i remember hearing a loud sound, of what seemed like horns, or trumpets from all around. i remember it being very early in the morning, maybe two am, and thinking, why isnt anyone else waking to this sound. i thought about it later, and thought maybe my dog had heard the sound, and that is why she wanted to go out. so on october 2nd, when my dog did this again i was much quicker to go outside. again i heard the horn\\trumpet sound, though this time it seemed a bit muted, almost like i was hearing it in a vacuum, similar to hearing the ocean in a seashell. i looked over the horizon and saw nothing, then from overhead noticed what appeared to be a triangle of lights, with what appeared to be randomly moving lights running between each of the tri angle points. it was very large, and all i could really see were the lights, and definitive darker, more shadowed area within the confines of the lights on the corners. it continued to move away from me in a southern direction, and reached a point on the horizon where is seemed to remain still, or in a relatively central location for a few minutes. i was able to get 31 seconds of video with my cell phone, and then the battery died. the video was shot prior to it reaching the location on the horizon where it hovered,and i opted to stay and watch it, as opposed to trying to go in and get a quick charge on my phone to record more video (which is what i did after watching it hover for a few minutes on the horizon, when i returned to try to record more, it was gone.) i have seen a lot of unusual air traffic, late night, early morning in this area. i am very close to a small airport, but the planes that fly in, both day and night are distinctly different than what i heard or saw o n the 2nd. and on the previous night. i will keep looking, a! nd hopef ully get more video, should it occur again."],"Latitude":"38.572003","files":["/var/www/straped/mufon/html2text/43950.html.txt","/var/www/straped/mufon/org/43950.html"],"Log Number":"US-11162012-0013","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.572003,+-121.810206(43950)&iwloc=A&hl=en\"> mufon case (43950) map </A>","Object Shape":"Flash, Sphere, Triangle, Other","trends":["There have been 8 other sightings in Davis","There were no other sightings in Davis on or around October 2nd 2012","This sighting has been favorited 2 times.",""],"Source":"MUFON","Disposition":"Unresolved","Weather Factors":"Unknown","Date of the Event":"10/02/2012 01:43 UTC","Viewing Distance":"101-500 Feet","Case Number":"43950","Object Features":"None","Object Flight Path":"Path then hovering","Date Submitted":"11/16/2012 05:22 UTC"}