{"Tags":"City","City":"Omaha","Viewing Distance":"Over One Mile","Disposition":"Unresolved","Object Flight Path":"Path with directional change","divs":["Sighting Details I was headed to work at 2:45pm on a perfect skyblue day, going west and stopped at a light. I noticed a small prop plane flying into a local small airport and while I was watching the plane I caught a glimpse of sunlight reflecting off something above the small plane. I figured it would be a big plane flying into the local air force base since where I live is close to thier flight paths. Instead of it beaing sunlight bouncing off a wing, it was light bouncing off the top of what looked like a paper cut-out of a typical small round dome shaped ufo. I say a paper cut-out because that's how it moved like a leaf or paper blowing in the wind. The light was bouncing off it as it fluttered in the air. I thought it might just be a mylar ballon, but then it all the sudden it just vanished. I looked for it to reappear as I started going again, but it never did. So I only saw it about the length of the traffic light. I watched as I pulled ahead, but didn't see it again, but I did then see a commercial size plane flying towards the Air Force base. I still am not sure what it was and it bugs me because it looked so typical of what you always see ufo's drawn like, like the imagine above but smaller around. The movement was also very wierd it didn't hover or zip like you always hear. It's vanishing was the kicker, I didn't lose sight of it - I saw it disappear. Just for the record, I do believe, even more now, I didn't ever think I would see one especially in the day time and I am sane."],"Object Shape":"Circle, Oval","Date of the Event":"11/15/2012 02:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.212418,+-96.10087(43957)&iwloc=A&hl=en\"> mufon case (43957) map </A>","files":["/var/www/straped/mufon/html2text/43957.html.txt","/var/www/straped/mufon/org/43957.html"],"Latitude":"41.212418","Log Number":"US-11162012-0020","Country":"United States","Sighting Duration":"Undisclosed","Date Submitted":"11/16/2012 10:58 UTC","Source":"MUFON","trends":["There have been 83 other sightings in Omaha","There were no other sightings in Omaha on or around November 15th 2012"],"Summary":"Common round domestructure like a rivot.","Case Number":"43957","Object Features":"Dome","Region":"Nebraska","Longitude":"-96.10087","Weather Factors":"Unknown"}