{"Object Shape":"Flash","Latitude":"40.547259","Log Number":"US-11162012-0015","Country":"United States","Object Features":"Unknown","Date of the Event":"11/16/2012 12:00 UTC","Disposition":"Unresolved","Sighting Duration":"Undisclosed","City":"Flora","files":["/var/www/straped/mufon/html2text/43952.html.txt","/var/www/straped/mufon/org/43952.html"],"Summary":"Saw huge lights flash and then disappear. Tried to follow but was too far away. Then saw planes tracking it.","Weather Factors":"Unknown","Date Submitted":"11/16/2012 09:03 UTC","Object Flight Path":"Path with directional change","Viewing Distance":"Unknown","Longitude":"-86.524443","map":"<A HREF = \"http://maps.google.com/maps?q=40.547259,+-86.524443(43952)&iwloc=A&hl=en\"> mufon case (43952) map </A>","Case Number":"43952","divs":["Sighting DetailsI was at my grandparents across the street when my best friend called me. He told me to go outside and look in the northern sky because he's seeing something weird. So I did. I went out and looked but couldn't see anything so I called him again. Just as he picked up the phone it flashed. There were four enormous lights that faded quickly. So I ran and got my dad. Just as he was walking out of the house we saw another flash, but smaller. So we stood in the drive way for a little bit and only saw one more. So we decided to get into the truck and drive in that direction. We drove about a mile and pulled off on a country road. We sat there for about 3 minutes and then saw another one to the north. We now realized that these were much farther away than they really were. The reason why they looked so close was because of the massive size of the lights. So we continued north about 10 miles to Camden. On our way we noticed some flashing lights in the sky coming from planes. There were 3 of them. We got to Camden and pulled off in the country and figured out that the planes were some kind of fighter jets because they were moving so fast. We came to the conclusion that these jets were tracking the UFO. The most mind boggling part of the whole thing is the size of the lights that we saw compared to the lights coming from the jets. It was absolutely unbelievable."],"Tags":"City","Source":"MUFON","Region":"Indiana","trends":["There have been no other sightings in Flora","This sighting has never been favorited."]}