{"Object Features":"Unknown","Object Flight Path":"Path then hovering","Viewing Distance":"Over One Mile","Country":"United States","Disposition":"Unresolved","Longitude":"-79.321653","map":"<A HREF = \"http://maps.google.com/maps?q=40.672177,+-79.321653(43954)&iwloc=A&hl=en\"> mufon case (43954) map </A>","Date Submitted":"11/16/2012 09:44 UTC","Date of the Event":"11/16/2012 04:50 UTC","trends":["There has been one other sighting in Shelocta","There were no other sightings in Shelocta on or around November 16th 2012"],"divs":["Sighting DetailsI was driving from Johnstown PA to Pittsburgh PA at about 4:50 pm on Nov. 16th, 2012. I was traveling West on interstate 422 when I witnessed a glowing ball to my left moving in the same direction as me. In front of me a few miles was another glowing ball. These two balls converged and were joined by a third (I did not see where the 3rd one came from, I hadn't pulled over yet). They stayed in a triangular formation and hovered a few miles in front of me for a solid 6 - 10 minutes during which time I pulled over and got some pictures. I attempted to take video, but the shapes were not showing up on my viewfinder. I was however able to get some still photos. While the objects were hovering, flame or light was coming out of the bottoms making them resemble jellyfish. Anytime they moved, they were simply round. Anytime they stopped, they had something coming out of the bottom again. After 10 minutes or so, they 'faded' from site. I continued down the road a ways, and found that they likely had been hovering over a power plant (I think it was nuclear -- it had that type of cooling towers) . A few minutes later (maybe 15 minutes from when I initially saw the objects) several military jet planes (4-6? I was driving and by now it was getting dark.) came from the West heading towards where I had seen the objects by the plant. I have military experience and have seen flares, various planes, drones copters, etc. and these objects were not like anything I had ever seen. They initially moved independently, then joined up and hovered in formation. They did not leave those trails in the sky like a passenger jet or the military jets that came after the fact. When they faded, there was no trails or anything left. There were several of us that pulled over and took pictures, but I do not know any of those people."],"Tags":"City","Case Number":"43954","Latitude":"40.672177","Sighting Duration":"00:10:00","Source":"MUFON","Weather Factors":"Unknown","Region":"Pennsylvania","Object Shape":"Sphere, Triangle","City":"Shelocta","Log Number":"US-11162012-0017","files":["/var/www/straped/mufon/html2text/43954.html.txt","/var/www/straped/mufon/org/43954.html"],"Summary":"Witnessed 3 glowing objects converge and form a triangle over a nuclear power site."}