{"Disposition":"Unresolved","Case Number":"43965","Latitude":"43.252562","Region":"New York","files":["/var/www/straped/mufon/html2text/43965.html.txt","/var/www/straped/mufon/org/43965.html"],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","divs":["Sighting DetailsI was on my friends porch at her home off of Rock Beach Rd in Irondequoit when we both noticed a large burning object slowly descending from the sky roughly 40 feet out and 100 feet up from where we were standing. We both immediately ran out into the street to better observe. My initial impression was that it was some kind of flaming debris but after only a few seconds of watching both the variation in the intensity of flame and the suddenly upward and outward flight path, I soon realized that what I was witnessing had no reasonable, earthly explanation whatsoever. Believe me, I am a highly skeptical, maybe even pessimistic person and would not believe any of this if you told it to me, but it happened. We proceeded to visually follow the object by walking north to the end of her street. The street dead ends at the beach(Lake Ontario). We then walked east and began to notice at least 3, if not more of the same objects to the north and north east. By this time they were all at a much greater altitude than the initial orb was when we had first started to observe roughly 10 minutes before. We did manage to get video of it for about 30 seconds when it was maybe 200-300 feet above us. Once we were at the beach I noticed an immense structure slowly floating very high in the air. It seemed to have a kind of haze for lack of a better word that prevented us from getting a real detailed look at it though it was easy to track because it pulsed a faint light every 5 seconds or so. Its hard to explain but it definately seemed to be a solid object unlike the red burning orbs that were more gaseuos in appearance and moved and stopped erratically whereas the large object stayed on a somewhat straight path. the larger object completely stopped moving about 30 minutes into our observation and hovered at a very high altitude over irondequoit bay, barely visible if you hadn't been tracking it as we were. At certain points in time I believe I could make out a series of symetrically spaced lights on this large craft and I also believe that I could see the smaller orbs seemingly buzzing around it but of this detail I can't be sure because of the high altitude and the haze that was either minor cloud cover or something eminating from the haze. I think the later. We observed all of this over the course of an hour or so and throughout this time there were quite a few visibly airplanes that seemed coincidentally to have flight paths that took them close to these objects. My gut feeling is they were not commercial but military planes but maybe thats just TV talking. I would swear to seeing all of this unfold on a stack of bibles, under oath in a court of law and so would my friend. We immediately got online and saw some videos of red orbs over Lake Ontario that were very close to what we saw, except we saw the one orb from a close enough distance that we could actually make out flames eminating from or harnessed inside of its aura.An amazing yet unnerving night that I am going to try not to think too deeply about because of the scary implications of the existance of these things."],"Date of the Event":"11/16/2012 09:00 UTC","City":"Rochester","Summary":"We initially saw a burning orb about 100 feet overhead that we followed to the beach and witnessed many more of the same object and one more much larger object that appeared huge and hovered slowly northeast. It was long in shape and had multiple lights.","Weather Factors":"Unknown","Date Submitted":"11/17/2012 02:39 UTC","Source":"MUFON","Longitude":"-77.596046","Object Shape":"Cigar, Cylinder, Fireball, Sphere, Triangle, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.252562,+-77.596046(43965)&iwloc=A&hl=en\"> mufon case (43965) map </A>","Log Number":"US-11172012-0003","trends":["There have been 53 other sightings in Rochester","There were no other sightings in Rochester on or around November 16th 2012"],"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Object Features":"Unknown","Tags":"City","Sighting Duration":"Undisclosed","Country":"United States"}