{"Source":"MUFON","Latitude":"36.621866","files":["/var/www/straped/mufon/html2text/43961.html.txt","/var/www/straped/mufon/org/43961.html"],"Object Features":"Dome","Summary":"Two black spherical objects with a ring of lights around them moving slowly enough to appear to be hoovering in the sky.","Country":"United States","Date Submitted":"11/16/2012 11:31 UTC","Case Number":"43961","Region":"Oklahoma","Disposition":"Unresolved","Log Number":"US-11162012-0024","Object Flight Path":"Path with directional change,Path then hovering","Sighting Duration":"00:08:00","divs":["Sighting DetailsOn October 16, 2012 my family was traveling east on a rural road from the town of Grove, OK. I noticed an interesting light pattern in the south east but it seemed like an airplane. When we turned Northeast we could see it clearing from our car windows. The first object appeared to be hoovering just south of the town cemetery where there is a cattle ranch. Then the white lights on the object seemed to brighten and turn yellowish orange. It then appeared to move upward in the sky very slowly. We arrived at our home less than five minutes and my daughter pointed it out in the sky it had barely moved. It was not like any airplane we had seen in the area the lights were too big and they were just different in pattern. While standing in our yard after getting out of the car, I pointed out a second object. I could clearly see that it was spherical shaped and it had an identical ring of light on it. It appeared closer than the first object then it was suddenly further away. I moved very slowly in the direction of the first object that we saw and if they had continued on that path they would have collided. Then they both moved south still looking like they were moving at a snail's pace in the sky then they just faded. I was so taken by watching the event that I didn't even think about filming it on my phone."],"City":"Grove","Longitude":"-94.739037","Viewing Distance":"Unknown","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.621866,+-94.739037(43961)&iwloc=A&hl=en\"> mufon case (43961) map </A>","Date of the Event":"11/16/2012 09:45 UTC","trends":["There have been 2 other sightings in Grove","There was one other sighting in Grove on or around November 16th 2012"],"Object Shape":"Saturn-like, Sphere","Tags":"City"}