{"Sighting Duration":"Undisclosed","Viewing Distance":"21-100 Feet","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=28.512095,+-81.312946(43962)&iwloc=A&hl=en\"> mufon case (43962) map </A>","Case Number":"43962","trends":["There have been 112 other sightings in Orlando","There were no other sightings in Orlando on or around November 13th 2012"],"Object Flight Path":"Hovering then path","Country":"United States","Source":"MUFON","Latitude":"28.512095","Log Number":"US-11162012-0025","Tags":"City","Longitude":"-81.312946","Weather Factors":"Unknown","Disposition":"Unresolved","divs":["sighting detailsi was walking my dog about 6:10pm on 11\\13\\12 and was watching a jet land, as i like to do, and noticed an orange ball out of the corner of my eye. it had no blinking lights so i knew it wasn't a plane and it followed the tree tops...i watched it for about 5 seconds and when i turned to leave saw several \"fireballs\" come out of the atmosphere. i stood there in awe watching as one, then three were what looked like they were :\"flicked\" out of the atmosphere...i ran to get my camera and got a pic and video but it doesn't do justice to what i saw...they were following each other once they came into the atmosphere and were slow moving...i ran around one of the condo buildings to video but they were heading west. whatever i saw was beautiful and lasted about 5 minutes. to answer the questions on the left sidelink: 1. walking my dog 2. i was watching a jet land but something moving in the sky to the left caught my eye 3. i thought it strange that it was orange and had no blinking lights like a plane 4. when i saw them come into the atmosphere, i tought they moved together like bubbles but in a line 5. seeing what i saw at first was surreal and i stood there dumbfounded until i thought to go get my camera, then while trying to get pictures, my heart was pounding and i forgot all about how to iso my camera!! after, when i calmed down, i thought how beautiful the orbs were!! 6. i followed them as they headed west."],"Object Shape":"Fireball","files":["/var/www/straped/mufon/html2text/43962.html.txt","/var/www/straped/mufon/org/43962.html"],"City":"Orlando","Region":"Florida","Summary":"Walking dog and watching a jet land saw orange ball out of corner of eye, then fireballs....","Date of the Event":"11/13/2012 06:10 UTC","Date Submitted":"11/16/2012 11:31 UTC"}