{"divs":["Sighting DetailsOver the past few weeks I have noticed these flashing, multi-coloured objects in the sky over areas in Peoria County, particularly Chillicothe. I've seen dozens in one night just circling the train bridge over the river, around the town, then coming back to the island, then back to the train bridge. I can't make sense of them. When they move they do so at a leisurely pace, but change direction and circle a small area in a seemingly directionless way. It's hard to describe. Some stay completely stationary and are very easy spot out against the darkness of the sky. The colors flash so quickly but you can see red, green, purple, white, yellow, orange, pink, blue, all changing lightning fast and pulsing with no type of rhyme or reason. There are at least 2 of them that remain completely stationary in the sky in view from my driveway almost every night for the past 4 nights in a row. I typically see them show up around 10pm and they just don't move. They pick the same spot every single night and just stay there. Sometimes there are 3 or 4 spread out in every direction but they seem to favour the river. The distance from my house and the closest one is hard to determine, but it appears to be right over the river or not far on the other side of it. They sometimes disappear after a few hours but one has stayed as late as 6am before. There are still the 2 (in the attached videos) outside right now. If you pause the video and play it back frame by frame you can see how quickly the colours change and how it appears to be \"burning\" almost like a gas fire. It's really unbelievable and they're really easy to see at night. Their behaviour appears to be predictable so I imagine they'll be back again tomorrow night."],"Object Features":"None","Sighting Duration":"Undisclosed","Date Submitted":"11/17/2012 05:04 UTC","Tags":"City","Viewing Distance":"Over One Mile","Object Flight Path":"Stationary","Log Number":"US-11172012-0006","Latitude":"40.950356","Weather Factors":"Unknown","Source":"MUFON","Object Shape":"Fireball, Sphere","Disposition":"Unresolved","City":"Chillicothe","Date of the Event":"11/17/2012 12:00 UTC","Longitude":"-89.461658","map":"<A HREF = \"http://maps.google.com/maps?q=40.950356,+-89.461658(43968)&iwloc=A&hl=en\"> mufon case (43968) map </A>","trends":["There have been 2 other sightings in Chillicothe","There were no other sightings in Chillicothe on or around November 17th 2012"],"Summary":"FLASHING/BURNING SPHERES OVER CENTRAL IL","Region":"Illinois","Country":"United States","Case Number":"43968","files":["/var/www/straped/mufon/html2text/43968.html.txt","/var/www/straped/mufon/org/43968.html"]}