{"Tags":"City","Summary":"My dad and I saw a silent hovering boomerang shape craft when we noticed it it made a whoop whoop whoop sound and shot off over the trees. We were very close.","trends":["There have been 12 other sightings in New Braunfels","There were no other sightings in New Braunfels on or around August 1st 2003","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/4396.html.txt","/var/www/straped/mufon/more/4396_submitter_file1__ufo.jpg","/var/www/straped/mufon/org/4396.html"],"divs":["Sighting Details1. My dad and I were staying in our motorhome in the hill country. We were sitting around a campfire discussing buying land in Seguin. I had drank appx 5 beers (I was not impaired). He had none. 2. I noticed it when my dad exclaimed, \"There it is!\". As he had seen it on a previous occasion and I thought he had seen something else maybe. I looked and saw it and was quite taken aback. 3. I didn't know what it was as I exclaimed, \"What the hell is that a couple times.\" I was very stunned. After seeing its maneuvers I thought I had seen something that defied laws of physics as I understand them. Mainly that of intertia. 4. The object was tomohawk shaped in my opinion. It appeared to be dark. There were 5 lights in the front (the wide portion) and a larger light in the center of bottom of the craft. The lights were dimmly glowing not really putting off any light. (my vantage point was from underneath, to the side and back). It was perhaps 60-80 ft. wide and 6-8ft thick and 60-80 ft. long. It was hovering perfectly still appx 20 ft. above the edge of the trees and about 100 ft. away when we first noticed it. I had the feeling it had been there for a while possibly listening to us or waiting to see if we would notice it or something because it was so still when we first saw it. After it realized we saw it we heard a whoot whoot whoot sound. There was a slight acceleration and then in an instant it shot off very low (20 ft or so) over the trees out of our vision. It was very very fast, nearly instantly gone. 5. My initial reaction was that of utter shock. What I saw didn't compute at first. I was then in awe. I told my dad that just didn't make sense and he said, \"I know thats what I was trying to tell you.\" I then drew a picture of it. I'm still amazed by it and have tried to find a picture of it on the net but the closest thing I have found is the \"original\" flying saucer. 6. It shot off over the trees (they are maybe 30 feet tall)."],"Country":"United States","Object Flight Path":"Hovering then path","Log Number":"US-02072006-0005","map":"<A HREF = \"http://maps.google.com/maps?q=29.707732,+-98.118273(4396)&iwloc=A&hl=en\"> mufon case (4396) map </A>","Latitude":"29.707732","Viewing Distance":"21-100 Feet","Source":"MUFON","Region":"Texas","Case Number":"4396","City":"New Braunfels","Longitude":"-98.118273","Sighting Duration":"00:00:30","Object Features":"None","Disposition":"Unknown","Date of the Event":"08/01/2003 02:15 UTC","Weather Factors":"Unknown","Date Submitted":"08/01/2003 02:15 UTC","Object Shape":"Boomerang, Other"}