{"City":"Goldsboro","Summary":"APPROXIMATELY 10-15 MULTI-COLORED LIGHTS .SHALLOW HUMMING SOUND.HUGE . EXTREMELY LARGE.","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Disposition":"Unknown","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Date of the Event":"03/06/1996 08:00 UTC","Longitude":"-77.992765","Latitude":"35.384884","Region":"North Carolina","Tags":"City","divs":["Sighting DetailsIWAS HEADED HOME FROM KENLY N.C. ON MEMORIAL CH. RD.I STOPPED AT THE STOP SIGN CONNECTING MEMORIAL CH. RD. AND HWY.581.IWAS AT A DEAD STILL POSTION WHEN I NOTICED THIS HUGE BUNCHED UP MULTI COLORED LIGHTS JUST FLOATING EXTREMELY LOW TO THE GROUND.APPROXIMATELY,100F. OR LESS.THE LIGHTS WERE LARGE.THEY BRIGHT,BUT NOT AS BRIGHT AS YOU WOULD EXPECT TO BE SO LOW OR SO LARGE.THE AIR SPEED COULD BE COMPARED TO THAT OF ASLOW MOVING CAR.I REALIZIED THAT THE CRAFT WAS NEARLY ON TOP OF ME.BEFORE IT WAS DIRECTLY ABOVE ME,I TURNED ON RT.OF 581 HEADING TOWARDS GOLDSBORO,N.C.IM SATISFIED JN MY MIND THAT THE CRAFT TURNED AND FOLLOWED ME.MY ROAD SPEED WAS 70-75 MILES PH.THE CRAFT APPEARED TO STAY WITH .REFLECTING BACK ,IT SEEMS THAT I WAS BEING TOYED WITH.IT APPEARED TO SYAY SIDE BY SIDE WITH ME FOR ABOUT 5 MILES.I REMEMBER THINKING TO MYSELF THAT THERE SPEED HAD INTENTIONALLY PICKED UP AS IF THE CRAFT WAS WATCHING ME. I ALSO REMEMBER THINKING THAT I WISED MY YOUNG SON WAS NOT WITH ME.I FOUND IT TO BE EXCITING AND SCARY AT THE SAME TIME.HOWEVER,AFTER ABOUT 5MILES THE CRAFT APPEARED TO HEAD TOWARDS THE GOLDSBORO CITY AREA CLOSE TO THE AFBASE.ALTHOUGH, I HAD ALOT OF CROOKS AND TURNS I WAS ABLE TO ALMOST CATCH UP WITH IT.IT WAS'NT UNTIL I WAS ON HWY.70 THAT I WAS ABLE TO SEE JETS COMING OFF THE BASE MAKING FLY BYS.I WATCH IN AMAZEMENT AS THE CRAFT PICKED UP SPEED AND APPEARED TO ASCEND FAIRLY RAPIDLY BEFORE IT JUST FLEW IN WHAT WAS LIKE THE BLINK OF A EYE.I NEVER PLANNED ON SHARING THIS INFORMATION FOR THE OBVIUOS REASONS.BUT,HERE IT IS."],"files":["/var/www/straped/mufon/html2text/4397.html.txt","/var/www/straped/mufon/org/4397.html"],"Weather Factors":"Unknown","Log Number":"US-02072006-0006","trends":["There have been no other sightings in Goldsboro","This sighting has never been favorited."],"Case Number":"4397","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=35.384884,+-77.992765(4397)&iwloc=A&hl=en\"> mufon case (4397) map </A>","Date Submitted":"03/06/1996 08:00 UTC","Object Shape":"Square, Rectagular, Triangle","Country":"United States"}