{"Object Features":"Other","Summary":"I was sranding on my porch that faces the west saw a bright orange tulip shape object for about 10 seconds, was going in a straight path then dropped down and disappeared, the skies were clear, stars were out and you could see the moon to the south","City":"Mt Clemens","Weather Factors":"Unknown","Longitude":"-82.896029","Source":"MUFON","divs":["Sighting DetailsI was standing on my front porch that faces the west, approx. 7:03 pm, and and suddenly a bright orange tulip shaped object appeared, coming from the north west. We are not far from Detroit Metro airport and Selfridge ANGB, and are used to seeing airplaines and air craft. This looked like nothing coming from the airport or the base. mainly because of the bright orange color and no sound. The skies were clear, you could see the stars out and the crescent moon in the south west area. This is the second time I have seen this type shaped object, the same color. It was moving at a slow to medium speed, then dropped down. I started to count, and came up with 15 seconds, but I was counting fast, so it was more likely 10 seconds, this particular occurence. It made no sound at all. I tried to compare it with the shape of a jet liner, but in comparison, it was at least 3-4 times larger. It was very bright in color, like a bright pumpkin orange, with three peaks (like a tulip) My neighbor's had just pulled up in their driveway, but I was afraid to call them to take a look, I didn't want to take my eyes off of the object and lose sight. It was going in a straight line going south, then dropped down, and even though you could see stars out, I thought that maybe it had gone behind a cloud, so I waited to see it come out the other side, which it never did. The first time made me feel like maybe my eyes were playing tricks on me, but to see it a second time confirmed that it was some sort of UFO. Has anyone reported seeing this also? I know the last time, I had Googled what I saw and someone reported something similar. I do hope someone will contact me in regards to last night's sighting. I'd appreciate some feed back about this. Thank you, Lisa Simon"],"files":["/var/www/straped/mufon/html2text/43972.html.txt","/var/www/straped/mufon/org/43972.html"],"Date of the Event":"11/16/2012 07:03 UTC","trends":["There have been 6 other sightings in Mt Clemens","There were no other sightings in Mt Clemens on or around November 16th 2012"],"Viewing Distance":"Over One Mile","Date Submitted":"11/17/2012 09:12 UTC","Tags":"City","Disposition":"Unresolved","Country":"United States","Latitude":"42.59097","Region":"Michigan","Case Number":"43972","map":"<A HREF = \"http://maps.google.com/maps?q=42.59097,+-82.896029(43972)&iwloc=A&hl=en\"> mufon case (43972) map </A>","Sighting Duration":"00:00:10","Object Flight Path":"Path with directional change","Object Shape":"Other","Log Number":"US-11172012-0010"}