{"Region":"Tennessee","Summary":"Moving Star Like Orb - Day Time - Tullahoma TN","Case Number":"43979","divs":["Sighting DetailsI had pulled over on the side of the road at the end of Tullahoma Industrial Park (just at the edge of Tullahoma TN) when I noticed a white star like orb traveling between a split in the clouds. (the split was actually what caught my eye) As I was looking at the cloud, I noticed the object traveling slowly at first up through the split then it hovered a bit and started to move again and took off so fast it seem to disappear. I watched it for about 1 to 2 minutes. When I got home and was watching the video I slowed it down to a little more than half speed and I seen the object drop straight down very fast even on half speed and then come back up. The dropping straight down part was not visible to the eye when I seen it. It was really amazing, whatever it was!!! Description: Bright light, star like orb, orb or sphere shaped, hovering and able to drop straight down and take off at a very high velocity beyond what the eye could see, no wings, no sound. Nov.9.2012 4:04 PM youtube user: Staroth999 for anyone who can't see the video here."],"trends":["There have been 4 other sightings in Tullahoma","There were no other sightings in Tullahoma on or around November 9th 2012","This sighting has been favorited 1 time.",""],"Object Features":"Unknown","Object Flight Path":"Path with directional change,Path then hovering","Tags":"City","files":["/var/www/straped/mufon/html2text/43979.html.txt","/var/www/straped/mufon/org/43979.html"],"Longitude":"-86.208014","Viewing Distance":"Unknown","City":"Tullahoma","Latitude":"35.371784","Country":"United States","Sighting Duration":"Undisclosed","Log Number":"US-11172012-0017","Weather Factors":"Unknown","Disposition":"Unresolved","Date Submitted":"11/17/2012 05:00 UTC","Source":"MUFON","Date of the Event":"11/09/2012 04:04 UTC","Object Shape":"Sphere, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=35.371784,+-86.208014(43979)&iwloc=A&hl=en\"> mufon case (43979) map </A>"}