{"Region":"Manitoba","Case Number":"43971","Sighting Duration":"Undisclosed","Country":"Canada","Latitude":"49.86926","Log Number":"CA-11172012-0009","City":"Winnipeg","Weather Factors":"Unknown","Object Features":"None","trends":["There have been 43 other sightings in Winnipeg","There were no other sightings in Winnipeg on or around November 15th 2012"],"divs":["Sighting DetailsMe and my two toddlers arrived home in Charleswood, parking our car behind the house. I gathered the boys, and walked to the gate. I looked up at the sky westwards, to determine if it was cloudy or not, when I observed a satellite in between a break in the clouds, (Ripple-style cloud formation, or waves?). Then I saw another satellite beside it on the right, except it was lagging a little behind. That caught my attention as satellites do not travel in pairs. Suddenly, a third and then a fourth satellite were also observed through the cloud breaks. The third one on the left \"slowed\" and stayed in one spot for about 10-15 seconds then proceeded to fly west-wards. One of the satellites changed course at one point, very slightly, but all were observed flying from the east to west. I proceeded into the house, got my boys to watch cartoons with a bag of chips while I grabbed my phone and ran back outside. My friend who lives out in Transcona, was able to verify what I was seeing. I returned into the house to check on my sons, went back outside, and saw at least one more satellite, this one, I'm not sure was really one of ours or not, but it had been also travelled from the east to west and there was no longer cloud cover. The duration of this whole event happened after 6pm and may have lasted about 15-20 minutes in total."],"Date Submitted":"11/17/2012 08:33 UTC","Summary":"November Winnipeg UFO sighting","Viewing Distance":"Unknown","Object Shape":"Sphere","Disposition":"Unresolved","Source":"MUFON","files":["/var/www/straped/mufon/html2text/43971.html.txt","/var/www/straped/mufon/org/43971.html"],"Longitude":"-97.256369","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Date of the Event":"11/15/2012 06:05 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=49.86926,+-97.256369(43971)&iwloc=A&hl=en\"> mufon case (43971) map </A>"}