{"Source":"MUFON","Latitude":"42.811877","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.811877,+-85.376617(43970)&iwloc=A&hl=en\"> mufon case (43970) map </A>","Date Submitted":"11/17/2012 08:25 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/43970.html.txt","/var/www/straped/mufon/org/43970.html"],"Summary":"Three golden lights, brighter than stars, moving in formation turning north, fading and disappearing","Region":"Michigan","City":"Alto","Object Flight Path":"Path with directional change","Object Shape":"Triangle","Country":"United States","trends":["There have been no other sightings in Alto","This sighting has never been favorited."],"divs":["Sighting DetailsWent to the window about midnight to see three lights in the sky, at first not moving. They were in a triangle shape, obviously, as three points always create a triangle of some sort. But they were bright and oddly colored for anything I've ever seen in the sky, like fireballs but not flickering or streaming across the sky like you'd normally see with a meteor (which we thought it was related to). They started to move slowly, in a pattern that suggested they were attached to a monstrous jet plane that was banking to land. This would not have been an unusual occurrence had it been of normal size and color and had some sound to it. We live near an airport and frequently have low-flying jets overhead. These are very loud. This was not heard at all. I ran outside to make sure and heard nothing but also, as I got out there, it began to fade and disappear, while it traveled north. Then it was gone, fizzled to nothing like a slowed-down version of the trails streaming from a long-burning firework. The leonids are scheduled for this time of year so I'm almost certain it is related but I have never seen a meteor act this way upon entering the atmosphere, hovering, turning and traveling horizontally. Could burning debris have caught some strong upper level winds?"],"Case Number":"43970","Date of the Event":"11/16/2012 12:00 UTC","Longitude":"-85.376617","Object Features":"Unknown","Disposition":"Unresolved","Log Number":"US-11172012-0008","Tags":"City"}