{"divs":["Sighting DetailsHello, I live about 9 miles south of Shelbyville Tennessee off of 231 S. It is in the foothills at 1200' elevation. I saw the video about recent objects in Colorado where the objects are too fast to see in real time and must be videoed and played almost a frame at a time. I have some security cameras and decided to point one up all night(Nov 17,2012) and was left that way until well after daylight. The camera and recording software catch about 5 frames a sec. I captured a jet at high altitude, looks normal vapor trail behind it, moves at normal speed for jet. Used this as a reference. Now, a couple of min before the jet I have a object with no vapor trail, moves from left to right off screen in 6 frames. That's very fast comparing to jet. I can email these to you if you would like. The camera is not a expensive one so the quality is not great, no detail really. I have two other cameras not in use and plan on placing those for full time monitoring of sky. Now I have only seen one other strange object in sky in my life. Back in 1976 myself and some friends drove up Kenhawk drive off nollensville rd. It dead ends on top of hill, there some sort of equipment up there for the airport. The object was only a light, at first myself and others in my car only saw what we thought was a falling star. Then it stopped cold, made a 90 degree turn and took off at original speed, stopped cold, turned 90 degrees again then original speed and vanished quickly. We were turning around in a driveway at the time. The driveway had a slight elevation to it pointing my car toward sky, that's when we first saw the light, it was only a point of light much like a falling star until it stopped and changed directions. I tell you this last story only so you don't think I have been seeing these all my life. Please let me know if your interested in the video I told you of at first and a email address to send it to. Thank you for your time."],"Region":"Tennessee","Source":"MUFON","Date of the Event":"11/17/2012 07:52 UTC","Country":"United States","Log Number":"US-11172012-0013","Object Features":"Unknown","Longitude":"-86.457702","Date Submitted":"11/17/2012 12:24 UTC","City":"Shelbyville","Weather Factors":"Unknown","trends":["There have been 3 other sightings in Shelbyville","There were no other sightings in Shelbyville on or around November 17th 2012"],"Case Number":"43975","files":["/var/www/straped/mufon/html2text/43975.html.txt","/var/www/straped/mufon/org/43975.html"],"Disposition":"Unresolved","Latitude":"35.491056","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=35.491056,+-86.457702(43975)&iwloc=A&hl=en\"> mufon case (43975) map </A>","Summary":"Captured on security video, object moves through view in 2 seconds, 6 video frames.","Tags":"City","Object Shape":"Sphere","Viewing Distance":"Unknown","Sighting Duration":"00:00:02"}