{"Tags":"City","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=35.901092,+-84.052016(43978)&iwloc=A&hl=en\"> mufon case (43978) map </A>","Summary":"Thought it was a low flying plane. As I got closer I realized it was stationary and hovering.","Case Number":"43978","Viewing Distance":"101-500 Feet","Country":"United States","Longitude":"-84.052016","Region":"Tennessee","Object Features":"Unknown","divs":["Sighting Details One the evening of Wednesday,November 15th as I was driving home on Westland Drive outside of Knoxville, Tn. at 10:20 p.m. I witnessed what I thought at first to be a low flying plane. Not unusual to see planes in the area as McGhee Tyson airport is about 7 miles to the south, but this looked at first to be only a few hundred feet high. It at first seemed to bank from the right and then level off. At this point the craft was about a half mile in front of me but directly over the road. AS I approached the craft I expected to see it gain elevation and then get further away. It did neither. at about a quarter mile I could see that it was stationary. It had two white lights on either side of the wing and a red light in the middle that flashed about every 3 seconds. I was now directly across from a middle school and slowing down. Still no apparent movement. I then went directly under the craft and looking straight up I noticed from the lights on the side that were illuminating the body of the craft that it was round or oval shaped. AS much as I wanted to pull over and observe this craft, I just sort of really freaked and kept on driving. I will probably always regret not stopping and observing this, but my mind just told me to keep on driving."],"Object Flight Path":"Path then hovering","Log Number":"US-11172012-0016","Latitude":"35.901092","files":["/var/www/straped/mufon/html2text/43978.html.txt","/var/www/straped/mufon/org/43978.html"],"trends":["There have been 50 other sightings in Knoxville","There were no other sightings in Knoxville on or around November 14th 2012"],"Sighting Duration":"Undisclosed","Object Shape":"Circle, Oval","Date Submitted":"11/17/2012 03:37 UTC","Weather Factors":"Unknown","City":"Knoxville","Date of the Event":"11/14/2012 10:20 UTC","Source":"MUFON"}