{"Latitude":"42.754211","divs":["sighting detailswhile playing frisbee in our yard with my dog-she got distracted and was nervous-i looked around and noticed four bright lights coming from the southwest headed to the north\\northwest. it appeared huge and silent . i only had my iphone and the photo is blurry showing only a couple lights :(. i watched for quite awhile, but it stayed on a straight path, but was very large for a long time. my dog distracted me and wanted to go in, and that made me actually a bit nervous-she never wants to stop playing! i watched for maybe 4-6 minutes-with it perfectly visible-it was cold and i had no coat-so i went in when it was quite a distance way. i felt a bit nervous for some reason. normally i'm quite adventurous and am interested in ufo's having seen a cigar shaped one while in high school many years ago. the four lights in a huge square is not normal for anything i've seen flying, so i was pretty sure i was seeing something very unusual and not made on earth. the lights seemed to point down not forward. also my neighbors posted on facebook that they found whitish splatters of unknown material on roofs, driveways, and in yards, etc the ext day...not sure if it's related and i didn't see that in my part of the neighborhood, but they live on the far west of our area, closer to the object i saw."],"Tags":"City","trends":["There have been 10 other sightings in Clarkston","There were no other sightings in Clarkston on or around November 11th 2012"],"Disposition":"Unresolved","Object Features":"Unknown","Log Number":"US-11172012-0025","Date of the Event":"11/11/2012 12:00 UTC","Country":"United States","Longitude":"-83.42206","Source":"MUFON","City":"Clarkston","Case Number":"43988","files":["/var/www/straped/mufon/html2text/43988.html.txt","/var/www/straped/mufon/org/43988.html"],"Object Shape":"Square, Rectagular","Object Flight Path":"Straight-line path","Summary":"A large square object flew silently over our neighborhood-too large for jet-odd light pattern -neighbors found whitish splatters and lines in yards, drives and roofs-I haven't seen that yet","Sighting Duration":"Undisclosed","Date Submitted":"11/17/2012 10:38 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.754211,+-83.42206(43988)&iwloc=A&hl=en\"> mufon case (43988) map </A>","Weather Factors":"Unknown","Region":"Michigan","Viewing Distance":"Unknown"}