{"map":"<A HREF = \"http://maps.google.com/maps?q=39.811273,+-105.022497(43981)&iwloc=A&hl=en\"> mufon case (43981) map </A>","City":"Denver","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/43981.html.txt","/var/www/straped/mufon/org/43981.html"],"Country":"United States","Summary":"Saw ufos get into a formation and travel w/ airplain flying over and through them.","Viewing Distance":"Over One Mile","divs":["Sighting Details1. I was at 5820 Lowell Blvd, in Denver Co.Talking to the owner of the outside storage as he was working on the gate at about 2:00 pm 2. I stared looking up about a year ago to see if I could see ufos. I reported one about a year ago that flew 30 to 40 feet over me. So, I looked up to see if I could catch anything. To th North of me I saw it hovering in the sky. 3. a ufo. 4. It was stationary in the sky, and 5 other craft came around it and they made a formation. They moved to the South West slowly taking about 10 min. A friend ran into his house and got his camera. An ariplain from DIA flew throught the formation. He thinks he got a picture af the airplain flying through the formation. One ufo was green, another was redish. The other fore were shinny grey. They moved slowly and got higher untill they vanished. The owners sister was there also and may of got pics on her cell phone. Then I saw one come from the west and travel east turning to the south. Then another formation of five regrouped in about the same place as the first. I got in my car and got home. I pointed to rhe sky and showed another ufo, about in the same place as the others were, to my neighbor. Her and I watched as we saw several ufos going from east to west in no formation. I ran in and gor my wife in time for her to also see one going from east to west. 5. Just thought is was nice to see ufos again and to have other people around to see it with me. 6. The ones in formation got higher and higher, then they vanished one by one. The others went west untill a tree in the yard got in the way."],"Sighting Duration":"Undisclosed","Longitude":"-105.022497","Case Number":"43981","Latitude":"39.811273","Date of the Event":"11/17/2012 02:00 UTC","Source":"MUFON","Object Features":"None","trends":["There have been 185 other sightings in Denver","There was one other sighting in Denver on or around November 17th 2012"],"Date Submitted":"11/17/2012 05:33 UTC","Region":"Colorado","Log Number":"US-11172012-0019","Weather Factors":"Unknown","Object Shape":"Sphere","Object Flight Path":"Hovering then path","Tags":"City"}