{"Case Number":"4398","Object Flight Path":"Straight-line path,Path then hovering","Viewing Distance":"21-100 Feet","Sighting Duration":"Undisclosed","Country":"United States","Log Number":"US-02082006-0001","Summary":"SLOWLY AND SILENTLY GLIDED OVER MY HEAD VERY LOW AND STOPPED . THEN CONTINUED TO GLIDE OFFF ITO THE NIGHT. I T WAS VERY DISCERNIBLE TO SEE AND NOT A FUZZY IGHT","trends":["There have been 25 other sightings in Bowling Green","There were no other sightings in Bowling Green on or around May 19th 1979"],"Latitude":"36.99032","map":"<A HREF = \"http://maps.google.com/maps?q=36.99032,+-86.443602(4398)&iwloc=A&hl=en\"> mufon case (4398) map </A>","Longitude":"-86.443602","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/4398.html.txt","/var/www/straped/mufon/org/4398.html"],"Region":"Kentucky","Date Submitted":"05/19/1979 07:30 UTC","City":"Bowling Green","Object Features":"Unknown","Date of the Event":"05/19/1979 07:30 UTC","Object Shape":"Circle","Disposition":"Unresolved","divs":["Sighting DetailsI WAS AT HOME AND WAITING FOR MY SON TO RETURN FROM A HIGH SCHOOL BASEBALL GAME OUT OF TOWN. HE WAS WAY OVERDUE. I BECAME VERY ANXIOUS WAITING FOR HIS ARRIVAL AND WENT OUTSIDE TO LOOK DOWN THE HIGHWAY TO SEE IF I COULD SEE THE SCHOOL BUS COMING THAT HE WOULD BE TRAVELING IN. I WAS TRYING TO BE PATIENT AND SO I JUST LET MY EYES WANDER THRU THE NEIGHBOR, UP AND DOWN THE STREETS, AND I SOON CAUGHT SOMETHING OUT OF THE CORNER OF MY. IT WAS A SMALL RED LIGHT FLASHING THRU THE TREES ACROSS THE STREET FROM WHERE I LIVED. THERE WAS A CHURCH THERE, AND TALL TREES BEHIND IT. AT FIRST I THOUGHT IT MUST BE A HELICOPTER SINCE THE TOWN I WAS IN WAS SITUATED BETWEEN FORT CAMPBELL AND FORT KNOX. I KEPT NOTICING THE LIGHT AND AS IT MOVED TOWARD ME, DIRECTLY TOWARD ME, I STILL ASSUMED IT TO BE HELICOPTER, UNTIL IT CAME CLOSED. IT MADE NO SOUND AND SEEMED TO BE GLIDING. IT CONTINUED TO MAKE IT'S WAY TOWARD ME, WITH NO NOISE AND I BECAME A LITTLE ANXIOUS. I HAD BEEN STANDING IN THE GRASS BUT AS IT APPEARED TO APPROACH ME DIRECTLY OVERHEAD I STEPPED ONTO THE SIDEWALK. THE OBJECT APPEARED TO STOP AND I LOOKED UP. COULD NOT BE SURE HOW BIG IT WAS, DID NOT APPEAR TO BE VERY LARGE BUT IT WAS VERY TO SEE THE UNDERSIDE OR WHAT I ASSUMED TO BE THE UNDERSIDE. IT HAD BEEN GREEN AND RED LIGHTS THAT WERE ROTATING CLOCKWISE ALL AT ONCE. THE LIGHTS WERE VERY BRILLIANT BUT NOT CASTING ANY LIGHT DOWN FROM THEM. I ASSUMED IT WAS ROUND BECAUSE OF THE WAY THE LIGHTS WERE SITUATED BUT I CAN NVER BE SURE THE SIZE OF THE OBJECT OR THE SHAPE. I WAS A LITTLE BREATHLESS AND I WAS ALMOST EXCITED BUT NOT UNDULY CONCERNED. I THINK IWAS MORE CURIOUS THAN ANYTHING. I DID HOWEVER REMEMBER BEING ALMOST FROXEN IN PLACE WHILE THE THING HUNG OVER MY HEAD. I WENT INDOORS AND DREW A PICTURE WITH CRAYONS OF THE DESCRIPTION AS WELL AS I COULD AND WAITED FOR MY SON TO GET HOME, WHICH HE DID A SHORT TIME LATER. I ASKED WHY THE BUS WAS SO LATE AND HE TOLD ME THERE WAS ENGINE TROUBLE WITH THE BUS. I DID NOT ASK HIM TO ELABORATE. I WAS JUST GLAD MY SON WAS HOME SAFE AND SOUND. THE REASON I AM WRITING THIS IS BECAUSE IT HAUNTS ME TO THIS DAY. I HAVE ALSO HAVE HAD SOME STRANGE THINGS HAPPENING TO ME IN THE PAST FEW YEARS THAT I CAN'T REALLY EXPLAIN AWAY ALTHOUGH THEY ARE NOT DRAMATIC CIRCUMSTANCES I STILL HAVE NO ANSWERS TO THEM. THIS EVENT HAPPENED IN LOGAN COUNTY KENTUCKY IN THE SPRING OF 1979 OR 1980.P.S. I DO WISH THAT I HAD HAD THE FORESIGHT TO HAVE TAKEN A PICTURE. IT WOULD HAVE BEEN AN EYEOPENER TO ALL SKEPTICS. I NEVER NOTIFIED THE AUTHORITIES. IT DON'T THINK IT WOULD HAVE SERVED ANY PURPOSE AT THAT TIME."],"Tags":"City","Source":"MUFON"}