{"files":["/var/www/straped/mufon/html2text/43996.html.txt","/var/www/straped/mufon/org/43996.html"],"Region":"Minnesota","Latitude":"44.104922","Longitude":"-94.218557","Sighting Duration":"Undisclosed","Date of the Event":"11/09/2012 12:00 UTC","Source":"MUFON","City":"Lake Crystal","Object Features":"Dome","Summary":"Having cigarette, heard buzzing, saw object through trees, grabbed camera, went to shore, took photo, watched it fly off","divs":["Sighting DetailsI was out having a cigarette in the morning and heard a buzzing sound. I walked around my house trying to find the source of the sound and noticed something strange through the trees towards the lake I live next to. I went inside my house, grabbed my camera and went down to the shore to find this amber-ish (copper??) object hovering below tree-top level but over the lake, about a hundred or so feet in front of me. It was reflecting light but wasn't blinding, it was like a dull reflection I guess. It looked to be about the size of a small car but I'm not very good at judging sizes. Its the closest I can get to a size comparison though. The buzzing sound had definitely been coming from this object as the sound was louder down by the shore. It started angling upwards so I took a photo and I'm glad I did. As soon as I took the photo, the object angled just a little more and then shot off into the sky. I was not able to get anymore photos as it had gone out of sight but I did get this one. I've heard of these things before obviously, who hasn't, but have never really believed any of it. Now I'm not so sure about my previous skepticism. I guess it most likely is man-made, perhaps a drone, but why it would be here is beyond me. There are no military installations around here (to my knowledge) and I'm sure they don't make RC toys that size and that fast. But I'm no expert on any of those things, so I guess I don't know, there could be a secret military installation around here or maybe some place out there makes really big RC UFO looking toys. The thing is, I'm a beginner photographer and this object ruined what may have been an otherwise really good landscape photo, perhaps one of the best I've done yet. Now that I think of it, I wasn't scared, wasn't bewildered, in fact I seemed to have been void of any emotion during this really short event (maybe five minutes from the time I heard the buzzing sound until the time I took the photo). I guess I'll never really know what it was but I'm glad I had the chance to get a photo and share it with anyone who may be interested."],"Object Flight Path":"Hovering then path","Object Shape":"Disc","Disposition":"Unresolved","Tags":"City","Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=44.104922,+-94.218557(43996)&iwloc=A&hl=en\"> mufon case (43996) map </A>","Date Submitted":"11/18/2012 12:50 UTC","Log Number":"US-11182012-0006","trends":["There have been no other sightings in Lake Crystal","This sighting has never been favorited."],"Country":"United States","Weather Factors":"Unknown","Case Number":"43996"}