{"Case Number":"43994","Date Submitted":"11/18/2012 10:07 UTC","Object Shape":"Other","Object Flight Path":"Stationary","Summary":"Large, long, extremely bright, stationary object, very high in sky, in East & one even higher more SW,6:30 am , 11-3-12. I took a picture and have witnesses.","Longitude":"-84.017934","Region":"Michigan","Log Number":"US-11182012-0004","Country":"United States","City":"Saginaw Charter Township","Disposition":"Unresolved","Tags":"City","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/43994.html.txt","/var/www/straped/mufon/org/43994.html"],"Date of the Event":"11/03/2012 06:30 UTC","Object Features":"None","trends":["There have been no other sightings in Saginaw Charter Township","This sighting has never been favorited."],"Latitude":"43.478942","map":"<A HREF = \"http://maps.google.com/maps?q=43.478942,+-84.017934(43994)&iwloc=A&hl=en\"> mufon case (43994) map </A>","Source":"MUFON","divs":["Sighting Details11-3-12 6:30 am I was on my way to work and noticed a extremely bright light in the sky , looking East. At first I thought it could be a star or plane but as I continued to look at it , it appeared very long and extremely bright and it did not move. It appeared to have big round lights on each end and there was a beam that projected out in a triangle in the middle like a glare. I searched the sky for more and spotted another one more SW and much higher in the sky , both stationary. I arrived at work 20 minutes later ( I work at a hospital) when I got there the object was still there, stationary, in the same location(East). I got to my work area and brought several people to the window to view this object , they all confirmed the object and thought it was very strange. At that point it was time to get to work. I looked again when it was lighter out and the object was gone. When I first realized that this object was not a star or a plane it was a bit disturbing and I wasn't sure what to do. I wanted to call an authority of some sort but didn't know who to call and I had to get to work. I wanted to make sure I documented this so I took a picture on my cell phone and got some witnesses who confirmed what I saw. In the paper today I read an article of a young man who reported an object in Flint and your organization was listed. I did not know where to go with this info until this morning. This was not anything I have ever seen, it was extremely long, large , extremely bright and it did not move. I observed this within the time span of an hour. I'd be happy to answer any questions. It has bothered me ever since, not knowing what it was. I do still have the picture but it just appears as a very bright light."],"Weather Factors":"Unknown","Viewing Distance":"Unknown"}