{"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Longitude":"-95.889626","Tags":"City","Date Submitted":"11/18/2012 07:34 UTC","trends":["There have been 11 other sightings in Council Bluffs","There were no other sightings in Council Bluffs on or around October 21st 2012"],"Weather Factors":"Unknown","Log Number":"US-11182012-0003","Disposition":"Unresolved","Object Flight Path":"Stationary","Source":"MUFON","Sighting Duration":"Undisclosed","City":"Council Bluffs","Latitude":"41.252666","Region":"Iowa","map":"<A HREF = \"http://maps.google.com/maps?q=41.252666,+-95.889626(43993)&iwloc=A&hl=en\"> mufon case (43993) map </A>","Date of the Event":"10/21/2012 05:30 UTC","Summary":"Red orange ball in sky","Object Shape":"Circle, Fireball, Sphere","divs":["Sighting DetailsI turned off 35th Ave on to 9th Ave heading east and I looked in my rear view mirror and my side mirror and saw this large red orange ball stationary all the way to 28th (ash st) and as I turned it was still there. It was over the trees all the way down 9th ave and even when I turned. I went one block to my house, jumped out of my car and ran into the house to get my camera and ran back to my car, all of about 30 secs and went back to 9th ave, turned left and I looked everywhere and it was gone. It looked like it was over the river?? I drove all the way to the interstate on 9th and I could not find it anywhere. It was pretty big. I wish I would have written the date and time down, I could kick myself. I will never forget about what I saw, I always thought if you seen something in the sky, it would look like a disk, but not the case, I just wondered if anyone else seen this, I hope so, so it would be a validation for me, so my family would know I wasn't just seeing something normal, believe me this was not normal or my imagination. I wanted a picture, I wish I would have had my camera with me or had a cell phone. I don't have a cell phone. :( Fell free to contact me if needed. Thanks Sherry"],"files":["/var/www/straped/mufon/html2text/43993.html.txt","/var/www/straped/mufon/org/43993.html"],"Country":"United States","Object Features":"None","Case Number":"43993"}