{"Summary":"camping clear cr. dusk we observed single red orb approx 50' away 3 ' above ground moved slowly toward us to 20' we screamed it vanished","Object Features":"None","Country":"United States","divs":["Sighting DetailsI believe mid july of 1993 myself and girlfiend decided to beat the heat and go camping on clear creek near camp verde. we parked at place called bull pen and hikedin approximately 3 to 4 miles. I had gone there earlier with a group of 4 for a day trip in june 2003. I friend was familiar with the location and we hiked in a few miles to a spot on the creek where there were a couple pools with 10 feet of water depth. the trail ran along the top of a cliff about 50 feet above the creek. the side of the cliff offered spots where you could jump or diving into the water from 10 to 30 feet or more depending on your skill or stupidity. it was a unique area and the large for arizona creek was a welcome venue in the arizona summer heat and better option that larger cottonwood river with was teaming with rattlesnakes that day. I decided to take girlfriend there and camp overnight. we had a small tent, food and standard camping supplies and no weapons. after a late phoenix start we arrived in the area where I had been previously about 3 in the afternoon and saw no desirable camping sites along the creek there so we hicked a short distance where the trail dropped near the creek and were surprised to find a large supply of firewood. I was initially uncomfortable using the wood knowing that scavenging for larger size pieces as what we encountered were rare but I thought I could replace at least some of the wood in the morning. the creek there 30 feet across and filled with rocks. the depth of the creek there was 2 or 3 feet max. there was a small more open area than normal area there about 15 by 30 yards with a few scrub trees of brush and level. I am provided these expanded details in the hope that someone familiar with the area will be able to pinpoint our location. I set up camp waded in the water with my girlfriend and then built a fire, ate beans and hotdogs I believe for a great relaxing evening. the high cliffs to the north and smaller hills to the west shortened the day. Approximately 7 ish as we were sitting on a log facing the southeast when i noticed a red ball of light approximately 30 yards from us that had a glowing character to it. the orb appeared just as we were losing light and making the red glow intensified. I asked my companion Peggy Zangrillo if she saw it also and she said yes asking \"what is that\". it had appeared to have originated at the thick brush at the southeast end of our open area. am digesting and imputing what I was seeing being only one light source ruling out animal, snake etc and it was suspended about 3 feet or waist height above the ground. There wasn't any other shape associated with it and I was trying to figure what thing could produce the light without any casing structure or body for it to originate from. Also there hadn't been an audible of sound since we saw the orb. AS all this was digesting I realized simultaneously with here it was moving very slowly directly towards us and she stated that. I remember we were both nervously asking what is that and its coming at us and basically WTF. I thought about our defense weapon options which were a dull kitchen knife, a small pocket knife and whatever nearby rocks or sticks we could use. what seemed like forever but in reality was three minutes approximately the object had closed to 40 feet or so. At 25 to 30 feet I had exhausted any options other than one which she employed at the identical time and we begin to scream as loudly as possible blurting out some rendition of get the frick away leave us alone. we were loud for sure and at that time it vanished. It light source didn't begin moving in another direction or up or down nor did it's appearance alter but it just vanished. the event was unlike any I had ever encountered and provided no answers. We were quite a ways deep in the wilderness and had a marginal flashlight. Based on the risks and danger of the trail even in daytime there was no way we could hike out that night in the dark. we were shaking, scared and went into the tent, zipped it closed and huddled together trying to assess what had and might occur next. We knew we were no match whatsoever for whatever we had encountered should it take action. I think I dosed off for a few minutes and daylight broke we quickly picked and headed back as fast as possible. I remember we take a could tumbles along the way and both had a few bruises when we arrived back at our car. we returned to phoenix and I moved back to washington state a couple months later and lost contact with my friend. Up until a couple years ago I couldn't recite this event without chills running up and down my body. Almost 20 years later I have no explanation. I spent another few hours tonight trying to find a matching event or some reference of strange activity in the area my 100's of hours has solved nothing. anyone want to give me their assessment of thoughts. Accurately stated, steve johnson"],"Object Shape":"Circle, Egg, Sphere","Case Number":"43995","map":"<A HREF = \"http://maps.google.com/maps?q=34.571836,+-111.849218(43995)&iwloc=A&hl=en\"> mufon case (43995) map </A>","Source":"MUFON","trends":["There have been 2 other sightings in Camp Verde","There were no other sightings in Camp Verde on or around July 21st 1993"],"Tags":"City","Date of the Event":"07/21/1993 12:00 UTC","Viewing Distance":"21-100 Feet","Latitude":"34.571836","Region":"Arizona","Log Number":"US-11182012-0005","City":"Camp Verde","Disposition":"Unresolved","Date Submitted":"11/18/2012 11:07 UTC","files":["/var/www/straped/mufon/html2text/43995.html.txt","/var/www/straped/mufon/org/43995.html"],"Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Longitude":"-111.849218"}