{"Log Number":"US-11182012-0018","Date Submitted":"11/18/2012 09:07 UTC","Summary":"Bright spherical object descended and hovered","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=30.60787,+-87.153801(44008)&iwloc=A&hl=en\"> mufon case (44008) map </A>","Region":"Florida","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/44008.html.txt","/var/www/straped/mufon/org/44008.html"],"Disposition":"Unresolved","Tags":"City","City":"Pace","Longitude":"-87.153801","Country":"United States","Object Flight Path":"Path then hovering","Source":"MUFON","trends":["There have been 4 other sightings in Pace","There were no other sightings in Pace on or around November 18th 2012"],"Case Number":"44008","Date of the Event":"11/18/2012 06:15 UTC","divs":["Sighting DetailsI was driving my car north to an intersection with Berryhill Rd. in Pace, FL when a bright ball of light descended straight down toward the ground. I was facing a northern direction and the time was approximately 6:15 p.m. The distance to the object was 100's of yards away and size was difficult to determine with any certainty but it appeared to be 10 to 20 feet in diameter at least. The object initially was a bright white but shifted gradually to a greenish color as it approached the ground. It then stopped and hovered above the tree line. I was momentarily confused as to what I was seeing and thought a large meteor was falling until it stopped above the tree line. At that point I had made my turn onto Berryhill Rd. when I suddenly realized what I was seeing. I turned the car around several hundred yards down the road to go back and see if the object was still there. I then drove north on Chumuckla Hwy and came around behind where I saw the object and later drove east down Willard Norris Rd. I did not see the object again. It was a very bright object and the road had several cars on it so I decided to report this in case anyone else saw what I did."],"Latitude":"30.60787","Weather Factors":"Unknown","Object Features":"None"}