{"Source":"MUFON","Date Submitted":"11/18/2012 07:39 UTC","Tags":"City","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/44004.html.txt","/var/www/straped/mufon/org/44004.html"],"Region":"Ontario","Object Shape":"Circle","Longitude":"-94.467754","divs":["Sighting DetailsI know this is odd but I thought I should tell our story even though it is very old. My son, who was about 7 at the time, and I were driving down the road on our way to his Christmas concert. He had been down that road twice a week, every week for judo practice. He was looking out the window and asked me what the light was over in the distance. I was unconcerned and said it probably was a tower light. He said that there was no tower there- as I was driving I looked over to where he was talking about and realized that indeed there was no tower there as it was at an area where there was a railway crossing (and power lines)( the crossing was a little farther down) the light was in an area that would have been over a building. As I was driving I realized that this was a very odd light - it was so perfectly round but one could tell it was like a dome outward. The light was very white and bright- it had a very definite edge to the light (not radiating) . We could see nothing else. I told him to wait and we would see as we got closer the to the light - we had to go down the road and then back around on the street toward the light ( so we sort of looped around). As we approached the light it seemed to be looking at us. I do not know how I could tell that, but just knew it was - it was a very large light. I know it turned to look at us and that is when I started to get nervous- then before I could think anymore my son started jumping up and down in his seat - it was before young kids had to sit in the back seat because of airbags- and saying it disappeared, it disappeared. It did- it turned and left in the blink of an eye -exactly like one would see on a television show ( I cannot remember the colour of lights we saw-they may have been red but very unsure). You could see for a minute second; the trail of light up into the night sky. Just a light trail from moving so fast, nothing else. I wanted to go in the direction the lights had gone - not sure how as they did go up into the sky but also away from us. I had to bring my son to the concert. You always wonder how do people not record what happened - first it happened too quickly and you are wondering what the heck is that - then like me - I did have a video recorder in the back seat for the concert. The battery was dead I had brought the plug-in so I could plug in to the wall so I could record the concert. So even though I had a recorder, I never even thought to use it, nor had the time and to top it off no battery. That is life I guess. I did phone the airport the next day and ask if anything at all was flying in our area - we are a small town. Nothing, but I knew that as we were so close the light I knew it was not anything I had ever seen before. I was married to a military pilot and lived on a base so I know aircraft. My son remained very frightened of the story for many years. If I did tell someone what we had witnessed he would run away and hide - I never spoke of UFOs in front of him so he had no reason to be afraid. About 1 month later or less- the speech pathologist at our Health Unit was out with her son and his friend and they witnessed a UFO that was documented by the university in our area . I watched the sky for many months after that but saw nothing. I know it was something odd, I can still see the light in my mind and hear my son's voice . I did not report it as I had no proof and back then people really thought you odd about seeing things like this. I hope one day someone has proof of what many of us have seen. I wish so much I had the camera working - we were so close- but then all that may have shown was a bright light; but if I had gotten the leaving of the light that would have been something - at least back at that time before you could do such things on a video. Best of luck."],"Log Number":"CA-11182012-0014","Object Flight Path":"Hovering then path","Summary":"very bright light that you could tell was like a dome- had no radiatting light - very sharp edges - did not hurt eyes but very white light - seemd to be following us then turned and went throught he sky like one would see on TV","Case Number":"44004","City":"Kenora","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=49.769826,+-94.467754(44004)&iwloc=A&hl=en\"> mufon case (44004) map </A>","trends":["There have been 4 other sightings in Kenora","There were no other sightings in Kenora on or around December 10th 1993"],"Date of the Event":"12/10/1993 12:00 UTC","Country":"Canada","Latitude":"49.769826","Object Features":"Dome","Disposition":"Unresolved"}