{"Object Shape":"Sphere","Region":"Ohio","Object Flight Path":"Hovering then path","Log Number":"US-11182012-0021","Source":"MUFON","Sighting Duration":"Undisclosed","Date of the Event":"11/15/2012 12:00 UTC","Latitude":"39.370136","Longitude":"-84.41863","Tags":"City","Disposition":"Unresolved","Date Submitted":"11/18/2012 10:53 UTC","Viewing Distance":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/44011.html.txt","/var/www/straped/mufon/org/44011.html"],"City":"West Chester","divs":["sighting detailsmy daughter and i were going shopping at about 8:00pm. it was dark when we pulled out of her west chester, ohio driveway. we turned the corner and headed west when she noticed some fuzzy round objects in the sky and said \"what is that?\" while continuing to drive. i looked up and noticed 3 fuzzy orange orbs hovering in the sky in front of us (we were heading west) but appearing to be bigger than a normal sky object and much bigger than an airplane which usually travels over west chester heading for the cincinnati\\nk airport. then another one appeared heading toward the 3 and 2 of the 4 started heading east se until they eventually disappeared. the way they disappeared was to get smaller and smaller until we could no longer see them as though they were travelling in a line straight from our vantage point. as the first 2 were disappearing, another one appeared from the nw and the 2 which were hovering then headed ese until they disappeared. then the final 1 headed ese in the same path as the other 4. my daughter and i were at first curious, then tried to get out our phones to capture the sighting all the while looking with amazement. then she stopped the car and opened the sunroof and we started shooting pictures. when the final 1 disappeared, we laughed and continued to the mall."],"Weather Factors":"Unknown","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.370136,+-84.41863(44011)&iwloc=A&hl=en\"> mufon case (44011) map </A>","Case Number":"44011","trends":["There have been 5 other sightings in West Chester","There were no other sightings in West Chester on or around November 15th 2012"],"Summary":"My daughter and I saw 3 orange disks hovering and moving in the sky; a 4th moved toward them from the NW; then 2 appeared to go SE and disappeared; then a 5th appeared from the NW and all moved SE and disappeared."}