{"City":"Proctorville","Latitude":"38.445925","Disposition":"Unresolved","Longitude":"-82.345858","Log Number":"US-11192012-0003","Date of the Event":"11/17/2012 07:20 UTC","Source":"MUFON","Object Features":"None","Case Number":"44017","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Weather Factors":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/44017.html.txt","/var/www/straped/mufon/org/44017.html"],"trends":["There have been no other sightings in Proctorville","This sighting has never been favorited."],"Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsI walked out my front door and saw several stars(about 8-10) in a line an odd orange-red shade. They didn't seem to be moving at first. This group I thought might be part of a fire line going up a mountain side. I asked my husband to come out and look. When we came back out I noticed more lights, not sure how many maybe 4 or 5 moving very slowly high above the river, like a plane would in cloudy conditions. This was not a cloudy night. We walked out to the road away from our trees, now all the lights were moving down river and higher until they disappeared, there was no flashing like you would see on a plane and no noise. After all of these disappeared, 2 more appeared, they seemed to be mostly side by side and disappeared upward. One of the lights moved faster and was larger these 2 lights were more yellow orange. I thought the lights might be military planes but the no noise factor seems to rule that out. This was all in about a 10 minute time span, I looked at my phone when it was over it was 7:20pm. Shortly after I went to a convenience store there was a woman with her small child who was talking about the lights, she said they just hovered, she had been near our local fire department and drove under them. She also said she called her husband and he only saw the 2 lights. Very Strange."],"Object Shape":"Circle, Star-like","Date Submitted":"11/19/2012 12:57 UTC","Sighting Duration":"Undisclosed","Region":"Ohio","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.445925,+-82.345858(44017)&iwloc=A&hl=en\"> mufon case (44017) map </A>","Summary":"Unusual color of stars in a line. Appeared to move slowly and higher above river until not visable."}