{"Object Shape":"Fireball, Sphere","Sighting Duration":"00:00:02","Disposition":"Unresolved","Weather Factors":"Unknown","Summary":"Bright white light falling toward road at angle changed to yellowish green light and disappeared into the horizon quickly. Friend of my wife saw a falling green object at the same time 60+ miles away.","files":["/var/www/straped/mufon/html2text/44015.html.txt","/var/www/straped/mufon/org/44015.html"],"divs":["Sighting DetailsMy father and I were heading north on AL highway 5 coming back from a hunting trip. Dad was on the phone with my uncle when both saw what appeared to be a bright light falling at an angle toward the road ahead of us. It seemed as if suddenly a large bright streetlight appeared out of nowhere and was falling down. The light then turned a yellowish green color and took off into the horizon leaving no trail of light. My dad told my uncle we just saw a UFO and I immediately texted my wife in Tuscaloosa. She later replied that her friend saw a green object at the same time 60 or more miles away. She saw it to the north east. I texted my wife at 6:30 and she was on the phone with her friend at 6:27 got disconnected at the time she experienced the event. Her friend called right back at 6:29. I got these times from my wife's cell and my own. My entire sighting lasted 2-3 seconds."],"Object Features":"Unknown","Region":"Alabama","Date Submitted":"11/19/2012 12:29 UTC","Case Number":"44015","City":"Faunsdale","trends":["There have been 2 other sightings in Faunsdale","There were no other sightings in Faunsdale on or around November 18th 2012"],"Tags":"City","Longitude":"-87.593894","Object Flight Path":"Path with directional change","Log Number":"US-11192012-0001","map":"<A HREF = \"http://maps.google.com/maps?q=32.459858,+-87.593894(44015)&iwloc=A&hl=en\"> mufon case (44015) map </A>","Date of the Event":"11/18/2012 06:28 UTC","Viewing Distance":"101-500 Feet","Latitude":"32.459858","Country":"United States","Source":"MUFON"}