{"Source":"MUFON","Region":"Arizona","map":"<A HREF = \"http://maps.google.com/maps?q=32.886261,+-111.719492(44016)&iwloc=A&hl=en\"> mufon case (44016) map </A>","Date of the Event":"11/18/2012 09:01 UTC","Country":"United States","Tags":"City","Viewing Distance":"Unknown","trends":["There have been 35 other sightings in Casa Grande","There were no other sightings in Casa Grande on or around November 18th 2012"],"Disposition":"Unresolved","Date Submitted":"11/19/2012 12:53 UTC","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/44016.html.txt","/var/www/straped/mufon/org/44016.html"],"Object Shape":"Boomerang","Object Flight Path":"Straight-line path","Latitude":"32.886261","Log Number":"US-11192012-0002","divs":["sighting details11\\18\\12 @ 9:00pm i was in my front yard looking at the stars because it was a clear night and the stars where so bright in the sky. there was no wind. as i was looking up at the sky looking up & toward the southeast i noticed something very large boomerang shape block out the stars. it made no sound and it was large. it was black against the sky and it seem to slightly reflect light towards the tips of the boomerang shape. it passed over about the speed of a plane but it was lower then what a plane would fly over a housing area. it was heading in a southeast direction. i watched it till it was out if my sight blocked by a tree beside my house. i have drawn a picture of what i saw and contacted my brother who is an aero space engineer to se if he had any idea if it could be a secret military plane. he thought i should list my sighting encase others saw it. it did get my adrenalin going that's for sure. it was the fact that it was so large and made no sound that really struck me as what the heck was that!!"],"City":"Casa Grande","Longitude":"-111.719492","Summary":"Out at night looking at the stars & object flew over blocking out the stars & made NO sound. Size was large maybe the size of a football field. Hard to say because it flew over my house & other then the stars in the sky I have nothing to make a comparison","Weather Factors":"Unknown","Case Number":"44016","Sighting Duration":"Undisclosed"}