{"City":"Baden","files":["/var/www/straped/mufon/html2text/44022.html.txt","/var/www/straped/mufon/org/44022.html"],"Object Shape":"Bullet, Missile, Fireball, Teardrop, Other","Latitude":"40.642007","Summary":"Three jet like objects hovering in an upsidedown V formation emitting bright, fiery teardrop trails.","Case Number":"44022","divs":["Sighting DetailsI was driving down Route 65 in Baden Pa and got stopped at a red light. I always check the skies but have never seen a ufo. Well, when I looked up, and a little bit to my right I saw three bright, glowing almost fiery trails (tear drop shaped) in the sky. At first my mind said \"jets\" but instantly I thought no way! Luckily, there was a jet about twice the elevation of the three objects also to the right. I could see the jet and its thin vapor trail which was nothing like these three objects. Ive seen many jets and over the last couple days Ive been wondering if maybe these were jets just at closer range. However, these objects, although admitting that awespme bright light, never moved. The jet, obviously, was moving, and as I watched these objects fascinated, I could glance over and follow the jets movement which somehow made it more obvious that these objects were entirely stationary. Ive made drawings of these objects - whatever they emitted was so resplendent it was almost inspiring! - and Im no artist but Id be glad to share these drawings so people know what I saw. Also, many people HAD to have seen these things as the highway was busy and it was broad daylight. Hopefully someone has pictures or even videos. If so I hope they come forward because Ive watched many ufo shows and these objects on video would basically shame 90 percent of the things Ive seen on other videos. Again they were awesome! Above the highest tear drop shaped emission was what appeared to be just small metallic jet like objects. How I wondered, if these were the craft, could something so small emit something so large and powerful? When compared to the thin vapor of the jet these resplendent almost glowing almost fiery tear drop \"vapors\" at the top (they got smaller as they trailed down) were about ten times at least the thickness of the jets vapor trail and the smallest at the bottom were still four to five times thicker than the jets emission. What is so odd is that even these \"vapor trails\" never moved or even appeared that they might didintegrate or anything; they were simply there. I say tear drop, and they were, but they also came up at points and then dipped down so it appeared on the very top one that it was almost encompassing or cupping the jet-like object \"inside\" of it. There were three of these in an upsideown V so that one was just a little higher than the other two on either side of it. Again, none of any of this moved, appeared as if it might move or anything - just there! It really was awesome - almost inspiring - and Im excited for other people to come forward even if they do not have pictures so they can decribe what they saw! Again broad daylight, heavy traffic, and three resplendent, awesome objects resting in the sky. A clear day, no stars, a few streaming clouds, no wind, just these things. I viewed them for maybe four minutes as I sat at the red light and looked back twice when the light turned green to see the same thing I had as I was stopped. Whatever happened to these objects or where they went or how they got there I dont know but I would LOVE to find out. Really, any information on this would be awesome and, as I said, there HAS to be a fair amount of people that saw these things I just dont know where to start. Id love to get to the bottom of this and find out what these were! As of now I know I saw three bona-fide unidentified flying - or stationary - objects! And they were the most awesome things Ive ever seen. Any information on this (if there is any) Id love to find out about. Whoever was in that jet that day also had to have seen them - they were unmistakable! I believe this is my main objective in relaying this, that other people who had to have seen these will come forward I know there has to be others who saw and if they got pictures or even a video (Ive seen many ufo videos on t.v. and internet) these objects captured on film I believe would really put to shame 90 percent of any ufo video Ive ever seen. . ."],"Date Submitted":"11/19/2012 06:10 UTC","Country":"United States","Object Features":"Other","Longitude":"-80.225486","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"00:05:00","Disposition":"Unresolved","Log Number":"US-11192012-0008","Region":"Pennsylvania","Tags":"City","trends":["There has been one other sighting in Baden","There were no other sightings in Baden on or around November 15th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.642007,+-80.225486(44022)&iwloc=A&hl=en\"> mufon case (44022) map </A>","Date of the Event":"11/15/2012 03:30 UTC","Weather Factors":"Unknown","Object Flight Path":"Stationary"}