{"Date of the Event":"11/18/2012 11:50 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=36.079335,+-79.783075(44023)&iwloc=A&hl=en\"> mufon case (44023) map </A>","Latitude":"36.079335","City":"Greensboro","Region":"North Carolina","Case Number":"44023","Date Submitted":"11/19/2012 08:36 UTC","Tags":"City","Log Number":"US-11192012-0009","files":["/var/www/straped/mufon/html2text/44023.html.txt","/var/www/straped/mufon/org/44023.html"],"trends":["There have been 24 other sightings in Greensboro","There were no other sightings in Greensboro on or around November 18th 2012"],"Weather Factors":"Unknown","Source":"MUFON","Object Features":"None","Object Shape":"Circle, Disc","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Longitude":"-79.783075","Disposition":"Unresolved","divs":["Sighting DetailsAbout 11:50PM last night I took the dog outside. I had an unexplainable fear about that same time. When I walked out I looked up at the sky in the area of the Greensboro airport. The sky was cloudy and there was a moderate, steady wind. The temperature was probably in the low 40s. I noticed a huge circular cloud formation that was stationary as the other clouds around it were blowing from East to generally West. I thought it odd that the circular cloud wasn't moving as the other clouds around it were moving at a steady pace. The circular cloud had a very defined circle around it's edges and looked kind of like a doughnut with a hole in the middle. I watched it for about 20 minutes. I don't know how long it had been there before I saw it. I would estimate the size of this disk to be about a mile wide and perfectly round. Then, at about midnight it began to shoot out what can best be described as short burst of what looked like, light blue, short, lightning bolts. They may have been beams of light but, they flashed like lightning, or flash bulbs. This went on for about 1 minute and seemed random and in no particular direction. It wasn't a rapid fire kind of a thing. Rather, in the period of a minute I saw about 5 or 6 burst of light. They weren't super bright from where I was. Rather, it was the brightness of distant lightning. It caused me to feel almost paralyzed with fear and I couldn't walk away or look away. I noticed the the area of sky behind the cloud was black as the rest of the sky was a very dark or, gray blue color. As clouds passed I could see occasional stars but over the circular shaped cloud the sky seemed blacked out. During this whole event I neither heard no saw any air traffic in the area, particularly from the Greensboro airport it's self (which is not uncommon at this hour). Then I heard a very fast moving jet flying over directly at the circle cloud formation. The cloud suddenly lost it's circular definition and broke up into the same consistency as the surrounding clouds. As the fast moving jet flew over I didn't see any of the typical flashing lights that are associated with aircraft in flight. I didn't see any lights at all. I just heard a loud, very fast moving jet fly right into the area where the circular cloud was breaking up. The jet sounded like it was coming from the South West of the airport and heading East. This happened at about 10 or 15 minutes after midnight. I didn't have a watch so, I'm guessing about the time for this phase of the event. Living near the airport I hear passenger and transport jets all day, every day. The jet I heard last night was, in my opinion a small jet fighter. The engine sound was louder and it was moving much faster than any of the jets ever do around the airport. And, there were no strobes or lights of any kind. It was completely blacked out. When I went outside it was about 11:50pm. When I went back in the house I looked at the clock and it was 00:58am. However, I was sure that I was only outside for about 20 minutes, or less. I went upstairs and had a strong sense of fear. In fact, I was so troubled that I loaded my rifle, which seems pretty crazy in the light of day. My dog is crippled and has limited use of her old legs. When I carried her in she was cold, slightly wet on her right side and shivering. I have no idea haw she got wet as it didn't rain. I kindly request that I not be contacted about this. I have been as detailed as I can about what I saw. This was disturbing and I don't wish to spend time talking about it and I won't be publicly exposed as it would certainly have a negative impact on my life. It's a long way back from crazy."],"Summary":"Huge, disk shaped, dark black, shooting off lighting or short beams"}