{"Object Flight Path":"Stationary","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Longitude":"-76.628611","City":"Davidsonville","trends":["There has been one other sighting in Davidsonville","There were no other sightings in Davidsonville on or around November 18th 2012"],"Object Features":"Unknown","Case Number":"44025","Sighting Duration":"00:02:30","Country":"United States","Source":"MUFON","Date of the Event":"11/18/2012 09:30 UTC","Summary":"3 lights hovering in a triangular formation lit up the entire sky, then faded to nothing twice before returning to a normal luminosity and just hovering. small plane appeared to pass it heading west","Tags":"City","Latitude":"38.922778","Disposition":"Unresolved","Object Shape":"Triangle, Unknown","Log Number":"US-11192012-0011","map":"<A HREF = \"http://maps.google.com/maps?q=38.922778,+-76.628611(44025)&iwloc=A&hl=en\"> mufon case (44025) map </A>","Region":"Maryland","files":["/var/www/straped/mufon/html2text/44025.html.txt","/var/www/straped/mufon/org/44025.html"],"Date Submitted":"11/19/2012 10:51 UTC","divs":["sighting detailsi was driving back to dc from a friend's house in severna park. i was headed south on route 50 and to my left were 3 lights hovering. they were in a triangular formation. there was a smaller red light closer to one of the 3 larger white ones. i could not tell if it was one entity or 3 separate vessels. the lights got very bright, lighting up the entire sky, then faded to nothing. then came back to a normal luminosity, then again, got so bright that i could see the clouds behind them. then they went back to a normal luminosity and just hovered. a small plane about the size of a cessna appeared to pass the lights. getting very close to them, although the plane may have been flying at a much lower altitude than the lights and therefore further away from the ufo than it appeared from the ground. the object just continued to hover. it\\they was\\were at one point in the sky the entire time i was driving. i lost sight of the object as i kept driving. i didn't really look for it in my rearview mirror because it was so high in the sky. the lights had to have been visible from lee airport just outside annapolis. i wonder if any pilots or air traffic controllers saw the same thing i did."],"Weather Factors":"Unknown"}