{"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.980668,+-76.3144(44037)&iwloc=A&hl=en\"> mufon case (44037) map </A>","divs":["Sighting Details My wife and I were in bed and I got up to use the rest room at roughly 4:20 in the A.M. 11-19-2012. I went back to bed and my wife noticed a bright red light through our sky light in our bedroom.The light flashed off and on. It stayed on for mabye 1 second and went off for 1 second. At first we thought it was a plane or aircraft of some kind, but it never changed position. It stayed stationary. It did this for twenty minutes or so. I started observing the object with binoculars and could not see anything but the red light. It was clearer and appeared to change shape from ball shape to oval to football shape and slightly triangle shape. It seemed to constantly change shape. Sometimes it seemed to be made up of three or four smaller red lights, but still maintained it's original size with the smaller lights staying very close together. Finally it went off at close to 4:45 A.M. We watched for a few more minutes, talked about what we had seen. We both agreed we did not know what it was and had never before seen anything like it or had seen anything that had the charactics it had. Then we went back to bed. At roughly 5:25 A.M. I rolled over in bed and looked up through the skylight and saw it was back on and blinking again.It appeared to be in the exact same location.The sky was just beginning to get the first mourning light. We both observed it again for another 10 minutes or so and it had the exact same charastics as before.Then it stopped again and we went back to sleep. There was also cloud cover and we could not see any stars in the sky and we did not see any air traffic at all during this event. To whom in may concern, Thank You, Jack"],"Viewing Distance":"Over 1 Mile, Unknown","Summary":"At 4:30 am my wife and I saw a bright red light, that blinked off and on, almost directly overhead in the eastern sky","files":["/var/www/straped/mufon/html2text/44037.html.txt","/var/www/straped/mufon/org/44037.html"],"Disposition":"Unresolved","trends":["There have been no other sightings in Stevensville","This sighting has never been favorited."],"Case Number":"44037","Tags":"City","Date Submitted":"11/19/2012 06:19 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","Latitude":"38.980668","Region":"Maryland","Object Features":"None","Date of the Event":"11/19/2012 04:25 UTC","City":"Stevensville","Object Shape":"Oval, Sphere","Log Number":"US-11192012-0022","Country":"United States","Object Flight Path":"Stationary","Longitude":"-76.3144"}