{"Object Shape":"Circle, Cylinder, Disc, Fireball, Oval, Sphere","trends":["There have been 17 other sightings in San Bernardino","There were no other sightings in San Bernardino on or around October 29th 2012"],"Sighting Duration":"01:30:00","files":["/var/www/straped/mufon/html2text/44039.html.txt","/var/www/straped/mufon/org/44039.html"],"Country":"United States","Case Number":"44039","Longitude":"-117.283545","Date of the Event":"10/29/2012 07:19 UTC","Object Features":"Dome","Latitude":"34.115625","Tags":"City","Object Flight Path":"Straight-line path","Date Submitted":"11/19/2012 07:15 UTC","divs":["Sighting DetailsIn my backyard stargazing specifically the moon, after about an hour looking through my telescope i notice two objects slowly approaching the top edge of the moon. Because i was staring at the bright moon for a while my eye sight was a little sore. But i could see two white objects one larger than the other, they were moving slowly so i took out my galaxy phone and took a steady as i could picture. I couldn't see anything on the phone at the time so about a week later a went over my phone pictures to discovered i could see the objects, and to my amazement one of them was clearly blue in color. I transferred the picture to my computer and enhance it with photoshop and to my again amazement you can see a perfect saucer shape object. This was the smaller one the larger one was a round ball with what looks like a line going through it. You have to see it to believe it, this is a very extraordinary photo. please call me i haven't showed this to anybody, and am very excited as i am very open minded."],"Viewing Distance":"Over One Mile","Disposition":"Unresolved","City":"San Bernardino","Source":"MUFON","Log Number":"US-11192012-0025","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.115625,+-117.283545(44039)&iwloc=A&hl=en\"> mufon case (44039) map </A>","Region":"California","Summary":"Looking at the moon at 7:19pm two objects one smaller than the other could be seen through my telescope."}