{"Country":"United States","trends":["There have been 3 other sightings in Gilford","There were no other sightings in Gilford on or around July 15th 2007"],"Date of the Event":"07/15/2007 12:30 UTC","Tags":"City","Log Number":"US-11192012-0018","files":["/var/www/straped/mufon/html2text/44032.html.txt","/var/www/straped/mufon/org/44032.html"],"Latitude":"43.523519","Region":"New Hampshire","Object Shape":"Sphere","Object Flight Path":"Stationary","divs":["Sighting DetailsSo i know this was a few years ago but i honestly didnt know i could make a report like this. i worked at a golf course. i was out on one of the tees by myself doing divots by filling them in with grass seed and dirt. using a tool similar to a rake i was spreading the seed. as i was doing this i was observing the numerois dragonflys around me and watching their shadows as i worked. out of the corner of my eye i notice the shadow of a small circle about the size of a golf ball with 3 others revolving around the center one. they werent revolving fast.. what was strange about this was that the object appeared transparent so did the 3 around the center one. it looked like a piece of glass if you were to hold it in the sunlight and observe its shadow. another odd thing was the 3 revolving around the center seemed to have a heat signature that dissipated as they revolved. i only sw this object for a few seconds. And never saw the object directly. only its shadow. my initial reation was that someone was playing a prank on me so i turned around fast only to find no one was around. when i looked back down the object was gone. after for the rest of the day i felt as though i were being watched. the object did not move other than the 3 around the center."],"Weather Factors":"Unknown","Viewing Distance":"20 Feet or Less","Sighting Duration":"00:00:20","Longitude":"-71.4425","Object Features":"Other","Source":"MUFON","Case Number":"44032","City":"Gilford","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=43.523519,+-71.4425(44032)&iwloc=A&hl=en\"> mufon case (44032) map </A>","Summary":"strange transparent orb surrounded by 3 other slightly smaller orbs circling the middle one","Date Submitted":"11/19/2012 01:57 UTC"}