{"files":["/var/www/straped/mufon/html2text/44033.html.txt","/var/www/straped/mufon/org/44033.html"],"Date Submitted":"11/19/2012 02:15 UTC","Object Shape":"Triangle","Longitude":"-75.102722","Viewing Distance":"Unknown","trends":["There has been one other sighting in Willow Grove","There were no other sightings in Willow Grove on or around November 16th 2012"],"Object Features":"Unknown","Summary":"Saw three sets of three bright glowing lights flying southwest in Willow Grove, PA.","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=40.154653,+-75.102722(44033)&iwloc=A&hl=en\"> mufon case (44033) map </A>","Sighting Duration":"00:05:00","divs":["Sighting DetailsI was driving towards the PA turnpike on November 16th, 2012 around 5:30 PM. When I drove over the turnpike on Davisville Road, I noticed 3 unusual lights flying southwest. I then noticed that there were 2 more sets of these lights flying right behind it. It came across as unusual to me because there were no blinking lights like on normal planes and helicopters. It was also strange that these air crafts were flying close together in odd formations. I immediately took out my cell phone and took as many pictures while I could. Most of them came out a little fuzzy, but I did manage to get a few good ones. I knew as soon as I got the pictures, what I saw was something special. I lost sight of the air crafts as I was driving away. After talking to my friends and family, other people actually saw strange lights in the sky near my sighting. I decided to do research to see if anyone else saw anything that night and to my surprise, I saw an article that was entitle \"8 UFO sightings in 5 states in 11 hours.\" Luckily someone else got a picture and it looked exactly on of the single crafts of what I saw earlier in the day right before dark. This made me want to report my sighting, in hope someone else got a better picture and maybe knows what it is. This is my first UFO sighting and I hope to see more."],"Latitude":"40.154653","Country":"United States","Disposition":"Unresolved","Log Number":"US-11192012-0019","Case Number":"44033","Tags":"City","Source":"MUFON","City":"Willow Grove","Weather Factors":"Unknown","Date of the Event":"11/16/2012 05:40 UTC","Region":"Pennsylvania"}