{"Region":"New York","Disposition":"Unresolved","Country":"United States","Source":"MUFON","Date of the Event":"11/14/2012 10:00 UTC","divs":["Sighting DetailsI was at home in my bedroom. Had finish taking a shower and was about to eat a snack before going to bed. But before I decided to close the window because it was getting cold in the room and plus I never leave my windows open. As I was about to close the window. I notice a star in the sky. This star wasn't like the other ones. This one was much much brighter and bigger, plus it was in a part of the sky that in all of my years living here. I've never had seen a star that big and bright there. That's what really caught my attention. I was calm not excited normal.So I open the window completely to get a better view of it. Then I decided to take picture's and video of it. So I took out my Fujifilm finepix 18x camera to take pictures. The first couple of pictures I took without the tri-pod, but then decided to put the camera on it's tripod to take better steady pictures. So I took a few pictures, then decide to take a video of this star. So I did about 7-9 minutes of video I believe. After I had taken photos and a video of this star. I closed my window and pull down the venetian blinds stored the camera away and went to bed. I didn't think about it. I decided to check the pictures and video the following day. So that's what I did. The following day I downloaded the pictures and video into my computer and saw what I had capture on video and on photos. I forgot to mention the object after I closed my window it remained there. Don't know for how long."],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/44038.html.txt","/var/www/straped/mufon/org/44038.html"],"Object Features":"Unknown","Log Number":"US-11192012-0024","City":"New York","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around November 14th 2012"],"Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=40.723113,+-73.996273(44038)&iwloc=A&hl=en\"> mufon case (44038) map </A>","Longitude":"-73.996273","Summary":"Star-like UFO over the bronx, New York","Weather Factors":"Unknown","Tags":"City","Latitude":"40.723113","Case Number":"44038","Viewing Distance":"Unknown","Date Submitted":"11/19/2012 07:04 UTC","Object Shape":"Star-like"}