{"Sighting Duration":"Undisclosed","City":"Aurora","Object Shape":"Unknown","Latitude":"39.732912","Object Flight Path":"Path with directional change","Case Number":"44040","Disposition":"Unresolved","Summary":"Originally saw two moving starlike objects,moving in tandem west -to-east, north of me, When it reached the edge of Aurora, turned south, much closer, 2 orange lights.","Country":"United States","Longitude":"-104.82565","trends":["There have been 48 other sightings in Aurora","There were no other sightings in Aurora on or around November 15th 2012"],"Source":"MUFON","Tags":"City","Date Submitted":"11/19/2012 07:55 UTC","files":["/var/www/straped/mufon/html2text/44040.html.txt","/var/www/straped/mufon/org/44040.html"],"Region":"Colorado","map":"<A HREF = \"http://maps.google.com/maps?q=39.732912,+-104.82565(44040)&iwloc=A&hl=en\"> mufon case (44040) map </A>","Log Number":"US-11192012-0025","divs":["Sighting DetailsI don't lie. I don't make things up. I have an above-average understanding of aerodynamics- studying aircraft is a hobby. I have worked at a location in SE Aurora for 8+ years. The building faces south and gives me a 180 deg. view.I can see the front range all the way down to Pike's Peak. I work late many nights, stepping out south of the bldg. for a 5 min. smoke break every hour or so. Every time I do, I stare up. I 've watched hundreds of aircraft over the years, DIA and Buckley's paths are both close. I've never seen anything I couldn't explain until last Thurs. (11-15-12) Ironically I was looking north over the top of the bldg sometime between 8-8:30 PM. Caught a glimpse of satellite-like object to the NW, moving east.Within a second or two realized that it was a tandem pair, exact same speed and brightness, no red or green ID lights, no blinking. They disappeared into the haze (smog?)that I see looking toward city. I was a bit cold, but I thought,\"What the heck, this is my first unknown in years of looking up, I'll wait for it to run east of town where the air clears\". I was about ready to give up when it (they?) reappeared. They seemed much closer, had turned south and crossed to my right(East). They were larger, about the size of an aspirin (your words) at arms length, and red-orange. There was no glare, just a soft light like a red silk scarf over a light bulb. They faded in, then out in about 40 deg. of compass direction. I blinked a couple times to make sure it wasn't just leftover light on my retinas. All I could do was repeat, \"I saw you. I saw you\" for a couple minutes after."],"Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"11/15/2012 08:20 UTC","Object Features":"Unknown","Weather Factors":"Unknown"}