{"Date of the Event":"11/18/2012 07:06 UTC","Object Shape":"Fireball","Viewing Distance":"Unknown","divs":["Sighting DetailsI was walking out side my apartment and as my habbit i normally scan the skys once i walk out of home. As i was few feet away from home i noted a very bright star,as i was walking i stopped immediately to sew if it was moving or was it a star that was stationary and was appearing to move due to my movement . It was becoming brighter in 2 seconds. I immediately tried to open my galaxy tab 2 , to get picture but slide lock didnt open i then again looked , the brigHt star dimmed and was moving parallel to our stratosphere. And another object like a blinking light showed up,i again looked at my tab but when i looked up the second one was blocked from building , i thought it could be plane and within 10 seconds more it dimmed and kept moving like satellite. It was exactly moving like that object moving in the atmosphere in NASA sts footage where it suddenly stops And the lift off when some laser like projectile comes frpom surface, exactly the same but in reverse order. My spersonal view is it was a ufo entering earths atmosphere this burning like a bright star and after enter entering it started moving along ."],"Object Features":"None","Source":"MUFON","Latitude":"30.737817","trends":["There have been no other sightings in Chandigarh","This sighting has never been favorited."],"City":"Chandigarh","Region":"Chandigarh","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=30.737817,+76.749523(44049)&iwloc=A&hl=en\"> mufon case (44049) map </A>","Country":"India","Date Submitted":"11/20/2012 04:44 UTC","Tags":"City","Case Number":"44049","files":["/var/www/straped/mufon/html2text/44049.html.txt","/var/www/straped/mufon/org/44049.html"],"Longitude":"76.749523","Log Number":"IN-11202012-0004","Object Flight Path":"Straight-line path,Path with directional change","Weather Factors":"Unknown","Disposition":"Unresolved","Summary":"decend like meteore then sudden change of direction"}