{"Date of the Event":"02/06/0001 04:40 UTC","Region":"Minnesota","divs":["Sighting DetailsI was driving from home Menahga Mn.to the Twin Citys for work when I was about 10 miles I seen a big bright light looked like a meter coming staight down.I was waiting for it to hit in the feild when it stopped and went up about 200 feet and hovered there.The shape was a diamond in the inside and a circle of lights around it.as I keept heading south to the citys it stayed in front of me getting further away but only a couple of blocks this thing was the size of the Metrodome.It stayed in the sky the whole time of my drive.Not a star or planet or plane I seen it come down stop before hitting the ground.Moving way to fast for anything we have.Then my cell phone rang it fianc'e she asked if I seen the metor,I said its not no metor I still see it, it stopped before hitting the ground and is moving slowly in front of me.Which It did all the way to the citys but moving further away,A coworker seen it at 6:15.I can't believe it was'nt on tv or something.There was two other veicles at the time it came out of the sky I know they seen it to,they hit there brake lights."],"Weather Factors":"Unknown","Object Shape":"Diamond, Oval","map":"<A HREF = \"http://maps.google.com/maps?q=46.753848,+-95.09808(4406)&iwloc=A&hl=en\"> mufon case (4406) map </A>","Case Number":"4406","Summary":"driving to work huge light came shooting down from sky like a metor didn't hit ground","Log Number":"US-02092006-0001","Tags":"City","Object Features":"Undisclosed","Object Flight Path":"Straight-line path,Path then hovering","files":["/var/www/straped/mufon/html2text/4406.html.txt","/var/www/straped/mufon/org/4406.html"],"Date Submitted":"02/06/0001 04:40 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Longitude":"-95.09808","Country":"United States","City":"Menahga","Source":"MUFON","Disposition":"Unknown","trends":["There have been no other sightings in Menahga","This sighting has never been favorited."],"Latitude":"46.753848"}