{"Source":"MUFON","Date of the Event":"11/20/2012 04:37 UTC","trends":["There have been 39 other sightings in Burbank","There were no other sightings in Burbank on or around November 20th 2012"],"divs":["Sighting DetailsWalking out of store in daylight, I looked straight ahead about one mile up at a slowly moving metallic craft (drifting perhaps a few hundred feet over several minutes.) No wings, no rotors, no balloon, a large hovering and slowly rotating silent object catching glints of sunlight on copper colored panels. Having worked at Edwards AFB I am very aware of all known aircraft designs, including drones, this was unlike anything commonly observed. When first observed I thought it might be a kit aircraft, but realized that it was without wings and stationary. As the object rotated to reveal large flat faceted side panels, it was clearly not an airplane. There were no rotors to sustain lift unless they were hidden inside the object. It was way too large to have been lifted by common quadrocopter craft. After shooting the object with an iPhone, I decided to drive a few blocks to grab a better camera, stopping halfway to take another shot and verify that it hadn't moved. The moment I arrived at my office, I observed a Burbank Police helicopter taking off and heading towards the same area as the object. The object was gone by the time the helicopter reached the area. Two possible explanations, this being Hollywood it could have been a new sort of hovering camera platform, but that doesn't explain the huge copper side panels and strange scorpion-like tail with a rectangular light on the end. Another possibility, being the former home of Skunkworks, and within 50 or so miles from the current Skunkworks, this might have been a new kind of surveillance device. Unfortunately I did not arrive in time to grab a zooming-camera, so this iPhoto image is the best I can supply. The craft is hard to spot, if one were to draw a tic-tac-toe board on the image, the craft appears in the upper left-hand intersection with it's scorpion tail light visible, but the large side panels I observed earlier seem to have folded away."],"Case Number":"44069","Date Submitted":"11/21/2012 04:41 UTC","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-118.352929","Weather Factors":"Unknown","Log Number":"US-11212012-0009","Disposition":"Unresolved","City":"Burbank","Summary":"Not an aircraft","files":["/var/www/straped/mufon/html2text/44069.html.txt","/var/www/straped/mufon/org/44069.html"],"Latitude":"34.212495","map":"<A HREF = \"http://maps.google.com/maps?q=34.212495,+-118.352929(44069)&iwloc=A&hl=en\"> mufon case (44069) map </A>","Sighting Duration":"Undisclosed","Object Shape":"Square, Rectagular","Object Flight Path":"Hovering then path,Path then hovering","Tags":"City","Object Features":"Appendage(s)","Region":"California"}