{"Object Features":"None, Unknown","Date of the Event":"11/20/2012 10:15 UTC","Viewing Distance":"21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile","City":"Kansas City","map":"<A HREF = \"http://maps.google.com/maps?q=39.123093,+-94.623684(44067)&iwloc=A&hl=en\"> mufon case (44067) map </A>","Tags":"City","Country":"United States","Case Number":"44067","Disposition":"Unresolved","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Longitude":"-94.623684","Source":"MUFON","Object Shape":"Cigar","trends":["There have been 27 other sightings in Kansas City","There were no other sightings in Kansas City on or around November 20th 2012"],"Latitude":"39.123093","Date Submitted":"11/21/2012 02:24 UTC","divs":["sighting detailsi was pulling out of the driveway at approximately 10:15pm to go to supermarket for bread before they closed at 11pm. i had just started up my street and immediately i saw a hovering object with 3 super bright pulsating lights. it was super close to the top of the trees and as i drove i watched it closely. first it was heading south in the same direction as i was going. i lost sight of it above the trees at the top of my street which is a hill. i kept my eyes on the sky after i came to the top of the street and came around a small curve after the hill and i could see it again. i drove my car slow around 10-15 mph because i was watching the object and not the road. it then starts to go east and ascends a little higher in the sky but still lower than any objects i typically see in the sky or have ever seen before. i continue east and try to get my cell phone out of my purse to capture a picture or video. i was now trying to keep up with the object it seemed to pick up a little speed as i try to drive, i get cell phone try to point it and watch the object in the sky. i had traveled maybe a mile at this point and the object continued east. i stopped the car and was on a residential street trying to watch the object because i can no longer go east on the streets anymore because they all run south and north for about 1\\2 a mile in that area because there is a interstate and manufacturing plant to the east. the object seems to be going faster now and i started to lose it as it went northeast and totally lost it as it went to the north. i have a regular cell phone not a smartphone and it has less than a wonderful camera and by the time i got it pointed to the sky the camera doesn't work well in the dark at all doesn't have a flash or zoom. i also didn't mention that i rolled down my windows as soon as i first saw the object to try to hear what it sounded like and it was completely silent. i know it was not a helicopter or plane. it was shaped like a cigar i only saw the shape when i was parallel with it headed up the street at the beginning and it was large. the lights were large, round and had a white bluish color that appeared to pulsate. they were much, much brighter than the stars and radio tower lights as well."],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/44067.html.txt","/var/www/straped/mufon/org/44067.html"],"Summary":"I was pulling out of the driveway onto my street headed south when I saw a hovering object with 3 large super bright pulsating lights","Log Number":"US-11212012-0007","Weather Factors":"Unknown","Region":"Kansas"}