{"Tags":"City","Sighting Duration":"00:02:00","Region":"Oklahoma","Longitude":"-97.484063","Disposition":"Unresolved","Latitude":"35.341998","map":"<A HREF = \"http://maps.google.com/maps?q=35.341998,+-97.484063(44076)&iwloc=A&hl=en\"> mufon case (44076) map </A>","Object Shape":"Star-like","City":"Moore","Case Number":"44076","divs":["Sighting DetailsI was driving south on Penn in Oklahoma city, between 149th and 134th streets at close to 11:15-11:20 at night skies were pretty clear, as soon as i went through the intersection at 134th street i notice out of the corner of my eye two lights, that appeared to be apart of one object jetting from the west. it looked like it was close to being over either the highway or Will rogers world airport, but it was zooming faster then anything ever. but as it was getting closer to being paralleled with Penn, it started slowing down and basically came to a dead stop pretty close to parallel with Penn but it never actually got to the street, it was just above the tree and power lines in the distance, at the same time it came to a complete stop i could see, and now hear a helicopter flying from south east of me, and passing me heading towards the object, then as soon as i could look back, the object like collapsed in on itself, like the two lights became one then shrunk into nothing and it was gone. then helicopter continued toward it and eventually got out of my view, it sounded louder then most police and news choppers that usually out at that time of night."],"Weather Factors":"Unknown","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/44076.html.txt","/var/www/straped/mufon/org/44076.html"],"Source":"MUFON","Country":"United States","Date of the Event":"11/21/2012 11:10 UTC","Date Submitted":"11/22/2012 01:48 UTC","Viewing Distance":"501 Feet - 1 Mile","Summary":"Two bright lights flying fast then slowing to a stop and vanishing, then a helicopter flew toward where it was","trends":["There have been 23 other sightings in Moore","There were no other sightings in Moore on or around November 21st 2012"],"Object Flight Path":"Straight-line path","Log Number":"US-11222012-0001"}