{"trends":["There have been 3 other sightings in Oxford","There were no other sightings in Oxford on or around November 16th 2012"],"Tags":"City","Weather Factors":"Unknown","Region":"Mississippi","divs":["Sighting DetailsWhile I was driving my Mother to the doctor's office in Oxford, MS, she suddenly pointed up and asked me what is that? We were driving West on Highway 278 and she was looking upward in the front passenger window. I looked in the direction above us by leaning over the steering wheel. There was a rounded cylindrical object hovering over the treetops on the North side of the road. It had a small round ball shaped object floating a good distance above it and oddly it looked like two large birds where circling below the cylinder shaped object. The cylinder was parallel to the treeline. I at first thought it was a blimp, then looked again and saw that it was not and that the object was not moving, just hovering over the trees at an height of 100 ft or more (hard to judge the distance while driving 50 mph). I quickly looked back up at it a couple more times and when I did a strange thing occurred. The image tried to morph into what resembled a helicopter except there was no rotor shaft coming out of the top of the object and there were no propeller blades and no landing struts. At the next glance to this scene I suddenly thought I saw a yellow state trooper symbol on the side of the object. I thought a traffic helicopter checking for cars speeding on the highway and quickly looked away and steadied my attention back to my drive and the road ahead for fear I might get a ticket. I told my Mom I think its a helicopter and she said it didn't look like one. Weird part is they don't have those types of police helicopter monitoring highway offenses anymore that I know of. It's as if whatever it was wanted me and my Mom to see it but then cautioned me to keep my eyes on the road and avoid a wreck. If it weren't for my Mom, I would never have seen it and she has very bad eyesight at that."],"Log Number":"US-11212012-0015","files":["/var/www/straped/mufon/html2text/44075.html.txt","/var/www/straped/mufon/org/44075.html"],"Latitude":"34.375565","Case Number":"44075","City":"Oxford","Object Features":"Patterned Surface","Object Flight Path":"Stationary","Source":"MUFON","Longitude":"-89.510838","Object Shape":"Cigar, Cylinder","Summary":"Spotted object hovering over the treetops on the side of the highway.","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.375565,+-89.510838(44075)&iwloc=A&hl=en\"> mufon case (44075) map </A>","Date Submitted":"11/21/2012 11:17 UTC","Sighting Duration":"00:01:00","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"11/16/2012 10:30 UTC","Disposition":"Unresolved"}