{"map":"<A HREF = \"http://maps.google.com/maps?q=33.333399,+-105.664231(44078)&iwloc=A&hl=en\"> mufon case (44078) map </A>","Source":"MUFON","Object Features":"Other","Disposition":"Unresolved","Tags":"City","Case Number":"44078","Log Number":"US-11222012-0003","divs":["sighting detailsdriving back home from dinner on hwy 48 from ruidoso to capitan,nm at about 8:30 pm . at tree top level an object appeared from my left side it looked like two bicycle wheels both skewed about 20 degrees but going in a straight direction . the rims were a vivid aqua blue and seemed to be either pulsating while they were both spinning very slowly like seeing a fan spin through a strobe light. the center of the wheels were a slightly lighter aqua blue and appeared to be translucent with a slight darkening in the center where a hub would be . they stayed the same distance apart with a small red light between them .it reminded me of a bicycle but just the wheels and no frame. there was no sound and it traveled slowly across the road from my left to the right above tree top the image was very clear and crisp i asked my wife what it was and she thought it was a helicopter but what we were seeing did not match. my wife seems to think it was an aircraft of some type but at that height it should of made some kind of noise . there was a car about an 1\\8 of a mile ahead of us and i did see his brake lights flash so i think they must of seen it to . the object came into view very slowly and cruised across the road while we were traveling and disappeared past the tree line .my mind tells me it had to be an aircraft because it was so clear and i guess i can only say the word real comes to mind.my feeling now is an intense need to know what it was it seems to bother me ."],"trends":["There have been 2 other sightings in Ruidoso","There were no other sightings in Ruidoso on or around November 15th 2012"],"Summary":"two circles like bicycle wheels","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Country":"United States","Date Submitted":"11/22/2012 02:45 UTC","Object Shape":"Circle, Disc","Sighting Duration":"Undisclosed","City":"Ruidoso","Viewing Distance":"Unknown","Longitude":"-105.664231","files":["/var/www/straped/mufon/html2text/44078.html.txt","/var/www/straped/mufon/org/44078.html"],"Region":"New Mexico","Latitude":"33.333399","Date of the Event":"11/15/2012 08:30 UTC"}