{"City":"El Cajon","Date Submitted":"02/07/2006 12:00 UTC","Date of the Event":"02/07/2006 12:00 UTC","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=32.800323,+-116.955227(4408)&iwloc=A&hl=en\"> mufon case (4408) map </A>","Object Features":"Undisclosed","Country":"United States","Weather Factors":"Unknown","Source":"MUFON","Log Number":"US-02092006-0003","Summary":"Bright light in eastern sky","trends":["There have been 41 other sightings in El Cajon","There were no other sightings in El Cajon on or around February 7th 2006"],"Case Number":"4408","divs":["Sighting DetailsSaw something again for about 40 min. (continually) between 5:35 - 6:15 am. I was driving my husband to work, driving east. We both spotted something very bright in the eastern sky. It was extremely bright, but this time it looked much closer. We both kept expecting it to turn, or something because we both thought it had to be a plane because of it's low proximaty in the sky, but it was much brighter than plane, and it looked round or diamond shaped. Then all of a sudden, it started to pulsate in different colors, alternating from white, yellow, blue and green - no red (like a plane). As we got closer to his job (about a 35-45 min drive from my home), I started to become very anxious because it seemed to be getting bigger and closer to us. Honestly, I was scared because It looked just like the one I watched yesterday. I felt like it was \"watching\" us. My husband is a total skeptic, but he was even concerened. I was so scared I began to pray and then suddenly it looked like it was getting smaller and more like a star, but still visible and still super bright. This thing was at least twice the size of any visable planet and at least 3 times brighter. It was so bright that you could see the surrounding rays of light from it, similar to when you look at the sun directly, except it didn't hurt your eyes."],"Object Shape":"Undisclosed","files":["/var/www/straped/mufon/html2text/4408.html.txt","/var/www/straped/mufon/org/4408.html"],"Region":"California","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Tags":"City","Disposition":"Unresolved","Longitude":"-116.955227","Latitude":"32.800323"}