{"divs":["Sighting DetailsWalked out of the home and turned in an east direction down my driveway and saw in the sky 2 large reddish orange objects about 40 degrees in the air, approximately 1 mile out, traveling in a North by Northwest direction. Ran to my window and knocked rapidly for my friend Joel to come out and look, and then he witnessed this also. No sound was being detected at all from the 2 objects. Then I saw a 3rd one heading away rather low in the sky from about a mile out in a easterly direction rapidly, too fast for my friend to see that one. The other 2 objects, after about a minute were seen heading away from us directly North rather rapidly and again no sound was detected. One disappeared in the clouds first, and then the other one. Checked the Sunday Rockford Register Star newspaper to see if anything was in there about these objects, but nothing was in the paper about it. Checked with the Rockford airport tower units, and they said that there where no unusual aircraft or experimental craft leaving at that time that we questioned. They also said that there was no aircraft leaving in that time period. The objects had no blinking lights on them and the solid reddish orange colors remained constant from the side angle we were watching them at and even when they were heading directly away from our vantage point. There's not a doubt in my mind that these were definitely of the ufo nature."],"Viewing Distance":"Unknown","Date of the Event":"11/17/2012 06:37 UTC","Country":"United States","Weather Factors":"Unknown","Case Number":"44088","Object Shape":"Sphere","City":"Rockford","Longitude":"-89.084028","Date Submitted":"11/22/2012 10:06 UTC","Object Flight Path":"Path with directional change","Object Features":"Unknown","trends":["There have been 20 other sightings in Rockford","There were no other sightings in Rockford on or around November 17th 2012"],"Region":"Illinois","Disposition":"Unresolved","Latitude":"42.286645","Tags":"City","Sighting Duration":"Undisclosed","Summary":"2 solid colored objects traveling northwest direction then headed due north rapidly with no sound detected. Then a 3rd solid colored object seen heading ENE direction with no sound either. No flashing lights, remained that redish orange solid color.","Log Number":"US-11222012-0012","Source":"MUFON","files":["/var/www/straped/mufon/html2text/44088.html.txt","/var/www/straped/mufon/org/44088.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.286645,+-89.084028(44088)&iwloc=A&hl=en\"> mufon case (44088) map </A>"}