{"Object Features":"Other","Source":"MUFON","Latitude":"38.905985","divs":["Sighting DetailsIt was 1:45 in the afternoon we were done with dinner at my apartment witch faces the occident and south of the city of Bogota. Looking outside the balcony i noticed a very strange object floating in the air it was far south of our position i dint pay much attention to it until i noticed it started to ascend and descend. the object was about 800 ft from the ground. It started moving towards the north were the apartment is situated. I was also confused by the fact that there was a flying object on top of the city do to the fact that it is a restricted flying zone with an exception of departing aircrafts from the airport and police or news helicopters the object started heading north right next to the mountain maintaining the same elevation as it came closer i started noticing that the object had three type of winglets two in the sides and a smaller one in the middle it kept on getting closer and closer until we got a perfect view of the object it was metallic like dint emit any noise and it was very hard to explain how this object kept on floating without any type of propultion like an engine or a fan we had this perfect view of the object for about 3 minutes then the object elevated and went behind the mountain. We are three witnesses and we all saw the strange object."],"Country":"United States","Date Submitted":"11/22/2012 08:47 UTC","Summary":"description event","trends":["There have been no other sightings in Bogota D.C","This sighting has never been favorited."],"Region":"District of Columbia","map":"<A HREF = \"http://maps.google.com/maps?q=38.905985,+-77.033418(44085)&iwloc=A&hl=en\"> mufon case (44085) map </A>","Object Flight Path":"Straight-line path","Longitude":"-77.033418","Tags":"City","Case Number":"44085","Disposition":"Unresolved","Viewing Distance":"101-500 Feet","Log Number":"CO-11222012-0010","files":["/var/www/straped/mufon/html2text/44085.html.txt","/var/www/straped/mufon/org/44085.html"],"Weather Factors":"Unknown","City":"Bogota D.C","Date of the Event":"11/22/2012 01:45 UTC","Sighting Duration":"Undisclosed","Object Shape":"Boomerang, Circle"}