{"trends":["There have been 4 other sightings in Kernersville","There were no other sightings in Kernersville on or around November 22nd 2012"],"Weather Factors":"Unknown","Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","City":"Kernersville","Tags":"City","Latitude":"36.09603","files":["/var/www/straped/mufon/html2text/44082.html.txt","/var/www/straped/mufon/org/44082.html"],"Country":"United States","Longitude":"-80.116213","Log Number":"US-11222012-0007","divs":["Sighting DetailsMy son and I were on our way home from Thanksgiving Dinner with the family over in Kernersville. As we drove on Union Cross road, heading home, my son noticed 2 bright lights in the SW sky. As we got closer to the object, we noticed that it was not moving but looked to be hovering over some open fields just SW of Glen High School. We turned down a road and stopped and observed the object hovering over the fields. From what we could see at this point, it was just 2 bright white lights and one small red light less than a mile from where we stopped to look at it. I then continued about 500 ft further down the road to try and get closer to the object to see what it was. Still, 2 bright white lights, hovering. My son stated there was an open field toward the end of the road and I proceeded toward that open spot. I stopped my truck and we both observed the object much closer now. The object began moving slowly toward the NE and was only about 500 feet off the ground. We noticed that aside from the 2 bright white lights in front, there were also 4 bright white lights on the underside rear of the object along with the small red light underneath as well. Now the object was closer, I would say about 500 to 900 yards from our position, slowly hovering just to our east. The sound was like a shhhh....... sound, like static sounding. Almost a crackle sound. We could not see any part of the object, just the lights. 2 in the front, 4 in the rear, Triangle shaped black object. Once the object hovered slowly past our position, 2 of the 4 lights on the underside of the rear went out leaving the brightness from the 2 in the front still visible and the 2 in the rear visible. It continued to hover slowly E and the made a very slow turn toward the NE. We proceeded down the road to another clearing and the object could still be seen way off in a distance. The whole event only lasted about 5 minutes give or take a minute. We live within 20 minutes of the Greensboro Airport and within 15 minutes of the Winston Salem Airport. This was no airplane, nor was it a helicopter. My son and I have no clue to what it was. My son was able to capture a brief video on his Ipod of the object and was able to get a picture of it when we first saw it. It just happened about an hour ago and my son and I are still amazed by what we saw."],"Object Shape":"Triangle","Date Submitted":"11/22/2012 07:33 UTC","Object Flight Path":"Path with directional change","Source":"MUFON","Region":"North Carolina","Sighting Duration":"Undisclosed","Case Number":"44082","Summary":"Hovering Triangular object observed for several minutes before flying off","map":"<A HREF = \"http://maps.google.com/maps?q=36.09603,+-80.116213(44082)&iwloc=A&hl=en\"> mufon case (44082) map </A>","Date of the Event":"11/22/2012 06:30 UTC","Disposition":"Unresolved"}