{"Sighting Duration":"Undisclosed","Object Features":"Patterned Surface","City":"Galveston","Summary":"3 stationary lights like planets in traingular formation unusual","trends":["There have been 6 other sightings in Galveston","There were no other sightings in Galveston on or around July 4th 2012"],"Tags":"City","Region":"Texas","Case Number":"44084","Object Flight Path":"Stationary","Disposition":"Unresolved","Country":"United States","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/44084.html.txt","/var/www/straped/mufon/org/44084.html"],"Latitude":"29.262525","Source":"MUFON","Date of the Event":"07/04/2012 09:15 UTC","Log Number":"US-11222012-0009","Longitude":"-94.862202","map":"<A HREF = \"http://maps.google.com/maps?q=29.262525,+-94.862202(44084)&iwloc=A&hl=en\"> mufon case (44084) map </A>","divs":["Sighting DetailsI was walking my dog about 9PM. As I approached my home in the culdesac I noticed 3 lights in the Western sky in triangular formation. Initially I felt they had to be planets since they were not flickering. Because of the triangular formation I got my camera and took pictures. The cul de sac was dark with no light interference. I went to my back yard and still saw the 3 lights so I took another picture of them. Then I forgot about it since I believed it was a combination of planets in the sky but very unusual. On Nov. 19th I took pictures of an event that my daughter was in and afterwords downloaded the pictures to the computer. I then noticed those original pictures. The first with the palm tree in the background was not significant although it shows the triangular formation of the lights. When I magnified it there was nothing significant because of the back yard light that was on. But the photos in the front of the house shows the lights attached to an object when magnified. It looks like some sort of metal machine. The lights were stationary for at least 15 minutes which is the time lapse from the first sighting to the last photo. There was no noise of a plane or helcopter. We have lots of helicopters flying to the oil rigs in the gulf and I can recognize that sound. Never saw that light formation again in the western sky. Photo labeled UFO0712D IS THE MOST REVEILING PHOTO."],"Object Shape":"Unknown","Weather Factors":"Unknown","Date Submitted":"11/22/2012 08:00 UTC"}