{"Weather Factors":"Unknown","Object Shape":"Circle, Diamond, Egg, Flash, Oval","Tags":"City","Source":"MUFON","Latitude":"32.237776","Viewing Distance":"21-100 Feet","trends":["There has been one other sighting in Noonday","There were no other sightings in Noonday on or around November 16th 2012"],"files":["/var/www/straped/mufon/html2text/44090.html.txt","/var/www/straped/mufon/org/44090.html"],"Date Submitted":"11/22/2012 11:19 UTC","Object Flight Path":"Hovering then path","Sighting Duration":"00:12:00","City":"Noonday","Region":"Texas","Longitude":"-95.399827","Country":"United States","Date of the Event":"11/16/2012 10:30 UTC","Case Number":"44090","Object Features":"Unknown","divs":["Sighting DetailsI wanted to share a video and account of a sighting that myself and my daughter had on the night of Friday, November 16, 2012. I know that the date is correct because that is my mom's 70th birthday and we had just been celebrating her birthday earlier that night. My daughter is 16 years old and she knows that i like star-gazing so she had brought with her an old National Geographic telescope that I had bought her years ago when she was about 10. We also had my son's binoculars with us. She said that she read an news article on her I-phone that there was going to be meteor shower that night. I dont know if that is true or not because I didnt look it up and confirm the meteor shower before we left the house. We just went down to the marina to look at the stars for fun. It was a very cold night, and we just decided to stay in the car and use my moon roof to look through, however when I took the video and the still picture I had rolled my driver's side window down, and tried to anchor my hand down on the top of the car door to keep the video still but the video is still all over the place in some spots. We got to the marina and parked at the lakes edge at about 9:00pm and just saw about 3 or 4 shooting stars from that time until 10:30pm. We did also spot some bright, blinking lights in the sky far away over the other side of the lake in which we thought were just bright stars. But when we looked at them through the binoculars they seemed to move around though? Anyway, around 10:30pm, I looked behind where we were parked and saw a large, (about the size of a nickel at first) bright object that was pulsating red, white, and blue inside the core of it. It was not the same color as the object I saw earlier in November which was amber colored at the core. This object would literally change from red to blue and then white over and over again inside of it's core. It was different than an object that has red, blue and white lights that flash because the core of it would change colors not just the outside and that seemed very weird to me. And it did not move like a plane either. When I originally had seen it just to the right of the trees behind the marina bait store in the southeast sky, it was just hovering while I was filming for the most part but it did slowly move further south and started moving away from us by the time I stopped filming the video and took the still picture. Which was about 9 minutes, the time of the video. And my daughter got tired so we went home. I tried taking a still picture of it before we left and couldnt get a good one because the object had started to move so far away from us by then and appears much smaller than it originally appeared to us when we first saw it. However, it was still very bright."],"map":"<A HREF = \"http://maps.google.com/maps?q=32.237776,+-95.399827(44090)&iwloc=A&hl=en\"> mufon case (44090) map </A>","Log Number":"US-11222012-0014","Disposition":"Unresolved","Summary":"DIAMOND SHAPED OBJECT ON IT'S SIDE-PULSATING RED, BLUE & WHITE LIGHTS SEQUENTIALLY FROM IT'S CORE-HOVERED THEN SLOWLY MOVED SOUTH OF MY POSITION"}