{"Viewing Distance":"Over One Mile","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Log Number":"US-11222012-0015","Region":"Massachusetts","Tags":"City","Summary":"UFO Hovering In a Circular Direction Over Palmer","Country":"United States","Source":"MUFON","Disposition":"Unresolved","Weather Factors":"Unknown","Date Submitted":"11/22/2012 11:46 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.12357,+-72.480171(44091)&iwloc=A&hl=en\"> mufon case (44091) map </A>","files":["/var/www/straped/mufon/html2text/44091.html.txt","/var/www/straped/mufon/org/44091.html"],"Object Features":"Unknown","trends":["There have been 21 other sightings in Springfield","There were no other sightings in Springfield on or around November 22nd 2012"],"City":"Springfield","Object Shape":"Unknown","divs":["sighting detailsi have seen the same object out my bedroom window 4 times at the same aproximate time for about two weeks now. the first time i saw it (around 11\\14)i thought it was just an airplane because we have an airbase a town over, but this thing was ascending from the opposite direction of the airbase and it was going really fast. i noticed how quickly it ascended because there was a regular plane slowly going along on the right side of my window and this thing was on the left goin way faster. it was very bright and it was hard to keep track of it because it was going so fast. i saw it for about six seconds before it disapeared out of my line of sight. a week later (11\\19) at the same time (11pm) i saw the same object but it was just hovering directly in front of me, but it looked like it was at least a town over which would be wilbraham so i could not make out the shape besides the bright lights it was emitting. the lights were steady white lights and then a quickly flashing or pulsating greenish light. at first i thought it was just a really big bright star that i never noticed before but then it began to move. it tured upwards at an angle of about 60 degrees which i thought was strangg and then it stayed like that for a moment before slowly ascending upwards until i could no longer see it. two days later (11\\21)at around 11 again i saw it but this time it was to the right of my window. it was harder to see it from the right because i have a lot of trees in my back yard that block my view. it also looked like it was farther away, but it was still very bright and was flashing. then a small white orb came out of the thing and made like this little circular motion. i kept blinking to make sure i was seeing correctly because i have never seen anything like this and it is just strange. it stayed stationary for a while but then it started to move left then right and then it kind of did this circular maneuver which i still am unsure was real because it was so weird. after a few moments it went upwards again out of my line of sight. tonight i saw it again and i realized this must be something different then a helicopter or a regular plane. i don't have a camera other then an iphone so i doubt it will show anything significant, but i feel like if i see it again i am going to try and take a picture and submit it and maybe someone can identify it. the object always seems to come and go around the same time each time i've seen it."],"Longitude":"-72.480171","Date of the Event":"11/22/2012 11:10 UTC","Case Number":"44091","Latitude":"42.12357","Sighting Duration":"Undisclosed"}