{"Longitude":"-122.955418","Case Number":"44100","Log Number":"US-11232012-0008","Weather Factors":"Unknown","Object Features":"Dome","Sighting Duration":"Undisclosed","Disposition":"Unresolved","City":"Chehalis","Viewing Distance":"101-500 Feet","Region":"Washington","Date Submitted":"11/23/2012 01:12 UTC","divs":["Sighting DetailsMy name is sergeant Lewis Musick And have witnessed to sightings of UFO's but in 20 years of the other. September. and having believe in UFO's prio I was always looking at the sk. but m but my attention the suddenly diverted to t the suddenly diverted to the north we're I spied a disc like object covering next to the power lines. possibl possibly minutes whe it started moving to the sout it started moving to the south west and through the trees. and. tand mirrored its surroundings And then disappeared. The second siding I had was of an orb and then turning at a sha and then turning at a shark right angle this happen in July of 2010u that these were nothing more than yo UFO's. Both objects continued until I lost sight of them. Both objects were silent 1 was a reflective silver color the other was a lead gray color. do to the to the fact I have always beli I have always believe in UFO's.l"],"Country":"United States","trends":["There have been 7 other sightings in Chehalis","There were no other sightings in Chehalis on or around September 6th 1991"],"Tags":"City","Summary":"I was standing outside of my job site when I looked to the and spotted what appeared to be a disc like object hovering right next to the power lines. The second sighting was an orbe","files":["/var/www/straped/mufon/html2text/44100.html.txt","/var/www/straped/mufon/org/44100.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=46.670018,+-122.955418(44100)&iwloc=A&hl=en\"> mufon case (44100) map </A>","Object Shape":"Sphere, Other","Object Flight Path":"Hovering then path,Path with directional change","Latitude":"46.670018","Source":"MUFON","Date of the Event":"09/06/1991 12:00 UTC"}