{"Object Features":"Unknown","Region":"Arizona","Summary":"I watched a very bright object that would turn to red but always remained very bright, brighter then the brightest star at night. I watched it fro 20 minutes go up, down, left then, right, hover over me, various altitudes","Log Number":"US-11232012-0013","Tags":"City","files":["/var/www/straped/mufon/html2text/44105.html.txt","/var/www/straped/mufon/org/44105.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.532136,+-112.129287(44105)&iwloc=A&hl=en\"> mufon case (44105) map </A>","Date of the Event":"11/23/2012 02:00 UTC","divs":["Sighting DetailsOn Nov. 23rd 2 pm I was talking on my cell phone outside with my brother when I noticed a bright object in the Northwest sky. The object was brighter than a star in the evening sky, but this was daytime with no cloud in the sky. The object was decending slowly when I first noticed it then hovered for a minute or two and started asending and at the same time it started moving soutward, towards me. Every now and then stopping and hovering completely still for a minute or two. The object continued to travel in my direction until it was almost directly over me maybe a mile up in the sky and it stopped and hovered for about 2 to 3 minutes. All the while I was giving my brother a play by play what the object was doing, I was very excited especially when it would change to red but mostly how bright it was. I also thought to myself one of mabe 3 planes must ahave seen this, as well as other citizens of Phoenix and surrounding areas. The object, after about 2 to 3 minutes it changed direction and began moving in a more Northeastern direction as well as decending at the same time. occationally I could still see the bright light as it was now behind some trees that obstructed my view. But I remember saying to myself how low it was going. Someone is bound to see it. After the trees blocked my view I could no longer see the object. It seems three minutes later there was more plane activity in the area then there was during the time I was observing. The brightness of this object was stunning."],"Country":"United States","Sighting Duration":"Undisclosed","Disposition":"Unresolved","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around November 23rd 2012"],"Longitude":"-112.129287","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Latitude":"33.532136","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Weather Factors":"Unknown","Case Number":"44105","Object Shape":"Other","Date Submitted":"11/23/2012 06:26 UTC","City":"Phoenix"}