{"Viewing Distance":"Over One Mile","City":"Clay","Latitude":"33.702601","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/44108.html.txt","/var/www/straped/mufon/org/44108.html"],"Country":"United States","Case Number":"44108","Tags":"City","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.702601,+-86.59971(44108)&iwloc=A&hl=en\"> mufon case (44108) map </A>","Disposition":"Unresolved","Region":"Alabama","Log Number":"US-11232012-0016","Summary":"Observed 4 illuminated objects of an unusual size and overall appearence that were staggered vertically the objects did not move the objects were observed for several minutes until they deminised and dissapeared","Weather Factors":"Unknown","Date Submitted":"11/23/2012 08:10 UTC","Source":"MUFON","trends":["There have been no other sightings in Clay","This sighting has never been favorited."],"divs":["Sighting DetailsAs I was driving north on Trussville Clay road at approx 8 30 pm on the stated evening I observed 4 lights that were stationary in the n.e. sky just above the horizon The lights were larger than aircraft lights and of a odd color that caught my attention. The objects were staggered vertically one above the other and off center of each other. I observed the lighst for several minutes. The objects did not move either up or down, left or right. The lights were a pinkish peachy color. The lights did not twinkle or flash. They were stationary and seemed to me to be several miles or more to the north and east of the intersection of Clay Trussville road and Deerfoot Parkway. The lights were CLEARLY visible and could easily be seen. I observed the lights for several minutes until they shimmered momentarily and just seemed to just turn off. I live in the approach flight path to the Birmingham Al. airport and I am very accustomed to aircraft lights in the night sky. I knew instantly upon seeing these lights that they were not the normal aircraft lights. When these lights remained motionless and instantly dissappeared I knew I had witnessed something unusual."],"Object Features":"Unknown","Longitude":"-86.59971","Date of the Event":"11/14/2012 12:00 UTC","Object Flight Path":"Stationary"}