{"Sighting Duration":"00:00:15","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=29.447952,+-98.467293(44119)&iwloc=A&hl=en\"> mufon case (44119) map </A>","Summary":"Started talking to aliens through meditation, joined the military and met in person.","City":"San Antonio","Longitude":"-98.467293","Weather Factors":"Unknown","Case Number":"44119","Disposition":"Unresolved","Object Features":"None","Region":"Texas","Latitude":"29.447952","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around May 10th 2004"],"Country":"United States","Log Number":"US-11242012-0005","Source":"MUFON","Object Shape":"Other","divs":["Sighting DetailsI guess it was always a joke \"are you guys lying? you better not be lying\" was a joke commonly made. they can sound like anyone, for 99.9 percent of people they can holograph in and out to make them look like anything. For fun some of them project a holograph on a political figure to give scare to the viewers. They are masters of remote viewing. I have been locked in a mediation session with an alien while in a jail cell, when he flipped me over and over again, it was as real as if i were diving off a tall diving board, just no gravity, he did it because i was in jail. I learned the hard way the disagreements that the police and federal government retain with the CIA. To get to the point. While in San Antonio was walk the sun was just about to come up and zing, there is one right in front of me slices me with a injection device and hovers away, thinking, I'm watching you. Ever since then my mind runs. When i sit down and close my eyes, if i am not able to sleep, i start to autonomously remote view, strange and a nuisance, not to mention dangerous. List of encounters. 1. On the base to beings quick and hypnotic, tall and white skin, green eyes. follow me down as i am directed down towards a creek, when i would squint to see exactly what they look like they gave me a jolt thought, general fear burst, then the idea, don't look at us, but yes we are here with you. I am directed to go off base. 2. To i get injected with an electric-magnetic biological substance which is for tracking monitoring and for instant access to the ufo Mental information channel and data-base, full access to requests to speak to certain individuals, can call ufo to location if in trouble. Many of the people i run into who dare to speak to me, give me analogy's about how hot i am, heat wise. this injection, worst case scenario, is being used to time-down a device aimed to collapse the human conscious and rebirth it to a singular consciousnesses. 3. 2 year back, when i was given an injection to speed it up and slow it down. I never stop hearing voices, i know these people to be real, as everyone always says it,\"ill believe when i see it\" with that retarded tone of voice, like they would be fine with anything they saw. well i am a direct link to everything MUFON stands for and wants to find, all we need to do, is get me to a hospital and let me tell them which tests will be administered, i am on medicare. call anytime, i have a screenplay almost ready to go. sincerely nathan west"],"Date of the Event":"05/10/2004 06:03 UTC","Date Submitted":"11/24/2012 08:15 UTC","files":["/var/www/straped/mufon/html2text/44119.html.txt","/var/www/straped/mufon/org/44119.html"],"Object Flight Path":"Hovering then path","Viewing Distance":"20 Feet or Less"}