{"Latitude":"32.780566","Object Flight Path":"Undisclosed","Date Submitted":"10/21/2005 08:35 UTC","Log Number":"US-02092006-0006","Tags":"City","Country":"United States","City":"Charleston","Longitude":"-79.922172","Source":"MUFON","Object Features":"None","files":["/var/www/straped/mufon/html2text/4411.html.txt","/var/www/straped/mufon/org/4411.html"],"divs":["Sighting DetailsOn Friday October 21, 2005 at 8:35 P.M. at night I was at a neighbors house that is very nearby with some friends. We were out in the backyard on the patio we were grilling barbecue ribs and italian sausage on the outdoor grills out in the backyard. We all looked up and saw 3 circle UFOS all 3 circle UFOS on the inside of the bottom had red, yellow, and green lights then red, yellow, and purple lights then red and orange mainly red lights then they were a roquefort blue (what I mean by a roquefort blue the lights on the inside of the bottom looked like roquefort and blue cheese salad dressing and they were a light blue the lights looked like ROQUEFORT SALAD DRESSING and were light blue) they hovered over the treetops in the backyard and still had roquefort blue lights then again red and orange lights mainly red lights. Then 3 triangler UFOS showed up they were yellow lighted with red dots at every corner. and a huge cone UFO showed up and then all 3 circle UFOS and 3 triangler UFOS and the cone UFO disappeard they were gone as fast as they came they were all going towards the ocean except one traingler UFO I guess they crashed out in the ocean. And the one trainger UFO looked like it landed in a nearby pasture. We were done grilling our food on the outdoor grills out in the backyard. We went to the pasture where the UFO landed we saw foil and metal wrapped around the trees. It was a clear night outside. And the trianger UFOS made a humming sound."],"Case Number":"4411","trends":["There have been 20 other sightings in Charleston","There were no other sightings in Charleston on or around October 21st 2005"],"Viewing Distance":"Unknown","Object Shape":"Cone, Circle, Triangle","Region":"South Carolina","Weather Factors":"Unknown","Summary":"WHILE I WAS WITH MY FRIENDS WE SAW UFOS WHILE WE WERE ALL TOGETHER.","map":"<A HREF = \"http://maps.google.com/maps?q=32.780566,+-79.922172(4411)&iwloc=A&hl=en\"> mufon case (4411) map </A>","Date of the Event":"10/21/2005 08:35 UTC","Sighting Duration":"00:20:00","Disposition":"Hoax"}