{"Disposition":"Unresolved","Sighting Duration":"Undisclosed","Summary":"Odd shaped aircraft. Triangular. 2 bright white lights displaying the underside of aircraft.","Object Shape":"Triangle","Tags":"City","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/44118.html.txt","/var/www/straped/mufon/org/44118.html"],"Region":"Ontario","Date Submitted":"11/24/2012 07:50 UTC","Source":"MUFON","Latitude":"43.88284","trends":["There has been one other sighting in Richmond Hill","There were no other sightings in Richmond Hill on or around November 23rd 2012"],"Longitude":"-79.440281","divs":["sighting detailslast night, my husband and i were travelling north on leslie towards stouffville sideroad, north of elgin mills at approx 6:30pm. i first noticed the object (i was driving) directly north. it looked as though it was very close, enough to clearly see that it was triangular. the distance from the left and right points on the triangle were much farther apart than the top point to the bottom. there were lights at each point, in different colours. it was hard to tell the colour of the lights because it looked like the colours kept changing. there were 2 spotlights shining on what appeared to be the underside (or side) of the object. these spotlights were on the far left and far right of the object - near the points, and pointing toward the middle of the object. it was between 500 and 750ft away. i pointed it out to my husband, and he watched it travel southeast (toward markham). he commented that he had no clue what it was. it was very clear, yet hard to make out at the same time (if that makes sense). he also said that if it was an airplane\\jet, it was odd that it was heading to buttonville airport - it was much larger than what would land there (biplanes). my husband is a huge skeptic of everything unknown, and he was shocked and taken aback. it definitely did not look like a commercial aircraft. my husband lost track of it when we started heading east on stouffville sideroad."],"Country":"Canada","Object Flight Path":"Path with directional change","City":"Richmond Hill","Log Number":"CA-11242012-0004","Case Number":"44118","Weather Factors":"Unknown","Date of the Event":"11/23/2012 06:30 UTC","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=43.88284,+-79.440281(44118)&iwloc=A&hl=en\"> mufon case (44118) map </A>"}