{"Region":"New Brunswick","files":["/var/www/straped/mufon/html2text/44124.html.txt","/var/www/straped/mufon/org/44124.html"],"Tags":"City","Disposition":"Unresolved","Country":"Canada","Date Submitted":"11/24/2012 10:41 UTC","Summary":"massive It was a fire ball with a florescent ring around the fire and 2 stares in twined together at the botom","Object Shape":"Circle, Fireball, Sphere, Star-like, Triangle, Other","Longitude":"-64.840803","Latitude":"46.117637","Object Features":"Other","Source":"MUFON","Log Number":"CA-11242012-0010","Weather Factors":"Unknown","City":"Moncton","Sighting Duration":"Undisclosed","Date of the Event":"07/12/2012 12:00 UTC","trends":["There have been 8 other sightings in Moncton","There were no other sightings in Moncton on or around July 12th 2012"],"divs":["Sighting Detailsmy friend Diane ast me to move my car out of her driveway . When i opened her front door i looked up and seen a humongous massive fire ball on top of the neighbors home.A cross the street coming towards Diane home . I screamed for Diane to come . It was not quit on top of the neighbours home at this time but with in 20 seconds it would be. It was as big as 2 to 3 cars in size it was slowly coming in a straight line... The inner ball was a fluorescent red a red i have never seen before and haven't seen again. It was a beautiful fluorescent fiery red Large. There was a ring around the red ball that was transparent ...see threw ...but you could see it was there..... At the bottom of the ball was 2 triangles in tangled in each other ... I can still picture it as clear in my mind to this day. We then went in the drive way and watched it as it slowly went over the neighbors home and continued straight for Diane home it seemed to have stooped directly on top of us... Hovering for 2 minutes... Continued to move directly over Diane home and continue straight past her home. Till we could not see it it took a good 15 to 20 min before it was gone so we couldn't see much of the fiery red anymore. When it Harvard over us well actually the hole time this happened we heard not a sound completely silent. I pointed this out to Diane. We both sat there in amazement and for the weeks after couldn't talk about this to anyone we both could not get this sighting of what ever this was out of our minds ...She said she could see the outline of a massively big object on top of the ball of fier i myself could not see this as my eyes where so set on this massive ball of fire and the colours... I could not consume the beauty .....After the fact we discussed this and realized if there are UFO out there we may have just wittiness one. They would call the one we just seen the mother ship. As it was so large .A week or few days after many people reported seeing lights in the sky it was in the news papers we both had dreams of this after off and on ...That we have discussed together dreams that felt so real the date of this event may not be accurate. Diane recalls the exact date and time . She is not with me at this time she is at her home . I could find out the exact date if needed . when-this happened the neighbor came out of her home a cross the street and we yelled can you see that. She looked up in disbelief and jumped in her vehicle and took off . We have no spoken to her as we do not know her.. We do know she could see what we could see ...i could draw this if needed i still remember the details in my head as clear as can be i still dream of this happening an more strange thank you listening ."],"map":"<A HREF = \"http://maps.google.com/maps?q=46.117637,+-64.840803(44124)&iwloc=A&hl=en\"> mufon case (44124) map </A>","Object Flight Path":"Straight-line path,Path then hovering","Case Number":"44124","Viewing Distance":"21-100 Feet"}