{"Tags":"City","City":"Cecil-Bishop","Weather Factors":"Unknown","Date of the Event":"11/18/2012 05:35 UTC","trends":["There have been no other sightings in Cecil-Bishop","This sighting has never been favorited."],"Object Shape":"Disc, Fireball, Sphere","Log Number":"US-11242012-0011","Longitude":"-80.191872","Latitude":"40.326634","map":"<A HREF = \"http://maps.google.com/maps?q=40.326634,+-80.191872(44125)&iwloc=A&hl=en\"> mufon case (44125) map </A>","Sighting Duration":"Undisclosed","Country":"United States","files":["/var/www/straped/mufon/html2text/44125.html.txt","/var/www/straped/mufon/org/44125.html"],"Object Features":"Unknown","Case Number":"44125","Region":"Pennsylvania","Summary":"{cak} Observed two amber disks approaching which passed directly overhead.","Disposition":"Unresolved","Date Submitted":"11/24/2012 02:58 UTC","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsMy husband and I were returning home from a visit to our daughter who lives near Washington PA. After leaving Cecil PA on Rt 50, the road changes from two to four lanes. It ws at this point that I noticed two flame colored objects heading toward us. One passed directly overhead and I was able to see the underside which looked dull gray outside the flame color sort of like the edge of a fingernail. The second ship passed but was blocked from view by the edge of the moon roof. I felt we had seen UFOs so I quickly noted the time on our clock and watches. Thus occurred last Sunday, Nov. 18 at 5:35. We were traveling east toward Pittsburgh and the UFOs were traveling west bound. The lights were steady. I have never seen anything of that color in the sky. They were not traveling side by side but rather one behind the other slightly off to one side. I was excited by the viewing but lost sight of them as we traveling along a highway and didnt think to stop and pull over. I think we were shocked at what we thought we saw."],"Object Flight Path":"Straight-line path"}