{"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Country":"United States","Source":"MUFON","City":"Bolton","Weather Factors":"Unknown","Sighting Duration":"00:05:00","Case Number":"44130","Log Number":"US-11242012-0016","Summary":"Two glowing orb-like objects observed by four people. Both penny sized at first. One shot upward becoming star sized. The other moved downward becoming basketball sized before disappearing behind tree line.","trends":["There has been one other sighting in Bolton","There were no other sightings in Bolton on or around November 24th 2012"],"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=41.799336,+-72.489789(44130)&iwloc=A&hl=en\"> mufon case (44130) map </A>","Date of the Event":"11/24/2012 09:45 UTC","Date Submitted":"11/24/2012 11:07 UTC","Longitude":"-72.489789","Region":"Connecticut","divs":["sighting detailsat about 945pm on 11\\24\\2012, four of us were driving through bolton. while driving over the bridge that crosses over 384 on route 85\\bolton center road, we noticed a white, glowing penny sized orb to our left, which would have probably placed it nearly above the highway. this object hovered and made no noise that we know of. we noticed it only because it was in our line of sight, and seemed too big to be a star - though otherwise this is what it looked like. after crossing the bridge, curiosity made two of us look back, at which point the orb seemed to shrink to nearly a pinpoint, which we realized meant that it had ascended upwards. no sooner had i (the driver and writer of this report) turned my head forward again to watch the road, a second object was observed by all of us directly ahead\\in front of us, no more than a mile away. this object was also a glowing white orb, but basketball sized. it descended below the treeline pretty much on route 85 itself. we drove along route 85 to see if we could find it, but to no avail. i would be very interested if anyone knows of any military operations going on in this area on this date. if not, then i cannot explain what we saw. note: airplanes do frequently fly to bradley airport in the area we saw these orbs, and we saw such a one at this very time. the orbs were clearly different than the airplane."],"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/44130.html.txt","/var/www/straped/mufon/org/44130.html"],"Latitude":"41.799336","Object Shape":"Sphere, Star-like","Tags":"City","Object Features":"Unknown"}