{"Latitude":"41.574021","Case Number":"44135","Object Flight Path":"Straight-line path","Log Number":"US-11252012-0005","City":"Middletown","Longitude":"-72.710958","divs":["Sighting DetailsI was watching TV in my living room when i see this very bright abject flying over my neighbors house . the brightness of the object is what caught my attention. I immediately ran to my front window 2 feet away ,waiting for object to appear on the other side or to the side of my neighbors house but it never did. I thought about going outside but was scared !! i figured if i could not see it from my window it must be flying very low thats why i did not go outside to check.i no it was not a plane or helicopter because it was to flying low and i could not here any noise. This thing was very very bright as if it was glowing, i waited about five minutes looking out the window to see if it would reappear from behind my Neighbors house and it did not!!!! My house is on a hill so im looking down and up to the sides nothing thats why i did not go outside it was flying very low and i was to scared to go check. I woke my wife up to tell her what i just seen she told me to go to bed i locked my bedroom door and thats what i did, i most say i was very paranoid when i went to bed.my dog sleeps in our bedroom and about five minutes after going to bed he was barking like crazy i you-sully get up when he starts to bark at night and have to open front door so he can see there,s nothing there then he calms down but not last night i let him bark for a while then he calmed down ."],"Object Shape":"Disc, Egg, Sphere","Summary":"flew over neighbors house very bright","map":"<A HREF = \"http://maps.google.com/maps?q=41.574021,+-72.710958(44135)&iwloc=A&hl=en\"> mufon case (44135) map </A>","Sighting Duration":"Undisclosed","Viewing Distance":"21-100 Feet","Disposition":"Unresolved","Source":"MUFON","Date Submitted":"11/25/2012 12:58 UTC","Tags":"City","Weather Factors":"Unknown","Object Features":"Dome","Region":"Connecticut","Country":"United States","files":["/var/www/straped/mufon/html2text/44135.html.txt","/var/www/straped/mufon/org/44135.html"],"Date of the Event":"11/25/2012 12:00 UTC","trends":["There have been 15 other sightings in Middletown","There were no other sightings in Middletown on or around November 25th 2012"]}