{"Object Features":"Unknown","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/44139.html.txt","/var/www/straped/mufon/org/44139.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.345876,+-121.891166(44139)&iwloc=A&hl=en\"> mufon case (44139) map </A>","Country":"United States","Case Number":"44139","Date Submitted":"11/25/2012 05:37 UTC","trends":["There have been 106 other sightings in San Jose","There were no other sightings in San Jose on or around November 24th 2012"],"Viewing Distance":"501 Feet - 1 Mile","Latitude":"37.345876","City":"San Jose","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering,Other","Disposition":"Unresolved","Log Number":"US-11252012-0009","Date of the Event":"11/24/2012 12:00 UTC","divs":["Sighting Details1. I was standing out on my second story balcony alone looking into the gap between apartment buildings that is south. 2. At first there was just one that was just flashing red, orange, yellow, and green while moving at random directions extremely quickly. 3. My first thought was it was a UFO due to the random movements and very bright flashing colors. 4. The object was south of me. After a minute or so it would fade away. After a minute another showed up, then another after another minute. I went and got my phone to try and take pictures but I was just too far away. I ran to the levee behind my apartments and looked around the night sky to see eight objects surrounding the northern section of the south bay. I noticed that the objects moved in random flight but at other times horizontally flat across the sky. At some paces extremely quick and at others no movement whatsoever. The objects were star-like at first. Extremely bright and beautiful. They would fade after a short while into nothingness from afar and seem to reappear about a minute or so later. While I was on the levee I noticed one object heading in my direction so I started to run toward it to get the best shot possible. It ended up hovering maybe 1000 feet or more away from me beyond an overpass on top of a tree located in the middle of the levee. I took two pictures with my 3.2 megapixel camera. One of the object as red and star-like which I had zoomed into and another which I did get closer to but forgot to zoom. the second picture is of the object turning into a black orb which shone in the moonlight and had a white center or pupil. When I had tried to take the third picture as I looked on my screen the object disappeared or vanished. The objects would be around for the next two hours in the night sky. 4. I felt so excited to see the object so up close yet nervous that no one would ever believe me."],"Summary":"Star-like UFO Turns into Orb In Front of My Eyes","Longitude":"-121.891166","Region":"California","Tags":"City","Source":"MUFON","Sighting Duration":"Undisclosed","Object Shape":"Fireball, Sphere"}