{"Latitude":"43.015757","Country":"United States","Object Shape":"Diamond, Star-like, Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=43.015757,+-83.678946(44148)&iwloc=A&hl=en\"> mufon case (44148) map </A>","Tags":"City","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/44148.html.txt","/var/www/straped/mufon/org/44148.html"],"Weather Factors":"Unknown","Object Features":"Unknown","Date Submitted":"11/25/2012 11:00 UTC","Sighting Duration":"Undisclosed","Case Number":"44148","Region":"Michigan","trends":["There have been 40 other sightings in Flint","There were no other sightings in Flint on or around November 25th 2012"],"Date of the Event":"11/25/2012 09:13 UTC","divs":["sighting detailsvery cloudy, night. there are a few \"breaks\" in the clouds, which reveals a very dark, clear sky. one of these \"breaks\" in the clouds revealed a stationary object (appearing diamond-shaped) which flashed brilliant colors: white\\red\\blue\\green. to the left of this object (more to the east) 3 circular lights slowly began appearing in a perfectly straight line. all three lights were equidistant to each other, and they slowly \"came into view\". when the 3 lights \"lighted up\" where you could clearly see that they were most probably attached to \"something\"- although nothing was visible! the diamond-shaped object, still glimmering different colors very brightly, appeared to be \"staying in the same place\"- while the 3 other lights were becoming brighter......then dimmer............then brighter...........then poof!!!!!!!!! all 4 lights vanished. gone. very strange. i tried to take a picture...but no camera that would take that picture after dark. i felt very curious and amazed to see this, as i did not expect it! i lost sight of the object when, just exactly as though somebody had \"flipped a switch\" and shut them all off at the same time- they were gone."],"Disposition":"Unresolved","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","City":"Flint","Summary":"extremely bright, diamond-shaped \"star-like\" object flashing brilliant colors","Log Number":"US-11252012-0018","Longitude":"-83.678946"}