{"Sighting Duration":"Undisclosed","Latitude":"39.739956","divs":["Sighting DetailsI was at my residence when I received a call from Mike Nelson, who was travelling south on Rt. 130, a mile north of me. He reported that he was observing a similar group of lighted objects similar to those he observed on Nov. 5, 2012. He stopped at my residence and picked me up. We then travelled one mile to the Delaware River, where the objects were now visible north of the Delaware Memorial Bridge, travelling south at approximately more than 5000 feet altitude. From our location, the bridge was located 6 road miles south of us. By the time we reached the beach at Delaware Avenue from my house, approximately 10 minutes had passed. The group of objects were now located south of the bridge and only three were intermittently visible, pulsing brighter then dimmer then winking out. Twenty minutes into the sighting the objects were totally gone from view, winking out and not becoming visible again."],"Log Number":"US-11252012-0015","Object Shape":"Disc","Longitude":"-75.469379","Region":"New Jersey","City":"Carneys Point Township","map":"<A HREF = \"http://maps.google.com/maps?q=39.739956,+-75.469379(44145)&iwloc=A&hl=en\"> mufon case (44145) map </A>","Country":"United States","Viewing Distance":"Over One Mile","Object Features":"None","Date Submitted":"11/25/2012 08:40 UTC","Case Number":"44145","files":["/var/www/straped/mufon/html2text/44145.html.txt","/var/www/straped/mufon/org/44145.html"],"Date of the Event":"11/15/2012 05:30 UTC","trends":["There have been no other sightings in Carneys Point Township","This sighting has never been favorited."],"Object Flight Path":"Straight-line path","Tags":"City","Weather Factors":"Unknown","Source":"MUFON","Disposition":"Unresolved","Summary":"Observed 6 glowing white-yellow objects in formation above 5000 feet travelling SW over Delaware River for about 20 minutes. Constant speed and altitude, no sound or trails. Appeared bright yellow-white pulsing on and off intermittantly. Objects appear"}