{"Object Shape":"Disc, Oval","Disposition":"Unresolved","Date Submitted":"11/25/2012 06:15 UTC","City":"Penns Grove","Object Flight Path":"Straight-line path","Longitude":"-75.448999","Case Number":"44141","trends":["There have been no other sightings in Penns Grove","This sighting has never been favorited."],"Log Number":"US-11252012-0011","files":["/var/www/straped/mufon/html2text/44141.html.txt","/var/www/straped/mufon/org/44141.html"],"Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Tags":"City","Region":"New Jersey","Source":"MUFON","divs":["Sighting DetailsI was contacted via cell phone by a friend Mike Nelson, who did not wish to file a report. He reported that he was travelling south from Swedesboro NJ on Rt. 130, when he look west over the Delaware River and observed at least six bright yellow glowing disc shaped objects travelling in formation. He kept the objects in sight as he travelled south to Carneys Point. I was approximately one mile from the river when I received his call. I looked in the area he was reporting but could only observe one glowing object consistant to what he was reporting. After approximately 10 minutes, he reported that the objects were now high over the Delaware Memorial Bridge approximately 20 degrees off the horizon. It was still daylight and the objects still appeared bright. Mr. Nelson reported that the objects were still travelling at a constant speed and did not change directions.I lost sight of the last object after this call and so did Mike Nelson. An airliner was observed flying north toward Phila. airport and below the objects during the sighting. The airport is approximately 20 air miles north of the sighting location. It should be noted that Mr. Nelson was an adamant disbeliever in UFOs prior to his sighting."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.714954,+-75.448999(44141)&iwloc=A&hl=en\"> mufon case (44141) map </A>","Sighting Duration":"Undisclosed","Object Features":"None","Latitude":"39.714954","Country":"United States","Date of the Event":"11/05/2012 05:30 UTC","Summary":"bright yellow glowing disc shaped objects in formation travelling SW approximately 5000 feet."}