{"Viewing Distance":"Over One Mile","Summary":"A round, silver object appeared out of nowhere, \"sparkled\" as it moved across the sky, and then quickly \"faded\" out of sight.","Date of the Event":"11/25/2012 11:11 UTC","City":"Smyrna","Latitude":"35.933631","Weather Factors":"Unknown","Disposition":"Unresolved","Case Number":"44140","Object Features":"None","Object Flight Path":"Straight-line path","Source":"MUFON","divs":["Sighting DetailsAt approximately 11:11AM, I was on my way back from the store and noticed two planes in the southeast sky (approx. 65 degrees from the horizon). They were traveling side by side, pouring out chem trails against a perfect blue sky (no clouds, just \"blue\"). These were definitely chem trails, as I could clearly see a very long line of toxic clouds lingering in the sky behind them. I was just about to pull into my driveway, when a round, silver object suddenly appeared below them (approx 45 degrees from the horizon). It moved across my sight for a brief moment, heading south, then \"sparkled\" as though it was reflecting the sun (located to the right of the object...approx 80 degrees from the horizon). The object then \"faded out\" of sight. I quickly pulled into my driveway and got out of my car, continuing to watch the sky. I could no longer see the two chem trail planes, and the toxic clouds began to disappear (they were completely gone within five minutes). The silver object was NOT a bird, plane, or superman, nor was it a balloon, butterfly or insect. It appeared out of nowhere, \"sparkled\" as it moved across the sky, and then quickly \"faded\" out of sight."],"Date Submitted":"11/25/2012 06:11 UTC","Log Number":"US-11252012-0010","map":"<A HREF = \"http://maps.google.com/maps?q=35.933631,+-86.516019(44140)&iwloc=A&hl=en\"> mufon case (44140) map </A>","Country":"United States","Tags":"City","Sighting Duration":"00:00:15","Object Shape":"Disc","files":["/var/www/straped/mufon/html2text/44140.html.txt","/var/www/straped/mufon/org/44140.html"],"trends":["There have been 5 other sightings in Smyrna","There were no other sightings in Smyrna on or around November 25th 2012"],"Region":"Tennessee","Longitude":"-86.516019"}