{"Longitude":"-122.425666","Latitude":"47.105628","Summary":"2 triangular sets of lights were travelling North to South turned almost directly overhead and headed exactly the way they came south to north and disappered into the clouds about 10 miles away","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Source":"MUFON","City":"Spanaway","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/44158.html.txt","/var/www/straped/mufon/org/44158.html"],"Log Number":"US-11262012-0007","Region":"Washington","Date of the Event":"11/22/2012 11:38 UTC","Object Flight Path":"Path with directional change,Other","trends":["There have been 9 other sightings in Spanaway","There were no other sightings in Spanaway on or around November 22nd 2012"],"Country":"United States","Object Features":"None","Date Submitted":"11/26/2012 10:33 UTC","Case Number":"44158","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=47.105628,+-122.425666(44158)&iwloc=A&hl=en\"> mufon case (44158) map </A>","divs":["Sighting DetailsMy wife was out on the back porch having a cigarrette and came running in screaming come look and I said look at what and she said theres red lights in the sky coming this way. So I grab my coat and ran out on the back porch to see a set of 3 red glowing lights coming towards us and another set of 3 about 2 or 3 miles directly behind the first also coming towards us. When the first one was nearly overhead I noticed the lights were in a triangle shape exact distances from each other and glowing not incandescent or strobes directly below a dark black or grey triangular shaped object. The first object made a turn like a tether ball on a pole 180 degrees and headed back north and the second object did the same shortly after. At one point I thought they might collide when they passed each other by meer feet. Both continued north and dissappeered into the clonds about 10 miles away. There was never any sound heard by me or my wife."]}