{"files":["/var/www/straped/mufon/html2text/44150.html.txt","/var/www/straped/mufon/org/44150.html"],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=42.936608,+-83.620182(44150)&iwloc=A&hl=en\"> mufon case (44150) map </A>","City":"Grand Blanc","Weather Factors":"Unknown","Source":"MUFON","Case Number":"44150","Summary":"UFO flying above an apartment complex as we got off the express way home. We tried to follow it and it flew away.","Region":"Michigan","Date of the Event":"11/25/2012 10:45 UTC","Date Submitted":"11/25/2012 11:57 UTC","Latitude":"42.936608","Object Flight Path":"Hovering then path","divs":["sighting detailsmy husband and i were on our way home from my parents house sunday, november 25th, 2012 at about 10:45pm. we were heading south coming from flushing and getting off at the grand blanc\\rankin exit. as we were approaching our exit, my husband asked me what i thought that was east of us flying in the sky. i was driving so i replied,\"probably an airplane\". he said it wasn't moving, just hovering over these apartments. so i looked and i couldnt logically come up with an explanation. it was a triangle that had at least 3 red lights, and probably (not exact) 6-8 bright white lights or more. there were trees as we were getting off at the exit which made it difficult to see. so, we rolled the window down and once we got off at the exit and stopped at the light,i screamed for my husband to take a picture. he was reaching for his phone, and as we turned right trying to figure out what this was, it flew almost directly straight and fast back south. it was like it completely dissappeared after that. we drove through the apartment complex and couldn't find anything nor any other logical explanation on what it could be. so, we headed back to our apartment complex on grand blanc road. the complex we saw it hovering over was on grand blanc and i beleieve, torrey road. it was the first road that you turn right off from grand blanc road if you go right off the exit coming south. we were completely shocked and my husband says he was completely mesmorized and couldn't get it together quick enough to get a picture. we called my mother and she found this site and another one and told us to report it. there was another sighting reported one week ago in flint, michigan but i don't know the validity of it."],"Viewing Distance":"N/A","Log Number":"US-11252012-0020","trends":["There have been 5 other sightings in Grand Blanc","There were no other sightings in Grand Blanc on or around November 25th 2012"],"Tags":"City","Object Shape":"Triangle","Country":"United States","Object Features":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-83.620182"}