{"Tags":"City","Disposition":"Unresolved","Object Shape":"Circle, Cylinder, Disc","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around November 25th 2012"],"Object Features":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Log Number":"US-11262012-0006","City":"Portland","map":"<A HREF = \"http://maps.google.com/maps?q=45.504822,+-122.64459(44157)&iwloc=A&hl=en\"> mufon case (44157) map </A>","Country":"United States","Region":"Oregon","files":["/var/www/straped/mufon/html2text/44157.html.txt","/var/www/straped/mufon/org/44157.html"],"Date Submitted":"11/26/2012 03:35 UTC","Latitude":"45.504822","Weather Factors":"Unknown","Longitude":"-122.64459","Case Number":"44157","Object Flight Path":"Hovering then path","Date of the Event":"11/25/2012 11:10 UTC","divs":["Sighting DetailsAt 5:15pm I got in my car to go to work. I noticed directly south of me a bright light in the sky. It looked like an extremely bright star but it was too early in the evening for stars and it was much larger than any other star I've seen. I thought maybe it was a satellite and drove to work, not really giving it much thought. When I got home at approximately 11:15 this evening, I noticed the 'star' was still there. I got out of my car and walked toward it, thinking maybe it was a light attached to the top of a telephone pole or something similar. I walked about 3 blocks until I could see it more clearly and could make out a circular shape with red lights on two of the 'sides' of the circle. Suddenly, it began to move. First to (my) left, then it began flying directly towards me. I literally ran two blocks and ducked into a driveway between the wall of their house and their car. I could make it out much more clearly now, it was definitely not an airplane and it made a noise too... like a low hum, like a quiet airplane. After I ran into the driveway it changed course and began flying directly west. It was interesting because tonight, unlike many nights we've had, has been such a clear night. No clouds in the sky and the stars and moon are brighter than usual. It's also interesting because I have never thought UfO's existed... until tonight. I'm not crazy and I know what I saw and heard. When I got to my apartment I turned around to see if that bright light was still shining, and sure enough it was gone."],"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Summary":"Noticed a bright light in the sky, when I approached, it began to change course and fly towards me."}