{"Tags":"City","Case Number":"44160","divs":["Sighting DetailsAt approximately 7:45 pm I was standing in front of my house, facing South West and saw a white light ascend rapidly & silently at an unknown distance, across the street behind my neighbor's house. What I noticed in particular was how straight and plumb the object's path was. A straight-as-an-arrow, and seeminly 90 degrees vertical ascent. It left no trail at all. I first saw it at 30 degrees above the neighbor's yard, and watched it rise to 60 degrees and vanish. I was also struck by its speed. I cannot say with certainty what its distance from me was...anything from 1 to 5 miles ??? After I saw it, I felt a bit spooked. It was not like anything I've seen before. It seemed inexplicable, and therefore qualifying as a UFO, but then later I had to fight off a desire to forget all about it -- which seems odd, because I've always wanted to see a UFO. I actually forgot about it until late last night, and then had to make a point of remembering it. .....that seems significant to me. I live in an area that occasionally uses white search lights for sports events. Those lights have a beam and move characteristically in sweeping arcs. The light I saw was nothing like that. One last thing that is a little embarrassing to include: I heard a unusual Peep-peep sound across the street after the Light vanished. It was about 40 degrees at the time -- too cold for insects or frogs. I moved to get a better perspective, and scrunched some leaves, at which point the sound stopped. I was outside getting my cat in at the time when I saw the Light. My cat was frightened of me at first, and I have never seen him act like that before. The whole episode is weird, with a cluster of weird aspects to it, which makes me inclined to think I did indeed see something strange...and yet, I still want to dismiss the whole thing as nonsense."],"Region":"Maryland","Disposition":"Unresolved","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=39.014391,+-76.973005(44160)&iwloc=A&hl=en\"> mufon case (44160) map </A>","Log Number":"US-11262012-0009","City":"Adelphi","Date of the Event":"11/25/2012 07:45 UTC","Object Shape":"Circle, Oval, Sphere","Latitude":"39.014391","Summary":"straight as an arrow 90 degree vertical ascent. rapid speed. then disappeared. struck me as VERY odd, then fought off desire to forget about it.","trends":["There has been one other sighting in Adelphi","There were no other sightings in Adelphi on or around November 25th 2012"],"Object Flight Path":"Straight-line path","Country":"United States","Viewing Distance":"Unknown","Source":"MUFON","Longitude":"-76.973005","Date Submitted":"11/26/2012 12:58 UTC","files":["/var/www/straped/mufon/html2text/44160.html.txt","/var/www/straped/mufon/org/44160.html"],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed"}