{"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/44169.html.txt","/var/www/straped/mufon/org/44169.html"],"Disposition":"Unresolved","Tags":"City","Date of the Event":"10/24/2009 02:30 UTC","Summary":"Ball of light, ground level. Emitting a wall of light that engulfed our vehicle. Radio and engine shut down and the light was bright enough to read by.","Date Submitted":"11/26/2012 11:29 UTC","trends":["There have been 2 other sightings in Kilgore","There were no other sightings in Kilgore on or around October 24th 2009"],"Region":"Texas","Viewing Distance":"Unknown","Case Number":"44169","divs":["Sighting DetailsMy wife and I was returning from the home of friends around 2am. We live in a rual area, no street lights. When we turned on Bell Rd. at about a 10 oclock position there was a huge flash. We compare it to a transformer explosion. There was a wall of light moving slow, about as fast as I can walk, moving toward us. The radio and engine of my truck shut down. It was very dark outside, but when the wall moved past us, it was light enough to read. We don't know how long this light was on us. The wall moved back over us just as slow as it had come, when it reaches the glowing ball, it flashed and was gone. The radio came back on, I cranked the truck and we came on home. It was dark on one side of the wall of light and very bright on the other. What was strange is that we wasn't excited or scared, just relaxed like it was an every day thing. We didn't talk about it for a coupla days, When we did talk, we both seen the same thing. As far as we can tell we haven't had any adverse effects to this, Just feel crazy telling anyone. We can't tell haw long timewise we was in this light."],"City":"Kilgore","Longitude":"-94.866551","Latitude":"32.392602","Source":"MUFON","Object Shape":"Fireball, Sphere, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.392602,+-94.866551(44169)&iwloc=A&hl=en\"> mufon case (44169) map </A>","Log Number":"US-11262012-0017","Object Features":"None","Object Flight Path":"N/A","Country":"United States"}