{"Viewing Distance":"21-100 Feet","Weather Factors":"Unknown","Object Features":"Unknown","Object Flight Path":"Hovering then path","Date of the Event":"11/24/2012 07:00 UTC","Disposition":"Unresolved","Log Number":"US-11262012-0015","Longitude":"-81.299611","files":["/var/www/straped/mufon/html2text/44167.html.txt","/var/www/straped/mufon/org/44167.html"],"Latitude":"28.638701","Case Number":"44167","map":"<A HREF = \"http://maps.google.com/maps?q=28.638701,+-81.299611(44167)&iwloc=A&hl=en\"> mufon case (44167) map </A>","Tags":"City","Country":"United States","Date Submitted":"11/26/2012 09:43 UTC","Sighting Duration":"00:08:00","Summary":"Me and six others witnessed a UFO, that had two red/orange wing lights, and a nose light. It appeared to be hovering, or moving rather slowly just aboove the house. Two of the witnesses believed it to be three seperate crafts.","Source":"MUFON","City":"Casselberry","divs":["sighting detailsi had arrived at my friends house shortly before 7:00 p.m. eastern time, on 406 eagle circle, casselberry fl, 32707. i was standing in the garage talking to one of my friend's female neighbors about my rough day. then i decided to go inside to grab a beer. i had walked back outside and the female neighbor i had talked to previously pointed up at the sky, and shouted everyone to look. my day was about to get even stranger. what i saw was the most bizzare sight i have ever seen in my life. just a little past and above the house (about 50-100 feet in the air), was a u.f.o. it had two red\\orange wing lights, and a matching nose light. i could faintly make out the shape, and it appeared to be a dark triangular shape, that was slightly darker than the horizon. making it easier to connect the dots of the lights to make out a shape. it was so close i thought i could throw a baseball at it! the female neighbor witness, and her boyfriend thought it was three seperate crafts, but i was pretty convinced that it was one. it slowly hover there for a few momemnts, as if it were observing, or collecting data. then is proceded to slowly fade of pass the trees, and from all of our vantage pomits. we could no longer see it. the \"air craft\" also made no distinct noizes at all. none of us heard a peep out of it even has it was leaving. i remember when i first looked up i ran through four different emotions during this roughly ten minute sighting (i know because i called a trusted friend at 7:17 to tell him of it) i first was kinda in fear, then in a second, shock. follwed by awe, and excitement. i tried to take three seperate picture of it and only one of them kinda shows the left wing light. i was too shocked, and couldn't keep my eyes of it to get any good pictures. all three pictures on my phone mainly show the blackness of the sky. i honestly figured it was some kind of drone, or government survillance plane, or visitor's from another planet, because i look at the sky and planes all the time. i have been studying geo-engineering, and can honeslty say this is nothing like i have ever seen before! there was also six of us who all saw this!"],"Object Shape":"Triangle","Region":"Florida","trends":["There have been 3 other sightings in Casselberry","There were no other sightings in Casselberry on or around November 24th 2012"]}