{"Tags":"City","Object Shape":"Sphere","divs":["Sighting DetailsI was reclining in the backyard on a chaise lounge. My cat jumped up on my chest as it usually does when I do this. I closed my eyes for a bit, then the cat started to get too close to my face, so I picked it up to put it on the ground. That's when I noticed a black shpere-shaped object simply HANGING in the air above me. It took me a while to figure out what I was looking at. I couldn't figure out why the object was simply suspended in the air. It was about the size of Venus, or a little smaller, maybe Mars. I knew it wasn't an airplane for sure, as it was simply STUCK in the air. It wasn't moving, except possibly slightly turning to reveal a red area on a different side of the sphere. This could have been a red flashing light, I don't know for sure. I kept looking at the object to figure out what it was. I knew it wasn't a helicopter- for one thing, I could clearly see it was a sphere, and not elongated at all. For another, there was no noise, and we have helicopters fly over the house almost every day, so I know what a helicopter looks and sounds like. And I think that a helicopter couldn't be that high anyway. I mean if it WAS a helicopter, it would have to be very very high to be the size of Venus and anyway, like I said, there was no movement of any kind, which means no props or blades. I thought perhaps it could be a balloon, but as I said, it was STUCK in the air. In other words, it didn't move at all, except possibly to gently turn over, but as I said, this could have been a red flashing light. If it WAS turning over, then it did it VERY VERY gently--in other words, there was no bobbing, jerking, jiggling, or erratic movement of any kind. It just hung there. Very weird. I finally realized I was very likely looking at a UFO, and I was excited. I went to get a digital camera, but either the memory card or whatever it is was full, or the camera didn't work. I think I got one picture, but when I tried to download it to my computer, the computer wouldn't take it. Anyway, I couldn't see the object in the viewfinder, so I just pointed it as best I could and took the picture. It is exposure 90, but the computer would only go to 89. I still have it, but I don't know if I was able to point at the object. I called my mom out to look, but she couldn't see it. It was only about the size of Venus or Mars, and the sky was still fairly bright. That was a bit frustrating. I kept pointing, but she didn't see it. It was there for only about 3 minutes. I wish I could have taken a picture, but I didn't want to go looking for another camera and lose the object. I kept looking at it, and then finally it just -- disappeared, which I know sounds weird, but that's what happened. Poof. Gone. I guess it could have sped off so fast I didn't see it. The next day, I told someone at work about it, and he got excited and kept asking me about it, and said his mom told him a similar thing, but I think that was in Phoenix. Anyway, later that day I saw a white sphere, about the size of an average star, and it was gently moving thru the air. It was kind of erratic. I guess that could have been a balloon, because it wasn't moving very fast and was just meandering thru the sky, but the next say something happened which made me think twice. On Friday, after work, I went outside to see if it was there again, and after scanning the sky, decided to lay back down to duplicate my actions two days before. My mom came out to ask if I was looking for the object, and about a MINUTE later, a VERY VERY fast star-like object flew right above my head ( I mean it was way way up there, but you know what I mean) in the direction I was reclining ( it started at my head and moved in the direction of my feet) and then started 'bouncing' or zig-zagging...those aren't really the words, because I couldn't see the object actually do those things, I just saw it in one place and then in another and then another - like that- then it straightened out and then ANOTHER object about 2 seconds behind it did very similar things--I know this sounds crazy but it was almost as if they were confirming that they were UFOs and nothing else. I mean this was three days in a row--if the previous day's sighting was a craft of some kind and not just a balloon. Come to think of it I see the slow meandering kind quite a bit--maybe every month, so those could be balloons I guess. I have never seen a big balloon like those would be but I have heard about weather balloons. Are those really big, completely round and white? But there is no way that those fast-moving objects were balloons, jets, meteors or rockets or anything 'conventional'. For one thing, all those things, except for the balloon of course leave trails of some kind, and these didn't--except for...well it seems like the air around them was kind of - I don't know, kind of hazy, almost as though they were on a road in the sky. And it took only about 5 seconds at the most to go from one point in the sky to the other where I couldn't see them anymore. In other words, clear across the sky in 5 seconds or maybe less. I just thought of something. Take your arm and put it on the table. Point your hand to the ceiling. Now, take about five seconds to lower your hand to the table. Remember that speed, go outside and do the same thing to the sky, and that's how fast the ojects were going. Try to imagine a rocket going that fast. No way. I wonder how fast they were going. Thousands of MPH, is my guess. I just thought of something else. When they were 'jumping' it was like what a flea does when it jumps. You can tell it jumped, but you can't see it actually in the air. That's exactly what it was like. I almost didn't even make this report; it's not like anyone can really prove it. And I told someone I didn't know about it and she kind of looked at me like I was drunk or something. Which by the way, I wasn't. No alcohol, drugs, or mind-altering substances of any kind. And I wasn't dreaming, as my mom will verify. But when I saw the two objects zoom by, compared with the slow moving object I saw the day before, I figured what the heck. Maybe someone else saw at least one of these things. And I saw where only about 1 in 7 people sees ONE, and I saw at least 3 or possibly 4 in three days, so I figured this was worth reporting. Definitely the weirdest three days I have ever had. Oh, I wasn't scared at all. It was very cool. Anyway, feel free to follow up if you think it will help."],"Country":"United States","Date of the Event":"02/08/2006 05:25 UTC","City":"Roseville","Source":"MUFON","Disposition":"Insufficient Data","Case Number":"4417","files":["/var/www/straped/mufon/html2text/4417.html.txt","/var/www/straped/mufon/org/4417.html"],"Object Flight Path":"Stationary,Straight-line path,Path with directional change","Summary":"Black Sphere w/red or red flashing light","Longitude":"-121.280986","Weather Factors":"None","Sighting Duration":"Undisclosed","Object Features":"None","trends":["There have been 31 other sightings in Roseville","There were no other sightings in Roseville on or around February 8th 2006"],"Viewing Distance":"Unknown","Date Submitted":"02/08/2006 05:25 UTC","Latitude":"38.754764","Log Number":"US-02112006-0004","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=38.754764,+-121.280986(4417)&iwloc=A&hl=en\"> mufon case (4417) map </A>"}