{"Object Features":"Dome","map":"<A HREF = \"http://maps.google.com/maps?q=33.680942,+-111.871186(44176)&iwloc=A&hl=en\"> mufon case (44176) map </A>","files":["/var/www/straped/mufon/html2text/44176.html.txt","/var/www/straped/mufon/org/44176.html"],"City":"Scottsdale","Sighting Duration":"Undisclosed","divs":["Sighting DetailsAt home, late evening - shortly after 10pm, doing nightly routines, checking on horse and bringing him his dessert cubes, just hanging out - always in habit of looking up at the sky. The moon was so bright last night (Mon. Nov. 26th) as we will have a full moon Wednesday. Noticed Orion's Belt and always notice low flying local air traffic from Scottsdale, Deer Valley and Carefree. Last night we also noticed a very bright twinkling object that was just hovering. Initially we thought it was a plane, then perhaps a chopper, but it was just hovering and we didn't hear any sounds. We also considered it could be a blimp. We are close to Cave Creek Rd. and Carefree Hwy and this appeared to be a few miles East, and slightly South - closer to Scottsdale Rd. and perhaps even over the McDowell Mountain Preserve, Four Peaks area. We watched it for a solid 30 minutes initially with binoculars. We saw a rainbow of lights, different colors and patterns lighting up, flashing and changing. It appeared to be sphere shaped when fully lit, at other moments looked like a boomerang with two sides lit, or a tubular shape with a spiral of lights. Never seen anything like this. We were in awe. We took some video but without a powerful zoom it doesn't show what we saw thru binos. We're hoping someone at the Scottsdale Airpark or around Four Peaks has some better video. We never lost sight of the object, we just went to bed about 11:30 and at that time it was still in the northeastern sky. Six witnesses - family of three in Cave Creek and other family members in North Scottsdale."],"Viewing Distance":"Over One Mile","Log Number":"US-11272012-0007","trends":["There have been 42 other sightings in Scottsdale","There were no other sightings in Scottsdale on or around November 26th 2012"],"Tags":"City","Weather Factors":"Unknown","Summary":"constantly changing dazzling light display from hovering object - rainbow of colors, appeared to be gyrating","Source":"MUFON","Region":"Arizona","Object Flight Path":"Stationary","Case Number":"44176","Longitude":"-111.871186","Disposition":"Unresolved","Country":"United States","Date Submitted":"11/27/2012 12:51 UTC","Date of the Event":"11/26/2012 10:20 UTC","Latitude":"33.680942","Object Shape":"Boomerang, Cylinder, Disc, Sphere"}