{"files":["/var/www/straped/mufon/html2text/44179.html.txt","/var/www/straped/mufon/more/44179_submitter_file1__colorcurve.png","/var/www/straped/mufon/more/44179_submitter_file2__multilightsinvertleveledcurved.png","/var/www/straped/mufon/org/44179.html"],"Weather Factors":"Unknown","trends":["There have been 35 other sightings in Kingman","There were no other sightings in Kingman on or around November 25th 2012","This sighting has never been favorited.",""],"Summary":"Explosive burst of light appeared in sky, white/blue, out of which came a blue, lazer-like object, follwed by more light, sparks/flames, crossing the sky and then disappearing.","City":"Kingman","Region":"Arizona","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","divs":["Sighting DetailsI was driving East on the I-40, near Flagstaff, AZ. It was aproximately 2AM. It was very dark and desolate. Suddenly, the sky became very bright. My attention was drawn to the sky, North, toward Nevada. Within aprox 1000ft AGL, there appeared an enormous, energetic explosion of light, mostly blue and white, that cast down a shower of sparks, somewhat similar to en electrical surge. The explosion seemed to create a ring-like effect, out of which, it seemed, emerged a large, oblong, glowing object. It had a blue, lazer-like appearance. The object rapidly \"skittered\" and dashed across the sky, westward, covering at least a couple of miles (or perhaps many more) in a matter of only 5 or 6 seconds. It seemed to leave a trail of \"sparks\" or some kind of flaring energy. The entire event seemed to end suddenly, in another display of explosive light. The sky immediately returned to its normal state, and it was over. I felt shocked, amazed, afraid and excited, all at once, during and immediately after the event. I even wondered if I had hallucinated or imagned the entire thing because it seemed so \"unreal.\" It was like nothing I have ever seen before, not even in movies. I did, by chance, have my video recorder on and was able to capture the majority of the event. I later encountered another traveler who saw the event, but not with as much clarity."],"Latitude":"35.197893","Object Shape":"Disc","Tags":"City","Log Number":"US-11272012-0010","Source":"MUFON","Object Flight Path":"Straight-line path,Other","map":"<A HREF = \"http://maps.google.com/maps?q=35.197893,+-114.046066(44179)&iwloc=A&hl=en\"> mufon case (44179) map </A>","Country":"United States","Case Number":"44179","Date of the Event":"11/25/2012 02:15 UTC","Disposition":"Unresolved","Date Submitted":"11/27/2012 04:21 UTC","Object Features":"Dome, Other, Unknown","Longitude":"-114.046066"}