{"Date Submitted":"11/27/2012 03:56 UTC","Object Flight Path":"Stationary","Case Number":"44174","divs":["Sighting Details I was on a commercial flight from sea-tac airport ,wash.st to anchorage Alaska. Approx.6:30 a.m. Mid.nov. there was no clouds,blue sky,you could see for miles,clear sky.suddenly,the pilot (captain) blurted over the intercom,his exact words,after 50 years I can still hear them.he said,ladies and gentleman,if you look over the right wing tip towards the horizon you will see a hah oh he'll I don't know what it is,with that message mostly every one on the plane took turns looking out the windows at the UFO.i was standing next to two stewardess who said it wasn't a weather balloon,there wasn't a balloon above the UFO.the color was really shiny silver,it was dome shaped, with a flat bottom, and what Lookedl like windows around the bottom of the craft. When we arrived at anchorage, the captain, over the intercom stated there was no known aircraft in the area at the time of our sighting.here is another part of this sighting. I was watching a UFO show on tv when I knew the Japanese pilot discs scribed being followed by a UFO for over an hour,this Japanese pilot was in the same area where we had our sighting.what really got to me was at the end of the Japanese pilot segment,he(the pilot) held up his drawing of the UFO that he interacted with.the picture of the UFO he drew was exactly the same UFO I have been drawing to show people what I and a hundred or so other people saw that morning.also,which I find happens quite often,the president then was Lyndon b.Johnson. He was in anchorage at the time of these sightings.i know this because I shook hands with him.one late afternoon the president was in a convoy going to a bonfire and celibration in his honer.the convoy,with troop trucks kept going and the presidents limo stopped right in front of me,he got out of the limo and I walked over to him,said hi and shook his hand.it was really a memorable experience,I can't get over the sight of that huge UFO just hovering there.i never heard any feed back until I saw that Japanese pilot and what he went through.they (UFO)are real.c"],"Latitude":"61.225266","Summary":"Flying from sea-tac airport wa. To anchorage alaska mid nov.,approx.6:30am at 36 thousand ft. The pilot over the intercom said to look over the riu. Ft..the pilot, on the intercom stated to look out the window past the right PFt.,we flew past a UFO that","Object Shape":"Sphere, Other","City":"Anchorage","Region":"Alaska","Disposition":"Unresolved","trends":["There have been 24 other sightings in Anchorage","There were no other sightings in Anchorage on or around November 15th 1966"],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/44174.html.txt","/var/www/straped/mufon/org/44174.html"],"Date of the Event":"11/15/1966 12:00 UTC","Source":"MUFON","Country":"United States","Log Number":"US-11272012-0005","map":"<A HREF = \"http://maps.google.com/maps?q=61.225266,+-149.893408(44174)&iwloc=A&hl=en\"> mufon case (44174) map </A>","Object Features":"Dome","Longitude":"-149.893408","Viewing Distance":"Over One Mile","Tags":"City","Weather Factors":"Unknown"}