{"Tags":"City","Date of the Event":"11/27/2012 06:39 UTC","Object Shape":"Circle, Fireball, Sphere, Star-like, Unknown","City":"Bonesteel","Summary":"6 different amber to orange lights in no pattern","divs":["Sighting DetailsI let the dogs out and looked up and noticed what I thought was a star until it got really bright orange, then it headed South extremly quickly. I called to my wife, when she got to the back door, it was gone but then others appeared like fireflies. Ramdomely heading in all directions, none together but seemed to chase eachother in a playful manner, one would stop and another would catch up then both be just gone. The lights would blink like an aircraft for a moment, changed direcsion quickly then just be gone. Then another would just appear with the same bright orange light orange and a smaller whiter or amber light would fall below it, the smaller light would fall the disappear, the larger would diminish in briliance fly off slowly the take off at great speed and disappear. This happened very ramdomely like fireflies for about 8 minutes. I managed to somehow get a few on my crappy little video camera but not great. I called a friend that was about 1 hour west of us heading home (East of us), he said he watched them as well and thought from his point of view that they were over our town. I would place them between Bonesteel SD and Pickstown SD (Fort Randal Dam Power Plant). Quite an exciting show. I would like to send you the video but I need to download it and I would like you to view it and decide, it's not good and only about 2 minutes with a few seconds of what we noticed. Thank You"],"Weather Factors":"Unknown","Sighting Duration":"00:08:20","Case Number":"44187","Object Features":"None","Date Submitted":"11/27/2012 09:11 UTC","Country":"United States","Viewing Distance":"Over 1 Mile, Unknown","files":["/var/www/straped/mufon/html2text/44187.html.txt","/var/www/straped/mufon/org/44187.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.076386,+-98.944535(44187)&iwloc=A&hl=en\"> mufon case (44187) map </A>","trends":["There have been no other sightings in Bonesteel","This sighting has never been favorited."],"Latitude":"43.076386","Log Number":"US-11272012-0018","Object Flight Path":"Path with directional change,Path then hovering,Other,Unknown","Source":"MUFON","Region":"South Dakota","Longitude":"-98.944535","Disposition":"Unresolved"}