{"Country":"United States","Latitude":"36.407248","Weather Factors":"Windy","Object Flight Path":"Straight-line path","Source":"MUFON","Summary":"Intermittently reflective rotating object traveling east at a steady altitude and speed. No vapor trail or sound.","files":["/var/www/straped/mufon/html2text/4418.html.txt","/var/www/straped/mufon/org/4418.html"],"Region":"New Mexico","Date Submitted":"02/11/2006 01:40 UTC","Longitude":"-105.573066","Log Number":"US-02112006-0005","Object Shape":"Unknown","Disposition":"IFO","divs":["Sighting DetailsAs I was walking north on a neighborhood road at about 1:40 in the afternoon on my way to my office on Cruz Alta Road, I caught a shiny point of light in my periphery out to the west high over the mesa at approximately 45 degrees. The sharpness of the reflected light appeared and disappeared in fairly regular intervals, indicating that the object was either tilting or rotating. It left no vapor trail, as is common with all planes that pass through the area. It's angle in the sky appeared to increase at the same time that it's definition softened, until I couldn't see it anymore. It left the impression that it was moving higher and farther out west. Then, further along in my walk, I saw what appeared to be a jet in the same area that I saw the object. It was quite far west over the mesa, and left a short dark vapor trail. My first interpretation was that it was this I had seen, and not being able to see both objects at the same time (the other had faded), I was about to dismiss it. Then, further yet on my walk, the reflective object came back into view, and I could clearly see it was different from the object leaving the vapor trail. It was moving in an easterly direction on a course to cross my path perpendicularly, traveling very steady in speed and altitude with no sudden jerky movements. All the time, it pulsated regularly with light reflected from the sun, at approximately once per second. Eventually, it did come right over my path. People driving by could have easily verified it, but no one seemed curious as to what I was looking at and I was too wrapped in it to stop anyone. When it was near overhead, I tried to see what it was. Since it appeared to be moving in the same direction of the wind, I couldn't rule out a piece of trash that had been picked up. But if it was, it was the only such piece of trash in the entire clear blue cloudless sky, and it traveled in a very smooth controlled manner, except for the \"wobbling\". My best interpretation was that is was 50% reflective and rotating, so that with each revolution it would once again reflect the light of the sun. It may have been disc shaped, but the strong contrast between the reflective surface and the non-reflective \"black\" surface served to disrupt a sense of shape. The wind was not blowing steadily at ground level, yet the object moved along quite smoothly and slowly. Whatever it was doing (wobbling or rotating), it always appeared to be maintaining the same \"top to bottom\" orentation. In other words, at no point did it look like it was tumbling end over end, which is what I would have expected to see at times if it were merely a piece of trash at the mercy of the wind. It continued right along, traveling east and toward the Sangre De Christo's and \"flashing\" in the sun, and then began rising in altitude slowly as it made it's way over the range and out of sight. I must have watched it for a good 5 minutes or more from the time it had reappeared, and I have no definitive conclusions as to what it was."],"trends":["There have been 4 other sightings in Taos","There were no other sightings in Taos on or around February 11th 2006"],"Case Number":"4418","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.407248,+-105.573066(4418)&iwloc=A&hl=en\"> mufon case (4418) map </A>","Sighting Duration":"00:07:00","Object Features":"Unknown","Tags":"City","City":"Taos","Date of the Event":"02/11/2006 01:40 UTC"}