{"Object Features":"None","City":"Amherst","Weather Factors":"Unknown","trends":["There have been 2 other sightings in Amherst","There were no other sightings in Amherst on or around December 25th 2008"],"Sighting Duration":"00:45:00","Summary":"Large object in sky slowly travelling from west to east transforming its shape as it moved.","Log Number":"US-11272012-0011","Longitude":"-82.222377","Country":"United States","Date Submitted":"11/27/2012 04:53 UTC","Object Shape":"Diamond, Other","Tags":"City","Source":"MUFON","Date of the Event":"12/25/2008 12:20 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.397822,+-82.222377(44180)&iwloc=A&hl=en\"> mufon case (44180) map </A>","Latitude":"41.397822","Object Flight Path":"Straight-line path","Region":"Ohio","divs":["Sighting DetailsOn Christmas day my family and I were returning home from my mothers house at about 12:15 pm when I noticed the object above the tree line about 300 feet away. At first I thought it was a large black garbage bag blowing in the wind over the top of our car but as I got a better focus on it I thought it might be a large black helicopter because it farther away. As we got a longer look at it, it was clearly not a helicopter. The object was a dark gray or black non reflective color and would transform in shape from a diamond shape to an arrow shape (like the cursor arrow on a computer) It would change shape very slowly approximately every 30-40 seconds. We traveled east on Middle Ridge Rd. The object also traveled east appearing to be over the Ohio turnpike. As we drove down Middle Ridge there were many people out along the edge of the road or in their drive ways looking up at the object. This was a very strange sight seeing these other observers, very much like a scene from a movie. I decided to stop in a parking lot on Route 58 just north of the turnpike. We sat there for almost 20 minutes watching it slowly travel east very slowly. It slowly kept transforming the entire time that it floated eastward. My wife and I just sat there watching it not saying very much. We both had our camera phones and a digital camera and never even thought to take any pictures. This was very unusual for me because I used to be a professional photographer and get pictures of everything. It was a feeling of just being overwhelmed. We eventually headed north on Rt. 58 leaving the object behind us. About 6-8 miles north we could still see the object heading eastbound on the same path along the turnpike as we turned to travel east again. It's been almost 4 years since this has happened but I can still see it in my head as clearly as that day in 2008. We don't talk about it much (I don't know why?) that is another strange thing about this event. I haven't even told more than 2 or 3 people about this since. I am very curious to know if anyone else has ever reported seeing an object like this because I have never heard of anything in the local or national news reports or on any ufo related television shows."],"Case Number":"44180","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/44180.html.txt","/var/www/straped/mufon/org/44180.html"],"Disposition":"Unresolved"}