{"Object Features":"Unknown","Object Shape":"Diamond, Triangle","Weather Factors":"Unknown","Case Number":"44189","Disposition":"Unresolved","Date Submitted":"11/27/2012 09:22 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/44189.html.txt","/var/www/straped/mufon/org/44189.html"],"Log Number":"US-11272012-0020","Tags":"City","Date of the Event":"11/27/2012 08:57 UTC","Sighting Duration":"Undisclosed","Summary":"strange randomly flashing multi-colored lights on irregular flight path","Object Flight Path":"Path with directional change","Longitude":"-83.844573","Latitude":"43.067113","divs":["sighting detailsmy sister called and told me she had been outside with her dog and saw 4-5 very strange objects in the sky. she told me to go outside and look because whatever she saw was flying north . i went outside, and at first, i saw nothing but a very clear night sky. after about 1 minute, i saw the first object coming from the southeast......a very bright, multi color (red\\yellow\\green\\white) randomly flashing object (not like an airplane), which, at first, was flying on a more-or-less straight path, but then began \"veering off\" somewhat, then \"veering off\" to the other side, then resuming it's original path! my sister was still on the phone, and i told her i only saw one object..........but she said to wait a couple of minutes.......because she saw 4 or 5! approximately 1 minute later, another object appeared from the south, and apparently this object must have been lower to the ground, because i could make out the shape of a triangle while the lights were flashing (same colors as the 1st object!) i waited an additional 2-3 minutes, but did not see any more....and the first 2 objects disappeared into the western sky. it is a very clear night tonight with an almost full moon (tomorrow night)- so it was very clear to see!"],"Region":"Michigan","City":"Flushing","Viewing Distance":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=43.067113,+-83.844573(44189)&iwloc=A&hl=en\"> mufon case (44189) map </A>","trends":["There have been 17 other sightings in Flushing","There were no other sightings in Flushing on or around November 27th 2012"]}