{"Case Number":"44182","Source":"MUFON","Tags":"City","divs":["Sighting DetailsI had stepped outside to my car to run an errand about 8:15 p.m. Sunday, Nov. 25, 2012, when I noticed a red light to the SW of our house in Richmond, KY. The light caught my attention because it looked like it had spikes on it--or was sparkling with a weird intensity. In other words, the light had more than a normal \"twinkle\" to it. At first I thought it must be the running lights of an airplane, but there were no other navigation lights visible, and I heard no sound as the light drew closer to my house. It flew straight from SW to NE, passing nearly directly overhead. It seemed to be at some considerable height, partly because it was so quiet. I have a pair of 8x42 binoculars in my car, and I got those out quickly and trained them on the light. I assumed that the spikes would vanish when I brought the lenses into play, but they did not. I could not resolve an aircraft or any kind of body behind this light--just the reddish point itself. The spikes were slender, sparkler-like extensions from the central light. I cleaned my glasses, and blinked frequently to be sure it wasn't an issue with my eyes. The point seemed to be revolving slowly, because the spikes turned as the point passed overhead. I thought the light looked like one of the special effects from the old \"Star Trek\" television show--the effect used for photon torpedoes. Also, it looked a bit like the point of a laser pointer. The light moved quite rapidly across the sky, but not at any supernatural speed. We do have the Blue Grass Army Depot in the area, so it could have been related to military exercises of some kind--perhaps a targeting device on a high-flying plane. It was not a helicopter, however."],"Summary":"Red star-like (or sparkler-like) light passed silently over house heading NE..","Disposition":"Unresolved","Log Number":"US-11272012-0013","Object Shape":"Star-like","Region":"Kentucky","Latitude":"37.740412","Longitude":"-84.306407","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.740412,+-84.306407(44182)&iwloc=A&hl=en\"> mufon case (44182) map </A>","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/44182.html.txt","/var/www/straped/mufon/org/44182.html"],"Weather Factors":"Unknown","Viewing Distance":"Unknown","trends":["There have been 10 other sightings in Richmond","There were no other sightings in Richmond on or around November 25th 2012"],"City":"Richmond","Country":"United States","Object Features":"Unknown","Date Submitted":"11/27/2012 07:48 UTC","Date of the Event":"11/25/2012 08:15 UTC"}