{"Longitude":"-119.010672","Sighting Duration":"Undisclosed","Latitude":"35.378592","map":"<A HREF = \"http://maps.google.com/maps?q=35.378592,+-119.010672(44193)&iwloc=A&hl=en\"> mufon case (44193) map </A>","Disposition":"Unresolved","Object Flight Path":"Hovering then path,Straight-line path,Other","Tags":"City","Log Number":"US-11282012-0004","files":["/var/www/straped/mufon/html2text/44193.html.txt","/var/www/straped/mufon/org/44193.html"],"Region":"California","trends":["There have been 32 other sightings in Bakersfield","There were no other sightings in Bakersfield on or around June 6th 1990"],"divs":["Sighting DetailsDriving home from LA area on hwy 99 around 10pm I noticed a bunch of lights off in the distance on my right side hovering low possibly on the ground. These lights started to turn on their side, wierd because they were far and about the size of a football field. I then noticed a extremely bright white light on the left side of hwy 99 over train tracks I watched it stay in one place for a while. I kept looking for a pole to hold up the light, it was so high up and really bright I thought it odd, still no pole. Hmmm wierd, when I got where I was under it I pulled off the Hwy still no pole or any noise from it, by then other cars were beginning to stop and look. My boyfriend finally woke up to ask what I was doing, I pointed w\"what is that!?\" We watched and listened for a while, this light then began to change into many colors and quietly and slowly moved away south until it just went dark. I then started to drive north again watching the sky for anything else strange, It wasn't long three more objects flew faster than anything we have up there in front of us one after eachother like they were chasing one another they were all bright white in color. I have to this day never eye witness anything remotely close to what I saw that night. I have seen similar accounts on tv of what other people describe. This still bothers me I can't explain what I saw. Any information you may have on this matter would be appreciated to help me put this to rest. Thank you B. Larson"],"Source":"MUFON","Object Shape":"Bullet, Missile, Circle, Cylinder, Flash, Star-like, Other","Date Submitted":"11/28/2012 02:40 UTC","Object Features":"Patterned Surface","Country":"United States","Weather Factors":"Unknown","Date of the Event":"06/06/1990 12:00 UTC","Summary":"1st object looked to be on the ground then to looked to lifting then turning on its side many lights. 2nd object bright white light hovved then changed colors hovered then took off slowly and without sound. 3rd, 4th, 5th objest flying rapidly after eachot","Viewing Distance":"21-100 Feet, Over 1 Mile","Case Number":"44193","City":"Bakersfield"}