{"Log Number":"US-11282012-0007","Summary":"Saw two triangular craft flying very slowly from South to North. Orange lights, no sound","Region":"Texas","files":["/var/www/straped/mufon/html2text/44197.html.txt","/var/www/straped/mufon/org/44197.html"],"Sighting Duration":"Undisclosed","Object Features":"Unknown","Source":"MUFON","Weather Factors":"Unknown","Case Number":"44197","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=32.898006,+-96.669365(44197)&iwloc=A&hl=en\"> mufon case (44197) map </A>","divs":["Sighting DetailsWhen I arrived at work this morning I noticed some strange lights tracking very slowly from south to north. They flew almost directly overhead at probably 5000-10,000 feet. There appeared to be two distinct sets of three lights flying a hundred or so feet apart in formation. The objects appeared to be triangular with orange lights at the corners that twinkled slightly but didn't blink. The two craft were moving very slowly, definitely flying under 50mph. I was parked and out of my truck and could hear absolutely no sound what so ever. We have a heliport about a mile away from us so I see helicopters taking off regularly and I can assure you that these were no helicopters. I thought it was over and was so amazed by it I didn't record anything but within a minute I saw two more of what appeared to be identical craft trailing one another tracking east west probably a mile or so away from me. I got a video of one of them but my phone doesn't do so well in the dark. After reviewing the video to my surprise one of the craft can be seen although not clearly. In my haste I shot the video upside down. These were the most amazing things I've ever seen in the sky!"],"Disposition":"Unresolved","Date of the Event":"11/28/2012 06:05 UTC","Country":"United States","Longitude":"-96.669365","Date Submitted":"11/28/2012 12:30 UTC","Object Shape":"Triangle","City":"Garland","Latitude":"32.898006","Tags":"City","trends":["There have been 19 other sightings in Garland","There were no other sightings in Garland on or around November 28th 2012"]}