{"Sighting Duration":"Undisclosed","Date Submitted":"06/30/1976 11:30 UTC","Weather Factors":"None","Log Number":"US-02112006-0006","Object Features":"Unknown","divs":["Sighting DetailsI was with a friend, sleeping on the beach (Black's Beach). He had gone to sleep in his sleeping bag but I had stayed up to look at the stars. We were both eighteen yrs. old at the time. I was in the habit of looking for passing satellites because I liked to watch them. On this night I saw what at first appeared to be a satellite, but then, as it moved, it began changing directions and zig-zagging about in the sky. I woke my friend up because I had the feeling this was a UFO. He watched it with me as it did these high speed maneuvers. Then the object began to descend and grow larger. Soon it was sitting above the ocean right at the horizon and it was very bright. As comparison, about twice as bright as the brightest star in the night sky. It just sat there for several minutes above the water and then it began to ascend again. Soon it was a tiny spec of light again and then it disappeared, I assume becuase of its distance from earth. I remember this well some thirty years later because it had a big impact on me at the time. My friend and I both felt we had seen a UFO."],"Viewing Distance":"Over One Mile","Longitude":"-117.152905","Object Shape":"Star-like","Country":"United States","Latitude":"32.718959","files":["/var/www/straped/mufon/html2text/4419.html.txt","/var/www/straped/mufon/org/4419.html"],"City":"San Diego","Summary":"This object went from faint star-like to large ball of light, always white.","Disposition":"Unresolved","Case Number":"4419","map":"<A HREF = \"http://maps.google.com/maps?q=32.718959,+-117.152905(4419)&iwloc=A&hl=en\"> mufon case (4419) map </A>","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around June 30th 1976"],"Source":"MUFON","Region":"California","Tags":"City","Object Flight Path":"Path with directional change,Path then hovering","Date of the Event":"06/30/1976 11:30 UTC"}