{"Object Flight Path":"Stationary,Path with directional change","trends":["There have been no other sightings in Dinuba","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Object Features":"Window(s)","Latitude":"36.487474","map":"<A HREF = \"http://maps.google.com/maps?q=36.487474,+-119.357488(44191)&iwloc=A&hl=en\"> mufon case (44191) map </A>","Longitude":"-119.357488","files":["/var/www/straped/mufon/html2text/44191.html.txt","/var/www/straped/mufon/org/44191.html"],"Disposition":"Unresolved","Case Number":"44191","Viewing Distance":"Unknown","Date of the Event":"07/15/1962 12:00 UTC","Weather Factors":"Unknown","Date Submitted":"11/28/2012 01:19 UTC","Tags":"City","Summary":"light came on in spaceship, like turning light inside house at night then witnessed 2 human shaped entities look like EASTER ISLAND STONE figures","Region":"California","City":"Dinuba","Source":"MUFON","Log Number":"US-11282012-0002","Object Shape":"Cigar","divs":["Sighting DetailsMy family and I lived just outside the small city of DINUBA, CA located in TULARE COUNTY. One evening approx.8:00 pm after dinner in the summer of 1962 I went outside thru the kitchen door to ly down on the grass between two cypress trees which were about 30 feet apart and 20 feet tall to gaze at the night sky filled with stars, I was gazing no more then 5 minutes (when I noticed a light turn on in the night sky; :for example like turning on your house inside lights after coming home at night: AFTER THE LIGHT CAME ON I SAW THE INTERIOR OF THE UNDENTIFIED FLYING OBJECT (AND 2 ENTITIES THAT LOOKED LIKE THE HEAD STONES ON EASTER ISLAND) THE ENTITES WERE STANDING ONE BEHIND THE OTHER. THE ENTITIES SEEMED TO BE MOVING THEIR HANDS OVER TABLE LIKE CONSOLES, THE CONSOLES SEEMED TO BE ABOUT WAIST HIGH TO THEM. ABOUT 30 SECONDS WENT BY WHEN THE ENTITY THAT WAS BEHIND THE OTHER STOPPED WORKING ON IT'S CONSOLE AND STARTED WALKING TO THE LEFT OF THE CONSOLE THEN TURNED RIGHT WALKING TO THE ENTITY THAT WAS TO THE FRONT ALSO WORKING ON IT'S CONSOLE, IT TOOK THE ENTITY APPROX 10 SECONDS TO REACH THE OTHER ENTITY. THE ENTITY THAT WALKED OVER STARTED JESTERING ARM AND HEAD MOVEMENTS, THE ENTITY AT THE FRONT CONSOLE WAS JESTERING WITH HEAD MOVEMENTS TURNING IT'S HEAD TO THE OTHER ENTITY THEN BACK TO THE CONSOLE, LIKE THEY WERE HAVING A CONVERSATION THAT APPROX LASTED ABOUT 40 SECONDS, THEN THE VISITING ENTITY RETURNED TO IT'S CONSOLE AND STARTED WORKING ON IT FOR ABOUT 30 SECONDS. (ALL THIS TIME THAT I WAS EXPERIENCING WHAT WAS TAKING PLACE WATCHING EVERY MOVE THEY MADE, I WAS YELLING AT THE TOP OF MY LUNGS (WITHOUT TAKING MY EYES OFF WHAT WAS HAPPENING); FOR ANY MEMBER OF MY FAMILY TO COME SEE WHAT I WAS WITNESSING, ALL THIS TIME THE INTERIOR LIGHT REMAINED ON AND THEN ABOUT 10 SECONDS LATER THE UFO STREAKED IN A ZIG-ZAG PATTERN AND WAS GONE IN LESS THEN A SECOND. (THIS 2 BEINGS WALKED AND MOVED THEIR LIMBS LIKE WE DO; THEY WERE OF DARK COLOR, BROAD SHOULDERS BUT THIN NECK AND ARMS, LEGS; I VISIT THE LOCATION ONCE A MONTH AND TO DATE I FEEL UNEASY WITH THE TEACHINGS WE HAVE RECEIVED ABOUT RELIGION, SCIENCE AND KNOWING!!! THAT WE ARE NOT ALONE ON THIS EARTH AND THE ONLY SO CALLED INTELLIGENT BEINGS IN OUR UNIVERSE OR ANY OTHER UNIVERSE."],"Country":"United States"}