{"Country":"United States","Summary":"6 or 8 lights hanging in the sky orange and glowing in a weird. Formation hung there for a few minutes then they disapeared","Log Number":"US-11282012-0018","Tags":"City","Date Submitted":"11/28/2012 08:11 UTC","Source":"MUFON","City":"St Augustine","Date of the Event":"03/19/2012 09:22 UTC","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Disposition":"Unresolved","Object Shape":"Fireball, Star-like","Case Number":"44208","Object Flight Path":"Stationary","Region":"Florida","Latitude":"29.902054","trends":["There have been 18 other sightings in St Augustine","There were no other sightings in St Augustine on or around March 19th 2012"],"divs":["Sighting DetailsLeaving moms house in a car heading north my wife said tO. Me omg do u see that when I looked I saw 6-8 hanging lights in the sky just sitting there I instantly got a terrible feeling in the pit of my stomach it was so eirie like nothing I've ever seen before when drove to a spot where we could get a better view and they were still there like a constellation very close to us just sitting there they started drifting around a little then all of a sudden. They were gone we knew we saw something amazing it was actually pretty frieghtening after that we did some research online to see if anyone else saw it and didn't find anything or hear of anything from that night but we did find video of floating orbs near homestead Florida that looked exactly like. It .... I've seen shooting stars and lots of air raft living in Florida with all the military bases nearby and we have also watched the space shuttle launches at night and seen blimps at night but this was totally different and instantly gave u that feeling in the pit of your stomach when u know something is not right and u should fear for your life"],"map":"<A HREF = \"http://maps.google.com/maps?q=29.902054,+-81.306588(44208)&iwloc=A&hl=en\"> mufon case (44208) map </A>","Viewing Distance":"Over One Mile","Longitude":"-81.306588","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/44208.html.txt","/var/www/straped/mufon/org/44208.html"]}