{"divs":["Sighting DetailsWhile driving home from work in the Northwest part of Philadelphia I noticed a jet stream that was shorter than most while looking up at the sun setting sky- a usual activity on my part (I appreciate the beautiful things in life). Also it was arrowed in a vertical direction with the aircraft desending, like a letter \"V\". It was not descending though but hovering and in my direct line of sight while I was driving. Accompanying it was a flat gunmetal gray orb. I did not keep and eye on that because it was harder to view as it was on my right and the jet streamed orbs were much more brilliant. I then noticed 2 more of the same type aircrafts in the same direction. The jet stream color was a bright white with a glow, the aircraft was a white orb. I phoned my Fiance' who was home a few miles from the road I was traveling. He began to look from a stationary position and also questioned what he was viewing. He is usually a skeptic and could not find any explaination of what he was seeing. By the time I got home I rushed from my car and to the second floor of our house. I could see the objects moving into the distance over the horizon. They began to disappear and we eventually lost sight. Then we seen a gray streak appear that seemed to be rotating where the jet streamed orb was. It was a flat gray and on a 120 degree axis. We watched this for about 5 minutes or so before it faded away."],"Summary":"While driving home from work seen 3 orbs with jet streams shaped like a letter V with the orb seeming falling toward earth but it wasn't it was hovering. there was also a gray orb without streams hovering. The stream orbs faded into a slate gray.","Longitude":"-77.185725","Case Number":"44207","City":"Undisclosed","Object Shape":"Bullet, Missile, Chevron, Fireball, Oval, Teardrop","Date of the Event":"11/28/2012 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.210222,+-77.185725(44207)&iwloc=A&hl=en\"> mufon case (44207) map </A>","Date Submitted":"11/28/2012 08:05 UTC","Disposition":"Unresolved","trends":[],"Region":"Pennsylvania","Source":"MUFON","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/44207.html.txt","/var/www/straped/mufon/org/44207.html"],"Latitude":"41.210222","Viewing Distance":"Over One Mile","Country":"United States","Object Features":"Dome, Other","Weather Factors":"Unknown","Tags":"City","Log Number":"US-11282012-0017"}