{"Weather Factors":"Unknown","trends":["There have been 3 other sightings in Monroe","There were no other sightings in Monroe on or around November 28th 2012"],"Object Flight Path":"Path with directional change","Summary":"strange triangle ufo flying towards airport then away from it abruptly","Tags":"City","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","divs":["Sighting DetailsI live near a small municipal airport and im used to seeing low flying planes and have learned pretty much how to figure out the model of airplane. But at around 1930 on tuesday night i pulled up to a intersection and witnessed a what appeared to be a plane flying very low, by the way it was a rainy night with very low cloud cover, it was a triangular shaped object with a white light on the back end and a dim greenish blue light in the middle. When i saw it i figured that it was a plane on approach but as i watched it it seemed flying too fast for a safe landing. When i saw the green light i thought it was a landing light and i waited for a blinking strobe which is a requirment for all airplanes but witnessed none. i brought it to the attention of my grandmother in the passanger seat and as the time she looked up and saw it it accelerated hard right and went behind a house. I stepped on the pedal to get to the top of a hill and see it agian but it was gone. I am very used to seeing low flying planes and helis but this was unlike i have ever seen."],"Latitude":"34.988918","Date of the Event":"11/28/2012 07:00 UTC","Case Number":"44200","Object Shape":"Triangle","Region":"North Carolina","Log Number":"US-11282012-0010","City":"Monroe","Date Submitted":"11/28/2012 04:22 UTC","Source":"MUFON","Longitude":"-80.545011","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/44200.html.txt","/var/www/straped/mufon/org/44200.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.988918,+-80.545011(44200)&iwloc=A&hl=en\"> mufon case (44200) map </A>","Country":"United States"}