{"divs":["sighting detailsi stepped out to smoke and notice several planes in the sky. i watched them for a few and directly beside one of the planes was a large very bright ball of light. the plane appeared to be descending in the sky and this ball remained by it's side until they disappeared behind the tree line. the plane left a contrail, this ufo did not. while the first plane and ufo were in my direct line of sight, a second plane was heading in their direction. the two planes crossed contrails closer than any two planes i have ever seen. i told my friend it looks like they're going to hit and he agreed. my friend went next door to tell the neighbor to come and check it out. planes, which did not look like passenger planes, came from several different directions in the sky and all headed in the exact direction where the ufo and first plane were headed. unfortunately, they all headed behind the trees and out of my view, but within 10 minutes or so i heard helicopters nearby also. i could only describe the ball as a very bright large round oval\\circle shape which remained very close to this first plane. ive never seen anything like it."],"Tags":"City","Country":"United States","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/44203.html.txt","/var/www/straped/mufon/org/44203.html"],"City":"Clarksville","Date Submitted":"11/28/2012 06:23 UTC","Date of the Event":"11/28/2012 04:35 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.539903,+-87.353622(44203)&iwloc=A&hl=en\"> mufon case (44203) map </A>","Viewing Distance":"Unknown","Case Number":"44203","Summary":"Weird Glowing ball of light moving with airplane","Log Number":"US-11282012-0013","Object Flight Path":"Hovering then path","Object Shape":"Circle, Oval","Region":"Tennessee","Longitude":"-87.353622","Latitude":"36.539903","Sighting Duration":"00:08:00","Source":"MUFON","Weather Factors":"Unknown","trends":["There have been 12 other sightings in Clarksville","There were no other sightings in Clarksville on or around November 28th 2012"],"Disposition":"Unresolved"}