{"Case Number":"44205","Log Number":"US-11282012-0015","Longitude":"-84.100774","Date of the Event":"11/24/2012 12:00 UTC","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=35.922815,+-84.100774(44205)&iwloc=A&hl=en\"> mufon case (44205) map </A>","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","trends":["There have been 50 other sightings in Knoxville","There were no other sightings in Knoxville on or around November 24th 2012","This sighting has been favorited 2 times.",""],"City":"Knoxville","Sighting Duration":"Undisclosed","Object Features":"None","divs":["Sighting DetailsAround 6pm on November 24, 2012 while driving south on Mabry Hood Rd in Knoxville near the intersection of Kingston Pike and Pellissippi Pkwy I saw approximately five orange lights in the sky in triangle formation. Four lights were in a line and one light that made the point of the triangle. These lights appeared to be hovering at a low altitude. There did not appear to be any mass between the lights. I pulled over at the Chili's parking lot to take a video with my iPod Touch, but I lost sight of the lights. Then I saw one of the lights again to the east, and then eventually two more which made another triangle. Two of the lights gradually disappeared, but the last one remained and appeared to glow more brightly. I did see other planes in the distance in the same direction as the lights, but those were obviously planes because they were moving at a constant rate and had blinking lights. I thought that the planes may have been dropping some sort of flares, or these were flares on balloons. I stopped my recording because the light was just stationary, but when I looked for the light again after it was gone."],"Latitude":"35.922815","Object Flight Path":"Hovering then path","Region":"Tennessee","Summary":"Orange lights in traingle formation","Date Submitted":"11/28/2012 07:17 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/44205.html.txt","/var/www/straped/mufon/org/44205.html"],"Weather Factors":"Unknown","Object Shape":"Triangle"}