{"Source":"MUFON","trends":["There have been 12 other sightings in Auburn","There were no other sightings in Auburn on or around November 27th 2012"],"Date Submitted":"11/28/2012 11:47 UTC","Object Features":"None","files":["/var/www/straped/mufon/html2text/44215.html.txt","/var/www/straped/mufon/org/44215.html"],"Longitude":"-122.223073","Country":"United States","Disposition":"Unresolved","Latitude":"47.315603","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=47.315603,+-122.223073(44215)&iwloc=A&hl=en\"> mufon case (44215) map </A>","Case Number":"44215","City":"Auburn","Weather Factors":"Unknown","Object Shape":"Flash, Triangle, Other","Viewing Distance":"501 Feet - 1 Mile","Region":"Washington","Date of the Event":"11/27/2012 06:50 UTC","Object Flight Path":"Hovering then path,Path with directional change","divs":["sighting detailslast night, on the 27th of november, 2012, my adult son called me outside to our backyard, telling me i had to see the weird lights in the sky. i hurried out, looking to the east\\ slightly south with two grandchildren, aged 10 and 9. we all saw three red lights in a line at first. i would guess that the object was quarter of a mile at most away and very low to the treeline far past our neighbor's rooftop. we have standard, rambler style homes, and this 'craft', at that distance, was at least half the length of their house. it appeared to be moving about 45 degrees off the horizon (can't see the horizon due to trees in the area, so this is a guess) and coasted smooth and silent, no jerky movements. also, there were shimmerings of red lights that would appear along the 'edge' that faced me, though these were hard to see. the lights pulsed repeatedly, but they looked nothing like anti-collison lights on the aircaft we have seen thousands of times in our area. within a minute or two, the lights took on a triangular shape that was huge. it seemed to pivot, and turn while slowly lifting the front edge as if it was a single large craft, or if it were several flying in unison, the back ones lifted up. at any rate, the entire group of lights slipped to the south east and apparently down into the auburn valley area. i attempted to record the sighting, but since it was dark, the video from my cellphone doesn't show much. in between the very excited yelling of myself and the elder grandchild, there is a noticable silence. any aircraft that we have seen would have shaken the house at such a low altitude and proximity. there is also a report on the mufon site that almost exactly mirrors ours, case # 44199 from kent that happened two hous after ours and to the north and east of us. my son submitted his report last night after we saw it, and the mufon site had not yet been contacted by the people in kent that also saw it. it helps to know someone else witnessed this interesting sighting."],"Log Number":"US-11282012-0025","Sighting Duration":"Undisclosed","Summary":"Three red lights in a line form huge triangle over Auburn/Federal Way"}