{"Viewing Distance":"501 Feet - 1 Mile, Unknown","Object Shape":"Circle","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.076909,+-83.019682(44214)&iwloc=A&hl=en\"> mufon case (44214) map </A>","divs":["Sighting DetailsI had been in meditation for six hours on Sunday, May 5, 2012. I went outside to sit by my garden to watch the sun set. I need proof of things and do not like to take the stories of UFO phenomenon at face value. I need to see to believe. I'm a show-me kind of girl. I had been trying my hand at telepathic communication with my star family in my meditation for several hours to no avail. Having given up I went outside to sit by my garden and watch the sun set. I looked directly above me and noticed three toroidal distortions as energy patterns in the twilight sky. I had read about the ability among some UFO's to cloak by bending light around themselves. I spoke directly to the largest and closest one. I spoke to it for 10 minutes explaining that I needed to see it to believe it. Exasperated, I finally said I did not wish to be eaten alive by mosquitoes and started to get up to go inside. In a flash of bright white light it decloaked for just a second so I could see it. It lit up the whole sky. It must have been relatively close at 500 feet or more. I said to it, \"OK, I believe you.\""],"Object Features":"None","Date of the Event":"05/05/2012 09:10 UTC","Summary":"3 toroidal stationary energy patterns observed, made telepathic communication, challenged it to decloak. One did for a split second with a bright white flash as I asked it to prove it was there.","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Source":"MUFON","Country":"United States","Latitude":"40.076909","Longitude":"-83.019682","Log Number":"US-11282012-0024","Case Number":"44214","trends":["There have been 2 other sightings in Worthington","There were no other sightings in Worthington on or around May 5th 2012"],"files":["/var/www/straped/mufon/html2text/44214.html.txt","/var/www/straped/mufon/org/44214.html"],"City":"Worthington","Object Flight Path":"Stationary","Date Submitted":"11/28/2012 11:17 UTC","Region":"Ohio","Tags":"City"}