{"Tags":"City","Date of the Event":"02/26/2012 10:00 UTC","Region":"New Mexico","Object Shape":"Fireball, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=35.88218,+-106.28759(44221)&iwloc=A&hl=en\"> mufon case (44221) map </A>","Latitude":"35.88218","Object Flight Path":"Straight-line path","Country":"United States","City":"Los Alamos","Case Number":"44221","files":["/var/www/straped/mufon/html2text/44221.html.txt","/var/www/straped/mufon/org/44221.html"],"Longitude":"-106.28759","Summary":"Huge, green fireball headed toward Los Alamos, N.M.","Weather Factors":"Unknown","Date Submitted":"11/29/2012 12:02 UTC","Viewing Distance":"Unknown","Object Features":"None","Disposition":"Unresolved","Source":"MUFON","trends":["There have been 6 other sightings in Los Alamos","There were no other sightings in Los Alamos on or around February 26th 2012"],"Log Number":"US-11292012-0005","Sighting Duration":"00:00:04","divs":["Sighting DetailsI had only been living in New Mexico for only 4 months. My wife found a job in Los Alamos and we moved from Illinois where we have lived our entire lives. We moved to the northern most point of Santa Fe county. At approximately 9:45 p.m. during late February, I decided to go out to the backyard for a cigarette. I had just lit my cigarette when I caught a glowing green object out of the corner of my right eye. It turned out to be this HUGE, glowing green fireball streaking across the sky. It lit up the night sky. The green was very odd...bright green. I was watching TV one night, after seeing UFO, and saw a trailer for I think the Green Lantern. That bright green in the trailer reminded me of tHe color of the UFO. The fireball was descending and after a few seconds disappeared behind my neighbor's tree line. It flew over the foothills of a mountainous range, right behind our property. I was shocked at what I witnessed. I know a meteor this low in the atmosphere would not still be burning brightly. I searched the Internet the next day for meteors in the area. I asked a couple of my neighbors if they witnessed the event, but both said no."]}