{"Tags":"City","Case Number":"44231","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.730866,+-71.205268(44231)&iwloc=A&hl=en\"> mufon case (44231) map </A>","Date of the Event":"11/29/2012 07:17 UTC","Longitude":"-71.205268","Log Number":"GB-11292012-0015","Date Submitted":"11/29/2012 06:18 UTC","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Region":"Massachusetts","trends":["There has been one other sighting in Swansea","There were no other sightings in Swansea on or around November 29th 2012"],"Country":"United States","City":"Swansea","divs":["sighting detailsit's a fresh chilled night with a full moon i'm wrapped up well ready to take the dogs out, usual walk up through the estate to the middle field, 2 dogs one on a lead and one running about, i got onto the middle field it's quiet (no streets light where i live) a beautiful fresh night not a cloud in the sky and the frost is glistening in the moonlight. at this point i look up in the sky (i'm always looking for sat-alights or bright stars), a very bright \"star\" caught my eye from where i was standing it was at my south east (i have a compass on my phone and i used it after the event) it was coming in towards me in the distance, in a slow slight cork screw pattern it just kept getting bigger and bigger a bright orange\\red\\gold with a bleared edge, it just kept coming in towards me then stopped, stayed still for a min or two then sped off away to the south getting smaller very quickly, so it looked like it changed direction of about 45degrees. while i was watching this event i rang my neighbour and told him to come out of his house and look up into the s.e. he did, and saw it disappearing from different locations 2 or 300 meters away from each other. ,"],"Object Shape":"Circle, Fireball, Star-like","Object Features":"Unknown","Latitude":"41.730866","Weather Factors":"Unknown","Summary":"walking the dogs, a full moon, frosty, visability good, saterlight was moving fast in the sky but following it it picked up speed got bigger then stopped then sped away to the south getting small very quick","files":["/var/www/straped/mufon/html2text/44231.html.txt","/var/www/straped/mufon/org/44231.html"],"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Disposition":"Unresolved"}