{"Object Flight Path":"Straight-line path","Object Features":"None","Object Shape":"Sphere","divs":["Sighting DetailsI was sitting outside at about 9:30 P.M. It was a clear and warm evening. I was visiting with two friends. Two of us looked up and saw this object moving across the sky, from west to east. We quickly pointed it out to the third person with us. The object was a white sphere. There were no visible lights and no sound, that we could hear. It appeared the lights from the city where reflecting off of it. In this part of the country there is a lot of commercial air craft flying to the west or to the east. These commercial aircraft have red, green and white lights that are visible from the ground and you can always hear them fly over. This obeject was different. It was moving east, as a lot of aircraft do,but, no sound or lights were detected. Also, it appeared maybe to be moving ( I guess ) at about half the height of these commercial aircraft. We viewed this object when it was directly over head and watched it for about 30 or more seconds until we could no longer see it. I guess it flew past our town so the city lights no longer shown upon it. ( The same thing happens when geese migrate over in the fall and spring. You can see them as long as there is light reflecting off of them.) The people I was with along as myself stated that it was \"Cool!\" for lack of better words. I am not saying I saw a space craft, but I know what it was not, It was not an aircraft, meteor, planet, star, or flock of birds. There are no bright stars nor are there any planets in that part of the sky, that I know of. Well, not that move like that. When I first saw the object I thought it was a latex ballon. But the longer I looked at it the sooner I gave that idea up. The two people I was visiting with that night still talk about this event whenever we are together. After the sighting we talk about for some time, and still do. I am not a pilot, but I know all planes or blimps have a green light on one wing and a red light on the other wing along with a white light on the back, sometimes on the wings too. I saw no wings nor lights."],"City":"Sioux City","Summary":"White sphere, no lights visible, moving west to east,","Date of the Event":"10/15/2005 09:30 UTC","Disposition":"Unknown","Country":"United States","Tags":"City","files":["/var/www/straped/mufon/html2text/4423.html.txt","/var/www/straped/mufon/org/4423.html"],"Region":"Iowa","Date Submitted":"10/15/2005 09:30 UTC","trends":["There have been 12 other sightings in Sioux City","There were no other sightings in Sioux City on or around October 15th 2005"],"Latitude":"42.501014","Longitude":"-96.392927","map":"<A HREF = \"http://maps.google.com/maps?q=42.501014,+-96.392927(4423)&iwloc=A&hl=en\"> mufon case (4423) map </A>","Log Number":"US-02122006-0004","Weather Factors":"None","Sighting Duration":"Undisclosed","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Case Number":"4423"}