{"Weather Factors":"Unknown","City":"Perkasie","Date of the Event":"11/29/2012 05:30 UTC","Tags":"City","divs":["Sighting DetailsAround 5.30 PM I was looking out of my kitchen window and saw an object in the sky coming from the west toward my house. At first I thought it was a large bird but as the object got closer I could see it was a black rectangle wobbling kind of end over end. I called my son and we both went out on our deck to look at the object. We only saw it for a couple of minutes then it was out of site heading east. the object was a black rectangle i could not see any lights or windows.I looked on the internet to see if I could cross reference the object that we saw and I found UFO Over Bolton Lancashire UK At 11am On The 31st August 2012. when I looked at the picture and the video I was happy to see that this object looked and behaved exactly like the object that we saw.The shape the color the height and the wobbling motion was the same. This is the first time I ever report a UFO.I am wondering If anybody else saw the the object.The sky was blue with clouds and it disappeared into a cloud then reappeared. The object made no noise.The siteting made me feel good but my son was scared and did not want to talk about it.I showed my son the video but he is only 11 years old.He just says it was something he has never seen before and he does want the aliens to hurt him"],"Source":"MUFON","Summary":"{nd} around 5.30 pm est I observed an object out of my kitchen window that I thought to be a bird but as it got closer i relized it was a solid black objectobject","Sighting Duration":"Undisclosed","Region":"Pennsylvania","Log Number":"US-11292012-0027","Date Submitted":"11/29/2012 10:44 UTC","Case Number":"44243","Latitude":"40.353793","Object Flight Path":"Straight-line path,N/A","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=40.353793,+-75.284463(44243)&iwloc=A&hl=en\"> mufon case (44243) map </A>","trends":["There have been 5 other sightings in Perkasie","There were no other sightings in Perkasie on or around November 29th 2012"],"Longitude":"-75.284463","Object Features":"Other","Object Shape":"Square, Rectagular","Country":"United States","files":["/var/www/straped/mufon/html2text/44243.html.txt","/var/www/straped/mufon/org/44243.html"],"Viewing Distance":"501 Feet - 1 Mile"}