{"Longitude":"-75.601184","Sighting Duration":"Undisclosed","Object Features":"Unknown","Tags":"City","Weather Factors":"Unknown","Source":"MUFON","Object Shape":"Triangle","Latitude":"40.549681","files":["/var/www/straped/mufon/html2text/44240.html.txt","/var/www/straped/mufon/org/44240.html"],"City":"Trexlertown","Viewing Distance":"Unknown","Case Number":"44240","Date Submitted":"11/29/2012 09:46 UTC","Country":"United States","divs":["Sighting DetailsI was driving on Route 222-N to attend a meeting in Allentown. I am a stargazer, so I was enjoying the clear sky and the full moon was very bright. A lot of the constellations and planets (Jupiter) were very easily noticeable tonight as it is extremely clear, and the moon is casting light everywhere. As I was at a red light near the Trexlertown Shopping Plaza, I noticed a glowing triangle shape going across the sky right below the moon in a W->E direction. What made me notice this is because I have never seen a triangular shaped object like this before. I actually stopped my car and pulled over because I could not keep my eyes on the road and didnt want to get in an accident. I watched it as it traveled, trying to rule out airplanes or helicopters which were seen in my neighborhood and on the drive there. It was nothing I have ever seen before. My husband and I sit out on our porch every night and watch the sky when the weather allows us. This was a large triangular shaped object. It almost looked like the glowing yellow lights on it were spaced evenly throughout the triangle edge. I lost sight of the object because it dissipated and disappeared into the East. I have not stopped thinking about it since I witnessed it at approx. 6:36pm and it is now 9:43pm. Again, I have never seen an object like this is my life. I wish I could have taken a picture but I did not have enough time and I only had my cell phone camera, which doesnt work well with distances."],"Date of the Event":"11/29/2012 06:36 UTC","Disposition":"Unresolved","Region":"Pennsylvania","Summary":"saw glowing triangle shape travel across sky right below full moon and then disappear","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=40.549681,+-75.601184(44240)&iwloc=A&hl=en\"> mufon case (44240) map </A>","Log Number":"US-11292012-0024","trends":["There have been no other sightings in Trexlertown","This sighting has never been favorited."]}