{"Summary":"3-lights in a small group appeared in sky on way home from work.","divs":["Sighting DetailsMy son and I were driving home from work on north 63 just outside of Bono Arkansas and observed a bright light suddenly appear in the Sky over Walnut Ridge Arkansas. As it appeared, about 200 fee below it another bright light appeared, and then above this light and to the left another light appeared. Then the first light blinked out, and then seconds later the second light blinked out and seconds later the third blinked out. About 3 to 5 minutes later as we were getting closer to Walnut Ridge Arkansas we observed the 2 lower lights blink on again. First one then the other, just like they did before. After about 1 minute they blinked off again. After a couple minutes went by and they appeared again, First one, then the other and about 15 to 20 seconds later they blinked out again. This time I told my son to pull over on the side of the highway and see if he could use the camera on his phone to get a picture. The lights didn't appear again. The lights appeared just like the ones in Arizona, except the first light appeared above the others and after the lower ones appeared, the first light blinked out."],"Source":"MUFON","Disposition":"Unresolved","trends":["There have been 5 other sightings in Black Rock","There were no other sightings in Black Rock on or around November 27th 2012"],"Case Number":"44244","Date of the Event":"11/27/2012 07:15 UTC","Longitude":"-91.176755","files":["/var/www/straped/mufon/html2text/44244.html.txt","/var/www/straped/mufon/org/44244.html"],"Object Features":"Unknown","Date Submitted":"11/29/2012 11:04 UTC","Country":"United States","Object Shape":"Circle","Viewing Distance":"Over One Mile","Object Flight Path":"Stationary","Tags":"City","Region":"Arkansas","Latitude":"36.133245","Log Number":"US-11292012-0028","City":"Black Rock","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.133245,+-91.176755(44244)&iwloc=A&hl=en\"> mufon case (44244) map </A>","Weather Factors":"Unknown"}