{"map":"<A HREF = \"http://maps.google.com/maps?q=34.988211,+-79.58227(44254)&iwloc=A&hl=en\"> mufon case (44254) map </A>","Object Features":"Other","Object Shape":"Triangle","trends":["There have been no other sightings in marston nc","This sighting has never been favorited."],"Object Flight Path":"Straight-line path","Summary":"very large slow moving absolutely silent","Region":"North Carolina","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","City":"marston nc","Sighting Duration":"Undisclosed","Case Number":"44254","Latitude":"34.988211","Source":"MUFON","files":["/var/www/straped/mufon/html2text/44254.html.txt","/var/www/straped/mufon/org/44254.html"],"Date Submitted":"11/30/2012 11:04 UTC","Tags":"City","Weather Factors":"Unknown","divs":["Sighting Detailsi was driving north along U.S. highway 1 , just north of Rockingham Dragway. It was completely dark, with no moon apparent. The skies were not bright but all manner of stars were visable. I looked up at the sky and a group of stars seemed to just disappear. As I was driving, I could not quite tell what I was seeing so I pulled off the road into the parking lot of a gasoline station at the intersection of US1 and NC Highway 177. I stopped my vehicle and turned off my lights and engine. I stepped out of my truck and could see a black triangular shapped craft moving slowly to the northeast. It was nearly invisible as no lights or anything else was visable. It was easier to track by watching stars become invisible...and then reappear as the craft passed by. Judging size with any accuracy was not possible...but it appeared tremendously large...large enough that I felt it impossible that anything that large could fly. I watched it for a couple of minutes...as cars came by on the highway their headlights made it difficult to track. I restarted my vehicle and continued north. I stopped again in the vacinity of Hoffman N.C., approximately 5 miles farther north...I was able to watch it again for a couple of more minutes until it seemed to be in the vacinity of Camp Mackall, a U.S. Army training facility associated with Ft. Bragg. There is a large rotating beacon there..I guess for the airfield there and I couldnt see the object any more after it got in the vacinity of it. I love aviation...and I can identify nearly every type of aircraft I see, but this was unlike anything I had ever seen. I was not afraid, but I was quite unnerved by what I saw. I would truly love to know what I saw that night."],"Log Number":"US-11302012-0008","Date of the Event":"11/20/2012 09:15 UTC","Longitude":"-79.58227","Country":"United States"}