{"Summary":"Bright white flash ighted ground; bar shape with \"windows\" with yellow light.","Weather Factors":"Unknown","Object Flight Path":"Stationary","City":"Chattahoochee","trends":["There have been no other sightings in Chattahoochee","This sighting has never been favorited."],"Region":"Florida","Object Features":"Window(s)","files":["/var/www/straped/mufon/html2text/44258.html.txt","/var/www/straped/mufon/org/44258.html"],"Log Number":"US-11302012-0012","Country":"United States","Viewing Distance":"Unknown","Date Submitted":"11/30/2012 02:22 UTC","Case Number":"44258","map":"<A HREF = \"http://maps.google.com/maps?q=30.637122,+-84.842828(44258)&iwloc=A&hl=en\"> mufon case (44258) map </A>","Tags":"City","divs":["Sighting DetailsMy brother and I were talking in the front yard. The stars are always brilliant at the farm, so I am usually looking up at them. The family has had meteor watching parties there, during the meteor showers. My brother was looking at his car when we both saw a bright flash of white light that lit up the yard. I was looking up between Orion's knee (Saiph) and the Sirius. My brother did not look up, then, but looked over at me. He did not see what I did, a bar-shaped rectangle with what appeared to be \"windows\" with squares of yellowish light. There were 4 or 5 windows. It appeared to be about 1.5 to 2\" long (between my fingers) and was at a slight angle. I had no emotional reaction other than curiosity about the flash, first, and then the bar with lighted windows. I said to my brother, \"What the hell was that?\" referring to the flash of light, initially. While I was looking at the bar, it disappeared. There was no sign of movement; it just was no longer there. There was no sound at all. The entire event lasted no more than 5 seconds. I didn't have a camera with me and would not have had time to take a shot. I went inside and posted on Facebook that I had seen a UFO, don't know that it was extraterrestrial, but it was nothing I had seen before!"],"Source":"MUFON","Object Shape":"Square, Rectagular","Longitude":"-84.842828","Sighting Duration":"Undisclosed","Latitude":"30.637122","Disposition":"Unresolved","Date of the Event":"11/24/2012 10:35 UTC"}