{"Country":"United States","files":["/var/www/straped/mufon/html2text/44255.html.txt","/var/www/straped/mufon/org/44255.html"],"Disposition":"Unresolved","divs":["Sighting DetailsWitness was outside by the tool shed when a very loud noise caught his attention. He saw a bright light to the west heading east. He was thinking the noise was a plane and the light was the moon. He noticed the noise was getting louder, moving faster and moving toward his home. His mother was standing outside the backdoor and only heard the noise. The witness wasn't sure if it was directly over the house. His fiance was in the bedroom watching TV. She said the TV went to static but that also could have been due to weather conditions as they have satillite. The weather was cold, rainy, and windy. No stars or moon could be seen. The witness discribes a triangle shape object approx 200 feet above. This was a good view due to darkness and he said no second guesses. The lights illuminated the under surface showing up against the dark sky. He guesses the craft to be 60 feet point to point and guesses 100 feet across. The point of the triangle was in back. The witness said that his heart was pounding out of his chest. When he first heard the noise he felt like his heart dropped into his stomach. The witness also saw about the same thing only farther away the night of the j10-29-'12. Same weather conditions. He is going to be sending us a sketch if his scanner is working."],"Object Features":"None, Unknown","trends":["There have been 45 other sightings in Grand Rapids","There was one other sighting in Grand Rapids on or around October 17th 2012"],"City":"Grand Rapids","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","Date of the Event":"10/17/2012 12:00 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","Tags":"City","Object Flight Path":"Hovering then path","Date Submitted":"11/30/2012 11:34 UTC","Object Shape":"Diamond","Longitude":"-85.748114","map":"<A HREF = \"http://maps.google.com/maps?q=43.043311,+-85.748114(44255)&iwloc=A&hl=en\"> mufon case (44255) map </A>","Log Number":"US-11302012-0009","Case Number":"44255","Latitude":"43.043311","Summary":"Triangle shape object moving fast bright lights appered overhead","Region":"Michigan"}