{"Log Number":"US-11302012-0010","divs":["Sighting Details I was on board American Airlines flight 1379 from Dallas to Tucson, looking out over the right wing of the plane. The sky was clear, moonlit night. While the aircraft was descending approximately 60 miles east of Tucson, approximately at or below 18,000 ft. I observed several light objects in the sky. (location approximately Mount Graham near Safford AZ). I first noticed the brightly lit object when it was joined by a second object same size and color light, I first thought it was a plane turning in the sky and was very curious because of the proximity of the second object, then one of the lights turned off and then on again and that is when I knew this was strange. Almost immediately a third, fourth, fifth and sixth light the light appeared in the sky, not all in a straight line but somewhat aligned horizontally. I would estimate within a mile separation of each other end to end. I am a pilot and engineer, I have much experience identifying aircraft at night, this was absolutely not an aircraft light or flares dropped by military planes. In fact, the amber color objects did not appear to move and were higher than our plane, I know this because they were well above the horizon (higher in the sky) I would estimate above 20,000 ft. The objects were not moving, but turning on and off in short duration like someone flipped a switch. I only saw all 6 lights on at the same time once, after that it was down to 2 or 3, then only 1 on and off (5 to 15 second duration)over a period of 3 or 4 minutes. I was able to call attention to the person sitting next to me and that person also saw the last 1 illuminate and disappear in the sky over the wing."],"Country":"United States","Tags":"City","Source":"MUFON","Object Shape":"Sphere","Date of the Event":"11/29/2012 08:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.053948,+-111.090091(44256)&iwloc=A&hl=en\"> mufon case (44256) map </A>","Weather Factors":"Unknown","Case Number":"44256","Summary":"Multiple objects emitting amber light from ~20,000 ft hovering in place","Longitude":"-111.090091","Region":"Arizona","Sighting Duration":"00:05:00","Latitude":"34.053948","City":"Undisclosed","trends":[],"Disposition":"Unresolved","Date Submitted":"11/30/2012 12:06 UTC","Object Features":"Unknown","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/44256.html.txt","/var/www/straped/mufon/org/44256.html"],"Viewing Distance":"Over One Mile"}