{"map":"<A HREF = \"http://maps.google.com/maps?q=39.008631,+-94.477965(44259)&iwloc=A&hl=en\"> mufon case (44259) map </A>","Date Submitted":"11/30/2012 02:31 UTC","Summary":"Black Triangle object with three pulsating lights and one center light","divs":["Sighting DetailsI was on my way to work on November 30, 2012 at 4:25 am. As I turned the corner down the road a huge black triangle object flying low, maybe twice tree top level came over my street moving north east. The object was moving very slow and as it crossed over the street and my car it stopped just above the house on the east side of the street and hovered. The object was black, darker than the night sky with the exception of three very bright pulsating lights at each corner and a large bright center light. The lights changed colors but did not appear to have any pattern to the movement. The object was absolutely huge. It easily covered the entire house and then some. I rolled my window down to take a picture and video with my cell phone but could not get it to come on. So I quickly made a sketch of what I was seeing on a receipt that I had in my car. The object started to move slowly and when I went to try and get my cell phone to work again and I looked up and the object was gone. There was no engine noise what so ever and it was just gone."],"Latitude":"39.008631","Sighting Duration":"Undisclosed","Date of the Event":"11/30/2012 04:25 UTC","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/44259.html.txt","/var/www/straped/mufon/more/44259_submitter_file1__TriangleUFO.jpg","/var/www/straped/mufon/org/44259.html"],"Country":"United States","Case Number":"44259","Region":"Missouri","Tags":"City","trends":["There have been 15 other sightings in Raytown","There were no other sightings in Raytown on or around November 30th 2012","This sighting has never been favorited.",""],"Log Number":"US-11302012-0013","Weather Factors":"Unknown","Source":"MUFON","Object Features":"None","Object Flight Path":"Hovering then path","Longitude":"-94.477965","Viewing Distance":"501 Feet - 1 Mile, Unknown","Object Shape":"Triangle","City":"Raytown"}