{"Region":"Florida","Object Features":"None","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"12/01/2012 12:01 UTC","Source":"MUFON","divs":["Sighting DetailsEvery morning I sit on my boat dock behind my house in Fort Lauderdale, Florida and watch the sunrise while having my coffee. This is usually between 5:30 and 6:30. I often have my camera with me because I like to take photographs and there are some awesome birds that land on the dock posts. When I go out to the dock, it's pitch black. Clouds look like trees or even mountains. IF you can see them. As it gets lighter, you can differentiate clouds from trees and there's certainly no mountains in Florida. This incident revolves around many photographs I took of the night I captured an orb on my camera that I NEVER saw with the naked eye. That morning, I decided to take pictures of the sun coming up in. I took the pictures in rapid succession because I was intending to do a quick montage of the photographs of the sun coming up. I wasn't paying much attention to the pictures I took because as I said, I was taking them in rapid succession and I wasn't concerned about the quality because I was taking at least three pictures per second and figured any blurred picture could simply be deleted and not added as part of my montage. However, I happened to glance at one of the pictures taken and noticed a penny-sized, really bright orb. It looked like the moon at first, but I am in to astronomy and I knew it was not the moon. I wanted to continue my rapid picture taking so I ignored the orb and kept snapping away. Then I happened to notice that it appeared yet again in my picture. So, I stopped my picture taking and looked at the sky. There was NOTHING there. I thought perhaps it was some sort of aircraft or distant street light, but it was way to bright and stood out as the only thing in the picture save for a bluish glow in the sky from the sun coming up. I took more pictures. The orb was there. I looked at the sky. No orb. I studied the sky some more and wrinkled my brow and kept taking pictures. It never really occurred to me that it may be something extraterrestrial because I was focused on my montage photos and was actually kind of angry that it kept showing up. It wasn't until I posted the picture on my Facebook wall and said something to the effect of \"Aliens! I see Aliens!\" Then a friend sent me an article from a TV station's website wherein several people saw the same kind of orbs that were showing up in my pictures. They saw as many as four or five orbs at about a 60 degree angle (I could be off on my perception of the degree because I suck at that sort of thing.) which is higher than the one I saw in my photographs. Also, they reported seeing the orbs move and slowly fade away. These are eye-witness accounts from several sources. Some had taken photographs themselves and they looked EXACTLY like the orb in my pictures. The only difference is that I couldn't see the orb with a naked eye. I studied the are where the orb was in the picture (I had my camera propped up so that it wouldn't move) so I was able to pinpoint the location in the sky. I stared at that location for about ten to fifteen minutes and never saw it. I then started taking more pictures and the orb remained in the same location in my pictures. I moved to a different location in my back yard, abandoning my montage project. I took pictures from different angles and areas, some with the flash on, some with the flash off, some with the flash on auto. The orb was in every single picture I took, yet I still could not see it with my naked eyes. The orb NEVER moved. The sun came out and out-shined the orb and it was no longer visible in the pictures. My feelings at the time were at first annoyance. Then curiosity. Then interested. That's when I posted one of the better photos on my Facebook page and subsequently got a link via message from a friend who told me of people in Fort Myers who were on television reporting UFO's. Since I am in the general area as they are, I can't help but to think we were all witnessing the same thing, even though I could not \"see\" my orb nor did my orb ever move. The people on the news reported seeing it before going to bed on the night of the 28th. I'm a super early riser and I'm up at 4:00 a.m. every morning. So, to those who saw the orb on the 28th, they went to bed and were probably still sleeping when I got up at 4:00 a.m., thus making it the same \"night\", yet a different day (it turned to November 29th at midnight - am I making sense? LOL) An older couple reported them moving in unison as did a younger couple. The older couple tried to get a picture, but it didn't show up. The younger couple were able to get pictures and after looking at them, I am convinced they are the same thing. I do not know what this thing was. But, I do know that the universe is infinite and to think that we are the only lifeforms in said universe is naive. And even if people do believe we share this universe with other lifeforms, it is also preposterous to think that we are the most advanced. I'm sure there are other planets with lifeforms that aren't nearly close to being as advanced as we are, nor do I believe that Earth is the most advanced of them all. Do I believe that lifeforms from other planets have the ability to travel great distances to study the earth? I suppose so. I mean, why not? I think it's entirely possible. If you think about another planet that is not as advanced as we are and are living in caves and haven't discovered fire or invented the wheel? Well, I bet if one of them spoke up and said, \"I bet there are other planets out there that lifeforms live on and they've traveled into space!\" I bet their friends and family would call them crazy. Yet here we are, and we have gone into space and to the moon. So, to ignore anyone who says, \"I bet there are other planets out there in this infinite universe who have traveled far distances with advanced technology.\" is to assume that we are alone in this universe. I think that anyone who believes that we are alone are naive or gullible and quite frankly, a little pompous. I also believe that the orb I captured with my camera was not meant for me to see, but somehow my camera was able to pick it up. There was nothing in that black sky that would have created the orb in pictures taken from different angles and perspectives. Additionally, I have taken pictures before that night of the black sky while waiting on the sun to rise and no orbs of the nature that showed have ever shown up on my camera. Also, I have taken pictures of the same exact location the last couple of mornings and there were no orbs. Again, I don't know what it was I saw. But I truly believe I wasn't meant to see it, but my camera caught it. I should also mention that over the course of the last couple of weeks, especially around midnight or later, there have been helicopters flying around, making slow, circular patterns in their flight. I believe this was mentioned by someone who witnessed the orbs over in Fort Myers, but I could be mistaken. Fort Myers is just across the Everglades from Fort Lauderdale, so it's certainly plausible that I was seeing the same orbs (or one orb in my case) that the people in Fort Meyers saw. Since the one I captured was stationary, I think THAT is why I wasn't meant to see it. Once the sun rose, it out-shined any and all light, including the orb. The picture I am attaching is a little fuzzy, but it's the best one of the orb itself."],"City":"Fort Lauderdale","Object Shape":"Circle","Summary":"Watching sunrise & taking pictures. Orb not visible to naked eye. Came out in every picture I took","Longitude":"-80.137989","Log Number":"US-12012012-0001","Sighting Duration":"Undisclosed","Case Number":"44264","Date of the Event":"11/29/2012 06:15 UTC","Latitude":"26.123308","Object Flight Path":"Stationary","trends":["There have been 37 other sightings in Fort Lauderdale","There were no other sightings in Fort Lauderdale on or around November 29th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=26.123308,+-80.137989(44264)&iwloc=A&hl=en\"> mufon case (44264) map </A>","files":["/var/www/straped/mufon/html2text/44264.html.txt","/var/www/straped/mufon/org/44264.html"],"Disposition":"Unresolved","Country":"United States","Tags":"City","Weather Factors":"Unknown"}