{"Log Number":"US-11302012-0015","trends":[],"Summary":"Two Glowing Bright Orbs Seen Near Planes Manchester TN","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=35.524461,+-86.572737(44262)&iwloc=A&hl=en\"> mufon case (44262) map </A>","Weather Factors":"Unknown","Date Submitted":"11/30/2012 07:02 UTC","Region":"Tennessee","divs":["sighting detailswe were down the road a bit coming up to the stop light near hardee's in manchester, tn. and talking about all the airplanes in the sky and i was counting them because there seemed to be much more than usual when all the sudden i seen a bright glowing ball\\orb light up. it did not appear to move and i thought it was a huge bright star at first but then it just vanished as i came up to the light. the light changed to green and i was still trying to see where the thing went, the guy behind was honking his horn (i guess he was in a hurry) so i pulled into hardee's, went through the drive-thru for a coke and got my husband some food when i came up to the window i seen 4 airplanes in the sky with contrails from my vantage point and again it seem to just appear; a bright ball\\orb of light, this one had a contrail and within 20 to 30 secs the whole thing vanished including the contrail. there was a plane just under this bright ball\\orb of light. my husband was with me but did not see it because his eyes are sensitive to light, by the time he focused in on the planes the thing was gone. i was wearing sunglasses. imo,these two bright balls of light seemed to be traveling with and near the planes. i am puzzled by the way they just appeared and disappeared while i was looking right at them...the first one i can understand because i was in moving traffic and also watching the road, but the second one, i was at a full stop at the drive-thru window and had a perfect view the entire time and watched it appear and then disappear."],"Object Shape":"Sphere","Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","City":"Undisclosed","Object Features":"Unknown","Latitude":"35.524461","Source":"MUFON","Sighting Duration":"Undisclosed","Country":"United States","Date of the Event":"11/30/2012 04:39 UTC","Case Number":"44262","files":["/var/www/straped/mufon/html2text/44262.html.txt","/var/www/straped/mufon/org/44262.html"],"Longitude":"-86.572737","Tags":"City"}