{"Object Features":"Other","files":["/var/www/straped/mufon/html2text/44268.html.txt","/var/www/straped/mufon/org/44268.html"],"Object Flight Path":"Stationary","divs":["Sighting DetailsWhile flying from Oakland to Burbank on SWA # 1025, at approx. 8:55 p.m. on Friday Nov. 30, a single bright redish-orange orb-shaped light seemingly nestled in the clouds was observed by myself and my girlfriend while looking out an airplane window from our seats in middle to rear of aircraft. The aircraft wing obstructed >50% of the view through the window. The sighting lasted 20-30 seconds and occurred on the final approach to Burbank Airport with lights from what appearred to be city of Simi Valley below and out in the distance. The light was first observed straight out the window in a north direction and slightly below the tip of the aircraft wing. The light appearred to be stationary and slowly moved out of view in the window as the aircraft headed to its Burbank Airport destination approx. 10 minutes before landing. At first sight the light appearred to be a little ball of fire sitting in a cloud approx 3-6 miles away. No other passengers were heard to comment on the orb-like light."],"map":"<A HREF = \"http://maps.google.com/maps?q=34.277997,+-118.778412(44268)&iwloc=A&hl=en\"> mufon case (44268) map </A>","Disposition":"Unresolved","Viewing Distance":"Unknown","City":"Simi Valley","Latitude":"34.277997","Case Number":"44268","Object Shape":"Circle, Fireball, Sphere, Star-like","Date Submitted":"12/01/2012 04:21 UTC","trends":["There have been 20 other sightings in Simi Valley","There were no other sightings in Simi Valley on or around November 30th 2012"],"Log Number":"US-12012012-0005","Region":"California","Country":"United States","Longitude":"-118.778412","Sighting Duration":"00:00:20","Date of the Event":"11/30/2012 08:55 UTC","Tags":"City","Source":"MUFON","Weather Factors":"Unknown","Summary":"Orb-like light observed at night from airplane window on approach to Burbank Airport on flight from Oakland."}