{"Country":"United States","City":"Swansboro","Region":"North Carolina","Weather Factors":"Unknown","trends":["There has been one other sighting in Swansboro","There were no other sightings in Swansboro on or around November 28th 2012"],"Date of the Event":"11/28/2012 06:00 UTC","Viewing Distance":"Unknown","Disposition":"Unresolved","Object Flight Path":"Stationary","Latitude":"34.688832","Longitude":"-77.116277","Summary":"saw ufo on the way to morehead","map":"<A HREF = \"http://maps.google.com/maps?q=34.688832,+-77.116277(44277)&iwloc=A&hl=en\"> mufon case (44277) map </A>","Log Number":"US-12012012-0013","files":["/var/www/straped/mufon/html2text/44277.html.txt","/var/www/straped/mufon/org/44277.html"],"Sighting Duration":"Undisclosed","Object Features":"Unknown","Case Number":"44277","Source":"MUFON","divs":["Sighting DetailsMy wife and I were traveling to Morehead city, and were observing the moon. As we crossed the bridge leaving the town of swansboro, I looked to the left to look at the moon. At first I thought it was a tower of some sort, then realized that there's never been anything before, and to my knowledge no new structures have gone up. We arrived at Cape Carteret, and had been observing these lights for a few minutes. As we moved closer to Cape carteret, the object got bigger, like it was hovering over a forest in the distance. We pulled into McDonald's to grab a bite, and maybe 10 minutes had gone by when we left. I looked for the object and it was nowhere in sight. I'm not sure what it was, but it wasn't an aircraft of any sort I'd seen before. I'm enlisted Marine corps, and there's 2 air statione in the area, so I've been exposed to several different kind of aircraft, and would know if it were a conventional craft. I didn't have a chance to get any sort of picture of it, and my wife was eating, but she saw it as well. Not sure if anyone else saw it, but I think it's a possibility."],"Tags":"City","Object Shape":"Boomerang, Triangle","Date Submitted":"12/01/2012 09:17 UTC"}