{"Date of the Event":"11/29/2012 11:00 UTC","Longitude":"-85.021251","Region":"Tennessee","Object Features":"None","Summary":"brights diamond shape being circled by 3 unknown aircraft and another plane circling","Object Flight Path":"Hovering then path","Case Number":"44275","files":["/var/www/straped/mufon/html2text/44275.html.txt","/var/www/straped/mufon/org/44275.html"],"Tags":"City","Sighting Duration":"Undisclosed","divs":["Sighting DetailsOn Nov 29, 2012, I was headed home from work. This would have been around 2245 hours. I was headed south and noticed a diamond shape bright yellowish light in the sky. It didn't appear to be moving, but as I continued to drive, I was getting closer to it. My drive home is 16 miles and takes roughly 30 mins to complete. About half way home, I could see 3 airplanes circling the object. The planes had the normal flashing lights. At no time did the object change shape or color or did it appear to be moving. As I arrived home, I saw a fourth airplane circling SE of the area. I exited my vehicle and watched for a second when, in a flash, the object traveled north and out of sight. No sound of any type was heard. The object left behind a vapor trail of some sort. The 3 aircraft then followed in the same direction evenly spaced and at a speed that I could watch them for a period of about 45 seconds before being out of sight. At no point did I hear any noise from those aircraft. The fourth plane made the normal prop plane noise and continued to circle the area. After the object and the other 3 aircraft disappeared, the plane increased it's circling pattern area and continued for a few minutes. I stopped watching and went inside. The plane was still circling."],"Disposition":"Unresolved","City":"Crossville","Log Number":"US-12012012-0011","map":"<A HREF = \"http://maps.google.com/maps?q=35.952317,+-85.021251(44275)&iwloc=A&hl=en\"> mufon case (44275) map </A>","Date Submitted":"12/01/2012 06:19 UTC","Weather Factors":"Unknown","Source":"MUFON","Country":"United States","Object Shape":"Diamond","Viewing Distance":"Unknown","Latitude":"35.952317","trends":["There have been 7 other sightings in Crossville","There were no other sightings in Crossville on or around November 29th 2012"]}