{"Region":"Michigan","Tags":"City","City":"Swartz Creek","Case Number":"44272","Country":"United States","divs":["Sighting DetailsI was driving South on Seymour Road near Swartz Creek Michigan when off to my left and before I crossed I69 I saw the blimp hovering over Sports Creek raceway. As I proceeded South I came to the realization that what I was seeing was not a blimp, so I stopped north of the intersection of Bristol Rd and Seymour Rd and watched. The object appeared to hover over the race track which was all lit up. I do not know if the race track was having an event that night. The object appeared to be the same size as this horse track. Spatially, the object certainly could have been SSE of the track. Initially I saw a dull silver stubby cigar shaped object that was as big as a blimp. As I got closer, I realized that it was more like a Zeppelin in shape, and this is what caused me to pull to the side of the road. I got out of the car for a moment, and then got back in and did not get out again. This object hovered spatially over the racetrack with a painfully slow turn to the right on its axis. I got back into the car as it began its turn on the axis. The turn allowed me to observe that although it looked like a panatella cigar from the side, it became more like a downward smile from the back. The entire surface of the back was the most beautiful fuzzy electric cobalt blue white light I have ever seen. This is all that I was able to remember of the event the next morning and I cannot explain that. This is why I have said nothing about this except to a few close friends. The reason I decided to report this is because of the similar description of a recent event over the Rave Theaters in Flint Twp at Corunna Rd and I75."],"Date of the Event":"03/10/1988 12:00 UTC","Date Submitted":"12/01/2012 11:40 UTC","Summary":"Driving and saw something, so I stopped","Latitude":"42.964841","Object Shape":"Boomerang, Cigar","Longitude":"-83.823414","Object Features":"Other","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Weather Factors":"Unknown","Log Number":"US-12012012-0007","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/44272.html.txt","/var/www/straped/mufon/org/44272.html"],"trends":["There have been 10 other sightings in Swartz Creek","There were no other sightings in Swartz Creek on or around March 10th 1988"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.964841,+-83.823414(44272)&iwloc=A&hl=en\"> mufon case (44272) map </A>"}