{"Date of the Event":"12/12/2005 10:00 UTC","files":["/var/www/straped/mufon/html2text/4427.html.txt","/var/www/straped/mufon/org/4427.html"],"Object Shape":"Triangle","Latitude":"33.581903","Date Submitted":"12/12/2005 10:00 UTC","Disposition":"Unknown","Longitude":"-101.853826","Case Number":"4427","Summary":"object was visible for about 1 hour in the same location. then object moved nort west until out of sight","Country":"United States","Sighting Duration":"Undisclosed","divs":["Sighting DetailsA friend of mine was driving home near wolforth, Texas (outside of lubbock) at approx. 10 pm and saw the object. She called me, I went outside and also saw the same thing she saw even though she was approx. 15 miles from me. It was low in the sky --just over the treetops in my view. She was directly under the object and said she could definately see a triaglular shape that was stationary. The object remained in the same place until she got home-probably another 15 miles. We both could still see it in the same place.. After about 1 hour of observing object it started to slowly move northwest and going lower towards the ground until it was too low to see. We knew it was not Venus although it was in the general direction where Venus was but was much larger and brighter. I looked at the object with binoculers and could see the triangle shape with the point toward the ground. Looking at the object at arms length it was slightly smaller than the size of a dime, much larger than any visible star or planet in the sky. I never saw anything on the news about the object. My friend and I remained in contact with each other the whole time it was visible (about 1 hour)."],"Region":"Texas","Log Number":"US-02142006-0001","trends":["There have been 18 other sightings in Lubbock","There were no other sightings in Lubbock on or around December 12th 2005"],"Source":"MUFON","Object Features":"None","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=33.581903,+-101.853826(4427)&iwloc=A&hl=en\"> mufon case (4427) map </A>","City":"Lubbock","Tags":"City","Object Flight Path":"Hovering then path,Straight-line path","Viewing Distance":"101-500 Feet, Unknown"}