{"divs":["Sighting Detailsi was on vacation with my family at disney world orlando fl. i woke up early went on the balcony to have my coffee. and i saw a brite blinking dot in the sky thought it might have something to do with nasa's launch that day. of the pluto project. my biggest regret it that i watched it for about 2 minuts before i got my video cam out and hit record. then i saw 2 birds fly by so i tiped the cam toward them. and then from behind the hotel came a second object i was glad i caught that it was closer and more detailed first. it was black then faded in and out then it also started to blink siver..then i tried to put the focus on the camera to infinity and went back to tape and they were just gone in a second like someone hit a light switch and turned them off.......i sent a clip.. i am willing to send you origonal digital tape. (but i will want it back) i dont care if you use my name and video for any purpous you would like i just dont want my kids or wife to be shown if you are interested in this sigting get back to me for origonal digital tape looks much clearer that the one attached....thanks for you time and work on UFOS i want to know what i saw!!!!"],"Object Shape":"Cylinder, Diamond, Flash, Sphere","Tags":"City","Disposition":"Unresolved","Source":"MUFON","files":["/var/www/straped/mufon/html2text/4428.html.txt","/var/www/straped/mufon/org/4428.html"],"Date of the Event":"01/19/2006 08:04 UTC","Case Number":"4428","map":"<A HREF = \"http://maps.google.com/maps?q=28.291956,+-81.407571(4428)&iwloc=A&hl=en\"> mufon case (4428) map </A>","Log Number":"US-02142006-0002","Weather Factors":"Unknown","Object Features":"Other","Object Flight Path":"Path with directional change","Country":"United States","Summary":"i could not believe what i was seeing but there they where","Latitude":"28.291956","Longitude":"-81.407571","trends":["There have been 18 other sightings in Kissimmee","There were no other sightings in Kissimmee on or around January 19th 2006","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Region":"Florida","Date Submitted":"01/19/2006 08:04 UTC","Viewing Distance":"Unknown","City":"Kissimmee"}