{"Object Shape":"Sphere","Sighting Duration":"Undisclosed","Case Number":"44280","Country":"United States","Longitude":"-87.880439","Log Number":"US-12012012-0016","Summary":"silent high rate of cruising speed approx 600-700mph","Object Features":"Unknown","Region":"Illinois","Object Flight Path":"Straight-line path","trends":["There have been 3 other sightings in Beach Park","There were no other sightings in Beach Park on or around December 1st 2012"],"divs":["sighting detailsi was getting into my car to make a run to walgreens. i started my car and to let it get up to temperature. while i waited, i was listening to a local radio station and the signal cut out and became static filled. i turned the radio off then back on and the signal was still evident. i was simultaneously lost connection to my home wi-fi signal then my phone shut itself off. i thought that was weird until i got out of the car to check the radio antenna. this was precisely 6:10pm (after looking at the clocks on the car stereo and cellphone) on 12\\01\\2012. the bright white (color sustained) object was travelling beneath the cloud ceiling of 3400 ft. approximately no more than a mile above the ground travelling at a high speed cruise of around 500-600 mph. the object travelled on a linear path from sw to ne heading towards lake michigan. the object did not emit a noise which i found odd since the object was travelling along the jet stream path which would have announced an approaching helicopter or plane. total time from point a to point b behind a line of trees was approximately 8-10 seconds in all."],"Disposition":"Unresolved","Date Submitted":"12/01/2012 11:44 UTC","Latitude":"42.430476","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/44280.html.txt","/var/www/straped/mufon/org/44280.html"],"City":"Beach Park","map":"<A HREF = \"http://maps.google.com/maps?q=42.430476,+-87.880439(44280)&iwloc=A&hl=en\"> mufon case (44280) map </A>","Date of the Event":"12/01/2012 06:10 UTC","Tags":"City","Source":"MUFON"}