{"trends":["There have been 24 other sightings in Chico","There were no other sightings in Chico on or around December 2nd 2012"],"Country":"United States","Date Submitted":"12/02/2012 04:19 UTC","Date of the Event":"12/02/2012 01:30 UTC","Object Shape":"Other","Case Number":"44290","Log Number":"US-12022012-0010","Object Features":"Patterned Surface","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsMy Co worker & I got off work @125 & we headed south on hwy 99. We were on the road for about 3 min when I thought I witnessed lightening strike in the middle of the sky. Something rang strange in my head because lightening doesn't strike usually that high up in the sky & it seemed to be a very short lightening strike. I looked directly at where it occurred & I saw a set of pulsating light. They were going from side to side in a orchestrated manor. I notified my co-worker & she witnessed it as well. We noticed it was descending lower & heading north. It moved close enough for USA to see it was teardrop shaped. It was as if the teardrop was on it's side & it had four panels of groups of lights. They flashed in sections from the rear to the front. As they were pulsating, we could see that the UFO had structural integrity & it appeared to be mechanical flying with no engines, propellers, or anything of that nature. There were no windows on it & the front of the UFO showed a build up of heat or some kind of distortion of matter present when a jet is traveling at a supersonic speed. Its flight pattern was very unnatural. As it passed us it was very disturbing & a little frightening to experience. There was a car in front of us. They pulled over but we continued driving to our destination."],"City":"Chico","files":["/var/www/straped/mufon/html2text/44290.html.txt","/var/www/straped/mufon/org/44290.html"],"Region":"California","Weather Factors":"Unknown","Latitude":"37.443787","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=37.443787,+-120.789876(44290)&iwloc=A&hl=en\"> mufon case (44290) map </A>","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Summary":"leaving work my co-worker & i witnissed a pulsating craft appear in the sky & decened","Longitude":"-120.789876","Tags":"City"}