{"Log Number":"US-02142006-0003","trends":["There has been one other sighting in Hays","There were no other sightings in Hays on or around February 14th 2006"],"Viewing Distance":"Unknown","Object Features":"Undisclosed","Longitude":"-99.32677","City":"Hays","Sighting Duration":"Undisclosed","Case Number":"4429","Object Shape":"Sphere, Star-like, Other","Source":"MUFON","Date Submitted":"02/14/2006 08:10 UTC","divs":["Sighting Details1. Driving east in my car. Five miles west of Hays, KS, city limits on Old U.S. Hwy 40 (now known as West Highway 40). 2. I'm very familiar with the skyline, and easily noticed the four, equally spaced, horizontal, yellow lights (round shape) in to the east, north east of my position. The lights as viewed looked like the warning lights on the tops of four radio towers, but these lights were yellow and sort of oblong (vertically). 3. I thought the lights were either the lights on the tops of four new radio towers (which would have been a big surprise since I live in Hays and am very familiar with its skyline) or were four new, very bright, very tall interstate interchange lights. 4. The lights stayed in roughly a straight line (north to south), with the third light from the left just a bit below the line of the other three lights. As I drove west, the lights kept getting lower on the horizon, which was opposite of what I thought should happen if the lights were on top of towers. 5. My response was to ask my son if he saw the lights (he did), ask him how many he saw (he saw four), and ask what color he saw (he said they were yellow). 6. The lights kept getting lower on the horizon and \"winked\" out one after the other."],"Latitude":"38.879178","Tags":"City","Region":"Kansas","Summary":"Four yellow lights, equidistant, in line, one winked out after the others","Date of the Event":"02/14/2006 08:10 UTC","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/4429.html.txt","/var/www/straped/mufon/org/4429.html"],"Object Flight Path":"Straight-line path","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=38.879178,+-99.32677(4429)&iwloc=A&hl=en\"> mufon case (4429) map </A>","Weather Factors":"Windy, Medium"}