{"Tags":"City","Sighting Duration":"00:30:00","Case Number":"4430","Date Submitted":"02/15/2006 06:30 UTC","Weather Factors":"Unknown","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=35.381822,+-119.010242(4430)&iwloc=A&hl=en\"> mufon case (4430) map </A>","Object Shape":"Star-like","Date of the Event":"02/15/2006 06:30 UTC","divs":["Sighting DetailsIn my back yard, between 6:30 and 7am., feeding my cats, an extremely bright object hanging motionless in the southeastern sky caught my attention. My first thought was, a star or satellite, except the sun was up, the object was not moving and no other stars were visible. The object in question was extremely bright as in a mirror reflection but brighter than the sun or any of several commercial aircraft, flying at various altitudes, in the area. This object was approximately thirty degrees above the horizon, in a southeasterly direction from my house and motionless. I was very curious to know what it was, as it was extremely bright and unlike anything I've seen before, day or night. I ran into my house and collected my eyeglasses and a pair of 10X50 binoculars to get a better view of the object. Through the binoculars it was still a near blinding spot of white light, no discernable details. After thirty minutes of viewing, the object was obscured by some drifting clouds. When those clouds cleared the sky where the object had been, about ten minutes later, it was gone from sight. Tomorrow morning, Feb. 16, 2006, I will be at the same place at the same time to find out whether or not this object was a star."],"Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/4430.html.txt","/var/www/straped/mufon/org/4430.html"],"City":"Bakersfield","Latitude":"35.381822","Object Features":"None","Viewing Distance":"Unknown","trends":["There have been 32 other sightings in Bakersfield","There were no other sightings in Bakersfield on or around February 15th 2006"],"Log Number":"US-02152006-0001","Disposition":"IFO","Country":"United States","Longitude":"-119.010242","Summary":"Between 6:30 & 7:00am., extremely bright object hanging in southeast sky at 30 degrees above horizon, motionless.","Source":"MUFON"}