{"Sighting Duration":"Undisclosed","Tags":"City","Object Flight Path":"Other","Date of the Event":"12/03/2012 10:30 UTC","Country":"United States","Weather Factors":"Unknown","Region":"Virginia","Date Submitted":"12/03/2012 11:48 UTC","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Summary":"large-ish craft darting back and forth like a gnat with mulit lights","City":"Hurley","Latitude":"37.420391","Longitude":"-82.020122","trends":["There have been no other sightings in Hurley","This sighting has never been favorited."],"divs":["Sighting DetailsI was driving across Big Rock Mountain, into Hurley VA. I noticed something bright in the sky of fairly large purportions. Probably the biggest thing i've ever seen in the sky. It darted back and forth like a gnat. Gained altitude, lost it, gained it, darted back and forth some more. All the while it was flashing colors, orange, purple, blue, bight white and yellowish. The lights flashed in a sequence for the first few trips across the sky, and then all the lights came on and pulsated. Then they went back to the sequence, except it was in a different pattern like it was random. I'm still looking at it right now, but it's higher in the sky. It's been an hour, and it's still there darting back and forth. Just a few feet in either direction at a time. I really don't know what shape it is, even though i've been looking at it for awhile, at first I thought it was round. But now it's in a sort of chevron shape, I can't tell if it's just the lights or the actual body shape. I'm kind of freaked out by it, i've never been a believer of stuff like this no offense to any one out there, but it's never been something I put much stock in. Until lately, there was a sighting including pictures in our local paper and video on the news and youtube. Since then i've seen a few things, this being by far the strongest, and longest lasting. I can't easily write this off as a airplane, helicopter, jet, or weather balloon. I've attempted to video it but unfortunately I have a crappy video camera or something because I can't even see it in the view finder but I can look up and see it. I've put the ending time as 1 hr and 16 minutes, but it's actually still visible but I wanted to get this in on the map incase anyone else is looking. I don't know if it's instant or not it's my first time using the site. If it's instant on the map, hopefully someone near here can see this thing too!"],"Case Number":"44311","Object Shape":"Chevron, Circle, Disc, Oval","map":"<A HREF = \"http://maps.google.com/maps?q=37.420391,+-82.020122(44311)&iwloc=A&hl=en\"> mufon case (44311) map </A>","Object Features":"Unknown","Log Number":"US-12032012-0012","files":["/var/www/straped/mufon/html2text/44311.html.txt","/var/www/straped/mufon/org/44311.html"]}