{"Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Object Features":"Unknown","Sighting Duration":"00:00:15","trends":["There have been 17 other sightings in Greenwood","There were no other sightings in Greenwood on or around December 5th 2012"],"City":"Greenwood","Latitude":"39.602082","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Country":"United States","divs":["Sighting DetailsI was outside, which I frequently do on many nights, and I always observe the sky, mainly because I have witnessed 6 different very unexplainable objects in the last four months. I am in Greenwood, In. and I was looking South and noticed( a rapidly moving solid object with no lighting whatsoever, other than the moon lighting up the night sky)moving from South to NNW as it went directly over my head. This solid unlit object was a greyish long and skinny cigar shape and was approximately a half-mile to maybe even higher and approximately 30 to maybe 100 meters long and 5 meters wide and made no sound as it went over me and made a slight left directional change as it went directly over Indianapolis and disappeared from my view. Estimated speed of this object would be in the 400kts to Mach 1 range because I did'nt even have time to grab my binoculars to get a closer view as the Approx. viewing time was 4-7 seconds. I must say that I am an amateur star gazer and also an NWS storm spotter and am always looking to the sky for any abnormalities that may show up.My feelings on this subject are purely fascination, not any fear at all and I have seen some bizarre things in the sky recently and I, like many other people and scientists that have witnessed objects unidentifiable, just want to know the truth."],"Case Number":"44326","Summary":"Was outside at 0100 and noticed from South silent solid object moving at 400 kts to mach spd. possibly leaving slight trail and heading off toward NNW dir. over Indianapolis.","Date of the Event":"12/05/2012 01:00 UTC","Object Shape":"Cigar","Log Number":"US-12052012-0002","Region":"Indiana","Source":"MUFON","files":["/var/www/straped/mufon/html2text/44326.html.txt","/var/www/straped/mufon/org/44326.html"],"Longitude":"-86.089914","Date Submitted":"12/05/2012 10:03 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.602082,+-86.089914(44326)&iwloc=A&hl=en\"> mufon case (44326) map </A>","Disposition":"Unresolved"}