{"Object Features":"None","Latitude":"36.141705","City":"Black Rock","Date of the Event":"12/05/2012 07:15 UTC","Disposition":"Unresolved","Weather Factors":"Unknown","divs":["Sighting DetailsOut on upstairs balcony smoking and observed orange-red glowing ball of light NE in the sky. As I was observing the light another one appeared a short distance to the left of the first object. After the second one appeared the first one blinked out. After several seconds the second one blinked out. These objects appeared to be in the same general location as an earlier report I sent in to Mufon. However these objects appeared to be closer and orange-red and globe-like in appearance. A few minutes later still looking to see if they would reappear, I noticed what seemed to be 3-pulsating lights in a upward odd triangle shape heading north away from me. These lights were blinking back and forth like lightning-bugs, lasting for several seconds then disappearing. 30 seconds later the pulsating lights reappeared, this time there were around 5 of them in a staggered line running east to west with different distances between each object. These were randomly-blinking back and forth and the line of these objects were heading north away from me. I watched until they went out of sight for around 2-minutes. If this keeps up I need to buy a good camera so I can get pictures of these things before people think I'm some kind of nut."],"Country":"United States","Case Number":"44339","trends":["There have been 5 other sightings in Black Rock","There were no other sightings in Black Rock on or around December 5th 2012"],"Longitude":"-91.168135","Log Number":"US-12052012-0015","Region":"Arkansas","Summary":"witnessed 2 Glowing orange red balls followed by multible blinking lights in staggered line","Sighting Duration":"Undisclosed","Viewing Distance":"Over 1 Mile, Unknown","Object Flight Path":"Stationary,Path with directional change","files":["/var/www/straped/mufon/html2text/44339.html.txt","/var/www/straped/mufon/org/44339.html"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.141705,+-91.168135(44339)&iwloc=A&hl=en\"> mufon case (44339) map </A>","Tags":"City","Object Shape":"Flash, Sphere, Star-like","Date Submitted":"12/05/2012 09:26 UTC"}