{"Case Number":"44338","Object Flight Path":"Path with directional change","Object Shape":"Triangle","Longitude":"-77.449813","Summary":"Black, low flying, SILENT, large in size with 3 lights; 2 spherical lights on wing tips and a conical shaped light on nose all 3 white","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Latitude":"39.430349","trends":["There have been 16 other sightings in Frederick","There were no other sightings in Frederick on or around March 5th 2012"],"divs":["sighting detailsafter work, i went to visit a friend in frederick in the area between key parkway and shookstown rd. as i was driving into the housing community, i noticed an odd shape in the sky that appeared to be flying very low and at a very low rate of speed that seemed to be above the area of the fredericktowne mall flying from south to north at a low rate of speed, such as a blimp would. being that i was operating a vehicle at the time, and my attention mostly fixed on this ufo, i did not think to take out my cell phone and to start recording and\\or get some photos. my friend lives in very close proximity to fort detrick, which is the army headquarters for national cancer institute and is known to house every biological\\biochemical baddy known to man. the ufo remained in view for the approximately 3 minutes while driving through the community until the time i parked my vehicle in front of his house. once out of the car, i watched this thing intently and started noticing the peculiarities of it. it was about 30 minutes after sunset, so there was still a slight orange glow on the horizon which provided an excellent contrasting backlight. either this thing was very large and flying high up, or it was flying very low (200 ft or less.)it also flew along what is normally a regular flight path for commercial airliners that are headed in for landing at dulles international airport. if it was flying at extremely low altitude, it's approximate size was about 250+ ft from wing to wing and about 75-100 ft from nose to tail. if it was higher, then it must have been huge. it's shape and color was a black triangle. i noticed a total of 3 lights on it of white color; one spherical shaped light on each wing, and what appeared to be a conical shaped light on the nose - like the shape of the letter \"u\" or as a glass protective dome that you would see in an industrial plant on a white or red incadescent light bulb - the round end being the tip of the nose. what really stuck me as odd was that it was completely silent - no noise at all; be it from a conventional jet thruster, propeller engine, etc.. the only noise was the ambient noise from the passing traffic in the area. i observed it as best as i could from behind a tree-line for another 2 minutes as it continued in the direction of ft detrick, which was less than .5 miles away geographically. once i lost complete sight of it due to the surrounding trees, i went and knocked on my friend's door, who promptly answered, and i dragged him by the arm to come outside. i was hoping that if it continued it's flight path, it might re-emerge in some distance above the tree-line in which i had lost sight of it and i would have a second witness to confirm this tale. alas, i was not able to reacquire it, and waited a few more minutes to be certain. i did not see it again and can only assume that it landed in a section of ft detrick that lies along the area of shookstown rd, kemp road and rocky springs rd, which is totally undeveloped, aside from a tarmac jogging trail along the fenceline. this area is known to house white-tail deer and may be some sort of hunting area for soldiers stationed on base to use."],"Object Features":"Unknown","Date of the Event":"03/05/2012 05:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.430349,+-77.449813(44338)&iwloc=A&hl=en\"> mufon case (44338) map </A>","Region":"Maryland","Log Number":"US-12052012-0014","Disposition":"Unresolved","Weather Factors":"Unknown","Tags":"City","Date Submitted":"12/05/2012 08:48 UTC","Country":"United States","Sighting Duration":"Undisclosed","City":"Frederick","files":["/var/www/straped/mufon/html2text/44338.html.txt","/var/www/straped/mufon/org/44338.html"]}