{"Country":"United States","Date Submitted":"12/05/2012 03:25 UTC","Date of the Event":"12/05/2012 07:40 UTC","Longitude":"-120.542787","City":"Ellensburg","Viewing Distance":"Unknown","Latitude":"47.001954","Object Flight Path":"Straight-line path,Path with directional change","Source":"MUFON","Object Features":"None","files":["/var/www/straped/mufon/html2text/44332.html.txt","/var/www/straped/mufon/org/44332.html"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=47.001954,+-120.542787(44332)&iwloc=A&hl=en\"> mufon case (44332) map </A>","trends":["There have been 4 other sightings in Ellensburg","There were no other sightings in Ellensburg on or around December 5th 2012"],"Object Shape":"Sphere","divs":["Sighting DetailsI'm a student at Central Washington University, and today on my way to class I decided to cut through the school's athletic field to get to my final exam sooner. While I was walking south across the field I was looking up at the sky admiring how nice, and clear, out it was. The sun was still low in the sky to the East and there were a few sparse, but large, clouds by the mountains to the West of me. The moon could still be seen as well. But then something bright caught my eye, I looked at it for a minute, and thought that it was a star. I soon realized though that it was moving on a straight path to the South of Ellensburg. I then thought that it could be a plane, but none of the lights on it were flashing, and it was completely round (an orb.) I then noticed its flight path changing slightly. For a few seconds it began to move backwards and forwards rather quickly. It kind of looked like it was wiggling, or bouncing back and forth in the air. After this it continued going south, and it became harder and harder to keep my eyes trained on the object. Soon after I lost it. I'm not sure how high up it was, or how fast it was going. (There was another girl, walking through a different part of the field, who may of seen the object. I'm not sure though.) Right after I lost sight of the orb a small plane from the town's tiny airfield came into my view. The plane was coming from the Northwest and heading on a straight path to the Southeast leaving a short trail behind it. I watched the plane while I continued walking to class, and I took note of its differences from the glowing orb that I saw. It was lower in the sky, and moving much slower than the orb. Even when the plane was far away from me, I could still see the trail that it was leaving behind it. And I also noticed that it didn't reflect the sun very well. So I don't believe that the orb I saw, was a plane."],"Case Number":"44332","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Region":"Washington","Log Number":"US-12052012-0008","Summary":"Glowing orb heading south of Ellensburg","Disposition":"Unresolved"}