{"trends":["There have been 4 other sightings in Altamonte Springs","There were no other sightings in Altamonte Springs on or around December 1st 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=28.665609,+-81.360974(44342)&iwloc=A&hl=en\"> mufon case (44342) map </A>","Country":"United States","Viewing Distance":"21-100 Feet","Source":"MUFON","Tags":"City","Object Features":"None","Disposition":"Unresolved","Case Number":"44342","Region":"Florida","divs":["sighting detailsi was leaving my home for my car in altamonte springs with both my mother and step-father when i saw this red balloon on the horizon. at first, i thought some kid had lost its helium balloon, but the closer it got the stranger it appeared. i just pointed and said \"look\", which got my mom's attention. soon the three of us and another neighbor were looking at it, all astounded. it grew closer as it rose in the air. it seemed like a red balloon the size of a man with a fire at its base. perhaps a chinese lantern... the balloon itself, though, was more of an red blur. it had no tangible exterior, it was as if the yellow flame itself emitted several red spheres. it was entirely incongruous, which is why all four of us were just dumbstruck. it floated as if it were a balloon, but picked up great speed. it is worth noting that i tried to explain it away as some sort of strange balloon\\prank (the previous night i had met a french lighting expert who used inflatable lighting for large events, prompting my inquiry \"have you ever hoaxed a ufo?\" to which he just laughed and shook his head no). my step-father, however, has a legitimate ufo story growing up near ft lauderdale in the 1950s when he witnessed unidentified air craft making impossible maneuvers he has yet to ever see replicated by modern aircraft and there were several other people who witnessed that event. this same step-father was with me on the red orb sighting and he was convinced this event involved a craft not of this world. everything about the sighting was fluidic, the fire within of course, but even the circumference of the red orb itself seemed to vary. i blinked my eyes, trying to focus, but it was of no use. it eventually sped off into the distance and nearby trees clouded its continue ascent. i captured a photo with my phone, but it is indistinguishable from a star."],"Object Flight Path":"Hovering then path","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/44342.html.txt","/var/www/straped/mufon/org/44342.html"],"City":"Altamonte Springs","Sighting Duration":"Undisclosed","Latitude":"28.665609","Date of the Event":"12/01/2012 12:00 UTC","Summary":"Red Orb with internal flame, perhaps Chinese lantern, but moved at great speed.","Longitude":"-81.360974","Weather Factors":"Unknown","Log Number":"US-12052012-0018","Date Submitted":"12/05/2012 09:52 UTC"}