{"Latitude":"42.011286","Region":"Rhode Island","Viewing Distance":"101-500 Feet","Date Submitted":"12/05/2012 10:14 UTC","Disposition":"Unresolved","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was outside with friends, we were talking and smoking cigarettes because no one smokes indoors, beautiful day sun shining no clouds. when my friends wife shouted almost in fear WTF IS THAT?? as we all looked up a HUGE and I mean HUGE white disc with black (seams) passed VERY low and VERY close over head with absolutely no sound at all. We were outside a 2 story home and if there were 4 floors it would have hit the house. it was that low. It passed very slowly, till it was blocked by trees and homes. Something very weird happened, i noticed noone spoke of it and it was like they never saw it. Well Im the only one who cant forget it. I feel like time stood still, for me at least.I truly feel like something else happened. I have seen many ufo,s in florida and had many (dreams?) i guess of visitors in my room. Dont wanna sound crazy but i felt something else happened That my mind will not let me remember. I still think I was (called?)to rhode island for this specific craft. Am I scared? a little bit, but more so not. Ive seen alot. One craft I saw in florida was followed a few days later by 2 black unmarked helicopters flying and hovering over my house so low they shook everything. and when I went outside to look they were so low i was able to see inside one of them. They stayed about i think it was 2 minutes maybe and left. This was reported to mufon and I met with a mufon rep. sorry i forget his name. I almost feel like Im being sought by whoever or whatever \"they\" are but then again not scared, excited is more my feeling towords these sightings. no scars on my body nothing i feel they are good and not evil. I do not talk about my experiences to anyone at all. I enjoy keeping them to myself, and consider it very special and a privlage to see the things I see and encounter. I like to tell mufon every now and then (not all) but sometimes i have to get just a little of my mind.I live in palm beach county florida, I was in rhode island with my now X fiance to see her family."],"Object Features":"Other","Weather Factors":"Unknown","City":"Woonsocket","Date of the Event":"01/15/2011 12:00 UTC","Source":"MUFON","Summary":"Sitting around with a fw friends outside having a cigarette, the girl that was with us shouted wtf is that. looked up and about 3 stories up a HUGE white disc with black (seems?) was moving very slowley over our heads. we just stared at it and watched","Log Number":"US-12052012-0019","map":"<A HREF = \"http://maps.google.com/maps?q=42.011286,+-71.512854(44343)&iwloc=A&hl=en\"> mufon case (44343) map </A>","files":["/var/www/straped/mufon/html2text/44343.html.txt","/var/www/straped/mufon/org/44343.html"],"trends":["There have been 10 other sightings in Woonsocket","There were no other sightings in Woonsocket on or around January 15th 2011"],"Longitude":"-71.512854","Object Flight Path":"Straight-line path","Country":"United States","Case Number":"44343","Object Shape":"Disc","Tags":"City"}