{"Disposition":"Unresolved","City":"Denton","Case Number":"44347","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/44347.html.txt","/var/www/straped/mufon/org/44347.html"],"Source":"MUFON","Region":"Texas","trends":["There have been 22 other sightings in Denton","There were no other sightings in Denton on or around December 5th 2012"],"Longitude":"-97.129368","Log Number":"US-12052012-0023","Sighting Duration":"00:00:05","Object Flight Path":"Straight-line path","Object Shape":"Cylinder","Date Submitted":"12/05/2012 11:13 UTC","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Date of the Event":"12/05/2012 07:57 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.219541,+-97.129368(44347)&iwloc=A&hl=en\"> mufon case (44347) map </A>","Object Features":"Unknown","Summary":"[flg] Moved from one side of the sky to the next out of sight within 3 to 5 seconds","divs":["Sighting DetailsAs I was walking to my car, I noticed something from the corner of my eye. I looked up and saw a large (about the size of an airplane) move from one end of the sky to the other. It didnt disappear, merely just went out of range of my sight. This took no more than 5 seconds to occur. I called the Denton County Sheriffs office and the dispatcher told me that the night before, several calls reported the same thing. About an hour later, as I was going back home, I took a call from someone who claimed to be a deputy with the Sheriffs Department. He wasnt making a routine follow up call. This man seemed to be interrogating me about what I saw and then he proceeded to tell me about \"landing patterns\" and what have you. He seemed to know more than your average person about aviation. He also contradicted the dispatcher by saying that he worked last night and that no such calls came in. His exact quote was, \"I dont know what that guy was talking about\" then laughed. A bit later, I was outside smoking with my daughter and we saw the same thing again. I chalked it up to some sort of secret military base or some sort of military activity originating at Fort Hood a few hours away. But before I could finish my cigarette, a conventional plane looking thing was flying in the same area and had what appeared to be a search light moving back and forth. Then moments later, more planes appeared."],"Tags":"City","Latitude":"33.219541"}