{"Date Submitted":"12/05/2012 10:47 UTC","Weather Factors":"Unknown","Latitude":"-28.208633","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Source":"MUFON","Object Shape":"Circle, Square, Rectagular, Other","Date of the Event":"11/28/2012 11:50 UTC","Longitude":"153.489243","Country":"Australia","trends":["There have been 3 other sightings in Bilambil Heights","There were no other sightings in Bilambil Heights on or around November 28th 2012"],"Log Number":"AU-12052012-0022","Disposition":"Unresolved","Object Features":"Other, Unknown","Case Number":"44346","Tags":"City","Viewing Distance":"Unknown","City":"Bilambil Heights","divs":["sighting detailsam interested in the cloulds and on that late morning i decided to take some photos with my canon eos 500d digital camera.. from my backyard i took 5 quick photos (the camera was set on standard settings..) from left to right over a time period of approx 5 to 10 seconds. had a quick look on the camera view finder, but saw nothing strange (apart from the cloulds that is :) ) next day download onto laptop and noticed small white streak, upper right had side of image on second photo that moved in all remaining images from right to left. image named three (3) is i believe the best best and appears to show a whitish straight streak with 5 light spots\\dots evenly spaced along the streak... the other streaks\\object also show a circlur dot and external dots along the edge of the streak, but do not appear as long as the streak\\object in picture 3. the streak\\object appears to move from right to left.. possibily up, then down and away from me. i certainly did not notice this when i was taking the photos at the time. please note imaged named one (1) did not have the streak\\oject in view. images are number 1 to 5 (taken left to right) see attached photos.. i only added a circle over the object to highlight area.. the photos have not be altered in any other way and are exactly as when i downloaded them. thank you."],"Region":"New South Wales","map":"<A HREF = \"http://maps.google.com/maps?q=-28.208633,+153.489243(44346)&iwloc=A&hl=en\"> mufon case (44346) map </A>","files":["/var/www/straped/mufon/html2text/44346.html.txt","/var/www/straped/mufon/org/44346.html"],"Summary":"object on 4 of 5 digital images taken within 5-10 seconds, taken left to right"}