{"Region":"Texas","Weather Factors":"Unknown","Country":"United States","Object Flight Path":"Path with directional change","divs":["Sighting DetailsMe and my wife were headed towards the grocery store when we saw two small starlike objects far up on the sky. They moved steadily a couple of inches apart. I told her \"wait, I don't think that is a star\" We stopped and looked and they moved forward effortlessly, not steadily on a straight path, but quick the side at times. We looked for a minute, then they parted, one started flashing, looking like an airplane that was high up, the other disappeared out of sight. A big diamond shape object came flying towards us, and away from us, maybe 500 ft up. My wife said it was a plane, but we noticed there was no sign, and that it was huge. It passed gently and we got in the car again, and talked that it was strange \"but who knows\" As we leave, we see a bright orange light up on the western sky. We manage to turn around and as we do it it proceeding south in high speed with a what seemed to be a fighter plane behind it, which couldn't catch up with it. We drove after to gain more view but by the time we had come to a view point it was gone. Also later, we saw a blue orb streak across the sky but it did not last more than a 1,5 seconds. My wife and I felt excitement and fear at the same time. We googled to see if anyone else had seen it and drove to our friends to tell them about the experience."],"Date Submitted":"12/05/2012 11:31 UTC","Case Number":"44349","files":["/var/www/straped/mufon/html2text/44349.html.txt","/var/www/straped/mufon/org/44349.html"],"Object Shape":"Blimp, Diamond, Oval","Date of the Event":"12/05/2012 08:00 UTC","Sighting Duration":"00:05:00","Source":"MUFON","Log Number":"US-12052012-0025","Viewing Distance":"Unknown","City":"Undisclosed","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=31.974149,+-99.895613(44349)&iwloc=A&hl=en\"> mufon case (44349) map </A>","Tags":"City","Summary":"Saw two starlike objects moving, then a big one, then a medium being chased by fighter plane.","trends":[],"Object Features":"Unknown","Latitude":"31.974149","Longitude":"-99.895613"}