{"Longitude":"-95.22595","files":["/var/www/straped/mufon/html2text/4435.html.txt","/var/www/straped/mufon/org/4435.html"],"Region":"Kansas","Source":"MUFON","Summary":"Driving I saw a flicker of light in the sky. I got out of my car and watched it fly away.","Country":"United States","trends":["There have been 18 other sightings in Lawrence","There were no other sightings in Lawrence on or around September 19th 2004"],"Date Submitted":"09/19/2004 01:45 UTC","Case Number":"4435","Log Number":"US-02162006-0004","Latitude":"38.979599","City":"Lawrence","divs":["Sighting DetailsI was driving my car a block from my apartment complex when I saw a flicker of light in my upper left hand range of sight. At first I thought it was light refecting off something on my window. I then looked to where the flicker had been and saw a silver-like disc off in the distance. At that moment I got really excited and pulled into my apartment complex and stopped in the middle of the lot. Then I grabbed my camera which I sometimes carry with me in case there is something I find interesting to shoot. Keeping my eyes on the object I lifted my camera for the shot. I had the object focused and in my sights so I pressed the shutter button but to no avail. In my rush to take the picture I had fogotten to turn the dial switch to on. I then lowered my camera and keeping my eyes on the object it began to move from left to right to left and gone into the distance. My feelings afterwards the event where of shock and dibelief. I also felt lucky but at the same time dissapointed that probably no one would believe me."],"Weather Factors":"Unknown","Tags":"City","Object Shape":"Disc","Object Flight Path":"Hovering then path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=38.979599,+-95.22595(4435)&iwloc=A&hl=en\"> mufon case (4435) map </A>","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Disposition":"Unknown","Date of the Event":"09/19/2004 01:45 UTC","Object Features":"None"}