{"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Region":"Tennessee","Summary":"Big Bright Multicolored UFO Manchester, TN","divs":["Sighting DetailsI was inside gaming and had all the windows closed. I noticed a loud roaring type sound over all the usual sounds in the house, so I walked outside to take a look around. I seen all the stars and then I seen a big bright object cycling through every color. I immediately compared it's size to the north star and Venus, this object was bigger than any star in the sky and brighter mainly because of the brilliant colors. A small white star like object shot out of it a couple of times. In the video you can hear the sound pretty well (it was much louder in person), see it change shape, hover and move. I used a Nikon camera on a tripod set to manual focus. I did have to adjust the tripod a few times when the object moved. It stayed around for about 30 to 40 minutes. I was actually videoing it for about 30 mins, but I heard it a few minutes before that so I am guessing 40 mins total. I went back out and checked and the object and the sound was gone. Just before this happened I heard a booming sound in the distance. Not sure if that had anything to do with what I witnessed. This was incredible what ever it was!!!"],"Object Shape":"Cone, Circle, Disc, Sphere, Star-like","Viewing Distance":"Unknown","Case Number":"44350","Latitude":"35.487733","trends":["There have been 7 other sightings in Manchester","There were no other sightings in Manchester on or around December 5th 2012","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/44350.html.txt","/var/www/straped/mufon/org/44350.html"],"Object Flight Path":"Hovering then path,Straight-line path","Log Number":"US-12062012-0001","Object Features":"Unknown","Country":"United States","Date of the Event":"12/05/2012 10:25 UTC","Longitude":"-86.085949","City":"Manchester","Disposition":"Unresolved","Date Submitted":"12/06/2012 12:55 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=35.487733,+-86.085949(44350)&iwloc=A&hl=en\"> mufon case (44350) map </A>","Source":"MUFON"}