{"Region":"Nebraska","Date of the Event":"12/04/2012 10:30 UTC","Log Number":"US-12062012-0002","Case Number":"44351","Date Submitted":"12/06/2012 01:20 UTC","Sighting Duration":"00:05:00","Object Shape":"Boomerang, Square, Rectagular, Triangle, Unknown","Disposition":"Unresolved","Object Features":"Other","Weather Factors":"Unknown","divs":["Sighting DetailsSmoking on my back porch about 30 minutes south of Omaha. I had earlier heard what sounded like the planes as they are just off the runway near the Air Force base in Bellevue, as if it were right above the field across the street directly in front of my house, about thirty minutes before I watched my UFO with my cigarette. I still don't know what the first sound was I just resigned myself to the notion that it was a low airplane as it wouldn't be the first to fly low enough to be heard above videos on a laptop in you home. While smoking I was trying to see what constellations and planets I could make out as they slipped in and out of hiding behind the clouds that had been slowly stretching across the night. I was about half done with a cigarette and sitting on the railing with my feet upon a chair looking down towards my feet when I heard it. It was no louder than a typical plane flying at a normal \"low\" distance in the sky at first and I paid no attention right away. The sound was from behind and I realized as it grew more audible that it was making a path that would cross over my house soon. I twisted my neck to face as far as possible to look behind me to find the source without moving my whole body and I saw \"a car flying below the cover of clouds\" more like drifting or gliding in a very controlled manner its subtle change of directions was nowhere as abrupt and noticeable as the jarring movement of a plane. I thought well here is that plane from earlier I heard why would it or maybe another of course possibly make such a low flight in the same area in such a short amount of time? I positioned my body so as to comfortably keep my gaze on the object and couldn't even find words of amazement as it sunk lower and lower and i was confinced my house was about to be ruined or this plane, or rather I realized at the same moment it was not a plane at all, was going to crash into my mothers willow tree in the middle of the backyard. About when it was nearest the tree I could see that the lights that looked like headlights (similar to the ones seen on some planes) where much different than said plane-type headlights. These lights were unwavering, projected all the way to the ground and i could clearly make out two 6-10 foot wide circles of light at the bottom of the light stream. It was also then when it became impossibly slow for a planes speed required to fly as perfectly still as the object was at the hight it was. It was likely 15-30 feet away from where I sat now and I could tell it had a rectangular front end and the lights were mounted on the front of this but they were so bright the rest of the body was hard to make out against the sky. I could tell for certain that this object flew at a 45 degree angle constantly and made out the possibility of one wing like protrusion from the main body. Its size was definitely no bigger than a medium sized willow tree and seemed to be the size of a personal aircraft. about 100-150 feet was how far it had to travel from the time it reached the willow tree and it was the longest part of its flight it seemed to almost completely stop for a short time and I just stared and it let me have all the time I needed to observe it as well as possible and I even lit another cigarette. I had deliberately left my phone downstairs so I wouldnt keep myself from looking at the stars and now I regret it because the pictures would have been crystal if the object didn't affect my phone. After maybe a minute or two it slowly resumed its movement in a quicker yet still not very fast manner. I got off my porch and walked to the side of my house where it had headed and saw it miss more trees and cross the street and continued in a 45 degree tilt shining those brilliant beams of light on the ground as it went. I was cold and tired and didnt know what to think and just silently walked back inside not even caring where it went or if it changed any aspect."],"City":"Beaver Lake","Latitude":"40.92144","Tags":"City","Viewing Distance":"20 Feet or Less, 21-100 Feet","Longitude":"-95.876277","trends":["There have been no other sightings in Beaver Lake","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/44351.html.txt","/var/www/straped/mufon/org/44351.html"],"Object Flight Path":"Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=40.92144,+-95.876277(44351)&iwloc=A&hl=en\"> mufon case (44351) map </A>","Source":"MUFON","Country":"United States","Summary":"flew pointed @ 45deg.tilt 1small R-light 2 fixd cone-beam-lights litup ground 5min to X-byard 2-3trees up"}