{"Object Features":"Dome, Wings","Summary":"boomerange type with dome center no sound but lots of static when above","Latitude":"38.408384","Date Submitted":"12/06/2012 05:24 UTC","Log Number":"US-12062012-0015","Longitude":"-90.416071","map":"<A HREF = \"http://maps.google.com/maps?q=38.408384,+-90.416071(44364)&iwloc=A&hl=en\"> mufon case (44364) map </A>","Weather Factors":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/44364.html.txt","/var/www/straped/mufon/org/44364.html"],"Disposition":"Unresolved","trends":["There have been 2 other sightings in Imperial","There were no other sightings in Imperial on or around June 1st 1978"],"Object Shape":"Boomerang, Other","Date of the Event":"06/01/1978 01:00 UTC","Tags":"City","divs":["Sighting DetailsI am writing because this is a life long event that I am finally realizing may have been a life long problem. It actually started as what I thought was a reacurring dream through my childhood. This is a dream that I clearly remember to this day. Then, in my early teens I actually saw this thing during the day hovering above me and will never forget it. My mother told me I was silly but my father comforted me and said he and his father had saw somthing that seemed about the same thing. But, it was at this time that my dreams actually stopped. Though my life doctors and surgeons have found problems with me that nobody can explain. For instance, my son had to be born by c-section and the doctor told me my abdomen was full of scar tissue which would account my abnormal pregnancy but nobody could give an explanation of how it got there. In the last few years I have begun to experience strange things again. I have always kept my mouth shut about it simply because of my mother's reaction when I was young. However, with the television I have seen too many documentaries that nearly recant my experiences with sightings and visitations. I am currious to find out more about what has been going on, off and an, most of my life."],"City":"Imperial","Source":"MUFON","Object Flight Path":"Hovering then path","Viewing Distance":"21-100 Feet","Region":"Missouri","Sighting Duration":"Undisclosed","Case Number":"44364"}