{"map":"<A HREF = \"http://maps.google.com/maps?q=38.416275,+-81.537772(44366)&iwloc=A&hl=en\"> mufon case (44366) map </A>","Sighting Duration":"Undisclosed","Summary":"encounter with being of unknown origin","Weather Factors":"Unknown","divs":["Sighting Details1. once walking in the woods, outside bedroom window face to face,burnt circle present in woods day after. 2.heard noise outside window , yanked curtains open, suprise of my life. also in woods. 3.some entity not of this time or world possible. 4.heard noise outside window, opened curtains to scare off whoever-gazed at entity for several minutes until it moved right up to my face, fell back in bed, could not scream, could not move, terrrified as certain i could not doubt whati saw.i will never forget this thing, or abomination from somewhere unknown. 5.The face appeared to be like plated metal, small peices. i witnessed a large being aproximmately 9 ft. tall, huge red glowing eyes, what looked like un even metal titanium like face with mouth with metal grimmace, hovering about 2 ft offf ground. Ilooked it over and saw it to be wearing like a cloak or dark robeing material. As i looked closer, it moved from3ft away, right up to the window face to face. I became petrified and fell back into the bed trying to scream to my parents. I couldnt move, i was petrified with fear.went into the woods behind house next day, where i saw a burnt circle about 30 ft in diameter that was not there the day prior. I heard a noise up the path about 30 yrds away, sounded like an electric generator or machine winding up , and witnessed this thing hovering above the ground approaching me. AlthoughIwas armed with a shotgun, as I hunted those woods like the back of my hand. Instantly I turned and ran for my life from those mountain top woods until I was back home. I ran so fast and hard praying not to trip, that when I got home my ankles were black and blue from almost spraining them. 5. Intresting note; I told my sister who is a college professor about this, as I did not talk about it to my very christian oriented family because i wwas afraid they might think i was looney, but my sister was coming home for christmas and had just crossed the Point Pleasent bridge, stopped at the other side for a cup of coffee, and the bridge collapsed killing about 60 people or so I think. My mouth just dropped when I heard her story that i had never, ever been aware of. If you would like, I could schetch it for your convienience, as I will never forget what I saw. The following I respectfully submit to you in all and true honesty to the best of knowledge..respectfully, John"],"Tags":"City","Object Shape":"Sphere, Other","files":["/var/www/straped/mufon/html2text/44366.html.txt","/var/www/straped/mufon/org/44366.html"],"Object Flight Path":"Path then hovering,Other","Viewing Distance":"20 Feet or Less","Disposition":"Unresolved","Latitude":"38.416275","Case Number":"44366","Log Number":"US-12062012-0017","trends":["There have been 13 other sightings in Charleston","There were no other sightings in Charleston on or around November 17th 1965"],"Date of the Event":"11/17/1965 10:30 UTC","Country":"United States","Object Features":"Window(s), Appendage(s), Other","Longitude":"-81.537772","Source":"MUFON","City":"Charleston","Region":"West Virginia","Date Submitted":"12/06/2012 07:01 UTC"}