{"Object Features":"None","Date of the Event":"12/05/2012 07:00 UTC","divs":["Sighting DetailsWE WATCHED MANY ORBS TURN INTO MANY FORMATIONS. THE MILITARY HAS CLEARED MY AIRSPACE FOR THE DAY AND NIGHT AND I KNOW WHY!!!!STOP CHASING THESE THINGS WITH FIGHTER JETS CONTINOUSLY OVER MY NEIGHBOORHOOD!!!!!!!!!!!THIS IS A RESIDENTIAL AREA AND WE ARE TIRED OF JETS SCREAMING PAST OUR HOUSE AFTER THE THESE CRAFTS!!!!GO PRACTICE OVER THE CEAN IT IS 2 MILES AWAY, IT IS UNSAFE, UNPRACTICLE AND UNETHICAL DO BEING SUCH MATTERS OVER A MAJOR TOURIST DESTIBATION, I HAVE BEEN RECORDING ALL THIS FOR 6 MONTHS, I KNOW THE AIR FORCE HAS NO REASON TO BE TRAINING EXERCISES CONTINOUSLY OVER MY HOUSE, I WOULD BE UPSET IF IT WERE JUST A SINGLE ENGINE PLANE, BUT THIS IS AND WE DEMAND A VALID LOGICAL EXPLANATION WHY OUR MILITARY WOULD BE PUTTING MY FAMILY IN DANGER, MY WIFE AND KIDS ARE AFRAID TO LEAVE THE HOUSE. GET YOUR ACT TOGETHER, MUFON INCLUDED, I HAVE BEEN CONTACTING YOU AND STATE DIRECTER SINCE JULY, AND ALL IVE HEARD IS SPENT FLARE CASINGS, DO THEY FLY INTO AND FROM AIRCRAFT, OR COMMERCIAL JETS. I HAVE VIDEO FOR ALL!!!!!IF YOU ARE TESTING GO TO A MILITARY TEST SITE OR THE OCEAN OR YOUR BASE, AND DONT DROP WASTE ON MY HOUSING AREA I HAVE HOURS OF FOOTAGE OF THAT DAY AND NIGHT, DO PEOPLE WANT TO SEE THESE ORBS GOING TO AND TOUCHING COMMERCIAL JETS.PLEASE JUST STOP OR CALL ME AND GARAUNTEE MY SAFTY, NO WAY YOU CAN!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"],"Object Shape":"Diamond, Sphere, Triangle","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Country":"United States","Disposition":"Unresolved","Tags":"City","Case Number":"44362","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/44362.html.txt","/var/www/straped/mufon/org/44362.html"],"Sighting Duration":"Undisclosed","Summary":"AMAZING CRAFTS IN FORMATION CHASED FOR HOURS BY MANY MANY FIGHTER JETS!!!!!","Viewing Distance":"21-100 Feet","trends":[],"Longitude":"-81.159704","City":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.844791,+-81.159704(44362)&iwloc=A&hl=en\"> mufon case (44362) map </A>","Region":"South Carolina","Log Number":"US-12062012-0013","Latitude":"33.844791","Source":"MUFON","Date Submitted":"12/06/2012 02:23 UTC"}