{"Log Number":"US-12062012-0020","Date Submitted":"12/06/2012 08:20 UTC","City":"Panama City Beach","Sighting Duration":"00:00:45","files":["/var/www/straped/mufon/html2text/44369.html.txt","/var/www/straped/mufon/org/44369.html"],"Latitude":"30.214822","divs":["sighting detailsme and a friend had went to pcb for the weeekend 0f 11\\23-11\\25 for a much needed break since i have been confined to a wheelchair for the last four months due to a injury to my leg and several months to go.on saturday night(11\\24) we were back in our unit at the resort. i had been out on the balcony shooting some video of the beach and enjoyimg the cold evening. at appro.22:00 hrs.i was getting cold and my video recorder was out of battery.i proceeded to go in our room.i opened the door and backed my wheelchair into the room. after i was in the room still sitting in my wheelchair with the balcony door open i had turned my head to the side talking to my friend.when i turned my head back to look out to the balcony,thats when i seen one reddish\\orange colored sphere.my first thought was someone is shooting fireworks.i quickly decided,no sparks,no hissing,not fireworks. it looked to be traveling west to east,moving at a steady speed.looked like it had one red light in the center of it and a halow or glow from the center light surrounding it.it appeared not to be real far from the coastline.(appr.100yds.)i would say the height could not have been no more than(75-100 ft.)for the fact i was backed up in the room (3rd. floor)ten feet or so from the balcony,still in my chair.there was no sound what so ever that i could hear coming from it. i hollowed to my friend to get the camcorder and come look at this.i grabbed the caamcorder hit the power on and it done nothing.figuring the battery was gone,grabbed my cell phone,took a quick picture while hitting the power button again on the camcorder.i seen the camcorder powering up,so i quickly closed my cell (forgetting to save the picture)trying to get some video as i seen the glow was fading as it looked to be going out in the gulf.end result,no picture,no video. i do not know for sure if it made a rt.turn while moving from west to east to head out in the gulf,or maybe it traveled more from northwest to southeast. never seen anything like this before.i estimate from first sighting,to watching it fade away,as it headed out sea, was (30-45) seconds."],"Object Shape":"Circle, Fireball, Sphere","Object Features":"None","Source":"MUFON","Disposition":"Unresolved","Case Number":"44369","Country":"United States","Tags":"City","Date of the Event":"11/24/2012 10:05 UTC","Summary":"one reddish / orange colored sphere / 75-100 ft. high / 100yds. from coast / travelling west to east","Object Flight Path":"Path with directional change","Longitude":"-85.874997","map":"<A HREF = \"http://maps.google.com/maps?q=30.214822,+-85.874997(44369)&iwloc=A&hl=en\"> mufon case (44369) map </A>","Weather Factors":"Unknown","trends":["There have been 12 other sightings in Panama City Beach","There were no other sightings in Panama City Beach on or around November 24th 2012"],"Viewing Distance":"101-500 Feet","Region":"Florida"}