{"Longitude":"-95.461262","Latitude":"30.165821","Disposition":"Unknown","Tags":"City","Object Shape":"Star-like","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Region":"Texas","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=30.165821,+-95.461262(4437)&iwloc=A&hl=en\"> mufon case (4437) map </A>","trends":["There have been 6 other sightings in The Woodlands","There were no other sightings in The Woodlands on or around February 13th 2006"],"Object Features":"None","Case Number":"4437","divs":["sighting detailsi was at my house, located in conroe, tx, on the afternoon of febuary the 13th. i had stepped outside to smoke a cigarette and wait for my girlfriend to get ready for an upcoming dental appointment. i smoke right outside my garage and almost always look up to the sky. this day was like no other. i was standing there, smoking, and when i looked across the street and up towards the sky, i noticed 2 silver\\star objects hovering about 2k feet off the ground and at about 3-4 miles distance from me. looking at the objects, i first thought they were stars. however, the sky was perfectly blue and the wind was blowing at about 10-15mph (direction unsure). as i stared at the 2 objects for a bit longer, one of them shot across the sky coming to a point behind me and my house and once again commenced to hover. this struck me as odd and at this point i knew they were not ballons due to the fact that they were both hovering at different locations and that one had moved to its present location rather quickly and stopped just as quickley. there was no noise or anything emitted by the objects and there were no strange smells or odors in the area as well. both objects sparkled and seemed to blink while hovering in their respective locations. at about this time, 30 minutes had passed and my girlfriend appeared and was ready to go. since we were running behind, i did not mention it to her until later that day. i lost sight of the object once i entered the vehicle since my mind was on driving at the time. i was somewhat disturbed by what i saw. i was a marine for 12 years and am trained to observe my surroundings. i know what i saw and i know that it was not man made or from this planet. no pics or video of the sighting. am curious as to if anyone else in this area has reported seeing anything pertaining to this report or of anything recently."],"Log Number":"US-02172006-0001","Country":"United States","Date of the Event":"02/13/2006 12:00 UTC","Object Flight Path":"Hovering then path","Date Submitted":"02/13/2006 12:00 UTC","Summary":"Two silver/star type objects spotted over Conroe, TX","files":["/var/www/straped/mufon/html2text/4437.html.txt","/var/www/straped/mufon/org/4437.html"],"Source":"MUFON","City":"The Woodlands"}