{"Tags":"City","Case Number":"44377","Region":"Ohio","Country":"United States","trends":["There has been one other sighting in Loveland","There were no other sightings in Loveland on or around December 5th 1985"],"Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/44377.html.txt","/var/www/straped/mufon/org/44377.html"],"Source":"MUFON","divs":["Sighting DetailsI was on my way home in the car with my family coming from dinner, as we pulled up to a stop sign near our house we noticed in front of us two bright orbs in the sky appear from nowhere and they got gradually brighter. They were hovering in the exact same place and never moved. These two orbs were southeast of my position around 400 feet away and around 200 feet in the air. We were already in awe from watching the two stationary orbs, when suddenly another set of orbs appeared suddenly moving very fast. The first two orbs we saw were stationary through the whole event, while the second set of orbs were moving across the sky and were VERY bright and may be better described as balls of light than orbs when compared to the stationary orbs. The second set was much closer to us, around 150 to 200 feet in front of us and barely over 100 feet above the ground. The strangest part of all was the nature of how these orbs were moving across the sky. The orbs moving across the sky were disappearing and reappearing in different positions while never changing speed or direction. There were always two moving orbs visible and they were always equidistant from each-other moving in the same direction. But while they were moving the orb in the back would disappear and reappear in front of what was the first orb. This kept repeating multiple times very fast. The orb in the rear would disappear and reappear in the front, than the next would disappear and reappear in front. This happened 6 or 7 times, and in rapid succession, making what can be best described as a dotted line along their heading. They travelled from south-east of my position to north-east, skipping across the sky in rapid succession, while the first two orbs we saw were stationary throughout the whole event. The moving orbs suddenly disappeared, and the stationary orbs faded out at the same time slightly slower. The whole event only lasted 20-30 seconds. There was no sound during the event at all which we could hear. It was a very clear night and I could not see anything but stars in the sky after they disappeared. After they disappeared we pulled into a driveway and my father and I jumped out and searched the whole sky and could not see anything. A while after the event (45-90 minutes later estimated) a very loud and low flying helicoptor flew over which I only noticed because of what I had experienced earlier. As well as myself, my mother and father (who grew up nextdoor to ufologist Leonard Springfield) witnessed the event and none of us have any explanation for what we saw. My father was sitting next to me in the front and had the exact same view of the event I had. There was a car around a quarter mile behind us facing the same direction we were, I feel they would have seen what we did also, but have no idea who it was."],"Date Submitted":"12/07/2012 03:25 UTC","Object Flight Path":"Stationary,Straight-line path,Other","Longitude":"-84.300599","Log Number":"US-12072012-0002","Object Features":"Unknown","Summary":"Two hovering stationary orbs appered, then separate very bright orbs appeared and skipped across the sky in a straight line","Object Shape":"Fireball, Sphere","City":"Loveland","Sighting Duration":"00:00:30","Date of the Event":"12/05/1985 06:51 UTC","Disposition":"Unresolved","Latitude":"39.229306","map":"<A HREF = \"http://maps.google.com/maps?q=39.229306,+-84.300599(44377)&iwloc=A&hl=en\"> mufon case (44377) map </A>","Weather Factors":"Unknown"}