{"Object Shape":"Cylinder","City":"Jacksonville","Viewing Distance":"Unknown","Log Number":"US-12072012-0004","Tags":"City","files":["/var/www/straped/mufon/html2text/44379.html.txt","/var/www/straped/mufon/org/44379.html"],"divs":["Sighting DetailsI was sitting in my apartment living room watching television . My chihuahua was in the livng room with me and had been asleep for hours under the comforter and my pug was asleep with my son in his bedroom. Suddenly both dogs started barking frantically. I grabbed my robe and went outside to see what might have them so upset, expecting to find a stray cat. I did not see anything. As fast as they had started barking they stopped. I decided to sit on the porch and have a cigarette hoping to run off the stray cat if it came back. I was watching the movement of the clouds in the sky and there was absolutely nothing there but clouds and the occasional star that would become visible when the cloud passed by. I turned my head to put my cigarette out and saw a bright green flash out of the corner of my eye. I turned my head to see what it was and saw a neon green object hovering in the sky. The object was shaped like three cylinders side by side. Each cylinder had a top and bottom shaped like a cone. The object was glowing. The outer edge and the area where each cylinder seemed to be attached were a slightly daker shade of green and not glowing. The object hovered for several seconds and then quickly dropped to right above the tree line on the mountain at which time it turned from it's vertical position to a horizontal position and moved above the tree line briefly before dropping down behind the mountain out of my sight. During the whole sighting I heard no sound at all from the object. During it's horizontal movement there was a large gust of wind. I can't say if the wind gust came from the object if it was just a coincidental natural wind gust. I felt no fear of the object, just shock at seeing it. I also observed no external lights on the object, it appeared more as if it were lit from within."],"Object Flight Path":"Hovering then path,Path with directional change","Object Features":"Unknown","trends":["There have been 4 other sightings in Jacksonville","There were no other sightings in Jacksonville on or around December 6th 2012"],"Longitude":"-85.753674","Country":"United States","Date of the Event":"12/06/2012 12:00 UTC","Disposition":"Unresolved","Summary":"3 attached cylinder shaped objects with both top and bottom having a cone shape in sky over Jacksonville, AL","Weather Factors":"Unknown","Case Number":"44379","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.822022,+-85.753674(44379)&iwloc=A&hl=en\"> mufon case (44379) map </A>","Region":"Alabama","Date Submitted":"12/07/2012 03:41 UTC","Source":"MUFON","Latitude":"33.822022"}