{"Object Flight Path":"Path with directional change","Object Features":"Unknown","Viewing Distance":"Over One Mile","divs":["Sighting DetailsI was working in my backyard. I am a 'skywatcher' and do look up occassionally. Looking NNW this morning I noticed 2 white dots at about 55-65 degrees. I have no idea how far away they were. I work outside about 3-4 miles from the Burbank Airport and have seen, what I believe to be, released weather baloons. I watch them just float up and into the atmosphere. These 2 looked the same except they were going a little bit faster. One of them veered off and did a circle. I thought that odd. Then it did another circle. Suddenly about 6 other white dots joined the 2. I have no idea what direction they came from. They began to flock around like birds, circling each other and diving in and out. When some of them made turns they lost their brightness like what one would expect from a white bird circling. Perhaps this was a bird flocking activity. From the distance I believe I saw the event from they would have had to have been awfully big birds. The event lasted from 3-5 minutes. At the end they broke off and went seperate ways and I quickly lost sight of any of them."],"map":"<A HREF = \"http://maps.google.com/maps?q=34.059924,+-118.236485(4438)&iwloc=A&hl=en\"> mufon case (4438) map </A>","City":"Los Angeles","Weather Factors":"Unknown","Case Number":"4438","Longitude":"-118.236485","Date of the Event":"02/16/2006 10:15 UTC","Sighting Duration":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/4438.html.txt","/var/www/straped/mufon/org/4438.html"],"trends":["There have been 404 other sightings in Los Angeles","There was one other sighting in Los Angeles on or around February 16th 2006"],"Date Submitted":"02/16/2006 10:15 UTC","Log Number":"US-02172006-0002","Summary":"6-8 white dots seen 'flocking'","Country":"United States","Latitude":"34.059924","Disposition":"Unknown","Region":"California","Object Shape":"Star-like","Source":"MUFON"}