{"Date Submitted":"12/07/2012 04:38 UTC","files":["/var/www/straped/mufon/html2text/44388.html.txt","/var/www/straped/mufon/org/44388.html"],"Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-83.611792","Object Features":"None","Date of the Event":"11/11/2012 09:01 UTC","Weather Factors":"Unknown","Object Flight Path":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.001872,+-83.611792(44388)&iwloc=A&hl=en\"> mufon case (44388) map </A>","Country":"United States","City":"Burton","Case Number":"44388","divs":["Sighting DetailsIt has taken me a few weeks to tell my story, and that's only because of the backlash people get when they report anything \"odd\". I was sitting in my chair in the living room on Sunday November 11th, 2012 (watching Once Upon a Time that I had recorded) when I glaned out my front window which faces West and observed 3 BRIGHT lights extremely low in the sky. I turned back to watch my program for a second and with the lights in my mind glanced back out the window and they were gone. I went to bed that night still wondering about those lights. The next morning as I was sitting in my same chair drinking my coffee I looked out that same window when I realized that whatever I had seen the previous night had to be flying just above the treetops and it had to have been HUGE. I thought \"maybe it was a plane\" as there is an Airport some distance from me located in Flint, MI. But I have lived in this home for over 26 years and in all that time I have never seen a plane flying that low. Grant it, when I am out near the airport planes decend all the time,nd of course on take off they are low, and that would not be unusual. But how could it be gone in a second? and why was it flying that low so far away from the airport heading East when the airport is some miles West from me? Anyway a few days later my sister happened to mention a UFO siting that was in the newspaper (I don't buy the newspaper). I asked her when was it and what did the article say. I was shocked to learn it was the same night I saw whatever it was I saw. I have no idea what I observed, but if a LARGE plane was flying that low wouldn't I have heard something? I didn't hear a sound. I am reporting this because I just couldn't let it go without saying something and also my sister urged me to report it. I have been searching for an explanation as to what the person reported seeing on Nov. 11th as I heard it was being investigated but have not found anything yet."],"Disposition":"Unresolved","Region":"Michigan","Object Shape":"Triangle","Latitude":"43.001872","Sighting Duration":"00:01:00","trends":["There have been 4 other sightings in Burton","There were no other sightings in Burton on or around November 11th 2012"],"Log Number":"US-12072012-0013","Source":"MUFON","Summary":"3 bright lights observed at tree top level when I glanced out my living room window which faced west"}