{"Date of the Event":"06/15/1982 03:00 UTC","Latitude":"40.116489","Country":"United States","Object Flight Path":"Hovering then path","Summary":"late night, quick sighting, long time ago by myself and friend (next door neighbor)","Viewing Distance":"101-500 Feet","Region":"Pennsylvania","Source":"MUFON","City":"Philadelphia","Date Submitted":"12/07/2012 04:01 UTC","Weather Factors":"Unknown","Disposition":"Unresolved","Longitude":"-75.03644","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around June 15th 1982"],"Sighting Duration":"00:04:00","Tags":"City","divs":["Sighting DetailsI realize this happened a long time ago - 30 years or so but I still remember it quite vividly... It was late at night, like 3:00 am or so and my friend and myself were walking around the neighborhood - which was in Northeast Philly - very close to Buck County which from what I hear is a bit of a UFO hot spot. We (my next door neighbor and myself) were about 15 years old or so and that was our kicks. That is, walking around the neighborhood late a night as kids was \"exciting\" and we used to do it from time to time when we slept over each others' house. This particular night was just on of the nights in which we took one of our little walks. Anyway, just around the corner from our houses, we noticed an object hovering directly over another one of our neighbor's houses. We both stopped and looked at this object, which was completely silent as it hovered directly over the house. The object looked like a \"monorail\" car to me which had 3 circular engine like objexts on one end which looked like would be used for propulsion... Anyway, I don't quite remember how long we stared at it but the very next thing I do remember was that this object was suddenly not over the house anymore but almost out of view in the night sky. I don't remember it \"flying\" awsay from the house, but just that I saw it over the house one moment, and the next thing I know it was almost out of view in the night sky. It wasn't until years later when I took a college course taught by Dr. David Jacobs (I guess he was a fairly prominent figure in the UFO world at that time) at which I realized the significance of what I saw years earlier.. namely that the object hovered without making a sound, and then I guess I had a lapse of memory because the next thing I remebered was that the object was almost out of view - I don't remember the object as it stopped hovering over the house and started to move away. So after all these years, and while currently watching an episode of \"UFOs over earth - actually about sightings in Bucks County PA in 2008\", I decided to submit this report. Please feel free to contact me if interested as I would love to share more of this with you guys. Sincerely.. UFO Enthusiast"],"Case Number":"44381","Log Number":"US-12072012-0006","Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=40.116489,+-75.03644(44381)&iwloc=A&hl=en\"> mufon case (44381) map </A>","Object Features":"Other","files":["/var/www/straped/mufon/html2text/44381.html.txt","/var/www/straped/mufon/org/44381.html"]}