{"divs":["sighting detailsbetween 6:45-6:50 am on 12\\7\\12 i saw a huge flash of white light that seemed to be at ground level as i was driving to work. it was big enough that i instinctively hit my brakes thinking something was coming at me. once the car was stopped i looked all around me and did not see the source of the light or any activity in the area that could have been the cause. i then looked to the sky and still saw nothing except for a pretty sunrise. my car window was all the way down and there was no sound to go with the light. i started driving again and continued to look for the source in the immediate area and found none. i then thought it might have come from one of the refineries along 225 and looked there once i got to the freeway. again, i saw no sign of what could have caused the light. i promptly forgot about the situation until a few hours later when a friend posted an article about it on facebook. on that thread another person and i started talking about how we both saw the light at the same time. she also thought it was at ground level and not from the sky. the posted article stated that \"experts\" were claiming the flash came from a meteor. the other person that was posting that she saw it was almost 40 miles away from me in richmond, tx (near cinco ranch, tx she said) when she saw the same flash of light."],"Longitude":"-95.208101","Sighting Duration":"Undisclosed","Viewing Distance":"20 Feet or Less","Case Number":"44386","Weather Factors":"Unknown","Date of the Event":"12/07/2012 06:45 UTC","City":"Pasadena","Log Number":"US-12072012-0011","Object Shape":"Flash","Object Flight Path":"Unknown","trends":["There have been 10 other sightings in Pasadena","There were no other sightings in Pasadena on or around December 7th 2012"],"Date Submitted":"12/07/2012 12:52 UTC","Object Features":"Unknown","Country":"United States","Latitude":"29.698972","Region":"Texas","Tags":"City","Source":"MUFON","files":["/var/www/straped/mufon/html2text/44386.html.txt","/var/www/straped/mufon/org/44386.html"],"Summary":"No UFO seen. Witness to blinding flash of light in Houston area this morning.","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=29.698972,+-95.208101(44386)&iwloc=A&hl=en\"> mufon case (44386) map </A>"}