{"City":"Central Lake","Object Features":"None","Latitude":"45.072786","Viewing Distance":"Over One Mile","divs":["sighting details i was at the time of the sighting lying in bed reading a book at the time of the occurrence. my brother walked outside approximately 10:06pm and noticed four triangular shaped objects coming in from the west. i was called down to observe and at that time, which was 10:14pm, i could make out three of those objects. my brother described seeing a flash of light and hearing a bang and one of the objects disappeared apparently before i had arrived to witness the event. there were three objects which were triangular shaped , appeared to be just west of the village, suddenly one of the three vanished . the remaining two glowed very brightly, appearing to be of three distinct colored lights sources from the objects. the colors were of an orange\\yellow\\ red pulsating or blinking nature. movement was slow and after a minute or so they changed direction to the south west and faded from view. i continued to scan the area of the last contact sighting and also to an area of sky behind me for any other objects but observed nothing. i felt a great elation to having viewed the objects and tried to keep calm and make some mental notes of the type, distance, speed and direction of travel."],"Source":"MUFON","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Disposition":"Unresolved","Case Number":"44393","Region":"Michigan","Summary":"Four triangular shaped objects, glowing with pulsating or blinking colored lights consisting of orange,red and yellow sighted at approximatley 10:06 PM above or just west of the village of Central Lake, MI.","Tags":"City","Longitude":"-85.260583","Date Submitted":"12/07/2012 10:55 UTC","Date of the Event":"12/07/2012 10:06 UTC","trends":["There has been one other sighting in Central Lake","There was one other sighting in Central Lake on or around December 7th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=45.072786,+-85.260583(44393)&iwloc=A&hl=en\"> mufon case (44393) map </A>","files":["/var/www/straped/mufon/html2text/44393.html.txt","/var/www/straped/mufon/org/44393.html"],"Country":"United States","Log Number":"US-12072012-0016","Object Shape":"Triangle"}