{"Object Features":"None","Case Number":"44396","Object Flight Path":"Stationary,Path with directional change,Other","Disposition":"Unresolved","Log Number":"US-12082012-0003","Date Submitted":"12/08/2012 12:48 UTC","Source":"MUFON","trends":["There have been 30 other sightings in Longmont","There were 2 other sightings in Longmont on or around December 7th 2012"],"Summary":"Ufos over south Longmont","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Country":"United States","Longitude":"-105.122225","Weather Factors":"Unknown","City":"Longmont","Sighting Duration":"00:02:30","Tags":"City","files":["/var/www/straped/mufon/html2text/44396.html.txt","/var/www/straped/mufon/org/44396.html"],"Region":"Colorado","Object Shape":"Fireball, Sphere, Star-like","Date of the Event":"12/07/2012 07:28 UTC","divs":["Sighting DetailsI was driving home from work, east down highway 119 in Boulder County between Boulder and Longmont. I first saw the ufos at the intersection of 119 and highway 52 (next to IBM). Directly ahead (East) I saw what I though was three planes making an approach to land at DIA. This is a common site in the east at night. I though that they looked a little strange and large. As soon as as I thought this the longer one started to \"fall\" leaving a small trail. Right away i thought maybe a shooting star, but why had they have been almost stationary then start to fall? I called my wife right away. Very soon (a couple of seconds later) the other two started moving right (South) and then they all kind of danced around each other slowly moving down, although the did make movements up. I was on the phone with my wife the whole time and it was a 3 minute phone call, so I figure about 2.5 minute duration. They all did gradually move downward disappearing behind the treeline. At one point they all dissappeared for a few seconds only to reapear. I estimate they were between 1-2.5miles away. Between the size of a star and and asprin at roughly 30 degrees from the horizon. They all left small glittering trails but not flame like. When the last one moved behind the tree I did not see them again."],"Latitude":"40.087394","map":"<A HREF = \"http://maps.google.com/maps?q=40.087394,+-105.122225(44396)&iwloc=A&hl=en\"> mufon case (44396) map </A>"}