{"Case Number":"44402","Region":"North Carolina","Sighting Duration":"Undisclosed","Tags":"City","trends":["There have been 31 other sightings in Raleigh","There was one other sighting in Raleigh on or around December 8th 2012"],"Date Submitted":"12/08/2012 01:27 UTC","divs":["sighting detailsi was running along the side of the road, looking at the clouds when i noticed a black\\dark grey orb like thing in the sky. it wasn't a plane because there were other planes around and this thing was a definitely spherical in shape. it was by its self and seeming minding its own business, flying due east towards downtown raleigh. it looked to be pulsating blue and red and also looked like it was possibly tumbling through the sky, i couldn't get a close enough look at it even though it was broad daylight, it was quite high in the sky i think. i only had my ipod, sunglasses and keys on me so i couldn't get a picture of it, but i was close enough to home so i ran back as fast as i could to my place to get my phone and ran back to where i saw it but it was gone. i was gone from the place i saw it less than three minutes, and it didn't appear to be moving that fast :(. i went a bit farther down the road to a place where more of the sky was visible but still couldn't see it. i'm not really into ufos and such but i honestly have no idea what else it could be."],"Viewing Distance":"Unknown","Weather Factors":"Unknown","Object Shape":"Circle","Disposition":"Unresolved","Latitude":"35.774046","Country":"United States","Log Number":"US-12082012-0009","Object Flight Path":"Straight-line path","Longitude":"-78.634534","files":["/var/www/straped/mufon/html2text/44402.html.txt","/var/www/straped/mufon/org/44402.html"],"Date of the Event":"12/08/2012 12:40 UTC","Object Features":"None","Summary":"grey orb flying across the sky, looked to be giving off blue and red light","City":"Raleigh","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=35.774046,+-78.634534(44402)&iwloc=A&hl=en\"> mufon case (44402) map </A>"}