{"Summary":"Went outside to take a walk, sat down looking west and to sky. Saw about 4 lights close to each other but not so close to be of the same object then more as they moved hovered and dissapeared. They were coming one after another about 10 or more.","Tags":"City","Latitude":"26.014801","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=26.014801,+-80.14289(44413)&iwloc=A&hl=en\"> mufon case (44413) map </A>","Longitude":"-80.14289","Case Number":"44413","Date Submitted":"12/09/2012 12:31 UTC","divs":["sighting detailswent outside to take a walk, sat down looking west and to sky. saw about 4 lights close to each other but not so close to be of the same object then more as they moved hovered and dissapeared into the clouds. they were coming one after another about 10 or more. inside the clouds through a hole i can see what could have been the back of a plane with lights together on one object but i never saw the plane enter the gap between the clouds. all the lights were small and separated by about 1\\2 mile each more or less so it may have come together to form one object? i couldnt believe what i was seeing and was trying to discount it in my mind. even now but i find no explanation for what i saw!. they were coming one after another about 10 or more. i was without my camera or phone in a residental area. i do not know if anyone else was looking into the evening sky at that time but i was alone."],"Region":"Florida","Log Number":"US-12092012-0001","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/44413.html.txt","/var/www/straped/mufon/org/44413.html"],"Viewing Distance":"Over One Mile","Country":"United States","Object Flight Path":"Path with directional change","Object Features":"Unknown","Date of the Event":"12/08/2012 12:00 UTC","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","City":"Hollywood","trends":["There have been 18 other sightings in Hollywood","There were no other sightings in Hollywood on or around December 8th 2012"],"Source":"MUFON"}