{"Object Features":"None","Sighting Duration":"00:00:35","Latitude":"29.829107","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Disposition":"Unresolved","Source":"MUFON","Date Submitted":"12/08/2012 09:06 UTC","Region":"Florida","Country":"United States","Object Shape":"Circle, Oval, Sphere","Longitude":"-82.59437","Summary":"orb like ball flew in zig zag fast flying across the sky","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=29.829107,+-82.59437(44410)&iwloc=A&hl=en\"> mufon case (44410) map </A>","files":["/var/www/straped/mufon/html2text/44410.html.txt","/var/www/straped/mufon/org/44410.html"],"City":"High Springs","Tags":"City","Date of the Event":"12/07/2012 07:36 UTC","Case Number":"44410","Log Number":"US-12082012-0016","trends":["There have been 2 other sightings in High Springs","There were no other sightings in High Springs on or around December 7th 2012"],"divs":["sighting detailsi was driving to the movies in high springs fl on sr 20\\hwy 411 headed w\\ nw when a blue\\green orb\\circle like object flew from the right side of my vision (across the windshield) it caught my eye at first i thought it was a shooting star i like to wish on them(i know that's lame)i also noticed airplane lights higher up in the sky further to the right of my windshield. then the object stopped in the sky that's when i was shocked that it stopped. then zig zagged back to the right then the left a few times back & forth with speed i've never seen before almost in a downward motion (i have spent 8 yrs. in the military) then in an up word roughly 60 degree motion flew off to the left and it was just gone almost like it just disintegrated in the sky. while the object zig zagged across the sky there were about 5- 10 cars in the lanes in front and around me...all of the cars put on break lights mind you there was no reason for any one to break (traffic was flowing at a steady speed of 46 mph due to a local police parked behind us about 4 miles back pulling radar for drunk driving as they always due on friday night) as i passed to get to the movie theater at least 5 cars pulled over to look and point...this is buy far the most freaked out, excited, scared, surprised i have ever been so much so i pulled over to call my husband after this. it really shook me up. i have yet to tell anyone else except my husband do to being scared of being scrutinized."]}