{"Tags":"City","trends":["There has been one other sighting in Central Lake","There was one other sighting in Central Lake on or around December 8th 2012"],"Date Submitted":"12/08/2012 11:00 UTC","Viewing Distance":"Unknown","City":"Central Lake","Source":"MUFON","Log Number":"US-12082012-0018","Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=45.075286,+-85.252433(44412)&iwloc=A&hl=en\"> mufon case (44412) map </A>","Case Number":"44412","Region":"Michigan","files":["/var/www/straped/mufon/html2text/44412.html.txt","/var/www/straped/mufon/org/44412.html"],"Latitude":"45.075286","Summary":"Observed first of two bright ornage objects at 8:50 PM which lasted for about 10 seconds then appeared to vanish into clouds followed by another object just to the north which lasted only 5 seconds or so,","Longitude":"-85.252433","Object Shape":"Sphere","Weather Factors":"Unknown","Object Features":"Unknown","Disposition":"Unresolved","Date of the Event":"12/08/2012 08:50 UTC","Country":"United States","divs":["Sighting Details I was parked at an intersection west of the village which was located at the top of a ridge looking east over the village. After a few seconds I noticed a bright orange object to the east which seemed to hover for several seconds at about ten degrees above the far horizon, which then appeared to move upward through the cloud cover and disappear. Not more than 2 or 3 seconds later a second object appeared just to the north of the last sighting which also glowed the same orange color. At this point I can't be sure if the second one was a different object or the same one which simply moved location. My reaction was that maybe there was a connection to last night's sighting and the possibility of an upcoming rash of sightings in the area, only time will tell. I brought along a pair of binoculars and used them to observe both sightings. At first I thought it might be the moon but there was no moon visible from my location. This sighting lasted for about 15 seconds or so and preceding that no further sightings were observed."]}