{"Tags":"City","Country":"United States","Date Submitted":"12/09/2012 05:51 UTC","Latitude":"45.158585","Longitude":"-122.593441","Date of the Event":"11/05/2012 12:00 UTC","Region":"Oregon","Object Shape":"Circle, Sphere, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=45.158585,+-122.593441(44417)&iwloc=A&hl=en\"> mufon case (44417) map </A>","Object Features":"Other","Object Flight Path":"Other","Log Number":"US-12092012-0005","Sighting Duration":"Undisclosed","Case Number":"44417","trends":["There has been one other sighting in Molalla","There were no other sightings in Molalla on or around November 5th 2012"],"divs":["sighting detailson 11-3-2012, i took two pictures of the sunset. later that night while reviewing the pictures, i noticed that the sun had another sphere on the left side of it. both were taken from the window of my van while i was driving with 20 seconds in between each photo. if it was glare, it would have bounced around because of me driving and appeared in different spots.. i was free from work for the next two days. 11-4-2012 had rain and overcast all day. at 2pm on 11-5-2012 the sun began to shine through the clouds, so i grabbed my cameras and ran outside to see if there was anything. i had a droid x with an 8mp camera and an ipod 4th generation as cameras. the clouds cleared enough to show the sun and its outline, plus there was another sun in front of it. this other sun is blue and 1\\10th the size. i started taking pictures right there, from the end of my driveway. i remember mainly the flutter of my heart when i saw it, almost like it skipped a beat. excitement that i felt is more significant than fear, but i will bring it to attention. the blue sun is still up there. it is visible all day . be advised... i am not saying to stare at the sun. here are some ideas for those who wish to see for themselves. 1. remove lenses from sunglasses and then \"stack\" (lenses) together for double protection. test on a bright lightbulb. tip: dollar tree has sunglasses 2. welding goggles or helmet 3. take pictures 4. look through the screen on your phone.... everyday i get pictures of it. as i stated in the submission form, i am sending a series from 11-5-2012 only."],"City":"Molalla","Weather Factors":"Unknown","Source":"MUFON","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/44417.html.txt","/var/www/straped/mufon/org/44417.html"],"Disposition":"Unresolved","Summary":"Blue colored sphere that orbits the sun. A Blue Star."}