{"Date Submitted":"12/09/2012 01:55 UTC","Log Number":"US-12092012-0010","Object Shape":"Sphere","City":"San Jose","Country":"United States","Object Features":"None","Summary":"Just after midnight, observed 7-10 red/orange orb-like objects flying east over downtown San Jose, then turn south and disappear.","Object Flight Path":"Path with directional change","Source":"MUFON","Case Number":"44422","Sighting Duration":"Undisclosed","Region":"California","Longitude":"-121.884013","trends":["There have been 106 other sightings in San Jose","There were no other sightings in San Jose on or around December 9th 2012"],"files":["/var/www/straped/mufon/html2text/44422.html.txt","/var/www/straped/mufon/org/44422.html"],"divs":["Sighting DetailsIt was just after midnight and I was outside with my boyfriend. He pointed to an object in flight and asked me what that was. At first, I thought a plane or helicopter but there was no flashing lights. There was a slight twinkle, like you'd observe in a star, but no flashing like you would see on a man-made craft flying at night. Then, I noticed another one. They were coming out of the west, flying east over downtown San Jose, could be near the SJ Airport (SJO), and they wouid appear to gain altitude and then they would turn to the south and the lights would dim to where we couldn't see them. I then witnessed 4 more coming, almost in a formation, taking the same path of the other two. I observed at least 2 of these lights slow down, hover for just a few seconds, then continue on their path and again, dim and disappear. I know they were hovering because I had a point of reference (a telephone pole) and I was able to see one moving away and one staying stationery. About 2-3 more came from the same direction and turn, dim and disappear. The whole event was over the course of about 5 minutes. We came inside immediately begin goggling to see if anyone had reported a similar sighting. We even fired up the police scanner but heard nothing. I knew the event wouldn't last long so I didn't run into the house to grab my camera. I was more interested in seeing this for myself then trying to grab photographic or video evidence of these flying objects."],"map":"<A HREF = \"http://maps.google.com/maps?q=37.356782,+-121.884013(44422)&iwloc=A&hl=en\"> mufon case (44422) map </A>","Date of the Event":"12/09/2012 12:00 UTC","Latitude":"37.356782","Tags":"City","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Weather Factors":"Unknown"}