{"Date of the Event":"12/08/2012 06:22 UTC","Object Features":"Unknown","Weather Factors":"Unknown","Longitude":"-83.394302","Summary":"10 or so lights in a group of \"v\" formation & another 10 but in a t formation p","Source":"MUFON","divs":["Sighting DetailsThe first one we seen was over laplasance rd. There's an outlet mall there along with a couple of gas stations and fast food restaurants. We were heading back from Toledo on North I-75 and seen 10 or so lights in a group of \"v\" formation. It was dark out & The lights were low and almost as soon as my wife and I seen them they began moving west and all but 3-4 lights turned off. The lights then started dimming until we couldn't see them. The object or objects in formation moved smoothly and did not climb in altitude. My wife couldn't believe it and felt scared and sick, I was nervous, but excited and wanted to see if we could see anything else. We got off on the next exit, front street, and was heading west, towards monroe st. When we seen another group of bright lights obstructed by the houses. I turned south going down Wadsworth and the lights were still being obstructed by the houses and were heading west. I turned west down E.5th and then south down laplasance. That's when the lights again about ten but in an upside down \"t\" formation passed over very low. The lights were heading south and began accelerating. I followed them and they began heading west over the quarry.I turned west onto jones and the lights began turning off like the other and it began blinking. They dimmed out just like the other until we could not see them. I pulled over at Navarre field to see if we could see anything else. We didn't see anything so just drove off."],"Date Submitted":"12/10/2012 12:50 UTC","Tags":"City","Disposition":"Unresolved","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Region":"Michigan","Viewing Distance":"501 Feet - 1 Mile","trends":["There has been one other sighting in Monroe Charter Township","There were no other sightings in Monroe Charter Township on or around December 8th 2012","This sighting has never been favorited.",""],"Latitude":"41.875089","files":["/var/www/straped/mufon/html2text/44435.html.txt","/var/www/straped/mufon/org/44435.html"],"Log Number":"US-12102012-0004","map":"<A HREF = \"http://maps.google.com/maps?q=41.875089,+-83.394302(44435)&iwloc=A&hl=en\"> mufon case (44435) map </A>","Object Shape":"Boomerang","Case Number":"44435","Sighting Duration":"Undisclosed","Country":"United States","City":"Monroe Charter Township"}