{"Longitude":"-117.636111","Weather Factors":"Unknown","Source":"MUFON","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=33.746111,+-117.636111(44437)&iwloc=A&hl=en\"> mufon case (44437) map </A>","Latitude":"33.746111","Object Features":"Unknown","trends":["There has been one other sighting in Silverado","There were no other sightings in Silverado on or around December 8th 2012"],"Tags":"City","Date Submitted":"12/10/2012 02:07 UTC","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/44437.html.txt","/var/www/straped/mufon/org/44437.html"],"Sighting Duration":"Undisclosed","Viewing Distance":"Over 1 Mile, Unknown","Object Shape":"Sphere, Star-like","Log Number":"US-12102012-0006","divs":["sighting details1. i was sleeping with the blinds open so i can see the hills when i wake up (my apt faces a canyon\\hills with no houses in front) and see the star-like object flying upward above the hills, in the distance. 2. it was the first thing i saw\\noticed when i opened my eyes. 3. at first, thought it was a bright plane, but then realized it's too bright\\large and it also stopped flying and hovered. 4. object was bright, mostly white but could see colors flashing randomly. after flying upward quickly, stopped, hovered and zig-zagged back and forth, moved side to side, up and down, slowly and quickly randomly, too fast and fluid for known airplane or helicopter to accomplish. 5. realized it wasn't a plane or anything that made sense. sat up in bed staring at it, heart was pounding and i was terrified (i also live alone). was terrified for first 15-20 min, afraid to move or turn on lights inside. eventually stood and kept watching, calling a friend on east coast about it, then texting another friend. this went on a full 40-50 min. 6. lost sight when i was looking down texting and looked back up, it was gone. sky was brightening up with morning."],"City":"Silverado","Case Number":"44437","Summary":"Bright star-like object flying upward, then hovered and zig-zagged, looped, etc.","Country":"United States","Date of the Event":"12/08/2012 05:06 UTC","Region":"California"}