{"Region":"Alabama","City":"Double Springs","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.166505,+-87.428781(44431)&iwloc=A&hl=en\"> mufon case (44431) map </A>","divs":["Sighting DetailsMy wife and I were o n the front deck at home this evening and as always were watching the sky when she noticed a \"plane\" moving slower than the rest. She thought it may be a helicopter and asked why it did'nt have any lights on it. As we watched, it made a very lazy \"S\" turn from SW to NE. A small airplane was approaching from the NE at the same time and we noticed a vector change of the plane further to the west (don't know if it did so as part of flight plan); I grabbed my DVR camera and located the object and recorded until it stopped (hovered) between my town and the lake resort about 10 miles away...then just drifted to the South slightly before disappearing frm my viewfinder. I searched for the next 10 minutes or so giving a commentary zooming in and out searching the sky. Funny thing is that although we could see it visually; it could not be located on the viewfinder! My wife can be heard in the background speaking as well. The sighting lasted for exactly 1 min 25 secs. The first 13 secs of the video got paused by accident. After reviewing the video full screen the object DOES arrear to pulsate a little."],"Object Shape":"Cylinder, Sphere","files":["/var/www/straped/mufon/html2text/44431.html.txt","/var/www/straped/mufon/org/44431.html"],"Source":"MUFON","Log Number":"US-12092012-0020","Summary":"ObservedSW of town moving very slowly, other airplanes in area (within 10-15 Mi)","Date Submitted":"12/09/2012 08:30 UTC","trends":["There have been no other sightings in Double Springs","This sighting has never been favorited."],"Longitude":"-87.428781","Viewing Distance":"Over One Mile","Case Number":"44431","Sighting Duration":"Undisclosed","Date of the Event":"12/09/2012 07:00 UTC","Object Features":"Unknown","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Country":"United States","Disposition":"Unresolved","Latitude":"34.166505","Weather Factors":"Unknown"}