{"divs":["Sighting DetailsIt was early Sunday morning around 3:40 am. My son woke up hungry so I went upstairs to the kitchen to make him a bottle. When I turned around to go back downstairs a light that I have never seen caught my attention in the window. It has been raining here since Friday so it was incredibly foggy with very very limited visibility to the point that weather alerts had been issued. This was the ONLY light that was visible, it didn't blink or move, it was solid white, very bright, and very large. It appeared to be just over the mountain line, I grew up in this area so I know where things are and where they should be. I thought I was seeing things so I moved to another window to have a look. It still didnt move and the trees that should've obstructed my view did not. It was as if the light had followed me to the next room while staying in the same location. It was amazing, as for how I felt, it was a mixture of curiosity and fear. I felt as if I were drawn to the light, at the same time I knew that my son was more important. When I went back downstairs I tried to wake my husband to show him but he wouldn't come look so I went back to bed after feeding my son. That night I looked out the window to see what the light could've been but there was nothing there and hasn't been since."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.654819,+-77.572768(44439)&iwloc=A&hl=en\"> mufon case (44439) map </A>","Longitude":"-77.572768","Region":"Maryland","Sighting Duration":"Undisclosed","Summary":"huge solid white light hovered over the mountain","Disposition":"Unresolved","Log Number":"US-12102012-0008","Source":"MUFON","City":"Smithsburg","Date of the Event":"12/09/2012 03:40 UTC","Case Number":"44439","Latitude":"39.654819","Object Flight Path":"Stationary","Object Shape":"Sphere","trends":["There have been no other sightings in Smithsburg","This sighting has never been favorited."],"Date Submitted":"12/10/2012 05:55 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/44439.html.txt","/var/www/straped/mufon/org/44439.html"],"Object Features":"Unknown","Country":"United States","Tags":"City","Viewing Distance":"Over One Mile"}