{"trends":["There have been 14 other sightings in Springfield","There were no other sightings in Springfield on or around June 30th 2003"],"files":["/var/www/straped/mufon/html2text/4444.html.txt","/var/www/straped/mufon/org/4444.html"],"divs":["Sighting DetailsI am unsure of the exact date and time because it was some years ago. It was a late summer night, approximately 10pm-11pm. I had just got off the bus with my friend as we returned from the summer fair. The walk was a few blocks from the stop to the house. At one point we were crossing the street in a northern direction. Just before we reached the other side I happened to glance up and immediately saw a star much brighter than the others moving at a moderate speed. It sort of looked like a dot on an old arcade machine in how it dragged a tail. But it didnt have a tail. It was like the light didnt dissipate immediately around the star. I'm not sure how to describe that aspect of it. I was looking at the sky at an angle that put the houses in front of us just out of view. The star appeared to be moving northwest. Then, as if it knew it was seen, it switched to a northeastern direction at a sharp angle and a faster speed. Then it streaked across the sky and disappeared. (well a small piece of the sky) When it zipped off, it wasn't like star trek where the space ship gets warp speed and flashes away. It was like it increased speed continually and simply dissapeared. This all happened in under 10 seconds. The time it took to swith direction and zip off must have been under a second. Now i wouldnt have reported this if my friend hadnt seen it as well. I remember that after seeing it and almost tripping on the curb we were both silent for a few moments. I got excited but I wasn't sure if I should mention it because he might not have seen it, so I said, \"Did you see that?\" he said he did and that he was wondering if I saw it too. We had a good laugh about how we saw a spaceship. At the time that I saw it I thought it was a satellite, but oddly bright. It was odd because the light wasnt flashing or pulsating like a star. It was solid. I see satellites all the time in the sky when its clear enough here. I quickly changed my mind when it took off like it did."],"Region":"Oregon","Country":"United States","Tags":"City","Log Number":"US-02182006-0001","Object Shape":"Circle, Sphere, Star-like","Latitude":"44.050696","Date Submitted":"06/30/2003 12:00 UTC","Summary":"bright light moves slowly, changes direction, then zips off fast","Sighting Duration":"Undisclosed","City":"Springfield","Case Number":"4444","map":"<A HREF = \"http://maps.google.com/maps?q=44.050696,+-123.019979(4444)&iwloc=A&hl=en\"> mufon case (4444) map </A>","Weather Factors":"Unknown","Date of the Event":"06/30/2003 12:00 UTC","Viewing Distance":"Over 1 Mile, Unknown","Object Features":"Unknown","Longitude":"-123.019979","Object Flight Path":"Path with directional change","Disposition":"Insufficient Data","Source":"MUFON"}