{"Sighting Duration":"Undisclosed","trends":[],"Viewing Distance":"501 Feet - 1 Mile","Object Features":"None","Disposition":"Unresolved","Latitude":"35.2057","map":"<A HREF = \"http://maps.google.com/maps?q=35.2057,+-91.823333(44441)&iwloc=A&hl=en\"> mufon case (44441) map </A>","Region":"Arkansas","Longitude":"-91.823333","Date of the Event":"10/20/2007 12:00 UTC","Case Number":"44441","Date Submitted":"12/10/2012 09:44 UTC","Weather Factors":"Unknown","Log Number":"US-12102012-0010","Tags":"City","files":["/var/www/straped/mufon/html2text/44441.html.txt","/var/www/straped/mufon/org/44441.html"],"Object Flight Path":"Path with directional change,Path then hovering","Source":"MUFON","City":"Undisclosed","divs":["Sighting DetailsMy husband and I were traveling southeast from Delaplaine Arkansas along hwy 34 a little past Evening Star going towards Paragould around 10 pm when we saw the sky starting to change colors. It looked like what we had seen and heard about the aurora borealis. We stopped the car on a gravel drive by a farm field and got out to watch it as it was getting more visible and the colors more vivid. We didn't know that you could see the aurora borealis this far south but that is what it looked like to us. We had been watching what we thought was the aurora borealis for about 20 minutes when a movement in the sky to the left caught my eye. I saw a large red glowing round shaped light to our northwest. It caught my eye because it was moving very erratically. I verified with my husband if he saw the same thing and he said yes that he had noticed it about the same time that I did. We discussed a possible helicopter or plane but that was quickly ruled out when the light defied speed and direction change for that of a helicopter or plane. The glowing red light shot straight up in the sky very high and very fast then hovered, then shot quickly to the right in the sky and hovered again, then shot down again at a diagonal and hovered closer to the tree line where it continued to move slowly and horizontally towards the east for a little while. Over the two hours that we watched it it did many of these type of manuevers over and over again in a large but similiar area. The only constant was that every time it descended back toward the ground it would stop and then move horizontally at a slow pace as if it was looking at something. We continued to watch it do these erratic patterns of movement for a little over 2 hours until it appeared as if it were getting closer. We thought that because the light appeared to be getting bigger and brighter but wasn't moving up, down, right, nor left. So, we decided to head home in case whatever it was was as aware of us as we were of it. In retrospect I think that it was probably just a coincidence that it got close to us because it didn't appear to be following us but continued to do what it had been doing when we first noticed it. As we left I watched it out of the sun roof and then out the back of the rearview window until I couldn't see it anymore because of the trees along the ridge. We left heading west on hwy 34 towards Paragould. When we got home neither one of us could sleep. We ended up staying up the rest of the night talking about it. The next day after we left work we headed to the library and the local bookstores to see if we could find reports of anyone else seeing something similiar to what we saw or books that talked about ufo sightings. Up until this past couple of months I hadn't heard of anyone else that had seen something similiar but thanks to Youtube and organizations like this I am now more aware that their are many others out there. Thank you for documenting and bringing light to such a hard subject."],"Summary":"Large red glowing light seen while we watched Aurora Borealis. It moved erraticly at times and then hovered at other times. Was viewed with husband for a little over two hours until it started getting brighter and closer. Then we left the area.","Object Shape":"Sphere","Country":"United States"}