{"Date of the Event":"12/08/2012 09:45 UTC","divs":["Sighting DetailsMy boyfriend works at Hilshire Farms which used to be Sara Lee a few months ago. I had left my cell phone in his car so I went and retrieved it. As I was leaving his work I went to turn on Cass Road and I got this urge to look up. The night sky was covered with clouds except for this little clearing that had this strange orange glowing orb moving really slow through the sky. I pulled over and watched the craft for about 5 minutes until the craft was un-observable due to the cloud coverage. This object had no hazard lights, no sound (I got out of my car to watch it), and it was moving eerily slow. Back in February of 2012, my friend and I were heading to work and when we were passing the town on Kingsley going west we witnessed the same exact craft, almost a perfect replica of what I saw 3 nights ago. From what I have read this orange glowing crafts are becoming more and more common and people are speculating them to be those Chinese Lanterns, these crafts were in no shape or form Chinese Lanterns. I have seen Chinese Lanterns emitted in the night sky to know the difference."],"Object Shape":"Fireball","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/44450.html.txt","/var/www/straped/mufon/org/44450.html"],"Longitude":"-85.625568","Source":"MUFON","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","trends":["There have been no other sightings in Garfield Township","This sighting has never been favorited."],"Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=44.735322,+-85.625568(44450)&iwloc=A&hl=en\"> mufon case (44450) map </A>","Region":"Michigan","Object Flight Path":"Hovering then path","Date Submitted":"12/11/2012 12:54 UTC","Summary":"2nd Sighting that I have observed this year of this same type of UFO in Northern LP Michigan","City":"Garfield Township","Case Number":"44450","Sighting Duration":"00:05:00","Latitude":"44.735322","Log Number":"US-12112012-0005","Country":"United States"}