{"Viewing Distance":"Unknown","Latitude":"40.087708","map":"<A HREF = \"http://maps.google.com/maps?q=40.087708,+-104.981167(44462)&iwloc=A&hl=en\"> mufon case (44462) map </A>","trends":["There has been one other sighting in Erie","There were no other sightings in Erie on or around December 11th 2012"],"Weather Factors":"Unknown","Object Flight Path":"Other","files":["/var/www/straped/mufon/html2text/44462.html.txt","/var/www/straped/mufon/org/44462.html"],"Tags":"City","Object Shape":"Star-like, Other","Case Number":"44462","Object Features":"None","Log Number":"US-12112012-0013","Sighting Duration":"Undisclosed","Longitude":"-104.981167","Country":"United States","Source":"MUFON","divs":["Sighting DetailsI was driving on rt 52 almost to I25 when the bright star that was almost due east of me split into two. At first the bright star stayed in its current postition and a dimmer smaller one split off heading in a southward direction until it was almost below the moon and stopped. When it first started accelerating it left a small trail behind it as if you were seeing a short tail on a meteor. The speed at which it moved was at least twice to three times as fast as the local air traffic. After the small light stopped the bright light started heading in a north west direction and followed the same acceleration pattern with the same \"trail\" behind it. Once it got to speed the trail disappeared and it started to look like a plane but with only one blinking white light. If I did not see the light split or the initial acceleration I would of thought it was just a plane and the other dimmer one was just a star. As I lost sight of the blinking one the dim one was still visiable for 5-10 min without it moving. Then eventually it disappeared. As for other witnesses there may be some as it was early morning traffic but it was only I in my vehicle. I had called my wife right after so the time is pretty accurate."],"Disposition":"Unresolved","City":"Erie","Date of the Event":"12/11/2012 06:12 UTC","Summary":"bright starlike object splitting in two one to the south one the the NW","Date Submitted":"12/11/2012 08:53 UTC","Region":"Colorado"}