{"Weather Factors":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Date of the Event":"08/08/2010 07:42 UTC","Case Number":"44468","Object Shape":"Other","Object Flight Path":"Path then hovering","Longitude":"-100.126488","Tags":"City","trends":["There have been no other sightings in Trent","This sighting has never been favorited."],"Country":"United States","Object Features":"Patterned Surface","City":"Trent","Log Number":"US-12122012-0001","Region":"Texas","Date Submitted":"12/12/2012 12:19 UTC","Summary":"I took 4 photos of this event.","Latitude":"32.489565","divs":["Sighting DetailsThese photos have had reduced exposure only. The first photo signs have been blurred. These are real.. I think you already have my photos, but if not. Here goes....I was traveling on 8-8-2010 from Lubbock back to Houston. My husband and I just stopped for gas and bathroom break. He is waiting for me to get into the car. I look up for some reason and see this explosion. I do not remember hearing anything. I get into the car on the passenger side and asked him to wait I want to take a picture. Hes telling me to hurry up. I rolled the window down and took first photo 7:42am. We are waiting to get onto the highway. We are now on highway and I see this black beam shooting down on top of the 18 wheeler. I say out loud what the hell is that? I took three more photos one right after the other, because we were about to pass it. It is now behind us. All 3 of these photos taken at 7:47am within the same minute. I asked my husband to stop, but he was on a mission to get home before dark. I did not see these photos until Nov of this year. I forgot about them. When I was taking these photos I did not see this Pentagon craft. The explosion was too bright. I only saw it when I started looking at the photos more closely. Chuck has not got back with me on these. I wish someone would. Thank you."],"Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/44468.html.txt","/var/www/straped/mufon/org/44468.html"],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=32.489565,+-100.126488(44468)&iwloc=A&hl=en\"> mufon case (44468) map </A>"}