{"Log Number":"US-12112012-0014","Case Number":"44463","divs":["Sighting DetailsStargazing on a site previously occupied by an elementary school, called \"the plateau\" by my group of friends, where we first reached enlightenment.A craft flew over us, low in the sky, but higher than the tree tops and buildings. Town has low skyline, big skies are a main feature. Sounded like nothing ever heard before, low rumbling engine with a slow turning turbine. At first, we thought a helicopter, that's a fairly logical assumption. But it seemed to be sloping to land, while never doing so, and then the sound wasn't consisted like a helicopter. The craft hovered for a couple minutes, turning off the brighter lights, and turning on rainbow-colored ones that flashed in a certain sequence manifested as triangles. As this was happening, the dome shape once perceived was translucent. Then, the brighter outside lights turn on, and the craft moved to the NE from it's first location due N. Hovered once again, repeated the light sequence, and proceeded to move higher in the sky, and to the W. At this point, my group started traveling in hopes of getting a better look, however, our feet couldn't carry us fast enough and visual was lost. One other and I decided to walk to the general NW to see if another view was possible, and upon reaching the outskirts of town, walked through and incredibly powerful \"wall\" of what seemed to be sulphur, or gunpowder, but there was no smoke or residue to see. Only the sensation. Right before this occurance, I perceived a very strange energy in the area around me."],"Object Shape":"Circle, Disc, Oval, Sphere","Region":"Missouri","Tags":"City","City":"Kirksville","Date of the Event":"12/01/2012 12:00 UTC","Summary":"Lying on hill, stargazing, craft lazily hovered over, light show","Latitude":"40.200014","Source":"MUFON","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Country":"United States","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Features":"Dome, Patterned Surface","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=40.200014,+-92.57814(44463)&iwloc=A&hl=en\"> mufon case (44463) map </A>","files":["/var/www/straped/mufon/html2text/44463.html.txt","/var/www/straped/mufon/org/44463.html"],"Date Submitted":"12/11/2012 09:25 UTC","Longitude":"-92.57814","trends":["There have been 2 other sightings in Kirksville","There were no other sightings in Kirksville on or around December 1st 2012"]}