{"trends":["There has been one other sighting in Cass City","There were no other sightings in Cass City on or around December 11th 2012"],"Weather Factors":"Unknown","Viewing Distance":"Unknown","Region":"Michigan","Longitude":"-83.177642","Case Number":"44461","Date of the Event":"12/11/2012 12:00 UTC","City":"Cass City","Latitude":"43.597789","Summary":"saw 3 starlike lights in sky separated flashing bluewhite moving in many direction appearing disappearing","Object Features":"None","Object Shape":"Star-like","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=43.597789,+-83.177642(44461)&iwloc=A&hl=en\"> mufon case (44461) map </A>","Country":"United States","Disposition":"Unresolved","Object Flight Path":"Path with directional change","divs":["sighting detailsdoing paperwork in office in home 6pm dark outside heard what i thought was loud planes in distance sounded like more than one went on for 10 minutes which i thought was too long for a plane went outside to see if military doing something or police. looked up in dark sky saw what i believe is planet in east with star to its south noticed flashing small light between these two it would move flash disappear appear in very different location sometimes blinking. then i notice another light doing same little distance away. the plane rumbling sound continued but quieter. ran in house to get jacket daughter arrived home in garage ran to her to have her come in yard. asked dtr what she was seeing and she described what i was seeing then another flashing light appeared now three not really near each other disappearing appearing moving irratice directions staying in east ran inside to call police asked if anyone seeing lights in sky he said no took report and said would have police take a look. went outside dtr still waching same occurring all three objects\\sound still present. went to front yard to see if police would arrive and continued to watch. lights started to move north doing same as stated above when lights ended up in very north direction all just disappeared. sound stopped. entire event last about 45 minutes."],"Sighting Duration":"00:45:00","Log Number":"US-12112012-0012","Tags":"City","files":["/var/www/straped/mufon/html2text/44461.html.txt","/var/www/straped/mufon/org/44461.html"],"Date Submitted":"12/11/2012 08:47 UTC"}