{"Region":"North Carolina","Longitude":"-80.934793","Date Submitted":"12/12/2012 08:40 UTC","Disposition":"Unresolved","Log Number":"US-12122012-0010","Date of the Event":"12/02/2011 02:00 UTC","Tags":"City","trends":["There have been 68 other sightings in Charlotte","There was one other sighting in Charlotte on or around December 2nd 2011"],"divs":["Sighting Details1. I was watching TV on the floor down stairs in the den on a pallet, pillow, throw, blanket. 2. Could see it thru the blinds in the den, just above TV height.Traveling left to right. 3. I am a retired military trained instructor & retired firefighter and I can assure you that I have never witness anything like this in my entire life. What is that, what is it, who is out there? 4. The object was orange & transparent,I saw thru it, floating 25ft above ground across the backyard. It stop, immediately, once I noticed it & turned at a 45 degree angle and decented to top center of the 3(SET)of den windows where I was. Once in center position above the windows, it changed shape from retangle to oval, changed colors from bright orange to a intense bright yellow-gold, it lit-up the whole den as it decented in a downward motion as it probed the room as though it was looking for me. When it changed colors, everything in front of it seem to disappear, as the light became a solid whole object. 5. Before this happen, my home was my castle, safe & secure form all harm, only invited guest could enter. Not anymore! Only, my head was uncovered during the event, as I lay facing the object, refusing to move or draw any more undue attention. I have known fear before in the military and fighting fires or growing up in the ghetto, but I have never experience this type of fear of being totally exposed and confused in my own home. What other things was I facing? Should I get a gun and shoot the object? What or who has the technology or reason to invade my life or my family in this way in an uninvited manner and why? I am a religious person who never bothers anyone and my life will never be the same, again! 6. As the object disappered behind the TV in it's downward decent, I lay motionless for about 30 mins. before I got up to gather my thoughts and composture. I wiped tears from my eyes, wondering why me and who would believe me!"],"Object Flight Path":"Path with directional change","Country":"United States","Weather Factors":"Unknown","Summary":"traveling south across backyard, treetop, I saw it, it stop, decented, change shape, became brighter, probed the room,look for me, departed, I FROZE.","Latitude":"35.243439","files":["/var/www/straped/mufon/html2text/44476.html.txt","/var/www/straped/mufon/org/44476.html"],"City":"Charlotte","Case Number":"44476","map":"<A HREF = \"http://maps.google.com/maps?q=35.243439,+-80.934793(44476)&iwloc=A&hl=en\"> mufon case (44476) map </A>","Source":"MUFON","Object Features":"Other, Unknown","Viewing Distance":"20 Feet or Less","Sighting Duration":"00:15:00","Object Shape":"Oval, Sphere, Square, Rectagular"}