{"City":"Phoenix","Region":"Arizona","Disposition":"Unresolved","Object Features":"None","Latitude":"33.382031","Object Shape":"Unknown","Viewing Distance":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/44478.html.txt","/var/www/straped/mufon/org/44478.html"],"divs":["sighting detailsi was sitting in a chair at 6:30 in the evening on saturday 12\\8\\2012. i was facing south looking up directly noverhead and looking through my widefield binoculars. as i watched a very bright object, which looked like the space station, came into view heading from the sw and going to the ne. just when it disappeared and from the north, another light a little brighter traveled from the n as i was looking over the top of my house and it went overhead traveling to the south. as soon as it disappeared a light that was quite a bit fainter came from the south overhead and traveled directly north were i lost it over my rooftop. when it disappeared another light came overhead from over my rooftop again from the north and went directly south. as soon as it disappeared the 1 more light which was bright again, came overhead from the south and went again directly north where i lost it over my rooftop again. it seems odd to me that 5 lights, 1 somewhat dull, 1 medium and 3 quite bright lights would zip to and fro, back and forth directly overhead going north and south and south and north. i don't think these were all satellites but the 1st sure looked like the space station. thank you for your time. ray groschen"],"Date Submitted":"12/12/2012 09:41 UTC","Object Flight Path":"Straight-line path","Date of the Event":"12/08/2012 06:31 UTC","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around December 8th 2012"],"Sighting Duration":"Undisclosed","Log Number":"US-12122012-0011","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.382031,+-111.985902(44478)&iwloc=A&hl=en\"> mufon case (44478) map </A>","Case Number":"44478","Longitude":"-111.985902","Tags":"City","Summary":"Within 5 min 5 lights went in seperate directions","Source":"MUFON"}