{"Region":"Michigan","divs":["sighting detailsi have had many ufo sightings, but i have never had one like this. very difficult to describe with words- and could not get a photo because camera was downstairs at that time). 7:13 am, 12-12-2012, my dog wanted to go utside. opened back door to let him out, and noticed an extremely brilliant, white v-shaped object (which must have been quite large, as it was as large as a penny at an outstretched arm's length and it also appeared quite large as well!), moving much more rapidly than an airplane, a jet, or anything else i've seen in the sky............now here is the difficult-to-explain part. it was as though the \"trail\" that the v-shaped object (bright white) left behind it was holographic.............(in other words- no chemtrail......but, rather like \"distortions\" of the sky with small, different colored \"dots\" or \"flashes\" in it's wake.) i really don't know how else to describe this, except to say \"think of a holograph and how it looks when turned in the light.\" approximately 40 seconds from w sky until i could no longer wee it going e. very fast. very hologrpahic. and very strange! i was amazed to see something this unusual......never saw a holographic flying object before! it was not a meteor\\comet\\airplane\\jet\\asteroid\\planet\\star......it was a triangle which glowed extremely bright white, with holographic aspects. very strange- but exciting to see!"],"Summary":"Extremely bright white holographic triangle moving very fast W to E","trends":["There have been 17 other sightings in Flushing","There were no other sightings in Flushing on or around December 12th 2012"],"Log Number":"US-12122012-0008","Longitude":"-83.879812","Object Flight Path":"Straight-line path","City":"Flushing","map":"<A HREF = \"http://maps.google.com/maps?q=43.054113,+-83.879812(44475)&iwloc=A&hl=en\"> mufon case (44475) map </A>","Case Number":"44475","files":["/var/www/straped/mufon/html2text/44475.html.txt","/var/www/straped/mufon/org/44475.html"],"Viewing Distance":"Unknown","Weather Factors":"Unknown","Date Submitted":"12/12/2012 08:32 UTC","Source":"MUFON","Sighting Duration":"00:00:40","Object Features":"Unknown","Date of the Event":"12/12/2012 07:13 UTC","Tags":"City","Disposition":"Unresolved","Object Shape":"Triangle","Latitude":"43.054113","Country":"United States"}