{"map":"<A HREF = \"http://maps.google.com/maps?q=53.730648,+-127.646331(44487)&iwloc=A&hl=en\"> mufon case (44487) map </A>","Weather Factors":"Unknown","Summary":"traveling home and saw a crome UFO aprox 120 ft above van. it followed me for a bit than stopped over van. it slowly moved to my right out of sight, aprox 2 min time.","Object Flight Path":"Hovering then path","Viewing Distance":"101-500 Feet","Latitude":"53.730648","Region":"British Columbia","Source":"MUFON","Longitude":"-127.646331","files":["/var/www/straped/mufon/html2text/44487.html.txt","/var/www/straped/mufon/org/44487.html"],"Tags":"City","trends":["There have been no other sightings in Princton, B.C.","This sighting has never been favorited."],"Country":"Canada","Date Submitted":"12/12/2012 05:56 UTC","City":"Princton, B.C.","Object Shape":"Other","Disposition":"Unresolved","Log Number":"CA-12122012-0019","Case Number":"44487","divs":["Sighting DetailsMe and my wife were comming back from my parents place in Aug 1976 we were 25km out on chain lake road in Princton B.C. on the way home aprox 12km from the city of princton, we had to climbe a hill called baker hill with steep switchbacks on the road. when about 80% the way up the hill i siad to my wife. look whats that dead in front of us above the tree tops.. she said i dont know, its weird. I drove making my last turn in the switchback and the object was behind me as i seen in my extreior mirrow. I than stoped my van putting the van in park. I opened my door and got out for a better look. I saw the UFO moving very slowly towards the van, making no noise at all. i said to my wife WOW! its cool. Than the UFO stoped moving in the air about 120 up ( just over the trees ) and just back 25 yards from the Van, I could have hit it with a rock if i tried hard. I said to my wife in the paseenger set to get out and take a look at this thing. she said No! lets go. it creeps me out, come on lets go. But i didnt just go, i stared for another 30 seconds or so and than it slowly started moving again to the right not making a sound over the tree tops out of sight heading for the merritt hwy. Of course i got a very good look at it, it was close. I have looked everywere on line to see if other ufo sightings described it or if photos of it were out their, NOPE!! i have not seen any. we did not have a camera in the van at the time. here is what it was not. 1- a cigar shape 2- triangle 3- round sacwer shape. It looked like this. It had a big ball in the middle, tub arms about 10-12 feet long on each side of the large ball in the centure, and smaller balls on each end of the tube. it was crome bummper looking bright and shinny, but no lights. it was solid looking. aprox 70-120 ft in length. when it turned away it was about 10ft wide on the small ball side. that was it, my wife started crying and i got her under control, and back home. we checked with the locial radio station staion but they reported nothing, the anouser said maye it is a weather ballon. ya right, one that stoppes and goes changes driction. P.S. add crome to your color list."],"Date of the Event":"08/25/1976 12:00 UTC","Sighting Duration":"Undisclosed","Object Features":"Dome, Other"}