{"Case Number":"44486","Latitude":"32.394466","divs":["Sighting DetailsWe were traveling along I-20 from Abilene toward Cisco, TX. It was dark and we have seen such lights before. I was riding in the backseat and looking out the side window when I saw them. They are orange lights that hover, disappear, reappear and sometimes change direction. When you fist see them you could mistake them for flares dropped from military aircraft, but we are in a drought and under burn ban. it would be irresponsible at best for the military to drop flares here at this time. My father was with us for this sighting, he is former USAF, and at first he thought they were flares. However, after observing them for a short time he concluded that they could not be flares, but had no other explanation. We pulled off the main highway to find a dark road to watch, but saw no additional lights in the sky. My 10 year old daughter was \"freaked out\" so we did not stay for long as she was scared. This is the second or third time we have seen lights along this stretch. I have also heard other people who live in the area talking about seeing lights, so it happens with some frequency."],"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/44486.html.txt","/var/www/straped/mufon/org/44486.html"],"Viewing Distance":"Unknown","Source":"MUFON","Object Features":"Unknown","Sighting Duration":"Undisclosed","Log Number":"US-12122012-0018","Date Submitted":"12/12/2012 05:38 UTC","Longitude":"-98.974074","Date of the Event":"12/11/2012 07:30 UTC","Object Shape":"Star-like","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.394466,+-98.974074(44486)&iwloc=A&hl=en\"> mufon case (44486) map </A>","Region":"Texas","City":"Cisco","Country":"United States","Summary":"Orange lights in the sky. sometimes in formation of 3, as many as 5 or 6 visible at one time.","trends":["There have been 10 other sightings in Cisco","There were no other sightings in Cisco on or around December 11th 2012"],"Object Flight Path":"Unknown","Tags":"City"}