{"Log Number":"US-12122012-0029","Tags":"City","Object Features":"Unknown","City":"Talihina","trends":["There has been one other sighting in Talihina","There was one other sighting in Talihina on or around December 12th 2012"],"Sighting Duration":"Undisclosed","Latitude":"34.758319","Country":"United States","Source":"MUFON","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/44497.html.txt","/var/www/straped/mufon/org/44497.html"],"divs":["sighting details 1. my spouse and i were parked in pasture in hopes of seeing lights again. rural area. 2. i was watching southern sky & lights just blinked on. 3. i want to know what they are, that's why we were looking for them again tonight. 4.see below 5. i was ok until i saw the beam. this did affect me. i won't be looking anymore. 6. the lights just turned off. 1841 four lights seen in southern night sky. four orange fireballs lit up individually to form straight line then went off. this sequence repeated once & lasted approx 20 seconds. windows down in car, heard low roar that lasted approximately 30 seconds. clear night sky, no jets or planes seen flying over...would have to have been low for that kind of roar. 1845 with our truck still in park facing east, to the south outside truck window, very close (maybe 1\\4 to 1\\2 football field if that) a white light lit up the ground. light was approximately size of our truck. it remained stationary. the light shined on the ground for approximately 30 seconds. at first i thought the light was car lights, but that is impossible because we were on private property behind locked gates in the country and we are 100% positive we were alone. i thought i could see something in the light but it was too dark. 1917 home. i have developed headache to right side of head (side facing light) and now have various \"buzzing\" feelings in my body. **the fireballs were not visible while light was beamed to ground.** other folks in the area have witnessed these lights as well. i am in hopes that they report also. report also submitted to national ufo reporting site. i was unable to get images."],"Disposition":"Unresolved","Viewing Distance":"Unknown","Summary":"Four fireballs observed again in oklahoma, white light beamed to ground.","Weather Factors":"Unknown","Longitude":"-95.039566","Region":"Oklahoma","Object Shape":"Fireball","Date of the Event":"12/12/2012 06:41 UTC","Case Number":"44497","Date Submitted":"12/12/2012 08:47 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.758319,+-95.039566(44497)&iwloc=A&hl=en\"> mufon case (44497) map </A>"}