{"Source":"MUFON","Summary":"A flame colored sphere that appeared to change into two spheres, disappeared, then reappeared further off in the distance as one orb, disappeared again, appeared closer yet again and looked like it was discharging something from the bottom, became two.","Latitude":"39.185318","divs":["Sighting DetailsMy mother and I were outside taking out the trash when she told me to look up and asked, \"what's that?\" I looked up and observed a flame colored sphere, almost star like. It was visible for a few seconds, disappeared very briefly and came back as two. A couple seconds later it vanished and appeared again, much farther to the east, as one sphere this time. Then disappeared again and came back very close to it's original position, this time appeared to have some type plasma or material dripping or pouring from the bottom. At this point it appeared as two again, lasted for maybe 7-8 seconds and then vanished for good. Immediately following the sighting I noticed what appeared to be a jet of some type flying directly to the same location. Over the next few minutes observed other planes that appeared to be going that general direction as well. One thing I'd like to note, it never seemed to move other than phasing out and appearing in different locations. Seemed to blink it's self miles across the sky in an instant."],"files":["/var/www/straped/mufon/html2text/44496.html.txt","/var/www/straped/mufon/org/44496.html"],"Object Flight Path":"Stationary,Other","Viewing Distance":"Unknown","Date Submitted":"12/12/2012 08:30 UTC","Tags":"City","Longitude":"-84.286862","Case Number":"44496","Object Features":"Unknown","Log Number":"US-12122012-0028","map":"<A HREF = \"http://maps.google.com/maps?q=39.185318,+-84.286862(44496)&iwloc=A&hl=en\"> mufon case (44496) map </A>","Country":"United States","Disposition":"Unresolved","Date of the Event":"12/12/2012 06:55 UTC","trends":["There have been 6 other sightings in Milford","There were no other sightings in Milford on or around December 12th 2012"],"Sighting Duration":"00:00:30","Object Shape":"Sphere","Weather Factors":"Unknown","City":"Milford","Region":"Ohio"}