{"trends":["There have been 49 other sightings in Huntington Beach","There were no other sightings in Huntington Beach on or around December 11th 2012","This sighting has never been favorited.",""],"divs":["Sighting DetailsWhile at work something caught my eye outside of my window. The office I use has a view of an intersection that faces southeast - the right side of this intersection I saw what I thought to be a police helicopter... I then went to the other side of the office to obtain an unobstructed view. There were absolutely no blinking nav lights onboard; the left side had one very bright red light and the right side had one very bright white light. It appeared to be heading in a northerly path (possibly NW) and then stopped, hovered momentarily, dropped altitude, changed direction and continued to drop in a diagonal path. It changed direction once more and descended straight down - it dropped so low I lost visual contact behind building on other side of the intersection. I then went back to work only to notice it once more, nearly at the same altitude, and then descended once again, this time straight down. I have video of this event. I am a former Navy vet and have been around aircraft. I know what to look for and found no navigation lights of any sort. The first descent was rather random and very peculiar. I checked for any accidents on the local freeway, thinking that this might possibly be a life flight aircraft, but the freeway was clear and had no accidents reported. It appeared to be some distance away, which would mean that more ground was covered by its movement, which for me, places the possibility of some sort of remote control aircraft to be slim (not to mention how bright the lights were)."],"files":["/var/www/straped/mufon/html2text/44494.html.txt","/var/www/straped/mufon/more/44494_submitter_file3__photo.JPG","/var/www/straped/mufon/org/44494.html"],"Longitude":"-117.984078","City":"Huntington Beach","Source":"MUFON","Summary":"Witnessed object; no navigation lights... one LARGE red light and one LARGE white light.","Viewing Distance":"501 Feet - 1 Mile, Unknown","Region":"California","Object Flight Path":"Hovering then path,Path then hovering","Disposition":"Unresolved","Case Number":"44494","Weather Factors":"Unknown","Country":"United States","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.734594,+-117.984078(44494)&iwloc=A&hl=en\"> mufon case (44494) map </A>","Latitude":"33.734594","Sighting Duration":"Undisclosed","Log Number":"US-12122012-0026","Tags":"City","Date Submitted":"12/12/2012 07:52 UTC","Date of the Event":"12/11/2012 05:22 UTC","Object Shape":"Unknown"}