{"Summary":"My 17 year old daughter and i witnessed something amazing","files":["/var/www/straped/mufon/html2text/44495.html.txt","/var/www/straped/mufon/org/44495.html"],"Longitude":"-99.898513","Date of the Event":"12/09/2012 08:40 UTC","Object Shape":"Other","City":"Undisclosed","divs":["Sighting DetailsDriving home approx 8:40 pm Sunday night Dec 9. Country road, central texas, cool weather and clear skies, I saw to my upper left, viewed through the front windshield, a bright light traveling left to right. Elevation estimated at 3000 feet, flying parallel to the ground. It was actually increasing in speed for my entire view of it. slowly increasing to an unbelievable speed, until disappearing in a brighter flash. I caught with my astonishment, what I thought was a streak, off in the direction it was traveling. I was fortunate to be coming to the top of a slight rise in the road and was afforded a great view, of the sky and the ground, and this unreal, star wars looking jump to hyper drive!!! Oh boy was that COOL whatever it was. I have seen meteorites and knew instantly that this was something else. My 17 year old daughter, began sobbing before I could utter... D DD Did you see that? I eventually got that out, after asking her what was wrong, and reassuring her that everything was alright. She saw the same thing and for about four more seconds before i did. And she was really moved by this sighting, she began sobbing the instant she realized that it was controlled, and i think that is what shocked her. Fortunately for me, it wasnt my first time, experiencing that feeling we get, during that instant of realization, when we are seeing something so much more advanced than us. That was Cool The four seconds that my daughter saw this she said it appeared in three different points in the sky ,one two three, close to each other., until it grew in brightness, as one point, and thats were I picked it up. wish I would have seen that too, she says the points formed a triangle. Edit: the more I think on this, I do remember seeing a trail of light. My first view of it and my daughters', it appeared as just a blip of light. No discernible shape. and when it increased to a zipping speed, I do remember seeing a trail of bright light, , but when it disappeared, its hard to describe really. It simply disappeared, but i got the impression from the increasing speed and the direction it was maintaining, that it \"punched it\" and was gone. I feel that this was not a meteorite because of the altitude it was at. The same alt. as where I see small aircraft sometimes in the sky here. Also it changed positions, according to my daughter's observations, kinda like it leaped from one position to the next, and when I initially saw it, the light appeared to be getting brighter and moving way faster, and was moving just about due east. From my left to my right, I had an unobstructed view of this Light, and the thing that shocked me, in a millesecond was the amazing speed that it attained. That freaked me out. and apparently my Daughter too. I drove for about 500 more yards and pulled over, near my mailbox, on the main road. I put the car in park and got out and looked to my right, due East. Heard and saw nothing but the night sky. My daughter was sobbing and insisted that I get back in the car, and just get home. Which I did. after i explained to her what i thought it was, she calmed down. we arrived home within five minutes discussing what we had just observed. I didnt really ask her any questions, i just listened to her. And what she said, jibed exactly with what i saw. Therefore, I concluded that this was an Unidentified Flying Object. I felt a relief that someone else had just witnessed what i did. And was especially happy that it was my Daughter, who shared this amazing sighting with me."],"Date Submitted":"12/12/2012 08:01 UTC","trends":[],"Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Log Number":"US-12122012-0027","Region":"Texas","Sighting Duration":"Undisclosed","Latitude":"31.971449","Case Number":"44495","Object Features":"Unknown","Country":"United States","Source":"MUFON","Object Flight Path":"Straight-line path","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=31.971449,+-99.898513(44495)&iwloc=A&hl=en\"> mufon case (44495) map </A>"}