{"trends":["There have been 35 other sightings in Kingman","There were no other sightings in Kingman on or around December 12th 2012"],"Object Features":"Unknown","Weather Factors":"Unknown","Object Flight Path":"Stationary,Hovering then path","Country":"United States","Date of the Event":"12/12/2012 11:20 UTC","Viewing Distance":"501 Feet - 1 Mile","Summary":"A freind called me to report this to me. I went out side and saw a ufo in the and under the clouds","Disposition":"Unresolved","Region":"Arizona","City":"Kingman","Source":"MUFON","Object Shape":"Circle, Sphere","Sighting Duration":"01:00:00","Tags":"City","Longitude":"-114.056092","Latitude":"35.189914","map":"<A HREF = \"http://maps.google.com/maps?q=35.189914,+-114.056092(44500)&iwloc=A&hl=en\"> mufon case (44500) map </A>","files":["/var/www/straped/mufon/html2text/44500.html.txt","/var/www/straped/mufon/org/44500.html"],"Log Number":"US-12122012-0032","Case Number":"44500","Date Submitted":"12/12/2012 10:40 UTC","divs":["Sighting DetailsAt 11:20 AM a freind called and said they saw a UFO over by my house in the clouds. I went outside, and saw an object about a mile away from in a north west direction in the clouds. At times it looked like it was shimering. It was disk like in shape. Dull sivler or grey in color. It might have been the cloud cover, but it look as if it would come in, and out of the clouds. My freind did get several photos, I do not know if this person wants to be contacted about it. I can find out. After hour bare foot and cold I went inside. I had an unusal amount of energy, and for a time I forgot about the pain I have had in my back for two months. Unrelated, but I have an appoint on the 13 with my family doctor for my back & dibetes. It is now about 8:PM, my back hurts again my tinitus has never stoped, and the burst of energy may be due to coffee or the sighting. I have seen other ufo's in D.C. in 1976, and West viriginia in 1977, and Subic bay while in the USMC in 1974 all sighting made national news. so conclude this is data insufecent, but I will keep looking."]}