{"Object Features":"Unknown","Weather Factors":"Unknown","divs":["Sighting DetailsMy husband, 2 sons and myself were leaving Walmart south at about 745pm. We heading north on 3rd ave se and to the east my husband and kids noticed something in the air. I thought looked like a helicopter but was hovering. It had a green light and a few white lights. I then turned east and south to turn closer to get a better look at it. It then seemed to stop hovering and moved southwest towards the airport, then the green light faded and a red light was visible. We then turned onto Broadway south and tried to follow it. It then started moving extremely fast and gained height. When we approached towards to airport it turned sharply and headed east again, then west and then back north. I turned around and headed north, then got onto highway 52 south and took the Marion road exit and headed west again. At this time the object was Heading towards southeast, after a few minutes it went out of sight behind trees. I stopped the car and we all tried looking to see if we could see it again. My younger son thought he saw it towards the northeast of us, but I did not locate it again. during this time we tried to video tape it however it was too dark out and could not see anything on video at all."],"Object Shape":"Oval","Tags":"City","Case Number":"44507","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Log Number":"US-12132012-0002","map":"<A HREF = \"http://maps.google.com/maps?q=44.024681,+-92.462159(44507)&iwloc=A&hl=en\"> mufon case (44507) map </A>","Country":"United States","Date Submitted":"12/13/2012 12:42 UTC","Region":"Minnesota","trends":["There have been 13 other sightings in Rochester","There were no other sightings in Rochester on or around December 12th 2012"],"Viewing Distance":"501 Feet - 1 Mile","City":"Rochester","files":["/var/www/straped/mufon/html2text/44507.html.txt","/var/www/straped/mufon/org/44507.html"],"Date of the Event":"12/12/2012 07:45 UTC","Sighting Duration":"Undisclosed","Latitude":"44.024681","Summary":"was driving and saw something, low in air then moved fast tried to follow then moved path again","Source":"MUFON","Disposition":"Unresolved","Longitude":"-92.462159"}