{"files":["/var/www/straped/mufon/html2text/44502.html.txt","/var/www/straped/mufon/more/44502_submitter_file1__NovaScotia0003.PDF","/var/www/straped/mufon/org/44502.html"],"trends":["There have been 6 other sightings in Dartmouth","There were no other sightings in Dartmouth on or around December 12th 2012","This sighting has been favorited 2 times.",""],"City":"Dartmouth","Region":"Nova Scotia","Tags":"City","Case Number":"44502","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Disposition":"Unresolved","Source":"MUFON","Longitude":"-63.490736","Country":"Canada","Date Submitted":"12/12/2012 10:55 UTC","Log Number":"CA-12122012-0034","Weather Factors":"Unknown","Latitude":"44.676","Object Features":"Patterned Surface","divs":["Sighting DetailsOn the 12th December I went ouside behind my house in Cole Harbour,Nova Scotia to have a cigarette. As always I am looking up at Orion & Jupiter and generaly looking all around up at the sky. At 19:30 Hrs something caught my eye to the right. A very dark dim red orb moving at a high rate of speed came from the east and made an abrupt 90 degree turn wobbling left & right just after the turn and shot out straight north at an insane amount of speed and dissappeared then about 1 to 2 mins approx a bright white light appeared where I last seen the red orb vanish and disappeared. I am not sure if the white light was related to the red orb. This whole event lasted for approx 10 sec. I had no idea what it was but knew what it wasn't. It was not a plane,jet,helicopter falling star,comet,meteor the ISS or satelite. It was a clear night cold and no clouds. There was no marker lights, no engine noise and something moving that fast should at least made a zonic boom which it didn't. Just after it made the abrupt 90 degree turn and started heading North, it wobbled left,right then left again. At this point I noticed somewhat of a pattern on the bottom resembling a sand dollar(star shape)like You have to remember this happened real fast so that's the best I can describe it. My first reaction to this was \"wtf was that\" I mmeaditley called my closest friend as we both seen something 30 years ago while fishing and knew he would believe me. I then started filling out this report while it was fresh in my mind. I am currently serving(23 years)in the Candian Armed Forces,Air Force. It was just pure luck that I was outside and happened to look up."],"Object Shape":"Circle, Disc, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=44.676,+-63.490736(44502)&iwloc=A&hl=en\"> mufon case (44502) map </A>","Date of the Event":"12/12/2012 07:30 UTC","Viewing Distance":"501 Feet - 1 Mile","Summary":"Dark red glowing orb came from the east at high speed and made an abrupt 90 degree turn, wobbled and headed north at insane speed."}