{"Log Number":"US-02182006-0008","divs":["Sighting Details1. Backyard of house. 2. I had been inside at the computer when I decided to check on dogs who were barking unusually loud and long time in yard. They just would not stop wailing. Something was wrong. 3. I thought the object was a UFO. It was like no other aircraft I have ever seen or believed could fly. 4. The object that I saw looked like a typical \"1950's UFO\" as seen on t.v. It was a grey or silver metalic-looking disc that made no sound and hovered in the sky low over house and seemed to lift up later and soar in a straight path over the neighborhood. 5. I was very perplexed. I was seeing a disc hover and move with ease over the houses. My grandmother had seen it hover over the house as she was in the yard before me and even witnessed it approach. When I got out, I could clearly see the object, but it was then flying in the air in the street by our house and then over the neighbor's house across the street. 6. I lost sight of the object as it continued its trajectory and seemed to appear and reapear and then vanish. I thought maybe it was due to slight clouds in the distance. I would clearly see it in the distance, and then it would vanish and reapear until it finally disapeared from my sight."],"Disposition":"Unresolved","Country":"United States","City":"Camarillo","Latitude":"34.216394","Object Shape":"Disc","map":"<A HREF = \"http://maps.google.com/maps?q=34.216394,+-119.037602(4451)&iwloc=A&hl=en\"> mufon case (4451) map </A>","trends":["There have been 7 other sightings in Camarillo","There were no other sightings in Camarillo on or around November 10th 2005"],"Longitude":"-119.037602","Summary":"Dogs barking outside like crazy. I went to see why all the noise. Grandmother was outside already. She told me, amazed, to look at the UFO. I saw it too. Unbelievable. Disc-like. Flew over the house. made no sound. I watched it fly away.","Date of the Event":"11/10/2005 12:00 UTC","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","Object Features":"Undisclosed","Case Number":"4451","files":["/var/www/straped/mufon/html2text/4451.html.txt","/var/www/straped/mufon/org/4451.html"],"Tags":"City","Source":"MUFON","Viewing Distance":"20 Feet or Less, 21-100 Feet","Weather Factors":"None","Sighting Duration":"Undisclosed","Date Submitted":"11/10/2005 12:00 UTC","Region":"California"}