{"Latitude":"37.69928","Viewing Distance":"101-500 Feet","Log Number":"US-12132012-0007","City":"Modesto","Region":"California","Weather Factors":"Unknown","trends":["There have been 48 other sightings in Modesto","There were no other sightings in Modesto on or around December 13th 2012"],"Sighting Duration":"01:10:00","Date Submitted":"12/13/2012 06:10 UTC","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/44512.html.txt","/var/www/straped/mufon/org/44512.html"],"Country":"United States","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Source":"MUFON","Longitude":"-121.051291","map":"<A HREF = \"http://maps.google.com/maps?q=37.69928,+-121.051291(44512)&iwloc=A&hl=en\"> mufon case (44512) map </A>","Date of the Event":"12/13/2012 01:00 UTC","Tags":"City","divs":["Sighting DetailsI have seen a black triangle craft twice in the past year. First time around Thanksgiving of 2011. But tonight, 12-13-12 @ 0110 I saw the same black triangle fly overhead towards the south east. I was outside taking my dog out before I went to bed and I was looking up like I do most nights, looking at stars (I look at night sky often on clear nights). As I was looking towards \"big dipper\", I saw something block out a star. I immediately recognized it as the black triangle craft I saw a year ago. The craft is black with no lights. It does however have some grey (maybe white) markings on the bottom in a \"V\" formation. There is no or little moonlight but plenty of starlight to see craft. Plus it's only about 500ft away. It's moving at a good speed... Maybe 100mph?? It stayed in sight for about 15-20 seconds. It made no noise what so ever!! This is the exact same thing I saw a year ago in this exact same location. Only last time it was heading north and it was about 930pm. There is no doubt of what I saw. Both times I watched it infront of me and fly right over me and off in distance. This craft both times flew straight at a steady speed the entire time on both occasions."],"Summary":"2nd sighting in year of same black triangle object. No noise and no lights. Flies very low and both times saw very well.","Case Number":"44512","Object Features":"Patterned Surface"}