{"map":"<A HREF = \"http://maps.google.com/maps?q=40.23363,+-75.278227(44518)&iwloc=A&hl=en\"> mufon case (44518) map </A>","Date of the Event":"12/12/2012 07:00 UTC","Date Submitted":"12/13/2012 10:22 UTC","trends":["There have been 12 other sightings in Lansdale","There were no other sightings in Lansdale on or around December 12th 2012"],"Object Features":"None","Summary":"Due to the extremely thick cloud cover in the area, I was only able to observe one lit object in the entire night sky.","Case Number":"44518","Log Number":"US-12132012-0013","Country":"United States","Disposition":"Unresolved","Region":"Pennsylvania","Weather Factors":"Unknown","Viewing Distance":"Unknown","Source":"MUFON","divs":["Sighting DetailsThis object is one of many \"false stars \" that I have located in the night sky that ejects and retrieves small, lit spheres resembling pinpricks of light. I call the larger objects carrier craft and the minute,ejected unknowns I label as spheres ( although they may be shaped totally different due to distance ). The cloud cover was so dense I was quite surprised to see this intensely lit object cut through the clouds. To the unaided eye it appeared as a round, white object with a slight blue aura around the circumference. As observed on clear nights, once again it remained in one location for an inordinate amount of time. The purpose and objective of this craft is such that moving through the night sky in coordination with the other natural objects is apparently secondary to the primary goal. Since this \"carrier craft \" and others have been studied extensively by me, I was able to discern the small, lit spheres exiting from the right and bottom of the primary object. This is one of 3 pairs of carrier craft that are working in concert with one another. Additionally, I have located 6 other independent craft visible in my small slice of sky. None were able to generate enough light last night to be seen from the ground. Like the paired carrier craft these individual structures are actively involved in ejecting and retrieving spheres that appear to be under intelligent control while engaged in surveillance missions. Literally hundreds of these spheres wander with purpose around the night sky. According to sighting reports, many witnesses are aware of portions of this activity and may, through time, become cognizant of the overall picture. I have photos of this carrier craft on both jpeg and RAW images. Having never sent a photo, my go to computer person is going to teach me the process. I have been contacted by 2 local MUFON representatives by phone and e-mail who have requested the photos and a subsequent face to face meeting. Thank You."],"City":"Lansdale","Sighting Duration":"04:00:00","Longitude":"-75.278227","Tags":"City","files":["/var/www/straped/mufon/html2text/44518.html.txt","/var/www/straped/mufon/org/44518.html"],"Object Flight Path":"Path with directional change","Object Shape":"Circle, Sphere, Star-like","Latitude":"40.23363"}