{"Object Shape":"Fireball, Flash, Oval, Sphere","Viewing Distance":"501 Feet - 1 Mile","Region":"Arizona","Case Number":"44519","Object Features":"Unknown","Summary":"Brilliant flash then reduced to small light and turned west and disappeared","Tags":"City","Source":"MUFON","Weather Factors":"Unknown","Country":"United States","Log Number":"US-12132012-0014","divs":["Sighting DetailsI was outside on my deck that is on a cliff. I saw a bright star like object appear out of nowhere. It first appeared as a round golf ball size and then it grew in size quickly and spread out a bit to a stretched out oval. I thought at first it was a shooting star then thought it might be an asteroid and then it got so big and bright I thought it would land on top of me. At its largest you could compare it to the size of a fully risen full moon yet its shape was more oval. Little scary I must admit. And then it started diminishing in brightness slowly back down to a golfball size and then it popped to a dimly lit pinpoint light and changed direction. At first it went slightly upward and then to the west. As it was moving in the sky I could see a very large helicopter travelling very fast coming from the Superstition Mountains. It hovered in the area but the object was gone. Then the helicopter went southeast very fast and I think I may have seen a shooting star cross its path. I have seen UFOs before because I spend a lot of time on that deck at night however I have NEVER seen anything like this. First time I ever became scared."],"Object Flight Path":"Hovering then path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=33.605671,+-111.717009(44519)&iwloc=A&hl=en\"> mufon case (44519) map </A>","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/44519.html.txt","/var/www/straped/mufon/org/44519.html"],"Latitude":"33.605671","Sighting Duration":"Undisclosed","Longitude":"-111.717009","Date of the Event":"12/11/2012 06:25 UTC","trends":["There have been 8 other sightings in Fountain Hills","There were no other sightings in Fountain Hills on or around December 11th 2012"],"City":"Fountain Hills","Date Submitted":"12/13/2012 10:24 UTC"}