{"Longitude":"-86.777733","Object Features":"None","Source":"MUFON","Object Flight Path":"Hovering then path","Weather Factors":"Unknown","Disposition":"Unknown","Sighting Duration":"00:00:02","divs":["Sighting DetailsOn Aug. 13, 2005, I came home from viewing 'Alien vs. Predator' and was smoking on my back porch. I remember the date because it was the movie's opening night. I didn't have my porch light on, and, I was looking to my right at my neighbors yard when something caught my eye in the sky. When I looked up, the object would have been at approximately 2 o'clock and highly visible against a deep dark night sky. The moment that I looked at it, it sped with ungodly speed horizontally across the sky to this large, thick, white cloud that was approximately located at 12 o'clock. The object was cigar shaped and it was pure white. It was the brightest thing I've ever seen, yet, it didn't hurt my eyes for the split second that I saw it. It's speed was unbelieveable. There was no noise from the sky whatsoever. I knew it was something that shouldn't have done what it did by that superfast speed with which it moved. I was stunned there for a moment. I'm still quite stunned when I think about it. It was something that I could not explain. And it's funny, because I've always thought there was something or someone else out there and wished I had been one of those people that got a glimpse of something in the sky. Yet, when I found myself wanting to share the experience, I found that I was very tentative about it. On the night it happened, I just went back inside and thought about it even though I wanted to run and tell everyone what I had seen."],"Date Submitted":"08/13/2005 11:30 UTC","Viewing Distance":"Unknown","Latitude":"36.17269","Country":"United States","files":["/var/www/straped/mufon/html2text/4452.html.txt","/var/www/straped/mufon/org/4452.html"],"Region":"Tennessee","Tags":"City","Summary":"Clear sky, few clouds, bright white object caught my eye then shot horizontally across the sky behind a large cloud","Case Number":"4452","City":"Nashville","map":"<A HREF = \"http://maps.google.com/maps?q=36.17269,+-86.777733(4452)&iwloc=A&hl=en\"> mufon case (4452) map </A>","Object Shape":"Cigar","trends":["There have been 72 other sightings in Nashville","There were no other sightings in Nashville on or around August 13th 2005"],"Log Number":"US-02192006-0001","Date of the Event":"08/13/2005 11:30 UTC"}