{"Country":"United States","Object Flight Path":"Stationary,Path then hovering","Date Submitted":"12/13/2012 01:32 UTC","divs":["sighting detailsi was driving home from school on n i-35 around 8:20pm, more or less on 12\\12\\12. i had just finished my final project for an accounting class. a bright blue light caught my attention. at first i thought it was just an airplane but even though i was far away from it i knew that it was too big and too low to be a plane. the first time i saw it i was driving through the downtown austin area. i slowed down from 70mph to about 50mph, upsetting other drivers who just kept on passing me. as i got closer i realized the thing was descending, just getting lower and lower. i think i might've gotten right next to it close to the braker ln area. that is when i saw the v shaped thing, so sleek and i actually saw the bottom of it. it had bright blue round lights and it was kinda transparent too because i remember i was able to see like squiggly bright lights through it too. i was not scared, just amazed. mesmerized. i also kept telling myself to pay attention to the road but i was looking at the road and then staring at the thing. i might've watched it for about 10-15 seconds with such clarity. then i convinced myself to focus on the road again. i got back to 70mph and when i looked at my rear view mirror there was nothing. i thought the show was over but that's when i noticed two bright bright bright orbs floating. i told my husband they looked like 2 torches inside a giant bulb. those things just floated and then they would move up and down but very slowly. that lasted the rest of the way home until i exited i-35 and then the houses and buildings blocked the view."],"Region":"Texas","Disposition":"Unresolved","Case Number":"44522","Weather Factors":"Unknown","Object Shape":"Circle, Triangle","Longitude":"-97.611284","Summary":"I was driving home from school heading north on I-35 when I first saw a bright blue light. I thought it was an airplane but as I got closer I saw the V shape so clearly and 2 other orbs just floating.","City":"Austin","Latitude":"30.339058","Object Features":"None","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=30.339058,+-97.611284(44522)&iwloc=A&hl=en\"> mufon case (44522) map </A>","files":["/var/www/straped/mufon/html2text/44522.html.txt","/var/www/straped/mufon/org/44522.html"],"Date of the Event":"12/12/2012 08:20 UTC","Log Number":"US-12132012-0017","trends":["There have been 188 other sightings in Austin","There was one other sighting in Austin on or around December 12th 2012"],"Tags":"City","Source":"MUFON","Sighting Duration":"00:05:00"}