{"Latitude":"39.767222","Tags":"City","Longitude":"-75.1675","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=39.767222,+-75.1675(44525)&iwloc=A&hl=en\"> mufon case (44525) map </A>","divs":["Sighting DetailsI'm posting on a UFO sight because the objects where unknown. They were more than likely military aircraft. I wen't outside to smoke, looked up saw an airplane(or what i thought was an airplane) I noticed another,, then another then another then another,, then I walked out to the field,, so i could get a larger range of view of the sky. To my surprise they were EVERYWHERE! At least 40-50 aircraft all flying east,, north east, Not really high in the sky, One flew right over our house. The darkness and fog made it very difficult to see an outline of the craft. I do not think they were alien or something like that. They had solid white light in the front and flashing red lights on both sides of the object. I actually started to panic because I thought something was going on. I immediately ran to the TV to turn on the news waiting for a breaking news story but it never came. I can't find any other information or other people who've had this sighting in my area. I've looked online for any information and there was none. I checked air traffic for commercial aircraft for that hour and there was almost none in my area. Time of sightings: 9:31 PM est, 12-12-2012"],"Log Number":"US-12132012-0020","Object Shape":"Unknown","Disposition":"Unresolved","Country":"United States","Object Features":"Wings","Date Submitted":"12/13/2012 04:40 UTC","Region":"New Jersey","Sighting Duration":"00:20:00","Viewing Distance":"101-500 Feet","Source":"MUFON","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/44525.html.txt","/var/www/straped/mufon/org/44525.html"],"Summary":"Multiple aircraft...","trends":["There have been 3 other sightings in Mantua Township","There were no other sightings in Mantua Township on or around December 12th 2012"],"Case Number":"44525","Date of the Event":"12/12/2012 09:31 UTC","City":"Mantua Township"}