{"Country":"United States","Object Flight Path":"Hovering then path","trends":["There have been 4 other sightings in Alameda","There were no other sightings in Alameda on or around October 6th 2012"],"Object Shape":"Circle, Cylinder","Log Number":"US-12142012-0001","files":["/var/www/straped/mufon/html2text/44537.html.txt","/var/www/straped/mufon/org/44537.html"],"Disposition":"Unresolved","Source":"MUFON","Longitude":"-122.262555","Date of the Event":"10/06/2012 12:00 UTC","Viewing Distance":"20 Feet or Less","Latitude":"37.759635","Sighting Duration":"Undisclosed","Tags":"City","Date Submitted":"12/14/2012 12:10 UTC","Object Features":"Other","Summary":"Was suddenly awakened. Observed a ring of segmented lights pointed directly at my face!","Region":"California","City":"Alameda","divs":["sighting details i awoke suddenly at about 4am on approx oct 6,2012. too my surprise there was a ring of segmented, curved rectangular green lights pointing directly at my face. the lights were approx. less than 1ft. from my face. i then brought my hand up to it, and my hand appeared to pass through it. as i did that the device rotated to my left pointing at my hip area. the device was slightly wider than my palm, which is 4 inches across. it's height was approx.2 to 2.5 inches high. the device did not have a solid structural outline. but as i was looking at it more closely. it had a more transparent look of it's body than it's lens. also, appearing more transparent, i could see a rotating shaft, similar to a intake valve on a gas engine. the device hovered for a few more moments the moved off through my window. as it moved, it emitted a yellow glow from it's aft area. then a couple of weeks later, i went up to the rooftop of a building were i'm working, to have a smoke. as i stood there looking over downtown oakland and the bay. there was a pinpoint diamond flash of light at the upper end of my peripheral vision. at the time, i thought it was just something happening with me. and i dismissed it. then as i continued to look at the scenery. at the approx. same area of space as the flash happened, a yellow sphere of color appeared and rapidly moved to the south in a straight line ( i was facing west at the time). it occurred to me at the time that it was the same device. the yellow sphere was the field it generates as it moves. otherwise, it would have been invisible. i speculated that it's possible that the diamond shaped flash is caused by it's transition from one domain into ours. also it's definitely a surveillance device of some sort. i did not have any physical or mental\\emotional reactions, other than the delight of seeing something like this."],"Weather Factors":"Unknown","Case Number":"44537","map":"<A HREF = \"http://maps.google.com/maps?q=37.759635,+-122.262555(44537)&iwloc=A&hl=en\"> mufon case (44537) map </A>"}