{"Object Shape":"Diamond","Disposition":"Unresolved","Tags":"City","Sighting Duration":"Undisclosed","divs":["sighting detailsi was on the phone with my dad while observing a few faint and a few bright geminid meteors directly overhead. we were discussing them and i was reclined looking directly overhead when i noticed four dark grey but visible asprin sized diamond shaped objects above at several thousand feet flying in formation equally spaced during this clear night for about three full seconds. the path was from exactly north to exactly south and did not change nor waver for the duration that they were in my sight. i was very excited as this is not like anything i have ever seen in the night sky and thought i should immediately make an account of the event. my observation further is explained that the objects were travelling at a very high rate of speed (i have witness many airplanes tonight and these were not airplanes, which in comparison take a good while to pass out of view). no lights associated with these objects, just all the same dark grey\\black and were lower than air traffic but high enough to estimate their size to be larger than aircraft. also there was no audible characteristic to the sighting whatsoever. unfortunately due to the dark nature of color and speed i wasnt able to see this event for as long as i wanted."],"Weather Factors":"Unknown","Date of the Event":"12/13/2012 09:21 UTC","Region":"Texas","Summary":"(GS) straight line of four objects in formation moving in straight path from north to south","Latitude":"30.1404","Case Number":"44535","Country":"United States","trends":["There have been 3 other sightings in Vidor","There were no other sightings in Vidor on or around December 13th 2012"],"Date Submitted":"12/13/2012 11:14 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/44535.html.txt","/var/www/straped/mufon/org/44535.html"],"Object Flight Path":"Straight-line path","Viewing Distance":"Over One Mile","Longitude":"-94.010954","City":"Vidor","map":"<A HREF = \"http://maps.google.com/maps?q=30.1404,+-94.010954(44535)&iwloc=A&hl=en\"> mufon case (44535) map </A>","Log Number":"US-12132012-0030","Object Features":"Wings"}