{"Date Submitted":"12/13/2012 09:54 UTC","Longitude":"-93.188351","files":["/var/www/straped/mufon/html2text/44532.html.txt","/var/www/straped/mufon/org/44532.html"],"Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=44.992899,+-93.188351(44532)&iwloc=A&hl=en\"> mufon case (44532) map </A>","trends":["There have been 2 other sightings in Roseville","There were no other sightings in Roseville on or around December 13th 2012"],"Sighting Duration":"00:00:10","Country":"United States","divs":["Sighting Detailsat about 8:00 pm my son and I had just taken the garbage out to the curb in front of our house and as we got near the front door we stopped because I was finishing smoking a cig and we were talking. I noticed a large bluish white orb falling from the sky at an angle, I yelled at my son to look at it because he was facing me and it was falling from the sky behind him, he turned and saw it just as it was descending into the tree line on the other side of our street. We both watched it disappear. I don't know what it was but I do not think it was a plane or a helicopter because it made no noise. I also do not think it was a shooting star because it was so close to us and so big. I have seen shooting stars and they are small and fast and always a white and always way up in the sky above far away. I felt in awe and curious and excited and my son is not sure what it could have been and he was scared. We lost sight of the object because it went down into the treeline on the other side of the street. We live on a frontage road of a busy 4 lane street and there is also a frontage road on the other side, so it is an extremely wide distance that the orb moved from our side of the street on the east to the other side of the street towards the west. We are both perplexed as to what we saw tonight."],"Case Number":"44532","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Date of the Event":"12/13/2012 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Region":"Minnesota","Object Shape":"Sphere","Summary":"my son and I saw a large blueish orb falling from the sky over snelling ave and it disappeared into the tree line on the other side of Snelling","Latitude":"44.992899","Source":"MUFON","Log Number":"US-12132012-0027","Tags":"City","City":"Roseville"}