{"Longitude":"-97.31981","Summary":"Rapid flight across the sky. Was only in my field of vision for mere seconds, enough time for me to observe it moving acrss the sky, then it disappeared.","Latitude":"32.727049","Region":"Texas","Object Shape":"Circle","Date of the Event":"12/13/2012 09:40 UTC","Date Submitted":"12/13/2012 11:55 UTC","Sighting Duration":"Undisclosed","Source":"MUFON","Tags":"City","Log Number":"US-12132012-0030","divs":["Sighting DetailsI was driving home from work, heading West on W Airport Frwy (in Fort Worth, toward downtown) at approximately 9:40 pm on Thursday, Dec 13, 2012. I had the windows up and the radio on so I did not hear any sound, however, the object was solid, round and glowing a beautiful cobalt blue. It came from the direction of East (behind me) and I saw it out of the left side of my windshield for about 3 seconds, and then it suddenly disappeared. It did not seem to land, just vanished in mid air. There were no buildings close enough for it to have been hidden by. If I had to guess, I would say it was likely about a mile up in the air. I have never seen anything like it and there was only one (that I personally saw).It flew in a slightly angled path just before it disappeared. My reaction was to try to rationalize what it could be, but I came up empty. This was not any known aircraft (none that I am aware of). There were other cars driving the same route, both ahead of and behind me, and I am wondering if any of them saw the same thing.When I first saw it I simply had no clue what it was, my first reaction was simply that it WAS, simply put, a UFO,"],"Country":"United States","Object Features":"Unknown","trends":["There have been 128 other sightings in Fort Worth","There were no other sightings in Fort Worth on or around December 13th 2012"],"Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=32.727049,+-97.31981(44536)&iwloc=A&hl=en\"> mufon case (44536) map </A>","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/44536.html.txt","/var/www/straped/mufon/org/44536.html"],"Disposition":"Unresolved","City":"Fort Worth","Case Number":"44536"}