{"Tags":"City","Summary":"I saw multiple Hovering Objects that seemed to hover about 1 to 5 miles out and then lower behind the trees till out of sight I also saw smaller orb like or meteor like that appeared and decended rapidly then seem to slow and kept going behind trees","Latitude":"34.881954","Object Flight Path":"Stationary,Hovering then path","Case Number":"44540","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Date of the Event":"12/14/2012 12:00 UTC","trends":["There have been no other sightings in Beulaville","This sighting has never been favorited."],"City":"Beulaville","files":["/var/www/straped/mufon/html2text/44540.html.txt","/var/www/straped/mufon/org/44540.html"],"Object Shape":"Circle, Disc","Log Number":"US-12142012-0004","map":"<A HREF = \"http://maps.google.com/maps?q=34.881954,+-77.795474(44540)&iwloc=A&hl=en\"> mufon case (44540) map </A>","Region":"North Carolina","Date Submitted":"12/14/2012 06:46 UTC","Object Features":"Unknown","Disposition":"Unresolved","Weather Factors":"Unknown","Country":"United States","divs":["Sighting DetailsI Stanley J Guyer saw what i thought to be a meteor shower at first started about 3:30 am to 4:00 am lasted till 5:30 am. I noticed that the objects started descending rapidly from one direction and like a meteor shower then they started doing some strange things like appearing then moving rapidly away in the atmosphere in different directions, I thought this was unusual so i went inside to get my video recorder or camera to take some pictures of the event to verify what i was seeing I woke my wife and daughter searching for these things because i could not find them,I also asked them to come look to verify what it was i was watching so i would another witness to this strange event. It was then that i looked behind my house after walking out into my yard father to see where these things where coming from. I then Noticed Two Different Objects That I could not Identify As aircraft or star or what it was and asked my daughter and wife to please look and tell me what they saw, Because this is not the first time i have seen these objects but located in the area of the sky different than was their orientation this night and also because there was a-lot more activity than just these objects hovering and pulsating a red blue orange yellow not like a aircraft i have ever seen these colors seem to move along the edge of the object. If i had to give the object a shape that would be difficult but i believe disc or a strip of light that seem to get brighter at different times while watching it. The smaller objects that reminded me of meteors but circular in shape but seem to behave differently than what i have seen before in the sky while on guard duty in Hawaii and other places I've been stationed. they seem to appear and then zoom down towards the ground in a controlled manner they did not like most meteors i seen start to burn and trail out till they burned up high in the atmosphere these where very low about tree top level or a little higher then zoomed down towards the ground and also some seem to appear and zoom towards the sky out of the atmosphere they also traveled in a variety of directions some looked like they might have come down in the fields behind my house and i wanted to get my rifle because i was concerned no i was scared and still am while i am writing this. I did get some pictures of one of the objects but ran out of card memory before the objects could no longer be seen where they showed and seem to have left the area. I have to get a card reader or connector to send you the pictures i took some while standing some on a base tripod. I have seen many meteor showers in my time while in the military and i have seen many aircraft from all over the world i don't know of any that can hover for a 1 hour to 1.5 hours then just disappear not to mention all of the many balls or circular lights i saw comming down and also going up."],"Longitude":"-77.795474","Source":"MUFON"}