{"Latitude":"36.786271","files":["/var/www/straped/mufon/html2text/44552.html.txt","/var/www/straped/mufon/org/44552.html"],"Object Shape":"Triangle","Sighting Duration":"Undisclosed","Region":"California","Case Number":"44552","Object Features":"Unknown","Log Number":"US-12142012-0016","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=36.786271,+-119.414512(44552)&iwloc=A&hl=en\"> mufon case (44552) map </A>","divs":["Sighting DetailsA group of four lights on what appeared to be a large craft, with 3 of the lights on the three points of the triangles edges and one red flashing light in the middle moved slowly South of my house, hovered momentarily and turned left, moving in a Northeast direction up Shepard's Canyon. The object itself was in the Canyon over the road, approximately 200 to 300 feet in elevation and rising above the treeline as necessary to make it over the ridgeline at the end of the Canyon. There was absolutely no sound associate with the object which unequivically rules out a jet or proopeller driven airplane or helicopter. The Canyon itself reflects noise from airplanes on a semi-regular basis. I have encountered an extremely low flying, large, propeller driven military plane that barely made it up the and had to turn around at the end of the Canyon unable to clear the ridgeline. That was window shatteringly loud. This craft was perhaps 100 to 150 feet higher in elevation than that, much larger and made no sound whatsoever. The size of the craft was also descernable from the fact that one can redily see homes on the far side of the Canyon and I could see the size of the craft relative to what I knew the size of the homes to be during daylight hours. The craft simply, slowly flew up the Canyon taking more than two minutes to fly over the ridge of peaks to the East, and was observable traveling a few thousand feet. There are blimps in the area that cover the various sporting events of the area, though I don't believe any would have been in the area that night, and it goes without saying that a blimp would have been much smaller than 300 feet in length and nearly as much in width. Likewise, the Bay Area's one Zepplin is still significantly smaler in both length and width. Needless to say, neither would purposely fly into a hard to navigate Canyon at night, either. I have no physical or photographic evidence to back up what I saw, but I am somewhat surprised that there haven't been more reports of the event. I should also report that a similar set of lights, appearing to be the same craft, appeared to hover over the Grizzly Peak area, just south of the tunnel on Hiway 24 at a much greater elevation at about 7 pm many days that month. The outline of the peaks were visible and the craft was several thousand feet above the peak line, stationary most days, and still descernable as a triangle with a center red flashing light."],"Date of the Event":"11/20/2012 09:05 UTC","Viewing Distance":"101-500 Feet","Tags":"City","trends":[],"City":"Undisclosed","Country":"United States","Date Submitted":"12/14/2012 04:37 UTC","Source":"MUFON","Longitude":"-119.414512","Weather Factors":"Unknown","Summary":"UFO over Shepard's Canyon, Oakland, CA","Object Flight Path":"Path with directional change,Path then hovering"}