{"Object Features":"Other","Summary":"Silent bright point-sized object moving through sky. Thru 5x zoom camera solid glowing 3 sections (left, & right sections, vertical section where other 2 joined).","files":["/var/www/straped/mufon/html2text/44555.html.txt","/var/www/straped/mufon/more/44555_submitter_file1__IMG4502.JPG","/var/www/straped/mufon/more/44555_submitter_file2__IMG4503.JPG","/var/www/straped/mufon/more/44555_submitter_file3__IMG4506.JPG","/var/www/straped/mufon/org/44555.html"],"divs":["Sighting DetailsOn Tuesday, November 20, 2012, late afternoon (between 4:00 and 5:00 p.m. EST), while in the parking lot of a grocery store, I looked up in the clear sky at the moon. I saw a bright point-sized object moving near the moon. I thought it was odd that it was not leaving a contrail, so I took out my camera and took several pictures at maximum optical zoom (5x). I estimate the moon was at azimuth 90 degrees and altitude 70 degrees. It took the object about 2 minutes to transit the sky. It was at about azimuth 0 degrees and altitude 15 degrees when it moved behind some trees and I lost sight of it. The object made no sound. Considering its size and appearance through my camera at 5x zoom, I would guestimate its height to be jetliner height, size unknown but it had to be large and distant. The object was solid with three sections: a glowing section to the left, a glowing section to the right, and a vertical section rising up where the other two joined, like a dragonfly shape. The glowing sections glowed with a brilliant white light with yellowish-orange or yellowish-red around the edges. I saw no other objects or aircraft in the sky."],"Longitude":"-82.513352","Weather Factors":"Unknown","Tags":"City","Case Number":"44555","Region":"North Carolina","Log Number":"US-12142012-0018","Date Submitted":"12/14/2012 05:20 UTC","Viewing Distance":"Unknown","Disposition":"Unresolved","Date of the Event":"11/20/2012 04:00 UTC","trends":["There have been 28 other sightings in Asheville","There were no other sightings in Asheville on or around November 20th 2012","This sighting has never been favorited.",""],"Object Shape":"Other","Sighting Duration":"00:02:00","City":"Asheville","Latitude":"35.556526","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=35.556526,+-82.513352(44555)&iwloc=A&hl=en\"> mufon case (44555) map </A>","Country":"United States","Source":"MUFON"}