{"Sighting Duration":"Undisclosed","trends":[],"Summary":"Glow in the woods","City":"Undisclosed","divs":["Sighting DetailsIt was a night just like any other, sitting around watching TV. My mother went to the kitchen to make popcorn when I heard, \"What the hell is that?\" I went into the kitchen expecting my mom to be looking at a weird bug or something, instead she was starring out of the window. There is a farm field across the street, to the west of our house. The field is roughly 200 yards deep, from the road to the beginning of the tree line. Slightly south and across the street is a neighbor's house, roughly 100 yards from the road. It was dark outside, and not much is visible at night in these parts. The neighbors did not have any lights on or a porch light, no one was home. They do have a large poll barn behind the house that has a light over the garage style door. This was completely unrelated to the glow in the woods. The glow was directly across from our kitchen window. It was about 30 yards wide, and came from in the woods. The light did not break the tops of the trees (most of which had no leaves) and I could not tell if it went all the way to the ground. I got a pair of binoculars and starred at this glow for at least 45 minutes. I watched for any kind of movement, change in position, anything. There was nothing, just a strong glow of light coming from the woods. My mother called our neighbors, who were out of town for the weekend, they knew nothing about it. I said before I watched the woods for a sign of anything for about 45 minutes. I saw nothing to describe what could have been producing or causing this glow, and all of a sudden it was gone. As if someone flipped a light switch and turned it off. I don't know if it was a UFO or anything of the sort, but it is inexplicable to my mother and I. We have never seen anything like it before or since. I did try to take pictures, but none produced any results. The only light that was visible was the light above the neighbors poll barn door. I found this to be more strange than the glow itself because the glow was brighter than the barn light."],"Case Number":"44558","Tags":"City","Latitude":"44.316244","Object Flight Path":"Stationary","Object Shape":"Unknown","Date Submitted":"12/14/2012 07:08 UTC","Disposition":"Unresolved","Region":"Michigan","Country":"United States","Source":"MUFON","Log Number":"US-12142012-0022","Weather Factors":"Unknown","Longitude":"-85.593364","map":"<A HREF = \"http://maps.google.com/maps?q=44.316244,+-85.593364(44558)&iwloc=A&hl=en\"> mufon case (44558) map </A>","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/44558.html.txt","/var/www/straped/mufon/org/44558.html"],"Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"11/12/2012 09:00 UTC"}