{"Source":"MUFON","divs":["sighting detailsmyself anda group of friends went to the beach just south of port washington, wi to observe the geminid meteor shower around midnight december 13, 2012. there was a glowing object of 3 orange lights we assumed to be a ship, off in the distance straight east. we werent really paying attention to it. about 30 minutes later this object was ne. later again, i noticed it was straight east towards where it originated. this struck me as odd, being 1:00am at this point why it isnt anchored. within minutes this object seemed to turn, and reveal itself to be much larger than any ship that would be in this lake. i have seen coal ships, and barges, nothing of this size. the front of it had a band of orange\\yellow lights, seemed to be tipped to one side showing a rounded end. towards the middle was a bright red flashing light, and the rear was a bright white light. we agreed this thing had to be almost a mile in length based on its distance, and nothing we have ever seen to resemble a ship or anything of that sort. it was incredible. i only had my cell phone which didnt magnify enough, and it was very dark out on the water. i hope to see this again with proper equipment for imaging. it was late so we decided to call it a night and we left. it remained in its position."],"Case Number":"44564","Sighting Duration":"01:00:00","Date Submitted":"12/14/2012 09:31 UTC","Longitude":"-87.871424","files":["/var/www/straped/mufon/html2text/44564.html.txt","/var/www/straped/mufon/org/44564.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.396065,+-87.871424(44564)&iwloc=A&hl=en\"> mufon case (44564) map </A>","trends":["There have been 2 other sightings in Port Washington","There were no other sightings in Port Washington on or around December 14th 2012"],"Country":"United States","Object Features":"Other","City":"Port Washington","Latitude":"43.396065","Object Shape":"Unknown","Disposition":"Unresolved","Tags":"City","Date of the Event":"12/14/2012 12:00 UTC","Log Number":"US-12142012-0028","Weather Factors":"Unknown","Region":"Wisconsin","Object Flight Path":"Path with directional change","Viewing Distance":"Over One Mile","Summary":"Floating in water Huge Ship like band of yellow lights, one bright flashing white light (stern?"}