{"Summary":"Dark circular object across Mexico City from east to west at a steady height","files":["/var/www/straped/mufon/html2text/44562.html.txt","/var/www/straped/mufon/org/44562.html"],"Sighting Duration":"Undisclosed","Date of the Event":"08/15/2012 07:02 UTC","Longitude":"-88.568644","Tags":"City","Viewing Distance":"Unknown","Date Submitted":"12/14/2012 08:23 UTC","divs":["Sighting DetailsI was in the living room of my apartment talking to my girlfriend and I looked at the sky through the windows that face the south of the city, because there were some clouds with beautiful colors of the sunset. I noticed right away to the east, a black sphere hovering over that area of the city and remained stable there, at first I thought it was a balloon, but I felt that it could be something else, it was very windy day, whit the wind comming in north to south direction and the ball did not move with it. I went to my room to get my camera so we can watch more closely with the camera zoom, and when I return to the window, noticed that the object had started to move toward the east, almost keeping regulate height. It crossed from one side to another of the city in about 10 minutes or so and I took some photographs of it. The object at first seemed a bit high up and then down, but I'm not sure about this. After doing this tour, very gently floating, the object was out of sight among the buildings that are on the west end of my view from my windows. At that time, I continued with the idea that the object could have been a balloon, but I noticed that the object was not moving along with the wind and the altitude was constant. Furthermore, after reviewing the pictures enthe computer I realized that the object would possibly larger than a toy balloon, the weather balloons that I know are white or metal color, not dark. Today I came upon the pictures by casual and I decided to upload them to the MUFON site."],"map":"<A HREF = \"http://maps.google.com/maps?q=20.682618,+-88.568644(44562)&iwloc=A&hl=en\"> mufon case (44562) map </A>","Source":"MUFON","City":"Chichen-itza","Weather Factors":"Unknown","Case Number":"44562","Object Features":"Unknown","Country":"Mexico","Disposition":"Unresolved","Region":"Yucatan","trends":["There have been no other sightings in Chichen-itza","This sighting has never been favorited."],"Log Number":"MX-12142012-0026","Object Flight Path":"Hovering then path,Straight-line path","Latitude":"20.682618","Object Shape":"Circle, Sphere"}