{"Weather Factors":"Unknown","Latitude":"44.989089","Country":"United States","Tags":"City","Source":"MUFON","Disposition":"Unresolved","Object Flight Path":"Stationary","City":"St Paul","Date Submitted":"12/15/2012 12:29 UTC","Region":"Minnesota","Summary":"2 Objects (probably orbs) appeared at about 45 degrees above the horizon. After 5-15 seconds of observation they both faded out at the same time.","Longitude":"-93.029404","Case Number":"44565","map":"<A HREF = \"http://maps.google.com/maps?q=44.989089,+-93.029404(44565)&iwloc=A&hl=en\"> mufon case (44565) map </A>","Sighting Duration":"00:00:15","Log Number":"US-12152012-0001","files":["/var/www/straped/mufon/html2text/44565.html.txt","/var/www/straped/mufon/org/44565.html"],"divs":["Sighting DetailsAt the beginning of 2010 I began researching the UFO field. During the months of September and October I wrote a 27 page paper about the universe, flying disc propulsion, the ET disclosure process and in this paper I requested the confirmation of their presence. On October 16th 2010 at 6:45 pm I uploaded this paper to the internet. Approximately 45 minutes later, at 7:36 pm October 16th 2010, I witnessed 2 glowing hovering objects, maybe a mile up, to my east and about 15 degrees north of Jupiter. After 5 to 10 seconds I realized I was seeing something very unusual and after my eyes got really big they both faded out at the same time during a fade out duration of 1 to 2 seconds. During the next 7 weeks I had more than 10 other interactions with the paranormal, ET crafts and beings. The last sighting was a single blinking craft I witnessed with a friend in the early portion of December 2010. My reaction that first night was that of incredible excitement and elation for about 15 minutes. Then I thought of Jodie Foster's character from the movie \"Contact\" and the scientist in me kicked in and I documented the event. Then, realizing that they went out of their way to say hello, I went into an incredible level of peace and humility followed by a lot of relief; we are not alone. It was the most purest time in my life. I have hand written documentation from that night and a youtube video of myself describing the experiences I had during my contact series. This is the second time I have filed this report as the first report seems to have been deleted."],"Object Shape":"Sphere, Star-like","Object Features":"None","Viewing Distance":"Over One Mile","Date of the Event":"10/16/2010 07:36 UTC","trends":["There have been 22 other sightings in St Paul","There were no other sightings in St Paul on or around October 16th 2010"]}