{"map":"<A HREF = \"http://maps.google.com/maps?q=34.108987,+-116.462953(44560)&iwloc=A&hl=en\"> mufon case (44560) map </A>","Date of the Event":"08/02/2012 07:16 UTC","Date Submitted":"12/14/2012 07:53 UTC","Tags":"City","Disposition":"Unresolved","Viewing Distance":"21-100 Feet","Summary":"orange orb over city then light turns off and silent object flys overhead","trends":["There have been 6 other sightings in Yucca Valley","There were no other sightings in Yucca Valley on or around August 2nd 2012"],"Case Number":"44560","City":"Yucca Valley","Object Shape":"Sphere, Triangle","Latitude":"34.108987","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","divs":["Sighting DetailsThis happened in August, a bright orange orb was hanging over the town of yucca valley. I observed this from my front yard, at first I thought it was Jupiter but confirmed that it was not through [Starry Night Enthusiast sortware. I called my girlfriend out of the house to look at it, I pointed to it and as we were talking about it, it slowly made a straight line West towards us and then vanished. Less than a minute later a dark triangular shaped object flew directly over my and my neighbors house just above the tree line, it appeared to be no more than 50 feet above and absolutely dead quiet. I tried to make out any distinct features from any ambient light reflecting off its surface yet I found it difficult to focus on where the edges ended and the space in the background began. What I made out from its shape was triangular from the void of stars. It flew West until it obfuscated into the night sky. I did not report this earlier because I did not believe I had captured the photo on my phone but after downloading old photos today I found it and there it was. This is not the only strange occurrence we have experiences here."],"Longitude":"-116.462953","Log Number":"US-12142012-0024","files":["/var/www/straped/mufon/html2text/44560.html.txt","/var/www/straped/mufon/org/44560.html"],"Source":"MUFON","Region":"California","Object Features":"Unknown","Country":"United States","Weather Factors":"Unknown"}