{"Object Flight Path":"Stationary","Region":"Pennsylvania","Viewing Distance":"Over One Mile","Disposition":"Unresolved","Longitude":"-79.852242","Case Number":"44578","Date of the Event":"12/12/2012 11:00 UTC","Date Submitted":"12/15/2012 06:04 UTC","Summary":"Huge green fireball with white trail falling east towards Murrysville; Oval ring of blinking lights very high in SE sky 12/12/12","Tags":"City","divs":["sighting detailson 12\\12\\12 at appx. 11 pm, as i was exiting my forest hills (eastern suburb of pittsburgh, pa) home to take my dog for a walk, i observed a huge green fireball with a white tail falling very quickly toward the eastern horizon toward murrysville, pa. i have seen falling stars before, but it did not look like any falling star i have ever observed. the fireball was bright green and huge attached to an extremely bright white tail. i looked up at the sky to see if there were more but i did not see any. instead, i observed a huge circular object extremely high up in the southeastern sky (1:00 position on the se horizon). it was so high up (likely many miles high) that i could not see a surface. the sky was clear and i saw that it was a definite circular formation outlined all around by white\\goldish lights that blinked randomly. there was a very large bright white light in the center. it was completely still for the time i observed it and did not move. i observed a plane pass at a much lower altitude below it. the object did not resemble the plane in any manner. the object was much, much higher up in the sky, and it was absolutely huge and in a perfect shape. there were several stars to the left of the object that were much brighter and very different from the object itself. however, the object was huge in comparison to the stars (i.e., stars were size of dots; in comparison to size of stars, object was size of half dollar). i watched it for at least 10 minutes and then went back in the house because i was a bit frightened by it. it was so high up that i knew it would not show up if i tried to take a picture with my phone. i wondered if it might have been an unusual star formation, so i have looked for it in the same place in the sky every night since then. although i can clearly see the stars that were to the left of it that night, the area of the sky where i observed the object is completely dark with no stars, and i have not seem the object or anything resembling it since. i have never seen anything like it, and have never claimed to see a ufo before. i don't know what the object was, and i am hoping that you can shed some light on this. i also hope that someone else might have observed either the green fireball or the object. it was disturbing."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.423464,+-79.852242(44578)&iwloc=A&hl=en\"> mufon case (44578) map </A>","files":["/var/www/straped/mufon/html2text/44578.html.txt","/var/www/straped/mufon/org/44578.html"],"City":"Forest Hills","Log Number":"US-12152012-0013","Latitude":"40.423464","Source":"MUFON","trends":["There have been no other sightings in Forest Hills","This sighting has never been favorited."],"Sighting Duration":"00:10:00","Country":"United States","Object Features":"Unknown","Object Shape":"Fireball, Oval","Weather Factors":"Unknown"}