{"Disposition":"Unresolved","Date Submitted":"12/15/2012 08:14 UTC","Object Shape":"Sphere","Log Number":"US-12152012-0007","Object Features":"Dome, Window(s), Patterned Surface","City":"Phoenix","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.510649,+-112.018458(44572)&iwloc=A&hl=en\"> mufon case (44572) map </A>","Sighting Duration":"04:00:00","Viewing Distance":"Unknown","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/44572.html.txt","/var/www/straped/mufon/org/44572.html"],"Weather Factors":"Unknown","Source":"MUFON","divs":["Sighting DetailsVery simply, I received a new camera, and thought it would be cool to take pictures from my patio of some of the planets that have become visable, I was comparing the sky with what was on the computer as to what i was looking at, and I noticed \"stars\" in places that werent indicated. So I zoomed in with my camera at these points of light, and took some pictures. once i took the picture, i loaded it on my computer and zoomed in some more, and the shapes of the object were obviously not natural. they were lit, jointed and obviously manufactured. I compared them with \"known items that are in orbit of the earth, ie satilites etc, and there was nothing like it listed. I have a total of 8 different objects, and I have gone out on several nights, with different friends, and Im able to take the same pics every night with so other ships as well. They do not resemble anything man made we have or any other country has produced. Dont know who to tell or whom to send the photos to. Very pleased with the performance of my canon cybershot 16 megapixil camera though. i wish i had something stronger to use now, but its a nightly thing. I know I cant be the only one seeing thease things. some one le me know if your seeing them too. Thank you"],"Latitude":"33.510649","Region":"Arizona","Summary":"blueish saucer w/ dome, more oval than round with windows reflecting sunlight","Country":"United States","Case Number":"44572","trends":["There have been 417 other sightings in Phoenix","There were 2 other sightings in Phoenix on or around December 12th 2012"],"Longitude":"-112.018458","Date of the Event":"12/12/2012 12:00 UTC"}