{"Country":"United States","Region":"Illinois","Object Features":"None","Sighting Duration":"00:35:00","Weather Factors":"Unknown","Disposition":"Unresolved","Source":"MUFON","Latitude":"42.47891","Date Submitted":"12/16/2012 12:22 UTC","trends":["There has been one other sighting in Winthrop Harbor","There were no other sightings in Winthrop Harbor on or around September 7th 2012"],"Summary":"two orbs, pastel colors, one orange one yellow, low in west, 7:00 pm, stationary full time, 35 min. duration, no sound-wind-clouds","Date of the Event":"09/07/2012 07:00 UTC","Longitude":"-87.823684","map":"<A HREF = \"http://maps.google.com/maps?q=42.47891,+-87.823684(44588)&iwloc=A&hl=en\"> mufon case (44588) map </A>","Object Flight Path":"Stationary","Viewing Distance":"Unknown","Log Number":"US-12162012-0002","files":["/var/www/straped/mufon/html2text/44588.html.txt","/var/www/straped/mufon/org/44588.html"],"Tags":"City","Case Number":"44588","Object Shape":"Sphere","divs":["sighting detailsfriday evening, sept. 7 2012, 7:00 pm. took dog for a walk along the new section of 5th st. which runs east\\west between the bike path and lewis ave. i started at eastern end (bike path). street is 1\\2 mile long and perfectly straight. sun was low in southwestern sky. no clouds, no wind, blue sky. saw two orbs(?) low in western sky, approx. 25 deg. above horizon. easy to notice since they were right in my line of sight. they were positioned roughly vertically, one at approx. 1:00, the other at 8:00. higher one was orange, the lower one was yellow. both were the same size, each a solid pastel color, and separated by about one finger's width at arm's length. walked all the way to end of 5th. during that time, three high flying jets passed by, all traveling west to east. objects were always in view. turned around and walked back to eastern end of 5th, arrived at bike path at 7:25 pm. objects had not moved, changed size or color, during this time. took dog home and got my neighbor who was outside. we both went back to the bike path\\5th st. intersection. he observed the same two spheres i had, still in their original postions. at approx. 7:35 pm, a large cloud bank arrived and obscured both objects, so we returned home. fascinating to look at these things, very pretty, not threatening or scary. spent 6 years in the military and have a strong interest in aviation, but never seen anything like these before. i don't know what they were, but can tell you what they weren't - not aircraft, helicopters, blimps, weather balloons, sun dogs, mirages, so-called \"ufo's\", or chinese lanterns (unless you can convince me lanterns can remain absolutely motionless for 35+ minutes). footnote: on tues. sept. 25 at 6:25 pm, saw a similar orb at the same location. only one this time, orange, and the weather conditions were the same as on the 7th. higher in the sky, but again in the west. only this time the object was in sight for just 10-15 seconds from when i first noticed it, then it just faded out till it was no longer visible. i'd be interested in knowing if anyone else in my community saw these objects."],"City":"Winthrop Harbor"}