{"files":["/var/www/straped/mufon/html2text/44582.html.txt","/var/www/straped/mufon/org/44582.html"],"divs":["Sighting DetailsOn October 22, 1992, about 11-11:30 pm, a friend and I were sitting in a car on Pickering (Ontario) beach, facing south looking out over Lake Ontario, just west and adjacent to the Pickering nuclear power plant. This object came out from behind the plant over the lake, flying in a straight line, from east to west. It was a cylinder-shape, with a rounded nose that glowed red, the body of the object appeared a sparkly emerald green, and something that looked like a shimmering blue (the colour of a gas flame) came from the rear. At first I thought it may have been a meteor, but seemed to be moving too slowly. The object flew staight; it did not get smaller, it did not dive down into the lake or disintigrate or break up. It simply VANISHED! Right before our eyes. I was dumbfounded, but my friend and I both saw the same thing. I have often wished that I had contacted the nuclear power station immediately afterward, as I am sure they must have caught it on security cameras, but I was younger then, and afraid of ridicule or being called a \"crackpot\"!"],"Case Number":"44582","Source":"MUFON","Date Submitted":"12/15/2012 09:40 UTC","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-85.315904","Object Features":"Patterned Surface, Other","Disposition":"Unresolved","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Latitude":"51.263355","map":"<A HREF = \"http://maps.google.com/maps?q=51.263355,+-85.315904(44582)&iwloc=A&hl=en\"> mufon case (44582) map </A>","Summary":"Drk night, looking S. over Lake Ont., obj.flew strt L to Rt, cyl shape front glow red, body sparkling emrld grn,,rear blue gas-flame colour, just DISAPPEARED before eyes","Country":"Canada","City":"Pickering, Ontario","Sighting Duration":"Undisclosed","Date of the Event":"10/22/1992 11:28 UTC","Object Shape":"Cigar, Cylinder","Log Number":"CA-12152012-0016","Tags":"City","trends":["There have been no other sightings in Pickering, Ontario","This sighting has never been favorited."],"Region":"Ontario"}