{"Country":"United States","divs":["Sighting DetailsMy sister and I are from Boring Oregon. that is where we lived at the time we saw this ufo! we were young kids myself about 9 or 10 my sister 2 years older than I. we always enjoyed sleeping outside in the summer. so the night of the sighting was like any other night, we got our beds ready on the front patio of the house which our house was a good sized 2 story home with big sliding glass doors on the front of the house which is were the patio is and where we chose to sleep that night. the view from sleeping on the patio was an unobstructed view of the night sky. there were trees on the outskirts of my vision, but from a laying position i could see about all of the night sky. the only thing that was in my view was a big tree to my left that we had topped off when i was younger due to the threat of wind and the tree falling on our house. our patio had grass right off it and then the trunk of the big topped off tree was about 50 feet from where we slept. i fell asleep with no problems that i can remember, and then I remember waking up to take the covers off my face, and when i did i was lying on my back and i opened my eyes to see the whole previously unobstructed night sky being taken up by this ufo! the ufo was right over the top of us if felt like we were directly under the middle of it. its height was very low it seemed to be just over the topped off tree! it was so close i could of thrown a rock and hit it! with it being so close i remember i could see the different textures and see shadows casting off those textures on to the craft. i cant recall direct lights in my eyes but the thing seemed to be illuminated by a soft dark but light glow. I remember filling like i was looking at someone that was looking at me but i did not see anyone per say. it was very steady and not moving it just seemed to be hanging there. I did not even here any noises and it was so big and close u would think you would here the power of this huge thing? so all that was about a minute of observing the ufo i then woke up my sister by shaking her. when she woke up we both got another look at it and by her lead threw the covers over our head. i was very curious so i looked again and as i uncovered my head i just caught the thing with hardly any movement the craft very fast and effortlessly went from right over my head to a little bigger than a big star way up into the sky, and then disappeared. the only noise it made when it moved was a swish like the noise of the wind and air moving! I was in shock when we saw it i don't really remember anything right after the sighting like falling back asleep or what we did? I find that really weird also cause knowing me as a child my first reaction would be run screaming for my mom! and i don't even remember if i went back to sleep, went inside or anything till the next morning when we both told our parents. they were amazed by the story but kinda in disbelief had us separately draw what we saw. I have thought about that every day since it happened and am very very interested In learning more!!!!!!!!"],"files":["/var/www/straped/mufon/html2text/44581.html.txt","/var/www/straped/mufon/org/44581.html"],"Object Features":"Window(s), Patterned Surface, Appendage(s)","Date Submitted":"12/15/2012 07:46 UTC","Region":"Oregon","Longitude":"-122.33558","Case Number":"44581","Viewing Distance":"21-100 Feet","Date of the Event":"07/07/1989 12:00 UTC","Disposition":"Unresolved","Object Flight Path":"Hovering then path","Latitude":"45.386672","Source":"MUFON","Log Number":"US-12152012-0016","map":"<A HREF = \"http://maps.google.com/maps?q=45.386672,+-122.33558(44581)&iwloc=A&hl=en\"> mufon case (44581) map </A>","trends":["There have been no other sightings in Boring","This sighting has been favorited 1 time."],"Summary":"i could see the texture of the craft it was so close i could hit it with a rock","City":"Boring","Tags":"City","Object Shape":"Circle, Disc","Weather Factors":"Unknown","Sighting Duration":"Undisclosed"}