{"Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/44585.html.txt","/var/www/straped/mufon/org/44585.html"],"City":"Warwick","Source":"MUFON","divs":["Sighting DetailsI was driving home with my daughter and all of a sudden she points up at the sky and tells me how bright that plane is and how low it looks. we were just talking about how the lights were never this bright and that maybe the engineers were making newer brighter planes. as we were talking, the plane moved across the sky, then all of a sudden it stopped right above the tree line. we were just thinking how no plane could do that. quickly, we pulled over and for about two minutes we watched the plane, it didn't move and it didn't make any sound. my daughter said she saw design on it, so i know it couldn't have been any type of army planes. the wing of the plane was shaped like a diamond, but you could only tell if you really looked at it, and the lights were really bright. after the two minutes of watching, it started to move again. i have never seen something so spectacular in my life. i know that planes cannot hover,and i know that it wasn't a special army plane. my daughter saw it too and i was basically testing her to see if she really saw what she said we both saw. it was heading from south east to northwest."],"Object Features":"Patterned Surface, Wings, Other","Log Number":"US-12152012-0019","Object Shape":"Other","Summary":"was light a bright plane but hovered!","Longitude":"-71.472152","Object Flight Path":"Path then hovering","Weather Factors":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","Latitude":"41.714305","Case Number":"44585","map":"<A HREF = \"http://maps.google.com/maps?q=41.714305,+-71.472152(44585)&iwloc=A&hl=en\"> mufon case (44585) map </A>","trends":["There have been 11 other sightings in Warwick","There were no other sightings in Warwick on or around December 15th 2012"],"Tags":"City","Region":"Rhode Island","Disposition":"Unresolved","Date of the Event":"12/15/2012 09:21 UTC","Date Submitted":"12/15/2012 11:00 UTC"}