{"divs":["sighting detailsat approximately 11pm on 12\\12\\12 i witnessed 1 f-15a\\b refueling with a kc-135 in standard fashion, once disengaged the f-15 dropped dramatically, full afterburner, to treetop levels. the f-15 continued moving erratically for 2 plus minutes. my wife at a home 1 mile away phoned me of a house shaking noise that sounded like a bullet train, pulsing and gyrating, complete with mechanical noises inconsistent with f-15 powerplant. this call was made as the f-15 was still re-fueling, and the noise was directly over her head. my parents, located in warner, spoke of the same noise. i have witnessed f-15's in every possible movement, from steep dive to full afterburn vertical take-off. the following night, 3 more f-15's arrived on-station and took up cap (combat air patrol) flight pattern directly overhead at approx 10,000 ft. my wife is also familiar with f-15 engine noise and was terrified to exit home and observe object. apparently 2 f-15's engaged this object in acm (air combat maneuvers) through several towns, warner, bradford, wilmot and new london. supposedly mass ang reported week long meneuvers, but they have not returned since 12\\13, or before 12\\12."],"Weather Factors":"Unknown","Region":"New Hampshire","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=43.27291,+-71.935801(44589)&iwloc=A&hl=en\"> mufon case (44589) map </A>","Object Shape":"Unknown","City":"Bradford","Country":"United States","Date Submitted":"12/16/2012 12:29 UTC","Source":"MUFON","trends":["There has been one other sighting in Bradford","There were no other sightings in Bradford on or around December 12th 2012"],"files":["/var/www/straped/mufon/html2text/44589.html.txt","/var/www/straped/mufon/org/44589.html"],"Log Number":"US-12162012-0003","Case Number":"44589","Sighting Duration":"Undisclosed","Summary":"Mass Air Guard Engaging UFO in Air Combat Maneuvers-Terrifying Sounds","Longitude":"-71.935801","Latitude":"43.27291","Date of the Event":"12/12/2012 10:54 UTC","Object Flight Path":"Unknown","Tags":"City","Object Features":"None","Viewing Distance":"501 Feet - 1 Mile"}