{"map":"<A HREF = \"http://maps.google.com/maps?q=38.360901,+-122.814931(44599)&iwloc=A&hl=en\"> mufon case (44599) map </A>","files":["/var/www/straped/mufon/html2text/44599.html.txt","/var/www/straped/mufon/org/44599.html"],"Date Submitted":"12/17/2012 03:14 UTC","Log Number":"US-12172012-0001","City":"Sebastopol","Latitude":"38.360901","Tags":"City","Object Features":"Unknown","divs":["Sighting DetailsI was leaving my friends house and as always looked up in the sky as I walked out the door, I saw what I first thought was a satelite in orbit with the sun reflecting off it(like a bright star in the sky only moving), but thought the object to be at a high altitude rather than in close orbit but higher than the planes I have observed in my life time, I called my friend out of the house telling her there was a ufo and she came out to observe the object with me, it was moving nothwest about the speed you would see a satelite moving,from almost directly above but more westward of my position, the object then changed direction moving west and then appeared to be gaining and losing altitude but evenly like ripples of waves, I thought my eyes were playing tricks but my friend confirmed the movements, I lost the object as it went behind the trees in her yard and moved to a better position to see it again but was never able to find it again. I looked at my watch to note the time and left for home. I dont think it was a plane because there was no lights on the object but seemed more like it was reflecting light, and was flying at an extremely high altitude,I know from observing planes that I should of been able to here it from my position but heared nothing on a very quite night. I know it was not a satelite because ive never seen one change dirction and seemed to low in altitude and they usually just disappear for no reason shortly after beeing observed.The whole incident lasted about three to four minutes before I lost the object."],"Region":"California","Date of the Event":"12/12/2012 05:54 UTC","trends":["There have been 2 other sightings in Sebastopol","There were no other sightings in Sebastopol on or around December 12th 2012"],"Case Number":"44599","Country":"United States","Longitude":"-122.814931","Object Shape":"Star-like","Source":"MUFON","Weather Factors":"Unknown","Disposition":"Unresolved","Object Flight Path":"Path with directional change","Viewing Distance":"Unknown","Summary":"looked much like a satelite lit up from outside source except at a high altitude and not in low orbit.","Sighting Duration":"Undisclosed"}