{"Country":"United States","Tags":"City","Date Submitted":"12/16/2012 05:38 UTC","City":"Inola","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Object Shape":"Unknown","Log Number":"US-12162012-0011","Object Features":"Unknown","Date of the Event":"12/14/2012 07:30 UTC","Case Number":"44597","files":["/var/www/straped/mufon/html2text/44597.html.txt","/var/www/straped/mufon/org/44597.html"],"Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-95.50942","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=36.15121,+-95.50942(44597)&iwloc=A&hl=en\"> mufon case (44597) map </A>","Summary":"2 unflashing white lights travel through clouds","Weather Factors":"Unknown","divs":["Sighting DetailsMy friend and I were drinving west on 240 near Inola around 7:30 PM. I first noticed a light in the western sky moving south. I watched as it was completely covered by clouds. After a minute I started seeing the light coming through the clouds and eventually coming completely out of cloud cover. I thought the object could have been an airplane but never observed the red or blue blinking lights that are on all aircraft I've ever seen. After it came out of the clouds its path changed and it started moving east. It continued moving towards us and my friend noticed it as well. I didn't say anything to him before because I didn't want him to think I was crazy. After coming out of the clouds we could see there were two bright unblinking white lights on the craft. It seemed to change direction while going through the clouds, going from a south bound path to a west bound path. As it traveled west it came closer and closer until it was going right over us. As it traveled above us I looked but couldn't see an outline or any other lights. I told my friend there were no red or blue lights and he confirmed that he didn't observe any either. After traveling over us I turned around in the passenger seat and tried to observe it behind us, but never saw it again. It's possible it went into more clouds as it was storming earlier, but had since stopped raining. I kept looking for a few minutes behind and on both sides of us, but couldn't see it again. It could have also ascended after passing over us, but it would have been a very quick ascension that I wouldn't expect from an airplane or helicopter. My friend is more skeptical than me, but he said it was a UFO before I did. I think there is an airport nearby, but I believe it is on the south side of 240 and the object came from north of 240, so I don't believe it could have came from the airport."],"Region":"Oklahoma","trends":["There have been no other sightings in Inola","This sighting has never been favorited."],"Latitude":"36.15121"}