{"Source":"MUFON","Object Shape":"Unknown","divs":["Sighting Detailsi was heading north on main street about 9:40 pm to take my girl freaind home.when my radio started to go relly fuzzy. then i looked at the sky for a second when i noticed sojmethin wierd two bright lights relly close to each other turning from green to white. at first i thought it was a pipper cub or something but then i rellized it was moveing way to slow to be an aircraft and i also know that aircraft running lights are requierd to pulsate with thees were not.so i pulled over for a min the object emmitted no sound and was moveing east at a verry slow rate of speed. then one of the lights just went out and the other accelerated into the north east.i know what i saw was not a aircrat or a helicopter. i am a ufo reasercher and i now how to tell the diffrance. and one other thing i realiloized after i saw it, the day befor i herad a loud humm so i went out side to take a look what i saw was kinda wierd. three totily unmarked black choppers flying over my house they were relly low though like at most 150-200 feet up i could see the pilots. but each one had no id numbers of any kind at all. first time iv ever seen a black, proply one of the few to see three up close."],"trends":["There have been 10 other sightings in Oshkosh","There were no other sightings in Oshkosh on or around February 18th 2006"],"Viewing Distance":"Unknown","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Longitude":"-88.540574","Case Number":"4459","Date of the Event":"02/18/2006 09:40 UTC","Date Submitted":"02/18/2006 09:40 UTC","Sighting Duration":"00:05:00","Region":"Wisconsin","Country":"United States","Summary":"i was driveing dowm main stree when i obseved two lights changing from green to white","files":["/var/www/straped/mufon/html2text/4459.html.txt","/var/www/straped/mufon/org/4459.html"],"Latitude":"44.028506","City":"Oshkosh","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=44.028506,+-88.540574(4459)&iwloc=A&hl=en\"> mufon case (4459) map </A>","Object Features":"Unknown","Weather Factors":"None","Tags":"City","Log Number":"US-02202006-0003"}