{"Disposition":"Unresolved","Date Submitted":"12/16/2012 01:16 UTC","Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-12162012-0004","map":"<A HREF = \"http://maps.google.com/maps?q=38.938899,+-104.636093(44590)&iwloc=A&hl=en\"> mufon case (44590) map </A>","trends":["There have been 3 other sightings in Peyton","There were no other sightings in Peyton on or around December 10th 2012"],"Latitude":"38.938899","Date of the Event":"12/10/2012 10:00 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-104.636093","Region":"Colorado","Country":"United States","Object Flight Path":"Path with directional change","City":"Peyton","Case Number":"44590","Object Shape":"Triangle","Summary":"Triangle shape with 5 to 6 lights 4 white with pulsating red light with a random blue flashing light","Tags":"City","files":["/var/www/straped/mufon/html2text/44590.html.txt","/var/www/straped/mufon/org/44590.html"],"Source":"MUFON","divs":["Sighting DetailsI was heading home going east on Woodmen drive off of I 25 in Colorado Springs about 2 miles from Reaching Falcon highway I noticed 3 white lights in the eastern sky. When I got to the the first Walmart turn off into the subdivision behind it. I noticed a hovering triangle above the electrical distribution station about 800 ft in the air with a blinking red light on the side and 3 smaller white lights at each tip making a triangle with a larger white light towards the center of the craft with no apparent outline of the craft it seemed to match the night sky so perfect or it was somewhat transparent I observed the craft hovering there for about 8 seconds i then got out of my car with my cell phone to take some pictures and video. I noticed no sound and the object began to slowly take off turning towards the south and then just took off slowly by the time i picked up my jaw off the ground in amazement the craft was to far away for my cell phone to be of any use. Hopefully the people who live in the subdivision near this power line distribution junction got some cool pictures and video maybe."]}