{"files":["/var/www/straped/mufon/html2text/44596.html.txt","/var/www/straped/mufon/org/44596.html"],"divs":["Sighting DetailsI was 15 and home alone in a new housing development. I walked outside to sit on the porch because I was bored. I watched in the woods as a series of white and red lights seem to move in a stationary area in dense forest maybe 300-400 yards from me. I thought maybe someone was driving their car in the the thick forest area. The lights then changed to the most beautiful pulsating color display of every color I've ever seen. The object slowly rose to the top of the trees and began moving slowly toward me. I got up of my chair and walked towards it waiving my hands in the air as to get it's attention. I heard no sound coming from it and felt no fear towards it. It slowly moved above me and I began to notice the objects shape. It was egg shaped with three circular pieces on the bottom. The object was a bright metallic color like a mirror surface or chromed titanium. Its lights seemed to be in the metal and pulsed and vibrated every color imaginable like the brightest LED. That's when I noticed that the object was not just egg shaped. There was a dark outer shell around it that somehow magnified the stars in the sky to camouflage its true shape and size. It had black sparks shooting off around it and a few small lights trailing the object but, as it moved the stars in the camouflage seem to move in an alternate direction. I remember thinking, \"I have to get my camera!\" as I turned to get it my mind went blank. I looked up and the object was much further away than it had been seconds before at the extremely slow speed it was moving at and I was facing another direction feeling slightly confused. My mind snapped back and I raced into my house and grabbed my video camera and darted outside chasing it as it moved in an arc straight up and accelerated very fast making no sound in a maneuver that if it had been a jet it would have easily broken the sound barrier causing a massive sonic boom. I walked home confused about what had just happened and noticed that what I had thought to have only been a 10 minute experience had actually been more like 45 minutes. After that, I began to become obsessed with universal geometry and the occult. Two things I had not been interested in before. I recently had an x-ray of my head and noticed a small object near my left ear that showed up brighter than the bones themselves."],"Case Number":"44596","Country":"United States","Latitude":"34.946147","Summary":"I watched as it rose from the ground to the top of the trees and then began to move very slowly towards me. I stood below it and am missing a small amount of time. It then moved slowly straight up into the sky","map":"<A HREF = \"http://maps.google.com/maps?q=34.946147,+-85.221955(44596)&iwloc=A&hl=en\"> mufon case (44596) map </A>","Source":"MUFON","City":"Fort Oglethorpe","Date of the Event":"06/10/2000 12:00 UTC","Date Submitted":"12/16/2012 05:08 UTC","Tags":"City","Object Shape":"Circle, Cylinder, Egg, Oval, Sphere, Star-like, Teardrop","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Log Number":"US-12162012-0010","Object Features":"Other","Viewing Distance":"21-100 Feet","Longitude":"-85.221955","Disposition":"Unresolved","Weather Factors":"Unknown","Sighting Duration":"00:45:00","Region":"Georgia","trends":["There have been 2 other sightings in Fort Oglethorpe","There were no other sightings in Fort Oglethorpe on or around June 10th 2000"]}