{"divs":["Sighting DetailsThis spacecraft looking object hovered-sat there,did not move an inch above my house, my backyard, with no sound.It was immense as I thought I could almost reach out and touch it.There was no telling of the distance as it was huge.I also thought it was a possible holographic image that someone put in the sky but I did not see where it could have been beamed from.My camera would not have done any justice as it was that close and that huge in size.If I was to estimate the size of this thing,the Multi colored lights on it were the size of a small city,never mind the size of the spacecraft itself -indeterminable- I also tried to report it while it was fresh in my memory as now I cannot remember certain things like the color of the lights,perfectly round,like the spacecraft itself,perfectly round and I could only see the under side of it as it was directly above me south and to the west slightly and it was Huge, Gigantic, Huge,Gigantic!! Surreal as I could not believe my eyes.No Aliens,there was no activity what so ever and silent,NO SOUND! I also thought if someone was trying to play a prank,as in a Hologhraphic Image-would have cost a small fortune! I soon quickly dismissed this but,now since having to study other sightings that have not even come close to the sighting I had.So as far as I know I am the only person that witnessed it at around midnight,clear skies,I was the only person in my house and it stayed there for about an hour or so as I soon tired and went to bed.If this was a prank and someone or something trying to disturb me in some fashion,they should come forth and explain their activity-against me-or for me!So I am making this so called sighting Public and so they can come forth and admit their actions!! I have not been able to put this so called sighting-image out of my mind and the amount of money it would have cost - if it was - a Holograph and a very expensive endeavor!! At what cost it would have been to them? Just to mess with me and my mind?Come forth or forever keep your peace WITH ME and the \"Lord\" is my only witness!! So an apology to \"him\" as well.How do you do That?"],"Longitude":"-113.457985","files":["/var/www/straped/mufon/html2text/44605.html.txt","/var/www/straped/mufon/org/44605.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=53.560804,+-113.457985(44605)&iwloc=A&hl=en\"> mufon case (44605) map </A>","Object Features":"Dome, Other","Viewing Distance":"Over 1 Mile, Unknown, N/A","Disposition":"Unresolved","Case Number":"44605","Source":"MUFON","Log Number":"CA-12172012-0007","Date Submitted":"12/17/2012 01:36 UTC","Tags":"City","Weather Factors":"Unknown","Region":"Alberta","Country":"Canada","Summary":"It was a huge object with no sound \"Huge\" with lights and absolutely NO Sound,no pictures I am sure my camera would not have","Object Shape":"Other","Date of the Event":"07/07/1997 12:00 UTC","trends":["There have been 70 other sightings in Edmonton","There were no other sightings in Edmonton on or around July 7th 1997"],"Object Flight Path":"Stationary","Latitude":"53.560804","City":"Edmonton","Sighting Duration":"01:42:06"}