{"Weather Factors":"Unknown","divs":["Sighting Details I saw a UFO last Friday night above the ocean near Klamath, California. I live in Requa, near Klamath on a mountain with a view of the Pacific Ocean. On December 14, 2012 at 11:00 PM approximately. I had gone to bed. I looked out my bedroom window over the ocean to see if I could see any meteors coming down....I saw one meteor and then I noticed on the horizon two lights going back and forth like they were looking for something.really fast back and forth...The whole thing went on for about 20 minutes from when I started watching it. In the middle as I was watching the whole thing, one of the lights noticed me. Then it flashed at me like the star of bethlehem star for about 30 seconds and then it went back to searching for something....then in the middle of this scene a large object (really big) behind a cloud starts coming nearer from the southwest over the ocean. Every five minutes or so it would flash a light and light up the clouds above it. It went over to where the two lights were buzzing around and just stayed there above them. Then one of the lights stopped and hovered for about 2 minutes and then both of the lights went up and into the cloud and large object. Then the whole thing moved away and the stars were visible again....."],"Object Flight Path":"Path then hovering","Object Features":"Unknown","Tags":"City","Date Submitted":"12/17/2012 01:30 UTC","files":["/var/www/straped/mufon/html2text/44604.html.txt","/var/www/straped/mufon/org/44604.html"],"Summary":"I saw 3 UFOs on 12/14/2012 at 11:00 PM at night. over the Pacific Ocean.","Case Number":"44604","Longitude":"-124.069758","Region":"California","trends":["There have been no other sightings in Klamath","This sighting has been favorited 1 time."],"Sighting Duration":"Undisclosed","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Latitude":"41.548887","Object Shape":"Blimp, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=41.548887,+-124.069758(44604)&iwloc=A&hl=en\"> mufon case (44604) map </A>","City":"Klamath","Date of the Event":"12/14/2012 12:00 UTC","Log Number":"US-12172012-0006","Country":"United States"}