{"Region":"Indiana","Sighting Duration":"Undisclosed","Country":"United States","Latitude":"40.642658","Tags":"City","Viewing Distance":"Unknown","trends":["There have been 2 other sightings in Delphi","There were no other sightings in Delphi on or around December 14th 2012"],"Weather Factors":"Unknown","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Date Submitted":"12/17/2012 08:45 UTC","Date of the Event":"12/14/2012 07:30 UTC","Longitude":"-86.64342","Object Features":"Unknown","Object Shape":"Cigar, Diamond, Star-like, Triangle, Other","map":"<A HREF = \"http://maps.google.com/maps?q=40.642658,+-86.64342(44613)&iwloc=A&hl=en\"> mufon case (44613) map </A>","Case Number":"44613","divs":["sighting detailsdecember 14 ,2012 6:30 pm ,me and my two daughters were coming from town,we live in the country .delphi in. my car was the only one on the road ,we noticed some beautiful but weird blue,red and white lights on the sky . we didn't know what it was . so i stopped my car to look at it .i noticed that the object stopped nd started coming my way ,i got scared so i kept driving and parked in a neighbours driveway.the object passed over us it was huge,and it disappeared .so i desired to keep driving home . as soon as we got home i parked outside my driveway for about 2 minutes to see if it was gone. there was nothing on the sky anymore.so i went into the garage and parked my car .than i told my daughters joking around that i was going outside to see if the aliens would take me . so i went outside and looked up the sky it was clear. but my youngest daughter went outside to tell me to get back in the house . i said ok . than she yelled out \" mom they're here \" pointing up the sky .there was the big object again up in the sky top of my house .we got so scared .we went inside the house locked the doors and turned off all lights. we went to the back sliding door witch is like. window . and just looked up the sky .the huge abject was hovering and went towers a bunch of little stars like lights .those stars like lights were about 25-30 of them hovering and going from side to side making a triangle shape .this lasted for about 1 1\\2 .and they were gone .. just the triangle staid there .i was so scared that i couldn't sleep tht night ."],"Summary":"huge object on the sky .with blue,red and white lights .triangle shape.","Source":"MUFON","City":"Delphi","files":["/var/www/straped/mufon/html2text/44613.html.txt","/var/www/straped/mufon/org/44613.html"],"Disposition":"Unresolved","Log Number":"US-12172012-0014"}