{"Source":"MUFON","trends":["There has been one other sighting in Macungie","There were no other sightings in Macungie on or around October 21st 2012","This sighting has never been favorited.",""],"Region":"Pennsylvania","map":"<A HREF = \"http://maps.google.com/maps?q=40.51593,+-75.555186(44615)&iwloc=A&hl=en\"> mufon case (44615) map </A>","Tags":"City","City":"Macungie","Disposition":"Unresolved","Log Number":"US-12172012-0016","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Flight Path":"Stationary","divs":["Sighting DetailsThis description is written by the Field Investigator after conducting an on-site interview with the main witness (MW), another family member and a neighbor who were all witnesses to this event: At approximately 8:05 on the evening of October 21st, 2012, the MW's son-in-law was outside packing up his car to return to his home out-of-state with his wife, the MW's daughter. He called his mother-in-law to come outside on the back porch to see an object in the sky. Their back porch faces South, and this object was seen slightly to the left looking toward the Southeast. They were joined on the porch by the MW's husband and daughter. The MW and son-in-law went back into the house to grab a camera and cell phone. The MW took a few photos on her camera, and he took a video on his cell phone. The MW's husband ran into the house and grabbed his binoculars (he said he thought they would help him see beyond the intensity of the lights which reminded him of LED lights). About 8-10 mins. into the sighting, they called their neighbor who came out of his house and also witnessed the object. He only saw it for a minute or two before it disappeared. All witnesses agree that the night was cloudless, with lots of stars, but no moon was visible at the time. The MW described the object as being very large and very bright, like the full moon. It had 2 sets of lights surrounding a central light (i.e. a circle of lights surrounding a smaller circle of lights with a light in the center), yet it looked spherical. The lights were blue, green, and amber in color and did not blink or pulsate, but seemed to flicker or twinkle--none went out at any time while the object was visible. While viewing the object, the MW noted that 2 planes flew across in front of the object and were dwarfed by its size. She said they looked like specks against it, and it would have taken 10-15 planes to take up the same area of he sky as the object. Suddenly, after about 10 minutes, there was no object to be seen. It was as if someone flipped a switch. There was no dark outline where a dark object would have been. The MW's husband said he actually saw the object disappear: it was as if the lights \"retracted\" very fast, and then the object instantly was gone. His estimation of the distance between him and the object was about 2 football fields in length, and at about 50 degrees elevation. ***Please note that separate interviews were conducted with 3 of the witnesses so therefore some information may seem to conflict."],"Object Features":"Unknown","Case Number":"44615","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"12/17/2012 09:38 UTC","Summary":"Five people witnessed a large, brightly-lit object hovering over Macungie, PA on 10/21/12 from approx. 8:05-8:10pm. The object disappeared instantly with no movement or sound.","Latitude":"40.51593","files":["/var/www/straped/mufon/html2text/44615.html.txt","/var/www/straped/mufon/more/44615_submitter_file1__Photo1.jpg","/var/www/straped/mufon/more/44615_submitter_file2__Photo1Enl..jpg","/var/www/straped/mufon/org/44615.html"],"Date of the Event":"10/21/2012 08:05 UTC","Longitude":"-75.555186","Country":"United States","Object Shape":"Sphere"}