{"trends":["There have been 5 other sightings in Buxton","There were no other sightings in Buxton on or around December 15th 2012"],"Date of the Event":"12/15/2012 05:00 UTC","Case Number":"44614","Latitude":"43.627513","Object Shape":"Circle, Star-like","City":"Buxton","Object Flight Path":"Path with directional change","divs":["sighting detailshusband was driving and i was the passenger. we were headed down rt 112 from west buxton, bar mills bound to the hannaford grocery store. i kept commenting to him about the breathtaking moon that was apon us. i smiled at him and turned my head back to observe the moon as was suprised to see a bluish\\white orb that was starlike and at first i thought that it was venus because it glowed so brilliantly. however i noticed very quickly that this object was ascending up from the ground in a vertical direction upward. the object was not blinking or had any lights. it appeared to be like a very bright star but moving up along the right side of the moon. it was around 5pm eastern time not very long after sunset. i watched in awe as the object ascending further up and up and finally once it became at a higher altitude than the moon it turned to my left and headed in a westerly direction. we were fortunate to have a moon roof where i continued to follow it. it was directly above our vehicle and seemed to be traveling with us but was very fast, i have seen many planes and satelites. but never saw an orb this brilliant and move in this manner. we arrived at the grocery store and it was still traveling along the sky. i pointed it out to my husband who was excited to see the object that i kept talking about for the past 5 mins. the object was to our left, i pointed at the moon to our right and showed him where it was located and how it ascended up and then we turned to our left and the orb was gone. :( ill never forget the way it moved and how it seemed to be out for a nice joy ride that beautiful early night."],"Disposition":"Unresolved","Country":"United States","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/44614.html.txt","/var/www/straped/mufon/org/44614.html"],"Longitude":"-70.513912","Weather Factors":"Unknown","Summary":"Husband and I witnessed a large glowing bluish/white orb comparible to Venus ascending up from the treelines up along the right side of the moon, Object did not blink, had no noise and made a turn once over the moon and traveled westerly then disappeared.","Log Number":"US-12172012-0015","Object Features":"None","Region":"Maine","map":"<A HREF = \"http://maps.google.com/maps?q=43.627513,+-70.513912(44614)&iwloc=A&hl=en\"> mufon case (44614) map </A>","Date Submitted":"12/17/2012 09:21 UTC","Source":"MUFON","Tags":"City"}