{"Summary":"I was playing catch with my uncle and when he thru the ball, I followed the ball to catch it and when looking upwards I saw the sky and saw a dark grey sauser looking object ... very big so big that I actually saw the blue ring witch was the sky.","City":"Sacramento","Date Submitted":"12/18/2012 05:02 UTC","Source":"MUFON","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=38.624926,+-121.476443(44624)&iwloc=A&hl=en\"> mufon case (44624) map </A>","Date of the Event":"06/10/1980 12:00 UTC","Object Flight Path":"Other","Longitude":"-121.476443","Case Number":"44624","divs":["Sighting DetailsPlaying catch outside with a relative when I was about 11 to 14, not to sure sorry. He thru the ball and when I looked and reached for the ball I saw a very very big disk shape, dark,and dull but very quiet and just in that fram when looking at the ball to catch I could even see the thin outer ring of blue sky. very detailed and the blue ring (sky) was far and thin. I don't remember if I ever caught the ball because I was shocked I guess but did mention it to my relative and was so excited that I told my grandfather then went home and told everyone I could ... they just laughed and said \"yeah sure you did\" the very next day in the newspaper it showed a sauser like object \"ufo\" that looked very familiar of what I saw ... above the \"ufo' photo on the paper said \"There's Proof\" I can remember it like if it happened a year ago. I never looked into it further and I didn't even read the article on it so I would love to share my story with Mufon and tell them that I know a better way to see ufo's if your looking for them in the sky's. Thank you!!"],"Log Number":"US-12182012-0007","Sighting Duration":"00:00:02","trends":["There have been 83 other sightings in Sacramento","There were no other sightings in Sacramento on or around June 10th 1980"],"Country":"United States","Object Shape":"Disc","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/44624.html.txt","/var/www/straped/mufon/org/44624.html"],"Region":"California","Object Features":"None","Latitude":"38.624926","Disposition":"Unresolved","Tags":"City"}