{"Viewing Distance":"21-100 Feet","Latitude":"35.227962","Disposition":"Unresolved","Source":"MUFON","Country":"United States","Region":"North Carolina","Sighting Duration":"Undisclosed","Date of the Event":"12/13/2012 01:15 UTC","City":"Linden","files":["/var/www/straped/mufon/html2text/44620.html.txt","/var/www/straped/mufon/org/44620.html"],"Object Shape":"Triangle","divs":["Sighting DetailsOn Dec.13, 2012 @ 1:15 a.m. I stepped outside to watch the meteor shower taking place when I noticed right through the bare trees in my backyard, several extrememly bright orange lights that were stationary, hovering right above the treeline. At first I thought that my woods were on fire when the craft, after about a minute & a half began to move silently toward me (where I was standing), as it got closer, I noticed that it made no sound,it was triangular and black, there were about 6 bright orange lights underneath & no other lights, none flashing & it just moved slowly & smooth like. I continued to watch it and by the time it got to a 150 year old oak tree of mine, it turned completely on it's side, showing the 6 orange lights under the aircraft. Once it rose slightly above the treeline again it leveled itself back out,and sped up just a little and flew off to the NW. About 3 or 4 minutes after I seen this, I heard another aircraft coming from the front of my home and upon running out to my front porch I noticed that it was a miliary helicopter flying quickly in the same direction I watched the ufo leave. I live close to Fort Bragg & I see military air vehicles all the time & what I seen that night was nothing military, however, I have a feeling they knew that this flying object was in the area."],"map":"<A HREF = \"http://maps.google.com/maps?q=35.227962,+-78.741546(44620)&iwloc=A&hl=en\"> mufon case (44620) map </A>","trends":["There have been no other sightings in Linden","This sighting has never been favorited."],"Date Submitted":"12/18/2012 12:51 UTC","Tags":"City","Summary":"Triangular shaped ufo w/orange lights on bottom.","Object Features":"None","Weather Factors":"Unknown","Log Number":"US-12182012-0003","Longitude":"-78.741546","Case Number":"44620","Object Flight Path":"Hovering then path"}