{"Disposition":"Unresolved","trends":["There have been no other sightings in Unknown","This sighting has never been favorited."],"Summary":"Very fast moving aircraft spotted in the northwestern sky and thought to be a jet airplane until it began to do acrobatics!!","Longitude":"-99.897253","Date of the Event":"11/15/1995 12:00 UTC","Case Number":"44621","Tags":"City","Object Features":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/44621.html.txt","/var/www/straped/mufon/org/44621.html"],"City":"Unknown","Object Shape":"Diamond","Region":"South Dakota","Date Submitted":"12/18/2012 12:52 UTC","Latitude":"43.970635","Object Flight Path":"Path with directional change","Log Number":"US-12182012-0004","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","divs":["Sighting DetailsThis incident actually happened years ago in 1995 while traveling from Colorado to Minnesota to attend a sales convention. I never reported it because I felt no one would believe me. While driving one night from Denver Colorado to Minneapolis Minnesota a friend of mine and I witnessed what we believe to be a UFO sighting. It was approximately 2:00 a.m. and we were still around 100 miles from the Minnesota border. We both had too much coffee and needed to use a restroom however decided to pull off to the side road to relieve ourselves. It was a very crisp and clear night and we could see the entire universe while emptying our bladders. I saw what appeared to be a fast moving jet plane in the northwestern sky and pointed it out to my buddy. We both thought nothing of it until it stopped in mid air. It then proceeded in reverse at the same speed and stopped again. The craft did this three times with a stopping point of maybe a few seconds. On the third movement it then shot immediately upward first, downward secondly at very steep angles and then returned in reverse horizontally to make the shape of a triangle or pyramid. The UFO made three triangular movements in rapid succession without any stopping and then after the third movement it shot up into the night sky at a northeastern direction and disappeared in the blink of an eye. Almost seemed as though it were sending a message of some sort? This experience shook us and we immediately returned to our car and didn't stop till we reached Minneapolis. We told no one of the event and scanned the news media for any clues or stories but to no avail?? We did share it with our wives at the time and they just laughed it off and did not believe us. I know this is something that happened many years ago but thought it may be worth mentioning just in case there were others who did report it. Maybe, just maybe there is a MUFON record of this somewhere and it would prove that I'm not crazy! LOL!!"],"Weather Factors":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=43.970635,+-99.897253(44621)&iwloc=A&hl=en\"> mufon case (44621) map </A>"}