{"Latitude":"43.0035","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","Weather Factors":"Unknown","City":"Manchester","Date of the Event":"12/16/2012 05:54 UTC","files":["/var/www/straped/mufon/html2text/44629.html.txt","/var/www/straped/mufon/org/44629.html"],"Country":"United States","Case Number":"44629","Sighting Duration":"Undisclosed","Summary":"craft slowly moved west to east, stopped hovered then slowly headed north.","Date Submitted":"12/18/2012 01:16 UTC","Tags":"City","divs":["Sighting DetailsI was heading to work at around 5:48am and heading in a south direction to take a right turn on the on highway ramp. As I reached about a 100 feet towards my destination I noticed what I thought at first was a Southwest airplane, due to the top was flat red in color due to the lights around causing the top to be seen but not the bottom, flying really low at what I guess would be a 100 feet or more directly over the highway bridge heading east from the west direction. As I got to the on ramp I decided because their was no cars at all in any direction to pull to the side and observe it and at the exact moment I stopped my vehicle, the CRAFT stopped in mid flight. I freaked out in awe and complete excitement and began to grab my android phone. This took me probably between 15-20 seconds, I began to record and the craft was still sitting still for about 10 more seconds. Then the crafts lights began to blink one by one from left to right I at the time assumed it was rotating to the left direction, hard to tell because the bottom of the craft was none visible, just black, then it gave off a final bigger and brighter red flash of light in my direction. Then it began to slowly move in a north direction, I kept filming until it disappeared over the trees then drove off. As I was about done filming their was a couple cars driving down the off ramp and I hope they witnessed it too and add to my sighting. In the video you see a bright light dead center of the footage. that is not the object. That is a light post from the highway but if you look carefully the craft is directly behind it just to the right of the post sitting still then proceeds to turn and head north. So you see the craft is moving behind the post. This video is REAL and not a fake, I filmed this on my htc android and immediately loaded it to my pc just so I could show you all at Mufon. I have become dedicated to looking to the skies since I have had many sightings over the years and for once I have footage to back up my sighting. Call it a plane, Helicopter, what ever you want but I witnessed it up close and it was none of those things. I'm not screaming Aliens but I feel it could be military but I'm not canceling out any theories at this point but what I do know is its real and not a figment of mine and believers minds everywhere around the globe. I just want to add the video does not give the craft justice, it was allot bigger and closer then appears in the footage."],"Longitude":"-71.451699","Object Shape":"Circle, Disc, Other","map":"<A HREF = \"http://maps.google.com/maps?q=43.0035,+-71.451699(44629)&iwloc=A&hl=en\"> mufon case (44629) map </A>","trends":["There have been 19 other sightings in Manchester","There were no other sightings in Manchester on or around December 16th 2012"],"Source":"MUFON","Disposition":"Unresolved","Viewing Distance":"101-500 Feet","Log Number":"US-12182012-0011","Object Features":"Dome, Appendage(s)","Region":"New Hampshire"}