{"Summary":"While walking through Clover Park in Santa Monica, I was looking up at the scattered dense rain clouds (but the sun was very bright and apparent), I noticed a blue/green streak of light fly across the sky into the rain-cloud..","Object Flight Path":"Straight-line path","Tags":"City","Latitude":"34.026184","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Shape":"Bullet, Missile, Unknown","Date of the Event":"12/18/2012 01:30 UTC","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.026184,+-118.489551(44634)&iwloc=A&hl=en\"> mufon case (44634) map </A>","Viewing Distance":"Unknown","Log Number":"US-12182012-0016","Region":"California","City":"Santa Monica","Country":"United States","files":["/var/www/straped/mufon/html2text/44634.html.txt","/var/www/straped/mufon/org/44634.html"],"Source":"MUFON","Case Number":"44634","Weather Factors":"Unknown","trends":["There have been 20 other sightings in Santa Monica","There was one other sighting in Santa Monica on or around December 18th 2012"],"divs":["sighting detailswhile walking through clover park in santa monica, i was looking up at the scattered dense rain clouds (but the sun was very bright and apparent), i noticed a blue\\green streak of light fly across the sky into the rain-cloud. it moved much faster than a plane. like maybe 6x as fast. i could tell it was blue but i could not tell if it was the sun reflecting off the surface or if it was lit blue. it left a long streak as it flew into the dark rain-cloud. no noise was heard, just a 1-2 second visual. no one in the park appeared to notice it. i was on the phone with my girlfriend at the time and told her what i had just seen. i told my buddy from work what i had seen as well, then he told me that the previous night there was a meteor shower and it could have been remnants of the meteor shower. just stuck me as odd since the color was bright blue (metallic)."],"Date Submitted":"12/18/2012 05:28 UTC","Longitude":"-118.489551"}