{"Sighting Duration":"00:02:00","Object Shape":"Circle, Star-like","Object Features":"Unknown","Disposition":"Unresolved","Tags":"City","Source":"MUFON","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=27.938744,+-82.750847(44642)&iwloc=A&hl=en\"> mufon case (44642) map </A>","Latitude":"27.938744","Longitude":"-82.750847","Summary":"Straight path then stopped briefly. Then suddenly turned 90 degrees right and looped in a perfect circle and ascended straight up and disappeared.","Date of the Event":"12/18/2012 07:40 UTC","Country":"United States","Date Submitted":"12/18/2012 10:53 UTC","files":["/var/www/straped/mufon/html2text/44642.html.txt","/var/www/straped/mufon/org/44642.html"],"Viewing Distance":"Over One Mile","Object Flight Path":"Path with directional change,Path then hovering","City":"Clearwater","trends":["There have been 31 other sightings in Clearwater","There were no other sightings in Clearwater on or around December 18th 2012"],"Log Number":"US-12182012-0024","Region":"Florida","Case Number":"44642","divs":["Sighting DetailsI stepped out on the veranda just before dinner and looked up to see the crescent moon in a crystal clear sky. Not a single cloud. Just below it, an object at several thousand feet was flying straight south. At first it appeared to be a jet but I noticed there was no sound. All was quiet. I began to think it was a Satilite because it had no flashing lights but was about the brightness of the star Sirius which had just risen to the east. Then suddenly it stopped. Motionless for a couple of seconds then abruptly turning in a circle the size of a dime then headed straight up shrinking and disapearing into the black sky after about five seconds. I am an avid amature astronomer and have witnessed many comets and satellites and have flown in many helicopters and aircraft. This was a bright non-shimmering circular object traveling at great velocity that defied logic. Yes, the apparent stop before turning could have conceivably been a sudden change in direction that matched my viewing position making it look like it stopped but then it made an inconceivably sharp rotation without losing brightness and shot straight up and dimmed out after about three seconds."]}