{"Date of the Event":"12/18/2012 07:10 UTC","Log Number":"US-12192012-0006","Tags":"City","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Object Shape":"Sphere, Star-like","Object Features":"None","divs":["sighting detailshad just gotten fuel for vehicles and equipment at caseys in carney(near ankeny) was heading home when i noticed a large yellow\\orange flashing\\pulsating light due west of 6000 blk of ne 60th ave. it was moving slowly from west to ese. i then turned down ne 60th ave off of ne 14th st and was heading west when i looked out my drivers door window and clearly saw 3 yellow\\orange orbs stationary and evenly spaced (at first) appearing to hover roughly 1\\2 mile or so to the south (was on 1200-1400 blk of ne 60th).. i rolled down the window and stopped on (ne 60th) to make sure i wasn't seeing some type of reflection. i was not. they were below the low cloud ceiling and appeared at first to be descending, then began ascent. they were approx the size of a dime at arms length and at roughly 60 degrees s. i became quite excited and decided to go on and turn down ne 11th ct (south)to see if i could get closer and spy a better look. when i parked my truck (less than 20 sec)they were moving up and away and disappeared above the clouds. i immediately got on my cell phone and called my brother in law who lives just down the street from ne 60th and told him what i had just seen. at that point i looked back to the west and observed the object yellow\\orange that had first caught my attention cont to slowly move while flashing\\pulsating to the ese. i told my brother in law to hurry and get out on his deck to see it but he couldn't locate the object even though i was 200 yds to his n and could see it clearly before it either was obscured by the low cloud cover or simply went dark, i couldn't tell. a first i was very excited but became frightful and nauseated shortly after. this not my first experience seeing strange lights but it is most certainly one of the most memorable!"],"Longitude":"-93.611003","Summary":"Saw yellow orange pulsating light due west moving very slowly to ESE. Then clearly saw 3 large yellow/orange orbs just below cloud cover 500-1500' at 1/2 milr or less, size of a dime at arms length slowly descend and ascend above clouds and dissapear","Date Submitted":"12/19/2012 08:37 UTC","Latitude":"41.673537","Country":"United States","Object Flight Path":"Stationary,Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=41.673537,+-93.611003(44649)&iwloc=A&hl=en\"> mufon case (44649) map </A>","Region":"Iowa","Disposition":"Unresolved","City":"Des Moines","files":["/var/www/straped/mufon/html2text/44649.html.txt","/var/www/straped/mufon/org/44649.html"],"trends":["There have been 42 other sightings in Des Moines","There were no other sightings in Des Moines on or around December 18th 2012"],"Case Number":"44649","Sighting Duration":"Undisclosed"}