{"Weather Factors":"Unknown","Tags":"City","Country":"United States","Log Number":"US-12192012-0001","Object Shape":"Unknown","Source":"MUFON","Longitude":"-77.044114","map":"<A HREF = \"http://maps.google.com/maps?q=35.108493,+-77.044114(44644)&iwloc=A&hl=en\"> mufon case (44644) map </A>","Region":"North Carolina","City":"New Bern","files":["/var/www/straped/mufon/html2text/44644.html.txt","/var/www/straped/mufon/more/44644_submitter_file1__IGP0202.JPG","/var/www/straped/mufon/org/44644.html"],"Object Flight Path":"Stationary","trends":["There have been 2 other sightings in New Bern","There were no other sightings in New Bern on or around December 18th 2012","This sighting has been favorited 1 time.",""],"Viewing Distance":"Over One Mile","divs":["Sighting DetailsI was first contacted by my girlfriend as she left my apartment that she witnessed a UFO like object in the sky. I went onto my balcony and couldn't readily observe the object until I panned to the lower southeastern sky. I noticed two extremely bright twinkling lights that were parallel to each other. The lights seemed to move very slowly. I had difficulty tracking the object because it was behind trees but I was able to clearly see it at times. About 5 minutes into the initial spotting, it seemed to fade away. After about five minutes of looking and waiting, it reappeared, this time higher over the tree-line. It was almost as if the lights twinkled back on. It then appeared to be closer to me (assuming the two lights are on the same object), which it then continued to descend behind the tree's again. My girlfriend reported still being able to see the object from about 5 miles south of me. I quickly ran and grabbed my camera and frantically slapped on a telephoto lens and began attempting to snap photo's of the lights. I got a few that were decent but none show any depth of details, other than evidence of the object. After about 5 more minutes, the object disappeared too low for me to see through the trees. I continued to go outside to check periodically throughout the night to see if it remained, but it never returned. The object made no noise, was intensely bright for being aircraft lights (it appeared like sodium street lamps in the air?) and moved very smoothly and slowly. I am a skeptic, and I do not believe in aliens or extra-terrestrials. I am a former member of the armed forces and worked on military aircraft and civilian aircraft. I have never witnessed this phenomena in the past on any known man-made aircraft. I am also aware of how flare's appear, and I confirm this was not an aircraft flare. I basically do not know what to say at this point. My skin is crawling, I have goosebumps. I spent two tours in iraq and i'm more fearful to sleep now than I ever have been, not knowing what this object was."],"Object Features":"Unknown","Summary":"Observed two bright orange lights parallel to each other over south to southeastern sky hovering.","Case Number":"44644","Date of the Event":"12/18/2012 10:15 UTC","Disposition":"Unresolved","Latitude":"35.108493","Date Submitted":"12/19/2012 12:25 UTC","Sighting Duration":"Undisclosed"}