{"Sighting Duration":"Undisclosed","Object Features":"None, Unknown","divs":["Sighting Details My daughter and I had just left my brother's house, after I was doing some network configuration work for he and his wife and were heading home. It is less than a 2 mile drive from his home to mine. My daughter, who was in the back seat said \"what is that dad\"? I saw the object just as she was speaking. At first, I thought it was a plane heading to CVG airport for landing, but thought that it was going the wrong direction (east to west) to be heading to the airport. It appeared to motionless in the sky but I couldn't be sure because I was driving so I stopped my vehicle in the middle of the road to see if it was moving or not. It was not moving forward, but it was slowly rotating. I rolled down my window to see if I could hear anything, but it made no noise. I grabbed my phone to take a video, but as I got the video app opened, the object started to move forward and then just vanished. It just disappeared! The object was just in front of our vehicle, no more than 100 yards away, and no more than 300 feet above. We had a completely unobstructed view. My daughter asked me again, \"what was that dad\"? I could not give her an answer. We just kept saying to each other that it was really weird. She then said, \"dad, was that a UFO\"? I told her that I wasn't sure but, because we could not identify it, it was flying, and it was definitely an object, it was a UFO to me. We talked about it the rest of the evening, and I even called my brother to tell him what we saw. I am pretty sure that he thinks we are crazy, and if my daughter hadn't been with me and hadn't seen the same thing, I would probably think that he is right..."],"trends":["There have been 2 other sightings in Union","There were no other sightings in Union on or around December 18th 2012"],"Case Number":"44650","files":["/var/www/straped/mufon/html2text/44650.html.txt","/var/www/straped/mufon/org/44650.html"],"Region":"Kentucky","Source":"MUFON","Disposition":"Unresolved","Longitude":"-84.655136","Weather Factors":"Unknown","Summary":"It was a black triangle shape with 5 lights on each side wall of the triangle. It appeared to be larger than 2 or 3 large passenger jets and made no sound.","Date Submitted":"12/19/2012 10:19 UTC","Object Shape":"Triangle","Viewing Distance":"101-500 Feet","City":"Union","Object Flight Path":"Stationary,Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=38.93437,+-84.655136(44650)&iwloc=A&hl=en\"> mufon case (44650) map </A>","Latitude":"38.93437","Country":"United States","Log Number":"US-12192012-0007","Tags":"City","Date of the Event":"12/18/2012 09:25 UTC"}