{"Object Flight Path":"Path with directional change","Latitude":"39.850687","Date of the Event":"12/11/2012 06:42 UTC","Sighting Duration":"Undisclosed","trends":["There have been 126 other sightings in Indianapolis","There were no other sightings in Indianapolis on or around December 11th 2012"],"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/44651.html.txt","/var/www/straped/mufon/org/44651.html"],"Log Number":"US-12192012-0008","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-86.12062","Weather Factors":"Unknown","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=39.850687,+-86.12062(44651)&iwloc=A&hl=en\"> mufon case (44651) map </A>","Country":"United States","Case Number":"44651","Object Features":"None","Region":"Indiana","Summary":"Bright light in sky no sound came towards me then faded into a red light","divs":["Sighting DetailsI stepped outside waiting for a friend to pick me up at 6:42 when I noticed a very bright light in the sky coming towards my house. Declination was apprx 45 degrees at first coming from the S-SE at a slow but steady pace. The size was about 2-3 jupiters. The light was very steady and did not blink or wave or shimmer. There was no sound at all. The total time of observation was 40-60 seconds. At first it appeared to be a plane. But as far as I know I have never seen a plane that low that curved over my house and go the opposite way from the airport. Any plane that comes that low from the south always turn and go west to the airpoint before they even come close to my house. The light eventually curved close to my house at apprx. 80-90 degrees declination where it turned and went east and at the last couple seconds faded into a red light. At that point it went behind some trees but was almost faded out completely anyways. This is not the normal direction of planes in this area. I live on a landing path for the Indianapolis airport and only landing planes are that low and they never go east. Always W-SW. There were no other lights on the object. And no real shape could be made out. As far as I know it was just a light and no other shape. There was no sound at all and no other planes around at that time. Good thing too cause it may have run into a landing plane at that height. The object appeared to be 500 ft to a mile off the ground. Sky was clear but dark."],"Date Submitted":"12/19/2012 10:47 UTC","Tags":"City","City":"Indianapolis","Source":"MUFON"}