{"Tags":"City","Viewing Distance":"Over One Mile","Source":"MUFON","Date Submitted":"12/19/2012 09:38 UTC","trends":["There have been 8 other sightings in Dubuque","There were no other sightings in Dubuque on or around December 11th 2012"],"Date of the Event":"12/11/2012 12:00 UTC","Object Flight Path":"Straight-line path","Country":"United States","Sighting Duration":"00:00:03","Region":"Iowa","Summary":"It was a grey orb that was reflecting the sun on the side facing the sun moving fast with no sound.","Object Shape":"Sphere","City":"Dubuque","Case Number":"44662","Log Number":"US-12192012-0018","divs":["Sighting DetailsFirst my background; I was a Fire Control Technician in the US Navy and I have tracked many types of aircraft with a manned director. It was the BPDSMS system I operated which was an open air, manually slewed radar system. I have tracked thousands of aircraft including commercial and our own aircraft involved in mock attacks on the 3 ships I was assigned too from '82-'92. I only saw this orb briefly, 3-10 seconds at the most. I would have gauged it's altitude to be between 1500-3000 feet and traveling between 200 - 300 mph. It was underneath the few clouds of the day and it clearly passed behind some trees (making it unlikely it was a particle of dust on one of my eyes.) It is possible that this could have been a white or grey colored weather balloon. I am unfamiliar where the altitude where the jet stream starts. I am familiar with inflating a helium balloon with a radar reflecting orb on it. We used this to practice firing at airborne targets with the 5\" gun on the Frigates I served on. These balloons never reached an altitude above 1500 feet and we were able to keep up with the balloon with the ship. These Frigates would rarely achieve 30 knots. There are a few TV shows that depict supposed UFO's in Mexico during a solar eclipse. Granted in these video's this object is stationary (more than likely it was Venus visible during the day because of the eclipse), but the shape and color of the object in these videos is very close to what I saw. If it is possible I would like to have someone from your organization give me a terrestrial explanation for this."],"Longitude":"-90.693496","Latitude":"42.510023","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=42.510023,+-90.693496(44662)&iwloc=A&hl=en\"> mufon case (44662) map </A>","Weather Factors":"Unknown","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/44662.html.txt","/var/www/straped/mufon/org/44662.html"]}