{"Object Shape":"Flash, Star-like","Source":"MUFON","Region":"Pennsylvania","Date of the Event":"12/19/2012 08:00 UTC","divs":["Sighting DetailsDriving home from mother's home. I stopped the car in the middle of the street to watch them. From an elevated vantage point, saw a cluster of 5-10 lights normally off, they would strobe on in random time and order. They all moved to the south-east horizon together but there was no altitude change. They moved straight into the sky in a perfect straight line, becoming dimmer as they moved away from me. It is a perfectly clear, cool night. Airplanes with signaling lights can be seen in all directions. Stars can be seen clearly also. They moved in the direction of my home, so I drove in a normal manner toward home. I wanted to stop and take video, but there was too much light pollution from traffic and street lights, so I decided to keep following to see if they would behave more like airplanes, but they did not; just kept moving until I lost sight about 3-4 miles from my house. The lights just kept on their course until they became too dim to follow with my eyes. They did not sink below the horizon. My reaction was surprise, because I have never seen lights in the sky behave like this. The only not random thing about the lights was that they all blinked in the same exact light intensity and were all going in the same direction. I went from surprised to excited, because the motion and light seemed unnatural. They did not behave like the planes and star light around them."],"Log Number":"US-12192012-0021","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Latitude":"40.105256","Country":"United States","Case Number":"44665","Tags":"City","trends":["There have been 5 other sightings in King of Prussia","There were no other sightings in King of Prussia on or around December 19th 2012"],"Disposition":"Unresolved","Summary":"Star-like cluster bright white strobe moved in unison","City":"King of Prussia","Sighting Duration":"Undisclosed","Longitude":"-75.376442","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.105256,+-75.376442(44665)&iwloc=A&hl=en\"> mufon case (44665) map </A>","Date Submitted":"12/19/2012 11:17 UTC","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/44665.html.txt","/var/www/straped/mufon/org/44665.html"]}