{"map":"<A HREF = \"http://maps.google.com/maps?q=35.936539,+-78.66646(44667)&iwloc=A&hl=en\"> mufon case (44667) map </A>","Object Shape":"Triangle","Case Number":"44667","Latitude":"35.936539","Region":"North Carolina","Date Submitted":"12/19/2012 11:43 UTC","Country":"United States","Tags":"City","City":"Raleigh","Viewing Distance":"101-500 Feet","Date of the Event":"01/14/2011 06:45 UTC","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Disposition":"Unresolved","trends":["There have been 31 other sightings in Raleigh","There were no other sightings in Raleigh on or around January 14th 2011"],"divs":["Sighting DetailsOn the evening of January 14, 2011 at around 6:45 pm... I had just sent my children off for the weekend with their Nani(grandma). It seemed like a regular evening at home and as they left, I just began to go upstairs and revamp over in my head other things(chores, etc.) that I needed to do. While contemplating, I went upstairs into my bedroom and walked straight into my bathroom as I had to use it. Within my bathroom, there is a window that opens into our backyard. Often, I may look out this window just to notice the scenery of nature, trees, deers, birds, or just to look into sky, but this evening I noticed something different. What made me urge towards looking out the window this night was a distinct whirring noise that my nephew and I had heard the previous night before. So when I looked out of the window, I noticed that there were orbs of lights(between 10-20)right above the ground in the woods. They were moving and rearranging themselves in a circular fashion. When I first noticed this(in combination with the noise) I didn't know what it was...I was just trying to understand why is something so low against the earth and what was it doing. Although, I heard the whirring noise all that I saw(at first) where the orbs of lights above the floor of the earth within the woods. No sooner than when I had came to in trying to comprehend what I was seeing, the orbs stopped rearranging themselves and formed(or locked into) a triangular pattern. As soon as this occurred, I heard an ascending noise of some type of craft from where the lights were showing and then a triangular-shaped three dimensional type craft appeared above the tree tops. The distinct detail of the craft was intricate as it was a darkish blue green color but it looked as if the detail was nothing that I would have expected for the average UFO craft to look like. I had so many mixed feelings...like why am I seeing this, is this real, is it an airplane..then telling myself no, this is not a plane because a plane would not be so low to the ground in this area and especially not within the woods behind my house.. While contemplating in my head-space about what had just appeared, the craft glided sideways in mid air and it was as if time had frozen for me to see all this happen. I followed the craft with my eyes until it disappeared and then I heard another sound and saw that there were still lights that were in the woods..Next thing I knew, another craft had ascended up the same way as the other one, same detail and structure...It was as if they were giving each other a significant amount of time between each other, it was so mathematically precise on how they appeared one at a time. After the second craft appeared, it followed right behind the same path as the first one. In my mind, this was not happening to me, but it was and it was very crystal clear as to what they were...but what were they doing was my main question- they were so close. No sooner than the second one was gliding off into the atmosphere, I still noticed that there were still some lights in the same spot within the woods. This is when I realized that it was a third craft... had to be- I had just seen two. However, prior to this craft ascending all the way up above the trees, the third craft ascended half way and then stopped. The orbs of lights that I had seen were attached to the craft. When the third craft stopped midway I saw it and it released these orbs of lights(don't know why or what it was for) into the woods and the lights disintegrated within the woods and upon the earth floor. After this, the craft ascended above the trees and then followed the path of the prior to crafts before it. I had seen not 1, not 2, but 3 official crafts no more than about 100 ft away from me from my window. It was no loss in sight within this experience, it was as if the universe wanted me to see these crafts and what they were doing. This could not have lasted no more than 5-7 minutes.. but it was so surreal as it was as if time had stopped, no crafts were flying(Although I do live by a heavily populated area for the RDU Airport)- the sky was clear. And as soon as the last craft was out of sight... I saw a small helicopter appear in the sky further in the distance.. We are definitely not alone here and may have never been anyway. Interestingly enough, I decided to take a walk in the back of my yard and within the area of the woods where I had seen these crafts. What was very significant to me and another friend of mine was how much richer and greener and plush the grass was in the woods versus the anatomy of the grass in the rest of the yard...I don't know the reasoning and purpose, but there is definitely one in regards to such visits...One thing is for sure...I was not scared, but was filled with deep emotion of gratitude, thankfulness(that I am not crazy off of something I already knew), and honored because I can truly say and affirm that we are not alone."],"Log Number":"US-12192012-0023","Source":"MUFON","Object Features":"Patterned Surface","Longitude":"-78.66646","files":["/var/www/straped/mufon/html2text/44667.html.txt","/var/www/straped/mufon/org/44667.html"],"Object Flight Path":"Hovering then path","Summary":"I Witnessed Three Triangular Shaped Crafts In The Woods in the Back of My House"}