{"Date of the Event":"12/19/2012 04:00 UTC","Tags":"City","Summary":"Witnessed a diamond shaped object hovering in the sky. It hovered and then moved horizontally from west to south-west before fading out.","map":"<A HREF = \"http://maps.google.com/maps?q=40.73744,+-73.437321(44672)&iwloc=A&hl=en\"> mufon case (44672) map </A>","Object Features":"None","files":["/var/www/straped/mufon/html2text/44672.html.txt","/var/www/straped/mufon/org/44672.html"],"Country":"United States","Sighting Duration":"00:03:00","Date Submitted":"12/20/2012 02:54 UTC","Case Number":"44672","Source":"MUFON","trends":["There have been 3 other sightings in Farmingdale","There were no other sightings in Farmingdale on or around December 19th 2012"],"Longitude":"-73.437321","Log Number":"US-12202012-0005","Disposition":"Unresolved","Region":"New York","divs":["Sighting DetailsI was driving around outside of my job and I noticed the object. I have worked overnights for 5+ years so I have seen every star, hundreds of times as well as objects that turned out to be planes or helicopters. This one was different. Its brightness, color and distance are what first caught my eye. It was very bright and a yellowish orange color, different from any star in the sky. It also appeared to pulse and only seemed to be about 2,500 feet away. This object was remarkable because I actually felt fear while observing it. As an overnight security guard I have looked at the sky hundreds of times and seen a variety of objects. I have heard things go bump in the night, shift after shift and, except for my first few months on the job, I have not felt fear. Again, this object was different. I felt almost frozen but I was able to bring myself to turn the car around and drive the other way, as if 500 feet of retreat would have mattered anyway. After retreating, I turned the car back toward the object and observed it move horizontally, from west to southwest, across the sky. It moved about a foot across the sky (I held a ruler to the sky right after it disappeared to \"measure\" so my estimate is rough) and then simply faded into the sky. I'm not sure if it actually faded out like a light going dim or perhaps shot further into the sky at a rate of speed that would make it appear as though it simply faded away. In the picture that I have attached (if you can even make it out), the object is only a couple of hundred feet above mounds of sand at my job site. The mounds themselves are about 50 feet high."],"Object Flight Path":"Hovering then path","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Object Shape":"Diamond","Latitude":"40.73744","City":"Farmingdale"}