{"Country":"United States","Case Number":"44673","trends":["There have been 7 other sightings in Phoenixville","There were no other sightings in Phoenixville on or around December 19th 2012"],"Tags":"City","Latitude":"40.134212","map":"<A HREF = \"http://maps.google.com/maps?q=40.134212,+-75.507903(44673)&iwloc=A&hl=en\"> mufon case (44673) map </A>","Sighting Duration":"Undisclosed","Date Submitted":"12/20/2012 03:35 UTC","City":"Phoenixville","Weather Factors":"Unknown","Source":"MUFON","Log Number":"US-12202012-0006","divs":["Sighting DetailsI was driving home at 6:30 pm (dark) when I saw in a wide expanse of sky this slow moving craft approaching from my right. It was not high, say less than a mile up and moving VERY slowly in a steady straight path. It was unusual as it had none of the normal airplane lights. As it went across my field of vision about a half mile in front of me, I could see it had a triangle shape with three round large white lights along the right edge and two round white lights along the left, all flat with the undercarriage. they were very close together, covering nearly all of the undercarriage. I noticed that there seemed to be a light missing on the left near the point, so only five lights were visible. There was a very tiny red light but it was not in the center of the undercarriage, it was to the left of center. I watched it cross my field of view as I drove along, and it was in the distance (about a half mile)to my left approaching a hill on its way east (would be flying toward Valley Forge National Park)out of my view. I am not sure if this is a US-made product. It was the first time I have seen a triangle shaped craft fly over and I see where Northrup Grumman is making triangular shaped craft, but this one seemed different in that it was a definite 3-cornered triangle with NO visible \"little wings\" projecting back from the body. The whole experience took about 60 seconds."],"Viewing Distance":"501 Feet - 1 Mile","Summary":"black triangle , 5 uniform size round lights-- 3 on one edge , 2 on other as seen from below, tiny red light near center of undercarrage, lights seemed flush wirg undercarriage.","Date of the Event":"12/19/2012 06:30 UTC","Object Features":"Unknown","Object Shape":"Triangle","Region":"Pennsylvania","Object Flight Path":"Straight-line path","Longitude":"-75.507903","files":["/var/www/straped/mufon/html2text/44673.html.txt","/var/www/straped/mufon/org/44673.html"],"Disposition":"Unresolved"}