{"Region":"Central Luzon","Object Shape":"Fireball","Object Features":"None","Latitude":"14.79456","Date Submitted":"12/20/2012 08:49 UTC","Weather Factors":"Unknown","Case Number":"44676","Country":"Philippines","Log Number":"PH-12202012-0009","City":"Bulacan","map":"<A HREF = \"http://maps.google.com/maps?q=14.79456,+120.879997(44676)&iwloc=A&hl=en\"> mufon case (44676) map </A>","Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change,Path then hovering","Source":"MUFON","files":["/var/www/straped/mufon/html2text/44676.html.txt","/var/www/straped/mufon/org/44676.html"],"Date of the Event":"12/20/2012 07:30 UTC","Disposition":"Unresolved","Tags":"City","divs":["Sighting DetailsI just lit a cigarette and exited the backdoor of our house. Then I walked towards the side house gutter towards our gate. Then I saw this flame like object just 50 degrees towards my direction, I called my mom then told her about it. She went out. Our house is nearby a road. And I recognized people I knew and pointed to them. I told them to take a picture. I didn't have my phone with me and was too fascinated. The object is approximately the size of a car or 2. It was surrounded in red orange flame or energy. Then while I was pointing to it and the others where looking at it, it stayed still for 2-3 minutes. It's speed of movement is around the same as when you are parking a car. very slow. It's not a flying lantern. I know what a lantern looks like. It was much bigger than that. Then it changed direction towards the southeast and disappeared on the horizon,trees until we couldn't see them anymore. Total time is around 10 minutes. NO SOUNDS at all. By approximation, it was flying over a rice field. What's fascinating about this is that there was a flame like energy surrounding it and the direction was upwards. As if how a meteor looks when entering the atmosphere. This one is slowly moving horizontally. And the altitude is the same as a low flying helicopter. Really amazing. -Brian, Bulacan,Philippines ps, I wasn't able to take a picture. But I looked it up and google and I saw ONE similar object. see attached. It's 90% similar."],"Longitude":"120.879997","Summary":"I thought I saw a plane in flames, but it was very slow and quiet. It's orange flame was flickering upwards like a blue flame lighter. but it was orange.Then I pointed to people nearby.","trends":["There have been no other sightings in Bulacan","This sighting has never been favorited."]}