{"Latitude":"43.149293","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.149293,+-85.62293(44671)&iwloc=A&hl=en\"> mufon case (44671) map </A>","divs":["Sighting DetailsMy girlfriend and I were visiting a supposedly haunted location called Hell's Bridge in Algoma Township, Michigan. There was a turnaround spot on a dirt road with a path leading off to the bridge. We had been there before and sometimes got scared by the place so we backed the car up to the path so that if we left in a hurry we would be facing the road. I was in the passenger seat and my girlfriend was driving. We sat for just a few minutes preparing ourselves to get out of the car. We were more timid than usual because we normally came with a group of friends, but since no friends were interested in coming, it was just the two of us. Suddenly, a bright blue-green light filled the car from the direction of the path behind us. I was looking at my girlfriend, and I didn't want to look in the direction of the light. She was looking in the rearview mirror and staring at the light. I began to panic and yelled at her repeatedly, saying \"DRIVE!\" but she was unresponsive. Then the light was suddenly gone. She snapped out of it and we took off. We then returned to a friend's house where we had stopped before heading out there. Our friend was surprised we had taken so long because it only takes 15-20 minutes to get there from his house, but we were gone for 2-3 hours. From the time that the light became visible, the whole episode felt like just a few minutes if that, so the entire trip there and back shouldn't have been longer than an hour, but we were gone from 2-3 hours. Afterward I noticed an itchy spot on either my leg or arm, and I have witnessed UFOs on two other occasions in the years since. One of which was just months after this occurrance. I would really like to know what happened to us during the missing time and I hope you can help. Thank you,"],"Region":"Michigan","Weather Factors":"Unknown","Country":"United States","Object Shape":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"20 Feet or Less","Log Number":"US-12202012-0004","Longitude":"-85.62293","files":["/var/www/straped/mufon/html2text/44671.html.txt","/var/www/straped/mufon/org/44671.html"],"Case Number":"44671","Summary":"Car filled with a light that caused a catatonic state and missing time.","City":"Algoma twp","Object Flight Path":"N/A","Date Submitted":"12/20/2012 02:47 UTC","Source":"MUFON","trends":["There have been no other sightings in Algoma twp","This sighting has never been favorited."],"Tags":"City","Disposition":"Unresolved","Date of the Event":"11/15/2004 12:00 UTC"}