{"Log Number":"CA-12202012-0014","divs":["Sighting DetailsI observed a flashing light out my front room window, coming from south direction. I ran outside, and it was visible, bright flashing white light, no noise, and it was undulating up and down, wobbling, going very slowly, dipping and going up and down. It was going SE direction. I ran back in the house, grabbed my pentax camera, ran back outside to film it , and it was still going very slowly, still undulating up and down, and sort of wobbling. I filmed it for 26 seconds. It went right over my head. I had trouble keeping it in the view window, as it was wobbling and undulating so much. No noise, no change in colour. I shut the camera off just before it went behind the trees on my property. Please note: my camera shutter speed was on longer mode as I had been photographing waterfalls that day, and had not changed the settings. So on film, the craft looks multicoloured (not sure if that is why it appears as it does) But you can clearly see a revolving ring going around the craft. I live by the airport, and have yet to hear a silent airplane, or one going that slow, and moving up and down. The background noise is the highway."],"Case Number":"44681","Country":"Canada","Region":"British Columbia","Date Submitted":"12/20/2012 12:53 UTC","Tags":"City","Date of the Event":"08/15/2012 12:00 UTC","files":["/var/www/straped/mufon/html2text/44681.html.txt","/var/www/straped/mufon/org/44681.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=53.917064,+-122.749669(44681)&iwloc=A&hl=en\"> mufon case (44681) map </A>","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Object Shape":"Circle","Viewing Distance":"Unknown","Summary":"bright undulating light","Longitude":"-122.749669","Source":"MUFON","City":"Prince George","Sighting Duration":"Undisclosed","trends":["There have been 4 other sightings in Prince George","There were no other sightings in Prince George on or around August 15th 2012","This sighting has never been favorited.",""],"Latitude":"53.917064","Object Features":"Other","Disposition":"Unresolved"}