{"Object Shape":"Cigar, Oval","Date Submitted":"12/20/2012 02:22 UTC","Latitude":"54.996015","files":["/var/www/straped/mufon/html2text/44683.html.txt","/var/www/straped/mufon/org/44683.html"],"trends":["There have been 13 other sightings in Newcastle upon Tyne","There were no other sightings in Newcastle upon Tyne on or around December 20th 2012"],"Disposition":"Unresolved","Weather Factors":"Unknown","Tags":"City","Object Flight Path":"Straight-line path","Object Features":"Unknown","Country":"United Kingdom","Case Number":"44683","Sighting Duration":"Undisclosed","Longitude":"-1.56299","Date of the Event":"12/20/2012 06:30 UTC","Log Number":"GB-12202012-0016","City":"Newcastle upon Tyne","Region":"England","divs":["Sighting DetailsMy two kids were in the sitting room alone playing xBox minecraft. i came into the sitting room to start using the computer. As I looked up I noticed how engrossed in the game they were so I decided to take a picture on my iphone. As i was pressing the on screen camera button i noticed movement on the floor of a long white shape. I hardly had time to move my eyes as it rose up fast in a 45 degree angle. I took a second photo as a follow on to the first (when I take iPhone pictures I often repeatedly press the shutter button and take successive pictures) I was quite baffled and asked Katie (in Pink) if she had thrown anything to Hurley (in White)I said I just seen something white in the air, did you throw anything? They looked at me a bit strange, had I not caught the image on camera I might have thought my eyes were playing tricks on me. As I look at the photo I see both Katie's hands are on the xBox controller, she would never have been able to throw something and get her hands back in position without leaving a blur on the picture. I asked them to look for something white, Katie pointed to the plate that can be seen on the lattice-work box, but that is not it. This might not be related but a week ago I was taking pictures of some wooden train track for and eBay auction. There was a white round object on one of the photos and to the right there is another haze. I thought to myself that it might be some dust or a hair had somehow got on the lens or maybe light from the window had reflected on the picture. i can't explain it any other way. I was the only person in the room at the time. This object i have caught on camera tonight has completely baffled me, I simply can not explain it at all. i saw it leave the floor, my first thought was it was folded white paper, it seemed solid (but paper doesn't rise by itself)"],"Viewing Distance":"20 Feet or Less","Source":"MUFON","Summary":"Whilst taking a picture of my kids a white object rose from the floor very fast and dissapeared","map":"<A HREF = \"http://maps.google.com/maps?q=54.996015,+-1.56299(44683)&iwloc=A&hl=en\"> mufon case (44683) map </A>"}