{"Source":"MUFON","Longitude":"-106.976007","City":"Snowmass","Tags":"City","Date of the Event":"08/10/1987 10:30 UTC","Date Submitted":"08/10/1987 10:30 UTC","files":["/var/www/straped/mufon/html2text/4468.html.txt","/var/www/straped/mufon/org/4468.html"],"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.334897,+-106.976007(4468)&iwloc=A&hl=en\"> mufon case (4468) map </A>","Disposition":"Unknown","Latitude":"39.334897","trends":["There has been one other sighting in Snowmass","There were no other sightings in Snowmass on or around August 10th 1987"],"Object Flight Path":"Undisclosed","divs":["Sighting DetailsWhile watching tv I fought the urge to fall asleep and a Paralizing feeling. I was startled awake by the tv going blank. My pregnant wife and son were asleep on the couch next to me I tried to wake them up and could not. I looked out side and noticed the street light also was out, which is not charicteristic of a normal power outage. I felt strangely light and my hair was standing on end.I bitterly fought a paralizing feeling in my arms and legs but I managed to break free and get up. I went outside to the deck, looked up and saw a dark rectangular object blocking out the stars. I was awe struck. there were no lights, and after my eyes adjusted I could see what appeared to be faint illuminated port holes around the edge of the craft. I felt like I was almost weightless and my hair was standing on end. It appeared to be aproximatly a half a mile high and the size of an aircraft carrier. It slowly headed north and disapeared behind the mesa. once it had gone the lights came back on and everything returned to normal."],"Sighting Duration":"Undisclosed","Summary":"awoke to power outage, went out side and saw a wrectangular shape silowetted againsed the stars.","Weather Factors":"None","Log Number":"US-02212006-0004","Country":"United States","Region":"Colorado","Object Shape":"Square, Rectagular","Object Features":"Undisclosed","Case Number":"4468"}