{"Weather Factors":"Unknown","Object Features":"None","Summary":"Oscillating \"UFO\" Lights Witnessed in the Sky Over Westerville OH 12-12-2012","Object Flight Path":"Path then hovering","Longitude":"-82.92014","Latitude":"40.162187","Region":"Ohio","City":"Westerville","trends":["There have been 3 other sightings in Westerville","There were no other sightings in Westerville on or around December 12th 2012","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=40.162187,+-82.92014(44689)&iwloc=A&hl=en\"> mufon case (44689) map </A>","files":["/var/www/straped/mufon/html2text/44689.html.txt","/var/www/straped/mufon/org/44689.html"],"Log Number":"US-12202012-0022","Date Submitted":"12/20/2012 08:03 UTC","Sighting Duration":"00:03:00","Tags":"City","Date of the Event":"12/12/2012 07:27 UTC","Object Shape":"Flash, Sphere, Triangle","Disposition":"Unresolved","Country":"United States","divs":["sighting detailson the evening of 12-12-2012, beginning at approximately 7:25pm, i witnessed what appeared to be an aircraft with its landing lights on, approaching from the e-se, headed n-nw. the craft was traveling at a speed that you would associate with an airplane, only the lights were very bright, which made me notice it, and lights that were orange-ish in color. i had stopped my car that i was traveling in to watch the craft at this point, which i could see very clearly now, as there are no street lights in my neighborhood, and i have 20\\15 vision. as the craft approached, i could see that it was now actually a group of tightly arranged lights that appeared pyramidal in shape, and the lights were a combination of bright orange and yellow. i immediately reached for my motorola droid razr hd and began filming in \"hd\" mode, under normal magnification. the craft had come to a \"complete stop\" at this point and was now oscillating in distinctly different colors: red, blue, green, orange and yellow about 6 seconds into the video i zoomed in at approximately 75% magnification, in an attempt to get better detail of what i was witnessing and observing. i would estimate that my distance from the object was approximately 1\\2 mile. at 20 seconds into the video taping of the craft, it \"blinked\" a couple of times and vanished. i continued taping, adding details to the video to corroborate the time and date of what i had just observed, along with other identifying information."],"Case Number":"44689","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile"}