{"Date of the Event":"12/13/2012 10:15 UTC","Sighting Duration":"00:01:00","Summary":"My Brother and I were watching for meteors when a V shaped dark grey object came into our view flying N to S.","Tags":"City","Longitude":"-75.170526","Region":"Pennsylvania","Source":"MUFON","Object Shape":"Chevron","files":["/var/www/straped/mufon/html2text/44684.html.txt","/var/www/straped/mufon/org/44684.html"],"Disposition":"Unresolved","City":"Philadelphia","Country":"United States","Weather Factors":"Unknown","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.958179,+-75.170526(44684)&iwloc=A&hl=en\"> mufon case (44684) map </A>","Latitude":"39.958179","Case Number":"44684","Object Features":"None","Log Number":"US-12202012-0017","Date Submitted":"12/20/2012 03:42 UTC","trends":["There have been 216 other sightings in Philadelphia","There was one other sighting in Philadelphia on or around December 13th 2012"],"Object Flight Path":"Straight-line path","divs":["Sighting DetailsMy Brother and I were in my backyard on the night of December 13th 2012, watching for meteors during the meteor shower that was clearly visible to the naked eye that night. We had gone outside at approximately 9:50 pm and during the next 15 minutes saw about 5-8 meteors. The way my house is set up, from my backyard, I have a clear view straight up into the sky and then I can see south really far, but I can't see a plane or anything else coming from the north of me until it is directly overhead. So we are looking up and directly overhead going south appeared what I could immediately at the time say looked like a giant ribbon shaped object in a V shape, almost like a giant piece of ribbon being pulled in a southerly direction attached at its center by something. But there was nothing in front of it pulling it. I thought at first it was maybe a big piece of trash getting blown in the wind but as we watched it that theory became disregarded. It wasn't moving fast at all, as we watched it for over 45 seconds until it disappeared out of our sight to the south. It had no lights on it but I could make out its outline somehow against the black night sky, it appeared to be a lighter shade of black than the sky so I'll say it looked dark grey. But it could have been black. As it got further away south it also looked to be ascending maybe. At one point it looked to me that the two arms of the V got closer together making the V shape very narrow almost to the point of being a thicker, straight line shape, but the two arms did not touch, they just got very close to each other. Then before it went completely out of our view I saw what I'll describe as one arm of the V getting shorter as the other arm got longer, but its north to south direction never changed at all. We watched it going south until it was out of view. After we lost sight of it I tried to process what just happened and something about the shape, movement, speed and size of the object just didn't look right, like my mind couldn't process it the way all of those factors added up in my head. Its speed was so constant and fluid, and it was dead silent, and looked big, from the ground each arm looked to be a couple of inches long when the arms were evenly distributed. My reaction during the event was just, what is that? For at least 45 seconds I stared at it in complete wonder."]}