{"Tags":"City","Log Number":"US-02222006-0001","Longitude":"-71.453889","Object Flight Path":"Stationary","Latitude":"41.580556","Object Shape":"Other","Object Features":"Unknown","Viewing Distance":"101-500 Feet","Summary":"Very Odd lights about 200 yards from the road in North Kingstown","Weather Factors":"None","Source":"MUFON","Date of the Event":"02/21/2006 09:00 UTC","Region":"Rhode Island","trends":["There have been 2 other sightings in North Kingstown","There were no other sightings in North Kingstown on or around February 21st 2006"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.580556,+-71.453889(4469)&iwloc=A&hl=en\"> mufon case (4469) map </A>","Country":"United States","City":"North Kingstown","Date Submitted":"02/21/2006 09:00 UTC","Sighting Duration":"00:02:00","divs":["Sighting DetailsThis is going to sound a bit odd. OK, alot odd. I was traveling north on Rt.1 last night at about 9 PM in North Kingstown just past Oak Hill Road but south of the Exeter exit, when I saw what looked like two very bright lights on the west side of the road (about 100 or so yards off the to the north and west. As I approached, I realized the lights were standing still. I slowed way down in my right lane to get a better look because as I passed the bright white lights, there were about ten neon blue strips of lights in triangular and pentagon shapes just hanging there in mid air above the trees but back into the woods. I started to pull off the road to get a better look but I was A) shocked at what I saw and had a little bit of fear B) concerned that the cars behind me would be staring at the same thing and would rear-end my car instead of watching the road and C)I didn't want to be late to pick up my daughter from the movies in Warwick. As a result I only got a 15-20 second close look at this \"thing\". I found it odd that only about 2-300 yards away there was the usual police officer parked on the south side of the road looking for speeders and he obviously didn't see anything (but he was facing north looking for the cars. I went back with my daughter hoping it was still there and that there was a logical explaination but there was nothing there when my daughter and I returned about 9:55pm. Anyway, I was wondering if any of the other drivers reported anything to explain this VERY UNUSUAL Phenomena. P.S.- I'm a physician with a scientific background. This souds as odd to me as it probably does to you. You may contact me on my cell at 401-623-6164 if you have any questions or info for me. Thanks, Dr. Jay Korsen"],"files":["/var/www/straped/mufon/html2text/4469.html.txt","/var/www/straped/mufon/org/4469.html"],"Case Number":"4469","Disposition":"Unknown"}