{"trends":["There have been no other sightings in Northridge","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=34.264904,+-118.544804(44698)&iwloc=A&hl=en\"> mufon case (44698) map </A>","Country":"United States","Latitude":"34.264904","Object Shape":"Cigar","divs":["Sighting DetailsAround 6:30 am on 12.21.12 (today!) I witnessed multiple (5-10) cigar shaped UFO's appear in the eastern sky near Burbank. Admittedly, this is near an airport so I was very careful to jump to conclusions. The first one I saw came at a time where there were no clouds in the sky, but the morning sunlight created an orange colored sky. OUT OF NOWHERE a thin line that looked like a cloud or even a vapor trail appeared but was intensely lit up by the sun, creating an orange glow. Grabbing my camera, I zoomed in and captured the attached photos. I watched as multiple \"cigar shaped clouds\" appeared out of nowhere and slowly moved in an eastern direction. With other planes in the area, it was easy to tell the difference between them. At one point, I could see 3 in a side by side formation, moving at the same speed. I have attached all pictures taken for you to view. There are a couple of them that shows an object at the end of the \"vapor trail\" as these were moving faster and in a different direction than most of the others. These (possibly, but really still very unsure) may have been planes, or earthly craft of some kind...however, by the looks of at least one of them, the shape of the object does not appear to be an airplane, and also considering that many other aircraft that were clearly planes from the airport (They were Northwest Airline Planes) were flying all around and none of them were leaving any sort of vapor trails. As I said, attached are all of the pictures taken that show anything, just keep in mind also that I acknowledge the possibility of pictures 2,3,4,5,10, and 15 (15 especially, not quite so sure on the others) could be an airplane. 2,3,4,and 5 however, the object is much smaller and from my vantage point did not look too much like an airplane. (5 more pics, but not enough attachment spots)"],"Disposition":"Unresolved","Log Number":"US-12212012-0005","Object Features":"None","Date of the Event":"12/21/1980 06:30 UTC","Weather Factors":"Unknown","Source":"MUFON","Case Number":"44698","City":"Northridge","Date Submitted":"12/21/2012 12:13 UTC","Summary":"Multiple cigar shaped \"glowing clouds\" appearing in a formation over Burbank,CA","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/44698.html.txt","/var/www/straped/mufon/org/44698.html"],"Region":"California","Viewing Distance":"Over One Mile","Longitude":"-118.544804","Object Flight Path":"Hovering then path","Tags":"City"}