{"files":["/var/www/straped/mufon/html2text/44694.html.txt","/var/www/straped/mufon/org/44694.html"],"Tags":"City","Sighting Duration":"Undisclosed","Source":"MUFON","Object Shape":"Circle, Oval, Triangle","Longitude":"-112.103712","Object Features":"Dome","Region":"Arizona","Disposition":"Unresolved","Weather Factors":"Unknown","Summary":"Three bright orange glowing orbs hovering in a vee formation.","map":"<A HREF = \"http://maps.google.com/maps?q=33.64047,+-112.103712(44694)&iwloc=A&hl=en\"> mufon case (44694) map </A>","divs":["Sighting DetailsI pulled out of my complex at approximately 8pm on 12-20-12 and drove west down Yorkshire Dr. As I crossed 31st Ave I immediately noticed three orbs floating in a 'V' formation. I slowed down and stopped in the middle of the road to get a good look, and could see several jet aircraft circling the area, and in comparison seemed tiny compared to the objects which had a bell shape, or at least the light coming off formed that shape. All I could think of was how similar they looked to the Phoenix lights, the color looked exactly the same, a dull orange color, the light was intense and I did not see any flickering or pulsing. I had to pull over to the side of the road as I was now blocking traffic. As I watched, the formation slowing moved in a north west direction, then stopped and the single craft forming the tip traveled straight up, as it did the two rear craft moved toward each other slightly. I was trying to tell if it was one big craft that was maybe turning vertical and flying up. I could not see any other outline so it looked like three crafts. The strange thing is that there was very light clouds in the area, and after traveling vertical for a short period, instead of the light slowly fading away it seemed to just disappear. After the first craft was no longer visible, the trailing two also began a vertical ascent, slowly moving toward each other at the same time. They also went from very bright and visible to completely invisible to the eye at about the same elevation as the first one did, no trace of them after that. All that was left in the area were several jet crafts flying in circles, which made me wonder even more what I just witnessed. The size of these crafts must be huge, compared to the jets flying around, they were at least four times the size. I initially though they were just very low but after watching them I could tell they were really pretty high up, scale wise they looked a little bigger that a street light, but at about the altitude you would expect to see a plane flying."],"Date of the Event":"12/20/2012 08:05 UTC","Country":"United States","trends":["There have been 417 other sightings in Phoenix","There was one other sighting in Phoenix on or around December 20th 2012"],"Case Number":"44694","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Log Number":"US-12212012-0001","Viewing Distance":"Unknown","Date Submitted":"12/21/2012 12:49 UTC","City":"Phoenix","Latitude":"33.64047"}