{"Date Submitted":"12/21/2012 02:49 UTC","Source":"MUFON","Object Flight Path":"Stationary","divs":["Sighting DetailsApproximately 4:30am I got up and went to the bathroom like I always do. When I got back it bed,I looked out the bedroom window,which is something else that i always do. I noticed a very bright light in the sky and found it odd because it was partly cloudy, and this light just shined so bright. I also noticed that there was a smaller light near it,it just was not as bright. I initially thought it was some aircraft, but it held my attention when it just hovered in the same spot. I woke my boyfriend upand told him what I saw,he said it was just a star and went back to sleep. I explained how bright it was and the fact that it was kind of cloudy and to please just look. I also asked him if he saw one or two..I figured my eyes were kjnd of tired and playingvtricks on me. He assured me there was only one and went back to sleep. I continued to watch for movement for the next 15 min or so, until I fell asleep. While I was watching I noticed how the colors changed reddish orange and then white. I also asked what was the closest planet to us, he said Venus. I kind of chalked it up to being Venus and settled down to sleep. When I mentioned it to a friend online, they too said it was possible that it was Venus as well. I'm going to look again tonight to see if it's there again but somehow I doubt it."],"Object Features":"Unknown","Log Number":"US-12212012-0007","City":"Baltimore","Disposition":"Unresolved","Sighting Duration":"Undisclosed","trends":["There have been 65 other sightings in Baltimore","There were no other sightings in Baltimore on or around December 21st 2012"],"Longitude":"-76.657148","Tags":"City","Viewing Distance":"Unknown","Country":"United States","Case Number":"44700","Latitude":"39.315985","Object Shape":"Sphere, Star-like","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.315985,+-76.657148(44700)&iwloc=A&hl=en\"> mufon case (44700) map </A>","Summary":"It seemed to just hover in one spot, lights changing randomly unsure if there was a second","Date of the Event":"12/21/2012 04:30 UTC","Region":"Maryland","files":["/var/www/straped/mufon/html2text/44700.html.txt","/var/www/straped/mufon/org/44700.html"]}