{"Date Submitted":"12/21/2012 08:31 UTC","trends":["There have been 185 other sightings in Denver","There was one other sighting in Denver on or around December 20th 2012"],"Region":"Colorado","map":"<A HREF = \"http://maps.google.com/maps?q=39.665944,+-104.872218(44705)&iwloc=A&hl=en\"> mufon case (44705) map </A>","Country":"United States","Source":"MUFON","Longitude":"-104.872218","Object Shape":"Sphere","Disposition":"Unresolved","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/44705.html.txt","/var/www/straped/mufon/org/44705.html"],"Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","Case Number":"44705","City":"Denver","Log Number":"US-12212012-0012","Tags":"City","Latitude":"39.665944","Summary":"Object with red and green flashing light","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path","Date of the Event":"12/20/2012 12:00 UTC","divs":["Sighting DetailsI was getting in my car after work when I looked up and saw what I looked like a red altitude warning light for planes, but hovering in the air on South Colorado Boulevard, looked to be at about the intersection of Evans and Colorado. I got in my car and turned in on to warm it up when the red light started flashing and moving. I thought it might be a plane since it had a fairly steady slow movement and that it might have just been flying towards me and that's why it looked like it was hovering, then the color of light I saw changed to green and started flashing. I watched it fly towards me a little bit and then it veered off towards the big Chase building on Colorado and Yale just North of where I work. The object circled the building and I didn't think much of it. I then watched it turn back around and circle it again. Then it did it again and I decided to get my phone out because I was starting to be unsure why a plane would be alternating between flashing red lights and then flashing green lights. I caught about a minute and a half of footage of it flying around the Chase building in about a 200-meter radius. After I had initially saw the object I had begun to think it was a plane just making an odd maneuver for Christmas and thought nothing of it. I put my phone away and was getting ready to drive home after a long shift when I noticed it had disappeared."]}