{"Date Submitted":"12/22/2012 01:21 UTC","Longitude":"-80.267414","divs":["Sighting DetailsMy son and I were playing outside and decided to take a break and look up at the planes flying over while lying in the grass. Because it was such a nice clear day, the planes flying over head were quit visible and distinct. The planes flying over head were emitting exhaust which as you know freezes in high altitudes appearing like white cloudy steaks in the sky. This is what we were initially experiencing. After a few minutes I noticed a shimmering pulsating light appearing just under and to the right of the moon.The object was noticeably cylinder shaped, so I immediately believed it to be a plane. It was travelling from East to Southwest direction. The odd thing was, it was higher than the planes we were observing. My next thought was maybe it was a large satellite or possibly the ISS. That appearently wasn't it because the direction changed to more of a South direction. From what I know satellites travel on a linear path and do not deviate. The object then topped moving and remained stationary for approximately 5 minutes. Once again, rules out planes and satellites. It just remained there while shimmering a pulsating bright white light. I do not believe it was a reflection from the Sun. It pulsated in a timely matter kind of like a plane's beacon light. But once again,this was not a plane, I never seen such a bright light from a plane's wing pulsating not to mention, planes do not stop mid air unless its a Harrier Jet. From what I can tell it was further up than the planes flying so definately higher than 30,000 ft. Being it was clearly visible, I am assuming it was probably 3x the size a normal passenger 757 type plane. After the 5 minutes or so of it hovering in a high altitude, it began to appearently drift up and out from its fixed position until it was no longer noticeable. Besides myself, my 4 yr old son and 14 yr old son and 12 yr old daughter witnessed this event. There were several of their friends there as well. If this was truly a UFO, it was pretty remarkable."],"Viewing Distance":"Over One Mile","Region":"Florida","Weather Factors":"Unknown","Sighting Duration":"00:10:00","Tags":"City","City":"Coral Springs","Object Flight Path":"Stationary,Path with directional change","Source":"MUFON","Country":"United States","Case Number":"44714","Summary":"Cylinder shaped and pulsating shimmering light","Log Number":"US-12222012-0005","Object Shape":"Cylinder","trends":["There have been 18 other sightings in Coral Springs","There were no other sightings in Coral Springs on or around December 19th 2012"],"Object Features":"Unknown","Date of the Event":"12/19/2012 04:00 UTC","files":["/var/www/straped/mufon/html2text/44714.html.txt","/var/www/straped/mufon/org/44714.html"],"Latitude":"26.278682","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=26.278682,+-80.267414(44714)&iwloc=A&hl=en\"> mufon case (44714) map </A>"}