{"Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=36.817908,+-80.60979(44717)&iwloc=A&hl=en\"> mufon case (44717) map </A>","Log Number":"US-12222012-0008","Sighting Duration":"00:00:30","City":"dugspur","Date of the Event":"11/26/2012 01:00 UTC","Longitude":"-80.60979","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/44717.html.txt","/var/www/straped/mufon/org/44717.html"],"Viewing Distance":"Unknown","Disposition":"Unresolved","Source":"MUFON","Object Shape":"Disc","Object Features":"Other","Latitude":"36.817908","Summary":"saw as driving stopped got pic through windshield turned car off listened then it left","Date Submitted":"12/22/2012 03:00 UTC","divs":["Sighting DetailsI was driving down deepwater rd. in Carroll Co Va when I noticed a flash out of the corner of my eye. when it stopped it would be sitting hovering above the tree tops along the creek.But would move back .I was trying to quickly take a picture with my cell phone, but couldn't keep up, the first 2 tries I missed the picture . So i stopped in the road and leaned forward and looking up took a pic of it. I then rolled my window down and turned off the car and listened to see if it made any noise. which it did not.When it moved forward or back it seemed to just appear instead of seeing it go forward or back.I was frightened and was not about to get out and chase it.It moved behind some of the tree tops and was just gone . I didn't see it leave, it was just gone. Telling people only results in smart comments so here it is take it or leave it. The pic is cell phone quality but prety good . You can see the shape ,lights on the bottom the sun glaring off the side of it and the sky in the direction it was heading is different than the rest.you need to zoom up to the left corner"],"Case Number":"44717","Tags":"City","trends":["There have been no other sightings in dugspur","This sighting has been favorited 1 time."],"Country":"United States","Region":"Virginia"}