{"Country":"United States","Longitude":"-118.995086","Source":"MUFON","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/44716.html.txt","/var/www/straped/mufon/org/44716.html"],"City":"Camarillo","Object Flight Path":"Straight-line path","Object Features":"Wings","Date of the Event":"12/21/2012 09:12 UTC","Summary":"Bright Amber White Light/Craft, has outline, may be arrow shaped","map":"<A HREF = \"http://maps.google.com/maps?q=34.19532,+-118.995086(44716)&iwloc=A&hl=en\"> mufon case (44716) map </A>","Case Number":"44716","Weather Factors":"Unknown","Log Number":"US-12222012-0007","Sighting Duration":"Undisclosed","Tags":"City","Latitude":"34.19532","Region":"California","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Chevron, Other","divs":["sighting detailsi saw an flying object in the sky while driving on the 101 freeway southbound in camarillo. it was orders of magnitude brighter then any aircraft i've ever seen and the lights were not flashing. i rolled down my window to look at it and it was so bright my eyes had to adjust. at first i thought it was not moving, but then i saw it was moving very slow. it was not very high up, probably about 135 stories high. for the split second i looked at it, it was arrow shaped, but the whole thing was lit, it was not just like 3 or 4 lights on a regular air craft, and it was definitely not a helicopter. it was way brighter than the moon, any stars, and the street\\city lights. i am hesitant to use the u word. i am still trying to make up my mind what it was. if it was an experimental commercial or military aircraft, it makes no reason it would be designed to waste all that energy to make it so bright. oh yeah, it was not a blimp either. later we observed in the distance about 3 miles away a large field of amber light emitting from the ground. almost like lights from a football field but much bigger, and the light was very even and amber. it was in the approximate area of oxnard shores and was brighter the the city lights. it was coming from behind the hills. this field of light has been observed before by my best friend and others in the area and videos were taken. i am attaching the video and pic of the field of amber light my best friend took."],"trends":["There have been 7 other sightings in Camarillo","There were no other sightings in Camarillo on or around December 21st 2012"],"Date Submitted":"12/22/2012 02:44 UTC"}