{"Date of the Event":"12/21/2012 05:20 UTC","Latitude":"41.677083","Case Number":"44719","City":"Iowa City","files":["/var/www/straped/mufon/html2text/44719.html.txt","/var/www/straped/mufon/org/44719.html"],"Date Submitted":"12/22/2012 06:29 UTC","Object Flight Path":"Stationary,Straight-line path,Path with directional change,Path then hovering","Disposition":"Unresolved","trends":["There have been 7 other sightings in Iowa City","There were no other sightings in Iowa City on or around December 21st 2012"],"Object Features":"Appendage(s), Other","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-12222012-0010","Object Shape":"Other, Unknown","Longitude":"-91.501233","Weather Factors":"Unknown","Summary":"Arial object with brilliant white lights and amber lights near I-80 and Exit 240 moving to the North.","Country":"United States","Tags":"City","Source":"MUFON","divs":["sighting detailsthe objected was sighted while drove slowly due e-- just before the intersection of n. scott blvd and act pl to approximately 1850 n scott blvd. the night was very dark and cold and the sky was unusually clear. i was admiring the brighter planets and stars while i waited for my turn at a 4-way stop. when i first sighted it, it seemed to be about the size of my thumb at arms length at about 10 degrees in the east. it was slowly moving and seemed to become stationary briefly. the lights were like led lights, a brilliant blueish color to clear white, and to my vision they seemed to be clustered together. the object stopped. i wondered if it was an advertising display or a blimp, but i could not see anything like red or green lights. as i went forward toward the lights the object increased speed. then like a car that missed it's turn on the highway, the cluster made a quick and tight u-turn. when it turned i could see the \"cluster\" of brights were equally spaced as if on a long \"neck\" or pole. however, i did not see anything that make me think that there was anything solid between them. i could see at least three and there may have been as many as five brilliant lights on a straight equally spaced line. it was hard to tell as they were so bright. thus, i could not see any structure between the lights, but directly behind the lights i could see a solid pie shaped solid about i\\3 as long as the distance occupied by the white light. the shape seemed to be attached to the white lights by the corner of the \"pie.\" the angle was approximately 45 degrees. the effect was something like a short fireplace broom. as the object made a full 180 degree turn, i could see the rear of the object. the height of the object was about 20 percent of the width of the \"pie\" and the \"pie seemed to be about 1\\3 the length of the line of white lights that proceeded it. on the slightly curved back side were four (4) equally spaced amber-yellow large round lights that were glowing and much less bright than the white lights. the amber lights were at least the size of my thumb nail at arms length. by the time i saw the amber lights, the object was much nearer in the sky. it appeared to be about the size of my open palm and open fingers. i slowed my car to keep it in view, and saw it make a sharp right turn to the north. it seemed to slide sideways and speed up. i checked the road and looked for it again. it was gone. i had viewed the front, side and back or the object. it was a dark pie shape behind the white lights. i never saw anything that looked red or green. the car was not affected, and i heard no sound over the radio. i made notes and a sketch when i arrived at my destination."],"Region":"Iowa","Sighting Duration":"00:02:30","map":"<A HREF = \"http://maps.google.com/maps?q=41.677083,+-91.501233(44719)&iwloc=A&hl=en\"> mufon case (44719) map </A>"}