{"Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 63 other sightings in Abilene","There were no other sightings in Abilene on or around December 21st 2012"],"Case Number":"44713","Date of the Event":"12/21/2012 08:00 UTC","Disposition":"Unresolved","Date Submitted":"12/22/2012 01:04 UTC","Tags":"City","Summary":"Last night was the third time this month I have seen these lights. Blue last night but green the first two sightings.","files":["/var/www/straped/mufon/html2text/44713.html.txt","/var/www/straped/mufon/org/44713.html"],"Object Features":"None","Sighting Duration":"Undisclosed","Country":"United States","Latitude":"32.424475","divs":["sighting detailsat about 8:00 p.m last night i was in my backyard with a buddy of mine. has i live just south of downtown abilene i always look toward our skyline. just when i looked isaw about 20-30 blue lights flying east\\northeast just has i had seen on december 1st about 11:00 p.m and on december 8th at about 8:00 p.m. only one exception. those two sightings the lights were green. the first time i saw about 10-12. the second time i saw about 7-8. this time there was a fleet of about 20-30 i couldn't count them all. a dyess afb cargo plane flew right into the path of this \"objects\". i have heard nothing from the local media or dyess afb. these light all three times have flown from the west-sw to the east-ne over downtown abilene. they were flying in a straight line and acended to the north and then made some formation like a big dipper formation. then they just contined to the northeast and were lost in the horizon. when i first encountered the lights on december 1st it was an event i had waited my whole life for. when i saw it on the 8th it became very real to me. no one i told believed at first. ridicule was the first reaction to my sighting. but last night, there were so many \"lights\" there was no way you could have been driving and not seen them. each light seemed to be independent from the next. it was not of this world. something is happening over the skies of abilene, tx this month. i seem to be the only one who cares and i guess i have been chosen for something greater. there were sightings in the midland\\odessa permain basin in november. could these sighting be related? something odd is happening in west texas that's for sure."],"Region":"Texas","Log Number":"US-12222012-0004","Longitude":"-99.748489","City":"Abilene","Object Shape":"Star-like","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=32.424475,+-99.748489(44713)&iwloc=A&hl=en\"> mufon case (44713) map </A>","Weather Factors":"Unknown"}