{"Tags":"City","trends":["There have been 17 other sightings in Flushing","There were no other sightings in Flushing on or around December 22nd 2012"],"Weather Factors":"Unknown","City":"Flushing","Latitude":"43.072594","Log Number":"US-12222012-0013","Source":"MUFON","Summary":"At first glance,they appeared as flaming \"lantern\"-type objects..... until they stopped, hovered, and changed colors!","Object Flight Path":"Hovering then path","divs":["sighting detailswhile driving west on the main street of the town, noticed 2 odd-looking, very bright, \"flaming\" type objects. i assumed they were probably \"chinese lanterns\" that many people \"send up\". i watched them for about 3 minutes, and both of the objects stopped, and were hovering- and the colors changed from a flaming red, to orange, and then a bright white, then to green! right then i knew that 1) chinese lanterns do not \"hover\", nor 2) do they randomly flash solid white, then green. both objects then began a slow course (much slower than an airplane\\helicopter), and while driving home, noticed that they had \"changed course\" from sw to due north. when i returned home, (a 5 minute drive) and got out of the car- they were no longer visible! i have seen \"chinese lanterns\", planes, helicopters, etc.....and these 2 objects could have easily been mistaken for those lanterns- if you were not \"paying attention\" to the randomly, bright flashing colors! these objects also had no sequentially-flashing lights as an airplane would, and as far as i know- chinese lanterns do not change from flame red, to orange-red, to bright white, to green!"],"files":["/var/www/straped/mufon/html2text/44722.html.txt","/var/www/straped/mufon/org/44722.html"],"Longitude":"-83.856842","Date of the Event":"12/22/2012 07:32 UTC","Object Shape":"Fireball, Unknown","Case Number":"44722","Region":"Michigan","Viewing Distance":"Unknown","Date Submitted":"12/22/2012 07:53 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.072594,+-83.856842(44722)&iwloc=A&hl=en\"> mufon case (44722) map </A>","Object Features":"Unknown","Country":"United States","Sighting Duration":"00:10:00","Disposition":"Unresolved"}