{"map":"<A HREF = \"http://maps.google.com/maps?q=41.768344,+-94.028246(44728)&iwloc=A&hl=en\"> mufon case (44728) map </A>","trends":["There has been one other sighting in Belle Plaine","There were no other sightings in Belle Plaine on or around December 22nd 2012"],"Object Features":"None","Source":"MUFON","City":"Belle Plaine","Country":"United States","Date of the Event":"12/22/2012 06:45 UTC","Weather Factors":"Unknown","Object Shape":"Triangle","Latitude":"41.768344","Longitude":"-94.028246","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Log Number":"US-12222012-0018","Region":"Minnesota","Case Number":"44728","Date Submitted":"12/22/2012 11:31 UTC","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/44728.html.txt","/var/www/straped/mufon/org/44728.html"],"divs":["Sighting DetailsTraveling south on Hwy. 169, approx. 1 mile south of Belle Plaine, Minnesota. Observed five bright, star-like objects, to the south-west, traveling east, slowly, perhaps at a helicopter speed and altitude. There was a formation of three, and two, but they didn't hold tight, and seemed to randomly vary their distance from each other, as though not really aware of each other. We tracked them for two minutes or so, and their flightpath intersected the highway almost as we approached them. We pulled to the shoulder as they approached. A least two other cars also pulled over, but more than 1,000 feet from us. The nearest object, and last in the formation, appeared to have an almost triangular shape, and seemed to glow an amber, as if it were on fire. As the five objects passed, they all abruptly dimmed and disappeared, not all at once, and not in any order. I rolled down the window, but likely due to the highway noise, there was no observable sound. After the last object faded away, the other cars that had pulled to the shoulder, signaled, and returned on their way. The total time of observation was 3 to 5 minutes."],"Summary":"Observed five amber, bright star-like objects, flying in formations of 2 and 3, then fade.","Object Flight Path":"Path with directional change"}