{"Region":"Michigan","City":"Plymouth Township","Date of the Event":"12/23/2012 12:00 UTC","Country":"United States","Weather Factors":"Unknown","Object Features":"Dome, Other","Sighting Duration":"Undisclosed","Longitude":"-83.509038","files":["/var/www/straped/mufon/html2text/44729.html.txt","/var/www/straped/mufon/org/44729.html"],"Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.373533,+-83.509038(44729)&iwloc=A&hl=en\"> mufon case (44729) map </A>","Disposition":"Unresolved","Date Submitted":"12/23/2012 01:42 UTC","divs":["Sighting Detailsat approximately 11:55pm on saturday december 22 2012 about 20 miles west of detroit, Michigan I turned onto I-96 west from merriman rd heading home from a friends house. A couple minutes into the drive I noticed an extremely bight, and large light that glowed a brilliant red and green outline straight ahead of me on the same path I was traveling off in the near distance. After driving for 5-10 min without taking my eyes off of it I was directly under it as I continued my ride home. It was 500-800 feet in the air, silent, and it was either hovering or moving at the pace of a blimp in a NE direction. It was nearly identical shape as a military drone only much bigger. It was about the size of 2 semi truck trailers side by side if not bigger. On the front, or rounded part of the drone shaped craft had a series of greenish white lights. approx 10 small evenly spaced greenish white lights around the outer edge of the round front part. On the tail or rectangle shaped part there were bright blue lights going around all 3 sides of the exterior. These were also evenly spaced the same as the greenish white lights. All the lights were very bright and defined. Had the look of LED lights. As I drove under and past it I quickly got off at the next exit a mile or less down the road. I pulled into a parking lot and watched as it slowly moved off, did a slow wide nearly 180 degree turn and start heading south as if to follow I-275 south. At this point I started to lose sight so I jumped in the car to follow it. I followed it for a few minutes but as the road winded I lost sight of it behind the trees and never located it again."],"Tags":"City","Latitude":"42.373533","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","trends":["There has been one other sighting in Plymouth Township","There were no other sightings in Plymouth Township on or around December 23rd 2012"],"Summary":"driving home on freeway. noticed giant drone shaped flying object with lots of lights no sound for approx 15 min","Log Number":"US-12232012-0001","Object Shape":"Disc, Square, Rectagular, Other","Case Number":"44729"}