{"Object Shape":"Star-like, Triangle, Other","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.812074,+-117.229226(44733)&iwloc=A&hl=en\"> mufon case (44733) map </A>","Weather Factors":"Unknown","Longitude":"-117.229226","Case Number":"44733","divs":["Sighting DetailsAt about 9:32 pm my mom started yelling for me from the second floor balcony. Before she yelled I noticed a car alarm going crazy on the next block. I ran upstairs and there were two extrememly bright jewel toned pinkish-red lights in the sky. They hovered there and I then ran downstairs to get my camera. I started taking pictures and after a few minutes one faded out. I kept taking pictures until the second one faded out as well. Very soon after the second one faded out another one, just like the first two, approached from the east in the distance. It came towards us in a straight line over the course of a few minutes and eventually came to rest in the same exact area of the sky as the first two were seen. The third pinkish-red light then hovered in this spot and began to fade out. It disappeared and then quickly reappeared further to the right in the same area of the sky before fading out for good. During the sighting of the 3 lights the car alarm continued to go on and off repeatedly. After the third light was gone I ran onto the roof to get a view of more than the eastern sky. Once on the roof, I looked towards the moon high in the western sky and saw a high flying jet traveling NNW and leaving a small contrail. Then I suddenly see a dark and blury object about the size of a penny flying below the jet at a much faster rate of speed. It reflected the moonlight and went in the opposite direction (SSE)of the jet. This object had no lights and I could not distinguish its shape because of the speed. After loosing sight of this object I quickly turned towards the east looking for more lights, but ended up seeing a dark graphite colored fat triangular craft with rounded edges. It looked like half the size of my fist from where I was. This craft came from the east and appeared to be heading southwest. The rounded triangle craft also reflected the moonlight and had no lights. It quickly moved out of sight. All of this happend in about 15 minutes. I only have video and pictures of the pinkish-red lights, but the camera had trouble focusing in the dark."],"files":["/var/www/straped/mufon/html2text/44733.html.txt","/var/www/straped/mufon/org/44733.html"],"Summary":"First saw 2 extremely bright pinkish red jewel toned lights to the east. They disappeared and a 3rd came from the east and flew to the same location in the sky before fading out. I then ran onto the roof and...","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around December 22nd 2012"],"Object Features":"Unknown","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Date Submitted":"12/23/2012 03:22 UTC","Region":"California","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering,Other","City":"San Diego","Log Number":"US-12232012-0005","Viewing Distance":"Unknown","Tags":"City","Country":"United States","Latitude":"32.812074","Date of the Event":"12/22/2012 09:32 UTC"}