{"Longitude":"-83.202406","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"12/22/2012 12:00 UTC","Object Flight Path":"Straight-line path","Country":"United States","trends":["There have been 3 other sightings in Hazard","There were no other sightings in Hazard on or around December 22nd 2012"],"Log Number":"US-12232012-0010","files":["/var/www/straped/mufon/html2text/44738.html.txt","/var/www/straped/mufon/org/44738.html"],"Object Shape":"Bullet, Missile, Cigar","Weather Factors":"Unknown","Tags":"City","divs":["Sighting DetailsMy Mom, older sister and I had gone to town to do a little Christmas shopping and to get my car checked. After we were done in town my sister said she was hungry so we went to Burger King to get her something to eat. It was close to 2pm and being right before the holidays, it was very crowded. We went through the drive thru and gave our order and was waiting in the line when my Mom and I saw something shoot across the sky. My sister was in the backseat and so didn't see anything. The object looked to be about a foot or a little longer perhaps (but it could have appeared longer due to the trailing effect (like with shooting stars) as it shot across the sky. It was white in color...didn't look very solid though, it (or it's trail) looked to be about 6-8\" or so wide at the widest point (at least from our vantage point anyway). There is a mountain behind the local news building which was where we were looking when it happened. It was just a bit above the top of that mountain, above the power lines which were farther down. It was really quick - shot across a small part of the sky and disappeared. It was much to quick to be any type of aircraft (toy or otherwise) or even a bird (though I've never seen a bird look white and shiny or shoot across the sky like that of course.) It looked very much like a large shooting star or something similar, but I've never seen anything like that in the daylight. It was more than big enough to be noticeable and I wouldn't be surprised if more people saw it considering how crowded it was around there."],"map":"<A HREF = \"http://maps.google.com/maps?q=37.253051,+-83.202406(44738)&iwloc=A&hl=en\"> mufon case (44738) map </A>","Source":"MUFON","Sighting Duration":"00:00:03","Date Submitted":"12/23/2012 02:07 UTC","City":"Hazard","Disposition":"Unresolved","Case Number":"44738","Region":"Kentucky","Summary":"Shooting Star-like UFO","Latitude":"37.253051","Object Features":"None"}