{"Source":"MUFON","Summary":"These images were captured while photographing lightning","Case Number":"44730","City":"San Jose","Sighting Duration":"Undisclosed","Region":"California","Latitude":"37.358458","Longitude":"-121.850388","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/44730.html.txt","/var/www/straped/mufon/org/44730.html"],"Log Number":"CR-12232012-0002","Object Features":"None, Other, Unknown","divs":["sighting detailsi was at my home in the central valley of costa rica (escazu, san jose). it was very stormy on the other side of the valley and i decided to try and photograph the lightning in the distance (north of my position). i often attempt to photograph lightning and enjoy taking pictures of the sky on clear nights. it was some time between 20:00 and 00:00 during the month of october, 2012. i cannot recall the exact time and date, as i did not see the event occur at the time, but discovered it while reviewing the images at a later date. i usually set my camera to shoot ten consecutive frames when taking these sort of low light photographs. in retrospect, now that i write about it and try to recall some details, i had felt a moment of uncertainty\\goosebumps\\confusion while taking pictures that night, but did not think much of it at the time. after all i was more interested in the lightning at the time than the stars or other features in the sky. as a consequence of my lack of observation, i am not certain which \"star\" appears in the left\\middle\\top portion of the picture frame. upon reviewing the pictures i did not notice or take immediate interest in these images as they did not capture any lightning. the \"photo shoot\" came and went without incident, and i did not think much of the strange feeling i had experienced that night. i was happy with many of the pictures i took that night and thought nothing of these pictures at the time as they did not contain lightning and seemed to not contain much of anything, except one bright star when reviewed quickly. it was not until late in the evening on the 20th of december 2012 that i discovered the strange object within these images. i was reviewing all of my \"night time\" photography that i had taken this year (the sky, low light pictures and lightning). meanwhile browsing through the hundreds of pictures i had taken this year, i saw\\realized what had been captured unintentionally. when i first saw the image i knew it was some thing strange. some thing i did not blatantly remember viewing that night. something that i had never seen in the sky or photographed before. i have often seen lights and other objects in the night sky that i could not identify or explain away, but never having any form of evidence, i always took those experiences as personal truths. i cannot say with any certainty what the object i photographed that night is, or where it came from. however my opinion is that it is some type of disc shaped object (flying saucer). i come to this conclusion due to the lights visible on what seems to be a slightly curved edge, and the objects apparent wobbly motion across the sky. it also seems as though the \"lights\" may have been pulsating, blinking, rotating or spinning, but i can only speculate. as best i can tell the object either appeared in the bottom middle of the picture frame (north from my position) and moved in a descending motion across the lower right side of the picture frame (toward the east). alternatively the object may have been moving across the picture frame (from west to east) and i only captured half of its trajectory as it moved across my line of sight. after discovering the object in the images i was very excited, as i have witnessed \"ufo's\" in the past, but had never captured a good image of one. i felt very lucky and felt as if i had finally been given some \"proof\" of what i already \"knew\" from other undocumented personal observations. these images were captured while photographing lightning. these pictures were taken with a canon eos rebel t2i dslr camera at f\\32, iso-3200, with a 5 second exposure time per frame. the object was captured in 9 of the 10 consecutive frames taken at the time. the object first appeared in the bottom middle of the picture frame and is seen descending\\leaving toward the bottom right of picture frame. the object was captured in frames 1-9 with the object having moved out of view under the tree line in the tenth frame."],"map":"<A HREF = \"http://maps.google.com/maps?q=37.358458,+-121.850388(44730)&iwloc=A&hl=en\"> mufon case (44730) map </A>","Viewing Distance":"Unknown","Object Shape":"Bullet, Missile, Cigar, Cylinder, Disc, Other, Unknown","Tags":"City","Object Flight Path":"Hovering then path,Straight-line path,Other,Unknown","trends":["There have been 106 other sightings in San Jose","There were no other sightings in San Jose on or around October 17th 2012"],"Country":"United States","Weather Factors":"Unknown","Date Submitted":"12/23/2012 02:02 UTC","Date of the Event":"10/17/2012 12:00 UTC"}