{"Object Shape":"Circle","Date of the Event":"08/15/2004 06:15 UTC","Case Number":"44743","Longitude":"-75.509743","Viewing Distance":"Unknown","Object Flight Path":"Stationary","Disposition":"Unresolved","City":"Phoenixville","map":"<A HREF = \"http://maps.google.com/maps?q=40.138942,+-75.509743(44743)&iwloc=A&hl=en\"> mufon case (44743) map </A>","Summary":"Saw something hanging in the sky in the distance","Country":"United States","Source":"MUFON","Log Number":"US-12232012-0015","Date Submitted":"12/23/2012 08:25 UTC","Weather Factors":"Unknown","divs":["Sighting DetailsThis report is being filed by a MUFON field investigator for the witness. The witness also reported a recent UFO sighting in December 2012 (see case 44673). This earlier sighting took place about 8 years ago (circa 2004), but she is not certain about the year. It was August. Early in the morning, just before the sun rose, she looked out the bedroom window and saw something hanging in the sky in the distance. She could not tell how far away it was. It was about the size of a quarter held at arm's length. It was a perfect circle, pewter gray. She went out onto her bedroom deck to get a better look. She grabbed a camera with a zoom lens (but no film). The zoom lens was 6 inches long, and provided about a 2x image. She could see every light bulb on the object. The object had multiple series of light bulbs that flashed on and off in a sequence. First they would light up on one side, then down the other side, etc. This repeated several times. Then the face of the disk was lighting up all over in muted random manner. When that stopped, each quadrant of the disc face would light in patterns (like a mysterious code). When it was done that, a wide black line appeared from 8 to 12 and from 12 to 4 (like the two vertical legs of an \"A\"). It resembled an upside down V. That went out and another line appeared from 8 to 4 (like the cross-bar of an \"A\"). That went away and the entire disc face went into all over random muted lights. That was the end of it because this was early morning, the sun was rising, and the disk blended into the color of the sky and faded away. The witness thinks back now and realizes that it did fade away as it matched the color of the sky. It was getting less solid looking and more transparent. After a little longer, it was gone, as all she could see was empty sky. She could not tell how long this took (maybe 15 minutes). The object faded away at approximately 6:30 am. Later that day, the witness made a telephone call UFO report to William Puckett (UFOs Northwest), but she did not file a report anywhere else. One of the most interesting things about this sighting is that the witness thinks that the object may have been trying to communicate with her (or with someone else)."],"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/44743.html.txt","/var/www/straped/mufon/org/44743.html"],"trends":["There have been 7 other sightings in Phoenixville","There were no other sightings in Phoenixville on or around August 15th 2004"],"Region":"Pennsylvania","Sighting Duration":"Undisclosed","Latitude":"40.138942","Tags":"City"}