{"files":["/var/www/straped/mufon/html2text/44741.html.txt","/var/www/straped/mufon/org/44741.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=44.316744,+-85.599534(44741)&iwloc=A&hl=en\"> mufon case (44741) map </A>","Date of the Event":"11/22/2012 12:00 UTC","Object Features":"None","trends":[],"Summary":"Apeared to be satellite but slowly turned i an ark slowly then went from goin ne to south. Then sighted 2 dim lights flying minutes later.","Latitude":"44.316744","Region":"Michigan","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","City":"Undisclosed","Tags":"City","Disposition":"Unresolved","Log Number":"US-12232012-0013","Object Shape":"Sphere, Star-like","Date Submitted":"12/23/2012 06:25 UTC","Object Flight Path":"Path with directional change","divs":["Sighting DetailsWent out front of my house after dark to lock my truck. Always aware of the stars and night sky I look up and see a bright ball of light moving NE. Thought it was a satalite but seemed to bright then it turned slowly east. I thought that's no satalite or someone is flying it. So I quickly snapped a picture with my I-phone5. Then went to video before I lost it behind the clouds. Maybe 5 minutes after that video I went out back to look up again and spotted one dim light coming from the east quickly started video ball of light was to dim to film it would not focus. I grabbed binoculars and looked at the light when I looked up at it it stopped for about 10 seconds and sat there looked like a dim redish orange constant steady light no flicker or trail. Then the object started going back east when it was almost out of sight I spotted a second redish light coming from south to north then made a right angle turn and went east until out of sight. A high flying jet was flying I the south sky and was easily identified , also a small prop plane was also seen flying at the same time. These objects I observed looked as if they were goin 2-3 times faster than the jet aircraft. No sound ,light did not flash flicker or even shine like steady dull lumination. Video object was bright white and did not flicker or flash was slower than red lights but faster than jet that was observed. Very strange."],"Longitude":"-85.599534","Viewing Distance":"Unknown","Country":"United States","Source":"MUFON","Case Number":"44741"}