{"Log Number":"US-12232012-0017","Case Number":"44746","Object Shape":"Other","Longitude":"-118.397061","Date Submitted":"12/23/2012 10:41 UTC","files":["/var/www/straped/mufon/html2text/44746.html.txt","/var/www/straped/mufon/org/44746.html"],"Summary":"as big as a 5 story building, looked kinda like a flying jellyfish, like the lights obscured the shape of the craft","trends":["There have been no other sightings in LAX","This sighting has never been favorited."],"divs":["Sighting DetailsI was on the 8th floor of a building in El Segundo sitting near a window studying. Suddenly about 3pm on a clear day, floating over LAX a multicolored UFO with about 6 black out helicopters flying around it.It was so huge it caught my eye. I could gauge the size of the craft because of the helicopters, the size of a 5 story building, This thing looked like a floating jelly fish! Maybe the glowing lights obscured the shape of the craft. I had a video camera but I was too astonished to pick it up! I had no clue what it was, but once I saw all the black helicopters, I regained my composure and when it took off in a flash, I realized it was something out of this world. It slowly moved east and then suddenly picked up speed and disappeared. One of the six helicopters flew right in my direction and over the building I was at. Almost as if the chopper knew what I saw and was intimidating me, and it worked! When I got home, I told the wife. Before the X files, (the Skully baby episode)Fox channel 11 announces, \"LA has an Xfile of our own\", and shows the craft on tv! I yelled at the wife, thats the ufo I saw! Fox said, more news at 11. that night Drew Barrymore's house burned down, waiting for the ufo story, they played that Drew Barrymore clip three or more times and announced, they couldnt get to all of the news, an obvious cover up. Somebody should look into it. We can pin down the date by the news story and we can possibly get a short video of the craft because it was on tv! 1999 (I think) X-Files Skully baby episode,(Im certain) and Drew Barrymore's house burned, I remember that for sure. I was so pissed they wouldnt get to the ufo story I sent them an email"],"Weather Factors":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.943655,+-118.397061(44746)&iwloc=A&hl=en\"> mufon case (44746) map </A>","Region":"California","Latitude":"33.943655","Country":"United States","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Date of the Event":"06/23/1999 03:04 UTC","Disposition":"Unresolved","Source":"MUFON","City":"LAX","Viewing Distance":"501 Feet - 1 Mile","Object Features":"None"}