{"Log Number":"US-12232012-0018","Date of the Event":"12/21/2012 07:40 UTC","Case Number":"44747","Object Features":"Unknown","Date Submitted":"12/23/2012 10:54 UTC","trends":["There have been 59 other sightings in Tulsa","There were no other sightings in Tulsa on or around December 21st 2012"],"Disposition":"Unresolved","Longitude":"-95.985725","Tags":"City","Region":"Oklahoma","Source":"MUFON","Weather Factors":"Unknown","Summary":"{nd} was heading west on 31st n tulsa. My wife and me observed six or more fireball looking objects hovering in the sky. Then they headed north.","divs":["Sighting DetailsWe were in Tulsa, okalhoma. We were heading west down 31st street to go to our daughters house. I looked at some emergancy vehcles to the south. When i looked back in front of me to the west my wife and i noticed at the same time that there were five fireball objects in the sky. The sky was clear at this time. You could barely see stars do to light polution. You could also see several planes in the sky as well. You could easily make them out though. We noticed this because they were intense. They just looked like hovering fireballs. At first i thought they were chinese lanterns floating.Then these five objects moved into a circular formation. The movement was deliberate. Chinese lanterns dont do that. I then looked back to the south and noticed two more fireball objects in the sky that were much closer and moving northward towards us. These looked the same. They just looked like fireballs. There were planes in the air at this time heading north as well to the tulsa airport. We could easily tell those were airplanes. An airplane was coming behind the two to the south. I looked back west in front of me. One airplane was heading north and appeared to fly through the circular formation. The top object suddenly moved down toward the plane then back up into position again. The bottom object went up toward the plane then back down to its position as well. Then the whole circle formation started to slowly move north behind the plane. All of the objects except for the bottom then faded out. There was then only one object to the west heading north. We lost sight of it due to trees. We then parked across the street from Dollar Thrifty Plaza. We were facing to the east now. I could see the two objects that were south. They were now over 31st street going the same speed. They were only maybe twenty feet from each other. The airplane that was behind them was going faster then they were. We were maybe only half a mile away from us or less. they were low.We then lost sight of them as well due to the trees. I didnt know what to think. I know these werent choppers. They didnt move like choppers. They didnt have sound. I felt confused by what i just saw. I didnt realy kmow what to do. I did try to take pictures and video with my phone unfortunately my battery was almost dead. I was mad at myself. After this we just could stop looking up to the sky. I knew i had to file this report to mufon. I didnt call the police because they would not believe us on that night of all nights. Tulsa cops arent very professional to begin with. This is the first time me or my wife have seen anything like this. Also we were completely sober. Nor do i have any history of mental disorders. i can draw a picture at a later time and submit it.I can also show on a map about the locations."],"Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.156622,+-95.985725(44747)&iwloc=A&hl=en\"> mufon case (44747) map </A>","City":"Tulsa","files":["/var/www/straped/mufon/html2text/44747.html.txt","/var/www/straped/mufon/org/44747.html"],"Latitude":"36.156622","Object Shape":"Fireball","Viewing Distance":"501 Feet - 1 Mile","Country":"United States"}