{"Longitude":"-78.155184","Sighting Duration":"Undisclosed","Summary":"Stationary, then slow crawl, shot up, shot down, then horizontal super speed","Tags":"City","Date of the Event":"12/22/2012 06:30 UTC","Object Shape":"Unknown","divs":["Sighting DetailsI was out walking dog and all the stars were very illuminated in dark sky. I noticed what I thought was another star but saw it had a red light flashing and that caught my attention so watched it. It was just still very high in sky, not moving - just a flashing red light. Then, very slowly it barely moved across to right at a snail pace. Then it started moving downward in an almost vertical direction. Suddenly it stopped and climbed upward extremely fast, then again, downward just as fast. I couldn't believe what I was seeing. Then it shot to the left horizontally, came lower and moved back to the right and behind me so I had to turn in a circle. My dog was pulling on the leash so I finally moved on. Then after a block, I turned to see if it was still headed in that direction and spotted it moving back the way it came except now, there was a smaller white only light moving at exact speed following behind and lower to it. The two objects continued back direction it had made from the circle toward the spot where I first observed it. I've never seen a plane able to make those types of moves. The night was black dark so all I can describe are the ligths and movements. (The time is uncertain, somewhere between 6PM & 7PM.)"],"Viewing Distance":"Unknown","Source":"MUFON","Disposition":"Unresolved","City":"Winchester","Log Number":"US-12242012-0003","Object Features":"Unknown","Region":"Virginia","Weather Factors":"Unknown","Case Number":"44752","Date Submitted":"12/24/2012 02:11 UTC","Latitude":"39.19056","files":["/var/www/straped/mufon/html2text/44752.html.txt","/var/www/straped/mufon/org/44752.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.19056,+-78.155184(44752)&iwloc=A&hl=en\"> mufon case (44752) map </A>","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","trends":["There have been 8 other sightings in Winchester","There were no other sightings in Winchester on or around December 22nd 2012"],"Country":"United States"}