{"Summary":"Awakened at 3 am with electricity out, both I and my husband heard loud humming and bright green lights surrounding our entire house followed by an entity encounter by myself","Viewing Distance":"20 Feet or Less","divs":["Sighting Details I was awakened at 3:00 am with the electricity in my home off. Then my husband awoke shortly after myself, which is extremely rare as he is a very deep sleeper. I said to my husband that there must've been a power failure in the night. At that moment, the entire house shook and vibrated and there was an extremly loud humming sound resonating throughout and all around us. I looked out my kitchen window and witnessed bright green light lighting up the yard encompassing our house. I was in shock to witness a humanoid figure beside the fence facing me about twenty feet from where I was standing. I could make the shape of what appeared to be a protective helmet over its head and observed a wand in his hand which appeared to be sparking. I could sense the being trying to telepathically compel me to go outside my home but even in my state of shock resisted it. My husband shouted from the other room, \" What the hell was that???!!\", hearing the loud humming sound continuing all around us. The whole incident lasted about five minutes before the lights dissipated and when I returned to the kitchen window the figure had disappeared."],"Disposition":"Unresolved","Source":"MUFON","files":["/var/www/straped/mufon/html2text/44751.html.txt","/var/www/straped/mufon/org/44751.html"],"City":"Lobelville","Tags":"City","Object Flight Path":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.695946,+-87.788732(44751)&iwloc=A&hl=en\"> mufon case (44751) map </A>","Sighting Duration":"Undisclosed","Date Submitted":"12/24/2012 11:39 UTC","Weather Factors":"Unknown","Case Number":"44751","Date of the Event":"12/24/2012 03:00 UTC","trends":["There have been no other sightings in Lobelville","This sighting has never been favorited."],"Longitude":"-87.788732","Object Shape":"Unknown","Latitude":"35.695946","Object Features":"Unknown","Log Number":"US-12242012-0002","Region":"Tennessee","Country":"United States"}