{"Log Number":"US-12242012-0009","trends":["There have been 3 other sightings in Allen Park","There were no other sightings in Allen Park on or around December 22nd 2012"],"Source":"MUFON","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Object Shape":"Chevron, Disc","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.259948,+-83.202638(44758)&iwloc=A&hl=en\"> mufon case (44758) map </A>","Latitude":"42.259948","Case Number":"44758","Longitude":"-83.202638","files":["/var/www/straped/mufon/html2text/44758.html.txt","/var/www/straped/mufon/org/44758.html"],"Region":"Michigan","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy friend was driving and noticed colors in the sky. He pointed them out to me bc they seemed to rest on the edge of only one big cloud, even though there were numerous clouds forming a ring around the sun. I initially thought it was a rainbow effect due to moisture in the air. Nevertheless I couldnt look away because it awed me how the lights were chevron & vertical in pattern and had distinctive edges on the top and bottom giving it a height much shorter than a rainbow is in length. We were traveling on allen road away from oakwood blvd toward outer drive when we noticed it. We turned right onto outer drive and the lights were ahead of us on our left side as we drove on outer drive. As we approached it, we noticed a fighter jet flying at high speed directly at the cloud w lights. The jet entered the scene about 2 minutes after we first spotted the strange lights. The lights were partially transparent or had an intensity less than they did when the jet was nearest the ufo. As we drove closer, the lights became more solid and were nothing like a rainbow effect at all. Just as the fighter jet was within hundreds of feet of the ufo, it vanished! The jet hung around for another ten seconds or so before it flew away at high speed again."],"Summary":"Cloudy look w an engineered shape having short chevron lights that hovered and became less transparent as a fighter jet fast approached it.","City":"Allen Park","Disposition":"Unresolved","Country":"United States","Object Features":"Patterned Surface","Date Submitted":"12/24/2012 09:28 UTC","Date of the Event":"12/22/2012 04:00 UTC"}