{"Latitude":"27.29886","Date Submitted":"12/24/2012 11:59 UTC","Source":"MUFON","Region":"Florida","Summary":"Whole bottom white lights triangle, then went level to see red light each end white in center","Object Features":"Patterned Surface, Other","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/44763.html.txt","/var/www/straped/mufon/org/44763.html"],"Country":"United States","Log Number":"US-12242012-0013","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=27.29886,+-82.460506(44763)&iwloc=A&hl=en\"> mufon case (44763) map </A>","Case Number":"44763","Date of the Event":"12/21/2012 10:00 UTC","Object Shape":"Triangle","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","trends":["There have been 39 other sightings in Sarasota","There were no other sightings in Sarasota on or around December 21st 2012"],"divs":["sighting detailsdaughter and i leaving bingo hall she went one way i the other. entered bee ridge road from shopping center and right in front was this triangle of what reminded me of rows and rows of bulb lights in a triangle form. first thought was never saw a plane look like that, trying to watch traffic coming toward me, wondered why it was away from the airport, noticed how low it was, just over the scenery, then it leveled so the bright lights vanished and i could see the side view which was dull lights with red at each end and white lights in the center. then it went out of sight. i called my daughter to see if i was seeing things as i knew she would see it at a different angle or at least see it. she pulled out onto macantosh rd and headed to bee ridge maybe less than a minute behind me. she was not home yet so i left message and she called the next day to say she did not think it was a ufo just a strange looking something, never saw anything that low or lit like it did, no noise as she had her radio off, she also looked on the computer and found nothing like we saw in planes or anything we could identify with. someone stopped into my place of business and we talked about it and she told me about mufon and said others reported seeing ufo in that area of bee ridge and here i am. [name removed\\cms\\tg]"],"City":"Sarasota","Longitude":"-82.460506"}