{"Date Submitted":"12/25/2012 01:11 UTC","divs":["Sighting DetailsWhile driving home northbound on Bechtold Road a red light was noticed initially appearing similar to that of a helicopter landing light. The light was primarily red in color and had a white center. The light traveled at a height of approximately 75-115 feet southbound over the road and continued south parallel to the road. Curious, I stopped the vehicle in the road and stepped out to look up at light as the light did not appear to have any identifying lights such as aircraft navigation or adjacent running lights. An orange glow appeared to the rear of the light as it traveled overhead. I expected to hear an aircraft engine noise from either a general aviation aircraft or helicopter and did not hear any noise whatsoever. Approximately 5 minutes before leaving the previous residence, I noticed the temperature was 8 degrees Fahrenheit. The sky was clear, and there were no clouds or winter weather precipitation present. At the time I thought the light may possibly be that of a paper lantern however, there was no definite shape and the light did not flicker and appeared much brighter than one would expect from a candle. The light travelled overhead southbound, over a grove of bare trees and was witnessed by my passenger (there were two of us) in the vehicle as well. Additionally, an adjacent farmhouse resident stepped out of their front door to investigate why we were stopped in front of their home at this time of night and I am unaware if they observed the light overhead before returning inside. Confused, we turned the vehicle around and drove southbound to attempt to track the light and verify its origin. After reaching the other side of the wooded area which was approximately 300 - 400 feet long, we were unable to visually locate the light in the sky or in the grove of trees."],"City":"Rogers","trends":["There has been one other sighting in Rogers","There were no other sightings in Rogers on or around December 24th 2012"],"Object Shape":"Unknown","Longitude":"-93.604424","Latitude":"45.152706","Case Number":"44767","map":"<A HREF = \"http://maps.google.com/maps?q=45.152706,+-93.604424(44767)&iwloc=A&hl=en\"> mufon case (44767) map </A>","Source":"MUFON","Summary":"While in car northbound on road, red, white and orange light observed over subdivision and traveled southbound along road overhead, crossing road to the southeast over trees before dissapearing","Object Features":"None","Viewing Distance":"101-500 Feet","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Log Number":"US-12252012-0004","Sighting Duration":"00:02:00","Region":"Minnesota","files":["/var/www/straped/mufon/html2text/44767.html.txt","/var/www/straped/mufon/org/44767.html"],"Tags":"City","Date of the Event":"12/24/2012 10:10 UTC","Country":"United States","Disposition":"Unresolved"}