{"Country":"United States","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","Tags":"City","Log Number":"US-12252012-0006","City":"Glendora","trends":["There have been 5 other sightings in Glendora","There were no other sightings in Glendora on or around December 24th 2012"],"Case Number":"44769","Date Submitted":"12/25/2012 02:11 UTC","Object Shape":"Unknown","Disposition":"Unresolved","Summary":"Bright orange red orb over San Gabriel Mountains, Glendora, California, USA.","Object Features":"None","Date of the Event":"12/24/2012 10:40 UTC","Longitude":"-117.859769","Weather Factors":"Unknown","Region":"California","files":["/var/www/straped/mufon/html2text/44769.html.txt","/var/www/straped/mufon/org/44769.html"],"divs":["Sighting Details1. I was on the patio facing north with my father at about 10:40 p.m., December 24, 2012. 2. My dad asked me, \"Is that a jet?\" I looked up and did not think it was a jet. 3. When I first noticed the object, I thought it was the resident helicopter that patrols the foothills. But there was no noise. 4. The object appeared to move toward my location, stop for a few seconds in place, then slowly moved left (west) about two feet in my vision, and then stopped in place. It then moved up slowly and faded out completely. 5. My first thought was it was a helicopter. But the closer it got, and because there was no sound, I felt a little disconcerted. I took out my cell to try and capture it on digital video, but it wouldn't come close to capturing the light, so I put the phone back and just watched and listened. I made a joke to my dad, \"Maybe it's Santa Clause.\" But inside I kept thinking, \"What the hell is that?\" We have jets, air planes and helicopters in my area, but there weren't any out that I saw or heard. Just this strange light. I told my dad I was going to find somewhere on the internet where I could share what we saw. 6. It moved up slowly and its bright orange-red light faded out."],"Latitude":"34.145359","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.145359,+-117.859769(44769)&iwloc=A&hl=en\"> mufon case (44769) map </A>"}