{"Summary":"red round slow move almost complete stop for seconds zig zag like ascending i have two cell phone pictures","Longitude":"-80.219599","Date Submitted":"12/25/2012 01:04 UTC","Latitude":"25.798559","Object Shape":"Circle","Disposition":"Unresolved","Object Flight Path":"Hovering then path,Path with directional change","files":["/var/www/straped/mufon/html2text/44766.html.txt","/var/www/straped/mufon/org/44766.html"],"Object Features":"Unknown","trends":["There have been 97 other sightings in Miami","There were no other sightings in Miami on or around December 24th 2012"],"Region":"Florida","Log Number":"US-12252012-0003","Viewing Distance":"101-500 Feet","City":"Miami","Sighting Duration":"Undisclosed","Case Number":"44766","map":"<A HREF = \"http://maps.google.com/maps?q=25.798559,+-80.219599(44766)&iwloc=A&hl=en\"> mufon case (44766) map </A>","Source":"MUFON","Tags":"City","Weather Factors":"Unknown","Date of the Event":"12/24/2012 10:45 UTC","divs":["Sighting DetailsWas with my brother in-law outside friend's patio. We went to feed her dogs since she is traveling. I got up from the chair and my eyes looked up, I don't know why but not too high up on the sky. I noticed it because it almost seemed still but unusually red, not glowing or sparkling or flickering as airplane looks at night. I thought it was a balloon, or a hot air balloon. It was moving abnormally slowly for any plane or helicopter, almost stopping for seconds, then continuing straight for seconds then started up but almost doing a closed zig zag and up then straight, up a little and straight again for a few more minutes with this strange flying pattern until it was very far and much more higher than when first seen and finally disappearing when it reached some clouds. No sounds or flickering lights as an airplane would.Just red non flickering ball for a moment when closer to us a bit more like a curved cylinder than round. I pointed to my brother in-law who saw it too. I ran inside got my Iphone and took two pictures but in the pictures the object appears bright white and in one when it was more hover than moving it shows round.When it was moving a bit faster, it has a different shape which I did not see with my naked eye. Can't tell what it was, nothing seen before by us . Unusual traveling too swift slow quiet and too close and low for a while to be any airplane. Wired. I would like to send you the two pictures maybe you could tell more with them. But the way I saw it is red orange red in the shape of the first picture. The cell camera capture another shape on my second picture with something else beside it that I didn't see while taking the picture or while I looked with my naked eye. The two pictures are when it was far in the distance and not in front of us because of the time it took me to go inside and into my purse to get my cell and come out.Pointing at it, looking through my camera was bright white, but red with my naked eye."],"Country":"United States"}