{"Region":"New York","files":["/var/www/straped/mufon/html2text/44762.html.txt","/var/www/straped/mufon/org/44762.html"],"Longitude":"-73.055011","divs":["Sighting DetailsI was at shopping center Marshalls getting Christmas gifts, then I exited the shopping center around 5:40 pm. I made a left onto Waverly Ave, that would be going North. As I was driving up Waverly Avenue, I noticed a Glowing orange Orb of Light. This was no plane, or helicopter. I thought it might be a balloon, but it was already dark outside. I knew it was a UFO, because It was emitting a pulse of orange energy. It was traveling at around 90 degrees from the eastern sky about 500 feet, then went in a straight line going west. I did not have a phone to take a picture, but there were other cars that saw the UFO, and also pulled off the road, to get out of their cars, and look at the UFO. I felt amazing, because I feel that I was lucky to have seen one. I always had a feeling they were out there, but I very much feel lucky. I lost sight of the object, because after about 5 minutes, while traveling east, it went past the tree line, so I couldnt see it anymore."],"Object Shape":"Circle, Sphere, Star-like","Case Number":"44762","trends":["There has been one other sighting in Holbrook","There were no other sightings in Holbrook on or around December 23rd 2012"],"Object Features":"None","Log Number":"US-12242012-0012","Disposition":"Unresolved","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Date of the Event":"12/23/2012 05:45 UTC","City":"Holbrook","Date Submitted":"12/24/2012 11:48 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.77075,+-73.055011(44762)&iwloc=A&hl=en\"> mufon case (44762) map </A>","Latitude":"40.77075","Viewing Distance":"101-500 Feet","Country":"United States","Tags":"City","Summary":"I was driving down Waverly Avenue north of Sunrise Highway when I saw a glowing orange orb float from the west, slowly going east.","Source":"MUFON","Sighting Duration":"Undisclosed"}