{"Latitude":"39.308694","Disposition":"Unresolved","Viewing Distance":"20 Feet or Less","Tags":"City","Case Number":"44788","Object Features":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path,Path with directional change","Longitude":"-74.600307","Region":"New Jersey","Summary":"On Atlantic 559 My brother his friend and I witnessed multiple UFO sightings.","Source":"MUFON","trends":["There have been 2 other sightings in Somers Point","There were no other sightings in Somers Point on or around December 25th 2012"],"files":["/var/www/straped/mufon/html2text/44788.html.txt","/var/www/straped/mufon/org/44788.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.308694,+-74.600307(44788)&iwloc=A&hl=en\"> mufon case (44788) map </A>","City":"Somers Point","Country":"United States","Weather Factors":"Unknown","Date of the Event":"12/25/2012 07:15 UTC","Log Number":"US-12252012-0025","Date Submitted":"12/25/2012 09:09 UTC","Object Shape":"Fireball, Sphere, Triangle","divs":["Sighting DetailsComing home from my brother's house in Somers Point, my brother pointed out a couple of \"UFO\"'s. Myself and his friend( who was in the passenger seat, I was in the back driver side) looked to the upper right hand side of the windows and saw to clearly visible sphere like object. At first sight they were about the size of a golf ball and looked as if flaming red,orange,yellow pulsating between the colors. We pulled over onto a side street in a small development. The objects made no sound and hovered straight at a steady speed. These objects were moving faster then jet airplanes as viewed from about the same distance. My brother took out his phone to record the event. At this time the objects were shrinking and then vanished. A man from the house on the corner came out to the street to ask us what we were up to. We told him that a couple of UFO's had just passed. He kind of laughed us off until from the same direction as the first two had appeared, another UFO followed, in the same manner, no sound, steady moving, very strange. I pointed up to the sky as my brother readied his phone. The man gave a quick glance and shrugged it off almost as if he had not seen anything and walked back to his house. While my brother was recording the object on his phone it did not appear to be visible on the screen. Well this was just plane bizarre, thought I. As we were getting back into the car, two more objects had come and gone in the same manner. We continued down the road a few feet and another set came out from the tree lines, same direction, but this time they were lower to the ground, about the size of a baseball now. They once again shrank in size but it seemed as if the prior vessel had veered of the course of the previous ones. Another ship then appeared and it seemed almost directly over our vehicle. From this angle I could almost make out that there was a larger vessel or field surrounding the orbs. We then, being slightly spooked, got into our car and drove away pretty fast. I, being in the rear, maintained visual contact with the object. This one did not follow the path of any of the previous vessels but seemed to follow our direction. As I watched that object I saw out of the corner of my eye another glowing. I at first assumed it to be a street light but on second glance noticed it was a sphere. This one was well below the others. It was about telephone pole height and back off in the distance a bit. This one appeared very strange to me. It was about the size of a basketball now and seemed as if it had a membranous layer or field over it. As the other ship I was originally watching hovered up into the sky and faded out of sight, this ship came straight up over the treeline and followed suite. This is my second positive UFO sighting. I believe in this type of phenomena, but am skeptical about just any strange dot in the sky being a UFO. These objects were very strange and most certainly Unidentifiable."]}