{"Log Number":"DK-12262012-0008","City":"Copenhagen","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering,Other","Region":"Capital Region of Denmark","Longitude":"12.577347","Source":"MUFON","Object Shape":"Oval, Sphere, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=55.684087,+12.577347(44797)&iwloc=A&hl=en\"> mufon case (44797) map </A>","Disposition":"Unresolved","trends":["There have been 3 other sightings in Copenhagen","There were no other sightings in Copenhagen on or around September 15th 1990"],"Country":"Denmark","divs":["sighting detailsi sat on a bench in a backyard and waited for my friend to arrive. because of the street lamp was broken, did i sit and looked at the stars, i did also noticed an airplane flying in a straight line \\ path in the sky .. the reason i saw the plane was because it was the only thing that moved in the sky at this time !! suddenly stopped the \"airplane\" up, and another \"airplane\" appeared right next to the first one. now i knew that this was not an normal airplane, but had to be something else! ( because; an airplane at high speed, can not stop up and hover in a second !!) my friend arrived, and i hastened to point up at the sky, and ask him if he saw the same as me?! these two \"airplanes\" began to fly together in shifts directions (like two flies flying below a lamp in summer time).. to then suddenly stop up, start 'zig-zag', stop up again, then 'zig-zag' again, then to hover absolute still and then they both suddently accelerated from aprox.0-1000 mph in a split second .. my friend, whose name is jan, did also see both these two \"airplanes\" flying patterns and saw also that they, in a split second, flew in a straight line towards the horizon .. - we were both stunned !! (i'm sorry, if not i did get the written words grammar and syllables correctly spelled)(i did use the google translater))!!"],"Date of the Event":"09/15/1990 12:00 UTC","Object Features":"Unknown","Sighting Duration":"Undisclosed","Latitude":"55.684087","Tags":"City","files":["/var/www/straped/mufon/html2text/44797.html.txt","/var/www/straped/mufon/org/44797.html"],"Case Number":"44797","Weather Factors":"Unknown","Summary":"Witness two clear UFOs very unnatural flight patterns!","Date Submitted":"12/26/2012 01:30 UTC","Viewing Distance":"Over One Mile"}