{"Tags":"City","Date Submitted":"12/26/2012 09:55 UTC","trends":["There have been no other sightings in Viola","This sighting has never been favorited."],"Source":"MUFON","Object Features":"Other","Case Number":"44796","Latitude":"35.538407","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Cigar, Oval, Sphere","divs":["sighting detailstraveling on morrison viola road toward viola, tennessee. halfway on the road (about four miles in) observed hovering white light in the sky that appeared brighter than the stars. it was a clear night. there were airplanes in other directions. object hovered while on the complete trip to a house in viola, and once in the town of viola. it was in the distance somewhat over the hills on the warren\\grundy county line approximately toward altamont tn and the savage gulf state natural area though perhaps east of there somewhat. as i got closer to viola i could see the \"edge\" of the object which appeared to be a white elliptical object that could have been the side of a disc or oval. it appeared to be pulsating with different colors, with one bright light radiating through the \"rim\" or middle of the side. it hovered for approximately two hours and thirty minutes. observed from house in viola, tn. after two hours it shifted positions to more prominently over the altamont tn\\savage gulf state natural area direction. it appeared to change shape or \"pulsate\" in visibility. there appeared to be after approximately an hour and ahalf two planes or jets headed toward it with standard blinking red lights."],"Longitude":"-85.859149","Country":"United States","Disposition":"Unresolved","Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","Region":"Tennessee","map":"<A HREF = \"http://maps.google.com/maps?q=35.538407,+-85.859149(44796)&iwloc=A&hl=en\"> mufon case (44796) map </A>","Date of the Event":"12/22/2012 12:00 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/44796.html.txt","/var/www/straped/mufon/org/44796.html"],"City":"Viola","Summary":"Pulsating white object with varying colors in white over Warren County/Grundy County line. Hovered 2 hours, shifted position","Log Number":"US-12262012-0007"}