{"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.378214,+-74.685733(44794)&iwloc=A&hl=en\"> mufon case (44794) map </A>","trends":["There have been 5 other sightings in Port Jervis","There were no other sightings in Port Jervis on or around December 25th 2012"],"Object Flight Path":"Straight-line path","Date Submitted":"12/26/2012 06:54 UTC","divs":["Sighting Detailsthis is the third time i have witnessed these lights the first time i saw this light it looked like a balloon that was on fire this happened in late October 2012 i was in Milford Pa me and my 8 year old son saw what appeared to be an illuminated balloon it made no noise and it just rose straight up slowly until it just disappeared we watched this for about 15 to 20 minutes. the next time i saw it was in mid November 2012. i was alone in port Jervis NY walking to the train station around 10 pm. this time i only saw a red object in the sky floating straight up for about 5 minutes again it just simply disappeared. then on the night of December 25 2012 at around 11 pm me and my wife where on our back porch smoking when she spotted two red lights in the sky one was higher than the other they where diagonal to each other she pointed them out to me and my daughter. they made no noise and flew from west to east staying in formation. I walked down the street to better view them i watched as they flew in a straight line for about 15 minutes once again they just disappeared it was as if the lights just shut off. none of the times that i saw these lights did it seem that they took off they did not fly at great speeds or made any type of strange maneuvers they either flew straight up or straight across. my reaction to these object in every occasion that i saw them was curiosity i dont know what they are and i dont know if i was the only person to see them. please give me some feed back if you know of any other witnesses or if they have a simple explanation. thank you for your time."],"Region":"New York","Object Features":"None","Longitude":"-74.685733","Weather Factors":"Unknown","Summary":"i observed two glowing red orbs from my back porch flying from west to east fo about 15 minutes then just dissapear","Case Number":"44794","Source":"MUFON","City":"Port Jervis","Disposition":"Unresolved","Tags":"City","Log Number":"US-12262012-0005","Latitude":"41.378214","Sighting Duration":"Undisclosed","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/44794.html.txt","/var/www/straped/mufon/org/44794.html"],"Viewing Distance":"Over One Mile","Date of the Event":"12/25/2012 12:00 UTC"}