{"Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=49.474174,+-123.75456(44793)&iwloc=A&hl=en\"> mufon case (44793) map </A>","Disposition":"Unresolved","Source":"MUFON","Sighting Duration":"00:00:02","Tags":"City","Viewing Distance":"21-100 Feet","Summary":"Blueish-white orb streaked across in front of our car but above treeline. Fast, blinked off for half-second.","Case Number":"44793","Weather Factors":"Unknown","Object Shape":"Sphere","City":"Sechelt","Date of the Event":"12/25/2012 09:40 UTC","Country":"Canada","files":["/var/www/straped/mufon/html2text/44793.html.txt","/var/www/straped/mufon/org/44793.html"],"Log Number":"CA-12262012-0004","divs":["Sighting DetailsMe and mother were in our car, she was driving. The orb-like object appeared streaking across the sky from east to west as a blueish-white light. I first thought the object was a shooting star, but it did not leave a trail like a shooting star, and it was raining which reduces the chances of seeing a shooting star drastically, as they would not often go below cloud coverage. The object was moving fast, from east to west (towards ocean) and turned dark for a very short time then lit up again with it still moving on the same path. We were surprised and starting talking about it immediately, making sure the other person had seen it. We both did. The object kept on its path and, although it was a very quick sighting which makes it difficult to remember each detail specifically, it seemed to go dark again or go behind a tree, which made us lose sight of it. We never stopped the car, to see if we could have kept seeing it, and only realized it was not a shooting star after a few seconds after the event."],"trends":["There have been 2 other sightings in Sechelt","There were no other sightings in Sechelt on or around December 25th 2012"],"Longitude":"-123.75456","Latitude":"49.474174","Object Features":"Unknown","Region":"British Columbia","Date Submitted":"12/26/2012 03:07 UTC"}