{"City":"Woodside, Queens","map":"<A HREF = \"http://maps.google.com/maps?q=40.73603,+-73.921282(44799)&iwloc=A&hl=en\"> mufon case (44799) map </A>","trends":["There have been no other sightings in Woodside, Queens","This sighting has been favorited 1 time."],"Latitude":"40.73603","Object Flight Path":"Hovering then path","Date Submitted":"12/26/2012 03:53 UTC","Viewing Distance":"101-500 Feet","Object Shape":"Disc, Fireball, Flash, Oval","Disposition":"Unresolved","Country":"United States","Source":"MUFON","Sighting Duration":"Undisclosed","divs":["Sighting DetailsAt 6:30am I awoke and suddenly I looked out the window while lying in bed to observed a pulsating light outside. There was a small star and ajascent to the star was this extremely bright light. When I approached to take a closer look the light would expand and contract. All of a sudden the object came into focus and it was large with an opaque silver plated top and a reddish orange bottom, it had a winged tip with pulsating lights. It pretty much glowed all over and it seemed to be radiating this glow from the inside out. It disappeared and appeared one more time. It hovered over the rooftop of some buildings across the street from me. I was in shock and was so curious super excited. I could have gone to get my cell phone to take a picture or even film it, but I was affraid I would lose it from sight. Slowly it started moving without any sound! It made a sharp left and slowly started elevating untill it went around the corner and out of sight. This object was very long and it had a strip of distinctive lights in the center. The bottom was pulsating and glowing in a red color."],"Log Number":"US-12262012-0010","Object Features":"Patterned Surface, Other","Longitude":"-73.921282","Tags":"City","Summary":"At 6:30am observed pulsating light outside window. When I approached to take a closer look the light would expand and contract. All of a sudden the object came into focus and it was large with a opaque silver plated top and a reddish orange bottom.","files":["/var/www/straped/mufon/html2text/44799.html.txt","/var/www/straped/mufon/org/44799.html"],"Region":"New York","Date of the Event":"12/26/2012 06:30 UTC","Case Number":"44799","Weather Factors":"Unknown"}