{"Latitude":"40.635525","Log Number":"US-12272012-0001","Sighting Duration":"Undisclosed","City":"Undisclosed","Country":"United States","Summary":"Blue Laser-Like Ring Hovers, Ascends, then Descends to Ground","divs":["Sighting DetailsI was watching television with a friend in my basement in the moments directly before the event occurred. It was roughly 8:45 pm on December 26. It was very dark outside. I noticed something bright in the corner of my eye, so I turned my head to look out the window. I then spotted the UFO. It looked like a blue laser in the shape of a ring. Because it was dark, I could not see anything else on the UFO. I could, however, make out that it was disk shaped, and that the ring was the exterior rim of the UFO. The laser-like light was unchanging in brightness and was one closed ring, not a set of lights. It was roughly the size of a dinner-plate. It did not appear to be spinning, but the closed-ring, static brightness of the light could have been the cause of that. It appeared to be hovering over the backyard of our neighbor's house, or perhaps the house next to that. I immediately ran to the window. My friend followed me to the window out of curiosity. Upon arriving at the window she too noticed the UFO. The object, which was originally hovering two-and-a-half stories high, started to ascend in a perfectly straight line (as linear as the path of an elevator). This looked unnatural because the object was small and there was a modest breeze outside. The object did not appear to waver, tilt, or move horizontally at all. It had almost perfect acceleration, increasing speed at a very constant and calculated pace. It honestly seemed to be the ideal and theoretical situation that you might find in a physics book. Which is actually quite unnatural, given the fact that a perfect theoretical situation doesn't exist due to the presence of other forces. The object ascended to above the treeline, about five stories high, then immediately started a perfect deceleration. As soon as the object came to rest, it began a perfect acceleration downward. After the object had descended about half-way, it then ascended again to the same height. It then descended all the way to what appeared to be a landing. After the UFO had landed, I immediately ran outside. The UFO was nowhere to be seen. After looking for about a minute, I went back downstairs to my basement and looked out the window. I then saw the UFO once again, but this time hovering only a-story-and-a-half high. It moved up and down with no set path, changing direction about five times but never displacing itself more than a foot from it's original position, before landing once again. I again ran outside, this time searching more carefully. I went behind my garage where I could see my neighbor's backyard more clearly. There was no person to be seen, and no footprints (there was snow on the ground.) There was also no sign of the UFO. No tracks, nothing. --- I was somewhat worried about the incident, so I tried to determine if the UFO had been a toy, since it was about the size of a flying saucer toy you might find in the store. Children do in fact live two houses away from me in the direction of the sighting. I am skeptical that it was a toy, however, because of its perfect acceleration, its perfectly vertical path, its blue lasers (which are often not sold commercially due to their strength), its height (five stories high) and the absence of any person nearby. I searched many different UFO toys online, but nothing matched what I seen perfectly. The closest thing I could find, honestly, was not a toy, but the objects described in MUFON cases 23705-23707, although I did not see a red light, and the blue ring appeared to be darker, much like, as I said before, a laser. I was actually doubting myself due to the fact that I could neither find the UFO, its tracks, or the tracks of any human being. But there was in fact another witness to verify the sighting. I'm not sure about what I saw, but something about it didn't seem natural."],"Object Flight Path":"Straight-line path","Object Shape":"Disc","Date of the Event":"12/26/2012 08:45 UTC","Case Number":"44807","files":["/var/www/straped/mufon/html2text/44807.html.txt","/var/www/straped/mufon/org/44807.html"],"Longitude":"-89.391138","Disposition":"Unresolved","Source":"MUFON","Viewing Distance":"20 Feet or Less, 21-100 Feet","Tags":"City","Region":"Illinois","Object Features":"None","Weather Factors":"Unknown","Date Submitted":"12/27/2012 02:43 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.635525,+-89.391138(44807)&iwloc=A&hl=en\"> mufon case (44807) map </A>","trends":[]}