{"Object Flight Path":"Stationary","Object Shape":"Disc, Other","City":"Chester Springs","Source":"MUFON","Weather Factors":"Unknown","Disposition":"Unresolved","Country":"United States","trends":["There have been 3 other sightings in Chester Springs","There were no other sightings in Chester Springs on or around December 25th 2012"],"Longitude":"-75.610522","Region":"Pennsylvania","Summary":"Christmas Day UFOs in Chester County, PA","Log Number":"US-12262012-0015","files":["/var/www/straped/mufon/html2text/44804.html.txt","/var/www/straped/mufon/org/44804.html"],"Object Features":"Unknown","Latitude":"40.10491","Date of the Event":"12/25/2012 12:00 UTC","Viewing Distance":"Unknown","divs":["sighting detailschristmas day, 2012. we took the kids out to ride their new power wheel and i noticed a black spot in the sky that wasn't doing much of anything - just hovering. i pointed it out to my husband and my mother and we couldn't figure out what it could be. after about a 1\\2 hour, we went back inside. every few minutes, we'd peek outside to see if it was still there - and it was. then our power randomly went out for a minute max - no storms, no wind, nothing else going on to cause a power outage. then as we were looking out the window checking on the black object again, my mom noticed flashing lights in the sky below. we immediately went out onto the deck and began filming. the lights appeared to be flashing randomly (or perhaps the object was spinning?) and it was mostly horizontal. however, there were times where the lights tilted and then went into a vertical pattern. the lights were hovering right behind some low lying clouds. eventually, more clouds came in and we lost sight of both images. since then, the weather has deteriorated and we have not seen anything else. the black object caught my eye - since we have large birds and planes flying overhead all the time, but this didn't do anything...for 2 hours. but when we saw the lights - my heart was racing and we couldn't believe what we were seeing."],"Date Submitted":"12/26/2012 08:22 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.10491,+-75.610522(44804)&iwloc=A&hl=en\"> mufon case (44804) map </A>","Tags":"City","Sighting Duration":"Undisclosed","Case Number":"44804"}