{"City":"Pollock Pines","files":["/var/www/straped/mufon/html2text/44819.html.txt","/var/www/straped/mufon/org/44819.html"],"Object Features":"None","Tags":"City","Date Submitted":"12/28/2012 02:32 UTC","Latitude":"38.767392","divs":["Sighting DetailsMy family including mother,Father little sister and I were camping about a week before summer vacation was over, something we did quite a few times when I was young. This time though an object which we though was a meteor but my dad who was ex military said was no meteor, came from straight above us from a northeasterly at a high rate of speed, 17,- 20,000 mph range, and at well over 50,000 feet altitude leaving behind it a trail of fire, it then turned south, then all of a sudden turned and went straight into the hillside about 800 feet from our position, we all jumped up because it was astonishing to all of us including my dad, we sat and watched in the darkness the location the object hit, within a few moment, there was a glow of fire coming out of the brush, my dad said, he did not like it,gave the order and we packed up everything and dowsed the remaining campfire coals with dirt and water, and got the heck out of there. we realized all the other campers were doing the same thing at the same time, many had seen the event apperently and wanted to get out as fast as possible, but we did not get more than 1 mile down the road when we were stopped by local sherrifs department officers along with everyone on the highway, they were doing car to car checks for someone or something, then we say miles of duece and halfs trucks comeing from McClellan afb going past us to the location of the crash, my father asked the sherrifs what had happened and the sherriffs told him a military satallite had crashed and they were going to retrieve it. We sat there while the police checked every vehicle then let us all go home, in the interim we could see the fire which had now grown to several acres and was withing 100 feet of the highway, so we all wanted to get going, after we were driving down the road, my dad made the comment, that it was no sattelite because satellites dont make 45 degree angle turns while crashing through the atmosphere at that speed,without making a sound and thought it must have been a top secret military aircraft instead. As we now know looking back the miltary does not have nor did have aircraft that went that speed at that time, speeds approximating that of the space shuttle on re entry and landing. Oh and one more thing to add, my dad and I are in the aerospace Industry, we know all about military aircraft and spacecraft. This thing was not like anything I have ever seen."],"Weather Factors":"Unknown","Date of the Event":"09/27/1973 10:45 UTC","Log Number":"US-12282012-0001","Object Flight Path":"Path with directional change","Region":"California","Source":"MUFON","Summary":"family were camping, object came out of sky from straight above, made two turns then crashed causing forest fire.","Object Shape":"Fireball","trends":["There have been 3 other sightings in Pollock Pines","There were no other sightings in Pollock Pines on or around September 27th 1973"],"Longitude":"-120.581234","Disposition":"Unresolved","Sighting Duration":"12:00:00","map":"<A HREF = \"http://maps.google.com/maps?q=38.767392,+-120.581234(44819)&iwloc=A&hl=en\"> mufon case (44819) map </A>","Case Number":"44819","Country":"United States","Viewing Distance":"501 Feet - 1 Mile"}