{"Object Features":"Other","Sighting Duration":"Undisclosed","Date Submitted":"12/27/2012 10:02 UTC","Longitude":"-83.414652","Log Number":"US-12272012-0005","Summary":"What appeared to be a search light (four beams) appeared in sky and merged into one pulsating light.","Country":"United States","Disposition":"Unresolved","Date of the Event":"12/26/2012 07:12 UTC","Source":"MUFON","Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","City":"Westland","Object Shape":"Cylinder, Oval","Case Number":"44811","Region":"Michigan","map":"<A HREF = \"http://maps.google.com/maps?q=42.348164,+-83.414652(44811)&iwloc=A&hl=en\"> mufon case (44811) map </A>","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/44811.html.txt","/var/www/straped/mufon/org/44811.html"],"divs":["Sighting DetailsOn December 26, 2012 around 7:10 a.m. I was getting into my car and I looked up at the sky and noticed lights that appeared to be search lights. If you can picture a picture frame with the four points, this is how the lights with light beam like tails were positioned. The lights would cross each other very rapidly and then would all of a sudden merge into one dazzling light and then would separate only to repeat this sequence at least ten times. The longer I looked the more frightened I became because it seemed that I was being watched. I was actually afraid to proceed on to work. As I got into my car and started to drive to work, all of a sudden the light seemed to have descended and started to follow me as I proceeded to work for about 30 seconds and then disappeared. By this time the beam seemed to have changed into just a solid oval light with no beam attached to it. On December 27th as I was getting into my car I didn't notice anything. I reported the incident to the Westland Police Department. They said no one had reported anything unusual. Of course this was with a little chuckle. I was not surprised. This is my third experience with a UFO. About two years ago I was in the parking lot of a resale shop and I noticed a series of round-shaped lights before I got to the store's parking light. When I finally got the nerve to get out of the car, the lights were above me (pretty high in the sky) and it turned into a series of fluttering, twirling lights of colors (white, yellow and a dull pink)that moved in all directions. I watched this for about two minutes until two other customers walked up and I asked them if they saw what I was looking at. They were also in amazement and watched for about another two minutes. We finally all went into the store. When I came out the lights were gone. One other time (about four years ago) as I was on my way to a friend's house I noticed the same pattern of lights (about four) to the left of me as I was driving along the service drive. When I arrived at the house, the lights moved above the car I would say about 200-300 feet. I was afraid to get out of the car, so I called my friend on the cell phone and asked him to come outside. He came out and witnessed the light that had the same pattern as the one I saw in the parking lot at the resale shop. There was no sound coming from those lights either. I saw no aircraft nor shape of an object, so I don't know what it was."],"Latitude":"42.348164","trends":["There have been 17 other sightings in Westland","There were no other sightings in Westland on or around December 26th 2012"]}