{"Source":"MUFON","Longitude":"-78.960758","Date Submitted":"12/28/2012 07:10 UTC","trends":["There have been 3 other sightings in Whitby","There were no other sightings in Whitby on or around December 18th 2012"],"Region":"Ontario","files":["/var/www/straped/mufon/html2text/44829.html.txt","/var/www/straped/mufon/org/44829.html"],"Sighting Duration":"Undisclosed","Tags":"City","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Viewing Distance":"101-500 Feet","Country":"Canada","map":"<A HREF = \"http://maps.google.com/maps?q=43.957049,+-78.960758(44829)&iwloc=A&hl=en\"> mufon case (44829) map </A>","Disposition":"Unresolved","Object Features":"Wings","Latitude":"43.957049","Object Shape":"Other","Log Number":"CA-12282012-0011","Weather Factors":"Unknown","Case Number":"44829","divs":["Sighting DetailsTravelling west on Conlin Road toward Thickson Road, Brooklin object appeared to be descending at a very high rate. It passed in front of us approximately 500 feet flying from the North to the South. After crossing Conlin the craft banked and turned to the south west crossing Thickson Road at the same rate of descent and appeared if an airplane would have crashed into a horse pasture to the south. The object stopped descending hovered over a stand of trees south of Conlin, and to descend into the stand of trees and within the next few seconds ascended from the stand of trees vertically and continued to travel to the southwest at tree level where it appeared to disappear. This craft we thought initially was a military plane akin to C-130 though it was much thinner and longer then this type of aircraft. It was also peculiar in that it had no markings, no windows or lighted becons. It became further clear that it was not a conventional aircraft when it made the banking turn to the south west. At that time it clearly had small semi circular wings attached at the base of the aircraft and had no visible engines on the wings. It was very clear we saw something that was not identifiable as a known aircraft. We were mystified and did not know what to think. We where totally mesmerized by it and have spent hours looking at pictures of aircraft attempting to identify it without success. My husband who was with me is an Airport designer and very familiar with aircraft silhouettes and has never seen anything like it. This aircraft passed right in front of us,initially we thought it was a plane crashing because of it's rapid loss of altitude. Are inability to explain this event otherwise motivated us to contact Mufon. There were two of us that witnessed this, however there was light traffic in the area that could have witnessed this. What was extremely strange was there were long tubular elements one on each side of the craft."],"Summary":"airplane like without airplain like no engines with two small circular wings, no windows dark grey color, no becons one long tube like element on each side, no landing gear","City":"Whitby","Date of the Event":"12/18/2012 02:45 UTC"}