{"files":["/var/www/straped/mufon/html2text/44824.html.txt","/var/www/straped/mufon/org/44824.html"],"Summary":"Witnessed 3 objects, where one moved horizontal and vertical with lights and a fire like emission.","Case Number":"44824","Tags":"City","Object Shape":"Unknown","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Date of the Event":"12/27/2012 06:50 UTC","Log Number":"US-12282012-0006","Viewing Distance":"Over One Mile","Object Features":"Unknown","Object Flight Path":"Path with directional change","Source":"MUFON","Region":"California","Longitude":"-117.129417","Latitude":"32.745648","Country":"United States","Date Submitted":"12/28/2012 12:55 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.745648,+-117.129417(44824)&iwloc=A&hl=en\"> mufon case (44824) map </A>","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around December 27th 2012"],"divs":["sighting detailswhile driving home from work and merging from the 15n to the 94e, i noticed what looked to be a plane on fire or a very large star or other object moving at a slight vertical incline headed east. it then changed directions headed west horizontally then dropped like a plane in distress all the time with a very large trail of flames. after dropping at a rapid pace, it then again changed direction shooting straight up with the flame trail and reached an altitude and then turned off the flame. there was also two other objects that i can only assume we're like planes or helicopter that were with this object the whole time. it was almost like they were playing chase with each other. it's hard to explain how large the object must have been as i was miles away and the flame being emitted was very large to where i could not miss it in the sky when i looked over my shoulder to look for on coming traffic while merging on to the 94e. this lasted about a minute or so. as i was headed east, away from the activity, i continued to watch to only see objects with green\\blue and red lights in the same area flying around."],"City":"San Diego"}