{"Summary":"Unusual object over Albuquerque, NM that sped away at incredible speed","Latitude":"35.086321","Region":"New Mexico","Object Flight Path":"Hovering then path","Disposition":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/4482.html.txt","/var/www/straped/mufon/org/4482.html"],"divs":["sighting detailsat 1:12 pm, february 24, 2006, an unidentified flying object was sighted over the city of albuquerque. the object was seen from a vehicle traveling southbound on yale. the object appeared to be disk shaped and light colored\\semi-reflective (white\\light silver). i am a pilot so i know and recognize most types of aircraft. this object appeared to be 1\\4 mile north of my position and approximately 750-1,000 feet in elevation. at that distance, it appeared to be slightly larger than an f-15 (which we commonly see here). the object, i believed was going to approach our location as the airport was nearby. i was very curious to see the object closer so i could identify it as it was very strange looking. however, the object didn't appear to be moving in our direction. possibly moving slowly and laterally. after about 15 seconds, it began to travel away from us (north) at an incredible speed. it became a distant point before disappearing out of sight after about 7 seconds. i was in the back of a car watching this object. i first noticed it when looking out the back window and it caught my eye. i turned around and focused directly on it as i had no idea what it was and wanted to see what it was going to do. i did not get the attention of the driver as it would require her to completly turn around which was impossible as she was driving a vehicle. the front passenger would not have seen it well, if at all, because she would need to have been in the back seat to be oriented well enough to see the object out the back window. additionally, i did not want to take my eyes off the object to get another person's attention. weather conditions were calm and clear. no other air traffic was in the immediate area."],"Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"00:00:20","Object Features":"None","Date of the Event":"02/24/2006 01:12 UTC","Case Number":"4482","trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around February 24th 2006"],"Weather Factors":"None","Country":"United States","Object Shape":"Disc, Oval","map":"<A HREF = \"http://maps.google.com/maps?q=35.086321,+-106.645227(4482)&iwloc=A&hl=en\"> mufon case (4482) map </A>","Source":"MUFON","Log Number":"US-02252006-0003","Date Submitted":"02/24/2006 01:12 UTC","Longitude":"-106.645227","City":"Albuquerque"}