{"Country":"United States","Object Shape":"Bullet, Missile","trends":["There have been 2 other sightings in Shingle Springs","There were no other sightings in Shingle Springs on or around August 16th 1978"],"Date Submitted":"12/28/2012 03:18 UTC","Longitude":"-120.927952","Case Number":"44822","Region":"California","City":"Shingle Springs","Object Features":"None","Disposition":"Unresolved","Date of the Event":"08/16/1978 09:00 UTC","Object Flight Path":"Straight-line path","Sighting Duration":"00:00:42","Latitude":"38.672649","files":["/var/www/straped/mufon/html2text/44822.html.txt","/var/www/straped/mufon/org/44822.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.672649,+-120.927952(44822)&iwloc=A&hl=en\"> mufon case (44822) map </A>","divs":["Sighting DetailsMy younger sister and nephew came in our house from lying on the deck outside really upset, my nephew was young about 4 or 5 years old, he was crying and hystarical, my younger sister who was about 8 years old was excited but not hysterical,she explained that they has seen something in the sky, after we got my nephew calmed down, we tried to get a coherant answer but neither one could give a cognazant answer to what they had seen. I did not beleive them and thought they were making it up for attention so I told them I would sleep out on the deck the next night also to see if i could see it with them and explain what it was. The next night the three of us were laying on the deck in our sleeping bags, with my elder sister hovering over my nephew who was scared to be outside again and was trying to reassure him that it would be ok. there was not wind and it was a nice summer night. we were all talking and making jokes about nonsense, when this large object that was roughly shaped like a bullet went over our house,the three of us all saw it at the same time, and sat up making comments as to the fact of what we just witnessed, i watched as it flew over, it was moving about 200 mph and just about the top of the pine tree's which were about 80 feet tall so I would say between 150 to 300 feet altitude above ground level, it struck me quickly that there was no sound from it and I was just stunned, my eldest sister who was hover over my nephew was knocked over because of the force of him sitting up, while she was recovering her balance the object flew away, we were all talking to her at once, she said (what) I did not see it, wehre was it and thought we were joking, now we were all freaked out and I decided I was going in the house, the other three followed me down the stairs from the deck and into the house quickly. When I aksed the other two what they saw, they both reported totally different things that what I saw and also what each other saw, to this day we don't agree on what it was we saw. we just know we saw something."],"Tags":"City","Weather Factors":"Unknown","Source":"MUFON","Log Number":"US-12282012-0004","Viewing Distance":"101-500 Feet","Summary":"dark object that seemed to absorb light passed overhead close"}