{"Source":"MUFON","Viewing Distance":"Over One Mile","Country":"United States","Date Submitted":"02/23/2006 10:00 UTC","Region":"Michigan","Disposition":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-83.677393","Object Flight Path":"Stationary","Object Shape":"Star-like","Log Number":"US-02252006-0004","Object Features":"None","divs":["sighting detailsit was ten pm, and i was taking my trash out to the curb. i stopped to look up at the stars which were very bright that night. there were no clouds in the sky and it was very dark out, making the stars really stick out. i didn't take notice right away, because i was looking at all the stars. then i saw it in the northwest, and it looked like three stars that made up a diagonal line. i stared at it, trying to figure out what it was, and then as quick as you could blink your eye, the shape changed to a diamond shape, made of 4 star-like objects. it stayed that way for 2-3 seconds, then it changed again. the last shape it took almost reminded me of a wrist, with three fingers. it stayed in one general area of the sky. i am not sure how many star-like objects made up the last shape, but know it must have been at least 9 of them to make this shape. it went back to the diagonal shape, then the diamond shape, then this shape a few times, and was still changing when i went back into the house. \\ --- -- \\ something similiar to that. i did not see it changing---it just changed. there were no trails, or any evidence at all of it's previous shape. it was almost like lights that turned off and on to make shapes, but they didn't look like lights. they looked just like stars. i know stars don't act like this, so i knew it had to be something else. it was cold and windy that night, and i was cold, so i hurried back into the house. the star-like objects were still changing shape when i went back in the house at 10:10 pm. i did not take photos because my camera doesn't take good photos of stars. i've tried many times before to photograph the moon and stars, but they don't show up well, so i didn't even attempt to get my camera."],"Latitude":"41.507426","files":["/var/www/straped/mufon/html2text/4483.html.txt","/var/www/straped/mufon/org/4483.html"],"trends":["There have been 3 other sightings in Toledo, Ohio","There were no other sightings in Toledo, Ohio on or around February 23rd 2006","This sighting has never been favorited.",""],"Tags":"City","Case Number":"4483","Date of the Event":"02/23/2006 10:00 UTC","Weather Factors":"Unknown","City":"Toledo, Ohio","Summary":"several star-like objects changing shape","map":"<A HREF = \"http://maps.google.com/maps?q=41.507426,+-83.677393(4483)&iwloc=A&hl=en\"> mufon case (4483) map </A>"}