{"Weather Factors":"Unknown","Summary":"appeared bright red orb. moved, hovered then vanished. did not appear flashing color to naked eye, however in video appears to be flashing red and gold.","Date of the Event":"12/28/2012 10:44 UTC","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around December 28th 2012"],"Longitude":"-73.964209","Country":"United States","Date Submitted":"12/29/2012 03:31 UTC","Latitude":"40.769558","Tags":"City","Object Flight Path":"Path then hovering","files":["/var/www/straped/mufon/html2text/44835.html.txt","/var/www/straped/mufon/org/44835.html"],"Source":"MUFON","Log Number":"US-12292012-0002","Sighting Duration":"Undisclosed","Region":"New York","City":"New York","map":"<A HREF = \"http://maps.google.com/maps?q=40.769558,+-73.964209(44835)&iwloc=A&hl=en\"> mufon case (44835) map </A>","divs":["sighting detailsi was at home on the phone with my boyfriend. i looked out the window and noticed a bright, red, glowing orb heading towards me. i immediately told him i was seeing a ufo. he didn't believe me and told me to film it. i went to film it on my phone and could not do so while a call was in progress. in my excitement i didn't explain this to him and just hung up and started to record it. he called me back 14 seconds into the recording, so it was automatically stopped. i could still see the orb. it came to a stop and was hovering, i could hear no sounds. i told him i'd call him back, but by the time i looked down at my phone and back up, probably 5 seconds, the orb had vanished. i can not really judge distances. i can however, being a new yorker, say that it appeared to be visible to me around 85\\86th streets between 3rd and lexington avenues and was last spotted at about 89th and 3rd. i live on 91st street between 3rd and lexington avenues. i based these observations on the buildings the orb was near. it seemed the orb moved in a slanted line, from sw (85\\86th and lexington) to ne (88th and 3rd). my feelings were that of excitement and awe, but also disappointment that my video was cut short. i wish i could've gotten a better, longer video. i also took a video of a plane passing through after, to compare what both objects looked like. i do remember seeing 2 or 3 planes passing while the event was taking place, though they were no where near the orb and much, much higher in altitude."],"Case Number":"44835","Object Shape":"Sphere","Object Features":"Unknown"}