{"Weather Factors":"Unknown","Case Number":"44830","Log Number":"US-12282012-0012","divs":["sighting detailstwo reportings of same object. december 20, 2012, 6pm. driving south on davis from north tarrant parkway in north richland hills. a plane is flying in same direction on east side of davis. i look ahead and see a multi-colored sparkling object. it looked like a giant fireworks sparkler. it was flying somewhat low following the outline of the hills flying in a southerly direction. i took it for a helicopter at first except that it looked like a sparkler with all the lights. it took off at a high rate of speed as it reached davis near 820 and shot off south. december 22, 2012, 10:25pm my husband and i are traveling north on 121 toward the 121\\820\\183 split in hurst, texas, exiting north onto the davis exit. i see what looks like a helicopter sized object, and i initially thought it was a helicopter, until it flashed white forming a saucer shape, immediately went to a multi-colored sparkler of indeterminate shape, then white sparkles and it disappeared. this all happened very quickly. i took it for a helicopter because it was the size of a helicopter, but seemed to have more extra flashing lights then the ones normally seen around here so i watched it. it was flying just north of the highway split, flying east along 183 and disappeared."],"Tags":"City","Object Features":"Patterned Surface, Other","City":"North Richland Hills","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Country":"United States","Latitude":"32.833174","Summary":"I saw this on Dec 20, 2012 also. It looked like a helicopter, flashed white, sparkled multicolor, went to white and disappeared.","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=32.833174,+-97.20157(44830)&iwloc=A&hl=en\"> mufon case (44830) map </A>","Longitude":"-97.20157","Date of the Event":"12/22/2012 10:25 UTC","Date Submitted":"12/28/2012 08:41 UTC","Object Flight Path":"Straight-line path","trends":["There have been 5 other sightings in North Richland Hills","There were no other sightings in North Richland Hills on or around December 22nd 2012"],"Source":"MUFON","Region":"Texas","Object Shape":"Disc, Oval","files":["/var/www/straped/mufon/html2text/44830.html.txt","/var/www/straped/mufon/org/44830.html"]}