{"Sighting Duration":"Undisclosed","Object Flight Path":"Other","Viewing Distance":"Over One Mile","divs":["Sighting DetailsBetween 3am-4am on dec 21, 2012 i woke up and realized my house had no powder due to a storm so because i could not go back to sleep right away i sat in my living room in a chair facing my window and was talking to my mother when all of a sudden there was this flash of lime green light that came threw the window and lit up my livingroom wall. It was so bright my mom and i thought that someone was outback and flashing a light so we went to the window and seen nothing but darkness we could not find out what it was and were so amazed that we stood at the window and about 8 minutes late we seen over the mountain another flash a lime green light witch was mile and miles away it just appeared from behind the mountain and it shocked us as we did not know what we were looking at the light stayed for only a couple of seconds and so we watched hoping to see it again and this time after 10 minutes we seen it in the exact same spot again after that my mom said we should try and record it but we stood and didnt see it again and after that we just sat there trying to find out what we just seen....we could not come up with any idea of what it was."],"Region":"Pennsylvania","Summary":"not ufo i think.","Log Number":"US-12292012-0013","Weather Factors":"Unknown","Disposition":"Unresolved","Case Number":"44846","Longitude":"-75.872858","Date Submitted":"12/29/2012 11:15 UTC","Date of the Event":"12/21/2012 03:15 UTC","trends":["There have been 14 other sightings in Wilkes-Barre","There were no other sightings in Wilkes-Barre on or around December 21st 2012"],"Source":"MUFON","Object Shape":"Circle, Flash","Object Features":"None","Latitude":"41.247135","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.247135,+-75.872858(44846)&iwloc=A&hl=en\"> mufon case (44846) map </A>","City":"Wilkes-Barre","files":["/var/www/straped/mufon/html2text/44846.html.txt","/var/www/straped/mufon/org/44846.html"],"Country":"United States"}