{"Sighting Duration":"Undisclosed","Log Number":"US-12292012-0012","Disposition":"Unresolved","City":"Albany","divs":["Sighting DetailsIt was very late. My wife was driving and I was in the passenger side of car. We had arrived at Albany airport at 11:20 or so (Dec. 28)from a long day of traveling. A few minutes after midnight, (now Dec.29)I saw an craft fairly close and under the low cloud cover. At first, I just assumed it was a low flying plane. But, upon inspection, I noticed it was barely moving. So, I began to look at it very closely and at the same time tell my wife my observations. We were traveling south-bound on the NYS thruway. Around mile marker 140 or so. (By the time I thought of mile markers we were at 133, but that was a good 5 minutes or so after the sightings) I was in the passenger side of the car looking at the western skyline. The object was directly to my right, and either hovering or moving very, very slowly in a northerly direction. We had a very low cloud cover and this object could be seen very clearly below the clouds. It was close enough that I could see the actual structure of the craft, along with its very bright lights. It was a very large triangle shape, with very bright white lights at each point of the triangle, with a smaller blue-white light at its center periodically, and a very bright red light at the rear, just behind and between two of the bright white lights. It did have some type of strobe like effect at some points, going through the center, from it's front white light through its center to the red light at its rear. As we were driving it began to get out of sight and I was telling my wife how excited I was to have finally seen a REAL UFO, which was very obviously not a conventional aircraft. Then, just as the craft was getting out of site I noticed, even a bit closer to the car, another one! This one appeared to be moving very slowly, going in the same direction as the first. But, even though it was closer to the car (meaning more directly overhead) it was more difficult to see details, being just barely in the clouds, so I couldn't make out the actual structure of this craft. But, it was the same general size as the first, and the light patterns were identical. I just turned my body and kept looking out the back window of the car, watching until it was out of sight. I was very excited to have seen them, but being late and both of us being tired from traveling all day, we didn't try to pull over or try to find an exit to follow. I tried to get a photo with my cell phone, but by the time I got it out and ready, the craft was way too far away to even bother! I have made some simple sketches though."],"Latitude":"42.653889","Object Features":"Unknown","Country":"United States","Date of the Event":"12/28/2012 12:00 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.653889,+-73.748432(44845)&iwloc=A&hl=en\"> mufon case (44845) map </A>","Summary":"Large triangular shaped structure with bright lights, hovering and/or moving very slowly northward.","Source":"MUFON","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Hovering then path","trends":["There have been 19 other sightings in Albany","There were no other sightings in Albany on or around December 28th 2012"],"Region":"New York","Case Number":"44845","Longitude":"-73.748432","Object Shape":"Triangle","Date Submitted":"12/29/2012 10:52 UTC","files":["/var/www/straped/mufon/html2text/44845.html.txt","/var/www/straped/mufon/org/44845.html"]}