{"Date Submitted":"12/30/2012 03:23 UTC","trends":["There have been 2 other sightings in Matthews","There were no other sightings in Matthews on or around December 25th 2012"],"Object Features":"Unknown","Tags":"City","Longitude":"-80.625436","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Date of the Event":"12/25/2012 09:30 UTC","files":["/var/www/straped/mufon/html2text/44853.html.txt","/var/www/straped/mufon/org/44853.html"],"Object Shape":"Sphere","Summary":"I saw 4 orangeish orbs going in a straight line across the sky.","Source":"MUFON","Region":"North Carolina","Case Number":"44853","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.123755,+-80.625436(44853)&iwloc=A&hl=en\"> mufon case (44853) map </A>","divs":["Sighting Detailswe all were at my parents house for Christmas dinner and my niece went outside to the back porch and returned inside yelling for my father to come outside i went out first with him following. what i say when i went out the back door was two objects that were in formation floating in a west direction others took my attention to another orange colored object moving faster and much ahead of the two slower moving objects so returned my attention back to the two objects. i keep trying calm everyone down as they asked what it was. i at first believed it to be a government drone with orange lights to distinct them from anything else, but they were so low to ground. i keep telling everyone to calm down and be quit because, i just want to listen and see if i could hear a motor.as soon as i stepped out the door everything slowed down, it was exciting and frightening at the same time i just wanted to justify what i was looking at as i listened harder and harder and focused as they moved harmonically across the sky it was apparently to all of us these were making no noise at all. further confusing everyone with what they saw. i have many ideas for what i saw that night but nothing still makes any since we all need help understanding what happen."],"Latitude":"35.123755","Log Number":"US-12302012-0007","Viewing Distance":"21-100 Feet","Country":"United States","Sighting Duration":"Undisclosed","City":"Matthews"}