{"Source":"MUFON","Date Submitted":"02/25/2006 02:50 UTC","Latitude":"34.053724","map":"<A HREF = \"http://maps.google.com/maps?q=34.053724,+-118.238945(4485)&iwloc=A&hl=en\"> mufon case (4485) map </A>","Region":"California","Log Number":"US-02252006-0006","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around February 25th 2006"],"Object Features":"Unknown","Country":"United States","Disposition":"Unknown","divs":["sighting detailsi was lying on my back in my backyard with sunglasses on. it was partly cloudy. i was looking directly up in the sky and i noticed a round object moving slowly from south to north. it was a glowing red sphere approx 1\\8\" between my thumb and forefinger. it moved, slowed briefly, paused, began moving again and then disappeared. i continued looking in the sky and it reppeared about 10 seconds later, however it had changed its direction completely moving from east to west. it was still glowing a bright red and may have been pulsing. as it moved it turned a brilliant white and then disappeared after a couple of seconds. if it were on land you could say it was traveling about 1-2 miles per hour. at first, i thought it might be a balloon because it was spherical in shape and moved kind of lazily across the sky. i changed my mind the second time i saw it when it took a path totally perpendicular to its original path. also, the second time i saw it it turned to a bright white, which i decided a balloon couldn't manage. i called to my father-in-law who was inside the house to come out and look. we both looked up in the sky for about 10 more minutes, but never saw it again."],"Viewing Distance":"Unknown","Case Number":"4485","Longitude":"-118.238945","Object Flight Path":"Path with directional change,Path then hovering","Sighting Duration":"00:00:30","files":["/var/www/straped/mufon/html2text/4485.html.txt","/var/www/straped/mufon/org/4485.html"],"Object Shape":"Sphere","City":"Los Angeles","Summary":"Glowing red sphere moving slowly in the sky, disappearing and changing direction","Tags":"City","Weather Factors":"None","Date of the Event":"02/25/2006 02:50 UTC"}