{"Object Features":"None","Country":"United States","Sighting Duration":"12:00:00","Source":"MUFON","Date Submitted":"12/30/2012 08:57 UTC","Log Number":"US-12302012-0012","City":"Wilmette","Longitude":"-87.691588","Latitude":"42.073753","Case Number":"44858","files":["/var/www/straped/mufon/html2text/44858.html.txt","/var/www/straped/mufon/org/44858.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.073753,+-87.691588(44858)&iwloc=A&hl=en\"> mufon case (44858) map </A>","divs":["sighting detailsweve talked before i have solid evidence now that i am in direct contact and can proof it.n i went to vegas and delivered a letter to my alien friends. i found them there and when i returned they acknowledged that they would honor my request by telling me on wgn then on midnight on dec. 20th they made contact with me. i can verify all of this with computer log with my company and with wgn. i talked to the woman in florida assigned to my case. i documented my hole trip on film and i can believe i can scare the day lights out of you now i probably understand with our last conversation that you probably wont do anything, i really dont care if you dont because i know the truth and ill handle it on my own from now on. i asked my alien friends to show up at midnight and i have the documentation on computer log showing that they did as i asked over two months ago which i posted on youtube. i know there my friends if you would like to talk further i would welcome it but it doesnt matter because sooner or later you will hear from us one way or another please contact me if you like im very serious im sorry that your not if we work together my friends may come out sooner. my name is [name and ph, number removed\\cms\\tg] i do have additional film that can proof i know what im talking about"],"Region":"Illinois","Viewing Distance":"20 Feet or Less","Summary":"I was contacted and can proof it","Disposition":"Unresolved","Tags":"City","Object Flight Path":"Stationary","Weather Factors":"Unknown","trends":["There has been one other sighting in Wilmette","There were no other sightings in Wilmette on or around December 20th 2012"],"Object Shape":"Other","Date of the Event":"12/20/2012 12:00 UTC"}