{"Latitude":"37.373661","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Longitude":"-115.157191","divs":["Sighting DetailsA contact of mine who is a local resident of Alamo, Nevada was walking near to the Windmill Ranch Hotel just outside Alamo when he spotted this sphere moving towards the west and the mountain range which you can see in the picture. Behind the mountains is Area 51 and on this particular day there had been no aircraft activity out of Nellis AFB or Groom Lake. The sun was behind the person who took this picture and you can clearly see this from the shadows on the ground in the picture. The contact had forgotten this image until he recently went through some old SD memory cards and came across it just before Christmas. He contacted me immediately and we cannot find any conventional explanation for this sphere. He does recall seeing flashes in the sky which were also witnessed by staff from the hotel, in total 3 other persons. He cannot find any conventional explantion for this sphere and satelites and astronomical objects have been ruled out. The contact has asked me to share this image and I will respect their wishes by not naming them. None the less this is certainly a decent image and one that should certianly be shared with the public. Darren Perks UFO Investigator www.ufoshropshire.co.uk"],"Date Submitted":"12/30/2012 04:05 UTC","Tags":"City","trends":["There has been one other sighting in Alamo","There were no other sightings in Alamo on or around September 29th 2012","This sighting has been favorited 1 time.",""],"Log Number":"US-12302012-0008","City":"Alamo","Date of the Event":"09/29/2012 02:10 UTC","Case Number":"44854","map":"<A HREF = \"http://maps.google.com/maps?q=37.373661,+-115.157191(44854)&iwloc=A&hl=en\"> mufon case (44854) map </A>","Disposition":"Unresolved","Region":"Nevada","Source":"MUFON","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/44854.html.txt","/var/www/straped/mufon/more/44854_submitter_file1__541707535337496485794875636304n.jpg","/var/www/straped/mufon/org/44854.html"],"Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path","Summary":"Unusual Bright Sphere Over Desert Near To Area 51","Country":"United States","Object Shape":"Sphere"}