{"Viewing Distance":"Over One Mile","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.562005,+-117.101241(44864)&iwloc=A&hl=en\"> mufon case (44864) map </A>","City":"Imperial Beach","Case Number":"44864","Date Submitted":"12/31/2012 01:13 UTC","Sighting Duration":"00:00:03","Longitude":"-117.101241","Region":"California","Latitude":"32.562005","Object Features":"Wings","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","divs":["Sighting DetailsI was sitting in my backyard stargazing. I got up to go in my shed to light a cigar. I came out of the shed and looked up and briefly saw a large dark triangular shaped object flying straight east to west almost right over my head. There was no sound at all. I saw it for roughly 2-3 seconds before it flew into or over cloud cover to my west. At first I thought it might be a large bird(hawk or seagull)but it flew into or over cloud cover. The object also had a very minimal glow or lighting along the forward wings. Not a strobe or regular light on a plane. I had witnessed and heard many planes in the area before and after I seen this object. All of them were very distinctly planes. Last night the air was very clear. There were storms in the area but the clouds were very scattered. It was a great night for stargazing in between the clouds. The object was also traveling at a fairly good rate of speed. If it was a bird and high enough to fly into or over the clouds it would not have been as big as it was and also not as fast. To me on the ground looking up the object was approximately two inches wide. Also the lighting or glow on the front of the wings looked kind of like the glow given off by the rotors of a helicopter at night while idling on the ground. My feeling after it disappeared into the cloud and I realized it was gone was slight shock. I stayed out stargazing for about another hour and a half before I came inside to eat dinner. I saw nothing else like the object for the rest of the that time."],"Object Shape":"Triangle","Disposition":"Unresolved","Source":"MUFON","Country":"United States","Summary":"Saw a huge triangle flying east to west with a slight glow on the front wings.","Log Number":"US-12312012-0004","files":["/var/www/straped/mufon/html2text/44864.html.txt","/var/www/straped/mufon/org/44864.html"],"Date of the Event":"12/30/2012 06:43 UTC","trends":["There have been 4 other sightings in Imperial Beach","There were no other sightings in Imperial Beach on or around December 30th 2012"]}