{"Source":"MUFON","Log Number":"US-02252006-0007","Object Flight Path":"Hovering then path","Country":"United States","Disposition":"Unknown","divs":["Sighting DetailsI was visiting my parents in Greenwood, S.C. over Thanksgiving. The Friday after the holiday, the three of us drove to the nearest city, Greenville, to do some Christmas shopping and to see a movie. Greenwood is a small city in a rural part of Upstate South Carolina, and the part of Highway 25 we were on is fairly isolated. There are a few homes here and there, but not a lot of development. Consequently, the road is quiet and on a clear night like the one in question, the stars are clearly visible. Around 10:30 or 11 p.m., I pointed out to my dad that the star on the horizon was particularly clear and beautiful, and he looked and said that while it was very pretty, he thought it was a planet because it looked too bright and large to be a star. My mom said that whatever it was, it looked awfully weird. The closer we got, the stranger it looked. I suggested that it might be a cell phone tower, and my dad disagreed, because the light on a cell phone tower would be red, and this light was white, like a star. That's when I realized that the object had changed positions in the sky. It had moved from the right side of the sky -- the passenger side, based on my position in the car -- to the left side of the sky, and it was definitely getting larger and closer. It's difficult for me to estimate how many miles we drove until it was directly overhead, but curiosity got the better of us in the little town of Ware Shoals, which is about 20 miles from Greenwood. My dad pulled into the median in front of the Burger King and he and I got out of the car and looked up. A large triangular craft slowly floated over us. Size in feet is hard for me to estimate and it's been a little while since this happened. I don't want my memory to inflate the measurement, but it was definitely larger than your average low-flying plane. If the sun had been out, it would have cast a shadow that would have covered me, my dad and his SUV. It was like something out of an \"Unsolved Mysteries\" reenactment. The craft was black and the corners of the triangle were rounded. There were lights at each corner which I believe were bluish-white and a red light on each of the three sides between the bluish-white lights. It didn't make any sound at all and it floated at an even pace right over the tops of the pine trees. It seemed to be so close to the tops of the trees that I thought it might brush them as it passed over. I know very little about military aircraft, but I looked up photos of stealth fighters later to see if I could find what we saw. It wasn't a B-2, I'm sure of it, because B-2s have a W-shape in the back and what we saw was a solid triangle. It wasn't a Nighthawk either. Both of those planes are too angular. I'm absolutely certain the corners of the triangle were rounded. My dad and I just stood there looking at it. I wasn't afraid, but I was intrigued. It was fascinating. Time seemed to move really slowly, not for any metaphysical reason but because I couldn't believe what was I seeing. I wanted to pull it back and look at it some more. When it passed over -- it didn't shoot off at Warp 9 or anything, it just floated over the trees and out of sight -- my dad and I got back in the car. Less than a minute elapsed between the time we stopped the car and the time we got back in. I asked him what we had just seen and he said he didn't know, which surprised me because he's always been interested in military technology. We didn't talk much until we got home. We haven't discussed it since."],"Summary":"Three witnesses saw a black triangular mystery craft silently pass over Highway 25 in Ware Shoals, S.C. on a clear night on Nov. 25, 2005.","Object Shape":"Triangle","Date of the Event":"11/25/2005 10:30 UTC","Date Submitted":"11/25/2005 10:30 UTC","Latitude":"34.1954","Weather Factors":"None","Longitude":"-82.161788","Tags":"City","Sighting Duration":"Undisclosed","trends":["There have been 5 other sightings in Greenwood","There were no other sightings in Greenwood on or around November 25th 2005"],"Region":"South Carolina","City":"Greenwood","Object Features":"None","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=34.1954,+-82.161788(4486)&iwloc=A&hl=en\"> mufon case (4486) map </A>","Case Number":"4486","files":["/var/www/straped/mufon/html2text/4486.html.txt","/var/www/straped/mufon/org/4486.html"]}