{"divs":["sighting detailsmy friend and i were outside observing the rising moon. there were fireworks going off at various times as well. however, this bright orange fireball was no firework. it lasted far too long, it came up from the horizon under the moon and went up over the moon. we were facing due east, it traveled south east for a bit, it was in the sky for about 5 min or so, it was flickering like a bright orange flame, it was orb shaped. my friend suggested it was a plane with an engine on fire however he thought it was strange that we could not see any smoke. the moon light was bright so we should have been able to see smoke. it did not appear to be dropping any material either. it was very bright, brighter than any star or planet. we watched it go up and then fade down like it was falling or gliding downward. it faded out and we couldnt see where it went after that. it was descending when it vanished. we did not see or hear any explosion in the distance as if it were a plane crashing but we did observe a faint glow over the horizon for a short time. we kept checking news reports for a plane crash but have not found any. it was in the direction of north pasco\\south hernando county toward orlando area. we were not able to record the event."],"files":["/var/www/straped/mufon/html2text/44875.html.txt","/var/www/straped/mufon/org/44875.html"],"Object Flight Path":"Path with directional change","Sighting Duration":"00:05:00","City":"Port Richey","trends":["There have been 8 other sightings in Port Richey","There were no other sightings in Port Richey on or around December 31st 2012"],"Date of the Event":"12/31/2012 10:30 UTC","Longitude":"-82.67868","Weather Factors":"Unknown","Latitude":"28.287812","Object Shape":"Fireball, Star-like","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=28.287812,+-82.67868(44875)&iwloc=A&hl=en\"> mufon case (44875) map </A>","Tags":"City","Object Features":"None","Date Submitted":"01/01/2013 12:40 UTC","Country":"United States","Summary":"Wavering Fireball over Pasco County FL","Viewing Distance":"Over One Mile","Log Number":"US-01012013-0002","Disposition":"Unresolved","Region":"Florida","Case Number":"44875"}