{"Viewing Distance":"501 Feet - 1 Mile","Longitude":"-81.762645","Object Features":"Unknown","Log Number":"US-12312012-0013","Disposition":"Unresolved","Country":"United States","Date of the Event":"12/31/2012 10:19 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","City":"Naples","Summary":"Red-orange light moving slowly, changing direction, hovering, then disappearing","files":["/var/www/straped/mufon/html2text/44873.html.txt","/var/www/straped/mufon/org/44873.html"],"Object Shape":"Circle","trends":["There have been 34 other sightings in Naples","There was one other sighting in Naples on or around December 31st 2012"],"divs":["Sighting DetailsOn New Year's Eve 2012, my boyfriend, myself, and three close friends were sitting outside in Naples, Florida, enjoying the fireworks and the crisp evening. The skies were totally clear and the stars were shining brightly. We were chatting but not concentrating on the sky or anything in particular, when suddenly my boyfriend looked up and said, \"Hey, what's that?\" The rest of us looked up to find what he was seeing. He pointed almost directly overhead and said, \"Look! That orange thing- it's moving! It just zig-zagged, but now it's going straight.\" I saw it next, closely followed by our three friends. It traveled slowly, changing from a zig-zag path to a straight line, not changing color or wavering the bright light it cast off in the least. It appeared to be very high in the atmosphere and maintaining a steady rate of speed at first. I struggled to get my phone out to record it as the five of us tried to rule out various possibilities. There is an airport very near to our house, but for the most part planes taking off and landing there are small and low flying. The object we witness made no noise that we could discern, and did not display any of the colors or flashing lights that one would expect from a small private craft or a larger commercial airplane flying high overhead. We watched as the orange circular shape slowed further in the sky, then stopped. It began to move again, then stopped again. After it had stopped and began moving three times in total, it started slowly, getting smaller and smaller before suddenly making a rapid ascent and disappearing. I would estimate that it traveled several miles during the time that we were able to see it, as it was clearly very high in the atmosphere. I would also say that it was going much more slowly than an airplane traversing a large distance would go. The five of us, as a whole, felt a sense of excitement, wonder, and awe. Although we would likely generalize ourselves as open-minded, it's one thing to entertain the idea of beings or crafts from another place, and another thing entirely to witness it with your own eyes. None of us were under the influence of psychotropic drugs, and all of us were able to agree on the details of what we saw, even if we didn't understand it. Everyone was eager to watch the object and find out any information we could gather, and almost all of us immediately let someone outside of our circle know what we had witnessed. I myself had two other friends who live more than 400 miles away in Daytona Beach, FL report to me after I shared what I'd seen that they, also, had seen an object matching both physical description and behavioral patterns at nearly the same time, and they are not by any stretch of the imagination people who are prone to flights of fancy. In short, I'm not sure what it was that we saw, but I know it wasn't something that one would normally see in the sky, and I feel privileged to have witnessed it."],"Tags":"City","Case Number":"44873","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Latitude":"26.159464","Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=26.159464,+-81.762645(44873)&iwloc=A&hl=en\"> mufon case (44873) map </A>","Date Submitted":"12/31/2012 11:55 UTC","Source":"MUFON"}