{"Date Submitted":"12/31/2012 10:16 UTC","Region":"Florida","Longitude":"-81.375366","Latitude":"28.547936","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=28.547936,+-81.375366(44871)&iwloc=A&hl=en\"> mufon case (44871) map </A>","files":["/var/www/straped/mufon/html2text/44871.html.txt","/var/www/straped/mufon/org/44871.html"],"Summary":"2 orange fireball like orbs moving slowly in a line across the sky, low flying, both objects followed the same path, going south to north west, at the same speed and the same altitude. Objects made no sound..","Disposition":"Unresolved","divs":["Sighting DetailsWalking my dog, noticed a bright orange flickering object moving from the south towards my direction. Object was low and moving slowly in a straight line. Then noticed a second identical object moving behind the first. This object was also moving at the same slow speed, in the same path as the first. Both objects were bright orange, with a flickering, \"fireball\" shape. Both objects moved at the same speed and altitude, then turned towards the north west. Objects made no sound. At first I thought it was the spotlight of a helicopter, since I first observed it from a distance, through the treetops. As it moved closer and into open sky, I realized it was an orange orb type object. I could not figure out what I was observing. I've never seen anything that looks or moves like this in the sky. Then a second identical object appeared in the distance and followed the same path. The objects moved slowly and in a straight line that eventually turned toward the north west. I watched the first one start to fade and I wanted to get my cell phone to film it, but couldn't take my eyes off it. Then I started to feel nervous and headed in the house. I didn't watch the second one fade or disappear."],"Tags":"City","trends":["There have been 112 other sightings in Orlando","There was one other sighting in Orlando on or around December 31st 2012"],"Country":"United States","Object Shape":"Circle, Fireball","Object Features":"None","City":"Orlando","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Date of the Event":"12/31/2012 08:30 UTC","Case Number":"44871","Log Number":"US-12312012-0011","Object Flight Path":"Path with directional change","Source":"MUFON"}