{"Date Submitted":"01/01/2013 02:53 UTC","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Log Number":"US-01012013-0009","trends":["There have been 18 other sightings in New Port Richey","There were no other sightings in New Port Richey on or around January 1st 2013"],"divs":["Sighting DetailsOne of my kids came running in the house tonight all freaked out telling me there are UFO's over the house! I was like you are just seeing planes or fireworks until they dragged me outside. Not a big UFO kinda guy, never have seen one before but I gotta say those were NOT fireworks and they were NOT planes!!! Burning orange balls of light tumbling moving in zigzags, up, down and every which way then they would disappear and then reappear miles away in just seconds? At one point one of them was right over the house and I could see the body of the object, it was round almost transparent looking with a pulsing orange light then went straight up through the clouds. Seems there were about 5 or 6 of them visible at one time and made NO noise. Not sure how many there were because they would disappear and reappear so fast. There were 3 in one area of the sky and 2 more on the total opposite part of the sky. Seemed to be almost like a swarm. Another one came from what seemed to be miles away and flew right past the house in seconds. It seemed to be just above the tree line maybe 1000 ft but as it flew by seemed to be thousands of feet in the sky then just disappeared. I see planes fly over almost every 5 minutes or so and I know what planes look like in all weather conditions but these were NOT planes!!! For the altitude these appeared to be at they must have been very large! They are still out there right now and I have been watching them for hours now on and off! We have a couple videos but they are very poor quality. We have another video but it is over 100 megs. Just reporting in case anybody else in this area might have seen them and reported."],"Tags":"City","Disposition":"Unresolved","Object Shape":"Circle, Disc, Sphere, Star-like","Region":"Florida","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=28.223248,+-82.661345(44882)&iwloc=A&hl=en\"> mufon case (44882) map </A>","Case Number":"44882","Summary":"Orange UFO's over New Port Richey Florida. Burning orange pulsating lights moving erratically, hovering, disappear, reappear, moving super fast, silent","City":"New Port Richey","Date of the Event":"01/01/2013 12:00 UTC","Longitude":"-82.661345","Weather Factors":"Unknown","Latitude":"28.223248","Object Features":"Unknown","Source":"MUFON","Country":"United States","files":["/var/www/straped/mufon/html2text/44882.html.txt","/var/www/straped/mufon/org/44882.html"],"Sighting Duration":"Undisclosed"}