{"Tags":"City","files":["/var/www/straped/mufon/html2text/44886.html.txt","/var/www/straped/mufon/org/44886.html"],"Latitude":"37.368544","Date of the Event":"01/01/2013 12:00 UTC","Object Flight Path":"Path then hovering","Sighting Duration":"00:01:00","Log Number":"US-01012013-0013","Country":"United States","divs":["Sighting DetailsShortly after midnight, we went outside to see the fireworks in our neighborhood. In addition to the fireworks, the usual commercial airliners were visible (our house is under flight paths for SJO, Moffet Air Field, and several local airports). When we looked out to the area of sky above the house across the street (300deg NW), we saw two objects that appeared star-like, but were moving quite slowly in a northerly path and had blinking red-orange lights. There were two commercial airplanes in the vicinity that were travelling at much faster speeds and were audible. The two lights suddenly disappeared and within 10 seconds a single similar light appeared in the direction of magnetic north, slowly ascended in altitude before suddenly vanishing. We were unable to see any further similar objects, though we continued searching the sky for approximately 30 minutes after we lost sight of the object. This is our secong New Year's experience, though the last year's experience was with a differnet light pattern and possible craft outline. While my aunt and I are always excited to see unidentified lights and keep binoculars and cameras at the ready, our neighbors are quite frightened of the lights, often wanting to return to the perceived safety of the indoors."],"Viewing Distance":"Unknown","Date Submitted":"01/01/2013 03:39 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.368544,+-121.820847(44886)&iwloc=A&hl=en\"> mufon case (44886) map </A>","trends":["There have been 106 other sightings in San Jose","There was one other sighting in San Jose on or around January 1st 2013"],"Longitude":"-121.820847","Case Number":"44886","Disposition":"Unresolved","Source":"MUFON","City":"San Jose","Weather Factors":"Unknown","Object Shape":"Sphere, Star-like","Region":"California","Object Features":"None","Summary":"solid white star-like object with blinking red-orange lights disappeared and reappeared 90deg to the right"}