{"Weather Factors":"None","Country":"United States","Summary":"Recurring. Two orange lights parallel course. One drops 2 orange lights of same color straight down before both original lights fade out.","trends":["There have been 12 other sightings in Visalia","There were no other sightings in Visalia on or around February 10th 2006","This sighting has never been favorited.",""],"Latitude":"36.334598","Source":"MUFON","files":["/var/www/straped/mufon/html2text/4488.html.txt","/var/www/straped/mufon/more/4488_submitter_file2__DSC_0672d.jpg","/var/www/straped/mufon/org/4488.html"],"Object Flight Path":"Path with directional change","divs":["Sighting DetailsI've seen these lights 5 or 6 times since November so I really wanted to get them on video after taking some still photos several days earlier. There are almost always two lights that move on perfectly parallel courses. After a couple minutes one drops what looks like a flare of the same color that falls straight down. Another one usually follows after that but I cannot remember seeing more than two nor have I ever seen them come from both objects. One time (see the photo, dated Febuary 6th) the flare itself seemed to actually split in two. There was a brief flash when it did, but nothing very bright. As for the February 10th encounter, I first noticed the objects to my southeast moving west at lower altitude than I usually saw. This was very different and they also seemed to be moving much faster than usual. I'm assuming this means they were much closer than before. All of the times I saw them before they were moving southeast to north and 30-45 degrees up from my point of view. This was maybe 10 degrees at the most. They were so much lower than before that they were obscured by some trees I have to my south. However, the objects changed course while out of view and started heading up at what looked to me like a perfect 45 degree angle. When the first flare dropped the lead object seemed to stop moving and slowly fade out. It would start to dim and then pulse back a little brighter but at a lower intensity than before. The second object changed course between the time of the first and second flares and seemed to level off its altitude. The strange thing is the remaining object seemed to just disappear as I looked away to move my camera. As silly as it sounds the remaining object in almost all the cases I've seen them seemed to just vanish if I looked away for a split second after it was done dropping flares or whatever they are. There doesn't seem to be any missing time involved. My backyard is fairly large and I've had the porch light on every time. It seems like if there was concern about people seeing whatever they are the man standing in the middle of a lit yard would be more of an issue than that same man seeing the last object fade away. I attached the photo, dated February 6th, to help explain things. It was taken with a Nikon D70 on a 30 second exposure time. Oddly enough, the \"flares\" don't seem to be dropping straight down in that case. The video itself, unfortunately, isn't all I had hoped it would be. It doesn't show the colors and in my haste I forgot to turn off the autofocus so it has problems there. It was on a tripod and was not moved during the clip. I've been thinking about it for quite awhile now and I really can't come up with any sort of explanation for what these are. I've searched the archives at NUFORC.org for sightings that matched mine and came up with a lot of results, especially in California. There was even one that mentioned the lights being on top of craft that were cross shaped but I have no way of verifying that since I can only see the lights. There was even one in the UK fairly recently. Why they don't seem to be getting any sort of attention I don't know, but with so many similar sightings there has to be some connection. The earliest sighting I've had was 8:30 p.m. and the latest is about 2 a.m. During the sightings I've never had any sense of fear but was pretty much just in awe. After they go away I start to doubt I saw them in the first place but I'm guessing that's a pretty typical reaction to this sort of thing."],"Tags":"City","Region":"California","Case Number":"4488","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"02/10/2006 01:30 UTC","Log Number":"US-02262006-0002","City":"Visalia","Longitude":"-119.288058","Object Features":"Unknown","Date Submitted":"02/10/2006 01:30 UTC","Object Shape":"Teardrop","map":"<A HREF = \"http://maps.google.com/maps?q=36.334598,+-119.288058(4488)&iwloc=A&hl=en\"> mufon case (4488) map </A>","Disposition":"IFO"}