{"Viewing Distance":"Unknown","Object Flight Path":"Path with directional change","City":"Glendale","Log Number":"US-01012013-0014","map":"<A HREF = \"http://maps.google.com/maps?q=33.545152,+-112.179257(44888)&iwloc=A&hl=en\"> mufon case (44888) map </A>","Date Submitted":"01/01/2013 03:51 UTC","Sighting Duration":"00:10:00","Latitude":"33.545152","Weather Factors":"Unknown","Source":"MUFON","divs":["sighting detailsmy wife, 2 sons and myself were outside shortly after midnight setting off fireworks. my oldest boy saw an orange light in the sky and alarmed us. i asked him to run inside and grabbed our hd camera, but the battery was almost dead when i turned it on. we all saw the exact same thing, red\\orange orbs rising into the sky from the direction of phoenix sky harbor airport, one after the next, then changing to solid orange and scooting back and forth through the sky for 1-2 minutes until they faded out\\reached outer space, then another rose into the air chasing a different direction. this happened at least 3 times until it stopped, not sure how long it was happening before we went outside and noticed. they were very bright, stopped in mid-flight and changed direction, certainly not the airplanes we see normally, then continued on in another direction. my oldest boy says each orb was making a sound and he had dreamed this would happen tonight. i will upload what i caught on film to youtube soon (mratomicg). we were all a little spooked."],"Country":"United States","Object Shape":"Fireball, Sphere","Date of the Event":"01/01/2013 01:20 UTC","Longitude":"-112.179257","Tags":"City","Region":"Arizona","files":["/var/www/straped/mufon/html2text/44888.html.txt","/var/www/straped/mufon/org/44888.html"],"Object Features":"Unknown","Disposition":"Unresolved","trends":["There have been 52 other sightings in Glendale","There was one other sighting in Glendale on or around January 1st 2013"],"Case Number":"44888","Summary":"Multiple objects (3+) red to orange launched one after another from ground to space shortly after midnight AZ time"}