{"Viewing Distance":"Over 1 Mile, Unknown","divs":["sighting detailswe were in neighbors field behind house celebrating new years eve 12\\31\\12. there was a bonfire and we had lit off a few fire works. in the distance is a tree line. my friend was facing that way and all of a sudden she saw the lights moving. we turned to look and noticed them too. they, 3 or 4 of them, were bright as stars only much bigger. one especially was closer with the others further in the distance. they were all moving horizontally through the trees silently smoothly not too fast. then they descended kind of with the same smooth floating motion. but then another group came. same motions. this went on repeatedly for maybe ten minutes. then no more. we discussed the possibility of them being fireworks but they didnt fizzle out, no sharp propellant moves. also no sounds at all and the horizontal movements. i attempted a photo but only one shows anything."],"Disposition":"Unresolved","trends":["There has been one other sighting in Micanopy","There were no other sightings in Micanopy on or around December 31st 2012","This sighting has been favorited 1 time.",""],"Longitude":"-82.273341","Source":"MUFON","Weather Factors":"Unknown","Summary":"Multiple starlike lights moving within a segment of sky from right to left then descending in small groups over 10 minutes","map":"<A HREF = \"http://maps.google.com/maps?q=29.496917,+-82.273341(44899)&iwloc=A&hl=en\"> mufon case (44899) map </A>","Tags":"City","Log Number":"US-01012013-0026","Date of the Event":"12/31/2012 12:00 UTC","files":["/var/www/straped/mufon/html2text/44899.html.txt","/var/www/straped/mufon/more/44899_submitter_file1__image.jpg","/var/www/straped/mufon/more/44899_submitter_file2__image.jpg","/var/www/straped/mufon/org/44899.html"],"Date Submitted":"01/01/2013 02:23 UTC","City":"Micanopy","Object Flight Path":"Path with directional change","Case Number":"44899","Sighting Duration":"Undisclosed","Object Features":"Unknown","Latitude":"29.496917","Object Shape":"Fireball, Sphere, Star-like","Region":"Florida","Country":"United States"}