{"Log Number":"US-01012013-0016","Object Features":"Unknown","Object Shape":"Sphere, Star-like","Date Submitted":"01/01/2013 05:22 UTC","trends":["There have been 19 other sightings in Elk Grove","There was one other sighting in Elk Grove on or around January 1st 2013"],"Source":"MUFON","divs":["Sighting DetailsI was at home on New Year's Eve and had gone out to my back yard a couple of minutes before midnight to watch the fireworks. Accompanied by my dog, I listened to the various bangs and horns and cheers and even managed to see an actual firework that was shot skyward. As usual there wasn't much of a show. Before retreating indoors however, I amused myself by watching my dog trot around the yard in reaction to all the noise. This held my attention for perhaps a minute. Feeling cold (and feeling bad for the dog), I decided to take one last look at the sky before going back inside. My intent was to take in the main sights on display that night: Jupiter, Orion, Sirius and the Moon. Due to its brightness, the Moon caught my attention first. After staring at it for a few seconds, I noticed distant lights off to the left, out of the corner of my eye. Turning my gaze on those objects, I immediately labeled them as planes. Simply put, they looked like planes do at night. Their speed, their apparent altitude, the general nature of the light, it all added up to planes. But then several uncommon characteristics became apparent. First of all, there were three lights. And they were clearly flying in formation, one directly behind the other. They also seemed relatively close to one another. Certainly much closer than regular air traffic. And then there was the color and specific nature of the light. Normally, when bright lights are visible on planes they appear yellowish and you usually only see them when the plane is approaching you head-on. However these lights were red-orange and were not flying directly toward me. Also, there were no blinking lights to be seen on either of the three objects. As the strangeness sinks in I start running possibilities through my head, trying to figure out what I'm looking at. In the midst of this, the lead object begins to dim. I then notice a fourth object (same color, speed, flight path) some distance behind the main group. Captivated, all I do is stare. What happens next is the other two objects begin to dim as well, once they reach the location where the first one started to dim. So if I were to number them, 1 was extremely dim, 2 was a little brighter, 3 brighter still, and 4 (back from the main group) was as bright as when I first noticed the objects. Ultimately, 1, 2 and 3 continued on their straight line path, becoming dimmer and dimmer until they faded away. 4 followed behind, and like the other three, began to dim once it reached the same point. It too simply faded as it flew across the sky."],"Region":"California","Weather Factors":"Unknown","City":"Elk Grove","Summary":"Four red-orange lights resembling bright stars flew in a straight line then slowly faded until they were no longer visible.","Viewing Distance":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=38.393036,+-121.413567(44890)&iwloc=A&hl=en\"> mufon case (44890) map </A>","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Case Number":"44890","files":["/var/www/straped/mufon/html2text/44890.html.txt","/var/www/straped/mufon/org/44890.html"],"Longitude":"-121.413567","Tags":"City","Date of the Event":"01/01/2013 12:00 UTC","Latitude":"38.393036"}