{"Date of the Event":"01/01/2013 12:00 UTC","files":["/var/www/straped/mufon/html2text/44894.html.txt","/var/www/straped/mufon/org/44894.html"],"Country":"United States","Region":"Wisconsin","Object Shape":"Sphere","Tags":"City","trends":["There have been 4 other sightings in Burlington","There were no other sightings in Burlington on or around January 1st 2013"],"Disposition":"Unresolved","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Summary":"Multiple (nine) very bright fireballs","Source":"MUFON","Case Number":"44894","Latitude":"42.683653","Log Number":"US-01012013-0020","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=42.683653,+-88.269863(44894)&iwloc=A&hl=en\"> mufon case (44894) map </A>","divs":["Sighting DetailsI was leaving my house to go to a third shift job just after midnight on the morning of January 1, 2013. In my driveway, looking towards the moon, I saw three very bright reddish-orange fireballs moving together in a triangular shape out of the northeast towards the southwest. Directly behind them were two more fireballs of the same description, moving along the same trail, one slightly ahead of the other. Two more sets of two fireballs, moving in an identical pattern, followed after. Each set of two fireballs had approximately the same spacing between the two balls, and there was approximately the same amount of space between each set of fireballs. All of them followed the same straight-line path without deviation. The first three sets (the set of three and the first two sets of two) moved at approximately the same speed, but the final set of two moved a bit faster than the others. All of the fireballs were more or less of the same brightness and size, but some seemed to get brighter as I watched them. Their apparent size was a little bit smaller than a basketball when they were at their closest to me. Their apparent brightness was similar to that of a professional firework (but these didn't explode). Their color was similar to the orange rising sun at the break of dawn. While they were passing over, I ran inside to get a pair of binoculars; even with this delay, they were still overhead when I returned (the whole event lasted approx. 5 minutes). Even with the binoculars, I was unable to make out any detail on the balls -- they were just glowing \"fireballs\" without any exterior features. They did not burn out, but simply got so far away that I could no longer observe them. My feeling during the event was mostly that of being mesmerized -- for at least a minute I could do nothing but stare at the sky in amazement. Afterwards (both immediately and hours afterwards) I was confused and interested -- these would be my normal reactions; I do not believe that the fireballs had any non-normal mental or psychological effects. After they were no longer visible I went to work; I asked some co-workers if they had seen anything around the same time (being careful not to describe my experience until after they answered), but all answered in the negative. Some joked that I must have been drinking (because of New Year's Eve), but, for the sake of clarity, I will mention that I have never consumed alcohol nor taken any mind-altering drug."],"Longitude":"-88.269863","City":"Burlington","Viewing Distance":"Unknown","Date Submitted":"01/01/2013 09:27 UTC","Sighting Duration":"00:05:00"}