{"City":"Silver Spring","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Date Submitted":"01/01/2013 09:25 UTC","Sighting Duration":"Undisclosed","Country":"United States","Object Shape":"Chevron","Latitude":"39.027169","Case Number":"44893","Summary":"Single silent amber chevron shaped flew by followed by a group of four identical","Disposition":"Unresolved","trends":["There have been 12 other sightings in Silver Spring","There were no other sightings in Silver Spring on or around January 1st 2013"],"Object Flight Path":"Straight-line path","Date of the Event":"01/01/2013 12:00 UTC","Region":"Maryland","map":"<A HREF = \"http://maps.google.com/maps?q=39.027169,+-77.058094(44893)&iwloc=A&hl=en\"> mufon case (44893) map </A>","divs":["Sighting DetailsWas doing my first dog walk of 2013 at 12:44 am when my attention was drawn to a couple loud silouettes a short distance up the street. I assumed my neighbors were intoxicated. One of the two women broke off and approached me. I again assumed incorrectly she wanted to pet my dog. I was surprised when she asked excitedly if I had seen the red lights in the sky? I said I had not and can remember saying I love that stuff and wished I had seen what she had. She explained how she and the other neighbor had seen one single object fly over them followed by two more a few minutes later, again she and the other neighbor were very excited not drunk. We talked neighbor small talk for only a couple of minutes when she spotted another one of the objects coming from the south west over the national mormon temple and the washington beltway. I was not a red light it was a very brilliantly illuminated amber colored chevron silently approaching and passing directly over our position from soutwest to the north north east at an approximate height of ten thousand feet below the clouds. Weater channel at the time had the cloud deck at thirteen thousand feet. The color and intensity of the lights were of a very strange shade or hue, I have never seen any lights like that and living in the washington dc area we see alot of lights. Everything from aircraft landing lights to helicopter spot lights. We have lots of helicopter traffic in this area. Their also seemed to be a pulsating effect although constant mixed with what looked like smaller faster flashing lights in among the the larger ones. I thought these smaller lights were some kind of navigation lights but this was clearly no conventional aircraft and these little lights were just to weird- flashing and blinking irradically all over the body of the craft not in a fixed position like on a regular plane. My neighbor asked me repeatedly \"what is that? What is that?\". It was amazing, wow was all I could say over and over as it silently moved away. Before we went off our seperate ways perplexed she stated she had never seen anything like that and that she worked for NASA. I continued my walk up the hill towards the direction the craft had disappeared. It was only a few seconds when the neighbor started screaming my name from the bottom of the hill. She was also yelling \"four look four!\" Sure enough out of the southwest at the same altitude came four of the amazing amber chevrons identical to the first one. They flew over me in a loose formation again completely silent. \"Wow\" was all I could exclaim. I was even tempted to knock on the door of the nearest house and say come check this out. At the top of the street I could hear the excited voices of several young women actually screaming \"aliens, aliens lets get inside!\""],"Longitude":"-77.058094","Log Number":"US-01012013-0019","files":["/var/www/straped/mufon/html2text/44893.html.txt","/var/www/straped/mufon/org/44893.html"],"Object Features":"Unknown","Weather Factors":"Unknown"}