{"trends":["There have been 34 other sightings in Naples","There was one other sighting in Naples on or around December 31st 2012"],"Date Submitted":"01/01/2013 04:12 UTC","Sighting Duration":"00:30:00","City":"Naples","Summary":"Red orange glowing fireball hovered then flew west, few hours later saw again going diff directiom4","Object Features":"None, Unknown","Object Flight Path":"Hovering then path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=26.147506,+-81.78904(44907)&iwloc=A&hl=en\"> mufon case (44907) map </A>","Date of the Event":"12/31/2012 12:00 UTC","Log Number":"US-01012013-0034","Case Number":"44907","Latitude":"26.147506","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Longitude":"-81.78904","Source":"MUFON","Tags":"City","divs":["Sighting Details4 of us walked out to the pool just after new years to try and see fireworks from homes in the neighborhood. Initially I thought it was an ember or a dud firework but it elevated then began to move slowly west overhead. I pointed it out to my husband and the other couple just as a \"hey look at that, what do you think it is?\" . As it kept going we tried to guess, maybe it was a plane or helicopter but then we realized it wasnt the normal flight path and it was completely silent. We frequently hear planes and helicopters but this made no sound. We continued to watch as it went off in the distance. A few hours later my husband and I were walking back to our apartment next door, same location, and saw the fireball again coming from behind our building and heading sw, toward the gulf beaches. This time it went faster and faded out once it got further away. We all joked about it initiall so this afternoon I asked my husband If he heard anything on the news, still half joking, but he looked online and we saw video of what we saw but in other states, all last night. We are open minded but never expected to see something we couldnt explain randomly, twice in one night. We are shocked really. We have heard about sightings in fl, etc but not in naples. We are close to Davis blvd. our friend tried to film it but his cell didnt record even though he thought it was recording. It wasnt a plane or fireworks, it was a flying flickering large fireball, thats the best way I can describe it."],"files":["/var/www/straped/mufon/html2text/44907.html.txt","/var/www/straped/mufon/org/44907.html"],"Country":"United States","Object Shape":"Fireball","Region":"Florida","Disposition":"Unresolved"}