{"Source":"MUFON","Log Number":"US-01012013-0033","Longitude":"-111.953919","divs":["Sighting DetailsMy wife and two sons were traveling east on hwy 12 toward east Helena after coming up over the train overpass my wife said \"what is that\" at the same time I saw the object's in the sky forming an arch shape. At first I thought it might be fireworks from the celebration but then noticed that the objects did not fall from the sky like a normal firework, but instead stayed hovering. the objects appeared to be just floating and glowing not moving at all. i turned the car off of hwy 12 east tuning left onto wylie dr trying to keep track of the objects there was a building and a few trees in the way so we lost track of some of them while turning. after traveling north for two blocks we turned the car to the right, traveling east again. after regaining sight of the objects, now there where only three. my wife and i used our cameras on our phones to try and document what we were seeing. i took video, while my wife snapped a picture. unfourtunatley the video did not pick up what we saw, the picture my wife took shows one tiny little blip but not enough to really determine what it was. when we saw these objects my family and i were freaked out, i tried to maintain composure for my kids sake, but i was scared. my boys eight and ten where very freaked out and immeadeatly asked to go home, they wanted no part of determining what these things were. i told my wife to get back in the car seeing as we were on our way home at this point there was one left we kept watching it as i turned the car around it dissapeared shortly after. none of the objects ever fell from the sky, or moved at all. they simply disappeared."],"files":["/var/www/straped/mufon/html2text/44906.html.txt","/var/www/straped/mufon/org/44906.html"],"Disposition":"Unresolved","trends":["There have been 9 other sightings in Helena","There were no other sightings in Helena on or around December 31st 2012"],"Latitude":"46.646051","Sighting Duration":"Undisclosed","Object Shape":"Fireball","Viewing Distance":"501 Feet - 1 Mile","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=46.646051,+-111.953919(44906)&iwloc=A&hl=en\"> mufon case (44906) map </A>","Tags":"City","Case Number":"44906","City":"Helena","Summary":"7 to 9 glowing star like orbs in an arch shape fading out until only one remained. These orbs stayed and hovered for approximately 7 mins. Until only one remained and then it finally disappeared , my wife and two boys where witnesses to the event as well","Date of the Event":"12/31/2012 09:20 UTC","Country":"United States","Weather Factors":"Unknown","Object Flight Path":"Stationary","Region":"Montana","Date Submitted":"01/01/2013 03:59 UTC"}