{"Log Number":"US-01012013-0030","Summary":"first seen 3 objects in sky,then a 4th one joined,then a larger one came from below","files":["/var/www/straped/mufon/html2text/44903.html.txt","/var/www/straped/mufon/org/44903.html"],"Country":"United States","Case Number":"44903","Object Shape":"Unknown","Tags":"City","Latitude":"39.843353","Object Flight Path":"Straight-line path","Date Submitted":"01/01/2013 03:01 UTC","Weather Factors":"Unknown","Disposition":"Unresolved","Object Features":"Unknown","trends":["There have been 30 other sightings in Westminster","There were no other sightings in Westminster on or around December 31st 2012"],"Region":"Colorado","Source":"MUFON","divs":["Sighting DetailsMy wife and youngest son were traveling west on 104th ave to pickup our middle son from work.my wife looked north over the house's and asked what that was? our youngest whos 15 yrs old said it could be parachutest and we said no cause the outside temp was 7 and below.i then put down the drivers side window and althouh moving could not hear any airplane sounds,or helicopter blade noise.my wife said she seen 4 lights in a triangle formation when the left light moved from its spot to above and to the right of the top light.then my youngest said there was a 5th light coming up from the bottom to join the first 4 lights.my wife said no she thought it was a house then relised it was moving up to join the other lights.because i was driving and rolling west from federal blvd i lost sight of the lights and listened to my wife and son talk about them.after another minute or so my wife and son said the lights were moving easterly then asended into the low cloud cover and never shown again.we pickup our 20yr old from work and traveled back east on 104th to see the lights and they were gone. there was other cars behind us but no one indicated having seen them. we all felt we saw a group of UFO's."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.843353,+-105.036205(44903)&iwloc=A&hl=en\"> mufon case (44903) map </A>","Longitude":"-105.036205","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Date of the Event":"12/31/2012 11:00 UTC","City":"Westminster"}