{"Date Submitted":"07/18/2003 12:45 UTC","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","Longitude":"-82.900963","Summary":"UFOs in the sky","divs":["Sighting Details I submitted this when it happened, but I thought I could clarify it. I still remember like it was yesterday. I had known about UFOs and wanted to believe but I was not sure if they existed. So anyway on July 18, 2003 it just turned to the 18th from the 17th and it was 12:45 AM. I was at my parent's house and they live in Coshocton, OH. I went out the door to smoke a cigarette and a strange feeling told me to turn around and look up. I looked up and was just frozen for a second. A orange boomerang object with a center \"stalk\" that seemed seperate from the \"wings\" by the smallest amount possible. It seemed high up but I could see details. It moved in an arc about like from the tip of my thumb to the tip of my index finger at an arm's length. It was almost as large as the average size moon. So it moved fast, I don't remember exactly how fast but pretty fast. And its movement was smooth but jerky. What I mean is it almost looked like it was stuttering but it was moving fluidly (if that makes sense). So this lasted all of 5-10 seconds. Then suddenly right behind it, following it almost, an orange \"star\" that moved so fast it left a tracer. It did not go in a straight line but the motion was a lot more streamlined than the \"boomerang\". As soon as it appeared then streaked across then disappeared, or during that cycle, another appeared and did likewise. This just continued in very fast repitition over and over. This all happened so fast it made me a little dizzy and I couldn't tell how many were visible at once. It is hard to even estimate the total. They would change direction at very high speed. Not sharp turns but curved turns that were so smooth and graceful that it was very awesome. They also displayed extreme acceleration and deceleration Their paths were a similar distance to the \"boomerang\" (thumbpoint to fingertip at arms length). They all started and ended in different places in the sky, but this all occured over the same patch of sky. So they were going everywhich way over the same area. This continued for about five minutes and I finally snapped out of my shock. I realized everyone was sleeping by this point, but my sister in college would be up. I ran in and grabbed the phone and was back in 5 seconds. I called her and told her and she believed me, but what could she do or say? So I hung up and kept watching. This whole time I had a feeling I would miss something. I had tried to go around the side of the house to get a different perspective but I lost sight of them and ran back to the original spot and just continued watching from there. So after what seemed like ten minutes, I realized I could run in and get either mom or dad up and back out and not miss much. So I ran in yelled \"blah blah come immediately\" and ran back out and my dad was \"quickly\" behind me. A white light similar to the orange ones, which had stopped in the time I was inside, streaked from east to west across the sky. My dad was half asleep still and very cranky. I said \"See that!\" He said \"No.\" It happened again I said \"See it that time\" and he did but I don't think it registered and tried to say it was a bird so I gave up on him. Now my mom had gotten out there but it was over. I talked to them for a second and at some point in the area where the orange lights were (North) a thick white column of \"smoke\" appeared to have risen from the horizon up into the sky. Like the space shuttle blasted off from Cape Canaveral. It was all very strange. My parents went back to sleep and my dad doesn't totally remember. To this day he probably only remembers because I ask him. He admits to seeing something, who knows what he remembers. The main thing is one year later almost to the hour(very late July 17th 2004) my grandpa of 80-some years died. He was a very good Catholic and gave a lot of money to good causes and was a member of a lot of organizations and such and is one of the best Catholics I have ever known. Married to his wife for 50-some years. The preacher came over to the house on his funeral. I really beleive it had something to do with that. When I was seeing this I was thinking \"what does it mean?\" and something inside me kept telling me \"change\" 1.see above 2.stood out 3.bizzare 4.see above 5.the whole spectrum of emotions 6.went in house, then just stopped"],"Tags":"City","Region":"Ohio","Latitude":"40.422197","trends":[],"Log Number":"US-02272006-0003","Object Flight Path":"Straight-line path,Path with directional change,Other","files":["/var/www/straped/mufon/html2text/4491.html.txt","/var/www/straped/mufon/org/4491.html"],"Country":"United States","Object Shape":"Boomerang, Star-like, Other","Viewing Distance":"Over 1 Mile, Unknown","Source":"MUFON","Case Number":"4491","map":"<A HREF = \"http://maps.google.com/maps?q=40.422197,+-82.900963(4491)&iwloc=A&hl=en\"> mufon case (4491) map </A>","Object Features":"Wings, Other, Unknown","Weather Factors":"Unknown","Date of the Event":"07/18/2003 12:45 UTC","City":"Undisclosed"}