{"Weather Factors":"Unknown","Case Number":"44914","Date Submitted":"01/01/2013 06:39 UTC","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around December 31st 2012"],"Sighting Duration":"Undisclosed","Object Features":"Other","divs":["Sighting DetailsMy family and I were standing on vacation in nevada standing on our balcony waiting to see the fireworks at approximately 11;58pm. We noticed an object in the sky hovering over the other condos quite close and approximately the size of a basketball. It was triangular in shape with a framed that looked like metal and a fireball in the centre of the object spinning. At first i thought it was a some sort of a test for the fireworks only it was not in the firework area. My husband thought it was a helicopter and my kids thought it was a plane on fire. It hovered for approx 2 minutes. We kept asking each other if they saw what we all couldn't believe we were all seeing. The fireworks started and it continued to hover. We were all watching the object as it simply seemed to ascend and then instantly disappear. None of us have ever seen anything like this before."],"Log Number":"US-01012013-0040","Summary":"My family and i were waiting on the balcony last night to watch the fireworks. At 11;58 we witnessed low in the horizon a metal triangular object with four points of light on its edges and a rotating orange fireball centre hovering in the sky.","Country":"United States","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=36.117726,+-115.166506(44914)&iwloc=A&hl=en\"> mufon case (44914) map </A>","files":["/var/www/straped/mufon/html2text/44914.html.txt","/var/www/straped/mufon/org/44914.html"],"Longitude":"-115.166506","Object Flight Path":"Hovering then path","Latitude":"36.117726","Region":"Nevada","Viewing Distance":"21-100 Feet, 101-500 Feet","Object Shape":"Fireball, Triangle","City":"Las Vegas","Source":"MUFON","Tags":"City","Date of the Event":"12/31/2012 11:58 UTC"}