{"divs":["Sighting Details Taking a walk to view Christmas lights and decorations between 6PM and 9:30 PM. At the end heading to the local CVS, me and my wife looked up and saw 2 objects moving across the sky with no sound. Assumed they were fighter jets at the time. Joked it was Santa. Afterwards realized recently North Korea launched an unstable satellite, perhaps it was coming down and breaking up in the atmosphere, or it was 2 US fighter jets. Due to the direction it was moving, the object was likely picked up by radar at EWR which is south of us. If anyone investigates, check the airport records please. My wife thought it might be a helicopter. The objects both seemed a little brighter than a plane, at a high altitude cruising, but emitted a red flame like exhaust as they moved across the sky. Checked mufon after and found some similar sightings along this flight path, but the others did not see 2 objects, often they saw 1 or 3, and the descriptions were different from what we saw, but reminiscent of it. Did not take a photo as I knew it would come out bad, and sure others saw it and had better cameras."],"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/44923.html.txt","/var/www/straped/mufon/org/44923.html"],"Log Number":"US-01012013-0049","Date of the Event":"12/25/2012 08:00 UTC","Disposition":"Unresolved","Region":"New Jersey","Date Submitted":"01/01/2013 10:12 UTC","Tags":"City","Longitude":"-74.183178","trends":["There have been 2 other sightings in Nutley","There were no other sightings in Nutley on or around December 25th 2012"],"Viewing Distance":"Over One Mile","Source":"MUFON","Weather Factors":"Unknown","Sighting Duration":"00:04:00","City":"Nutley","Object Shape":"Fireball, Star-like","Object Flight Path":"Straight-line path","Country":"United States","Summary":"Likely 2 jet planes, satelite debris, or meteor breaking up.","Latitude":"40.830636","map":"<A HREF = \"http://maps.google.com/maps?q=40.830636,+-74.183178(44923)&iwloc=A&hl=en\"> mufon case (44923) map </A>","Case Number":"44923"}