{"Date Submitted":"01/01/2013 09:01 UTC","Object Flight Path":"Path then hovering","Disposition":"Unresolved","Latitude":"43.67284","divs":["sighting detailswe were outside in our backyard about 20 miles south of bend, or. on new years eve enjoying a fire with 2 other friends when, at about 11:15p.m. on 12\\31\\12, 2 golfball sized glowing red orbs appeared side by side about 30 degrees above the horizon. they slowly ascended in the north west sky. they were fully viewable for about 1 minute until slowly fading out, one, then the other within a second or two of each other. within approximately 1 minute, a 3rd identical glowing red orb appeared in the same approximate location of the nw sky as the previous two, and it also slowly ascended until fading out after about a minute as well. at this point we all rejoined standing around the fire when about 5 minutes later a 4th identical glowing red orb appeared much lower on the horizon than the first three and ascended in the same manner as the first 3 had done until it hovered at the peak and slowly faded out. all the orbs were fairly identical in size, shape, and color, and behavior. they all had an \"apparent\" size in the sky of approx. a golf ball, all maintained a fairly consistent glowing red color, all appeared suddenly in the sky at about 30 degrees above the horizon(with the exception of the last orb), and all slowly ascended to about 45 degrees before appearing stationary and then fading out."],"Weather Factors":"Unknown","trends":["There has been one other sighting in La Pine","There were no other sightings in La Pine on or around December 31st 2012"],"files":["/var/www/straped/mufon/html2text/44920.html.txt","/var/www/straped/mufon/org/44920.html"],"Source":"MUFON","Sighting Duration":"Undisclosed","Date of the Event":"12/31/2012 11:15 UTC","Longitude":"-121.495406","Case Number":"44920","Object Features":"None","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=43.67284,+-121.495406(44920)&iwloc=A&hl=en\"> mufon case (44920) map </A>","Tags":"City","Log Number":"US-01012013-0046","Region":"Oregon","Viewing Distance":"Over One Mile","City":"La Pine","Summary":"We observed 4 (total) slowly ascending red orbs. The first two simultaneously rising, followed by the 3rd within 1 minute, and the 4th about 3 minutes later.","Object Shape":"Circle"}