{"Tags":"City","Disposition":"Unresolved","Weather Factors":"Unknown","Case Number":"44927","Region":"Michigan","Source":"MUFON","files":["/var/www/straped/mufon/html2text/44927.html.txt","/var/www/straped/mufon/org/44927.html"],"Sighting Duration":"Undisclosed","Date of the Event":"01/01/2013 10:15 UTC","Latitude":"43.595511","Object Flight Path":"Stationary,Unknown","Log Number":"US-01012013-0053","Date Submitted":"01/01/2013 11:04 UTC","Object Shape":"Boomerang, Star-like, Triangle","Summary":"V-shaped object, multicolored stationery object observed way up in the sky.","trends":["There have been 7 other sightings in Bay City","There were no other sightings in Bay City on or around January 1st 2013"],"Longitude":"-83.881726","Viewing Distance":"Over 1 Mile, Unknown","divs":["sighting detailswhile looking at the moon from my living room window,(i live on the top floor of a five story apt. building.) i happened to notice a brightly lit star off to the southeast. when i looked through my binoculars, i noticed a multi-colored v-shaped object that was stationary. i'm reporting this right now as it's still just hovering there. it's way up!! don't know what it is, but i observed red blinking lights, along with a whole slew of different bright colors. i became excited as i do enjoy reading ufo articles. this is not my first sighting, and i made sure to anylize it thoroughly to rule out planes, stars, and\\or helicopters. whatever it is it's still there. to the naked eye it looks like a bright star. not sure of the angle. only when looking through binoculars did the v-shaped object come into view properly. am going to keep watching until i cannot see it anymore, so maybe i can give a more detailed report. i tried getting a pic, or video of the object, but it's too far away, and my android phone doesn't have a zoom option. gonna try and put the viewfinder into the eyepiece of my binoculars. probably won't work but worth a try. ty"],"Object Features":"Unknown","City":"Bay City","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=43.595511,+-83.881726(44927)&iwloc=A&hl=en\"> mufon case (44927) map </A>"}