{"Weather Factors":"Unknown","City":"Gastonia","Log Number":"US-01022013-0006","Object Shape":"Bullet, Missile, Oval","Viewing Distance":"Unknown","Longitude":"-81.137291","Tags":"City","Summary":"slow moving bight red-orange pulsating light","Region":"North Carolina","map":"<A HREF = \"http://maps.google.com/maps?q=35.2249,+-81.137291(44938)&iwloc=A&hl=en\"> mufon case (44938) map </A>","Sighting Duration":"00:02:15","files":["/var/www/straped/mufon/html2text/44938.html.txt","/var/www/straped/mufon/org/44938.html"],"Date of the Event":"01/01/2013 01:30 UTC","Country":"United States","trends":["There have been 8 other sightings in Gastonia","There were no other sightings in Gastonia on or around January 1st 2013"],"Object Features":"Unknown","Source":"MUFON","Latitude":"35.2249","Case Number":"44938","Object Flight Path":"Path with directional change","divs":["sighting detailsit was new years eve\\new years day around 12:30 am 1\\1\\2013 and it was dirizzing outside. i had stepped out side for a smoke when i was on my way back inside. i had noticed a couple hours before that there was a search light in the sky. well as i made my way back inside the house i noticed something very bight in the sky right above the search lights (about as high as a plane) moving east. at first i dodnt think nothing off it, but i noticed it wasent blinking red and green lights like a plane, it was a solid color, but pulsating. the color was a bight orange-red color, i noticed it was moving rather slower than a typical airliner would. the thing i found the most interesting was it seemed to make a sudden shift in travel and turned north and just vanished. i did get video on my cell (so quality is horrible and does not show in detail what i saw) after i realized it was \"different\". i am just curious to know what it was considering i know it was not a typical aircraft or even a man made on at that. p.s. the only way i know to get you the video is by emailing it over because its on my phone and i dont know how to transfer it over to my computer."],"Date Submitted":"01/02/2013 01:57 UTC","Disposition":"Unresolved"}