{"Object Flight Path":"Straight-line path","Date Submitted":"01/02/2013 03:40 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=18.370446,+-66.160597(44949)&iwloc=A&hl=en\"> mufon case (44949) map </A>","Disposition":"Unresolved","Source":"MUFON","Tags":"City","divs":["Sighting DetailsI am reporting the event for my acquaintance as fairly as I can because his computer is damaged. I will explain as clearly as I can what he told me that he and another witness saw on the 31rst of December 2012. They saw: Four lights approaching in the sky which he believed at the beginning that were airplanes, but had no other lights than the red lights they saw, non pulsating and making no noise. As they approached a certain point in the sky one by one, they vanished. A few minutes later, on a cloudless sky, they saw five similar red lights approaching again, same characteristics, and they vanished as the first four, except a 5th one that made an abrupt turn of 10 degrees to turn back, in the opposite direction it was first approaching. He said, no aircraft can do that.It flew back to where it was coming from until it vanished. He told me they seemed to be coming from the sea, so I ASSUME (if he is correct) that they would be flying North to South. I think this sighting may have a connection with the reports from Lakeland and Largo, Florida, happening on the 31st of December, 2012."],"Region":"BayamÃƒÂ³n","Summary":"Red dots moving slowly in one direction, truning aburptly and vanishing","Case Number":"44949","Object Shape":"Other","Log Number":"PR-01022013-0016","Sighting Duration":"Undisclosed","Country":"Puerto Rico","files":["/var/www/straped/mufon/html2text/44949.html.txt","/var/www/straped/mufon/org/44949.html"],"Longitude":"-66.160597","Latitude":"18.370446","trends":["There have been 3 other sightings in Bayamón","There were no other sightings in Bayamón on or around December 31st 2012"],"Object Features":"None","Weather Factors":"Unknown","City":"BayamÃƒÂ³n","Date of the Event":"12/31/2012 12:00 UTC","Viewing Distance":"Unknown"}