{"Disposition":"Unresolved","Region":"Florida","Date of the Event":"01/01/2013 07:30 UTC","Log Number":"US-01022013-0015","Object Shape":"Fireball, Star-like","Object Flight Path":"Path with directional change","Source":"MUFON","Date Submitted":"01/02/2013 03:18 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=25.93185,+-80.154848(44948)&iwloc=A&hl=en\"> mufon case (44948) map </A>","Latitude":"25.93185","files":["/var/www/straped/mufon/html2text/44948.html.txt","/var/www/straped/mufon/org/44948.html"],"Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Tags":"City","Longitude":"-80.154848","Sighting Duration":"Undisclosed","Summary":"Red star like lights in the sky","trends":["There have been 97 other sightings in Miami","There was one other sighting in Miami on or around January 1st 2013"],"divs":["Sighting DetailsI was just driving back home from the store with my mom around 7:30 PM, almost 5 minutes from my house when I started to notice these strange objects in the sky ahead and above. This is a busy, main street with fast food joints, a mall and such. Not out in rural area. I was just looking out the front window as these lights all of a sudden manifested. They started appearing one after the other, where I counted 5 total. They were a few feet apart from each other and on not immobile. I figured the first light was a plane because they have red, blinking lights on the wings. But one after the other started to glow and become visible, I ruled that possibility out. I started to tell my mom to look at the lights. She said they're probably planes, but planes don't just pop out of nowhere and become visible like that. They seemed to move while we were driving, but I couldn't pinpoint if they were and if it was just the movement of the car. We drove further and they looked to be moving as we passed under them. I couldn't get a good photo or video on my iPhone. We came home and didn't see any of the weird lights at all, only a plane and some bright stars. Within a minute or two, I saw a solo light from the previous ones we noticed while driving. It floated as if it was a lantern with fire, that sort of movement. It wasn't extremely windy either. I heard no noise, just what looked like a star shaped red light floating and moving in a horizontal way. It disappeared behind the clouds and that's the last I saw of it. I've seen some weird lights before, but this one puzzled me. And I've googled around and it seems I'm not the only person who's seem these in the last couple days. And not in my state as well. Hopefully I don't see anymore."],"Country":"United States","Case Number":"44948","Object Features":"None","City":"Miami"}