{"Case Number":"44945","Log Number":"US-01022013-0013","Sighting Duration":"Undisclosed","Object Shape":"Sphere","Tags":"City","Latitude":"28.827608","City":"Mount Dora","Disposition":"Unresolved","Viewing Distance":"Unknown","Date of the Event":"01/01/2013 07:10 UTC","Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=28.827608,+-81.651582(44945)&iwloc=A&hl=en\"> mufon case (44945) map </A>","Weather Factors":"Unknown","Summary":"7-8 distant red-orange shimmering objects observed above tree-line moving ENE over Eastern Lake County, FL","Object Features":"Unknown","Country":"United States","Date Submitted":"01/02/2013 01:43 UTC","Longitude":"-81.651582","Source":"MUFON","Object Flight Path":"Straight-line path","divs":["Sighting DetailsMy wife and I were driving in our car, approaching my mother's house in Mount Dora, FL. As we reached the top of a hill in the road we noticed 7-8 reddish-orange glowing, or shimmering objects above the tree line. They were as clear and bright as aircraft, and were very distinctive in the sky, so we backed up so we could observe them through a break in the trees. At first glance, they appeared like the red lights on power lines near an airport (There is NOT a major airport in the area), except the objects were in a somewhat broken \"W\" pattern instead of a straight line. Each object appeared to remain equidistant from each other, like in a formation. The objects were moving ENE and appeared to be over the Sorrento, FL area. As we watched, the objects slowly descended below the trees (horizon). Their movement was slow, and we could see them through the trees, until the tree density blocked them from our view. We observed the objects for approximately 10 minutes. My wife saw the objects quite clearly, and confirmed their sighting to my mother after we arrived at her house and reported our sighting to her. We were both excited about what we saw because we knew that they could not have been aircraft. Additionally, I was on my cell phone talking to a friend and hurriedly told him I had to hang up because of the UFO's we were seeing. I used the call history on my cell phone to confirm the time of sighting."],"files":["/var/www/straped/mufon/html2text/44945.html.txt","/var/www/straped/mufon/org/44945.html"],"trends":["There has been one other sighting in Mount Dora","There were no other sightings in Mount Dora on or around January 1st 2013"]}