{"Latitude":"40.866487","Country":"United States","trends":["There have been 3 other sightings in Selden","There were no other sightings in Selden on or around November 24th 1992"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.866487,+-73.035662(4494)&iwloc=A&hl=en\"> mufon case (4494) map </A>","Region":"New York","Summary":"Observed a flash and then a white/pinkish explosion that lit up the sky","Log Number":"US-02272006-0006","Source":"MUFON","Longitude":"-73.035662","Sighting Duration":"00:10:00","divs":["Sighting DetailsThis event happened when I was about 12 years old. The event has stuck in my head and still remains fresh as if it happened yesterday. I was at my home walking up the back stairs and usually just glance outside the windows as I walk up the stairs. I remember there was snow on the ground and then there was this flash of light. A few seconds after this flash I saw a light red, pinkish color illuminate the sky. I remember thinking to myself that it was similar to the Terminator 2 movie where there was a nuclear explosion. I got really scared and thought it was the end of the world. After staring at the sky for 15 seconds or so the lights disappered. I explained what I had seen to my parents and to some friends and I got the explanation that it was a transformer that had exploded or someone had shot off a roman candle. I never really accepted the fact that it was either of those things as the light lit up the whole sky - something that neither of those 2 things could have done. Recently I did some research and found out there had been a suspected UFO crash on Long Island on that date I nearly had a heart attack. I went onto google maps and found my home and then drew a line from the spot where I had seen the light emerge. The line extended almost exactly to Brookhaven Labs - the spot where the crash was reported. I did not see any type of craft or anything just the strange lights and what seemed like an explosion. I will agree with some of the reports that something did crash near Brookhaven Labs just not sure as to what it was."],"files":["/var/www/straped/mufon/html2text/4494.html.txt","/var/www/straped/mufon/org/4494.html"],"Viewing Distance":"Unknown","Case Number":"4494","Tags":"City","Object Shape":"Fireball, Flash","City":"Selden","Disposition":"IFO","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Date of the Event":"11/24/1992 07:00 UTC","Weather Factors":"Unknown","Date Submitted":"11/24/1992 07:00 UTC"}