{"Region":"Illinois","Country":"United States","Viewing Distance":"N/A","Log Number":"US-01022013-0017","Tags":"City","files":["/var/www/straped/mufon/html2text/44950.html.txt","/var/www/straped/mufon/org/44950.html"],"Source":"MUFON","Longitude":"-87.745163","Date of the Event":"11/07/2006 02:45 UTC","Object Shape":"Other","Weather Factors":"Unknown","Object Flight Path":"Stationary","City":"Chicago","Sighting Duration":"Undisclosed","Case Number":"44950","Disposition":"Unresolved","trends":["There have been 221 other sightings in Chicago","There was one other sighting in Chicago on or around November 7th 2006"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.970644,+-87.745163(44950)&iwloc=A&hl=en\"> mufon case (44950) map </A>","Summary":"it was so big that i thought everybody could see it so i just watched it for what seemed to be an hour","Object Features":"Other","Latitude":"41.970644","Date Submitted":"01/02/2013 05:19 UTC","divs":["Sighting Detailsi was on my deck in my hot tub . my view from there is north,west,andeast.my son was taking a nap from 2pm to4pm. i was sitting in the tub facing north.there are 2 flight paths just north of my home,and because i worked at ohare airport,i always look to the skies.both landing runways were being used and planes were coming in every 90 seconds or so.im 8 miles due east of ohare.when i looked to the west i saw the craft sitting just north of both landing runways at about 800 feet or so.it was very close to the airport. it was brownish in color and it dwarfed all the planes coming into ohare it was 2 to 3 times bigger than the biggest plane that was landing. it was chilly out,i thought so many people were seeing this that i didnt jump out of the hot tub to get cameras.i look back and consider it one of the biggest mistakes of my life. so i watched it until the acorn shaped craft went straight up and made a hole through the clouds.at some point i thought the craft knew i was watching it.but it could be me justifying why i didnt get out of the warm water to film it.of course when i heard later that day about the united guys seeing a saucer like craft over gate c-17,my sighting then became special.to this day im the only person that i know that describes a huge acorn like craft.i figured it was time to come out of the closet and at least tell of my sighting in case it helps someone keep their sanity.wow what a day CASEY this is my wifes e-mail please call me if you want to communicate with me. thanks for listening"]}