{"Log Number":"US-02272006-0007","Date of the Event":"02/08/2006 01:50 UTC","files":["/var/www/straped/mufon/html2text/4495.html.txt","/var/www/straped/mufon/org/4495.html"],"City":"McAlester","Country":"United States","Longitude":"-95.769713","Weather Factors":"Windy, Light","Summary":"I observed two disc shaped objects traveling due north in formation, the right lead, and the #2 in the eight-o-clock, traveling from overhead to the two -o-clock position at which time the right and then the left rose into a cloud.","Object Shape":"Disc, Saturn-like","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Latitude":"34.93343","Case Number":"4495","Source":"MUFON","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.93343,+-95.769713(4495)&iwloc=A&hl=en\"> mufon case (4495) map </A>","Object Flight Path":"Straight-line path,Path with directional change","Object Features":"Other","Date Submitted":"02/08/2006 01:50 UTC","divs":["sighting details8 feb 06, 1250 hrs, mcalester army ammunition plant, outfield secure area, next to the container outload facility, i often watch the aircraft,jetstreams, of the plains comming out of dfw airport 175 miles to the south, as i looked overhead i observed two disc shaped objects, traveling north in formation, the right\\lead and the left at the 8-o-clock position, their altitude when i first saw them was approx. a quater at arms length, when last seen, a nickle at the 2-o-clock high position, the center section of the disc's were redish\\rust color with a gray\\bluegray outer edge, i didn't know they came in multicolors?. the duration of the observation was one minute fourtyfive seconds, when last seen the right\\lead object rose stright up into a cloud and then the second, his wingman did the same, these were no convential aircraft, x- oh-6 pilot, air observer scout 101st ab, 5th special forces group, recon. needless to say we can have no cameras where i work, i guess i could draw them but not using computer graphics. i have seen smaller silvery objects tailing jet's on two other times, one did a 180 and rose up when another aircraft came out of the clouds."],"trends":["There have been 6 other sightings in McAlester","There were no other sightings in McAlester on or around February 8th 2006"],"Disposition":"Unresolved","Region":"Oklahoma","Sighting Duration":"Undisclosed"}