{"Object Flight Path":"Unknown","Disposition":"Unresolved","Region":"California","trends":["There have been 10 other sightings in Napa","There were no other sightings in Napa on or around December 27th 2012","This sighting has never been favorited.",""],"Date of the Event":"12/27/2012 12:00 UTC","Object Shape":"Sphere, Square, Rectagular","Log Number":"US-01022013-0026","City":"Napa","Latitude":"38.459011","Summary":"Lights that showed up on our pictures (3 different pictures) - all attached","Case Number":"44959","Viewing Distance":"Unknown","Object Features":"Unknown","Date Submitted":"01/02/2013 10:23 UTC","Longitude":"-122.41581","files":["/var/www/straped/mufon/html2text/44959.html.txt","/var/www/straped/mufon/more/44959_submitter_file1__IMG1244.JPG","/var/www/straped/mufon/more/44959_submitter_file2__IMG1245.JPG","/var/www/straped/mufon/more/44959_submitter_file3__IMG1246.JPG","/var/www/straped/mufon/org/44959.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.459011,+-122.41581(44959)&iwloc=A&hl=en\"> mufon case (44959) map </A>","Weather Factors":"Unknown","Tags":"City","Source":"MUFON","Country":"United States","Sighting Duration":"Undisclosed","divs":["sighting detailsmy husband and i were visiting the castello di amorosa winery in st helena (napa valley) on christmas break, on dec. 27 2012 more precisely. we did not observe anything in the sky with the naked eye at the time the pictures were taken, however, upon looking at the pictures after we got home, we noticed 2 separate sets of lights in each of the 3 of the pictures taken at this particular site from this angle (all pictures are attached). there was no noticeable aircraft in the area at the time the pictures were taken. it was a beautiful sunny and crisp december day. when you look at the pictures, you will see that the 2 objects appear to be at the same distance in each of the 3 pictures. the 2 objects appear to have different shapes however. none of the other pictures of the winery\\castle taken from different angles appear to have these lights. the pictures were taken with an iphone 4s. if you have any information about these objects, please let us know."]}