{"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/44954.html.txt","/var/www/straped/mufon/org/44954.html"],"Date of the Event":"01/01/2013 12:00 UTC","Region":"Indiana","Source":"MUFON","Country":"United States","Object Shape":"Circle","Sighting Duration":"Undisclosed","trends":[],"Tags":"City","Object Flight Path":"Straight-line path","Case Number":"44954","Object Features":"None","Date Submitted":"01/02/2013 07:34 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.275454,+-86.133782(44954)&iwloc=A&hl=en\"> mufon case (44954) map </A>","divs":["Sighting DetailsGroup of six people stepped outside of back of home to see if fireworks happening for new year's day. Giving cheers for New Year's all persons immediately noted a break on the dark cloudy sky of red show up and quickly cross the sky. Looking for fireworks, first thought was shooting rocket type firework, however, made no signs of breaking up like firework, showed and remained in ring-like shape until gone. Object appeared, traveled quickly with a SW heading, ascending what appeared to be from the ground off in the distance (within 700 feet of observer)disappearing from view within cloudy sky. This was immediately followed by a second, identical object with exact likeness in shape, color, trajectory, speed, and pattern of view. After sighting, all persons immediately discussed viewing and compared sightings. Later off into much further in distance at horizon, fireworks were then noted. These fireworks were red in color, yet were beyond the observable tree line and demonstrated characteristic explosion, separation, and gradual dissipation. This further confirmed the uniqueness of the two earlier observed objects as not being fireworks. All persons were excited about viewing, although no further \"feelings\" were reported from the observation. The two objects, one showing and disappearing before the second was noted following, were lost in view differently for the persons based upon location. These included those more in a Southern position \"disappearing behind the tree line\" blocking view and other more Northern position noting disappearing into clouds. As a side note, the sky was cloudy and prior to the observation of these objects, lightning-like flashes of white color were noted in the sky behind the clouds as well."],"City":"Undisclosed","Longitude":"-86.133782","Weather Factors":"Unknown","Latitude":"40.275454","Viewing Distance":"101-500 Feet","Summary":"At approximately midnight, six persons observed in dark, cloudy sky two consectuive objects red, ring shaped with hazy glow appear low at horizon, ascending with southwestern direction and disappear into sky (one object gone, then second repeats pattern","Log Number":"US-01022013-0021"}