{"Date Submitted":"01/02/2013 05:31 UTC","Object Flight Path":"N/A","Summary":"Possible abduction.","Log Number":"US-01022013-0018","Tags":"City","Region":"Iowa","divs":["Sighting DetailsFollowing normal evening routine. -Took sleeping meds approx midnight. Fell asleep I believe between 0100-0200 -0730 approximately wake up on floor on dog's bed (No recollection of how I got there), legs straight but crossed left over right with no lateral room for movement. Right arm was in an up position with palm under the back of my head. Left arm was resting alongside my body. -Ordinarily I have no dream recall but upon waking vividly recall laying on a bed with an attractive blonde woman and having some sort of telepathic communication. -When I woke up I felt compelled to check the electronics around the house to see if anything seemed to be interrupted, did not find anything. -After checking electronics went to bathroom to urinate and found that my genitals smelled as if I had had sex recently, which I had not knowingly. In addition my genitals felt sore as if I had cum repeatedly. -Checked my body from head to toe looking for any kinds of marks, found none. Did find a point on my ribcage on my right side on the lowest attached rib approximately 4 inches out from the sternum that was tender to the touch. -Was abnormally alert and rested upon waking up considering that the amount of sleep that I would have gotten was considerably shorter than I normally get."],"Weather Factors":"Unknown","Latitude":"41.587306","Object Features":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","Case Number":"44951","trends":["There have been no other sightings in Montezuma","This sighting has been favorited 2 times."],"Object Shape":"Unknown","City":"Montezuma","files":["/var/www/straped/mufon/html2text/44951.html.txt","/var/www/straped/mufon/org/44951.html"],"Date of the Event":"01/02/2013 12:00 UTC","Longitude":"-92.52725","Disposition":"Unresolved","Country":"United States","Viewing Distance":"N/A","map":"<A HREF = \"http://maps.google.com/maps?q=41.587306,+-92.52725(44951)&iwloc=A&hl=en\"> mufon case (44951) map </A>"}