{"Summary":"blue green light streeked over my car as i came to a stop on hwy 119 at the intersection where 119 meets 80 / 26","Region":"Georgia","Object Features":"None","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","Date of the Event":"12/31/2012 07:30 UTC","Disposition":"Unresolved","Source":"MUFON","Object Flight Path":"Straight-line path","City":"Guyton","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=32.336304,+-81.391499(44952)&iwloc=A&hl=en\"> mufon case (44952) map </A>","divs":["Sighting Detailsi was coming home from a family members house with my wife around 7:30 we made our way down 119 heading east and we where about to turn left on 80 to go northwest as soon as we came to a stop i looked to my left to look for oncoming cars and in the sky far down the road about 1000 feet in the air and about 2-4 miles away was a blue green light that passed right over the car with no noise it left a trail of blue white light that faded about 300-400 feet behind it. the object made a run of about 1 mile in the sky in about 2 sec over the car and headed southeast. the entire event lasted about 7 sec i had enough time to role my window down to see it as it was coming towards us i practically was pushing my wife out the car window so she could see it but it was already gone. living in guyton i see a lot of air craft coming and going from Savannah hiltonhead airport and this was no plane if it was a meteorite in space burning up in the atmosphere it would of had bean as big as a mountain and spouting blue green light while going thousands of mph without breaking up."],"Longitude":"-81.391499","trends":["There have been no other sightings in Guyton","This sighting has never been favorited."],"Log Number":"US-01022013-0019","Date Submitted":"01/02/2013 06:58 UTC","Tags":"City","Sighting Duration":"Undisclosed","Object Shape":"Circle, Fireball, Oval, Star-like","Case Number":"44952","Latitude":"32.336304","files":["/var/www/straped/mufon/html2text/44952.html.txt","/var/www/straped/mufon/org/44952.html"]}