{"trends":["There have been no other sightings in Gibson City","This sighting has never been favorited."],"City":"Gibson City","divs":["Sighting DetailsI was sitting in my car at roughly 11:40 pm after having come home from the gas station. I stopped to loom out my window at the stars like i sometimes do. After star gazing for a few seconds i turned off my car and proceeded to exit the vehicle upon doing so i happened to look up and saw three red-orange spheres in a diagonal line pattern. I stopped and watched as the three spheres flew from the edge of the horizon moving from south west to north then curved slightly and pro eeded northeast. The event was very brief due to the objects speed which was not immensely fast but noticeably faster than a plane. At first i was unsure of what it was i saw but due to the very abnormal appearence and speed i immeadiately assumed it to be a ufo or at least some top secret government plane. The spheres had no noticable surface and no flashing lights or distinguishing markings. They were solid red-orange with a faint glowing orange aura to them. They disappeared from view over the horizon. During the sighting i was awe-struck, i have never seen anything like it before in my life and all i could think was how out of place and odd of a situation it was. After it was gone from sight i just sat back in my car and tried to commit as many details of it to memory as possible."],"Object Shape":"Sphere","Longitude":"-88.372205","files":["/var/www/straped/mufon/html2text/44964.html.txt","/var/www/straped/mufon/org/44964.html"],"Latitude":"40.462261","Viewing Distance":"Unknown","Sighting Duration":"00:01:30","Tags":"City","Country":"United States","Object Features":"None","Summary":"3 orange lights in diagonal pattern moving southwest to northeast over town","Source":"MUFON","Region":"Illinois","Date Submitted":"01/02/2013 11:39 UTC","Date of the Event":"01/01/2013 11:40 UTC","Case Number":"44964","map":"<A HREF = \"http://maps.google.com/maps?q=40.462261,+-88.372205(44964)&iwloc=A&hl=en\"> mufon case (44964) map </A>","Disposition":"Unresolved","Log Number":"US-01022013-0031","Object Flight Path":"Path with directional change","Weather Factors":"Unknown"}