{"Date of the Event":"01/02/2013 10:07 UTC","Object Shape":"Disc","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/44968.html.txt","/var/www/straped/mufon/org/44968.html"],"trends":["There has been one other sighting in Upper Marlboro","There were no other sightings in Upper Marlboro on or around January 2nd 2013"],"Disposition":"Unresolved","Country":"United States","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.817367,+-76.746451(44968)&iwloc=A&hl=en\"> mufon case (44968) map </A>","Region":"Maryland","Latitude":"38.817367","Tags":"City","Source":"MUFON","Summary":"After taking close to 800 frames with my Nikon D90 I found this object in 19 frames","divs":["sighting detailsi was photographing chemtrails on tuesday jan. 2, 2013, like i do whenever the chemtrails are being sprayed, which is almost every day and had taken around 800 photographs. while reviewing and selecting photographs to upload to my site i noticed a green object in 19 different frames. i have one set of 4 frames with the object, one set of 13 frames and one set of 2 frames with the object. i'm going to upload the last photo of all taken yesterday. the photo has the metadata you need. note: as you can see in the metadata the shutter speed at this time is 1\\2500s, and this object is moving much faster than that. the human cannot see anything that moves that fast. only a camera can capture something that fast. no feelings, just another ufo photo which i will add to my collection of other ufo photos. i selected this photo as the craft is tilted and one of the better shots. i was not using a tripod and some of the 19 photographs of this object are blurry since the camera is hand held. the majority of the photographs are of what i believe to be the bottom of the craft since the object can be seen to be perfectly round."],"Date Submitted":"01/03/2013 07:47 UTC","Sighting Duration":"00:00:01","Viewing Distance":"Unknown","Log Number":"US-01032013-0002","Longitude":"-76.746451","Case Number":"44968","City":"Upper Marlboro","Object Features":"None"}