{"Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Region":"Texas","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","divs":["Sighting DetailsGot back from the pool hall around 9:45. Took my dog out for frisbee around 10. About 15 to 20 mins later I noticed an odd orange star in the treeline. Stared for a moment and went back to play. A minute later I noticed its speed increase and three than a fourth one followed. I couldn't believe my eyes. They almost looked like paper lanterns except a could front was blowing se. It couldn't be. Air traffic going to dfw airport usually travel se or e. l snapped one shot on my iPhone and filmed the blinking three that stopped above and south from me. The lead light continued toward the roofline of my house. It was interesting seeing them pulse and blink. The bottom light approached another light and it began to pulsate and dim out like an incandescent bulb. Eventually after the others blinked out leaving the lead orb traveling west over I-35. I ran to the other side of my house but lost it. These were no lanterns or aircraft. Please reply back. Somebody had to have seen this too. Excuse the audio. I was awestruck and on weed. Thank you for your time. Mike"],"City":"Denton","Weather Factors":"Unknown","Tags":"City","Object Shape":"Fireball","Longitude":"-97.164825","files":["/var/www/straped/mufon/html2text/44963.html.txt","/var/www/straped/mufon/org/44963.html"],"Date Submitted":"01/02/2013 11:10 UTC","Log Number":"US-01022013-0030","Country":"United States","Object Features":"Unknown","Date of the Event":"12/26/2012 11:20 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","trends":["There have been 22 other sightings in Denton","There were no other sightings in Denton on or around December 26th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.222461,+-97.164825(44963)&iwloc=A&hl=en\"> mufon case (44963) map </A>","Summary":"Throwing frisbee with my dog. Saw an orange orb. More followed. Filmed it. Dream come true.","Latitude":"33.222461","Case Number":"44963"}