{"divs":["Sighting Detailsi was at work on the night shift, when i went outside to get something out of my car,as i was leaving my car i heard this chug chug noise like a train at the same time there was a humming noise, i thought it sounded nearby so i stood there for a few seconds and looked around, the noise got louder and i was looking in the direction of the noise when i noticed a dark cloud going overhead aprox 125 ft. the cloud was almost the same color as the sky behind it,but you could see the outline of it, it was aprox 75 to 100 foot long moving at aprox 10 miles an hour, it was only in my sights for about 35 seconds ,the noise i heard for close to 3 minutes,my first reaction was to call someone(the police) but i talked myself out of it as i thought they would think i was nuts,so i told myself to forget all about it, and i did! which is what bothered me the most because i dont remeber what made me recall the whole incident,almost two years later, its hard for me to believe i would not tell someone right away, when i finally talked about the whole thing i did get a few people laughing at me, im not nuts or making this up."],"Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/4496.html.txt","/var/www/straped/mufon/org/4496.html"],"Date of the Event":"11/30/1999 12:00 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.900101,+-71.089767(4496)&iwloc=A&hl=en\"> mufon case (4496) map </A>","Source":"MUFON","Sighting Duration":"Undisclosed","Date Submitted":"11/30/1999 12:00 UTC","Weather Factors":"Unknown","Latitude":"41.900101","Country":"United States","Summary":"sounded like a train and a humming noise, appeared to be cloaked in a dark cloud overhead about 125 feet moving slowly out of sight.","City":"Taunton","Viewing Distance":"101-500 Feet","Log Number":"US-02282006-0001","Region":"Massachusetts","Object Features":"Unknown","trends":["There have been 8 other sightings in Taunton","There were no other sightings in Taunton on or around November 30th 1999"],"Disposition":"Unknown","Longitude":"-71.089767","Case Number":"4496","Object Flight Path":"Straight-line path"}