{"Longitude":"-82.449008","Region":"Florida","Object Shape":"Fireball, Sphere","Date Submitted":"01/03/2013 10:46 UTC","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/44969.html.txt","/var/www/straped/mufon/org/44969.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=27.937029,+-82.449008(44969)&iwloc=A&hl=en\"> mufon case (44969) map </A>","City":"Tampa","Case Number":"44969","Log Number":"US-01032013-0003","Object Flight Path":"Path with directional change,Path then hovering","Object Features":"None","Country":"United States","Tags":"City","Date of the Event":"12/31/2012 07:30 UTC","Summary":"Ball of light (Orb/Sphere) moving in direct line south. Stops, hovers, changes abruptly to NW flight path.","trends":["There have been 105 other sightings in Tampa","There was one other sighting in Tampa on or around December 31st 2012"],"Latitude":"27.937029","divs":["Sighting DetailsSeven of us were outside a residence at a social gathering when one person called our attention to the Orange Glowing ball,Orb, Sphere of light moving from the North of Tampa to South (directly at us) at 7:30 December 31st, 2013 from David Island-Tampa. It looked like a blinking star at first when it was further away, but it was larger. As it approach it took on more of a Meteor appearance but it was traveling too slow and low with no tail. Once it was the size of a small aspirin in the sky, it stopped and hovered for perhaps 15 seconds. We guessed it was over a heavily populated area of Tampa and not more than 5 miles from the Tampa International Airport. After pulsating and glowing as if it was the exhaust of a fighter jet, It made a 90 degree turn and began to ascend west-northwest blinking on and off and jumping on and off its path. The red-yellow-orange glow appeared as if we were looking into a furnace. No Noise from it at all. As I mentioned before, the glow seemed to diminish once in awhile and in and then come back bright and pulsate. It captured every one of us and took all of the attention as we all stood up and moved to see it better as it moved behind some tree tops for a few seconds that were near the house. As we were watching it we discussed that it was like watching a video that was having \"tracking\" issues. The object seemed to shift off path and then get back on path again rapidly. Every one of us was confident that it was not a plane, helicopter or star. It was too low and it's movement was a big turn and not just a star misjudged. . There was a commercial plane off in the distance with normal lights to judge the difference in our sighting. We were all excited about the fact that we were witnessing something very different and that we were all together to confirm what we each saw. We watched it come towards us, hover then accelerate away rapidly. We lost sight as it climbed away from us into clouds and the light disappeared."],"Viewing Distance":"Over One Mile"}