{"map":"<A HREF = \"http://maps.google.com/maps?q=33.430419,+-83.967177(44977)&iwloc=A&hl=en\"> mufon case (44977) map </A>","divs":["Sighting DetailsAt around 2am my cousin and I went outside to get away from a house full of people. We lived in Jackson in a wooded area. We sat in the car listening to music and talking about girlie stuff. We were just talking, listening to the radio, and looking at the sky when we saw a \"star\". I can't even remember who noticed it first, but then it looked kind of close so she said \"I think thats an airplane\".i said.\".no it can't be...there aren't any lights on the side.\" Then we thought maybe it was the angle .. It was an airplane that was facing our direction and that's why we couldn't see the side lights maybe... We watched it because it just seemed \"off\" or strange somehow.then it darted diagonally upward ... i guess you could say a 2 oclock direction from where it was before that.... then darted toward to the left. it then made a spiral .. And we were both like omg! It's a crashing helicopter!.. But then it just stopped and hovered. We then realized there's no way a helicopter can move that fast in the distance it would have travelled that far up in the sky... It moved WAY faster than any airplane could. ...then it went diagonally across as fast as a shooting star moves and disappeared completely."],"trends":["There has been one other sighting in Jackson","There were no other sightings in Jackson on or around September 2nd 1993"],"Case Number":"44977","Region":"Georgia","Latitude":"33.430419","Summary":"A single light. Looked like a plane or helicopter light at first until we realized it had no lights by the wings like airplanes do... It was a single light... Moving all over a times, spiraled at one time..then ascending to nothing.","Country":"United States","Log Number":"US-01032013-0012","Object Features":"Unknown","Longitude":"-83.967177","files":["/var/www/straped/mufon/html2text/44977.html.txt","/var/www/straped/mufon/org/44977.html"],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","Tags":"City","Date of the Event":"09/02/1993 12:00 UTC","Weather Factors":"Unknown","Date Submitted":"01/03/2013 12:31 UTC","Disposition":"Unresolved","Object Shape":"Unknown","City":"Jackson"}