{"Longitude":"1.078909","files":["/var/www/straped/mufon/html2text/4497.html.txt","/var/www/straped/mufon/org/4497.html"],"Region":"England","divs":["Sighting DetailsMy son and I were walking from our flat on Dover Road to the off license on the strand (just round the corner). There was a person in front of us and it was a quiet evening. We'd popped out for a bar of chocolate each. We crossed the road and the person in front of us walked around the corner and out of sight to us. Someone else on the other side disappeared down Liverpool road and the road went very quiet which was unusual for the busy main road into Deal town. It was six in the evening. I turned round to look behind us because it was so quiet and it was a long road into the distance behind us which stretched up an incline in the distance but there were no cars and we found ourselves alone. then i noticed three lights in an equilateral triangle as i viewed it (not tilted from my perspective) move steadily and silently from above the roof tops over our flat and i said to my son 'hey look!' at first he didn't but i said 'look quick! what's that?' and we both saw it as it slid slowly and steadily and silently (It was silent because there were no cars or people anywhere anymore) quite low down in the sky. It would have needed a grapefruit held at arms length to have covered the lights in a triangle. Yellow on top, green to the left, and red at the bottom. I said 'wouldn't it be funny if it was a ufo?' and giggled but frowned too as it struck me as very peculiar but as i was with my son i didn't take it seriously. as it passed us the bottom light reflected off the slate tiled roof of the first house on the strand. So i knew it was tangible. as soon as it disappeared someone walked from the strand onto Dover road towards us adn as i looked behind us the line of traffic the headlights in a row all began descending the incline of the road in the distance. I said to jack 'shall we run and see it along the houses?' but we both decided not to as it would have disappeared by the time we'd run along the road and got onto the beach. I asked my son to describe and draw what he'd seen separately to me and we compared later. we both saw the same thing and our drawings were the same. We moved house since and don't know where they are but it stuck in our memories and we still talk about it now."],"Sighting Duration":"00:01:00","Object Features":"Unknown","Weather Factors":"Unknown","Country":"United Kingdom","map":"<A HREF = \"http://maps.google.com/maps?q=51.280233,+1.078909(4497)&iwloc=A&hl=en\"> mufon case (4497) map </A>","Date of the Event":"02/26/2004 06:00 UTC","Source":"MUFON","Object Flight Path":"Straight-line path","Tags":"City","Log Number":"GB-02282006-0002","Date Submitted":"02/26/2004 06:00 UTC","Disposition":"Unresolved","Summary":"Three coloured lights. top one yellow. right one green. bottom light red. equilateral triangle to my view. no slant in perspective.","Latitude":"51.280233","Object Shape":"Triangle","trends":["There have been 3 other sightings in Canterbury","There were no other sightings in Canterbury on or around February 26th 2004"],"Case Number":"4497","City":"Canterbury","Viewing Distance":"21-100 Feet"}