{"Object Flight Path":"Other,Unknown","Tags":"City","divs":["Sighting DetailsWe were driving back from a beach trip, we were about thirty minutes outside of Aberdeen when my friend Tim said \"that plane is flying weird\". We all looked out the side window and observed what looked to be a diamond shaped craft, descending at an odd angle, it was just above the tree line and it had five lights, four white ones on each corner and a red blinking one in the middle, it was very large in size, I'm not sure exactly maybe 40-50 feet, maybe more, it's hard to gauge size when you're looking at something you can't explain, anyway we watched and listened, as it made no sound, and it flipped upside down and disappeared into the night sky, when it flipped you could see one of the lights as stationary so the whole thing must have completely rotated upside down, then it took off and it was gone. As we were watching it, we all tried to rationalize what we were seeing, oh it's a plane, it's some secret military project, but our rational minds began to fail us when we saw it flip upside down while one light stayed stationary, we knew no man made craft that could maneuver like that, we just observed in awe and wonder, we weren't afraid, we were more excited than anything, we had just seen a UFO and we never would have if Tim hadn't noticed the odd angle it was flying at, so we saw it as a unique experience that we all get to share now for the rest of our lives, it was truly a once in a lifetime experience and I know we will never forget it."],"Date Submitted":"01/03/2013 11:21 UTC","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=32.865726,+-79.991001(44972)&iwloc=A&hl=en\"> mufon case (44972) map </A>","Source":"MUFON","Disposition":"Unresolved","City":"North Charleston","Summary":"Black diamond shaped UFO, we observed 5 lights, one on each corner and one blinking red one in the center, it was at an angle as it looked to be descending then it flipped upside down and disappeared into the night sky","Longitude":"-79.991001","Latitude":"32.865726","Object Shape":"Diamond","Log Number":"US-01032013-0006","Object Features":"None, Unknown","files":["/var/www/straped/mufon/html2text/44972.html.txt","/var/www/straped/mufon/org/44972.html"],"Country":"United States","trends":["There have been no other sightings in North Charleston","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Case Number":"44972","Weather Factors":"Unknown","Date of the Event":"01/02/2013 07:40 UTC","Region":"North Carolina"}