{"Tags":"City","Source":"MUFON","Case Number":"44974","files":["/var/www/straped/mufon/html2text/44974.html.txt","/var/www/straped/mufon/org/44974.html"],"Log Number":"US-01032013-0009","Date Submitted":"01/03/2013 11:57 UTC","Latitude":"39.643928","Object Shape":"Triangle","Summary":"Late Night drive, Found Bright lights, Followed me, I hid under thick tree cover, UFO searched back and forth then left.","divs":["Sighting DetailsI was 17. My girlfriend (at the time) and I pick our two friends up in my Jeep to the well-known Batsto Rd in the Pine Barrens. In the dead of night, it is easily among one of the creepiest roads in Burlington County and we were trying stumble upon the Jersey Devil but what we got was something equally as great. We were a bunch of teens who went out and \"ghost hunted\" and \"monster hunted\" for fun and we got the find of a life time. I was driving down Batsto Rd and noticed three extremely bright lights, stadium lights at a football field, completely still above the leafless trees. I pointed it out to my friend in the back and he rolled down the window and leaned out. It began to move towards my vehicle and I started to pick up speed. My friend who got out of his seat practically on my roof kept yelling \"GO!GO!GO!\" as I took the curves the best I could of the windy Batsto rd. It was over my car until it lost sight of me when i approached thick tree cover. I turned my lights off and parked in the dirt circle of Batsto Rd. The UFO was not visible but its light was. Its paced back and forth down the road as it was looking for me. I gained sight of the UFO again and watched it disappear like an X-wing jumping to hyperspace."],"Object Flight Path":"Stationary,Hovering then path,Path with directional change","Longitude":"-74.644033","Sighting Duration":"05:00:00","Date of the Event":"12/15/2009 10:00 UTC","trends":["There have been 5 other sightings in Washington","There were no other sightings in Washington on or around December 15th 2009"],"Region":"New Jersey","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.643928,+-74.644033(44974)&iwloc=A&hl=en\"> mufon case (44974) map </A>","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","Country":"United States","Disposition":"Unresolved","City":"Washington"}