{"Object Shape":"Circle, Oval, Sphere, Square, Rectagular, Teardrop","Region":"Arizona","map":"<A HREF = \"http://maps.google.com/maps?q=32.898705,+-111.791752(44988)&iwloc=A&hl=en\"> mufon case (44988) map </A>","Weather Factors":"Unknown","Log Number":"US-01032013-0023","Case Number":"44988","City":"Casa Grande","Disposition":"Unresolved","Object Features":"None","Viewing Distance":"Over One Mile","Summary":"glowing object. changed shape,look.","Longitude":"-111.791752","Source":"MUFON","Object Flight Path":"Stationary,Path with directional change,Unknown","Latitude":"32.898705","Date Submitted":"01/03/2013 04:42 UTC","trends":["There have been 35 other sightings in Casa Grande","There were no other sightings in Casa Grande on or around May 10th 2011"],"Tags":"City","Sighting Duration":"Undisclosed","Date of the Event":"05/10/2011 06:15 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/44988.html.txt","/var/www/straped/mufon/org/44988.html"],"divs":["Sighting Detailsapprox, May of 2011... went to walk my dog.it was about 6.15 am. in pinal co. arizona. was large glowing object in the sky. at about 1,000- 3,000 ft. off the ground at a ditance of about 15-25 miles? at first i thought it was a hot air balloon and thought nothing more of it. it was at about 6.45 am. i went to my backyard to do some yard work. looking up and to my south i saw it. it was still there. now because of morning light it showed up as translucent. the more i looked at it the more i began to realize, this is no balloon. i watched it for 30 min. it seemed to look dull then glownig white at times. i marked a spot on my wall with a stick then put rocks where my feet were. to mark my exact stance and location to the object. i then noticed after 15-20 min. it was not moving or gaining alltitude. i then called fox 10- news arizona. told them what i was seeing and was told, they were aware of it. and it was a weather balloon passing over. that was released from luke a.f.b. arizona. for 2 more hours i watched this thing change shape color, things appeared to go in and out of it! by 10.30 am i had called back to fox 10- news to see what and if they saw and filmed this thing has i had. this time however i was told not to worry. they are going to run a report on it. and that it was a weather balloon that had malfunctioned. and was released from some private place in new mexico. with all this said i have photos taken from my i phone 4..i have clear photos of what appears to be a grey floating donut. then in other photos it appears as a glowing orb and in others a single massive rod hanging verticaly in the sky. and still another that now shows 2 glowing verticle objects that i beleave are hundreds of feet long. and have it all photographed!! please help me to get the photos from my phone as i donot know how to forward them to you.. respectfully submitted, t.w."]}