{"Sighting Duration":"Undisclosed","Latitude":"37.59024","Date of the Event":"08/11/2011 04:28 UTC","Weather Factors":"Unknown","Date Submitted":"01/03/2013 02:36 UTC","Object Flight Path":"Stationary","Region":"Kentucky","Log Number":"US-01032013-0020","Object Shape":"Circle, Fireball","Disposition":"Unresolved","Longitude":"-86.309864","Summary":"S. West about 30ft off the ground my Wife seen it frist","Case Number":"44985","Source":"MUFON","divs":["Sighting DetailsI was taking my wife to work and she said to me want that was glowing in the woods? We live on Rough River in Hudson,Ky.This thing lite up the whole woods and I didn't think about it and told her it was the moon shining and that all it was. Well I keep on driving and when we got on the main Road , she ask me were was the moon and it wasnot there I said I wish I stoped When we seen the object and investacated because it was gone . I dont know what it was but I can say I was it Too. I can tell you about other events I have seen with witness Like My Mother and I was a circular clear and clouds in it and my Mother was it too And the one my wife and I was in the sky that looked like a could in a perfected Rectangle shape. And one that was in a triangle shape that was in the nite sky had no sound and the next day a guy in were we lived at that time came over and ask me if I saw the bite light in the sky last nite.I don't know why I got a connection with the ufos but I do think that it got to do with the time my Twin Brother and I saw one one day we were in the field working and it landed in front off us."],"Tags":"City","Viewing Distance":"101-500 Feet","Country":"United States","Object Features":"Patterned Surface","trends":["There have been no other sightings in Hudson","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=37.59024,+-86.309864(44985)&iwloc=A&hl=en\"> mufon case (44985) map </A>","City":"Hudson","files":["/var/www/straped/mufon/html2text/44985.html.txt","/var/www/straped/mufon/org/44985.html"]}