{"divs":["Sighting DetailsAt around 11:50 p.m. on Dec. 31, 2012, I was on the phone with my daughter. I sit directly across from my window which faces south west. Being on the 16th floor I have a great view over the city. As I talked I sighted a few fireworks going off in the distance. Then I saw, what I first thought were more fireworks going off around the horizon. I was surprised to see this one kept climbing higher and kept going, headed in a north east direction. It seemed to move in a straight direction as it arced across the sky (no zig zag and no blinking). It had to have traveled the length of the city. When it went over my building I could no longer view it. It seemed fan shaped to me. The wide part of the fan was at the front and the narrow part followed behind. (More lights at the front and fewer behind - It sort of looked like a fiber optic type fan) The lights seemed mostly white but there may have been a few dimly colored pinkish blue lights as well - that's why my first impression was fireworks. It moved fairly quickly and only lasted about 6 seconds. I told my daughter \"I think I am seeing a U.F.O\" and began to describe it to her. We discussed all the possibilities of what I may have seen. I have seen satellites and I often see airplanes, jets, helicopters, and large balloons out my window and this was not anything like that. This object moved much faster. I know the difference. In my 60 yrs. I have never seen anything like this before. I wonder how many people spot UFOs and don't tell anyone or bother reporting them. I was not going to report this but others urged me to do it."],"trends":["There have been 43 other sightings in Winnipeg","There was one other sighting in Winnipeg on or around December 31st 2012"],"Summary":"It seemed fan shaped.The wide part of the fan was at the front with more lights and the narrow part followed with less lights. It sort of looked like a fiber optic type fan.","Case Number":"44980","City":"Winnipeg","Latitude":"49.864052","Log Number":"CA-01032013-0015","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=49.864052,+-97.133578(44980)&iwloc=A&hl=en\"> mufon case (44980) map </A>","Date Submitted":"01/03/2013 12:44 UTC","files":["/var/www/straped/mufon/html2text/44980.html.txt","/var/www/straped/mufon/org/44980.html"],"Longitude":"-97.133578","Date of the Event":"12/31/2012 11:50 UTC","Country":"Canada","Object Features":"Unknown","Region":"Manitoba","Disposition":"Unresolved","Tags":"City","Source":"MUFON","Object Shape":"Chevron"}