{"Country":"United States","Viewing Distance":"Unknown","Region":"Texas","Longitude":"-96.384164","Log Number":"US-01032013-0030","Source":"MUFON","Object Features":"Unknown","Tags":"City","Latitude":"30.127089","City":"Brenham","Sighting Duration":"Undisclosed","Summary":"Short bright white repetitive light that was originally thought to be lightening. Did not get up to check it out as the weather was wet/damp/foggy.","Date of the Event":"12/31/2012 12:00 UTC","trends":["There have been 2 other sightings in Brenham","There were no other sightings in Brenham on or around December 31st 2012"],"Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/44996.html.txt","/var/www/straped/mufon/org/44996.html"],"Case Number":"44996","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.127089,+-96.384164(44996)&iwloc=A&hl=en\"> mufon case (44996) map </A>","Date Submitted":"01/03/2013 07:38 UTC","Disposition":"Unresolved","Object Flight Path":"Unknown","divs":["Sighting DetailsI had just gone to bed around 3:00am and was lying in my bed when the flashing repetitive lights started. I originally thought it was lightening and my boyfriend had evidently falled asleep as he did not see it. There were probably about 15-20 flashes and one that seemed to pulse through the bedroom. I never heard thunder, and there was no rain that I know of. I fell asleep after a few minutes and I think I woke once or twice and saw it again once again thinking it must be lightening but still no thunder. Yesterday, Jan 2 my boyfriend asked me if I saw the lights about 6:00-6:30am that same morning. I said no I did not but then I told him what I had experienced New Years Eve and asked him if he saw that as we had just been talking before I saw the lights but he had fallen asleep quickly and did not see any of them. Our two dogs did see them and actually growled and barked some and at the time I told them to be quiet as it was just lightening and to settle down and go to sleep which they did in a few minutes. After seeing the interview on Channel 13, ABC, KTRK Houston News at 6:00pm tonight of the lady that saw what she believed to be a UFO in Cleveland, TX on Dec. 30th and the Agent from MUFON I went online and decided to report what I saw as well. Hindsight, now I wish I had gotten up and went to look as Ive always believed in Alien occurrences. Respectfully,"]}