{"Longitude":"-80.848626","Date of the Event":"01/01/2013 12:00 UTC","trends":["There have been 9 other sightings in Titusville","There were no other sightings in Titusville on or around January 1st 2013"],"divs":["sighting detailsi was celebrating new years eve 2012\\13 with my girlfriend (only 2 drinks)and we went outside at midnight to watch the fireworks being shot off in the neighborhood. at about 12:10 am we turned to go back into the house when i noticed an orange sphere about the size of a catalope coming towards my house from the south. there was absolutely no sound to it. the sphere was moving slowly north (about 10 mph)and was about 50 to 70 feet above the ground. the sphere went across my house and was moving so slowly i thought it would fall and land in my neighbor's front yard, i thought it was some type of fireworks. when the sphere was directly over us we could see flames blazing on the backside as if the slight wind from it's movement was pushing the flames to the back. we stood there watching it and it never did fall to the ground. the sphere kept going about the same altitude over my neighbors house across\\through the tree line until it was out-of-sight. we noticed one of our neighbors standing outside of his home and was looking in the same directionl. we think he had seen it but we don't speak spanish so we didn't discuss it with him. my girlfriend and i spent the next couple of hours discussing what it could be but couldn't come up with an explantion. i had talked with another neighbor later that day and as i started discribing the sphere (fireball) he was able to finish my discription because he had witnessed the same thing only about 3-4 hours earlier and traveling in a different direction."],"Object Flight Path":"Straight-line path","Case Number":"44991","Object Features":"None","Summary":"Small sphere of fire move slowly across the sky.","Object Shape":"Fireball, Sphere","Sighting Duration":"Undisclosed","Latitude":"28.640966","Region":"Florida","Disposition":"Unresolved","Source":"MUFON","Tags":"City","City":"Titusville","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/44991.html.txt","/var/www/straped/mufon/org/44991.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=28.640966,+-80.848626(44991)&iwloc=A&hl=en\"> mufon case (44991) map </A>","Log Number":"US-01032013-0026","Country":"United States","Viewing Distance":"21-100 Feet","Date Submitted":"01/03/2013 06:43 UTC"}