{"Country":"United States","Case Number":"44990","Date Submitted":"01/03/2013 06:09 UTC","Viewing Distance":"501 Feet - 1 Mile","City":"St. Louis","Object Shape":"Circle","Object Flight Path":"Straight-line path","Tags":"City","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/44990.html.txt","/var/www/straped/mufon/org/44990.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.612819,+-90.253016(44990)&iwloc=A&hl=en\"> mufon case (44990) map </A>","divs":["Sighting DetailsMy wife and I were sitting on our back deck at our apartment in the Hill area of st louis. It was approximately 930 - 10 pm. Not a cloud in the sky. It was a warm night, and a little windy. maybe 20 mph winds coming from the west. Looking up in the sky towards the city of st louis we see glowing objects above the city and flying towards our direction. They were bigger balls of light than any aircraft I have ever seen up close. Very round. I remember thinking that it was probably hot air balloons, the great forest park air balloon race was earlier that day. Shortly after thinking that we noticed that there were several of these orbs in the sky. Then a few started to speed up. They seemed to be playing with on another. They continued to fly on their original path, but would weave in and out of each other then would slow down greatly while another would speed up. This lasted 4 minutes at the most. They continued heading west south west against the wind. I remember noticing the wind when they had originally started speeding up and slowing down. I called the local news and gave them a report."],"Weather Factors":"Unknown","Log Number":"US-01032013-0025","Latitude":"38.612819","Longitude":"-90.253016","Disposition":"Unresolved","Summary":"6 or 7 flying objects increasing and decreasing speed","trends":["There have been 5 other sightings in St. Louis","There were no other sightings in St. Louis on or around September 19th 2009"],"Source":"MUFON","Object Features":"Unknown","Region":"Missouri","Date of the Event":"09/19/2009 09:30 UTC"}