{"Source":"MUFON","Summary":"While driving saw flames in outside rear view mirror. Crested hill lost sight for several seconds. Vehicle overtook by aircraft flat bottom no lights perfect delta . Trailing edge. schraded like bread knife and belved at about 30 degrees.","Latitude":"39.024894","Disposition":"Unresolved","Object Features":"Patterned Surface","Country":"United States","Sighting Duration":"00:01:01","map":"<A HREF = \"http://maps.google.com/maps?q=39.024894,+-93.734404(44993)&iwloc=A&hl=en\"> mufon case (44993) map </A>","Weather Factors":"Unknown","divs":["Sighting DetailsWhile on routine patrol as police Sgt. At about 0100 hrs.Traveling on rural Hwy. south toward I 70. A clear and starry night. My attention was drawn to outside rear view mirror where I saw three columns of flames above ground lever. The flames appeared as when you light an oxy-accedeling torch without oxygen. Very lofty and sooty. As I was still driving south at 55 mph. The road went down a hill and I lost sight of the craft. I reached to bottom of the hill and saw the craft had caught up to me. No longer seeing the flames just the shape by it blocking the night's sky. The craft was just off the eastern edge of the highway. The altitude looked to be less then 200 ft. Rang 0 . The size was hard to judge. Half of the craft was outside my view as is was over my car. The bottom of the craft was flat black. The eastern wing seemed to extend about 150 to 200 ft. I saw no lights at all on the craft. I had rolled down my window could not hear any unusual noise other then wind noise. As the craft overtook me I saw it was a very sharp pointed leading edge straight line out to wingtip.. The craft overtook me where I could see the trailing edge..it was straight across except it looked like the edge of a bread knife with 8 scallops and it was beveled as a knife edge at about 30 degrees . I could see that the craft was a perfect delta except for that feature. Appeared to be apptoximatly a 70 degree delta wing. I live about 35 miles from Whiteman AFB, I have seen the B2 all the time flying over this area. The craft I saw could carry the B2 on it's top with room to spare. The angle of the nose was a steeper angle then the B2. As it passed over the I-70 area I could see the spine of the top of the craft..unlike the B2 it had no \"bubble\" for the crew compartment. It was completely flat and smooth on top. The craft continued south straight and level until it went out of sight."],"Object Shape":"Triangle","Log Number":"US-01032013-0027","Date of the Event":"02/08/1997 12:00 UTC","Viewing Distance":"20 Feet or Less","Longitude":"-93.734404","Tags":"City","trends":["There have been no other sightings in Higginsville","This sighting has never been favorited."],"Date Submitted":"01/03/2013 07:08 UTC","Case Number":"44993","files":["/var/www/straped/mufon/html2text/44993.html.txt","/var/www/straped/mufon/org/44993.html"],"Object Flight Path":"Straight-line path","City":"Higginsville","Region":"Missouri"}