{"files":["/var/www/straped/mufon/html2text/45002.html.txt","/var/www/straped/mufon/org/45002.html"],"Longitude":"-95.113544","Source":"MUFON","Object Flight Path":"Straight-line path","Summary":"black triangle with 4 bright lights I a line flew slowly over my car about 150 yards above ground","Weather Factors":"Unknown","City":"Webster","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=29.539872,+-95.113544(45002)&iwloc=A&hl=en\"> mufon case (45002) map </A>","Object Shape":"Triangle","divs":["Sighting DetailsI was driving home from work, just turned onto el Dorado headed west off of I45 when I notice 4 very bright lights sitting in a row in the sky just above the trees. I noticed it out the corner of my left eye. I thought it might have been a new light pole since I had never noticed it before, but the lights were becoming much larger. I was driving about 30 mph and started to slow down as the lights were starting to move over the trees. I couldn't take my eyes off of it. there were multiple cars around me driving on the invest 2 lane road, all of which slowed down.the object moved overhead, it was very large, maybe a football field long. it moved directly over my car and the other deadheading northeast. From underneath it was a solid black triangle with the top being at the back of the craft. at this point, I had rolled down my windows and heard no sound other than that of the other cars, typical rolling tire noise. I became very frightened, I could feel my pulse beating in my face. I went to my apartment about 3 minutes away, grabbed my video camera and ran out the door back into the car. I headed back toward i45 hoping to get a good camera shot and it was gone. I drove around for a good 20 minutes trying to find the lights. I know what I saw and I know im not going to get any sleep tonight."],"Country":"United States","Viewing Distance":"20 Feet or Less","Date of the Event":"01/03/2013 07:45 UTC","Date Submitted":"01/03/2013 11:08 UTC","Tags":"City","Region":"Texas","Disposition":"Unresolved","Object Features":"None","Log Number":"US-01032013-0036","Latitude":"29.539872","Case Number":"45002","trends":["There have been 3 other sightings in Webster","There were no other sightings in Webster on or around January 3rd 2013"]}