{"Log Number":"NZ-01032013-0035","files":["/var/www/straped/mufon/html2text/45001.html.txt","/var/www/straped/mufon/org/45001.html"],"Country":"New Zealand","Region":"Bay Of Plenty","Object Flight Path":"Stationary","divs":["Sighting DetailsI had been visited a month before the last contact.I was stopped on the highway near wiakino queensheads by a white ball of light ,the ball of light spoke to me and said follow me lead me to a bit of land just off the highway and said to me stay here with me,with in 15minutes i felt a sudden woof of hot air i looked up and saw a huge triangle shaped craft moving towards me and suddenly stopped about 30 foot above me,the next thing i was levertated into the ship by the white ball of light i found myself in a brightly lit up room,then i was spoken to buy the entity that i preveisly met before,the entity said old freind we will see one another soon we don't live in space we live here on earth in the fabric of time as you will all learn the secrets are in the crop circles.We have the souces here on earth to create new science, and make energy from our crops this energy is found all around us and in our space the sun makes this energy is called matter it is found in our selfes in trees plants insects it also passes through thick metel plates.We are been observed by the entity every day to see how we are all progressing year affter year the Entiti watches over us .Study the crop circles there are far cheaper way to make electrity ,there are other ways to make this planet more enjoy able to live."],"Summary":"Black silent moving Triangle shape space ship.","Viewing Distance":"21-100 Feet","Object Shape":"Sphere, Triangle","Disposition":"Unresolved","Source":"MUFON","Case Number":"45001","Weather Factors":"Unknown","Date Submitted":"01/03/2013 10:17 UTC","Longitude":"175.94142","trends":["There have been no other sightings in Waihi Beach","This sighting has never been favorited."],"Date of the Event":"11/20/1978 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=-37.407898,+175.94142(45001)&iwloc=A&hl=en\"> mufon case (45001) map </A>","Object Features":"Patterned Surface","Tags":"City","Latitude":"-37.407898","Sighting Duration":"Undisclosed","City":"Waihi Beach"}