{"Object Flight Path":"Stationary","Summary":"My wife & I saw a Silver disc 20' off the ground, about 50' from us. Could have hit it with a rock!","Region":"Alabama","Object Shape":"Disc","Log Number":"US-01042013-0009","Viewing Distance":"21-100 Feet","files":["/var/www/straped/mufon/html2text/45011.html.txt","/var/www/straped/mufon/org/45011.html"],"Disposition":"Unresolved","Object Features":"Dome","Date Submitted":"01/04/2013 01:16 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.177776,+-86.783333(45011)&iwloc=A&hl=en\"> mufon case (45011) map </A>","Latitude":"33.177776","Country":"United States","Sighting Duration":"Undisclosed","Longitude":"-86.783333","Weather Factors":"Unknown","Source":"MUFON","Case Number":"45011","trends":["There have been 3 other sightings in Calera","There were no other sightings in Calera on or around December 18th 2012"],"Date of the Event":"12/18/2012 05:00 UTC","City":"Calera","divs":["sighting detailswhile driving north on i-65, we saw something with 2 bright, white flood lights & a blinking red light in the middle. the lights were brighter than any, i have ever seen. we thought it was a tower. i was supposed to turn left after getting off at the shelby co. airport exit....but just had to go right and check it out. as we got closer(about1 1\\2mi. n. of the airport) i kept saying \"i don't see any legs on that tower\" my wife was busy facebooking it on her phone & only looked up for seconds at a time, to say \"it's a tower\" the closer we got the more i insisted, there were no legs on this \"tower\". we got right next to the thing, & i told her \"look at it!\" she finally, looked up & didn't say a word! we saw from very close up...a silver disc, with white lights on either side & a red flashing light on the middle front. i felt as if it was watching us because it was tilted towards us.she said \"lookout!\" as i was going into the other lane and a car was coming. we then had a 2 story building, between us & it. i whipped it around, & went right back(less than 60 sec. had passed) it was gone! i said...\"where'd the tower go baby!\" lol we felt excited and nervous for several hours after the sighting. i had left my video camera in our other vehicle, so no photos. i know of 4 other people that say they saw it too, but none checked it out as we did."]}