{"divs":["Sighting DetailsI was sleeping at around 3am i had woke up to see a ball of light flashing several diffrent colors. I have a very large windows and belcony that attatch to my bedroom. I thought it may be a helicopter or plane, we do live were both fly over often. But when the colors changed from green to red to blue i knew it wasnt either. The lights would always fade back to white and the there was no order or pattern in the colors. It was very dark so i couldnt make out a shape, I was the same height as the helicopters that fly by but a little further to the west of us.. It also had a camera like flash that would flash in a cone like distince from the ball of color.. It was always a white light that would flash from beneath it.. I moved very smooth and to the north and south and west to east very quick but effortlessly.. I didnt take my eyes off of it only stayed a close distance a few min.. I moved further west and stayed there for a good half hour and then moved north and i stoppped watching it.. I also had called my motherinlaw, mother, husband, and sister. My mother inlaw lives with us and came upstairs to look.. She looked at it while it sat at the distance from furhter out.. It looked like a flickering star to anyone else who didnt know what to look for, she said it could just be two stars flickering over one another. But i could still see the colors changing because i had seen up close.. very weird and scary.."],"trends":["There have been no other sightings in Clare","This sighting has never been favorited."],"Log Number":"US-01042013-0008","Weather Factors":"Unknown","Date of the Event":"01/04/2013 03:35 UTC","Object Flight Path":"Hovering then path","Disposition":"Unresolved","Case Number":"45010","Tags":"City","Country":"United States","Latitude":"42.022523","Summary":"I woke up at around 3am to see a light flashing green, blue, red, and white. It then had a camera flash, white sparkeler look that flashed from underneath it.","Sighting Duration":"Undisclosed","City":"Clare","Object Features":"Unknown","Region":"Illinois","Longitude":"-88.754558","Source":"MUFON","Date Submitted":"01/04/2013 12:17 UTC","Viewing Distance":"Over One Mile","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/45010.html.txt","/var/www/straped/mufon/org/45010.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.022523,+-88.754558(45010)&iwloc=A&hl=en\"> mufon case (45010) map </A>"}