{"Latitude":"52.509875","files":["/var/www/straped/mufon/html2text/45012.html.txt","/var/www/straped/mufon/org/45012.html"],"Weather Factors":"Unknown","Object Features":"Unknown","Summary":"star like in night sky. then desended and stopped and then went straight back up and disappeared.","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=52.509875,+-1.865187(45012)&iwloc=A&hl=en\"> mufon case (45012) map </A>","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Country":"United Kingdom","divs":["sighting detailsi was in my garden at about between 2\\3 am doing what i usually do which is signaling the night sky with a uv light source (a bit of a experiment ive been doing now for a number of years)when my cousin who was sleeping over that night came out into the garden and asked what i was doing.i told her \"i'm sending a s.o.s. i hope of attracting the people visiting are planet from other solar systems, she had a bit of a giggle then said as she took out her mobile phone \"there is a s.o.s. app on my phone\" . i smiled and said to her that i didn't usually see much in the ne\\e sky so you signal up that way and ill signal w ....as she started signaling i was just about to turn to the west when i noticed the the roofs of the row of houses i live on lighting up very bright, i turned back to look where my cousin was signaling and saw a bright object, no discernible shape save it was very bright and round. it descended real quick lighting up where we were, stopped and then went straight back up into the night sky to a pin prick of light and then disappeared . we both stood there in shock, are jaws on the floor you might say. all this happened in a matter of seconds and was silent. after this happened my cousin went back in the house and i tried to resend the signal but to no avail, well night ."],"Log Number":"GB-01042013-0010","Longitude":"-1.865187","Object Shape":"Star-like, Unknown","Date Submitted":"01/04/2013 01:32 UTC","Tags":"City","City":"Birmingham","Case Number":"45012","Source":"MUFON","trends":["There have been 57 other sightings in Birmingham","There were no other sightings in Birmingham on or around July 8th 2007"],"Region":"","Object Flight Path":"Straight-line path","Date of the Event":"07/08/2007 02:30 UTC"}