{"files":["/var/www/straped/mufon/html2text/45019.html.txt","/var/www/straped/mufon/org/45019.html"],"Date Submitted":"01/04/2013 04:41 UTC","Summary":"7 orange lights, 3 flying in formation. Not conventional aircraft.","Source":"MUFON","Region":"Michigan","Object Flight Path":"Straight-line path","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=42.823541,+-84.678431(45019)&iwloc=A&hl=en\"> mufon case (45019) map </A>","Log Number":"US-01042013-0016","Sighting Duration":"Undisclosed","Tags":"City","Latitude":"42.823541","divs":["sighting detailsi was just making it home from work, when i spotted 7 orange lights in the sky to the south of my home. i got my wife, and we continued to watch the objects. i then got some binoculars and we informed the neighbor who had a party going on, and she and some of her guests witnessed these objects too. stabilized and looking through the binoculars, i could see that 3 of the objects that were in a triangular formation, that i originally thought were one aircraft, was actually 3 separate lights. the ones not in formation appeared to make movements in random directions, slowly, but still moving. they all had a glow around them at 360 degrees and did not appear to have solid structure. one of the objects appeared to have an extremely bright conic orange glow emanating from the bottom of it. towards the end of the observation, this object appeared to slowly fade out. my original thought was that it shot off at and extremely high rate of speed, but i watched it thought the binoculars, and could see it remained the same size, just got dimmer until it finally disappeared. i would estimate that these objects were from 5-7 miles from my location, flying at 1,500 feet, and moving from wsw to ene. they were moving at a very slow airspeed, less than that of a aircraft on approach with full flaps. they looked to be near the junction of 69, 96, and grand river ave all intersect. their direction would have them running straight at the e\\w runway at city airport in lansing, but their flight pattern did not suggest that they were descending. i have had 12 years experience with observing aircraft as part of my job, and i know for certain that these were not conventional aircraft."],"Longitude":"-84.678431","Country":"United States","Object Features":"Other","City":"Grand Ledge","Viewing Distance":"Over One Mile","Object Shape":"Fireball, Sphere","Weather Factors":"Unknown","Date of the Event":"12/31/2012 10:53 UTC","Case Number":"45019","trends":["There have been 4 other sightings in Grand Ledge","There were no other sightings in Grand Ledge on or around December 31st 2012"]}