{"Viewing Distance":"Unknown","Longitude":"-122.204078","Region":"California","trends":["There have been 24 other sightings in Oakland","There were no other sightings in Oakland on or around November 11th 2012"],"Tags":"City","Case Number":"45018","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.79383,+-122.204078(45018)&iwloc=A&hl=en\"> mufon case (45018) map </A>","Log Number":"US-01042013-0015","files":["/var/www/straped/mufon/html2text/45018.html.txt","/var/www/straped/mufon/org/45018.html"],"Disposition":"Unresolved","Weather Factors":"Unknown","City":"Oakland","Latitude":"37.79383","Country":"United States","divs":["sighting detailsi was having a smoke on a clear evening when i saw a strange orange\\red light moving across the sky. others soon appeared from the same location as the previous ones. they all took the same \"route\" and it was not a straight line. there was no wind to move possible \"lanterns\" like that. once they would disappear, others would appear from the same exact location in sky that the previous ones came from, and travel same exact path. lanterns cannot do this. no blinking lights like planes have. airport is a few miles away, but i have seen planes all my life while living here. these were no planes. i called my mother to confirm that i was seeing something, and she was astonished at seeing these, and could provide no explanation. i took a few pictures with my cell phone, and ran inside to grab my camera. i was able to take several shots, but camera is not great. i was really just taking pictures hoping something would come out. they eventually stopped. i later saw an object just hovering in the same general area that they disapearred to. very bright object. looked like a star, but stars do not move, and as other stars slowly move across the sky, this one did not. upon viewing the pictures on my computer, i noticed some strange objects...maybe they were made because i am not a great picture taker.( i could not stay still), but they seemed unusual after our experience. i have attached the photos. decide for yourself....i have several other interesting photos on this. the one thing i cant figure, is if these objects are just blurry, why are all the other backrounds not? first and last pictures are the best..."],"Object Flight Path":"Path with directional change","Object Shape":"Fireball, Sphere, Other","Source":"MUFON","Date of the Event":"11/11/2012 10:29 UTC","Date Submitted":"01/04/2013 04:29 UTC","Summary":"Saw multiple lights appearing in distance. One after another would fly SAME course, then disappear.","Object Features":"Unknown"}