{"Viewing Distance":"501 Feet - 1 Mile","Region":"California","Disposition":"Unresolved","Summary":"Unknown object with no sound flew over me and in a straight line off towards the northwest","Latitude":"32.759624","Log Number":"US-01052013-0011","Date of the Event":"01/04/2013 11:20 UTC","trends":["There have been 13 other sightings in La Mesa","There were no other sightings in La Mesa on or around January 4th 2013"],"City":"La Mesa","Weather Factors":"Unknown","Case Number":"45038","Object Flight Path":"Straight-line path","Country":"United States","Source":"MUFON","Object Shape":"Cross","Sighting Duration":"Undisclosed","Date Submitted":"01/05/2013 03:49 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.759624,+-117.064033(45038)&iwloc=A&hl=en\"> mufon case (45038) map </A>","divs":["Sighting DetailsI was sitting in my La Mesa backyard facing NW when I looked up and saw a strange looking thing fly above me heading northwest from the south There was no sound whatsoever and appeared to be approx the size of a Cessna 150. It appeared to be approx 800 to 1,000 ft above me. There were absolutely no clouds that day and the sky was clear and blue. As it flew overhead of me it appeared to be rounded or dome shaped on the bottom of the craft with stubby-looking wings that had blunt edges. The \"wings\" appeared to be the same width from where it attached to the dome to the end of the wing. The craft appeared to be a dull cream color when I looked at the underbelly, but then seemed to become a darker almost grey color as I saw it in profile. I wondered for a second if it could be a very large bird with large outstretched wings in a straight glide, but quickly realized that the speed was much greater than what a bird would do in a glide, plus it traveled in a very fast and straight path. I watched it for a few more seconds and then it just simply vanished while in mid-flight. It did NOT disappear behind a tree nor did it disappear into the horizon. It just vanished."],"files":["/var/www/straped/mufon/html2text/45038.html.txt","/var/www/straped/mufon/org/45038.html"],"Longitude":"-117.064033","Tags":"City","Object Features":"Dome, Wings"}