{"files":["/var/www/straped/mufon/html2text/45037.html.txt","/var/www/straped/mufon/org/45037.html"],"Disposition":"Unresolved","divs":["Sighting DetailsOn the evening of December 29, 2012, at approximately 5:50PM, I was walking my dog down our street, heading in a west-southwesterly direction. The sun was almost finished setting, and the sky was mostly clear. As I was looking up into the sky, which I regularly do when dog-walking, I noticed a \"star\" that was as bright as Venus, but in a different location. Venus, at that time of night, is almost directly due East. This \"light\" was on a south-southwest path in the sky...looking up, it was also about 70-75 degrees above the horizon. At first I thought it was coming towards me, and that the \"big bright light\" was the headlights of a jet. Then I realized that it was going AWAY from me, and that the quality of the light coming from it was different to that of a jet headlight...more like it was lit from within. With this understanding, the dog and I stopped in our front yard...I watched. As I looked on, the \"light object\" dimmed a bit, then, SPLIT INTO 3 separate smaller objects. Each one, though not as bright as the original, was also a \"ball of light\". As soon as they were clearly separated from one another, they took off in 3 different directions...1 took a more southerly route, 1 went straight forward for a second then shot straight UP, and the third one banked sharply to the right(my right) and headed on a north-northwest trajectory. The time that elapsed between separation and all 3 being no longer visible was about 15-20 seconds. As for a time frame, from first sighting to the end, the entire event lasted around 45 seconds to a minute.\" It was not only fascinating, it was quite intense. Feel free to email me."],"Summary":"Star-like object observed for 30 seconds or so, then same object separates into 3 distinct objects","Log Number":"US-01052013-0010","City":"Orlando","Case Number":"45037","Viewing Distance":"Unknown","Date of the Event":"12/29/2012 05:50 UTC","Region":"Florida","Object Shape":"Star-like","trends":["There have been 112 other sightings in Orlando","There were no other sightings in Orlando on or around December 29th 2012"],"Country":"United States","Object Features":"Unknown","Source":"MUFON","Longitude":"-81.183878","map":"<A HREF = \"http://maps.google.com/maps?q=28.574023,+-81.183878(45037)&iwloc=A&hl=en\"> mufon case (45037) map </A>","Sighting Duration":"Undisclosed","Tags":"City","Object Flight Path":"Path with directional change","Date Submitted":"01/05/2013 01:37 UTC","Weather Factors":"Unknown","Latitude":"28.574023"}