{"Source":"MUFON","Date Submitted":"01/05/2013 12:59 UTC","Tags":"City","Date of the Event":"07/14/2012 09:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=-33.753982,+150.99197(45033)&iwloc=A&hl=en\"> mufon case (45033) map </A>","Object Features":"None","Weather Factors":"Unknown","Object Flight Path":"Stationary","Viewing Distance":"Over One Mile","City":"Castle Hill","Case Number":"45033","Longitude":"150.99197","Region":"New South Wales","Disposition":"Unresolved","Country":"Australia","divs":["sighting detailsme and my dad were leaving the house to drive to the hospital to see a close relative when i looked up at the sky as my dad was reversing the car and in a far distance i saw a red\\orange coloured sphere floating next to a star. i didn't think it was a star due to the bright colour, shape and distance between it and the star. i got my dad out of the car and told him to have a look at it. my dad saw it and agreed it looked nothing like a star and in my dads words he said \" its way to close to the star to be a star\" we both had no idea what it was and i said do you think its a ufo and my dad said \"good chance it is\" my dad has seen 2 ufos both close to him so he has a genreal idea of what some of them tend to look like. the ufo was small but the colour was very bright and it looked like it was almost slowly flashing. we left as we were late getting to the hospital but when we came back about 2 hours later around 11pm i looked to see if it was there but it had dissapered but there was a small grey cloud where the ufo was before. i felt rather confused on what was there and in the sky there were not many clouds there at all except the small grey one."],"Log Number":"AU-01052013-0006","trends":["There have been no other sightings in Castle Hill","This sighting has never been favorited."],"Sighting Duration":"00:02:00","Summary":"A Red/Orange Sphere hovering quite close to a star far up in the sky","files":["/var/www/straped/mufon/html2text/45033.html.txt","/var/www/straped/mufon/org/45033.html"],"Object Shape":"Sphere","Latitude":"-33.753982"}