{"Object Flight Path":"Stationary,Path then hovering,Other,Unknown","files":["/var/www/straped/mufon/html2text/45032.html.txt","/var/www/straped/mufon/org/45032.html"],"Disposition":"Unresolved","Summary":"At about 12:02 or 03 we (my friend, Godmother, and I) along with three other neighbors I alerted in the street saw what we thought were fire works, then flares, and finally thought were planes. We saw 3 on the lower left bottom form an unbroken Triangle.","Tags":"City","Viewing Distance":"Unknown","Date Submitted":"01/05/2013 06:03 UTC","Sighting Duration":"Undisclosed","Latitude":"25.762879","map":"<A HREF = \"http://maps.google.com/maps?q=25.762879,+-80.380568(45032)&iwloc=A&hl=en\"> mufon case (45032) map </A>","trends":["There have been no other sightings in Sweetwater","This sighting has never been favorited."],"Longitude":"-80.380568","Date of the Event":"01/01/2013 12:00 UTC","Region":"Florida","Weather Factors":"Unknown","divs":["sighting detailsi recently read the accounts posted about the weird lights in miami but i have to say.....i'm at a loss for words here. my friend and my madrina (godmother or master in santeria) all saw those lights. but we thought it was only in our area. it seems they appeared all over the skies from the descriptions we read. my friend lives at right around the corner from florida international university (fiu) in the city of sweetwater in miami, fl. we saw as many red-orange lights appeared in the sky, rising slowly from the west. this was two or three minutes after midnight on 1\\1\\13. from what i saw, 6 or more objects, fiery red orange orbs rose into the sky some distance behind some of the other apartment complexes. they were so bright i expected them to be fire works or even flares but they did not explode in the air as we expected. in fact, we saw that they just stayed there. we thought they may have been flares, but then they just stayed there, some occasionally having gone higher but that was it. then, the bottom far left half had three that went into formation as a triangle. we imagined perhaps there were planes but planes that just stayed suspended in the air like that? it makes no sense. they made no noise and gradually all semed to vanish, that is to say the lights went away as the last flicker of candle light would be extinguished. only one remained in the sky and he vanished much the same way. i've never seen anythimg like this. the three neighbors we alerted are the other three witnesses. i just want to know what's goin on here. i've read that other people saw them in their areas far from sweetwater. how and why can so many have been in the miami skies in more than one area?"],"Source":"MUFON","Object Features":"Other, Unknown","Object Shape":"Cone, Cylinder, Fireball, Sphere, Other","City":"Sweetwater","Country":"United States","Log Number":"US-01052013-0004","Case Number":"45032"}