{"trends":["There have been no other sightings in Walnut Cove","This sighting has never been favorited."],"Summary":"Defined trianglur craft pulsing lights east to se with zig-zag dip and rise...","Longitude":"-80.166066","Viewing Distance":"Unknown","Object Features":"Patterned Surface","Weather Factors":"Unknown","Disposition":"Unresolved","Country":"United States","City":"Walnut Cove","Region":"North Carolina","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was taking my dog out at 11:15 and after hooking him to his tie out turned to reenter my home and noticed the craft to the east. o be honest I was scared to death, never saw anything like this. I glanced for a second at my watch and noticed the second hand was jerking. I was very scared. The thing moved quickly, from the east in a slightly zig-zag pattern, light was or seemed to be a part of the body. It pulsed, but was wavey like the highway in summer. It stopped for just a moment hovering, then sped off to the se and upward faster than I have ever seen anything moveand vanished completely. I was stunned! I never really belived in these things...to be honest, I vomited. It was only visible to me for about a minute and a few seconds, but it felt like forever. I do not want my name published as I am an exfelon, and I think to associate my name will discredit the entire event. This is the single most frightening event in my life, I was not drinking or under the influence of any substance...and am certain of what I saw."],"Tags":"City","Case Number":"45048","Date Submitted":"01/05/2013 11:30 UTC","Log Number":"US-01052013-0019","Date of the Event":"01/04/2013 11:15 UTC","Latitude":"36.382037","map":"<A HREF = \"http://maps.google.com/maps?q=36.382037,+-80.166066(45048)&iwloc=A&hl=en\"> mufon case (45048) map </A>","Source":"MUFON","files":["/var/www/straped/mufon/html2text/45048.html.txt","/var/www/straped/mufon/org/45048.html"],"Object Shape":"Triangle"}