{"Source":"MUFON","Country":"Romania","Latitude":"44.437711","Region":"","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Log Number":"RO-01052013-0013","Object Features":"None","files":["/var/www/straped/mufon/html2text/45041.html.txt","/var/www/straped/mufon/org/45041.html"],"Disposition":"Unresolved","Date Submitted":"01/05/2013 06:28 UTC","Summary":"large black disk about 4 miles diameter, with multiple lights on","Tags":"City","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=44.437711,+26.097367(45041)&iwloc=A&hl=en\"> mufon case (45041) map </A>","Object Shape":"Circle, Disc","divs":["Sighting DetailsI was at my vacation house with my ex-husband and two friends, bout 2.30 am when they were living my house,I open the front door for them and while all of us were walking to the front steps, in front of us we all did see this huge disk.It sat still for about 4 minutes with some of the light on, but right before to live, more lights went on and start to turn rapidly in a sequence and after few seconds it just went up, turning the whole disk and disappeared in a fraction of a second to E side of the city.Problem is that my house is close to 2 main airport and the disk seems to stay above one of them.The day after, a friend of mine which his wife was a security guard at the airport, he told me that all was paralyzed over the airport for 5 minutes. In 2010 I meet my second husband which he reside at that time in the E side of the city and at exactly at that time in night he was outside with some friends of his, seeing the whole ship above their heads, so measuring the distance I come up with 4 miles diameter of the ship.I did see it from the side, not from under. Between 1965-1966, I remember very well some facts which I can not forget but also I can not have the answers.Being a child, 5 years old, living in a building with 4 high floors, at the 4-th floor was our apartment and on the top ,the roof. I do remember just how I was taken in many night over the window and put me on the roof by some one as a male, felling OK not scared, and after the same protocol, back in the room, BUT, on the last night he put me back on the table we had in the bedroom, a one leg table, round.I remember very well that my mom was sleeping with me and she did wake up, seeing me there on the top of that table she start to ask questions how could I get there because that table was so unstable.I remember that I told her that HE put me there and she took me in her arms and put me in bed.Later on, about in 2004, November, being in Florida on the beach , running, the sky got black and it start to rain really bad.No one was on the beach anymore, just me, so I start to get afraid of the lightning, it was bad and the rain and the wind, so I remember that I start to walk to the parking lot, which was 2 miles away, but I never got there, until 3 h after, I was jut there, having no recollection of how I got there of the time passed. All this are just facts, but what is more curios is that in any airport, embassy or high security door I pass, the metal detector is making a sound as I have a chip in my body, which I believe I have, in my leg I have a scare since I was a kid, round ,also I have silicium in my body and some other nano things. I was researching all over the net to find any of the transcripts of that night, but I did not find so maybe you can do that, it was a large disk and is impossible NOT to have any script by the state, picture of it and so on.The ship was large, black, and the side was full with lights, it was not a rounded ship as you have in here, it was a modern flat one."],"Case Number":"45041","Longitude":"26.097367","trends":["There have been 3 other sightings in Bucharest","There were no other sightings in Bucharest on or around November 18th 1998"],"Sighting Duration":"Undisclosed","City":"Bucharest","Date of the Event":"11/18/1998 02:30 UTC"}