{"Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","Log Number":"US-01052013-0016","Latitude":"40.732696","Sighting Duration":"00:00:10","Longitude":"-89.61264","Region":"Illinois","Summary":"Huge blue circle shaped object came down from clouds","City":"Peoria","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=40.732696,+-89.61264(45045)&iwloc=A&hl=en\"> mufon case (45045) map </A>","Disposition":"Unresolved","Source":"MUFON","Date Submitted":"01/05/2013 10:19 UTC","Object Shape":"Circle","Country":"United States","trends":["There have been 7 other sightings in Peoria","There were no other sightings in Peoria on or around January 5th 2013"],"divs":["Sighting DetailsMy daughter, grandson and I all witnessed this event driving home tonight. We all were looking in the same direction and a HUGE blue ball or circle shaped object descended from the cloudy sky at around 6:48pm. It was glowing very bright and blue. We believe it was trying to land because it seemed to have hit a power line(s) and then blue sparks went all around and were falling towards the ground. We don't know if the object either disintegrated or actually hit the ground after hitting the power lines. When we drove near where we think the object hit the power lines, all the traffic lights and street lamps were completely out. A utility truck had a spot light and was surveying the skies back and forth with the spot light which we thought was odd. There is no way this could have been anything other than a UFO. No transformers come from the sky and blow up after hitting a power line! My truck's radio cut off and the heat vent quit blowing near where this object had descended. We all were really terrified! I wonder if anyone else has noted this event since there were many vehicles on the highways tonight. Our cell phones also quit working and went dead which totally sucked since we immediately went for our phones to try to record the happening! The whole event lasted for under 10 seconds."],"files":["/var/www/straped/mufon/html2text/45045.html.txt","/var/www/straped/mufon/org/45045.html"],"Case Number":"45045","Weather Factors":"Unknown","Date of the Event":"01/05/2013 06:48 UTC","Tags":"City"}