{"Source":"MUFON","Longitude":"-81.879809","Latitude":"26.692874","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/45046.html.txt","/var/www/straped/mufon/org/45046.html"],"Country":"United States","Summary":"noisless reddish-orange glowing,slightly pulsating enity","Object Flight Path":"Straight-line path","City":"North Fort Myers","Date Submitted":"01/05/2013 10:46 UTC","Date of the Event":"01/04/2013 06:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=26.692874,+-81.879809(45046)&iwloc=A&hl=en\"> mufon case (45046) map </A>","Case Number":"45046","Weather Factors":"Unknown","Log Number":"US-01052013-0017","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 2 other sightings in North Fort Myers","There were no other sightings in North Fort Myers on or around January 4th 2013"],"Object Shape":"Unknown","divs":["Sighting DetailsNorth Fort Myers,Fla. Jan.4th,2013 There are about six of us who live in a gated community that take a daily bike ride around our park around 6:00 P.M. to 7:00 P.M...Three men and our three wives. Two of us men have seen ufos in the past. I myself have seen two over 60 or so years.One of the other men had also seen one several years back.My two were different types. Each nite as we ride, we joke if we see something bright in sky ,the person who sees it first yells out \"look UFO\".Then as we look harder we see some red or green flashing lights,usually a plane leaving or arriving at RSW airport. At about 6:45 P.M. we were coming around the bend of the road that borders a small lake within our park.One of the women yells out \"Look UFO\" and points to what I believe is North,the rest of us turned and saw a glowing reddish - orange light coming toward us from over the small lake. We stopped or bikes,looked and said \"What the heck is that\" it appeared to be quite low, our guess about 2000 ft or so. It passed a little in front of us right over our heads, maintaining same the altitude heading some what South.Being so low we looked for some type of body or silloutte, but saw none.Even stranger it made no engine sounds ,either electric or other.It made just a very slight air passage sound.It did not race by us ,but seemed to be about 100-150 mph by my estamation. It headed in a straight line destined for somewhere.The back of the object looked the same as the front in color.The color looked almost like embers of a campfire when its just about burning out, then it would brighten up like if you blew on hot coals,slight pulsing.We thought at first some one was messing with a remote control airplane,generally they turn it back as they get out of range...this thing did not deviate.We dont know what this was ,but one thing for sure its not any type of lanterns..."],"Disposition":"Unresolved","Object Features":"Unknown","Region":"Florida","Tags":"City"}