{"divs":["Sighting DetailsWe reached Volcano National Park at around 4:00 PM and had to make a decision to return to Kona via the Saddle Road, retrace our steps through Hilo, or proceed clockwise and go around South Point. We finally opted to proceed towards South Point. After we rounded the corner of the island and began making our way North again, I noticed what I thought to be a campfire off in the distance mauka. As I drove at 45 mph, it seemed to keep pace with our car. I put that down to an optical illusion because of the curvy road and my unfamiliarity with the area. However, after a few minutes at one turn in the road, we were facing the light more or less directly. I slowed the car and realized that it was three floating, spinning balls of red light. They flew about in what I could only call a \"Celtic Knot\" pattern about 20 feet above the ground for a few seconds and then merged into a single larger red ball which flew East at a high rate of speed and disappeared. I could not give accurate details as to size and distance since it was pitch black out and I was unfamiliar with the area. My impression was that they were basketball sized and a few hundred yards away but that's conjecture. Anyway, I was completely shook and had a difficult time driving back to our hotel. When I returned to Las Vegas, I started to ask people with a science background what it could have been. The best answer I heard was a form of ball lightning brought on by minor earthquake activity. That answer sufficed, but ball lightning is supposed to be fleeting and this sighting went on for almost five minutes. For the record, I was 51 at the time of the sighting, I don't drink or use drugs, and I have a doctorate degree. I am sorry that I don't have much more to offer. My mind kept saying \"campfire\" until those last seconds when I could differentiate that it was separate lights and moving. By that time it was over too quickly to stop and try to photograph it. Plus at 100 - 200 yards there wouldn't have been much on the photo anyway"],"Longitude":"-155.576782","Source":"MUFON","Case Number":"45044","Object Flight Path":"Hovering then path","Date Submitted":"01/05/2013 08:58 UTC","Log Number":"US-01052013-0015","Tags":"City","Object Shape":"Sphere","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/45044.html.txt","/var/www/straped/mufon/org/45044.html"],"Latitude":"19.905596","Weather Factors":"Unknown","Viewing Distance":"Unknown","Object Features":"None","trends":[],"Country":"United States","Region":"Hawaii","map":"<A HREF = \"http://maps.google.com/maps?q=19.905596,+-155.576782(45044)&iwloc=A&hl=en\"> mufon case (45044) map </A>","Summary":"Three spinning balls of red light moved and morphed into one orb then zoomed off.","Disposition":"Unresolved","City":"Undisclosed","Date of the Event":"10/02/2003 12:00 UTC"}