{"files":["/var/www/straped/mufon/html2text/45055.html.txt","/var/www/straped/mufon/org/45055.html"],"Date Submitted":"01/06/2013 02:37 UTC","Source":"MUFON","trends":["There have been 3 other sightings in El Mirage","There were no other sightings in El Mirage on or around January 5th 2013"],"Case Number":"45055","Summary":"Red light moving from NE to SW stopped, pulsated, dropped object then blinked out.","City":"El Mirage","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI live in El Mirage AZ. (north west of Phoenix). Last night I saw a bright red object, like a star, around 10 pm. I was bringing my dogs out back to go to the bathroom before bed. This object came from the NE and was moving diagonally to the SW. It made no sound and had no other lights or strobes like a plane or helicopter. It caught my attention for that reason so I kept watching it. Suddenly, it came to a complete stop. I estimate that it was between 2 & 3 miles straight west of my location and between 1000 & 2000 feet high. The light slowly grew dim, then bright, then dim, then bright. Then some object that was just faintly lit red and somewhat tear-drop shape, dropped straight out of the bottom and fell like a rock straight towards the ground. The first object remained for just less than a minute, then blinked off, just like someone turned off a light switch. I watched in that direction for about 10 more minutes , but nothing reappeared. Luke air force base is about 3 miles south of where the object was hovering. Below the object is all residential housing developments and empty fields in between. I drove around that area this morning, but did not notice anything unusual."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.616492,+-112.355905(45055)&iwloc=A&hl=en\"> mufon case (45055) map </A>","Tags":"City","Object Shape":"Sphere, Star-like, Teardrop","Weather Factors":"Unknown","Object Flight Path":"Path then hovering","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Latitude":"33.616492","Country":"United States","Date of the Event":"01/05/2013 10:10 UTC","Longitude":"-112.355905","Log Number":"US-01062013-0007","Region":"Arizona","Disposition":"Unresolved","Object Features":"Unknown"}