{"Source":"MUFON","files":["/var/www/straped/mufon/html2text/45058.html.txt","/var/www/straped/mufon/org/45058.html"],"Date Submitted":"01/06/2013 05:29 UTC","divs":["sighting detailsi had just received my new iphone 4 in the mail and wanted to test the hd camera, so i shot out my kitchen window. my camera is recording as i point it up towards the night sky, i begin to see an odd looking light to my left but i disregard it as there is an airport near me behind the mountain in the direction that this strange light is coming from, but over the years i have been able to tell the difference between an airplane with its blinking lights on the wings apart from the vapor trail planes that fly to see the potential weather . now this light made me take a second look and as my eyes adjusted i noticed there wasnt any lights blinking on this object, only that it looked as orange as the sun with an almost flame like trail behind it. it was moving very slow and at the time i was filming i did not feel threatened in any way, just a really erie feeling knowing that this is something i have never seen before. a day or two later i see a fully skinned cat on a grass patch down the road of my apartment in the direction of the orange orb like figure. i also went hiking over in the wooded area on the side of the mountain and found a chunk of slag, the nearest factory is 3-5 miles away. now i have this video on youtube and the slag in my possession. [link moved to fi section\\cms\\tg]"],"Longitude":"-117.649588","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.073124,+-117.649588(45058)&iwloc=A&hl=en\"> mufon case (45058) map </A>","Summary":"Orange orb flying in the sky / slag material / skinned cat","Latitude":"34.073124","trends":["There have been 3 other sightings in Ontario","There were no other sightings in Ontario on or around July 3rd 2011"],"Viewing Distance":"Unknown","Log Number":"CA-01062013-0010","Region":"Ontario","Object Shape":"Circle, Fireball, Sphere, Unknown","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Date of the Event":"07/03/2011 09:00 UTC","Case Number":"45058","Object Flight Path":"Straight-line path","Object Features":"Dome","Country":"United States","City":"Ontario","Weather Factors":"Unknown"}