{"Object Flight Path":"Stationary","Latitude":"29.96754","Tags":"City","divs":["Sighting DetailsThese photographs were taken NE of Houston Texas on our about November 10, 2012. I did not see this object with my bare eyes, only in the photos later. I was taking photos of contrails as I usually do when they appear in our skies do to the fact that I live in the East to West landing path for Bush Intercontinental Airport and it's odd to see planes flying as low as they do in all different directions leaving these trails. Well this particular day while uploading the images from my cell phone to my PC I noticed this object between two contrails. On my PC the object was obviously a different color than the contrails so I changed the contrast on the images to see if it was indeed a solid object or just just on my cell phone lens. This was the only photo that this image showed up in of about 20 photos. I didn't think much of it until a few days later I saw online that someone had uploaded a photo of a similar object near another contrail only a few miles from where I had taken my photo. The objects in our photos are very similar. I take a lot of photos and this is the first time that I have ever seen anything like this in any of photographs. In the attached photos you will see my original photo without any cropping or modifications. Three other photos where I cropped the image to see it closer and edited the lighting and contrast. The last photo is the one I found online that had been uploaded by a an unknown person but the photo was taken the same month and near the same location as mine was."],"Region":"Texas","Summary":"object seen in photo while during uploading to pc,same type object photographed by stranger in same month/same area.","Sighting Duration":"Undisclosed","Source":"MUFON","trends":["There have been 7 other sightings in Humble","There were no other sightings in Humble on or around November 10th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=29.96754,+-95.17811(45050)&iwloc=A&hl=en\"> mufon case (45050) map </A>","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Circle","Log Number":"US-01062013-0002","Country":"United States","Object Features":"Unknown","Date of the Event":"11/10/2012 02:00 UTC","Case Number":"45050","Date Submitted":"01/06/2013 08:51 UTC","Longitude":"-95.17811","Weather Factors":"Unknown","City":"Humble","files":["/var/www/straped/mufon/html2text/45050.html.txt","/var/www/straped/mufon/org/45050.html"],"Disposition":"Unresolved"}