{"map":"<A HREF = \"http://maps.google.com/maps?q=34.167107,+-118.780784(45056)&iwloc=A&hl=en\"> mufon case (45056) map </A>","Country":"United States","Tags":"City","Object Flight Path":"Path with directional change,Path then hovering","Latitude":"34.167107","divs":["Sighting DetailsBeing close to the holidays I had stepped out to my front yard to decide where I would put the Christmas decorations I had purchased. Immediately I saw the orb. It was low in the horizon a clear cloudless night and the orb was very noticeable. I remember thinking that it could not be a helicopter or a plane because there was no sound. Then I tried to think of what it could be maybe it was someone with a toy airplane or some one shinning a light but I was just grasping for something to explain what I was seeing I was amazed by the movements of the orb ascending, descending, hovering then moving left then right. I also remember thinking i should get my phone and record this, or i should run in the house and tell my family to come out, neither of which I did because I did not want to lose sight of this incredible sight The orb's movements seemed to stay in the same area in other words it did not cover a large distance in the sky. The light glowed, pulsated all at the same time. Then the orb just dimmed and was gone. I only watched it for about two minutes before it disappeared but out went back outside several times that night and looked in all directions but never saw it again. Down the street from my home I did see 2 other neighbors watching the orb."],"Date of the Event":"11/11/2012 12:00 UTC","Disposition":"Unresolved","Longitude":"-118.780784","Date Submitted":"01/06/2013 02:51 UTC","Summary":"Glowing Orange gold orb at times pulsating, erratic movements ascending, descending and hovering. Dimmed pulsated and disappeared","Viewing Distance":"501 Feet - 1 Mile","City":"Westlake Village","Case Number":"45056","Log Number":"US-01062013-0008","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","trends":["There have been 3 other sightings in Westlake Village","There was one other sighting in Westlake Village on or around November 11th 2012"],"Region":"California","files":["/var/www/straped/mufon/html2text/45056.html.txt","/var/www/straped/mufon/org/45056.html"],"Object Features":"None","Source":"MUFON","Object Shape":"Fireball, Sphere"}