{"Longitude":"-111.923132","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.50381,+-111.923132(45066)&iwloc=A&hl=en\"> mufon case (45066) map </A>","Country":"United States","Region":"Arizona","Date Submitted":"01/06/2013 09:57 UTC","trends":["There have been 42 other sightings in Scottsdale","There were no other sightings in Scottsdale on or around January 5th 2013"],"Latitude":"33.50381","files":["/var/www/straped/mufon/html2text/45066.html.txt","/var/www/straped/mufon/org/45066.html"],"Tags":"City","Source":"MUFON","Case Number":"45066","divs":["sighting detailsi was in my backyard at approximately 1900 hours local time (phoenix) barbequing. it was dark since it was winter (1\\5\\13) and i walked out by the pool to look at the stars for a moment. a particularly bright starlike object was in the sky about 20-30 degrees above the horizon to the southeast. it did not move at all (as an airplane would) and i watched it off and on for about 2 hours or so. i looked at it through 10 power binoculars but could not make out any features whatsoever. this starlike object was twinkling brilliantly in various colors like blue,green,red, yellow, and orange. it was brighter than jupiter which was also visible overhead. i called channel 10 news to see if they were interested in going outside to take a look, but i doubt that they did anything. this starlight like object stayed stationary the whole time so i convinced myself that it was in fact just an atmospheric condition making a star look brilliant and change colors. i went to bed about 9pm and it was still there. the next night (1\\6\\13) at the same time i went outside and no such object was present, no bright stars of any kind were in that area of the sky. i was in the us navy (aircrew) for 4 years and have held a private pilot's license since the 1970's. i am 67 years old and camp out frequently so i have seen plenty of stars. i have never seen anything like this before."],"Weather Factors":"Unknown","Disposition":"Unresolved","Log Number":"US-01062013-0018","Object Shape":"Star-like","Object Features":"Unknown","Object Flight Path":"Stationary","Summary":"Starlike light except very bright (brighter than Jupiter) pulsating in various brilliant colors.","City":"Scottsdale","Viewing Distance":"Over 1 Mile, Unknown","Date of the Event":"01/05/2013 07:15 UTC"}