{"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.984756,+-118.442567(45068)&iwloc=A&hl=en\"> mufon case (45068) map </A>","Object Flight Path":"Straight-line path","Case Number":"45068","Log Number":"US-01072013-0002","Weather Factors":"Unknown","Date Submitted":"01/07/2013 05:32 UTC","Latitude":"33.984756","Summary":"Red Orb, White Orb, Red and White shapeshifting Orb","Region":"California","Tags":"City","Object Shape":"Star-like","divs":["sighting details1. i was looking at the sky. i've seen these before(at a former neighbor's) but never from my yard. 2. i was looking for the object. 3. i thought it was a ufo drone.(orb) 4. one was red, one was white, like balloons, high in the northern sky. they hovered, moving south west. 5. i don't like admitting this but i held up my hands and motioned for them to wait while i got my video camera from inside. when i came back out i started videotaping.the first one i saw was gone but the other one continued to hover.(they essentially look like a small red dot or a small white dot in the shaky video.) i texted a neighbor who is very skeptical(i've had other sightings and had recently confessed them to him. he ridiculed me so i wanted him to come over and see for himself. he declined.) i continued to videotape them over the next hour and a half. there were five in all that i saw, though i only got four on video. one came closer than the others, flying east to west over my yard. this one was different in shape. the first ones were perfect spheres but this one looked to be at times like a triangle shape with multiple ball-like shapes protruding from it as it turned, seeming to change shape as it twisted. it appears to glow but it was also after 4:00 at this time and the sun tended to give everything, including planes, a bit of a glow. at this point i called for my fiancee to come outside and see it.(she's seen the white orbs before and isn't very interested but this one was closer and oddly shaped so i insisted she take a look.) 6. i followed\\filmed the object as it flew overhead(i bent over backward in my chair, eventually filming it upside down) until i lost sight as it disappeared over another neighbor's house. (from seeing this particular object until it was gone took about 6 1\\2 minutes.) i had similar sightings(which i also videotaped) over the next two days (jan 2, 3 & 4) all around the same time, 3:00 p.m. (to be fair, that's the time that i would really sit down to look.)"],"Longitude":"-118.442567","City":"Venice","Country":"United States","Source":"MUFON","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/45068.html.txt","/var/www/straped/mufon/org/45068.html"],"trends":["There have been no other sightings in Venice","This sighting has never been favorited."],"Viewing Distance":"101-500 Feet","Date of the Event":"01/02/2013 03:12 UTC","Disposition":"Unresolved"}