{"Object Flight Path":"Other","files":["/var/www/straped/mufon/html2text/45062.html.txt","/var/www/straped/mufon/org/45062.html"],"Disposition":"Unresolved","Viewing Distance":"21-100 Feet","Object Features":"Unknown","City":"South Bend","Weather Factors":"Unknown","Longitude":"-86.25199","Region":"Indiana","map":"<A HREF = \"http://maps.google.com/maps?q=41.676354,+-86.25199(45062)&iwloc=A&hl=en\"> mufon case (45062) map </A>","Summary":"One Dec. 24 2011 My boyfriend, my kid, & myself came home, got out of car, and seen bright star like object, VERY bright like star at closest point, and then as if in a vaccum, lightening fast, was off in distance, appeared to be small red dot / orb.","Country":"United States","Date of the Event":"12/24/2011 12:00 UTC","trends":["There have been 38 other sightings in South Bend","There were no other sightings in South Bend on or around December 24th 2011"],"Tags":"City","Case Number":"45062","Source":"MUFON","divs":["sighting detailson december 24th 2011, between 7:30 p.m. and 8:00 p.m my boyfriend, my kid, and myself all got home from picking up the kid from her fathers house. ( must b anonymous here lol) my boyfriend got out of car, and i heard him ask \"what is that?\" i got out of car as did my kid, and we both looked up in direction my boyfriend was looking. it was insanely bright, and made no noise, and was coming closer very fast. we were absolutely transfixed as this is something we have never seen before, and it seemed to happen so fast. when it got to its closest point, it was approximately only maybe 30 feet away, and it was like a white brightness, the closer it got the whiter and brighter it got, with no form, like a star or something..and then, as if in a vacuum or something, it was so fast, in an instant, it was off in the far distance, appeared to be a small red dot \\ orb. at this point, i actually walked in the house, almost disturbed as my rational mind was trying to..make sense of it..my boyfriend and kid stayed out there until it had finally vanished. i want to add, normally i would be scared to death of such things, but we were like transfixed, almost peaceful, didnt seem..bad, evil or anything..also, when my boyfriend walked in house, we spoke about it for maybe 2 minutes..then dropped it completely and a month later we were what the h*ll was that!?!? lol i thought that strange...another thing, i always look at the clock..for everything..when it comes to any event etc..i thought it strange i didnt look at clock when i came in as this was an extraordinary event,...but i remember wishing father would keep kid longer lol and it being december 24th helped it easier to remember time etc as we were busy.."],"Log Number":"US-01062013-0014","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Latitude":"41.676354","Date Submitted":"01/06/2013 08:14 UTC"}