{"files":["/var/www/straped/mufon/html2text/45061.html.txt","/var/www/straped/mufon/more/45061_submitter_file2__masonufo.png","/var/www/straped/mufon/org/45061.html"],"Date Submitted":"01/06/2013 07:46 UTC","divs":["sighting detailstaking video of austin crows v boston demons australian rules football match at usafl nationals in mason (outside cincinnati), ohio, on saturday, october 13, 2012. editing video clips on january 5, 2013, and noticed something fly across the screen. i did not notice this during filming. i thought it may have been a football being thrown across the grounds during play. problems with that theory include: the speed it is moving (5 frames, 1\\5 second, approx., on screen), the fact that it is not brown (like an american football) making it an australian rules football (footy, which can be a variety of colors) if it was thrown (which is made for kicking, not passing, and is smooth and rounder than an american football, making it difficult to throw at all), the distance it would have to travel (during the match, this is taken near the center of the grounds, meaning the ball would have to travel 75-125 yards to cross the grounds from side-to-side at that point), plus no one noticed it (at that height, if it were a football, since it appears to be about the same size as the footy in the video, it would have been noticed by umpires and players, and no doubt led to a reprimand of anyone who would try to interfere with play like that). so, it's not a football. so far, this is the only instance of something like this in the video clips i shot that day."],"Log Number":"US-01062013-0013","Latitude":"39.366798","Object Features":"Unknown","Source":"MUFON","trends":["There have been 5 other sightings in Mason","There were no other sightings in Mason on or around October 13th 2012","This sighting has never been favorited.",""],"Region":"Ohio","Object Flight Path":"Straight-line path","Tags":"City","Date of the Event":"10/13/2012 02:30 UTC","Sighting Duration":"00:00:01","Disposition":"Unresolved","Longitude":"-84.300794","Case Number":"45061","Viewing Distance":"Unknown","Summary":"USAFL Nationals video of Austin Crows v Boston Demons match, did not see until viewing video clips","map":"<A HREF = \"http://maps.google.com/maps?q=39.366798,+-84.300794(45061)&iwloc=A&hl=en\"> mufon case (45061) map </A>","Weather Factors":"Unknown","Country":"United States","City":"Mason","Object Shape":"Disc, Oval"}