{"trends":["There have been 2 other sightings in Tonopah","There were no other sightings in Tonopah on or around August 31st 2009"],"Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/45064.html.txt","/var/www/straped/mufon/org/45064.html"],"Weather Factors":"Unknown","Disposition":"Unresolved","Region":"Nevada","Viewing Distance":"Over One Mile","Tags":"City","Object Features":"None","Summary":"Three greenish lights seen above mountains NE of I-95, south of Tonopah","Date of the Event":"08/31/2009 07:15 UTC","Date Submitted":"01/06/2013 08:22 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.075681,+-117.227846(45064)&iwloc=A&hl=en\"> mufon case (45064) map </A>","divs":["sighting detailsi was driving north on i-95, and i believe i was not very far south of tonopah (although the location is a point my memory is not clear on as this was a few years ago) on august 31, 2009, and very shortly after sunset, i noticed three solid greenish lights (my memory is that they were light green) just on the other side of the mountain range, just above a mountain top to the north east of the highway. i would guess they were a few miles away, but the lights were bright, and relatively close together. the distance from the furthest left to the furthest right was probably less than a dime held at arm's length. i don't recall whether i saw them moving or not, but i think i may have seen them come up over the mountain. they remained in formation throughout the sighting, and i wondered if they might be lights on an aircraft, although it seemed strange to me that they would be green and unaccompanied by a flashing light, and i was curious if it could be some experimental craft, given the location, so i continued to watch them, for perhaps a minute. they seemed either to be hovering, and perhaps moving slightly to the left and\\or right, though i think my perception was that they might be coming in my general direction (just because that's typically what airplane lights that seem to be relatively stationary in the sky are doing). in any case, what surprised me was that as i watched them, they all disappeared simultaneously. i detected no departure path, as if the lights on a craft had just been turned off. i looked very closely as i expected to see the shape of the craft in the still-lit sky, but i saw nothing but empty sky where they were. very peculiar. it's stuck with me, and having my interest in the subject of ufo's re-piqued by a recent book on the subject, it occurred to me i may as well do my best to report the incident. for what it's worth."],"City":"Tonopah","Longitude":"-117.227846","Latitude":"38.075681","Object Flight Path":"Stationary,Other","Sighting Duration":"Undisclosed","Object Shape":"Other","Log Number":"US-01062013-0016","Case Number":"45064"}