{"Summary":"My Dad and I were chased by 3 lights!","Region":"Indiana","Date of the Event":"02/19/2006 10:03 UTC","Longitude":"-87.453363","map":"<A HREF = \"http://maps.google.com/maps?q=40.946146,+-87.453363(4507)&iwloc=A&hl=en\"> mufon case (4507) map </A>","trends":["There have been 2 other sightings in Morocco","There were no other sightings in Morocco on or around February 19th 2006","This sighting has never been favorited.",""],"divs":["Sighting DetailsMy Dad, me, and my friend were driving on 41 to take her home at about 10:00 (it takes 15 min. to get there, and 15 min. back.) We passed the gravel road and turned on 14. My dad said \"What is that in the sky?.\" The object look like a bright star that eventually faded. I saw a blue light run through the sky, but the blue light(not the light in the sky) turned out to be the light from McDonalds. We turned right, and dropped her off at her house. This time we continued going down the road. Then we turned down the gravel road in which we passed before. As we were driving I told my dad to listen to a song on my Ipod. After the song I wanted him to hear another. I had dropped my Ipod on the floor earlier that day. I have dropped it on the floor a number of times, but it's never done this. My Ipod began to freeze up and nothing worked on it. Then the light in the back seat didn't work (it hasn't worked since), but that could be from a bulb that burned out. My dad told me during that, that he saw 3 brights ligts (reddish yellow) shining out in the field right next to us (right where we saw the first light, but that one was in the sky, this was on the ground.Then they dimmed, because i never saw them.) I told him my Ipod wasn't working, and I also said I never see any UFO's. Well right after that I began looking out the windows to see if i saw anything. I looked in the back window and saw 2 lights that flickered, and then 3 (also reddish yellow.) There aren't any houses out that way either, just a few but their lights would've disappeared in the distance. I thought maybe it was a car, and I didn't say anything for a long time. But the lights started getting brighter and brighter, and faster. I said \"Dad look at those lights in your mirror.\" We were far past from when we first saw the lights, and I still saw them very clear and still very bright. We stopped at a stop sign, and then my dad floored it. These lights didn't make a sound, were too spaced out to be car lights, and also car light travels these did not. We finally turned off the road and got on the highway. I looked back and could still see them. Then I looked again and a small patch of grass lit up. My dad also said he was getting a really sick feeling in his stomach every time I told him about the lights. After I didn't see them anymore (which was right after the patch of grass lit up), my Ipod began to work again. We arrived home that night at 10:12 p.m. approx. But I said before it takes 15 min. to get there, and 15 min. back. We should've arrived home at 10:32 p.m. appox. Why did we arrive so early? Did the UFO's stop time? I don't know what I saw that night, but I've never seen anything like it, and it was strange. Thank you for letting me tell you about this experience."],"Object Shape":"Circle, Unknown","Log Number":"US-03032006-0003","Case Number":"4507","Tags":"City","City":"Morocco","files":["/var/www/straped/mufon/html2text/4507.html.txt","/var/www/straped/mufon/org/4507.html"],"Sighting Duration":"Undisclosed","Disposition":"Unresolved","Weather Factors":"Windy, Medium","Latitude":"40.946146","Object Flight Path":"Unknown","Viewing Distance":"21-100 Feet","Object Features":"Unknown","Country":"United States","Date Submitted":"02/19/2006 10:03 UTC","Source":"MUFON"}