{"Object Flight Path":"Straight-line path","divs":["sighting detailsnew years eve, my wife was out in the back yard with our kids lighting sparklers around midnight. she looked up in the sky and shouted for me to come outside. she pointed up at the sky and said, \"what is that?\" both me and my sister-in-law got up and went out in the backyard and looked up at the southern sky, over our own house, and saw a red\\orange glowing orb moving in a westerly direction toward the gulf of mexico. my wife pointed out the plane in the background with its blinking lights moving in an easterly direction and said, \"its not a plane, because thats a plane right there!\" there were no sounds, no flashing, just a bright reddish\\orange glowing orb. when it appeared to enter a cloud, it turned as black as the night sky, then when it appeared to come out of the cloud, it went back to its original red\\orange color. total time of event about a minute or two. my 8 year old got extremely frightened and started to cry after i answered my wifes question of what was it? with, \"its a ufo!!!\" there were no zig-zags, no ascending or descending, just a straight flight path over the neighborhood that went out toward the gulf of mexico. witnesses include me, my wife, my wifes sister, and our three children. no video or pictures were taken."],"Summary":"Glowing red/orange orb flying from east to west... south of our location... when it entered a cloud, it turned black, then back to red/orange","Tags":"City","Object Shape":"Fireball, Sphere","Date of the Event":"12/31/2012 12:00 UTC","Region":"Florida","Latitude":"26.649735","Object Features":"Unknown","City":"Cape Coral","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Source":"MUFON","Country":"United States","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=26.649735,+-81.923227(45073)&iwloc=A&hl=en\"> mufon case (45073) map </A>","Case Number":"45073","trends":["There have been 16 other sightings in Cape Coral","There were no other sightings in Cape Coral on or around December 31st 2012"],"Longitude":"-81.923227","Date Submitted":"01/07/2013 01:40 UTC","Log Number":"US-01072013-0006","files":["/var/www/straped/mufon/html2text/45073.html.txt","/var/www/straped/mufon/org/45073.html"],"Disposition":"Unresolved"}