{"Viewing Distance":"101-500 Feet","Object Shape":"Blimp","trends":["There have been no other sightings in Cibolo","This sighting has never been favorited."],"divs":["Sighting Details1. Taking nature photographs in a park 2. I stopped to take a picture of a tree with sunlight on it. 3. When I first shot the image I did not notice anything unusual. I just check my flip LCD to make sure the tree image was captured. 4. Later in the day I uploaded my image files to my computer. As I was looking through them I noticed the tree picture had an unusual alien like face peering out from the croutch of the tree. I enlarged the image trying to figure out what it was. I thought maybe it was a trick of light & shadows making an illusion of some sort. I still think that is a possibility. 5. My wife & I went back to the park to find the tree where the image was taken. We could not find an explanation for the face. Today, with a co-worker I went back over to the park and took additional pictures of the tree trying to duplicate what I had captured the day before. Nothing in the new pictures comes close to that face image. 6. My feelings are that I would like to try and find an answer as to what is really in the photograph. I am hoping that maybe someone with better digital equipment can analyze the image to try and find out if it is indeed a trick of light & shadow or a real object. Please note: I did not see an object just something in my photograph. This form would not let me send this unless I answered flying object question. So, please ignore the flying object data."],"Latitude":"29.561618","Tags":"City","files":["/var/www/straped/mufon/html2text/45078.html.txt","/var/www/straped/mufon/org/45078.html"],"Source":"MUFON","Sighting Duration":"Undisclosed","Longitude":"-98.226955","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=29.561618,+-98.226955(45078)&iwloc=A&hl=en\"> mufon case (45078) map </A>","City":"Cibolo","Date of the Event":"01/06/2013 12:00 UTC","Object Flight Path":"Stationary","Case Number":"45078","Weather Factors":"Unknown","Log Number":"US-01072013-0011","Disposition":"Unresolved","Summary":"Alien looking image in photograph","Object Features":"None","Date Submitted":"01/07/2013 06:08 UTC","Country":"United States"}