{"Region":"New York","Log Number":"US-01072013-0010","Disposition":"Unresolved","Latitude":"42.887527","Weather Factors":"Unknown","Object Features":"Other","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","divs":["Sighting DetailsOkay so im driving home with my Mom, and Sister, from seeing my Grandpa at Waterport,NY. were almost Home and all of a sudden i notice this Big light in the Sky. To me it didn't Look like a Normal Plane even though it had some of the lights on it that a normal commerical airliner would have. The reason why i didn't think it was a airliner was because it was kinda small, and it was flying really close to the Throughway. Now i call this a UFO because it is something that I Didn't recognize as a Normal Object in the Sky. Now another reason why i thought it might be a UFO is because it flew over us, and the light dimmed to the point where i could get a good look at the craft even though it was Night time. And even then i couldn't determine what it was. I just wish i had a camera to Photograph it.(My ipod Touch didnt have one its one of the older models). I mean the area we were in i have NEVER seen anything like this. In fact i think its illegal to be flying this low to the ground as they were. Now i have been a Paranormal enthusist for quit some time now. But i have Never seen anything like this before. My Mom was the one Driving but she was on the phone and couldnt care less about it, i kept on trying to tell her to look at the sky and tell me wtf that thing is. But my Sister said she didn't recognize it either. I am also pretty positive that it wasn't a Helicopter either as it flew over us to the point where i could get a good look at it. And i still couldnt recognize the object. Also another fact is that it was moving pretty slow to. I'm just so Mad that i didn't get a Picture of it. i feel it was a guine UFO."],"City":"Buffalo","Object Shape":"Star-like","Summary":"Strange Aircraft in the Sky Flying Extremly Low to the Ground","Date Submitted":"01/07/2013 05:44 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.887527,+-78.877249(45077)&iwloc=A&hl=en\"> mufon case (45077) map </A>","files":["/var/www/straped/mufon/html2text/45077.html.txt","/var/www/straped/mufon/org/45077.html"],"Viewing Distance":"Unknown","Case Number":"45077","Date of the Event":"08/27/2012 12:00 UTC","Source":"MUFON","Longitude":"-78.877249","Country":"United States","trends":["There have been 56 other sightings in Buffalo","There were no other sightings in Buffalo on or around August 27th 2012"],"Tags":"City"}