{"Disposition":"Unresolved","Source":"MUFON","City":"New Orleans","Tags":"City","Country":"United States","Case Number":"45082","Log Number":"US-01072013-0015","Weather Factors":"Unknown","trends":["There have been 26 other sightings in New Orleans","There were no other sightings in New Orleans on or around February 16th 1965"],"Sighting Duration":"00:00:20","files":["/var/www/straped/mufon/html2text/45082.html.txt","/var/www/straped/mufon/org/45082.html"],"Longitude":"-90.234211","map":"<A HREF = \"http://maps.google.com/maps?q=29.950732,+-90.234211(45082)&iwloc=A&hl=en\"> mufon case (45082) map </A>","Object Features":"Other","Object Shape":"Circle","Summary":"In Metairie, LA., 1965, two circular illuminated objects observed directly overhead, traveling in a staggered flight formation.","Viewing Distance":"101-500 Feet","Region":"Louisiana","Latitude":"29.950732","divs":["sighting details i was a young boy between 9 or 10 years of age, residing in what was the westgate area of metairie, louisiana. i believe the parish was jefferson county at that time. our family lived on the metairie side of the street, while kenner was on the other side. my dad was working as a buyer\\purchasing agent for the boeing company supporting nasa on the early saturn rocket and apollo space programs at the michoud assembly facility. anyway, i remember my dad was reading the newspaper that i believe was the \"new orleans times picayune\". dad told me a newspaper article said that one of the pegasus satellites would be visible in the sky that evening. this was incredible, because i was so fascinated with all that was going on with the us space program and had many vernher von braun and astronomy books. i was so excited about the news of this pegasus satellite that would be visible in the evening sky, that i ran over to my neighbor buddy's house to tell him about this news. we were so excited about this, that we were out early in my back yard looking up in the dark sky before this satellite was to appear overhead. while we were waiting to get a glimpse of the pegasus satellite, all of a sudden two circular illuminated objects flew slowly directly over our heads. the best description that i have, is they were flying in a staggered formation and looked like two circular illuminated objects and there was absolutely no sound whatsoever. their distance or altitude to be between 300 and 500 feet. the direction of flight was from right to left as we were looking directly to the backyard. we were so astonished that we ran in the house to tell my dad, he laughed about it, although my mom went outside to look and the objects were now gone. this experience that i had as a young boy has bothered me for years, because of time gone by can cause uncertainty in believing, and as i have always wondered if any other residents of metairie or kenner had made any recorded reports of ufos. i figured because of the \"new orleans times picayune\" newspaper article that many residents had to be out looking in those evening skies, someone may have seen these objects too. i do not know which pegasus satellite we were looking to see at the time, as there were actually three that were launched to study micrometeoroid densities for the early apollo space program. my research tells me that the three pegasus satellites were launched between february 16, 1965 and july 30, 1965..."],"Object Flight Path":"Straight-line path","Date Submitted":"01/07/2013 10:09 UTC","Date of the Event":"02/16/1965 10:00 UTC"}