{"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","trends":["There have been 6 other sightings in Rockford","There were no other sightings in Rockford on or around December 24th 2012"],"Country":"United States","City":"Rockford","Date of the Event":"12/24/2012 12:00 UTC","Object Shape":"Flash, Triangle","Object Flight Path":"Hovering then path,Other","files":["/var/www/straped/mufon/html2text/45084.html.txt","/var/www/straped/mufon/org/45084.html"],"Summary":"3 red lights in a triangle pattern, pulsed then turned to a bright yellow and disappeared","map":"<A HREF = \"http://maps.google.com/maps?q=43.127367,+-85.553282(45084)&iwloc=A&hl=en\"> mufon case (45084) map </A>","Source":"MUFON","Tags":"City","Log Number":"US-01072013-0017","Sighting Duration":"Undisclosed","Region":"Michigan","Case Number":"45084","Date Submitted":"01/07/2013 10:30 UTC","Longitude":"-85.553282","Disposition":"Unresolved","Weather Factors":"Unknown","Latitude":"43.127367","Object Features":"Unknown","divs":["sighting detailsi was at my fiance's mothers house on christmas eve around 9pm, went outside to get xbox 360 controller from my truck. i saw a blink of red out of the corner of my eye, i stopped to look. i first thought the light was a satellite but after i saw it flash in a triangular pattern i realized it was not. i tried to see if a could take a photo with my phone but no lights were visible from the phone. i called my fiance to come outside to check it out but she did not answer. i was excited and i didn't want to take my eyes off it in fear i would miss something. i watched it flash not sure the order of the lights, thought it could have been one object moving in a triangular motion but now i believe it was one object flashing, i only saw the light one at a time, flashing when it reached to top of the triangle it turned from red to a bright yellow then disappeared behind a cloud. i watched for a moment longer then i went inside and told the family what i had saw and then went back out to see if i could see anything else. nothing else was seen . clouds . . clouds ttytrees___treesty \\ | \\ \\ | \\"]}