{"Date of the Event":"02/26/2006 08:06 UTC","Weather Factors":"None","Object Features":"Unknown","Latitude":"42.498958","Object Shape":"Fireball, Star-like, Teardrop","Log Number":"US-03032006-0004","Object Flight Path":"Straight-line path","Viewing Distance":"101-500 Feet","Longitude":"-82.930571","map":"<A HREF = \"http://maps.google.com/maps?q=42.498958,+-82.930571(4508)&iwloc=A&hl=en\"> mufon case (4508) map </A>","Summary":"decending teardrop UFO flew overhead parrelling our driving along road for 6 to 7 seconds beford 'winking out' while approx. directly overhead","Source":"MUFON","divs":["sighting detailsdriving northbound through suburban detroit neighborhood (roseville) i, sitting in passenger seat, noticed in a clear night sky an extremely bright meteor shape ball of light (with small attached tail) coming down at slight angle (22-25 degrees)toward the north-northwest (direction we were also traveling) several hundred feet above us and brighter than any other object in the sky. my wife, the driver, noticed me looking out the window and looked out the windshield a second or two before the object \"burned out\" (her decription) as a way of disappearing. both of us at first thought of a meteor just before impact because it was so close and bright right above us and no smoke or trail remained after the disappearance. there was no other traffic in the area during the sighting and the object seemed to come down in a matter of 5-6 seconds for the mile or so it seemed to travel between 10 and 11 mile roads in roseville (designated road names in our adjoining cities spaced one mile apart). no words were spoken between the two of us during the event perhaps due to the awe induced by seeing such a bright (whitish\\blue) object flying alongside us and only a few hundred feet above. as the object disappeared so suddenly, we assumed a meteor being burned up in a final flashing gasp overhead, rather than a craft zipping away in another direction. no report of debris was reported later in the area and no mention of a similar sighting was read or heard by my wife or myself. no report was made to local authorities until a few days later after contact with a member of michigan based mufon. no picture documentation could be obtained, although usually a disposable camera is available in our car's glove compartment. not that night, however, but a new one is now waiting in the car for the next potential encounter. everyone who drives should have one at the ready for such possible occasions."],"Region":"Michigan","files":["/var/www/straped/mufon/html2text/4508.html.txt","/var/www/straped/mufon/org/4508.html"],"Sighting Duration":"00:00:07","Case Number":"4508","City":"Roseville","Tags":"City","Disposition":"Unknown","Country":"United States","Date Submitted":"02/26/2006 08:06 UTC","trends":["There have been 14 other sightings in Roseville","There were no other sightings in Roseville on or around February 26th 2006","This sighting has never been favorited.",""]}