{"Summary":"Saw object in sky rotating in a circular motion with the bottom changing colors in a circurlar motion. At times it would pulsate and it was gradually going up and to the south and then it just disappeared.","Case Number":"45083","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Elliston","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=46.565092,+-112.440611(45083)&iwloc=A&hl=en\"> mufon case (45083) map </A>","Country":"United States","Viewing Distance":"Unknown","Weather Factors":"Unknown","Log Number":"US-01072013-0016","files":["/var/www/straped/mufon/html2text/45083.html.txt","/var/www/straped/mufon/org/45083.html"],"City":"Elliston","Date Submitted":"01/07/2013 10:22 UTC","divs":["Sighting Details1) Was looking up at the stars 2) Saw the blue pulsating light 3) Not sure. 4) After watching this object for several minutes in the southeastern sky over Elliston, Montana tonight (January 2, 2013) we are convinced it is not a star nor a plane. With the naked eye you can see the changing of colors between red, blue, and green. After zooming in on the object you can clearly see the bottom part of the object turning around in a strobe like motion around changing colors and moving slightly up and down. It sporadically shoots out of the frame and then back. My husband and stepson were also watching it. We have been watching it for over 45 minutes. We are not exactly sure what it is but it is definitely fascinating to watch. We are curious as to whether other listeners of your show have seen it as well. I will need to transfer the video from tape to digital later this evening. It has been a really exciting evening for us to watch. 5) Excited with what we saw. 6) It just vanished from sight as it was moving south and up in the sky more."],"Latitude":"46.565092","Source":"MUFON","Disposition":"Unresolved","Region":"Montana","Object Features":"None","Tags":"City","Date of the Event":"01/02/2013 09:30 UTC","Longitude":"-112.440611","Object Flight Path":"Path with directional change","Object Shape":"Circle, Flash, Sphere, Star-like"}