{"Source":"MUFON","Date Submitted":"01/08/2013 02:20 UTC","Viewing Distance":"Unknown","divs":["Sighting DetailsI was holiday with my wife when early in the am she woke me to ask what a light she had seen in the sky was .I got out of bed (it was still dark)and i observed a light moving quickly in the sky.I got my camera and took a photo.As i changed my camera to video the sky had changed to daylight and i continued to film as the orb flew at great speed in the sky,all i can say is i thought i had seen a ufo as i had never seen anything like it before .I zoomed in and out to get a reference has to how far away it was ,on playback when i zoomed out i could see the orb light go out and drop down through the cloud using the palm tree as a reference.some of my film would be camera movement but i was steadied up against the door frame .The orb was moving in many ways sometimes slow sometimes fast then at times just stationary changing colour and glowing .It was too fast for a plane and too bright for a star.It was filmed looking across the sea to venuzuela.The next few days were followed by heavy storms .I lost sight after again zooming out and when i zoomed back in it appeared to have vanished . The next night i set my video up on the table for a few mins looking at the sky i only realised when i returned home the i had actually caught the orb again on camera flying in and out of the top of my screen. The photos are close ups of stills taken from my film.The photo of the orb at night is a digital photo the first i took of the orb."],"City":"Calgary","Date of the Event":"11/12/2011 12:00 UTC","Log Number":"AW-01082013-0009","files":["/var/www/straped/mufon/html2text/45096.html.txt","/var/www/straped/mufon/org/45096.html"],"Object Features":"None","Longitude":"-113.921227","trends":["There have been 76 other sightings in Calgary","There were 2 other sightings in Calgary on or around November 12th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=51.116538,+-113.921227(45096)&iwloc=A&hl=en\"> mufon case (45096) map </A>","Weather Factors":"Unknown","Disposition":"Unresolved","Latitude":"51.116538","Object Flight Path":"Other","Case Number":"45096","Summary":"while on hoiliday in aruba i filmed this orb.","Object Shape":"Circle, Fireball, Oval, Sphere, Star-like","Region":"Alberta","Tags":"City","Sighting Duration":"Undisclosed","Country":"Canada"}