{"Viewing Distance":"101-500 Feet","Object Flight Path":"Other","divs":["Sighting DetailsI will NEVER forget this. First, I am an incredibly visual person and a professional artist and musician with 4 EMMY awards. I was 10 years old and my family (4 siblings) and the family who lived down the street (4 siblings) traveled to Miami Florida together and would stay at the Suez Hotel on Collins ave. They had a large, life-size white camel in front of the hotel. We went in August for the cheap rates, coming from upstate NY. The 4 parents were playing cards in one of the rooms. I wanted to swim in the pool because I loved swimming underwater at night when the lights were on in the pool - there was nothing like this at home. The others were assigned to watch me as I used the pool (ages ranging from 6 - 12) and after about 20 minutes they grumbled at me and all ran off. I was standing on the diving board, and I yelled \"Hey, I can't go in if you leave\" - I followed the rules as I had a very frightening, tall stepfather who was very intense when it came to punishment, leather belts, paddles, etc. So I stood there on the diving board with an elevated view of the everything. As I stood there, I heard what sounded like a continuous \"churning\" of the ocean just to my left (diving board facing south along coastline) as opposed to the waves coming and going. I looked to the ocean and about 100 feet off shore, the ocean WAS churning - then a light came on under the water - as I watched, a sea-shell shaped object with what appeared to be a flickering candle-like light source inside it (this is waaay before those Japanese lanterns, and came OUT of the water AFTER the light appeared) and began slowly floating straight upward ... after a bit, when it got really high up, it started to curve and float parallel to the ocean surface - it just kept going for around 20-30 minutes. Immediately after it finally became to small to view, my siblings returned and asked me why I was still standing on the diving board. I told them excitedly what I saw - the dismissed it in laughter. Interestingly, just a couple years ago, I read of Columbus' UFO sighting when he approached land and it sounded like the same thing."],"Sighting Duration":"Undisclosed","Longitude":"-80.223119","Case Number":"45097","Date Submitted":"01/08/2013 03:47 UTC","Disposition":"Unresolved","Object Features":"Patterned Surface","trends":["There have been 97 other sightings in Miami","There were no other sightings in Miami on or around August 12th 1963"],"Source":"MUFON","Summary":"Watched this emerge from ocean slowly, flew slowly away","Region":"Florida","Weather Factors":"Unknown","City":"Miami","Object Shape":"Oval","Date of the Event":"08/12/1963 12:00 UTC","Log Number":"US-01082013-0010","map":"<A HREF = \"http://maps.google.com/maps?q=25.792259,+-80.223119(45097)&iwloc=A&hl=en\"> mufon case (45097) map </A>","Country":"United States","Tags":"City","Latitude":"25.792259","files":["/var/www/straped/mufon/html2text/45097.html.txt","/var/www/straped/mufon/org/45097.html"]}