{"Object Shape":"Unknown","Date Submitted":"01/08/2013 01:10 UTC","Log Number":"US-01082013-0006","Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Latitude":"29.53619","trends":["There have been 5 other sightings in Friendswood","There were no other sightings in Friendswood on or around December 19th 2012"],"Disposition":"Unresolved","Summary":"4 bright lights not moving then started to move in a group over tree line","map":"<A HREF = \"http://maps.google.com/maps?q=29.53619,+-95.170994(45093)&iwloc=A&hl=en\"> mufon case (45093) map </A>","Object Flight Path":"Hovering then path","Tags":"City","City":"Friendswood","Region":"Texas","divs":["Sighting DetailsI DID NOT KNOW WHAT TO THINK, COMING HOME IN DECEMBER IT WAS JUST DARK. I WAS GOING SOUTH ON I-45 TURNED ON EL DORADO GOING WEST. I LIVE AT THE INTERSECTION OF BLACK HAWK AND BARCELONA DR. ALMOST A DIRECTLY WEST 2.5 MILES. JUST LIKE THE WEBSTER REPORT ALMOST EXACTLY, I DID NOT SEE THE OBJECT MOVE OVER ME. I KICK MYSELF I DID NOT STOP. I DID SLOW DOWN RIGHT BEFORE THE SCHOOL ON THE RIGHT ON EL D0RADO DR. I SLOWED TO ALMOST A STOP,BUT KEPT MOVING WITH THE WINDOW DOWN. I DID NOT HEAR ANY SOUND. I TOO WAS WONDERING IS THIS A NEW LIGHT TOWER? OR WHAT CLOUD IT BE. IT MOVED SLOW TO ALMOST A HOOVER THEN SEEM TO KEEP MOVING NORTH EAST WARD. I WAS NOT THE ONLY ONE SLOWING DOWN I SAW TWO OTHERS JUST SLOWING AS I WAS. I DID NOT SEE AN OBJECT JUST A GROUPING OF LIGHTS THAT SEEM TO BE CONNECTED SOME WAY AS PART OF AN OBJECT. IF YOU LOOK AT GOOGLE MAPS FROM WHERE THE OBJECT OR LIGHTS IN A GROUP MOVING WAS AND MOVING TO IS A LINE TOWARD ELLINGTON FIELD (AIR FORCE BASE). I AM GLAD I SAW THIS ARTICLE ABOUT WEBSTER, BECAUSE EVERYDAY SINCE I HAVE KEPT THINKING WHAT DID I SEE OR I WISH I WOULD HAVE STOPPED TO OBSERVE LONGER. ALMOST THE SAME AS THE WEBSTER TEXAS IN SAME AREA DIFFERENT DATE"],"files":["/var/www/straped/mufon/html2text/45093.html.txt","/var/www/straped/mufon/org/45093.html"],"Longitude":"-95.170994","Date of the Event":"12/19/2012 08:00 UTC","Case Number":"45093","Weather Factors":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","Source":"MUFON"}