{"Tags":"City","Disposition":"Unresolved","Viewing Distance":"Over 1 Mile, Unknown","Longitude":"-157.852453","Region":"Hawaii","Date Submitted":"01/08/2013 05:36 UTC","Object Shape":"Disc, Sphere","Log Number":"US-01082013-0014","Summary":"Witnessed two small in succession shoot out of the Downtown Honolulu area, then disappear.","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Object Features":"Unknown","Source":"MUFON","Date of the Event":"01/08/2013 08:15 UTC","Case Number":"45101","Latitude":"21.313174","map":"<A HREF = \"http://maps.google.com/maps?q=21.313174,+-157.852453(45101)&iwloc=A&hl=en\"> mufon case (45101) map </A>","City":"Honolulu","Weather Factors":"Unknown","divs":["sighting detailsmy three year old son and husband and i were driving in our car this morning at 8:10 am in honolulu, hi. as we drove on the h1 freeway in the westbound direction. at about the university exit, scott, my husband noticed a small circular\\disc\\or spherical, gun metal gray\\black object flying quickly out of the downtown honolulu area at about 45 degrees, then turned south and changed it's angle of ascent to a more straightened path. when i noticed it, it was above the skyline, heading south toward diamond head over the ocean. my husband and i were trying to figure out what it could be since it did not \"fit\" any thing that we have seen before, and it did not have wings. but we were also wondering if we just weren't seeing it clearly. we lost sight of the first object, and then a second object following the same flight pattern came out of the area. i was able to watch the entire path of the second object. and after a few seconds, 30, 40 seconds or so, the flight path changed to gradually turn toward the horizon, then simply disappeared. a few seconds before the flight path changed, the quality of light of the object changed. i could not tell if it was a flash or the sun reflecting off of the object. then, like the first object, the second one also disappeared. i'm very curious to know if there were other reports of this sighting or an explaination regarding what we saw."],"files":["/var/www/straped/mufon/html2text/45101.html.txt","/var/www/straped/mufon/org/45101.html"],"trends":["There have been 17 other sightings in Honolulu","There were no other sightings in Honolulu on or around January 8th 2013"],"Country":"United States"}