{"Date of the Event":"01/06/2013 10:00 UTC","Tags":"City","City":"Barnstable","Latitude":"41.651683","Case Number":"45109","map":"<A HREF = \"http://maps.google.com/maps?q=41.651683,+-70.290339(45109)&iwloc=A&hl=en\"> mufon case (45109) map </A>","Object Features":"Window(s), Other","Longitude":"-70.290339","Source":"MUFON","Object Shape":"Blimp, Cylinder, Other","Log Number":"US-01092013-0003","Viewing Distance":"21-100 Feet, 101-500 Feet, Unknown","divs":["sighting detailsi was driving into my friends apartment complex when i noticed a bright orange light sitting in the sky. i pulled into her house and walked back to the street to look at it. i starred at it for a good minute before i decided to take a picture of it. i thought maybe it was a plane or something coming towards me and thats why it looked stagnant but it was sitting a long time. as soon as i take a picture\\video it begins to move to the left and starts blinking. at this point i was deeply interested and tried to continue recording. it changed direction and was right above me at this time and i could see it was not a plane at all. it made no sound and was oval\\blimp like. a band of white light wrapped around the middle of the craft, possibly a window? there were exterior lights all over it some pulsing and the others blinking fast. i started to panic because i knew i was looking at a ufo. at first i could follow it on foot but it took off towards the next town. i called my friend hysterical and told her what i saw and that i was going to drive to see if i could find it. i was unlucky in my endeavor so i started driving back to my friends house. as soon as i'm back into my town the orange glow is once again sitting in the air. i try calling my friend to tell her to get outside but she could not hear me at all. i could hear her perfectly fine and at first thought she was joking with me. when i get to her house she says i was cutting out on the phone and there was an electrical whining noise in the background although i could hear her perfectly. we both start looking at it and it moves in the most obscure pattern i've seen any craft move.it was circling around and moving back and forth and up and down. once again as soon as i start to record it takes off again towards the next town. then it was gone for good. it happened so fast but i have a couple videos and a picture on my cell phone. unfortunately the videos only picked up the blinking lights instead of the craft itself but it shows the erratic movements of the craft. unfortunately im writing this on my cell phone so attaching the video files isn't working. if you email me i can get to a pc and upload them for you to see."],"Summary":"UFO seen in downtown Hyannis Ma two seperate times within the hour","Country":"United States","Weather Factors":"Unknown","Object Flight Path":"Hovering then path,Path with directional change","files":["/var/www/straped/mufon/html2text/45109.html.txt","/var/www/straped/mufon/org/45109.html"],"Date Submitted":"01/09/2013 12:17 UTC","Sighting Duration":"00:45:00","Disposition":"Unresolved","Region":"Massachusetts","trends":["There have been 9 other sightings in Barnstable","There were no other sightings in Barnstable on or around January 6th 2013"]}