{"Object Features":"None","Object Flight Path":"Path then hovering","trends":["There have been 417 other sightings in Phoenix","There was one other sighting in Phoenix on or around January 8th 2013"],"Weather Factors":"Unknown","Latitude":"33.456957","Date Submitted":"01/08/2013 10:55 UTC","Longitude":"-112.069307","Log Number":"US-01082013-0018","Summary":"Saw two glowing star-like objects above Phoenix, Arizona on Tuesday Jan. 8th 2013","files":["/var/www/straped/mufon/html2text/45105.html.txt","/var/www/straped/mufon/org/45105.html"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.456957,+-112.069307(45105)&iwloc=A&hl=en\"> mufon case (45105) map </A>","Source":"MUFON","Disposition":"Unresolved","divs":["sighting detailsi was outside smoking a cigarette. i am one of those people who enjoy looking at the stars. i've never been a huge ufo person. i can take or leave them. maybe they are real, maybe not. today seemed different. i was looking at the orion constellation, and just below it, a star-like object was hovering and moving up or towards me. i couldn't tell which because when your far from an object, both directions look the same. it was glowing\\flashing an array of neon colors. i'm not sure if the colors were all at the same time or not, but there were purples, reds, white-blues, and maybe some green in the \"color array\". it seemed weird but i figured it was a helicopter. this was until it started moving upwards at a decent clip, and then dropped down and then shot up and then dropped down. i know helicopters don't do that. i watched it some more, and it kept hovering and moving slightly upwards. i went to get my glasses and when i came back out, it was just hovering. it hovered in the same spot for about 30 minutes. it might still be out there. i came inside because it's freezing out there. but i did notice a second, smaller object to the north of the original object, glowing the same array of colors. it might have been further away or just smaller, not sure. it was also just hovering. i felt very strange because i see a lot of \"ufos\" that have at least \"some\" characteristics of normal american\\human aircraft, but this time was different. i don't know of any aircraft that glows the way this thing did. i almost felt at peace for some reason. not sure why."],"Country":"United States","Case Number":"45105","Region":"Arizona","Date of the Event":"01/08/2013 08:15 UTC","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","City":"Phoenix","Object Shape":"Star-like"}