{"Latitude":"43.853632","Viewing Distance":"21-100 Feet","Object Features":"Other","Longitude":"-83.964987","Date Submitted":"01/08/2013 11:17 UTC","Country":"United States","Date of the Event":"09/01/2002 12:00 UTC","Tags":"City","Sighting Duration":"Undisclosed","Summary":"dark, triangle mass with 3 lights on each side, saw the frame and bottom clearly.","Region":"Michigan","Disposition":"Unresolved","Object Shape":"Triangle","Case Number":"45106","divs":["Sighting DetailsMy 3 children and I were coming over the I75 overpass on Coggins Rd.in Pinconning, MI in the Fall, around September, about 12 years ago around 9 pm, just before it became very dark outside. My son said, \"look Mom\", and pointed up from the front windshield. I peered over the steering column and saw a frame of a dark triangle with lights at each point, a total of 3. The lights appeared to flash very lightly. The triangle was not more than 200 ft above the farm fields as we came over and down the overpass. It was very large and I could clearly see the outline and the bottom of the triangle object. The bottom of the UFO was very dark. I could not see any of the sides or anything, as I was driving and was somewhat under it in direction. It moved very slowly and made not a sound, and I thought that odd. I dismissed it at the time, but as my knowledge about UFO's have grown over the year, I am convinced that I saw a UFO. Two of my children remember this, and the other does not. As I drove down the over pass and headed East onto Coggin Rd. I looked back and it had disappeared. My youngest son, said the same. He looked back and it was gone."],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/45106.html.txt","/var/www/straped/mufon/org/45106.html"],"City":"Pinconning","trends":["There have been no other sightings in Pinconning","This sighting has never been favorited."],"Object Flight Path":"Straight-line path","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=43.853632,+-83.964987(45106)&iwloc=A&hl=en\"> mufon case (45106) map </A>","Log Number":"US-01082013-0019"}