{"Tags":"City","Latitude":"38.896992","trends":["There have been 82 other sightings in Washington","There were no other sightings in Washington on or around December 30th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.896992,+-77.029806(45108)&iwloc=A&hl=en\"> mufon case (45108) map </A>","Weather Factors":"Unknown","Summary":"took a photo in seattle. upon reviewing photo i discovered the ufo. it was not visible when photo was taken","Log Number":"US-01092013-0002","Sighting Duration":"Undisclosed","Object Shape":"Blimp, Boomerang, Cylinder, Triangle","files":["/var/www/straped/mufon/html2text/45108.html.txt","/var/www/straped/mufon/org/45108.html"],"divs":["Sighting DetailsOn Dec. 30 2012 I was downtown killing time before meeting friends for a weekend of bringing in the new year, so I decided to take some photos of buildings and places around downtown Seattle which I found to be interesting. It was an uneventful morning and I got several great photos of the area. Several days later I was reviewing my photos when I noticed this object apparently hovering above a building in one of them. I zoomed in on it and quickly realized the object does not look like an airplane or a helicopter. It vaguely resembles a blimp, yet it had unusual characteristics. There appears to be no windows, some blueish and reddish coloration, definitely metallic looking surface. There also appears to be an appendage sticking out the top near the middle and also seems as if it may have a boomerang shape as well. When I originally took the photograph I saw nothing hovering there and heard nothing unusual, just typical sounds of city traffic and such. It was only after I had reviewed the photo nearly a week later that I realized it was there. It was not visible to the naked eye or in my viewfinder on my phone's camera when I took the photo. I feel like it could be something remarkable or perhaps not. I do not have any means of enhancing the photo with my phone, so I can't really get a more clear look at the object other than the zoom I do have. This thing doesn't look like any known aircraft I have ever seen and all who I have showed the photo to agree that I may very well have a legitimate UFO sighting over downtown Seattle. I would like to have this picture examined by an expert to determine what it is just as much as I want to know what it is not."],"Case Number":"45108","City":"Washington","Source":"MUFON","Country":"United States","Object Flight Path":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"12/30/2012 08:20 UTC","Disposition":"Unresolved","Object Features":"Appendage(s)","Date Submitted":"01/09/2013 11:06 UTC","Region":"Washington","Longitude":"-77.029806"}