{"Tags":"City","Object Flight Path":"Hovering then path,Path with directional change","Date of the Event":"01/02/2013 05:15 UTC","Region":"Tennessee","files":["/var/www/straped/mufon/html2text/45102.html.txt","/var/www/straped/mufon/org/45102.html"],"Object Shape":"Square, Rectagular","Summary":"Rec. white box shaped with square metal or glass on side sun reflected off of square. Moved at blimp speed. About 30' long 2000' up.","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=36.209045,+-86.515565(45102)&iwloc=A&hl=en\"> mufon case (45102) map </A>","Case Number":"45102","Disposition":"Unresolved","Latitude":"36.209045","Date Submitted":"01/08/2013 05:49 UTC","Object Features":"Window(s)","City":"Mount Juliet","Longitude":"-86.515565","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Log Number":"US-01082013-0015","divs":["Sighting DetailsI was getting in my truck, heard a helicoptor, probably news helicopter or a hospital helicopter dark in color, watched helicopter fly right over me from east to west. Saw object in background of helicopter flight path due north. It was about a half mile or mile away hovering. I took second look and it was still there. It appeared to be a white rectangle shaped box with a square in side of box that appeared to be glass or metal. It was really a box shape. I thought it might be observing something, I figured it was a square blimp. Directly below or near is an electrical sub station that in previous years I have watched helicopters fly in and around. I lined up tree tops with my finger on object to see if it was even moving. It was at blimp speed or slower. It was going west but then turned to northwest. It was at sunset aand the rays of the sun were orange on all the tree tops. As I watched it turn I saw the reflection of the sun on the metal or glass square shape on the left side of box, it really got bright almost enough to cover up whole object, then as it continued to turn the reflection died down. I knew it was a one piece square like glass or metal on side. Then watched it as it went over nearby school toward direction of National Weather Station. It was a clear sky but a haze like high up along horizon. Finally the object faded out in haze across sky. There were no lights, no sound, just a white rectangle box with a smooth square glass or metal in left side. Looked too much like the observation room of a blimp, but no blimp football on top. Is there such a thing? I was asked why I didn't take a picture with my phone....I was in complete shock of \"what is that\" and did not want to take my eyes off of it, wish I had taken a picture now. I kept saying to myself, there is a logical explanation to this."],"Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Mount Juliet","This sighting has never been favorited."]}