{"Log Number":"US-01092013-0012","map":"<A HREF = \"http://maps.google.com/maps?q=40.29183,+-79.58333(45118)&iwloc=A&hl=en\"> mufon case (45118) map </A>","divs":["sighting detailspulled into my mother in laws driveway about 6:30 pm, i got my son out of his car seat and was holding him in my arms. he looked up and said \"airplane\" i looked up and saw an object flying low directly above us. i said to my mother in law look at that. it looks weird. she said ohyeah it does. we started to walk up her front walk i was behind her and my son and i kept looking up at the object. i stopped and stood still to watch for a moment. i observed the object was diamond shaped, had a white light on 3 of its points a blinking red light in the center and the 4th point was glowing orange, as if it were an interior light illuminating the whole point and bright enough to see a distinct diamond solid shape. i turned to go inside and my mother in law handed me a bag of rock salt for her driveway. it was covered in packed snow\\ice. i stopped to watch the object again and realized it was completely quiet. it was at the same height of what the local helicopters fly and no noise. i watched it until it went behind the trees and house across the street. it flew low, and slow in a straight line to the west. towards jeanette."],"Weather Factors":"Unknown","Source":"MUFON","Date of the Event":"01/09/2013 06:30 UTC","City":"Greensburg","Date Submitted":"01/09/2013 09:00 UTC","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Object Features":"Window(s)","Tags":"City","Object Shape":"Diamond","Country":"United States","Sighting Duration":"Undisclosed","Disposition":"Unresolved","trends":["There have been 21 other sightings in Greensburg","There were no other sightings in Greensburg on or around January 9th 2013"],"Summary":"low, slow flying diamond shape. a white light on 3 points 4th point glowed from interior light orange","Case Number":"45118","Latitude":"40.29183","files":["/var/www/straped/mufon/html2text/45118.html.txt","/var/www/straped/mufon/org/45118.html"],"Longitude":"-79.58333","Region":"Pennsylvania","Object Flight Path":"Straight-line path"}