{"map":"<A HREF = \"http://maps.google.com/maps?q=36.782521,+-119.413092(45117)&iwloc=A&hl=en\"> mufon case (45117) map </A>","Case Number":"45117","Weather Factors":"Unknown","Tags":"City","divs":["Sighting DetailsI was driving North up hwy 88 talking with my daughter who was my passenger. I am pretty sure we were at about 5,000 foot elevation and I would guess it was about 8:00pm or a little before. We hadn't made it to Ham's Station yet. I glanced up above the tree line because there was a very lit up Chevron shaped object on the other side of the highway and to the left. I pointed it out to my daughter and immediately pulled over because there was a nice pull over area. She was excited for what she was seeing and I told her to grab her iphone and she was already out and taking pictures. I wasn't as fast but did the same thing. It hovered where I first saw it for a few seconds and then very slowly and silently made it's way above the trees moving somewhat south and parallel to hwy 88 until it was obstructed by the trees and could no longer be seen. This took about a min or a little more. We got in the car fully charged with excitement and talked about what we saw. It seem to be chevron shaped because it was triangle shape but two sides were much longer than the back side to make it pointier. There seemed to be one big red light in the front and one big red light on the back that both randomly blinked. There was one huge white light not totally in the center. There was also a blue light that would blink now and then. The whole entire bottom was totally lit up in a white light until it faded near the back. Strange because I would expect the pointed side to be moving forward but it was the back. It almost seemed to be tilted in a way that the bottom was the part that was mostly visible to both of us. Hard to say exactly how large this object was but it seemed to be about the size of a very large jumbo jet. We were really blown away by this sighting and it was hard to actually stop talking about it for hours. When we got back home we looked at our pictures and weren't surprised to see that we got lights but not at all what we saw with our actual eyes. No way was this a helicopter because only weeks before in almost the same exact area again at night my husband and I saw a noisy large helicopter searching through the tall trees with a huge bright search light. It circled around and I stuck my head out of the car like a puppy dog and wave at them as they put the search light right on our car. It was loud and noisy and blew our minds wondering what the heck they were up to out in the middle of nowwhere."],"City":"Undisclosed","Summary":"Driving on hwy 88 going North, about 5,000 ft elevation at about 8:00 pm my daughter and I spotted a chevron shaped object just above the tall tree line first hovering and then slowly moving south along the side of the road.","Date Submitted":"01/09/2013 08:57 UTC","Log Number":"US-01092013-0011","Longitude":"-119.413092","Latitude":"36.782521","Source":"MUFON","Disposition":"Unresolved","Sighting Duration":"00:01:30","Object Features":"Other","trends":[],"Date of the Event":"01/08/2013 12:00 UTC","Region":"California","Country":"United States","Viewing Distance":"101-500 Feet","Object Shape":"Chevron","files":["/var/www/straped/mufon/html2text/45117.html.txt","/var/www/straped/mufon/org/45117.html"],"Object Flight Path":"Hovering then path"}