{"map":"<A HREF = \"http://maps.google.com/maps?q=40.386579,+-82.828674(45113)&iwloc=A&hl=en\"> mufon case (45113) map </A>","Country":"United States","Log Number":"US-01092013-0007","Longitude":"-82.828674","Object Flight Path":"Stationary","Summary":"Vertical cylinder or cigar shaped object with sll protrusions on each side that were lit up too.Emitted short bursts of light from bottom when moving.","Sighting Duration":"00:05:00","Object Shape":"Cigar, Cylinder","Date Submitted":"01/09/2013 03:52 UTC","Source":"MUFON","Latitude":"40.386579","City":"Marengo","files":["/var/www/straped/mufon/html2text/45113.html.txt","/var/www/straped/mufon/org/45113.html"],"Object Features":"Appendage(s), Other","trends":["There have been 2 other sightings in Marengo","There was one other sighting in Marengo on or around January 8th 2013"],"Disposition":"Unresolved","Tags":"City","Case Number":"45113","Date of the Event":"01/08/2013 01:07 UTC","divs":["Sighting DetailsI was on my computer at my house on Facebook. My dog Winnie had to go out to pee. Since I live in the country and alot of deer come in my yard to eat apples, I used a flashlight and check to see if the coast was clear. I also look out for coyotes. Since there was nothing outside I let Winnie out, then stepped out tthe edge of my porch to kee an eye on her. I had on my thick robe and slippers. Something in the sky caught my eye. When I looked up, there was a long cylinder shaped object with protrusions on it's side that was shooting out short bursts of light like a ray sort of, and it was ascending. It only moved a short distance at I would say a medium speed (but faster than an airplane) before it stopped.It stayed right where it was until it disappeared. If I would hold a dime up at arm's length, it would have been covered by the dime. I watchd it for about a minute. It would flash a light now and then. I decided I had to get my husbad up to see this even though he has to get up at 3:00 a.m everyday to leave for work at 4:00 a.m. So I got him up, told him there was something weird, maybe a satellite in the sky.He went outside with me and I showed him the object. He said he could only see the light(s) but he only saw the one and possibly due to his eyesight or being just awakened, he could not see the shape. He grunted \"I'm going back to bed, have fun (or something like that)\" and went back to bed. Thinking, \"I'm not going to have a witness\", I ran to my computer and posted on FB \" theres a UFO in the southern sky right now OMG\". Then I got on my boots and a hat and went back outside, but this time I stepped off the porch and down the steps. At that time, the object was still where it was when I had gone inside. It's lights were still emitting a flash of light now & then. I looked up and in a semi-circle, that was facing the first object were approximately 6 or 7 more of this same thing. They were also flashing their lights and it was all simultaneously. I stood and watched them for another minute or two, then they all just disappeared! There was only blackness where the objects had been. I waited a few more minutes, but they did not re-appear. I went back into my house and continued what I was doing on the computer. About 45 minutes later, my curiousity got the better of me and I went back outside and down the steps.I did not see anything where they had been before, but when I looked South- South West, I saw one of these objects. Looking more, I spottd 4 or 5 more, and again, they were flashing their lights in unison. I probably only watchd them for a minute, then suddenly a beam of light came out of each of them..at the same time. The beams were not as bright as when their lights would flash, but were very visible. The beams came out of the crafts at an angle..like 4 o'clck on a clock in reference to the top of the craft being 12 o'clock. I only watched these beams for about 15-20 seconds, then it was like a cloud covered the objects..I could see the lights flash, but not as brightly. It was almost like there was a shroud over them, but I could tell they were stil there. And then they were gone.Poof! I posted a bit about this on my FB page then in the morning I went to WTTE Fox 28's FB page and posted asking if anyone else had seen this. Is it a coincidence that later that day, there were 4 big gray helicopters fly in the same path that the objects did, TWICE?? By the way, I've been in the same home for almost 17 years and have never seen more than one helicopter at a time and it's usually life flight. I don't know. I'm not a UFO crazy, I don't watch shows about UFOs but I have seen some unexplained things before, but never something like this. I called my brother who is retired from the Marine Corps and he told me to report this sighting to you, MUFON. I just realised I'm supposed t tell you my feelings. I am amazed, excited and a bit nervous. The thought DID cross my mind \"is this an Alien invasion?\" Oh well. You can call me if you need to. I'm not shy, I'm not embarassed to tell my story and I'm not a wacka-doodle! LOL!"],"Region":"Ohio","Viewing Distance":"Unknown","Weather Factors":"Unknown"}