{"Sighting Duration":"Undisclosed","Disposition":"Unresolved","Case Number":"45110","Longitude":"-69.281586","Country":"United States","City":"Dexter","Source":"MUFON","Region":"Maine","Object Flight Path":"Hovering then path","Tags":"City","Latitude":"45.027948","divs":["Sighting DetailsIt was approximately 12 midnight when the cable television had been flickering and then stopped working. I went outside on my porch over looking the lake for some fresh air and to observe the stars as I often do. I noticed a low, luminous cloud above the small part of Lake Wassookeag across the street. As I was observing the cloud a red glow appeared to the left of the cloud, just below the tree line. I initially thought it was a radio antenna light, then it started to rise. A large,bright red object then emerged from the trees approx. 300 yards away from me(I was facing North). It appeared to be pulsing and was round like an orb with another object in the center emitting red light with some hints of white light as well. After observing the object for a few seconds with the naked eye,I grabbed my binoculars (near by) and observed it again even closer, moving West. I was very excited, astounded! As it continued to move to my left (West), it seemed to cross above the street and move behind another section of trees and houses. I ran down to the street with my binoculars but was unable to regain sight of the object. I went back inside my apartment, to the 3rd floor facing North (the original direction of the sighting) and was unable to see the object. I will never forget this event and continue to share the details."],"files":["/var/www/straped/mufon/html2text/45110.html.txt","/var/www/straped/mufon/org/45110.html"],"Date of the Event":"01/07/2013 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 4 other sightings in Dexter","There were no other sightings in Dexter on or around January 7th 2013"],"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.027948,+-69.281586(45110)&iwloc=A&hl=en\"> mufon case (45110) map </A>","Summary":"A round red object appeared at tree level. It was very close, glowing red. It hovered then started traveling west.","Weather Factors":"Unknown","Object Shape":"Sphere","Date Submitted":"01/09/2013 01:16 UTC","Log Number":"US-01092013-0004"}