{"Date Submitted":"01/10/2013 05:03 UTC","Case Number":"45127","Country":"United States","Latitude":"39.711","divs":["Sighting DetailsI was standing outside on my front porch, engaged in a phone conversation and observing the stars in the east. I noticed a bright star shaped light (a point of light emitting rays, as a star does in the night sky) headed slowly in my direction above the tree line. My first thought was that it must be a helicopter flying low but it made no sound, unlike a helicopter. I walked out into my driveway to get a better view and was still attempting to detect a sound. The light was moving extremely slow in my direction, so slowly that I was sure this was an aircraft preparing to land. The object proceeded to coast above me and my house and neighborhood dogs began barking. I was confused yet curious up to that point. Once it was directly above me I was immediately able to discern that the object was not a common aircraft. The object was boomerang shaped with a small cylindrical protrusion stemming from behind the boomerang. The bright light that I first witnessed was emitting from the front of the craft. There were three white lights located on the bottom of the protrusion in a triangular formation. These three lights blinked sequentially, in a rotating pattern, each taking turn flashing on and off. There were two crescent shaped lights, also located on the undercarriage of the craft. These lights were set on the the tips of the boomerang, and the color of them is hard to describe. They were not quite red having more pink hues and were very dim. The craft proceeded to hover above and still I could not detect a noise. Suddenly all of the white exterior lights, including the bright front light, shut off and I was looking above at a solid black object that blocked out the stars. I became more frightened when this occurred and hid closer to my truck in the shadows. I also lost track of my phone conversation and hung up with the person that I was talking to. I was afraid to move and continued to look up at the black craft which was now slowly creeping westward. I could still make out the dim crescent shaped lights on the ends but the brighter white front light and the ones that had been blinking remained off. Once the object had cleared my immediate location I was better able to see the back and some of the top of the craft. Located on the top I noticed an upward \"pole like\" object that also contained a dim light similar in color to the crescents below. The cylindrical protrusion in the back appeared thicker than the boomerang portion and had a grid like appearance. I was relieved that it was moving away, toward South Table Mountain and the city of Golden. I watched it until I could no longer see it and immediately went inside to call my daughter."],"Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Straight-line path,Path then hovering","trends":["There have been 39 other sightings in Lakewood","There was one other sighting in Lakewood on or around January 9th 2013"],"City":"Lakewood","Object Features":"Patterned Surface","Date of the Event":"01/09/2013 10:00 UTC","files":["/var/www/straped/mufon/html2text/45127.html.txt","/var/www/straped/mufon/org/45127.html"],"Region":"Colorado","Summary":"Noticed a bright slow moving light in the east, once above me the undercarriage lights shut off, object then moved west","Object Shape":"Boomerang","Disposition":"Unresolved","Longitude":"-105.079763","Log Number":"US-01102013-0006","Sighting Duration":"Undisclosed","Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=39.711,+-105.079763(45127)&iwloc=A&hl=en\"> mufon case (45127) map </A>","Source":"MUFON"}