{"Log Number":"US-01102013-0005","Weather Factors":"Unknown","Object Features":"Other","Case Number":"45126","Summary":"Huge Flying object Right over my Car.","trends":["There have been 20 other sightings in Livermore","There were no other sightings in Livermore on or around June 18th 2012"],"divs":["Sighting DetailsI stopped on North Luvermore Road to make a phone call. It was starting to get dark. While looking for the number I noticed Two lights just over the hills. As im looking out my passanger door window I keep looking at the lights because I felt they were too low for a jet on approach, because the lights looked liked landing lights. There is an airport near but not for jets. But I was sure the lights were too bright and too far apart to be a small aircraft. As the lights approached they got further apart but continued in unision. At some point I got out of the car beacuase I could no longer see both lights and everything seemed much darker, like no lights at all. When I stood up I could see the outline of something seeming to cover the sky. I looked to the west to see the tip or outline of this craft, It had sort of a red glowing on two sides but, they were not attached to wings but to the sides of the object. It must have been 1000 or more feet wide and at least twice that long. It seems in my mind to be much bigger but I cant understand how. It made now sound as it went over me and turned west towards San Framsico. I could make out its basic design as it asended and flew out of site towrds the northwest. The back of the craft was huge and had two big white lights that you would have to say were engines. It looked like a giant black battleship in the sky. So much larger than my mind could imagine something being able to fly and no noise. I have very strong belives based on phicics and some common logic that prevents me from beliving in beings from places too far away to even begin a project to come to our planet light years away. I do however, want to know if anyone saw this craft as well. It kind of bothers me. I have a cell phone pic, but it just shows two white dots, Have a nice day."],"Date of the Event":"06/18/2012 08:15 UTC","Sighting Duration":"Undisclosed","Longitude":"-121.76997","Disposition":"Unresolved","Latitude":"37.722233","Region":"California","Date Submitted":"01/10/2013 04:16 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.722233,+-121.76997(45126)&iwloc=A&hl=en\"> mufon case (45126) map </A>","City":"Livermore","Object Shape":"Disc","Source":"MUFON","files":["/var/www/straped/mufon/html2text/45126.html.txt","/var/www/straped/mufon/org/45126.html"],"Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Object Flight Path":"Path with directional change"}