{"Log Number":"US-01102013-0003","Latitude":"39.731742","Date of the Event":"01/10/2013 11:48 UTC","Sighting Duration":"00:00:03","Object Flight Path":"Other,Unknown,N/A","map":"<A HREF = \"http://maps.google.com/maps?q=39.731742,+-104.82445(45124)&iwloc=A&hl=en\"> mufon case (45124) map </A>","Object Shape":"Unknown","Date Submitted":"01/10/2013 03:16 UTC","Weather Factors":"Unknown","Summary":"A light was seen that flashed very brightly out of the corner of our eyes.","Region":"Colorado","Longitude":"-104.82445","City":"Aurora","Source":"MUFON","Object Features":"None, Unknown","trends":["There have been 48 other sightings in Aurora","There were no other sightings in Aurora on or around January 10th 2013"],"files":["/var/www/straped/mufon/html2text/45124.html.txt","/var/www/straped/mufon/org/45124.html"],"Country":"United States","Disposition":"Unresolved","Case Number":"45124","divs":["Sighting DetailsIt was around 11:48PM on January the 9th of 2013. My cousin and myself witnessed a very bright light that almost seem like a power transformer exploding although this was more areal and much quicker. It is quite dark out in this side of town since its out of some of the city lights. We were sitting in my cousins truck and we saw this light flash out of the corner of our eyes. This is the most recent one. we have seen this light flash twice before. once in my room in my house, while looking out the window into a near part another part of town. there we saw another flash of light, again only lasting a short few seconds out of the corner of our eyes. it was pretty massive in how much \"area\" it seemed to spread out over. the other and so far, final experience, we were going on a late night bike ride within this same area, and on our way to the end of the block we saw, again, this flash of bright white light, it was also quite large in how much area it \"covered\" in light for just the short second(s) it lasted. there is a local air port and air force base nearby for what its worth, although it doesn't seem to be a physical object but something areal and fast."],"Tags":"City","Viewing Distance":"Unknown"}