{"Object Features":"Unknown","City":"Worthington","Object Flight Path":"Path with directional change","Disposition":"Unresolved","Source":"MUFON","files":["/var/www/straped/mufon/html2text/45122.html.txt","/var/www/straped/mufon/org/45122.html"],"Date of the Event":"01/09/2013 09:40 UTC","trends":["There have been 2 other sightings in Worthington","There were no other sightings in Worthington on or around January 9th 2013"],"Date Submitted":"01/10/2013 12:04 UTC","Weather Factors":"Unknown","Region":"Ohio","Longitude":"-82.993911","Latitude":"40.094959","Summary":"Multiple fast moving objects","Log Number":"US-01102013-0001","Country":"United States","divs":["Sighting DetailsAt about 9:15 pm I told my wife I was going to take a walk around the block and go down to the park in our neighborhood to look at the stars. I do this quite often as it gives me a chance to have a cigarette away from the wife and kids. I love to look at the stars and in Ohio you don't have too many clear nights to do so. Let me state I am a firm believer in ufos,so yes I am always keeping an eye out for anything out of the ordinary as well. I got back to my house about 9:40 pm and was standing in my driveway finishing my cigarette. I was still looking at the sky, specifically at what I believe is Venus which was pretty much directly above. All of the sudden a number of objects just appeard in the sky directly above me. This is when it got strange. There were somewhere between 10 and 15 of them and it was like they un-cloaked themselves or something. They looked like a bunch of dimly lit, glowing dashes. They were clearly visible but dim. They didn't have flashing lights like an airplane, which there were plenty of in the sky as well. They moved so fast compared to airplanes or helicopters. They were flying south in what I can only describe as a similar formation as geese fly in, but if the geese were drunk. They were flying very erratically in and out of one another. Some seemed to disappear then re-appear. I was thinking in my head they might honestly be birds at first because of the formation but there is absolutely no way. They were omitting their own light and they were moving way too fast. I thought maybe balloons or something too until their flight paths became more controlled and suddenly they all came together and merged into two separate lights. Then they were gone from my sight. The reason I said their formation was like drunk geese is because the lights that were leading them did not fly erratically and they formed the V shape you see with geese. It was only the lights behind them. Then they all flew into those lead lights. I'm guessing there were still 3 lead lights but at that point I could only see two. I'm color blind so I couldn't tell you specifically what color they were. There was no sound to them. Since there were planes in the sky my best judgement is that they were definately lower that planes. I witnessed the international space station on multiple nights this past summer but at the time thought maybe ufo. Even though i'm a believer I am also skeptical. I started doing research and that is whem I figured out what I saw this summer was the ISS. I've now learned a lot about identifying different anomolies in the sky like satellites, airplanes, iridium flares, etc... Most of these things fly in a straight line path at a reasonnable speed. I have never seen anything fly with the speed and directional changes of what I saw tonight. The sun had long been set so they were not reflecting light like satellites do within that hour after sunset. Unfortunately this event only lasted about 10-15 seconds, but it was long enough for me to make these rational observations. The fact too that they were shaped like dashes instead of round makes these objects unidentified at least to me."],"Case Number":"45122","Viewing Distance":"Unknown","Tags":"City","Object Shape":"Square, Rectagular","map":"<A HREF = \"http://maps.google.com/maps?q=40.094959,+-82.993911(45122)&iwloc=A&hl=en\"> mufon case (45122) map </A>","Sighting Duration":"00:00:10"}