{"Date of the Event":"01/09/2013 10:45 UTC","Region":"Ohio","Disposition":"Unresolved","City":"Marengo","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Object Features":"Unknown","Date Submitted":"01/10/2013 10:49 UTC","Case Number":"45130","Longitude":"-82.810733","Viewing Distance":"21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=40.400894,+-82.810733(45130)&iwloc=A&hl=en\"> mufon case (45130) map </A>","Tags":"City","Source":"MUFON","Sighting Duration":"Undisclosed","Country":"United States","Latitude":"40.400894","divs":["Sighting Detailsbout 5 miles south of marengo toward sunbury. The oject first looked like it could have been a bright star on the horizen, which I thought at first, until I noticed it was moving toward me and getting bigger. At this time I could only see the white light which twinkled like a star,as I was watching it almost looked like a mist yet a falling star not very bright, coming from the left side fallen down,on;y seen this once, my thought was that of a falling star as I watched, thinking this is really strange,and oh that can't be, Then as the object moved closer and them overhead of me, I saw it had white, red and blue lights on the bottom side, white in front, red on left looking up and blue on right, or maybe it is the other way, I was so in shock at what I was seeing!! It moved as in gliding and had no noise. It did have a boomerang type shape, would be the clostest I could say as to the position of the lights. the light did yet did not blink, they seemed almost twinkling like stars do, yet it was very close above me I do not believe it was a blimp, because I really think I would have noticed that typw shape it was so close. I Would really like to know if this was some sort of aircraft (military) or something, the thing that stands out to me is how low it was and the fact I could hear nothing,yet it moved with a good speed to it, but a gliding motion, I was on the phone with a friend at the time, since I never have good service in the house, I was outside on my deck. That thing just moved as if floating yet very fast, I was telling her about it since I have never seen anything like it before I can not tell if there was any type of break up in my phone, that happens a lot anyhow from phone service. My main after thoughts? What in the world was that and I soooo wish I could have taken a picture, as close as it was it would have been a really cool picture, but I was so amazed with what I was seeing, that thought did not even occur to me. Thank you, Sincerely Rebecca"],"trends":["There have been 2 other sightings in Marengo","There was one other sighting in Marengo on or around January 9th 2013"],"files":["/var/www/straped/mufon/html2text/45130.html.txt","/var/www/straped/mufon/org/45130.html"],"Object Shape":"Boomerang, Star-like, Triangle","Summary":"about 5 miles south of marengo toward sunbury. The object I saw had red white and a blue lights on the bottom side, white in front, red on left looking up and blue on right, It moved as in gliding and had no noise.","Log Number":"US-01102013-0009"}