{"Case Number":"45135","map":"<A HREF = \"http://maps.google.com/maps?q=42.464594,+-82.958262(45135)&iwloc=A&hl=en\"> mufon case (45135) map </A>","Tags":"City","Date of the Event":"01/10/2013 05:45 UTC","Viewing Distance":"101-500 Feet","Latitude":"42.464594","divs":["Sighting DetailsWe were travling home from Madison Hgts, Mich to St. Clair Sores, Mich and started noticing real bright white objects in the sky, then we were heading south, objects were in the west traveling east. We say probably 25 or 30 ojects but the ones that caught out attention most were very brillant white. As we traveled further south we kept watching them, one after another they would appear in the sky, we exited mound rd south to 696 east and got off at gratiot rd exit. We headed south on gratiot and there three bright objects in the sky in front of us. The first one was coming West heading east, it made a sharp left turn like a u tutn and headed west. When it turned we could see plainly that it was a triangle shape with red, blue and green lights on the points of the triangle. the 2nd followed the same pattern as the first as it turned my husband saw the shape of it. looked like two big tanks connected in front and back, only could recall bright white lights on that one. Both of them moved slowly without any noise that we could hear. we made a turn to go n on gratoit and before we turned we saw a brillant white light traveling from the east. As we were making the turn we stopped our car and the object then appeared to be hovering over the buildings in front of us, it then shot to the west and moved slowly to the west beside our car, thats when I could see it was a diamond shape with 4 ligts on each point. I watched as it went west until husband turned the car onto gratiot heading North and i could see it no more."],"files":["/var/www/straped/mufon/html2text/45135.html.txt","/var/www/straped/mufon/org/45135.html"],"Object Shape":"Diamond, Triangle","Country":"United States","Disposition":"Unresolved","trends":["There have been 2 other sightings in Eastpointe","There were no other sightings in Eastpointe on or around January 10th 2013"],"City":"Eastpointe","Summary":"traveling east made a quick turn to the west hovered over a building, then crossed gratiot ave over our car to the right of us heading west","Sighting Duration":"Undisclosed","Log Number":"US-01102013-0014","Longitude":"-82.958262","Region":"Michigan","Object Features":"None","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Source":"MUFON","Date Submitted":"01/10/2013 09:06 UTC"}