{"files":["/var/www/straped/mufon/html2text/45143.html.txt","/var/www/straped/mufon/org/45143.html"],"Disposition":"Unresolved","Date Submitted":"01/11/2013 09:57 UTC","Object Shape":"Star-like","divs":["Sighting DetailsLast night, I was lying in bed somewhat on the verge of sleep. My bed has an ascending view through a window at the back of my house which faces a wooded area with no neighbors. Because of this, there is no shade or blinds, and I have a decent view of the sky above. I heard a faint, low frequency rumbling sound - like that of a plane, but slightly off. As I stared out the window, I saw what would appear to be a large shooting star streaming across the sky. However, as it reached the midway point of my view, it slowed rapidly, slowly began to arc back around, and proceeded to zoom off back from whence it came. The whole thing had the feeling of a watching a video recording of a shooting star that was slowed to a stop in the middle, then played in reverse at full speed. I have no idea if this sound was emitted by this thing or not - the two certainly didn't align. I wasn't too clear in my prior post, but I was citing the sound as an explanation as to why I was looking out the window. We often hear noises out there from aircraft, and because of the acoustics of the environment, the sounds are always sound sort of strange -even when we see the planes and they are normal, garden variety air planes, the sounds are odd. Because of the strange acoustics, and subsequently, the strange sounds, I always find my self looking out that window when I hear airplanes going by."],"Viewing Distance":"Unknown","Case Number":"45143","Date of the Event":"01/10/2013 10:30 UTC","Longitude":"-71.435728","Weather Factors":"Unknown","Country":"United States","Region":"Massachusetts","Summary":"Appearance of shooting star that abruptly changed direction and headed back.","Latitude":"42.368584","Sighting Duration":"Undisclosed","Tags":"City","Object Features":"Unknown","City":"Framingham","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=42.368584,+-71.435728(45143)&iwloc=A&hl=en\"> mufon case (45143) map </A>","trends":["There has been one other sighting in Framingham","There were no other sightings in Framingham on or around January 10th 2013"],"Source":"MUFON","Log Number":"US-01112013-0005"}