{"Object Features":"Unknown","Date Submitted":"01/11/2013 02:21 UTC","Longitude":"-112.099735","Disposition":"Unresolved","Country":"United States","Date of the Event":"01/09/2013 12:30 UTC","Sighting Duration":"Undisclosed","Object Shape":"Sphere","Log Number":"US-01112013-0003","Summary":"Loose formation of 10 UFO orbs, moving from East to West","Case Number":"45141","map":"<A HREF = \"http://maps.google.com/maps?q=33.509669,+-112.099735(45141)&iwloc=A&hl=en\"> mufon case (45141) map </A>","Source":"MUFON","Latitude":"33.509669","City":"Phoenix","trends":["There have been 417 other sightings in Phoenix","There was one other sighting in Phoenix on or around January 9th 2013"],"Weather Factors":"Unknown","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/45141.html.txt","/var/www/straped/mufon/org/45141.html"],"Tags":"City","Region":"Arizona","divs":["Sighting DetailsI had gone outside during the last 10 minutes of my lunch break, to give myself enough time to chain smoke two cigs before going back to work. Had clocked out at 11:39 AM for lunch, so this sighting took place precisely between 12:30 and 12:40 PM, local time. I've been seeing white orb UFOs over where I work for the last couple of years. With my first few sightings I just categorized them as odd and random phenomena, but as I continued to witness these white orbs on a regular basis I began to take these sightings more seriously. I finally bought a video camera last year so I could start recording them, and as one might expect from Murphy's Laws, after 4 sightings in January of 2012 when I bought the video camera, the following months through the summer offered nothing to record. Between the summer months and the transition to this winter I'd witnessed a couple of more sightings, but it wasn't enough to convince me to start carrying around my video camera as a matter of habit once again. Observing these white orbs had simply become a personal passtime; watching these other worldly probes prance around in the sky as if pretending to be balloons. It had gotten to the point to where I was beginning to feel somewhat jaded in my response to these sightings, until two days ago. When I glanced up and saw the front three passing overhead, with a very deliberate trajectory lacking any pretense of balloons being carried along by the wind, I was immediately awestruck by what I was seeing. As the front three became obscured by the wispy cloud cover overhead, and I was able to see others following along in the open blue behind them, I became intensely focused and dumbfounded by what I was witnessing. I realized I was seeing six, not three; no, it was eight, no wait, there's ten! Holy friggin guacamole! They were moving along as a loose formation above the lacey cloud cover, with the sort of spread and dispersement pattern you'd expect of ten Army Black Hawk helicopters in flight; somewhat random in their positioning, but with no bob and weave nor sway between them as they passed overhead. By the time they reached the stretch of sky directly over where I work, the rest of the formation had disappeared from sight, leaving only one in plain view with a clear blue back background. That last one faded out of sight right there between the clouds. Later in the afternoon, when I came out for my afternoon break, there was a plane circling around the same patch of sky where these orbs had disappeared. I couldn't make out what kind of plane it was. It wasn't a Cessna trainer, but beyond that I'm not sure."],"Viewing Distance":"501 Feet - 1 Mile"}