{"Region":"Illinois","divs":["Sighting DetailsStepped outside, the sky was clear but could see some clouds getting ready to come in from the SW in the distance, noticed a bright object coming from the same direction, stood and watched it slowly coming my way, it was glowing white light and every now and again it would flash, it would hover in one spot for a little bit then move a little bit and flash. I would say it was about 3 blocks away when it started to decend, as it got lower the tops of the trees lite up, then it just kept coming down into the trees, I could see the light coming from behind the trunks of the trees as it was coming down lower and lower, I ran inside to tell my husband what was happening, he was showering, so I went back outside to watch to see what it was doing, right at that point it was coming up out of the woods,cleared the trees and went off into the direction in which it came (SW). Husband came out of the shower and I told him what I saw, he asked why I didnt go back in the woods, duh!, for one thing its somebodies property, another, its dark, coyotes, and the what if factor and me being by myself."],"Tags":"City","Object Shape":"Circle, Sphere","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.798656,+-88.928351(45156)&iwloc=A&hl=en\"> mufon case (45156) map </A>","City":"Decatur","Longitude":"-88.928351","Object Features":"None","Sighting Duration":"Undisclosed","trends":["There have been 14 other sightings in Decatur","There were no other sightings in Decatur on or around January 11th 2013"],"Object Flight Path":"Path then hovering,Other","files":["/var/www/straped/mufon/html2text/45156.html.txt","/var/www/straped/mufon/org/45156.html"],"Country":"United States","Weather Factors":"Unknown","Log Number":"US-01112013-0016","Date Submitted":"01/11/2013 08:15 UTC","Summary":"Brite object decending into woods","Date of the Event":"01/11/2013 06:07 UTC","Case Number":"45156","Latitude":"39.798656","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile"}