{"Date Submitted":"01/13/2013 02:32 UTC","Date of the Event":"01/12/2013 05:30 UTC","files":["/var/www/straped/mufon/html2text/45176.html.txt","/var/www/straped/mufon/org/45176.html"],"Longitude":"-159.46304","Object Features":"None, Unknown","divs":["Sighting DetailsWent to my car @ about 5.30.AM, looking at the clear sky, noticing a satellite coming from the north, watching that satellite going south. Just when i turned away to enter the car i noticed two lights moving and being just before crossing the path of the satellite, very bright about like venus, thinking that it must be an illusion because of the movement of the satellite i turn my head away, then i turn back to it because of a gut feeling that it is not an illusion. The two lights are still moving. They keep a steady pace a little bit slower than the satellite, the light on the right side is leading the direction the second light follows exactly in distance and direction. It seems like the first light is at the beginning of an object and the second light at the end but there is no object detectable they could be attached to. The first light dims like being behind a cloud, the second one is doing the same when it reaches the same spot, beside this the lights dim in a consistent way since i saw them the first time until they disappear.No sound, first time i noticed them they had been at about 10 o clock if you consider the satellite to be at 12 o'clock and they disappeared at about 3 o'clock. The distance between the two lights was about 5 minutes. A few hours later i compared it with a regular passenger jet landing at the airport about 2 miles away and i would say say the distance between the two lights was 4 to 5 times the apparent length of the jet. I don't think it had been two jets in a perfect configuration because of how the brightness of the lights diminished, two satellites following each other very closely? on an unusual path. I can't figure out what it was, if You have an explanation please let me know, until then it is my little unidentified \"What the heck is that?\""],"Object Shape":"Star-like","Sighting Duration":"Undisclosed","Tags":"City","Case Number":"45176","Region":"Hawaii","Source":"MUFON","Disposition":"Unresolved","Weather Factors":"Unknown","Latitude":"21.911168","Summary":"2 lights moving from NNW to NNE keeping exact distance and configuration first light leading direction straight path bright light in the beginning then deminishing about 1 minute duration","Viewing Distance":"Unknown","Log Number":"US-01132013-0005","map":"<A HREF = \"http://maps.google.com/maps?q=21.911168,+-159.46304(45176)&iwloc=A&hl=en\"> mufon case (45176) map </A>","Object Flight Path":"Straight-line path","Country":"United States","City":"Koloa","trends":["There has been one other sighting in Koloa","There were no other sightings in Koloa on or around January 12th 2013"]}