{"City":"Johnston","Date Submitted":"03/01/2006 05:01 UTC","Latitude":"41.673949","Region":"Iowa","Date of the Event":"03/01/2006 05:01 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.673949,+-93.696297(4517)&iwloc=A&hl=en\"> mufon case (4517) map </A>","Disposition":"Unknown","Log Number":"US-03052006-0003","Object Shape":"Triangle","Source":"MUFON","Summary":"Brilliant, steady, white lighted object seen suburb of Des Moines & Des Moines","files":["/var/www/straped/mufon/html2text/4517.html.txt","/var/www/straped/mufon/org/4517.html"],"Weather Factors":"Unknown","Object Flight Path":"Undisclosed","divs":["Sighting DetailsBeverly Trout reporting a sighting reported by a witness on her way to work as a speech pathologist at the VA Hospital at 5:00 a.m., with sighting lasting some 19 of the 20 minutes it took to get to the VA Hospital. Witness was driving east, and when she turned right (south) on 86th Street in West Des Moines, she saw directly east of her a brilliantly white-lit triangle, though she says she believes she was seeing the rear of the triangle. (She says she was NOT seeing the underside of the object) At first she thought it was stationary, but when she had continuing driving south for two (2) miles, and turned left (East) onto Douglas to drive straight to the VA Hospital, she realized that the object was now SE of her position, so the object must have been moving. By the time she arrived at the VA Hospital, she'd lost sight of the object. It takes 20 minutes for witness to get to work from the suburb of Johnston, so she believes she had the UFO in sight for 19 minutes during her drive. The VA Hospital is in a fairly heavily wooded area with tall trees, so it's very reasonable that the surrounding vegetaion would very soon shut off sight of the object. More later. No sound. More information to come."],"Country":"United States","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Longitude":"-93.696297","trends":["There has been one other sighting in Johnston","There were no other sightings in Johnston on or around March 1st 2006"],"Case Number":"4517"}