{"Region":"South Carolina","Source":"MUFON","files":["/var/www/straped/mufon/html2text/45187.html.txt","/var/www/straped/mufon/org/45187.html"],"City":"Undisclosed","Case Number":"45187","divs":["Sighting DetailsThis is not a UFO sighting but so strange this was the only place I could think to put it. Early this morning something so strange happened that I can't seem to shake this uneasy feeling. Last night I fell alseep on the couch, My wife asked me if I wanted to get up and go to the bed. I said how about just a blanket and leave me sleeping here. Sometime if I get up from where I am sleeping I cannot go back to sleep so its better to stay where i am. I woke up on the couch, it was dark outside and I needed to get up and use the bathroom. My daughters bathroom is not 6 foot from the couch down the hallway. I got up and on my way there glanced over to look at what time it was on the oven clock. It was 2:15. Usually when I get up at this time of night its because something or every once in awhile my 6 year old daughter wakes me up jumping into our bed because of a bad dream which always makes me get up and go to another room. So I go in and use the bathroom which takes only a couple minutes. I walk from there to the kitchen and grab a mountain dew from the fridge, I notice my neck is killing me which is like what i call a CRICK and it hurts like hell. So I go to the couch set the dew on the floor in front of the couch and rub my neck for a moment. I reach down and grab the mountain dew. I pick it up and take a drink and think this is warm, what the heck. I figure something must be wrong with the fridge but thinking it was cold walking over. I noticed i had the use the bathroom and was like what the hell I just went to the bathroom a minute ago. Then I notice that my neck is suddenly feeling alot better, still hurting but not nearly as bad as it was. I keep my laptop on the coffee table and reach over hit the mouse and the computer comes out of sleep mode. This is when I freak the clock say 4:23 am I look over at the oven clock and it says 4:24 am. All of this happening in less then 6 minutes at the most. I got a creepy feeling and started to get very upset and a little scared. I look out the doors which is next to the couch and out across the back yard, I look aand see the motion lights down by the barn some 400 yards away are on. Rarely do we ever see these lights come on and have to be triggered by movment of something. Things get worse for me mentally when I glance down and the door is unlocked and not all the way closed. I cannot explain the way I felt at that moment but I ran to my daughters bedroom and she was not there and turned and ran to ours and hit the light. Both my wife and daughter were in the bed asleep. I came back out to the family room where I was sitting. walked over and pushed the door shut and locked it. Looked out towards the barn and the light was still on, I couldn't see anything except the heavy fog. I had a weird feeling I am not sure if I thought something was at the barn or more that I was so freaked out about what just happened. I sat back down on the couch and spent the next 5 hours thinking about how that could have possibly happened. I still don't know how. Maybe a case of Hypnagogia but I don't think so. I never closed my eyes. Whatever happened to those approx 2hrs, I have no idea. It was totally seamless. I still am baffled how it could have happened, it was 2 something 1 second and 4 something the next second just like that. I have no history of sleep walking, or any other sleeping disorder.I was not asleep I was very much awake. I am trying to figure out how to record from my webcam to my laptop as i will sleep on the couch again tonight to see if anything happens again or to see if I might sleep walk or something. If I do it will be the first time ever. Usually my body is in so much pain when I get up its impossible for me to go back to sleep, I have severe back problems. I have to list this as something and abduction is the only thing I can really put there but I want to make it clear that in no way am I claiming to have been abducted by anyone. One point I forgot to point out is I had both my Schipperkes Sleeping on the back of the couch with me. So if anyone was going to grab me the dogs would have had them for breakfast. Wife said in the morning that when she went to bed all doors were locked up tight."],"Longitude":"-81.154744","Viewing Distance":"N/A","Summary":"Missing 2 hours","Country":"United States","Date of the Event":"01/13/2013 02:20 UTC","Object Features":"None, Unknown","Object Flight Path":"N/A","Object Shape":"Unknown","Log Number":"US-01132013-0015","Disposition":"Unresolved","Date Submitted":"01/13/2013 09:39 UTC","Weather Factors":"Unknown","Latitude":"33.842751","Sighting Duration":"02:08:00","map":"<A HREF = \"http://maps.google.com/maps?q=33.842751,+-81.154744(45187)&iwloc=A&hl=en\"> mufon case (45187) map </A>","Tags":"City","trends":[]}