{"Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","trends":["There have been 2 other sightings in Jefferson","There were no other sightings in Jefferson on or around January 12th 2013"],"Source":"MUFON","Latitude":"34.118294","Date Submitted":"01/13/2013 10:42 UTC","Object Features":"None, Appendage(s), Other","Log Number":"US-01132013-0017","Country":"United States","Tags":"City","Weather Factors":"Unknown","Region":"Georgia","Disposition":"Unresolved","Object Shape":"Other","Longitude":"-83.566588","Object Flight Path":"Straight-line path","Summary":"Flu over us 129 over high school. It was big. Biger than anything Ihave seen","City":"Jefferson","files":["/var/www/straped/mufon/html2text/45189.html.txt","/var/www/straped/mufon/org/45189.html"],"Date of the Event":"01/12/2013 05:15 UTC","Case Number":"45189","divs":["Sighting DetailsI was leaving athens heading home to gainesville. As I was heading up us 129 through jefferson. I was about a quarter mile before the high school. When I looked up the hill I saw at first what I though to be a chinook carrying somethig by a cable. As I came closer to the high school I new it was not an air craft of any kind I have ever seen. I was in the military for 6 years and was once an anti aircraft gunner and I know my aircraft. This thig looked like the end of a hammer with the teeth end of it pointed to the front and then below it was what looks like a black pipe that went for about 25 feet. Then connected at the end of the pipe was a smaller structure about 25 percent smaller than the top. It was the same shape but was like an upside down hammer top with the teeth end pointed the same direction as the abouve. It looked like something out of Star trek. I got excited and as I passed the school there is a large embankment at the end of the street were the school is and it went behind it. As I passed it and had a clear view of the back of the school and the horison there was no sign of it. It was cloudy and I saw some con trails just below the clouds but this thing moved about 3-4 mph in a very smooth straight path just gliding across the sky fairly low about 500 feet above the tree line. I came home and googled to see if anyone had reported something simular and saw a listing that was simular to mine. It had simular fetures but the object was shinny. the object that I saw was almost as grey as the clouds. Very strange. I am still in aww. And I have never saw an aircraft like that. And I know just about every military air craft there is...lol Hope you find this interesting. I am excited to see if there have been similar sitings in the area. It made no sound but by van sputterd upon toping the incline prior to reaching the school. Intersection."],"map":"<A HREF = \"http://maps.google.com/maps?q=34.118294,+-83.566588(45189)&iwloc=A&hl=en\"> mufon case (45189) map </A>"}