{"Object Flight Path":"Straight-line path","Date Submitted":"01/14/2013 12:21 UTC","Object Features":"None","Source":"MUFON","Sighting Duration":"00:02:00","Country":"Australia","map":"<A HREF = \"http://maps.google.com/maps?q=-31.632539,+152.703725(45197)&iwloc=A&hl=en\"> mufon case (45197) map </A>","Date of the Event":"12/31/2012 09:35 UTC","Log Number":"AU-01142013-0007","Case Number":"45197","Summary":"An orange transparent glowing disc travelling silently in a NE direction, 2 witnesses.","divs":["sighting detailsit was a crystal clear night on new years eve on the mid-north coast of new south wales. i wandered out side to relax on my front porch and admire the beauty of the stars. a few minutes later a slightly transparent glowing orange disc caught my attention. it took me a couple of seconds to realize what i was looking at was unnatural. the object moved smoothly and silently in a ne direction. i first observed the object when it was approx. 70 degrees above the horizon. although it had a straight line path and traveled at an approx. speed of 500km\\h, i quickly ruled out a plane. it was a large disc, it had no visible external lights, it was silent. after a few seconds i ran and grabbed a camera, told my relative whom lives with me, then ran back outside to record the object. by this time it was still visible, unfortunately i failed to correctly operate the camera. however, my relative observed the object as it was gradually disappearing over the horizon. i was startled to say the least. i have researched all possibilities and so far remains unexplained. i am now a believer."],"Tags":"City","Disposition":"Unresolved","Weather Factors":"Unknown","Object Shape":"Circle, Disc","Viewing Distance":"501 Feet - 1 Mile","Longitude":"152.703725","files":["/var/www/straped/mufon/html2text/45197.html.txt","/var/www/straped/mufon/org/45197.html"],"Region":"New South Wales","trends":["There have been no other sightings in Kendall","This sighting has been favorited 1 time."],"Latitude":"-31.632539","City":"Kendall"}