{"Object Flight Path":"Unknown","Source":"MUFON","Viewing Distance":"Over 1 Mile, Unknown","Log Number":"US-01142013-0002","Object Shape":"Flash, Sphere, Star-like","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Features":"None, Unknown","Date Submitted":"01/14/2013 01:33 UTC","Country":"United States","City":"Austin","files":["/var/www/straped/mufon/html2text/45192.html.txt","/var/www/straped/mufon/org/45192.html"],"trends":["There have been 188 other sightings in Austin","There was one other sighting in Austin on or around July 7th 2012"],"Longitude":"-97.736371","Region":"Texas","Date of the Event":"07/07/2012 11:30 UTC","Latitude":"30.270723","Tags":"City","Case Number":"45192","Summary":"While using an ipad to locate constellations, my friends and I witnessed what appeared to be a star imploding while I pointed at Ophiuchus.","Weather Factors":"Unknown","divs":["Sighting Details I was living in Houston and went on a trip to Mckinney Falls with three other people. I drove there, and we got to the camp grounds late into the evening. Because we were late to set up, we chose the first site we found. Later, a park ranger came by and after explaining that we did not formally sign up for the two spots we chose, the man allowed us to stay there after filling out some information. Fast forward a couple of hours. It was well after dark, and we were finishing up a late meal and discussing the vastness of the universe. My friend, who I shall call K, decided to bring out her new Ipad and show off the constellation application she had on it. After pointing out a few constellations, I mentioned that I thought the Draco system was above my campsite [which was about ten to fifteen feet away from where her site was]. So my three friends and I all get up from the picnic table and go to my tent, where we are facing what appeared to be a snake-like constellation in the sky. K brings the Ipad up to the direction of where I had mentioned, and pauses. \"That's not the Draco system,\" she replies. \"Oh no?\" I replied \"Then which one is it?\" Rather puzzled, she responds \"That is Ophiuchus.\" After a brief explanation, I had gathered that this was the thirteenth sign taken out of the zodiac some time ago [I believe it was during the Roman empire]. Excitedly, I point my finger directly at it and exclaim \"That is Ophiuchus?! That is the thirteenth sign?!\" That's when things got crazy. At that exact moment, there was a bright flash off to the left, behind the trees that were immediately next to us. The two girls I was with looked to the left and started gasping and trying to make sense of it, when suddenly, what appeared to be a star exactly where I was still pointing imploded. So there was a bright flash to the left, and immediately after that flash what seemed like a star imploded right in the spot I was still pointing. The light grew from the size of a normal star's light to about the size of a dime in a yellowish- green wispy aura; and then just as soon as it had done so sucked into itself and vanished. My friend, N and I were the two people who saw the extent of it. The two girls saw the flash on the left, which I saw out of the corner of my eye, and N and I saw the \"star\" implode in on itself and vanish. As one can imagine, the rest of the night all four of us were on edge. We tried to explain these events with pure logic, where obviously there was something very off about it. What are the odds we witness a star implode right as we discover the thirteenth symbol of the zodiac? What was the flash off to the left right before this occurrence? So, not surprisingly, we stayed up for awhile laying in our two separate tents, staring at stars, and wondering what in the world had just happened. Afterwards, we saw strange activity among the stars; basically it seemed like some of the \"stars\" wouldn't stay still and were doing loops and lazy zig-zags across the sky. All of us saw it, but blamed it on the adrenaline; claiming it was a trick of the eyes. We convinced ourselves that we were looking for more activity. One thing that happened right before we finally slept, however,stood out among the rest. I joked about summoning a UFO and one of the \"stars\" got brighter and seemingly got closer as I very loudly ushered it to come down. The two girls I was with, however, did not find it funny [our nerves were still very frazzled]. They both yelled at me to cut it out and I complied. The next day, on the way home, K discovered that China had to shut down an airport the same night due to the massive sightings of a very large UFO. It seemed that we were not the only people on the Earth witnessing strange phenomenon. Although I do not have video or photographic evidence, there are three other eyewitnesses that were with me that night. The lack of physical evidence is the main reason I never tried to report it, but due to all the sightings recently I finally felt comfortable to at the very least report this to a well known UFO-sighting community. Safe travels, truth- seekers :)"],"map":"<A HREF = \"http://maps.google.com/maps?q=30.270723,+-97.736371(45192)&iwloc=A&hl=en\"> mufon case (45192) map </A>"}