{"Date of the Event":"01/12/2013 07:09 UTC","Object Shape":"Triangle","Object Flight Path":"Hovering then path,Straight-line path","Source":"MUFON","Disposition":"Unresolved","Country":"United States","Date Submitted":"01/14/2013 04:48 UTC","Case Number":"45199","Viewing Distance":"Unknown","Sighting Duration":"07:09:00","Tags":"City","files":["/var/www/straped/mufon/html2text/45199.html.txt","/var/www/straped/mufon/org/45199.html"],"Weather Factors":"Unknown","Object Features":"Window(s)","Latitude":"30.499771","divs":["Sighting DetailsWent out in my backyard for about ten minutes and started to head inside but right when I started to go inside, I heard something humming behind me. Looked behind me to find a giant black triangle shaped craft hovering above the powerlines behind my house. I first noticed the object through a relfection on my screen door so I turned around and the craft just hovered above the powerlines behind my house. It had a few windows around it and a small beam of light shot down from the middle below the craft. The object of course was black in color and shaped as a triangle, about four giant circular lights below the craft all completely white in color, then the middle of the light shot down this large beam of yellow light down onto the powerlines affecting my cellphone. It had about maybe five windows on the front side but I saw absolutely no one on board until the craft changed dirrections. I then saw about ten small four feet tall figures aboard the craft looking down at either the controls inside the craft, down at the powerlines, or down at me. I felt completely shocked that I saw this actually happen for once, so once it started leaving I followed it until the fence cut me off in my yard then I just continued staring at it until it left in fast speed. Lost sight of the craft once I was cut off at the fence in my backyard. Haven't seen anything since."],"Summary":"Black Triangle Craft Hovered Then Took Off In Matter of Seconds.","City":"Cedar Park","Longitude":"-97.80242","map":"<A HREF = \"http://maps.google.com/maps?q=30.499771,+-97.80242(45199)&iwloc=A&hl=en\"> mufon case (45199) map </A>","Region":"Texas","Log Number":"US-01142013-0009","trends":["There have been 14 other sightings in Cedar Park","There were no other sightings in Cedar Park on or around January 12th 2013"]}