{"Case Number":"45194","Sighting Duration":"00:00:30","Date Submitted":"01/14/2013 05:52 UTC","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Country":"Mauritania","trends":["There have been no other sightings in Cansado","This sighting has been favorited 1 time."],"Object Shape":"Flash, Oval, Sphere, Teardrop","Summary":"A sudden bright flash of light broke the atmoshpere and for a split second what seemed like an aircraft of light shot to the west.","Tags":"City","Region":"Dakhlet Nouadhibou","Latitude":"20.85","files":["/var/www/straped/mufon/html2text/45194.html.txt","/var/www/straped/mufon/org/45194.html"],"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=20.85,+-17.033333(45194)&iwloc=A&hl=en\"> mufon case (45194) map </A>","Weather Factors":"Unknown","Date of the Event":"02/22/2008 06:30 UTC","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Longitude":"-17.033333","divs":["Sighting DetailsI decided to wake early in the morning to photograph the sunrise in Cansado, Mauritania. It was about 6:30 am local and I was out on the coastline with a local boy I had met during my visit. As I taking test photos, a sudden flash and crash of thunder rolled out across the ocean. A single bright light appeared, and what followed was a streaking portion of light about which an orb formed, a few hundred meters above the water line about a half kilometer out. It hung in this state for only a moment before it streaked west, leaving a glowing white trail that faded. The event occurred over no more than 30 seconds, the initial appearance before the 'departure' lasted a mere 5 from apparition to departure. It seemed to me that the craft or object entered into atmosphere spontaneously, disturbing the local air pressure momentarily, as if a pressure wave of something violently occupying the space of air previously vacant. A crash similar to thunder rolled out, though quieter, and a pocket of blue light stretched as a purple glowing orb exited. As the streak of light and orb hung, they seemed to again stretch out in an odd fashion before another, smaller flash occurred and the orb streaked out in a trail of blue white light that hung in the air for a few second after it's departure. This was the only photo that properly exposed during the incident due to the light from the event and the ambient light of the environment."],"Log Number":"MR-01142013-0004","City":"Cansado"}