{"divs":["Sighting DetailsWas sitting in my car having a conversation with a friend. I first noticed the object thinking it was a helicopter or plane in the close distance. About 5 minutes later i noticed it had not moved, so i started watching it. I noticed it would elevated and glide side to side covering a matter of a mile or so in each direction in a matter of a second. The object was glowing and pulsating . It would blend colors from an orange to golden yellow to a peach color. It zig zagged for about 15 minutes over Mesa Rock mountain until it dropped elevation and descended down smoothly till it was probably 1000 ft about the rock formation. The object then started glowing even brighter, as it bubbled out approx 3 dozen red flickering orbs. These red orbs flickered until they were about half way down to earth, than disappeared. After the orbs stopped coming out the object ascended about 1000ft higher than sat for about 5 minutes. It then went bright then disappeared about 5 or six times till it finally went black."],"City":"Escondido","Date of the Event":"12/11/2011 12:00 UTC","Sighting Duration":"Undisclosed","Tags":"City","Summary":"Glowing peach to yellow colored orb that would smoothly glide side to side then drop small red orbs to the ground","Disposition":"Unresolved","Date Submitted":"01/14/2013 10:58 UTC","Object Flight Path":"Hovering then path,Path then hovering","Source":"MUFON","Weather Factors":"Unknown","Longitude":"-117.078086","trends":["There have been 28 other sightings in Escondido","There was one other sighting in Escondido on or around December 11th 2011"],"Object Shape":"Sphere","Region":"California","Latitude":"33.143891","Viewing Distance":"Over One Mile","Country":"United States","files":["/var/www/straped/mufon/html2text/45208.html.txt","/var/www/straped/mufon/org/45208.html"],"Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=33.143891,+-117.078086(45208)&iwloc=A&hl=en\"> mufon case (45208) map </A>","Case Number":"45208","Log Number":"US-01142013-0017"}