{"Viewing Distance":"20 Feet or Less","Case Number":"4520","Date Submitted":"02/28/2006 08:45 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/4520.html.txt","/var/www/straped/mufon/org/4520.html"],"Object Features":"Unknown","Region":"Indiana","Summary":"12 lights lined up sparkle and then big dimmed white light as we pass.","Country":"United States","Object Shape":"Star-like","trends":["There have been 2 other sightings in Morocco","There were no other sightings in Morocco on or around February 28th 2006"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.949026,+-87.444283(4520)&iwloc=A&hl=en\"> mufon case (4520) map </A>","Latitude":"40.949026","Object Flight Path":"Unknown","Date of the Event":"02/28/2006 08:45 UTC","Log Number":"US-03052006-0006","Disposition":"Unresolved","City":"Morocco","Source":"MUFON","Tags":"City","Weather Factors":"Unknown","divs":["Sighting Details(yes i know i've told you about three sightings in one week, but i wasn't lying about any of them. Just telling ya.)I was taking my friend home again and again it was me, my dad, and my friend (on a different night.) We went down the same route as last time down 41 and up 14. After we dropped her off again at her house, i said dad lets look for UFO's again. So we did. We drove down the same road we dropped her off at. Then, my dad said what are those 12 lights lined up in a row?(they were flickering and reflectors don't do that) i didnt know and my dad said lets find out. So we drove down right where the thing was it was landed. about 30 ft in front of us. Im not sure if these were reflectors or not, but 1st my dad said it was a tractor. But then we stopped right in front of it and pulled off the road a bit. We turned our lights off and the lights did too. I still wondered if they were reflectors or not, but when we looked closer the lights looked as if they were floating because nothing was holding them up (i think im not quite sure because it was too dark to see much of anything.It looked like a telephone line were holding these things together, but the \"telephone line\" didnt run vertically,as usual, it ran horizontally across the road but the same height as a telephone wire.) Then when we passed it i looked over and a huge dimmed circle lit up a little but it was very dim. Now that i think of it it couldve been a huge light very huge about the size of a tire maybe a little smaller. We then drove home and i looked back and nothing was lit up. P.S. MUFON, was this object a reflector or something more? If it wasn't a reflector what was it? Please respond ASAP."],"Longitude":"-87.444283"}