{"Sighting Duration":"Undisclosed","Object Shape":"Triangle","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=42.307895,+-87.864818(45204)&iwloc=A&hl=en\"> mufon case (45204) map </A>","Source":"MUFON","Disposition":"Unresolved","Date Submitted":"01/14/2013 10:16 UTC","divs":["sighting detailsmy first child was born earlier in the day and i needed to take my mother in-law home, since i was staying at the hospital overnight. i let her in my house, grabbed my dog, and tied on his leash. i took him out to the front yard and started looking into the sky, thanking the lord for the birth of my child. for some reason my eyes caught a glimpse of what appeared to be a transparent object in the sky. however, when i focused in on the moving object\\s i notices three orange lights or orbs in a triangular formation. i was unable to tell whether they were separate or one larger object. at first i thought it was the clouds moving, but when i saw the lights (orange objects) i realized it was not a normal aircraft nor was it a helicopter or meteor shower. it was too smooth and fluent of a motion and direction in flight for that. i was confused and stunned at the same time. i went to pull out my phone to take a picture and when i had it ready i lost the objects from pulling my eyes away. after the incident i went inside and told myself that i was not crazy. i waited until i calmed down and drove back out to the hospital."],"Tags":"City","files":["/var/www/straped/mufon/html2text/45204.html.txt","/var/www/straped/mufon/org/45204.html"],"Viewing Distance":"N/A","Object Flight Path":"Straight-line path","trends":["There has been one other sighting in North Chicago","There were no other sightings in North Chicago on or around January 7th 2013"],"Longitude":"-87.864818","Country":"United States","Date of the Event":"01/07/2013 05:20 UTC","Region":"Illinois","Case Number":"45204","Log Number":"US-01142013-0013","Weather Factors":"Unknown","Summary":"Transparent object/s in vicinity of Great Lakes Naval Training station.","City":"North Chicago","Latitude":"42.307895"}