{"Object Shape":"Boomerang, Triangle","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/45212.html.txt","/var/www/straped/mufon/org/45212.html"],"Date Submitted":"01/15/2013 03:49 UTC","divs":["Sighting DetailsI was driving from W. LA to Long Beach during morning traffic sometime around Easter of 1986. I was just south of LAX, in the area where there are many defense co's like TRW, Hughes. Traffic had come to a stop, and while looking ahead and up and off to the right, I noticed a large, black triangular object absolutely motionless hovering above the buildings on the frontage road adjacent to the 405 highway. I continued to watch it while traffic inched along, and at one point the driver of the car to my right looked up as well, and we looked at each other and the other driver shrugged as if saying \"I don't know what it is\". I continued to watch as long as I could, however traffic picked up and I could not see the object in my rear view mirror. One of the more striking features was that the object seemed absolute black, in that it almost seemed to absorb light, or could have been a black triangle cut out of the blue sky above. It's hard to gauge it's size and altitude as there were no visual clues such as shadows to compare to the angle of the sun. I would estimate that it could have been as wide as 100+ ft, and very much the profile that we see of stealth aircraft. I had considered at the time that perhaps it was some type of antenna undergoing tests at one of the defense companies that are along the roadway there. But I could see no tethers, supports, or means of keeping this large object motionless and at altitude. My background is laser and electro-optical technology, and I have a background in intel applications, as well as motion picture and broadcasting technology. This object did not appear to me to be causing any threat or hazard, and because of it's proximity to LAX and these defense co's, I'm surprised that there was not more made of it's appearance at this location. I've never heard of any other reports of this event, although I've heard of reports of similar objects in this area. I also have quite a few hours of satellite observing, and am familiar with sat's such as the NOSS, and other spy sat's."],"trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around April 5th 1986"],"Object Features":"None","Viewing Distance":"501 Feet - 1 Mile","City":"Los Angeles","Source":"MUFON","Country":"United States","Summary":"Absolute black large triangular craft in daylight near LAX","Date of the Event":"04/05/1986 12:00 UTC","Object Flight Path":"Stationary","Disposition":"Unresolved","Region":"California","Tags":"City","Log Number":"US-01152013-0001","Case Number":"45212","Latitude":"33.942104","Longitude":"-118.402644","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.942104,+-118.402644(45212)&iwloc=A&hl=en\"> mufon case (45212) map </A>"}