{"Weather Factors":"Unknown","Tags":"City","trends":["There has been one other sighting in Pasig City","There were no other sightings in Pasig City on or around January 15th 2013"],"Object Shape":"Triangle","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/45213.html.txt","/var/www/straped/mufon/org/45213.html"],"Date Submitted":"01/15/2013 06:06 UTC","Date of the Event":"01/15/2013 03:15 UTC","Object Features":"Patterned Surface","Country":"Philippines","Longitude":"121.097375","Summary":"Triangle, darker that the night sky but not pure black 3 lined lighs on Back and so flat human cant walk in it,slow and interior factory like sounds and hum.","Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","City":"Pasig City","Latitude":"14.607988","Object Flight Path":"Straight-line path","divs":["Sighting DetailsMy fathers pigions were making a lot of noise, Due to a lot of cats I got up from a half sleep to find if any cats were on the sheds, when I stepped outside I heard clicking thumping humming sounds and straight away looked up to see this huge craft really big, it was a dull dark greyish colour with no streetlike shine, it was traveling at aproximately 30mph, I stood back indoors and looked at it passing from kitchen back window, it had 3 maybe 10 ft wide lined lights that werent too bright, when it went further I noticed it was very flat, about 10-15ft flat compared to its huge size, I knew it was no normal craft and even though it looked human built I still had aliens in my thoughts, when it passed over School collage roof and dissapeared the birds quietened, I couldnt sleep for over 2 hours, Im only reporting this as Im only up now. What I saw is not a huge Blimp fowmed in a triange shape as the weather was cold, clear and windy while this was going against the wind. In relation to no pic or video, that thought crossed my mind yes but I knew going to grab the phone would of lost me precious viewing time and I was not going to get it and loose sight getting it, this was 1 minute, my heart was literally thumping so hard my way of thinking was effected. I would like to remain Anonomous, say all but my name. thanks"],"Case Number":"45213","Region":"Metro Manila","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=14.607988,+121.097375(45213)&iwloc=A&hl=en\"> mufon case (45213) map </A>","Log Number":"GB-01152013-0002"}