{"Source":"MUFON","Log Number":"US-03062006-0001","Viewing Distance":"Unknown","City":"HALE MI","Country":"United States","Date of the Event":"07/10/2005 10:44 UTC","Case Number":"4521","Sighting Duration":"Undisclosed","Latitude":"44.377972","Object Features":"Undisclosed","Summary":"I saw an unidentified aircraft hovering over the treetops.","Date Submitted":"07/10/2005 10:44 UTC","Weather Factors":"Unknown","Tags":"City","Disposition":"Insufficient Data","divs":["Sighting DetailsI just turned off of M65 east onto Curtis Road. Just as I was coming up the hill, on the left hand side the craft lit up like the sun. I knew it was a ufo when I first saw it because it was so huge and bright. There was no sounds and no wind. It was hovering and it had either 2 or 4 sets of lights on the bottom of the craft,I am not sure if it was2 or 4 because 1 set of lights went on and then they went off and another set of lights came on. The lights were alternating from front and back to side to side, and the lights were turning off and on faster and faster. I would say the craft was at least the size of a football field,it was circular. It was just hovering above the trees, with the lights increasing with speed. Out of the top of the craft came 6 red and blue, looked like they were half red and half blue , not sure what to call them, but they were about 6 foot in diameter and round . They flew in the sky,until they looked about the size of a dime. There were 2 airforce jets in the air coming toward them , as the jets approached, they split into 2 groups of 3. One jet went after one group while the other jet went after the other group. As the lights on the craft blinked about one second apart from the other set of lights on the bottom of the big craft, it dissapeared into thin air right before my eyes. The jets chased the 6 little ones for about 30 minutes, then theywere all out of my sight and hearing. I was in total awe and I will never forget it. I know what I saw and nobody can tell me different."],"trends":["There have been no other sightings in HALE MI","This sighting has never been favorited."],"Longitude":"-83.804796","map":"<A HREF = \"http://maps.google.com/maps?q=44.377972,+-83.804796(4521)&iwloc=A&hl=en\"> mufon case (4521) map </A>","Object Shape":"Circle","Region":"Michigan","files":["/var/www/straped/mufon/html2text/4521.html.txt","/var/www/straped/mufon/org/4521.html"],"Object Flight Path":"Undisclosed"}