{"map":"<A HREF = \"http://maps.google.com/maps?q=41.221711,+-121.439571(45229)&iwloc=A&hl=en\"> mufon case (45229) map </A>","City":"McArthur","divs":["Sighting DetailsI was asleep in bed and was awoken by my dogs whining and my rv shaking. I thought it was the wind at first then as my senses became clearer I realized I was hearing a humming sound like a dull bass filled electric motor type of sound but loud enough to vibrate the rv. It was bright out like the sun was coming up and I got up to go out and see what was making the noise. Before I could get to the door I heard what sounded like someone running on top of the rv and then it got dark outside instantly and was silent. When I opened the door there was what looked like a breaking fog just a few feet above my rv that went as far as I could see in each direction that faded away like a puff of cigarette smoke in only a few moments. I realized that it was three in the morning and was rather confused about the light and sound mostly. I live on a mountain far from any neighbors or traffic on a road that I have to use sleds to get in and out in the winter, so I know there was no vehicles passing by. There is no power here either, other than generator, which was not running, so it couldn't have been electrical..During the period I was hearing the humming, my hair was standing up as though in a static or magnetic field, and I felt a slight tingling around my hands. My dogs never normally get scared of anything and they continued to whine and huddle in the corner for over an hour after it was over. I know it wasn't a helicopter because they do frequently pass over my area and I know what they sound like. This wasn't as loud as something like that. I'm wondering if anyone in my area saw anything that night to help me piece it together? I see lights along the ridge I am next too frequently, but none have ever come this close before."],"Case Number":"45229","Date of the Event":"01/14/2013 12:00 UTC","Viewing Distance":"Unknown","Latitude":"41.221711","Object Shape":"Unknown","Log Number":"US-01152013-0018","Object Flight Path":"Unknown","Date Submitted":"01/15/2013 06:26 UTC","Weather Factors":"Unknown","trends":["There have been no other sightings in McArthur","This sighting has been favorited 1 time."],"Object Features":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/45229.html.txt","/var/www/straped/mufon/org/45229.html"],"Disposition":"Unresolved","Longitude":"-121.439571","Region":"California","Country":"United States","Tags":"City","Summary":"All I could see was the illumination outside my windows. It was so bright I thought it was morning."}