{"Date Submitted":"01/15/2013 02:38 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.562862,+-83.128711(45220)&iwloc=A&hl=en\"> mufon case (45220) map </A>","Log Number":"US-01152013-0009","Source":"MUFON","Viewing Distance":"21-100 Feet","Sighting Duration":"Undisclosed","Latitude":"42.562862","Object Flight Path":"Straight-line path,Path with directional change","Case Number":"45220","trends":["There have been 18 other sightings in Troy","There were no other sightings in Troy on or around January 13th 2013"],"Region":"Michigan","Summary":"Saw 3 red/orange lights while driving home from work","Object Shape":"Circle, Star-like, Triangle","divs":["sighting details was on my way home from work at approx 12:40 am and on the phone with my brother. i was on big beaver rd. heading east, and was about to turn right onto rochester road when i saw this red\\orange light flickering and moving west. it was about to cross my path and was maybe 50 feet above me beneath the low lying cloud cover. i pulled into the parking lot and stopped to watch it as i thought it was a chinese lantern or something like that. i realized that it was not a lantern and was red light moving without sound, and it was not windy outside. then a second light came into view, running parallel to the ground and following this light. that's when i got off the phone, got out of my car, and attempted to use my iphone to record. once i got out of the car, the lights started moving farther away and higher in the sky. a third light came into view and then all three formed a triangular pattern. they stayed in that position for a bit, and then disappeared one by one. my video was shaky as i got back into my car and tried to pull past the large lights in the parking lot so that i would not have any light pollution in the video. all i can say was it was extremely strange and i have never seen anything like that before in my life. did anyone else witness this? i know there were other drivers at that intersection at that time."],"Date of the Event":"01/13/2013 12:00 UTC","Weather Factors":"Unknown","City":"Troy","Tags":"City","files":["/var/www/straped/mufon/html2text/45220.html.txt","/var/www/straped/mufon/org/45220.html"],"Country":"United States","Object Features":"None","Longitude":"-83.128711","Disposition":"Unresolved"}