{"City":"Ruston","divs":["Sighting DetailsI was awoken by a brilliant white light, lighting up my bedroom. I heard the rustling of leaves and flowers, but not a sound from the object. It moved alongside my house, across the field in front of my house, across the road, to the neighboring property. It hovered for 3 or 4 minutes in the middle of the field, shone a beam of light on the ground, then dropped quickly to the ground for about 5 minutes. It shot up at an angle, hovered again for a minute, then suddenly zoomed at an amazingly fast rate back in the direction it had come from. I went outside to look for it, but it was out of sight. I knew when I first saw it that it couldn't be anything ordinary, because of the way it moved soundlessly, hovered in mid-air, dropped to the ground in a second, moved at angles, then took off at jet speed, accelerating in a second. I was very excited and amazed during the sighting. I noted the time, from 2:00 AM to 2:20 AM. I tied my curtains together in a knot because I thought, that when I told people about what I saw, they would say I had dreamed it. The next day I told my father about it, and I thought it should be reported to someone. He discouraged me, and said it probably was a weather balloon, or my imagination. Barksdale Air Force base was about 100 miles away, and they might have some sort of experimental craft. He also said people who made such reports were the objects of ridicule. I was a grad student, relatively young. I still followed my parents' advice. So, I never reported it officially. I've told people throughout my life. I swear it is absolutely true."],"map":"<A HREF = \"http://maps.google.com/maps?q=32.543921,+-92.653327(45221)&iwloc=A&hl=en\"> mufon case (45221) map </A>","Date of the Event":"05/15/1973 02:20 UTC","Log Number":"US-01152013-0010","Object Features":"None","Date Submitted":"01/15/2013 02:46 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Disposition":"Unresolved","Source":"MUFON","Summary":"I was awoken by a brilliant light. It moved slowly to a point across the road, where it hovered, dropped to the ground, quickly rose at an angle, hovered again, then took off like a shot.","Tags":"City","Latitude":"32.543921","Case Number":"45221","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Country":"United States","Region":"Louisiana","Object Shape":"Disc, Fireball, Oval","trends":["There have been 6 other sightings in Ruston","There were no other sightings in Ruston on or around May 15th 1973"],"Longitude":"-92.653327","files":["/var/www/straped/mufon/html2text/45221.html.txt","/var/www/straped/mufon/org/45221.html"],"Viewing Distance":"20 Feet or Less, 101-500 Feet, 501 Feet - 1 Mile"}