{"Region":"Arizona","Date of the Event":"01/14/2013 07:30 UTC","Country":"United States","Object Flight Path":"Hovering then path","Weather Factors":"Unknown","Longitude":"-111.70112","Tags":"City","City":"Casa Grande","Case Number":"45237","divs":["Sighting DetailsI was a passenger in a car heading West on Cottonwood LN, when I noticed Four bright objects in a straight horizontal line. This occurred approximately 1930 hours. These lights were in a vicinity where there are no tall structures and way too high. These objects were far right of Casa Grande Mountain which have red tower lights. I knew at this point these objects did not belong there. After a few minutes the lights disappeared. Two lights reappeared in a westward direction hovering, what looked like over the electrical power plant, but further back. The two lights were higher than the red lights on top of the power plant. Also, I was able to see a jet airliner going in a northeastern direction with its navigation lights on many thousands of feet above the hovering lights. A few minutes later both lights disappeared in place. I figured that the objects were UFOs because I saw no navigation lights, heard no sound (maybe because of the distance)and where I saw them."],"Summary":"Four bright objects in a horizontal line hovering above Casa Grande. All lights went out and then two lights went back on west of original sighting and then disappeared.","trends":["There have been 35 other sightings in Casa Grande","There were 3 other sightings in Casa Grande on or around January 14th 2013"],"Object Features":"Unknown","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/45237.html.txt","/var/www/straped/mufon/org/45237.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.894278,+-111.70112(45237)&iwloc=A&hl=en\"> mufon case (45237) map </A>","Disposition":"Unresolved","Sighting Duration":"00:15:00","Log Number":"US-01162013-0003","Date Submitted":"01/16/2013 12:19 UTC","Source":"MUFON","Latitude":"32.894278","Object Shape":"Circle"}