{"Country":"United States","Sighting Duration":"Undisclosed","Object Shape":"Cylinder, Disc","map":"<A HREF = \"http://maps.google.com/maps?q=28.087532,+-82.758253(45248)&iwloc=A&hl=en\"> mufon case (45248) map </A>","Region":"Florida","Case Number":"45248","Date Submitted":"01/16/2013 02:53 UTC","Latitude":"28.087532","Object Flight Path":"Other","Source":"MUFON","Longitude":"-82.758253","Tags":"City","trends":["There have been 8 other sightings in Palm Harbor","There were no other sightings in Palm Harbor on or around January 8th 2013"],"files":["/var/www/straped/mufon/html2text/45248.html.txt","/var/www/straped/mufon/org/45248.html"],"City":"Palm Harbor","divs":["Sighting DetailsI was at wl park doing basketball around 11 am when 2 pool cleaners screamed hey look, I looked at what they were looking at and saw a silver frisbee object. The one guy said he watched it shoot backwards then stay still and that's when he screamed for his friend to look which is when it got my attn. I ran over and they tried to take pics and there cellphones weren't working so I ran back and got my camera that was in the truck. I just got back to a clearing by them when I zoomed in and took a picture, a second later it was gone it disappeared as if you stomped on a soda can to flatten it. After me and the pool cleaners talked about what we just saw and the picture on my camera wouldn't show up. When I putt the sd card in my computer when I got home it was there. I've been scared to come forward because of gov and other people. I'd like for someone to give me an answer I've been having bad headaches and trouble sleeping at night since. I also noticed black helicopters in the air that day. All I know is that what me and the 2 others saw WAS NOT of this planet. If anyone wants too meet up and see the sd card with the original picture and pictures before and after please let me know."],"Summary":"Was at park and saw a frisbee shaped huge object 2 other pool cleaners witnessed it, tried to take pics with there cellphones but both of there's wouldn't work. Ran to get camera zoomed in and couldn't view it till I put the sd card on my computer. I've","Object Features":"Unknown","Log Number":"US-01162013-0012","Date of the Event":"01/08/2013 12:00 UTC","Disposition":"Unresolved","Viewing Distance":"Unknown","Weather Factors":"Unknown"}