{"Longitude":"-111.756222","map":"<A HREF = \"http://maps.google.com/maps?q=32.880622,+-111.756222(45241)&iwloc=A&hl=en\"> mufon case (45241) map </A>","trends":["There have been 35 other sightings in Casa Grande","There were 4 other sightings in Casa Grande on or around January 15th 2013"],"divs":["Sighting DetailsWhile I was traveling on Cottonwood LN, Casa Grande, heading West (on the bridge over I-10, same location as yesterday's sighting) I saw three bright objects in a straight horizontal line hovering over Casa Grande in a SW direction. It was obvious these lights did not belong in that direction. This time I had a pair of binoculars. I was able to see an orange colored light surrounded by a yellow light.The objects were not moving. There were no navigation lights seen. After ten minutes, the lights began to fade out starting with the left object, yellow first, followed by the orange light, then the middle object fading, then the right object fading. I waited a few minutes and never saw the lights again. I returned home. There is a small municipal airport about four miles north of this location, small planes with navigation lights are rarely seen at night. These lights were definately not small airplanes. It was really strange to see these lights again. I feel that the lights are real; could be UFO's or a government ploy. No comment!"],"Viewing Distance":"Unknown","Case Number":"45241","Weather Factors":"Unknown","Latitude":"32.880622","Object Flight Path":"Stationary","Sighting Duration":"00:15:00","Date of the Event":"01/15/2013 07:30 UTC","files":["/var/www/straped/mufon/html2text/45241.html.txt","/var/www/straped/mufon/org/45241.html"],"Country":"United States","Source":"MUFON","Log Number":"US-01162013-0007","City":"Casa Grande","Date Submitted":"01/16/2013 01:43 UTC","Summary":"Second sighting of bright lights over Casa Grande in same location as yesterday, but three lights were seen.","Object Features":"Unknown","Tags":"City","Object Shape":"Circle","Region":"Arizona","Disposition":"Unresolved"}