{"trends":["There have been 6 other sightings in Florence","There were no other sightings in Florence on or around January 14th 2013"],"Latitude":"33.078781","Viewing Distance":"Over 1 Mile, Unknown","City":"Florence","Longitude":"-111.447052","Weather Factors":"Unknown","Date Submitted":"01/16/2013 05:42 UTC","Object Flight Path":"Hovering then path","divs":["Sighting DetailsWent out the back door heading for the arena to put away the horse's feed bins. My dogs went with me. Stepped out on the patio and lit a cigarette. Told the dogs to go do their thing, and they scampered off. Turned to face the arena (southwest of me)and immediately noticed two very bright lights very close together about 8 to 10 degrees above the horizon. At first I thought they were attached to an approaching aircraft, as I live in the landing path of both Sky Harbor and Phoenix-Mesa Gateway airports, but the lights were coming in on an entirely different heading than usual. Then thought they may be from yet another military helicopter, as several had passed directly overhead late that afternoon and evening. The National Guard Training Grounds are directly east of me here, so that wasn't too unusual. I turned my attention to the dogs for a few seconds, still curious about the lights, as I couldn't hear the normal noise the helicopters always make. I looked back toward the lights and discovered that another pair, identical to the first ones, had appeared about 10 degrees to the right of the originals. The new ones seemed to be at the same altitude as the lights I had first noticed, but at a slightly greater distance from me. What I mean is, they were slightly lower in the sky and just a very little bit smaller. The next thing I noticed was that they were seemingly stationary, or at least moving extremely slowly for an aircraft close enough to see the landing lights on that well, plane or chopper. I proceeded down the steps into the yard, gathered the bins, put them inside the door of the shed, and went back up the steps. This takes between 80 and 90 seconds (I later timed it twice.) I turned to see the lights again from the same position on the patio that I had first seen them, and realized they had not moved at all in that length of time. I continued to watch them for perhaps 15 seconds, when they began to move, in formation, descending fairly quickly to the right at about a 40 to 45 degree angle. Puzzled, I rationalized that they must be helicopters, to be able to come down sideways like that in unison, because the lights never seemed to turn away from being pointed directly, or very nearly so, towards my position. I estimated, at first, that they were about 3 or 4 miles away. I was still bothered by the fact that they made no sound, but convinced myself that it may have been muted by the extremely rare cold weather here at the time. As soon as I sure that they were choppers, I was immediately un-convinced because 2 REAL military helicopters passed rapidly by my house, one from the east and the other from the north. I could see their red and green FAA navigation lights and the white strobes on both tails. They met up southwest of my place, the one from the north falling in behind the one from the east, and both turned to head southwest, toward the descending lights. The choppers were about four miles from me when the bright lights dipped below the crest of the ridge out in the desert to my southwest. The choppers continued on their course, and also disappeared past the ridge. I could still hear the choppers for some time after I could no longer see them. I watched for awhile to see what else would happen, but it was too cold to stay out long. Put out my cigarette and took the dogs in. When my wife arrived home from work, I mentioned the event to her, and she thought it must be some kind of military maneuvers, as she had seen several choppers flying nearby our property also. I checked your 20 latest sighting reports, and found the reports from Casa Grande today. If these reports were of the same lights I saw (same direction, same color, same date and time)then they were HUGE to be seen at that distance from my position with the apparent size of an aspirin (viewed edge-on)! I am former military (radar), not a youngster, and my father (USAF) was a pilot. Believe me when I tell you, these lights were STRANGE!"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.078781,+-111.447052(45242)&iwloc=A&hl=en\"> mufon case (45242) map </A>","Object Shape":"Circle, Sphere","Tags":"City","files":["/var/www/straped/mufon/html2text/45242.html.txt","/var/www/straped/mufon/org/45242.html"],"Date of the Event":"01/14/2013 07:25 UTC","Summary":"Two pairs of HUGE orange-yellow lights hovered in southwestern sky, then descended westward at 45 degree angle as if landing southwest of Casa Grande.","Country":"United States","Log Number":"US-01162013-0008","Object Features":"None","Disposition":"Unresolved","Source":"MUFON","Case Number":"45242","Region":"Arizona","Sighting Duration":"00:03:00"}