{"Date of the Event":"04/11/2006 12:00 UTC","Summary":"I went to Daniel Boone's National Forest in Kentucky one day on April 11th 2006. I took a few pictures over a valley. Upon reviewing them I noticed an anomaly.","Country":"United States","Object Flight Path":"Stationary,Unknown","Sighting Duration":"Undisclosed","City":"Lexington","Log Number":"US-01162013-0006","divs":["Sighting DetailsI went to Daniel Boone's National Forest in Kentucky one day on April 11th 2006. I took a few pictures over a valley. Upon reviewing them I noticed an anomaly. I took 4 pictures no more than 10 seconds apart. Later at home I was reviewing all the pictures on my computer. I notice what looked like a water tower about a mile off in the distance. I thought \"there's a water tower in a national forest?\" so I looked for it in the next photo, to my surprise it wasn't there. Not in any of the other three photos. Only in the first pic I had taken. It was a beautiful day. The sun was shining & there wasn't a cloud in the sky. The photo shows a metallic orb about a mile or two in the distance ascending? descending? Hovering? above the tree canopy down in the valley. A rare treat indeed! I'm thoroughly convince this is not an insect & indeed a Ufo. Another \"metallic orb\" just like the others that have been spotted worldwide. Anyway, it's been a great conversation piece over the years. I figure I should post them for you to check out. I still have the original photos & the photo's on camera's memory card."],"Case Number":"45240","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=38.049274,+-84.499256(45240)&iwloc=A&hl=en\"> mufon case (45240) map </A>","Object Shape":"Sphere","Longitude":"-84.499256","Region":"Kentucky","Tags":"City","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","files":["/var/www/straped/mufon/html2text/45240.html.txt","/var/www/straped/mufon/org/45240.html"],"Weather Factors":"Unknown","Source":"MUFON","trends":["There have been 43 other sightings in Lexington","There were no other sightings in Lexington on or around April 11th 2006"],"Latitude":"38.049274","Disposition":"Unresolved","Date Submitted":"01/16/2013 01:16 UTC"}