{"Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Source":"MUFON","Date Submitted":"01/17/2013 01:11 UTC","Object Features":"Unknown","divs":["sighting detailsi was driving westbound in town when i noticed three orange glowing orbs just west of town about 3 milres from my location. i've seen these orbs on other occasions but they were much farther away and have even talked with friends who have seen them as well. since they were close to town tonight, i decided to try to see them up close to determine if they were flares. i drove to within a third of a mile or so of the orbs just west of town. at this point, they began moving west just south of hey 84 towards stanfield. i followed them on 84 always staying within a mile of their proximity. i opened my windows and was not able to hear any sound from them. i continued to follow them and observe as they gained altitiude slightly. perhaps 100 to 200 feet. the orbs made a course adjustment just past stanfield and headed southwest. i turned south on stanfield road and continued travel toward i-8. i observed them traveling southwest over the desert\\farmland for several more miles and then they simply went dark and i was no longer able to observe them. i stopped and scanned the sky but could not locate them again. the total time was 35 to 40 minutes from when i first spotted them."],"City":"Casa Grande","Object Shape":"Sphere","Log Number":"US-01172013-0005","Object Flight Path":"Path with directional change","Case Number":"45260","Region":"Arizona","files":["/var/www/straped/mufon/html2text/45260.html.txt","/var/www/straped/mufon/org/45260.html"],"Longitude":"-111.753552","Weather Factors":"Unknown","trends":["There have been 35 other sightings in Casa Grande","There were 4 other sightings in Casa Grande on or around January 16th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.880522,+-111.753552(45260)&iwloc=A&hl=en\"> mufon case (45260) map </A>","Country":"United States","Summary":"saw orbs and followed in my truck for approx 30 miles. orbs dissapeared over desert.","Latitude":"32.880522","Date of the Event":"01/16/2013 08:00 UTC","Tags":"City"}