{"Object Features":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","divs":["Sighting DetailsI was sitting in our family room watching television late at night with my husband when I saw, through the window which faces Highway l4 and a large wooded park across the highway (called Bird Park), a LARGE white circular orb which caught my eye as it was up high descending in a downward direction angled to the left. It landed somewhere deep into this park. It caught eye because we occasionally see helicopters fly overhead going to the U.M. Hospital and airplanes. I have even seen an occasional shooting star, but this was NOT any of those three things mentioned. This was MUCH larger and very bright white and was slowly descending into the wooded area called Bird Park which is behind my house across Highway l4, close to Newport Road. The size of this white circle, or orb, was very similar to one I remember seeing directly above my neighbor's yard about 7 years ago. On this occassion, it was during the summer, and I shot straight up in bed with my eyes wide open and remember the bedroom being flooded with extremely bright white light. Our shades were up. I went to the bedroom window and looked outand saw a large white circular, brightly glowing orb hoovering in a stationary mode above my neighbor's home in the front yard area, high in the sky, with a thin bluish white beam coming down from it at an angle touching my neighbor's yard. Within seconds of standing there viewing it, the beam withdrew into the white orb and the orb ascended straight upwards and disappeared. My husband was not awakened by any of this, but I was. I want to the bathroom afterwards and looked back out the window as a reality check to understand that I actually did see what I described to you. I was not frightened by this, but did call a friend the next day and tell her about what I had witnessed."],"Longitude":"-83.734708","Summary":"Bright white, glowing, large , round, circular, glowing orb","Country":"United States","Viewing Distance":"Over One Mile","Log Number":"US-03072006-0003","Latitude":"42.286036","Disposition":"Insufficient Data","Date of the Event":"02/25/2006 01:20 UTC","Weather Factors":"Unknown","Date Submitted":"02/25/2006 01:20 UTC","trends":["There have been 18 other sightings in Ann Arbor","There were no other sightings in Ann Arbor on or around February 25th 2006"],"Object Shape":"Circle","City":"Ann Arbor","map":"<A HREF = \"http://maps.google.com/maps?q=42.286036,+-83.734708(4526)&iwloc=A&hl=en\"> mufon case (4526) map </A>","Region":"Michigan","files":["/var/www/straped/mufon/html2text/4526.html.txt","/var/www/straped/mufon/org/4526.html"],"Source":"MUFON","Object Flight Path":"Straight-line path","Case Number":"4526"}