{"City":"Phoenix","map":"<A HREF = \"http://maps.google.com/maps?q=33.457067,+-112.072337(45274)&iwloc=A&hl=en\"> mufon case (45274) map </A>","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/45274.html.txt","/var/www/straped/mufon/org/45274.html"],"Source":"MUFON","Weather Factors":"Unknown","Region":"Arizona","Date of the Event":"01/16/2013 07:55 UTC","Disposition":"Unresolved","Case Number":"45274","Latitude":"33.457067","divs":["Sighting DetailsI was driving home last night, which is in an elevated part of the north valley.. I always can see the city lights, airplane traffic, Luke jets etc. I glance over and see 4 HUGE glwoing orangish goldish lights hovering over the valley (if I had to guess the area would be I-10ish and maybe right around 11lth ave) I immediately pulled over and started taking pictures with my cell phone. I also took video as well. My dad and I are always talking about UFO's and such so I went ahead and called him to let him know what I was witnessing and then a second set of lights this one was 3 of the the same type of orangish goldish lights. About 2 minutes after that one appeared the first set had 3 lights go out and the last fade out. since I was on the phone I was not able to get a picture of the two sets together. It was the most amazing thing I have ever seen and if I had to guess I would say whatever each set of lights was attached to had to be at least the size of two city blocks. Upon reviewing online it sounds like quite a few people have witnessed similar evens over the past few weeks. The lights appeared very bright and seemed to pulsate and almost change color slightly they seemed to get bigger and smaller but always stayed right in line with each other so definitely appeared they were connected to something.. I have seen plenty of military flares in my life time and watched several shows after the '97 lights and how they tried to make the flares look just like the lights over Phoenix with no luck.. These were DEFINTELY not flares!!!"],"trends":["There have been 417 other sightings in Phoenix","There were 7 other sightings in Phoenix on or around January 16th 2013"],"Object Features":"None","Country":"United States","Longitude":"-112.072337","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Log Number":"US-01172013-0016","Summary":"2 seperate sets of V like formation of orange lights","Tags":"City","Object Shape":"Unknown","Date Submitted":"01/17/2013 12:05 UTC"}