{"City":"Maricopa","Case Number":"45277","Disposition":"Unresolved","Region":"Arizona","Log Number":"US-01172013-0019","map":"<A HREF = \"http://maps.google.com/maps?q=33.067416,+-112.045862(45277)&iwloc=A&hl=en\"> mufon case (45277) map </A>","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Summary":"Very bright glowing amber lights sometimes with red an unknown distance accross the valley from me to the s/w from Apache Junction in the direction of Maricopa or Gila Bend. Three nights now Jan 14-15 & 16.","Weather Factors":"Unknown","Longitude":"-112.045862","Latitude":"33.067416","Object Shape":"Circle, Unknown","Viewing Distance":"Over 1 Mile, Unknown","divs":["Sighting DetailsOn the evening of January 14th 2013 around 7:30 pm from my residence in Apache Junction Az. looking to the southwest accross the valley in the direction of Maricopa or Gila Bend I saw two clusters of amber lights at an unknown distance. My guess would be at least 25 to 30 miles from my location. Each cluster containing approximately three lights. The next night (Jan. 15) the two clusters were back but there were five lights per cluster and both clusters were in straight horizontal lines and there were distinct red lights periodicaly flashing mixed with the steady amber lights. One cluster was at about 8 degrees above horizon and the other slightly farther south about 4 degrees above the horizon. As I watched them the hight cluster dimmed out all lights at the same time. (Unlike flares burning out at slightly different times). Then I saw them again last night all three nights the lights had gone away by 8 or 8:30 pm."],"trends":["There have been 33 other sightings in Maricopa","There were no other sightings in Maricopa on or around January 16th 2013"],"Date Submitted":"01/17/2013 01:22 UTC","files":["/var/www/straped/mufon/html2text/45277.html.txt","/var/www/straped/mufon/org/45277.html"],"Country":"United States","Date of the Event":"01/16/2013 12:00 UTC","Object Features":"None","Tags":"City","Source":"MUFON"}