{"Weather Factors":"Unknown","Disposition":"Unresolved","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Tags":"City","Object Shape":"Circle, Fireball","Region":"Washington","divs":["Sighting DetailsDriving SE on Old Hwy 99 near the Olympia Airport. Rush hour traffic, multiple vehicles driving on roadway. Clear cold evening. I was remarking how many airplanes were flying when a white compact fireball descended very fast to the south. The light appeared to move straight toward the ground with very little angle to it. It changed from white to blue as it did this, leaving a very short trail behind it. My initial thought was that it was an aircraft of some sort about to crash and I fully expected to see a large explosion as it hit the ground. Everyone driving in front of me was slamming their brakes on. I can assume they were seeing the same thing as I was since it was directly in our line of sight out of our front windshields. At the last second it appear to change direction parallel to the ground or split off from the original object and the lights faded out and I lost sight of it behind the buildings of the airport. This did not look like any meteor I have ever seen. Not sure what it was as it moved much to fast to be a controlled helicopter or airplane and it was nowhere near the runway. I drove past where it appeared to have come close to the ground and saw nothing out of the ordinary."],"City":"Washington","Case Number":"45270","Log Number":"US-01172013-0012","map":"<A HREF = \"http://maps.google.com/maps?q=38.896832,+-77.029366(45270)&iwloc=A&hl=en\"> mufon case (45270) map </A>","Latitude":"38.896832","Date Submitted":"01/17/2013 09:25 UTC","Viewing Distance":"Unknown","Date of the Event":"01/15/2013 05:28 UTC","Source":"MUFON","Country":"United States","Summary":"Rush hour fireball over Olympia Airport","Longitude":"-77.029366","files":["/var/www/straped/mufon/html2text/45270.html.txt","/var/www/straped/mufon/org/45270.html"],"trends":["There have been 82 other sightings in Washington","There were no other sightings in Washington on or around January 15th 2013"],"Object Features":"Unknown"}