{"Case Number":"45279","divs":["Sighting DetailsMy father and I were outside his apartment at dusk having a cigarette when a golden light appeared to the SW around 500 Feet in the air. As we watched my father thought it was an airplane but I said the object didnt seem to be moving. It was very bright. Suddenly a glowing goldish red orb shot out the right side of the object and moved to the right along a straight path and then another and another and another. We thought they were flairs but they did not descend and we could not hear any helicopter blades. As we watched all the lights just hovered in place, and we kept waiting to see if they would descend like a flair from a military helicopter but they did not. I ran inside to get my Iphone and just when I came back out the lights all disapeared in around 3 seconds. I asked my father if the lights had done anything else while I was inside looking for my phone and he said they just floated in the air and then all of them disappeared as soon as I had come back out. I was on your Mufon sites map today just looking around. I had never been on your site before. I checked your interactive map around my area and saw that on the same day my father and I saw this strange light another person out on Boca Grande Island said they saw 4 lights in the sky and I decided to report what my father and I saw today. My father is a skeptic, and does not believe in UFOs. From that day until today my father and I believe we saw a UFO in the sky that night."],"Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=26.866486,+-82.238559(45279)&iwloc=A&hl=en\"> mufon case (45279) map </A>","Tags":"City","trends":["There have been no other sightings in Placida","This sighting has never been favorited."],"Date Submitted":"01/17/2013 04:37 UTC","Date of the Event":"01/13/2012 12:00 UTC","Latitude":"26.866486","files":["/var/www/straped/mufon/html2text/45279.html.txt","/var/www/straped/mufon/org/45279.html"],"Source":"MUFON","City":"Placida","Log Number":"US-01172013-0019","Object Features":"Other","Object Shape":"Sphere","Summary":"Saw 4 to 5 lights eject from glowing object and hover","Weather Factors":"Unknown","Disposition":"Unresolved","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Region":"Florida","Longitude":"-82.238559"}