{"Country":"United States","Object Features":"Unknown","divs":["Sighting DetailsI went to let my dogs out before bed when I saw bright flashing object to the south. I watched it for a minute as it changed color and faded in and out in brightness. The whole time it was hovering and in the far distant sky. I went inside to grab my binoculars and my wife so that she could take a look too. As we began to watch the stationary object, suddenly a second object came into our field of vision from the northwest. Moving quickly and steady it had one bright white light and one dim red one. We thought they were two objects as it flew low over The town completely silent. Then it made a slowish turn to the north and then we four see that it was actually a triangular object with three lights. Two red and one white. The white was at the front tip of the triangle. It increased in speed as it went north behind our home and field of vision. We walked around the house to gain site of it again and it was gone. Vanished. We have a large, clear line of site to the north and it nowhere to be seen. The skies were completely clear and a waxing moon gave little extra light. There were no trees or clouds or buildings for it to pass behind. It was completely gone. After a minute we returned inside after determining that the flashing light in the south was most likely a star."],"Longitude":"-103.653112","Object Flight Path":"Path with directional change","Date Submitted":"01/18/2013 12:12 UTC","Latitude":"30.367302","Object Shape":"Boomerang, Triangle","Date of the Event":"01/17/2013 10:23 UTC","Disposition":"Unresolved","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=30.367302,+-103.653112(45287)&iwloc=A&hl=en\"> mufon case (45287) map </A>","City":"Alpine","Source":"MUFON","Case Number":"45287","Tags":"City","Summary":"Watched triangle object fly low/silent for 2 min.","trends":["There have been 4 other sightings in Alpine","There were no other sightings in Alpine on or around January 17th 2013"],"Log Number":"US-01182013-0001","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/45287.html.txt","/var/www/straped/mufon/org/45287.html"]}