{"Case Number":"45282","Summary":"On 1/17/13 at 9:45pm EST my boyfriend and I seen a dark metallic triangular shaped UFO flying over North Reading Rd in Stevens/Denver PA. The shape, flight manuevers and lights were unlike anything I have ever seen. It also made NO sound.","Sighting Duration":"Undisclosed","Country":"United States","files":["/var/www/straped/mufon/html2text/45282.html.txt","/var/www/straped/mufon/org/45282.html"],"trends":["There have been 2 other sightings in Stevens","There was one other sighting in Stevens on or around January 17th 2013"],"Region":"Pennsylvania","Latitude":"40.212424","Object Flight Path":"Hovering then path,Path with directional change","Viewing Distance":"101-500 Feet","Longitude":"-76.128741","Date Submitted":"01/17/2013 10:24 UTC","Object Features":"None","divs":["sighting detailson 1\\17\\13 at about 9:45pm (est) i was just driving home work down north reading road in denver pa and saw this weird \"airplane\" hovering in the sky. so i went back a different road to get in closer. i got up pretty much right underneath the thing and the realized it was not an airplane but a triangular craft. it then made this crazy maneuver that no airplane can do. it went from a completely stagnant hovering position and then shot horizontally to the right with incredible speed! it slowed its pace but kept moving and so i drove to follow it. however, as if it seen us following it suddenly did another horizontal speed maneuver and literally within seconds it looked to be all the way over by blue ball\\ephrata area. i have never ever seen anything like this in my life except for on tv shows about ufos! there is no doubt in my mind about what i seen tonight flying over lancaster county pennsylvania! i seen this thing clear as day. the shape, the lights, the fact that it made no sound whatsoever and the flight manuevers leave no doubt in my mind that this was a ufo."],"Tags":"City","Date of the Event":"01/17/2013 09:45 UTC","City":"Stevens","Disposition":"Unresolved","Weather Factors":"Unknown","Object Shape":"Triangle","Source":"MUFON","Log Number":"US-01172013-0022","map":"<A HREF = \"http://maps.google.com/maps?q=40.212424,+-76.128741(45282)&iwloc=A&hl=en\"> mufon case (45282) map </A>"}