{"Tags":"City","files":["/var/www/straped/mufon/html2text/45285.html.txt","/var/www/straped/mufon/org/45285.html"],"Date Submitted":"01/17/2013 11:17 UTC","divs":["Sighting DetailsI just got off work and was dropping my friend off. Standing outside of car talking across roof of car and thought an airplane light was approaching from west very slow and maybe 300 ft high as it approached. Crickets never stopped and no noise from it at all. It was certainly something you see and dare not move to draw attention. It was thin or not bulged much. It was not a lighter than air blimp. It was a perfect triangle, hinted of grey and seemed to have a texture with a louvered edge at least along trailing backside. Louvers were straight up and down maybe 6 ft spacing between louvers. The louvers seemed to be more like a concealing of the rear. Louvers were boxy and not really vent like. It looked heavy and solid and sorta looked composite and not metallic. If there had been any markings i would have noticed but, did not observe any numbers or insignia. There were no windows and the lights were on each corner of the perfect triangle. There was not a center light as described in other triangles i have read about. I had never witnessed any designs like that or heard of triangular craft in prior years before 1992. I actually briefly discussed it with my friend but we did not elaborate about it other than it was creepy and we shrugged it off. Actually i forgot about it for several years until i heard similar stories since 2008 or so. I recently saw my friend at a local store at the end of the 2012 summer and asked if he remembered it. He did and gave me that one eyebrow raised confirmation and we continued on different conversation. Two other boys i now work with also saw a similar craft on two separate occasions unrelated but both were in the same year of 1992 and east of where i saw it. Strangely, it was around 1:00 A.M. but none of us know an exact date. Myrtle Beach tourist attractions begin closing at the end of the summer and they both had summer jobs at that time near the Old Myrtle Beach Airbase, which is now just Myrtle Beach International Airport. We all agree it must have been around the end of September that year in all three instances. Same craft, we cannot say. All i know is that it was a quarter mile from where i stood that night to the stop sign. It came over head directly centered and one side of it seemed to extend almost to the stop sign. Maybe not a half mile wing span but, it didn't miss by much. I recently described that long ago memory to a retired NSA guy and he listened intently as i described it. He said there have certainly been many unusual things seen by people over the years and didn't really offer an opinion either way. Well, there was a kinda acceptance of information gesture but that is where the conversation ended.He certainly didn't think it was unusual or that i had a far fetched story. That's all i have on that and i certainly was clear of thought at the time and it was silent till it got far away and then a very slight hum low in frequency. It did not rely on air speed to stay up. Either it floated like a blimp or had the ability to interrupt gravity. It would have had to be fatter if it was a hydrogen blimp. There was not any wind or sensation and really there was nothing but a visual sighting. If my back was turned or i did not look up, i wouldn't know it was passing over head at 300 ft or less. I saw it good and i still feel privileged to have seen such a thing."],"Object Flight Path":"Straight-line path","Viewing Distance":"101-500 Feet","Object Features":"Patterned Surface","Log Number":"US-01172013-0024","Country":"United States","Summary":"isometric triangle completely silent at steady due east direction maybe 10 mph centered overhead. wingspan approx 1200 ft minimum.","trends":["There have been 4 other sightings in Conway","There were no other sightings in Conway on or around September 25th 1992"],"Longitude":"-79.017153","Source":"MUFON","Object Shape":"Triangle","City":"Conway","Weather Factors":"Unknown","Latitude":"33.89237","Case Number":"45285","map":"<A HREF = \"http://maps.google.com/maps?q=33.89237,+-79.017153(45285)&iwloc=A&hl=en\"> mufon case (45285) map </A>","Region":"South Carolina","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Date of the Event":"09/25/1992 12:00 UTC"}