{"Object Shape":"Star-like","divs":["sighting details i had just returned from our adoration chapel at 1:12 am on 1\\18\\2013. it was a clear and starry night so i checked the sky for any unusual activity before i went into my house. i did not see anything out of place until i looked out my kitchen window and saw a bright light overhead. i observed said light for several minutes and saw it move up and down, hover for a while, and then move higher up in the sky. about an hour later, i observed two more lights northeast of the first light. these two lights were blinking at one another as though they were communicating. then, one of the lights seemed to disappear for awhile and then returned to continue blinking. after a while, both lights stopped blinking. i was looking through my emails and stopped every so often to observe the unusual lights in the sky. i noticed the first light at 1:15 am and watched it and the others intermittently until 4:30 am when i laid down on the couch. my daughter left for work around 6:30 am. her leaving woke me up, and so i went back to the kitchen window, and the lights were still there. i then went back to sleep on the couch. when i awoke around 8am, the lights had either disappeared, or it was too light out to see them. we live across from lunken airport so there were airplanes taking off and landing during my observation. i really wanted to go outside and take pictures, but it was freezing cold last night with the temperature around 24 degrees fahrenheit. i was excited to see another possible ufo phenomena, especially when the lights started blinking and seemed to communicate. i was disappointed that i was too tired to go outside into the cold to take pictures. i was surprised that the ufo's stayed around as long as they did."],"City":"Fort Thomas","Summary":"UFO's observed near Ohio River in Northern Kentucky","Longitude":"-84.447163","Region":"Kentucky","Latitude":"39.075061","Sighting Duration":"Undisclosed","Object Flight Path":"Path then hovering","Disposition":"Unresolved","Case Number":"45297","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=39.075061,+-84.447163(45297)&iwloc=A&hl=en\"> mufon case (45297) map </A>","Log Number":"US-01182013-0010","Date of the Event":"01/18/2013 01:15 UTC","Tags":"City","trends":["There have been 5 other sightings in Fort Thomas","There were no other sightings in Fort Thomas on or around January 18th 2013"],"Date Submitted":"01/18/2013 01:36 UTC","Country":"United States","Object Features":"Unknown","Source":"MUFON","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/45297.html.txt","/var/www/straped/mufon/org/45297.html"]}