{"Country":"United States","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/45294.html.txt","/var/www/straped/mufon/org/45294.html"],"Longitude":"-117.144982","divs":["Sighting DetailsApril 23, 2008 San Diego, CA I was in outside at around 12:00pm on March 3rd. The sky was completely clear and cloudless. I was outside on the phone with a friend when I noticed what at first glance I thought was a plastic grocery bag tumbling in the wind. The more I stared at it the more peculiar it seemed as it was unusually high for blowing garbage. It came to a stop directly over my apartment complex. At first I thought it was one object just hovering there stationary. The more I examined it the more it appeared as what can only be described as a revolving mass of white plastic grocery bags but as I watched it I realized it was more like a \"colony\" of white amoeba-like shapes crawling or revolving randomly around one another . The most striking thing about the object was that there was one noticeably separate smaller amoeba that was \"orbiting\" randomly around the tighter central group. The object(s) moved very slowly and gracefully as if underwater. Two stars were visible in the noon sky also. One was right next to the aforementioned object(vaguely visible in the first movie) and the second was far off to North on my right. This second \"star\" actually turned out to be another one of these floating colonies. However this one kept movingly slowly and steadily Northward and eventually past the apartment complex and out my line of sight. I watched the first object for about 30 minutes. When I realized it was strange I took a 3 short movies and a picture before running out of memory card space. I ran inside to make more room on my camera. When I came back out it started to move North VERY slowly at which time I strangely lost interest(?!), left the camera inside, and strangely forgot about it. An hour later I 'remembered' that there was an object outside but it was gone when I ran back outside to find it. Upon viewing the picture and movies later I was perplexed as to why I didn't film more. It was like my mind went blank after I went indoors. It was a strange feeling. Here is the only photo and 3 short movies I took of an object I spotted over my apartment complex in North Park(San Diego). If you zoom in, you can see the one separate smaller \"orbiter\" around the trundling larger central \"nucleus\". *Another interesting detail I discovered while watching the first movie(M_Sky Amoebas_1) in slow motion is that towards the end of the movie a small white orb comes in and then out of view from the lower right for just a few frames. MOVIE VIEWING DIRECTIONS: Best way to watch these is to open in QUICKTIME or WINDOWS MEDIA PLAYER then Zoom to maximum or double size(you must zoom in to see the little details) then select repeat or loop playback option."],"Object Features":"Appendage(s), Other","Date Submitted":"01/18/2013 10:07 UTC","Source":"MUFON","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","Sighting Duration":"Undisclosed","Date of the Event":"03/09/2008 12:00 UTC","Latitude":"32.754262","Summary":"Bright white daytime object moving North to South VERY slowly. Stops and hovers over aprtment. Object ppears to be a group of smaller, amorphous blobs 'crawling' or revolving around one another.","Log Number":"US-01182013-0007","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.754262,+-117.144982(45294)&iwloc=A&hl=en\"> mufon case (45294) map </A>","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around March 9th 2008"],"City":"San Diego","Case Number":"45294","Weather Factors":"Unknown","Disposition":"Unresolved","Object Shape":"Sphere, Other, Unknown","Region":"California"}