{"map":"<A HREF = \"http://maps.google.com/maps?q=43.512393,+-96.788832(45296)&iwloc=A&hl=en\"> mufon case (45296) map </A>","Object Features":"Unknown","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/45296.html.txt","/var/www/straped/mufon/org/45296.html"],"Viewing Distance":"Over One Mile","trends":["There have been 16 other sightings in Sioux Falls","There were no other sightings in Sioux Falls on or around January 9th 2013"],"Weather Factors":"Unknown","Latitude":"43.512393","Object Flight Path":"Straight-line path","Case Number":"45296","Summary":"Vibrant orange light that semi-slowly brightened and dimmed as it glided across the sky","Date Submitted":"01/18/2013 12:04 UTC","Longitude":"-96.788832","Object Shape":"Sphere, Star-like","Log Number":"US-01182013-0008","divs":["Sighting DetailsMy husband and I were out smoking a cigarette when we spotted an orange light, orb-ish craft in the north eastern sky. At first we thought it could possibly be a plane, but the way the lights were functioning and shining were completely different than any aircraft I've ever seen. As it glided along going south, it slowly brightened and dimmed, like a very slow pulsation. There was nothing distinguishable about it other than the light. When it wasn't shining bright orange during it's pulsating, it appeared to be a tiny red dot, there was no 'body' to it. I was very excited to be seeing it and was uplifted by the experience, but my husband was a bit shocked to admit what we were looking at. As it started going further south, it appeared to be getting farther away either at a very fast rate, or even going outside of the Earth's atmosphere... it's hard to explain. It just got smaller and smaller rather quickly until it disappeared in an instant. We go out every night and see all different kinds of planes very often, we've never seen anything like what we saw on that night."],"Date of the Event":"01/09/2013 09:00 UTC","Tags":"City","Source":"MUFON","Country":"United States","City":"Sioux Falls","Region":"South Dakota","Sighting Duration":"Undisclosed"}