{"Latitude":"33.842611","Longitude":"-81.156944","Weather Factors":"Unknown","Summary":"Have witnessed several sightings since October 2012","Case Number":"45299","Source":"MUFON","Viewing Distance":"101-500 Feet","City":"Undisclosed","Object Features":"Other","Tags":"City","Disposition":"Unresolved","Region":"South Carolina","Date of the Event":"01/18/2013 12:35 UTC","Sighting Duration":"Undisclosed","Date Submitted":"01/18/2013 02:17 UTC","Log Number":"US-01182013-0012","files":["/var/www/straped/mufon/html2text/45299.html.txt","/var/www/straped/mufon/org/45299.html"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.842611,+-81.156944(45299)&iwloc=A&hl=en\"> mufon case (45299) map </A>","divs":["Sighting DetailsI have witnessed several sightings since October 2012. The first was a pink glowing craft that emits a pink contrail silent no sound at great heights, have seen this craft a total of 4 times since October 2012 in my area. In November 2012 I witnessed a bright white \"orb\" like craft at power line height that appeared in the sky out of nowhere it was as if someone turnt on a light in the sky, it hovered silently for approximately 3 minutes then blinked out and disappeared. Today at approximately 12:35 pm I noticed a white object descending in a straight line path come to a stop in mid air and then disappeared. *a coworker witnessed sightings* *most of the sightings It has been at dusk and dawn and has had accompanied smaller by smaller tear shaped silent encapsulated craft flying in all directions in area of sightings before, during, and afterwards* with first few sightings saw commercial plane's, choppers during and after sightings with the first few sightings but haven't seen them in area with the most recent sightings. I live in a town with an airforce base, I feel like they are aware of whats going on. Have photos of pink craft and white descending light *will have to zoom in to see more clearly *taken from cell phone"],"trends":[],"Object Shape":"Oval, Star-like","Object Flight Path":"Straight-line path,Path then hovering"}