{"City":"Durham","Country":"United States","Date Submitted":"01/18/2013 09:13 UTC","Object Shape":"Sphere","Case Number":"45304","trends":["There have been 29 other sightings in Durham","There were no other sightings in Durham on or around January 18th 2013"],"divs":["Sighting DetailsAround 4:00 pm January 18th 2013 on Friday afternoon in South Durham North Carolina on the \"Third Fork Creek Trail\" in the direction of the setting Sun (West) I looked up and I saw a airplane with a small comtrail heading East (away from the sun) and something else very peculiar was very close to it almost riding next to it without a comtrail. I thought that it looked very strange and was way too close to the airplane for comfort. The other object appeared to be round and smaller than the plane. Both were moving east, almost paralleled one another and very close it appeared both moving upwards and East. I fumbled with my cell phone camera to try to get a picture and by that time the object split off from the plane and went in a new direction. It was now moving in a horizontal line, where it was headed vertically before with the plane. I do not have details if it was a exact angle or how this happened but it was then heading in a straight line to the right, due North I believe. So the object is now moving in a different direction from the plane and it looked like it was moving much quicker than the airplane now but not so fast that it was completely unable to track. So I followed it with my eye for a few minutes and the sun illuminated it for about 10 seconds and then it got out of the sun's illumination. So basically it is a round, silvery gray object moving in a straight line now. I noticed that it had a bit darker silver dome and a brighter silver underbelly and it was not the shape of an airplane. I say \"dome\" because it was not elongated like a plane, it was more round. I followed it for a while and I knew it was too high up in the sky to get a cell phone image it was just too high! I also did not want to take my eyes off it! It was heading directly to the right, in a straight line and then it just vanished right before my eyes. The odd thing is I had a feeling that it was going to vanish. I don't know how I knew this. It's almost like a sense that it was going to vanish. After it was gone I could still see the plane I originally saw and how the other object looked absolutely nothing like it. The weather that day was completely clear, crisp 40 degrees F and sunny winter day without a cloud in the sky. The other planes in the sky all had little comtrails and did not just vanish. This other \"craft?\" definitely stood out as being bizarre...which is why I am writing this. I spoke into my phone and got all these details down as soon as it happened so things would not fade and get jumbled in my mind. I hope this report is useful, maybe someone out there saw it too or there is an explanation. It seemed different that just another plane. Something unusual about it, which motivated me to write my first ever UFO report. No one else was on the trail at that moment. It was like just me and this thing and I was mesmerized just watching it. It was actually a pretty incredible feeling and I am glad I witnessed it."],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.938051,+-78.941048(45304)&iwloc=A&hl=en\"> mufon case (45304) map </A>","Viewing Distance":"Over 1 Mile, Unknown","Longitude":"-78.941048","Source":"MUFON","Summary":"Round Silver Object Seen In Durham, NC Following an Airplane and Then Flying in a New Direction and Disappearing.","Latitude":"35.938051","files":["/var/www/straped/mufon/html2text/45304.html.txt","/var/www/straped/mufon/org/45304.html"],"Object Flight Path":"Straight-line path,Path with directional change","Sighting Duration":"00:03:00","Date of the Event":"01/18/2013 04:00 UTC","Disposition":"Unresolved","Object Features":"Dome","Log Number":"US-01182013-0017","Tags":"City","Region":"North Carolina"}