{"Tags":"City","Disposition":"Unresolved","Latitude":"44.323284","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.323284,+-85.600054(45302)&iwloc=A&hl=en\"> mufon case (45302) map </A>","Object Shape":"Fireball, Sphere, Star-like","Object Flight Path":"Stationary,Path with directional change","Longitude":"-85.600054","Country":"United States","Region":"Michigan","Object Features":"Other","Date Submitted":"01/18/2013 04:54 UTC","Case Number":"45302","Date of the Event":"02/02/2011 12:00 UTC","files":["/var/www/straped/mufon/html2text/45302.html.txt","/var/www/straped/mufon/org/45302.html"],"Log Number":"US-01182013-0015","divs":["Sighting DetailsThese were 7 separate events 1 entity and 3 UFO at different times, 1st was during the last solstice I was on the deck looking at the moon, and nothing was around it then within 3 minutes a white orb appeared around the moon changing positions circling it, I caught this on phone video and have stills of it the video for some reason don't work at the same time I noticed a structure of some type off in another direction but was to dark to photograph at this point of night,2nd time I saw several objects in 4 different directions passing close to each other moving vary fast, to fast for planes.3 was observed by my eldest son seeing a glowing object passing over the house and disappearing as if it fell onto hwy 23 but no further seen., other times off and on things are seen by others as well as us in the sky as per reports. The opposite of UFOs, we have once found small footprints in the snow on our deck, with no way to enter the deck? This same entity I saw myself through the privacy panels on the deck with a high school sports coat quickly I opened the gate and no one was there, looked like a young girl on 3 occasions."],"trends":[],"Viewing Distance":"20 Feet or Less, 501 Feet - 1 Mile","City":"Undisclosed","Summary":"Orb or round ship and structure separate","Sighting Duration":"Undisclosed","Source":"MUFON"}