{"Latitude":"38.876482","Region":"California","Weather Factors":"Unknown","Summary":"Amber glow moving side to side smoothly.","Viewing Distance":"101-500 Feet","Country":"United States","Case Number":"45309","Object Features":"Dome","Log Number":"US-01192013-0003","Tags":"City","Date of the Event":"01/22/2011 04:30 UTC","files":["/var/www/straped/mufon/html2text/45309.html.txt","/var/www/straped/mufon/org/45309.html"],"Disposition":"Unresolved","Source":"MUFON","Object Shape":"Disc","Sighting Duration":"Undisclosed","Date Submitted":"01/19/2013 02:20 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.876482,+-121.127308(45309)&iwloc=A&hl=en\"> mufon case (45309) map </A>","Longitude":"-121.127308","trends":["There have been 2 other sightings in Newcastle","There were no other sightings in Newcastle on or around January 22nd 2011"],"Object Flight Path":"Path then hovering","City":"Newcastle","divs":["sighting details*outside at 4:30ish in the morning smoking a cig. *i noticed a bright light on the horizon. it got brighter and my attention went directly back to the area and it was much closer now. *i wondered if it was mars but i also knew that mars wasn't on the area in the sky at that hour nor was it on the horizon that low being that bright. *it was so quiet there was literally no noise. it gave off a amber color below and the capsule top was a amber\\white color that reflected off the outer layer of the disc. it moved up closer to me but in a zig-zag pattern that was so smooth that i knew this wasn't the behavior of any of our vehicles. *i thought it was very beautiful and just stared at it as i could see something inside just looking at me. i wasn't sure what i could do and didn't really care because i had this sense that whatever this was, it wanted me to know that i was visible and that i could see it. i didn't feel threatened and i always wish i could go back to that day, since i always think about it. *i lost sight of the object as it very smoothly moved over the hill and i ran after it but there was no sight when i got over that hill."]}