{"trends":["There have been 2 other sightings in Shrewsbury","There were no other sightings in Shrewsbury on or around January 19th 2013"],"City":"Shrewsbury","Source":"MUFON","Date Submitted":"01/19/2013 01:54 UTC","Latitude":"39.773094","files":["/var/www/straped/mufon/html2text/45312.html.txt","/var/www/straped/mufon/org/45312.html"],"Sighting Duration":"Undisclosed","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.773094,+-76.676333(45312)&iwloc=A&hl=en\"> mufon case (45312) map </A>","Weather Factors":"Unknown","Case Number":"45312","Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Date of the Event":"01/19/2013 10:36 UTC","Log Number":"US-01192013-0006","Object Flight Path":"Straight-line path","divs":["Sighting DetailsOn Saturday, January 19, 2013, I was driving north on Interstate 83 in Pennsylvania on my way to York, PA. At 10:36am I was around the Shrewsbury area when I noticed 3 white objects in the sky to my left. At first glance I thought they were birds by the way they were flying so close together in a row. I looked again and realized that they weren't birds but some kind of aircraft. I kept watching them because they just looked kinda odd. No flashing lights or anything. As I was watching them, I noticed that the first 2 objects were getting extremely close to each other while the 3rd lagged behind slightly. All I kept thinking to myself was that they were flying too close together to be airplanes and I also thought they were going to crash into each other! My 8-year-old daughter was in the back seat and could also see them. She kept asking me what they were and I just told her that I'm not sure. I got out my phone & tried taking 2 pictures of them, which didn't come out that great. We watched them go from West to East, crossing over I-83. As they were traveling East, some trees got in our way on the right. When we got to another big opening, the objects were gone. They were no where in sight. We watched them for about 10 to 12 seconds before we lost sight of them. I have absolutely no clue as to what we saw!"],"Region":"Pennsylvania","Object Shape":"Cigar","Longitude":"-76.676333","Disposition":"Unresolved","Summary":"3 white objects flying close in the sky. 2 of the objects got so close to each other I thought they were going to crash.","Tags":"City"}