{"Date Submitted":"01/19/2013 11:53 UTC","Weather Factors":"Unknown","Longitude":"-111.833836","map":"<A HREF = \"http://maps.google.com/maps?q=41.73698,+-111.833836(45326)&iwloc=A&hl=en\"> mufon case (45326) map </A>","Log Number":"US-01192013-0020","Summary":"Looked like another meteoroid skimming across the atmosphere but it stopped and changed direction with a flash.","Disposition":"Unresolved","Country":"United States","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/45326.html.txt","/var/www/straped/mufon/org/45326.html"],"Tags":"City","City":"Logan","Object Shape":"Flash, Star-like","trends":["There have been 3 other sightings in Logan","There were no other sightings in Logan on or around June 1st 2002"],"divs":["Sighting DetailsWent up to Tony Grove (41.89483,-111.642428) in Logan Canyon near Logan, UT back about 10 years ago. Headed up there near midnight to watch for \"shooting stars\". I worked nights, had a night off so I wanted to do something. There isn't much up there to do so this seemed like fun. We were laying down on the hood of the car watching for shooting stars and saw quite a few of them before the \"big one\". The one that caught both of our attentions was maybe three or four times bigger and brighter than Jupiter in the night sky. It came in at a slower and constant speed. It came from the west heading east in a straight line. It got a little brighter from when it first appeared in the sky as it travelled east. We both pointed at it and at about that time, it stopped dead in it's path. That's about the time we stopped talking about how bright it was. It sat there for about 3 seconds then took off 1000x faster in a NW direction. When it took off at that speed, it lit up at least 10x brighter and left a streak the other way about as long as the path it took originally before it disappeared. It was really bright, probably the brightest thing I've seen in a very long time. The odd thing is that it left a streak in the sky. I looked around to see if it had burned an image of the streak into my vision, but it didn't. It sort of stayed there for a couple seconds before it faded into black. It had a blue and white light when it sped off. The streak faded from white to green to black. To me, it seemed like whatever was up there saw a planet with lights and went back to the \"mothership\" in an excited manner to report their finding of a civilization. :-) I haven't heard of other sightings here but I'm hoping this will bring some out that haven't been reported for years, like mine."],"Latitude":"41.73698","Region":"Utah","Date of the Event":"06/01/2002 12:00 UTC","Object Features":"Unknown","Source":"MUFON","Object Flight Path":"Path with directional change","Case Number":"45326","Sighting Duration":"Undisclosed"}