{"Date of the Event":"01/19/2013 05:50 UTC","Date Submitted":"01/19/2013 11:18 UTC","City":"Oxnard","Country":"United States","Longitude":"-119.205389","map":"<A HREF = \"http://maps.google.com/maps?q=34.158677,+-119.205389(45324)&iwloc=A&hl=en\"> mufon case (45324) map </A>","Tags":"City","Case Number":"45324","Source":"MUFON","Sighting Duration":"Undisclosed","Summary":"Silver Strand Beach, Oxnard,ca...Red pulsating disc heading northbound with a flight pattern resembling a question mark...","divs":["sighting detailsit was about 6:00 pm and the sun had just set and i was helping my girlfriend unload some stuff for the beachcomber bar and as i was coming out to grab the last couple things i look up at the sky and see a bright red pulsating object to the south right over the navy cbc (construction battalion corps) base main radar station located at the end of silver strand beach. i know the air traffic very well around here and as soon as i saw it i knew it wasn't any normal type of aircraft. i shouted to my girlfriend, who is a total skeptic, to come see and she was baffled by its appearance and flight pattern. it was bright red and it pulsated and as it flew overhead we noticed a red cone shaped light that seemed to slowly rotate around the object and at the same time the object itself seemed to be burning like a flare would but pulsated also....that's the best way i can describe it.... the flight pattern was in the shape of a question mark... so.. as my girlfriend and i are both walking in circles in the middle of the street with our heads to the sky a neighbor walks up and asks what is so intriguing in the sky, so i pointed, and she continues to tell me, \"oh ya! we saw that lastnight.....it must be some new plane or something.\" i quickly replied, \"i highly doubt it! our planes make noise this thing is silent!\" as soon as i said that it disappeared. my uncle worked for northrop\\grumman on the b-2 spirit and many other projects and knowing what flys in the air has been second nature to me. this is definitely was something i've never seen before."],"trends":["There have been 19 other sightings in Oxnard","There were no other sightings in Oxnard on or around January 19th 2013"],"Latitude":"34.158677","Object Flight Path":"Path with directional change","Region":"California","files":["/var/www/straped/mufon/html2text/45324.html.txt","/var/www/straped/mufon/org/45324.html"],"Viewing Distance":"Over One Mile","Object Shape":"Disc","Log Number":"US-01192013-0018","Weather Factors":"Unknown","Object Features":"None","Disposition":"Unresolved"}