{"City":"La Follette","Object Shape":"Circle","files":["/var/www/straped/mufon/html2text/45329.html.txt","/var/www/straped/mufon/org/45329.html"],"Region":"Tennessee","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=36.382885,+-84.119947(45329)&iwloc=A&hl=en\"> mufon case (45329) map </A>","Tags":"City","Country":"United States","Weather Factors":"Unknown","trends":["There has been one other sighting in La Follette","There were no other sightings in La Follette on or around January 19th 2013"],"Longitude":"-84.119947","Summary":"The bright light among the stars drew my attention. I thought it was maybe the space station or something seldom seen but it came toward me very fast and low then changed direction and shot east and up at incredible speed","divs":["Sighting DetailsI was traveling north on I 75 between Knoxville and Lexington when a bright light caught my eye. I looked up and thought i was seeing the space station or something unusual. As I watched I quickly realized It was not that high but much closer and it was moving very fast in my direction. It was very bright and I noted that it was controlled and not falling. I also knew it was not a helicopter flood light or any normal aircraft. Born and raised in and near Dayton Ohio I know many different aircraft lights and sounds. It looked like a star at first and as it got closer it was like a white fire ball. My 20 year old son was sleeping reclined in the passenger seat and I could not speak. Really, I was speechless! I soon got a better idea of its position as it got closer I new it was not much higher than the mountain top in front of me. Suddenly when I thought I could not be more in shock of what i was seeing it turned and shot eastward and upward at an incredible and I mean like a special effects, not possible with any known man made aircraft kinda speed leaving a bright long tail. When I was able to finally speak and wake my son I was crazy excited by what I had seen. He said he himself when half asleep wondered what the bright light was that was disturbing him. I lost track of the tail as It disappeared behind the mountain now behind me. I do not believe any known man made aircraft is capable of doing what this thing did. I have no pictures or video and hope that someone else in the area saw what I saw. I will be checking local news."],"Object Features":"None","Case Number":"45329","Date of the Event":"01/19/2013 10:10 UTC","Latitude":"36.382885","Log Number":"US-01202013-0003","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Source":"MUFON","Sighting Duration":"Undisclosed","Date Submitted":"01/20/2013 03:52 UTC"}