{"Summary":"I saw two lights I described as glowing campfires in the sky moving slowly across the sky then they seemed to elevate higher while coming together and one disappeared then the one light left kept rising and vanished.","Object Shape":"Sphere, Other, Unknown","Region":"Texas","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=29.427642,+-98.486868(45327)&iwloc=A&hl=en\"> mufon case (45327) map </A>","Object Features":"Unknown","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/45327.html.txt","/var/www/straped/mufon/org/45327.html"],"Latitude":"29.427642","Weather Factors":"Unknown","Date Submitted":"01/20/2013 01:31 UTC","Date of the Event":"01/19/2013 12:00 UTC","Sighting Duration":"Undisclosed","Case Number":"45327","Country":"United States","divs":["Sighting DetailsI was leaving my wife's apartment just around 11 pm and walking to my car I noticed two lights moving across the sky. I noticed the objects because of the color of the light and because of where they were. I thought at first I was seeing some lights I hadn't noticed before then thought maybe plane or helicopter lights but they were too close and slow. I then thought this can't be a ufo so what is it. I noticed a man 15 ft. in front of me on aa cell phone and looked at him as if maybe he had something to do with it looked back at the objects then looked at him again. I was going to yell out to him to see if he saw it but still looking at the lights I realized I could not explain them and had to tell my wife. I ran back to her door and knock a lot. She didn't come right away so I ran back to the parking area and I saw the lights had continued their path in the sky, elevating slightly and the one on the right seem to begin to come closer to the other then it disappeared or joined the other. The now remaining one light continued to rise ever so slightly then it too vanished. I called my wife to see why she didn't answer and then told her of what I saw. I then sat in my car wanting to start it and leave but couldn't stop staring at the sky looking for the lights. Then I scanned the area to see if maybe they were anywhere else I could see bu they were not. I described these lights to her as a campfire color and look but in the sky. I said that maybe someone tied bags with candles or something to balloons and that was what I was seeing. I know it was not planes, or helicopters, or hot air balloons. In fact it was hard to determine what It was because I couldn't match it to anything I have ever seen before. When I returned home I got online and typed in \"I saw strange lights in san antonio tonight\". I was surprised to see there were actually descriptions of objects similar to what I had seen tonight. I am not sure what to do or how to process this information because I see myself as a science minded individual who had completely dispelled any idea of aliens flying around our planet. I still think there must be a logical explanation like maybe they are drones or whatever but I am resolute that what I saw was real and is something that I have never seen before."],"Viewing Distance":"501 Feet - 1 Mile, Unknown","Object Flight Path":"Path with directional change","City":"San Antonio","Source":"MUFON","Longitude":"-98.486868","trends":["There have been 148 other sightings in San Antonio","There was one other sighting in San Antonio on or around January 19th 2013"],"Log Number":"US-01202013-0001"}