{"Region":"Louisiana","Log Number":"US-01202013-0002","Object Flight Path":"Stationary","divs":["Sighting DetailsI took my dogs out before going to bed a little after 1 this morning. I noticed an almost blindingly white object very low to the northwest. The light seemed to be reflecting off of some low flying clouds. The light did not move, and there was no sound. It almost looked like an upside down crescent. I kept staring at it, trying to figure out what it was. It wasn't a plane or a helicopter. There was no associated sound, it wasn't moving, and the light was just too big. From where I stood, if I put my hand up in front of it, it was about the size of my closed fist. I considered that maybe it was the moon, but it seemed too low. I initially thought that I was viewing it through some tree branches, as there seemed to be a dark line running horizontally across it and another running vertically through it. I went to go get my camera because it was the strangest, most beautiful moon I had seen, even if the shot would have been through tree branches. I got my camera and looked toward the object, but it appeared to be dimming. I tried to get a picture, but I couldn't get the camera to focus. I quit trying and continued to watch the object grow dimmer. As it did, it seemed as though I had been mistaken about the tree banches. The shape seemed to resolve into an arrow shape, pointing toward the south, with the dimming lights forming the arrow on the top and bottom of the object. Though the object remained stationary for a good 10minutes, the dimming seemed to happen very quickly, pobably between 30 and 45 seconds. It finally dimmed to the point that it was no longer visible. It just disappeared, right in front of myy eyes."],"Latitude":"29.94678","Sighting Duration":"Undisclosed","Disposition":"Unresolved","trends":["There have been 2 other sightings in Harahan","There were no other sightings in Harahan on or around January 20th 2013"],"City":"Harahan","Weather Factors":"Unknown","Object Shape":"Other","Tags":"City","files":["/var/www/straped/mufon/html2text/45328.html.txt","/var/www/straped/mufon/org/45328.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=29.94678,+-90.188871(45328)&iwloc=A&hl=en\"> mufon case (45328) map </A>","Summary":"While outside, I noticed an extremely bright, very large light low on the horizon to the northwest.","Longitude":"-90.188871","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Date Submitted":"01/20/2013 03:39 UTC","Date of the Event":"01/20/2013 01:10 UTC","Case Number":"45328","Source":"MUFON","Object Features":"Unknown"}