{"Summary":"White Flashes like heat lightning turned green.","files":["/var/www/straped/mufon/html2text/45339.html.txt","/var/www/straped/mufon/org/45339.html"],"Object Flight Path":"Stationary","Case Number":"45339","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Longitude":"-81.100459","City":"Chardon","Log Number":"US-01202013-0012","Source":"MUFON","Date of the Event":"01/20/2013 01:03 UTC","Weather Factors":"Unknown","Date Submitted":"01/20/2013 11:34 UTC","Country":"United States","Latitude":"41.562533","Object Shape":"Flash","map":"<A HREF = \"http://maps.google.com/maps?q=41.562533,+-81.100459(45339)&iwloc=A&hl=en\"> mufon case (45339) map </A>","Tags":"City","Region":"Ohio","divs":["Sighting DetailsI left a friends house on Kile Rd at 1am on January 20, 2013. I turned left onto Chardon Windsor Rd and a few seconds later I noticed a flash of white light and thought nothing of it. It occured a few seconds later, and repeated about every 10 seconds or so. I stopped at the stop sign on the corner of Chardon Windsor and 608. I sat at the sign for a few moments to watch this lightning. The next flash of lightning was bright green. It did this 2 more times but I had to turn left to continue on my way home so I could no longer see it. I'm not sure how long it continued. It was interesting to watch at first but it became eerie when I tried to decipher what it was. It was slightly south east of where I was positioned. It was high about the ground,and behind clouds. It was so bright that I could see the detail in the clouds when the light flashed. I realized that it couldn't be lightning because it is said that lightning doesn't strike the same place twice and these flashes were one right after the other, in the exact same location in the sky. It is the craziest thing I have ever seen in my life. It was beautiful and I had never seen that color in the sky before. It will stick with me and I wish I knew what it was or that I had sat there longer to watch it."],"Viewing Distance":"Over One Mile","trends":["There have been no other sightings in Chardon","This sighting has never been favorited."],"Object Features":"Other"}