{"City":"Bowling Green","Date of the Event":"01/19/2013 11:43 UTC","Region":"Ohio","files":["/var/www/straped/mufon/html2text/45331.html.txt","/var/www/straped/mufon/org/45331.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.350509,+-83.653256(45331)&iwloc=A&hl=en\"> mufon case (45331) map </A>","Case Number":"45331","Latitude":"41.350509","Object Features":"Unknown","trends":["There have been 5 other sightings in Bowling Green","There were no other sightings in Bowling Green on or around January 19th 2013"],"Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Object Shape":"Circle","Summary":"Materialized, then shot sideways, then straight down. Wasnt anything i have seen before.","Object Flight Path":"Path with directional change","Date Submitted":"01/20/2013 06:52 UTC","Disposition":"Unresolved","Source":"MUFON","Log Number":"US-01202013-0005","Tags":"City","Sighting Duration":"00:00:10","Country":"United States","divs":["Sighting DetailsI had just went outside around 11:40 pm on the night of the 19th of january, 2013. I lit up a cig, and looked up in the sky over my neighbor's property. all of the sudden, I saw what I had at first believed to be the beginning of a falling star in the west, except it was brighter than i had ever seen a falling star be. It looked like a cluster of maybe 4-5 lights, very bright, that made up the aura of one larger light. Very bright. The object then took off sideways in the sky, to the nw maybe a dozen degrees, from my line of sight. Then it stopped in the sky for about 2 seconds, and descended very rapidly toward the ground. This was in no way close to my location, i project at least 20 miles away, and there were no clouds in the sky so i could see the object very clear and the path it took. I did not see the object after the descent, and i did not chase it or try to follow where it went. Looked in the sky for about 5 minutes after, did not see any helicopters, jets, airplanes, etc. I see falling stars just about every time they are forecast to be seen, and this was no falling star. I got pretty shaken up by the event that i witnessed, and i am not easily spooked. I enjoy reading about ufo's and paranormal activities, but this was the first time i actually witnessed an unidentified craft."],"Longitude":"-83.653256"}