{"Region":"Texas","files":["/var/www/straped/mufon/html2text/45334.html.txt","/var/www/straped/mufon/more/45334_submitter_file1__20130111130705.jpg","/var/www/straped/mufon/org/45334.html"],"Sighting Duration":"Undisclosed","trends":["There have been 7 other sightings in Sugar Land","There were no other sightings in Sugar Land on or around January 11th 2013","This sighting has never been favorited.",""],"Country":"United States","Date Submitted":"01/20/2013 01:12 UTC","Disposition":"Unresolved","Log Number":"US-01202013-0008","Longitude":"-95.625396","Case Number":"45334","Summary":"unknown object crossed 59s in Sugar land tx.","Object Features":"Other, Unknown","Source":"MUFON","City":"Sugar Land","map":"<A HREF = \"http://maps.google.com/maps?q=29.622179,+-95.625396(45334)&iwloc=A&hl=en\"> mufon case (45334) map </A>","Date of the Event":"01/11/2013 01:17 UTC","Object Flight Path":"Path with directional change","Latitude":"29.622179","divs":["Sighting DetailsI was driving south on 59s on 1-11-2013 @ 1:17pm and I noticed a dark strange shaped object to my left, moving kind of oddly from se to nw over 59s out of sight behind a tree line. When I first saw it I thought \"what the heck is that thing? Its bigger than a helicopter, no blades, dark, and moving not like a plane nor helicopter. What is that thing?\" The dark oddly shaped object moved like sputtering and a tight zig zaggy sideways and vertical path. When I first saw it I knew it was unusual and immediatly I reached for my phone in my purse and since it was moving fast I knew I didnt have much time so as soon as my camera mode came up I zoomed in as much as possible right away and snapped a pic in the direction I last saw it. I got one pic of it before it disappered behind the treeline. I felt anxious and in disbelief and amazed because I couldn't identify what this thing was. Having lived near an airport for over 30 yrs and being used to planes and helicopters day and night, I was shaken that at the distance this thing was from me I couldnt tell identify if it was a plane or helicopter. I could not identify it as a plane nor helicopter."],"Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Object Shape":"Other","Weather Factors":"Unknown"}