{"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/45332.html.txt","/var/www/straped/mufon/org/45332.html"],"Summary":"solid white elongated disc appearing 3 times","Log Number":"US-01202013-0006","Date Submitted":"01/20/2013 10:06 UTC","City":"Pine River","Viewing Distance":"Unknown","Tags":"City","Source":"MUFON","Object Shape":"Blimp, Cigar, Circle, Cylinder, Disc, Egg, Oval, Sphere","Latitude":"46.717202","Region":"Minnesota","Longitude":"-94.432464","trends":["There have been no other sightings in Pine River","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=46.717202,+-94.432464(45332)&iwloc=A&hl=en\"> mufon case (45332) map </A>","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Other","divs":["sighting detailsyesterday afternoon i stepped out to let my dogs out and i noticed the moon was out during the day and a solid white oblong disc was moving to the right of it, it was a very cloudy\\windy day and it was hard to tell if it was in front of or weaving in and out of clouds. the clouds were moving alot, but this object stuck out solid white. after the first time it moved toward the southeast and got covered by the clouds it came back again about 5 minutes later and was up near the moon again just moving around up there, mainly traveling southeast. i then called my mom and was discussing it with her and hoping it would appear again, right then it appeared to the left of the moon instead of the right and traveled southeast, i had time to go inside dress up warm and come back out and it was still moving around up there, i tried to snap a pic, but my phone was dying, its a new phone and i was very excited and i couldnt hit the button right to snap the pic. by this time the clouds were starting to get thick and i could no longer keep track of it, i went back in and got my girlfriends cellphone hoping that it would reappear to no avail, so im not sure if it was 3 different objects travelling or 1 object that returned to the same area 3 times within about 30 minutes. if you have any questions, feel free to ask~"],"Object Features":"Other","Date of the Event":"01/19/2013 12:00 UTC","Country":"United States","Weather Factors":"Unknown","Case Number":"45332"}