{"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=29.301168,+-97.705487(45338)&iwloc=A&hl=en\"> mufon case (45338) map </A>","trends":["There have been no other sightings in Nixon","This sighting has never been favorited."],"Country":"United States","Object Flight Path":"Path with directional change","divs":["Sighting DetailsLocation: Nixon, TX Date on game camera is correct; time is not. If deer had not triggered game cam the UFO would no doubt have passed unobserved. Total elapsed time: UFO at 6:31 on first photo. Faint glimpse in second photo, just barely on left edge of tree at 6:47 on second photo. Solid glowing light at 7:09 on third photo. Total minutes before game cam cycled back to inactive 38 minutes. The pictures taken before these on the same sd card show deer and coons, but no light. The game cam has taken dozens of pictures prior to this incident, from the same mounted position; no light or reflections have ever been recorded before. My first thought was that someone was headlighting. But the third picture shows the light to be above any human height. In the third picture, the light appears to be in front of the small tree; however, a look at picture number two indicates the tree is bent to the right, enabling the UFO to be seen as in front of the tree, but actually just as it bends away from it. Picture number one seems to verify reports of triangular UFO's with three lights underneath. Unknown why there is a solid light in the third photo. I have no explanation for the lights on the game camera. A reasonable conjecture is made that it is not an airplane due to the time lapse."],"Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","City":"Nixon","Tags":"City","files":["/var/www/straped/mufon/html2text/45338.html.txt","/var/www/straped/mufon/org/45338.html"],"Region":"Texas","Object Shape":"Circle, Triangle","Disposition":"Unresolved","Object Features":"Unknown","Date Submitted":"01/20/2013 06:54 UTC","Summary":"Captured on game cam; first seen as triangle, then solid white light.","Case Number":"45338","Latitude":"29.301168","Date of the Event":"12/28/2012 12:00 UTC","Longitude":"-97.705487","Log Number":"US-01202013-0011"}