{"Sighting Duration":"Undisclosed","Disposition":"Unresolved","Country":"United States","Viewing Distance":"Over One Mile","Date of the Event":"01/20/2013 04:15 UTC","Log Number":"US-01212013-0008","City":"Calhoun","Region":"Georgia","Source":"MUFON","trends":["There have been 5 other sightings in Calhoun","There were no other sightings in Calhoun on or around January 20th 2013"],"files":["/var/www/straped/mufon/html2text/45347.html.txt","/var/www/straped/mufon/org/45347.html"],"Weather Factors":"Unknown","Latitude":"34.511587","Object Features":"Wings","Case Number":"45347","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=34.511587,+-84.943144(45347)&iwloc=A&hl=en\"> mufon case (45347) map </A>","Longitude":"-84.943144","Tags":"City","Date Submitted":"01/21/2013 08:35 UTC","Summary":"Bright Green Luminous Ship Like object spotted while driving north bound on Interstate 75","Object Shape":"Square, Rectagular","divs":["Sighting DetailsIt was about 4am; I was driving northbound on I75 and with the exception of a car in front of me the road was empty. Then a very bright green object just appeared in the sky ahead of me. It wasn't flying in a path it just appeared, then sort of dropped on an angle but you can tell it was a path to the ground and then disappeared under the tree-line. I was able to see enough detail that it appeared to be a ship? I know this is crazy but it reminded me of those fighter type ships you see in Star Wars. This was no airplane, no balloon and the green light coming from it was just a very bright fluorescent green light that lit up the sky. The entire time couldn't have been more than 15 seconds but it was clear, I was wide awake and I'll never forget it. As soon as it seemed to descend to the ground the car in front of me pulled over at what I now know as the Gordon Rest Stop, I followed the car because I had to see if this person saw it. I parked next to the other vehicle and as he got out, I said \"did you see that\"? He confirmed and said what was that? I said that was a UFO, I'm not crazy right? He said it caught him off guard and didn't get a good look at it but knew it wasn't normal. While he didn't get a great look at it I did, and he confirmed to me I wasn't crazy. I saw a very good shape of it, I can draw and send you a picture of what I believe I saw if you'd like. AS I drove off, the next exit was Calhoun, GA. I did not get the other person's name. I see below there is a place to attach a drawing, I will draft one and attach later today."]}