{"Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=39.732552,+-104.82631(4534)&iwloc=A&hl=en\"> mufon case (4534) map </A>","Tags":"City","Object Features":"None","Source":"MUFON","Country":"United States","trends":["There have been 48 other sightings in Aurora","There were no other sightings in Aurora on or around March 11th 2006"],"Longitude":"-104.82631","Date Submitted":"03/11/2006 04:30 UTC","Latitude":"39.732552","Case Number":"4534","Object Flight Path":"Stationary","Date of the Event":"03/11/2006 04:30 UTC","Region":"Colorado","files":["/var/www/straped/mufon/html2text/4534.html.txt","/var/www/straped/mufon/org/4534.html"],"Sighting Duration":"Undisclosed","Log Number":"US-03122006-0001","divs":["Sighting Details I was at a friends house in Aurora, CO. He lives around the intersection of Buckley Road and Arapahoe Road. The time was around 4:30 pm. The temperature was about 32 degrees. It was overcast like it was about to snow. I am not sure how you can found out what the ceiling hieght of the clouds. We were walking from our car towards his house. I heard a jet going by, over head, so I looked up. As I watched the Lear Jet (From N.W. go to S.E.), I noticed something else at the same height. It was almost directly over head. It looked like a Paraglider. It was way way up there. It was high enough where you couldn't see anyone hanging below it. It did have movement but not as much as you would expect from a paraglider. It would rise into the clouds and then drop back down. For perspective the Lear Jet that went by had a little bigger wing span than this thing. If this was a sunny warm day it would have been a little easier to believe it was a paraglider. BUT it was fricken cold on the ground, I can't imagine how cold it would have been up there. And the added wierd thing was the center of the wing seemed to come apart and then go back together. It also seemed stationary as far as getting anywhere. It eventually rose above the clouds and we lost it's location. I have no idea what this thing was. Best guess was it was a paraglider with some dude freezing his arse off. but I really have a hard time believeing that is what it was. Any ideas?"],"City":"Aurora","Object Shape":"Boomerang","Summary":"Was with a friend and notice this object when we watched a Lear Jet go by.","Weather Factors":"Unknown","Viewing Distance":"20 Feet or Less"}