{"divs":["Sighting DetailsI was driving down I2 75 south in Canton Michigan, When me and my uncle Joseph Sypolt Noticed a single whitish blue Vertical beam in the sky. So we pulled over to investigate, When we pulled over we started to notice hundreds and hundreds of more of these beams coming down from the sky. We then took the Michigan Avenue exit West Pulled over on a side street that was not lit we thought maybe the light was polluting our vision. We ended up going to a pitch black field With no trees buildings or any type of object of strucking our views That is when we noticed these lights were in every single direction because we first thought they were possibly the northern lights Although we were headed south. We started looking for numbers to find out information from government agencies about these lights we were seeing. While we were searching for these numbers on the ride home we noticed one Predominant A distinctive solid red beam In downtown Canton which has plenty of light pollution. We got out again to investigate this Redbeam in Westland Michigan, When we noticed hundreds of beams around that one as well some transparent some not We then proceeded to call nor read the Michigan Air Force that Detroit FBI. The FAA And I was told by all agencies they have never had a report of anything like this. I ended up searching online for the same events and found multiple. But nothing as extraordinary and vivid as I can describe I have attached two photos at the bottom That I took from my iPhone five the lighting was poor I was hoping you could edit these photos to see what I was seeing"],"trends":[],"Sighting Duration":"Undisclosed","Longitude":"-85.592574","Summary":"Hundred of beams Some transparent whiteish blue and 1 Distinctive blood red beam","Viewing Distance":"20 Feet or Less","Object Features":"Other, Unknown","Region":"Michigan","Date of the Event":"01/21/2013 02:38 UTC","Log Number":"US-01212013-0006","Country":"United States","City":"Undisclosed","Object Shape":"Cylinder","Tags":"City","files":["/var/www/straped/mufon/html2text/45345.html.txt","/var/www/straped/mufon/org/45345.html"],"Source":"MUFON","Date Submitted":"01/21/2013 05:50 UTC","Disposition":"Unresolved","Latitude":"44.316744","map":"<A HREF = \"http://maps.google.com/maps?q=44.316744,+-85.592574(45345)&iwloc=A&hl=en\"> mufon case (45345) map </A>","Case Number":"45345","Object Flight Path":"Stationary","Weather Factors":"Unknown"}