{"files":["/var/www/straped/mufon/html2text/45352.html.txt","/var/www/straped/mufon/org/45352.html"],"Case Number":"45352","Disposition":"Unresolved","Latitude":"40.639945","Object Flight Path":"Stationary","Object Features":"Unknown","Date Submitted":"01/21/2013 03:45 UTC","Sighting Duration":"Undisclosed","divs":["Sighting DetailsThe day was sunny, mid-thirty degrees, with a low thin cloud cover or haze. I Was driving south on Houbolt Rd. I was sitting a few cars back from the stop light facing south when I noticed an extremely bright star-like shape in the SW sky with a cloud-like cigar shape behind it situated at a 45 degree angle. At first I thought it was something reflecting off my dashboard onto the windshield, or an airliner and contrail, but the objects just sat there not moving for about one minute. Then the star-like object pivoted slightly to the right and looked like a string of beads connected together. The cloud-like object behind it remained stationary. I saw no lights or emissions of any kind. I was in my car, so I couldn't hear if it made any kind of sound. The light turned green and I made a right turn onto Rt.6 and drove west. I looked out my driver's window at the star-like object, when it suddenly just blinked out and disappeared, but the cloud-like object remained stationary in the sky. I continued to glance up at this object as I drove west towards I-55. When I reached I-55, I turned to go south towards Wilmington. All the while driving south(approx. an hour)this object never changed shape, never changed color and remained stationary at a 45 degree angle in the SW sky - but it started to fade in and out. It was harder to locate each time I glanced up at the sky because of this. I turned off of I-55 onto Lorenzo Rd. and turned left towards the frontage Rd. on the east side of the highway. I continued to watch this object until it just faded out and disappeared. I spotted a small airplane in the sky and the object I was previously watching was situated much, much higher than it was. I would put the altitude of the objects I saw as that of an airliner. I've only seen one other chrome-like object like this when I was living in Joliet, IL. It was 2004, a sunny day with no clouds and I was outside doing yard work.It was cigar shaped, traveled from the east and disappeared into the west horizon in a matter of seconds. It left no contrail, made no sound, had no lights and was flying low enough that I could see it had no wings or tail fin and was completely smooth. This object caught my attention because it too was highly reflective. I don't believe these objects are classified military aircraft, because the of way they move and act. That's why I'm reporting them as UFO's."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.639945,+-89.392748(45352)&iwloc=A&hl=en\"> mufon case (45352) map </A>","Source":"MUFON","Date of the Event":"01/16/2013 12:23 UTC","trends":[],"Viewing Distance":"Unknown","Tags":"City","Weather Factors":"Unknown","Longitude":"-89.392748","City":"Undisclosed","Object Shape":"Cigar, Sphere","Country":"United States","Summary":"Two stationary objects sighted. One chrome-like star-like shape, the other cloud-like cigar shape.","Log Number":"US-01212013-0014","Region":"Illinois"}