{"Latitude":"39.110418","Object Shape":"Disc","City":"Cincinnati","Source":"MUFON","files":["/var/www/straped/mufon/html2text/45353.html.txt","/var/www/straped/mufon/org/45353.html"],"Country":"United States","Object Features":"Window(s)","Tags":"City","Disposition":"Unresolved","trends":["There have been 82 other sightings in Cincinnati","There was one other sighting in Cincinnati on or around August 16th 1972"],"Log Number":"US-01212013-0014","Viewing Distance":"20 Feet or Less, 21-100 Feet","Object Flight Path":"Straight-line path","Case Number":"45353","Summary":"Saw a UFO in the shape of a saucer going over family home at dusk.","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","divs":["Sighting DetailsIt was summertime at dusk and I was coming out of my father's house. I always look in the sky because I have always known that there was something out there. I just knew that at some point in my life that I would see something in the sky. As I was coming out the door, I looked up in the sky and was amazed by the sight I saw. I could only focus on this shocking sight. I could not move or do anything else except watch what was happening because I was so intrigued, shocked, and awestruck. There was a silver flying saucer about the size of a half of a football field flying at tree top level my overhead. It was floating overhead slowly and If I had not looked up I would not have noticed it because it did not make a sound. It had large windows and below the windows on the edge of the craft were blue, red, and green lights spinning around the entire edge of the craft. I countinued to watch the craft in this paralized state until it disappeared out of my eyesight. After the craft was almost out of sight, I rushed back into the house and told everyone to come outside because there was a UFO. By time the people from the house came outside, all they could see was the spinning colored lights and they knew it was not an airplane because it was too low. So everyone returned in the house. Inside the house, the radio was on and there was a break in regular local programing. The announcer on the radio said that there were people were calling into the station and reporting sightings of a UFO. I recently was looking on UTube recently and found a picture of myself on the episode of Aliens Underground. This picture had been taken before I was born. The picture looks exactly like me."],"Longitude":"-84.50737","Date of the Event":"08/16/1972 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.110418,+-84.50737(45353)&iwloc=A&hl=en\"> mufon case (45353) map </A>","Date Submitted":"01/21/2013 04:26 UTC","Region":"Ohio"}