{"Source":"MUFON","trends":["There have been 42 other sightings in Scottsdale","There were no other sightings in Scottsdale on or around March 12th 2006"],"Sighting Duration":"00:02:30","Date Submitted":"03/12/2006 12:40 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.49815,+-111.919832(4535)&iwloc=A&hl=en\"> mufon case (4535) map </A>","Weather Factors":"Unknown","Disposition":"Unknown","City":"Scottsdale","Log Number":"US-03122006-0002","Latitude":"33.49815","divs":["Sighting DetailsI was standing in the front yard watching to see which way the clouds were moving. I noticed a glowing object moving fast. Not uncommon since we live close to an airport. However, when it passed above the clouds, I realized that it was moving faster than military craft at the same altitude. It made abrupt changes in directions and always maintained the same glow, unlike the reflection from a planes' wing. =========================================================== I made these notes as soon as I went back into the house. Phoenix, Arizona 03-12-2006 12:40 PM A shiny object was observed coming from the S.S.E., at an excessive speed. It was moving much faster than a jet. From the time it was first seen in the Southernly sky until it disappeared into the Eastern horizon, was less than three minutes. When it was first seen it was coming from the S.S.E.. It passed at about forty-five degrees upward in the East sky. About twenty degrees from vertical, it abruptly changed course to the N.W., and came to a complete stop. It then sped off to the S E for a second or two and abruptly changed course toward the East and rapidly sped toward the horizon and out of sight. It maintained the same glow for the entire time it was in sight."],"Case Number":"4535","Object Shape":"Other","Longitude":"-111.919832","Country":"United States","Tags":"City","Summary":"Brightly glowing, extremely fast, came to full stop, changed direction rapidly","files":["/var/www/straped/mufon/html2text/4535.html.txt","/var/www/straped/mufon/org/4535.html"],"Region":"Arizona","Object Features":"Undisclosed","Date of the Event":"03/12/2006 12:40 UTC","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown"}