{"Weather Factors":"Unknown","City":"Liberty","Object Shape":"Other","Region":"Missouri","Longitude":"-94.449298","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Disposition":"Unresolved","Object Features":"None","trends":["There have been 12 other sightings in Liberty","There were no other sightings in Liberty on or around November 16th 2012"],"Tags":"City","Log Number":"US-01222013-0005","Summary":"Moving on flightpath toward MCI Airport at approach speed and ltitude","map":"<A HREF = \"http://maps.google.com/maps?q=39.255393,+-94.449298(45366)&iwloc=A&hl=en\"> mufon case (45366) map </A>","Latitude":"39.255393","Date of the Event":"11/16/2012 05:22 UTC","Object Flight Path":"Straight-line path","divs":["Sighting DetailsOn the way to work I noticed the light upon cresting the bluff at M291 Hwy and old 210 hwy. It was moving at a steady speed. It appeared as two small orbs the color of a cigarette cherry, one above the other with a black band separating the two with a black band between them. They did not appear as a single orb with a black band divider, they were two separate orbs. There was a trail of the same color that you could see through, denser closer to the orbs and dissipating with distance. The trail was about 10 to 12 diameters of the orbs long. The orbs were the size of a large pea from my vantage point. As I approached the stop light which was red, I turned and saw the rear view of it heading toward Kansas City. I have worked in airfreight for 30 years.. I have never seen anything like this. It was not a plane. I was not a meteor, it was moving far too slow. I just smiled and realized that I had seen a UFO. I drove on to work and when I told coworkers later what I had seen, they said that the news shows had been talking about it because people had been calling in to the station about the sightings. There was nothing said about the sightings on the evening news shows ,nothing in the paper the next day or subsequently, I subscribe to the paper and read it daily. I don't expect an explanation, I just want acknowledgement of the multiple witnesses and that it happened."],"Case Number":"45366","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/45366.html.txt","/var/www/straped/mufon/org/45366.html"],"Date Submitted":"01/22/2013 05:52 UTC","Country":"United States"}