{"Tags":"City","Date Submitted":"01/22/2013 10:14 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.314585,+-83.502358(45369)&iwloc=A&hl=en\"> mufon case (45369) map </A>","Case Number":"45369","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","City":"Canton","Summary":"Black Triangle Observed Twice in One Night over Canton, MI","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-83.502358","Date of the Event":"01/18/2013 09:30 UTC","Region":"Michigan","Log Number":"US-01222013-0008","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/45369.html.txt","/var/www/straped/mufon/org/45369.html"],"trends":["There have been 16 other sightings in Canton","There were no other sightings in Canton on or around January 18th 2013"],"Country":"United States","Object Shape":"Triangle","divs":["Sighting DetailsThe first time I saw the object, I was coming home from work around 6:45pm on January 18, 2013. Traveling North on I-275, I exited at Ford Road. It was very heavy traffic. Before going below the highway bridge underpass, I glimpsed what I thought was a plane just above the bridge flying very low making a banking turn until its lights appeared to be pointing directly at me (east) --there were three very bright lights. Then I went under the bridge and lost sight of it. It looked strange to me, like other odd craft I have seen in the area over the last 9 years, so I was anxious to get a good look at it, but once I had emerged from under the bridge, the object had apparently banked again to the southwest and was quite far away. I could see white lights and a red flashing light in the middle. It was flying very low and fast and was moving away from metro aiport. When I got home I told my family that I think I had seen another one of those black triangles that I have seen at least 6 times before and my son has seen several times also. I told my son to keep an eye out because when we have seen them, we often have seen them more than one in the same night. Around 9:30 that same evening, my wife and I left on a trip to Chicago. We were traveling south on Canton Center Road Approaching Ford Road when to the south west of us, maybe a half mile to mile away, we saw the black triangular object again. This was the clearest view I have had of these objects in the last 9 years and after seeing it I had absolutely no doubt that it was not an aircraft. My wife and I could both clearly see the triangle shape as it banked on its side. There were 3 bright white lights at each corner with smaller white lights (2 or 3) outlining the edge between the corner lights. And in the center was a blinking red light. Again, it traveled very low, maybe 50 feet above the trees, and fast--at least 2 to 3 times faster than conventional aircraft we see in the area all the time. It was probably about the size of a conventional airliner. I could not hear anything but we were in a closed up car."],"Object Features":"None","Latitude":"42.314585"}