{"Disposition":"Unresolved","Weather Factors":"Unknown","Longitude":"-74.361006","Latitude":"39.585575","files":["/var/www/straped/mufon/html2text/45362.html.txt","/var/www/straped/mufon/org/45362.html"],"Summary":"saw out back whenheater was replaced at night. Heard AF planes taking off then saw ufo doing Z in sky 2 times","trends":["There have been no other sightings in Little Egg Harbor Township","This sighting has been favorited 1 time."],"Case Number":"45362","Object Flight Path":"Hovering then path,Other","Log Number":"US-01222013-0002","Sighting Duration":"Undisclosed","Tags":"City","Object Shape":"Fireball","Source":"MUFON","divs":["Sighting DetailsI was in my home. Recently at that time I kept hearing military planes take off. I was having emergency heater replacement as we were having first freeze and heater was old. There were two installers here. One went to store and I was here with the other. We saw 2 red lights over trees. we both noticed them but didn't go overboard. When the other guy returned and we were telling him, we looked over roof of my home. We all three saw this fireball in sky. At that time it stopped and did a huge zig zag of the letter Z in sky. Not once but twice. I said out loud \" for those of you who didn't realize what that was it did not one but two zig zags. When I looked at these guys their jaws were dropped. We all three said we saw same thing.After that it left area. I think we were too shocked to watch what it did next. We all agree only a ufo could do a manuever like that. When it is clear and I use binoculars I see lights in the sky ALL THE TIME! The white lights are a brighter white than on regular planes. I'm not sure what visual aid to use to see closer what these lights are. When observing a meteor shower I saw so many lights zipping along in areas I don't think are in a planes path. Not so many at one time. I can count over 15 to 30 any clear night and these are continously moving and more replacing that count. I want to know how to see better what these are. Most of these lights are not seen with naked eye. I can only see these with binoculars and no detail. Some even appear as orbs with bluish and red or orange lights. No one wants to believe me, but I see this often."],"Country":"United States","Object Features":"None","City":"Little Egg Harbor Township","Date of the Event":"10/11/2012 07:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.585575,+-74.361006(45362)&iwloc=A&hl=en\"> mufon case (45362) map </A>","Viewing Distance":"Over One Mile","Date Submitted":"01/22/2013 11:44 UTC","Region":"New Jersey"}