{"Region":"California","Date Submitted":"01/23/2013 01:13 UTC","Case Number":"45371","Summary":"Dimond shaped bright orange color","Sighting Duration":"00:20:00","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","City":"Moreno Valley","Log Number":"US-01232013-0002","Latitude":"33.950516","Object Features":"Unknown","Disposition":"Unresolved","Country":"United States","Object Shape":"Diamond","Date of the Event":"01/21/2013 01:30 UTC","Longitude":"-117.224912","trends":["There have been 13 other sightings in Moreno Valley","There were no other sightings in Moreno Valley on or around January 21st 2013"],"Weather Factors":"Unknown","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=33.950516,+-117.224912(45371)&iwloc=A&hl=en\"> mufon case (45371) map </A>","files":["/var/www/straped/mufon/html2text/45371.html.txt","/var/www/straped/mufon/org/45371.html"],"divs":["sighting detailsi live near the hills of lake perris in moreno valley. i was out in the backyard picking up a few items around 1-2am from a bbq we had that day and at the distance i noticed in the dark sky a triangular shape light coming my way. i stared at it for a while, and then walked inside my house to get my nikon dslr camera. at first i tried to record video footage but was unable to because it was so dark. i then decided to take a picture in which i turned off the flash; turned up the iso to 12,800 high resolution and took this picture at 55mm zoom. this light as i viewed it did not flash or make any other effects, but was just solid and there was no visable view of an airplane or a helicopter when it passed by for it made no noise and flew by somewhat slow. after it went past my view of sight i decided to look at the pcitures i took. as you can see in the first picture if you zoom in as much as you can you notice a diamond shaped shadow around the orange lights and if you follow the light patterns there are various places where you can see bright lights. in addition, since its a picture of the sky you can also see the stars in the sky in red and light brown which are perfect dots, but yet this bright orange light has and effect to it. on the 2nd picture i took it from my upstairs restrooms window and as you can see the street light are doubled due to the double layer glass. there you can see an suv in the street and if you look right above it above the house you'll see a bright white\\blue light. and this light you can also zoom into it to get a better view. and belive me you can zoom in alot! but by this time the light went from orange to a super bright white\\blue at a distance of around 15-20miles away."],"Tags":"City"}