{"Object Features":"Unknown","Date of the Event":"09/15/2008 09:30 UTC","Disposition":"Unresolved","Source":"MUFON","Date Submitted":"01/23/2013 01:25 UTC","Log Number":"US-01232013-0003","Sighting Duration":"Undisclosed","Case Number":"45372","Weather Factors":"Unknown","Latitude":"35.803588","map":"<A HREF = \"http://maps.google.com/maps?q=35.803588,+-88.7715(45372)&iwloc=A&hl=en\"> mufon case (45372) map </A>","Region":"Tennessee","City":"Medina","Viewing Distance":"Unknown, N/A","Longitude":"-88.7715","Object Shape":"Unknown","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","files":["/var/www/straped/mufon/html2text/45372.html.txt","/var/www/straped/mufon/org/45372.html"],"Country":"United States","divs":["Sighting DetailsI was at my friends house. There were five of us all together. We got a call from another friend who lives in Kenton. He told us to go outside and look at the sky. So we did. We observed several different lights just appear in the south. Then they would fly slowly to the west and disappear. There would be several of them in the sky at the same time at different altitudes. Obviously they weren't satellites or airplanes. These lights did not blink. Every other light would split like cells in meiosis or something. The moon was fairly bright and there are a great deal of streetlights on this particular street. So for us to really see anything it had to be BRIGHT. They appeared to be moving between two hundred to four hundred miles per hour when they were moving slow. Others would ascend very quickly and disappear. While others would fly around for a minute and then zip quickly in wither the north or the west. We were very interested and committed to staying outside and watching this as long as it would last. There is an Army Arsenal in a neighboring town. However if we faced the arsenal we'd be facing the North East. Eventually they had all disappeared. Obviously there was a lot going on all at once when these things showed up. It wasn't a meteor shower. Not too long after we saw this the giant UFO in Texas showed up."],"Tags":"City","Summary":"Bright lights that seemed to pop into the atmosphere then zip around.","trends":["There have been 4 other sightings in Medina","There were no other sightings in Medina on or around September 15th 2008"]}