{"trends":["There have been 3 other sightings in Bishop","There were no other sightings in Bishop on or around January 19th 2013"],"Region":"California","files":["/var/www/straped/mufon/html2text/45377.html.txt","/var/www/straped/mufon/org/45377.html"],"Latitude":"37.362114","Sighting Duration":"Undisclosed","Log Number":"US-01232013-0008","Tags":"City","Object Features":"Dome","Viewing Distance":"21-100 Feet","divs":["Sighting DetailsWe were driving home after a little birthday party. my girlfriend was driving at that time. once we got out the freeway, we made a right going south on Fowler ave. it got darker as we got closer to the corner of Church ave. ,,when my girl friend saids outload...Manny What are does lights in front of us,,,,so I starded looking from inside the car. It look like this round shape objects with bright lights just floating in fron of us like maybe arounf 100 feet above the ground. it did not look normal when we look at them.I was in shock my girlfriend and I. we were like what the heck is that...I thought it was like someone had fire up some fire works or something like that.. I could not believe what my eyes were looking at.So then my girlfriend tells me to take a pictures. I was so into it. that I forgot how to operate my cell video....Cause I kept just looking at them to see what was that. so I starded to record video for about ten minutes. as they were just getting further out in the sky line up all of them close to each other. and the kept moving diferent directions. as they were fading out. they were also changing color in a bright red. as they fade out and lost them. there was no one around just me and my girfriend. and you can just feel the surround sound like a weed wacker noise very load. it did not seem normal at all. it was something out of this world never seeing only on movies. I have footage in my cell. I loaded into my computer as you can see it better. but i try to email it to conference news. but it wont work cause the file is to big. That is what we saw. an experience of a life time."],"Weather Factors":"Unknown","Summary":"Huge bright lights just floating in the air in front of our car while we were driving.","Date of the Event":"01/19/2013 01:15 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=37.362114,+-118.398186(45377)&iwloc=A&hl=en\"> mufon case (45377) map </A>","Longitude":"-118.398186","Object Flight Path":"Straight-line path","Country":"United States","Date Submitted":"01/23/2013 02:59 UTC","Case Number":"45377","Disposition":"Unresolved","Object Shape":"Fireball, Sphere","City":"Bishop"}