{"Weather Factors":"None","divs":["Sighting DetailsI stepped outside my house in Port St. Lucie, FL about 9 pm Sunday, March 12th, 2006 to go to the store and noticed a lighted but hazy object with a blinking light on top. It did not have the shape or movements of a fixed-wing or helicopter so that made me notice it. (I was in the Air Force and have seen many planes.) Hard to tell the size and distance but apparently it was several hundred feet off the ground. It came from the east and seemed to lose some altitude before levelling off. It then flew north. I paralled it's course in my car but it was over an area west of the town, over farms I believe, and I couldn't get close. I thought it could have been a blimp but they don't usually fly at night around here and they are based south of here. I also don't see why it would fly over an unpopulated area of the county since blimps are mainly used for advertising. Boca Raton might be the closest airship base. I couldn't really see if it was blimp-shaped. Blimps usually have moving lights along the sides to advertise something. The lights on this seemed to be steady except for the one on top. All the lighting on it seemed to be white including the blinking light on top. Many other drivers were on the road and could have seen it. It kept flying north till I lost sight of it. If it was the size of a blimp then it could have been moving at about 50 or more mph. I was somewhat excited when chasing it in my car, thinking that I may be witnessing something special but also aware that it's more than likely terrestial such as a blimp. There were several hot air ballons flying around here this morning but I don't believe they would fly at night and are therefore not lighted. After I lost sight of it I continued with my errands and then came home to write this."],"Date of the Event":"03/12/2006 09:00 UTC","files":["/var/www/straped/mufon/html2text/4538.html.txt","/var/www/straped/mufon/org/4538.html"],"Date Submitted":"03/12/2006 09:00 UTC","Object Shape":"Blimp, Other","Log Number":"US-03122006-0005","Country":"United States","Region":"Florida","Source":"MUFON","Object Flight Path":"Path with directional change","Object Features":"None","Latitude":"27.283333","Viewing Distance":"Over One Mile","Summary":"Lighted but hazy and distant object, possibly blimp-shaped (or a blimp) flying north approximately 50 mph.","trends":["There have been 15 other sightings in Port St Lucie","There were no other sightings in Port St Lucie on or around March 12th 2006"],"Disposition":"Unresolved","Sighting Duration":"00:15:00","map":"<A HREF = \"http://maps.google.com/maps?q=27.283333,+-80.34572(4538)&iwloc=A&hl=en\"> mufon case (4538) map </A>","City":"Port St Lucie","Case Number":"4538","Longitude":"-80.34572","Tags":"City"}