{"Summary":"Sphere casting a very bright light at 5pm (sun is still shinning at that time)","Source":"MUFON","Region":"DF","Weather Factors":"Unknown","Object Shape":"Sphere","Date Submitted":"01/24/2013 06:36 UTC","Country":"Mexico","Tags":"City","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/45396.html.txt","/var/www/straped/mufon/org/45396.html"],"Longitude":"-99.134386","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was out in my 4th floor terrace drinking coffee looking at the horizon which I always do. I can see the precise airplane paths on their way or out of the airport. As I was looking towards a mountain a very bright sphere caught my attention, I first thought it was an airplane until I saw airplanes coming and going behind it (from my perspective) this bright sphere had a different path, zig zagging a bit then straight then completely off from the airplane path, it traveled from south east to south west (if that makes sense) from my left to my right. I saw a helicopter too, that was closer, that determined more or less the altitude (the sphere was way higher) and in definitely had a path... unlike a ballon which kinda always goes up, this one was going from one side to the other, at some point stopping and the resuming. It wasn't a high speed object, steady but in a weird way. stop go stop go go stop, zig zag. go go go... The sphere was glowing, I could see a mist around it. I lost it in the horizon very close to where the sun was... and it was still shinning brightly. I was very emotional, I'm always looking out there to see if I catch one... maybe this one was for real... I hope it was.."],"Log Number":"MX-01242013-0011","Date of the Event":"01/24/2013 05:15 UTC","Object Flight Path":"Hovering then path,Path then hovering","Disposition":"Unresolved","Object Features":"Unknown","trends":["There have been no other sightings in Mexico City","This sighting has never been favorited."],"City":"Mexico City","Latitude":"19.376791","Case Number":"45396","map":"<A HREF = \"http://maps.google.com/maps?q=19.376791,+-99.134386(45396)&iwloc=A&hl=en\"> mufon case (45396) map </A>"}