{"Tags":"City","Longitude":"-112.012976","divs":["Sighting DetailsThis report is in regards to my second sighting of an orange light UFO. My first sighting of this category happened at some point after the Christmas Holidays, before I had finally accepted the need to start reporting on what I've been seeing in the skies over Phoenix. My first sighting of an orange light happened around 6:15PM local time, after I'd just traveled across town on the bus after work. After getting off at the stop in my neighborhood, I paused in the parking lot of the local supermarket and drug store for a smoke, and began scanning the skies. To the northeast I could see a commercial airliner, miles off in the distance, with its bright beacon light seemingly suspended over the horizon. I initially thought I was seeing the light of a second airliner further back in the air corridor, but as the airliner got closer on its approach, to where it no longer seemed to be just hanging in the sky but entering into Phoenix airspace, I then saw that the second light was a smaller orange light. As the airliner passed overhead off to my right, the orange light veered off to the left and then disappeared just short of directly overhead. At the time, I rationalized that it was just a private aircraft I'd lost visual track of after it passed over head. I changed my mind on this assessment after my second sighting of an orange UFO. What makes this second sighting even more bizaare than the actual event, was that it followed my filing a report with MUFON about a UFO I'd seen earlier in the week, while on my way to work. This happened on Saturday, right around dusk. Had just submitted my report online to MUFON, and had left my apartment to head down to the corner market for a six pack. As I was passing by a large strip mall across from the corner market, I noticed an orange light at tree top level, moving along slowly down the length of the parking lot. It was pulsating with a similar rhythm to that of a normal beating heart at rest. The light alternated from being completely red, to being bright orange in front yet still red around the back edges and across the top. It got fairly close to being almost directly in front of me, before it suddenly just shot up into the sky and blinked out, simultaneously. Another odd thing about this is that the light seemed somehow \"pretty\" to me in its appearance. No, I don't believe I was mesmerized by it, just profoundly fascinated."],"Date Submitted":"01/24/2013 03:09 UTC","Region":"Arizona","Source":"MUFON","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around January 19th 2013"],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/45392.html.txt","/var/www/straped/mufon/org/45392.html"],"Object Flight Path":"Straight-line path","Disposition":"Unresolved","Object Shape":"Oval","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.581289,+-112.012976(45392)&iwloc=A&hl=en\"> mufon case (45392) map </A>","Viewing Distance":"21-100 Feet","Case Number":"45392","Summary":"Pulsating Orange and Red Light","City":"Phoenix","Date of the Event":"01/19/2013 12:00 UTC","Log Number":"US-01242013-0007","Country":"United States","Latitude":"33.581289","Sighting Duration":"Undisclosed"}