{"Tags":"City","Latitude":"50.85564","Object Features":"None","City":"Brussels","Region":"Brussels","Viewing Distance":"Over One Mile","Date of the Event":"03/13/2006 05:30 UTC","Date Submitted":"03/13/2006 05:30 UTC","Object Shape":"Flash, Sphere, Star-like, Other, Unknown","Country":"Belgium","trends":["There have been 3 other sightings in Brussels","There were no other sightings in Brussels on or around March 13th 2006"],"Log Number":"BE-03132006-0001","Longitude":"4.3581","map":"<A HREF = \"http://maps.google.com/maps?q=50.85564,+4.3581(4540)&iwloc=A&hl=en\"> mufon case (4540) map </A>","Disposition":"Unresolved","Source":"MUFON","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Other","Summary":"Perfect sphere became a squiggly light that moved very suddenly and became a sphere again. Object would disappear and reappear and shake vigorously","files":["/var/www/straped/mufon/html2text/4540.html.txt","/var/www/straped/mufon/org/4540.html"],"Weather Factors":"None","divs":["Sighting DetailsI was in Brussels visiting my girlfriend and I was lying in bed staring out the window at the full moon in the early hours of the morning. I started looking for stars, expecting none, as the moon was very bright and full. However, I saw one light off in the distance past the trees outside the window. The object seemed at first to be a plane or a satellite. The object then seemed to go in and out of focus. i was sure this was because I was tired and could not sleep. Then the object appeared to be a flashlight up in the sky being shaken back and forth very quickly. Then the object completely stabilized and became a perfect sphere. Then I was sure it was a planet (Mars?) ands that my eyes were playing tricks on me. However, this sequence of events (more or less, but not exactly) repeated itself, I got out of bed and got the camcorder. Thinking back on this, this is very strange as I have never done anything like that before, not with a camera or a camcorder. This woke my girlfriend and she asked what I was doing. When I told her, she put her glasses on and stared out at the object. I asked her what she thought it was. With neither of us having any idea what we were seeing, she suggested I open the window and try shooting directly into the early morning sky. By this time the birds were chirping and it was twilight. This made it easier to see the tree branches as points of reference and it seemed clear that this object in the sky was moving in a very unusual way that I had never seen before. Eventually, I got tired of shooting, put away the camera and got back into bed. As daylight came, the object became harder and harder to see. I have the camcorder MiniDV cassete tape, but would like to get it back."],"Case Number":"4540"}