{"trends":["There have been 7 other sightings in Martinsville","There were no other sightings in Martinsville on or around January 24th 2013"],"Object Shape":"Circle, Disc, Sphere","Date of the Event":"01/24/2013 07:30 UTC","Tags":"City","Log Number":"US-01252013-0004","Object Flight Path":"Stationary","Latitude":"39.421532","divs":["Sighting DetailsMy three sons, my mother, and I were coming home from walwart. We were heading east on old Morgantown road. We went around a curve and up a hill. As we reached the top of the hill we saw five lights in a slight v formation. We all commented on how low this apparent plane was. The lights appeared bright white as we approached. We drove forward about half a mile we directly in front of the object. The object was at the treeline and about 1000 ft away. The lights were now huge, orangish, red swirling spheres. They remained in the same formation, only now I could see clearly the shape of an object. The part I could see was saucer shaped. The lights were lights on this craft. I stopped the car, opener the door, and grabbed my camera phone. Before I could even touch the screen the lights went off and it was gone. I got into the car and everyone was yelling \" It was a UFO\". I went home which is about a five minute drive. We saw nothing else on the way home. I went into the house and looked out the south window and saw the object again to the south east. The were disappearing behind the treeline at a great distance. I would guess ten to twenty miles away."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.421532,+-86.339537(45405)&iwloc=A&hl=en\"> mufon case (45405) map </A>","Country":"United States","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Longitude":"-86.339537","Source":"MUFON","Disposition":"Unresolved","Object Features":"None","City":"Martinsville","Viewing Distance":"101-500 Feet","Date Submitted":"01/25/2013 10:56 UTC","Summary":"ufo sighting in martinsville","Region":"Indiana","files":["/var/www/straped/mufon/html2text/45405.html.txt","/var/www/straped/mufon/org/45405.html"],"Case Number":"45405"}