{"map":"<A HREF = \"http://maps.google.com/maps?q=43.64609,+-70.51478(45401)&iwloc=A&hl=en\"> mufon case (45401) map </A>","Longitude":"-70.51478","Country":"United States","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Disposition":"Unresolved","Object Features":"Other","Sighting Duration":"00:03:00","Object Shape":"Other","Viewing Distance":"101-500 Feet","Latitude":"43.64609","Region":"Maine","Date Submitted":"01/24/2013 11:03 UTC","Weather Factors":"Unknown","Summary":"Small, odd shaped, slow, and in buxton","City":"Buxton","divs":["Sighting DetailsNight 1 - Thursday ------ Event: From the church coming out of Portland I noticed what looked like an orange star. After driving by Low's Variety and before the bridge I noticed something behind a tree. About 3 feet behind it. I crossed the bridge and watched it for 30 and it didn't move. Then it turned and went over the river to where it became hard to watch. I drove up the hill about 50-100 feet and looked over the area and couldn't find anything. I was maybe 50 feet away and it was about 20-50 feet above the ground. Described: It was about 1-2 feet tall and had a yellow-orange light in the center. Then each leg had a light at the bottom. One blue and one red. Looked like an orb but after it moved I saw that it didn't have any shape that is easily describable (see sketch). The lights were solid and did not blink (12:30AM) Weather: It was -2 degrees with 6mph wind. Very close to a full moon. Night 2 - Thursday ------ Event: From Smiling hill farm I saw the exact same start like light. I watched it as best I could but as I got to the church again I noticed it was moving (slowly). After I got to the Hannaford intersection I could see it was much closer. I watched it as I got closer till I saw it was behind someones home. I stopped and watched. It started off moving but then suddenly stopped. Then as quick as it stopped it started moving again. It was about 100-150 feet away this time but was very obviously not a plane even with it's blinking lights. It was moving at a steady speed but then slowed down and sped back up. Stopped once more and then continued. I left soon after it started again. Described: Same as before but the lights blinked this time. (10:10PM) Weather: 5 degrees and 12mph wind. Once again very close to full moon. Other ------ I noticed a star both nights that was blinking between white and blue. It is plainly obvious and is easy to find. It blinks semi randomly but only white and blue. Both nights left it in a different spot and it disappeared for about 15 seconds. It doesn't look like a star that belongs there and doesn't have the same effect of looking at a star too long (the very many colors)."],"Source":"MUFON","trends":["There have been 5 other sightings in Buxton","There were no other sightings in Buxton on or around January 24th 2013"],"Date of the Event":"01/24/2013 12:00 UTC","Log Number":"US-01242013-0015","Tags":"City","files":["/var/www/straped/mufon/html2text/45401.html.txt","/var/www/straped/mufon/org/45401.html"],"Case Number":"45401"}