{"Date Submitted":"01/25/2013 11:42 UTC","divs":["Sighting DetailsI was cleaning up my home office at midnight and noted when looking out the back window what a clear night it was. I then noticed what I first thought was a plane with blinking lights over Tennessee Valley, but it didn't move after a couple of minutes. It didn't appear like a helicopter although it was fairly stationery. When looking at it closely it appeared like a blob of differently colored, sparkling lights. The sparkling lights were white, blue and light green. After about 10 minutes it moved to the east and then stopped (I could gauge movement and direction by adjacent trees), then after 2 minutes it moved straight up. After moving up it began to appear more as a vertical line shape with three stronger points of light, one in the middle and one at top and bottom. It then moved down twice and then moved north over the next 15 minutes. In its last 5 minutes it appeared again like a blob of sparkling lights, became gradually dimmer and shifted to red and orange sparkling lights. It gradually disappeared over 20 seconds in a stationery position and did not appear again."],"City":"Mill Valley","trends":["There have been 7 other sightings in Mill Valley","There were no other sightings in Mill Valley on or around January 25th 2013"],"Source":"MUFON","Tags":"City","Longitude":"-122.539046","Summary":"Hovering, sparkling orb which moved and morphed into vertical shape","map":"<A HREF = \"http://maps.google.com/maps?q=37.915257,+-122.539046(45415)&iwloc=A&hl=en\"> mufon case (45415) map </A>","Disposition":"Unresolved","Latitude":"37.915257","Log Number":"US-01252013-0012","Date of the Event":"01/25/2013 12:00 UTC","files":["/var/www/straped/mufon/html2text/45415.html.txt","/var/www/straped/mufon/org/45415.html"],"Viewing Distance":"Unknown","Region":"California","Country":"United States","Object Flight Path":"Hovering then path,Path then hovering","Object Features":"Unknown","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Shape":"Cylinder, Sphere","Case Number":"45415"}