{"Longitude":"-86.116778","Disposition":"Unresolved","Object Shape":"Sphere","Date Submitted":"01/26/2013 09:05 UTC","Object Flight Path":"Stationary","Tags":"City","Source":"MUFON","Case Number":"45418","trends":["There have been 2 other sightings in Whiteland","There were no other sightings in Whiteland on or around January 24th 2013"],"City":"Whiteland","Latitude":"39.549196","Summary":"4 horizontal lights suddenly appeared and then went out one at a time","Date of the Event":"01/24/2013 07:15 UTC","Country":"United States","divs":["Sighting DetailsI was sitting on the sofa watching TV when something caught my eye. I looked out the south window and saw what I thought was an airplane. I saw 4 bright lights evenly spaced in a horizontal row. My first thought was that the plane was coming in awfully low. We are sort of in the flight path for Indianapolis International Airport, but the planes this evening had been coming in way east of us. Then I thought that it was odd that there were four lights. They didn't appear to be moving. As I watched, the lights began to go out, one at a time, starting on the left as I viewed them. It was about at one second intervals. When they all went out, I called to my husband that I thought I had just seen a UFO. He put his coat on and went outside, but he saw nothing. For the record, Camp Atterbury lies to the south of us and they have at times sent up flares, but it has been a long time since they did this. Also, these lights were very evenly spaced and they went out sequentially and remained in the position in which I originally saw them. Flares normally settle as they burn and they would not have been perfectly even."],"Viewing Distance":"Unknown","Region":"Indiana","files":["/var/www/straped/mufon/html2text/45418.html.txt","/var/www/straped/mufon/org/45418.html"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.549196,+-86.116778(45418)&iwloc=A&hl=en\"> mufon case (45418) map </A>","Sighting Duration":"Undisclosed","Object Features":"None","Log Number":"US-01262013-0002"}