{"Object Features":"Patterned Surface","City":"Montclair","trends":["There have been 2 other sightings in Montclair","There were no other sightings in Montclair on or around January 20th 2013"],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/45424.html.txt","/var/www/straped/mufon/org/45424.html"],"Sighting Duration":"Undisclosed","Log Number":"US-01272013-0001","Viewing Distance":"Unknown","Region":"California","Country":"United States","Case Number":"45424","Date of the Event":"01/20/2013 01:28 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.08651,+-117.680648(45424)&iwloc=A&hl=en\"> mufon case (45424) map </A>","Tags":"City","Weather Factors":"Unknown","Disposition":"Unresolved","Latitude":"34.08651","Date Submitted":"01/27/2013 01:05 UTC","divs":["Sighting DetailsMy husband, friend and I were visiting an elderly acquaintance living in a large apartment complex for seniors. It was a warm, clear Sunday afternoon. While I went to locate my elderly friend, my husband and his friend sat down on a bench in the open patio area, facing the bright sky. All of a sudden this bright white object could be seen high in the sky. It was a brilliant silver? white object with bright \"headlights\", very brilliant spinning in and out of view. It would move from one direction to another. My husband took three pictures of the object. We also watched its movements with our binnoculars. While viewing, a plane flew by probably onto the path of Los Angeles airport. The object was higher than of the planes path and I doubt that the plane personnel would be able to view the object. The object continued to be visible for about 40 minutes and then it completely disappeared. I cannot describe the \"brilliance\", of the object. I have attached pictures showing object. However, the picture has to be zoomed in to be able to view object. Once, visible you can actually see the brilliant white lights and also see like a small dome in between. Please analyze photo. Zoom is a must!!!"],"Longitude":"-117.680648","Summary":"Observed object in clear blue sky. Object was twirling, spinning and you could see very brilliant \"headlights\", Bright white lights. At times, object would fade in and out, then appear stationary for a time.","Object Shape":"Disc, Oval","Object Flight Path":"Path with directional change"}