{"Object Shape":"Sphere, Unknown","Country":"United States","Tags":"City","Longitude":"-96.335942","Source":"MUFON","Viewing Distance":"Unknown","Log Number":"US-01272013-0013","Object Flight Path":"Other","Summary":"4 bright lights (Almost like plane headlights) in the sky, slowly moving","Region":"Texas","Case Number":"45436","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Latitude":"30.573225","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/45436.html.txt","/var/www/straped/mufon/org/45436.html"],"City":"College Station","Date Submitted":"01/27/2013 03:55 UTC","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.573225,+-96.335942(45436)&iwloc=A&hl=en\"> mufon case (45436) map </A>","Date of the Event":"01/26/2013 10:15 UTC","trends":["There have been 10 other sightings in College Station","There were no other sightings in College Station on or around January 26th 2013"],"divs":["Sighting DetailsMe and 3 roommates were all sitting on top of our roof and suddenly noticed 4 lights very close to each other probably around 30 degrees above the horizon. Each of the 4 lights looked about as bright as a plane that was maybe a few miles away, but they were a solid yellow light (Not blinking colors). They were all very close to each other, almost IDENTICAL to the ones in the pictures from Michigan on the January 10th. It's freaky how much they looked like those. If I were to hold my hands out and make a square with my arms fully extended, they would have all fit in the square. So it resembled 4 planes' headlights, as if they were coming directly at us and weren't too far away. If you've ever seen a video of a busy runway (Just like the UPS runway) when several airplanes are flying in at once very close to each other, that's EXACTLY what it looked like. One of my friends jokingly made the comment that they were four planes about to fly over and bomb us. I thought maybe they were coming to land at the airport a mile or two from us. But they never moved towards the airport, they might have been slowly moving as a group to the right, but they were all slightly moving just a tiny bit within their formation. We were freaking out, because none of us believe in aliens, but we didn't even know what could look like that other than planes flying directly at us! We watched for a solid 120-150 seconds I'd say. Enough to freak out, joke about, and discuss what they could possibly be. Then we were distracted for 2 minutes TOPS because a car drove up to our house. And when we looked back they were gone. Mind you, we were on top of a roof, so the distance for them to fly (if they were planes) to get out of our sight, would take MUCH longer than 2 minutes. Especially since we had already watched them for several minutes without them hardly even moving. The lights had to have either gone out, been turned off, or whatever they were had to have sped off very, VERY quickly."]}