{"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.273651,+-89.089875(4543)&iwloc=A&hl=en\"> mufon case (4543) map </A>","Object Flight Path":"Undisclosed","Date of the Event":"06/28/1965 12:00 UTC","Object Shape":"Unknown","City":"Rockford","Summary":"three very fast shapes that made exact stops three times across the northern sky","Region":"Illinois","Longitude":"-89.089875","Latitude":"42.273651","Case Number":"4543","files":["/var/www/straped/mufon/html2text/4543.html.txt","/var/www/straped/mufon/org/4543.html"],"divs":["Sighting Detailsmy friend and i were standing in my driveway and we were talking, as we were enjoying the evening (alchohol and drugs were not an issue) we looked up to the northern sky,enjoying the clear night and stars. then we noticed a light moving very fast but that was not all, it was followed by another fast light and yet another. they completely stopped, times three and moved in sequence across the north to the east and completely dissapeared. we both swore to each other we would never speak of it as everyone would make fun of us anyway. so we never did till now. i have had experiences all of my life and my daughter as a 15 mo old baby told me one night that little people took her up, i just freaked out and i really think she was better with it at the time than me as i have had something going on most of my life. when i have talked about it with family and coworkers i think that they all think im crazy. i did go to a mufon meeting in rockford in 1988, mostly because what happened to my daughter. the people there were veterens of the war and their wives and the man from chicago mufon would have liked to talk to me more but i was afraid. i have a lot more to say now that im older and wiser."],"Date Submitted":"06/28/1965 12:00 UTC","Disposition":"Unknown","Tags":"City","Log Number":"US-03142006-0003","Object Features":"Undisclosed","Source":"MUFON","Country":"United States","Sighting Duration":"Undisclosed","trends":["There have been 20 other sightings in Rockford","There were no other sightings in Rockford on or around June 28th 1965"],"Weather Factors":"Unknown"}