{"Region":"Minnesota","City":"McGregor MN","Country":"United States","Weather Factors":"Unknown","Longitude":"-93.316732","Object Flight Path":"Stationary","Object Features":"Wings","Object Shape":"Boomerang, Bullet, Missile, Circle, Diamond, Triangle","Tags":"City","Summary":"I just went out to photo Chemtrails the only clearing was west to overhead, this is what was there but there is so much more.","trends":["There have been no other sightings in McGregor MN","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=46.686061,+-93.316732(45438)&iwloc=A&hl=en\"> mufon case (45438) map </A>","Date Submitted":"01/27/2013 06:39 UTC","Latitude":"46.686061","Log Number":"US-01272013-0014","Disposition":"Unresolved","Viewing Distance":"Over One Mile","divs":["Sighting DetailsI was astonished to see the Chemtrails on Oct 28th - 31- 2011 So I started photographing them every chance i can. With over 25.000 photographs I know that I am sucked in to the atmosphere every now and again. Words can not describe the things I now have seen, astonishing things we only thought were in our dreams. More to my reveling is these triangular machines, they seam to be about every where but that amongst my dreams. I went out side to photograph before the loss of day the clouds had split like a big slit and my camra clicked away. As I could see around these clouds looked like chemtrails I do say ! My eyes are not good, I have to where shades the light so bright in these aluminum days. I can not see anyway because Glaucoma is in my way. Yet I click away and to the computer i play this is the way I see, what the Lord reveled to me today, the Computer is my eyes I say. I Publish my photographs on line and I never play. This is a work that needs more quirks as this is the price I pay! When you see these things day after day spending eight hours editing this is work I say ! It would be easier with a little pay but my weariness gets in the way, my weariness that you today don't know about the skies. It is what is in them, that plays a big, big roll in why we are being chemtrailed to death with lies. Look on my sites to what i have seen, we need to reveal the skies to clean our air to clean our dreams to reveal the truth before, Who Screams ? By CH.KRN"],"Date of the Event":"01/26/2013 04:45 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/45438.html.txt","/var/www/straped/mufon/more/45438_submitter_file1__BigGuyresized.jpg","/var/www/straped/mufon/more/45438_submitter_file2__10048560resized.jpg","/var/www/straped/mufon/more/45438_submitter_file3__1004857000resized.jpg","/var/www/straped/mufon/more/45438_submitter_file4__10048581resized.jpg","/var/www/straped/mufon/more/45438_submitter_file5__10048585resized.jpg","/var/www/straped/mufon/org/45438.html"],"Source":"MUFON","Case Number":"45438"}