{"trends":["There have been 4 other sightings in Paradise Valley","There were no other sightings in Paradise Valley on or around January 23rd 2013"],"Object Shape":"Oval, Sphere","files":["/var/www/straped/mufon/html2text/45432.html.txt","/var/www/straped/mufon/org/45432.html"],"Case Number":"45432","City":"Paradise Valley","Object Flight Path":"Path with directional change","Longitude":"-111.935285","Tags":"City","Date Submitted":"01/27/2013 12:27 UTC","Country":"United States","Sighting Duration":"Undisclosed","Log Number":"US-01272013-0009","Viewing Distance":"Over 1 Mile, Unknown","Date of the Event":"01/23/2013 12:00 UTC","Weather Factors":"Unknown","Summary":"Red Light Descends amid Oncoming Commercial Aircraft","Object Features":"Unknown","Region":"Arizona","map":"<A HREF = \"http://maps.google.com/maps?q=33.534344,+-111.935285(45432)&iwloc=A&hl=en\"> mufon case (45432) map </A>","Latitude":"33.534344","Disposition":"Unresolved","Source":"MUFON","divs":["Sighting DetailsThis was yet another sighting this month, in the local supermarket parking lot around dusk. Had just gotten off the bus after work, and was scanning the skies while having a smoke. Amost due east of my position I could see two commercial airliners heading into Phoenix. Both of their bright landing beacons were lit up, making them visible from many miles away. The closest one was to the right of the one farther back, and as I monitored their approach I was surprised to see a red light just suddendly drop out of the sky into their path. After the light had descended below the paths of the oncoming planes, it leveled off and then continued on a slightly downward path in the opposite direction of the approaching airliners. It soon disappeared from view on the horizon. Given that my perspective on all of this was two dimensional, because of the distance, I'm unsure whether the red light descended ahead of both planes or whether it was at some point in between them. The closer plane soon passed over my position, heading towards the horshoe loop over the city most airlines take when landing at Skyharbor. The second one continued on its path towards me, but then banked of to my right as though it were heading towards the west side of Skyharbor. This left me to wonder if this had been an adjustment because of the red light. Had the pilot of the second plane been startled by this?"]}