{"Object Features":"None","Sighting Duration":"00:00:03","divs":["sighting detailsit was just after 8 pm, i was sitting on my bed, messing around with a new program on my pc when i noticed a really bright, almost blinding light, coming over one of the houses i have in view from my window. it looked as it was flying really low and as it was coming from the west it seemed like it was approaching the big navy fuel containers opposite my flat (east). as it came over the house, it immediately turned left (north) and left at an even faster speed. i was watching it all from my window so it\\'s hard to give an accurate\\technical answer on the size and how low it was but it was higher than the containers and they are as tall as my block (5\\6 floors high). the thing that struck me the most is that it didn\\'t make any noise what so ever, in fact it was quieter than usual, no cars or anything. all this happened within 2-3 seconds as it was going at a fast pace, as mentioned above. i believe it\\'s the same \\\"light\\\" that was spotted by mr. ryan on 24th july 2012 and if i remember correctly, i recollect seeing a bright light appear very quickly over the same house about a year ago too, but i wasn\\'t sitting in the same spot as i was just yesterday at the time it appeared and took it to be just my imagination or a reflection of some kind. this could mean that this occurrence is happening frequently. also i would like to add that i\\'ve seen a small red light on the \\\"side\\\" of the \\'bright white light\\' too."],"trends":["There has been one other sighting in Gosport","There were no other sightings in Gosport on or around January 26th 2013"],"Source":"MUFON","Latitude":"50.802225","Log Number":"GB-01272013-0007","Date Submitted":"01/27/2013 09:58 UTC","City":"Gosport","Disposition":"Unresolved","Case Number":"45430","Date of the Event":"01/26/2013 08:10 UTC","Region":"England","Longitude":"-1.109907","map":"<A HREF = \"http://maps.google.com/maps?q=50.802225,+-1.109907(45430)&iwloc=A&hl=en\"> mufon case (45430) map </A>","Object Flight Path":"Path with directional change","Summary":"Bright almost blinding white light appeared over the house coming from West Towards Navy fuel containers and shooting North.","Country":"United Kingdom","files":["/var/www/straped/mufon/html2text/45430.html.txt","/var/www/straped/mufon/org/45430.html"],"Tags":"City","Viewing Distance":"20 Feet or Less, 21-100 Feet","Object Shape":"Unknown","Weather Factors":"Unknown"}