{"divs":["Sighting DetailsMy brother-in-law was holding up a ballon and was about to let go and i went over to tell him not to and then as we were looking up a bright object zoomed above us. as soon as it passed we had to go around the house because it we could not see it other wise. At first i thought it was a commit or an airplane on fire but i did not see or hear a crash. I did not even hear anything as it passed above our heads. My brother-in-law went across the house to see it and he said that he saw it as it twisted in direction and moved and as he was pointing at it he had to look across the house for a brief second where he could not see it and as it came around the corner it turned into an airplane. i did that notice this part because i was not looking at it after my first sighting but i did notice that when he was pointing at the airplane, it seemed to appear out of nowhere. i was extremely traumatized and thought that i must have been dreaming. When the object first passed 90 degrees over my head i lost sight of it because it went over our house."],"Country":"United States","City":"Germantown","Date Submitted":"01/27/2013 01:08 UTC","Object Shape":"Sphere, Star-like","Latitude":"39.086268","Log Number":"US-01272013-0010","Summary":"It was spherical and very bright in the sky. it flew right above our heads and was glowing very bright.","Disposition":"Unresolved","Case Number":"45433","files":["/var/www/straped/mufon/html2text/45433.html.txt","/var/www/straped/mufon/org/45433.html"],"Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Object Features":"None","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.086268,+-77.326418(45433)&iwloc=A&hl=en\"> mufon case (45433) map </A>","trends":["There have been 4 other sightings in Germantown","There were no other sightings in Germantown on or around January 26th 2013"],"Longitude":"-77.326418","Sighting Duration":"00:00:15","Viewing Distance":"Unknown","Tags":"City","Date of the Event":"01/26/2013 11:05 UTC","Region":"Maryland"}