{"divs":["Sighting DetailsAt about 0425-0435 my fiance and I were laying in bed in Ingleside on the bay. Out of the window I saw what seemed to be an unstable flashing star. Numerous colors, so i woke up my fiance to show her this pretty \"star\" and we noticed it was fading out entirely, several times we lost this stationary object in the sky. I quickly grabbed my binos to get a better look. I noticed this \"star\" had 5 lights, one at each point of the cross shape with one in the center. I passed my binos to my fiance for a second opinion, She set the binos on the cat rest of the window for better stability and confirmed my cross shape. I took another look at a more stable position to make sure that it wasnt me moving. This object seemed very unstable and appeared to manipulate itself before fading out. When it would return in the same stationary spot it would be in cross shape. This object when it would re appear would be more stable and in cross shape, after a few minutes it seemed to lose stability and change numerous shapes before fading out entirely. It was almost a full moon and very bright with cloud cover approaching the object. As the clouds passed the object was in the same spot. After significant cloud cover we were no longer able to see the object for the duration of the period. From the direction of the sighting it appeared to be over the bay or over Corpus Christi."],"Source":"MUFON","Longitude":"-97.220567","Date Submitted":"01/27/2013 09:20 UTC","Object Shape":"Cross, Star-like","Country":"United States","Date of the Event":"01/27/2013 04:23 UTC","Region":"Texas","trends":["There have been 3 other sightings in Ingleside","There were no other sightings in Ingleside on or around January 27th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=27.835856,+-97.220567(45441)&iwloc=A&hl=en\"> mufon case (45441) map </A>","Tags":"City","Summary":"Star like at first, through bino's cross shaped, seemed unstable with binos stationary. 5 lights,","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","City":"Ingleside","Latitude":"27.835856","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/45441.html.txt","/var/www/straped/mufon/org/45441.html"],"Case Number":"45441","Log Number":"US-01272013-0016","Viewing Distance":"Over One Mile","Disposition":"Unresolved","Object Flight Path":"Stationary"}