{"Case Number":"45445","map":"<A HREF = \"http://maps.google.com/maps?q=35.826219,+-88.757563(45445)&iwloc=A&hl=en\"> mufon case (45445) map </A>","Source":"MUFON","City":"Medina","Object Flight Path":"Stationary","Disposition":"Unresolved","Object Shape":"Other, Unknown","Object Features":"Unknown","Country":"United States","Log Number":"US-01282013-0002","Date Submitted":"01/28/2013 03:01 UTC","Longitude":"-88.757563","Region":"Tennessee","Tags":"City","Date of the Event":"10/01/2008 03:16 UTC","divs":["Sighting DetailsI woke up in the street. I gathered myself...and felt extremely disoriented. Very similar to how it feels to wake up from surgery. I began to walk back towards my house. I wasn't really thinking. I was scared. And didn't really try to figure out why I was in the street. I just wanted to get back into my house. I entered the front yard. There was a large tree to my right that stands about...three or four stories high. A pecan tree. Something jumped out of the tree. I should have just ran past it. But I was afraid. I ran the other direction...I turned down a couple roads. I had only lived here for a few months. I didn't know the layout of the town well. I had no idea where I was going...I knocked on someone's door. Beat on it actually. I screamed but no one came out of their houses. I knocked on someone else's door. Nothing happened. What ever came out of that tree....there was more of them. Everywhere. I could'nt see them. But I heard them following me. I got on the roof of the garage of the second door I knocked on. I was able to do this because there was a truck in the driveway and the roof began at a low slant. Once I got on the roof I saw a bright light. Then woke up in my bed. I had a vague memory of seeing a bright light through my window. I'm scare to investigate this. I thought it was a dream. Now I am unsure. I've been doing a lot of research and a lot of sources say that they are often remembered as dreams. I...am not sure. I've been seriously considering hypnotherapy for this event and the event of case number 45370. I'm afraid of what I'll find. I've sent MUFON an Email but they have not replied. A friend of mine has had a relationship with these entities. They approached him one night while he was asleep in a lawn chair in his backyard (he smoked outside and it was late at night). One of these things apparently gripped his shoulders and pushed him down into a chair. While two others walked out in front of him. They told him to pull out his phone and record. He showed us the bruises on his shoulders. The message he recorded was meant for me (that's what he said). I have attached it. I broke it into three parts. The third part is where he drops the phone. I just want to know what all of this means."],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/45445.html.txt","/var/www/straped/mufon/org/45445.html"],"Viewing Distance":"21-100 Feet","Summary":"I woke up in the street in front of my house.","Latitude":"35.826219","trends":["There have been 4 other sightings in Medina","There were no other sightings in Medina on or around October 1st 2008"],"Sighting Duration":"Undisclosed"}