{"Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Case Number":"45451","Date Submitted":"01/28/2013 12:49 UTC","City":"San Antonio","Sighting Duration":"00:01:30","Log Number":"US-01282013-0008","Latitude":"29.446577","Longitude":"-98.504849","Disposition":"Unresolved","Source":"MUFON","Object Flight Path":"Straight-line path","Date of the Event":"01/20/2013 12:00 UTC","Country":"United States","Weather Factors":"Unknown","divs":["Sighting DetailsWhile outside a live music venue having a cigarette, I noticed what I thought were five white balloons flying across the sky. Made a joke with my wife about flying balloon UFOs. As I said this, the five objects which were flying in line equidistant from each other, moved into a delta formation. This was not happenstance as inline object #4 moved to left of formation, circled across front of object#1 and to its right into position #2 to #1's right. At the same time, inline object #2 followed same flight path as #4, but came back into formation behind #4. Inline objects #3 & 5 closed ranks once #2 & 4 changed position so that they were now parallel with #2 & 4 in a delta formation behind #1. While this formation change happened, none of the objects ever slowed down their forward movement. Objects came from behind Crown Plaza area. Forward flight path as observed, was looking south, to the right of Crown Plaza, flying north almost directly overhead of 107 E. Martin, continuing north past Convent St., until out of view. Looking on a st map of the area. Observed overhead flight path appeared to originate somewhere around or before E Pecan St & Soledad, and continued in a northerly direction towards where Giraud & Augusta St's intersect. Observable portion of path was limited to sky visible while standing between 107 E. Martin and Riverwalk. I lost sight of objects due to them fading out as if someone decided to turn a fader light switch off. Fade out took about 2-3 seconds. The sky was clear on this night, nor were the final observation of the objects obstructed by trees or buildings."],"trends":["There have been 148 other sightings in San Antonio","There was one other sighting in San Antonio on or around January 20th 2013"],"files":["/var/www/straped/mufon/html2text/45451.html.txt","/var/www/straped/mufon/org/45451.html"],"Region":"Texas","Summary":"Observed five cirle shaped objects fly overhead while changing formation","map":"<A HREF = \"http://maps.google.com/maps?q=29.446577,+-98.504849(45451)&iwloc=A&hl=en\"> mufon case (45451) map </A>","Object Shape":"Circle","Object Features":"None"}