{"Source":"MUFON","Latitude":"38.582661","Object Shape":"Other","Summary":"Two orange star like lights then 1 large jellyfish top like object","Country":"United States","Date of the Event":"01/27/2013 09:00 UTC","Region":"California","files":["/var/www/straped/mufon/html2text/45455.html.txt","/var/www/straped/mufon/org/45455.html"],"Date Submitted":"01/28/2013 04:46 UTC","divs":["Sighting DetailsWe saw two orange lights moving West to East. They seemed to be following each other. Thought they might be satellites but brighter, bigger and lower. At that time, we could see planes at various altitudes in the area and these definitely did not look the same. Like I said, much more satellite looking. Then one disappeared. About 30 seconds later the second one disappeared. About a minute or two later as we kept looking up because of the previous lights we saw a very strange object. Thought it might be a balloon at first but it was traveling WAY too fast and there were not any winds to speak of and the winds would not be traveling exactly West to East. If I had to describe it I would say that it looked kind of like the head of a jellyfish. It seemed translucent or opaque. It seemed much lower than the two previous lights yet it was still pretty high. All three were orange in color but the third was not very bright. We honestly could not figure out what these objects were. Very strange indeed. Did anyone else see them. Would love to hear."],"Weather Factors":"Unknown","Disposition":"Unresolved","Case Number":"45455","trends":["There have been 4 other sightings in West Sacramento","There were no other sightings in West Sacramento on or around January 27th 2013"],"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.582661,+-121.521434(45455)&iwloc=A&hl=en\"> mufon case (45455) map </A>","Log Number":"US-01282013-0012","Sighting Duration":"Undisclosed","City":"West Sacramento","Longitude":"-121.521434","Tags":"City","Object Flight Path":"Straight-line path","Object Features":"Other"}