{"Case Number":"45464","Country":"United States","Object Shape":"Triangle","Object Flight Path":"Straight-line path","divs":["Sighting DetailsIt was late evening. Around 8:45 pm I walked outside to have a smoke. Sat down in my truck turned on the radio and had a couple smokes. Several minutes later my wife cane outside to have a smoke as well. As she sat down in the truck I leaned out of the drivers waindow and just glance up at the sky. That's when I first seen it. At first it didn't register. But almost instantly I looked back and noticed this was a little unusual. I told my wife to look and she agree. I began to get excited. There were three amber lights,looked like head lights on an old 1960's ford pickup, arranged in a triangle flying point to the rear flat side in the front. At first one flashing light in the center. I hoped out of with my binoculors to see if I could see an outline or something . I then told her to turn of the radio. I live in a secluded, wooded area. You don't hear cars. No traffic. No sirens. Just coyotes,owls and other critters that live in the forest at this time of night. And my kids when they are outside. That's when I niticed there was no sound. None what so ever. And if flew at a very slow speed I would say for its size. I then ran to the middle of the yard to better vantange point. Thats when two more lights began to flash with the one in the middle. All three in a straight line. The object continued west untill I could no longer see it."],"files":["/var/www/straped/mufon/html2text/45464.html.txt","/var/www/straped/mufon/org/45464.html"],"Summary":"triangle shaped ligoht patern. one flashing light in the middle. then three flashin in the middle. white then seemed to flash differnt colors","Region":"Texas","Object Features":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","Disposition":"Unresolved","Date Submitted":"01/28/2013 10:37 UTC","trends":["There have been 2 other sightings in Huntington","There was one other sighting in Huntington on or around January 22nd 2013"],"Date of the Event":"01/22/2013 09:32 UTC","Longitude":"-94.60589","Log Number":"US-01282013-0021","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=31.246647,+-94.60589(45464)&iwloc=A&hl=en\"> mufon case (45464) map </A>","City":"Huntington","Source":"MUFON","Latitude":"31.246647"}