{"Source":"MUFON","Object Features":"Unknown","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/45467.html.txt","/var/www/straped/mufon/org/45467.html"],"Country":"United States","Case Number":"45467","Tags":"City","City":"Monroe","map":"<A HREF = \"http://maps.google.com/maps?q=32.523605,+-92.052644(45467)&iwloc=A&hl=en\"> mufon case (45467) map </A>","Log Number":"US-01282013-0023","Region":"Kansas","Summary":"One light changing directions, two possible planes following.","Sighting Duration":"Undisclosed","Longitude":"-92.052644","Object Shape":"Star-like","divs":["Sighting DetailsA buddy of mine was over and we had just finished dinner. He went outside for a smoke, and I joined him, and we were looking up at the clouds talking about the chance of severe weather that is expected in the next 24 hours. He noticed a solid light, that was heading north, toward Kansas City. We thought it was odd, because it was low, below the cloud cover, or perhaps in the clouds, since it appeared slightly faint, but there wasn't any flashing lights like you would see on a plane. It went out far enough it was out of sight, but then a few moments later, it was coming back south toward us. We then assumed it must have been a plane that left the Allen County Airport, but then it turned again and started east toward Fort Scott. It was then I opened the kitchen door to tell my girlfriend to come outside, but by the time she got out there, it was out of sight. My buddy decided to have another smoke in case it came back, and it did. It was now heading west, towards Yates Center. I called my girlfriend back out, and this time she did see it too. And after we watched it a few minutes we then noticed a plane following it. We knew the second object was a plane, because we could see the strobe lights, or markers, flashing on it. At first it seemed the second object was gaining on the first object, but then the first object began to pull away. Approximately five minutes after spotting the second object, a third object appeared, and was following the first objects. My girlfriend noticed that one of the objects made a sudden drop, like a swift change in altitude, but not in direction. We've taken into consideration that due to the weather here, these lights could have been planes being diverted because of turbulence. However, to have three planes in this close of a vicinity is something I've never seen before. But since the one object wasn't flashing is why we were interested. We always see planes flying over, it's a flyover state, but this wasn't normal. The last two objects that came into our view came from the northeast, and traveled south and west to follow the unknown object, which could mean they came from KCI or from the Air Force base. Not sure, but thought it was worth reporting. We didn't catch video or pictures because our phones were inside, and the objects were so far away that we probably wouldn't have been able to capture them. We'll keep looking up like always."],"Object Flight Path":"Path with directional change","Latitude":"32.523605","Weather Factors":"Unknown","trends":["There have been no other sightings in Monroe","This sighting has never been favorited."],"Disposition":"Unresolved","Date Submitted":"01/28/2013 11:02 UTC","Date of the Event":"01/28/2013 08:15 UTC"}