{"Summary":"orange light landed then emited all colors of the spectrum","Date of the Event":"12/10/2012 12:00 UTC","Disposition":"Unresolved","Case Number":"45470","Longitude":"-85.532775","Region":"Michigan","map":"<A HREF = \"http://maps.google.com/maps?q=42.120046,+-85.532775(45470)&iwloc=A&hl=en\"> mufon case (45470) map </A>","Object Shape":"Fireball, Sphere, Unknown","divs":["Sighting DetailsI am telling a story that was told to me by a family member. It is a truly spectacular story and I have a keen interest in the subject so I thought I would share it cause I know they have not. Now I know these people and they are not ones to make up stories they have no reason or anything to gain from this and haven't told anyone besides for for family and friends. So my aunt comes home from grocery shopping it is dark out and the live next to farmland. So she can see a good distance behind their house for atleast a mile or more. She see a glowing orange orb hovering around the trees a mile behind their house as she is bring in groceries. She observes the object as she brings in the items into the house comes back out and observes the object as she comes back out to the trunk of the car she gets to the back of the car stares at the object wondering what it could be. She bends down to grabs some bags of groceries, in a short time 2 to 3 seconds to grab the groceries she looks back up and the orb had shot across the field in that time and seemed to be observing her. She panicked and ran inside to grab my uncle who had been napping. She brings my uncle out to observe what she was seeing. They go outside and find nothing for a moment. They get to the edge of their property where the farm land starts when the object appears in the treeline where she had first observed it. They describe its movement as dissapearing and reappearing in an instant. Eratic movement dissapeared and reappear from the bottom of a tree to the top of a tree in an instant they observe this action for a min when they object dissapeared and reappears landed in the farmland behind a neighbours house no more than a 1000 yards away landed. They describe the object to be as big as a house. It started to emit all the colors of the spectrum in sequence. It would emit an orange light go dim and silently explode as they describe an orange light, Then blue, red, green, yellow, all doing the process I just described in rapid sucession. At this point in a panic my aunt started tugging on my uncle in fear to get them back into the house. At this point the lights stopped and they no longer seen the object. I thought this was an amazing story hope someone could share a similar experience."],"files":["/var/www/straped/mufon/html2text/45470.html.txt","/var/www/straped/mufon/org/45470.html"],"Source":"MUFON","Latitude":"42.120046","Log Number":"US-01292013-0003","Country":"United States","Object Features":"Dome","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Tags":"City","City":"Vicksburg","Date Submitted":"01/29/2013 05:26 UTC","Object Flight Path":"Path with directional change","trends":["There have been no other sightings in Vicksburg","This sighting has never been favorited."]}