{"Case Number":"45479","Object Flight Path":"Path with directional change","Object Features":"Other, Unknown","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around January 29th 2013"],"Weather Factors":"Unknown","City":"Tucson","Log Number":"US-01302013-0001","Region":"Arizona","Disposition":"Unresolved","Viewing Distance":"21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Country":"United States","divs":["Sighting DetailsI live in Tucson Arizona sw side of town out of city limits I was out in my front yard at about 8 pm jan.29 2013 rideing a new motor bike I had just purchased up and down my residential street my street faces north to south I rode about 200 feet away from my house south down my street turned around to go back Toward my house north bound at this time when I looked to my left looking west something had caught my eye they were flying just above the homes to my left going from the s.w. to the n.e. they flew pretty fast and very very quite they seemed like they were in a formation one behind the other I herd nothing as they flew they were allmost gliding as if flying in space they flew s.w. to n.e. as I pedaled back home I was trying very hard at that point to get back home they were goin so fast they must have flown a couple miles in under 30 seconds so it really freaked me out they flew directly in front of me over my street as I was going back home and by the time I pulled up to my garage they flew over my neighbors house that's the house next door to me on the north end and they went out of view the direction they were going looked like they were goin n.e. into town \"Tucson\" .they also seemed as if they were reflecting the light from the streets and home pourch lights they were flying over it was also a full moon and that made it easyer to spot them I could see clear as day 2 fighter jet sized ufos they wher shaped kinda like a rounded edge Diamond very airodinamic looking they had a metallic look to the surface with a goldish copper red tone .seemed as if they were flying low intentionaly as if to avoid detection from our air radar systems one reason they might have flown thru my valley that low could be because ther is a air strip a few miles away with operational air traffic radar it's called Ryan's air field.now I know what I saw I I can garentee that what I saw was a UFO it wasn't a plane or a helicopter or anything of this earth when you get that feeling inside that feeling that just lets you know your terrified by puting that lump in ur throat or by making our hearts drop we all know the feeling what I was looking at that night what I saw wasent natural not to our planet . When I seen them they were flying low and close enuff to me that I saw them both clear as day and with the moon light and street lights made it Easyer to see them my heart sank into my stomach I could not be leave what I had seen I hurried up went side and locked my door that's how scared I was from witnessing this sighting it was the first time I have ever seen a real UFO in person ....... I am also including a pic of a map of the area if u look at it the ufos were pretty much traveling from the sw corner to the n.e. corner of the picture the were south of the highway 86 and a hair north of me I'm blue dot they were also traveling g parallel to highway 86 flying n.e. thanks for reading its true I swear on my life .... We're not alone I am a true beleaver now and I'm freaked out ....."],"Latitude":"32.148151","Longitude":"-111.146431","Summary":"I saw 2 UFO flying over my neighborhood silent no lights fast and low enuff to remain undetected by radar traveling sw to nw flew very close to me I saw shape and the lights on my street made them visible seemed like they wher trying to stay undetected","Date Submitted":"01/30/2013 12:24 UTC","Tags":"City","Date of the Event":"01/29/2013 08:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.148151,+-111.146431(45479)&iwloc=A&hl=en\"> mufon case (45479) map </A>","Object Shape":"Boomerang, Diamond, Oval, Other, Unknown","files":["/var/www/straped/mufon/html2text/45479.html.txt","/var/www/straped/mufon/org/45479.html"],"Source":"MUFON"}