{"Viewing Distance":"Over One Mile","divs":["Sighting DetailsThe wife and I had been traveling east on I-90 Interstate towards Rapid City. We exited the Interstate in Black Hawk and we both noticed a very white shiny light that seemed to be sitting under a cloud. What drew our attention is the fact it at first seemed like a glint of something metal off the sun, but it actually looked to be stationary at this point, and the light or whatever it was became very bright. We then noticed it changed to a bluish white color and it seemed to really take off very fast. We noticed it started to fly through the cloud and the maybe less than 1 second it took to reappear, it was dark in appearance. I looked away for just a second to pull over and my wife said, it just disappeared. My wife said she was still watching whatever it was and said it just disappeared. I tried looking, but I could not find it. At first we were trying to figure out what we saw as maybe an airplane. Ellsworth Air Force Base is located within 5-10 miles of where we observed this, whatever it was. The Rapid City municipal airport is also within 10-15 miles distant. We see Air Force bombers flying all the time as well as commercial jets, but this was nothing like those. I don't know really how far away this was but it was not coming in for a landing or taking off. I am also trying to figure out how if this thing was under a cloud, how it could be reflecting the sun, but when it was out in the open, away from the cloud, it was not reflecting the sun? We are at a loss to explain what it was. After we saw this about 3-4 minutes elapsed while my wife and I were talking about it. I had a camera in my car, so I took a picture of the cloud it was under, I know it doesn't help, but maybe someone can figure out how high up it could have been. Please tell us we just saw an airplane!"],"Tags":"City","files":["/var/www/straped/mufon/html2text/45474.html.txt","/var/www/straped/mufon/org/45474.html"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=44.087083,+-103.226795(45474)&iwloc=A&hl=en\"> mufon case (45474) map </A>","Source":"MUFON","trends":["There have been 10 other sightings in Rapid City","There were no other sightings in Rapid City on or around January 29th 2013"],"Object Shape":"Other","Date Submitted":"01/29/2013 03:30 UTC","Log Number":"US-01292013-0007","Region":"South Dakota","City":"Rapid City","Summary":"Wife and I saw bright white light under a cloud then noticed a blue white trail behind it. It shot away and disappeared.","Object Features":"Unknown","Latitude":"44.087083","Case Number":"45474","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Date of the Event":"01/29/2013 11:15 UTC","Longitude":"-103.226795","Disposition":"Unresolved","Weather Factors":"Unknown"}