{"Region":"Illinois","Object Shape":"Disc, Other","Weather Factors":"Unknown","City":"Hillsboro","Source":"MUFON","Disposition":"Unresolved","divs":["Sighting DetailsAround 1964 during summer, or late summer, in the late morning, I was two houses east of my parents house, cutting large acorns open that had fell from the neighbor's tree, with my pocket knife (a residential area). I looked up and saw a solid white object that actually looked like the USS Enterprise from Star Trek in the clear blue sky. It's altidue I am not sure of but thinking back, it might have been only about 10 to 20 thousand feet. It was huge and white in color. It was facing east and did not appear to be moving; just hovering. This has bothered me ever since in that when I first saw Star Trek, I recognized the shape of the craft. Anyway, I ran home, crying (I was 6 or 7 years old at the time), scared. I tried explaining what I saw to my Mother but she said I only saw clouds. There was no sound and the object was huge. It was basically the image of the spacecraft on Star Trek. I have never told anyone about this. I lost sight of the object in that after watching it hover, and it scared me, I ran home."],"Summary":"Looked like Star Trek Interprise docking with an airliner, or maybe all in one.","Object Features":"Wings, Other","Sighting Duration":"Undisclosed","Country":"United States","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/45489.html.txt","/var/www/straped/mufon/org/45489.html"],"Case Number":"45489","Date Submitted":"01/30/2013 10:03 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.154852,+-89.498342(45489)&iwloc=A&hl=en\"> mufon case (45489) map </A>","trends":["There has been one other sighting in Hillsboro","There were no other sightings in Hillsboro on or around June 15th 1964"],"Latitude":"39.154852","Longitude":"-89.498342","Tags":"City","Log Number":"US-01302013-0011","Viewing Distance":"Over One Mile","Date of the Event":"06/15/1964 12:00 UTC"}