{"Date of the Event":"01/14/2013 07:43 UTC","files":["/var/www/straped/mufon/html2text/45487.html.txt","/var/www/straped/mufon/org/45487.html"],"Date Submitted":"01/30/2013 05:40 UTC","Weather Factors":"Unknown","Object Features":"Window(s)","Viewing Distance":"Unknown","Case Number":"45487","Summary":"UFO Abduction/Alien Contact Face to Face\"","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=30.508583,+-97.819717(45487)&iwloc=A&hl=en\"> mufon case (45487) map </A>","City":"Cedar Park","Tags":"City","Object Shape":"Disc","trends":["There have been 14 other sightings in Cedar Park","There was one other sighting in Cedar Park on or around January 14th 2013"],"Latitude":"30.508583","Sighting Duration":"07:43:00","Country":"United States","divs":["Sighting DetailsNormally around 7:00 P.m central time I head outside in my backyard to get some fresh air. I stepped outside for around thirty minutes and continued standing in the middle of the yard just looking around in the sky with my binoculars. Around 7:43 P.m central time, something caught my attention. I happened to glance out of the left of me to see something that looked like a huge chunk of medal hovering in the air slowly. I removed the binoculars and stared at the unknown object for around ten minutes. The object stayed in one single place in the sky and never moved for about an hour. You could easily see this object by the naked eye. This object was completely dull in color, the shape of it was a disk and it rotated for around an hour. The size of it was [my guess], about the size of a football field and as long as two eight-teen wheelers. On the bottom of the craft was silver with a few which looked like, burnt marks. Either it was burnt marks or rust, I couldn't tell that good. After around 8:01 P.m central time, the object hovered more close to my house and hovered right in the middle of my yard. The shadow of it completely covered the yard, I couldn't see much underneath the craft until it stopped rotating. I could count about thirty-five windows around it, none of which were lit except for two. Strangely enough the craft made this loud humming sound which led to make me unconscious. I awoke several minutes later staring up at some kind of blinding ceiling, the room was wide with some controls and tables and some weird looking tools. Out of the corner of my right eye I spotted a figure which looked to be about five feet tall. Behind it was another figure and another. I counted three total while they walked towards me and looked down at me. One of the beings started mumbling something in a language I couldn't explain. The being placed it's arm behind me as I stood up on the table while the being gave me this weird looking book. The book on it didn't have words on the cover, but inside had different pictures of human species. Male and Female. The male was populated 4,000,000 percent and the female was populated as 5,320,000. I didn't have a clue what this meant but the being turned the page where it showed a group of researchers looking up at the sky staring at another disk shaped craft simular to the one these beings had me on. The being spoke to me through mind telling me that he was a male and the other two were female. He told me in this correct sentence: \"Human and Species are over-populating. We have been given the right to abduct humans by order of the Government and your leaders. Such amount can be produced by humans, but our kind is being extinct. Our species known as the \"Vetrolment\" [Vet-troll-meant] are dying without the help of our second species known as \"The Greys\".\" I was confused at time but I understood everything. I didn't know what to think of it but the male alien led me off the table and out the craft. I asked him if they did experiments on myself but he said \"no\". The male alien told me that when they abducted me, he sent two others inside my house to search around for any kind of \"Evidence\" they needed. The only suppose \"Evidence\" I had was a few sketch books with drawings of Alien's and UFO's. Since then, I haven't see anything interesting but I do believe they'll come back.. and I do believe they are our next human race..}"],"Source":"MUFON","Disposition":"Unresolved","Object Flight Path":"Hovering then path,Path then hovering","Log Number":"US-01302013-0009","Longitude":"-97.819717"}