{"City":"Mission","divs":["Sighting DetailsIn the middle of the night 3-4am central time, I was awakened by the dog growling. Without moving, I opened my eyes to see a brightly glowing round object at the south window in the mid to upper west corner. The dish or dinner plate sized object was illuminated by red and green rows of lights that appeared to resemble light bulbs 2-3 inches in diameter. There were at least three rows and all were bright red and green like Christmas lights. Surprised, I wondered what could cause a Christmas light display to appear or reflect in my bedroom. The minute I tried to focus my thoughts on what I was seeing and knew it could not be a reflection because it was hovering, it shifted phase and disappeared behind the window where I could only see a bit of green light behind the slats of the window blind. I sensed it knew my thoughts and apparently didn't want to be seen. I tried to focus my eyes better but the light was gone after a few more seconds. I figured trying to go outside wouldn't give me any more information. The dog was quiet so I went back to sleep."],"Longitude":"-94.655791","Latitude":"39.027783","trends":["There have been 3 other sightings in Mission","There were no other sightings in Mission on or around January 27th 2013"],"Source":"MUFON","Weather Factors":"Unknown","Tags":"City","Object Shape":"Circle","Viewing Distance":"20 Feet or Less","Summary":"Circular lighted object in bedroom.","Region":"Kansas","Date of the Event":"01/27/2013 12:00 UTC","Object Flight Path":"Hovering then path,Straight-line path","Log Number":"US-01302013-0008","Disposition":"Unresolved","Sighting Duration":"00:02:00","Country":"United States","files":["/var/www/straped/mufon/html2text/45486.html.txt","/var/www/straped/mufon/org/45486.html"],"Date Submitted":"01/30/2013 03:39 UTC","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=39.027783,+-94.655791(45486)&iwloc=A&hl=en\"> mufon case (45486) map </A>","Case Number":"45486"}