{"Sighting Duration":"Undisclosed","Date Submitted":"01/31/2013 09:32 UTC","files":["/var/www/straped/mufon/html2text/45495.html.txt","/var/www/straped/mufon/org/45495.html"],"Object Features":"None","City":"Asheville","Region":"North Carolina","Longitude":"-82.597812","Disposition":"Unresolved","divs":["Sighting DetailsThere is a very pretty gibbous moon out this morning, and apparently my son was looking at it on the way to school. At about 7:50-7:55, while at the stop light for the I-40 West entrance ramp, going south on Brevard Rd, my seven year old son, asked \"What was that?\" I asked \"What was what?\" He said, \"I just saw a white thing that was moving around the moon and then shot down.\" I asked him to describe it further, and he said that it was long and thin and white, and \"I think it may have been a rocket ship.\" I asked if it went all the way around the moon, and he said it went about halfway around it, but it surprised him that then it just shot down and disappeared behind a cloud. I don't know if he meant that it passed around from back to front, or moved around the visible circumference. I also don't know if white means luminous, or just white. I didn't have a lot of time to ask questions as I had to drop him off at school, and I also didn't want to make a big thing out of it. It could have been a reflection on the window, or a meteor, but he's a pretty serious-minded boy, and I've never known him to invent a story and present it as real, and as far as I know, he has shown no interest in UFOs, so I'm convinced he believes he saw what he described. In any case, it seemed worth posting a report, just to serve as confirmation in case someone else saw something this morning."],"Tags":"City","Country":"United States","Object Flight Path":"Path with directional change","Log Number":"US-01312013-0003","Case Number":"45495","Latitude":"35.556542","Weather Factors":"Unknown","Object Shape":"Cigar, Other","map":"<A HREF = \"http://maps.google.com/maps?q=35.556542,+-82.597812(45495)&iwloc=A&hl=en\"> mufon case (45495) map </A>","Source":"MUFON","trends":["There have been 28 other sightings in Asheville","There were no other sightings in Asheville on or around January 31st 2013"],"Date of the Event":"01/31/2013 07:50 UTC","Summary":"Long, thin, white object circles around moon and then shoots down, disappearing behind a cloud","Viewing Distance":"Unknown"}