{"Object Shape":"Chevron, Triangle","Weather Factors":"Unknown","Date Submitted":"02/24/2006 07:35 UTC","Case Number":"4549","City":"Baltimore","files":["/var/www/straped/mufon/html2text/4549.html.txt","/var/www/straped/mufon/org/4549.html"],"Disposition":"IFO","trends":["There have been 65 other sightings in Baltimore","There were no other sightings in Baltimore on or around February 24th 2006"],"divs":["Sighting DetailsMy fiancee and I were taking a walk through our neighborhood (Windsor Hills) and looking at the stars. I glanced at Orion and was looking for the faint glow of the Pleiades, when I noticed what appeared to be a constellation of lights cruise through the sky. Immediately, I asked my fiancee to observe the phenomenon. It then followed that we saw 3 V-shaped objects flying SE, though they could have been triangular. They were silent, and their distance and dimensions couldn't be determined, though they must have been quite large when compared to commercial aircraft (perhaps 5 to 10 times the size) flying at a comparable altitude. The craft almost had a translucent appearance, though the front edge seemed luminous (almost as if hazy, glowing lights or a \"string of stars\" had been strung across the front). Each object remained visible for 5 to 10 seconds, and it appeared that they flew with their points facing downward. We lost sight of them, as the tree line blocked our ability to follow the craft to the horizon. We saw the first one at about 7:30pm then walked to a less light-polluted area for better viewing. About five minutes later two more objects appeared and flew in the same direction. Though, we spotted three craft, chances are that there could have been more. After spotting the first one, we moved to a spot that was less affected by light-pollution, which may have taken three to five minutes. Upon reaching the new locale, we spotted two more craft. Perhaps there could have been other craft that we missed during the interim. It was difficult to spot the craft initially, because it was as if they were \"stealthed\" in some way -- as if they were blending in with their surroundings. Had we not been looking at the stars, and had it not been a clear night, chances are we would not have noticed the craft. In addition to their luminous glow, there was an ethereal nature to them, and they seemed to cruise entirely silently and steadily, with no apparent change in direction."],"Sighting Duration":"Undisclosed","Summary":"3 luminous chevron-like objects silently cruising.","Object Features":"Undisclosed","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.299755,+-76.607739(4549)&iwloc=A&hl=en\"> mufon case (4549) map </A>","Source":"MUFON","Date of the Event":"02/24/2006 07:35 UTC","Object Flight Path":"Undisclosed","Tags":"City","Region":"Maryland","Viewing Distance":"Unknown","Log Number":"US-03172006-0002","Latitude":"39.299755","Longitude":"-76.607739"}