{"Longitude":"-93.158266","Disposition":"Unresolved","Date Submitted":"01/30/2013 10:35 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.812942,+-93.158266(45490)&iwloc=A&hl=en\"> mufon case (45490) map </A>","Tags":"City","Sighting Duration":"Undisclosed","Object Shape":"Circle, Sphere, Other","Viewing Distance":"Over 1 Mile, Unknown","Summary":"I observed a black round cloudy looking object that seemed to try and blend with the cloud cover.to camo","trends":["There have been 3 other sightings in Eagan","There were no other sightings in Eagan on or around January 30th 2013"],"Region":"Minnesota","divs":["sighting detailsi was at the st paul\\minneapolis airport driving back to the freight house when i observed what i thought was a very low exhaust cloud from a aircraft, until it moved. it had a end trail as wide as the orb that came to a point that when it stopped the end trail was absorbed back in the round dark grey cloud. i thought to myself it was because i was moving so i used a point of reference by using the smoke stack that was on the left of the cloudy looking orb, as i looked at it. it continued to move left and right in short distances. i thought it maybe a blemish on my window or something in my eyes. then it started to move from my right to left with a slight descent.it started to change shape while passing the smoke stack. the new shape looked a little like the 60's star trek badge, but laying a on it's side a bit. at this time i decided to stop and open my window. making sure i had nothing to distort my pic. when i was able to get my phone out ,it moved behind a aircraft hanger before i could take a pic. not to be seen again. this thing looked like it was trying to blend with the cloud cover we had today. if i weren't looking directly at it or took my eye off it, it would have not been noticed or seen. after seeing this i got on line as fast a i could and found a pic of it. in file 1 is not what i saw, but this is what i saw. i'm not sure what i was feeling. but i know i was freaked."],"City":"Eagan","files":["/var/www/straped/mufon/html2text/45490.html.txt","/var/www/straped/mufon/org/45490.html"],"Source":"MUFON","Date of the Event":"01/30/2013 09:30 UTC","Case Number":"45490","Weather Factors":"Unknown","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Latitude":"44.812942","Country":"United States","Log Number":"US-01302013-0012","Object Features":"Other, Unknown"}