{"map":"<A HREF = \"http://maps.google.com/maps?q=36.045364,+-86.743944(45496)&iwloc=A&hl=en\"> mufon case (45496) map </A>","trends":["There have been 72 other sightings in Nashville","There were no other sightings in Nashville on or around January 15th 2013"],"Disposition":"Unresolved","Weather Factors":"Unknown","City":"Nashville","Object Features":"Appendage(s), Wings, Unknown","Date of the Event":"01/15/2013 08:00 UTC","Source":"MUFON","Country":"United States","Date Submitted":"01/31/2013 11:35 UTC","Case Number":"45496","Object Shape":"Circle, Other, Unknown","Longitude":"-86.743944","Tags":"City","Log Number":"US-01312013-0004","Latitude":"36.045364","files":["/var/www/straped/mufon/html2text/45496.html.txt","/var/www/straped/mufon/org/45496.html"],"divs":["Sighting DetailsMy boyfriend and I were on our way to the grocery store when this \"thing\" with bright red, blue, white and purple lights that was flying just above the treetops near a park descended in a straight line down to hover over a football field. For a second it stayed there and then in a straight path, still hovering, it flew over the length of the field, made a right turn, still hovering, to fly the width of the field, made another right turn to go back the length of the field, ascended about 15 feet, and started back down the field. We looked around the park for people to see if it was some kind of toy, but no one was there! The object seemed to have wings, but the body of the object was translucent. All we could see were the bright lights, but couldn't really make out a shape. We have witnessed many occurrences before, so we were once again amazed by this ufo! We lost sight as we drove by the park, but every time I drive by it now I look to see if it will come back!"],"Summary":"bright lights shot straight down from just above treetops and hovered over ground","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Sighting Duration":"00:01:00","Region":"Tennessee","Viewing Distance":"101-500 Feet"}