{"Viewing Distance":"Unknown","divs":["Sighting DetailsOn the evening of Christmas Eve 2012 I was traveling with my girlfriend and her family northbound on George Washington Memorial Highway in Gloucester, Virginia to visit her relatives. I was sitting in the back seat on the drivers side looking out the window when my girlfriend, her brother and I noticed a glowing orangeish redish orb-like object hovering in the sky. It's hard to describe the glowing of the object, almost like a light source was being radiated from an object as opposed to shining from it. The object was completely still in the night sky and we pulled over to safely get a better view of it. It appeared as if the object slightly descended, but because of the distance it's hard to say for certain. About 3-quarters into the sighting, the object began to travel southwest only to come to a complete stop, hovering for a few seconds than vanishing into the night sky almost like a candle with a dying flame. After the object had vanished, it seemed like everything around us went silent and still. It was almost chilling how still the night became after the sighting. Certainly a great early Christmas present!"],"Country":"United States","Case Number":"45493","Object Shape":"Circle","Region":"Virginia","files":["/var/www/straped/mufon/html2text/45493.html.txt","/var/www/straped/mufon/org/45493.html"],"Object Flight Path":"Hovering then path","Log Number":"US-01312013-0001","Latitude":"37.438894","Summary":"Glowing Orb-like object in sky","Sighting Duration":"Undisclosed","Object Features":"Unknown","Date of the Event":"12/24/2012 07:33 UTC","trends":["There have been no other sightings in Gloucester","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=37.438894,+-76.55937(45493)&iwloc=A&hl=en\"> mufon case (45493) map </A>","City":"Gloucester","Date Submitted":"01/31/2013 05:30 UTC","Disposition":"Unresolved","Source":"MUFON","Weather Factors":"Unknown","Longitude":"-76.55937","Tags":"City"}