{"Longitude":"-82.386645","Weather Factors":"Unknown","divs":["sighting detailswas outside approximately 8:52pm est, when from the northwest sky i saw a fire ball slowly rise in the sky. i thought maybe a plane, with it's multiple lights perhaps mixing in the atmosphere to appear like an orange \\ fire like glow. however, to my surprise, the object stayed pulsating orange (like a fire), traveling similar speed and path as high-altitude commercial jets that go over (my perception at least), then disappearing just as they crossed directly overhead heading se (gradual diminishing of light until it was similar to a star then gone). it was enough to really grab my attention, however to my astonishment from the northwest sky, more appeared. this time a formation of three that stayed similar distance from each other, all following one after another on same flight path. then two more. all went overhead the same way, same path, quickly diminishing as they passed 12:00 overhead (they would make it a little se before disappearing completely). my best guess is 12-15 orange \"orbs\" is best i can describe it. the only thing i've been able to come up with that would be a possibility would be chinese lanterns launched northwest of here that could be seen for miles and just appeared to be very high-altitude?"],"Latitude":"29.676446","Tags":"City","Region":"Florida","Object Shape":"Fireball","Country":"United States","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","City":"Gainesville","map":"<A HREF = \"http://maps.google.com/maps?q=29.676446,+-82.386645(45505)&iwloc=A&hl=en\"> mufon case (45505) map </A>","Object Features":"Unknown","Disposition":"Unresolved","Log Number":"US-01312013-0013","Summary":"Series of orange lights, at least twelve, flying from NW to SE over Gainesville, FL","Source":"MUFON","Date of the Event":"01/31/2013 08:52 UTC","files":["/var/www/straped/mufon/html2text/45505.html.txt","/var/www/straped/mufon/org/45505.html"],"Viewing Distance":"Over One Mile","trends":["There have been 27 other sightings in Gainesville","There were no other sightings in Gainesville on or around January 31st 2013"],"Case Number":"45505","Date Submitted":"01/31/2013 11:59 UTC"}