{"divs":["Sighting DetailsMy buddy and I, were driving north on Quarterhorse Ln. at the stop sign on blue diamond. My buddy says \"what the f**k is that.\" I look up and see a string of orange ball lights way far away on the NW side of town. these lights seemed to be in a shallow v or boomerang as viewed from the side. They almost seemed to undulate. But that could be from heat waves on the horizon. We watched for about 45 seconds until it went over the mountain. it was heading NW. I made sure to pop my head out of the side because i couldn't believe it, and wondered if it was a reflection, it was not. It had no normal navigation lights or the typical flashing heli or plane lights. The lights seen were bigger and more orange than all other aviation lights i have ever seen, especially for being so far away. It was not on the typical mccarran flight path. We continued down Blue Diamond heading east. We were going to get my jeep from work. We joked about seeing an unexplainable ufo. Usually we point out reasons things are not a ufo when friends or family see something in the sky. So we get to the Rainbow and Blue Diamond intersection, and i'm looking out his side of the truck towards the north because i cant stop watching the sky now. As were driving I see A big orange light again. This time more north than north west and it seemed closer as the lights were a bit bigger than the last sighting. I had him roll the window down, again to make sure it wasn't a reflection. it wasn't. Then the single light goes out and a small distance away it lights again, then again. we were debating weather it was a huge craft with sequential lights or a very fast single craft that was blinking on and off. they lit sequentially from left to right. It was not a string of lights as before. It came from the area and direction of travel as the other craft. I viewed other planes come and go from mccarran. The lights suddenly stopped. I saw a helicopter near las vegas blvd, and 215 area. hover for about a minute, as if to react to the object. Then haul ass west until it disappeared over mt. charleston area. Amazing.... wish i could have filmed it. but it happened so fast and though i thought about it, my cell phone wouldn't have picked it up anyhow."],"Sighting Duration":"00:00:45","Date of the Event":"01/31/2013 07:33 UTC","Latitude":"36.116986","Summary":"a string of lights in a boomerang, then a sequential series in a different area.","Object Features":"Unknown","Date Submitted":"02/01/2013 12:44 UTC","Disposition":"Unresolved","Source":"MUFON","Tags":"City","Case Number":"45507","City":"Las Vegas","Region":"Nevada","Log Number":"US-02012013-0002","files":["/var/www/straped/mufon/html2text/45507.html.txt","/var/www/straped/mufon/org/45507.html"],"Object Flight Path":"Path with directional change","Viewing Distance":"Over One Mile","Object Shape":"Boomerang, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.116986,+-115.167716(45507)&iwloc=A&hl=en\"> mufon case (45507) map </A>","Longitude":"-115.167716","Weather Factors":"Unknown","Country":"United States","trends":["There have been 229 other sightings in Las Vegas","There was one other sighting in Las Vegas on or around January 31st 2013"]}