{"Viewing Distance":"Unknown","Country":"Canada","Object Features":"Unknown","Source":"MUFON","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/45509.html.txt","/var/www/straped/mufon/org/45509.html"],"City":"Gatineau","Region":"Quebec","divs":["sighting detailsi was sitting at home browsing the internet (hockey games results) on laptop. it was a windy night out and a few seconds before event, i heard louder sounds outdoors (i tought some army aircraft\\jets were circling the skies nearby) and decided to take a peak if i could see a plane. i went to the patio door and looked up in the skies. there were a few clouds but i could see multiples stars. i then noticed one star that was shining a little bit more and focussed on it. after a very brief moment (maybe one second) the star that was still suddenly moved at very high speed towards west. gave me the goosebumps... i also realized that the \"noises\" were not there anymore. not sure at what moment they stopped. and i figured it could have been the high winds. i went to other windows to try and see it again but it was gone. i looked back a few times during the rest of the evening but saw nothing else. i wondered a bit about what had just happened and if i relly saw what i think i did. i also tought that i could have had an hallucination... still, just thinking about it now, it gives me the goosebumps again."],"Latitude":"45.476545","Longitude":"-75.701272","Weather Factors":"Unknown","Log Number":"CA-02012013-0004","Disposition":"Unresolved","Object Flight Path":"Stationary,Straight-line path","Summary":"Star-like object was still and suddenly speeded up in straight line towards west and vanished","trends":["There have been 3 other sightings in Gatineau","There were no other sightings in Gatineau on or around January 31st 2013"],"Case Number":"45509","Sighting Duration":"Undisclosed","Date Submitted":"02/01/2013 09:53 UTC","Date of the Event":"01/31/2013 08:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.476545,+-75.701272(45509)&iwloc=A&hl=en\"> mufon case (45509) map </A>","Tags":"City"}