{"Source":"MUFON","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.456927,+-112.069567(45503)&iwloc=A&hl=en\"> mufon case (45503) map </A>","Weather Factors":"Unknown","City":"Phoenix","Country":"United States","Latitude":"33.456927","Tags":"City","Longitude":"-112.069567","Viewing Distance":"Unknown","Case Number":"45503","Date of the Event":"01/21/2013 12:40 UTC","trends":["There have been 417 other sightings in Phoenix","There were 2 other sightings in Phoenix on or around January 21st 2013"],"Object Flight Path":"Stationary","Disposition":"Unresolved","Date Submitted":"01/31/2013 11:40 UTC","files":["/var/www/straped/mufon/html2text/45503.html.txt","/var/www/straped/mufon/org/45503.html"],"Region":"Arizona","Object Shape":"Other","divs":["Sighting DetailsHave mentioned in a previous report how I've been seeing white orb UFOs in this area for about two years at least. I've seen white orbs at lower altitudes on a couple of occassions. In one case it was like looking at the ball from the top of a large flagpole, sitting stationary above me. Most often I would see these things parked in the sky at a very high altitude, where they would resemble Venus in the morning or early evening sky, yet I was seeing them at midday or during the afternoon. Well I have now seen something new at the same sort of high altitude as the white orbs, on two occassions. The first was sometime during the holiday stretch, after Christmas or New Years, don't remember when exactly. It was a day when we had lacey or gauzey like cloud cover, and I noticed what looked like a stubby grain of rice among the clouds. After it initially caught my attention, I allowed that it might just be a cloud fragment, so I waited to see if it would dissipate or merge with the surrounding cloud cover. That didn't happen. This grain of rice looking thing maintained its unique shape apart and distictive from the rest of the clouds drifting by an morphing around it. This thing was solid. My second sighting of this category happened on Jan 21st, MLK day 2013. There was no cloud cover at all on this day. The sky was clear blue, and sitting there parked in the sky was another stubby little grain of rice once again. I spotted it during the last few minutes of my lunch break, around 12:30 to 12:40PM, while outside having a smoke. Imagine having a single grain of rice in your open palm, and giving it an underhand toss onto the asphalt parking lot about 5 to 6 feet ahead of you. Now imagine trying to zero in on the rice grain and getting a visual lock on it. That's what finding this thing in the sky was like, both with locating it and with monitoring its position."],"Summary":"Sationary elongated craft at normal white orb type altitude","Object Features":"Unknown","Log Number":"US-01312013-0011"}