{"Object Flight Path":"Path with directional change","divs":["Sighting DetailsAt 7:40 pm I was walking my dog in the courtyard of my apartment complex. I looked up at the sky and was thinking that the stars looked especially bright tonight...I saw what appeared to be a low moving very small cloud with no distinct shape. I looked back down at my dog and then up again and I realized that it was no cloud (the sky is completely clear tonight). By the time I looked back up the object was almost directly overhead and I saw that it had morphed into a distinct large boomerang shape. It seemed as if it were trying to camouflage itself as a cloud but it had lights outlining it. The object was low flying and was large...it made absolutely no noise and was fairly slow moving. I was shocked at first, and I began to feel very uneasy and frightened. The object flew overhead and I watched it for a few more seconds before I became even more uneasy and hurriedly rushed my dog back into my apartment. My dog did not seem to notice the object, she was not acting strange. I felt much more relaxed when I got back inside of my apartment....it was an eerie experience, I have never seen anything like it before in my life."],"trends":["There have been 4 other sightings in Greenville","There were no other sightings in Greenville on or around January 31st 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.365678,+-91.056216(45500)&iwloc=A&hl=en\"> mufon case (45500) map </A>","Object Shape":"Boomerang, Triangle","Date of the Event":"01/31/2013 07:40 UTC","Summary":"It was completely silent and slow moving, it was boomerang shaped with an outline of lights. It seemed like it was trying to camouflage itself.","files":["/var/www/straped/mufon/html2text/45500.html.txt","/var/www/straped/mufon/org/45500.html"],"Tags":"City","Latitude":"33.365678","Source":"MUFON","City":"Greenville","Date Submitted":"01/31/2013 10:39 UTC","Longitude":"-91.056216","Object Features":"Unknown","Weather Factors":"Unknown","Log Number":"US-01312013-0008","Country":"United States","Viewing Distance":"101-500 Feet","Sighting Duration":"00:03:00","Disposition":"Unresolved","Region":"Mississippi","Case Number":"45500"}