{"divs":["sighting detailswhen the power went off, i and my friend moved to the balcony of my home, when i noticed an usual object at the horizon. the background was pitch black and since the object was exteremly glowing orange it immediately grab my attention.i took out my mobile camera and rushed to the terrace. i managed to take a couple of pics and suddenly it disappeared into thin air. i asked my friend to take his digital camera hoping to capture the object on tape if it ever appeared. after a few minutes say 2-4 minute object reappeared. it was a clear sky and on the background i could see the stars but this object was atleast 5-6 times brighter and 1\\4 size of the moon. i am a star gazer and i could easily identify the planet venus, jupiter the star sirius. it was much much larger and emitted a glowing orange color , disappearing and appearing at will. it was visible at the eastern horizon for more than a minute. it appeared to be hovering really low,(40-30 degree los) the object was atleast 3 miles from were we stood. it appeared to change direction and path in an instant. it then flickered and vanished into thin air. we scanned the area for atleast 30 minute and even in clear sky the object was no where to be seen again. note : birds were unusally making a lot of noises at that time of the day, when we spotted the object"],"City":"Kochi","Weather Factors":"Unknown","Case Number":"45504","Date Submitted":"01/31/2013 11:48 UTC","trends":["There have been 2 other sightings in Kochi","There were no other sightings in Kochi on or around January 31st 2013"],"Summary":"Extremely orange glowing object which appeared and disappeared at will, hovering above wihout making a slightest of noise..Causing power outages in the area.","Source":"MUFON","Disposition":"Unresolved","Object Features":"Unknown","Sighting Duration":"00:02:00","Log Number":"IN-01312013-0012","files":["/var/www/straped/mufon/html2text/45504.html.txt","/var/www/straped/mufon/org/45504.html"],"Latitude":"9.940463","Region":"Kerala","Viewing Distance":"Over One Mile","Object Shape":"Fireball","map":"<A HREF = \"http://maps.google.com/maps?q=9.940463,+76.276604(45504)&iwloc=A&hl=en\"> mufon case (45504) map </A>","Tags":"City","Date of the Event":"01/31/2013 07:45 UTC","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Country":"India","Longitude":"76.276604"}