{"Source":"MUFON","divs":["Sighting DetailsSAW WHITE LIGHT COMMING THROUGH WINDOW, TO MY RIGHT.COMPLEATLY ILLUMINATING ROOM, THEN CHANGED TO SOLID RED, SAT UP IN BED, THEN THE ROOM CHANGED ATMOSPHERE.LIKE A HEAVY MAGNETIC FIELD. LOOKED OVER AT MY DOOR THAT WAS SHUT,SLOWLY IT OPENED. THERE THERE WERE 3 SMALL GREY ALIENS. THE FIRST TWO WERE IN FRONT OF THE THIRD. THE THIRD ALIEN WAS A LITTLE TALLER. I GOT THE IMPRESSION IT WAS FEMALE AND THE DOCTOR.I WASENT SCARED,I KNEW ABOUT ALIENS AT THE TIME.THEY KIND OF FLOATED WAYVING THERE HANDS.NEXT I WAS FLOATING ON MY BACK PAST MY PARENTS DOOR, ITRIED TO SCREAM OUT TO MY PARENTS BUT TIME WAS FROZEN. I REMEMBER FLOATING THROUGH THE WINDOW OF DOOR TOWARDS THE WOODS BEHIND MY HOUSE. THE CRAFT WAS MAYBE 100FT BEHIND MY HOUSE. IT HAD MOVED FROM OUTSIDE MY BEDROOM WINDOW TO THE WOODS. THE ALIENS WERE VERY NICE . THE DOCTOR ALIEN SAID DONT BE AFRAID, TELEPATHY.THEY USED THERE HANDS TO COMMUNICATE TO EACH OTHER. I CANT REMEMBER ANYTHING AFTER THAT.. THEY DID LEAVE A IMPLANT IN MY LEFT HAND JUST UNDER THE SKIN NEAR MY THUMB. IT TOOK ME 30 YEARS TO REMEMBER THIS ABDUCTION.ONE DAY I LOOKED AT THE IMPLANT IN MY PALM AND SAID TO MYSELF \"THOSE DAMM ALIENS \" AND GOT A RAIZOR BLADE AND CUT IT OUT. IT WAS TRIANGULAR, THE SIZE OF A SAND CRYSTAL. TI WAS A STRANGE MATERIAL LIKE LAVA ROCK.I KEPT IT AROUND FOR A WHILE THEN REALIZED THEY COULD TRACK ME. AND PUT IT IN THE GARBAGE, THAT WAS STUPID, THIS WAS TEN YEARS AGO.I DONT THINK THEY HAVE BEED BACK SINCE."],"Summary":"ABDUCTION / ME","City":"Westhampton","Sighting Duration":"00:59:00","Date Submitted":"02/01/2013 10:25 UTC","Log Number":"US-02012013-0013","Tags":"City","Viewing Distance":"21-100 Feet","Object Features":"None","trends":["There have been no other sightings in Westhampton","This sighting has been favorited 1 time."],"Object Flight Path":"Stationary","Case Number":"45518","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=40.819659,+-72.654039(45518)&iwloc=A&hl=en\"> mufon case (45518) map </A>","Region":"New York","files":["/var/www/straped/mufon/html2text/45518.html.txt","/var/www/straped/mufon/org/45518.html"],"Object Shape":"Other, Unknown","Weather Factors":"Unknown","Longitude":"-72.654039","Date of the Event":"05/28/1976 02:01 UTC","Country":"United States","Latitude":"40.819659"}