{"Date of the Event":"02/02/2013 11:55 UTC","Log Number":"AU-02012013-0012","Longitude":"153.395104","City":"Russell Island","Region":"Queensland","Country":"Australia","Summary":"Observed a white sphere shaped craft flying for 6 seconds against blue sky then winked out, then reappeared higher and disappeared again","trends":["There have been no other sightings in Russell Island","This sighting has never been favorited."],"Object Features":"None","Tags":"City","files":["/var/www/straped/mufon/html2text/45517.html.txt","/var/www/straped/mufon/org/45517.html"],"Object Flight Path":"Straight-line path","Object Shape":"Sphere","Latitude":"-27.711866","Viewing Distance":"Over One Mile","Sighting Duration":"00:12:00","Weather Factors":"Unknown","Source":"MUFON","divs":["Sighting DetailsI was standing on my front verandah having a coffee & cigarette at 11:55am local Queensland time on Saturday the 2 of Feb 2013 on Russell Island looking east towards North Stradbroke Island I was thinking what a beautiful day it was after some very heavy weather when I noticed a white 'craft' moving very slowly in a south - north direction. It just appeared. I observed it for about 6 seconds, flying dead straight, when it just winked out. I thought 'What the hell?' It was flying against a very clear blue sky, with white clouds way above it so I know it didn't just fly into clouds and disappear. I watched the same patch of sky for another 5 to 10 minutes when it re-appeared. This time it was above the flight path it had taken and further south but still flying at the same speed and in the same direction, again for about 6 seconds, but just before it winked out it seemed to 'bank' in a left direction. It appeared slightly larger. Then once again it simply disappeared against a very blue sky. Then about 10 minutes later a helicopter appeared flying from the general area of the craft over North Stradbroke Island from east to west straight over my house. I stood on the verandah for another half hour but observed nothing else. I first noticed it because it seemed to just appear out of thin air. I was looking at the right spot at the right time. Pure chance. When I first noticed it I thought it was an airplane. Even though it had been clear sky I thought it might have come down through the clouds but when it just suddenly disappeared twice I knew it was not 'normal.' Was it a UFO? Yes. Was it a man made UFO, perhaps."],"map":"<A HREF = \"http://maps.google.com/maps?q=-27.711866,+153.395104(45517)&iwloc=A&hl=en\"> mufon case (45517) map </A>","Case Number":"45517","Date Submitted":"02/01/2013 10:01 UTC","Disposition":"Unresolved"}