{"Viewing Distance":"Over One Mile","Sighting Duration":"01:12:00","Latitude":"36.207139","Country":"United States","divs":["Sighting DetailsI was letting the dogs outside because they were freaking out, I thought they just had to \"go.\" I lit a cigarette and some lights caught my attention over by the AFB. I live directly across from the base, so I'm used to hearing aircraft and seeing all sorts of planes. It dawned on me that there's no noise except a very low hum. Since the base has Sunrise Mountain on the other side, they normally don't fly that direction either. There was one bright circular object with numerous smaller ones lining up to it, then they would separate, \"blank out,\" get back into formation and do it all again. Some would take off directly toward the mountain. I only had the view from my back porch between homes, but I grabbed my camera and took several videos. Unfortunately, I'm yelling at the dogs to stop barking and the cat to stay in the house through all of them. It was around 10 pm and living so close to the base, I know they don't do practice runs that late at night...and there is ALWAYS sound. I asked my husband to look up if something was going on and our Clear internet was down. I had to come back inside because the animals were just going too crazy and I didn't want to disturb our neighbors, that is when I lost sight of the objects. On a side note, my family and I have been hearing a very low hum for weeks now everywhere we go in Las Vegas. Also, the lights seemed to have been very far away, and I doubt any half witted jet pilot would fly that close to a mountain."],"Tags":"City","Log Number":"US-02012013-0011","Longitude":"-115.074289","Source":"MUFON","Summary":"Glowing lights north of Nellis AFB","Object Features":"Unknown","Weather Factors":"Unknown","Date of the Event":"01/30/2013 10:15 UTC","Object Shape":"Circle, Fireball","Case Number":"45516","Date Submitted":"02/01/2013 07:53 UTC","Region":"Nevada","Disposition":"Unresolved","trends":["There have been 229 other sightings in Las Vegas","There was one other sighting in Las Vegas on or around January 30th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.207139,+-115.074289(45516)&iwloc=A&hl=en\"> mufon case (45516) map </A>","Object Flight Path":"Path with directional change,Path then hovering","City":"Las Vegas","files":["/var/www/straped/mufon/html2text/45516.html.txt","/var/www/straped/mufon/org/45516.html"]}