{"Object Features":"Other","Object Shape":"Cigar","Summary":"I saw a cigar shaped object take off and change into a pink cloud","map":"<A HREF = \"http://maps.google.com/maps?q=47.516975,+-122.30093(45529)&iwloc=A&hl=en\"> mufon case (45529) map </A>","Object Flight Path":"Straight-line path","Country":"United States","Source":"MUFON","City":"Seattle","Log Number":"US-02022013-0009","Latitude":"47.516975","Date of the Event":"06/26/1962 07:05 UTC","Case Number":"45529","files":["/var/www/straped/mufon/html2text/45529.html.txt","/var/www/straped/mufon/org/45529.html"],"Sighting Duration":"Undisclosed","Longitude":"-122.30093","Region":"Washington","Date Submitted":"02/02/2013 02:18 UTC","Weather Factors":"Unknown","Disposition":"Unresolved","Viewing Distance":"21-100 Feet","divs":["Sighting DetailsI awoke in my bed and began to open my window shades. The 1st one I opened did not reveal the craft. I opened the 2nd shade and saw a glowing cigar shaped object across the street in the power line field. I was scared and got on the floor and peered over my bed. For some reason I was affraid to move even tho my bedroom door was a few feet behind me . I thought I would be zaped or something. It than began to rise with no sound still amiting the firery aura around it. I watched it go up into a SE direction toward Renton and Lake Washington. As it rose higher into the sky I got up off my knees and went to the window and watched it change into a pnk cloud and then blended into the sky. My mother did not believe me (I was almost 8). She finially did and called a local radio station. They directed her to the local air force base. This would be McCoard Air Force Base near Tacoma. Some men in uniform came to my home and asked me a lot of questions and had me color a picture of the object . Then they carried me into the field. They had machines that they ran over the ground something like a meatal detector. The ground was 3ft hight feild grass was smashed in a big circle, about 15 Ft in diamitor. They asked how big it was. I told them it was about 3 or 4 car lenghts long. They used the cars on the highway for a mesurment i could realte to. My Neighbor came over and wanted to know what was going on. My mother told her that I thought I saw something. She said she saw it too. She saw it land about 4am in the morning. The Airforce guys talked to her and told us something was there, they do not know what but was there for a few hours. They left and the sighting never left me. I knew as a little girl we were not alone and instilled a faith in me of a higher enity. I tried to contact MAFB as an adult and they shut me down and said thye do not keep record of things of this type. I know they do and still have my drawing."],"Tags":"City","trends":["There have been 110 other sightings in Seattle","There were no other sightings in Seattle on or around June 26th 1962"]}