{"Sighting Duration":"Undisclosed","Latitude":"38.312194","Log Number":"US-02022013-0001","Weather Factors":"Unknown","Region":"Virginia","Country":"United States","City":"Fredericksburg","Date of the Event":"02/01/2013 11:30 UTC","Source":"MUFON","divs":["Sighting DetailsAt 11:30 pm February 1st I was sitting on the couch in my living room watching tv. I glanced out the window and saw what I thought was a plane with white lights on above the tree line which is normal. All of the sudden the white lights turned orange like the plane went up in flames. I first thought a plane was on fire when all of the sudden the orange ball took on a perfect round shape. It increased in size dramatically and then started moving around back and forth up and down the movements of this orange ball were so quick and crazy. As I watched this orange ball emitted three smaller orange balls. I also tried to take pictures but it was like my phone was frozen or locked up. I also have a time discrepancy I thought I was only watching it for two or three mins but based on a pre recorded show I was watching I may have been watching it for fifteen to twenty mins but I can't account for those. I am still really scared as this just happened I also had pressure in my ears which is so strange. I lost sight of the object when I went to wake a family member up. When I got back with her it was gone."],"Object Shape":"Fireball, Sphere","Case Number":"45520","files":["/var/www/straped/mufon/html2text/45520.html.txt","/var/www/straped/mufon/org/45520.html"],"Object Features":"None","Disposition":"Unresolved","Date Submitted":"02/02/2013 12:09 UTC","Longitude":"-77.45866","Object Flight Path":"Other","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 17 other sightings in Fredericksburg","There were no other sightings in Fredericksburg on or around February 1st 2013"],"Tags":"City","Summary":"Huge flaming erratic fireball in sky","map":"<A HREF = \"http://maps.google.com/maps?q=38.312194,+-77.45866(45520)&iwloc=A&hl=en\"> mufon case (45520) map </A>"}