{"Disposition":"Unresolved","Region":"Texas","Summary":"Three orange orbs hovering and moving for approximately 30 minutes","City":"Frisco","Case Number":"45530","Weather Factors":"Unknown","Object Shape":"Circle, Fireball","Viewing Distance":"Unknown","Longitude":"-96.818272","Source":"MUFON","Tags":"City","Log Number":"US-02022013-0010","Object Features":"Unknown","trends":["There have been 17 other sightings in Frisco","There were no other sightings in Frisco on or around February 1st 2013","This sighting has been favorited 1 time.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=33.157534,+-96.818272(45530)&iwloc=A&hl=en\"> mufon case (45530) map </A>","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path","divs":["sighting detailsat approximately 7:30pm, i went out to my backyard to talk on the phone. when i looked to south, toward dallas, i saw a bright orange light just above the rooflines\\treeline. as we are on the flightpaths for both dfw and dallas love airports, i thought it was a plane taking off from love. over the next 30 minutes, it would periodically brighten, then dim. it would also ascend, then descend below the rooflines of our subdivision, then ascend again. at its brightest, it was about a half inch in diameter, from my point of view. after 10 minutes, i got my binoculars, and that's when i noticed two other orange orbs that weren't as bright and large as the first. they were also ascending and descending periodically, along with slow lateral movements. i asked my husband to look at them through the binoculars, and confirm that they weren't helicopters. there was no sound, other than when a plane would cross overhead for one of the airports. after 20 minutes, i got my camera, a sony nex-5, and set the shutter speed for 1\\25sec, since i didn't want to take the time to set up a tripod. after taking a series of photos, the two dimmer orbs faded out, and the larger orb dimmed significantly, then headed east on a straight line flight path until it disappeared at approximately 8pm."],"Date of the Event":"02/01/2013 07:30 UTC","Date Submitted":"02/02/2013 02:32 UTC","files":["/var/www/straped/mufon/html2text/45530.html.txt","/var/www/straped/mufon/more/45530_submitter_file1__UFO2.01.20132.jpg","/var/www/straped/mufon/more/45530_submitter_file2__UFO2.01.2013.jpg","/var/www/straped/mufon/more/45530_submitter_file3__UFO2.01.2013zoom.jpg","/var/www/straped/mufon/more/45530_submitter_file4__UFO2.01.2013zoom2.jpg","/var/www/straped/mufon/org/45530.html"],"Latitude":"33.157534","Country":"United States"}