{"Weather Factors":"Unknown","Country":"United States","divs":["Sighting DetailsI was out for a nightly walk Off to the left in the sky I noticed this bright red-orange ball rising in the east and then I watched it fly over head, you thought maybe a plane was on fire. I watched it move to the west and then could no longer see it, but as I kept walking SE it appeared to circle around and be heading back. I then noticed 3 - 4 more follow similar paths and then at one time I could see 1 - 2 in the distance circling around I initially thought this must be some sort of plane lights reflecting, but after seeing the first one fly over head, the intensity of the bright red-orange object, this was unlike anything I had ever seen I continued to walk, stop and turn around, cars driving in the area probably wondered what I was looking at in the sky all around me. I aborted my walk earlier than normal to tell my wife of the sighting and we looked out the windows upon arriving home, but could not see anything in the sky I came home to check if others may have reported seeing anything in the Houston skies, but did see others talk about what the FAA was saying were meteorites earlier in the week in OK and TX I would think meteorites would follow a path and then disappear, whereas these objects seemed to disappear in the distance and then you could see them re-emerge and circle back around."],"Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Features":"None","Object Shape":"Circle, Fireball","Longitude":"-95.613725","Case Number":"45536","Tags":"City","City":"Tomball","trends":["There have been 8 other sightings in Tomball","There were 2 other sightings in Tomball on or around February 2nd 2013"],"Log Number":"US-02022013-0014","Source":"MUFON","Summary":"4 to 5 objects, randomly spread out over time, bright ball of fire , east to west and then appeared to circle aournd","map":"<A HREF = \"http://maps.google.com/maps?q=30.102482,+-95.613725(45536)&iwloc=A&hl=en\"> mufon case (45536) map </A>","Latitude":"30.102482","Viewing Distance":"Over One Mile","Date Submitted":"02/02/2013 10:30 UTC","Date of the Event":"02/02/2013 08:00 UTC","files":["/var/www/straped/mufon/html2text/45536.html.txt","/var/www/straped/mufon/org/45536.html"],"Region":"Texas"}