{"Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Source":"MUFON","Longitude":"-97.733616","Tags":"City","Summary":"Star-like but moving across the sky then stopping now swinging back and forth","trends":["There have been 188 other sightings in Austin","There were 2 other sightings in Austin on or around February 2nd 2013"],"Country":"United States","Date of the Event":"02/02/2013 07:20 UTC","files":["/var/www/straped/mufon/html2text/45535.html.txt","/var/www/straped/mufon/org/45535.html"],"divs":["Sighting DetailsIf anyone were to look up and glance at it they'd think it's just another star, but while I was out walking my dogs I looked up and saw the star-like thing moving from south toward north and flashing irregularly. For a couple seconds I thought it was an airplane at high altitude but the strobing is irregular, not like an airplane strobe at all. The colors are irregular, it flashes orange then orangy-gold, occasionally yellow and there was one - only one - large bright flash of red. The object moved past us overhead and then stopped, started moving in an irregular pattern but always near the same spot - forward, backward, right and left, stop then start - very irregular, it doesn't look like the movements of an airplane, helicopter or balloon. It now has finally calmed down, has been near the same spot over an hour but it's swinging back and forth at an irregular rate. I sat in a chair to steady myself while looking up just in case I was moving and not the object - and I also got under a tree branch as a stationary point of reference to make sure it really is moving. There's almost no wind tonight, the tree is still but the object comes out from behind the branch. I'm not moving and the tree isn't moving. I also did the same experiment using the apex of our roof - the roof isn't moving but the object is, but now very subtly. In spite of all this it has now been there so long I'm starting to wonder if maybe it is a star, like I've made some kind of mistake. I don't know what to think. It's almost like it's trying to look like a star as in hiding in plain sight. Hour and 40 minutes and it's still out there. At one point I told my housemate about it, he came outside and confirmed it's moving."],"Date Submitted":"02/02/2013 09:37 UTC","Object Features":"Unknown","Sighting Duration":"01:40:00","Disposition":"Unresolved","Object Shape":"Star-like","Weather Factors":"Unknown","Viewing Distance":"N/A","Region":"Texas","Latitude":"30.436451","map":"<A HREF = \"http://maps.google.com/maps?q=30.436451,+-97.733616(45535)&iwloc=A&hl=en\"> mufon case (45535) map </A>","Case Number":"45535","City":"Austin","Log Number":"US-02022013-0015"}