{"map":"<A HREF = \"http://maps.google.com/maps?q=30.275893,+-97.734051(45543)&iwloc=A&hl=en\"> mufon case (45543) map </A>","Latitude":"30.275893","Sighting Duration":"00:03:00","Disposition":"Unresolved","City":"Austin","Longitude":"-97.734051","Summary":"Flashing blue'ish light traveled short distance across sky before disappearing from odd flight path.","Object Features":"Unknown","Tags":"City","Viewing Distance":"Over 1 Mile, Unknown","trends":["There have been 188 other sightings in Austin","There were 2 other sightings in Austin on or around February 1st 2013"],"Case Number":"45543","Object Flight Path":"Path with directional change","Region":"Texas","Source":"MUFON","Weather Factors":"Unknown","Country":"United States","Log Number":"US-02032013-0005","files":["/var/www/straped/mufon/html2text/45543.html.txt","/var/www/straped/mufon/org/45543.html"],"Date Submitted":"02/03/2013 01:43 UTC","Object Shape":"Flash, Star-like, Unknown","divs":["Sighting DetailsI thought I was seeing a plane at first, flashing one light at intervals as it moved across the sky. However, it seemed far too high for the light to be so visible and bright, satellites are usually the size of a star. The light was more of a blue color as well. A plane at that height as close to the airport as I am seems odd. I can usually watch a plane streak all the way across the sky for miles. In this case, it only traveled a short distance before it was no longer visible. Its path also seemed to curve oddly and the only way I could track it was by it's flashes which were at least 15-20 sec apart (this is not exact as I did not actually calculate), much slower than a normal commercial liner as I did not see any physical trace other than the flash of the light. Sky had no clouds, time between 11:30pm-12:00am CST facing south, mild winds ~50 degrees Fahrenheit as high as orion. I only noticed because I was starring at the sky and noticed a flash in the corner of my eye just east of orion which one could only observe if they were literally starring at that part of the sky for some time."],"Date of the Event":"02/01/2013 12:00 UTC"}