{"trends":["There have been 39 other sightings in Sarasota","There were no other sightings in Sarasota on or around February 1st 2013"],"Case Number":"45545","Longitude":"-82.521897","map":"<A HREF = \"http://maps.google.com/maps?q=27.316432,+-82.521897(45545)&iwloc=A&hl=en\"> mufon case (45545) map </A>","Date Submitted":"02/03/2013 02:14 UTC","City":"Sarasota","Summary":"Two fiery orbs changing colors","Object Shape":"Sphere","Latitude":"27.316432","Viewing Distance":"Unknown","Log Number":"US-02032013-0007","Tags":"City","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/45545.html.txt","/var/www/straped/mufon/org/45545.html"],"Source":"MUFON","Date of the Event":"02/01/2013 08:25 UTC","Country":"United States","Object Flight Path":"Stationary","divs":["sighting details i was returning to my truck parked on hyde park st. when i noticed two bright lights in the sky. what immediately struck me as different was the orange reddish color and the size. the color was not what i would expect from aircraft of any kind. there was no strobe type light.the size of the light was also inconsistent with known aircraft nav lights, being approx 10 time the diameter. the orbs appeared to hover, moving extremely slowly in a slight circular motion and changed color from orange \\ reddish to a deep ruby red. the overall appearance was more like a burning ember in a fire. there were three of us observing the event when a passing motorist slowed and called out \" hey, what the heck is that\". he stopped and joined the group. thought none of us are pilots, two have spent time in private planes and one hs spent time offshore in boats. we feel comfortable saying that these lights are unlike any navigation light. living near military bases in nc, i have observed numerous parachute flares .these objects did not descend or give off as much light as a flare nor was there a smoke plume as i have seen previously. after several minutes one object began to fade and disappeared. about 30 seconds later the other did the same."],"Disposition":"Unresolved","Object Features":"Unknown","Sighting Duration":"Undisclosed","Region":"Florida"}