{"Region":"California","Sighting Duration":"Undisclosed","Date of the Event":"02/03/2013 02:10 UTC","Case Number":"45541","Log Number":"US-02032013-0003","Date Submitted":"02/03/2013 08:45 UTC","Source":"MUFON","Country":"United States","Disposition":"Unresolved","Longitude":"-117.872361","City":"Santa Ana","Object Features":"None","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/45541.html.txt","/var/www/straped/mufon/org/45541.html"],"divs":["sighting detailsi am a deputy sheriff at the john wayne airport. at the listed date\\time i was patrolling the area of operation (runway) and parked. i noticed an orange orb emitting a fairly intense light. i called the control center (dispatch) and they also saw the object. the object was at a 30 degree angle from me directly west of the airport over the city of costa mesa. the object stayed stationary for about 20-30 minutes. while watching the object with binoculars i noticed it was slowly dropping elevation. the object could be seen between two tall buildings and i estimated the distance to be about one mile. the orb had no blinking lights. there were several aircraft on the long beach airport flight path at different distances that i could clearly see their beacons (1 mile to 5 miles from my location). there was also a police helicopter that i could see southwest of my location and it too was clearly recognizable. this object dropped to a 20 degree angle from me and went out (for lack of a better term). within about one second i could see the object still west of me but it was dimmer and appeared to be 1\\10th the original size. it also appeared to be farther out."],"trends":["There have been 17 other sightings in Santa Ana","There was one other sighting in Santa Ana on or around February 3rd 2013"],"Latitude":"33.70224","Weather Factors":"Unknown","Tags":"City","Object Flight Path":"Stationary,Other","map":"<A HREF = \"http://maps.google.com/maps?q=33.70224,+-117.872361(45541)&iwloc=A&hl=en\"> mufon case (45541) map </A>","Summary":"ORANGE ORB HOVERED WEST OF JOHN WAYNE AIRPORT","Viewing Distance":"501 Feet - 1 Mile"}