{"Object Shape":"Circle, Cylinder, Sphere","Disposition":"Unresolved","trends":["There have been 17 other sightings in Santa Ana","There was one other sighting in Santa Ana on or around February 2nd 2013"],"Date of the Event":"02/02/2013 02:50 UTC","Region":"California","Tags":"City","City":"Santa Ana","Latitude":"33.723884","Weather Factors":"Unknown","Date Submitted":"02/03/2013 02:33 UTC","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Summary":"Viewed an object with a smaller object glide accross the sky together to meet up with a third and form triangle shapes","Sighting Duration":"Undisclosed","Country":"United States","Case Number":"45546","Log Number":"US-02032013-0008","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.723884,+-117.880225(45546)&iwloc=A&hl=en\"> mufon case (45546) map </A>","files":["/var/www/straped/mufon/html2text/45546.html.txt","/var/www/straped/mufon/org/45546.html"],"Object Flight Path":"Path with directional change,Path then hovering,Other","divs":["Sighting DetailsI was in my room at the time sitting at my computer. It was about 2:50PM when I looked out my window and saw the object. It took me a second to figure out what I was looking at. I live very close to John Wayne airport so seeing planes and helicopters is nothing new. This object was different so I took my phone and went into my backyard. The sky was very overcast with a nice cloud cover. The cloud cover almost made it the object easier to see. it was off to the east toward Tustin and was accompanied by a smaller second craft that would follow the bigger one. The two objects slowly glided across the sky toward the north direction toward orange. The larger object looked as if it had something orbiting it or it was changing its shape. I watched this glide for about 20 minutes when a third object about the same size as the smaller one showed up. The three objects hovered there for a minute and the smaller crafts looked to be gaining altitude and lowering altitude to make patterns. They were making triangle patterns. I have always been a believer but this was something to see. I was so upset my camera was not good enough to get any pictures but after this I will be out to get one for the next time! The objects stayed in the triangle formations for about 15 minutes then one by one they looked to gain altitude till I could no longer see them."],"Longitude":"-117.880225"}