{"trends":["There have been 3 other sightings in Winter Springs","There were no other sightings in Winter Springs on or around February 2nd 2013"],"Log Number":"US-02032013-0012","Case Number":"45550","Sighting Duration":"Undisclosed","Region":"Florida","Weather Factors":"Unknown","Object Flight Path":"Hovering then path","Date Submitted":"02/03/2013 04:45 UTC","Source":"MUFON","Disposition":"Unresolved","City":"Winter Springs","map":"<A HREF = \"http://maps.google.com/maps?q=28.649261,+-81.275652(45550)&iwloc=A&hl=en\"> mufon case (45550) map </A>","Country":"United States","Latitude":"28.649261","Summary":"8-10 star like objects slowly moving in a slight coordination.","divs":["Sighting DetailsPulling into my parking spot at the apartments I noticed in the corner of my eye an odd colored constellation and I thought it was weird that the stars were that bright from that angle, so close to the glow on the horizon. I got the car parked and had to jog over to the building next to mine for a view through the trees. I tried to get a picture or video from my phone but I couldn't get anything to show up or come into focus. At that time I started to call my friend and focus on the objects. The lowest object was maybe at 10 or 15 degrees above the horizon and the highest object was about 30 degrees or so. There was about six to ten of them but I want to say eight objects. They seemed to stay in a zigzag kind of stacked pattern but the individual objects were moving slowly one way and then would slowly move the other way. They were a bright orange yellowish color, nothing like any stars in the sky. They seemed like they may have been circling each other but they were moving slow and disappeared in less than a minute and was hard to make since of any pattern of the motion but it was impressive to see them changing direction. I work in the aviation industry and have a good idea of how aircraft traffic patterns and flight paths work and are run, especially in my area. I kept looking for strobes or beacon lights but saw none. There are no air force bases close to my area and any major airports are in the opposite direction. There is a flight path near this area but nothing to the north, any commercial aircraft always come from the east, and this was directly north. After maybe thirty seconds to almost a minute the moving lights started to fade out. They did not fly away or continue on any path, they just started to fade out from the middle of the formation out. The last objects to fade out were the top and the second from the bottom object. This was my first time seeing anything like this. I've seem objects that I thought were odd but I've always been able to notice strobes or some characteristic that gives it away to be an aircraft or blimp. This was very cool and I was a bit mad I couldn't get my phone to focus. It was interesting to see them move, very graceful. They were pretty bright and not quite orange and not quite red, there was no flicker but maybe a very slight pulse. Never seen anything like this in my life, always thought I would only see something like this on tv."],"files":["/var/www/straped/mufon/html2text/45550.html.txt","/var/www/straped/mufon/org/45550.html"],"Viewing Distance":"Unknown","Object Shape":"Sphere, Star-like","Object Features":"Unknown","Longitude":"-81.275652","Tags":"City","Date of the Event":"02/02/2013 11:33 UTC"}