{"Summary":"Two round objects in sky, outlined with light, a dot of light within each; hovered then took off really fast","Object Features":"Unknown","Region":"Florida","Country":"United States","Viewing Distance":"Unknown","Date Submitted":"02/03/2013 09:17 UTC","Longitude":"-80.167408","trends":["There have been 24 other sightings in Boca Raton","There were no other sightings in Boca Raton on or around February 3rd 2013"],"Log Number":"US-02032013-0017","Latitude":"26.368123","Object Flight Path":"Hovering then path","Tags":"City","Case Number":"45555","Date of the Event":"02/03/2013 06:04 UTC","City":"Boca Raton","Object Shape":"Circle","Weather Factors":"Unknown","Sighting Duration":"00:00:10","map":"<A HREF = \"http://maps.google.com/maps?q=26.368123,+-80.167408(45555)&iwloc=A&hl=en\"> mufon case (45555) map </A>","files":["/var/www/straped/mufon/html2text/45555.html.txt","/var/www/straped/mufon/org/45555.html"],"divs":["Sighting DetailsI was sitting in my car in the parking lot by Whole Foods Market in Boca Raton, Florida, waiting for my wife and daughter to finish shopping. Out of boredom, I started looking up at the sky, to see what the weather was going to be. It was kind of cloudy. As I'm looking up, the clouds were a little thinner and there were two round circles about the size of shirt button. There was a circle of light outlining each object, and in the center of each object, there was a light like a white dot. The objects were not moving, they just stood there, stationery, for maybe five seconds or 10 seconds. They were like two doughnuts and looked about a foot apart from my vantage point, but could have actually been as much as 1,000 feet apart. I watched them for about five or 10 seconds and suddenly they took off like a bat out of hell, from left to right, and disappeared under the clouds. This took place generally above the roof of Whole Foods Market. When the objects took off, they went north. In relation to Whole Foods Market, I was parked in the second parking space in the parking lot itself as you walk out of the store's \"exit\" door and into the parking lot. I was not parked in a handicapped spot, but the parking place was in a place you might expect to find a handicapped spot. The parking lot was very crowded, and my wife and daughter said the store was, too. I told my wife and daughter about what I had just seen as soon as they got back to the car, which was maybe two minutes after my UFO sighting. I have always wanted to see a UFO, but in all my years I never have, until this experience this evening. If you like, I can sketch a picture of what I saw."],"Source":"MUFON","Disposition":"Unresolved"}