{"Weather Factors":"Unknown","Object Features":"Window(s)","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=43.888003,+-111.834097(45558)&iwloc=A&hl=en\"> mufon case (45558) map </A>","Object Shape":"Oval","Sighting Duration":"Undisclosed","Longitude":"-111.834097","Case Number":"45558","Tags":"City","Date Submitted":"02/04/2013 12:51 UTC","Region":"Idaho","Country":"United States","trends":["There have been no other sightings in Rexburg","This sighting has never been favorited."],"Object Flight Path":"Hovering then path","Summary":"Saw two UFOs southwest of our ranch house. Through binoculars saw oval shape, with lights around middle. One appeared to be having trouble. 7 people watched it.","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsIn 1974, I was driving home from a date very late: it was 3:00 a.m. I knew I was going to be in trouble, because I was supposed to be home much earlier. Before pulling into the driveway, I turned off my car lights, and drove slowly in on the side of the house and parked my car--and went in without turning on any lights. I was hoping to just get inside and into bed without waking either of my parents or my two younger brothers or two younger sisters, and say to Mom and Dad in the morning, \"It was late; I didn't want to wake you.\" I should say here that we lived on a ranch eight miles northwest of Rexburg; our house is on a beautiful bend of the Snake River, surrounded by forest and our alfalfa and grain fields. The house is a split-level. My room was on the second level facing south; the window looked out over the forest and river south of us. I got to my room and was getting undressed--when I saw a white light above the trees to the southwest. No one lived south or southwest of us. I knew that that stationary light could not be, for instance, someone's yard light. I got my binoculars out and looked at that light--and saw a silvery disc with lights around the center. I ran at once and got my parents up and the whole family ended up following. All seven of us stood there and watched it through my window for some time, taking turns with the binoculars. I wanted to call the police and the neighbors and tell them to go out and look at this, but my father forbade me. He was the county Democratic chairman at the time, in a staunchly Republican county. \"They'll call me crazy,\" he said. Eventually, everyone went back to bed but my mother and me. I wanted to try taking pictures, but we had no film in the family camera. The disc would slowly rise up higher, then higher, then gradually sink back down and hover over the trees. it did this again and again. Mother and I watched it do this for about an hour--when a second disc came and hovered close to it. The second disc remained there 20 minutes or so. All at once, it took off straight up, and very quickly we couldn't see it anymore. The first disc followed it slowly, slowly. Eventually dawn came. Mother and I went outside and watched that first disc--now in the morning light--as it climbed up higher and higher till we couldn't see it, even with the binoculars. (Mom cooked breakfast about 9:00 a.m. -- late for a farm family. Suddenly she looked up at me and said: \"What time did you get home last night?\" I told and that I had been trying to sneak into the house without waking them. She laughed, and I didn't get into trouble.)"],"City":"Rexburg","Latitude":"43.888003","Date of the Event":"06/12/1974 12:00 UTC","files":["/var/www/straped/mufon/html2text/45558.html.txt","/var/www/straped/mufon/org/45558.html"],"Log Number":"US-02042013-0002","Source":"MUFON"}