{"Source":"MUFON","Country":"United States","Sighting Duration":"Undisclosed","Date Submitted":"02/04/2013 01:13 UTC","Longitude":"-111.916856","City":"Salt Lake City","Viewing Distance":"N/A","Object Shape":"Unknown","Object Flight Path":"N/A","Object Features":"Unknown","Disposition":"Unresolved","Latitude":"40.790441","Summary":"Abduction \"dream\" -- except for a leaf in my hand","divs":["Sighting DetailsThere is one experience I am uncertain about. I would have called it a vivid dream--except for one detail I will shortly tell you. For five years, from 2008 to 2012, I lived in a one-story house on the northwest side of Salt Lake City. Outside my bedroom window was an apricot tree. In 2010, the tree had a large crop of apricots, and I had picked them up as high as I could get. But many beautiful apricots were left on the highest branches of the tree where I couldn't reach them, even with a stepladder. I \"dreamt\" I was slowly descending down through the air toward the apricot tree and my bedroom window. I was in a fetal position, my arms wrapped around my knees. It was the bright light of morning, so I could clearly see the apricots on the high branches. They hung down below me. I descended amongst the branches and could feel them and the leaves touch me, touch my forehead. I thought: \"If I can pick one apricot, I will know this really happened.\" I tried so hard to reach out and pick one apricot, but I could barely move my arms. I woke in my bed, and thought I had dreamed it all: but my right hand was tightly closed around one leaf from the apricot tree."],"files":["/var/www/straped/mufon/html2text/45560.html.txt","/var/www/straped/mufon/org/45560.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.790441,+-111.916856(45560)&iwloc=A&hl=en\"> mufon case (45560) map </A>","trends":["There have been 73 other sightings in Salt Lake City","There were no other sightings in Salt Lake City on or around July 10th 2010"],"Weather Factors":"Unknown","Date of the Event":"07/10/2010 12:00 UTC","Tags":"City","Case Number":"45560","Log Number":"US-02042013-0004","Region":"Utah"}