{"Log Number":"US-02042013-0013","Country":"United States","City":"Carolina Beach","Region":"North Carolina","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Case Number":"45569","Date Submitted":"02/04/2013 01:16 UTC","Date of the Event":"02/04/2013 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile, Unknown","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Object Features":"None","Object Shape":"Sphere, Star-like","trends":["There have been 3 other sightings in Carolina Beach","There were no other sightings in Carolina Beach on or around February 4th 2013"],"files":["/var/www/straped/mufon/html2text/45569.html.txt","/var/www/straped/mufon/org/45569.html"],"Summary":"saw light moving low above horizon,white small but bright intensified,changed color bightened turned ,went below treeline saw pulse of light explosion 12-20 secs later redish aura","Longitude":"-77.899662","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.054758,+-77.899662(45569)&iwloc=A&hl=en\"> mufon case (45569) map </A>","Latitude":"34.054758","Tags":"City","divs":["Sighting Detailswas driving n on hwy 421 toward Wilmington from Carolina beach near golden rd. oldest son with me going to pick other son up from work . approx. 12:40 am 2 4 13 no moon yet very dark night noticed light on low horizon moving slowly west towards cape fear river .pointed out to son. phone battery dead so no pics.continued driving towards stop lights which could see the light was barely above cutting right to left across sky. was white getting brighter as cut across going wnw. turns white brighter with blue flashes inside the white. then saw orange flame like color shoot out bottom only a second till turned to north again and started going up river slightly veering toward the north. not as bright but still very noticeable . sped up as suggested by son.few seconds later saw reddish flash of light from ground and resembled a pressure wave. started to call 911 but phone dead. drove immediately to Mohican trail to loop road discussing what we saw and what to do. other son waiting outide work got in and we told him . gave us his phone. turned 180 degrees in wrong direction and caught myself speeding as other son advised not to call. figured someone saw it and called in plus if it was lost off radar they would know about it was scared and bewildered . already slept woke up did this ."]}