{"City":"Pasadena","Tags":"City","trends":["There have been 26 other sightings in Pasadena","There were no other sightings in Pasadena on or around February 2nd 2013"],"Source":"MUFON","Latitude":"34.149425","Region":"California","Log Number":"US-02042013-0006","divs":["Sighting DetailsI was having a conversation with my wife on our patio in Pasadena, CA. I saw a light in the western sky that I assumed was a plane. After a few minutes it had moved, but it wasn't moving in a straight line, and it didn't seem like a plane shape. It looked round, and the altitude it was flying at made it look strange to me. Once I could see it through our trees, I videotaped it. It is very bright, and very high, and it was, for lack of a better term, \"wobbling\". My wife was a bit less freaked out than I was. I am still pretty startled. I really wanted something to happen that assured me it was just a plane, but it was moving too strangely. It made no sound, and it was very high, and moving in a sporadic way - which was much too quick for a plane. Also, though it was generally moving west to east over Pasadena, it was dipping, turning, speeding up and slowing down. It was by far the strangest thing I've seen in the sky. We do not know what it was. We stayed outside for another two hours just watching for a plane, so that we could see what one looked like on that flight path, but we didn't see one. Thanks for reading."],"Longitude":"-118.140666","Case Number":"45562","Object Features":"None","Object Shape":"Fireball","Date Submitted":"02/04/2013 02:43 UTC","Sighting Duration":"Undisclosed","Date of the Event":"02/02/2013 12:00 UTC","Weather Factors":"Unknown","Summary":"It just looked like a glowing, wobbling orb. My wife saw it also.","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=34.149425,+-118.140666(45562)&iwloc=A&hl=en\"> mufon case (45562) map </A>","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/45562.html.txt","/var/www/straped/mufon/org/45562.html"],"Disposition":"Unresolved","Country":"United States"}