{"Viewing Distance":"Over One Mile","Object Features":"Appendage(s), Wings","City":"Riverview","Region":"Florida","trends":["There have been 3 other sightings in Riverview","There were no other sightings in Riverview on or around January 31st 2013","This sighting has been favorited 2 times.",""],"divs":["Sighting DetailsI parked my car just off HWY 301 In Riverview, Florida to call on a client. I happened to look up at the sky (crystal blue, totally cloudless) and spotted what first looked like a flock of white birds or balloons, but in a very strange pattern and moving slowly and all in unison. I had binoculars in the car, and looking through these was amazed to see they were not birds or balloons but yet couldn't comprehend exactly what I was looking at. They appeared to be round white lights with a somewhat reddish tint, with 2 dark, solid triangular fixed appendages on each side. They all looked exactly the same with one or 2 drifting away at times and then a few drifting back in to join the rest. They traveled slowly in a straight path across the sky from a NE to SW direction, all maintaining approximately the same position from each other, keeping the overall pattern of the group fairly consistent. I removed the binoculars for just a few seconds to get my bearings, but when I looked back through them, they were gone. I estimate the total viewing time to be about 5 minutes. Still could not comprehend what I just saw, but realized the sight was similar to what I have seen on the History Channel that was a \"fleet\" of UFO's seen in Mexico. That is pretty much exactly what this looked like and the best way I can describe it. Thought about this sighting for days trying to rationalize it and convince myself they must have been birds, but the more I thought about it, the more confident I was that they were not.In my opinion, unidentified flying objects for sure."],"files":["/var/www/straped/mufon/html2text/45572.html.txt","/var/www/straped/mufon/more/45572_submitter_file1__drawings1.jpg","/var/www/straped/mufon/org/45572.html"],"Date Submitted":"02/04/2013 06:40 UTC","Object Flight Path":"Straight-line path","Summary":"Viewed Fleet of 20-30 UFO'S","Latitude":"27.882428","Sighting Duration":"Undisclosed","Country":"United States","Log Number":"US-02042013-0016","Case Number":"45572","Source":"MUFON","Tags":"City","Date of the Event":"01/31/2013 02:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=27.882428,+-82.326818(45572)&iwloc=A&hl=en\"> mufon case (45572) map </A>","Disposition":"Unresolved","Longitude":"-82.326818","Object Shape":"Other","Weather Factors":"Unknown"}