{"Date Submitted":"02/05/2013 10:45 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Region":"Arizona","files":["/var/www/straped/mufon/html2text/45588.html.txt","/var/www/straped/mufon/org/45588.html"],"Disposition":"Unresolved","Source":"MUFON","Object Flight Path":"Straight-line path,Path with directional change","Latitude":"34.055078","Case Number":"45588","Weather Factors":"Unknown","Summary":"It was around dinner time, we had a very unexpected monsoon storm that rolled in. I saw the craft shoot straight up to 3500 ft and blast west just in the cloud base.","divs":["Sighting DetailsThis event took place at the end of May 2012 or the beginning of June 2012. It was a very unexpected monsoon storm with violent lightning. It was Approximately 5:30pm. The sky was black. It was an incredible storm. My son and I were looking towards the east valley over towards the North Valley Mountain Preserve. Together we observed a hugh white ball rise up directly into the sky. We both exclaimed, what the hell is that? I knew, and he knew it was much too large to be a helicopter. It climbed just to the level of the clouds, so it could not be clearly seen, and immediately shot west, towards us. As it passed over me I could clearly see the light surrounded the object. It was extremely bright and moved very quickly. It was seconds from the I first time I saw it, until it passed my house. The sky was so black and the cloud cover was very heavy. Also there was a an abnormal amount of lightning and it had just started to rain. Once the object reached my house and passed, I lost sight of it because of the weather, it's position in the clouds and it's speed."],"City":"Undisclosed","Log Number":"US-02052013-0008","trends":[],"Country":"United States","Date of the Event":"05/31/2012 05:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.055078,+-111.088441(45588)&iwloc=A&hl=en\"> mufon case (45588) map </A>","Longitude":"-111.088441","Object Shape":"Circle","Tags":"City","Object Features":"None"}