{"Region":"Louisiana","Source":"MUFON","Disposition":"Unresolved","Object Shape":"Flash","divs":["sighting detailsmy 2 friends and i was driving from new orleans to dallas along i49 northbound about 630pm. since i was the driver, my friends weren't paying attention to the road. i saw a quick flash of aquamarine-bluish light which lasted about a second. before i could describe to my them what i had just screamed about, a 2nd one of the exact same lights flashed again so my friends were able to witness it as well. a few seconds later, we saw the 3rd and final flash a little bit off to the left of the lights but it seemed further away in the horizon. the lights were a gradual color change which appeared to have horizontal waves\\lines (pulsating waves?) within the lights. it was very bright like led lights but it appeared to come from the ground going upward towards the skies. the gradual color change was consistent in height across the skies. there weren't \"concentrated\" colors on 1 area more than another. the colors were even across. trying to ease our mind, we thought there maybe an airport runway or city buildings or just something that had this super powerful machine that can glow up the entire sky. i checked my gps and we're driving in the open land and the next big city was about 150 miles away. the lights was way too bright and very very big to think that it could have come from here. one of my friend saw the exact same thing back in early-mid december 2012. she was in north dallas and saw it while driving home. we've googled to see if anyone else has seen something similar and there has been a few but very little in finding more information to help ease our mind. we looked for blown transformers but it look like the blowups last about 3-4 sec. this sighting didn't have smoke after it. just flash and gone."],"trends":["There has been one other sighting in Bunkie","There were no other sightings in Bunkie on or around February 4th 2013"],"Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Date of the Event":"02/04/2013 06:20 UTC","Tags":"City","Log Number":"US-02052013-0003","Date Submitted":"02/05/2013 07:40 UTC","City":"Bunkie","map":"<A HREF = \"http://maps.google.com/maps?q=30.953247,+-92.182626(45582)&iwloc=A&hl=en\"> mufon case (45582) map </A>","Latitude":"30.953247","Object Flight Path":"N/A","Weather Factors":"Unknown","Case Number":"45582","Longitude":"-92.182626","Country":"United States","Summary":"Flash of greenish-blue scheme flash from ground up","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/45582.html.txt","/var/www/straped/mufon/org/45582.html"]}