{"files":["/var/www/straped/mufon/html2text/45585.html.txt","/var/www/straped/mufon/more/45585_submitter_file1__BucktownrdbrasherfallsnyUFO.jpg","/var/www/straped/mufon/org/45585.html"],"Object Flight Path":"Stationary,Other","Object Features":"Dome, Other","City":"Brasher Falls-Winthrop","Tags":"City","Case Number":"45585","Sighting Duration":"Undisclosed","Log Number":"US-02052013-0006","Latitude":"44.807679","Summary":"Taken by a local friend who at this time wishes to remain anonnomus.","Viewing Distance":"Unknown","trends":["There has been one other sighting in Brasher Falls-Winthrop","There were no other sightings in Brasher Falls-Winthrop on or around June 16th 2012","This sighting has been favorited 1 time.",""],"Country":"United States","Weather Factors":"Unknown","Object Shape":"Saturn-like, Other","map":"<A HREF = \"http://maps.google.com/maps?q=44.807679,+-74.774312(45585)&iwloc=A&hl=en\"> mufon case (45585) map </A>","Longitude":"-74.774312","Region":"New York","Date of the Event":"06/16/2012 08:45 UTC","divs":["Sighting DetailsAll I was told was that her husband was taking out the trash and looked up and saw this thing hovering. He went and got his cell phone snapped this picture and it took off or disappeared seconds after. I believe he works for state correction facility and wishes to remain anonnomus. However if you are interested I can get more details and possibly talk him into coming forward or at least get all the answers to your questions. I was whitness to two separate events where two craft egg shaped and glowing light yellow to white traveling at high rate of speed aproximately 3 seconds apart. First time I saw them they were headed south coming from North across the St lawrence river aproximate elevation 25,000 ft or short distance below the jetliner which was above headed north. Estamates of speed judged from the speed of the airliner which was just visible from the blinking lights. Time aprox. 11:00 pm EST. In contrast to the jetliner the two unidentified glowing egg shaped craft were traveling 20 times faster as they both passed horizon to horizon in aprox 3 seconds while the jetliner took aprox. 1 minute to cover the same distance. Granted they were below and would appear to be going faster but since they were just below the jet I am sure it would not account for that kind of speed differential. I again saw two similar craft traveling one behind the other aprox 3 seconds apart almost one year later. This time they were headed North across the St Lawrence river but at a much lower altitude aprox 5000ft traveling at the same rate of speed as the first time. First sighting was fall of 2000, second sighting fall 2001. There were 4 whitnesses to the first sighting however they are all unwilling to come forward do to there positions in the community and fear ridicule."],"Date Submitted":"02/05/2013 06:46 UTC","Source":"MUFON","Disposition":"Unresolved"}