{"Viewing Distance":"501 Feet - 1 Mile","City":"Chesapeake","Date Submitted":"02/06/2013 01:53 UTC","Case Number":"45591","Longitude":"-76.266488","Object Shape":"Circle","files":["/var/www/straped/mufon/html2text/45591.html.txt","/var/www/straped/mufon/org/45591.html"],"Date of the Event":"02/05/2013 12:00 UTC","Region":"Virginia","Sighting Duration":"00:00:03","map":"<A HREF = \"http://maps.google.com/maps?q=36.778648,+-76.266488(45591)&iwloc=A&hl=en\"> mufon case (45591) map </A>","Object Features":"Unknown","Object Flight Path":"Straight-line path","Latitude":"36.778648","Tags":"City","trends":["There have been 8 other sightings in Chesapeake","There were no other sightings in Chesapeake on or around February 5th 2013"],"Weather Factors":"Unknown","Disposition":"Unresolved","Source":"MUFON","divs":["Sighting DetailsI turned my head, looked out of my windshield and noticed a bright green light in the sky moving northwest at a high rate of speed. My initial reaction was surprise due to it's speed. This area is famous for military and civilian aircraft in the air during all hours of the day and night and I have seen all types of craft flying at all possible altitudes. The speed was at least five times that of a traffic helicopter. The object was inside the cloud cover as it flew above some and below others. Roughly two to three seconds was the length of time I observed the object before it disappeared into more cloud cover. I stayed in my car, starring at, and beyond, the same spot for roughly ten minutes before starting it up and driving off. When I first noticed the object it was at my 12 o'clock. The point at which it disappeared into the clouds was my 11 o'clock. This is the second UFO sighting I've had in my lifetime. The first was during a walk to a convenience store sometime in 1993. Then, I just so happened to look up at the sky at the right time and witnessed seven small orbs, all glowing green, shoot forward at seemingly impossible speeds, all in sync with each other. Odd that both sightings are, except for quantity, exactly the same."],"Summary":"Green light, disc shape. Traveled swiftly on a northwest path until out of sight.","Country":"United States","Log Number":"US-02062013-0002"}