{"Summary":"Black object in the sky during the day....","Case Number":"45594","Country":"United States","Viewing Distance":"Unknown","Latitude":"37.389452","Disposition":"Unresolved","Log Number":"US-02062013-0005","Object Flight Path":"Hovering then path","Source":"MUFON","Weather Factors":"Unknown","divs":["Sighting DetailsI was out walking my dog. I just so happened to look up and saw the strangest object in the sky. If i had to describe it, i would say it looked like a piece of garbage bag floating. There were birds in the sky but none near this object and i made sure to look at the birds and they were below the object. It almost looked like a bird too but without wings. It floated and just sat there. There was a wind so i could not understand why it wasnt going anywhere. It just rolled and floated pretty much in the same place. I kept walking my dog but would stop to see the progress. It just remained floating.... much like a leaf in the wind only it stayed in the same place. I just kept staring up at the sky and it seemed at this time ( after 5 minutes) to be traveling towards me. I was rather excited and waited to see if anyone was walking down the street so i could point it out to them but nobody was on the street. It was pretty much above me but only now , it looked exactly like a black star. Not completely black, more like dark grey. It was no longer moving. The clouds went over it and i lost sight of it:( I took 2 pictures with my cheap phone camera. I cannot see it tho:( I wonder if anyone could clean up the picture or if it happened to be behind a cloud. Around this time, a man in a pick up truck was pulling into his driveway and looking at me strangely as i stared up into the sky."],"Longitude":"-121.975704","trends":["There have been 12 other sightings in Santa Clara","There were no other sightings in Santa Clara on or around February 2nd 2013"],"Region":"California","Date Submitted":"02/06/2013 04:02 UTC","City":"Santa Clara","Date of the Event":"02/02/2013 12:00 UTC","files":["/var/www/straped/mufon/html2text/45594.html.txt","/var/www/straped/mufon/org/45594.html"],"Sighting Duration":"Undisclosed","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=37.389452,+-121.975704(45594)&iwloc=A&hl=en\"> mufon case (45594) map </A>","Tags":"City","Object Shape":"Square, Rectangular, Star-like"}