{"trends":[],"Summary":"I thought it was a really bright star at first until I noticed it moving. Small circles. Left then right. Strobe like flashing of red green blue and white","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.843093,+-84.264138(45593)&iwloc=A&hl=en\"> mufon case (45593) map </A>","Disposition":"Unresolved","Log Number":"US-02062013-0004","Longitude":"-84.264138","Country":"United States","Date of the Event":"02/06/2013 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Flight Path":"Hovering then path,Path with directional change","Weather Factors":"Unknown","Object Shape":"Flash, Sphere","files":["/var/www/straped/mufon/html2text/45593.html.txt","/var/www/straped/mufon/org/45593.html"],"Latitude":"37.843093","Object Features":"Unknown","Case Number":"45593","Tags":"City","Source":"MUFON","Region":"Kentucky","City":"Undisclosed","divs":["Sighting DetailsWilliamsburg ky, I was laying in bed and I happened to look out the window and I saw what I thought was a really bright twinkling star. As I looked at it I noticed that it was moving but it wasn't moving normal or like anything I had ever seen. It gave me goose bumps. It was to the south of Williamsburg maybe over jellico mtn. I started noticing that I could actually make out the colors that it was flashing. Red blue green and white. Kinda reminded me of strobe lights used on emergent vehicles only with no real discernible patterns. I have been watching it for over an hour now and it's about out of my sight. It is traveling southwest. It's like a big star. It was doing small circles and then it would move left or right. It's still there now however it seems like its getting even farther away. My first reaction was to get my video camera but it's too far away to even focus. My camera thinks the cap is on the front of it so it doesn't pick anything up. I have been around the world and seen most things that fly and this did not fit the description of anything I have EVER seen."],"Date Submitted":"02/06/2013 02:31 UTC"}