{"Object Shape":"Triangle","Summary":"Noticed moving light like satelite.Observed untill overhead 7 lights V changed direction.Went out of sight","Case Number":"45592","Object Flight Path":"Path with directional change","Latitude":"40.346385","divs":["Sighting DetailsI was on front porch sky watching hobby with young daughter showing her satelites.I observed bright light moving in west,came closer very quickly and I saw it was a v shape with 7 blueish green lights(I guess)I have never seen any the same color before. Had 1 in center and 3 in middle of each v side. They appeared to have a small tail similar to a tadpole that extended towards rear of object and zigzaged they are very hard to describe. They also shuddered side to side like a distorsion but not front to rear I thought this was strange. When I explained them to friends I origonally said they were distorted like under water but actually it was more like heat you see on a road in a distance like a shudder or shimmer. It came from the west medium high in the sky as a point of light and went almost overhead appeared to tilt or bank slightly to the north west and gave me a good look and gave the apperance of flying then stayed that direction untill out of sight.It made no noise and I could not tell if it was large and 500'up or 30,000'up and huge. It went from one end of the sky to the opposite in about 15 or 20 seconds so it was traveling extremly fast. I live close to a county airport and nothing moves that speed.I have been sky watching and satellite spoting as a hobby for several years. I have seen lights in the sky or meterors and thought cool.This was very VERY different. This was an object a V, I could see the leading edges. The lights were remarkable I have never seen that color and their movement as weird as it sounds had an alive quality.I could not tell anything from the back. Actually I dont no if it was an open back V or a closed triangle their was no lights on back. Only the 7. No red or no blinking. This incident still makes the hair on my neck stand up. Their is a difference from seeing lights and seeing an object that you no is there has shape and mass and moving but dont know what it is. I actually kinda hope its something we have but if it is I dont think we built it. I live near an airport and Bettis atomic research plant. Im an precision mechanical assembler and work with engineers on research an development projects for companys like Seimens. I know what this was not. out of room to tell why late telling story sooner. Thank You, Rob"],"Log Number":"US-02062013-0003","Weather Factors":"Unknown","Sighting Duration":"00:00:15","City":"Pittsburgh","Longitude":"-79.960234","trends":["There have been 122 other sightings in Pittsburgh","There were no other sightings in Pittsburgh on or around March 13th 1996"],"files":["/var/www/straped/mufon/html2text/45592.html.txt","/var/www/straped/mufon/org/45592.html"],"Country":"United States","Date of the Event":"03/13/1996 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Object Features":"Unknown","Tags":"City","Disposition":"Unresolved","Region":"Pennsylvania","Date Submitted":"02/06/2013 02:08 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.346385,+-79.960234(45592)&iwloc=A&hl=en\"> mufon case (45592) map </A>"}