{"Latitude":"31.970689","Tags":"City","Summary":"red object hovered over an open field of cattle for 30 minutes, I have snap shots.","Sighting Duration":"Undisclosed","Object Features":"Unknown","Log Number":"US-02062013-0001","files":["/var/www/straped/mufon/html2text/45590.html.txt","/var/www/straped/mufon/more/45590_submitter_file1__Cowbeingdropped.JPG","/var/www/straped/mufon/org/45590.html"],"Region":"Texas","Date of the Event":"02/13/2009 09:00 UTC","divs":["Sighting DetailsLocation: Across the street from us.... Farm country......Open Fields....... The weather was nice outside. I was just enjoying the night sky. Looked out over the field of cattle and horses and saw a red object that just kept in one position for about 30 minutes over the tree line...(Just remember this was over four years ago, and I think you can check the date and time on the picture stamp.) I held the camera so it would not move while snapping the shots. After I downloaded the pictures, believe it or not, it looks like a cow is being dropped. Really.... I live around neighbors with shotguns and you don't go around asking questions. Trust me... I would love for someone to take a look at the picture and then you all can make up your own decisions about the view. The farmer that lived across the street has died....So you won't be able to ask him any questions. He lived alone.... Kept going in and out of the house. Then I went into the house, but still kept an eye on the object. Went to the restroom and when I went back to the window it was gone... But the next day we had black helicopters in about the same area flying up and down that creek area. It wasn't just one helicopter but about 3.... So I have decided the next time, I will take snapshots of them also... With the time stamp on the camera that will help also. Just take a look at my picture and let me know what you all think..... Something about being called \"Off the rocker\", NO ONE LIKES. But the good thing is that my husband saw the same thing I did. I will only forward one picture, but I have more. Would like to have an intelligent conversation with someone regarding this photo....and others. Enjoy.... Let me know what you think. Sincerely, Ms. McCullough"],"map":"<A HREF = \"http://maps.google.com/maps?q=31.970689,+-99.899713(45590)&iwloc=A&hl=en\"> mufon case (45590) map </A>","Weather Factors":"Unknown","Viewing Distance":"Unknown","Object Flight Path":"Stationary","Date Submitted":"02/06/2013 12:29 UTC","Country":"United States","Longitude":"-99.899713","Case Number":"45590","Source":"MUFON","City":"Undisclosed","Object Shape":"Unknown","Disposition":"Unresolved","trends":[""]}