{"Longitude":"-82.994044","divs":["sighting detailsat 10:37 pm i walked out of a side exit door at the cinemark movies 12 at the corner of bethel and pickford in columbus, oh. i know the time is exact because i was leaving work at the theater on my way to the bus stop on pickford and checked my phone in anticipation of the bus i was about to catch. about one minute after leaving the theater i reached the bus stop and happened to look up, over the carriage place shopping center where the theater is located and saw a black crescent-shaped craft fly approximately 100' over the building. the object was about 80' across and 20' wide in the center. all of the measurements are based in comparison to the part of the building that it flew over - the building being about 20' high at that point. the only sound i heard at all was an alto-pitched hum that faded as the object passed over flying due north. the object itself was a flat dark color, slightly lighter than the sky behind it. there were several light grey squares underneath but no lights. it traveled a distance of approximately 1 mile before i could no longer see it, which took about twenty to thirty seconds. when i first noticed it i thought it looked like a giant boomerang-shaped ship. i felt only a slight confusion\\curiosity. i lost sight of the object because it's dark color made it blend in with the sky after passing over the well-lit parking lot of the shopping center."],"Source":"MUFON","Disposition":"Unresolved","Case Number":"45608","Sighting Duration":"Undisclosed","Date Submitted":"02/07/2013 12:30 UTC","Log Number":"US-02072013-0001","Object Flight Path":"Straight-line path","City":"Columbus","Summary":"Large black crescent with white/grey squares underneath, alto-pitch hum","files":["/var/www/straped/mufon/html2text/45608.html.txt","/var/www/straped/mufon/org/45608.html"],"Latitude":"39.970026","Object Shape":"Chevron","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=39.970026,+-82.994044(45608)&iwloc=A&hl=en\"> mufon case (45608) map </A>","Country":"United States","Weather Factors":"Unknown","Region":"Ohio","Tags":"City","Viewing Distance":"101-500 Feet","Date of the Event":"02/06/2013 10:38 UTC","trends":["There have been 70 other sightings in Columbus","There were no other sightings in Columbus on or around February 6th 2013"]}