{"files":["/var/www/straped/mufon/html2text/45606.html.txt","/var/www/straped/mufon/org/45606.html"],"Object Shape":"Disc, Other","Latitude":"33.411936","trends":["There have been 4 other sightings in Greenville","There were no other sightings in Greenville on or around June 20th 1954"],"Tags":"City","divs":["Sighting DetailsMy uncle was an electronics specialist and a civilian employee at the Air Force base in Greenville, Mississippi in the mid 50's. One day some military authorities escorted him and several other civilian employees into a large aircraft hangar and ordered them to stay there until they were told they could come out. None of the men's questions about what was going on were answered. The military men closed the hangar's doors and left. The men in the hanger hung around the area where the hangar's doors came together, and they discovered they could peek outside and see what was going on. A disk shaped aircraft about 40 feet in diameter descended vertically and landed on the tarmac outside the hangar. Several men with cameras filmed the entire incident from an elevated scaffolding. Other cameramen stood on the ground. A door opened on the aircraft and a child-sized alien being walked down a short ramp. The alien used a hand-held computer to communicate with the military personnel. The aircraft was on tripod landing gear with wheels, and several men were ordered to pushed it into the hanger across the way. Once the ailen aircraft was inside the hanger, the men closed the doors. The doors were reopened several minutes later and the same men pushed the alien aircraft back outside and to its original position. The men around the aircraft stepped away from the aircraft and it soon lifted vertically and silently and quickly darted away. As soon as the alien aircraft was gone,some military men opened the hanger doors where the civilian men were standing and told them to carry on. I was a teenager when I heard this story and my reaction to it was a mix of uncertainty and disbelief. My uncle didn't have any reason to lie about it, but... Years later, I was watching a program about UFO's on television, and a man who saw the same event described it exactly as my uncle had described it years earlier--in every detail. I was amazed, but while I have seen many UFO programs on television repeated several times, I never saw that particular interview again. I now realize the importance of that event, but my uncle died several years ago, and I imagine that the other witnesses are probably all dead as well. Just the same,I wanted to get this information out there for what it is worth, so here it is. I hope it proves to be beneficial. Our government isn't about to confess that it has lied to us about UFO's since 1949. Doing so would destroy what little credibility it still has."],"Log Number":"US-02062013-0017","Object Flight Path":"Other","Object Features":"Appendage(s)","Viewing Distance":"21-100 Feet","Summary":"UFO landed at U.S. Air Force base, and an alien talked with military officals","Date of the Event":"06/20/1954 12:00 UTC","Country":"United States","Source":"MUFON","Weather Factors":"Unknown","Case Number":"45606","Disposition":"Unresolved","City":"Greenville","Date Submitted":"02/06/2013 08:55 UTC","Sighting Duration":"Undisclosed","Region":"Mississippi","Longitude":"-91.056984","map":"<A HREF = \"http://maps.google.com/maps?q=33.411936,+-91.056984(45606)&iwloc=A&hl=en\"> mufon case (45606) map </A>"}