{"divs":["sighting detailsat approx 22:45 on feb 6th 2013 a rumbling\\grumble\\vibrating & fluctuating ball of light appeared outside my second floor north facing bedroom window startling my wife and i for approx. 10-20 seconds. as i moved downstairs my children were heading upstairs reporting the same thing outside their south facing individual bedroom windows on the first floor. we immediately went outside and saw numerous neighbors emerging from their residences searching for something. our home's electricity faltered, although power remained on numerous homes the entire length of our street had lost complete power. after speaking with some neighbors they reported the same experience that happened at our home, one neighbor was outside and reported the lights hovering in the of and then shot straight up. police patrols were immediately apparent and it appeared they were searching for something, at times racing down the roads back and forth. power company vehicles showed up later and at approx. 12:30 am the other residents homes were returned to power. our new (dec 2012) in-ground pool lite was burnt out by the incident and the cable tv, internet and telephone all stopped working. this morning 2\\7\\13 the power company trucks began working on the power lines behind my home and the cable guy just showed up to fix the issue. the police patrols reported to the residents on the block that they could not explain the incident nor the fact that most of the homes along the block all reported similar lights & noises outside their windows at the same time. the power lines only run behind my house and my immediate neighbor to the west neither of us lost power just the other homes on the same street. the 4 adult members of my family experienced this same event on different floor of the home with the windows facing different directions. there were numerous other neighbors who also experienced this event."],"Source":"MUFON","Region":"Texas","Weather Factors":"Unknown","Object Features":"None","Case Number":"45618","Date of the Event":"02/06/2013 10:45 UTC","Disposition":"Unresolved","City":"Los Fresnos","trends":["There has been one other sighting in Los Fresnos","There were no other sightings in Los Fresnos on or around February 6th 2013"],"Object Flight Path":"Hovering then path","Log Number":"US-02072013-0011","Latitude":"26.078622","Object Shape":"Sphere, Star-like, Other","Sighting Duration":"00:00:20","Longitude":"-97.480903","Summary":"Ligths & Noise Outside Homes","Date Submitted":"02/07/2013 03:57 UTC","files":["/var/www/straped/mufon/html2text/45618.html.txt","/var/www/straped/mufon/org/45618.html"],"Viewing Distance":"20 Feet or Less","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=26.078622,+-97.480903(45618)&iwloc=A&hl=en\"> mufon case (45618) map </A>","Country":"United States"}