{"Object Shape":"Other","Latitude":"43.045614","Log Number":"US-02072013-0008","Case Number":"45615","Object Features":"Unknown","Viewing Distance":"Unknown","Weather Factors":"Unknown","Date of the Event":"02/06/2013 05:55 UTC","Longitude":"-74.850656","Date Submitted":"02/07/2013 12:03 UTC","Object Flight Path":"Hovering then path,Straight-line path","files":["/var/www/straped/mufon/html2text/45615.html.txt","/var/www/straped/mufon/org/45615.html"],"Disposition":"Unresolved","Country":"United States","Tags":"City","City":"Little Falls","Sighting Duration":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=43.045614,+-74.850656(45615)&iwloc=A&hl=en\"> mufon case (45615) map </A>","Summary":"Line of approx 5 lights in sky. Brightened, hovered, then slowly began moving northward. Then abruptly and quickly seemed to faded away.","Region":"New York","divs":["Sighting DetailsI was driving eastbound on a rural secondary road in southern Herkimer county just prior to 6 PM Wed, Feb 6, 2013. It was about twilight, with the sky still appearing dark blue, not nighttime black yet. I first noticed a light in the sky in front of me, in the direction I was driving. My first thought was that it was the first star of the night. It really caught my attention, though, when it increased in brightness. I slowed my driving and looked at the sky, and saw not one \"star\" but approximately 5 brightening lights in the sky, in a line that was to me, on a slight diagonal. The lights were slowly sweeping northward, and the brightness grew then dimmed somewhat as they moved. The movement was much faster than planes move across the sky when observed from the ground. Also, the lights were close enough that I believed no airplanes could fly in formation that close together, that quickly. Yet the lights covered too much area to be on one airplane. The movement was also not \"normal\" to me - not anything I am used to seeing. The line of lights seemed to move irregularly, hovering then sliding northward. As I now gawked out of my windshield, hoping for a better look, the lights began to dim and faded away into nothing very quickly. I was left without any rational explanation for what I'd seen. The whole thing lasted only seconds, maybe a minute."],"trends":["There has been one other sighting in Little Falls","There were no other sightings in Little Falls on or around February 6th 2013"]}