{"Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=28.568601,+-81.38943(45624)&iwloc=A&hl=en\"> mufon case (45624) map </A>","Date of the Event":"05/08/1985 09:28 UTC","Region":"Florida","Source":"MUFON","City":"Orlando","Latitude":"28.568601","Country":"United States","Sighting Duration":"Undisclosed","Log Number":"US-02082013-0002","Date Submitted":"02/08/2013 11:26 UTC","Summary":"Triangular shaped craft hovered then took off into sky at phenomenal speed","trends":["There have been 112 other sightings in Orlando","There were no other sightings in Orlando on or around May 8th 1985"],"Longitude":"-81.38943","Disposition":"Unresolved","divs":["Sighting DetailsI was walking my small dog one night in Orlando College Park area. I heard what I thought was a whirring sound of a helicopter and saw lights and assumed it was a helicopter landing at the nearby hospital. It began to fly directly over me and hovered. When I looked up, I realized (gulp) that it looked nothing like a helicopter and looked like a small version of a stealth jet, which of course cannot hover, so I was alarmed. It had very bright lights emanating from it all around the sides and at least one shining down from the bottom of the craft. I looked over to my dog and she was looking up at it and was mesmerized, but not barking, which she would normally do at loud big things. I looked back up at the object, which was about 40 to 50 feet above us, and it suddenly moved sideways for about 200 feet, then went up into space at an incredible speed that within 30 seconds, it was up so high it looked like a star. I had never seen anything move that fast ever. My father was an air force pilot, so I am familiar with planes and jets. For days afterward, my dog just lay around listless, and I felt strange as well, extreme fatigue yet an unusual blissful mental state. A few years later, they had a show on about these craft seen by numerous Belgian or Dutch police and air force, and showed drawings of it. It was exactly the same craft I had seen..."],"Case Number":"45624","Object Flight Path":"Path then hovering","files":["/var/www/straped/mufon/html2text/45624.html.txt","/var/www/straped/mufon/org/45624.html"],"Weather Factors":"Unknown","Object Shape":"Triangle","Tags":"City","Object Features":"Wings"}