{"Viewing Distance":"21-100 Feet","Case Number":"45627","Log Number":"US-02082013-0006","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.795575,+-94.496542(45627)&iwloc=A&hl=en\"> mufon case (45627) map </A>","Date of the Event":"11/15/1987 11:00 UTC","Weather Factors":"Unknown","City":"Evansville","Latitude":"35.795575","Tags":"City","Object Features":"None","Object Shape":"Fireball, Sphere","Source":"MUFON","Summary":"Orange flaming ball of fire, paced car about 45 mph, parallel to highway for about three quarters of a mile on Arkansas Highway 59 on Mountain Fork Creek.","divs":["Sighting DetailsThirty one year old woman with three sleeping children in a pickup truck travelling south on Arkansas 59 Highway, around 11 pm. Driver observed to left of the roadway, a bright orange flaming ball of fire pacing the truck at about 45 mph, about three feet off ground in a field adjacent to highway. The object was about 80 feet inside the field travelling parallel to the truck. The driver was concerned that the object might cross over and impact the truck. She sped up and tried to evade it. She tried to awaken children so they could observe it was out of sight by the time they were awake. As she turned left across the bridge on Mountain Fork Creek, she lost sight of it. The children did not see it, but verify that she awakened them and her husband verifies that she told him the same night. The family was surprised the next days when there was no sign of fire along the flight path. Several years later the husband searched the field with a metal detector looking for a possible meteorite, but was unsuccessful. A MUFON Field Investigator helped with making this report. To answer questions briefly: Family was going home from evening out and noticed fireball in adjacent field. The drive thought it was just a flaming object. It paralleled the roadway. She was frightened that it might hit truck. Lost sight of object in a turn."],"Region":"Arkansas","trends":["There have been no other sightings in Evansville","This sighting has never been favorited."],"Object Flight Path":"Straight-line path","Country":"United States","Disposition":"Unresolved","Longitude":"-94.496542","Date Submitted":"02/08/2013 04:12 UTC","files":["/var/www/straped/mufon/html2text/45627.html.txt","/var/www/straped/mufon/org/45627.html"]}