{"Summary":"3 cone shaped objects appear and disappear out of thin air within the span of approximately 4 seconds.","Country":"Canada","divs":["Sighting DetailsI was lying outside in my backyard in the middle of the night star gazing. I don't remember what time it was, but my guess would be that it was around 2am or 3am. All of a sudden something catches my attention out of the corner of my eye, so I quickly whip my head around to look to my right. Then and there I see 3 shapes right above my neighbor's backyard. At a height no higher than the roof of a one story building. They are moving towards my neighbors house at a regular velocity. Each one appears to be spinning on it's axis, perpendicular to the surface of the earth. They were positioned in a diagonal formation. Each one slightly beside and above the one below it. The lowest one was furthest away from my neighbor's house and the one on top was the one closest. I guess you could describe the formation as leaning towards the house. They each moved at the same speed and they were each the same size. Their shape was like a diamond. As if someone stuck 2 cones together, hence having a circumference. They appeared to be reflecting the little light there was, but I can't be sure. It was very dark and at night so there wasn't much light at all. If it was reflective it wasn't very reflective at all. As soon as I sighted them they were already moving towards my neighbor's house. They moved for about 3 or 4 seconds before disappearing out of thin air. As if they never even existed. I'm pretty sure I saw them a split second after they appeared. I never saw them stationary. They appeared whilst moving I would say, but I am not sure as I saw them appear out of the corner of my eye. I'm not sure if they were already there by the time they caught my attention, but I don't think they were. I think I saw them at the moment of appearance. They made a sound as they moved. The sound I can best describe as a fluctuating sound. It would go louder and quieter in the same pitch. It sounded sort of electronic. Like: waowwaowwaow. It made that sound \"waowwaowwaow\" then dissapeared. The sound stopped when it dissapeared. Sorry, but I don't know how else to describe the sound, I know it's not very specific. Anyhow, this is what I saw and I hope that you may learn something from it or benefit from it in some way. Has anyone else ever seen anything like this??"],"Disposition":"Unresolved","Object Features":"None","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/45621.html.txt","/var/www/straped/mufon/org/45621.html"],"Region":"British Columbia","Source":"MUFON","Object Shape":"Diamond, Other","Longitude":"-123.031347","Date of the Event":"08/17/2012 12:00 UTC","Date Submitted":"02/07/2013 11:22 UTC","Weather Factors":"Unknown","Case Number":"45621","Tags":"City","trends":["There have been 33 other sightings in Vancouver","There was one other sighting in Vancouver on or around August 17th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=49.231995,+-123.031347(45621)&iwloc=A&hl=en\"> mufon case (45621) map </A>","City":"Vancouver","Log Number":"CA-02072013-0014","Viewing Distance":"21-100 Feet","Latitude":"49.231995","Object Flight Path":"Straight-line path"}