{"Log Number":"US-02082013-0001","Country":"United States","City":"Rotterdam","Longitude":"-73.962858","Tags":"City","Weather Factors":"Unknown","Viewing Distance":"20 Feet or Less","Date Submitted":"02/08/2013 02:32 UTC","Summary":"multiple orbs of light","Date of the Event":"02/07/2013 05:50 UTC","Object Features":"None","Region":"New York","divs":["Sighting DetailsDriving on rte 7 from Duanesburg, towards Schenectady, three blue orbs were flying over the industrial park in a triangle formation. They combined and came towards the road. Over the road the super orb hovered and glowed red. By this point people on the road had come out of their cars, some staring in disbelief, others grabbing out cameras. The orb then descended to about 10ft above the people watching and sat idly for awhile. The radio that was on, shut off, the engine of the car began to run funny (as if the electrical components were having issues) and when trying to take a cell phone pictures, the phone immediately began to die. The orb then split off in three directions, one direction being down the road towards schenectady. Before it completely flew off, it flew in a square shape, the square trail holding illumination as the object itself flew away, and the square began to disappate. When the orb left the radio began to come on, but not in a normal way there was a static as it slowly began to regain signal and function. The cell phone went back to being fully charged. I post this in hopes that the other witnesses find this, and share there pictures also. note: the object showed up as yellow in the picture, not the red hue that it appeared to be in person"],"Object Flight Path":"Path with directional change,Path then hovering","Case Number":"45622","Disposition":"Unresolved","Object Shape":"Fireball, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=42.788321,+-73.962858(45622)&iwloc=A&hl=en\"> mufon case (45622) map </A>","Source":"MUFON","Latitude":"42.788321","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/45622.html.txt","/var/www/straped/mufon/org/45622.html"],"trends":["There has been one other sighting in Rotterdam","There were no other sightings in Rotterdam on or around February 7th 2013"]}