{"Disposition":"Unresolved","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.182081,+-80.642352(45620)&iwloc=A&hl=en\"> mufon case (45620) map </A>","Summary":"Object crossed the sky in a matter of seconds","Region":"Ohio","Object Flight Path":"Hovering then path","Source":"MUFON","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Case Number":"45620","Object Shape":"Cigar","Date of the Event":"02/06/2013 07:25 UTC","divs":["sighting detailsmy mother and i were driving home at 7:25 p.m. on the night of february 6, 2013. visibility in the night sky was absolutely crystal clear. we turned right off of sampson rd. onto tibbetts wick road. as we approached the cross-over of logan ave. to continue onto tibbetts wick road, ahead of us in the south\\southeastern sky, above the tree line, was a straight line of flashing lights. the lights hovered as we started to ascend a slight rise. we lost sight of the lights due to tree tops being in the way, and when we picked them up again less than 10 seconds later, they were in the north\\northeastern sky, descending, nearly at the horizon, over an open field. i must note that there was no other traffic, none, in that area at that time. we were both awe-struck; there is no other way to describe how we felt. neither of us had ever in our lives seen anything like those hovering, flashing lights before. when we saw the lights descending and then disappearing, i accelerated my car, as i wanted, needed, to be out of that vicinity. my mother uttered a short scream. i said to her, \"mom, you know that was a ufo, don't you?\" and she said \"yes.\" we both wondered why it was she and i who were chosen to see this object, those flashing lights. and we do not have any explanation for why this might have been. i will say that a similar event occurred in december of 1994, in virtually the exact same location (open field near sampson rd.). very, very strange, to my way of thinking."],"Log Number":"US-02072013-0013","files":["/var/www/straped/mufon/html2text/45620.html.txt","/var/www/straped/mufon/org/45620.html"],"trends":["There have been 6 other sightings in Girard","There were no other sightings in Girard on or around February 6th 2013"],"Weather Factors":"Unknown","Longitude":"-80.642352","Date Submitted":"02/07/2013 10:55 UTC","City":"Girard","Latitude":"41.182081","Tags":"City","Object Features":"None"}