{"Date of the Event":"07/01/1969 12:00 UTC","Country":"United States","divs":["Sighting DetailsAt around 300 am at lake havasu Arizona two friends and I were in a boat fishing. One of my friends brought to our attention a reflective object approaching from the east. At first we thought it was satellite reflecting off of the morning sunlight rising in the east. As it got closer we realized it was only a couple of thousand feet above us. As it approached us it slowed down until it got directly above us in the middle of the lake and stopped. We could see clearly that it was a huge cylinder shape and was on its side. It made no sound at all and remained motionless for a few minutes and then turned its self strait up and down with the round ends at the top and bottom. After a few minutes strange glowing rings of colored lights appeared around the whole cylinder. The rings of light were green, white and yellow. The lights began to pulsate up and down the cylinder and it began to descend al most directly above us until it was only a few hundred feet above and stopped, hovering making no noise. When it stopped, the rings of light stopped pulsating. It sat there for about 10 minutes and then reversed the whole process to its original altitude,the lights went off and turned back on its side and in a flash, sped back in the direction from which it came. My friends and I agreed that we saw the same thing and confirmed that we were not crazy."],"Object Flight Path":"Path then hovering","Case Number":"45628","Viewing Distance":"101-500 Feet","Object Shape":"Cylinder","Region":"Arizona","Tags":"City","files":["/var/www/straped/mufon/html2text/45628.html.txt","/var/www/straped/mufon/org/45628.html"],"trends":["There have been no other sightings in Havasu","This sighting has never been favorited."],"Log Number":"US-02082013-0007","Weather Factors":"Unknown","Object Features":"None","City":"Havasu","Longitude":"-114.37574","Latitude":"34.46735","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.46735,+-114.37574(45628)&iwloc=A&hl=en\"> mufon case (45628) map </A>","Date Submitted":"02/08/2013 05:14 UTC","Summary":"UFO sighting while fishing at lake havasu arizona","Disposition":"Unresolved","Sighting Duration":"Undisclosed"}