{"Longitude":"-97.789586","Weather Factors":"Unknown","Country":"United States","Date of the Event":"11/09/2012 12:00 UTC","Case Number":"45634","Summary":"Thought they were flares at first, but each one was a different color, and they danced in the sky.","Source":"MUFON","Log Number":"US-02092013-0001","divs":["Sighting DetailsAround 8-9 pm, on a Saturday night, i walked out onto my back porch and was looking up at the sky as i always do. I seen 4-5 bright objects in the sky, and thought they were flares. My fiance is military and we both came to the conclusion that they were not flares. They were all different colors and would ascend and descend, and go left and right, and they would change colors, and they were like dancing in the clouds. I watched them for about 15 minutes and noticed that they did not flicker out like most flares do, and then is when i started to get excited. I did call the police, and was informed that they did not know what these objects were, and that they had dispatched officers to the scene of where the reports were coming from. The officer said that he did not know what the aircraft were. I was elated and overjoyed at the feeling of watching these objects, like, dancing in the sky. Was not raining, and the cloud cover was up a ways. The lights of killeen was like under lighting the clouds, and you could see them, going in and out of the clouds. Was an experience that i will never forget. I KNOW WHAT I SAW, and no airplane, flare, balloon, kite, or any other man made object was up in the sky that night. The objects after about 40 minutes, blinked out, blinked back on, and eventually dissappeared into the cloud cover, and at times, seemed to be advancing in a northeasterly direction."],"Viewing Distance":"Unknown","Object Features":"Unknown","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=31.094438,+-97.789586(45634)&iwloc=A&hl=en\"> mufon case (45634) map </A>","Latitude":"31.094438","Sighting Duration":"Undisclosed","Tags":"City","Date Submitted":"02/09/2013 01:13 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/45634.html.txt","/var/www/straped/mufon/org/45634.html"],"Region":"Texas","Object Shape":"Circle, Fireball, Sphere","trends":["There have been 16 other sightings in Killeen","There were no other sightings in Killeen on or around November 9th 2012"],"City":"Killeen"}