{"Source":"MUFON","Object Shape":"Flash, Star-like, Unknown","Date of the Event":"01/06/2013 10:30 UTC","Region":"Pennsylvania","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-75.44052","files":["/var/www/straped/mufon/html2text/45638.html.txt","/var/www/straped/mufon/org/45638.html"],"Tags":"City","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","Case Number":"45638","Log Number":"US-02092013-0005","Object Features":"None","Date Submitted":"02/09/2013 08:25 UTC","divs":["Sighting DetailsAt 10:30 that night I saw a brighter than usual cloud on the distant horizon looking West from the second floor window of my building ( I was looking for this ufo since it appears nightly in this area ~10:30 PM and ~6:30 AM or I think it will appear at any time when you have time to watch it-it seems to know that you want to see it).It nightly haunts Ridley Creek State Park just a mile or less West northwest of the Building I look out of to the West. The Jan 6th observation is an example : It looks like Planet Venus near the horizon but it twinkles wildly , fades ,disappears, brightens again as it moves so slowly over the treetops of the distant woods(it tends to move in an easterly direction). It then disappears, then reappears a little higher flickering wildly and eratically . Then it reappeared as a small helicopter with a strobe light at ~10:45 PM that night, just over the Park coming toward me looking out the closed window( since it knew I was watching it). The \"helicopter\" was quite low as it passed directly over my Building I have a Room in. There was no loud helicopter sound at all-just what looked like a helicopter(or other craft-about 25 feet long )But at night, all you can see is the helicopter lights ,not the helicopter. About 3 minutes after it flew east over my building, there it was again: a flickering, twinkling bright orange-yellow star over the treetops of the Park to the West northwest. I am an Amateur Astronomer, and have been a student of UFOs since NICAP back in the late 1950s and 1960s and have a Ph. D. in Organic Chemistry. In the Winter, I can see a lot more of Ridley Creek State Park since all the leaves are gone on the big trees around the Facility I live in(Fair Acres Geriatric Center). The starlike object always moves straight and level slowly eastward over the treetops , while I watching ,it fade and brighten eratically in the same place over those trees in that Park. I first saw the object back in Nov 2012 after I read about animal and human mutilations and then I started looking out the window more. There's lots of deer on the Park and a horse breeding farm at the edge of this State Park.I read of the numerous disappearances of hikers in State Forests of Pennsylvania-as many as in the Pacific Northwest. I thought of the mystery of human feet in shoes washing up on the shores near British Columbia, and beheaded seals in other places(always severed at the same vertebra in the neck as are other mammals severed in the same place by precision.)I am now trying to get a night vision camera. I think you can see this object in the daytime over the Park if I had FLIR or an Infra -Red Camera. If you look out of this window thinking about it ,it will surely appear, and dissappear and twinkle for an hour,then disappear for a couple hours then around 6:00 AM reappear again in the same general area.I sent George Filer in New Jersey an email about this ufo.I have no pictures or video of it yet."],"Disposition":"Unresolved","Summary":"wildly twinkling star would appear ,fade, then reappear in another area over treetops .","Latitude":"39.917666","trends":["There have been no other sightings in Lima","This sighting has never been favorited."],"Weather Factors":"Unknown","Sighting Duration":"00:30:00","City":"Lima","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.917666,+-75.44052(45638)&iwloc=A&hl=en\"> mufon case (45638) map </A>"}