{"Latitude":"35.840484","files":["/var/www/straped/mufon/html2text/45646.html.txt","/var/www/straped/mufon/org/45646.html"],"Tags":"City","Longitude":"-78.714323","Summary":"Object caught my eye because of bright light, motionless,hovering, light turned off then moved slowly towards west, solid shaped,larger than helicopter, cigar shaped","Region":"North Carolina","Object Shape":"Bullet, Missile, Cigar","Source":"MUFON","Case Number":"45646","Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=35.840484,+-78.714323(45646)&iwloc=A&hl=en\"> mufon case (45646) map </A>","Sighting Duration":"Undisclosed","Country":"United States","divs":["Sighting DetailsI was traveling home from job approaching a major intersection but before I reached traffic stop light I noticed a bright light in sky about 35 - 40 degrees over horizon. At first I thought it was a bright star in sky, then I thought it could've been a helicopter shinning a bright search light but I thought, why would a helicopter be shinning a bright light in daytime. I took my eye off object for a couple of seconds to pay attention to traffic and when I saw object again the light was off and it was actually moving very slow toward the West. The object appeared to be about the size of a passenger airplane but didnt have characteristics of an airplane but more like a cigar. Both ends of object were equally curved. When the object omitted the light it appeared much smaller and the light was the brightest I had ever seen in sky, brighter than the sun. After the light turned off I could see the true shape of the object. It went from small bright glowing object, hovering, to lights off, cigar shaped, moving slow across sky. I felt sad because I didn't record event. I lose track of object because I made a left turn off Duraliegh Road onto Glenwood Avenue in Raleigh N.C... I also attached a photo of an object I captured on film in 2008, as I was taking picture of sun rays bursting thru clouds during a thunder storm in Roanoke Rapids, N.C"],"Disposition":"Unresolved","Viewing Distance":"Over One Mile","trends":["There have been 31 other sightings in Raleigh","There were no other sightings in Raleigh on or around January 14th 2013"],"Date of the Event":"01/14/2013 07:30 UTC","Log Number":"US-02102013-0006","Weather Factors":"Unknown","Object Features":"Unknown","Date Submitted":"02/10/2013 02:52 UTC","City":"Raleigh"}