{"Case Number":"45645","Object Features":"Unknown","Weather Factors":"Unknown","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Summary":"Two Unidentified Objects Flying in Night Sky Over Sacramento County on February 9, 2013 at Approximately 6:25pm","map":"<A HREF = \"http://maps.google.com/maps?q=38.590112,+-121.4847(45645)&iwloc=A&hl=en\"> mufon case (45645) map </A>","Date Submitted":"02/10/2013 01:46 UTC","Region":"California","Tags":"City","Log Number":"US-02102013-0004","Country":"United States","Object Shape":"Fireball, Sphere","City":"Sacramento","Source":"MUFON","Latitude":"38.590112","Longitude":"-121.4847","Disposition":"Unresolved","divs":["Sighting DetailsLooking out to the Southwest direction from of the Western-facing window of my condominium in Rocklin, California, I saw two circular shaped objects in the sky. I live on a second floor, and I have a very clear and panoramic view of the horizon to the West and the South. The skies were clear, and the weather was dry and mild. I first saw the objects at approximately 6:25pm, and they were flying at approximately 15 to 20 degrees above the horizon. They were very bright and seemed bigger than any airplane, helicopter or other familiar aircraft. They were several miles from me and were definitely flying over an area in Sacramento County. They could have possibly been flying over Citrus Heights, California, Fair Oaks, California or even Rancho Cordova, California, depending on their distance from my home. The objects were very bright and were mostly yellow-orange colored, but they occasionally changed to a green color, and even red, blue and white. They moved in all directions and changed direction quickly. Sometimes either one of the objects would appear to fall like a leaf, and then fly upward again. They appeared to stay relatively low to the ground, but they would sometimes fly higher up in the sky. Both of the objects stayed relatively close in proximity to each other. My reaction to these objects was that I had never seen anything like them before, and that they must be of an extraterrestrial origin. From my window, I saw two other people (whom I do not know) on my street who were outside on the sidewalk witnessing these two objects flying in the sky. They were capturing video footage of the objects on a cell phone, smartphone, or a similar device. I no longer saw the objects after approximately 7:30pm."],"Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/45645.html.txt","/var/www/straped/mufon/org/45645.html"],"Sighting Duration":"01:30:00","trends":["There have been 83 other sightings in Sacramento","There were no other sightings in Sacramento on or around February 9th 2013"],"Date of the Event":"02/09/2013 06:25 UTC"}