{"City":"Dublin","Tags":"City","Object Shape":"Triangle","Source":"MUFON","Country":"United States","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI am located about 3 miles southeast of Stephenville, Texas. A friend and I were standing in my driveway about 7pm. It was a full moon night with a low lying cloud cover. The clouds were so thick the moon and stars could not be seen. However the moon did create a luminous glow behind the clouds. I noticed a large glowing object above the horizon to the southeast. I pointed to the object and we both speculated as to what it could be. It was moving too slowly for an airplane and we heard no helicopter sounds. We heard no sound at all but my neighbor's dog did begin to bark as if to alert of an intruder. The object randomly glowed from a bright amber (to almost white) then it would dim to a deep orange (almost red). The object was following an arc about 45 degrees above the horizon. The direction was southeast to northwest. My friend said he could see a shape, triangular, I could not. However I observed that when the object would brighten it would cast a glow on the clouds above it. The glow was a different color and brighter than the light of the moon. The object continued until it was almost directly overhead at 90 degrees angle to the ground; it then vanished completely. It winked out as if someone had turned off a light. The duration of the sighting was perhaps 2 minutes or less. We discussed the event briefly then I went inside to check the time (7:05 pm). I went back outside and we discussed the events we had just witnessed, comparing observations and attempting to be as objective and accurate as possible. My friend is a skeptic and was rather excited by the sighting. I grew up in this area and began to tell him of the many other unusual things I've seen here. Suddenly another glowing object appeared in the same location as the first one. This object had the same characteristics as the first object and follwed the same flight path. It moved the same speed and when it reached a point 90 degrees overhead it also disappeared. My friend had retrieved his cell phone and checked the time (7:26pm). We noted the objects had appeared about 20 minutes apart and decided to wait 20 minutes to see if another one appeared. I got out my camera and tripod, my friend moved his car so I could set up. As I was sighting my camera I joked that retrieving my camera would hex the evening so that another object would not appear. Unfortunately, it was an accurate prediction and another object did not appear. However a jet did come roaring overhead and we were struck by the difference in sight and sound when contrasted against the UFO."],"Date Submitted":"02/09/2013 10:32 UTC","Object Flight Path":"Straight-line path","Region":"Texas","Longitude":"-98.350156","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=32.110167,+-98.350156(45641)&iwloc=A&hl=en\"> mufon case (45641) map </A>","Object Features":"None","Date of the Event":"01/26/2013 07:05 UTC","Case Number":"45641","Log Number":"US-02092013-0008","files":["/var/www/straped/mufon/html2text/45641.html.txt","/var/www/straped/mufon/org/45641.html"],"Weather Factors":"Unknown","Summary":"We saw two glowing objects. The objects appeared seperately (21 minutes apart) Both followed the same flight path SE to NW.","Latitude":"32.110167","trends":["There have been 40 other sightings in Dublin","There were no other sightings in Dublin on or around January 26th 2013"]}