{"Source":"MUFON","Log Number":"CA-02102013-0003","City":"Undisclosed","Date of the Event":"06/10/1977 01:30 UTC","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=51.260025,+-85.320544(45644)&iwloc=A&hl=en\"> mufon case (45644) map </A>","Country":"Canada","Region":"Ontario","Object Features":"Other","Summary":"CYLINDER W/ SLIGHT FLAIR AT BOTTOM, DARK GREY APERENCE NO SOUND, NO LIGHT, NO HATCH SEEN, BRIGHT SUNNY DAY BACK DROP COTTON LIKE CLOUDS, SUN LIGHT DID NOT GLEAM ON CRAFT.","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"02/10/2013 01:45 UTC","Tags":"City","Object Flight Path":"Straight-line path","Latitude":"51.260025","trends":[],"divs":["Sighting DetailsDATE: JUNE 1977, SCHOOL CAMPING TRIP TO BOUNDRY WATERS IN CANADA. I REMEMBER HEARING WE WERE GOING 300 NORTH OF INTERNATIONAL FALLS,MN I DO NOT KNOW WHERE, OR ANY OF THE LAKES NAMES. WE WERE GATHERD AT 1;30 2:00 PM. IT WAS A BRIGHT SUNNY DAY. WHITE CLOUDS SOLID BANK, FLUFFY NO HOLES THRU CLOUDS. CLEAR BLUE SKIES OTHER WISE I WAS FACING THE SOUTH EAST WHEN THE CRAFT COUGHT MY EYE. IT WAS APROX 30 DEG ABOVE THE HORIZON. FIRST NOTICED THERE WAS NO SOUND. IT WAS CYLINDER SHAPE WITH A SLIGHT FLAIR AT BOTTOM. THE WIDE END WAS ON THE BOTTON SMALLER ON TOP, IT DID NOT WOBBLE OR SPIN. THERE WERE NO WINGS, TAIL SECTION, IT WAS NOT AN AIR PLAIN, COMERCIAL, PRIVATE, LARGE OR SMALL WAS NOT A ROCKET, METEOR, COMET. IT WAS NOT SPINNING, THERE WAS NO CONTRAILS, SMOKE COMING FROM THE CRAFT. IT WAS A DEFINATE GRAY COLOR I THOUGHT IT ODD THAT THE BRIGHT SUN OF THE DAY DID NOT GLEAM, SHINE ON THE CRAFT. IT DID NOT REFLECT THE SUN LIGHT. IT STAYED THE SAME COLOR I DO NOT KNOW THE DISTANCE. I CAN SAY THAT I COULD SEE THERE WERE NO VISIBLE SIGNS, LETTERS LIKE YOU WOULD SEE ON AN AIR PLANE. IT WAS NOT TOTALY SMOOTH. I COULD SEE, BUMPS SMALLISH THINGS, NO HATCH, WINDOWS, VENTS. I SAW IT FROM THE FRONT, THE SIDE FACING ME, AND THE BACK OF THE CRAFT. I COULD TELL THAT IT WAS NOT SPINNING.I REMEMBER THINKING I COULD HIT IT WITH A GUN ( LONG BARREL ) ( I DON NOT KNOW HOW FAR IT ACTUALLY WAS) I FOLLOWED IT FROM THE SOUTH EAST UNTILL I COULD NOT SEE IN ANY MORE DUE NORTH. IT DID NOT ZIP LEFT OR RIGHT, GO UP OR DOWN. IT MAINTAINED A CONSTANT SPEED. THE LEADER OF THE GROUP WAS FACING NORTH WHEN I WAS FACING S.E. AT MY FIRST SIGHTING. AFTER I COULD NOT SEE THE CRAFT ANY LONGER I TURNED TO THE GROUP. AND SAID I HAD SEEN A UFO OR SOMETHING. THE TIME VIEWED ONLY 1 MINN TO 1.5 MINN. IT SEEMED IT TOO LONGER. THE LEADER HAD TO HAVE SEEN IT. HE SAID IN A STEARN ALMOST MEAN (ISH) VOICE, THAT IT WAS A SATELITE. I DID NOT ANSWER HIM BACK. HE REFUSES TO SPEAK OF IT TO THIS DAY. AND ONE THING I LEARNED AT THE SAME SCHOOL. SATELITES DONT ORBIT IN OUR ATMOSPHERE. MY REACTION TO THE SIGHTING, MOSTLY OF AWE WONDERMENT. TAKING IN THE FACT THAT IT WAS NOT LIKE ANY AIR BORNE THING ID EVER SEEN IN THE 17 YEARS ON THE PLANET. IT WAS JUST PLAIN COOL. I DID NOT OBBSES OVER IT. AS I STARTED TO TRAVEL IN THE NAVY AS A RADIOMAN SATELITE COMMUNICATION, 30+ COUNTRIES. I DID ALOT OF TOURING OF ANCIENT SITES, LISTENING TO LOCALS SPEAK ON MANY THINGS, AND EVERY ONCE IN AWHILE ABOUT UFO, ALIENS. I WOULD LIKE TO THANK THE MINNESOTA MUFON GROUP I WAS THERE AT A MEETING IN JAN. IT WAS NICE TO HEAR OF OTHERS EXPERIENCES IT WAS GOOD TO BE AROUND OTHER LIKE MINDED PEOPLE."],"Weather Factors":"Unknown","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/45644.html.txt","/var/www/straped/mufon/org/45644.html"],"Longitude":"-85.320544","Sighting Duration":"Undisclosed","Case Number":"45644"}