{"Longitude":"-2.234656","Object Features":"Patterned Surface","Source":"MUFON","Country":"United Kingdom","Viewing Distance":"20 Feet or Less","Disposition":"Unresolved","Case Number":"45648","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/45648.html.txt","/var/www/straped/mufon/org/45648.html"],"Date of the Event":"02/03/2013 02:10 UTC","Log Number":"AU-02102013-0007","Weather Factors":"Unknown","City":"Gloucester","Summary":"A triangular craft, enveloped with aura and pulsing lights","Latitude":"51.865895","map":"<A HREF = \"http://maps.google.com/maps?q=51.865895,+-2.234656(45648)&iwloc=A&hl=en\"> mufon case (45648) map </A>","trends":["There has been one other sighting in Gloucester","There were no other sightings in Gloucester on or around February 3rd 2013"],"divs":["Sighting DetailsMe and my girlfriend were on trip to visit my parents in Gloucester (Australia). Gloucester is full of little forests aroud it, where me and my girlfriend decided to spent the night with food and bonfire. As we were eating and talking around the bonfire, a pulsing yet strong light, hitted the attention of my girlfriend who immediately reported my attention to it. The object was approaching to land slowly and vertically; we then decided to run to see what was happening carrying a torch. We started to walk with suspicion into the woods, and as we were more and more closer to the object, its form started to emerge. It was a triangular craft, probably 9ft long an 6ft height entirely enveloped with aura-like pulsing lights, the color of aura would change dynamically from red to blue to black to white, with many shades. The object was making no sound at all, and was without any landing gear; it was as if was in suspension, and it was full of static electricity. After four minutes, my girlfriend was starting to be afraid of what she was looking at, yet (in my opinion) curious of the craft. We started to have an argument about what we had to do.(Either running to the police station to report the event, or staying there while traying to understand more of what was going on.) Meanwhile, the object started to lift-off at 2:14 AM, with no sound, no air disturbance, nothing. We started to retreat, as if we were perceiving a \"threat\". The object was lifting up between the trees, slowly, yet with decision. It stopped just above the trees, and... it's hard to find the words to describe it's velocity, but it was... probably instantaneous. In short, the speed was just unknown. During and after the event, our emotions were equal: wonder. We were wondering what was the that glowing light landing between the trees; we were wondering and questioning ourselves fruitlessly. Even though we were just feets from this craft or whatever it was, we felt \"hypnotized\" by it. Ultimately, we went to my parent; waking them up out of the blue. But... whomever we ever talked to, derision was the only result."],"Date Submitted":"02/10/2013 10:36 UTC","Object Shape":"Triangle","Region":"England","Sighting Duration":"00:04:00","Tags":"City"}