{"Tags":"City","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/45657.html.txt","/var/www/straped/mufon/org/45657.html"],"Date of the Event":"02/09/2013 11:45 UTC","Object Shape":"Star-like","Log Number":"US-02102013-0016","trends":["There have been 105 other sightings in Tampa","There were no other sightings in Tampa on or around February 9th 2013","This sighting has never been favorited.",""],"Disposition":"Unresolved","Longitude":"-82.448568","Country":"United States","Object Features":"Unknown","City":"Tampa","Source":"MUFON","Region":"Florida","Object Flight Path":"Straight-line path","Latitude":"27.956675","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Date Submitted":"02/10/2013 04:57 UTC","Summary":"Four Starlike objects rose one after another from behind Eastern tree lined horizon, then rose straight up into air, then traveled west.","divs":["sighting detailsi was outside smoking a cigarette, i looked to the east then i saw a large orange\\reddish starlike object rise straight up above the tree line as if it was taking off into the air. (maybe 10 miles away) once it rose to a certain distance, another one followed behind it. when those two rose to a distance they became just a reddish color, then they began traveling west, another one (3rd) rose from the tree line, rising straight up then following the two proceeding ones.i was just watching in shock thinking i wish i had my camera.when the first one had passed overhead at a far distance, the 2nd one wasn't too far behind.i watched them both head west toward orion, then they disappeared completely, when they should have been somewhat visible.i saw the 4th one rise from behind the tree line (like the 3 before them) it was also an orange\\reddish color, almost glowing with it until getting to a certain distance into the atmosphere, im not sure? they just became a red color once they started traveling west.while i watched all 4 of them rise, i didn't notice a sound around me at all. but it was when the 4th one rose that i ran into my house to get my phone to film them.when i came back out the 3rd one was already disappearing into thin air as it got closer to the orion constellation as well. the video i took of the 4th one, it is in the middle of the screen for the most part. it a red dot but it's visible.at some points it disappears, but shows back up. there are some street lights in the video as well, but its taken of the 4th one as it starts heading west, above and then as far west as i could see it on the camera screen."],"map":"<A HREF = \"http://maps.google.com/maps?q=27.956675,+-82.448568(45657)&iwloc=A&hl=en\"> mufon case (45657) map </A>","Case Number":"45657"}