{"Country":"United States","Sighting Duration":"Undisclosed","Log Number":"US-02102013-0014","Case Number":"45655","Summary":"Round Orange/Yellow orbs of light, approximately 40 blinking off and on, all together making a diamond shape in the sky approximately 1.5 football fields in length.","Object Shape":"Diamond, Fireball","divs":["sighting detailsi was driving on february 4, 2013 at approximately 7:15pm on i10 and dezavala road in san antonio, texas when another witness in the backseat of my car observed round orange\\yellow orbs of light, approximately 40 blinking off and on randomly. all the lights together making a diamond shape in the sky approximately one and a half football fields in length. i know this because we also observed a small plane underneath it and two small planes beside it as the orbs of light were turning off\\on randomly. the third witness on passenger side also observed the lights in disbelief. at first i thought something was falling from the sky, then i noticed the lights were hovering above. we attempted to film this ufo with our phones, but after several attempts, we were unable to film. as the orbs of light rapidly started to turn off, we were only able to get a small amount of pictures of these orbs. the pictures do not do it justice. we only got the end of the disappearing orbs. the total time we observed this was approximately 40 seconds before it dissappeared before our eyes. i still don't know what this was, just that we don't understand it and we have never seen anything like this before. if anyone knows of anything new going on with military experimenting with aircrafts that they have not yet told the citizens of us, i think it's time they fessed up. we need an explanation as to what we saw in the sky. i feel everyone has a right to know, that is why i am sharing my story. there were several cars driving by, there has to be other people who witnessed this phenomenon. p.s. after we viewed the pictures we also observed the lights were actually floating right above the parking lot right in front of us, although we didn't see them when we were actually there.....super strange."],"map":"<A HREF = \"http://maps.google.com/maps?q=29.588338,+-98.595265(45655)&iwloc=A&hl=en\"> mufon case (45655) map </A>","Weather Factors":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/45655.html.txt","/var/www/straped/mufon/org/45655.html"],"Longitude":"-98.595265","Object Features":"Patterned Surface","Region":"Texas","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around February 4th 2013"],"Viewing Distance":"101-500 Feet","Date Submitted":"02/10/2013 03:56 UTC","Object Flight Path":"Stationary","City":"San Antonio","Latitude":"29.588338","Disposition":"Unresolved","Date of the Event":"02/04/2013 07:20 UTC","Source":"MUFON"}