{"Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","divs":["Sighting DetailsAt approximately 12:30 am I saw a starlike object ascend in the NE, beginning at 60 degrees above the horizon. It reached approximately 80 degrees within two minutes. At first I thought it might be an approaching jet, but it had no strobes and it maintained the same size, indicating that it was not coming closer or moving away. It was only moving upwards. It was beneath the cloud cover last night - which makes me think it may have been of similar size to conventional aircraft. I base that on how planes usually look coming and going, as I live between O'Hare and Midway, and comparing the starlike object to regular air traffic luminosity. I had time to observe the object through binoculars, though they're not very strong. The object was pulsing and multi-colored. I watched this for a minute or so, it was only hovering at this point. It blinked out right then, and looked like a small white ember - just a pinpoint. Here's the weird part: when the object dimmed, a whitish meteor arced north from the object. As if the meteor came from it. The object made no sound. A plane with red strobes came from the direction of O'Hare (west), toward the object and the object disappeared. When the plane passed, the object became visible again, having moved about two inches right in a more easterly direction and now at about 85 degrees. The cloud cover began to obscure it from my view and I went inside shortly after."],"Region":"Illinois","Disposition":"Unresolved","Case Number":"45653","Object Shape":"Star-like","Summary":"Starlike object slowly ascending NE, faded and disappeared - primarily white but pearlescent","Weather Factors":"Unknown","Date of the Event":"02/10/2013 12:00 UTC","Tags":"City","trends":["There have been 15 other sightings in Forest Park","There were no other sightings in Forest Park on or around February 10th 2013"],"Latitude":"41.889616","Source":"MUFON","Log Number":"US-02102013-0012","City":"Forest Park","Date Submitted":"02/10/2013 02:23 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.889616,+-87.821524(45653)&iwloc=A&hl=en\"> mufon case (45653) map </A>","files":["/var/www/straped/mufon/html2text/45653.html.txt","/var/www/straped/mufon/org/45653.html"],"Object Flight Path":"Hovering then path","Country":"United States","Longitude":"-87.821524","Object Features":"None"}