{"divs":["Sighting DetailsI was leaving the public library when I noticed that the crepe myrtle bushes looked interesting under the parking lot lights. Photography is one of my hobbies. I have a habit of carrying my camera with me all the time. It was a very cold night. The temp was hovering around freezing. There was a possibility of sleet in the area, but this passed by. I got in my car and turned the heater on to warm up. I rolled down the driver's side window and pulled closer to the bushes. I'm still a novice with photography. It takes me a bit to experiment with manual camera settings to get the look that I want, especially with night time photography. I took about five shots of two different crepe myrtle bushes. I noticed nothing unusual. It was a very quiet night with very little traffic. I think most people were staying in because of the threat of ice. I heard no noise from airplanes. There was scattered cloud cover and stars visible through the clouds. I toyed with the idea of setting up my tripod to get some shots of the night sky, but it was just too cold. A couple of days later I opened the photographs on my PC to edit them. I noticed the three lights immediately. The mist and orbs in the right side of the pic are probably due to my cars engine. The three lights do seem to be up in the sky and not an odd reflection on the lens. The lights seem to illuminate the hazy cloud around them. Only one of the five pictures have the lights. I would be inclined to think that this was an airplane except for the low altitude and the lack of engine noise. Explanations are most welcome. The first attached photo is the original shot converted to jpeg format. In the second photo I have increased the contrast and the brightness."],"Date Submitted":"02/10/2013 08:06 UTC","Log Number":"US-02102013-0018","Source":"MUFON","Object Shape":"Triangle","City":"Cumming","Sighting Duration":"00:15:00","Latitude":"34.221201","Weather Factors":"Unknown","Date of the Event":"01/17/2013 08:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.221201,+-84.13237(45659)&iwloc=A&hl=en\"> mufon case (45659) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/45659.html.txt","/var/www/straped/mufon/more/45659_submitter_file1__image.jpg","/var/www/straped/mufon/more/45659_submitter_file2__image.jpg","/var/www/straped/mufon/org/45659.html"],"Country":"United States","Viewing Distance":"Over One Mile","Longitude":"-84.13237","Case Number":"45659","Disposition":"Unresolved","Region":"Georgia","Summary":"Discovered possible anomalous lights on photograph. Did not notice anything unusual when the pic was taken.","trends":["There have been 14 other sightings in Cumming","There were no other sightings in Cumming on or around January 17th 2013","This sighting has never been favorited.",""],"Object Features":"None","Object Flight Path":"Unknown"}