{"Country":"United States","Object Features":"None","files":["/var/www/straped/mufon/html2text/45675.html.txt","/var/www/straped/mufon/org/45675.html"],"Object Shape":"Cigar","Source":"MUFON","Object Flight Path":"Stationary","Weather Factors":"Unknown","divs":["Sighting DetailsI was driving East on I-96 at about 5:30 PM. I was around mile 128. I noticed the object stationary in the sky approximately 2 miles ahead of my car. It was not extremely high. I would guess it was less than 500 feet up. It was overcast, but bright out. I saw three bright lights in a row. They were in a line parallel to the horizon. The third light was the brightest. The first and second lights were very slightly farther apart than the second and third lights. I thought it was very odd that the object was stationary. I had a clear view of it, so I knew that it wasn't a light on a tower or anything. I also thought that the lights must have been very bright, considering my distance from them, and the fact that it was daylight out. I Eventually rounded a bend on the expressway and lost sight of it behind trees. I was very sad to lose sight of it, because I had been very excited to see it. I couldn't stop staring as long as it was in view, which was very distracting to my driving. After I got home, I tried to see if there had been any similar sightings reported online. I found out that there have been many in the past month in my area, as well as a year ago. There was also a very similar sighting in Australia yesterday."],"Log Number":"US-02112013-0013","Latitude":"43.020907","Date of the Event":"02/11/2013 05:28 UTC","City":"Flint","Longitude":"-83.683756","Sighting Duration":"Undisclosed","Region":"Michigan","Tags":"City","Summary":"3 bright lights in a row. parallel to horizon. third light brightest. slightly less distance between 2nd and 3rd light.","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=43.020907,+-83.683756(45675)&iwloc=A&hl=en\"> mufon case (45675) map </A>","Disposition":"Unresolved","Date Submitted":"02/11/2013 10:37 UTC","Case Number":"45675","trends":["There have been 40 other sightings in Flint","There were no other sightings in Flint on or around February 11th 2013"]}