{"Source":"MUFON","Log Number":"US-02122013-0004","divs":["sighting detailsi was traveling eastbound on heil ave from goldenwest, taking my kids to the regency theater on the corner of beach and warner when i could see this strange object in the sky with very bright lights. i could not discern its shape, but it had two red lights and a green light, all three very, very bright. they were not like the little lights on the wings of a plane. the object was stationary in the sky, hovering, and the two red lights were flashing in a sequence, as if an on\\off button turning them on and off. the green light stayed on without blinking or flashing and was very, very bright. as i was driving i had my son partially film it but it came out poorly since we were in motion. as we came to beach and made a right turn, there was a building obstructing our view. when we rounded the corner and could eventually see the sky, the object was gone. i don't know what path it took and could not see it anywhere. however, i must disclose that i immediately noticed this object in the sky because i saw an object that greatly resembled the one i saw tonight about three weeks ago. i left my house at about 8:30 p.m. to go to cvs on beach blvd, and i was traveling southbound on edwards toward heil when i noticed a large craft exhibiting these same bright lights; however, it had a single red, white, and green light. the green light was in the center, and all three lights were very bright. the green light in the center was much larger and brighter than the red and white light, although they were very bright as well. they did not blink or strobe or anything to that effect. the craft itself was large, larger than an airplane, but i could not make out its shape. it did not hover but was flying north in a direct path much lower than airplanes would. the lights on this object were of equal size and intensity as the object i saw tonight, except that there was no blinking on this particular night."],"Tags":"City","Object Shape":"Unknown","Longitude":"-117.989205","Date of the Event":"02/11/2013 06:25 UTC","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=33.715714,+-117.989205(45679)&iwloc=A&hl=en\"> mufon case (45679) map </A>","Object Flight Path":"Path then hovering","Region":"California","Object Features":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/45679.html.txt","/var/www/straped/mufon/org/45679.html"],"trends":["There have been 49 other sightings in Huntington Beach","There were no other sightings in Huntington Beach on or around February 11th 2013"],"Country":"United States","Latitude":"33.715714","Disposition":"Unresolved","City":"Huntington Beach","Weather Factors":"Unknown","Summary":"I saw the object NW of the intersection of Warner and Beach. I saw that it had 3 very bright lights: two red and one green. The red lights were very bright and were flashing. They were not blinking but were sequential w/ bright a steady green light","Case Number":"45679","Date Submitted":"02/12/2013 03:23 UTC"}