{"Viewing Distance":"501 Feet - 1 Mile","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=33.764487,+-118.168426(45677)&iwloc=A&hl=en\"> mufon case (45677) map </A>","files":["/var/www/straped/mufon/html2text/45677.html.txt","/var/www/straped/mufon/org/45677.html"],"Latitude":"33.764487","Tags":"City","City":"Long Beach","Object Shape":"Sphere","Case Number":"45677","Source":"MUFON","Log Number":"US-02122013-0002","Summary":"Two red orbs flying side by side, traveling soutbound along the coast of long beach. Followed by two others one behind the other. Lead orbs faded to black, third orb accelerated quickly , slowed down and turned then faded to black. Final orb fades .","Sighting Duration":"Undisclosed","Longitude":"-118.168426","divs":["Sighting DetailsWhile going on an evening run with my daughter we stargazed as usual and I noticed two red craft flying in very close proximity to each other. Being a former special forces operator in the Marine Corp I've seen many aircraft and these two caught my attention because they appeared to be flying in formation and there were no pulsating beacon lights. Just a constant red light on both, which is extremely unusual due to the Long Beach Airport being so close. We stopped running and began to walk as we watched these craft. The two craft in the front eventually faded to black before reaching the pier as they travelled southbound along the shoreline. The third craft behind them was the most peculiar as it abruptly accelerated for 1-2 seconds, banked hard west, slowed down and also faded to black. The fourth object faded to black soon after."],"Object Flight Path":"Path with directional change","Country":"United States","Date of the Event":"02/11/2013 08:10 UTC","trends":["There have been 45 other sightings in Long Beach","There were no other sightings in Long Beach on or around February 11th 2013"],"Object Features":"Unknown","Disposition":"Unresolved","Weather Factors":"Unknown","Date Submitted":"02/12/2013 12:47 UTC"}