{"Object Features":"None","Log Number":"US-02112013-0010","Case Number":"45672","Date of the Event":"02/08/2013 12:00 UTC","Region":"South Carolina","divs":["Sighting DetailsWas working outside when aircraft flew over pretty low and made uturn. When i looked up the sky was full of small very bright white lights. Thought they were just stars at first but noticed they were moving to the northwest at a steady speed. The aircraft after making the uturn went straight toward one of the lights. Could see the red light on the plane as it headed for the white light. It looked like the red light ran into the white light and they both disappeared. There were clouds to my south which was the direction of the aircraft. Possibl the aircraft disappeared behind the clounds. From my point of view the lights were about 5 miles wide but i could not determine the height. After about five minutes of viewing i could see maybe 3-5 aircraft lights which seemed to be about the same height of the white spheres. Some of the white lights were in small clusters and others made a zig zag like formation. I watched this event for over 30 minutes. The lights just kept a steady nothwest motion. I have watched the heavens for years. Been at sea at night with no light. I have never seen anything like this. Watching these small white lights gave me an uneasy feeling. After watching for about 30 minutes i told myself those were just stars and you are just tired from a long day at work. I would just forget about all of this but the plane flying overhead doing an 180 and intersecting the white light was just strange."],"Source":"MUFON","Longitude":"-79.755962","Date Submitted":"02/11/2013 03:13 UTC","Object Shape":"Sphere","Sighting Duration":"Undisclosed","trends":["There have been 11 other sightings in Florence","There were no other sightings in Florence on or around February 8th 2013"],"City":"Florence","Viewing Distance":"Unknown","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=34.203123,+-79.755962(45672)&iwloc=A&hl=en\"> mufon case (45672) map </A>","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/45672.html.txt","/var/www/straped/mufon/org/45672.html"],"Country":"United States","Tags":"City","Object Flight Path":"Straight-line path","Latitude":"34.203123","Summary":"was working ouside saw military aircraft come by, make uturn towards white light, looked like they intersected and both disappeared behind clouds to my south"}