{"Case Number":"4567","files":["/var/www/straped/mufon/html2text/4567.html.txt","/var/www/straped/mufon/org/4567.html"],"Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Source":"MUFON","Sighting Duration":"Undisclosed","Log Number":"US-03212006-0003","divs":["Sighting DetailsI was in Big Bend National Park. Me and a friend left Rio Grande Village after dark, car started fine and the lights were bright. Arrived at Dugout Wells (still within the park) about 30 minutes later, lights still bright on car with no dimness. Turned the car off to listen for owls and other wildlife (just rolled windows down and listened through window). About 10 minutes later (wanted to move to a better spot and get out of car) tried to start the car but nothing happended, it just went tunk. Not even the normal wa-wa-womp that you hear when you have a low battery. So I opened my car door to look under the hood, thought maybe I lost a fan belt for the alternator and that is why the car wouldn't start. I just couldn't imagine that the battery would do nothing when it was fine 10 minutes ago. When I opened the car door the dome light was bright then dim, then off completely, then dim, then off, then bright, etc. while the door buzzer was going through the same things, normal, weird buzz, no buzz at all. The radio lights came on then started flashing and freaking out, the radio at one point came on by itself then off by itself. While I was looking under the hood, the CD player started ejecting then sucking up the CD and didn't stop until I asked my friend to pull it out. It seemed like the car computer was freaking out for no apparent reason. A few minutes later we are sitting in the car with the doors closed, we are facing north adn to my left but behind me and behind some cottonwood trees but high in the sky, there is a huge explosion of light that stayed there for several seconds lighting up the sky then streaked towards the Earth (towards the Chisos Moutains which were south and a little west of us). It reminded me of a flare but it stayed suspended in the sky far longer, was far, far brighter, and it streaked towards the Earth at a much faster rate of speed than a flare (because of the parachutes on them). Moments later, to the east, on the face of a cliff in Mexico there was a light glowing, moving and changing colors. We could make out the outline of the top of the cliff in Mexico which I assume was about 30 miles away. The produced a glow across the desert which encompassed the car and lasted about 20 minutes then disappeared. The light on the cliff appeared and disappeared many times during this observation. About 15 minutes later, the light produced a spot light which scanned the desert, including our car. The spotlight changed colors from white to blue to red. This lasted for about 10-15 minutes. After watching the desert \"glow\" twice from the light on the cliff, I decided to go to bed. My friend stayed up for a few more hours with the same things happening on the cliff face. We thought about the lights being border patrol but how could they get a light on the side of a 1000 foot cliff. And if they could, why did they not check our car out when it was illuminated by spot light and the glow. The next morning, we hiked to the road, got a ranger to jump start my car. Charged my battery at panther junction gas station for an hour. The battery would not take a charge at all, I mean it stayed on \"zero\". This really puzzles me. The lights were bright as they always were when we stopped the car. I thought it could have been running directly off of the alternator to keep the lights bright but my experience and mechanics tell me that just an alternator could not keep the lights bright. BTW, our cell phone batteries were fine the next day which puts a damper on my magnetic field idea. So, could you explain any of this?"],"Object Features":"Unknown","Longitude":"-103.52935","Region":"Texas","Object Flight Path":"Stationary,Hovering then path,Straight-line path","City":"Study Butte-Terlingua","Date Submitted":"02/26/2006 08:30 UTC","trends":["There has been one other sighting in Study Butte-Terlingua","There were no other sightings in Study Butte-Terlingua on or around February 26th 2006"],"map":"<A HREF = \"http://maps.google.com/maps?q=29.321309,+-103.52935(4567)&iwloc=A&hl=en\"> mufon case (4567) map </A>","Object Shape":"Unknown","Country":"United States","Summary":"2 sky anomalies - one burst of light then streak to ground, one light source casting glows and spotlights across desert","Date of the Event":"02/26/2006 08:30 UTC","Tags":"City","Latitude":"29.321309","Disposition":"Hoax"}