{"Log Number":"US-02112013-0012","Disposition":"Unresolved","Weather Factors":"Unknown","Case Number":"45674","Object Shape":"Cylinder","Tags":"City","divs":["Sighting DetailsAt about 3:50 PM on Feb. 09,I observed an oblong, cylinder shaped object moving slowly from the NNE to the SSW. I at first believed it was a passenger jet as the local airport is nearby and the area occupied by the object is frequently used by approaching planes.Exiting the US127 N. highway onto the I-69 W. interchange ramp I pulled over to observe the object as something appeared \"wrong\" with what I was seeing.The object appeared about as large as say a DC-9 jet, but upon further observation I discovered the object displayed no wings nor did it have a vertical tail section.The object was a brilliant, \"clean\" white with no apparent projections from its body.It moved more slowly than what is typically seen from planes approaching the local airport for landing.It flew in an apparent straight line with no visible or apparent altitude changes.After watching it for a few minutes the crafts' aspect began to narrow as it apparently maneuvered to a more westerly path.As the object turned to where it would be seen only from behind, it could no longer be seen-it just disappeared.To confirm my own suspicions, I drove several miles West down I-69 to attempt to regain visual contact with the object but never saw it again.I believe it was originally flying slowly enough that I could have regained visual contact with it, assuming it maintained a similar speed and made no radical course changes.Interestingly, I don't think any of the other motorists driving by that day noticed anything strange about the object."],"Country":"United States","files":["/var/www/straped/mufon/html2text/45674.html.txt","/var/www/straped/mufon/org/45674.html"],"Date Submitted":"02/11/2013 09:14 UTC","Latitude":"42.792473","Summary":"Observed a cylinder/cigar shaped object that had no wings or vertical tail.No lights were seen.Object flew slowly and veered to the west/north west and could no longer be seen.","Region":"Michigan","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-84.543187","City":"DeWitt Charter Township","map":"<A HREF = \"http://maps.google.com/maps?q=42.792473,+-84.543187(45674)&iwloc=A&hl=en\"> mufon case (45674) map </A>","Object Features":"Unknown","Object Flight Path":"Path with directional change","trends":["There has been one other sighting in DeWitt Charter Township","There was one other sighting in DeWitt Charter Township on or around February 9th 2013"],"Sighting Duration":"Undisclosed","Date of the Event":"02/09/2013 03:50 UTC","Source":"MUFON"}