{"Country":"United States","Date of the Event":"02/11/2013 08:30 UTC","Date Submitted":"02/12/2013 12:07 UTC","files":["/var/www/straped/mufon/html2text/45676.html.txt","/var/www/straped/mufon/org/45676.html"],"Latitude":"36.073222","Longitude":"-86.992619","Source":"MUFON","Disposition":"Unresolved","Summary":"Large red pulsating object flying NW on a clear night.","Sighting Duration":"Undisclosed","trends":["There have been 72 other sightings in Nashville","There were no other sightings in Nashville on or around February 11th 2013"],"Region":"Tennessee","Object Shape":"Star-like","City":"Nashville","Object Flight Path":"Hovering then path,Straight-line path","divs":["Sighting DetailsCoyotes were going crazy howling in the back field, so I opened my back door to see how close they were, to my amaze they were closer than normal. I sat out on the back deck to listen for a moment when I noticed a larger than normal object in the clear night sky! The object was a red glowing sphere traviling NW as a somewhat steady speed. I grabbed my lenses to get a closer look, and to my surprise it was defiantly not a plane!! I called my wife out to take a look, and she was instantly stunned, she took a look through the binoculars and was shaken up with what she saw. I didn't have to say anything to her, she new what she saw and went back into the house startled . I remained outside until the object was out of sight steadily flying over the back mountain side into the night sky. This is the first time I am reporting anything I have seen out on the country side, this is not the only occurance of strange objects I have seen out here. There has been more and more occurances in the past 6 months that I can't explain! Luckily I know I'm not the only one seeing these things, we have had multiple witnesses, and I have photos of a landing with time, date, and GPS coordinates that happened back in July. I just thought its time to quit keeping all this to myself and share what has been occurring in the sky's over Tennessee!"],"Log Number":"US-02122013-0001","Case Number":"45676","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.073222,+-86.992619(45676)&iwloc=A&hl=en\"> mufon case (45676) map </A>","Object Features":"Unknown","Tags":"City","Viewing Distance":"Unknown"}