{"Latitude":"41.534331","Region":"Illinois","Date of the Event":"07/20/2007 08:10 UTC","City":"Joliet","Tags":"City","Date Submitted":"02/12/2013 12:37 UTC","files":["/var/www/straped/mufon/html2text/45687.html.txt","/var/www/straped/mufon/org/45687.html"],"Longitude":"-88.073135","Source":"MUFON","Object Shape":"Circle, Sphere","trends":["There have been 12 other sightings in Joliet","There were no other sightings in Joliet on or around July 20th 2007"],"Object Flight Path":"Path then hovering","divs":["Sighting DetailsI had just gotton of of work,walmart.my routeen was to get 1 can of beer and go to pilcher pk forest preserve to meditate.not sure of the exact date now , but around the middle of July 2007.I was standing by a creek,sipping on a can of beer,never finished it. standing there I looked up and saw a round rainbow , like a hula hoop, hovering in the sky.I was stunned because I never seen a round rainbow in my life.I was in a trance.I dont remember seeing it decend or how long it was or what happened after that.I remember next that this thing was about 5ft.front of me. I was afraid and excited at hhe same time.So Im standing there looking at this ring, a round rainbow colored ring hovering about 3ft. above the ground, about 5ft. wide in circumferance. the inside of the ring looked blurry compared to me looking on the outside of it, sort of watery looking.I feft electicfied and afraid like if I made the wrong move I wouldnt be here anymore. however, I managed to slowly pull my camera phone out of my pocket and took a photo. bad news is that later on I lost it. so I thinking I get to get out of here, I started backing away from this ring and when I got a safe distance, I turned and ran to my car and havnt been back there since.I did manage to show the photo to a preacher friend of mine before I lost my camera phone."],"Summary":"Around july 2007 I was in the forest preserve and I saw a round rainbow over a creek and it came down to me.","Case Number":"45687","map":"<A HREF = \"http://maps.google.com/maps?q=41.534331,+-88.073135(45687)&iwloc=A&hl=en\"> mufon case (45687) map </A>","Object Features":"Unknown","Sighting Duration":"00:00:00","Country":"United States","Weather Factors":"Unknown","Disposition":"Unresolved","Viewing Distance":"20 Feet or Less","Log Number":"US-02122013-0012"}