{"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/45683.html.txt","/var/www/straped/mufon/org/45683.html"],"City":"Chigasaki","Log Number":"JP-02122013-0008","Object Features":"None","Object Shape":"Other","Viewing Distance":"101-500 Feet","Country":"Japan","map":"<A HREF = \"http://maps.google.com/maps?q=35.33386,+139.404716(45683)&iwloc=A&hl=en\"> mufon case (45683) map </A>","trends":["There have been no other sightings in Chigasaki","This sighting has never been favorited."],"Source":"MUFON","Disposition":"Unresolved","Date Submitted":"02/12/2013 09:07 UTC","Summary":"I missed an opportunity to film it front on!","Latitude":"35.33386","divs":["Sighting DetailsIt was a windless evening, I was taking my two sons, aged 2.5 and 5.5 to their grandparent's house. The youngest was going slow, holding onto a fence with both hands imagining he was on some adventure; I guess. So I told him to look at the plane to distract him. I noticed the plane was quite unusual immediately but was more concerned about my sons' well-being. I called to elder, as he was getting some distance from me to look at the plane too; so as to gather us together. He remarked that the plane was shooting. I laughed and said it's not shooting, but that it was unusual. A few weeks earlier I had told him about the difference between the speed of light and sound like, as we frequently observe military jets, propelled craft and high altitude commercial aircraft. I told him to wait for the sound to come. We waited, and he said \"It's shooting. I told him it wasn't. It was just the lights flashing. That's when he said it was a UFO, and I suddenly realised it had passed, and there still wasn't any sound to account for it. I then proceeded to take out my phone, get the camera selected and take some video; resulting in the back end video which I have. It's from a Samsung Galaxy S 2LTzE, so it is in 1080 but I feel like a prize banana for not realizing sooner when I could have got a frontal and passing shot."],"Date of the Event":"02/10/2013 12:00 UTC","Tags":"City","Longitude":"139.404716","Case Number":"45683","Region":"Kanagawa Prefecture","Object Flight Path":"Straight-line path"}