{"Object Flight Path":"Straight-line path,Path with directional change","Viewing Distance":"20 Feet or Less","Region":"Florida","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=28.708212,+-81.335101(45682)&iwloc=A&hl=en\"> mufon case (45682) map </A>","City":"Longwood","Object Shape":"Sphere, Unknown","Source":"MUFON","Summary":"Small obeject that changed colors when moving in different direction","Date Submitted":"02/12/2013 09:20 UTC","Case Number":"45682","trends":["There have been 6 other sightings in Longwood","There were no other sightings in Longwood on or around February 11th 2013"],"divs":["Sighting DetailsMy teenage daughter was driving home from the store at about 8:30 pm last night. As we were coming down the block I noticed a green small light cross the road at about 20 feet overhead that left a trail as it moved. My first thought was a lightning bug, but I then realized it was too big to be and I never see lightning bugs here. We pulled into driveway and I jumped out of the car looking up. It was then about 10 to 15 feet overhead and moved diagonally but was now red also leaving a trail. As it moved all you could see was a color trail and no object. I was never able to actually see an object which blew my mind because it was not that far! I looked toward the treetops across the street and saw a white light blink once and never saw it again. I just stood there dumbfounded trying to understand what it was that I just saw. I started to feel faint or woozy and decided to go inside. As soon as I went inside my husband asked me what I was looking at and I said I saw something. He then began to describe the same thing with the same colors that he had seen earlier in the evening before I could describe to him what I saw. It seemed as if it was crisscrossing the street going over homes for some reason and felt as if it was alive in some way? I am having a hard time explaining the experience."],"Disposition":"Unresolved","Latitude":"28.708212","Date of the Event":"02/11/2013 08:30 UTC","Log Number":"US-02122013-0007","Longitude":"-81.335101","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/45682.html.txt","/var/www/straped/mufon/org/45682.html"],"Country":"United States","Object Features":"None","Weather Factors":"Unknown"}