{"files":["/var/www/straped/mufon/html2text/45698.html.txt","/var/www/straped/mufon/org/45698.html"],"Object Shape":"Circle, Disc, Oval, Star-like, Unknown","Region":"Louisiana","Weather Factors":"Unknown","Tags":"City","Date Submitted":"02/14/2013 04:17 UTC","Date of the Event":"02/13/2013 07:25 UTC","Case Number":"45698","Log Number":"US-02142013-0002","map":"<A HREF = \"http://maps.google.com/maps?q=30.016472,+-89.955483(45698)&iwloc=A&hl=en\"> mufon case (45698) map </A>","Source":"MUFON","Viewing Distance":"Over One Mile","Object Features":"Other","Longitude":"-89.955483","Latitude":"30.016472","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Straight-line path","Country":"United States","trends":["There have been 26 other sightings in New Orleans","There were no other sightings in New Orleans on or around February 13th 2013"],"divs":["Sighting DetailsNOT ONE BUT MANY UFO'S. MARTIANS TRIANGLE AND A MINI TRIANGLE. BUT UFO'S FORMED THE MINI TRIANGLE, WHICH IS NOT THE 1ST TIME HERE IN BATON ROUGE. THE LAST WAS FOUR MONTHS AGO ALSO ON THE 13 ON THE MONTH OF OCTOBER. THEN AS IM DESCRIBING ORIONS BELT AND OTHER NAMES IT HAS TO NYSIA, OUT OF NOWHERE A UFO AT HIGH SPEEDS FLYS ACROSS THE SKY. BUT AS IT DOES, IT GETS DIMMER. THEN EVENTUALLY GOES INVISIBLE. THEN 30 SECONDS LATER, ANOTHER COMES RACING AFTER THE FIRST AND IT DOESNT BOTHER TO DIM ITS BRIGHT RED AND GREEN LIGHTS. TWO HOURS LATER WHILE IM ON THE PHONE WITH DEAR MOTHER, ANOTHER NOT AS FAST, GOES IN THE SAME DIRECTION. THEN RIGHT OVER CAMPUS FOR THE WHOLE TWO HOURS, ONE JUST SITS. THEN EVENTUALLY ASCENDS. LET ME REMIND YOU, NYSIA WITNESSED IT ALL TOO. I BELIEVE THEY'VE BEEN FOLLOWING ME AND HER. SINCE I GOT HERE AND BEEN OUT ON THE BALCONY, I'VE WATCHED THEM IN THE SKY. IM AFRAID TO GO TO SLEEP, AFRAID OF LOSING HOURS, MINUTES, SECONDS. WHATEVER THEY WANT MUST BE HERE IN THIS STATE. OR THEY REALLY ARE JUST FOLLOWING ME AND NYSIA. FOR YEARS WE'VE WATCHED THE SKY. TONIGHT THEY JUST SEEMED TO BE CLOSE ENOUGH TO SEE."],"Summary":"like they was racing after another","Disposition":"Unresolved","City":"New Orleans"}