{"Date of the Event":"12/15/2001 12:00 UTC","Summary":"I saw a ship with red lights in the back in a tail-light configuration","Object Features":"Unknown","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Latitude":"39.961135","Date Submitted":"12/15/2001 12:00 UTC","City":"Philadelphia","divs":["Sighting DetailsI was sitting in couch, which I don't uasually sit in; it gave me a view of the. left window; full view. I saw a bright light beaming down. in the left side of this window. I thought it was helicopter, until I saw it wasn't. What it was was obscured by the very bright light; but it wasn't a helicopter which I have seen easily, But then when it went away, I could see the redights, rectangular; and it was huge;the length of a bridge. It traveled east to the Delaware River, then south; I eventually lost sight of it. It was a cold, dark moonlesss night and no other airplanes were in the vicinity. I think because it was Sunday night and cold. It had to be a ship, although I couldn't make out the outline of a ship. But, it wasn't a helicopter or plane or blimp. I'd never seen anything like that before. I wasn't on drugs, alcohol, hallucinogen, LSD, or anything; I was stone cold sober. It was just there. although airliners circle overhead headed toward South Phila.,(I live in Northeast Phila,), they're relatively tiny. It wasn't an airliner, and airliners never beam down a brightlight. It was a UFO. I'm not making this up; my background is in science and I went to colllege, full-time. I majored in science and I'm currently studying computer prgoamming. Unfortunately, I never bought a video cam."],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.961135,+-75.155439(4569)&iwloc=A&hl=en\"> mufon case (4569) map </A>","Country":"United States","files":["/var/www/straped/mufon/html2text/4569.html.txt","/var/www/straped/mufon/org/4569.html"],"Longitude":"-75.155439","Log Number":"US-03212006-0005","Viewing Distance":"101-500 Feet","Object Flight Path":"Hovering then path","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around December 15th 2001"],"Region":"Pennsylvania","Source":"MUFON","Object Shape":"Square, Rectagular","Tags":"City","Case Number":"4569"}