{"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Tags":"City","Object Shape":"Disc","Source":"MUFON","Date of the Event":"02/08/2013 05:45 UTC","Country":"United States","Case Number":"45699","Date Submitted":"02/14/2013 02:24 UTC","Disposition":"Unresolved","City":"Monument","Object Flight Path":"Stationary","divs":["sighting detailswe were driving to have dinner. the road goes down the hill, towards the west, sun was setting, sky was clear and any object in front of the sun would appear dark, but not this object. i noticed the golden light because it appeared suddenly as if it was turned on. i am used to seeing airplanes in the area, but this light behaved differently. when a big airplane lands, it would have red\\green lights flashing. this light only had golden color and it was brighter. the object was hovering before the front range mountains, so i could calculate the distance. when helicopters fly in that area, you would see the shape of a helicopter. i thought that the golden light definitely was not an airplane or helicopter, but it was clearly sitting still in the air. suddenly the light vanished as if it was turned off. i started doubting myself, may be it was a big airplane on a landing approach, strange flight path of course as we never have big airplanes approach that low above the mountains. a minute or so later the same golden light reappeared in the same position and this time it stood still for longer (10 minutes). i kept watching it (i wasn't the driver). that's when i became 100% sure it was not a big airplane or a helicopter. by then we dropped in elevation so i could see what was on the ground below the position of the light and it was hovering above air force academy. ten minutes later light vanished again and this time did not reappear, or at least i didn't see it as we went into the restaurant. unfortunately i didn't take pictures."],"Log Number":"US-02142013-0003","files":["/var/www/straped/mufon/html2text/45699.html.txt","/var/www/straped/mufon/org/45699.html"],"Sighting Duration":"Undisclosed","Object Features":"None","Longitude":"-104.865848","trends":["There have been 6 other sightings in Monument","There were no other sightings in Monument on or around February 8th 2013"],"Summary":"Golden light sat still in the sky.","map":"<A HREF = \"http://maps.google.com/maps?q=39.100339,+-104.865848(45699)&iwloc=A&hl=en\"> mufon case (45699) map </A>","Weather Factors":"Unknown","Latitude":"39.100339","Region":"Colorado"}