{"map":"<A HREF = \"http://maps.google.com/maps?q=37.781119,+-122.522948(45691)&iwloc=A&hl=en\"> mufon case (45691) map </A>","Case Number":"45691","Longitude":"-122.522948","City":"San Francisco","Country":"United States","Object Features":"Unknown","divs":["Sighting Details At 9:05 pm I was outside having a smoke when I saw something over the ocean (my fire escape has a view of the sea). It was BRIGHT red when I first noticed it (and I mean super freaking bright, almost exactly like an emergency flare, which is what I thought it was at first), and glowing with such intensity that it appeared to have a misty sheen around it, as if it was pointing a bright light directly at me (the sky was clear enough to see stars, but there's always some moisture in the air over the ocean). I was absolutely transfixed. It deviated slightly on its path as it appeared to be slowly progressing towards me, so at first I thought it must be a small airplane (as the big ones, big enough to have a light that bright, never visibly deviate from a smooth arc, I thought). But it was soon moving about as fast as a quick LEAR jet (heading toward the Southeast), and (here's the spooky part) was absolutely silent as it passed overhead. I see (and hear!) tons of air traffic over SF (my view faces south, toward the airport), and this was not like anything I have ever seen. It remained very bright until it had passed overhead, and then suddenly became a dim red glow which I watched until it receded over the East horizon. I am absolutely sure that this was not a satellite, as I have seen many. Sighting lasted about two minutes, or less."],"Date of the Event":"02/10/2013 09:03 UTC","trends":["There have been 127 other sightings in San Francisco","There was one other sighting in San Francisco on or around February 10th 2013"],"files":["/var/www/straped/mufon/html2text/45691.html.txt","/var/www/straped/mufon/org/45691.html"],"Summary":"Very bright red light, passed at moderate pace overhead, dimmed suddenly, proceded over horizon","Region":"California","Disposition":"Unresolved","Source":"MUFON","Viewing Distance":"Over One Mile","Tags":"City","Object Flight Path":"Hovering then path","Latitude":"37.781119","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Log Number":"US-02122013-0016","Date Submitted":"02/12/2013 11:30 UTC","Object Shape":"Unknown"}