{"Weather Factors":"Unknown","Date of the Event":"10/15/2000 12:00 UTC","files":["/var/www/straped/mufon/html2text/45705.html.txt","/var/www/straped/mufon/org/45705.html"],"Sighting Duration":"Undisclosed","Summary":"hovering just above tree top at my home, rounded shape, no wind or air from the saucer","Source":"MUFON","Longitude":"-89.920202","Disposition":"Unresolved","divs":["Sighting DetailsI was first sitting in my living room watching TV just as the 10 o'clock nightly news went off, There was some program came on and while I was watching it I saw a light through my glass door so I went out side to see what it were and I thought it was a helicopter light looking for something so I stay there waiting while it got closer and closer I heard no noise and by time it got closer to me I notice it wasn't a helicopter, but to my surprise it was a flying saucer. I call my brother to see what I was looking at and he came out and he begin to follow behind the saucer and so did I, but I, turn around because I was very afraid,so I saw this thing turn to my right heading north west of town...till this day I can't sleep the only noise I heard was a low sound and the lights that was on went off but it was still very clear to us what we was witnessing a flying saucer. it was a clear night and the thing was so close to us we could see it full shape at the bottom and edges. I never told many people about it ,because people will say other wise. since the year 2000 of oct. I have not been the same. the tree top didn't move there was no wind coming from it. the noise we heard only when it hover over our head. the next day there was other people say they saw it as well, but was afraid to come forward...thinking people will think they was crazy...etc."],"Country":"United States","Tags":"City","Region":"Mississippi","trends":["There have been no other sightings in North Carrollton","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.519536,+-89.920202(45705)&iwloc=A&hl=en\"> mufon case (45705) map </A>","Object Shape":"Circle, Disc","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Date Submitted":"02/14/2013 09:47 UTC","Log Number":"US-02142013-0008","Case Number":"45705","Object Features":"Window(s)","Viewing Distance":"21-100 Feet","Latitude":"33.519536","City":"North Carrollton"}