{"City":"Kansas City","Latitude":"38.890081","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.890081,+-94.576699(45700)&iwloc=A&hl=en\"> mufon case (45700) map </A>","Log Number":"US-02142013-0004","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Sighting Duration":"Undisclosed","trends":["There have been 134 other sightings in Kansas City","There were no other sightings in Kansas City on or around February 12th 2013"],"Date of the Event":"02/12/2013 01:45 UTC","Region":"Missouri","Country":"United States","Object Flight Path":"Hovering then path","Case Number":"45700","files":["/var/www/straped/mufon/html2text/45700.html.txt","/var/www/straped/mufon/org/45700.html"],"Object Shape":"Cylinder","Longitude":"-94.576699","Date Submitted":"02/14/2013 05:52 UTC","divs":["Sighting DetailsAs described over the phone to ASD: I was outside early this morning and saw a bright object the size of a dime held at arm's length in a gap in the trees. The object had red, blue, and yellow lights. It appeared to be a cylinder shape although I could not make out any structure - just the bright light or lights that appeared to be rotating and moving around. I watched for 20 minutes but needed to go back inside for my jacket and grabbed my Sony night shot camcorder. I was able to take video of the object for approximately 5 minutes. The HD video does no justice to how colorful it was... it was stationary for abut 20 min and then moved away toward the southwest. There was no sound whatsoever, and no wings, or red or green lights on wings, and no strobe light. A helicopter came in from the North but did not pursue the object. I could hear the helicopter but not the object. I got in my car and gave chase to the object, which at that time was at the top of the radio towers and headed Southwest. It was slow moving at first, then picked up speed. I estimate that it was approximately 1 mile away from me at first and may have been over the State Meadow Golf Course, then got further away. I could not catch up with it and lost sight of it. I work in Avitronics and am very familiar with aircraft. This object did not appear or behave like any aircraft I've ever seen. I would like to know if anyone else saw this and what your opinion is as to what it was."],"Summary":"Strange bright multi-color lights over Kansas City","Object Features":"None","Tags":"City"}