{"City":"Hillsdale","Viewing Distance":"Unknown","Source":"MUFON","Date of the Event":"03/01/2006 11:00 UTC","Sighting Duration":"02:00:00","Longitude":"-84.63051","Summary":"3 round objects silently stood still with a white light in center with green lights rotating in circle under the disks. Then I watched them move in a flash upward & side ways & off they went in a flash. Gone in a blink with no notice. I see this often .","Date Submitted":"03/01/2006 11:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.920047,+-84.63051(4570)&iwloc=A&hl=en\"> mufon case (4570) map </A>","Country":"United States","Latitude":"41.920047","Object Features":"Unknown","trends":["There have been 4 other sightings in Hillsdale","There were no other sightings in Hillsdale on or around March 1st 2006"],"Tags":"City","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Object Shape":"Circle, Disc","Region":"Michigan","Log Number":"US-03212006-0006","Disposition":"Unknown","Weather Factors":"Unknown","divs":["Sighting DetailsI was sitting in my livingroom & watched out my window.I live in the country. I noticed it because the unusual lights like to hover over our near by field. One night recently my mom saw a craft & it hovered over a tree up high & suddenly was gone that quick & cars came out to the field to see what it was afterwards so we heard the next day from others who saw this too.I to date don't believe these are planes because they just sit there as in no movement untill they move sideways or up suddenly not like a helicopter.The lights are not like a plane. They are underneigh several green lights cicling with a white light very bright in the middle. We have been quite shaken for we can't explain what they are & it's quite a shaken feeling to know they are comming back at night. I know were in a flight path for you see regular planes & can tell the difference very well. I have lived here for years & can tell you this has only been noticable since the beginning of december up to now.I'am now trying to get good pictures for someone else to see. If someone can tell me what it is please let me know."],"Case Number":"4570","files":["/var/www/straped/mufon/html2text/4570.html.txt","/var/www/straped/mufon/org/4570.html"]}