{"map":"<A HREF = \"http://maps.google.com/maps?q=38.499717,+-94.941991(45703)&iwloc=A&hl=en\"> mufon case (45703) map </A>","Tags":"City","divs":["Sighting DetailsIn 1972 we were driving towards the small town of Osowatomie Kansas. I suddenly noticed a very quick pulsating object coming on the opposite direction. I told my ex husband to look and he laughed saying it was just a plane. Inmediately the small disk shaped object descended at great speed and flew right next to me on the passenger side. It was so low that I noticed one of its small lights on the side was half burned. I rolled down the window and there was only a buzzing sound. I began to scream at my exhusband to stop the car but by that time he appeared to be in a state of panic. As he accelerated the car to get away from it the object kept up with our car the whole time. The next thing I remember is our car stopped on the shoulder of the road and me looking back to see the object turn into a very bright light and take off vertically. I do not remember what happened between the time we were being chased and the time we found ourselves stopped on the rd. I got home and told my mother that we had seen a UFO and I fell asleep until the next morning. It was only 9pm. To me one of the strangest things is why my ex husband and I never spoke about it....It makes absolutely no sense. There is no question that I have been traumatized all these years because I go back to this night over and over again over the course of my life. I try to re-live the whole event trying to make some sense of it because by nature I am a skeptic. I heard that my ex husband would not mind talking about it now after so many years..and I do know that I want to speak to him so that I can hear for the first time what he remembers...When I try to re-live the event I realize that the object was so small and almost flat that it could not have held anyone inside.. Tere is another part to this event which I have not related because of how unsure I am of that and this event being connected. But I do have other memories but I cant tell with certaintity if they were a dream.Meaning the rekated event DID happened..the other memories I seem to have I don't know if they came from a dream or not.. Thanks.."],"Object Features":"Dome","Log Number":"US-02142013-0006","trends":["There has been one other sighting in Osawatomie","There were no other sightings in Osawatomie on or around December 15th 1972"],"Weather Factors":"Unknown","Viewing Distance":"20 Feet or Less","Object Shape":"Disc","Summary":"In 1972 my ex husband and I witnessed a small disk shaped object that descended all the way down next to me on the passenger side. It had two small lights on each sude that resembled upside down cups and one of them appeared to be half burned.","Source":"MUFON","Date Submitted":"02/14/2013 09:16 UTC","Region":"Kansas","Longitude":"-94.941991","Date of the Event":"12/15/1972 07:00 UTC","Latitude":"38.499717","City":"Osawatomie","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Country":"United States","files":["/var/www/straped/mufon/html2text/45703.html.txt","/var/www/straped/mufon/org/45703.html"],"Disposition":"Unresolved","Case Number":"45703"}