{"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","Disposition":"Unresolved","Viewing Distance":"21-100 Feet","Latitude":"40.626725","files":["/var/www/straped/mufon/html2text/45704.html.txt","/var/www/straped/mufon/org/45704.html"],"Object Flight Path":"Path with directional change","Log Number":"US-02142013-0007","Source":"MUFON","Summary":"swoped in and stopped above trees just above us","Longitude":"-79.143365","trends":["There have been 3 other sightings in Indiana","There were no other sightings in Indiana on or around January 12th 2013"],"City":"Indiana","map":"<A HREF = \"http://maps.google.com/maps?q=40.626725,+-79.143365(45704)&iwloc=A&hl=en\"> mufon case (45704) map </A>","Object Features":"Unknown","Country":"United States","Date of the Event":"01/12/2013 12:00 UTC","Region":"Indiana","Date Submitted":"02/14/2013 09:33 UTC","Case Number":"45704","divs":["Sighting Detailscoming south on interstate 31 made a right turn on interstate 47 heading west. place is bakers corner just west of 47. saw a light coming down I thought it was a plane coming in for landing. i leaned forward to get an idea what direction it was to the right side of my car. i was looking thru my windshild. looking up I saw a red light about 40 ft up and it changed to a bright light then to a bluish light. this light had abought 3 to 4 ft diameter and i could see it was resessed. thats when i noticed the red light was above and to the rear of the car. at that time the lights blinked off. i was trying to locate them when i looked in the mirrow and saw a vehicle with one light coming up behind me. i proceded driving that vehicle followed me. when i got to interstate 421 the vehicle was no longer there. i thought it may have been a tower at that location. i went back a few days later no tower. there is a few towers in the area but none had the shape of lights that i saw. what ever it was seemed to have stopped right above us and the trees. it bothered me that i couldn't get a better look thats why i went back to the area. my brother and i had another incident in 1959 or 1960 thats why i guess i didn't feel threatend."],"Object Shape":"Other, Unknown"}