{"Date Submitted":"02/15/2013 05:19 UTC","Log Number":"US-02152013-0011","map":"<A HREF = \"http://maps.google.com/maps?q=39.340756,+-77.052407(45717)&iwloc=A&hl=en\"> mufon case (45717) map </A>","Longitude":"-77.052407","Latitude":"39.340756","Case Number":"45717","Sighting Duration":"Undisclosed","divs":["Sighting Detailsat 250 pm on friday feb 15th, i observed an employee of the state of Maryland scanning the sky to the northeast of the shopping center i was driving my work vehicle at. He was pointing at something and talking to another person employed at the shopping center. I drove around to my next stop a couple hundred yards away and exited my truck. As i was walking towards a grocery store i looked up in the air and made out what at first i believed to be 2 birds hovering a thousand feet up in the air. As i watched, i noticed that neither object had any wings or appendages. they hovered silently for about 30 seconds, and then i continued into the store. when i exited the store , there was increased cloud cover and the objects could not be seen. As i reflected on the sighting, the objects did not move whatsoever, which led me to believe they were not birds or balloons. there was a slight breeze blowing so if they were balloons then they would have deviated from their posistion. Also i find it difficult to beleive that 2 birds spaced about 20 yards apart could both hover with no spreading or flapping of wings. Later as i was driving back to my station, i passed some balloons tethered above a shopping center a few miles East. these balloons were obvious balloons and only reached to treetop level, whereas the objects sighted earlier had no tether and were at least 1000 feet up."],"Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"02/15/2013 02:50 UTC","Object Features":"None","trends":["There have been 2 other sightings in Woodbine","There were no other sightings in Woodbine on or around February 15th 2013"],"Object Shape":"Cylinder, Other","Summary":"saw someone pointing at sky , looked up and observed 2 dark objects hovering in the sky .","Object Flight Path":"Unknown","Region":"Maryland","City":"Woodbine","files":["/var/www/straped/mufon/html2text/45717.html.txt","/var/www/straped/mufon/org/45717.html"],"Disposition":"Unresolved","Country":"United States","Tags":"City","Source":"MUFON","Weather Factors":"Unknown"}