{"Sighting Duration":"Undisclosed","Disposition":"Unresolved","trends":["There has been one other sighting in Edinburgh","There were no other sightings in Edinburgh on or around February 15th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.361718,+-85.956898(45711)&iwloc=A&hl=en\"> mufon case (45711) map </A>","Weather Factors":"Unknown","Date of the Event":"02/15/2013 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-02152013-0005","divs":["sighting detailsi am in the military, stationed south of indianapolis in. i work third shift, during a cigarette break, i noticed the object approximately a mile above the ground, inside our airspace. its part of my job to keep track of all aircraft in our area, and we werent tracking anything. i could tell that there was some definite pulsating lights, figuring it was just a commercial aircraft, i checked my phone for texts and looked back up approximately 2 minutes later. the object appeared to have lost elavation but was still in the same general area. i keep my spotting scope in my vehicle most of the time, i am a long range shooter, and use it to look at the moon on occasion its a 20-60x leupold scope, very nice glass. once i got a clearer view of what i was looking at i took a picture with my iphone which is very difficult, but i'm getting better from practicing taking pictures of the moon. this object was not a commercial aircraft. it had a round structure to it, and atleast one main source of light underneath and possibly more smaller light sources around its bottum edge, it was so far away by this time, and the wind was blowing head on into my scope. if it increases my credibility i am a veteran observer\\sniper. i am trained to be able to recall detailed information on things in stressful situations all the time. i have no explanation for what i saw the other night and the photo although taken on an iphone gave me goose bumps when i saw how good it came out. i continued to watch this object for about 15 minutes until like a flame dying out it disappeared."],"Longitude":"-85.956898","Tags":"City","Source":"MUFON","Region":"Indiana","Latitude":"39.361718","City":"Edinburgh","Date Submitted":"02/15/2013 03:55 UTC","Object Flight Path":"Path then hovering","files":["/var/www/straped/mufon/html2text/45711.html.txt","/var/www/straped/mufon/org/45711.html"],"Country":"United States","Summary":"Strange glowing object seen near Camp Atterbury","Object Features":"Unknown","Object Shape":"Unknown","Case Number":"45711"}