{"Region":"Texas","divs":["Sighting Detailsit was about 2 to 3 o'clock in the morning when I couldn't sleep so I thought I go outside get some fresh air. then I started to notice a small pulsating light at the corner of my eye. I first noticed the light when it started to get bigger and brighter. When it started to cross the sky in crazy patterns and then more objects suddenly appeared. They began to pulsate sequintually while still getting brighter. After about an hour,all but one of the objects dissappeared. Then the last object got much brighter and while rising swiftly to the sky started pulsating and concentrated on the blues and greens (prevously emmiting a whide variety of colors). While the object was flashing blue and green I started to get violent headaches that lasted only about 1 - 2 minutes then then the object turned solid white and shot across the sky. If I blinked I probably would have missed it going away. As soon as the object was out of sight my headache stopped. For a moment when I was having the headache I thougt I heard a weird sounding voice. It seemed to be a language of some sort but the voice did not sound like a person. I could not figuer out what the voice was saying. I THOUGHT I WAS GOING CRAZY. after all but 1 of the object disappeared I was feeling very uncompfertable and sick to my stomach. Thats all I can remember."],"Case Number":"45710","Tags":"City","Longitude":"-94.789594","trends":["There has been one other sighting in Henderson","There were no other sightings in Henderson on or around November 25th 2012"],"Object Shape":"Disc, Sphere, Star-like","Sighting Duration":"01:20:00","files":["/var/www/straped/mufon/html2text/45710.html.txt","/var/www/straped/mufon/org/45710.html"],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Summary":"multiple glowing orbs with slightly shiny surface when not emmiting light and I also started getting headaches when the lights started getting much brighter and more colors started to appear","Date of the Event":"11/25/2012 02:30 UTC","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","Source":"MUFON","Weather Factors":"Unknown","City":"Henderson","Date Submitted":"02/15/2013 02:13 UTC","Latitude":"32.205697","Country":"United States","Log Number":"US-02152013-0004","map":"<A HREF = \"http://maps.google.com/maps?q=32.205697,+-94.789594(45710)&iwloc=A&hl=en\"> mufon case (45710) map </A>","Disposition":"Unresolved"}