{"Source":"MUFON","Sighting Duration":"Undisclosed","Date Submitted":"02/15/2013 10:22 UTC","divs":["Sighting DetailsWas flying from Nashville to Detroit. Video was shot around 11am ET. Throughout the flight the plane made an unusual amount of turns. Around 11am ET I looked out the window and observed a very bright light keeping pace with our airplane. It was cloudy and the sun was above. I figured that the sun was maybe reflecting off something to generate the bright light. I took video of the bright light and as we went through clouds it appeared that clouds would go over the object and to block its light. The object then dissappeared. Roughly two minutes later or so the object reappeared, figuring it was just a reflection of the sun I tilted my phone camera up to shoot the sun and caught an object above our plane. My flight was scheduled to land at 11:30, so we may have started to make our desent into Detroit, our cruising altitude was 31,000 feet. If we were descedning it was in the very beginning stages of our descent when I shot the footage. I did not realize I had caught the image of the object above my plane until about 5 minutes after shooting it, and I watched the footage back. I did not have lights on at my seat when I shot the footage of the object. I am not sure what the object is, or if its a reflection of some kind. Please let me know what you think."],"Latitude":"40.419047","City":"Happened in the air","Summary":"Glowing Orb - Large Object above Orb - Shot from Airplane 30,000 plus feet.","Case Number":"45715","Object Flight Path":"Straight-line path","Longitude":"-82.898153","Disposition":"Unresolved","Log Number":"US-02152013-0009","Country":"United States","Tags":"City","trends":["There have been no other sightings in Happened in the air","This sighting has been favorited 1 time."],"files":["/var/www/straped/mufon/html2text/45715.html.txt","/var/www/straped/mufon/org/45715.html"],"Object Features":"Dome, Window(s), Patterned Surface, Other, Unknown","Viewing Distance":"Unknown","Weather Factors":"Unknown","Object Shape":"Circle, Other, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.419047,+-82.898153(45715)&iwloc=A&hl=en\"> mufon case (45715) map </A>","Region":"Ohio","Date of the Event":"02/14/2013 12:00 UTC"}