{"Object Shape":"Sphere","Object Flight Path":"Path with directional change","Latitude":"-37.804637","Object Features":"Unknown","Tags":"City","Country":"Australia","Longitude":"144.96672","Region":"Victoria","Summary":"Odd glowing lights x 2","City":"Melbourne","Case Number":"45714","Weather Factors":"Unknown","Date Submitted":"02/15/2013 06:26 UTC","trends":["There have been 40 other sightings in Melbourne","There were no other sightings in Melbourne on or around February 15th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=-37.804637,+144.96672(45714)&iwloc=A&hl=en\"> mufon case (45714) map </A>","Disposition":"Unresolved","divs":["Sighting DetailsI was sitting in my lounge room watching a movie, I'd already seen the movie so I decided to go and take some photos of the stars I had recently got the camera and had been taking photos. It was 9:40 when I looked at my phone. I went outside and had my camera, I was playing with the settings when I looked up for a good shot, I looked over the house past the palm tree and to my eyes I thought I was looking at 2 brilliantly bright stars. I kept focused on them when I noticed that they were both moving. The lights were bright blue, like a shimmering blue. I looked closer shocked as I watched the two objects move across the sky towards the southwest. The object moved in an odd path like a snake moving across the sky. The small tail it had was quickly disappearing as the object moved. Then suddenly it faded and reflected off the clouds like a liquid firework but very subtle. The whole experience lasted about 15 seconds and I was so fixated I couldn't unfortunalty get a photo as the camera wasn't on the tripod and it was such a distance to shoot. I wis I would have been outside 1 minute earlier so I could have caught the whole thing. Quite amazing and at the same time I was rocked by this. Only happened 20 minutes ago at the time of writing. Still feeling a little odd from the whole thing."],"Log Number":"AU-02152013-0008","files":["/var/www/straped/mufon/html2text/45714.html.txt","/var/www/straped/mufon/org/45714.html"],"Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Date of the Event":"02/15/2013 09:40 UTC","Source":"MUFON"}