{"Object Flight Path":"Path with directional change","Object Shape":"Sphere","Weather Factors":"Unknown","Object Features":"None","Date of the Event":"02/15/2013 07:50 UTC","Region":"Florida","Sighting Duration":"Undisclosed","Longitude":"-81.45106","Case Number":"45722","Source":"MUFON","Summary":"Two bright orange lights in sky. Spoeed off to South-West, return and depart same direction.","Viewing Distance":"Over One Mile","trends":["There have been 66 other sightings in Jacksonville","There were no other sightings in Jacksonville on or around February 15th 2013"],"Disposition":"Unresolved","Log Number":"US-02162013-0001","Tags":"City","Country":"United States","Latitude":"30.296934","map":"<A HREF = \"http://maps.google.com/maps?q=30.296934,+-81.45106(45722)&iwloc=A&hl=en\"> mufon case (45722) map </A>","Date Submitted":"02/16/2013 12:44 UTC","divs":["Sighting DetailsFebruary 15,2012 @ about 1950. Just West of Hodges Blvd. on Beach Blvd. Jacksonville, FL. Two bright orange lights in South-Western sky. They were separated horizontally at about 45 degrees and maybe a mile or so vertically. The bottom light was to the left of the top light. I watched them for a few minutes and the bottom light started moving to the right. When it was almost lined up with the top light, the top light started to move South-West very rapidly. The bottom light started moving South-West also a few seconds after the first. They both moved extremely fast and disappeared in the distance. I left the spot where I first spotted the lights and drove about two minutes or so (in a golf cart) to another part of the housing development. I made a right on another road and the two objects were back in the same part of the sky. I drove back to the original spot. They were arranged different. The top one was to the left of the bottom. They sped off tho the South-West again. Amazing! The second time I saw them, there were two other people watching the lights. We did not speak."],"files":["/var/www/straped/mufon/html2text/45722.html.txt","/var/www/straped/mufon/org/45722.html"],"City":"Jacksonville"}