{"Date of the Event":"02/15/2013 10:02 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.015102,+-80.13066(45729)&iwloc=A&hl=en\"> mufon case (45729) map </A>","Country":"United States","Latitude":"33.015102","Tags":"City","Summary":"Two triangular shaped objects moving in formation from east to west.","Object Flight Path":"Straight-line path","Object Shape":"Triangle","Source":"MUFON","Region":"South Carolina","City":"Summerville","divs":["Sighting DetailsIwas exiting my car and looked up to view an airliner in the process of landing at the airport. The plane was just about to disappear behind the roof of a house when I continued my gaze higher to look at the night sky as it was a exceptionally clear night. I didn't initially see the objects in motion until they crossed my vision. I did't see them approaching until almost in front of me but they became clearer and brighter as they got right above me, almost like the reason I didn't see them right away was because of the flatter angle to my right.As they moved from west to east what initially looked like a shadow moving from right to left became clearer right overhead and in a direct line of sight. Two triangular shaped objects, identical in size with rounded corners, moved in formation at what could best be described as a leisurely pace. Given the approximate altitude they didn't seem to be more than 1200 feet off the ground and moving faster than a small plane. Two things stand out though, they're positions in relation to each other did not vary considering how close they were to each other and they made no sound and that REALLY made an impression on me. As they moved from right to left,they faded from my view almost within 500 line feet and I can only guess that as their departing angle increased they faded from view. I knew right away as to what I had just seen and went inside to tell my wife. Going back outside to see if something like that were to happen again would be like finding the proverbial needle in the haystack. I already had found the needle and it was in my hand."],"Longitude":"-80.13066","trends":["There have been 4 other sightings in Summerville","There were no other sightings in Summerville on or around February 15th 2013"],"Disposition":"Unresolved","Case Number":"45729","Log Number":"US-02162013-0007","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Object Features":"Unknown","Date Submitted":"02/16/2013 06:52 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/45729.html.txt","/var/www/straped/mufon/org/45729.html"]}