{"Date Submitted":"02/16/2013 04:52 UTC","Log Number":"US-02162013-0005","Weather Factors":"Unknown","Latitude":"38.094536","Tags":"City","City":"Vallejo","files":["/var/www/straped/mufon/html2text/45726.html.txt","/var/www/straped/mufon/org/45726.html"],"Summary":"standing on front porch smoking and looking at stars. saw large red orb come into view above house across the street","Longitude":"-122.230605","Object Flight Path":"Path with directional change","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Circle, Cross, Egg, Oval, Sphere","Region":"California","Date of the Event":"02/11/2013 12:00 UTC","Case Number":"45726","divs":["Sighting Detailsi was on front porch smoking and looking at the stars. where i live i can see air traffic from sfo oak airports napa county airport and travis air force base so i know what navigation lights should look like. when the orb came above the house across the street i knew it was nothing ive seen before.the size was much bigger than any star that was visible. it was the size of a full moon.the color was not deep red but a reddish orange flickering or pulsating.it was going from nw to se about the same speed as a low flying single engine airplane but making no sound at all.it had no distinct shape or hard edges.as i watched it going away the orb was getting smaller and dimmer.before it disapeared all i could see was a red cross pointed on each end but the bottom point looked as if it was dripping blood.i lost sight as it moved away into the distance.when it was gone i was excited after finally seeing something i could not identify.i rushed into the house to tell my wife i didnt bring her outside because she was sitting on the toilet and i would have to put her in her wheelchair to bring her outside to see it. idid not want to miss it not for 1 second.i wanted to make the most accurate report as possible."],"trends":["There have been 12 other sightings in Vallejo","There were no other sightings in Vallejo on or around February 11th 2013"],"Source":"MUFON","Object Features":"Other","Country":"United States","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.094536,+-122.230605(45726)&iwloc=A&hl=en\"> mufon case (45726) map </A>"}