{"Country":"United States","Longitude":"-118.338121","Region":"California","Date Submitted":"02/16/2013 03:47 UTC","Log Number":"US-02162013-0003","map":"<A HREF = \"http://maps.google.com/maps?q=33.898765,+-118.338121(45724)&iwloc=A&hl=en\"> mufon case (45724) map </A>","Latitude":"33.898765","Disposition":"Unresolved","Tags":"City","Summary":"My husband and I heard a noise we looked out the window and saw 2 big bright red circles with a orange haze descending south","Object Flight Path":"Straight-line path,Other","Object Shape":"Circle, Fireball","Source":"MUFON","Date of the Event":"02/15/2013 12:00 UTC","Case Number":"45724","divs":["sighting detailsmy husband and i were inside the house and heard a weird noise that sounded like it was coming from the garden. looking out of the window we were immediately drawn to two red\\orange circular lights in the sky...traveling what looked like north to south, appearing to be heading towards the ground. they seemed to be traveling together, not to or from the airport, lax which is super close! they seemed to have their own groove, not like the airplanes, a slight back and forth movement whilst traveling, looking like heading towards the ocean? when we see the planes, they give a white light, not a red light! there was a haze...maybe because the ocean and full sky as a background? we absolutely could not identify them as being aircraft that we are used to seeing. was a very strange sight in all. never seen anything like that before! we came inside and went straight onto the computer to see if there were any reports of them..we know there's meteor activity out there right now...but we came across your site instead so decided to submit a report. i wish i had grabbed my ipad to record it, will be on the lookout and film again if we see again!"],"trends":["There have been 2 other sightings in Lawndale","There were no other sightings in Lawndale on or around February 15th 2013"],"Object Features":"Other","Sighting Duration":"Undisclosed","City":"Lawndale","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/45724.html.txt","/var/www/straped/mufon/org/45724.html"],"Viewing Distance":"Over One Mile"}