{"Object Features":"Unknown","Case Number":"45735","Log Number":"US-02172013-0003","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Object Shape":"Disc, Oval","Tags":"City","Sighting Duration":"00:03:20","divs":["Sighting DetailsI was talking to my girlfriend on the phone. I saw a bright glowing light an trail as it came down it has before near my house my friends next door have seen ufos before but this is the second one that has happened right by my house.I turned all the lights off in my room an looked at it carefully to make out details of the colors an size of the object. The object was glowing red on the outside as trail behind it disapared as it hoovered over builting near my house an in the middle of the ufo their were 6 red flashing lights as the rest of it was glowing. This is the first sighting of this year i have seen a ufo i saw three last year within a month an got under one large black triangle , just a few days ago i read the reports that nothing was happening in our area but the sighting have been high this month an i'm not talking my self into this it was a legit ufo i've seen a good amount i think an i like ufo i know what to look for so for seeing a ufo this year was really cool again i got so happy but quickly put my eys to what i was seeing an what time it started. How i lost sight of the object is that it came in very bright an then faded out like it was never their but it was extremely low to the trees an the left."],"Date Submitted":"02/17/2013 12:53 UTC","files":["/var/www/straped/mufon/html2text/45735.html.txt","/var/www/straped/mufon/org/45735.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.156812,+-77.005917(45735)&iwloc=A&hl=en\"> mufon case (45735) map </A>","trends":["There have been 2 other sightings in Dillsburg","There were no other sightings in Dillsburg on or around February 17th 2013"],"Latitude":"40.156812","Date of the Event":"02/17/2013 12:00 UTC","Region":"Pennsylvania","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Weather Factors":"Unknown","Longitude":"-77.005917","Country":"United States","City":"Dillsburg","Source":"MUFON","Summary":"bright red light with a black backround flashing light an glowing saw it out of the side of my eye then turned all the lights in my room an faded out after that it was for sure outside i have nothign red in my room."}