{"Case Number":"45737","Log Number":"US-02172013-0005","City":"Memphis","Date of the Event":"02/16/2013 10:15 UTC","trends":["There have been 62 other sightings in Memphis","There were no other sightings in Memphis on or around February 16th 2013"],"Object Shape":"Sphere, Star-like","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/45737.html.txt","/var/www/straped/mufon/org/45737.html"],"Latitude":"35.16307","Viewing Distance":"Over One Mile","Longitude":"-89.769815","Date Submitted":"02/17/2013 01:32 UTC","Weather Factors":"Unknown","Region":"Tennessee","Source":"MUFON","Tags":"City","Object Features":"Unknown","Country":"United States","divs":["Sighting DetailsWe were driving south on our way home at 10:15pm central time and we came upon a clearing where we saw a cluster of lights. At first, we thought they were lights from a cell tower or some similar structure. However, we then noticed that they were the wrong color and there were too many for it to be A tower. We quickly pulled over to watch and noticed that there were 10 orange lights in triangular or diamond formations. Like this: - - - - - - - - - - The lights hovered for a few seconds and then slowly began to travel NE. They traveled more slowly than a plane, but much faster than a blimp or bird. We watched them for about 10 minutes as each one slowly faded, starting with the one that appeared to be leading the rest, until they had all disappeared. Each light disappeared individually and each seemed to begin to fade when it reached the exact same spot in the sky. Initially, we thought the lights were disappearing behind a cloud. However, they neither reappeared further along the skyline, nor did they shine through at any point as would be expected if they went behind a cloud. We attempted to capture the lights on our iPhone camera, but they were either too small or not bright enough to be picked up by our phone cameras. We were excited to see something so strange."],"Summary":"10 orange balls of light hovered in triangular formation then slowly traveled NE and faded one by one","Disposition":"Unresolved","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.16307,+-89.769815(45737)&iwloc=A&hl=en\"> mufon case (45737) map </A>"}