{"City":"Bellingham","Case Number":"45733","Viewing Distance":"Over One Mile","Date Submitted":"02/17/2013 12:32 UTC","Latitude":"48.764263","trends":["There have been 27 other sightings in Bellingham","There were no other sightings in Bellingham on or around February 16th 2013"],"Object Shape":"Diamond, Disc","Disposition":"Unresolved","Country":"United States","Date of the Event":"02/16/2013 06:40 UTC","files":["/var/www/straped/mufon/html2text/45733.html.txt","/var/www/straped/mufon/org/45733.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=48.764263,+-122.485325(45733)&iwloc=A&hl=en\"> mufon case (45733) map </A>","Tags":"City","Log Number":"US-02172013-0001","Object Flight Path":"Hovering then path","Object Features":"Unknown","Weather Factors":"Unknown","Summary":"saw six bright lights moving both horizontally and vertically across the night sky and they disappered about the clouds","divs":["Sighting DetailsI went out on my balcony of my apartment to get some fresh air in Bellingham, Washington. I opened the door and immediately saw these six lights flying strangely close together yet not straight across in a line. I opened the door and yelled for my husband to come out with me. I don't know what they were but knew they were not anything I had ever seen before and I am 60 years old. He was just inside the door watching TV. He came right out and saw the light formations too. I said \"What are they?\" He responded \"Has to be UFO'S.\" I said \"NO, no such thing as UFO's.\" Then I saw them going up and down and across but close together. They were all moving both horizontally and vertically across the sky. I said \"Could they be some kind of a helicopter formation?\" Of course I didn't think they were since they were to close at times and would have collided. My husband said \"No, look they are to close to each other.\" By then the lights were starting to all go up and above the cloud cover. They each disappeared above the clouds and were gone. This lasted about a minute or so. (The whole episode of my hubby and I questioning what they were.)"],"Source":"MUFON","Region":"Washington","Longitude":"-122.485325","Sighting Duration":"Undisclosed"}