{"Case Number":"4573","Disposition":"Unknown","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=40.567539,+-89.640658(4573)&iwloc=A&hl=en\"> mufon case (4573) map </A>","files":["/var/www/straped/mufon/html2text/4573.html.txt","/var/www/straped/mufon/org/4573.html"],"Weather Factors":"None","Date Submitted":"05/15/2005 09:50 UTC","Latitude":"40.567539","Viewing Distance":"101-500 Feet","Object Shape":"Cigar, Disc","Longitude":"-89.640658","Country":"United States","Log Number":"US-03232006-0001","Summary":"Witnessed huge cigar craft shining bright against morning sky. Object hovered motionlessly high above tree-line for several minutes. There was one other witness.","Region":"Illinois","Date of the Event":"05/15/2005 09:50 UTC","trends":["There have been 7 other sightings in Pekin","There were no other sightings in Pekin on or around May 15th 2005","This sighting has never been favorited.",""],"divs":["Sighting Details At apx. 9:45 in the morning I was heading up to the top of the cul-de-sac from my house on my way to work. Wanting to turn right onto the main road, I was blocked by a tan pickup truck pulled and parked askew in the road, its driver still in the cab. I thought nothing of it for a moment as I took the time to shuffle through my CDs, but upon looking back up I grew irritated that the driver in front of me had not moved on yet given that I was running late for work. That is until I looked in the direction he also appeared to be looking. There past the cornfield and above the distant tree-line was an enormous hovering object gleaming against the cloudless sky. At that time of morning the sun and clear sky are extremely bright, but this object was shining marvelously and unmoving, huge given the distance. The other witness and I just sat in our vehicles watching for several minutes. But it was our similar reactions that are most stunning to me. I am a person extremely interested in unexplained phenomena, but had never been witness. Furthermore I am not opposed to shrugging off work or being late. With my house just down the street, I had but to run back down the street and grab a camera or at least sit the watching for the duration. Rather the truck in front of me simply pulled away and I routinely followed, never looking back. Even more peculiar, by the time I had reached the stop sign only a short distance down the road. In fact it was not until about six months later that the memory came flooding back as clear as the object had been. While talking to my mother one evening the memory finally returned, but with anger and regret that I could have behaved so carelessly, something I could not (nor could anyone else who knows me) have been capable of without some kind of outside influence. I know that this account is all but worthless with the lack of evidence and the loss of memory for such a long period of time (something which angers me even today), but it is my story and sworn truth in all accounts."],"Sighting Duration":"Undisclosed","Object Features":"None","Source":"MUFON","City":"Pekin","Tags":"City"}