{"Log Number":"US-02172013-0011","Summary":"fire in color, formed a formation, changed speed (one did, to catch up?)caught on video and still","Date of the Event":"02/16/2013 09:30 UTC","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/45744.html.txt","/var/www/straped/mufon/org/45744.html"],"Longitude":"-77.604052","Object Features":"None","Disposition":"Unresolved","Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=43.1702,+-77.604052(45744)&iwloc=A&hl=en\"> mufon case (45744) map </A>","City":"Rochester","Region":"New York","trends":["There have been 53 other sightings in Rochester","There were no other sightings in Rochester on or around February 16th 2013"],"Sighting Duration":"Undisclosed","Country":"United States","Case Number":"45744","divs":["Sighting Detailswent out to eat with wife and 2 friends in rochester Ny. After dinner while leaving my wife said what the f@#k are those. We all saw them and were confused. Six other people were in the parkinglot and saw them too. We watched as three formed a triangle, followed by a fourth. Kinda formed an arrow of sorts. Then the rear light caught up to the front three, and they all formed a diangle line. Traveled for about 3 minutes then dissapeared one at a time startind with the front one. If these were the size of planes i would say they were 60 miles away, and traveled about 75-100 miles in 5 min. We have the phone video and a phone still, the still when zoomed in on revieled 10 more in the background that were not visible to the naked eye, and there appears to be an edge or a ridge that connected the seen ones to the unseen ones. They appear to have the same qualities as the pheonix lights, and many other videos i watched on youtube.The color was hard to describe, i called it fire color, although there was no tails i first thought meteorite, then helecoptors (no sound), then flares (did not decend but assended slightly. I have no idea what they really were."],"Source":"MUFON","Tags":"City","Weather Factors":"Unknown","Date Submitted":"02/17/2013 10:55 UTC","Latitude":"43.1702"}