{"Date Submitted":"02/17/2013 02:52 UTC","Country":"United States","Region":"Texas","Source":"MUFON","Disposition":"Unresolved","divs":["sighting detailsi was sitting outside with my dogs, enjoying the beautifully clear day, watching the birds chasing each other, when i just happened to look up just above my roof and in the far distance i saw a shiny white\\greyish orb like object just appear out of nowhere. i was kind of hovering, yet possibly moving very slow. i called out to my partner to come outside and see what i was seeing. the 1st orb like object appeared in the east and traveled in a se direction at a slow rate of speed and just disappeared within 10 minutes. after the 1st orb disappeared a 2nd shiny white\\greyish orb appeared in almost the exact spot as the 1st on did. the 2nd orb also traveled in a se direction, but it was faster and zigzagged, it disappeared within 15-20 seconds. after the 2nd one disappeared a pinkish\\translucent rocket like object with several wings appeared and was moving at a very slow rate of speed in a southern direction. the rocket like object then seemed as it sped up, when it sped up a 3rd orb like object appeared just behind it and seemed to start chasing it. both the rocket like object and the 3rd orb sped up very fast and the just disappeared into thin air in about 30 seconds. i had my cell phone on and was recording all three, i went inside to download the video, and only one came out and was abruptly cut short. i then decided to go back outside and see if i could see anything else. i was outside for about 3 minutes when i noticed another orb appear, this orb seemed as though it was either flashing or spinning, it too was traveling in a se direction. i then called out for my partner to come back out because i spotted another orb. my partner and her brother both came outside, as we were watching the 4th orb a drone like craft came out of the west, moving in a se direction at a high rate of speed. the drone like object then began chasing the flashing orb, the both disappeared into thin air within 20-30 seconds. i was unsure of what i had just seen, but i do know they were nothing i have ever seen before. none of the objects acted like any plane, blimp or balloon."],"Object Features":"Wings","map":"<A HREF = \"http://maps.google.com/maps?q=29.634568,+-95.204865(45747)&iwloc=A&hl=en\"> mufon case (45747) map </A>","Date of the Event":"02/16/2013 12:00 UTC","Weather Factors":"Unknown","Longitude":"-95.204865","Tags":"City","Object Shape":"Bullet, Missile, Cigar, Circle, Sphere","files":["/var/www/straped/mufon/html2text/45747.html.txt","/var/www/straped/mufon/org/45747.html"],"City":"South Houston","Latitude":"29.634568","Log Number":"US-02172013-0014","Sighting Duration":"Undisclosed","trends":["There has been one other sighting in South Houston","There were no other sightings in South Houston on or around February 16th 2013"],"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Viewing Distance":"Over One Mile","Summary":"4 orb like objects and 1 rocket like with wings","Case Number":"45747"}