{"files":["/var/www/straped/mufon/html2text/45745.html.txt","/var/www/straped/mufon/org/45745.html"],"Source":"MUFON","Summary":"Bright lights and a unusual shaped solid object, rumbling and humming noise affected animals in the house.","Case Number":"45745","Longitude":"-3.060288","Object Flight Path":"Stationary,Path with directional change","divs":["Sighting DetailsAt the time of the event I was sat in my living from doing vocal preparation for a class that I was going to teach the next day. My dog was sat next to me on the sofa until he got up quickly and barked franticly at the window before running to the front door, as if he had seen something. i got up and checked and saw nothing. my TV and radio connection also did any internet connection that we had. While taking a look at the plugs and the cables my Girlfriend came down complaining that she could hear a rumbling noise from out of the bathroom window that lasted for about 30 seconds. We started to see an extremely bright, clouded light out side the window that lit up our garden, we both ran down to the back door and looked out, the dog still hysterically barking outside. I saw a weirdly shaped dark object that seemed to be hovering in a stationary in one place over the top of the street. Our Garden was no longer lit so it was obvious that it had ascended higher into the sky. At this point we made our way outside and watched it for about and tried to contact a friend down the street on the phone but it wasn't working. I haven't seen or heard of any kind of aircraft like it in my life as I used to be in the air force. soon after it seemed to ascend higher into the sky, and suddenly shot into nowhere. I never took my eye of the object however it seemed to have disappeared at a shocking speed. we headed back indoors and I quickly drew what I had seen, within the hour our phone started to work again and we received calls from two people down the street who had seen the same thing. we realised that our dog was no where around the house and could not find him in the gardens. we walked the streets most of the night trying to find him. about 4 pm the next day he was found outside the door. He was not the same as he normally was and seemed depressed and made no noise and had a mark above his tale where it looks like his fur had been burned, like he ran past a flame and with left with painful raw skin. No one in our small street said that they had seen him out last night. and no sightings of fire. I have never seen anything like this and the sighting terrified my girlfriend and myself. for the last day, I feel different as my voice seems higher as well as I feel that being shocked at the time, mentally effected me, my girlfriend and other people down the street, its upsetting as we have no answers."],"Sighting Duration":"Undisclosed","trends":["There has been one other sighting in Oswestry","There were no other sightings in Oswestry on or around February 15th 2013"],"Disposition":"Unresolved","City":"Oswestry","Log Number":"GB-02172013-0012","Country":"United Kingdom","Object Features":"Other, Unknown","Tags":"City","Date Submitted":"02/17/2013 01:13 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=52.857852,+-3.060288(45745)&iwloc=A&hl=en\"> mufon case (45745) map </A>","Region":"England","Object Shape":"Disc, Egg, Oval, Teardrop, Other, Unknown","Date of the Event":"02/15/2013 10:45 UTC","Latitude":"52.857852","Viewing Distance":"Unknown"}