{"Case Number":"45740","files":["/var/www/straped/mufon/html2text/45740.html.txt","/var/www/straped/mufon/org/45740.html"],"Log Number":"US-02172013-0007","Latitude":"32.164855","divs":["Sighting DetailsVisiting my father in Marietta I went out onto his balcony to smoke a cigarette. As I always do; looked up at the stars. I then began to notice something out of the ordinary through the trees. At first it seemed as though the \"star\" was twinkling because of the wind through the branches. Then as I watched it closer I noticed slight movement. Finally out from the trees... my attention for the next hour and a half was captured. After slight movment was abrupt movement! From the right to left, then hovering for 45 minutes more then made its way slowly back to the right, then began to descend downward at an angle. I thought it was strange from the beginning because once it abruptly moved; 5 minutes later a plane appeared. It seemed to cross right underneath it. Within this time, I showed my Dad. He said it was strange and looked through the binoculars as well, but the cold weather pushed his curiousity away. So I moved inside the sliding door, proped my elbows on the bar and pushed the binoculars against the window to secure the object in eyesite. When I noticed it was descending slowly then I was really convinced I wasnt just seeing things. Ive seen two sitings before here in marrietta and both late at night. But oddly enough it seems to be in the same direction. Also somewhat near the airforce base. Which convinces me further that it is some type of aircraft. Over the years UFO's have become a huge interest of mine but often I try to create scientific explainations. Although, sometimes I just cant seem to rule out the possibility. Once descended, it then dissappeared. The show began around 130, and ended at 245. Next thing I know im sitting here on the couch typing this story. Im grateful for what ive witnessed, but there seems to be some hot spot around here. As I watched it.. I REALLY, TRULEY, realized that it was descending after hovering for so long, and all the colors that flashed with it I was baffeled. Ive questioned the other sites but this one made the book."],"Disposition":"Unresolved","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.164855,+-82.902163(45740)&iwloc=A&hl=en\"> mufon case (45740) map </A>","Viewing Distance":"N/A","Date Submitted":"02/17/2013 03:35 UTC","trends":[],"Country":"United States","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path","City":"Undisclosed","Summary":"Observed over an hour on balcony w. binoculars. Once noticed placement was made compared to stars and tree branches","Date of the Event":"02/17/2013 01:38 UTC","Region":"Georgia","Source":"MUFON","Weather Factors":"Unknown","Object Features":"None","Longitude":"-82.902163","Object Shape":"Star-like"}