{"Object Features":"None","Log Number":"US-02172013-0024","Weather Factors":"Unknown","Object Shape":"Boomerang","map":"<A HREF = \"http://maps.google.com/maps?q=32.646184,+-97.063(45756)&iwloc=A&hl=en\"> mufon case (45756) map </A>","Region":"Texas","files":["/var/www/straped/mufon/html2text/45756.html.txt","/var/www/straped/mufon/org/45756.html"],"trends":["There have been 7 other sightings in Grand Prairie","There were no other sightings in Grand Prairie on or around February 17th 2013"],"Tags":"City","Summary":"Just before sunset dropped below Cirrus clouds then slowly ascended through clouds till gone.","Disposition":"Unresolved","Date of the Event":"02/17/2013 05:55 UTC","City":"Grand Prairie","Date Submitted":"02/17/2013 09:58 UTC","Object Flight Path":"Stationary","Country":"United States","Latitude":"32.646184","Longitude":"-97.063","Case Number":"45756","divs":["Sighting DetailsI was taking a walk with my daughter(6) who was scootering along the Fish Creek Linear Trail. The sun was setting, clouds were amazingly beautiful. We were observing jets flying by, some with vapor trails and some without. When out of nowhere to the NE a Huge dull metal boomerang shaped craft, approximately 2 to 4 times the size of the jets, descended vertically through the cirrus looking clouds, hovered for approximately 30-40 seconds in plain view, then ascended vertically back through, it could be seen for a little while through the clouds but then disappeared. There was quite a breeze and I saw the clouds slowly flowing by the craft, it was not effected by the wind, it remained stationary. This event was observed by my daughter and I. I immediate knew it was not a plane, balloon, bird, hang glider, optical illusion, or reflection. I had no huge emotions or feelings just curiosity, wanting to see it again or find out more about it. After arriving home I asked my daughter to draw a picture of the object. She drew it exactly how I saw it, same exact shape and she even shaded it with a pencil to show exact color."],"Sighting Duration":"Undisclosed","Source":"MUFON","Viewing Distance":"Over One Mile"}