{"Case Number":"45750","Region":"California","trends":["There have been 127 other sightings in San Francisco","There were no other sightings in San Francisco on or around February 16th 2013","This sighting has been favorited 1 time.",""],"Tags":"City","Object Features":"None","Source":"MUFON","City":"San Francisco","Longitude":"-122.401578","Object Shape":"Circle","Country":"United States","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change,Path then hovering","Summary":"Two large orange lights that hovered and changed direction","divs":["Sighting DetailsI had just arrived home from work. It was about 7:40 PST. I noticed the first light in my bedroom window. it was basketball sized at this point. I assumed that it was a helicopter or perhaps it was a fireball from the recent meteor activity. So I grabbed my iPhone and ran up to the roof of my apartment and began filming. At the start, you can see the first light heading west. Its below the star seen at the center of the frame. By the time I grabbed my phone and headed up to the roof, it was almost gone. Initially, this baby was HUGE. I was bummed that I didn't get video of its initial appearance. Just as I was about to head back indoors, the second light appeared from the north. You can clearly see that this thing doesn't zip through the sky like your typical space debris. It moves slowly. Oh and by the way, it also appears to stop, change direction and follow the first light that is continuing west."],"Date of the Event":"02/16/2013 07:45 UTC","Disposition":"Unresolved","Log Number":"US-02172013-0018","Weather Factors":"Unknown","Latitude":"37.802603","Date Submitted":"02/17/2013 05:43 UTC","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.802603,+-122.401578(45750)&iwloc=A&hl=en\"> mufon case (45750) map </A>","files":["/var/www/straped/mufon/html2text/45750.html.txt","/var/www/straped/mufon/more/45750_submitter_file2__IMG4728.jpg","/var/www/straped/mufon/org/45750.html"]}