{"map":"<A HREF = \"http://maps.google.com/maps?q=32.745544,+-117.247148(45761)&iwloc=A&hl=en\"> mufon case (45761) map </A>","Latitude":"32.745544","Date Submitted":"02/18/2013 12:43 UTC","Object Flight Path":"Stationary,Hovering then path,Path then hovering","Date of the Event":"02/17/2013 08:00 UTC","City":"San Diego","Longitude":"-117.247148","Weather Factors":"Unknown","divs":["Sighting Detailsa blue light slowly gliding across the sky that didn't look very normal so i kept watching it and it would change to red every once in awhile then change back blue randomly no noticed patterns. it would slow down and speed up abruptly and then hover and swoop up and down, then a helicopter flew right by it and it crazily started swooping back and forth in a V like pattern towards a blinking radio tower i think then quickly sunk low into the mountain and disappeared, shortly after the helicopter was gone it came back and keeps flying back in forth around this tower like its attracted to it but will stop get close to it speed off come back. it even completely disappears at moments then re-appears in a different spot, i witnessed it decent up and down and disapear several times but with in 5 minutes it kept coming back. i was in my back yard in ocean beach san diego looking north east of sea world on the mountain side, i noticed it first because it was fairly bright light unlike any i see in the skys at night, i instantly thought it was a ufo but a friend who did not witness it said it coulda been a remote control airplane but with the patterns it was doing im still very skeptical it could have been a remote controlled plane and it would randomly change back n forth colors and would disappear for 5 secs at a time here n there idk why you want the lights to disapear in the dark sky.. and even the size of the light if it was a remote control would have been much smaller compared to lights on vehicles and aircrafts at a closer distance being much smaller.. and the way i would lose sight of it would sink into the mountain side go behind a tree and idk after that but i would keep watching the blinkin tower and it came back 4 time atleast as im writing this its still flying. tryed to film it but at the distance it doesnt show up, i cant even see the blinking tower in the video.. :("],"Case Number":"45761","Region":"California","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","trends":["There have been 151 other sightings in San Diego","There was one other sighting in San Diego on or around February 17th 2013"],"Tags":"City","Country":"United States","Source":"MUFON","Summary":"solid blue and red light flying around blinking tower","Object Shape":"Boomerang, Circle","Log Number":"US-02182013-0002","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/45761.html.txt","/var/www/straped/mufon/org/45761.html"],"Object Features":"Unknown"}