{"Object Shape":"Unknown","Date of the Event":"02/17/2013 02:00 UTC","Latitude":"34.057824","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.057824,+-118.237705(45768)&iwloc=A&hl=en\"> mufon case (45768) map </A>","Object Features":"Unknown","City":"Los Angeles","Summary":"UFO appears in picture.","Longitude":"-118.237705","Object Flight Path":"Unknown","files":["/var/www/straped/mufon/html2text/45768.html.txt","/var/www/straped/mufon/more/45768_submitter_file1__Dennis1.JPG","/var/www/straped/mufon/more/45768_submitter_file2__Dennis2.JPG","/var/www/straped/mufon/org/45768.html"],"Region":"California","divs":["Sighting DetailsOn February 17, 2013 i was out that night with a couple of friends. We had a couple of beers and deceided to go get something to eat around 2am. We ended up at the local hamburger resturant down the street since they stay open until 3am. I deciede to take a picture of the sign infront of the returant to post it up to my facebook. When i took the picture i didnt notice anythig in the sky. It was 2am so it was pretty quite and no cars out on the street. I would have noticed if there was a helicopter or a plane passing by. Later that day when looking over the pictures with my wife i noticed something in the top right corner of the picture. I zoomed into the picture and i could not explain what it was and my wife couldnt explain it either. My first thought was that it has to be like a ballon caught on the electrical wires below or somthing like that. I went back out to the same place i took the picture and no balloon was caught in the powerlines. I took the picture with my Iphone 5 Camera."],"Weather Factors":"Unknown","Log Number":"US-02182013-0008","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Case Number":"45768","Tags":"City","Country":"United States","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around February 17th 2013","This sighting has never been favorited.",""],"Date Submitted":"02/18/2013 12:03 UTC","Source":"MUFON"}