{"Summary":"USS Kittyhawk, CVA-63, buzzed & followed by multiple craft","Object Features":"None","Case Number":"4576","Source":"MUFON","Date of the Event":"11/30/1963 12:00 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Viewing Distance":"Over One Mile","Longitude":"-99.895043","Tags":"City","Sighting Duration":"Undisclosed","Date Submitted":"11/30/1963 12:00 UTC","Log Number":"US-03232006-0004","files":["/var/www/straped/mufon/html2text/4576.html.txt","/var/www/straped/mufon/org/4576.html"],"Latitude":"31.972459","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=31.972459,+-99.895043(4576)&iwloc=A&hl=en\"> mufon case (4576) map </A>","Disposition":"Hoax","trends":[],"Country":"United States","Object Shape":"Saturn-like","Region":"Texas","divs":["Sighting DetailsI was on a readiness condition watch (midnight to 4am)on the ship's aft catapults. I went up onto flight deck and shortly noticed an odd \"star\" low off the aft quarter. It appeared larger and closer than any others and seemed to \"bob\" very slightly. Just before going back below, this \"star\" suddenly executed an extremely high-speed 3 legged manuever in the shape of a perfect figure \"4\" that went almost horizon to horizon in approximately 3 seconds, passing directly over the ship. I immediately reported the incident to the officer-of-the-deck. He and I went back on deck where he soon witnessed further manuevring & then we quickly proceeded to the CIC (Combat Information Center)radar room. The officer in charge of CIC confirmed that four \"unknowns\" were present on radar at the time and commented they \"had been trailing the ship for almost a week now\". When queried by the OD as to why we had not launched any aircraft to investigate a potential threat to the ship, the reply was that the craft had been recorded manuevering at speeds as high as 25 thousand mph and there simply was no point. I also recall that when the (very young) OD asked why there were no entries of these events in the ship's log, he was informed that they had indeed been reported \"through the proper channels\" and that, \"per standing orders\", such events were never entered into the ship's official log.I then returned topside and viewed all of the craft via the signal bridge binoculars for about another 30 minutes before having to return to my duty station. They all appeared as solid metallic orbs with a band of softly flashing lights across their center that changed colors sequentially. While I do remember that there was a distinct and common pattern to the sequence of colors that appeared to rotate around each of these craft, I no longer recall the actual sequence. Note: At the time, the Kittyhawk was attached to Taskforce 77 and the flaghip for the 7th Fleet and operating in the deep Pacific, so I have no way of determining a precise location. The ship was on it's way to the Gulf of Tonkin for a tour of combat duty in Viet Nam. While the actual event is still quite vivid, I am uncertain as to the actual date (it may even have been the tour of 1965). It was a long time ago and while I have previously related this information to several interested parties, this is the first time I have actually filed a formal written report of this incident. It had a profound effect on my thinking and eventually led to my participation in Project VISIT, a not-for-profit Texas based UFO investigative organization."],"City":"Undisclosed"}