{"Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Source":"MUFON","Country":"United States","Longitude":"-78.863873","Summary":"Large dark object with white light on top rose up, hovered, and then flew directly overhead with no sound.","Date of the Event":"02/17/2013 02:30 UTC","Region":"New York","Disposition":"Unresolved","Log Number":"US-02182013-0001","City":"Hamburg","Sighting Duration":"00:01:00","Latitude":"42.705178","Object Flight Path":"Hovering then path","Case Number":"45760","trends":["There have been 2 other sightings in Hamburg","There were no other sightings in Hamburg on or around February 17th 2013"],"Object Shape":"Cone","Date Submitted":"02/18/2013 12:22 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/45760.html.txt","/var/www/straped/mufon/org/45760.html"],"divs":["Sighting DetailsI awoke from sleeping at approximately 230 AM. I went to the kitchen and got something to drink and went into my family room. It has a large bay window that faces south and I looked out of it into the southern sky. I noticed there was a bright white light off in the distance above the tree tops. At first I thought it was a star, but then I realized that it would not be that low in the horizon if it was that bright of a star. The light then moved upward in the sky to about 1000 to 1500 feet altitude. I could see that it was a large dark conical shaped object. The best way I can describe it is that it looked like an oversized Apollo space capsule that was also drawn out so that it was taller in shape. It was much darker than the background sky. The light went out ( or the object moved in such a way that I could no longer see the light) and i watched as the object now moved towards me. It flew directly over my house. The closer it got, the more I realized how large it was. I waited, anticipating that I would hear a plane or helicopter noise, however, it was perfectly silent. The area this took place in is a suburban area on the edge of a rural area. It was relatively dark out with some minor lighting on neighboring houses. I could see clearly into the night sky and pick out clouds and stars. This object was way too low to be a commercial aircraft and I've never seen a helicopter that flew that low in this area. Don't know what it was. Maybe something with stealth technology?"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.705178,+-78.863873(45760)&iwloc=A&hl=en\"> mufon case (45760) map </A>","Object Features":"Unknown"}