{"Weather Factors":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/45762.html.txt","/var/www/straped/mufon/org/45762.html"],"trends":["There have been 8 other sightings in Turlock","There were no other sightings in Turlock on or around February 17th 2013"],"Case Number":"45762","Object Shape":"Triangle, Other","Source":"MUFON","City":"Turlock","Country":"United States","Disposition":"Unresolved","Region":"California","Log Number":"US-02182013-0003","Date Submitted":"02/18/2013 01:44 UTC","Date of the Event":"02/17/2013 08:57 UTC","Summary":"Took dog out @8:57. Observed object/red light coming from Est @low altitude. Seen complete object above me in the moon light. Flew west. Movement was slow if at all at times.","map":"<A HREF = \"http://maps.google.com/maps?q=37.430266,+-120.924944(45762)&iwloc=A&hl=en\"> mufon case (45762) map </A>","Longitude":"-120.924944","Latitude":"37.430266","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","divs":["Sighting DetailsEvery night I take the dog out at 9 o'clock before bedtime. First thing I do is look up and check out the sky while he does his thing. I have often seen (and reported) other \"lights\" that I have seen on other occasions. This time we walked out at 8:57pm on Feb. 17 2013 (I always keep or take notes) and seen a \"red light\" to the East. At first I figured it was a low flying plane. See plenty of planes around here. But then it seemed like it wasn't moving. So as I began to watch I noticed it was moving, just extremely slow. At times it didn't look like it was moving at all. As it came towards me (going West) I began to see details of the object from the bright moon light. The moon was low to the west. So I couldn't really see detail on the bottom. But I could see the front and sides clearly. I've seen small planes fly over head about as high as it was (maybe 200-300ft range) It wasn't very large and I would say it was about the size of small plane. To me it looked to be a \"Stealth Drone\" or something similar. Just my opinion of what it could have been. Although it didn't really have the boomerang shape. It was longer nose triangle shape. The red light did blink steady most of the time. As it began to pass over I notice that it didn't make a sound. And it's really quiet where I'm at. If it were a plane as low as it was I would have heard it without a problem. Next I noted two white lights on the rear outer tips. It made a little jog to the North but continued West. At this time I figured I'd call my wife out to see it too. As she stood outside with me watching it, the first thing she said,\"it's moving extremely slow?\". We watched it continue West for a bit and then brought the Pooch back in for bedtime. Checked the time (9:08pm)"],"Object Features":"Patterned Surface, Other"}