{"Country":"United States","trends":["There have been 4 other sightings in Laughlin","There were no other sightings in Laughlin on or around February 16th 2013"],"Weather Factors":"Unknown","Viewing Distance":"Unknown","divs":["Sighting DetailsI was returning to the Riverside Resort Hotel, walking along the river walk (Colorado River) in the rear of the building. I happen to look up and see two lights moving rapid in a tandem formation (equivalent of an inch apart). At about the same time, the lights accelerated at a tremendous rate of speed. While the objects increased acceleration, their direction changed and the object on the right appeared to play catch-up, meaning his arch was wider during the course of the direction change. I work at an airport and am very familiar with jet aircraft. They do not fly this fast. Also, with jet aircaft, the higher they are, the slower they appear to fly. These objects appeared to be high in the sky did not emit any sounds. I did not observed any blinking lights. The objects were solid white lights. A private aircraft flew North over the Colorado river and the resorts a few seconds later. It's a little difficult to describe the feeling and it's still with me as I describe this event. It's as if, you been told something didn't exist and now you see something tangible that contradicts what you've been told. It's not fear, not anxiety, I guess with me, it's an exuberant sort of feeling. I lost sight of them as they made a swooping turn and disappeared behind the building towards the mountains."],"Disposition":"Unresolved","Source":"MUFON","Object Flight Path":"Path with directional change","Log Number":"US-02182013-0006","Tags":"City","Sighting Duration":"Undisclosed","Latitude":"35.141593","Case Number":"45765","Object Features":"None","City":"Laughlin","map":"<A HREF = \"http://maps.google.com/maps?q=35.141593,+-114.547031(45765)&iwloc=A&hl=en\"> mufon case (45765) map </A>","Region":"Nevada","Date Submitted":"02/18/2013 02:41 UTC","Summary":"Lights moved rapidly across the sky, changed direction and dissapeared","Longitude":"-114.547031","Date of the Event":"02/16/2013 12:00 UTC","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/45765.html.txt","/var/www/straped/mufon/org/45765.html"]}