{"map":"<A HREF = \"http://maps.google.com/maps?q=41.762782,+-86.105008(45777)&iwloc=A&hl=en\"> mufon case (45777) map </A>","Latitude":"41.762782","Object Shape":"Chevron, Triangle","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-02182013-0018","divs":["sighting detailsi was driving south on brick road in granger, in at about 7pm on february 18, 2013 when i noticed two bright, round white lights pierce through the clouds almost directly above me. these were unwavering during the sighting. there were also smaller lights underneath\\behind - red, green, and white lights that flashed sequentially from left to right. i thought this object was an airplane, but it appeared to slow down and hover over the nearby rural landscape as i watched it through my rear view mirror. i did not hear the typical whoosh of an airplane as the object passed over. could not say what the exact shape was, but a triangle or chevron seems closest. after i saw it hovering for a few seconds, i turned my car around and quickly pursued the object, which now sped up considerably and steeply descend northwest, toward michigan (the state line is very close to granger). it almost seemed to know that it was being observed. i lost sight of it through the treeline as i continued north on brick road. the thing that freaked me out the most was the hovering. airplanes don't slow down in mid-air and hover over the landscape. also, even though it was dark and somewhat foggy out, i would have noticed the basic airplane shape, along with tail lights and sound. i almost hesitate to report this event - still not quite sure what i saw and would like other witness confirmation. i felt shaken as i realized what i was seeing, and afterward for several minutes - senses on edge, hyper-aware of my surroundings."],"Weather Factors":"Unknown","Object Flight Path":"Path with directional change,Path then hovering","Summary":"I thought I was seeing an airplane, but the object hovered over a rural area and then quickly continued on its path.","Longitude":"-86.105008","Tags":"City","Region":"Indiana","files":["/var/www/straped/mufon/html2text/45777.html.txt","/var/www/straped/mufon/org/45777.html"],"Disposition":"Unresolved","Date of the Event":"02/18/2013 06:58 UTC","Sighting Duration":"Undisclosed","Date Submitted":"02/18/2013 08:48 UTC","Country":"United States","City":"Granger","Case Number":"45777","trends":["There have been 2 other sightings in Granger","There were no other sightings in Granger on or around February 18th 2013"],"Object Features":"Unknown"}