{"trends":["There have been no other sightings in Osceola National Forest &","This sighting has never been favorited."],"Viewing Distance":"21-100 Feet","divs":["Sighting DetailsMy husband and I left Jacksonville, FL very early on a Saturday am in Dec of 1994 to attend a family member's graduation at FSU. We took 95 North to I-10 West with Tallahassee as our destination. Having gone to school in Alabama, I had travelled back and forth on I-10 multiple times over the course of 4 years with all trips having been very uneventful. As my husband was driving, I was in the passenger seat looking out the window to my right. I had commented earlier in the drive what a beautiful day it was and there was not a cloud in the sky. I while looking for the Suwannee River sign, I noticed a sign indicating we were entering the Osceola National Forest. At this point I believe we had passed the outer city limits of Lake City, FL. I remember lightly resting my head in my right hand and leaning slightly on the passenger side window. I suddenly became aware of a dark spot in the periphery (or what would be peripheral vision) of my right eye. I turned to see what was at first a small, dark, speck high in the sky above. Literally in the blink of an eye it was instantly lower and much bigger. I'd say it was about the size of a volkswagen bug. It hovered momentarily in the sky to the right of our car maybe 50 feet in the sky. I grabbed my husband's arm telling him to look and see what I was seeing. When it was hovering I noticed it was all black, seemingly metalic as there was a shine to the side facing NE, there were no wings, windows, lights, letters or numbers. No logos or any identifying marks. The shape was similar to an egg on its side or stretched out oval. No wings, seams, screws or anything were visible. Suddenly another one appeared, flying parallel to the right side of the first. Suddenly the one closest to us stopped hovering and with a burst of speed shot forward at an angle over the highway and the second one followed suit, both seeming to barely miss treetops of the overpass in front of us & then they were gone from view. The entire event lasted less than 10 minutes but my memory is as clear as if it happened yesterday. We were so shaken we pulled off the highway as did the couple in the car behind us. We asked them if they saw \"that\", which they did, and talked briefly about what \"that\" could have been. Later that afternoon we called the few small airports in the area in an attempt to report and understand what we saw. The people we spoke to at the airports all said there was no air traffic in the area that am or flight plans over the area where our sighting occurred. We did report what we saw but with limited computer technology and no internet at the time who knows what was really documented on our behalf."],"Country":"United States","Object Features":"None","Disposition":"Unresolved","Summary":"While driving on I-10 observed 1 silent dark orb-like object appear vertically in sky then cross hwy horizontally & another following same path simultaneously","Case Number":"45772","Date Submitted":"02/18/2013 05:03 UTC","Object Flight Path":"Hovering then path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=27.668617,+-81.513394(45772)&iwloc=A&hl=en\"> mufon case (45772) map </A>","files":["/var/www/straped/mufon/html2text/45772.html.txt","/var/www/straped/mufon/org/45772.html"],"City":"Osceola National Forest &","Date of the Event":"12/14/1994 12:00 UTC","Log Number":"US-02182013-0013","Weather Factors":"Unknown","Longitude":"-81.513394","Object Shape":"Circle, Egg, Oval","Latitude":"27.668617","Sighting Duration":"Undisclosed","Tags":"City","Region":"Florida","Source":"MUFON"}