{"Summary":"At about 1:03 am I saw what appeaered to be a star like object emiting light","Date Submitted":"02/19/2013 02:06 UTC","Longitude":"-73.999793","map":"<A HREF = \"http://maps.google.com/maps?q=40.716613,+-73.999793(45786)&iwloc=A&hl=en\"> mufon case (45786) map </A>","Case Number":"45786","City":"New York","Sighting Duration":"Undisclosed","Log Number":"US-02192013-0003","Latitude":"40.716613","divs":["Sighting DetailsI woke up at at 1:01 am to go to the bathroom, I then walked to the window and my windows face Manhattan, my view is from Pelham Bay in the Bronx. I always have a habit of looking out the window in the early morning hours. I noticed a star like flashing object emitting green, yellow, white, with a what appeared to be a huge red light tip of the craft. I could see it blinking, so I got my NIKON SPORT OPTICS Binoculars and it let me see the object a little clearer, at times it appeared disc shaped oval, at times it appeared to be triangular. It stayed in the same position from 1:03 am to 1:29 am. It appeared to have a tip with a large red beam of light, then the other lights seem to be pulsating around it Yellow, green, blueish white, It stayed in the same spot, I thought it could be a star, but I live on the 5th floor so I looked at the other stars around an they all appear to reflect a blueish light, but this object kept reflecting different colored lights, with the red Point being the most bright. So I went out into the fire escape to get a better view, and there it was, still stationary and hovering, and flashing its colors. It began to very slowly head towards Manhattan, but I could still see it with me Binoculars. I felt it did not belong to this world, that is the feeling I kept feeling inside. I was not excited, I felt myself asking myself what do you want, why are you here...kind of questions. I noticed at times, the red beam of light grew in intensity, round, very bright. At times the object appeared to be spinning, then for some reason it looked like a rectangular shaped object when the red beam became brighter. I went back inside got a pen and pad, and a heavier coat I was freezing, then went back outside to look and in that one min it just disappeared at 1:29 am,"],"Viewing Distance":"Over One Mile","Object Flight Path":"Stationary","Tags":"City","Weather Factors":"Unknown","Country":"United States","Region":"New York","Object Shape":"Disc, Star-like","files":["/var/www/straped/mufon/html2text/45786.html.txt","/var/www/straped/mufon/org/45786.html"],"Date of the Event":"02/19/2013 01:03 UTC","Source":"MUFON","Object Features":"Dome, Other","Disposition":"Unresolved","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around February 19th 2013"]}