{"Log Number":"US-02182013-0022","map":"<A HREF = \"http://maps.google.com/maps?q=37.27688,+-107.000952(45781)&iwloc=A&hl=en\"> mufon case (45781) map </A>","City":"Pagosa Springs","Viewing Distance":"Over One Mile","divs":["sighting detailsi just got in my car and was traveling west when i noticed a bright metallic object in the sky. i looked at the clock right away and saw that it said 3:02 pm mtn i watched the object for a few seconds then lost it in the sun. i drove back a bit to see if i could see it from where i first saw it but had not luck so i drove forward again and spotted it again further west. only watched it for a few more seconds and then it was gone. the object was traveling sw when i first noticed it. as i said it was metallic in color and reflected the sun. from where i saw it, it appeared to be cigar\\ pencil shape. i do not know how far off it was but if i was to hold a silver pen up to my face that would be about what i saw. i have tried to contact the local airport and have not gotten hold of anyone. i have also called the sheriffs office and no one else had reported anything at the time. the object was just below the sun. later in the day i watched a prop plane and a jet take off. they both made sound even after i could not see them anymore. this object made no sound."],"Region":"Colorado","Longitude":"-107.000952","Date of the Event":"02/18/2013 03:02 UTC","Disposition":"Unresolved","Tags":"City","Object Features":"Unknown","Date Submitted":"02/18/2013 11:00 UTC","Object Flight Path":"Straight-line path","Case Number":"45781","Country":"United States","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/45781.html.txt","/var/www/straped/mufon/org/45781.html"],"Object Shape":"Cigar","trends":["There have been 4 other sightings in Pagosa Springs","There were no other sightings in Pagosa Springs on or around February 18th 2013"],"Source":"MUFON","Sighting Duration":"Undisclosed","Latitude":"37.27688","Summary":"noticed shiny object in sky"}