{"trends":["There have been 73 other sightings in Mesa","There were no other sightings in Mesa on or around February 18th 2013"],"Country":"United States","Disposition":"Unresolved","Case Number":"45784","Source":"MUFON","Longitude":"-111.824992","Date of the Event":"02/18/2013 09:30 UTC","Summary":"Walked out of the house at about 9:30 turned and looked west and saw two bright orange lights which hovered for a while and then faded away.","Log Number":"US-02192013-0002","Date Submitted":"02/19/2013 12:34 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.420634,+-111.824992(45784)&iwloc=A&hl=en\"> mufon case (45784) map </A>","Object Flight Path":"Stationary","divs":["sighting detailsat about 9:30 on 2\\18\\13, i walked out of my garage heading toward my backyard (west) and was startled by 2 unusually bright orange flame-like lights in the sky one above and slightly to the north of the other, probably about 50 degrees above the horizon. we are in the flight path of sky harbor airport so i am accustomed to seeing alot of airplane lights and helicopter lights and these were unlike anything i had seen before. i also saw the \"phoenix lights\" years ago and these were unlike those either. they appeared to be just hovering, i don't believe they were very close to me so it is difficult to judge how large they were. the most striking aspect of these objects was the color - they truly looked like two firey balls in the sky. they hovered for about 3 minutes and the higher light began to fade out. i ran inside to get my cell phone and by the time i came back out the higher object had completely faded away and the other was fading fast and i was not able to get a pic before it disappeared. the entire incident probably lasted only 5 minutes, from the time i first saw them, but they could have been up there for awhile before i went outside and saw them."],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/45784.html.txt","/var/www/straped/mufon/org/45784.html"],"Object Features":"None","Tags":"City","Viewing Distance":"Unknown","Weather Factors":"Unknown","City":"Mesa","Latitude":"33.420634","Region":"Arizona","Object Shape":"Fireball, Sphere, Star-like"}