{"Longitude":"-84.381792","Object Features":"None","Date Submitted":"02/18/2013 11:18 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.753955,+-84.381792(45782)&iwloc=A&hl=en\"> mufon case (45782) map </A>","Disposition":"Unresolved","Region":"Georgia","divs":["Sighting DetailsMy wife and I were traveling in our car and it was such a beautiful day without a cloud in the sky...the sun was so bright that we wasn't trying to look at the sky at all and i was even contemplating putting on my shades to block the sun. Fortunate for me, i looked up and noticed that a plane coming from the west was flying extremely high but, what captivated my attention was that a star seemed like it was inside our atmosphere and even as low as a cloud would appear..so i asked my wife, \"do you see that\"...so she starting noticing the same thing that i was, and was super amazed at the glowing object that looked like it was a diamond shaped chrome object that was shining so bright as if it had its own light illuminating from itself that it was amazing! We watched for at least 2 mins and my wife decided to get out her camera phone and as she was about to record it, it disappeared as if it teleported or something...simply amazing! I'm definetely a firm believer that other beings exist outside of this world...and the technology they have is simply unbelievable to our kind that it baffled us that we actually seen this!"],"trends":["There have been 95 other sightings in Atlanta","There were no other sightings in Atlanta on or around February 18th 2013"],"Weather Factors":"Unknown","Case Number":"45782","Object Shape":"Diamond, Star-like","Summary":"hovered for few mins and disappeared or took of so fast that we didn't see it leave","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/45782.html.txt","/var/www/straped/mufon/org/45782.html"],"Object Flight Path":"Stationary","Log Number":"US-02182013-0023","Latitude":"33.753955","Tags":"City","City":"Atlanta","Viewing Distance":"Over 1 Mile, Unknown","Date of the Event":"02/18/2013 04:51 UTC","Source":"MUFON"}