{"Case Number":"4579","files":["/var/www/straped/mufon/html2text/4579.html.txt","/var/www/straped/mufon/org/4579.html"],"trends":["There have been 3 other sightings in Clackamas","There were no other sightings in Clackamas on or around March 23rd 2006"],"Source":"MUFON","Sighting Duration":"00:01:00","Date of the Event":"03/23/2006 09:40 UTC","Date Submitted":"03/23/2006 09:40 UTC","City":"Clackamas","Summary":"terrified as hell! (warof worlds)","Weather Factors":"Does Not Apply","Viewing Distance":"Over One Mile","Log Number":"US-03242006-0001","map":"<A HREF = \"http://maps.google.com/maps?q=45.41245,+-122.566939(4579)&iwloc=A&hl=en\"> mufon case (4579) map </A>","Disposition":"Unknown","Country":"United States","Object Features":"Other","Object Shape":"Disc, Egg, Oval","Longitude":"-122.566939","Tags":"City","Object Flight Path":"Straight-line path","Latitude":"45.41245","Region":"Oregon","divs":["Sighting DetailsI was at my house, and I let my dogs out. I noticed like a red sattlite floating, going paralle with earth's ground. I saw the first one (I thought it was a plane, we get many over-head), and then a second one, I thought no-way, military! The third one convinced me, this was no walk in the park, it scared me! Reason why is the 3rd flew in sequence, the sequence was so advanced that they approx. could have been about 100 miles apart. I can't explain, for one, planes don't fly like what I saw. They made no noise (the only noise I heard was from other planes, (almost like a roar or a swarm flying in after them?)). It was weird, the three ships flew, but not that fast, at first. I walked up the road still seeing them, like I could keep up, soon they disappeared way beyond an enviroment that was almost not noticeable, like a paradox or dimimesion, not of this earth. I'm not saying they disappeared in a flash, it's that they seemed close, but could have been a hundred of miles away. Red, orange, and yellow is all the craft shown (mostley red), I don't know what it was, besides UFOS. Many others would have seen it from miles around!"]}