{"Date of the Event":"02/18/2013 09:15 UTC","Weather Factors":"Unknown","Summary":"I had an alien in counter today. Serious as a heart attack! It had to have been a ship, like 20 feet from me this morning! I could see like a water bubble in the air 5-8 feet hovering above the ground at about 9:15am, I was loading my work truck and","Region":"California","trends":["There have been 4 other sightings in Inglewood","There were no other sightings in Inglewood on or around February 18th 2013"],"Date Submitted":"02/20/2013 01:07 UTC","divs":["Sighting Details I had an alien in counter today. Serious as a heart attack loading my work truck this morning! It had to have been a ship, the noise was unexplainable;, like 20 feet from me this morning! I could see like a water bubble in the air 5-8 feet hovering above the ground at about 9:10am, I was loading my work truck and heard this weird noise. Like wind going through straws, and then a huge gust blew past the light post and it was shaking vigorously only on one side ten feet from me bouncing up and down like it was about to snap then a noise like a jet taking off for a split second and street signs only on half of my block on east side of street were waving like a sling shot. It's more weir then anything. I've felt there ha been something for the last few years trying to show itself to me. Things disappearing, then in a few min later it shows back up in the same place it was when I left it. It left me feeling like I had just been placed in a trance for a few min after it left. Like something went through my mind, and took every ounce of strength out from my body. I was on the phone with one person while it was happening an they said I was full of it."],"files":["/var/www/straped/mufon/html2text/45798.html.txt","/var/www/straped/mufon/org/45798.html"],"Disposition":"Unresolved","City":"Inglewood","Object Features":"Other, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.95884,+-118.346708(45798)&iwloc=A&hl=en\"> mufon case (45798) map </A>","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Latitude":"33.95884","Viewing Distance":"20 Feet or Less, 21-100 Feet","Longitude":"-118.346708","Log Number":"US-02202013-0001","Object Shape":"Oval, Sphere, Other, Unknown","Country":"United States","Sighting Duration":"09:17:13","Source":"MUFON","Tags":"City","Case Number":"45798"}