{"City":"Kumbia","Case Number":"45810","map":"<A HREF = \"http://maps.google.com/maps?q=-26.691012,+151.653993(45810)&iwloc=A&hl=en\"> mufon case (45810) map </A>","Region":"Queensland","Disposition":"Unresolved","trends":["There have been no other sightings in Kumbia","This sighting has been favorited 1 time."],"Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was outside admiring the incredibly bright night sky in rural Australia near the township of Kingaroy with one other person. We observed many unusual orb like object darting across the sky which started our intregue with the night sky last night. Some were meteorites yet others were different altogether. I was standing facing north next to another individual when a strange feeling came over me that caused me to look back over my right shoulder and upward to the south east direction. I noted a large high altitude object that moved incredibly slow. Unless you watched it it looked stationary but using line of sight and landmarks determined the object to be moving from the north in a southerly direction. We watched it for a little over 10 mins as it headed south past power lines, edge of roof of house, and over the Bunya mountain region. Earlier we had commercial jets head north west to north queensland yet this object was much higher and much much larger than those planes we had seen earlier. My colleague also watched this massive object move so slowly until it disappeared in the south to the east of the Bunya Mountains. I was amazed and could not speak during the event out of shock and excitement at what we saw. This was larger than a city and can only be described as a massive mother ship in a typical cigar design. We saw the object disappear into the southern horizon around 2:26am. I have never seen anything like it before and for hours after all I could say was \"Fu$k WOW\". I just couldnt say anything else out of shock. The massive cigar object had a bright light at either end and between was the dark shape of the body of the 'vehicle' (if thats the right word to use). We have talked about it all day today and just cant get it off our minds. We continue to stay watching the night sky until 4am. We saw one other object which repeatedly came out of nowhere with massive bright light and then a swift darting back and forth to the same locations. This final event was just prior to 4am."],"Object Features":"Unknown","Weather Factors":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/45810.html.txt","/var/www/straped/mufon/org/45810.html"],"Tags":"City","Viewing Distance":"Over One Mile","Object Shape":"Cigar","Longitude":"151.653993","Log Number":"AU-02202013-0013","Date of the Event":"02/21/2013 02:15 UTC","Object Flight Path":"Hovering then path","Summary":"Giant Cigar Mother Ship - MASSIVE","Latitude":"-26.691012","Country":"Australia","Date Submitted":"02/20/2013 10:59 UTC"}