{"Disposition":"Unresolved","Sighting Duration":"Undisclosed","Log Number":"US-02212013-0007","Date of the Event":"02/21/2013 12:00 UTC","Object Shape":"Star-like","Object Flight Path":"Path with directional change,Path then hovering","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=34.277914,+-118.359094(45819)&iwloc=A&hl=en\"> mufon case (45819) map </A>","divs":["Sighting DetailsI was inside my house after dark, approximately 7:00pm pst. My wife and daughter arrived home from errands. They hammered on the front door, ringing the doorbell causing our dog to bark. I opened the front door, the girls were very excited pointing north. I thought they saw a coyote or some other animal but they were pointing to the sky North into the hills. I looked up and saw a bright light which at first looked like a helicopter in the distance. The object maneuvered in circles and figure eights, sometimes dropping quickly behind the trees, then quickly shooting up again. My wife handed me her iphone and I took a still image, my daughter reminded me to take video and I did that as well. The light remained constant and bright, at times seemed to fade off for a moment. It looked as if it had an additional red light, (very small). I could see no shape of an object, only light. I did not hear any noise coming from it, though my daughter thought she heard a faint \"buzz\" sound briefly, I did not. It moved through the sky randomly, then after about 10 minutes or so drifted down behind the tree tops. My only thought was that it might had been some sort of RC Toy, but by the way it moved about, dropping to the ground like a rock at times. It seemed the \"pilot\" was very confident in his abilities to fly it so close to exposed power lines, houses and rugged hills and at night. I don't know what it was."],"City":"Los Angeles","Weather Factors":"Unknown","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around February 21st 2013","This sighting has never been favorited.",""],"Object Features":"None","Latitude":"34.277914","files":["/var/www/straped/mufon/html2text/45819.html.txt","/var/www/straped/mufon/more/45819_submitter_file1__LVTUFO.JPG","/var/www/straped/mufon/org/45819.html"],"Source":"MUFON","Country":"United States","Longitude":"-118.359094","Case Number":"45819","Summary":"My wife, daughter and I saw a bright light North toward the hills in front of our house. Object hovered, ascended quickly, descended quickly, randomly maneuvered figure 8's circles etc. then disappeared below treetops.","Date Submitted":"02/21/2013 03:00 UTC","Tags":"City","Viewing Distance":"501 Feet - 1 Mile"}