{"Summary":"Was outside and looked up. Noticed object moving in a SE direction and shortly after viewing it, it grew bright then faded back to orignial light. Moved on off to the SE.","Weather Factors":"Does Not Apply","Latitude":"34.854858","divs":["Sighting DetailsIt was 3:58 am Fri morning March 24, 2006. I was outside in my driveway walking down to get the morning paper. I looked up into the sky, casually gazing at the stars when a moving object caught my attention. I wondered if I was looking at a satellite moving across the sky because it seemed to be too high to be a jet of some sort unless it was a military craft that flew at very high levels. Anyway I stopped walking and watched it. About 5 to 10 seconds after I stopped to watch it, the object grew in brightness and remained really bright for about 3 seconds then faded back to where it was previously. I chuckled and said to myself something like well if this is another UFO then it is acknowledging me that it knows I am watching it. Casually I watched it as it kept on moving off in a general south eastern flight path. After about 3 minutes or so, I couldn't track it due to trees so I stopped watching and went on to get the paper and go back inside the house."],"Log Number":"US-03242006-0003","Object Features":"Unknown","City":"Meridianville","Date of the Event":"03/24/2006 03:58 UTC","files":["/var/www/straped/mufon/html2text/4581.html.txt","/var/www/straped/mufon/more/4581_submitter_file1__carambola.jpg","/var/www/straped/mufon/org/4581.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.854858,+-86.567225(4581)&iwloc=A&hl=en\"> mufon case (4581) map </A>","trends":["There have been 8 other sightings in Meridianville","There were no other sightings in Meridianville on or around March 24th 2006","This sighting has never been favorited.",""],"Object Shape":"Star-like","Longitude":"-86.567225","Source":"MUFON","Date Submitted":"03/24/2006 03:58 UTC","Region":"Alabama","Viewing Distance":"Unknown","Sighting Duration":"00:03:00","Tags":"City","Object Flight Path":"Straight-line path","Disposition":"Unknown","Country":"United States","Case Number":"4581"}