{"Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/4582.html.txt","/var/www/straped/mufon/more/4582_submitter_file1__Object_Mar_2006.jpg","/var/www/straped/mufon/more/4582_submitter_file2__Entity_Mar_2006.jpg","/var/www/straped/mufon/org/4582.html"],"Object Flight Path":"Stationary,Hovering then path","City":"Ogallala","Sighting Duration":"00:15:00","Weather Factors":"None","Case Number":"4582","divs":["sighting detailshad pulled into a shell gas station near ogalala, nb. husband had gone into gas station for coffee, while wit was sleeping in back of truck (accessible between cab and flatbed of pu truck). wit was sleeping in the back of the truck. sat up and looked out of the front\\windshield and observed object. watched object for approximately 15 minutes (note: may have been indeterminatly longer, as this may have been a ce4 event). husband came out of gas station, and wit pointed out object to him. he got into truck, and started ignition. drove off in opposite direciton. note: husband had no apparent reaction to sighting of object. wit watched object for about five minutes in rear window of truck as drove off. lost sight of the object in the distance as truck drove off. ====================== note: wit described under hypnosis, a close encounter of the fourth kind. she was taken aboard the craft. there she encountered multiple entities. she described the scene as somewhat of a \"family reunion\" with multiple adult humanoids and hybrid children. sketch of adult being is attached. sketch of object is also attached."],"Tags":"City","Date of the Event":"03/22/2006 08:30 UTC","Summary":"Nebraska I80 Truckstop CE1/CE4 - large hovering disk plus abduction","Log Number":"US-03252006-0001","map":"<A HREF = \"http://maps.google.com/maps?q=41.128889,+-101.719444(4582)&iwloc=A&hl=en\"> mufon case (4582) map </A>","Region":"Nebraska","Source":"MUFON","Latitude":"41.128889","Country":"United States","Longitude":"-101.719444","Date Submitted":"03/22/2006 08:30 UTC","trends":["There have been 2 other sightings in Ogallala","There were no other sightings in Ogallala on or around March 22nd 2006","This sighting has never been favorited.",""],"Object Features":"Other","Disposition":"Unknown","Object Shape":"Oval"}