{"Weather Factors":"Unknown","Summary":"Ongoing, difficult to reconcile with personal schematic repertoire or frames of reference","City":"Coquitlam","Viewing Distance":"20 Feet or Less, 21-100 Feet","Country":"Canada","files":["/var/www/straped/mufon/html2text/45827.html.txt","/var/www/straped/mufon/org/45827.html"],"Region":"British Columbia","Object Shape":"Disc, Sphere, Star-like, Other","trends":["There have been 4 other sightings in Coquitlam","There were no other sightings in Coquitlam on or around January 19th 2013"],"Log Number":"CA-02222013-0002","Date Submitted":"02/22/2013 02:07 UTC","Source":"MUFON","Tags":"City","Object Features":"Dome, Other","Object Flight Path":"Stationary,Path with directional change,Other,Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=49.289219,+-122.808206(45827)&iwloc=A&hl=en\"> mufon case (45827) map </A>","divs":["sighting detailsongoing!!! unbelievable. consequences, personally, legally, financially continue to accrue. i am more than willing to submit to any form of verification\\corroboration at your disposal. ongoing contact and the nature thereof appears to suggest an elevated degree of willingness to maintain and cultivate inter-subjective understanding. i believe with a high degree of probability that entities continue to capitalize on writer's ability to communicate by nonconventional means. writer' awareness of this particular capacity is recent, with increasing acuity. qualifying the subsequent interpretation as personal and possibly subjective, phenomenological activity relative to ongoing contact\\communication appears to be a fascination and\\or appreciation for writer's application of logic, facilitated by an ability to seemingly read and\\or understand writer's thought processes, as well as ideas. often, prior to writer forming the latter. influencing intentionality through 'suggestion', appears to be a game (unable to determine rules), and fundamentally reflective of most exchanges. writer's overall impression has given rise toward inclinations that the intended motive for continued entity presence may be to actualize or effect structural change in either the inter-state\\gloabal levels, or beyond. or both. [name removed\\cms\\tg]"],"Case Number":"45827","Disposition":"Unresolved","Latitude":"49.289219","Sighting Duration":"12:59:59","Longitude":"-122.808206","Date of the Event":"01/19/2013 03:59 UTC"}