{"Disposition":"Unresolved","trends":[],"Object Shape":"Disc","Sighting Duration":"Undisclosed","Object Features":"Other","Case Number":"45823","Latitude":"34.52194","Date Submitted":"02/21/2013 08:24 UTC","Longitude":"-105.86647","Country":"United States","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Region":"New Mexico","Weather Factors":"Unknown","Summary":"saucer with electromagnetic center ring traveling around saucer moving same speed as alternating red and green lights saucer about60 ft acrossI was camping","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.52194,+-105.86647(45823)&iwloc=A&hl=en\"> mufon case (45823) map </A>","Tags":"City","Date of the Event":"09/12/1991 11:11 UTC","files":["/var/www/straped/mufon/html2text/45823.html.txt","/var/www/straped/mufon/org/45823.html"],"Viewing Distance":"21-100 Feet","divs":["Sighting DetailsI was camping out with a friend at Howell springs,near Hachita,N.M.We had a campfire going and were just sitting around and shooting the breeze.I had just looked at my watch a few minutes earlier.I don't know what made me look but,I turned my head and looked up the hill and there was a flying saucer just hovering above the ground about twenty-five ft.I got up off the ice chest I was sitting on.I called it to the attention of my buddy and we walked up the hill and stood next to it.It was about 60 ft across and had a ring that was not attached to anything but it had an upper and lower track that was stationary and the middle ring rotated at the same speed as the oval shaped red and green lights that pulsated around the saucer intermittently.The saucer was kind of metallic looking but you felt like you could see through it,but you couldn't.I was expecting little geen men to start coming out of this sumbitch,but nothing happened.It just sat there hovering about 45 minutes.Then the middle ring and the lights started spinning really fast and I mean fast then it turned like white hot and swish, that fast it looked like the most distant star you could see.It went north.After all the excitement to put it mildly,we walked back down to camp we talked about it till there was nothing left to say.we were sitting in the exact same place,this was about three hours later, and the exact same thing happened again Every detail was exactly like the first time.We decided we better not tell anyone because they would think we were crazy or some thing.But now I just gotta. I haven't seen my buddy sincce the end of the job we were working on together but if you ask him he'll tell you the same thing. there's one thing I know,I could build you one.I know how they work.and I know why they work. the best way to describe how I felt was just awe stricken.I was not afraid,just awe stricken,and I remember trying to send them telepathy to give me a ride on it and they came back but like I said,S every thing was exactly the second time as it was the first time. Sometimes when I wake up,I'll say something off the wall,and I have no idea where it came from,like cosmic shouting center or inter galactic harmonic reciprocator,which is pretty cool but some what strange,don't you think? i"],"Log Number":"US-02212013-0011","City":"Undisclosed"}