{"Summary":"light from clear night-time sky turned into solid-body craft that hovered over large field where NASA announced over local TV news a huge fireball had impacted the earth, the craft flew away less than 25 feet above our heads.","Country":"United States","divs":["Sighting DetailsMy friend and I were sitting in her mom's yard facing Taylor's Ridge when we heard the sound. I looked at her and said \"Our plane has returned!\" refering to our previous experience at the same location in December. The sky was crisp and clear; I don't recall wearing a jacket so it must have been a warm night; the moon must have been behind us because the sky was light; and the eastern sky was alive with the \"stars\" that had been flying around for over a year. The sound was that of a slowly-rotating washing machine tub off-balance and filled with several large round cannonballs. The two dogs leashed to a clothesline had once again became still and were watching the sky also. We both carried cellphones with cameras; why we did not attempt to take photos I just can't understand. After several seconds a pin-prick of white light appeared, growing larger, turning orange, then just as before began changing into a laser-light show similar to an Etch-A-Sketch. From rectangle to square to angles of every conceiveable shape then circles and cylinders and cones the object settled on it's previous shape a triangle of two equal sides and a shorter base. I realized it was moving once again very slowly towards us growing larger just as before. Then I noticed the thing seemed to be out of control. My thoughts were \"Great! A flying saucer is about to crash-land right here in downtown Catlett!\" The sights I saw next became so unbelievable that I was hesitant to ever report this sighting. The orange triangle morphed into a solid-body type of fighter from a very popular series of movies. But... there was a slight bit of a problem! Parts of the craft were fading in and out; the craft floated gently to a large grassy area and hovered. So much more to tell but I really don't want to in a public post. Let's just say that whatever that thing was it was of something and somewhere that makes all our troubles unimportant."],"trends":["There have been no other sightings in LaFayette(Catlett communi","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=32.158565,+-82.901763(45820)&iwloc=A&hl=en\"> mufon case (45820) map </A>","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering,Other","Sighting Duration":"Undisclosed","Object Features":"Dome, Window(s), Appendage(s), Louvres, Wings, Other","Source":"MUFON","Date of the Event":"01/12/2013 12:00 UTC","Weather Factors":"Unknown","Latitude":"32.158565","Disposition":"Unresolved","Log Number":"US-02212013-0008","Date Submitted":"02/21/2013 04:09 UTC","files":["/var/www/straped/mufon/html2text/45820.html.txt","/var/www/straped/mufon/org/45820.html"],"Viewing Distance":"20 Feet or Less, 21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile, Unknown","Object Shape":"Bullet, Missile, Cone, Cylinder, Fireball, Flash, Sphere","Region":"Georgia","City":"LaFayette(Catlett communi","Case Number":"45820","Longitude":"-82.901763","Tags":"City"}