{"Object Features":"Other","Date Submitted":"02/22/2013 03:43 UTC","Object Shape":"Circle, Fireball, Sphere","Country":"United States","Case Number":"45837","divs":["Sighting DetailsOilfield .. my truck was facing north.. my partners was facing south at about 9pm my partner said what the hell is that? I looked in my door mirror to see all sorts of lights .. I then got out of my truck to get a better look... at first I really thought two jet fighters were dogfighting and it was tracers,missles and flares going off... it was that bright. but as you watched it.. it was 4 bright white light orbs moving at a very high speed all around each other.. one then shot out balls of fire that lit up the night sky.. then it would retract the balls of fire back into itself... the orbs would disappear then show up in a completly different spot moving around very very fast.. then fire balls would spit out in all directions then get sucked up by the one orb again.. this happenned four or five times.. I then grab my phone to get this on camera.. because it was so unreal.. when I grabbed my phone and finally got it to camera.. all four orbs lined up like a single craft and moved as one.. headed north towards us. I tried to film it but it shows up as all black... maybe a computer can break it down... then all four orbs were strobing as they went over head.. but would tilt in unison on occasion to the left then to the right by ninty degrees.As if it was one. I called 911 afterwards to see if anyone else had seen this and that it was moving north... they said noone had called anything in.. which amazed me.. because it lit up the sky so brightly at first.. you couldnt miss it.. almost like lightning...We went to the other pad site and the Flo-back guys had seen them also.."],"Log Number":"US-02222013-0011","Summary":"White objects shot out balls of flame then retracted them. appeared then disappeared then gathered together and traveled north","Latitude":"28.66748","Weather Factors":"Unknown","Tags":"City","trends":["There have been no other sightings in Dilley","This sighting has never been favorited."],"Region":"Texas","City":"Dilley","Longitude":"-99.170589","map":"<A HREF = \"http://maps.google.com/maps?q=28.66748,+-99.170589(45837)&iwloc=A&hl=en\"> mufon case (45837) map </A>","Disposition":"Unresolved","Object Flight Path":"Path with directional change","Source":"MUFON","Date of the Event":"02/21/2013 09:05 UTC","files":["/var/www/straped/mufon/html2text/45837.html.txt","/var/www/straped/mufon/org/45837.html"],"Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed"}