{"Viewing Distance":"101-500 Feet","Object Features":"Other","divs":["sighting detailsabout 6:15pm, 2\\22\\13 in south san jose we saw a black rectangular line in the sky. i was getting the car keys from one of the witnesses and noticed the object just over their right shoulder in the sky. we thought it was a stray balloon at first but quickly realized it wasn't. it was moving south, slowly and in a steady path. when the other 2 witnesses saw it, it seemed to turn and look oval and then triangular. it was solid black on the 3 sides in color except the middle which looked see-through. one side was not as straight or as wide as the other 2. one witness said it looked like a person was in the middle. it seemed to turn and spin slowly as we looked at it. i turned the car off, and listened for any sounds coming from the direction of the object and there were none. there were no airplanes, helicopters, birds, etc. it was not a balloon simply for the deliberate path it was taking. it wasn't floating or moving in the wind. we watched it for a good 5-6 minutes and it started moving farther away towards los gatos direction. we all felt a little scared. we had no idea what it was. i was kind of frozen watching it. i had dreams about it the same night. we watched it as we were walking towards our stairs and when we looked back for it within about 2 seconds and it was ascending and then it was gone. it was the darkest black object i'd ever seen."],"Date Submitted":"02/23/2013 06:46 UTC","Object Flight Path":"Path with directional change,Path then hovering","Object Shape":"Oval, Triangle","Sighting Duration":"Undisclosed","Log Number":"US-02232013-0007","Latitude":"37.302319","Weather Factors":"Unknown","Longitude":"-121.792569","Country":"United States","files":["/var/www/straped/mufon/html2text/45848.html.txt","/var/www/straped/mufon/org/45848.html"],"Case Number":"45848","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=37.302319,+-121.792569(45848)&iwloc=A&hl=en\"> mufon case (45848) map </A>","City":"San Jose","Summary":"Shape changing UFO South San Jose","Disposition":"Unresolved","trends":["There have been 106 other sightings in San Jose","There were no other sightings in San Jose on or around February 22nd 2013"],"Tags":"City","Date of the Event":"02/22/2013 06:15 UTC","Region":"California"}