{"Summary":"Began with object appearing over phone lines. Ended with two objects out in field area.","divs":["Sighting DetailsI was talking on the phone around the time of 11:00, and I got off when my friends arrived. So around 11:30, we sat in my backyard and discussed previous UFO sightings, and I spoke about my \"Ufo in Horn Lake\" video. After that, we walked to the center of my backyard and gazed at the stars, and when I began playing music, a ship appeared in front of us, and it was as low as the telephone lines outside of my cove! At first, this thing appeared to be a plane as it flew over my backyard. I ignored it, and a second or two later, it makes some sort of U turn and it slowed down. It began to turn, showing the bottom of it and the lights were BRIGHT. There were several rows of red lights, and the lights blinked in such a well played pattern. It was signaling to us, and if I think about it deeply, it was reacting to my music. I stopped the music and attempted to record this craft, and it began to move in that side ways position until vanishing into thin air!!! We were blown away! So after that sighting, we were determined to see this again, but at the field. We drove a few miles into the middle of nowhere, and parked next to a corn field with no intentions. We stood in the road and watched the skies for it to return. It took a minute for it to appear out of nowhere, and it began flashing a red light. We decided to move closer, and once we got into the car to move forward, it began to leave. So I demanded for us to stop and get back out because of the fact of a red light means, stop, warning, and or danger. I figured that it meant stop, so we stopped. It came back from a transparent look! We stood in place and examined this ship. It was over a line of trees, and it seemed to be over the Memphis area as we stood in Mississippi but it seemed closer at the same time. Going on with the event... The ship began to move to the left, and the Mississippi River was in the direction that it was heading. The weird thing about this is, it began to lag or glitch. It would move and stop completely. Then jump forward in a mere second, and back, and into that spot again. Until we lost it for a second, and it appeared moving into the same direction but further ahead. It stopped and began to fade in and out. It drops a ball of light, and a beam is shot down afterwards. It vanished after that, and to the far right another ship came! They both looked exactly the same and the other soon appeared. The one to the right was moving quickly, as the other was moving slowly. They both met up where the first one appeared from the start. We watched them blink in a pattern. It was like they were speaking to each other, and or us. They both began to vanish and appear. I then heard some sort of muffler like sound and the thought of a truck driving by crossed my mind. I turned around and didn't see anything. I told the others, and we all look back and there were two orbs. A white light, and a red light. They were POSING AS A VEHICLE! It was way to low to be a truck or a car, and when we pointed that out, the lights curved into the naked field on the side of us. They moved down the field away from us and QUICKLY turned around speeding towards us! We jumped into the vehicle and left the scene. The muffler sound was heard by one other, and the other two didn't hear it. It sounded like a muffler, but with a growing sound! There was something in the corn field and I am certain that it was no animal! It was loud, and made my skin crawl. After this event, we didn't go straight home but we sat at a local waffle house. Oddly enough, the streets were empty and so was the waffle house. It was a strange night. The worker at waffle house even stated that it was bizarre that she had no customers. Once I got dropped off, my night turned into fear. I sat in my living room and felt like I was being watched from the back door. I turned on my living room light and sat until my mom woke up. I fought to stay awake and something snapped beside my ear, and my head dropped! I quickly jumped up and said \"No!\" Something tried to put me to sleep, and I am not making this up. I dozed off finally, and it seemed like a second had passed by when I jumped up from the small sleep. My mom made a noise that woke me , and my vision was grey and full of black numbers and letters. They were scrolling in my vision and that was that! That ended my night as the sun began to rise. The whole day I stayed up thinking about my night."],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.965613,+-90.14655(45843)&iwloc=A&hl=en\"> mufon case (45843) map </A>","Weather Factors":"Unknown","Log Number":"US-02232013-0002","City":"Walls","Tags":"City","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Object Shape":"Unknown","Viewing Distance":"20 Feet or Less, 501 Feet - 1 Mile","Date Submitted":"02/23/2013 09:36 UTC","Case Number":"45843","Country":"United States","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/45843.html.txt","/var/www/straped/mufon/org/45843.html"],"Object Features":"Other","Latitude":"34.965613","Longitude":"-90.14655","trends":["There has been one other sighting in Walls","There were no other sightings in Walls on or around June 27th 2012"],"Date of the Event":"06/27/2012 12:00 UTC","Disposition":"Unresolved","Region":"Mississippi"}