{"Date Submitted":"02/23/2013 10:04 UTC","trends":["There have been 2 other sightings in Memphis","There were no other sightings in Memphis on or around January 9th 2013"],"Object Shape":"Cylinder, Oval, Sphere","Object Flight Path":"Path with directional change,Path then hovering,Other","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.045785,+-89.843081(45844)&iwloc=A&hl=en\"> mufon case (45844) map </A>","City":"Memphis","Country":"United States","Viewing Distance":"21-100 Feet, Over 1 Mile","files":["/var/www/straped/mufon/html2text/45844.html.txt","/var/www/straped/mufon/org/45844.html"],"Log Number":"US-02232013-0003","Object Features":"Unknown","Longitude":"-89.843081","Source":"MUFON","Weather Factors":"Unknown","Disposition":"Unresolved","Case Number":"45844","Latitude":"35.045785","divs":["Sighting DetailsI just posted a sighting that I had in June of 2012, so I will keep this one detailed but not as long. The night began with me and two others walking through a trail in the woods near the Mississippi River. We walked half a mile until turning back around due to mud. When we got back to the car, we sat in the car and started a conversation. I began to play music on my phone, and a red light shot out of the area that we were just walking through. I watched it cross the river, and I pointed it out to them as it stopped over Arkansas. It was over a line of trees and it began to move to the right and turn around quickly, going back to the left. It did this over and over again, and the sound that came from it rattled the area in a weird sense. It sounded like 7-10 helicopters in one spot. It was a humming sound with a rumble to it. When it made it to the turning point, it would make a THUNDER noise and release an orb or two. It would always do it under this one single cloud that sat in the sky. The orbs would shoot to the right, or Up. When the orbs shoot out, they would swing back, and the red light would go back to the left. With that on repeat, I pulled out my phone and turned on my strobe light. It did one more release of orbs, but this time they didn't vanish, they stayed around the red light. They then began to cross the river at a fast pace, and during this they had time to transform. The two lights turned into solid shapes that were metallic black. The red light stayed in the back as they all connected. It was like a sky chariot! I have never seen anything like it, and since that day I have been bottled about what I saw. It vanished and I haven't seen this craft since."],"Tags":"City","Date of the Event":"01/09/2013 12:00 UTC","Summary":"Red orb darts out of woods. Shoots orbs out several times. Shape shifts at the end of event","Region":"Mississippi"}