{"Object Shape":"Oval","files":["/var/www/straped/mufon/html2text/45840.html.txt","/var/www/straped/mufon/more/45840_submitter_file1__2013022221.37.51.jpg","/var/www/straped/mufon/org/45840.html"],"Weather Factors":"Unknown","City":"Lansing","Disposition":"Unresolved","Latitude":"39.243874","Object Features":"Unknown","Case Number":"45840","Viewing Distance":"Over One Mile","Log Number":"US-02222013-0014","divs":["Sighting DetailsI was driving east down West Mary street on my way home I noticed a very bright light north east of my position. while trying to determine what it was the lights dimmed on it and I could see an oval shaped outline I slowed down and tried to take a picture of it with my phone, as it just sat there stationary. There were no planes no visible aircraft in the area just the strange light. I am estimating that it was just on the other side of the Missouri river parallel to Ft. Leavenworth I watched it for a few minuets it did not change or move the lights on it seemed to pulsate a bit not enough for me to consider them flashing just kinda of dim and grow back in intensity to the state they were after the it initially dimmed. I then proceeded the rest of the way home as it was about a block from my apt where I was sitting observing the event. I got home went in to tell my wife about it my stepson went back outside to see if we could still see it I could barely as the lights around my complex were bleaching out the horizon it was difficult but i could tell there was something still there. I went back inside again for a moment, came back out and I could no longer see it. What the object was I have no idea it was not like any aircraft I have seen before, it sat perfectly still not the slightest hint of any sway or movement of any kind. I looked over the photo I snapped but there seems to be nothing on it."],"Longitude":"-94.905694","trends":["There has been one other sighting in Lansing","There were no other sightings in Lansing on or around February 22nd 2013","This sighting has never been favorited.",""],"Region":"Kansas","Source":"MUFON","Date Submitted":"02/22/2013 11:24 UTC","Tags":"City","Object Flight Path":"Stationary","Date of the Event":"02/22/2013 09:40 UTC","Sighting Duration":"Undisclosed","Country":"United States","Summary":"Bright light hovering near Ft. Leavenworth","map":"<A HREF = \"http://maps.google.com/maps?q=39.243874,+-94.905694(45840)&iwloc=A&hl=en\"> mufon case (45840) map </A>"}