{"divs":["Sighting DetailsThis experience i describe has been happening multiple times in my life, i feel summoned outside and they seem to signal me with specific patterns of formation and light signals, usually white brillant flashes but also a red lazer seems to lock with my eyes. im overcome with emotions foriegn to me and feel as if they are trying to tell me things. On a nightly basis i feel summoned outside, so i take a cigarette and sit outside and usually one appears out of nowhere and seems to flash light directly at me. Over this week they have flashed beams at my residence which seem to not emit a trial but appear directly by me. I have tried to signal back with a lighter and a LED flashlight and they flash specific sequences seemingly in reply. I would dismiss these as regular craft but the movements are not within our current technology as far as i know, i do not believe a human could withstand the sharp angle movements.Last night two of the crafts absorbed into one another and then dropped something out of the newly formed unidentified object. On other occasions i would go for walks and remember taking note of the constelation orion to show my girlfriend right over head, we walked about 50 and both were cold so we returned home, i had apparently lost over an hour of time and only thought to check once i noticed that orion was now on the horizon when it was almost directly overhead moments before. Its difficult scribing my events because of the constant headaches. I only chose to write this after me and my girlfriend started getting odd bruises and markings that we couldnt figure out how we got. she then said that we should check on symptoms of alien abduction which led me here. I believe that if i were ask questions by someone with more knowledge of these abnormalities i would be able to articulate it better, i have not been sleeping and feel a bit confused in trying to express this. Also at odd intervals of the night i feel summoned to go outside and they once again appear, this has been happening over a week straight now. My girlfriend has seen them with me everytime. and when she was alone would not see them unless i walked outside and and thought about them. its an uneasy feeling and have multiple physical problems since these more recent experiences, including but not limited to odd pains in specific parts of my body accompanied by bruising and raised and dented skin among other things. im searching for answers. once again this has been on going my entire life since i can remember. i have a better memory than anyone of my friends or family and find it extremely odd that i have large periods of my life missing from my memory as a child and now more recently as an adult i have been taking more notice to these instances, when as a child i brushed all of it off as nightmares or some sort of acute ptsd."],"Log Number":"US-02232013-0004","trends":[],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/45845.html.txt","/var/www/straped/mufon/org/45845.html"],"Date of the Event":"02/22/2013 08:30 UTC","Weather Factors":"Unknown","Country":"United States","Object Shape":"Sphere, Other, Unknown","Longitude":"-119.408402","City":"Undisclosed","Sighting Duration":"01:00:00","Summary":"changing color, lazer light direct to me, absorbed other craft","Date Submitted":"02/23/2013 12:37 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.787441,+-119.408402(45845)&iwloc=A&hl=en\"> mufon case (45845) map </A>","Object Features":"None, Unknown","Viewing Distance":"Unknown","Case Number":"45845","Disposition":"Unresolved","Latitude":"36.787441","Tags":"City","Object Flight Path":"Path with directional change,Other","Region":"California"}