{"Object Flight Path":"Straight-line path","Date of the Event":"02/23/2013 08:45 UTC","Case Number":"45849","Summary":"3 glowing orbs traveling slowly from west to east","map":"<A HREF = \"http://maps.google.com/maps?q=42.123381,+-87.941123(45849)&iwloc=A&hl=en\"> mufon case (45849) map </A>","Object Shape":"Circle, Fireball, Sphere","divs":["sighting detailsit was 8:45 in the evening and i was taking the dog out. as i walked out the door to let the dog out, i always make it a habit to look up at the sky to see what the stars look like for the evening. today was a bonus! as i looked out to the west i saw a red glowing orb moving slowly towards the east. i saw it go overhead above the condo unit i live in. curiosity got the best of me and i walked out and around the building to see if i could continue seeing it. as i tried looking for it, i saw another red\\orange orb following the same path the first one went through. as i fumbled for my phone to see if i could record it, i saw a third red\\orange orb following the exact path and moving slowly. that is what i was able to capture on the video, the 3rd object. the whole event lasted about 3mins. all of the glowing lights appeared to be above & below the clouds as i could see the clouds affecting the glow. which made it appear randomly pulsating. but i'm not sure if that was the clouds. it definately did not have blinking lights, like a plane normally does. this was different. and relatively big in the sky. it made no noise and it kept a consistent slow speed across the sky. it went directly overhead. the best way to visually describe it is like looking at a slightly out of focus point of light moving across the sky."],"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/45849.html.txt","/var/www/straped/mufon/org/45849.html"],"trends":["There have been 2 other sightings in Wheeling","There were no other sightings in Wheeling on or around February 23rd 2013","This sighting has never been favorited.",""],"Region":"Illinois","Tags":"City","Longitude":"-87.941123","City":"Wheeling","Date Submitted":"02/23/2013 10:40 UTC","Log Number":"US-02232013-0008","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Country":"United States","Latitude":"42.123381","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON"}