{"City":"Madison","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/45858.html.txt","/var/www/straped/mufon/org/45858.html"],"Object Shape":"Disc, Egg, Oval, Sphere, Star-like","Date Submitted":"02/24/2013 02:01 UTC","Viewing Distance":"Over 1 Mile, Unknown","Summary":"F-16 in trail of non strobe object which made RAPID decent straight down without changing speed.","divs":["Sighting DetailsI stepped outside at 3:30am to have a cigarette and observed a red pulsating strobe in the SE sky. Looking at the strobe which was traveling SE I thought to myself - this is either a late night cargo flight to Milwaukee or a red-eye flight. I then observed a non pulsating light in front of the object in the same trajectory of flight. That got me confused and excited as I thought wow this actually might be a military exercise of some sort. The red strobe object was in trail and after about 30 seconds of observation I heard a distant roaring sound that's familiar to me as an F-16. They fly daily from Truax Field here in Madison, home of the National Guards 115th Fighter Wing. They often fly directly overhead at low altitude, and most residents here are familiar with their distinct sound. Then the steady light object in the lead made an abrupt 90 degree turn straight down at a speed that made my heart skip a beat. The decent took about 2 seconds and I lost sight of it beyond the tree line. My conservative estimation is that it dropped more than ten thousand feet in those 2 seconds. The strobe object in trail turned down to follow it, but was nowhere near as fast. I'm making this report because no possible estimation of the speed of decent can convince me this was a conventional aircraft or even a drone. Immediately after I lost visual on both objects I saw a third bluish non strobe star like object directly over where the first two objects descended. It seemed to me that it appeared from very high altitude. It hovered in the sky and then slowly dropped down behind the tree line. There was no noise. If it was a drone being tested at night there wouldn't have been a fighter in trail, nor would the non strobe object be illuminated at all. My only logical explanation is that I saw a commercial aircraft and also a satellite. At the moment I lost sight of the satellite a meteor came down at 90 degrees directly over it. This seems impossibly unlikely."],"Log Number":"US-02242013-0007","Sighting Duration":"00:05:00","trends":["There have been 23 other sightings in Madison","There were no other sightings in Madison on or around February 24th 2013"],"Region":"Wisconsin","Object Flight Path":"Path with directional change,Path then hovering","Case Number":"45858","Object Features":"Unknown","Weather Factors":"Unknown","Source":"MUFON","Longitude":"-89.39404","Date of the Event":"02/24/2013 03:30 UTC","Country":"United States","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=43.075762,+-89.39404(45858)&iwloc=A&hl=en\"> mufon case (45858) map </A>","Latitude":"43.075762"}