{"Summary":"Looking through my cannon eos with a 55-250 lens saw a white object snapped about 30 stills.","Source":"MUFON","Longitude":"-75.876168","Country":"United States","City":"Wilkes-Barre","files":["/var/www/straped/mufon/html2text/45855.html.txt","/var/www/straped/mufon/org/45855.html"],"divs":["Sighting DetailsI was on my deck taking pics of the sky,as i was looking through my camera i noticed a shiny white object. Not sure if it came out of a cloud or just materialized. But when i did notice it i started snapping,i have about 30 stills of the object. This is not the first time i think i have this object recorded. In the middle of January i was having my roof replaced so i would go on the deck and take pics of them working. This time though i was using the movie function on the camera and had it on a tripod,i did not notice this one till i reviewed the couple minutes of footage.For about ten seconds it shows a very bright object moving between clouds decending. This time i was shocked to see it so well. Even thogh inthink if i was not looking through the camera i might have missed it entirely. For a couple of seconds it was in view,it moved like it was folding in on it self,also it moved very fast like zig zagging. As far as what i thought it maybe if you ever seen pics of the smaller so called energy orbs that you would get by taking pics in a cemetery. Been then i thought it would have to be the size of a 50 \" tv. I have to say i was very excited and pleased that it showed itself to me, becouse it was cold and i would almost bet no one else in the valley was out taking pics. Finaly as how i lost sight of it from all the pics you could tell it rised higher in the sky and phased out. I just kept snapping until i couldn't see it any more. Thanks for listening ,and by chance you would like all thirty pics to see it how i did send an email and i would be happy to send all of them. Pretty amazing !"],"Object Shape":"Sphere, Other","Date of the Event":"02/18/2013 12:00 UTC","Viewing Distance":"Over One Mile","Tags":"City","Region":"Pennsylvania","Log Number":"US-02242013-0004","map":"<A HREF = \"http://maps.google.com/maps?q=41.248315,+-75.876168(45855)&iwloc=A&hl=en\"> mufon case (45855) map </A>","trends":["There have been 14 other sightings in Wilkes-Barre","There were no other sightings in Wilkes-Barre on or around February 18th 2013"],"Object Features":"None, Other","Disposition":"Unresolved","Case Number":"45855","Latitude":"41.248315","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Flight Path":"Other","Date Submitted":"02/24/2013 11:59 UTC"}