{"divs":["Sighting DetailsMe and my girlfriend were just leaving my house and we stoped at a stop sign. the we noticed a glowing orange light. it seemed about golf ball size from where we sat but i couldnt say the true size. and it seemed to be moving very slow. it was coming diagonally from left. and it was only getting slower. then it was just hovering. then slowly it made a sharp diagonal turn to the right. it was moving away from us. and it seemed to getting smaller ass it went up. as if going into space. then as we were watching this one disappear, a larger one came up sharply from the left. it hovered in the same spot as the other. then it started a slow diagonal ascension in the same spot as the other and flew away in the same direction as the other. as if following it. by now the first one was gone. and soon after the other one disappeared to. my girlfriend has also witnessed another ufo sighting in our town a few months before. i took video but it did not turn out"],"Date Submitted":"02/23/2013 11:38 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.428947,+-89.776696(45851)&iwloc=A&hl=en\"> mufon case (45851) map </A>","Region":"Tennessee","files":["/var/www/straped/mufon/html2text/45851.html.txt","/var/www/straped/mufon/org/45851.html"],"Object Flight Path":"Path with directional change","Source":"MUFON","Log Number":"US-02232013-0010","Latitude":"35.428947","Weather Factors":"Unknown","Object Features":"None","Tags":"City","Summary":"Me and my girlfriend saw an orange light glowing and moving in a direction our way so we watched then it was flying away slowly diagonally away from us when another light came up diagonally and disappeared in the same direction of the first light","trends":["There has been one other sighting in Atoka","There were no other sightings in Atoka on or around February 23rd 2013"],"Country":"United States","Date of the Event":"02/23/2013 08:40 UTC","Viewing Distance":"501 Feet - 1 Mile","City":"Atoka","Case Number":"45851","Object Shape":"Unknown","Longitude":"-89.776696","Sighting Duration":"Undisclosed","Disposition":"Unresolved"}