{"trends":["There has been one other sighting in Hale","There were no other sightings in Hale on or around March 25th 2006"],"divs":["Sighting DetailsI was at our cabin on Sage Lake at Hale ,MI at the south east side. I was letting out the dog at 11:00pm It was a very clear night. I observed what I initally thought was an aircraft with it's flashing light. But after 5 min or so I realized it had not moved. Then I looked closer it was pulsating Red, green, pink, violet, blue, yellow and white. I then observed it through 8 power bonoculars. That is when I called my wife out to see it. We both saw a cluster of lights flashing. I then set up my 80 power spotting scope and confirmed the separate lights that made it up. I took notes of what we saw. From my location it was 255deg. by about 10to 15 degs. up from the horizon. While observing it with the 80 powers scope. I noticed it was moving very slowly to the north. There were two aircraft passing by at the time probley within 20 mile of my location. The object appeared a great distance away but was as bright as a commercial airliners landing lights. I actually left me blinded as you would be if you were looking at a bright object in the dark then looked away. There was a light cloud cover that drifted in and I lost sight of it at 11:33pm. I went back into the house and after 10 minuts I looked again and it was still there. Further to the north and not as brilliant but still plusating. I could not find it with my spotting scope but did with my binoculars. I have no idea what it was."],"Latitude":"44.386122","City":"Hale","Object Shape":"Circle, Star-like","Weather Factors":"None","Summary":"Cluster of six lights surrounding center light pulsating several different colors","map":"<A HREF = \"http://maps.google.com/maps?q=44.386122,+-83.800796(4585)&iwloc=A&hl=en\"> mufon case (4585) map </A>","Tags":"City","Date of the Event":"03/25/2006 11:00 UTC","Log Number":"US-03262006-0003","Date Submitted":"03/25/2006 11:00 UTC","Object Flight Path":"Stationary","Case Number":"4585","Country":"United States","Longitude":"-83.800796","Source":"MUFON","Object Features":"None","files":["/var/www/straped/mufon/html2text/4585.html.txt","/var/www/straped/mufon/org/4585.html"],"Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Disposition":"Unknown","Region":"Michigan"}