{"Disposition":"Unresolved","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=36.001232,+-83.817734(45864)&iwloc=A&hl=en\"> mufon case (45864) map </A>","Case Number":"45864","Region":"Tennessee","Date Submitted":"02/24/2013 04:57 UTC","Summary":"say glowing red circle, it turned black, shifted form, and flew to the east, dissapearring twice","Sighting Duration":"Undisclosed","Date of the Event":"01/16/2013 05:30 UTC","files":["/var/www/straped/mufon/html2text/45864.html.txt","/var/www/straped/mufon/org/45864.html"],"Country":"United States","Latitude":"36.001232","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","City":"Knoxville","divs":["sighting detailsme and my friend went outside for a smoke break at work. i looked to the west and saw a red dot in the sky. i said to my friend\" he look there's a ufo!\" in a joking way and then upon looking harder, we both stared at it and could not figure out what it was. it started to rise up as a red dot and in the blink of an eye it turned black and shifed into a weird shaped object. it was kind of shaped like a strange airplane but much smaller\\ it was high up but not as high as an airplane. we live close to an airport so we see them all the time. at the time this was occurring, there were about 3 other airplanes high up in the airspace(not all at once). the object then flew from the west towards the east going at a fast speed for the altitude it was in. it had no lights and made no sound. after it flew about 200-300 ft east it disappeared. we both saw it happen and reacted at the same time. i saw it reappear and disappear again but she did not see it because a power pole was obstructing from her angle."],"Object Flight Path":"Path with directional change","Object Shape":"Fireball, Unknown","trends":["There have been 50 other sightings in Knoxville","There were no other sightings in Knoxville on or around January 16th 2013"],"Longitude":"-83.817734","Source":"MUFON","Object Features":"Wings","Log Number":"US-02242013-0013"}