{"Sighting Duration":"Undisclosed","Viewing Distance":"21-100 Feet","Date of the Event":"02/11/2013 04:43 UTC","Region":"Florida","Object Flight Path":"Straight-line path,Path then hovering","divs":["sighting detailsi walked out of my home, early morning about 4:45 a.m. e.s.t., and viewed three unknowns traveling southward at tree top level. they were traveling at or about 10 m.p.h. once they crossed 70th and palm river road (google home address) they were at tree top level in front of my home about to pass. i shouted \"good morning fellas, are you in a hurry to get somewhere?\" the third stopped in front of my home, at tree top, while the other two continued southward. i than said, \"would you like to have some breakfast?\" there was no response. it hovered. i stepped out from my front door, onto my walkway (google home front) and said, \"don't just hover, come on down and let's speak with each other.\" it surprised me with a five foot (or more) descended just above my neighbor's high oak (google the front of my home, do a reverse view and see my neighbor's high oak). it stopped, hovered, brighten up more, and ascended straight up and and southward. i assumed it was attempting to catch up with his friends. this isn't my first viewing, my daughter (currently age 22) who was 19 or 20 at the time, bear witness of our first viewing (together). i have viewed these guys often, beginning at\\or about 11:p.m. through 1:a.m., e.s.t., from time to time. but this was a first close up. i'm a school teacher, and i value my employment. if this gets out, i'll become a political tool and tossed aside. i'll share with you what i've discussed here, but it must not become \"public\"."],"Disposition":"Unresolved","Log Number":"US-02242013-0015","map":"<A HREF = \"http://maps.google.com/maps?q=27.953324,+-82.363794(45866)&iwloc=A&hl=en\"> mufon case (45866) map </A>","files":["/var/www/straped/mufon/html2text/45866.html.txt","/var/www/straped/mufon/org/45866.html"],"Weather Factors":"Unknown","Object Features":"None","trends":["There have been 105 other sightings in Tampa","There was one other sighting in Tampa on or around February 11th 2013"],"Tags":"City","Longitude":"-82.363794","Country":"United States","City":"Tampa","Source":"MUFON","Latitude":"27.953324","Case Number":"45866","Summary":"Three round objects, traveling South, one responded to voice command...","Object Shape":"Sphere","Date Submitted":"02/24/2013 05:16 UTC"}