{"map":"<A HREF = \"http://maps.google.com/maps?q=35.47434,+-97.514668(4586)&iwloc=A&hl=en\"> mufon case (4586) map </A>","files":["/var/www/straped/mufon/html2text/4586.html.txt","/var/www/straped/mufon/org/4586.html"],"Longitude":"-97.514668","Source":"MUFON","divs":["Sighting DetailsI was about age 12 when I saw the disc shaped object. I was in a car with my mother and a friend of mine we were traviling west bound on S.W. 44th street and had just crossed over the santa fe railroad tracks when we were slowed by heavy traffic and police. The vehicle traffic was traveling very slowley and the police were directing the traffic because of the object. As we passed over the railroad tracks we looked to the right or to the North and saw the disc shaped object. It was about 250 yards from the roadway about 100 feet off of the ground. The object was about 100 feet in diameter with many multiple colored rotating lights. The object made no sound audible to me and had no movement other than the lights. There were many, many people who saw the same object that we saw including many police officers. We watched this object as long as we could, which was about two minutes because the traffic control moved us right along. I was amazed at what I saw, so were my mother and my friend. We didn't really know what we saw weather it was a military aircraft or a UFO but is was certainly something we had never seen before or since."],"Log Number":"US-03262006-0004","Object Features":"Undisclosed","City":"Oklahoma City","trends":["There have been 78 other sightings in Oklahoma City","There were no other sightings in Oklahoma City on or around May 31st 1971"],"Viewing Distance":"Unknown","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Region":"Oklahoma","Country":"United States","Date Submitted":"05/31/1971 12:00 UTC","Summary":"I saw stationary object about 100 feet above the ground with rotating lights and no sound. no other movement.","Weather Factors":"Unknown","Case Number":"4586","Tags":"City","Latitude":"35.47434","Date of the Event":"05/31/1971 12:00 UTC","Object Shape":"Disc","Object Flight Path":"Undisclosed"}