{"Weather Factors":"Unknown","Object Flight Path":"Straight-line path,Path then hovering","Summary":"Obsurved strange light in rear view mirror","Log Number":"US-02242013-0028","Case Number":"45879","Latitude":"27.670517","Object Shape":"Circle, Disc, Egg, Flash, Oval, Sphere, Star-like, Other","divs":["Sighting Details My encounter was on January17 2013 I was on State Road 51 near Tennals on US 19. It was approximately 6:20 to 6:30 when I noticed the light in the rear view mirror of my truck I stopped and backed up. I slowed and stopped so I could observe more closely the light was White on each side and Red in in the center.I watched for two or three minutes before deciding to leave. State Road 51 is only a two lane road but the light seemed to be jumping from one side of the road to the other.I remember where it was because it was situated over the old Railroad Bed, which sits on top of a small rise. I was thinking of getting out of the truck to watch the light more closely but decided against it. It was hunting season and I did not know if maybe a hunter may need help. But I knew of NO emergency light that had white lights on the outside and a red light in the center. Let along one that seemed to jump across two lanes of a highway in rapid succession. When I returned that afternoon I stopped to look at the location I suspected the light was located 20feet before and 20 feet after but could see no disturbances and no sigh of any car or truck parking although it is rough ground. I felt secure in my truck and decided not to get out.I had a doctors appointment to get to and decided not to stay. I lost sight of the light as I went down a dip and around a curve to US19."],"City":"Cross City,Fl","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Tags":"City","Longitude":"-81.510064","trends":["There have been no other sightings in Cross City,Fl","This sighting has never been favorited."],"Date Submitted":"02/24/2013 09:01 UTC","Object Features":"None","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=27.670517,+-81.510064(45879)&iwloc=A&hl=en\"> mufon case (45879) map </A>","files":["/var/www/straped/mufon/html2text/45879.html.txt","/var/www/straped/mufon/org/45879.html"],"Date of the Event":"01/17/2013 06:30 UTC","Sighting Duration":"00:03:00","Region":"Florida"}