{"Viewing Distance":"Over 1 Mile, Unknown","Object Features":"Undisclosed","Summary":"strobe light, very bright in southern sky","Country":"United States","Region":"New Hampshire","Latitude":"43.194852","files":["/var/www/straped/mufon/html2text/4587.html.txt","/var/www/straped/mufon/org/4587.html"],"trends":[],"divs":["Sighting DetailsIn January, while in bed approximately 11:30pm e.s.t. I looked up as I always do to see stars. Noticing a strobing flash, I didn't pay much attention thinking it was a comercial airliner which the white strobe strongly resembles. A few seconds passed when I glanced back in the vicinity of the strobe, when it occured to me that it hadn't moved. Studying the strobe light more intensely now I pondered whether or not it could be a helicopter as it was stationary now for approx. 8 minutes. I went to get my Nikon binoculars for a closer look. Searching now for the tell tale sign of colored lights of some commercial craft as I thought for sure I would find. Instead, I found that this object was MUCH farther away than I first thought. Binoculars also revealed that there were 3 0r 4 possibly 5 other strobing lights in the very same close vicinity as the bright strobing light Although, the others were not as bright and only visible with the binoculars. I woke up my husband for a witness to what I was seeing. While observing these lights I also realized that the stars had moved considerably out of the window view (yes, I realize it was truely the earths rotation, not the stars) but that the lights were in the same place. I watched these lights until around 2:00am when the cloud cover took over and I could no longer see lights or stars. Last night at approximately 10:00pm e.s.t. was laying in bed and turned off the TV. Immediately looked up out my window to see stars. In the North country we've had what seems to be a straight month of clouds, but finally it was a bright starlit night, and to my absolute amazement, in the exact same place were the strobe lights. I watched for a few seconds and then told my husband to look. He witnessed the lights. This time there were also 4 or 5 white strobing lights although I could not tell which one was brightest because it seemed to me that they were taking turns being bright although I could not pick up a pattern. Also, the strobing lights were visible with out the use of binoculars. Still, I reached over for my binoculars because they help emensly with detail and I could see more clearly but still not enough to discern a definate shape. The best way to explain what I saw both times is that it looked like any other beautiful star lit night with the occasional flash of a airplane coursing through the night sky, although these do not move. I called my dad to see if he could see them from his window. He could not do to trees or some obstruction. I watched the lights until about 10:30 when the lights seemed to slowly get dimmer and dimmer as if they were moving farther and farther away. (Note)The lights ever so slightly move in there position as if say a helicopter was hovering overhead. These lights were absolutly, positively very far away. Lisa Cordwell"],"Object Shape":"Star-like","Source":"MUFON","Date of the Event":"03/26/2006 10:10 UTC","Tags":"City","Log Number":"US-03272006-0001","map":"<A HREF = \"http://maps.google.com/maps?q=43.194852,+-71.564145(4587)&iwloc=A&hl=en\"> mufon case (4587) map </A>","Disposition":"IFO","Object Flight Path":"Stationary","City":"Undisclosed","Longitude":"-71.564145","Weather Factors":"None","Date Submitted":"03/26/2006 10:10 UTC","Case Number":"4587","Sighting Duration":"Undisclosed"}