{"Case Number":"45875","divs":["Sighting DetailsI was on 68th street and McDowell northbound in Scottsdale, az. I was speaking on the cell phone with my fiance and was stopped at the signal waiting for it to turn green. I looked out the window to the left because i could hear the 2 black helicopters hovering over the reserve base on McDowell. I looked up above the helicopters and saw the glowing red-orange spherical object moving very slowly. It reminded me of satellite movement but it was much lower in the horizon; but it was MUCH higher in the horizon than the normal landing plane flight path of sky harbor airport that is right next to this base. I watched it as i told my fiance that i was watching a ufo, waiting to see the blue and white lights that accompany the red light in a plane; but they never appeared. I watched it for about 2-3 minutes as it pulsated in brightness and moved slowly in a erratic pattern. I watched until i looked at the signal. I looked back and it was gone. The black helicopters remained there. I got off the phone, and we live north of the base and my fiance went outside to look at the helicopters. He confirmed later that they remained there. They were even there when i got home about 20 minutes later. I was excited to have seen something i couldn't explain but wondered if it was base related or if it was something unknown to them that they were closely monitoring."],"Object Features":"Unknown","Tags":"City","Weather Factors":"Unknown","Disposition":"Unresolved","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Latitude":"33.449777","Date of the Event":"02/20/2013 06:45 UTC","Date Submitted":"02/24/2013 08:55 UTC","Log Number":"US-02242013-0025","files":["/var/www/straped/mufon/html2text/45875.html.txt","/var/www/straped/mufon/org/45875.html"],"Object Shape":"Sphere","Region":"Arizona","City":"Phoenix","Longitude":"-112.070507","Summary":"glowing object much higher than plane flight path above military base and military helicopters","Country":"United States","Viewing Distance":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.449777,+-112.070507(45875)&iwloc=A&hl=en\"> mufon case (45875) map </A>","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around February 20th 2013"]}