{"Weather Factors":"Unknown","Log Number":"US-02242013-0026","trends":["There have been 8 other sightings in Rockingham","There were no other sightings in Rockingham on or around February 24th 2013"],"Disposition":"Unresolved","Longitude":"-79.750108","map":"<A HREF = \"http://maps.google.com/maps?q=34.956584,+-79.750108(45877)&iwloc=A&hl=en\"> mufon case (45877) map </A>","Latitude":"34.956584","Object Features":"Unknown","Summary":"observed while driving home from work 2 boomerang shaped objects with lights that seemed to move like a hanglider then bank to right as I tried to take a picture of them","Case Number":"45877","Object Flight Path":"Path with directional change,Path then hovering","Object Shape":"Boomerang","Tags":"City","divs":["Sighting DetailsOn February 24, 2013 as I was driving home from work at around 6:50pm, I noticed some lights in the sky. It was a full moon out and no clouds. I was on Richmond Rd in Rockingham, NC. This is a well lit residentual area. I could see some light just over the trees and as I watched them they seemed to be moving very slow much slower than a C130 Transport planes that we often see in the area. It was almost like it was gliding or hoovering. As the area opened up some and there was less trees I could clearly see that there was 2 of the objects. 1 behind the other. I pulled into the parking lot of roberdel Baptist Church to try and get a picture of them. As I pulled in and parked I turned my truck off and I already had my window down and these objects made no sound. The objects then banked to their right and I could not get a picture of them. I started my truck up and tried to follow them to try and get a better spot to view them. As I crossed the stoplight which is less than 500 yds from where I pulled in to park I noticed that they had picked up speed and were moving faster. by the time I got another 1-2 miles down the road they were far enough away from me that I could not follow them. I had already called home and told my wife to look outside and see if she could see anything but she could not. Right after they banked to the right I had noticed what seemed to be an airplane coming towards them. When I got home I told my wife what I had seen and she said it was probably something military , but not 5 minutes later after she said that, 2 big airplanes (C130 I guess) came flying over just above treetop level going in the same direction that the 2 objects were going. They were low enough to vibrate the house. I went outside and noticed a lot of planes in the sky(small blinking lights). It is now 7:15pm and I have to go and pick my daughter up from church. I tell her about it and as we are coming home she tells me that she sees some lights also. I could not see them because they were too far to the right side to look at and drive safely. When we get home we get out and notice 4 blinking lights that are in the shape of a square almost like helicopters in formation but no sound but at the distance they were I thought I would have heard something. They were flying from north to south. Time is about 7:45pm. I have never had an experience like this before because I can usually explain it away, but what got me on this was that there was no sound from the 2 boomerang objects and when they banked I could make out lines on one of them and then all the plane traffic in the area after that."],"City":"Rockingham","Date Submitted":"02/24/2013 08:58 UTC","Viewing Distance":"Unknown","Region":"North Carolina","Date of the Event":"02/24/2013 06:50 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/45877.html.txt","/var/www/straped/mufon/org/45877.html"],"Country":"United States","Sighting Duration":"Undisclosed"}