{"Object Shape":"Circle, Sphere","Log Number":"US-02242013-0036","Date of the Event":"02/24/2013 12:00 UTC","Region":"Arizona","Disposition":"Unresolved","Viewing Distance":"Unknown","Summary":"2 very large orange orbs that stayed the same distance apart while travel","City":"Tucson","Date Submitted":"02/24/2013 11:24 UTC","Sighting Duration":"Undisclosed","Case Number":"45887","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=32.378669,+-111.030227(45887)&iwloc=A&hl=en\"> mufon case (45887) map </A>","Source":"MUFON","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around February 24th 2013"],"Tags":"City","Longitude":"-111.030227","Weather Factors":"Unknown","divs":["sighting detailsapproximately 7:35 pm on 2\\24\\13 i walked out my back door to let my dog out. the back yard faces east and my home is situated near the tucson national golf resort so i can clearly see mt lemon in my east direction and i have no obstructions like trees or other homes. i noticed two very large yellow-orange orbs floating in a direction that looked as if it was traveling due west right to my location. these orbs were very bright, never changing their color and were about the size of a aspirin at arms length held away. these two light objects were the same distance apart. i watched them move towards me for about one minute in length when they made a curved sloping directional change, heading south and then south east. it looked as if they wanted to hug the mountain curvature. the two lights started to rotate a bit as if to tumble but never did their distance apart change. i could not tell if it was distance or if simply one light was dimming but as it traveled away from my location one light and then the other light disappeared. there was no sound. interesting note is that as it traveled closer to my location, dogs in the neighborhood began to bark. i had no time to run into the house to grab a camera as i was not about to miss the event. the whole sighting lasted approximately 2-3 minutes."],"Latitude":"32.378669","Object Features":"None","files":["/var/www/straped/mufon/html2text/45887.html.txt","/var/www/straped/mufon/org/45887.html"],"Object Flight Path":"Straight-line path"}