{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.65351,+-73.94105(45886)&iwloc=A&hl=en\"> mufon case (45886) map </A>","Case Number":"45886","Sighting Duration":"Undisclosed","Log Number":"US-02242013-0035","Region":"New York","Object Features":"Appendage(s), Other","City":"New York","divs":["Sighting DetailsI was at a party with a friend when I went outside on the roof for a cigarette. It was cloudy, drizzling and sporadically windy out. When I was just about done with my cigarette my friend came outside and joined me on the roof. We were talking for about 5 minutes or so when my friend looked up and yelled, \"Please tell me that's a plastic bag, ...or something!!\" and pointed to what he was starting at. I looked up and saw this bizarre, black object sort of wobbling a few hundred feet above us. If I had to guess I would say it was slightly larger than a helicopter. Its shape is very difficult to describe but it looked kind of how my friend first interpreted it - like a black plastic bag with these appendages, or \"handles\", on the top. It had no lights. Completely black. The color was very strange; almost like an absence of light, like it was absorbing light, if that makes any sense. Just totally and completely dark and stood out surprisingly well against the grey clouds above it. It wobbled in place for about 3-4 seconds then started moving off in a straight path at an extremely fast pace (way faster than any helicopter or airplane I've seen at that altitude). It moved very purposefully and was unaffected by the gusts of wind that were bombarding the city. It was definitely not a plastic bag due to it being solid in shape, at least the size of a helicopter and travelling in a straight path at tremendous speed. I do not believe it was any conventional aircraft either because of its shape, having no lights and the fact that it was silent. Perhaps the strangest part of all was as it took off towards the harbor it looked like it maintained its size even though it was further away (we saw it go behind a building that was at least a mile a while so we knew it had traveled away from us). The fact that it got smaller at first and then larger while also being further away really freaked us out. My friend said \"lets get the hell out of here\" so we headed back to the party and didn't discuss it for most of the night other than an hour later when my friend asked out of the blue, \"that thing was a solid, wasn't it? It definitely wasn't a plastic bag, huh? ...Damnit. What the hell...\" then stopped talking about it again and haven't discussed it since."],"Object Flight Path":"Path with directional change","Viewing Distance":"101-500 Feet","Latitude":"40.65351","Country":"United States","Summary":"Dark, black object seen travelling low and at tremendous speed silently.","Disposition":"Unresolved","Weather Factors":"Unknown","Longitude":"-73.94105","Date of the Event":"02/24/2013 12:00 UTC","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around February 24th 2013"],"Object Shape":"Other","Tags":"City","files":["/var/www/straped/mufon/html2text/45886.html.txt","/var/www/straped/mufon/org/45886.html"],"Date Submitted":"02/24/2013 11:00 UTC"}