{"Date of the Event":"02/24/2013 01:20 UTC","City":"Falmouth","Latitude":"38.677887","Tags":"City","Region":"Kentucky","Case Number":"45881","Country":"United States","Summary":"Third time in 2 weeks starlike object with multi colored lights observed near home stopping,moving,going up and down,","divs":["sighting detailsthis is the 3rd sighting of the same object in the past two weeks near our home,looks like a very bright star except it moves with red,blue,green,and yellow\\white lights that light up in random rotational order.we have observed this object on the 16th,20th,and 24th of february 2013 all sightings were first noticed in the 1:30 am time frame for an hour or longer each time.we observed object through binoculars and an 8x power rifle scope.it is disc shaped with a larger half sphere on bottom and smaller half sphere on top,it turned sidewise several times when moving to reveal a ring of green lights rotating around circular shape.other lights pulsed on and off randomly,but continually except when airplanes come into nearby airspace. now has my family concerned about our safety because of regular sightings although it has not approached our home closer than approximately 1\\4 mile away.always observe slowly moving away to the southwest until it disappears over horizon. i would be grateful if some ufo investigators would come observe this object to verify what my wife,son,and i have witnessed."],"trends":["There have been 8 other sightings in Falmouth","There was one other sighting in Falmouth on or around February 24th 2013"],"Date Submitted":"02/24/2013 09:10 UTC","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=38.677887,+-84.325444(45881)&iwloc=A&hl=en\"> mufon case (45881) map </A>","Longitude":"-84.325444","Weather Factors":"Unknown","Source":"MUFON","Disposition":"Unresolved","Object Features":"Dome","Sighting Duration":"Undisclosed","Object Shape":"Disc, Saturn-like, Star-like","Log Number":"US-02242013-0030","files":["/var/www/straped/mufon/html2text/45881.html.txt","/var/www/straped/mufon/org/45881.html"],"Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering"}