{"Object Features":"Other","trends":["There has been one other sighting in Forsyth","There were no other sightings in Forsyth on or around February 24th 2013"],"Longitude":"-83.86554","divs":["Sighting DetailsMy husband and I started seeing an object in the sky over a year ago. We live in a very wooded area. There is no light pollution. We thought of it as a joke at first. Everyone who came to our home saw it. We called it our light. As time went on the object got closer. It got to the point we could see it in the scope of our gun, but the object was constantly moving. There is a large object that we know is lower than the stars because when it is extremely overcast and cloudy, we can still see it. This tells us it is in the atmosphere. Along with the larger object, there is always three smaller UFO's that change colors very quickly. These objects move faster and in ways that our conventional aircraft simply can not. We would love to know what these things are. There is no way these are weather balloons or objects reflecting light. We have hours of footage and pictures of the objects. At one point they got so close to the house and tree line it scared us. We did not see the objects for quite sometime after two jets flew over the house chasing it. The fighter jets were in combat mode trying their best to keep up, but it was like the UFO'S were just teasing them. Every time the aircraft got close the UFO'S would just go from one point in the sky to another point in the sky in almost the blink of an eye. It has been in the past week that the objects have returned. If anybody has any answers we would love to hear and explanation; because, we are running out of reasonable explanations. These objects go vertical to horizontal in no time at all. It is quite scary."],"City":"Forsyth","map":"<A HREF = \"http://maps.google.com/maps?q=32.967802,+-83.86554(45889)&iwloc=A&hl=en\"> mufon case (45889) map </A>","Viewing Distance":"Over One Mile","Log Number":"US-02252013-0001","Object Shape":"Other","Case Number":"45889","Region":"Georgia","Weather Factors":"Unknown","Date of the Event":"02/24/2013 12:00 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/45889.html.txt","/var/www/straped/mufon/org/45889.html"],"Date Submitted":"02/25/2013 12:16 UTC","Latitude":"32.967802","Source":"MUFON","Country":"United States","Summary":"One big object, Three small objects","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Disposition":"Unresolved"}