{"Longitude":"-80.364845","Object Shape":"Sphere","Date of the Event":"02/23/2013 08:30 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=26.013843,+-80.364845(45883)&iwloc=A&hl=en\"> mufon case (45883) map </A>","Source":"MUFON","Tags":"City","Region":"Florida","Date Submitted":"02/24/2013 09:51 UTC","trends":["There have been 9 other sightings in Pembroke Pines","There were no other sightings in Pembroke Pines on or around February 23rd 2013"],"Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/45883.html.txt","/var/www/straped/mufon/org/45883.html"],"Disposition":"Unresolved","Latitude":"26.013843","Object Features":"None","Log Number":"US-02242013-0032","Summary":"Driving east bound on a local street mysellf and two others witnessed a group of lights that appeared moving towards us in a westerly direction , there were airplanes on the usual North westerly flight climbing out of MIA airport and the were above these","Object Flight Path":"Path with directional change","Country":"United States","Case Number":"45883","divs":["Sighting DetailsDriving east bound on a local street mysellf and two others witnessed a group of lights that appeared moving towards us in a westerly direction , there were airplanes on the usual North westerly flight path climbing out of MIA airport and the airplanes were above these lights. I decided to pull over and the three of us got out the car , as they got closer I realized that these were not aircraft but some kind of ORB . They were bright as what a flare would look like however there were climbing steadily in a westbound heading and began to get closer together they then headed north bound then faded above us , there were no clouds around them them simply faded and vanished all at the same time. I can compare them to when you stere up a fire and the hot embers rise .. I am a trained observer and work around aircraft all the time and I know that these were not any kind of helicopter or airplane."],"City":"Pembroke Pines","Weather Factors":"Unknown"}