{"Object Features":"None","Date of the Event":"03/27/2006 07:40 UTC","Object Shape":"Circle","Tags":"City","Source":"MUFON","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/4588.html.txt","/var/www/straped/mufon/org/4588.html"],"Summary":"It was distant, metallic looking, glistened in the sunlight for a second.","Longitude":"-75.223704","Log Number":"US-03272006-0002","trends":["There have been 16 other sightings in Utica","There were no other sightings in Utica on or around March 27th 2006"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.110743,+-75.223704(4588)&iwloc=A&hl=en\"> mufon case (4588) map </A>","Sighting Duration":"Undisclosed","Case Number":"4588","City":"Utica","Country":"United States","Viewing Distance":"Unknown","Region":"New York","Object Flight Path":"Hovering then path","divs":["Sighting DetailsI was driving to work headin Eastbond down Route 5, between the towns of Vernon and Kirkville. I first noticed the object because i saw 4 to 5 planes spraying chemtrails in the air. Looking head on the object (east), the object slowly descended and moved to my right. It was shining in the sun so it was kind of hard to see. Then it stopped shining and it looked circular, but it was pretty distant so its hard to tell. At first I thought it was just a plane descending, but then it stopped descending to the right and started moving more left. I figured it proably just looked like it was moving left because I was driving and my car was moving. But its movements did catch my attention. I lost it along the treeline, only to have to become visible again as i kept driving. This has been 1-2 minutes of driving so far. It kept moving left, but its descent was much slower. I lost visibilty again. After another about 30 seconds, I gained visibility of a rather large plane in the vicinity of the objec t in question. As far as I know the plane could have been the object. However when I first clearly vieded the object, it was definetely circular in shape and metallic. The object may have changed shape due to its change in trajectory."],"Date Submitted":"03/27/2006 07:40 UTC","Latitude":"43.110743","Weather Factors":"None"}