{"Disposition":"Unresolved","Log Number":"US-02252013-0009","Viewing Distance":"Over One Mile","Region":"Nevada","Country":"United States","Date Submitted":"02/25/2013 04:28 UTC","Object Shape":"Oval","City":"Las Vegas","Latitude":"36.119046","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around May 7th 2012"],"Object Flight Path":"Stationary,Hovering then path,Path with directional change,Other","Longitude":"-115.170316","Object Features":"Unknown","Case Number":"45897","map":"<A HREF = \"http://maps.google.com/maps?q=36.119046,+-115.170316(45897)&iwloc=A&hl=en\"> mufon case (45897) map </A>","Source":"MUFON","Tags":"City","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Summary":"Dimly lit, oval-shaped object seen by drivers on highway; it was being pursued by helicopters.","Date of the Event":"05/07/2012 01:50 UTC","files":["/var/www/straped/mufon/html2text/45897.html.txt","/var/www/straped/mufon/org/45897.html"],"divs":["sighting detailsi was with a friend in my car. he was driving south\\south east on the main highway in las vegas, nv, the 95 south. he said: \"what is that?,\" and i turned to look up through the windshield. there was a huge, oval shaped object that seemed almost dimly lit all around. it emitted a dim haze. it was farther away in the distance by a mountain range closely outside of the city area to the left of the highway. there were two black helicopters circling the object, shining spotlights on it. we watched this happen for four minutes until the object was behind us. i turned to look, and it changed position abruptly and with extreme speed. the helicopters re-positioned themselves to apparently attempt to shine their spotlights on it again. after about a minute of this, it was gone. the helicopters then hit each other with the spotlights as if the light was no longer blocked by the object. they then proceeded to shine spotlights on the mountain, and then they stopped and flew south east."]}