{"Sighting Duration":"00:02:28","Source":"MUFON","Country":"United States","Date Submitted":"02/25/2013 11:22 UTC","Tags":"City","Log Number":"US-02252013-0006","City":"Yorkville","Longitude":"-88.420764","Object Shape":"Star-like","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=41.653171,+-88.420764(45894)&iwloc=A&hl=en\"> mufon case (45894) map </A>","Date of the Event":"02/23/2013 07:55 UTC","Latitude":"41.653171","files":["/var/www/straped/mufon/html2text/45894.html.txt","/var/www/straped/mufon/org/45894.html"],"Case Number":"45894","trends":["There has been one other sighting in Yorkville","There were no other sightings in Yorkville on or around February 23rd 2013"],"Object Features":"None","divs":["sighting detailsdaughter was out the back door (facing north nw) letting dog out at 1953 hrs noticed two round lights in the western sky moving to the east and no idea what they were but she couldn't miss them. she then called mom and dad out to see the spectacle. the two orange\\red lights which which stayed perfectly spaced at the same altitude not wavering at all moved to the east or ene and were out of sight in a short time, too short to locate binoculars or camera. i lost sight of the objects far to the east or ene when one of them fizzled out and shorty after that the other disappeared too. of course we three we dumbfounded with what we saw. my first explanation was that it was illuminated lanterns moving across the sky. only thing is there was very little wind and they looked like they were self propelled and going at a much higher rate of speed than the environment at that time. the two lights never wavered in distance from one another. also there was some cloud cover but the clouds did not interfere with the view of the objects. when we went back into the house we noticed to the south the moon appeared from some cloud cover. my best recollection of viewing time was just about 2 minutes and the time was us navy time with which my watch is synchronized at precisely 1955 to 1957 hours, with my daughter's viewing time maybe 30 to 40 seconds morel"],"Region":"Illinois","Summary":"from the west two red/orange, yellow/pink lights or objects traveling east or ENE airplane like speed side by side ENE","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Viewing Distance":"Unknown"}