{"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","trends":["There have been 9 other sightings in Walnut Creek","There were no other sightings in Walnut Creek on or around February 24th 2013"],"Summary":"Moving white light that became brighter and larger as it moved and faded, became smaller then vanished.","Country":"United States","Longitude":"-122.067137","divs":["Sighting DetailsWe were standing on our rear deck which faces South-West. The movement of the light and the absense of a strobe light caught my attention. My first thought was that it was a commercial jet which is why I watched the light closely for any sign of a strobe. It moved at a speed consistent with a commercial jet at cruising altitude. As I focused on the light watching for a strobe light, the light became much brighter and larger-roughly doubling in size-brighter than but about the same size as Jupiter which was to the right of Orion. It was at this moment that I pointed it out to my wife who's eyes picked up the brightening of the light. The light became steadily smaller and fainter as it moved upward and to the right (approximately 1:00 o'clock trajectory) until it was no longer visible. The duration from the time the light becoming brighter until it disappeared was about 2 to 3 seconds and covered a perceived distance of 2 fingers held 2\" apart at arms length. The night was clear and cloudless, there was no vapor trail visible and there was no engine sound. At the time of the sighting, it was quiet enough to have heard jet engine sounds of a commercial jet at a typical cruising altitude. The trajectory combined with the steady decrease in size and brightness gave the impression that the light was moving upward and away from us at a slight rightward angle."],"Date of the Event":"02/24/2013 08:30 UTC","Object Shape":"Circle","Tags":"City","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=37.894142,+-122.067137(45898)&iwloc=A&hl=en\"> mufon case (45898) map </A>","Latitude":"37.894142","Region":"California","Date Submitted":"02/25/2013 04:32 UTC","Log Number":"US-02252013-0010","City":"Walnut Creek","Viewing Distance":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/45898.html.txt","/var/www/straped/mufon/org/45898.html"],"Object Flight Path":"Straight-line path","Object Features":"Unknown","Case Number":"45898"}