{"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.682837,+-84.323154(45892)&iwloc=A&hl=en\"> mufon case (45892) map </A>","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Region":"Kentucky","Latitude":"38.682837","Object Shape":"Circle, Disc, Star-like","Date of the Event":"02/25/2013 12:00 UTC","Source":"MUFON","Date Submitted":"02/25/2013 09:11 UTC","Longitude":"-84.323154","files":["/var/www/straped/mufon/html2text/45892.html.txt","/var/www/straped/mufon/org/45892.html"],"Summary":"4th sighting of same object since 2/16/2013 except there where 2 objects this time","City":"Falmouth","divs":["sighting detailswatched two objects come from the east slowly travelling west and southwest at approximately 11:00 pm 2\\24\\13 through 2:30 am on 2\\25\\13.same objects as i have reported on 2\\16\\13,2\\20\\13,and 2\\24\\13 in the am hours. they appear as bright stars until you see them move,they have multi-colored lights red,blue,green,and white\\yellow that blink randomly and last night i noticed they tip on side revealing a round,disc shape bottome with a ring of green lights rotating around object. movements are from a hovering standstill,to slow linear path,to wobbling side to side (possibly small circles),up and down in elevation,usually from east to west southwest or once northwest. when very close to directly in front of my home last night,my wife standing in front yard observed a military type jet fly at these objects and i heard it pass over our home,the objects disappeared momentarily and reappeared on the west side or behind our house too quickly for normal aircraft. i contacted district mufon person to ask for investigators as i am becoming concerned for my family's well being as sightings are more frequent and closer. we are observing objects through 8x rifle scope and binoculars,our camcorder is currently broken and 3x zoom camera is useless in taking a good picture.trying to fix or replace our camcorder and hope to get it on tape as evidence."],"Object Features":"Dome","Disposition":"Unresolved","trends":["There have been 8 other sightings in Falmouth","There was one other sighting in Falmouth on or around February 25th 2013"],"Log Number":"US-02252013-0004","Case Number":"45892","Weather Factors":"Unknown","Sighting Duration":"03:00:00","Country":"United States"}