{"Summary":"Octagon shaped bright grayish ship in sky, near Cameron Texas on highway 36. Blinking. Fast. Scary","map":"<A HREF = \"http://maps.google.com/maps?q=30.708189,+-96.835011(45899)&iwloc=A&hl=en\"> mufon case (45899) map </A>","Country":"United States","Latitude":"30.708189","Disposition":"Unresolved","Object Shape":"Disc, Other","Region":"Texas","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/45899.html.txt","/var/www/straped/mufon/org/45899.html"],"Weather Factors":"Unknown","Tags":"City","Log Number":"US-02252013-0011","Date of the Event":"12/20/2012 11:30 UTC","City":"Milano","Longitude":"-96.835011","Case Number":"45899","trends":["There have been 3 other sightings in Milano","There were no other sightings in Milano on or around December 20th 2012"],"divs":["sighting detailsoctagon shaped bright grayish ship in sky, near cameron texas on highway 36. blinking. fast. scary i must preface, i'm somewhat nervous to have to explain something of this nature. never in a million years would i have thought it remotely possible in reality.... last night my son and i were driving on hwy 36 around 11:30 on our way to my mothers house in coppers cove tx. in the distance we noticed a very bright flashing light. my first thought was that it could be a plane, helcopter or a signal tower with unuasually bright lights. we continued to watch it when suddenly it was right on above of our suv! there are few words that will effectively relay to anyone that wasn't there just how large and utterly surreal looking this thing was. it was shaped like an octogan with flashing lights on all sides. it looked like a building floating in the sky. it had debth\\structure to it that's hard to put into context. i was in shocked and as a mother i became fearful this thing could be a potential threat considering how close it was. so i stepped on the gas to get a! way from it. i was driving way over the speed limit and not looking back when it occured to us to take a picture or video. my son was in the back filming what was left of it at that point. both my son and i were just floored by what was happening. i'm extremely dissappointed we didn't think soon and capture the object in solid form. when we first saw the object it was about 400 meters above us, close enough for us to realize its enormous size, hexagonal shape, and its grey\\concrete color. by the time my son had pulled out a camera and moved to the back of the vechile to film, it appeared to have distanced itself subtaintally from us, at least a few miles away."],"Viewing Distance":"Over One Mile","Date Submitted":"02/25/2013 05:01 UTC","Object Features":"Dome"}