{"Date Submitted":"02/25/2013 12:26 UTC","Latitude":"39.739748","Country":"United States","Summary":"Glowing bright orange-red sphere above a dark night horizon. Darted back and forth before switching off. Bigger than a full moon in the sky.","Object Flight Path":"Hovering then path","Date of the Event":"08/15/1978 12:00 UTC","Longitude":"-76.356727","Disposition":"Unresolved","Source":"MUFON","Case Number":"45895","files":["/var/www/straped/mufon/html2text/45895.html.txt","/var/www/straped/mufon/org/45895.html"],"trends":["There have been no other sightings in Delta","This sighting has never been favorited."],"Object Shape":"Circle","Log Number":"US-02252013-0007","map":"<A HREF = \"http://maps.google.com/maps?q=39.739748,+-76.356727(45895)&iwloc=A&hl=en\"> mufon case (45895) map </A>","City":"Delta","divs":["Sighting DetailsBack in the late 70's, outside with other neighbor girls and we were camping in my back yard. It was a clear, summer night and we were up late so we walked up our road just for something to do...about 5 of us all saw an orange sphere to the S.E. up along the horizon above some cornfields. We were all excited and knew it was a UFO. It just switched on like a light, didn't seem to arrive from anywhere....at least 500+ feet away or more from us. We were all very excited but some also were scared. To put the size in perspective, it was a larger than the biggest moon I've ever seen. It quickly darted off to the left just a little, then straight back to the right again before it went out. Later the next day we asked some other kids we knew down the street further away from where it happened, and they also said they even saw it and described it to us exactly. There are some high tension power lines that run in the general direction past where the sighting was, over the ridge....but we did not hear of anything that would explain it was caused by the power lines."],"Weather Factors":"Unknown","Object Features":"Unknown","Tags":"City","Sighting Duration":"Undisclosed","Region":"Pennsylvania","Viewing Distance":"501 Feet - 1 Mile"}