{"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/45891.html.txt","/var/www/straped/mufon/org/45891.html"],"Disposition":"Unresolved","Date of the Event":"02/24/2013 07:45 UTC","divs":["Sighting DetailsSaw 2 objects that had mainly red lights that seemed to pulse but were always on and an occasional white light. The objects moved slowly at the same altitude and speed. One followed the other. Distance between was probably 100 feet (approximate), far too close for most airplanes. They were as big as passenger airliners which we can hear when they go over our house. These were perfectly silent and moving slowly. The distance between the 2 vehicles never varied nor did their altitude. It was like what you would see if one car were pulling another with a rigid tether between them. Looking through a monocular I could see three lights in tri-corner positions on both UFO's. I would say that we observed them travel from south to north with only one slight veering to the west and then back to a direct south north direction for a distance of 12 miles. We have open vistas. There were other aircraft in the area as usual on normal flight patterns. Most are west to east or east to west. These craft just flew beyond our area of vision. I read an entry on another sight that also occurred tonight about an hour earlier than ours that sounded similar to this one but from Rockingham NC which is approx. 2 hours south east from here. We observed this from our deck, then our front porch and then from the north side of our house in the yard. My husband had just walked outside to look at the stars and moon. The night sky was so clear and beautiful. We are star gazers. We are so familiar with aircraft because we live on a regular flight path and noticed immediately that these were different."],"Viewing Distance":"Unknown","Summary":"2 triangle objects observed with monocular and without","Object Features":"Unknown","Latitude":"35.985713","Object Flight Path":"Path with directional change","trends":["There have been 4 other sightings in Graham","There were no other sightings in Graham on or around February 24th 2013"],"Source":"MUFON","Object Shape":"Triangle","Longitude":"-79.361831","Case Number":"45891","map":"<A HREF = \"http://maps.google.com/maps?q=35.985713,+-79.361831(45891)&iwloc=A&hl=en\"> mufon case (45891) map </A>","Country":"United States","Log Number":"US-02252013-0003","City":"Graham","Sighting Duration":"00:15:00","Region":"North Carolina","Tags":"City","Date Submitted":"02/25/2013 02:17 UTC"}