{"Object Features":"Other","Case Number":"45901","Weather Factors":"Unknown","divs":["Sighting Detailswe were moving supplies into storage of our workplace. we were all in a tennis stadium so we pretty much had a 180 degree look of the sky. as i was placing somthing down on the ground my coworker said look and i looked up but didnt see anything. then he said look, look right here. thought he was just trying to make me look up for a joke but then he said look its an object. then i finally spotted it and it was a dull silver peanut looking object spinning at a medium rate of spee, going in a straight path. at first i thought of all possibilities of what it could be, a ballon but a ballon would more rather kinda float wobbly and keep rising. then i dismissed it as a airplane or helicopter, it had no wings or propellers. it was a constant spinning in a straight path and everytime it spun the sun would reflect off of it. was a dull silver till the sun would hit it, shined really bright when it did shine. Then as it finally passed under the sun, it may sound stupid but i looked down for a bit cause the sun was hurting my eyes then looked right back up, it was gone. when i first saw it, i immediately knew it was nothing i have never seen, and kept my eyes on it for the most part, till it disappeared. i was kinda in lost of words and in a gaze the whole time. my coworkers kept questioning what it was. lastly i lost sight of it as i explained earlier when i looked down to refocus my eyes. thank you for your time."],"Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=29.7428,+-95.578535(45901)&iwloc=A&hl=en\"> mufon case (45901) map </A>","Longitude":"-95.578535","City":"Houston","Region":"Texas","Latitude":"29.7428","Summary":"was moving things into storage and friend looked up and saw an object in the sky.","Country":"United States","Date of the Event":"02/25/2013 10:03 UTC","files":["/var/www/straped/mufon/html2text/45901.html.txt","/var/www/straped/mufon/org/45901.html"],"Object Shape":"Other","Tags":"City","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Source":"MUFON","Viewing Distance":"Unknown","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around February 25th 2013"],"Log Number":"US-02252013-0013","Date Submitted":"02/25/2013 07:50 UTC"}