{"Object Features":"None","Weather Factors":"Unknown","Longitude":"-82.990224","Summary":"large formation of many white orbs travelling swiftly NE; lost sight from my window; could not find them outside in the sky afterwards","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Log Number":"US-02252013-0012","Date Submitted":"02/25/2013 05:49 UTC","Country":"United States","Source":"MUFON","trends":["There have been 70 other sightings in Columbus","There were no other sightings in Columbus on or around February 25th 2013"],"City":"Columbus","files":["/var/www/straped/mufon/html2text/45900.html.txt","/var/www/straped/mufon/org/45900.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.964126,+-82.990224(45900)&iwloc=A&hl=en\"> mufon case (45900) map </A>","Region":"Ohio","Tags":"City","Date of the Event":"02/25/2013 05:30 UTC","divs":["sighting detailsmy partner was napping on our bed and i came in to plug my cellphone in, and happened to be down close to the floor to find the plug. i looked up out of the window and saw what looked like a beautiful formation of white shimmering birds -- i yelled at my partner to sit up & put his glasses on to see. then i looked closer and saw that there were lights, glowing lights. they were moving north over our building in victorian village, columbus. my partner couldn't see them so we ran outside to try to find them as they headed over the building. ran all around the block, every which way, and no sign of any of the lights. they were neither in a 'v'-formation or a straight line -- a sort of very intricate inter-woven pattern, diamonds maybe?, that i'd have to see again to describe. strangely enough we'd both seen the exact same thing with 2 other witnesses in a columbus-area grocery store on the day neil armstrong died. looked it up all over the internet & nothing ever explained. (august 25th, 2012). very, very moved by & curious about these lights. would love to know if anybody else has seen them today. (no chem\\vapor trails in the sky, either ... ) heard a helicopter afterward, while filing this report."],"Latitude":"39.964126","Object Shape":"Circle","Case Number":"45900","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile, Unknown"}