{"Disposition":"Unresolved","Date Submitted":"02/26/2013 02:25 UTC","Object Features":"None","Date of the Event":"02/24/2013 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.762025,+-124.179552(45911)&iwloc=A&hl=en\"> mufon case (45911) map </A>","Object Flight Path":"Path with directional change,Other","City":"Eureka","trends":["There have been 12 other sightings in Eureka","There were no other sightings in Eureka on or around February 24th 2013"],"Longitude":"-124.179552","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Tags":"City","Summary":"observed 50+ orange orbs asend from ocean fly over house in a north to south flight path at different altitudes","divs":["Sighting DetailsI was leaving the house at 12:55am Feb 24 2013 to go to the store when i stepped out my front door and noticed the whole sky was lit up with 50+ orange orbs!!( I've seen the orange orbs before but only 1-3 at a time) My first thought was that they were embers from a fire, but quickly realized they were all rising up from one spot northwest of the house a couple miles away, out over the ocean, and they all were traveling south with different flight paths and at different altitudes~ some were stopping and hovering then speeding up to catch others and maneuvering around each other, while others kept steady straight paths. Also some would get real bright then dim out then would light up again. I quickly took out my cell phone and tried to record what i was seeing and filmed for about 47 seconds but didn't think i was picking up anything, so i raced to the bedroom and woke up my wife( she believes, but has never seen )and excitingly told her \"come quick~ you gotta see this!! She was startled by my emergency, and asked me whats going on? I told her everything's OK~ but you gotta see this!! I coaxed her out of bed and to the front door and pointed to the sky and said \"Look at that~ what the hell are those?!!\" At this point there were about 20 or so still coming towards us and as they got directly to the west of our position, the closest to us, they would fade out and disappear from sight. Not one could be seen once it was past the west parallel or southwest of us. She just stood there not really saying anything while i pointed out where they were coming from and some of the crazy maneuvers they were doing. We watched as one by one they would cross the west parallel and fade out until the last one was gone... The only way i can really compare what i saw is to the video of the clusters taken in daytime in South America and Mexico..."],"Case Number":"45911","files":["/var/www/straped/mufon/html2text/45911.html.txt","/var/www/straped/mufon/org/45911.html"],"Region":"California","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Latitude":"40.762025","Log Number":"US-02262013-0005","Object Shape":"Oval, Sphere, Star-like"}