{"Summary":"Orbs flying like gnats","Case Number":"45917","Disposition":"Unresolved","Longitude":"-89.092165","trends":["There have been 20 other sightings in Rockford","There were no other sightings in Rockford on or around February 25th 2013"],"Object Features":"None","Country":"United States","Date of the Event":"02/25/2013 02:55 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.280871,+-89.092165(45917)&iwloc=A&hl=en\"> mufon case (45917) map </A>","Source":"MUFON","files":["/var/www/straped/mufon/html2text/45917.html.txt","/var/www/straped/mufon/org/45917.html"],"Date Submitted":"02/26/2013 08:00 UTC","Weather Factors":"Unknown","divs":["Sighting DetailsI saw a sunlight glint of something in the sky like an RC plane flying. I thought it was awful high for an RC so I kept watching. Then there was another. I wondered if there was an RC club flying but they were really high off the ground like half a mile. I stepped out from around a tree that was partially blocking my view. Then I saw 5. They weren't there the whole time but were appearing. They were little orbs with a a light coming from inside. Every once in a while one of them would reflect sunlight like it was metallic then the light from inside was less prominent. I counted six. I decided then they were UFO's so I called my friend and asked her to come over right away. While I had her on the phone more appeared to the SE of the original group. They were in circular, random flight but were relative to each other. They were like gnats but not as quick. More graceful. Hard to count the new group but I would say a dozen. All together I think I was looking at 18 when they joined. By the time my friend got there, there were only 2 or 3 left. She saw them. They kind of just disappeared to the North. When I say disappeared I don't mean distance in horizontal miles but more like above the cloud cover. I asked my friend \"did you see them?\" she said \"I saw SOMETHING\". Good enough for me. She described them just like I did so I feel confident they were UFO's. I took pictures with my camera phone but all I got was blue sky. The resolution is just too poor to show anything."],"Log Number":"US-02262013-0011","Tags":"City","Object Shape":"Sphere","Latitude":"42.280871","Viewing Distance":"501 Feet - 1 Mile","City":"Rockford","Sighting Duration":"00:15:00","Object Flight Path":"Other","Region":"Illinois"}