{"Summary":"Strange Object Traveling Slowly Through Morning Sky","Object Flight Path":"Straight-line path","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=29.77443,+-94.669868(45915)&iwloc=A&hl=en\"> mufon case (45915) map </A>","trends":["There have been 2 other sightings in Anahuac","There were no other sightings in Anahuac on or around February 26th 2013"],"Object Shape":"Disc","Date of the Event":"02/26/2013 05:00 UTC","Sighting Duration":"Undisclosed","divs":["Sighting DetailsIt was about 5:00 a.m. and once again I stepped outside for a smoke. I noticed an object flying through the sky which I assumed was a plane, due to the aviation lights I saw on it. But after a few minutes I noticed it was moving too slow to be a plane, that and the aviation lights (there were three, two blue ones on either end and a red one in the middle of the object) were blinking randomly, not in any order at all. I watched it as it flew over me and that was when I noticed that it didn't have any wings, it was completely disc like. I was in shock because I have never seen a UFO in such detail. Here's the weird part though. I was completely transfixed by this object, forgot I was even smoking a cigarette and watched it as it flew over the tree line and out of view completely. I hate that I didn't have my phone with me so I could take a picture, but I even wonder if I would have being so transfixed on this object. I didn't even think about taking a picture of it until I had come back inside. From now on my phone stays with me and one way or another I am going to take a picture of the objects I have been seeing lately."],"files":["/var/www/straped/mufon/html2text/45915.html.txt","/var/www/straped/mufon/org/45915.html"],"Region":"Texas","Viewing Distance":"Over One Mile","Country":"United States","Source":"MUFON","Longitude":"-94.669868","Log Number":"US-02262013-0009","City":"Anahuac","Object Features":"Unknown","Latitude":"29.77443","Case Number":"45915","Date Submitted":"02/26/2013 06:16 UTC","Weather Factors":"Unknown","Tags":"City"}