{"Case Number":"45926","trends":["There have been 9 other sightings in Midland","There were no other sightings in Midland on or around February 19th 2013"],"files":["/var/www/straped/mufon/html2text/45926.html.txt","/var/www/straped/mufon/org/45926.html"],"Disposition":"Unresolved","Object Features":"Unknown","Weather Factors":"Unknown","Summary":"Flaming, Hovering UFO","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile, Unknown","divs":["Sighting DetailsI went outside to smoke my morning cigarette, just after I woke my youngest daughter for school. It was around 6:20 or so. I was sitting on the porch facing an exterior wall of my bedroom. I turned to my right to look up in the sky, as I often do when having a smoke, and saw the craft hovering in the sky to the northeast. My first thought was that I was hallucinating, or possibly my eyes just hadn't adjusted to being awake yet. (I'm not a morning person) I've tried finding a picture similar to what I saw, but haven't been able to find one. On first glance, it looked like a small fire in the sky, below the thin, low, partial cloud cover. When I really looked at it, it appeared to be three (possibly 4-5) orangeish lights stacked on top of each other that were pulsating. They were way too large to be stars or commercial aircraft. It looked as though they shone through a haze. I ran inside and grabbed my cell phone to take a video, but it's not great. The object was far enough away that you can't really see the detail or shape that I saw with my naked eye. I took a few clips, sorry for the crappy footage, I didn't have time to run in and grab my tripod. Since this thing seemed to be hanging around, I dashed back inside to get my daughter to come look. As soon as we made it back outside, it was gone. Simply vanished into thin air. Needless to say, she thinks I'm nuts now (she's 11). The thing never moved while I was observing it, it just sat there pulsating light. This isn't the first one I've seen. The first was on a road trip from Midland to Lake LBJ in high school, a large orange orb that followed my car and then zig-zagged off into the sky. Then, I saw another last week on February 21st, during the day on my drive to work. I turned on to the street heading towards my office building, and saw a small silver disk glinting in the sunlight. My guess is it was a couple thousand feet up. It was moving very slowly to the northwest, then poof! It vanished into thin air. No video on this one, it happened too fast."],"map":"<A HREF = \"http://maps.google.com/maps?q=32.037845,+-102.151253(45926)&iwloc=A&hl=en\"> mufon case (45926) map </A>","Latitude":"32.037845","Log Number":"US-02262013-0019","Object Flight Path":"Stationary","Longitude":"-102.151253","Date of the Event":"02/19/2013 06:20 UTC","Tags":"City","Country":"United States","Object Shape":"Bullet, Missile, Cigar, Fireball","Sighting Duration":"Undisclosed","Date Submitted":"02/26/2013 05:13 UTC","Region":"Texas","City":"Midland"}