{"Object Flight Path":"Hovering then path","Latitude":"39.490847","Sighting Duration":"Undisclosed","Source":"MUFON","Date Submitted":"02/26/2013 11:15 UTC","City":"Brazil","Country":"United States","Disposition":"Unresolved","Log Number":"US-02262013-0022","files":["/var/www/straped/mufon/html2text/45931.html.txt","/var/www/straped/mufon/more/45931_submitter_file1__IMAG0975.jpg","/var/www/straped/mufon/more/45931_submitter_file2__IMAG0976.jpg","/var/www/straped/mufon/more/45931_submitter_file3__IMAG0977.jpg","/var/www/straped/mufon/org/45931.html"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.490847,+-87.140965(45931)&iwloc=A&hl=en\"> mufon case (45931) map </A>","Tags":"City","Viewing Distance":"Unknown","trends":["There have been 7 other sightings in Brazil","There were no other sightings in Brazil on or around September 10th 2012","This sighting has been favorited 2 times.",""],"Object Shape":"Disc","Date of the Event":"09/10/2012 11:12 UTC","Case Number":"45931","Object Features":"Unknown","Region":"Indiana","Longitude":"-87.140965","divs":["Sighting DetailsMy spouse was returning to work after 11:10 AM on the 10th of Sept. 2012. She contacted me on the phone after returning to work stating that she had taken pictures (via cell) of something rather strange she spotted while driving on State Road 59 by Forest Park. At first, she though it might be a blimp that sometimes passes over Brazil, but this did not look like the normal blimp that travels through the area. I looked at the photos and it did not look like the blimp either, but tha is not to say it is not. She observed the craft hovering and then moving North of the town of Brazil, Indiana. She took photos on both 59 and by the Hardees (North)of the object. We have looked at the photos, but no one is sure what the object might be. You will notice the object below the traffic light and near the power lines in photo 2-3 and in the v of two trees in the first photo. The object appears like a small white object with a dark bottom."],"Summary":"Uknown vehicle spotted in the sky during daylight hours."}