{"Sighting Duration":"Undisclosed","Region":"Hawaii","divs":["Sighting DetailsMy partner and I were riding our harley's just after breakfest, I noticed a bright reflection over a small swamp in haleiwa. when I looked up I saw a silver disc it was not moving so I called out to my partner to look up at it he did and as we were both staring at it it completely dissappeared before our eyes, the disc was only 200 yards away and about 500 ft up we got a good look it did not fly away it was just gone, so we pulled over right away and shut off the engines of our bikes to see if we could hear anything and stood there motionless for a few seconds no noise nothing. there was no obstructions to the view, I have been back there 10 times since it happened.I am not in the least supprised as I have believed in other life forms since I was 9 years old at an early age I took a real interest in ufo's and read all that I could find on the topic, just happy to say that I finally saw one with my own eyes.Any way we didnot say much after that I was confident that he saw what I saw, about a week later I called my riding partner and said that I never asked him that morning exactly what he saw, He then told me that he saw a silver disc just as I did. the disc was approx. 30 feet across"],"Object Flight Path":"Stationary","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=21.59,+-158.113889(4593)&iwloc=A&hl=en\"> mufon case (4593) map </A>","City":"Haleiwa","Date Submitted":"03/14/2006 08:30 UTC","Case Number":"4593","Weather Factors":"Unknown","trends":["There has been one other sighting in Haleiwa","There were no other sightings in Haleiwa on or around March 14th 2006"],"files":["/var/www/straped/mufon/html2text/4593.html.txt","/var/www/straped/mufon/org/4593.html"],"Object Features":"None","Object Shape":"Disc","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-03292006-0001","Tags":"City","Longitude":"-158.113889","Country":"United States","Disposition":"Unknown","Summary":"silver disc 250 yards away 500 feet elev.","Date of the Event":"03/14/2006 08:30 UTC","Latitude":"21.59"}