{"Region":"Arkansas","map":"<A HREF = \"http://maps.google.com/maps?q=34.772256,+-92.259644(45932)&iwloc=A&hl=en\"> mufon case (45932) map </A>","Latitude":"34.772256","Date of the Event":"02/24/2013 07:00 UTC","divs":["sighting detailsbrother in law was outside on my carport smoking approx 19:00 on 2\\24, called me outside to see something. due east, above treeline, there was a group of 7 orange lights moving through the sky. there was no obvious formation, some formed a triangle, some a line, their relative position was constant. there was no sound, no emission and the lights were steady (not twinkling). they moved to the west in a straight line at about airplane speed, and when they passed directly overhead, they would disappear. looking back to their origin, i noticed more lights coming into view, again with no obvious formation and no sound, just moving steadily to the west and disappearing overhead. i called for my husband, and i tried to move closer to origin to take a picture or video, but a streetlight and tree made viewing worse. the lights continued across the sky, sporadically for approx 10 minutes. we are near an air force base and national guard base, but there were no planes in the sky at this time. my other brother in law is load master at the afb, and was working, but denies any knowledge of exercises that night."],"Log Number":"US-02272013-0001","Disposition":"Unresolved","Object Features":"Unknown","Source":"MUFON","Summary":"15-20 orange lights moving through sky","Weather Factors":"Unknown","Case Number":"45932","City":"North Little Rock","Object Flight Path":"Straight-line path","Object Shape":"Other","Date Submitted":"02/27/2013 12:41 UTC","Longitude":"-92.259644","Tags":"City","files":["/var/www/straped/mufon/html2text/45932.html.txt","/var/www/straped/mufon/org/45932.html"],"Viewing Distance":"20 Feet or Less","Country":"United States","trends":["There have been 5 other sightings in North Little Rock","There were no other sightings in North Little Rock on or around February 24th 2013"],"Sighting Duration":"Undisclosed"}