{"Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/45935.html.txt","/var/www/straped/mufon/org/45935.html"],"Region":"California","City":"Pico Rivera","Date of the Event":"07/20/1968 12:00 UTC","Summary":"5 bright star-like points of light low on horizon","Tags":"City","Source":"MUFON","Sighting Duration":"Undisclosed","Date Submitted":"02/27/2013 03:10 UTC","Object Flight Path":"Path with directional change","trends":["There have been 8 other sightings in Pico Rivera","There were no other sightings in Pico Rivera on or around July 20th 1968"],"Log Number":"US-02272013-0003","Disposition":"Unresolved","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.022601,+-118.057608(45935)&iwloc=A&hl=en\"> mufon case (45935) map </A>","Object Shape":"Star-like, Other","Longitude":"-118.057608","Object Features":"Other","Weather Factors":"Unknown","divs":["Sighting DetailsThis accurred around 1967 or 1968 in Pico Rivera, CA. in the early evening in summer. As I walked out the door I observed the neighbors across the street looking up. As I also looked up I saw a pulsating red light directly above the street. Eventually it faded out and disappeared. Then i continued up the street to a party 5 houses down. there were approximately 15-16 people in the backyard of the party all were friends of mine from high school. After approx. 20 mnutes something caught my attention in the corner of my eye, as I looked to see what it was I saw 5 points of lights that looked like stars traveling in formation low in the northern horizon traveling slowly from east to west. The lights were observed by my friends also. Suddenly the 'stars' stopped in mid flight, zig-zagged, then abruptly changed direction and flew upward and disappeared in an instant. We all fell silent and not sure what to say for a few minutes. We all asked one another if everyone saw the same thing. The rest of the night as we tried to joke about it everyone was quieter than usual and kept shaking our heads in disbelief. Occasionally when we get together even now the subject of what we saw will come up and still wonder what the hell it was."],"Latitude":"34.022601","Case Number":"45935"}