{"files":["/var/www/straped/mufon/html2text/45942.html.txt","/var/www/straped/mufon/org/45942.html"],"Latitude":"35.017543","Object Shape":"Circle, Sphere, Triangle","Region":"Oklahoma","map":"<A HREF = \"http://maps.google.com/maps?q=35.017543,+-97.357609(45942)&iwloc=A&hl=en\"> mufon case (45942) map </A>","Sighting Duration":"Undisclosed","City":"Purcell","trends":["There has been one other sighting in Purcell","There were no other sightings in Purcell on or around February 26th 2013"],"Source":"MUFON","Date Submitted":"02/27/2013 03:54 UTC","Tags":"City","Log Number":"US-02272013-0011","Viewing Distance":"20 Feet or Less","divs":["Sighting DetailsWe were driving south along i35 outside Purcell, OK when object appeared in the sky in front of our vehicle. Object appeared to be a straight object with two white lights one in front and one in the back. It began performing aerial stunts and making patterns in the sky mostly figure eight pattern my daughter tried taking a picture but object at this point was to far in the distance. One of the lights blinked out remaining light started to blink as it moved out toward the east and hovered out of our view. About 40 minutes later while still traveling south along i35 just south of Paul's valley, OK my daughter had a strange look on her face I asked if she was ok she said yes just had what she described as a rush of panic when she looked up at me I noticed her face had a look of almost shock I looked outside the drivers window to the east to see an sphere object with a white light almost like a window with a red arch above the white hovering right along side the car. The moment I noticed it it shot out in front of the vehicle back toward the south and changed shape to a triangle with 3 lights 1 white 1 red and 1 blue. At this point the object again started performing aerial stunts and making patterns before changing shape again to a solid light and moving back east at this point it was close enough my daughter was able to get photos it changed again once it slowed down back to the triangle shape and started hovering out of our sight. After it was no longer in our view my daughter checked her pictures to discover that two of three photos appeared to be smiley faces in the sky while the third is two straight lines parallel to each other."],"Disposition":"Unresolved","Country":"United States","Summary":"Object in sky performing aerial designs to our south moves to the east begins hovering. 40 min later object is seen hovering to east outside of car shoots back to south changing shape and light paterns performs more aerial designs before moving back east","Weather Factors":"Unknown","Case Number":"45942","Longitude":"-97.357609","Date of the Event":"02/26/2013 12:00 UTC","Object Features":"None","Object Flight Path":"Other"}