{"Date of the Event":"06/25/2008 01:15 UTC","Sighting Duration":"Undisclosed","Log Number":"US-02282013-0001","Disposition":"Unresolved","Object Shape":"Sphere","Region":"Wyoming","Viewing Distance":"20 Feet or Less","files":["/var/www/straped/mufon/html2text/45949.html.txt","/var/www/straped/mufon/org/45949.html"],"City":"Gillette","Source":"MUFON","Case Number":"45949","Longitude":"-105.485837","map":"<A HREF = \"http://maps.google.com/maps?q=44.304215,+-105.485837(45949)&iwloc=A&hl=en\"> mufon case (45949) map </A>","Country":"United States","divs":["Sighting DetailsSince I was a young girl I have always loved to watch the stars. I would try to pick out the constellations. So staring out my bedroom window into the night sky was not new to me. I was sitting at my bedroom window. I had the room as dark as it could be so that the stars would show more brightly. My window is about 20 feet from the neighbors backyard fence. On the other side of their fence are their trees. I could hear a single cricket chirping and that was the only sound I remember hearing. Around 1 to 1:15 am I seen an object traveling from east to west in the sky. I noticed it because I had been watching the stars and they don't move and I rarely see birds or bats flying around our house at night. The object was not as high in the sky as the neighbors treetops. It did not glow or give off any sound. It looked like two solid used-penny colored spheres no bigger then large grapefruits. One was slightly ahead of the other. They looked attached in their center with a white cylinder shaped tube only about 2 inches in diameter. The white cylinder tube did not glow but somehow looked as though it was hollow. It only took about 5 seconds to enter and leave my view but it will always remain in my mind. I could only see about 20 feet to the east of my window and about 30 feet toward the west until the nights darkness hid everything. I then jumped up away from my window, walked out of my bedroom into the hallway then into the living room all the time my thoughts were spinning around in my head. I was thinking, did I really just see that, circlular objects don't fly, we aren't alone and what's going to happen next? I felt afraid and excited at the same time. I wish I had someone to tell so that I would know I wasn't going crazy but then again they would probably think I was crazy. I then tried to collect my thoughts. I thought I better write this down so that I will never forget. Luckily, I have never forgotten."],"Date Submitted":"02/28/2013 12:36 UTC","Object Flight Path":"Straight-line path","Latitude":"44.304215","Object Features":"Other","Weather Factors":"Unknown","trends":["There have been 5 other sightings in Gillette","There were no other sightings in Gillette on or around June 25th 2008"],"Tags":"City","Summary":"Two,used penny colored spheres that looked conjoined with dull white tube. Flying below treetop level about 12 feet from me from east to west."}