{"Sighting Duration":"00:00:10","Date of the Event":"06/25/2010 11:55 UTC","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Region":"Wyoming","Country":"United States","Case Number":"45953","Source":"MUFON","Disposition":"Unresolved","Latitude":"44.313745","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=44.313745,+-105.484797(45953)&iwloc=A&hl=en\"> mufon case (45953) map </A>","Viewing Distance":"21-100 Feet","trends":["There have been 5 other sightings in Gillette","There were no other sightings in Gillette on or around June 25th 2010"],"Date Submitted":"02/28/2013 02:24 UTC","Object Features":"None","Object Shape":"Triangle","Summary":"Me and one other person witnessed three lights in a triangle pattern flying from the east into the west.","files":["/var/www/straped/mufon/html2text/45953.html.txt","/var/www/straped/mufon/org/45953.html"],"Longitude":"-105.484797","City":"Gillette","divs":["Sighting DetailsI was sitting on my bed. My bed was directly against the wall with a window. We could sit in the bed and look out the window and view the sky. I like to keep it dark in my room to be able to see more stars in the sky. Two years before on this exact date I had seen spheres going by my window so, since then, I gazed out of my window more often hoping to see something again. It was partly cloudy and to the north there was a thunderstorm or heat lightning with no rain. The moon was full or almost full making the stars more difficult to see. The clouds were moving quickly from northwest to east but I still gazed up into the sky trying to make out the stars. I had a friend with me who would like to stay anonymus. My friend had just come into the room and sat down with me on the bed it was almost midnight. My friend and I were only looking out of the window a few minutes when the lights which appeared to me to be in a equilateral triangle formation flew over our apartment building past our window in a straight line until it was out of site. It came from the east just like the spheres two years before and followed the same path to the west just as the spheres did. As it traveled over us I noticed it looked as though it was above the clouds but the lights did not disappear like an airplanes lights would if it went behind the clouds. The bluish-white lights shown right through the clouds not losing any of their luminosity. My friend describes the three lights as being spherical in shape and white with a slight pinkish hue. My friend also describes the three lights as being in an isosceles triangle formation. My friend and I both felt excited, afraid and curious. I remember saying while pointing up at the lights, Ufo, Ufo, Ufo, wait, wait, wait. I was thinking I could grab the camera and get a photo but it went out of sight too quickly. Neither one of us knew how to report a Ufo sighting so we discussed what we saw after we closed the window and pulled the blinds shut. We also decided not to tell anyone until we were both comfortable with people knowing."],"Log Number":"US-02282013-0005"}