{"City":"Sierra Madre","Source":"MUFON","Object Flight Path":"Stationary","Tags":"City","Longitude":"-118.044719","divs":["Sighting DetailsIt was early evening summertime between 1967 & 1970. I first heard sirens running from west to east.I thought it might be the Forest Service as this was their usual route.Several minutes later I heard the fog horn go off signaling the volunteer fimemen there was a fire. I then thought it was a brush fire close to us and the Forest Service needed our fire department's help. I then went outside to see if I could locate any fires as the foothills were right behind our house.As I went outside I was first looking south over the San Gabriel Valley as we lived on a hill and saw 2 groups of red round lights with 3 to 5 per group just floating about 500' above I believe to be the South El Monte area of the San Gabriel Valley. I don't know if they were moving much as they were about 10 miles away. I called to my parents to come see what I was looking at. Our neighbors also heard me calling my folks and also came out to look. There was about 10 of us watching and wondering what we were looking at for about 10 minutes before they just disappeared one group at a time. I checked the local paper the next morning to see if there were any articles about the UFO's (or what ever we saw) but didn;t find any. I did find an article on the small brush fire that was in the hills just east of us with an ending of \"and UFO's were seen in the area but not believed to have anything to do with the fire.\" I least I knew someone else had seen something strange."],"Date of the Event":"06/20/1968 12:00 UTC","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.172578,+-118.044719(45950)&iwloc=A&hl=en\"> mufon case (45950) map </A>","Latitude":"34.172578","Disposition":"Unresolved","Log Number":"US-02282013-0002","Summary":"Viewed with neighbors 7 to 10 red round objects hovering about 500' above neighborhood around 10 miles across valley from us.","Date Submitted":"02/28/2013 01:07 UTC","Country":"United States","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","trends":["There have been no other sightings in Sierra Madre","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/45950.html.txt","/var/www/straped/mufon/org/45950.html"],"Case Number":"45950","Region":"California"}