{"Log Number":"US-02282013-0007","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/45955.html.txt","/var/www/straped/mufon/org/45955.html"],"Object Shape":"Fireball","Summary":"Fireball like, pulsating, white and reddish-yellow light coming from NE heading Southeast, but then ascended rapidly up into space until no longer visible.","trends":["There have been no other sightings in Pine Haven","This sighting has never been favorited."],"Object Flight Path":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=44.35068,+-104.804431(45955)&iwloc=A&hl=en\"> mufon case (45955) map </A>","Region":"Wyoming","City":"Pine Haven","Viewing Distance":"Over One Mile","Case Number":"45955","Source":"MUFON","Date of the Event":"02/28/2013 02:12 UTC","Disposition":"Unresolved","Country":"United States","Date Submitted":"02/28/2013 04:50 UTC","Longitude":"-104.804431","Tags":"City","divs":["Sighting DetailsI was sitting in my lounge chair in front of the large windowed patio doorsin my living room. The entire room was dark so that I could see outside better. There were some clouds in the sky but they were thin. The mooon was bright so not many stars were visible but I could make out a few. I seen just above the horizon what looked like a fireball traveling in a southeast direction and gaining altitude. It ascended like an airplane taking flight only it moved faster. While it was ascending and moving southeast it also pulsated white and reddish-yellow light. It seemed to slow a little then changed from the white, reddish yellow light to a white bluish color then suddenly it shot straight up out of site almost instantly. I was shocked because I thought it was an airplane at first but then when the fireball shot straight up I got up and looked out the door and up into the sky to see if I could see it higher in the sky. I searched the sky for at least a minute but then decided at the speed it ascended I wasn't going to find it. I really need to keep a camera on me at all times. I would love to have a picture of the things I see in the sky."],"Sighting Duration":"00:00:10","Latitude":"44.35068","Object Features":"Unknown"}