{"Longitude":"-117.173927","Summary":"outside having a cigarette, looked up and saw a bright orange object. It appeared to be on fire.","Tags":"City","Source":"MUFON","Object Features":"Unknown","Country":"United States","City":"San Diego","files":["/var/www/straped/mufon/html2text/45952.html.txt","/var/www/straped/mufon/org/45952.html"],"Case Number":"45952","Date of the Event":"02/27/2013 09:40 UTC","Date Submitted":"02/28/2013 01:29 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.778296,+-117.173927(45952)&iwloc=A&hl=en\"> mufon case (45952) map </A>","Latitude":"32.778296","Object Flight Path":"Hovering then path","Viewing Distance":"501 Feet - 1 Mile","Region":"California","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Disposition":"Unresolved","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around February 27th 2013"],"Log Number":"US-02282013-0004","Object Shape":"Oval, Sphere, Other","divs":["Sighting DetailsI was outside my house around 9:30 p.m. having a cigarette. After a few minutes, I looked up and saw a huge, bright orange object. So bright, it appeared to be on fire. I called for my husband to look and he saw it too. He called for his nephew who was inside, to bring out his phone for video, at which point my husband ran around to the front of the house. His nephew gave him the phone and he (his nephew) had binoculars. By this time I came back around and that's when it took off south, within 20 seconds, it had dimmed to the size of a pinpoint and then disappeared all together. My husbands heart was beating so fast, you can hear him on the video out of breath. We felt that we were witnessing a UFO. Our nephew, saw it the best through the binoculars and says it looked like a hazy, translucent sphere with a fire at the bottom of it. He was able to sketch it. We were very very excited by what we saw. We lost sight of the object because it faded into nothing. I hope we were not the only ones who seen it."]}