{"Date Submitted":"02/28/2013 05:14 UTC","Object Shape":"Other","trends":["There have been 12 other sightings in Marquette","There were no other sightings in Marquette on or around August 16th 2008"],"Disposition":"Unresolved","Latitude":"46.548236","map":"<A HREF = \"http://maps.google.com/maps?q=46.548236,+-87.387161(45969)&iwloc=A&hl=en\"> mufon case (45969) map </A>","Object Flight Path":"Straight-line path","Country":"United States","Object Features":"Dome","Tags":"City","Log Number":"US-02282013-0020","Case Number":"45969","Weather Factors":"Unknown","City":"Marquette","divs":["Sighting DetailsIn mid-August at about 9:20 in the evening I got into my car and began driving home from a restaurant along the lakeshore. (Lake Superior) There is a road along the Lower Harbor and I was facing North. I looked up to see the sky and saw a large, long craft moving very slowly over Marquette Michigan's downtown area. I didn't see any lights on the craft, but I clearly saw it silhouetted, or backlit by the sunset's afterglow. The sky was still bright and golden. It was headed NE and moved ot of my sight over the treetops. I was very excited when I saw it and knew it could not possibly be a plane or jet. It was so huge and moved so very slowly and at such a low altitude. I was undecided as to what to do next. Should I hurry up to higher ground and try to see it some more? Or perhaps turn around and reverse my direction in order to have a view of the craft over Presque Isle and above the lake? What I did instead was drive to my home and call the police to report the sighting. The officer did not make me feel silly and took the information. My assumption was that since the very large UFO moved right over Marquette, that they would have hundreds of calls from residents who also saw it. But no one else reported seeing a UFO that evening. I guess I might have been the only person who did observe the UFO."],"Longitude":"-87.387161","Region":"Michigan","files":["/var/www/straped/mufon/html2text/45969.html.txt","/var/www/straped/mufon/org/45969.html"],"Source":"MUFON","Summary":"While driving I saw a large UFO moving slowly over downtown Marquette, MI","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"08/16/2008 09:20 UTC","Sighting Duration":"Undisclosed"}