{"files":["/var/www/straped/mufon/html2text/45964.html.txt","/var/www/straped/mufon/org/45964.html"],"Object Flight Path":"Other","Log Number":"US-02282013-0015","City":"Tallassee","Object Features":"Unknown","Date of the Event":"06/07/1998 09:01 UTC","Object Shape":"Other","Sighting Duration":"00:10:00","divs":["sighting detailsi was sitting in my moms car one night laying across the front seats, i was able to lay across the front seats because she had bench seats in the car. i noticed a really bright light out the corner of my eye. the light was extremely bright like the light on a large aircrafts landing gear. the thing that set it apart aside from being in a very rural town in the middle of no where, was that this light would get extremely bright and pulsate itself out until it was gone. this went on for about 5 min. getting really really bright and pulsation\\flickering itself almost in steps to a smaller bright ball of light until it completely was not viewable. after doing this for 5 min, the light became bright again, not extremely bright as in its peak potential and it seemed as if multi lights came into the play, seemed like red, blue, white, yellow etc, going around in circles. it did this for about another 5 min and it descended below the tree line. i never seen it bolt up or anything. during the time that all this was happening, i was really curious and nervous because i had no explanation for it, especially with me being raised and brought up on military installations all my life from birth to 17 or 18 and having a passion for aircraft. i knew it was not a helicopter, airplane, or bump because of the location i was as well as the object or whatever it was not generating any sound whatsoever. i mean for the periods of time i watched it, it had absolutely no sound just lights. i was really nervous so once the object went behind the tree line, i got out of the car and ran in the house."],"Source":"MUFON","Disposition":"Unresolved","Region":"Alabama","trends":["There has been one other sighting in Tallassee","There were no other sightings in Tallassee on or around June 7th 1998"],"Viewing Distance":"Unknown","Longitude":"-85.916672","map":"<A HREF = \"http://maps.google.com/maps?q=32.543493,+-85.916672(45964)&iwloc=A&hl=en\"> mufon case (45964) map </A>","Tags":"City","Latitude":"32.543493","Case Number":"45964","Summary":"I was sitting in my mothers car at around 9 ish, and I noticed a really bright light similar to a airplane landing light but pulsating and disappearing.","Date Submitted":"02/28/2013 04:02 UTC","Weather Factors":"Unknown","Country":"United States"}