{"divs":["Sighting DetailsI was taking my two dogs outside to go to the bathroom when I noticed three bright lights. My first thought was that it was an aircraft. However the lights suddenly faded out. I assumed that it was obscured by the tree so I moved further up the yard. It was then that I saw an orange fireball. I had seen one before several years ago and assumed that it was just a meteor striking the atmosphere. However I suddenly felt it was out of place. I called to my mother to come outside and went on looking for any other lights. My mother came over and asked what was going on. I told her what I had seen, and joked that she was going to think I was crazy. We stared up at the sky for sometime and was about to go back inside when the three lights reappeared, followed by another set of three lights further to the North. We were both shocked and a little disconcerted. We have been around aircraft all our lives, since my father is a pilot. However, we both knew this was no aircraft. The lights remained on for a few seconds before they appeared to drop and fade out. We could not hear any engine noise or see any solid shape. The lights were very bright, and large. This made is somewhat difficult to judge the distance. We knew friends that live in that general direction so I called them. I told her what we had seen, and she went outside. We continued our conversation when suddenly the lights reappeared. She was also shocked and said that the lights appeared to be slowly moving in a North Eastern direction. We remained outside for about twenty minutes, seeing another glimpse of these lights. I called another friend who also lived in that direction. She was not that surprised and stated that last year, also during April, they were outside doing a program at Wolf Park. In the middle of the program they also saw these lights. Many of the staff and members of the public saw them too. I have never been a beliver in this sort of phenomenon and am still not sure what we saw. I did find it interesting that the lights were in the direction of Grissom Airforce base."],"Source":"MUFON","Tags":"City","Region":"Indiana","Date of the Event":"03/29/2006 09:10 UTC","Longitude":"-86.867234","Country":"United States","Object Flight Path":"Hovering then path","City":"Brookston","Summary":"A pair of three large, bright yellow lights in the sky. One fireball / meteor.","Date Submitted":"03/29/2006 09:10 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/4596.html.txt","/var/www/straped/mufon/org/4596.html"],"trends":["There have been 2 other sightings in Brookston","There were no other sightings in Brookston on or around March 29th 2006"],"Disposition":"Insufficient Data","Object Shape":"Fireball","Latitude":"40.602814","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=40.602814,+-86.867234(4596)&iwloc=A&hl=en\"> mufon case (4596) map </A>","Case Number":"4596","Viewing Distance":"Over One Mile","Log Number":"US-03292006-0004"}