{"Latitude":"35.604005","Sighting Duration":"00:10:00","Region":"North Carolina","Weather Factors":"Unknown","Source":"MUFON","Summary":"I was a large black plane, but didn't have normal patterns and was silent and still","City":"Asheville","Object Features":"Window(s), Wings, Other","Date Submitted":"02/28/2013 07:24 UTC","Viewing Distance":"Unknown","Case Number":"45971","Log Number":"US-02282013-0022","Country":"United States","trends":["There have been 28 other sightings in Asheville","There were no other sightings in Asheville on or around February 28th 2013"],"files":["/var/www/straped/mufon/html2text/45971.html.txt","/var/www/straped/mufon/org/45971.html"],"divs":["Sighting DetailsMe and my mother were driving down the roa near the Asheville airport when we spotting a straight line about 2 inches across of un moving lights. We speculated that because we driving at it that it was simply a trick of the eye and we were deceiving ourselves. As we got closer it looked like a plane that was may 5 minutes away from landing, since it was the airport I thought this was the obvious answer, but as we got to a diagonal angle of It I noticed that it was completely still. I have flown on a many and long flights so realize when planes come in for a landing they usuall have their lights flashing. We then thought that since it was stationary and bright it would be one of those industrial style lights that decorate parking lots and the such. But at around 300 yards away from the object (that's a bad estimate) I realized it was a dark colored military plane. The craft, wether terrestrial or not was displaying physics defying. Feats and promoted me to immediately draft this report. We drove along the highway and it was out of view by trees about 15 seconds later. As a Man of logic I usually do be careful not to make a fool of myself believing everything is a UFO as long as I don't know it's real purpose. But this incident seemed to strange and direct to be a trick of the eye. I'm aure many other drivers saw this craft aswell"],"Disposition":"Unresolved","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=35.604005,+-82.552045(45971)&iwloc=A&hl=en\"> mufon case (45971) map </A>","Longitude":"-82.552045","Object Shape":"Other","Tags":"City","Date of the Event":"02/28/2013 06:50 UTC"}