{"trends":["There have been no other sightings in Vian","This sighting has never been favorited."],"Tags":"City","Latitude":"35.498428","Case Number":"45975","Log Number":"US-02282013-0026","divs":["Sighting DetailsAt 2023hrs I stepped outside to smoke a cigarette, I noticed a large object in the sky that seemed to be moving west. It was two major lights (orangish-yellow), on the each side of the object. The lights looked bigger then a bright star that where close together. I came back in and within 30secs I had a pair of 10x24 Pentax binoculars. It would move in angles as if the lights turned off and turned on in a different spot. I thought it was an optical allusion because it was moving very slowly, and if you stare at a bright star at times it looks like its moving. But this moved erratic, but still west. Through the Binoculars I could see two sets above and below the center ribbon lights not ribbon lights but long reddish orange lights the seemed to glow. It slowly moved west but out of the frame of binoculars, and I would reacquire it and it would move again, it moved west until out of view at 2028hrs. It was very unnerving as I look up at the stars as much as I can. I am very aware of events in the sky, planes, satellites, HST, and the ISS. This was very strange. The lights seemed that they didn't shine but emit the light."],"Longitude":"-94.969675","Object Features":"Unknown","Object Flight Path":"Path with directional change","Viewing Distance":"Unknown","Country":"United States","Summary":"I spotted a large craft that moved slowly but erractic. It had two large lights on each side.","Object Shape":"Cylinder, Oval","Source":"MUFON","Date Submitted":"02/28/2013 11:31 UTC","City":"Vian","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.498428,+-94.969675(45975)&iwloc=A&hl=en\"> mufon case (45975) map </A>","Date of the Event":"02/28/2013 08:23 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/45975.html.txt","/var/www/straped/mufon/org/45975.html"],"Region":"Oklahoma","Disposition":"Unresolved"}