{"files":["/var/www/straped/mufon/html2text/45979.html.txt","/var/www/straped/mufon/org/45979.html"],"City":"Hamilton","Case Number":"45979","Object Shape":"Flash","trends":["There have been 8 other sightings in Hamilton","There were no other sightings in Hamilton on or around February 28th 2013"],"Tags":"City","Summary":"Like fireflies glistening on and off- at least 30 of them- just white flickers all over the sky","Country":"United States","Sighting Duration":"Undisclosed","Longitude":"-98.256978","Weather Factors":"Unknown","Latitude":"31.770465","Region":"Texas","Object Flight Path":"Unknown","Source":"MUFON","divs":["Sighting Details Do not know if we caught on video yet- just wanted to ask if any military training exercises going on last night around 9:15-9:45 ish Feb 28th, 2013. Perhaps jets flying in the dark and then blinking white lights everywhere- started out as 3 or 4 then they were flashing everywhere just like you would see fireflies in the night- all over the sky 5 to 15 degrees from the horizen- no set form.many of them, too numerous to count, but approx 30 or more. lasting approx 20 minutes stopped and then started again about 10 minutes..amazingly beautiful to watch..perhaps jet pilot training? Could not see outline of any object although some blinking lights seemed to form some shapes, but unsure. Just want to know if you know of any training exercises being performed by the military. Did hear airplane jet sounds, but also saw planes flying over at some points. 3 witnesses.. PLEASE get back with me if this can be explained... or not. I'm a sky wathcer- was watching the space station fly overhead when noticed this- never seen anything like it before. just very curious!!! ;-)"],"Date Submitted":"03/01/2013 12:19 UTC","Disposition":"Unresolved","Date of the Event":"02/28/2013 09:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=31.770465,+-98.256978(45979)&iwloc=A&hl=en\"> mufon case (45979) map </A>","Viewing Distance":"Over One Mile","Object Features":"None","Log Number":"US-03012013-0004"}