{"Date of the Event":"03/25/2006 10:30 UTC","Date Submitted":"03/25/2006 10:30 UTC","Object Flight Path":"Other","Source":"MUFON","Country":"United States","City":"Lafayette","Disposition":"Insufficient Data","Object Shape":"Other","Viewing Distance":"Unknown","Latitude":"40.416702","Region":"Indiana","Sighting Duration":"00:02:00","trends":["There have been 30 other sightings in Lafayette","There were no other sightings in Lafayette on or around March 25th 2006"],"divs":["Sighting DetailsIt was approximately 10:30pm on saturday March 25th, I was driving home from work at which my shift ended at 10pm and it takes 15-20 min to drive home. I turned off of SR43 onto SR225 and about 3 orange lights in the sky directly ahead and above me caught my attention. They were kind of yellow-orange like a yellow traffic light and approximately the size of pea at arms length (approx 1cm in visual size). The lights did not seem to be moving except that the one left would fade out and then reappear on the right of the two remaining lights. Then the one that was now the left most light would fade out and thusly reaapear on the right of the two remaining lights. I observed this for approximately 1 min while in the vehicle, and I turned into my driveway and hopped out of my vehicle to observe them for about 30sec to 1min more, but I lost line of sight to them as they moved behind the tops of the tree line across the street. Which was approximately in a westerly direction. I was not sure what the lights were and was quite confused by them. When I got into the house I described what I had seen to my room mate and his mother who have been around airplanes all their lives as her husband was a flight engineer, because I was not sure what I had seen. They, being very skeptical of what I described, thought it was the lights on a plane at a strange angle to me but I was sure they were wrong. On the following wed night he and his mother both observed the same lights in the sky as I did, and they too at this point were positive that it was not an airplane of any kind."],"Weather Factors":"Unknown","Summary":"Yellow lights in the sky","Longitude":"-86.875287","Log Number":"US-03312006-0001","Case Number":"4597","map":"<A HREF = \"http://maps.google.com/maps?q=40.416702,+-86.875287(4597)&iwloc=A&hl=en\"> mufon case (4597) map </A>","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/4597.html.txt","/var/www/straped/mufon/org/4597.html"],"Tags":"City"}