{"Country":"United States","Date Submitted":"03/01/2013 11:38 UTC","divs":["Sighting DetailsI was walking a few laps around where I work, a beautiful day with a spotless blue sky, I was purposefully looking at the blueness of the sky when I noticed a small, white sphere sitting motionless at a 40 degree angle up and seemed about 100-300 feet away. The distance was hard to measure since it was such a clear sky. My initial reaction was I gotta get my phone out, this is not normal. When I first spotted it, I didn't take my eye off it for 4-5 seconds, then I looked away and quickly looked back like when you are staring at a plane way up in a blue sky, then look away and look back to see if you can find it again. I spotted it again, it was only about the size of a BB held at arm's length, maybe a little smaller, seemed to be in the same spot, this time I only looked at it for say 2 seconds, because a co-worker on his phone was just coming around the corner of the building about 50 feet away, and I was going to walk over to him and point it out. I looked back to the object, it was gone..total observation time was about 7-8 seconds. What struck me the most was how odd it looked being completely motionless, static in the sky , not a normal thing to see. There was a highway overpass filling the lower half of my view so I can confidently say it was motionless."],"City":"Torrance","Object Shape":"Sphere","Log Number":"US-03012013-0010","Date of the Event":"02/01/2013 12:00 UTC","Latitude":"33.845659","Source":"MUFON","Viewing Distance":"101-500 Feet","Disposition":"Unresolved","Longitude":"-118.331489","map":"<A HREF = \"http://maps.google.com/maps?q=33.845659,+-118.331489(45985)&iwloc=A&hl=en\"> mufon case (45985) map </A>","Object Features":"None","Region":"California","files":["/var/www/straped/mufon/html2text/45985.html.txt","/var/www/straped/mufon/org/45985.html"],"Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Tags":"City","Summary":"I was standing alone outside sunglasses on saw a small white sphere motionless","Weather Factors":"Unknown","trends":["There have been 16 other sightings in Torrance","There were no other sightings in Torrance on or around February 1st 2013"],"Case Number":"45985"}