{"Source":"MUFON","Tags":"City","Longitude":"-123.064828","map":"<A HREF = \"http://maps.google.com/maps?q=43.800729,+-123.064828(45989)&iwloc=A&hl=en\"> mufon case (45989) map </A>","City":"Cottage Grove","trends":["There have been 2 other sightings in Cottage Grove","There were no other sightings in Cottage Grove on or around March 1st 2013"],"files":["/var/www/straped/mufon/html2text/45989.html.txt","/var/www/straped/mufon/org/45989.html"],"Date Submitted":"03/02/2013 04:46 UTC","Weather Factors":"Unknown","Object Shape":"Triangle","Summary":"At 10:10pm on 3-1-13, I and my family saw 3 orange lights in the sky that were in a triangular pattern or part of a singular object.","Sighting Duration":"Undisclosed","Log Number":"US-03022013-0004","Latitude":"43.800729","Date of the Event":"03/01/2013 10:10 UTC","Viewing Distance":"501 Feet - 1 Mile","Case Number":"45989","Object Flight Path":"Hovering then path","Object Features":"Unknown","divs":["sighting detailsi, allen perkins, my daughter olivia and son jackson arrived home at approximately 10:10pm on 3-1-13. we saw 3 orange lights in the sky that were in a triangular pattern or part of a singular object. it was a foggy\\cloudy evening with low clouds moving through and occasional glimpses of clear sky. the lights were hovering over west cottage grove, appearing to be over the river road area or bohemia elementary school. they appeared to be 600yds to 1 mile away and not extremely high in the sky (low on horizon). upon exiting our car we all saw the lights and immediately recognized them as a ufo or multiple ufo's. i tried to video it, but it lasted only 20 to 30 seconds and i couldn't take my eyes off it long enough to properly run my iphone camera. the southeastern-most light dissappeared first and then 5 seconds later the other 2 went out almost simultaneously. it appeared as though the cloud was engulphing them, but it blew through in a few seconds and the lights were gone. my 14 year old daughter had retreated almost immedietly into our house, as she was very frightened by the sighting. we all told my wife what we had seen, grabbed my nephew, and then we all jumped back in our car and went out to look for it again...no such luck."],"Country":"United States","Disposition":"Unresolved","Region":"Oregon"}