{"Object Shape":"Unknown","divs":["Sighting DetailsI never expected I would be doing this but as it has me a little disturbed, I will do my best to explain it adequately. I was in my room, I couldn't sleep and was thinking about getting up and reading or watching a movie, just laying there considering. I first noticed the noise, close but what threw me off is that I hadn't heard it approaching. I had NO idea what this was when I first heard it, I was just as baffled from the beginning as I was at the end of this experience. When I first heard it, it sounded above the house. A kind of humming, that doesn't really describe it, but it's the best I have. It would seem to move around the town, sometimes closer, sometimes further off. I felt startled and worried, not really scared at first as I thought looking out a window would shed light on whatever this was and surely it would be something logical. However, I looked out every window and continued to see nothing. I could hear it but not see it. Then I was a bit frightened. My dogs were going crazy the entire time. Plus through-out the day, one of them, that rarely barks, every time I have let him outside, he has run the perimeter of the fence, barking his head off. Towards the end of this sightings I started feeling a little \"fuzzy\" for lack of a better term. Today I am nauseous and somewhat shakey.(I should have checked \"physical\"). I am definitely confused as to what this was. This lasted about an hour, maybe a little over. At least that is when I stopped hearing it."],"Sighting Duration":"Undisclosed","Region":"Minnesota","Tags":"City","Disposition":"Unresolved","Viewing Distance":"Unknown","trends":["There have been no other sightings in Kellogg","This sighting has never been favorited."],"Weather Factors":"Unknown","Object Features":"Unknown","Summary":"\"Mechanical\" Sounds Heard, Nothing Like Experienced Before","Latitude":"44.322203","Case Number":"45996","Date of the Event":"03/02/2013 02:40 UTC","City":"Kellogg","Source":"MUFON","Longitude":"-91.9871","Date Submitted":"03/02/2013 06:01 UTC","Log Number":"US-03022013-0010","map":"<A HREF = \"http://maps.google.com/maps?q=44.322203,+-91.9871(45996)&iwloc=A&hl=en\"> mufon case (45996) map </A>","files":["/var/www/straped/mufon/html2text/45996.html.txt","/var/www/straped/mufon/org/45996.html"],"Country":"United States","Object Flight Path":"Path with directional change"}