{"Longitude":"-121.738874","Summary":"red light traveling SILENTLY at visible altitude","trends":["There have been 8 other sightings in Davis","There were no other sightings in Davis on or around February 28th 2013"],"Object Shape":"Boomerang, Sphere, Star-like","Log Number":"US-03022013-0005","map":"<A HREF = \"http://maps.google.com/maps?q=38.55227,+-121.738874(45990)&iwloc=A&hl=en\"> mufon case (45990) map </A>","City":"Davis","Source":"MUFON","Tags":"City","Latitude":"38.55227","Date Submitted":"03/02/2013 05:12 UTC","Disposition":"Unresolved","Case Number":"45990","Sighting Duration":"Undisclosed","Object Features":"Unknown","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path","Region":"California","Date of the Event":"02/28/2013 08:27 UTC","divs":["sighting detailsa very clear night with many stars. going out to my car with girlfriend when i noticed a red light in the sky traveling steadily across the sky from the north east ending at the south east skies... it was traveling at constant rate against the backdrop of stars. its shape was star like (sphere), but at one point, when it was closest to my position i suppose, i saw what seemed to be a boomerang like shape to it, like the logo used for star trek. what struck me as very odd is that it was very visible while traveling, yet it made absolutely no sound. eventually the light dimmed after about 4 mins and disappeared. i am not claiming its anything in particular, it just struck me as odd considering airplanes tend to have a white\\blue\\red light combination and make sound as they pass by.. this did not. there was only red light, nothing else. the only reason i noticed the object was because its red light was way brighter than the backdrop of stars, and it was literally red in hue. i am a very critical individual (pre-law), and from the beginning i could think of what would cause this. i looked at it mesmerized for about 4 mins until it disappeared... i could seem to break eye contact with it, as it was very novel. i watched it until i saw it disappear into the dark sky. i eliminated an airplane\\helicopter as it was too low and yet no sound came from it. plus, its velocity seemed extremely smooth... its as if a bubble was floating in the air you know? also, the brightness of the light as it approached was just as bright as when it was passing and at a distance until disappearing. it was too slow to be a shooting star or meteorite. plus, those tend to leave a trail of light of some sort; this did not. note: nothing else was in the area; no air planes, no helicopters, no balloons. its trajectory could have only been caused by thrust\\propulsion."],"files":["/var/www/straped/mufon/html2text/45990.html.txt","/var/www/straped/mufon/org/45990.html"],"Weather Factors":"Unknown"}