{"Summary":"Single White Star like circle followed by appearance of 4-5 similar objects close to original","City":"Phoenix","Viewing Distance":"Unknown","Log Number":"US-03022013-0013","Longitude":"-111.996584","Date Submitted":"03/02/2013 08:42 UTC","Latitude":"33.424861","Weather Factors":"Unknown","Source":"MUFON","divs":["Sighting DetailsLaying on back at pool on a mostly clear blue sky day I noticed a small white circle shaped object almost straight up slightly to the North. Nothing else in area and looked the distance of what a star might look like. It was completely stationery and did not seem to move as I was using a palm tree to measure if it was moving. I passed it off as a planet off the reflection of the sun. I pointed it out to my girlfriend, who picked it up and noticed several more white dots appear around vicinity of first object. We counted 4-6 more that appeared for only a couple of minutes than disappeared only to leave the original object. The objects that appeared looked to be moving but I can not be sure but they only appeared for a short time than faded out. A commercial jet at altitude flew nearby heading north and to the west of the white dots, which looked easily twice the height or more than the jet which was at around 35,000 ft. Eventually the object faded off to the east and some very light cloud cover began to block view."],"files":["/var/www/straped/mufon/html2text/45998.html.txt","/var/www/straped/mufon/org/45998.html"],"Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=33.424861,+-111.996584(45998)&iwloc=A&hl=en\"> mufon case (45998) map </A>","Object Features":"Unknown","trends":["There have been 417 other sightings in Phoenix","There was one other sighting in Phoenix on or around March 2nd 2013"],"Date of the Event":"03/02/2013 04:45 UTC","Object Shape":"Circle, Sphere","Country":"United States","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Case Number":"45998","Tags":"City","Region":"Arizona"}