{"Disposition":"Unresolved","Sighting Duration":"00:00:15","Case Number":"46000","Source":"MUFON","Weather Factors":"Unknown","trends":["There have been 151 other sightings in San Diego","There were 2 other sightings in San Diego on or around March 1st 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.719819,+-117.153455(46000)&iwloc=A&hl=en\"> mufon case (46000) map </A>","Country":"United States","Object Features":"Wings","Longitude":"-117.153455","Viewing Distance":"Over One Mile","divs":["Sighting DetailsWas in a friend's back yard in Point Loma, San Diego enjoying the warm evening. First noticed, out of the corner of my eye, a moving object that appeared orange in color and very similar to visible stars in brightness. Object moved in a straight line in a SW direction but too slow and steady to be a meteor and too fast to be a satellite or airplane. It never burnt out like a meteor. Checked the position of the ISS and it wasn't nearby; it also wouldn't appear to move in the SW direction from our position. It covered overhead to horizon in about 15 seconds and was visible for some time on the horizon (at least another 15 seconds). My friend said she saw that it looked to have a wing shape but I just saw a dot shape. Just as we were discounting this as something like a meteor or satellite I noticed something else moving in my field of view. We both looked up to see a boomerang or flying wing shaped craft (it was large enough to see the wing shape in good detail) pass silently overhead moving at great speed in complete silence. The craft appeared to me to be glowing slightly orange and to my friend to have a generally white glow with illuminating lights. The direction of travel was similar to the star-like object in that both seemed to move towards the same point in the sky. The total time from overhead until it faded from view on the horizon was maybe 15 seconds. At other times that evening there were other commercial aircraft operating in the area that were moving at a mere fraction of the speed of this object (and not silently). There were no aircraft overhead overhead at the time of the sighting. The winged object and the earlier star-like object appeared to move 20-30x faster than the commercial aircraft. The speed (and lack of sound) was the most startling aspect. I've seen a lot of aircraft and this escapes explanation. It felt as if it wasn't material since it was so quiet and unbelievably fast but we both saw it clearly. A very strange experience to see something that doesn't follow the rules of everyday objects."],"City":"San Diego","Log Number":"US-03032013-0002","Summary":"Two sightings about 10 minutes apart: first a star-like object flew over to horizon, then a wing-shaped object in the same direction","Latitude":"32.719819","Tags":"City","Object Shape":"Boomerang","Object Flight Path":"Straight-line path","Date of the Event":"03/01/2013 11:30 UTC","Date Submitted":"03/03/2013 02:07 UTC","Region":"California","files":["/var/www/straped/mufon/html2text/46000.html.txt","/var/www/straped/mufon/org/46000.html"]}