{"Date Submitted":"03/03/2013 09:07 UTC","Longitude":"-109.910567","Source":"MUFON","files":["/var/www/straped/mufon/html2text/46007.html.txt","/var/www/straped/mufon/org/46007.html"],"Region":"Baja California Sur","Latitude":"22.900233","Disposition":"Unresolved","Object Flight Path":"Path with directional change","City":"Cabo San Lucas","Summary":"Orbs","Country":"Mexico","Tags":"City","Object Shape":"Circle, Fireball","Date of the Event":"11/19/2012 12:00 UTC","Sighting Duration":"Undisclosed","divs":["sighting detailswe were at the riu palace los cabos mexico. we saw 4 orbs come in from the ocean on the 17th of nov 2012 . they hovered off the beach and disappeared into the distance. my wife and i put it down to that they where flares from a ship.two days later we were sitting on our room balcony and witnessed two glowing orbs swooping over the hotel descending and heading south over the ocean. over the hotel they where white in colour and as they flew away they became orange to dark orange in the far distance. i asked hotel stff the next day if anyone had seen the same thing and no one would talk about it. i found another tourist if he had seen anything. he said he saw the four orbs come in from the distance flying north to the hotel hover and disappear to the south. i and my wife did not feel threatened we actually felt kind of peacefull like they were angels. while we witnessed the two orbs we had enough time to discuss that it was not an airplane we discuss that ther was no noise.we talked a lot while we whatched them almost like time slowed down. [name removed\\cms\\tg]"],"trends":["There have been 10 other sightings in Cabo San Lucas","There were no other sightings in Cabo San Lucas on or around November 19th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=22.900233,+-109.910567(46007)&iwloc=A&hl=en\"> mufon case (46007) map </A>","Viewing Distance":"101-500 Feet","Object Features":"None","Log Number":"MX-03032013-0009","Case Number":"46007","Weather Factors":"Unknown"}