{"City":"Phoenix","Disposition":"Unresolved","Object Flight Path":"Other","Object Features":"None","Weather Factors":"Unknown","Object Shape":"Circle","Date of the Event":"03/02/2013 09:26 UTC","Longitude":"-112.106367","Sighting Duration":"Undisclosed","Region":"Arizona","map":"<A HREF = \"http://maps.google.com/maps?q=33.571154,+-112.106367(46006)&iwloc=A&hl=en\"> mufon case (46006) map </A>","Latitude":"33.571154","divs":["Sighting DetailsMy family was outside playing cards when my 22 year old son exclaimed \"what is that wierd light?\" we observed a blue glowing light in the sky at a NW direction, where a small airport is. You could see the white lights of planes coming and going, but this blue glow light would alternate with a smaller RED light, like a police helicopter. Then the blue light would be back on, sometimes dim, sometimes very bright and big. I thought it was a helicopter except there were no other running lights, and the light would bob up, go out, reappear lower, get brighter and move in a flight path, dim out, red light would come on, then blue light again and this happened in a random pattern. Eventually it seemed to head north and dissapear into the horizon. It was at a distance and we watched for a good 7 minutes. Very strange. We see Police helicoptors ALL the time, and this did not behave like one, and the blue light was very strange color. Sometimes it was very bright and large, sometimes dim. Police choppers do not do that. AND typically, if they are circling, their spot light is on and shining down. This had no such light. Wierd. My wife tried to film it on her android phone, but it didn't turn out very good."],"Viewing Distance":"Unknown","Case Number":"46006","Log Number":"US-03032013-0008","files":["/var/www/straped/mufon/html2text/46006.html.txt","/var/www/straped/mufon/org/46006.html"],"Summary":"Blue light, GLOWING! with Red Light center or alongside. Red was pinpoint. Blue was like NEON. Fluttered flight path","trends":["There have been 417 other sightings in Phoenix","There was one other sighting in Phoenix on or around March 2nd 2013"],"Source":"MUFON","Date Submitted":"03/03/2013 04:31 UTC","Tags":"City","Country":"United States"}