{"Disposition":"Unresolved","Weather Factors":"Unknown","Log Number":"CA-03042013-0001","Country":"Canada","Date of the Event":"07/10/2012 10:05 UTC","files":["/var/www/straped/mufon/html2text/46016.html.txt","/var/www/straped/mufon/org/46016.html"],"Object Shape":"Blimp, Egg","Date Submitted":"03/04/2013 02:29 UTC","Case Number":"46016","Object Flight Path":"Stationary","Longitude":"-103.782955","Tags":"City","trends":["There has been one other sighting in Fort Qu'Appelle","There were no other sightings in Fort Qu'Appelle on or around July 10th 2012"],"Summary":"It was a large object that rose up about 10m,higher in front and moving foward slightly,then back,higher behind,then up and gone","Source":"MUFON","divs":["Sighting DetailsI was on my way home from dropping off my wife and kids at grandmas house,it was slightly foggy out when I noticed a slight pulsing reddish glow in the fog. Thinking it was brake lights from a semi ahead of me,I didn't really think much of it. Now the lights were more brighter and seemed strange as the glow came through the fog. All of a sudden there was a clearing and there was this huge red glowing pulsing object that seemed to be blimp shaped. There was a black or dark spot on the back side of it. It's front end lifted slightly,then it raised up about ten meters or more as it moved slightly foward. Then the back end raised slightly as it moved backwards raising up another ten meters or so. This object had to be massive because it was over 150ft from the road,and I was doing about 110kph and I seemed to watch it for at least 20 seconds,glancing back at the road in front of me to avoid an accident as there were vehicles in front of,and behind me,at least seven vehicles in a row. I just wished I had my cell-phone,or iPod with me at the time. The last time I had turned to look,it was already gone. I know that there had to be at least 3 other people who had seen it,and one that probably saw it take off. I have never been so scared in my life. I've never seen anything like that before,and it was huge. I always carry an iPod,cell phone and sometimes an HD camcorder now. If I ever get a chance to video something like this again,I will let you know."],"Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=50.768051,+-103.782955(46016)&iwloc=A&hl=en\"> mufon case (46016) map </A>","Region":"Saskatchewan","Latitude":"50.768051","Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","City":"Fort Qu'Appelle"}