{"Date of the Event":"03/03/2013 06:46 UTC","Date Submitted":"03/03/2013 11:19 UTC","Source":"MUFON","Region":"Washington","Tags":"City","Country":"United States","divs":["Sighting Details My mate and I stepped out the front of our house for a smoke. I stepped further out into the yard to fully view Betelguise, Orion and Jupiter, when a large white object, as big and as bright as Jupiter went overhead about 5 to 8 degrees West of Jupiter heading due South. I pointed it to my mate and we both observed it for over 20 seconds. We both exclaimed, \"What is THAT?\" It stayed at full brightness for about 12 seconds, then dimmed to the same as a bright star, but did not fade further from that brightness. We both observed it for aproximately 40 degrees of travel before trees to the South obscured the view. At one point it passed over a small cloud wich momentarily blocked it, then reappeared on the other side of it travelling in the same straight line. It was shortly after sundown. The object paralleled the western horizon. Both my mate and I have observed the ISS (always travelling W to E) and in comparison, this object appeared both larger and faster. My immediate reaction was that we were seeing something quite unusual, as to my knowledge and experience- satellites do not travel North to South, only West to East. Yet, in less than a year, I have observed two similar objects travelling South to North, again not a known satellite trajectory. On was reported to MUFON for sure, but I may have to find notes to report the more recent of the two. It seems we are seeing unusual things in the skies over Seattle much more frequently. Considering that we've had cloud cover 80 and even 90% percent of the time here in Western Washington, I wonder what we might be going on above those clouds that we've missed."],"Case Number":"46013","map":"<A HREF = \"http://maps.google.com/maps?q=47.719619,+-122.322306(46013)&iwloc=A&hl=en\"> mufon case (46013) map </A>","Log Number":"US-03032013-0015","Viewing Distance":"Unknown","City":"Seattle","Weather Factors":"Unknown","Summary":"Jupiter sized object travelling N to S at high speed","Sighting Duration":"00:00:21","Object Shape":"Sphere","Latitude":"47.719619","trends":["There have been 110 other sightings in Seattle","There were no other sightings in Seattle on or around March 3rd 2013"],"Object Flight Path":"Straight-line path","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/46013.html.txt","/var/www/straped/mufon/org/46013.html"],"Disposition":"Unresolved","Longitude":"-122.322306"}