{"files":["/var/www/straped/mufon/html2text/46026.html.txt","/var/www/straped/mufon/org/46026.html"],"Object Shape":"Fireball","Weather Factors":"Unknown","divs":["Sighting DetailsThis is difficult for me. I told someone once before and they scoffed at me. It was only after watching the Reed family story did I feel compelled to submit this. It was early in the morning. I cannot remember the exact year. But I recall waking up to a bright glow coming through the curtains of my bedroom that face north. I was only 4 or 5 years of age. I went to the window and saw a large fireball hovering in the backyard. I remember thinking it was the sun...I was so young so what did I know. This light pulsated and it frightened me so I ran back to my bed. I cannot recall how long after but the light went away but I stayed awake frightened looking at the window with the curtains open. All of sudden a figure appeared, that to me as a child, looked like Spiderman. I only saw the face and head. It moved across the window, looked in and that is the last I recall. That morning I remember running downstairs to my mother and telling her I saw Spiderman. The figure looked like a praying mantis but to me it was Spiderman. She laughed and told me I was dreaming. I insisted I was not and I recall being upset and confused at that. For days after I had a hard time going to bed. I cannot believe I am sharing this but I feel good that the story is now told."],"City":"Mississauga","Date of the Event":"06/01/1977 12:00 UTC","Summary":"What I thought was spiderman","Sighting Duration":"Undisclosed","Viewing Distance":"21-100 Feet","Source":"MUFON","Disposition":"Unresolved","Tags":"City","Object Flight Path":"Hovering then path","Date Submitted":"03/04/2013 05:09 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.594195,+-79.63949(46026)&iwloc=A&hl=en\"> mufon case (46026) map </A>","Case Number":"46026","Log Number":"CA-03042013-0010","Latitude":"43.594195","Country":"Canada","Region":"Ontario","Longitude":"-79.63949","trends":["There have been 20 other sightings in Mississauga","There were no other sightings in Mississauga on or around June 1st 1977"],"Object Features":"Unknown"}