{"files":["/var/www/straped/mufon/html2text/46022.html.txt","/var/www/straped/mufon/org/46022.html"],"Object Shape":"Circle, Oval, Sphere, Other","Country":"Canada","Region":"Ontario","Object Flight Path":"Hovering then path","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.144847,+-79.880348(46022)&iwloc=A&hl=en\"> mufon case (46022) map </A>","Summary":"Round or hexagonal object. Various coloured pulsing lights. No sound. Quite close at times. Occassional sightings, I have video.","Case Number":"46022","City":"New Tecumseth","Object Features":"Other","divs":["Sighting Details This is something I see on an ocassional basis. I view it from my property. I see it more often in the summer because I sky watch more in the warm weather. My two closest sighting were in cold weather though. Once in the early spring of 2012 and in November of 2012. I was able to get good video on both these ocassions. When I first noticed the object I thought it was some kind of satalite. It made a great target for my telescope. But then I notced that it wasn't moving in an orbit. It would change altitudes, speed, course and sometimes there were two or three of them close together. Eventually the object would just move out of sight or dissappear. One night I saw small orange balls coming out of one. I only have a basic digital camara so I was only able to get decent video when it has been quite close. It appears to be hexagonal to round in shape. It pluses with various coloured lights. No sounds. I watched Alien Mysteries on March 10th. I was shocked yet relieved that someone else is seeing what I am seeing. I also live near an air force base. I have reported it to them but I was ignored. About a year ago I reported this to another UFO investigation site. They concluded it was unknown. That was all the response I got. I had linked up my computer with theirs so I could load up video that was too large to send by email. Shortly after that, I got a strange phone call. Shortly after that, the videos dissapeared from my computer. An I.T. tech told me that if someone with authority got my IP address, they could access my computer. Forunately since then, I have had a couple of close sightings. I got more video, and I made hard copies this time. So I could keep them safe."],"Tags":"City","Sighting Duration":"Undisclosed","Date of the Event":"04/14/2012 12:00 UTC","Longitude":"-79.880348","Disposition":"Unresolved","Date Submitted":"03/04/2013 11:04 UTC","Latitude":"44.144847","Source":"MUFON","Log Number":"CA-03042013-0006","trends":["There has been one other sighting in New Tecumseth","There were no other sightings in New Tecumseth on or around April 14th 2012"],"Weather Factors":"Unknown"}