{"Viewing Distance":"Unknown","Date of the Event":"09/09/2012 12:00 UTC","Latitude":"41.780566","map":"<A HREF = \"http://maps.google.com/maps?q=41.780566,+-80.851679(46025)&iwloc=A&hl=en\"> mufon case (46025) map </A>","files":["/var/www/straped/mufon/html2text/46025.html.txt","/var/www/straped/mufon/org/46025.html"],"City":"Austinburg","Source":"MUFON","Summary":"Observed lights while traveling east bound on rt.307","Region":"Ohio","Log Number":"US-03042013-0009","Object Shape":"Star-like","divs":["sighting detailsi was driving to pyumatuning lake to do some late night fishing traveling east on rt.307 through austinburg ohio where the local festival austinburg days was being held. i first noticed the bright red lights over the tree tops apx.3\\4 west of austinburg and attempted to follow the lights while driving east.i attempted to find a parking spot to observe the lights and drove past the intersection of rt.307 and rt.45 and lost sight of the lights at that time apx.1\\4 mile east of the intersection. as far as i can recall the lights were bright red and neither flickering or pulsating.they appeared to fade\\disappear into the clouds. they were formed in a reverse horse shoe formation and did not switch nor change positions as i observered them. i did briefly lose sight of the due to tree tops and local lights.but did follow them as stated earlier. i do not believe they were flares nor aircraft as the lights did not blink nor pulse as flares or aircraft would do. i did not know at first what the lights were and to this day am not sure what they were,but as far as i can say they were not any known aircraft."],"Tags":"City","Longitude":"-80.851679","Case Number":"46025","Country":"United States","Weather Factors":"Unknown","Disposition":"Unresolved","Object Features":"Unknown","Date Submitted":"03/04/2013 04:35 UTC","trends":["There have been 2 other sightings in Austinburg","There were no other sightings in Austinburg on or around September 9th 2012"],"Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path"}