{"City":"Oakdale","Disposition":"Unresolved","trends":["There have been 7 other sightings in Oakdale","There were no other sightings in Oakdale on or around March 3rd 2013"],"Longitude":"-120.845894","map":"<A HREF = \"http://maps.google.com/maps?q=37.774255,+-120.845894(46028)&iwloc=A&hl=en\"> mufon case (46028) map </A>","Country":"United States","Tags":"City","Object Shape":"Triangle","Date Submitted":"03/04/2013 07:12 UTC","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Latitude":"37.774255","Weather Factors":"Unknown","Case Number":"46028","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Log Number":"US-03042013-0012","Summary":"Witness black, triangular shape in sky, hovered 8 min then made quick short turn right, then left and disappeared.","Object Features":"Unknown","Source":"MUFON","divs":["Sighting DetailsAt approx. 4:15pm PST, I was sitting outside in backyard with family. My neighbor was in his backyard and interrupted us, asking us to look at the thing in the sky. He was looking through his binoculars at a black object. I looked through the binoculars and saw what appeared to be a black, triangular shaped object. It did not appear to be moving but hovering. Hard to be sure as it was really far away. My husband estimated it to be about 5 miles up. The binoculars shake a bit when you are looking through them so, it's up for debate as to whether the movement of the object was from the shaking of my hands, or the movement of the object itself. The neighbor said he had been watching it hover for about 5 min. My father, two daughters and my husband all witnessed this as well, with eyes and binoculars. I then went into the house to look for my telescope, hoping to gain closer viewing access; this took another 2 min. I could not locate the object through the telescope ( I think I just kept picking the wrong size lense!). I looked again through the binoculars and it was still hovering, then all of a sudden it turned clockwise slightly, flew to the right slightly, then quickly flew off to the left in a straight line, and was gone. I am trying to find a reasonable explanation for what this object was. It did not look like an airplane (B52 for example, as some have hinted). There were no lights that we could see or any sort of reflection either."],"files":["/var/www/straped/mufon/html2text/46028.html.txt","/var/www/straped/mufon/org/46028.html"],"Region":"California","Date of the Event":"03/03/2013 04:15 UTC"}