{"Tags":"City","Date of the Event":"03/04/2013 11:10 UTC","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Longitude":"-80.427979","Source":"MUFON","Disposition":"Unresolved","Case Number":"46023","Summary":"shining silver w light semi round","Date Submitted":"03/04/2013 12:19 UTC","Object Flight Path":"Straight-line path","Country":"United States","files":["/var/www/straped/mufon/html2text/46023.html.txt","/var/www/straped/mufon/org/46023.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=25.677328,+-80.427979(46023)&iwloc=A&hl=en\"> mufon case (46023) map </A>","Log Number":"US-03042013-0007","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Latitude":"25.677328","trends":["There have been 97 other sightings in Miami","There were no other sightings in Miami on or around March 4th 2013"],"divs":["Sighting DetailsOn March 4, 2013 around 11am I was walking my dog around the block. As I walking my dog I looked up at the sky and I saw an object in which I thought it was a balloon floating in the air. I was like ohhh a balloon is flying and I kept looking at it and noticed it could not be a balloon because a balloon does not float horizontally. A balloon goes up straight into the air in a slanted form. I kept looking at it in which I saw was a very shiny SILVER COLOR with a white light maybe unless it was the sns's reflection on it but it was a very SILVER SHINY color and the shape was not round it was like SEMI ROUND and I would say bigger than a balloon ***keep note*** it was at a distance I saw this so I do not know the exact shape. As I kept looking at it maybe 15 to 20 seconds floating southbound it slowly started to fade itself. Little by llittle it started fading itself and vanished. There were no airplanes in site. I only saw black birds flying but they were maybe 50 feet from me and lower than the object but not far I would say in the middle flying . The distance from that object was lower than a air plane. It would be kind of like when a helicopter hovers over but floating slowly and quietly with no noise. It just faded little by little and vanished. I looked and looked I could not find it anywhere in the sky it just vanished. MY feeling were it must be a UFO because it could not be a airplane because a airplane makes noice and it was not shaped as a airplane it was semi roundish. I thought to myself, it mush be a UFO. I have heard people say they have seen objects in the sky and they vanished and my nephew and his sisters boyfriend also told me a story when they were out one night at their home how they saw a red light or something and they claim they believe they saw a UFO . I figured this has to be a UFO to fade away little by little and vanish floating in a straight line slowly. Something is out there. I did not have my cell phone with me or I would have had taken a picture. But there was no one aorund me during the time I was walking the dog in my neighborhood. The object was not far I do know there is a school beside me dont know if anyone there saw it. Again, I did not lose site of it. The object faded little by little and vanished itself."],"Object Shape":"Circle, Unknown","Object Features":"Other","City":"Miami","Region":"Florida"}