{"files":["/var/www/straped/mufon/html2text/46031.html.txt","/var/www/straped/mufon/more/46031_submitter_file1__UFOsightingreferrenceimage.jpg","/var/www/straped/mufon/org/46031.html"],"Log Number":"US-03042013-0015","Case Number":"46031","Country":"United States","Summary":"UFO In Sullivan Indiana","Date of the Event":"03/04/2013 05:30 UTC","Date Submitted":"03/04/2013 09:59 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.102999,+-87.435248(46031)&iwloc=A&hl=en\"> mufon case (46031) map </A>","trends":["There have been 2 other sightings in Sullivan","There were no other sightings in Sullivan on or around March 4th 2013","This sighting has never been favorited.",""],"Latitude":"39.102999","divs":["Sighting DetailsJust had gotten our order from Hardee's Restaurant and sat down. 3 or 5 minutes later I watched a single prop plane fly by in the west side window of the restaurant at an altitude of about 150-200 feet flying NNW and most likely headed for Sullivan County Airport. It appeared to be flying extremely slow. Thinking in my own mind it had a head wind while assisting in the planes lift, which I watched this plane for about 30-40 seconds. Then about 2 or so minutes later I decided to look out the window again thinking I may see the plane still and caught a view of a white color glowing object just above the tree line over a field from my position and was further away compared to the plane that had passed by (I could almost make out the pilot in the plane). The object headed due West from advantage point in a slow pattern and suddenly headed down toward the deck at about a 10 degree angle behind the tree line and that's when I lost view of the object. All this took is about 15-25 seconds and I wasn't able to clear my head enough to take a picture with my phone. I wanted to yell out in the restaurant about what I was seeing, but thought otherwise. I didn't want complete strangers to look at me like I was some sort of a nut. That's it nothing glorious, but it certainly did not look like a plane. I have never seen a plane glow like that in broad daylight and I have been viewing air crafts of all kinds on military bases around the world for a better part of my life. Other Note: I attempted to contact the Sullivan Airport control tower, but they do not have one."],"Sighting Duration":"Undisclosed","Longitude":"-87.435248","Object Flight Path":"Hovering then path,Path with directional change","Disposition":"Unresolved","Viewing Distance":"Over One Mile","Object Shape":"Oval","City":"Sullivan","Weather Factors":"Unknown","Source":"MUFON","Object Features":"None","Region":"Indiana"}