{"Region":"California","Weather Factors":"Unknown","Longitude":"-122.280247","Date Submitted":"03/05/2013 05:01 UTC","divs":["sighting detailsill never forget as long as live . it was 5:52 pacific standard time. i was taking my 9 year old daughter to a softball sleepover party in the foothills of kensington. a small town north of berkeley about a 1&1\\2 miles from my house. it was dark, and raining, the first big storm of the winter. i was listening to espn radio discuss if cowboys qb romo can win in december. i had just charged my camera phone and was unplugging it from the lighter to call to get directions, as it was the first time i was going to my daughters teammates house . i had inadvertedly driven a couple of streets off course(they are all named after ivy league colleges in that area). if i would have turned right i never would have noticed the ufo but i kept strait going east up the hill. the street has a small bend going north, then another going east. as i finished going through the bend heading east i noticed a cylinder beam of white light coming thru a large pine tree with part of the light on the side of a large shingled two story house. the tree stood maybe 15 at most from the house maybe a little over a hundred feet tall. that instant, simultaneously following the light to its origin i said out loud to my daughter, \"what kinda helicop.....what the f... is that!?. my daughter and i were looking at what i can only compare to the romulin bird of prey in star trek. im not a trekky, but i know what the bird of prey looks like from plastic models and tv. as i turned of my lights the all black spacecraft turned of its beam and then i noticed the red glow coming thru 4-6 triangle shaped viewing windows that were front of a triangle patterned hexagonal cockpit stationed slightly below the middle of the cockpit . i looked for aliens but at my angle could see nothing, then the ship went dark completely. it was hovering perfectly, and i mean completely motioneless, no sound, no wind , absolutely nothing. it was floating. over the next three minutes it sat there while i asked my daughter repeatedly \" are u seeing what im seeing\" and \"omg what the f... is that thing\". i smoked five cigarettes in that time. it hovered barely above the tree as if it were resting on the top of it like a large bird maybe 100 or 150 feet at most. i noticed everything about the ship. the triangular panels comprising the hexagonal cockpit , long pieces of material comprising the 80-100 foot cylinder neck, followed by a shoebox body that the massive wings were attached to folllowed by a larger box behind the wings. picture a massive f-15 or f-22 with a long neck leading to the hexagonal with a shoebox lid in place of the rear thrusters going horizontally across the rear of the ship. it was the most powerful amazing deadliest looking aircraft ill probably ever see. at the time it both fascinated and amazed me. it was facing due west this whole time, then all of a sudden without a sound, or variation in its position it rotated southward 360 degrees spinning slowly like a 33 record and stopped at its original starting point. i did hear a slight \"click\" if will, when it started and stopped. the click sounded like the electric locks they have in the jails. at that point it made feel a little nervous, and extremely small. then about a minute later, almost unoticeable at first it began floating west toward the bay right over and in front of me. i was looking at it from a fortyfive degeree angle. the wings got real close maybe 100 feet. what creeped me out was that there wasnt a rivot to be seen. it was all welded seamlessly together. it floated slower than a feather then maybe 3-5 miles an hour toward the bay. the shoebox back of the ship then flashed a sequence of 2 lights, in random areas like a disco floor, then a small violet colored round light, very small flashed of the rear of the plane as it floated, im mean really floated towards the bay. i watched it float for a couple of miles and couldnt see it thru the rain anymore.. that was kinda saddening to see it go, but releieving too. i looked a my nine year daughter, and she said please dont tell anyone this at the party. i smoked 7 cigarettes in those 8 minutes. i was freaking out inside, but trying to stay as calm as i could. it took me 3 weeks before i told my boss whom i known for ten years. i confided in him because he knows i am brutally honest about things. over the last couple years i find myself wondering why no one from mufon came to interview me, test the soil, ask the people in the house did they see the ufo,and why , like my grandpa and grandma witnessed a ufo on a trip to vegas, my daughter and i see a ufo right in our heavily populated eastbay hills. i can see the location upward in the hills from my moms house which is south by southwest roughly a mile an half from where i saw it, and i wonder will it come back, and why me. ive always wanted to see a ufo, but when i did, it made me feel the insignifigance of human technology. no aircraft i have ever heard of, read of, or seen could hold a candle to the ufo. it was wonderous, amazing,and at the same time extremely deadly and powerful looking. no noise, no wind, nothing. just amazing how it floated in air effortlessly... and in the words of forest gump...\"thats all i have to say about that\" .. sincerely, your devoted believer, nicholas lavrov jr ps my uncle was captain walter bauerle usaf decorated combat pilot vietnam .....id love to show a mufon rep where i saw the ufo or u can email me and get the street name for u and u can google it .."],"Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Other","Latitude":"37.91048","Case Number":"46036","Object Features":"Window(s), Patterned Surface","Tags":"City","Disposition":"Unresolved","Viewing Distance":"101-500 Feet","Log Number":"US-03052013-0003","map":"<A HREF = \"http://maps.google.com/maps?q=37.91048,+-122.280247(46036)&iwloc=A&hl=en\"> mufon case (46036) map </A>","Summary":"IT LOOKED LIKE THE ROMULAN BIRD OF PREY IN STAR TREK. NO SOUND NO WIND","City":"Kensington","Source":"MUFON","files":["/var/www/straped/mufon/html2text/46036.html.txt","/var/www/straped/mufon/org/46036.html"],"trends":["There have been no other sightings in Kensington","This sighting has been favorited 1 time."],"Object Shape":"Bullet, Missile, Diamond","Date of the Event":"12/12/2009 05:12 UTC","Country":"United States"}