{"Country":"United States","Object Features":"Unknown","Log Number":"US-03042013-0014","Case Number":"46030","Source":"MUFON","Longitude":"-80.022657","divs":["Sighting DetailsMy sister (27-years old) was at my house. She ran inside and told me to come see \"this thing quick,\" she didn't know what it was! It was still there after I put down the kids and went outside. Total time it hoovered was a couple minutes; maybe 2-3. There was a low hovering, HUGE ROUND (or oval) craft of some sort, with flashing lights of yellow, red, and green, and it hoovered in total silence. It was not overhead, but seemed like it was very very close. It was over our subdivision. It appeared to be some kind of really, big craft. We watched it for a while talking about the flashing lights and what it could possibly be, then it turned in silence and then flew away seemingly at the speed of light. No light trails or anything it just turned as it hoovered and flew away! FAST. FLEW AWAY FAST out of sight. I called my Father immediately to tell him what we just saw! My stepmother Laurel LaFlamme said we at least need to report this to someone and she's transcribing this email to you right now! We are NOT crazy. This \"thing\" was right in front of us. I have no clue whether it was north or south of what the directionalilty was. It was night, a little after 8pm EST in Goose Creek, South Carolina! We've never seen anything like that before. My sister and I agree we've never seen anything in the sky we could not identify; like a plane, shooting star. This was abnormally large, hoovered in silence, it did have lights that flashed, it was solid, it sped away VERY quickly! It made us feel creepy and a little scared. Confused. Excited that we saw something we couldn't identify. Was it a true UFO or some Charleston Air Force Base craft gone astray? We have no clue! That's about it. Thank you!"],"Weather Factors":"Unknown","trends":["There have been 5 other sightings in Goose Creek","There were no other sightings in Goose Creek on or around March 4th 2013"],"Region":"South Carolina","Tags":"City","Disposition":"Unresolved","Summary":"HUGE round craft with flashing lights, hovered in CREEPY SILENCE then turned and sped away; yellow, red, greens lights flashed","Viewing Distance":"101-500 Feet","Latitude":"32.982536","Object Shape":"Disc","map":"<A HREF = \"http://maps.google.com/maps?q=32.982536,+-80.022657(46030)&iwloc=A&hl=en\"> mufon case (46030) map </A>","Date of the Event":"03/04/2013 08:10 UTC","City":"Goose Creek","files":["/var/www/straped/mufon/html2text/46030.html.txt","/var/www/straped/mufon/org/46030.html"],"Object Flight Path":"Hovering then path","Date Submitted":"03/04/2013 09:06 UTC","Sighting Duration":"Undisclosed"}