{"Country":"United Kingdom","Region":"","Object Features":"Unknown","Date of the Event":"07/01/2009 12:00 UTC","Source":"MUFON","Date Submitted":"03/05/2013 02:58 UTC","Summary":"UFO sighting, bright lights, paralysed, two entities, memory loss","Weather Factors":"Unknown","Disposition":"Unresolved","Object Shape":"Cylinder","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path","Latitude":"53.499173","Case Number":"46044","divs":["Sighting DetailsI woke up about 3am, very thirsty and needed a drink, I came down stairs to get a drink, I made one, drank half, saving the other half to take to bed with me, as I came up the stairs, I could see out of our landing window onto the horizon, I noticed a strange sparkler type lights in the distance, as they faded, a bright ball shaped orb descended from above the window, hovered above the ground for a few seconds, emitting a dim light on the ground but not as much as you would imagine from how bright it was, it then abruptly ascended out of view. At this moment I ran into my mothers bedroom, having to pass the foot of my parents bed to run to my mothers side, I shook her to try and wake her, she slightly came too, but I had left the door open slightly and a strong bright light was coming through the gap, I then immediately ran to try and fight whatever was coming, as I got to the foot of my parents bed, I collapsed, paralysed but conscious, as I lay there unable to move, two small creatures entered, I can only describe them as the typical greys, but with rough textured skin, large dark eyes, thin faces and bodies, wearing some form of clothing, with a strange turtle neck. I did not wake up till the following morning, I couldn't find my drink, and when I spoke to my mother about what had happened and she told me she had heard me go downstairs but nothing afterwards."],"Log Number":"GB-03052013-0011","Viewing Distance":"20 Feet or Less","City":"Salford","Tags":"City","trends":["There have been no other sightings in Salford","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=53.499173,+-2.232173(46044)&iwloc=A&hl=en\"> mufon case (46044) map </A>","files":["/var/www/straped/mufon/html2text/46044.html.txt","/var/www/straped/mufon/org/46044.html"],"Longitude":"-2.232173"}