{"Longitude":"-88.073944","Object Shape":"Circle, Fireball, Saturn-like","map":"<A HREF = \"http://maps.google.com/maps?q=41.541711,+-88.073944(46041)&iwloc=A&hl=en\"> mufon case (46041) map </A>","Region":"Illinois","Object Features":"None","Tags":"City","divs":["Sighting DetailsI went to take the garbage out the backdoor of my apartment at about 9pm on or about February 28, 2013. I noticed 2 bright objects flying in a straight trajectory from the Southwest and moving to the Northeast. I thought they were helicopters at first due to our proximity to the hospital. As I observed the objects for a a minute or so I realized they were not making any noise and were flying too close together to be helicopters. The one object would take the lead and then the other object would overtake the first. As I was returning to my door from the dumpster area I observed more bright round objects trailing, in a straight line the first 2 objects. They were all of the same shape, size, and color. I witnessed 4 more objects and thought this was very strange. I went in the house and my boyfriend was getting ready for bed. I told him he had to come outside and \"see this\". He relectantly followed me outside. We both observed about 6 more objesct traveling together in a staggered line again following the same path in a mostly straight line. He told me to go grab my camera, my batteries were charging and I was still like, these must just be planes or something (the regional airport is relatively close). As we continued to observe the objects they just kept coming. After about 5 minutes we were getting cold and went back inside. He laid down and I went back outside, the objects were still coming...I observed 5 objects in an almost square formation. I called him outside again where we both watched the objects for about another 10 minutes. They were still coming. I was asking him, what do you think we are seeing. I don't know?"],"Summary":"Went to take out the garbage and noticed two objects over the house.","Disposition":"Unresolved","trends":["There have been 12 other sightings in Joliet","There were no other sightings in Joliet on or around February 28th 2013"],"Weather Factors":"Unknown","City":"Joliet","Source":"MUFON","Log Number":"US-03052013-0008","Latitude":"41.541711","Object Flight Path":"Path with directional change","Date of the Event":"02/28/2013 12:00 UTC","Case Number":"46041","Date Submitted":"03/05/2013 12:18 UTC","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/46041.html.txt","/var/www/straped/mufon/org/46041.html"],"Sighting Duration":"Undisclosed","Country":"United States"}