{"Source":"MUFON","trends":["There have been no other sightings in Strathroy","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/46053.html.txt","/var/www/straped/mufon/org/46053.html"],"Log Number":"CA-03062013-0003","Date of the Event":"07/16/2009 11:30 UTC","Summary":"It was a triangle shaped UFO that had three blue circles in each corner and a giant Circle in the middle. All circles were connected with some sort of blue light string","map":"<A HREF = \"http://maps.google.com/maps?q=42.95542,+-81.623233(46053)&iwloc=A&hl=en\"> mufon case (46053) map </A>","Country":"Canada","Tags":"City","Object Flight Path":"Stationary,Hovering then path","Case Number":"46053","Object Shape":"Triangle","Disposition":"Unresolved","Latitude":"42.95542","divs":["Sighting DetailsI was on my way home after spending time over at a friends. I had left his house on my way to my house at around 11:00 pm. (it takes roughly 5 min to get home)so on my way home I took my normal path heading down a dark road with train tracks roughly 3 min down the road. I was biking fairly fast and than out of no where i saw some lights coming from behind, which I thought was a car so i biked faster in order to beat it over the tracks. when I suddenly blacked out and did not know what had happened. when i came to i was standing on the tracks holding my bike in my hands looking up at the sky. Just staring when i realized i was staring into the sky i looked down to see where i was, i noticed i was standing beside my bike on the tracks than looked up again. When i looked up i saw a triangle that had 3 small circles of blue light in each corner. and a big blue circle of light in the middle that got smaller as it rotated from pointing at me to leaving. than i noticed a bunch of blue lights coming out of the back of it and some small black fins on the top. I can draw this as it is etched into my memory. The triangle took over the whole sky that i could see. It slowly moved away and left slowly (as if they wanted me to remember what had happened). After looking at this terrifying and magnificent object i biked home as fast as i could. When i got home my parents were yelling at me as to why i was late. I told them i would be home around 11:30 pm because i was leaving at 11:00 giving me lots of time to bike home. I arrived home around 2-3 in the morning. Normally I would yell back and argue but for some reason i just went straight to bed and fell asleep instantly. This memory has haunted me for years and now i am afraid of being abducted, I have many other past memories that can relate to this event and i need to get my mind cleared please if someone who studies these mysteries please get a hold of me. I don't know how to put a drawing on the computer to add it to this but i can draw a sketch any time of this object."],"Date Submitted":"03/06/2013 01:18 UTC","Sighting Duration":"03:00:00","Object Features":"Wings, Other","City":"Strathroy","Viewing Distance":"101-500 Feet","Longitude":"-81.623233","Weather Factors":"Unknown","Region":"Ontario"}