{"Date of the Event":"10/01/2002 06:00 UTC","City":"San Diego","Weather Factors":"Unknown","Latitude":"32.716529","Object Flight Path":"Stationary,Unknown","Sighting Duration":"03:00:00","Region":"California","Object Shape":"Other, Unknown","divs":["Sighting DetailsI was talking with my girlfriend at the time and some other friends. Noticed a reddish light in the sky. My friends and I watch the thing for some time (don't recall how long) and we even talked about what it could be or was. After some time a Military Helicopter flew up to it. The Helicopter just hovered next to the strange light for a short time and then flew away. I don't recall the time of year (just recall that it was after September) nor can I give the right time of day (just recall that is was late in the day and after working hours). I don't beleave the explanation that was given, that it was some sort of Jet or Rocket exhaust. I do not beleave it to be natural ether, the light or thing never changed shape like clouds so nor did it reflect any light, but it did seem to take light in. I would just like to know if there is any more info as to what it may have been or if I just was seeing something that did not truly happen. Any info or help in determining what I saw would be very great-full."],"Object Features":"Unknown","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Country":"United States","Case Number":"46059","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around October 1st 2002"],"files":["/var/www/straped/mufon/html2text/46059.html.txt","/var/www/straped/mufon/org/46059.html"],"Tags":"City","Summary":"Reddish light in the sky that just was there for some time and then gone.","Log Number":"US-03062013-0009","Longitude":"-117.154705","Date Submitted":"03/06/2013 05:38 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.716529,+-117.154705(46059)&iwloc=A&hl=en\"> mufon case (46059) map </A>","Source":"MUFON"}