{"Country":"United States","files":["/var/www/straped/mufon/html2text/4606.html.txt","/var/www/straped/mufon/more/4606_submitter_file1__000_0609.JPG","/var/www/straped/mufon/more/4606_submitter_file2__000_0610.JPG","/var/www/straped/mufon/more/4606_submitter_file3__000_0611.JPG","/var/www/straped/mufon/org/4606.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.327631,+-86.894588(4606)&iwloc=A&hl=en\"> mufon case (4606) map </A>","Tags":"City","Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Other","Summary":"Unknown flying object","Log Number":"US-04022006-0002","Sighting Duration":"01:00:00","Weather Factors":"None","Disposition":"Unknown","Longitude":"-86.894588","Object Shape":"Circle, Fireball, Unknown","Region":"Alabama","Latitude":"32.327631","divs":["Sighting DetailsI was at home with my older sister, and i had just finished a report for school, when i got up to take the trash out. When i was out i wanted to see if i could still spot the moon, because of the time, the moon was about ready to be replaced by the sun. I was in my front yard and i saw where the sun was comming from, but i thought it funny because it was still dark in front of my house, but behind my house it was a little bright because of the sun, what made me notice the object, was the fact that it was brighter in the dark part of the sky. At first glance i thought it was an airplane, but it was too early in the morning for flights, then i thought it was a blimp, but i have not seen a blimp since the early 1990s and because of the time. The object was far away, but close enough for me to spot in the sky, at first it was just sitting there, but when i got my camara and a photo it started moving very slightly. My first reaction to the sighting was \"what the hell is that thing in the sky?!\" I had called my sister outside to look at what i saw and her reaction was very much the same. I did not lose sight of the object until the sun came up, and it seemed as though the object disappeared."],"Date of the Event":"02/15/2006 04:45 UTC","City":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile, Unknown","Case Number":"4606","trends":[""],"Date Submitted":"02/15/2006 04:45 UTC","Object Features":"Unknown"}