{"Disposition":"Unresolved","trends":["There has been one other sighting in Wetumpka","There were no other sightings in Wetumpka on or around March 6th 2013"],"Latitude":"32.616607","Object Shape":"Circle, Diamond, Disc, Flash, Oval, Sphere, Star-like, Triangle","Case Number":"46072","Source":"MUFON","files":["/var/www/straped/mufon/html2text/46072.html.txt","/var/www/straped/mufon/org/46072.html"],"Date Submitted":"03/07/2013 08:33 UTC","Tags":"City","divs":["sighting detailswent to the local store at 9:43 p.m. and returned home at 9:59 p.m. i pulled in my driveway which put me facing west when a \"pop\" of light caught my attention just coming into view over our residence. at first i didn't pay it much attention and went inside and settled my things, taking about 15 minutes i guess. for some reason it was nagging at me to go back outside and just look up. odd considering the temperature was around 37 degrees! as i walked out onto our porch facing east, there it was. kind of pulsating\\strobing just above the treetops across from us. i watched it for a minute or so and knew i needed to get the sony handycam asap! after acquiring the camcorder i began filming the object just kind of waver around the screen. the object had become an \"orb\" looking shape now. i filmed this for around 20-25 minutes observing that the sky was full of twinkling stars and no clouds but, on my lcd screen of the recorder all i could observe was the object in question which made me believe that it was pretty close. upon realizing this i adjusted my recorder to 800x digital zoom and began reshooting the object. i also noticed that now there were more than just the one in the sky. 3 to my knowledge but it was more difficult to get them on film. i briefly had one other zoomed in screen but it quickly moved off to avoid me it seemed. the footage i captured is astounding. i've seen many videos taken over the years of unidentified flying objects but, nothing to this effect. it should also be stated that many times while filming my hearing was affected with a high pitched ringing tone and throughout the encounter i felt very safe and curiously enough... very loved."],"Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=32.616607,+-86.321795(46072)&iwloc=A&hl=en\"> mufon case (46072) map </A>","Object Flight Path":"Path then hovering","Viewing Distance":"Unknown","Log Number":"US-03072013-0007","Weather Factors":"Unknown","Region":"Alabama","City":"Wetumpka","Date of the Event":"03/06/2013 10:28 UTC","Longitude":"-86.321795","Country":"United States","Summary":"Astonishing. Have over an hour of it on video. GOOD VIDEO!","Sighting Duration":"02:20:10"}