{"Tags":"City","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Country":"Canada","Case Number":"46074","Weather Factors":"Unknown","Summary":"Small light that slowly turned into a much larger light, then vanished.","Object Flight Path":"Path then hovering","Object Shape":"Circle, Fireball","Log Number":"CA-03072013-0009","trends":["There have been no other sightings in Springhill","This sighting has never been favorited."],"Latitude":"45.642551","Object Features":"None","files":["/var/www/straped/mufon/html2text/46074.html.txt","/var/www/straped/mufon/org/46074.html"],"Longitude":"-64.059142","Date of the Event":"04/15/2008 10:40 UTC","Viewing Distance":"Unknown","Source":"MUFON","Date Submitted":"03/07/2013 03:18 UTC","divs":["Sighting DetailsI was in my backyard with a few of my friends playing a game called \"Man-Hunt\" where one person looks for the others while they hide in the dark. Tag at night-time, basically. We were much too old to playing it, and I remember that it was probably the last time we decided to play it. I first noticed the object upon giving up looking for them when it was my turn, as I usually lose anyway. At first, I thought the object was a jet or a plane, but I noticed that there were no flashing lights or anything else that would suggest a plane. I thought, maybe a star, or a satellite? I dismissed those as well, as this was moving north pretty slowly, and satellite don't do what it soon started to do. After a few seconds of watching the star-thing, I looked away for a moment as one of my friends ran up to me to ask why I gave up. I told him that I usually lose, and then asked him what he thought the star-thing was. As I turned to point to it, the star-thing had stopped in place, and was much larger than it was originally, going from the size of a star to maybe as big as my fist at arm's length away. I asked him, without looking away, if he saw what I was seeing, and he said he was seeing it too. The light remained stationary, and as we watched it grew bigger, until it reached about basketball-sized, maybe bigger. I'm not sure if this is because it came closer, or if it just remained that size in the sky. I was starstruck, to be sure. Years of reading about UFO lore and the paranormal since my early childhood, and here I was seeing a UFO, in my own backyard. My friend barely remembers the event after the fact, probably dismissing it for some reason or another. My other friends, it must be said, either had no idea of what was going on, or just couldn't be bothered to look up. Either way, I heard nothing from them while this took place. After around 5 minutes or so, I'm not exact on how long we were watching it for, but it suddenly just vanished. It disappeared in a quick little flash, and where it was before, there were no stars at all. Not even visible by the naked eye ones. I tried squinting to see any, but I came up empty. I felt amazed for seeing this thing, and I'm sure my friend wasn't sure about it either, at least at the time. As it was almost time for bed, I took them home, then went to bed. I didn't tell my parents for fear of being called a nutter, so I kept it to myself, and my friend. I am afraid to look out my bedroom window now, which faces my backyard, because I get this feeling of being watched."],"map":"<A HREF = \"http://maps.google.com/maps?q=45.642551,+-64.059142(46074)&iwloc=A&hl=en\"> mufon case (46074) map </A>","Region":"Nova Scotia","City":"Springhill"}