{"Summary":"5 objects appeared out of darkness, then flew staight up when helicopters showed up within four to five minutes","trends":["There have been no other sightings in Tsuu Tina Reserve","This sighting has never been favorited."],"Tags":"City","Date of the Event":"01/25/2013 09:23 UTC","divs":["Sighting DetailsI have a strange file that you might be interested in. If not, can you direct me to someone who might be able to assist me. On January 25, 2013, at 21:23 hrs. our office received a call from a Tsuu Tina resident who claims that she saw strange lights just south of her house on the Tsuu Tina reserve west of Calgary. Some of these lights appeared to be very close to the ground. This event may have been a 3 - 5 minute event at which time these lights took off straight up into the sky. Within 4-5 minutes the complainant advised that 4-5 helicopters showed up and flew around circling the general area. When myself and Cst. Fairbrother attended, there was still one helicopter circling around. Our complainant was able to take some pictures of these lights and provided me with her photo card from her camera. I took her card back to our office, developed the photos, printed them off and made digital copies on disk. After reviewing the photos and using the zoom tools on our computer, these images show what appear to be 3 maybe 4 different craft. On January 28th, 2013 I returned to the area where these lights were seen in the day light hours. I walked through the forested area to see if I could find anything that could be related to this event. In the general area I found a small peice of florescent greenish-yellowish fuzzy type material. This was sitting right on top of the snow. I looked around and found that there was nothing in the general area that matched this material and could not find an explanation for this material being there except for the events that occurred on the days previous. In addition to this, our office checked with the local airports, as far as air traffic, and were told that there were no helicopters flying in the area on the above noted date. Question - would you know anybody who would be able to take a look at this material and analyze it and tell me what it could possibly be? Also, after watching your show on Discovery Channel, I learned a little bit about radio-activeness in relation to U.F.O's. So I did a compass check with it and found that this peice of material does affect the compass in that it makes the needle move a small amount. I have recorded some video of the compass needle movement. For all it's worth it could be a piece of insulation, but I still think it is worth looking at. I can also provide a copy of the photos on c.d. for your examination as well. you can reach me at this email willy.bigsmoke@tsuutinapolice.com office # 403-251-9660 fax 403-238-4075 Thank you. W.M. Big Smoke Cst. SG112 Tsuu Tina Nation Police Service"],"Source":"MUFON","Case Number":"46083","Region":"Alberta","Log Number":"CA-03082013-0005","Object Features":"Window(s), Patterned Surface, Appendage(s)","Latitude":"53.934391","Object Flight Path":"Stationary,Hovering then path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=53.934391,+-116.572984(46083)&iwloc=A&hl=en\"> mufon case (46083) map </A>","Date Submitted":"03/08/2013 06:38 UTC","City":"Tsuu Tina Reserve","Viewing Distance":"101-500 Feet","Object Shape":"Disc","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/46083.html.txt","/var/www/straped/mufon/org/46083.html"],"Country":"Canada","Longitude":"-116.572984","Disposition":"Unresolved","Sighting Duration":"Undisclosed"}