{"trends":["There has been one other sighting in Haldimand","There were no other sightings in Haldimand on or around October 17th 2009"],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Shape":"Chevron, Triangle","divs":["Sighting Details1. In hot tub in backyard at 9:00 p.m, watching flight pattern across clear sky. Top airplane veered upward toward star at incredible speed. 3 minutes later huge black matte delta shaped spacecraft appeared over trees, crusing over backyards. Tips reached from street to street. Undercarriage reminiscent of folded paper airplane. Seven round off-white lights in arrow formation situated on top of craft and pointing skyward. Cruised slowly to edge of town and then disappeared suddenly. Was looking to see where the airplane could have gone when massive spacecraft sudenly appeared over trees. Made no noise and no exhaust. Definitely unidentifiable as an airplane. Moved about 30 kph in straight line from south to north. I hid under hot tub cover which was halfway open, then peeked out to witness, slowly standing up to get a good view. I was scared and ran into the house as soon as the thing disappeared at the edge of town. Afraid it would come back to get me. One week later at 9:00 p.m. something smashed a metal shed situated next to the hot tub, crated a wnd so fierce it left street dirt stuck to the neighbour's house on the north side of the street. The shed looked like it had been hammered to the ground with a million ball-pien hammers and had to be scrapped. I felt the thing had come back for me and I was away that weekend. No other debris from the \"storm\" was found in the yard or any of the neighbours yards. It was fall of 2009, either October or September, not positive of the date, but was in the last 2 weeks of the month.A couple of years later, Another person I know mentioned strange holes depressed in her backyard about the same time as my sighting, the holes were filled in. One tree had no leaves on it or on the ground, and another tree nearby had all leaves intact."],"Latitude":"42.907247","Summary":"black matte delta shaped, round lights in arrow shape pointing skyward cruised between streets disappeared at edge of town","Tags":"City","Longitude":"-79.616936","Region":"Ontario","City":"Haldimand","Object Flight Path":"Straight-line path","Date Submitted":"03/08/2013 10:37 UTC","Log Number":"CA-03082013-0007","Country":"Canada","Viewing Distance":"21-100 Feet","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/46085.html.txt","/var/www/straped/mufon/org/46085.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.907247,+-79.616936(46085)&iwloc=A&hl=en\"> mufon case (46085) map </A>","Case Number":"46085","Source":"MUFON","Object Features":"Louvres","Date of the Event":"10/17/2009 09:05 UTC"}