{"Viewing Distance":"20 Feet or Less","City":"Penticton","Date of the Event":"07/10/1993 02:00 UTC","Region":"British Columbia","Object Shape":"Unknown","Tags":"City","Summary":"didnt see ufo","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy freind and I were out late cutting through an orchard this little dog noise came from some tall grass the grass started to move it parted and started to come towards my freind and i after it cleared the grass i could see it it was blackish grey color and it was shuffeling along the ground it scared the heck out of me and my freind so we started to run it persued my freind and I into a lit area where i got a good look at it it was an over sized bug. I have done some research on it and found other similar discriptions of it in history. Pazzuzu Rumplestiltskins aka Rumply Abdomain stilty Legs Shinny skin. Under the beam in abbydos the bug with a cane and the crimson red story on the roof of the sistine chaple Esaias act on the roof and the oranges of anguish. To be on your toes for when the baby bug bugs it will tear your world apart. How the little bug babies hang out on the roof and make their way inside and the man pointin out somtin fishy with the creature in the tree It has a voice synthesizer and a sword and a sicle. The other was found on clay pots the annunki the two entities facing each other. Translates it will take all that you have and then your life. It has nuclear capabilities. Scary movie 3 on the cover to when they raid a house in the feild they leave a message to its craft flying around it is called branch code. I know more but would like to discuss it in better detail in person. I have reason to believe someone else has come in contact with it. It recorded my voice."],"Log Number":"CA-03092013-0005","Weather Factors":"Unknown","Longitude":"-119.588208","Disposition":"Unresolved","Object Flight Path":"Unknown","Country":"Canada","Source":"MUFON","Date Submitted":"03/09/2013 07:27 UTC","trends":["There have been 7 other sightings in Penticton","There were no other sightings in Penticton on or around July 10th 1993"],"files":["/var/www/straped/mufon/html2text/46098.html.txt","/var/www/straped/mufon/org/46098.html"],"Object Features":"Unknown","Latitude":"49.506468","Case Number":"46098","map":"<A HREF = \"http://maps.google.com/maps?q=49.506468,+-119.588208(46098)&iwloc=A&hl=en\"> mufon case (46098) map </A>"}