{"Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/46090.html.txt","/var/www/straped/mufon/org/46090.html"],"Case Number":"46090","Date of the Event":"01/01/2013 12:00 UTC","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Object Features":"Other","Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","Source":"MUFON","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=29.892941,+-95.649026(46090)&iwloc=A&hl=en\"> mufon case (46090) map </A>","Log Number":"US-03082013-0012","Longitude":"-95.649026","Summary":"In western sky when first sighted. Object proceeded directly overhead toward northeast.","Latitude":"29.892941","Country":"United States","divs":["Sighting DetailsMy husband and myself (both of us aged 72) went to check outside before retiring on New Years Eve. It was exactly at 12:00 A.M. I first sighted the object and called my husband outside to witness the object. The nearest I can get to the shape and action of the object was the space shuttle when it tilts the nose up before landing. It was triangle shaped but a soft triangle. No sharp edges showing. There were no strobing lights on the bottom like an airplane but steady red and amber lights surrounding the bottom of the craft. It was proceeding quite slowly and came directly over our house. We were standing on our patio. As it passed over the house we moved out into the driveway to watch it. It was proceeding basically northeast and increasing in altitude. There were some high whispy clouds and it remained in sight under the clouds. We eventually lost sight of it. The object made no sound what so ever. It did not shoot across the sky at a high rate of speed it was proceeding in what I would say was a liesurely fashion. The object was quite beautiful as observed from below with the lights burning steadily. My husband has been trying to get me to report this sighting to someone but I hesitated to do so. This is the first definitive sighting of a UFO either one of us has ever had. I have seen satellites pass over so I know what they look like. This object was much closer. It was not a star. What I noticed first was the lights and shape of the object. I first thought it was a plane but I have never seen a plane fly with the nose tilted upward. We both felt priviledged to have seen this beautiful object. We do not have any large airports to the west of us so it was not a plane taking off. We are approximatley 25 miles from Houston Bush Airport and it is to the northeast."],"trends":["There have been 173 other sightings in Houston","There were 2 other sightings in Houston on or around January 1st 2013"],"Date Submitted":"03/08/2013 04:20 UTC","Weather Factors":"Unknown","City":"Houston","Region":"Texas"}