{"Tags":"City","City":"Georgetown","trends":["There has been one other sighting in Georgetown","There were no other sightings in Georgetown on or around March 8th 2013"],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Longitude":"-86.029177","Date Submitted":"03/09/2013 01:25 UTC","Source":"MUFON","Viewing Distance":"101-500 Feet","Latitude":"38.32488","files":["/var/www/straped/mufon/html2text/46096.html.txt","/var/www/straped/mufon/org/46096.html"],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=38.32488,+-86.029177(46096)&iwloc=A&hl=en\"> mufon case (46096) map </A>","Summary":"Seen @least4 objects @ different times, sometimes 2 @ a time in different directions. Had lights but weren't necessarily all the same. Red, white, and green. Didn't look like the usual airplane or copter lights. Didnt make any noise.","divs":["Sighting DetailsWas outside looking up @ the stars March 8,2013 about 10:00.Saw lights that didn't look like a normal airplane or helicopter. Object would hover then move in ways that airplanes for sure can't do. Was lower than an airplane would usually fly. Was @ least 4 different objects that came from different directions during a 3 hour period that I noticed. I was in and out a few times looking. Saw @ least 2 each time. Husband saw several also as did daughter. We are thinking they are drones. I would like to know why there are so many, and what are they doing? I have seen these objects on several other occasions. First time @ Patoka lake right after dusk about 4 years back. What really caught my attention was the way they moved. That night there was 3 and seemed to move to gather unlike any aircraft I have seen. I am no expert but no plane I've seen has ever moved like that or hover with no sound that I noticed. I would really like to know what these are. I believe like I said before that they are drones. Why so many in a quite area? Creeps me out to think Big Brother is practically looking in our windows. What's next? Strange too that Rand Paul spent most of his day going on and on about drones this last week."],"Log Number":"US-03092013-0004","Object Features":"Wings","Country":"United States","Region":"Indiana","Case Number":"46096","Object Shape":"Triangle","Date of the Event":"03/08/2013 12:00 UTC"}