{"trends":["There have been 6 other sightings in Cypress","There were no other sightings in Cypress on or around February 26th 2013"],"Viewing Distance":"Unknown","Object Features":"None","Longitude":"-118.005571","Source":"MUFON","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/46092.html.txt","/var/www/straped/mufon/org/46092.html"],"Object Shape":"Sphere","Tags":"City","Region":"California","Object Flight Path":"Hovering then path,Path with directional change","Date Submitted":"03/08/2013 09:55 UTC","divs":["sighting detailson february 26th 2013, i was walking to my car at 7:56pm after attending radiology class at cypress college in cypress california. i was looking at the stars because it was a crystal clear night. i was looking at the orion constellation and to the right of orion, i noticed a very bright star. i thought it was capella at first but it wasn't in the right spot so i continued to look at it. that is when i noticed it began to track towards the orion constellation. it was slow, similar to how a plane would track. i then thought i was looking at a plane. i was shocked when it stopped and hovered. as i was thinking to myself, \"how is that plane doing that\", it suddenly shot straight up at a rediculous speed and faded out of sight. i stood there for a minute after it was gone trying to figure out what i just saw. i have absolutely no idea what it was, and i was an air traffic controller for the u.s. marine corps. i saw lots of high tek aircraft, including stealth aircraft, but never anything that could do that. it took off so fast and streaked out of the atmosphere\\sight so fast, it was impossible."],"Log Number":"US-03082013-0013","Country":"United States","Disposition":"Unresolved","City":"Cypress","Case Number":"46092","map":"<A HREF = \"http://maps.google.com/maps?q=33.834428,+-118.005571(46092)&iwloc=A&hl=en\"> mufon case (46092) map </A>","Sighting Duration":"Undisclosed","Latitude":"33.834428","Summary":"Hovered, Flight path to Left then shot out of atmosphere","Date of the Event":"02/26/2013 07:56 UTC"}