{"trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around February 17th 2013"],"Object Features":"None","Latitude":"35.110703","Case Number":"46103","map":"<A HREF = \"http://maps.google.com/maps?q=35.110703,+-106.609991(46103)&iwloc=A&hl=en\"> mufon case (46103) map </A>","Source":"MUFON","Longitude":"-106.609991","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","City":"Albuquerque","Country":"United States","Date Submitted":"03/09/2013 10:08 UTC","Object Shape":"Sphere","Region":"New Mexico","files":["/var/www/straped/mufon/html2text/46103.html.txt","/var/www/straped/mufon/org/46103.html"],"divs":["Sighting DetailsAfter I crossed University Street heading west on Lead towards the I-25 Freeway, I noticed an orange light headed towards me flying low and headed East. It was to my right as it approached so I assume that it was above Central Avenue or another nearby parallel street in Albuquerque. The closer this object got to me, the more evident it was that it was an orange orb. I continued driving west as it continued east until we were perpendicular to each other, and I could define that it was definitely lower than airplanes are allowed to fly and was a distinctly orange orb, although the definition of a physical object was lacking...it was a self-illumined light orb, and conscious. I continued on to I-25 and could no longer keep track of it. Once on the freeway, I though to call a friend who lived father north and east to ask him to look for it, but, he saw nothing. We both checked our cell phones tonight so that I could be certain that I had the correct date, as I went to ABQ on the 3rd of February as well as on the 17th of February, but, neither one of us found the call I placed to him stored on our phones. In October, I also saw 2 huge stars as I headed North on Highway 14 from the Santa Fe Studios at 8PM or so. They did not belong there, and, of course, were the only stars that bended into the mist and disappeared. I checked on other nights to see whether or not the constellation had those two stars nearby, and they were never there again."],"Log Number":"US-03092013-0010","Tags":"City","Date of the Event":"02/17/2013 12:00 UTC","Sighting Duration":"Undisclosed","Summary":"{cak} Driving West to I-25, orange orb heading toward me following a path north of the street I was on","Disposition":"Unresolved","Viewing Distance":"101-500 Feet"}