{"Longitude":"-77.365556","Object Shape":"Diamond","Latitude":"38.847104","Source":"MUFON","divs":["Sighting DetailsI was out in front of my apartment looking for the comet visiable in the west. I had my binoculars with me. I had walked north about 50 yards to get a better view of the horizon. I did not see the comet, so I started to walk back to my place. I kept looking up and to west as I walked. I noticed a solid object moving just above me about 50' away, a Black Long Diamond that was flat about 2 foot tall and 25' long and 5' wide. The points were rounded. I thought it was a helicopter, but made no noise and had no propeller or wings. After it passed, I heard a very faint noise. It had glowing orange rectangles that appeared on the side. I was not sure if these were windows or vents. I only saw it for a few seconds, maybe the entire encounter was 5 to 10 seconds. I thought to look through my binoculars to get a better look at it when I could not figure out what it was, but I really didn't need them because it was so close. When I tried to find it in my binoculars, I could not find it. I then tried to find it just with my eyes and I could not see anything. It was moving from east to west in a strait path. It moved maybe 20 to 30 yards during my observation. It was moving very slow, close to a hover, but it was moving. I couldn't believe that I was seeing something. It was very clear to me that I had just seen something that I have never seen before. I just smiled and said to myself that I had truely seen a UFO. I always wanted to see one,and today it had really happened for me. I was not scared, but I was slightly freaked out because I couldn't believe what I had just seen."],"Weather Factors":"Unknown","trends":["There have been 14 other sightings in Fairfax","There were no other sightings in Fairfax on or around March 9th 2013"],"Summary":"I saw it just above me, a Black Long Diamond that was flat 2 foot tall and 25' long and 5' wide.. I thought it was a helicopter, but made no noise and had no propeller. After it passedI heard a very faint noise. It had orange rectangles on th sides.","Country":"United States","Object Features":"Window(s), Louvres","Date Submitted":"03/09/2013 09:41 UTC","Log Number":"US-03092013-0009","Date of the Event":"03/09/2013 07:20 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.847104,+-77.365556(46102)&iwloc=A&hl=en\"> mufon case (46102) map </A>","City":"Fairfax","Object Flight Path":"Straight-line path","Region":"Virginia","Viewing Distance":"21-100 Feet","Disposition":"Unresolved","Tags":"City","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/46102.html.txt","/var/www/straped/mufon/org/46102.html"],"Case Number":"46102"}