{"Summary":"Not just one... many of them","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Latitude":"18.472445","files":["/var/www/straped/mufon/html2text/4610.html.txt","/var/www/straped/mufon/more/4610_submitter_file1__airp2.jpg","/var/www/straped/mufon/more/4610_submitter_file2__gsrs.jpg","/var/www/straped/mufon/more/4610_submitter_file3__wetyt.jpg","/var/www/straped/mufon/org/4610.html"],"Source":"MUFON","Object Shape":"Star-like","Tags":"City","Viewing Distance":"Unknown","trends":["There have been no other sightings in Arecibo","This sighting has never been favorited."],"Date of the Event":"09/27/2005 12:00 UTC","Longitude":"-66.715731","divs":["Sighting Details It all starts in September while I was outside the house contemplating the stars. I have seen many airplanes in that area but what I saw was completly different. It was like two stars in form and color, one was behind the other and both had the same size and goes at the same speed very slow. I though maybe could be one single object but I keep on watching it and wanting it not to desappear but instantly it desapeared the one in the front first and then the other. The were no clouds in the sky, it was completely clear...a beautiful night to see the stars. I remember by that time Mars were near the earth and that night it was beside the moon & that was what I was looking for. But after that day at the same time I went outside I start to see many of them. At first I start to think they were satellites but they were to many and some travel in group of two...some were bigger and others get nearer and their light get bigger, very bright...a white light that I ever seen. They look like stars, if you are watching the sky you are seeing something like a star and then suddenly it begin to move. Usually they appear from nowhere and they desappear in the same way. Always I see them when the first stars begins to appear but never late at night. I moved to Virginia on December 27 and I was affraid I wouldn't see those stars again but I was wrong. I start to see just a few in a night but since a week ago they are starting to appear again...many of them and on March 27...(I think is not a concidence the date) but It was the fist time I saw a little one getting out of a big one. I needed to report this because something is happening whatever they are. I don't have a good zoom camera but I tried to captured them and I took photos of airplanes and those strange moving stars to compare them...they look very different. I took the photos with a Canon PS510 with a tripod I will sent you pictures of both cropped and putting more contrast to make the objects clearer...but I keep the original ones, full resolution for if you need them. I will keep on taking pictures of them and hopefully by the end of this month I will get a Canon Eos20D with a 55mm-85mm lense wich is more better to take this kind of pictures. I can give you the settings of the camera too if you ask. I want you to believe me because I have seen them very near and I could not see any shape on them just a great white light. I got worried because I though that maybe that could be radiation but that is why I am here. You are the experts, please let me know any info you have if you know something about it. I can show you in person too if we plan a meeting...I think that is the best proof I can give. Well that is all by now. Y NOTE:the first photo below is an airplane, the rest are the objects"],"Country":"Puerto Rico","Object Features":"Unknown","Region":"","Date Submitted":"09/27/2005 12:00 UTC","Weather Factors":"None","Case Number":"4610","Disposition":"Unresolved","City":"Arecibo","map":"<A HREF = \"http://maps.google.com/maps?q=18.472445,+-66.715731(4610)&iwloc=A&hl=en\"> mufon case (4610) map </A>","Sighting Duration":"00:01:00","Log Number":"PR-04032006-0003"}