{"Region":"Indiana","divs":["sighting detailsi was at high school singing up for night school walking from one building to another. just looked up and saw the fluid like fireball it had a shape like a cocoon trying to hatch but was a jirating type flameball. hovering alot i would guess it to be aproximatly 1\\2 to 3\\4 miles in diameter but the diameter preaty much kept the same volume i was sure at the time it to be extersurectical later i was woundering if it could be a chariot of fire from heaven it was hovering what i figured to 2 or 3 miles south of me and i would guess 1000 to 2000 feet in altitude. after hovering what seamed to be around 30 or 40 seconds it started moving northand east not in a straight line. it would move and hover as it moved northeast. i probably watched for 4 or 5 minutes. i stoped an older teacher walking by and said look at that and he put his head down and kept walking. i had to get in to my next class to sign up for another class. so thats when i quit looking at it. buy then it was probably 4 or 5 miles northeast of me i would guess it would move 1 or 2 miles in 1 or 2 seconds"],"Object Features":"None","Tags":"City","Summary":"looked up notest a flame(ball )more eggshape not a definate shape. hovered moved contenuoisly","Weather Factors":"Unknown","Object Flight Path":"Hovering then path","Source":"MUFON","Sighting Duration":"Undisclosed","trends":["There have been 126 other sightings in Indianapolis","There were no other sightings in Indianapolis on or around January 10th 1977"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.776982,+-86.149836(46101)&iwloc=A&hl=en\"> mufon case (46101) map </A>","Log Number":"US-03092013-0008","Case Number":"46101","Object Shape":"Fireball, Other","Longitude":"-86.149836","Date of the Event":"01/10/1977 12:00 UTC","files":["/var/www/straped/mufon/html2text/46101.html.txt","/var/www/straped/mufon/org/46101.html"],"Disposition":"Unresolved","Latitude":"39.776982","Viewing Distance":"Over One Mile","Country":"United States","Date Submitted":"03/09/2013 09:29 UTC","City":"Indianapolis"}