{"Object Features":"None","Date Submitted":"03/10/2013 02:09 UTC","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Case Number":"46112","Weather Factors":"Unknown","City":"Blythe","Summary":"we saw 2 large flare like objects slowly falling from the sky over the colorado river looking from blythe towards phoenix","Log Number":"US-03102013-0007","files":["/var/www/straped/mufon/html2text/46112.html.txt","/var/www/straped/mufon/org/46112.html"],"Date of the Event":"03/09/2013 10:00 UTC","Latitude":"33.97251","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.97251,+-114.510208(46112)&iwloc=A&hl=en\"> mufon case (46112) map </A>","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-114.510208","trends":["There have been 7 other sightings in Blythe","There were no other sightings in Blythe on or around March 9th 2013"],"Region":"California","Source":"MUFON","Tags":"City","Object Flight Path":"Hovering then path","divs":["Sighting DetailsMy husband and I were outside after dinner , sitting by our fire pit, chatting. I was drowsy and a little cold. All of a sudden I felt like I was supposed to look to my left . I looked and I what initially looked like a plane on fire. I jumped up and told my husband to look too and thats when, we noticed there were two orbs. After a minute or two of us discussing what we thought they were and that they were NOT a plane on fire or a meteor and staring NOT LOOKING AWAY( we thought it decended to slowly to be a meteor)we moved physically closer ( very strange as they were very far up in the night sky) , WE stood there staring into the night. My husband said they looked like very large flare like things. I agrree except they were HUGE. Maybe parachuters using flares for a night jump... except there was no plane or helicopter and there were only two and again the size was to great to be a regular flare. Additionally , we have been to airshows where they jumpers have a flame that trails behind them and that was not it either.Plus there was silence, no motor like noises from a plane; big or small or helicopter . We watched them a long time , 15 or more minutes. After they slowly either decended where we could not see them or burned up. I noticed a strange light that was as bright as a star but very big and movin very very slowly towards us . It was shining but not set in one place like a star but not moving like a plane , it seemed to be hovering to watch our location. I stopped looking at it and when I returned approximately 5 minutes later the object was gone. My husband witnessed this too. Weird."],"Object Shape":"Other"}