{"Object Features":"None","trends":["There has been one other sighting in Rankin","There were no other sightings in Rankin on or around February 17th 2013"],"divs":["Sighting DetailsI was letting the dogs out before I went to bed around 4 am and noticed a white light to the west of me. I live close to the airport so I didn't pay too much attention to it at first because I thought it was a plane with landing lights on flying through the air space. As it passed over head I noticed it didn't have any beacons flashing and it looked the same as it did when I first seen it...all white orb. As it moved to the east the white orb remained white with no navigational beacons flashing, no noise, and still looked like a white ball. I'm guessing it was 10,000 ft. in altitude or less. It eventually disappeared in the eastern horizon. It was a clear night with no clouds. It was not a satellite as I have seen one before and it wasn't a plane or a balloon. It made no noise and the flight path was straight and true. I wished I had my camera to video it but by the time it would have taken me to go inside to get and get back out to video it, it would have been gone. I didn't want to stop watching it so I didn't get the camera. The best way to describe the object would be picture a jet with the nose landing light on. Thats what it looked like coming towards me, above me, and going away from me."],"files":["/var/www/straped/mufon/html2text/46114.html.txt","/var/www/straped/mufon/org/46114.html"],"Sighting Duration":"00:03:00","Tags":"City","Region":"Michigan","Latitude":"42.914472","Source":"MUFON","Log Number":"US-03102013-0009","Case Number":"46114","map":"<A HREF = \"http://maps.google.com/maps?q=42.914472,+-83.750511(46114)&iwloc=A&hl=en\"> mufon case (46114) map </A>","Disposition":"Unresolved","Object Shape":"Sphere","Summary":"White orb with no sound","Longitude":"-83.750511","Object Flight Path":"Straight-line path","Date of the Event":"02/17/2013 12:00 UTC","Weather Factors":"Unknown","Viewing Distance":"Unknown","Country":"United States","Date Submitted":"03/10/2013 04:53 UTC","City":"Rankin"}