{"Case Number":"46117","Viewing Distance":"21-100 Feet","Latitude":"40.573736","Disposition":"Unresolved","trends":["There have been 2 other sightings in Wapakoneta","There were no other sightings in Wapakoneta on or around June 15th 1997"],"Object Flight Path":"Straight-line path","Log Number":"US-03102013-0012","divs":["Sighting DetailsI once saw a UFO with my girlfriend at the time in Wapakoneta Ohio. I have never formally reported it, but it did get me interested in the UFO Phenomena because even though I am skeptical of UFO's I do in fact know that people really do see things in the sky. I do not know if they are extraterrestrial, but I do know that people honestly do see things they cannot explain. My sighting happened on a nice warm sunny day. My girlfriends house was right next to a park and the fenceline was shared with the park. I looked up as we were sitting outside and she was clipping her dogs hair. I then saw in plain sight a chrome looking egg shaped craft which was highly reflective and travelling at a high rate of speed. It was about the size of a couch and made no noise whatsoever. It was slightly higher than a telephone pole in height and wasn't but about 50 yards away. We both watched as it flew over the park and then continued on in a straight line until it disappaeared from view. I remember watching some footage one time of a silver egg shaped craft flying over a field where a supposed crop circle was found, and it looked exactly like the craft on that film. It was in broad daylight and we both watched it passing by until a tree obscured us from seeing it further. I got up and walked to a different vantage point so that I could see it again, but I could not find it in my field of view. So that is what I saw, and it feels good to finally report it."],"Tags":"City","Weather Factors":"Unknown","Object Features":"None","Date Submitted":"03/10/2013 07:09 UTC","Country":"United States","Region":"Ohio","Object Shape":"Egg","Summary":"Egg Shaped Object Broad Daylight","files":["/var/www/straped/mufon/html2text/46117.html.txt","/var/www/straped/mufon/org/46117.html"],"City":"Wapakoneta","map":"<A HREF = \"http://maps.google.com/maps?q=40.573736,+-84.184129(46117)&iwloc=A&hl=en\"> mufon case (46117) map </A>","Source":"MUFON","Sighting Duration":"Undisclosed","Date of the Event":"06/15/1997 03:00 UTC","Longitude":"-84.184129"}