{"City":"Cottonwood","divs":["Sighting DetailsMy father, step-son and I were heading home after baseball practice in the ruck heading West on Gas Point Road. Straight ahead in front of us over the tree tops we noticed 3 triangle shaped lights moving together in same formation, appeared to move SW, top light tipped (ship) and then disappeared. My father and I were trying to get video, but its just black cuz inside the truck through windshield. We couldn't believe it we kept asking eachother what the heck it was, and making sure we all three were seeing it. We were passing by a local gas store, \"Gas Point Market\" and pulled over, saw my neighbor looking at the same direction as we saw the object, he said \"YEAH! What was that?!\" We then told him we thought for sure it was a UFO, but the lady that was with him said, there is a base around here, and could be drones. We dont believe so, it was one object like \"The Mothership\" and too big to be a drone. My father is even calling me asking if anyone else seen our UFO this morning. HE is 57 and always had me watching UFO stories and shows since I was little. I was pretty scared and my dad was a little too. I didn't even want to go out side last night in the open sky area. I KNOW it was a UFO, I know of local activity in the Cottonwood area from Ranchers that live out Bowman Road too."],"Sighting Duration":"00:03:00","Disposition":"Unresolved","Summary":"Driving, noticed 3 orange lights in a triangle and all moving together, looked as if tipped up and then disappeared","Latitude":"40.388644","Date of the Event":"03/09/2013 07:21 UTC","Tags":"City","Object Shape":"Triangle","Object Flight Path":"Path with directional change","Object Features":"None","Country":"United States","Log Number":"US-03102013-0008","files":["/var/www/straped/mufon/html2text/46113.html.txt","/var/www/straped/mufon/org/46113.html"],"Date Submitted":"03/10/2013 03:53 UTC","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=40.388644,+-122.406822(46113)&iwloc=A&hl=en\"> mufon case (46113) map </A>","Case Number":"46113","Weather Factors":"Unknown","Longitude":"-122.406822","trends":["There have been 5 other sightings in Cottonwood","There were no other sightings in Cottonwood on or around March 9th 2013"],"Viewing Distance":"Unknown","Source":"MUFON"}