{"Latitude":"41.623454","Date of the Event":"08/15/2012 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.623454,+-86.837347(46120)&iwloc=A&hl=en\"> mufon case (46120) map </A>","Disposition":"Unresolved","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","trends":["There have been 32 other sightings in La Porte","There was one other sighting in La Porte on or around August 15th 2012"],"Date Submitted":"03/10/2013 10:07 UTC","Object Shape":"Fireball, Sphere","Longitude":"-86.837347","Viewing Distance":"Over One Mile","Country":"United States","Log Number":"US-03102013-0015","Region":"Indiana","City":"La Porte","divs":["sighting detailsthe laporte county fair grounds was involved in a week long pyrotechnics show after fair week after dark. i am approx. 3-4 miles northwest from the fairgrounds as the crow flies. i could see the fireworks from my property. i took out the dogs before getting ready for bed. it was a nice clear nite.to avoid mosquitos, i went up to my bedroom window to watch some of the show. as i waited for the next shot of fireworks i saw an orange glowing ball of light appear north of where the fireworks were going off approx. 40 degrees off the horizon. it dropped straight down, made a 90 degree turn to the north, went a short distance then disappeared. i said well! you just saw your first ufo!!!! the whole thing only lasted 15 to 20 seconds. i think the fireworks show was being checked out! the next day i talked to my friend and neighbor about what i saw. she has a 16 y\\o daughter who had been to the fair and on their way home said she and her friends saw something, like an orange glowing thing in a field not far from the fairgrounds. the fairgrounds may be hosting another pyro show this year again in august 2013."],"Tags":"City","Summary":"orange ball of light appeared, descended, 90 degree turn to a ,straight-line path, then disappeared","Object Features":"None, Unknown","files":["/var/www/straped/mufon/html2text/46120.html.txt","/var/www/straped/mufon/org/46120.html"],"Object Flight Path":"Path with directional change","Case Number":"46120","Source":"MUFON"}