{"Disposition":"Unresolved","City":"Mulberry","Latitude":"27.895304","Object Features":"Unknown","Summary":"Orange light turned into a star","Object Shape":"Cylinder, Sphere","Object Flight Path":"Path with directional change,Other","files":["/var/www/straped/mufon/html2text/46128.html.txt","/var/www/straped/mufon/org/46128.html"],"Weather Factors":"Unknown","trends":["There has been one other sighting in Mulberry","There were no other sightings in Mulberry on or around January 20th 2013"],"Viewing Distance":"Over One Mile","Source":"MUFON","Sighting Duration":"00:04:00","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=27.895304,+-81.973417(46128)&iwloc=A&hl=en\"> mufon case (46128) map </A>","Log Number":"US-03112013-0003","Longitude":"-81.973417","Case Number":"46128","Date of the Event":"01/20/2013 12:00 UTC","Region":"Florida","Tags":"City","Date Submitted":"03/11/2013 01:36 UTC","divs":["sighting detailsheading east on cr640 at about 1am (around jan 20 2013) i saw on a clear night what it looked like two orange\\yellowish lighted up sausages put together with an empty black space between them. it was flashing on and off, and i say to my self \"well that it is a weird looking airplane. it stayed on for about 6 seconds, then went off, keeping its course it re-appeared (glowed back) again some distance ahead from where it disappeared. it was traveling on straight line about 40 degrees from the horizon going from north to south. it did that a few times, then here is the best part that convinced me it was a ufo. on its last re-appearance it went from the orange\\yellowish sausage looking light to rapidly transform itself into a star! it just slowly went from the size of an aspirin, swinged very fast upward and stayed static as an star the size of the smallest stars in the sky. i kept looking at it for about another 30 minutes but it did nothing, it was just hanging in the sky just like another star. thats it, and i have to say that it was a very beautiful show!"]}