{"Summary":"2 starlike ufos, evenly spaced apart, one following the other","Case Number":"46121","Date Submitted":"03/10/2013 10:10 UTC","Viewing Distance":"Over One Mile","Date of the Event":"03/03/2013 09:21 UTC","trends":["There have been no other sightings in Township of Upper Chichester","This sighting has never been favorited."],"Source":"MUFON","Object Features":"None","Tags":"City","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Log Number":"US-03102013-0016","Region":"Pennsylvania","Latitude":"39.862773","files":["/var/www/straped/mufon/html2text/46121.html.txt","/var/www/straped/mufon/org/46121.html"],"divs":["Sighting DetailsI was in the back yard. Their movement together made me notice them. At first I thought it was a satellite. On clear nights I go outside with star watching binoculars to observe any abnormal items in the sky. I had just viewed the northeastern sky (from west to east)when I caught these 2 objects,traveling at a high rate of speed, across my field of vision. At first I thought I only saw one but as I watched I actually saw two, flying together(one following the other). I observed the objects for about 30 seconds and they began to fade, then they continued towards the east until they were out of my sight. They had to be very high in the sky. Best estimate would be over 30,000 feet. Prior to viewing what I just reported I thought I had seen other objects traveling in the same direction, but they were very dim and that made me unsure as to what I actually saw. Because I often look at the sky, on clear nights, I am quite familiar with 'normal' air traffic and these objects were not normal. A few months ago I saw similar objects traveling in the general direction as what I had just seen but those objects were side-by-side, at an angle, as they traversed the sky. If only they were closer for me to observe I could have given you more information."],"Country":"United States","Object Shape":"Star-like","City":"Township of Upper Chichester","map":"<A HREF = \"http://maps.google.com/maps?q=39.862773,+-75.459781(46121)&iwloc=A&hl=en\"> mufon case (46121) map </A>","Longitude":"-75.459781","Weather Factors":"Unknown"}