{"Latitude":"35.727665","Case Number":"46132","Object Shape":"Oval","City":"Apex","Weather Factors":"Unknown","Disposition":"Unresolved","divs":["Sighting DetailsMyself and two other individuals were traveling north bound on a main road when we saw an extremely large bright light in the distance. It was brighter than anything I have ever seen. It hovered above the tree line for approximately ten seconds then \"fell\" straight down. It was hovering, there was no trial, so I ruled out falling star or meteor. I have lived near air force bases all my life, so I know what their aircraft are like, this FELL at a speed much faster than any human made aircraft. The color was of a glowing blue-white and was almost blinding bright. It was approximately 40 degrees above horizon, hovered, then \"fell\" behind the tree line. I have NEVER seen any type of human aircraft (including experimental) with lights as bright or fly in this manner, or at rates of speed this craft flew). My son was walking the dogs the night before and claimed he saw something of the same description and as I am very skeptical, I just assumed it was an aircraft. He said it was the SAME EXACT thing as he saw the previous night in the same general area."],"Summary":"Brightest light I have ever seen (blue/white in color)","Region":"North Carolina","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=35.727665,+-78.823383(46132)&iwloc=A&hl=en\"> mufon case (46132) map </A>","trends":["There have been 3 other sightings in Apex","There were no other sightings in Apex on or around March 8th 2013"],"Longitude":"-78.823383","Log Number":"US-03112013-0008","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/46132.html.txt","/var/www/straped/mufon/org/46132.html"],"Tags":"City","Date of the Event":"03/08/2013 10:13 UTC","Date Submitted":"03/11/2013 12:11 UTC","Object Flight Path":"Hovering then path","Country":"United States","Sighting Duration":"Undisclosed","Source":"MUFON"}