{"Date of the Event":"01/20/2013 12:13 UTC","Object Features":"Unknown","Region":"Maryland","Latitude":"39.153555","Country":"United States","Case Number":"46133","Summary":"a dark line, surrounded by spiral vapors, with white reflections or lights","Weather Factors":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.153555,+-77.27003(46133)&iwloc=A&hl=en\"> mufon case (46133) map </A>","Log Number":"US-03112013-0009","Longitude":"-77.27003","trends":["There have been 4 other sightings in Germantown","There were no other sightings in Germantown on or around January 20th 2013","This sighting has never been favorited.",""],"Tags":"City","divs":["Sighting DetailsAround noon, on Jan. 20, 2013, I was driving in Germantown, Maryland. I noticed that the Sun seemed to be glaring and rather large in the sky for some reason, so I stopped to take a photo. On March 8, while reviewing photos on my phone, I looked at the photo again. It was then that I first noticed an anomaly towards the top of the photo. Since the shot was taken through my windshield, I thought it must have been something on the shield. But then as I looked more closely, I noticed there was a \"dark line\" through the air, and around it, a tight spiral pattern of vapor or clouds. In a certain area of this dark line, these spiral vapors were quite well lit. It was obviously a part of the photo and was something in the sky at the time. I am posting the story here because I feel this must be something with a simple explanation, perhaps ice crystals or wind shear. Since you folks are experts in studying photos of things in the sky, please help me identify this odd phenomenon. Thanks. Here is the weather for that date in Germantown: JAN 20 2013 - Germantown MD Minimum Temperature 37.4 Mean Temperature 45.3 Maximum Temperature 55.4 Mean Sea Level Pressure - no data Mean Dew Point 23.4 Total Precipitation 0.0 inches Visibility 10.0 miles. Mean Wind Speed 8.98 mph Maximum Sustained Wind Speed 21.0 mph Maximum Wind Gust 33.37 mph"],"Date Submitted":"03/11/2013 12:53 UTC","Sighting Duration":"00:01:00","City":"Germantown","files":["/var/www/straped/mufon/html2text/46133.html.txt","/var/www/straped/mufon/more/46133_submitter_file1__IMAG0221copy.jpg","/var/www/straped/mufon/more/46133_submitter_file2__IMAG0221copy2.jpg","/var/www/straped/mufon/more/46133_submitter_file3__20120120skyobject1.jpeg","/var/www/straped/mufon/org/46133.html"],"Object Flight Path":"Unknown","Object Shape":"Unknown","Disposition":"Unresolved","Viewing Distance":"Unknown"}