{"Object Shape":"Circle","divs":["Sighting DetailsDuring the year of 1984, at a apartment complex parking lot with my sister, both of us experienced the event, but I did not remember until few years later, when my sister and I were talking. We spoke of the moving lights under a huge circular apparatus above our heads, approximately 100' in the air. I completely forgot what happened, but I sensed or felt that a amount of time was missing. In 1994, I exprienced the presence of three individuals, a tall skinny entity, brilliant white light image or form, and two other small black beings with reflective dark eyes. I remember looking at the tall entity, when he placed his middle finger in the center of my forehead, after that I don't remember a thing, except that I woke up very weak. After this event I started making very futurisctic drawings of temples, devices, etc. I developed a better sense towards everything that surrounds me, and today, I still very inspired and motivated with everything that has to do with the unknown. A few years later, by coincidence I discovered a long mark in my genital area, it looks like a perfectly performed laser surgery from top to bottom. In addition, I removed a crystal like object from the back of my head. It was so tiny that I dropped it on the ceramic floor, making the sound of piece of crystal. And I was never able to find it. For samples, please visit my site www.alezones.com this is a living proof of how these experiences changed my life for the better."],"Object Features":"Patterned Surface","files":["/var/www/straped/mufon/html2text/4614.html.txt","/var/www/straped/mufon/more/4614_submitter_file1__IAZrealityDying.jpg","/var/www/straped/mufon/more/4614_submitter_file2__IAZitWas.jpg","/var/www/straped/mufon/more/4614_submitter_file3__14401-229-Temple-in-Honor-t.jpg","/var/www/straped/mufon/more/4614_submitter_file4__IAZSoundGate.jpg","/var/www/straped/mufon/more/4614_submitter_file5__IAZTempleSun.jpg","/var/www/straped/mufon/org/4614.html"],"Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=25.673884,+-80.348357(4614)&iwloc=A&hl=en\"> mufon case (4614) map </A>","Date Submitted":"11/30/1983 04:00 UTC","Disposition":"Unresolved","Source":"MUFON","Summary":"Circular shape with many lights of different colors in 1984, and abduction in 1993","Sighting Duration":"Undisclosed","Case Number":"4614","City":"Kendall","trends":["There have been 9 other sightings in Kendall","There were no other sightings in Kendall on or around November 30th 1983","This sighting has never been favorited.",""],"Tags":"City","Longitude":"-80.348357","Viewing Distance":"21-100 Feet","Log Number":"US-04032006-0007","Date of the Event":"11/30/1983 04:00 UTC","Latitude":"25.673884","Country":"United States","Object Flight Path":"Stationary","Weather Factors":"Windy, Medium"}