{"Object Shape":"Flash, Sphere, Star-like","Latitude":"36.482041","Case Number":"46143","Disposition":"Unresolved","Country":"United States","trends":["There have been no other sightings in Death Valley","This sighting has never been favorited."],"Object Flight Path":"Hovering then path,Path then hovering","Tags":"City","City":"Death Valley","Date of the Event":"03/10/2013 10:00 UTC","Source":"MUFON","Object Features":"Unknown","Summary":"Flashing Lights Suddenly Appear over Mountain Range in Death Valley, Ca.","Viewing Distance":"Over One Mile","divs":["Sighting DetailsMy friend and I drove to Death Valley, Ca., in the hopes of viewing the Comet Panstarrs now visible in the Southwest, but didn't have any luck finding it in the sky from our perspective. We decided to pull over at a random parking lot about 10 miles east of Furnace Creek and just a few hundred feet off of Hwy 190. The sky was very clear with minimal haze around the edges of the Valley. The view of the Milky Way was amazingly clear. We witnessed the occasional commercial airline overhead on it's trajectory to Las Vegas. It was around 10 pm when I noticed an amber colored light rising above the north east mountain range. I turned and asked my friend what planet or star he thought it might be when we noticed moving in quick short accelerations and then suddenly slow, almost to a hover. It was not in a straight flight path as planed operate and appeared to be just over the mountain range to the north of Death Valley. When another plane heading West by Southwest flew overhead, the amber light suddenly changed it's color to flashing red and green light mimicking those of conventional aircraft. We could hear the engines of the jets as they passed overhead at higher altitudes and detected no sound whatsoever, though this object was at a lower altitude above the mountain range and appeared to be closer. Over the course of a few minutes as many as eight flashing lights appeared in relatively close proximity to one another just above the northern mountain range. They appeared to be mimicking the flashing markers of conventional aircraft with their white light with red and a green lights on the wing tips. At one point these lights all remained fairly stationary, as if they were signaling each other. Slowly they began to migrate towards the northeast with at least one set of these flashers traveling parallel to one another."],"Date Submitted":"03/12/2013 03:11 UTC","Longitude":"-116.871246","Log Number":"US-03122013-0003","map":"<A HREF = \"http://maps.google.com/maps?q=36.482041,+-116.871246(46143)&iwloc=A&hl=en\"> mufon case (46143) map </A>","files":["/var/www/straped/mufon/html2text/46143.html.txt","/var/www/straped/mufon/org/46143.html"],"Weather Factors":"Unknown","Region":"California","Sighting Duration":"Undisclosed"}