{"Tags":"City","Disposition":"Unresolved","Date Submitted":"03/11/2013 11:29 UTC","Weather Factors":"Unknown","trends":["There have been 8 other sightings in Brooksville","There were no other sightings in Brooksville on or around March 8th 2013"],"Case Number":"46140","Source":"MUFON","Object Features":"Unknown","divs":["sighting detailsmy husband, children, and i pulled in to my yard after getting some dinner for the kids. the kids ran into the house to eat and my husband and i were slowly getting out of the truck. for some reason i started to walk toward the middle of the yard (away from the house) and thats when i noticed the red ball of light in the sky. i yelled to my husband \"baby come look at this, hurry\" as i was scared it could go away at any time. he came from the truck to where i was standing and we both saw the light. i then told him lets walk away from our tree line to the clear part of the yard. then we had a clear view of it. it was above the trees a little ways out. i am not sure the distance. i first thought (and so did he) that it was a light on a tower or something but quickly realized it was way to high and then it started moving like wobbling around kinda square like.... i kept asking him \"what was it?\" and he kept saying \"i dont know\" ...and kept asking him over and over cause i really thought my own mind\\eyes were playing tricks on me!! and then after a few minutes it just faded right out and disappeared completely into thin air!! it was a very very clear sky that night and we had a very clear view. i then started to search online and thats when i read so many stories about the same things and saw videos of exactly what i saw too and these were all over the world!! i didnt get a pic or video cause i was too scared to take my eyes off it and miss something! really really wish i knew what all these sightings are about!!!"],"Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=28.559232,+-82.380641(46140)&iwloc=A&hl=en\"> mufon case (46140) map </A>","Log Number":"US-03112013-0015","Region":"Florida","City":"Brooksville","Object Shape":"Circle, Fireball","Date of the Event":"03/08/2013 08:30 UTC","Sighting Duration":"Undisclosed","Latitude":"28.559232","Country":"United States","Summary":"My husband and I saw a red fireball like circle over the tree tops that hovered around slowly until it suddenly disappeared completely!","files":["/var/www/straped/mufon/html2text/46140.html.txt","/var/www/straped/mufon/org/46140.html"],"Viewing Distance":"Unknown","Longitude":"-82.380641"}