{"Source":"MUFON","Tags":"City","Disposition":"Unresolved","Latitude":"35.972743","Viewing Distance":"Over One Mile","Region":"North Carolina","map":"<A HREF = \"http://maps.google.com/maps?q=35.972743,+-79.384826(46144)&iwloc=A&hl=en\"> mufon case (46144) map </A>","trends":["There have been 4 other sightings in Graham","There were no other sightings in Graham on or around March 8th 2013"],"Weather Factors":"Unknown","divs":["Sighting DetailsI was standing in my glassed sun room facing due south early in the morning admiring and studying the beautiful stars. It was very dark and the sky was absolutely clear and the stars were shining brightly. I observed, what I thought was an aircraft of some sort on an earlier than normal flight path from Greensboro headed toward Raleigh. I would estimate this path followed the Greensboro-Chapel Hill Highway. The craft crossed over the Cane Mountain Range west to east. It had 3 white lights. 2 pulsing white lights then a space that I would guess at maybe 20 to 30 feet, if my distance and altitude guesses are correct, and then a third white pulsing light. There was also a pinkish glow but no distinct pink or red light observed through my monocular. The speed of the craft was slightly faster than a normal passenger airliner. perhaps 20% faster than most passenger aircraft on this route. It topped the highest point of the mountain by 100 to perhaps 300 feet. The flight control was very smooth and steady. Nothing unusual except the different locations of the lights, I'd never seen before. At approximately 57% of the distance of its flight path it dropped down suddenly and then immediately corrected itself. At approximately 70% of the flight path it suddenly pointed downward to about 7 o'clock from 9'o'clock angle and flashed brightly with a greenish white glow and evaporated into a green glowing tail which faded as it vanished downward. I would guess that it disappeared in the area where the Haw River crosses and separates Alamance and Orange Counties between the Swepsonville community and the Eli Whitney community. It didn't crash and it didn't land. It just vaporized and left only the trail like an asteroid. There was absolutely no sounds at all. I can hear airliner engines easily from my vantage point and do so every day. I wondered if it might be a drone but I think they are smaller by far than what I watched. What I saw was longer than a normal DC 10 and traveled at a faster clip."],"Country":"United States","Date of the Event":"03/08/2013 04:13 UTC","Date Submitted":"03/12/2013 03:37 UTC","Log Number":"US-03122013-0004","files":["/var/www/straped/mufon/html2text/46144.html.txt","/var/www/straped/mufon/org/46144.html"],"Object Features":"Other","Sighting Duration":"00:02:00","Summary":"Saw what looked like a plane with 3 pulsing white lights, 2 front ones close together","Object Shape":"Unknown","Longitude":"-79.384826","Case Number":"46144","Object Flight Path":"Straight-line path,Other","City":"Graham"}