{"Log Number":"US-03122013-0002","files":["/var/www/straped/mufon/html2text/46142.html.txt","/var/www/straped/mufon/org/46142.html"],"Sighting Duration":"00:10:12","Case Number":"46142","Date of the Event":"07/10/2011 08:30 UTC","Country":"United States","Date Submitted":"03/12/2013 01:59 UTC","Tags":"City","Object Shape":"Flash","Object Flight Path":"Straight-line path","Summary":"It was about a football field and half it had 11 lights in a row that flashed so fast faster then a strob light it went nw after I saw and flashed back at it two jets flew buy very slow. I could see energy around it it whent very slow about 8;30 at night.","City":"Tucson","Disposition":"Unresolved","Region":"Arizona","Latitude":"32.103821","Longitude":"-110.999685","divs":["Sighting DetailsI would flash a light every night at the sky .in the summer I would close down the yard and lock the gates after that I would go in side and watch my TV well one night I felt I had to go out side again I felt this energy going threw my body It was a electric feeling I went to lock the gate again and turned around and there wear these lights 11 in a row going north west the lights wear flashing very fast like a strobe light and I could see this glow around it like it had power around it I could also feel there power coming from the lights it was slowly moving over the mountain in front off my house I just flashed my light towards it so that they could see my signal after about 10min or more it just went on its way with out a sound after that I walked towards my door looked up and saw two jets passing over going in the same direction that the lights wear headed buy then the lights wear long gone.I also have seen four other UFO."],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.103821,+-110.999685(46142)&iwloc=A&hl=en\"> mufon case (46142) map </A>","Object Features":"Other","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around July 10th 2011"],"Viewing Distance":"21-100 Feet","Weather Factors":"Unknown"}