{"Viewing Distance":"20 Feet or Less","Summary":"round ball of light that glided very slowly","map":"<A HREF = \"http://maps.google.com/maps?q=32.580983,+-93.892681(46154)&iwloc=A&hl=en\"> mufon case (46154) map </A>","Date of the Event":"06/10/2007 10:30 UTC","files":["/var/www/straped/mufon/html2text/46154.html.txt","/var/www/straped/mufon/org/46154.html"],"Longitude":"-93.892681","Disposition":"Unresolved","Object Shape":"Circle","Source":"MUFON","divs":["Sighting Details I do not know if I am reporting a UFO. I saw something that no one believes me when I tell them what I saw. I am telling you about this hoping maybe you may be able to tell me what I saw. I was standing on my back porch about 10:30pm smoking a cigarette. I saw a large light at the right edge of my yard at the top of the tree line about 40 yards away. I stood there watching the light slowly come toward the house across my yard. It glided very slowly and did not zig zag or waver in any direction, just glided directly towards my house. It finally glided to where I was standing and paused directly in front of me and paused a few seconds. I was in total awe. Not afraid at all. I just stood there looking at it thinking how pretty it was. It glided to the left along the side of the house then over the roof of the house and was gone. I ran to the driveway to see if I could see where it had gone but could not see it any more. It finally dawned on me I had seen something I had no idea what it was and got scared and ran into the house. The light was about the size of a child's basketball and the brightness of the moon. I could look at it and the light did not hurt my eyes. If you have any idea of what it was that I saw, I would love to know. I have heard of ball lightning and I looked that up, but this light did not act like what I saw on the internet and was larger in size and slower moving."],"Country":"United States","Object Flight Path":"Path then hovering","City":"Blanchard","trends":["There have been no other sightings in Blanchard","This sighting has never been favorited."],"Latitude":"32.580983","Case Number":"46154","Date Submitted":"03/12/2013 07:25 UTC","Object Features":"None","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Region":"Louisiana","Tags":"City","Log Number":"US-03122013-0013"}