{"Source":"MUFON","Longitude":"-89.253418","Date Submitted":"07/09/1951 09:05 UTC","Object Flight Path":"Hovering then path","Object Features":"Dome","Sighting Duration":"00:05:03","Viewing Distance":"21-100 Feet","Tags":"City","Case Number":"4615","trends":["There have been no other sightings in Cobden","This sighting has never been favorited."],"Weather Factors":"None","files":["/var/www/straped/mufon/html2text/4615.html.txt","/var/www/straped/mufon/org/4615.html"],"City":"Cobden","Region":"Illinois","map":"<A HREF = \"http://maps.google.com/maps?q=37.531439,+-89.253418(4615)&iwloc=A&hl=en\"> mufon case (4615) map </A>","Summary":"Silver disc about the size of a 70's Volkswagen appeared about 30 feet in front of me and my grandmother.","divs":["Sighting DetailsIn about summer of 1951, my grandmother and I (I was about 8 yrs old) were sitting on her front porch about dusk on a summer evening. We were staring out in front of her house when all of a sudden a silvery disc about the size of a 1970's Volkswagen appeared and was hovering about 3 feet over the gravel road directly in front of her house. The road was about 30 feet in front of her house. The disc had red and green alternating lights around the top of it. It never ever made a single sound. At that time I had not heard of UFO's and had no idea what it could be. My first thought was that I was very scared and should run in the house at once. My next thought was that \"if they were going to get me, they would get me anyway and I wanted to see what was going to happen next.\" My grandmother and I looked at each other as if to say, \"What is it?\" But we never ever said a word to each other or anyone else about it. I told this story for the first time about 10 years later. My grandmother died about 3 years later. To my knowledge, she never told anyone about it. The disc stayed in that position about 5 minutes. It then took off so fast across the field in front of us that it disappeared almost instantly. I am now a pilot. To my knowledge, there was nothing in our world at that time that could behave in that fashion. I have always been fasinated about mysterious events ever since and particularly UFO phenomenen. I also saw a disc like this one about 20 yrs later in Columbus, IN. I will file that report also."],"Disposition":"Unknown","Date of the Event":"07/09/1951 09:05 UTC","Latitude":"37.531439","Log Number":"US-04032006-0008","Country":"United States","Object Shape":"Disc"}