{"City":"Gunnison","Summary":"At about 12:20 in the evening I witnesses a Boomerang shaped object approaching in the night sky. It was silent and dark and had no sound or lights. It glided ever so silent from the East sky to the West and went right over my residence and continued West","trends":["There have been 6 other sightings in Gunnison","There were no other sightings in Gunnison on or around April 22nd 2012"],"Latitude":"38.545399","Date of the Event":"04/22/2012 12:00 UTC","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Source":"MUFON","Log Number":"US-03122013-0015","Date Submitted":"03/12/2013 07:55 UTC","divs":["Sighting DetailsOn April 22nd at about 12:20 am I was outside in my yard hoping to view a few shooting stars. I had heard that there was a meteor shower the day before. The sky was fairly light that night, yet the stars were still visible in the night sky. Approaching from the East I noticed something dark heading my way. I could not tell what it was. It appeared to be Boomerang shaped. For a moment the stars would disappear in the sky as it headed in my direction. It was dark, and silent. There were no lights at all. It almost had a shadow like form in the sky. It seemed to me to be a solid object. I watched it go over my residence, then head into the Western sky. It was traveling in a very straight line. I could not tell how high up it was, but it appeared to be somewhat Low, yet it was much higher than the power lines. It is really hard for me judge what altitude the object was traveling. As I watched it travel West I simply lost sight of it! It was very exciting to see this object overhead and I felt very lucky to have witnessed this ( No matter what it was ) If I had not been looking to the East at that precise moment the object would have gone unseen by me, because it was so silent. I guess you could say I just looked up at the perfect moment and it caught my eye instantly."],"Tags":"City","Object Features":"Wings","Country":"United States","Case Number":"46156","Sighting Duration":"Undisclosed","Longitude":"-106.939608","map":"<A HREF = \"http://maps.google.com/maps?q=38.545399,+-106.939608(46156)&iwloc=A&hl=en\"> mufon case (46156) map </A>","Object Shape":"Boomerang","Viewing Distance":"Unknown","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/46156.html.txt","/var/www/straped/mufon/org/46156.html"],"Region":"Colorado"}