{"Object Flight Path":"Path then hovering","Object Shape":"Triangle","divs":["Sighting DetailsDriving SW on 222 by Adamstown exit in Pa we saw a glowing triangular object flying towards the highway. It hovered a bit and vanished. It was a glowing orange but I could still make out the shape. It was about 8:30-9 at night. My daughter video taped it and we were pretty freaked out. We turned around at the nearest exit and saw a person running right by the highway an it was pitch black. They were in sneakers and gym clothes so I didn't think much of it till I really thought about it. I also saw a car stop on the road by where it happened. In the mining car barely would start due to battery drain. I've been feeling anxious all day since it happened and super paranoid. Cell phone keeps losing battery charge super fast today. I feel super drained and even napped today which I never do. Also, I feel like seeing the UFO was all a blur. I witnessed a UFO when I was 16 and had UFO abduction dreams and some very out of the ordinary experiences throughout my life that make no sense. We did video tape the UFO yesterday. My 11 year old was freaking out saying she didn't want to die and when it vanished she said it died. Our dog kept crying during the occurrence also of our seeing the ufo. We have no idea why she was crying. When we got home she kept acting like she was in rrally bad pain. It just doesn't make sense."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.224165,+-76.065094(46159)&iwloc=A&hl=en\"> mufon case (46159) map </A>","Case Number":"46159","Date Submitted":"03/12/2013 10:20 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/46159.html.txt","/var/www/straped/mufon/org/46159.html"],"Latitude":"40.224165","Log Number":"US-03122013-0018","Longitude":"-76.065094","Viewing Distance":"101-500 Feet","Region":"Pennsylvania","Country":"United States","trends":["There have been no other sightings in Adamstown","This sighting has never been favorited."],"Disposition":"Unresolved","Sighting Duration":"Undisclosed","Tags":"City","Object Features":"None","Date of the Event":"03/11/2013 08:30 UTC","Source":"MUFON","Summary":"Driving home saw UFO for about 2 minutes flying over highway then hovering and vanished . Saw a person running near highway right afterwards. Seemed very odd since it was night and person running by highway.","City":"Adamstown"}