{"Source":"MUFON","Summary":"Observed two objects while waiting to see Pan-STARRS comet 03-11-2013 at 19:30","Case Number":"46150","map":"<A HREF = \"http://maps.google.com/maps?q=34.52571,+-105.86373(46150)&iwloc=A&hl=en\"> mufon case (46150) map </A>","Object Features":"None","Latitude":"34.52571","City":"Undisclosed","Log Number":"US-03122013-0009","Sighting Duration":"Undisclosed","trends":[],"Weather Factors":"Unknown","Date of the Event":"03/11/2013 07:30 UTC","Date Submitted":"03/12/2013 03:59 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/46150.html.txt","/var/www/straped/mufon/org/46150.html"],"divs":["Sighting DetailsI went to a viewing site not far from my home to see the Pan-STARRS comet where there is an unobstructed view of the western horizon. Have been to this location last year to watch sun eclipse, Venus crossing in front of the sun. While scanning the horizon for comet about 19:30 with my Canon 10x30 Image Stabilizer binocular I noticed a long, pencil-like, dark brown object coming up in the western horizon. This was way off in the distance so it looked as if it was under power lines that crossed the area. As I observed it it kept moving up, from left to right, and a very slow pace. My impression was that it certainly wasn't in any hurry to get anywhere. At first I thought it was the comet, but comets aren't this dark and they aim downwards towards the sun with the tail behind. At first I thought this object had a tail too but the length never changed. It stayed the same the entire time I watched it, with no 'trail' disappearing as it flew. As it climbed higher, through and above the power lines, I noticed small flashing red and green lights at the front. I wondered if it could be an airplane but a couple of airplanes flew by with their white flashing lights and white trail. This object just kept on going very slowly in a straight line. As it climbed higher and closer(?) I saw more lights flashing along the entire length of the object from front to back then back to front. The lights were easy to see because of the dark color of the object. My impression of the surface was that it was a little rough, not smooth at all. The light was fading and it got harder to keep track of it but everytime I got back to it it was still on the same flight path. I went back to scanning for the comet when I saw another long, dark, object coming up in the western horizon at just about the same place the first one came from. It looked just like the first one and had the flashing lights. The good news is that while I was watching the second object come up in the horizon I saw the comet a little above it. Looking through the binoculars I would guess the distance between the object and the comet to be about a fist length. Without the binocular I could 'see' both objects way off in the distance. They looked like straight lines and from where I was standing they had to be very long. Observing stopped about 19:50 when it got too dark to see anything. Unfortunately, I didn't take my camera or telescope with me."],"Longitude":"-105.86373","Region":"New Mexico","Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","Object Shape":"Cylinder","Tags":"City","Disposition":"Unresolved"}