{"Sighting Duration":"Undisclosed","Summary":"The clearest blue sky in weeks and this passes by I wouldn't have noticed if the morning sun hadn't reflected off of it","Date Submitted":"03/12/2013 11:30 UTC","trends":["There have been 3 other sightings in Alpharetta","There were no other sightings in Alpharetta on or around March 8th 2013"],"Source":"MUFON","Weather Factors":"Unknown","City":"Alpharetta","Object Flight Path":"Straight-line path","Object Shape":"Cigar","Object Features":"Other","Longitude":"-84.28859","Region":"Georgia","Viewing Distance":"501 Feet - 1 Mile","divs":["sighting detailsi was letting the dog run in the back yard and enjoying one of the bluest skies we have had in weeks. i live within 35 miles of hartsfeild intl ap, 25 from pdk and 15 from dobbins and it struck me that the only plane in the sky was one that just passed over at about 20-25,000 feet heading 32 deg nw. usually i can see the remains of a contrail that last for ever and that's when i really let the blue sky soak in, there no trails in the sky. the sky was void of clouds and trails. just as i turned my attention to the southern sky something caught my eye. it was different from the usual cesnas that fly over or jets coming and going. at first i thought it was a drone so i grabbed my camera and took a picture. the picture looks nothing like what i was seeing with the naked eye. what i saw with my eyes was a silver\\grey object that looked the same at one end as it did the other. it was narrow in vertical depth and i would say it was 5-7 times longer than it was tall. i mentioned it was shiny but it also seem to give off a white light from back to front and top to bottom almost as if it was passing through a micro cloud but it didn't trail the body. it just passed by in a straight line without a sound. out of the 5 pictures i shot i manged to capture it once. it was impossible to find on my screen so i just continued taking pictures hoping to capture it. strange results, i'll let you professionals make the call. enclosed are 2 views of the same picture i zoomed in so you could see the results better."],"map":"<A HREF = \"http://maps.google.com/maps?q=34.084276,+-84.28859(46162)&iwloc=A&hl=en\"> mufon case (46162) map </A>","Tags":"City","Disposition":"Unresolved","Date of the Event":"03/08/2013 09:30 UTC","Country":"United States","Log Number":"US-03122013-0021","Case Number":"46162","files":["/var/www/straped/mufon/html2text/46162.html.txt","/var/www/straped/mufon/org/46162.html"],"Latitude":"34.084276"}