{"Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/46165.html.txt","/var/www/straped/mufon/org/46165.html"],"trends":["There have been no other sightings in Mira Loma","This sighting has never been favorited."],"Object Flight Path":"Straight-line path,Other","Case Number":"46165","Country":"United States","Latitude":"33.988759","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.988759,+-117.517512(46165)&iwloc=A&hl=en\"> mufon case (46165) map </A>","Source":"MUFON","Longitude":"-117.517512","divs":["Sighting DetailsI went out side with my dog. an sat down facing south. I was looking up at the stars an air liners going over head. when I noticed a jet weaving back an forth to the east I got up an called my dad out side and we watched it fly over an off. then as we were finishing talking about it an he was about to step back in side i was looking up from the chair again. an i noticed a light with looked like a star moving across the sky from the south west, west sky over us in a almost strait but turning more to the north tell it vanished into the horizon of the north. it was blue white like a star but it moved across the sky in a matter of a few min. it was much higher than a jet but closer then the moon would be. I have live in this same area an have seen these lights here since i was a kid. I have always called them wandering stars, but when i was a kid i was always told they were satellites. but i know now most satellites site at geostationary orbit. an the others that do move travel west to east an they dont preform the turns ive seen... on some nights we've seen multiple ones. i have seen several emit bright white light. other make hard turns an can fly in the sky for upwards of 20 min. an the go from a slow pace to a fast dart across the sky then back to slow again. ive had lots of Friends an family see these events with me. but we cant explain them. Ive never reported any before because i didnt know about this site. thanks to the history channel i do now so all keep reporting ones I see."],"Disposition":"Unresolved","Weather Factors":"Unknown","Log Number":"US-03132013-0002","Date Submitted":"03/13/2013 12:12 UTC","Region":"California","City":"Mira Loma","Object Features":"Unknown","Date of the Event":"03/12/2013 08:40 UTC","Summary":"me an my father just saw a star like light travel across the sky from the south west, west to the north,","Object Shape":"Star-like"}