{"City":"Columbus","Weather Factors":"Unknown","Longitude":"-85.91724","Viewing Distance":"Unknown","Source":"MUFON","Country":"United States","Date Submitted":"04/10/1972 07:05 UTC","trends":["There have been 14 other sightings in Columbus","There were no other sightings in Columbus on or around April 10th 1972"],"Tags":"City","Object Shape":"Disc","Date of the Event":"04/10/1972 07:05 UTC","Object Flight Path":"Undisclosed","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=39.21053,+-85.91724(4616)&iwloc=A&hl=en\"> mufon case (4616) map </A>","Summary":"A silvery disc with red and green alternating lights around the top of it appeared about 30 feet in front of me at tree top level moving slowly across the sky not making a single sound.","files":["/var/www/straped/mufon/html2text/4616.html.txt","/var/www/straped/mufon/org/4616.html"],"Region":"Indiana","divs":["Sighting DetailsI had heard reports the night before in this small town of people seeing a UFO. The next night, I was determined to see it also if it came. I was waiting with my 8 year old daughter on our back patio. About dusk, here it came. It was silvery in color, had red and green alternating lights around the top of it and was about the size of our 1970 Volkswagen. It was about 30 feet in front of us and was tree top level. It just moved across the sky in front of us and disappeared on the horizon to our left. It never ever made a sound. I reported this to the local police station at that time. There was a lot of other people in that town that night that saw the same thing and reported it also. I was very fasinated by it since I had seen that same thing back in about 1951 with my grandmother on her front porch when I was about 8 years old. This event occurred in either the spring, summer, or fall. The year is an approximate. My timing couldn't be off more than a year or two I think. The incident with my grandmother has been reported also."],"Log Number":"US-04032006-0009","Latitude":"39.21053","Object Features":"Undisclosed","Case Number":"4616","Sighting Duration":"Undisclosed"}