{"Tags":"City","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Latitude":"30.57315","Viewing Distance":"Unknown","Log Number":"US-03132013-0023","Region":"Mississippi","Longitude":"-89.455224","divs":["sighting detailsi was outside waiting for the sun to set so i could observe the comet panstarrs on mar 12, 2013. the sun's lower limb had just touched the horizon(not true horizon) and the object appeared for a brief moment directly above the sun. it appeared as though two plates were facing each other with a gap in the middle, the object was well lit between the two plate shapes with a white light that extended to what would be the edge. the two plates appeared red\\orange this color i beleaved to be caused by the setting sun. only thing is i didn't understand how the top plate could be colored by the sun because the sun was below it. the object was only visible for a minute or so and then just disappeared. no movement at all in any direction. interestingly this object was observed again at a different location(about 15 miles further to the west) the very next night.(today march 13,2013) in the same relative position to the sun at the same time of sun set. i first thought it might be the iss, or even a geo stationary satellite, but there was no movement. only and appearance and then just disappeared. i was a commercial pilot for over 45yrs. and quite familiar with aircraft of all(most) types. btw: i did see the comet later on after the sun had disappeared below the horizon."],"Weather Factors":"Unknown","Date Submitted":"03/13/2013 11:40 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=30.57315,+-89.455224(46187)&iwloc=A&hl=en\"> mufon case (46187) map </A>","Object Features":"None","City":"Perkinston","Object Flight Path":"Stationary","trends":["There has been one other sighting in Perkinston","There were no other sightings in Perkinston on or around March 12th 2013"],"Summary":"Just prior to sunset waiting to observe the comet PanSTARRS the object appeared directly above the setting sun","Object Shape":"Blimp, Oval","Source":"MUFON","Date of the Event":"03/12/2013 07:30 UTC","Country":"United States","Case Number":"46187","files":["/var/www/straped/mufon/html2text/46187.html.txt","/var/www/straped/mufon/org/46187.html"]}