{"Object Features":"None","Log Number":"US-03142013-0003","files":["/var/www/straped/mufon/html2text/46191.html.txt","/var/www/straped/mufon/org/46191.html"],"Sighting Duration":"Undisclosed","Date of the Event":"03/13/2013 10:55 UTC","Longitude":"-122.396907","Summary":"4 yellow orange spherical objects puslating slowly traveling east slightly and then ascending above clouds","Case Number":"46191","Region":"Washington","Object Shape":"Sphere","Viewing Distance":"Unknown","Disposition":"Unresolved","City":"Camas","Country":"United States","Weather Factors":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=45.587752,+-122.396907(46191)&iwloc=A&hl=en\"> mufon case (46191) map </A>","Latitude":"45.587752","trends":["There have been 4 other sightings in Camas","There were no other sightings in Camas on or around March 13th 2013"],"Tags":"City","Object Flight Path":"Hovering then path","Date Submitted":"03/14/2013 02:26 UTC","divs":["Sighting DetailsI was walking back from the Safeway on 3rd Avenue, taking the back way along 2nd Avenue in downtown Camas, WA. I looked up as I was in between 2nd and 3rd Avenue and noticed 4 yellow-orange spherical objects in a near horizontal line about 50 degrees above the horizon. At first I glanced away because planes frequent the area (The PDX airport is across the river) but it's strange to see 4 planes so close together so I took a second look and noticed that they weren't blinking like standard planes, nor were they the same color or moving in the same pattern. Instead they all hovered around a bit (5-10 seconds) while their glow changed slowly in intensity between bright and not as bright. Then the right most (from my POV) object began to rise in a non-linear pattern to the right and up, with the others following loosely and slowly behind it. I watched the right-most object disappear above the clouds at about 60 degrees above the horizon. Just after that happened, the next right-most object picked up it's pace again and ascended above the clouds around the same position the last one did. I continued to watch the remaining two objects do the same thing before coming in and finding somewhere to report it. After viewing it, I am almost certain they were not planes, but I can't help but wonder if they were possibly weather balloons."]}