{"map":"<A HREF = \"http://maps.google.com/maps?q=29.138316,+-80.99561(4619)&iwloc=A&hl=en\"> mufon case (4619) map </A>","Latitude":"29.138316","Log Number":"US-04032006-0012","Viewing Distance":"101-500 Feet","City":"Port Orange","Region":"Florida","files":["/var/www/straped/mufon/html2text/4619.html.txt","/var/www/straped/mufon/org/4619.html"],"Sighting Duration":"Undisclosed","Tags":"City","divs":["Sighting DetailsI WAS A FRAMING SUB CONTRACTOR BUILDING A HOUSE IN A PLACE CALLED SPRUCE CREEK FLY-IN. I HAD NINE GUYS WORKING FOR ME AND THE PRIME CONTRACTOR WAS WALKING UP TO THE HOUSE WITH THE REST OF US, GETTING BACK FROM LUNCH. JUST BEFORE WE ENTERED THE FRONT DOOR, I POINTED TO AN OBJECT AND ASKED EVERY ONE, STOP! WHAT THE HELL IS THAT!I ADMIRE AIRCRAFT AND KNOW THE MACHANICS IT TAKES TO FLY. THIS WASN'T NORMAL. IT WAS DEAD STILL, METAL, SHINING AS IF HOT, ABOUT 500' UP AND 300' OVER, IT WAS ABOUT 10 DEGREES OUT OF PLUMB. NO SURFACE DETAILS,ON THRUST TRAIL,ON LIGHTS,JUST HANGING THERE!A CYLINDER ABOUT 40' WIDE AND 80'TALL.I ASKED EVERY ONE IF THEY EVEN SEE SOMETHING AT ALL. THEY ALL SAID YA! I ASKED EACH ONE AT A TIME,WHAT IS IT. I DON'T KNOW THEY SAID. FROM LABORER TO THE PRIME CONTRACTOR, NO EXPLANATIONS. WE WATCHED IT FOR ABOUT THREE MINUTES AND EVERY ONE ELSE LOST INTEREST AND WENT TO WORK, I LAYED DOWN ON A STACK OF PLYWOOD AND WATCHED IT FOR ABOUT 15 MINUTES LONGER, BUT THERE WAS ON CHANGE. EVETUALY, I WENT BACK TO WORK. 5 MINUTES LATER I CHECKED ON THE OBJECT AND IT WAS GONE. I SHOULDN'T HAVE GOTTEN UP. EVERY ONEC IN A WHILE I SEE THOSE GUYS AND QUIETLY ASK, REMEMBER! THEY CAN'T DENY IT. I HADN'T THOUGHT MUCH ABOUT IT LATELY, BEING BUSY WITH WORK AND EVERY THING. (UNTIL)! I WAS WATCHING T.V. AND THERE IT WAS ON A U.F.O. SHOW. THE FLYING BARREL P.S. MAYBE THE FILM WAS OF THE SAME EVENT WE SAW ! IF SO, I WOULD LIKE IT ON MY P.C. WALL PAPER."],"Disposition":"Unresolved","Object Flight Path":"Stationary","Object Features":"None","Country":"United States","Source":"MUFON","Date of the Event":"06/01/1988 12:00 UTC","Object Shape":"Cylinder","Weather Factors":"Unknown","Longitude":"-80.99561","Case Number":"4619","Date Submitted":"06/01/1988 12:00 UTC","trends":["There have been 4 other sightings in Port Orange","There were no other sightings in Port Orange on or around June 1st 1988","This sighting has never been favorited.",""],"Summary":"11 PEOPLE SAW A HOVERING MATALIC BARREL 500' UP"}