{"Tags":"City","Object Features":"Dome","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been no other sightings in Londonderry","This sighting has never been favorited."],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/46198.html.txt","/var/www/straped/mufon/org/46198.html"],"Summary":"Flattened dome with trail of different colored lights at bottom (cone shaped)","Case Number":"46198","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Region":"Nova Scotia","Date Submitted":"03/14/2013 03:32 UTC","City":"Londonderry","Date of the Event":"09/27/2012 07:15 UTC","Log Number":"CA-03142013-0010","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.477477,+-63.594621(46198)&iwloc=A&hl=en\"> mufon case (46198) map </A>","Object Shape":"Disc","Latitude":"45.477477","Country":"Canada","Disposition":"Unresolved","Longitude":"-63.594621","divs":["Sighting DetailsSept. 27, 2012 UFO Sighting Between 7:15 and 7:40pm in Londonderry, twenty miles from Truro N.S, Canada, a circular object was seen from a southwest facing apartment window. The lady who lives there, Brenda Paris, was watching the object drift slowly across the south Truro area, following the Salmon River out to the top of the Bay of Fundy (Cobequid Bay). She was speaking to her friend, Peggy Pearson, on the phone, describing the object as having a fiery tail that resembled a plane on fire and shaped like an ice creram cone. There was no turbulance, smoke or con-trail coming from the object, and it moved far too slow for it to be a plane. She turned to get a camera but when she returned to the window, the object was gone. She ended the call by describing the object to Peggy. Peggy, (Margaret Pearson), who lives in Londonderry, a village on the northern side of Cobequid Bay, finished talking to Brenda, then sat at her kitchen table to watch the birds fly across her open and un-used pasture. She noticed a bright white light that she first thought was a reflection of the early moon on a piece of polished glass that hangs as an ornament in the center of the large bay type window. On closer study of the glow, she saw that there was a btight white circular object hovering above the pasture, about 100 ft up. Below the object was a cone shaped tail that was bright red. She said it looked just like an ice-cream cone except for the color. The object continued to hover in that same place for about 20 minutes. Suddenly it appeared to blink out of existence, only to almost instantly re-appear miles away, hovering over what we estimate is the Economy area. Peggy then called 2 friends who have a better view of the area that the object had moved to. She then got her binoculars and was surprised to see that what she first thought of as a red cone was now showing green, white and red streams of light. The outer streams were red, giving the red cone appearance. Matt and Candace watched the object for 4 or 5 minutes then returned inside. Matt said the object blinked and disappeared just before he and Candace went inside. The object wasn't seen again. No video or still shots were taken of the object that we know of. Anyone who also saw this object can call Peggy at 902-986-4085."]}