{"Region":"Alabama","Date Submitted":"08/15/1978 12:00 UTC","Longitude":"-86.088585","Object Flight Path":"Path with directional change","trends":["There have been no other sightings in Attalla","This sighting has never been favorited."],"Case Number":"4620","Sighting Duration":"Undisclosed","City":"Attalla","divs":["Sighting DetailsI was piloting a Piper Cherokee 140 airplane returning to the Gadsden Airport after some recreational flying approaching from the north about 5 miles out when I passed the object at about 1000 Ft. above ground level. It was about 20 ft. off of my left wing. It was about 3 feet in diameter, tan in color, and looked like a weather balloon except that it had no inflation nozzle, no radiosonde attached to it, and it was perfectly round. Weather balloons have a teardrop shape to them when strapped to a weather gathering payload. I circled back to get a closer look and noticed what appeared to be a red crecent moon or a hammer and sicle shape on it reminicent of the emblem on the former Soviet flag. As I circled around a second time to get closer look, the object moved away from me and maintained a distance of about 50 to 75 yard spacing between itself and my plane. When I became aware that the object could manuver, I was certainly rattled. I tried to pursue the object about a minute or two but it accellerated away to the point that I could not keep up with it. I was traveling at 120 knotts. Scared, I opted to return to the Gadsden Airport. When I arrived home, I reported the sighting to the Anniston Flight Service Station. I believe the attendant at the FSS was unofficially impressed, but I don't know weather or not he officially filed my report. I believe the UFO to be either alein, a Top Secret USA probe, or the Russians aren't telling us something. I maintain that what I saw was not a weather balloon and flew under it's own power. I strongly believe the markings were used camoflage the UFO to be from Earth."],"Viewing Distance":"20 Feet or Less","Disposition":"Unknown","Summary":"Tan in color, 3FT dia. like a weather baloon but perfectly round with a red crecent moon shape on it.","Date of the Event":"08/15/1978 12:00 UTC","files":["/var/www/straped/mufon/html2text/4620.html.txt","/var/www/straped/mufon/org/4620.html"],"Weather Factors":"Unknown","Object Shape":"Sphere","Log Number":"US-04032006-0013","map":"<A HREF = \"http://maps.google.com/maps?q=34.021764,+-86.088585(4620)&iwloc=A&hl=en\"> mufon case (4620) map </A>","Latitude":"34.021764","Source":"MUFON","Object Features":"Insignia","Tags":"City","Country":"United States"}