{"Longitude":"-97.594755","files":["/var/www/straped/mufon/html2text/46212.html.txt","/var/www/straped/mufon/org/46212.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=49.354581,+-97.594755(46212)&iwloc=A&hl=en\"> mufon case (46212) map </A>","Object Flight Path":"Straight-line path","Case Number":"46212","Object Features":"None","Object Shape":"Disc","Summary":"UFO Hovering Over Airplane","Country":"Canada","Region":"Manitoba","divs":["Sighting DetailsI was walking my parents dog on a gravel road near their farm approximately 3 miles outside of the town of Lowe Farm when I saw a low flying Airplane coming towards me at a fairly low altitude heading in a southwest direction in a straight line of travel, I noticed that there was a grey object directly above this airplane as it appeared very metallic and shiny which instantly caught my eye. I am not certain as to how many feet above the plane this object was but estimate it was several thousand feet. It was close enough to tell that it had a large diameter, and produced no noise on top of the noise from the low flying airplane. The object that I witnessed appeared to be an exact match to a sighting that I witnessed on December 12 2011 in Morris, MB. The major difference in this case is that There was no smell of sulphur as I witnessed before, and that this object was moving at a faster rate of speed. I was able to view both the airplane and the object for approximately 2 minutes before losing sight of them. I was not physically affected in any way by the object and did not have any devices on me at the time so it is unknown as to whether or not there was electrical interference at the time. I was unable to see this object as clearly as I did on my Dec 12 2011 sighting but am almost certain that the object was indeed identical. I have been watching the skies in this region since my first sighting and this has been the first UFO I have witnessed since that time."],"Date Submitted":"03/15/2013 02:58 UTC","City":"Lowe Farm","Tags":"City","Latitude":"49.354581","trends":["There have been no other sightings in Lowe Farm","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Source":"MUFON","Viewing Distance":"Over One Mile","Disposition":"Unresolved","Weather Factors":"Unknown","Date of the Event":"03/14/2013 04:20 UTC","Log Number":"CA-03152013-0005"}