{"Object Shape":"Diamond","Latitude":"20.680354","Sighting Duration":"00:07:23","Object Features":"Unknown","divs":["Sighting DetailsMorning time around 9:00 clouded sky, I was trying to connect to the internet on my wifi network but it was not working, so I decided to go to the rooftop and water my plants. Then I noticed movement on the hoirzon line, from south to east I noticed a dimond like shape object hovering (Seemed to rotate on its own axis) over the houses in a straigth line, at first I thought it was a ballon but its movement was to precise to be a ballon then it started to descend when I think it noticed me looking and trying to focus my cell phone camera. At first you cant believe that is happening to you, seems so surreal you think your eyes are deceiving you, I got a little bit frightenned when i believe the object seemed to know that it was being witnessed. I lost sight of the object when it started to descend behind the houses like a mile or so from to the north east from where I was standing. a short sighting in time it lasted for about four minutes and also it is the first time I lay eyes on an actual UFO."],"City":"Guadalajara","Log Number":"MX-03152013-0010","Object Flight Path":"Straight-line path","Tags":"City","Summary":"hovering over the neighborhood, in straigth line then seemed to descend after a four minute flight","Region":"Jalisco","map":"<A HREF = \"http://maps.google.com/maps?q=20.680354,+-103.335478(46218)&iwloc=A&hl=en\"> mufon case (46218) map </A>","Longitude":"-103.335478","trends":["There have been 8 other sightings in Guadalajara","There were no other sightings in Guadalajara on or around March 15th 2013"],"files":["/var/www/straped/mufon/html2text/46218.html.txt","/var/www/straped/mufon/org/46218.html"],"Date of the Event":"03/15/2013 09:12 UTC","Source":"MUFON","Disposition":"Unresolved","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Case Number":"46218","Country":"Mexico","Date Submitted":"03/15/2013 12:56 UTC"}