{"City":"Palm Springs","Sighting Duration":"00:15:00","Disposition":"Unresolved","Object Flight Path":"Stationary","Tags":"City","Country":"United States","Source":"MUFON","Longitude":"-116.537682","Latitude":"33.830353","Log Number":"US-03152013-0015","Object Features":"Unknown","Date Submitted":"03/15/2013 04:29 UTC","files":["/var/www/straped/mufon/html2text/46225.html.txt","/var/www/straped/mufon/org/46225.html"],"Weather Factors":"Unknown","Case Number":"46225","trends":["There have been 23 other sightings in Palm Springs","There were no other sightings in Palm Springs on or around March 15th 1991"],"Region":"California","Date of the Event":"03/15/1991 12:00 UTC","Object Shape":"Circle, Sphere","Summary":"Was lying in bed when a red light streamed through the window. When i looked outside i saw a small red orb above the telephone line.","Viewing Distance":"20 Feet or Less, 21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=33.830353,+-116.537682(46225)&iwloc=A&hl=en\"> mufon case (46225) map </A>","divs":["Sighting DetailsIn 1991 i lived with my mother and two younger siblings. I was 8 at the time. My siblings and I often slept together in my room and this was a night of no exception. We had gone to bed like normal, around 9pm, and I was in between my siblings in bed. I remember not sleeping well and waking up several times. The head of my bed laid just under the large bay window in the room and we had horizontal blinds which were closed. I presume it was sometime between midnight and 3am when I woke to see red light streaming into the room. The room was in the back of the house and we had an unusually positioned garage which stood alone in the backyard and could be seen clearly from the window and just behind that in the corner was a telephone pole, which could also be seen clearly from the window. Thinking my mother must be in the garage I looked through the window to see what she was doing. I looked out and saw the garage was closed and hanging just above the telephone pole was a red orb. The light was bright red and illuminated the telephone pole, garage and surrounding area. The orb was no more than a foot or two in diameter and I watched it for a minute, probably less. And then, almost instantly it was in front of the window and large, more like 10-15 feet in diameter, literally like a flash, telephone pole to window. I remember most vividly the paralyzing fear that I felt, I tucked my head under the blanket and just wished for it to go away. When I poked my head out again the light was gone but the fear remained. I mustered up my courage and looked out the window again and it was gone. I felt a tinge of relief, but still very uneasy. Then i looked toward the bedroom door and what I saw there I will NEVER forget. The bedroom door was directly across from the window and on the other side of the door was a \"family room\" with huge windows that stretched the length of that wall, probably 15 feet of windows. The bedroom door was closed and then I noticed it, the light, the same bright red, it was on the other side of the door. The light was so bright and it completely framed the door, streaming through the cracks like a floodlight. I was sitting up just looking at the door paralyzed with a panicky fear that could not be shaken. Then I saw them. Feet. Little feet, like children's feet moving in front of the door, at least two pairs, probably more. And then I watched the doorknob start to turn. And then I woke up. I don't remember anything else and have not done any regression, which I should probably do. I do believe that this was a real experience and not a dream. I do believe something happened that night, whether terrestrial or not something happened that night and whatever this one was it was not the good kind. I have had other experiences which i will report later but this one was not the same. If there are benevolent and malevolent beings out there this was definitely the later. Since we don't live there anymore you can type in \"2141 North Girasol Avenue, Palm Springs, CA\" on google maps to see the house that this incident occurred at. You will see the free standing garage, top left of property, and the telephone pole, also top left corner. The bedroom we slept in is in between the small cropping on the roof and the funky little shed that faces the garage."]}