{"files":["/var/www/straped/mufon/html2text/46222.html.txt","/var/www/straped/mufon/org/46222.html"],"Longitude":"-74.87128","divs":["Sighting Details1 I was at my families house on Marcel lake in Penn. It was night and I was standing on the back balcony looking at the sky. 2 I first noticed the object, which looked like a satelite, moving from west to east. All of a suddenly it stopped and changed direction. 3 It looked like the space station that I saw in the past. 4 As the object was moving in a straight line going from west to east it suddenly stopped and change direction to north northeast at a very high speed. Then a boomerang shape with one side blue and the other side green attacked the spot where the ufo would have been if it kept its direction. The lights could have been lasers or jets which left a short trail going north then disappeared. 5 At first I thought it was a satelite or space station, but when it stopped and change direction I felt I saw a ufo. Then when it was targeted by the boomerang, I thought that we were fighting aliens or aliens fighting each other. I then told my wife who was skeptical. 6 The satelite ufo went away very fast and the boomerang seemed to disappear as it ran out of momentum."],"Country":"United States","Object Shape":"Boomerang, Sphere","Case Number":"46222","City":"Dingmans Ferry","Tags":"City","Source":"MUFON","Date of the Event":"09/15/1991 12:00 UTC","Object Features":"Wings","Latitude":"41.220095","Viewing Distance":"Unknown","Summary":"Following what looked like a satelite which abruptly stopped and changed direction Then a boomerang shape with green and blue beams went to the spot where the ufo would have been","map":"<A HREF = \"http://maps.google.com/maps?q=41.220095,+-74.87128(46222)&iwloc=A&hl=en\"> mufon case (46222) map </A>","Weather Factors":"Unknown","Region":"Pennsylvania","Log Number":"US-03152013-0013","Date Submitted":"03/15/2013 03:16 UTC","Object Flight Path":"Straight-line path,Path with directional change","trends":["There have been 3 other sightings in Dingmans Ferry","There were 2 other sightings in Dingmans Ferry on or around September 15th 1991"],"Sighting Duration":"00:00:30","Disposition":"Unresolved"}