{"Weather Factors":"Unknown","Tags":"City","divs":["Sighting DetailsThis was an incident that I cannot explain, nor can I confirm that it is related to aliens. I honestly have no clue what it was. Long story short, I was in Leavenworth, WA at a Compressed EMT course. One night sleeping in my room, I woke up immediately alert to what was going on, no drowsiness at all. I woke up with my arms crossed, hands extremely high on my shoulders. My shoulders were stuck to my chest. (I had 4 to 5inch long hair) I could see my hair blowing in the breeze to my right. Then I could feel the wind in my beard going to my left. I couldn't hear anything except the sound of wind(similar sound to sticking your head out of a moving vehicle). I tried for just shy under a minute to free my arms. Once I finally broke my arms away from my chest, the wind stopped and I fell to my bed. The fall was about 1 foot or so. My head hit the bed, then my feet hit the bed. Then I had a warm pleasant feeling come over me. You know that feeling you would imagine a puppy to have when you put it down. That's what I felt like, like I was being put back down. -- The reason I am reporting this now, is I just found your site. I was looking into a Giant Bright blue flash in the sky this evening around 222AM just South of San Francisco. The flash radiated from the ground and shot into the air, turning the better part of the sky blue. There was no bang or thunder. Also, a week ago I saw an orb in the distance, flashing many different colors in the same part of the sky. The flashing orb I do have a witness to."],"Country":"United States","files":["/var/www/straped/mufon/html2text/46233.html.txt","/var/www/straped/mufon/org/46233.html"],"Latitude":"47.75262","Object Features":"Unknown","Source":"MUFON","trends":["There have been no other sightings in Leavenworth, CA","This sighting has been favorited 1 time."],"Date of the Event":"03/12/2012 12:00 UTC","Object Flight Path":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=47.75262,+-120.753983(46233)&iwloc=A&hl=en\"> mufon case (46233) map </A>","Viewing Distance":"N/A","Case Number":"46233","City":"Leavenworth, CA","Region":"Washington","Longitude":"-120.753983","Disposition":"Unresolved","Summary":".....","Log Number":"US-03162013-0004","Sighting Duration":"Undisclosed","Object Shape":"Blimp","Date Submitted":"03/16/2013 09:36 UTC"}