{"Latitude":"36.123526","Date of the Event":"03/15/2013 08:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.123526,+-115.164006(46230)&iwloc=A&hl=en\"> mufon case (46230) map </A>","Region":"Nevada","Country":"United States","Viewing Distance":"Over One Mile","Case Number":"46230","Log Number":"US-03162013-0001","Summary":"Flashing, directly to the east from las vegas, hovering, magenta, green, white, random turnes","Disposition":"Unresolved","divs":["Sighting DetailsI was reading outside in the dark in my backyard with a flashlight and i had my dog laying next to me and all of a sudden I heard a fimaliar almost hovering noise. I recognized it as a UFO because i have herd it before and around the same time last year i saw it. I first noticed the object because of the almost hovering sound (sounds like a helicopter but without the blades slicing the air but only the air comming down) so i looked at it and being i have seen it before i called a couple people to come and look at it with me. I saw the object hovering when i first saw it in the same place i saw it last year. At first it looked like this - . XXXOOO OOOXXX The X's are red and the O's are green. . EE The E's were magenta flashing lights . At first it lowered itself then it did weird circles again and then dissapered like it did last year. I was shocked again that i have seen it 2ce in my life. I was pretty weird. I lost sight of the object after it dissapeared behind some trees and some houses. Mkay so today is 3-15-13 and it was kind of overcast and a very clear moon. The planet saturn and jupeter are almost align with the moon and it is a creasent moon. There isn't much more to say but i have seen it at the same time last year around this year."],"Object Flight Path":"Stationary,Hovering then path,Path with directional change,Other","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/46230.html.txt","/var/www/straped/mufon/org/46230.html"],"Longitude":"-115.164006","Sighting Duration":"Undisclosed","Source":"MUFON","Date Submitted":"03/16/2013 01:35 UTC","City":"Las Vegas","Object Shape":"Boomerang, Cigar, Other","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around March 15th 2013"],"Object Features":"Unknown","Tags":"City"}