{"Summary":"white orb stationary in sky at least ten minutes very faint dark lines coming from opposite sides, it then began moving slowly in southerly direction descending as it went","trends":["There have been 417 other sightings in Phoenix","There was one other sighting in Phoenix on or around March 15th 2013"],"Country":"United States","Sighting Duration":"00:15:00","map":"<A HREF = \"http://maps.google.com/maps?q=33.576368,+-112.1014(46232)&iwloc=A&hl=en\"> mufon case (46232) map </A>","Date Submitted":"03/16/2013 02:57 UTC","Date of the Event":"03/15/2013 08:30 UTC","City":"Phoenix","Longitude":"-112.1014","Object Flight Path":"Hovering then path","Tags":"City","Object Shape":"Sphere","Case Number":"46232","Disposition":"Unresolved","divs":["Sighting DetailsI was walking with the dog back through the park after walking my daughter to school bus pick up on other side of park. I turned to watch when I heard bus stop to pick up kids, so I know it was right at 8:30 AM, and when I turned back heading west I saw something very white in sky with faint black lines coming from north and south sides of the object as viewed by me. I knew it wasn't a plane because it wasn't moving and it wasn't a helicopter or plane because of its appearance, a smooth white sphere. It stayed in same spot while I crossed a footbridge over a wash and walked slowly with dog towards freeway a little less than a quarter mile from bridge.when I got to freeway it slowly started descending and moving in a southerly direction. I watched it for a few minutes more while it moved I'm guessing around a mile before being obscured by large trees which are just to the west of freeway. your timezone choices doesn't include one for Arizona, no daylight savings time, so I picked Mountain because that's what we are but right now Arizona time is same as Pacific"],"Weather Factors":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/46232.html.txt","/var/www/straped/mufon/org/46232.html"],"Region":"Arizona","Latitude":"33.576368","Log Number":"US-03162013-0003","Object Features":"None","Viewing Distance":"501 Feet - 1 Mile"}