{"trends":["There have been no other sightings in Higüey","This sighting has been favorited 1 time."],"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/46238.html.txt","/var/www/straped/mufon/org/46238.html"],"Summary":"Entity contact and sighting.","map":"<A HREF = \"http://maps.google.com/maps?q=18.616249,+-68.70771(46238)&iwloc=A&hl=en\"> mufon case (46238) map </A>","Region":"La Altagracia","Case Number":"46238","Country":"Dominican Republic","divs":["Sighting DetailsIt was not a UFO. I am reporting this on behalf of my mother who is 76 but in perfect state of mind. I can assure you that she is not the type of person that makes up anything, specially to me. She withhold this information for a few months because I have recently had surgery and she did not want to make me nervous. She was lying in bed next to my nephew when she felt something lightly hit her face, above the left eye. She opened her eyes and with her right eye saw what she described to be something like a small computer card with many wires connected to it. She stood up and saw a very big figure standing next to her. She describes the figure like a large gorilla with what appeared to be a \"poncho\" type white robe around it. The figure emanated light rays from it toward the outside of the room but also all around it. She was so startled that she could not scream. The figure then started to fade for a few seconds until it disappeared completely. About two or three minutes afterward my brother walked in and saw her still a bit scared. Nobody else was in the area. For what its worth I relate this to you and can assure you that this is exactly what she said."],"Log Number":"DO-03162013-0009","Longitude":"-68.70771","Tags":"City","Date of the Event":"11/15/2012 12:00 UTC","City":"HigÃƒÂ¼ey","Object Flight Path":"N/A","Disposition":"Unresolved","Object Shape":"Unknown","Sighting Duration":"00:03:00","Viewing Distance":"20 Feet or Less","Latitude":"18.616249","Date Submitted":"03/16/2013 06:39 UTC","Source":"MUFON","Weather Factors":"Unknown"}