{"Case Number":"46237","Tags":"City","Region":"Maryland","Summary":"Four clustered lights over Bethesda Maryland","trends":["There have been 2 other sightings in Bethesda","There were no other sightings in Bethesda on or around October 7th 2012"],"Date of the Event":"10/07/2012 06:45 UTC","City":"Bethesda","Longitude":"-77.097479","Sighting Duration":"Undisclosed","Log Number":"US-03162013-0008","Object Flight Path":"Stationary","Viewing Distance":"101-500 Feet, Unknown","Weather Factors":"Unknown","Country":"United States","divs":["Sighting DetailsMy mom was driving me to my psychologist. We were on Rockville Pike, passing the metro, approaching Jones Lane [in which Rockville Pike turns into Wisonsin Avenue] when I saw, near the entrance to the city of Bethesda, four yellow lights clustered together which appeared to be immediately diagonal to an apartment building that can be seen from my view. My iPod was on my lap as I was listening o music on it. I immediately grabbed it and tried recording the lights, but for some reason, they weren't showing up on the screen [maybe they were too far away?] so I deleted the recording and waited to do it again when I got closer. I put it down on my lap and continued listening to music. The strange lights were still there. However, once I got close enough to record, before when I actually could start doing it, they disappeared like swictching off a light! My mother was the one driving and I do remember mumbling to her, asking if she seen that, but I don't think she heard me. I did not articulate voice any further to ask her again as she is not into these kinds of things."],"Object Features":"None","Date Submitted":"03/16/2013 06:00 UTC","files":["/var/www/straped/mufon/html2text/46237.html.txt","/var/www/straped/mufon/org/46237.html"],"Latitude":"39.009513","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=39.009513,+-77.097479(46237)&iwloc=A&hl=en\"> mufon case (46237) map </A>","Object Shape":"Unknown","Source":"MUFON"}