{"Source":"MUFON","Date Submitted":"03/17/2013 08:53 UTC","Region":"Connecticut","Longitude":"-72.53499","Latitude":"41.781609","divs":["sighting detailsi did not see the object myself but was told about it by a friend on feb 19th. she viewed a glowing orange object in the night sky feb. 14th around 9pm. she lets her dog out every night at 9pm and has a cigerette. while the dog was in the yard she notices a glowing object flying above the trees but below the cloud line. it did not have any lights on it and was not round but oblong. it flew aross her yard\\house in a south to north direction above her in a straigt line and did not waver or dip. it made no noise at all, she only heard street car noise from the road she lives on. she watched it fly over her yard and over the elementary school that is also on the road she lives on until it was out of sight. she told me she was terrified because she had never seen anything like that in her life. she watched it for more than 30 seconds to minute in a half and then ran in the house and told her friend what she had just saw. i asked her if it could have been an airplane going into bradley airport and she said there where no lights on it, it glowed. i also thought it might be a advertising blimp from the nearby rentschler field but she see's those frequently and insists it was not that. we have discussed this 3 seperate times and she says the same story. i have asked but she will not report this herself and does not want anyone investigating her. she knows i am involved in mufon and asked me to see if anyone else reported or saw anything like this in our area. i emailed the fi in our area and he told me to report it so the event is recored."],"Tags":"City","City":"Manchester","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.781609,+-72.53499(46245)&iwloc=A&hl=en\"> mufon case (46245) map </A>","Case Number":"46245","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"02/14/2013 12:00 UTC","Summary":"I was asked if I saw or knew about a glowing orange object in night sky","files":["/var/www/straped/mufon/html2text/46245.html.txt","/var/www/straped/mufon/org/46245.html"],"Object Shape":"Oval","Log Number":"US-03172013-0005","Disposition":"Unresolved","Object Flight Path":"Straight-line path","trends":["There have been 14 other sightings in Manchester","There were no other sightings in Manchester on or around February 14th 2013"],"Object Features":"None","Sighting Duration":"Undisclosed"}