{"Log Number":"CA-03172013-0013","Object Flight Path":"Straight-line path","City":"Miramichi","Date of the Event":"09/01/2012 11:15 UTC","files":["/var/www/straped/mufon/html2text/46253.html.txt","/var/www/straped/mufon/org/46253.html"],"Sighting Duration":"00:03:00","trends":["There have been 4 other sightings in Miramichi","There were no other sightings in Miramichi on or around September 1st 2012"],"Weather Factors":"Unknown","Case Number":"46253","Disposition":"Unresolved","Viewing Distance":"Over One Mile","Object Features":"Unknown","Tags":"City","Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=47.02628,+-65.503819(46253)&iwloc=A&hl=en\"> mufon case (46253) map </A>","Summary":"Orange, non pulsating light sighted travelling south to west at high speed.","Latitude":"47.02628","Country":"Canada","Region":"New Brunswick","Longitude":"-65.503819","Date Submitted":"03/17/2013 08:28 UTC","Source":"MUFON","divs":["Sighting DetailsTime: approx 2315-2330 Atlantic time 01 Sept 2012 Position: 46.936653N -65.909965W Ground sighting. Weather: Clear, no clouds sighted. The moon was full but would have been still east as it was to my left and partially obscured by trees. My wife and I had just stopped and got out of the truck after coming back from Miramichi. I was getting my camera bag out of the bag to try some night photos. She looked up and said \"What is that orange light?\" She may as described it as an orange ball and I would agree to that. The object was about 45-50 degree elevation estimated, perhaps 60 degrees, to our south. It tracked left to right, and went out of sight to the west. The object was moving faster than airliners that were in the area that night but not what I would consider a satellite speed. There were two airliners that went overhead after by about 10 mins from the west to the east. My parents place is situated under an air route. As we watched the object, it was a steady orange light and I would say the size of a pea perhaps. It would have been smaller than a aspirin. The brightness \"turned off\" as it got further away from us but we could see a faint possibly white light as it continued west. I couldn't describe it better than that after the bright orange went out. The orange light was steady. It didn't flash, flicker or pulse. It was very bright as compared to the brightest stars. I never contacted anyone about it. I had thought to contact and IFR controller I know in Moncton but never did. Better to leave that to those who know who and how to ask. I don't believe it would be related to the balloon festival as this object was moving too fast."]}