{"Object Features":"None","Region":"Massachusetts","Log Number":"US-04042006-0002","divs":["Sighting DetailsAbout 10 years ago i was camping at camp cachalot in the plymouth state forest. Most of my troop (including the leaders) were inside a lodge and we were sleeping on the porch. It started snowing about 3 AM and was rather windy so we were all pretty cold and wet. 6 of the 8 of us were up (the 2 closest to the lodge stayed dry) and at roughly 4 AM we noticed a single glowing object asscend through the sky. it was changing colors at a rate of about a color per 5 seconds. it lasted for a good five minutes dancing around in the sky at breakneck speed. it turned at 90 and 180 degree agnles, it stopped on a dime and at one po int it actually turned into 3 objects in the shape of a equilateral triangle. The color was blue when it dissapered and it was very bright when it blinked out. Not one of us said a word the entire time and we all were almost in a state of shock. a good few minutes later we started talking about it and decided not to let the others know. To this day ive been wondering what the hell it is. if you have any information, please email me. Thanks!"],"Date of the Event":"11/10/1996 12:00 UTC","trends":["There have been 15 other sightings in Plymouth","There were no other sightings in Plymouth on or around November 10th 1996"],"Sighting Duration":"00:05:00","files":["/var/www/straped/mufon/html2text/4625.html.txt","/var/www/straped/mufon/org/4625.html"],"City":"Plymouth","Latitude":"41.958446","Object Shape":"Sphere, Triangle","Longitude":"-70.667262","Disposition":"Unknown","Object Flight Path":"Path with directional change","Country":"United States","Case Number":"4625","Source":"MUFON","Tags":"City","Date Submitted":"11/10/1996 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.958446,+-70.667262(4625)&iwloc=A&hl=en\"> mufon case (4625) map </A>","Summary":"Solo object seen over camp cachalot","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Weather Factors":"Unknown"}