{"map":"<A HREF = \"http://maps.google.com/maps?q=41.225165,+-74.86136(46259)&iwloc=A&hl=en\"> mufon case (46259) map </A>","Case Number":"46259","Date of the Event":"09/15/1991 12:00 UTC","Weather Factors":"Unknown","Viewing Distance":"Unknown","Date Submitted":"03/17/2013 11:02 UTC","City":"Dingmans Ferry","Source":"MUFON","Log Number":"US-03172013-0018","Disposition":"Unresolved","Summary":"What Dr. Kasher observed from the film of the Discovery mission 9/15 /1991 I saw from the ground. After the ufo stopped and change direction a blue and green sided lasers boomerang shape passed the spot where the ufo would have been","divs":["sighting detailsi was on the back balcony of my family's house on marcel lake watching the night sky. i saw an object which looked like a satelite moving at high speed going from west to east. i watch as the ufo stopped and change direction quickly going to the northeast. after the ufo turned a boomerang shape from the south with sides of a blue and green trail on each side went to the spot where the ufo would have been if it did not change direction. when the ufo changed direction is sped away very fast. the boomerang shape disappeared. this is exactly what i saw and i hope that the 9\\15\\1991 discovery mission film that dr. kasher showed will be analyzed to confirm the colors of the streak that went after the ufo. i first thought the ufo was a satelite, but after it stopped while going at a high rate of speed and then stopping and speeding away at a higher rate of speed i did not think the ufo was from earth po. then when the boomerang shape passed the place where the ufo would have been it s i seemed as if we were aquottacking it with lasers."],"Tags":"City","files":["/var/www/straped/mufon/html2text/46259.html.txt","/var/www/straped/mufon/org/46259.html"],"Object Flight Path":"Path with directional change","Object Features":"Other","Longitude":"-74.86136","Latitude":"41.225165","Country":"United States","trends":["There have been 3 other sightings in Dingmans Ferry","There were 2 other sightings in Dingmans Ferry on or around September 15th 1991"],"Region":"Pennsylvania","Object Shape":"Boomerang, Sphere","Sighting Duration":"Undisclosed"}