{"Disposition":"Unresolved","Object Shape":"Boomerang","Weather Factors":"Unknown","Country":"Canada","Region":"Nova Scotia","Case Number":"46263","Date of the Event":"01/19/2012 01:30 UTC","Date Submitted":"03/17/2013 11:45 UTC","Source":"MUFON","Object Features":"Patterned Surface","Summary":"Looked like a big car bumper","City":"Amherst","files":["/var/www/straped/mufon/html2text/46263.html.txt","/var/www/straped/mufon/org/46263.html"],"Longitude":"-63.814547","Latitude":"45.833348","map":"<A HREF = \"http://maps.google.com/maps?q=45.833348,+-63.814547(46263)&iwloc=A&hl=en\"> mufon case (46263) map </A>","Tags":"City","Object Flight Path":"Path then hovering","Log Number":"CA-03172013-0022","Viewing Distance":"21-100 Feet","trends":["There have been no other sightings in Amherst","This sighting has never been favorited."],"divs":["Sighting DetailsI was out in my garage working on my truck when I saw a bright light outside , so I figured a few of my buddies were there so I opened up the big door and there was no one there and no lights . Then I was a little tripped out so I start to walk back in the garage and I see these 4 bright lights in the sky across the road at my uncles, and as a teenager I thought it was pretty cool so I took out my iPhone to take a video of it and just as I got my video opened my battery went from 94% to 0% . So I slowly backed myself in my garage and as I walked back the lights would slowly get closer and it was freaking me out . I went back inside and tried to forget about it and I was doing something under the truck and I thought I seen something run past the door really quick so I grabbed the shot gun and went to the door when I got there their were what looked to be like grizzly bear tracks they were huge so I slowly walked around to the back of the garage and I followed the tracks right to the back door where they stopped but the door was looked and the pad lock was still on it. Then I was starting to think I was going crazy. I was standing there when the bright lights came back on a d started moving by my uncles and they went down into the gully way back behind my house , so I hoped on my ski doo picked the shot gun up and went down the field when I got there , their was nothing there and I was tired and confused so I came back up to the house and went to sleep. When I got up the next morning and went outside , there were no tracks other then might but down the field the was about 8 big spots of snow that were red and black and about 5 m in size . Ill never forget that night but I want some kind of explanation of what it is ?!?"],"Sighting Duration":"02:13:47"}