{"Disposition":"Unresolved","Date of the Event":"08/15/2001 12:00 UTC","Weather Factors":"Unknown","Object Shape":"Sphere","trends":["There have been 3 other sightings in White Bear Lake","There were no other sightings in White Bear Lake on or around August 15th 2001"],"City":"White Bear Lake","Case Number":"46269","Object Flight Path":"Hovering then path","Date Submitted":"03/18/2013 02:05 UTC","Viewing Distance":"Unknown","Tags":"City","Source":"MUFON","files":["/var/www/straped/mufon/html2text/46269.html.txt","/var/www/straped/mufon/org/46269.html"],"Log Number":"US-03182013-0006","divs":["sighting detailsas i remember, it happened in the early afternoon, in mid august. i had seen my mother that wednesday, and she gave me a lift to my work, at the nearby mall, to pick up my paycheck. a little way up the slope of the road, i saw from her open window a shiny metallic object in the clear sky. it was a running joke for me to point at airplanes or other common \\ easily identifiable things and proclaim them to be ufos. and that's all i originally thought it was: just a plane at a weird angle. but i remember laughing at first then stopping as i noticed it wasn't moving. she kept driving up the road, which merged onto a small bridge \\ different street that ends at a stop sign. i remember after we stopped, i finally got her to look at it. then i quickly looked around to see if anyone else was also witnessing this. and in front of us was a sedan carrying passengers also pointing toward the object in the sky. as we remained stopped and the cross traffic continued, we both watched it hover in place to, then suddenly, break off into a circular path around the area. it didn't make any sounds. and i remember thinking about how weird it was that it was so silent. also, from all angles it appeared to be a sphere. now, i've been in lots of life threatening or adrenaline boosted situations, and watching it had a similar affect on my perception of time. it's like life just slowed down. i know in reality it was probably no more than a minute and a half, but it felt like we were watching it forever. it finally stopped again and just took off in a blur to the north east. it was out of our visibility within a second. i also can't remember if the car that was at the stop sign, in front of us, was there for the entire duration or if it took off during it. i certainly know that it was the least of my concerns while i watched this thing like a hawk. we continued on after it left and talked about how little we knew of what we just saw. i wasn't afraid or anything. i was more in complete amazement of it. i had never seen anything move like that before. i remember being really excited and telling a lot of my friends about the experience, but i was mostly laughed off or not taken seriously. today, i don't claim this thing was an alien space ship. i really don't know. i just know that over a decade later, i still think about it, and i've never seen anything like it again."],"Longitude":"-93.017321","Latitude":"45.037959","Country":"United States","Sighting Duration":"00:01:30","Summary":"Witnessed a metallic sphere hover in place, circle the area, then instantaneously blur out of visibility.","Object Features":"None","Region":"Minnesota","map":"<A HREF = \"http://maps.google.com/maps?q=45.037959,+-93.017321(46269)&iwloc=A&hl=en\"> mufon case (46269) map </A>"}