{"Date of the Event":"03/10/2001 03:33 UTC","City":"Powell River","map":"<A HREF = \"http://maps.google.com/maps?q=49.840486,+-124.52286(46267)&iwloc=A&hl=en\"> mufon case (46267) map </A>","Latitude":"49.840486","trends":["There have been 2 other sightings in Powell River","There were no other sightings in Powell River on or around March 10th 2001"],"Log Number":"CA-03182013-0004","files":["/var/www/straped/mufon/html2text/46267.html.txt","/var/www/straped/mufon/org/46267.html"],"Date Submitted":"03/18/2013 01:46 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Path then hovering","Disposition":"Unresolved","Source":"MUFON","Tags":"City","Viewing Distance":"Over One Mile","Country":"Canada","Region":"British Columbia","Case Number":"46267","Longitude":"-124.52286","divs":["Sighting DetailsMy X and I came home from a farmers market and we just started talking about the lights she had been witnessing out over Vancouver Island as she got up in the middle of the night to go out on the porch and have a smoke. She was then telling me that day what she had been witnessing and pointed out, \"Just like that right there!\" Of course I said, \"What?\" So I looked and there it was decending from a high altitude slowly. We got the video camera out and started shooting for just over 10 minutes - I have it all on tape!!!! We were out on the porch and had a good view of the ocean. I feel it was hovering out in front of the paper mill here and examening it. I know my aircraft and I thought it might be a double-bladed chopper at first but when it came down lower it was more disc-like - it looked like it changed shape?? When it stopped to hover, it was a very windy day, and it was wobbeling a bit; it looked a little unstable in the wind. We just sat there in amazement and took turns with the camera. I tried phoning people that lived in the area and of course no one was home and the Air Force Base in Courtney (Vancouver Island) didn't pick up anything on the radar....so they told me. We were getting bored filming this object for so long we were waiting for it to do something. We finally put down the camera, came inside, went back out to the porch and it was gone. I told my friend about this and he is a school bus driver. He told me he picked up these kids from the back roads and one of the kids wouldn't take this alien figurine out of his hand for weeks. The kid told him that he and his sister looked outside one night (the same time corralates with my sighting), and said they heard a buzz going on like a bee hive. They looked out at 2:00am and saw this craft with different coloured lights. I still have the video to this day. I did get a hold of this gentleman in Vancouver that said he could take my tape and blow it up but I have not followed up on this with anyone yet...but would like to see it blown up!!! Rob MacDougall"],"Summary":"Came down out of the sky slowly then hovered for 10 minutes","Object Features":"Other","Object Shape":"Circle, Disc, Oval","Weather Factors":"Unknown"}