{"Log Number":"CA-04042006-0003","Viewing Distance":"21-100 Feet","Longitude":"-115.7694","map":"<A HREF = \"http://maps.google.com/maps?q=49.512968,+-115.7694(4626)&iwloc=A&hl=en\"> mufon case (4626) map </A>","Region":"British Columbia","Sighting Duration":"Undisclosed","Object Features":"None","City":"Cranbrook","trends":["There have been 3 other sightings in Cranbrook","There were no other sightings in Cranbrook on or around July 31st 1971"],"Date Submitted":"07/31/1971 12:00 UTC","Case Number":"4626","Object Shape":"Disc","Object Flight Path":"Stationary","Summary":"we seen a floating spinning disc.","Latitude":"49.512968","files":["/var/www/straped/mufon/html2text/4626.html.txt","/var/www/straped/mufon/org/4626.html"],"Disposition":"Unresolved","divs":["Sighting Detailswe were burying our dog who had been hit by a car earlier on in the day. We were at the Cranbrook Airport (which had been abandoned) just off of dirt road that ran along the side of the airport. It was in the afternoon the sun was over us and there was something that was reflecting the sunlight like a mirror. It was flashing on us while we were burying the dog.The light was coming from behind us. We weren't paying much attention to it. Untill my Uncle said finally what is that light and he turned around and then said the words look. So we did. And there was a a spinning disc floating in the sky overhead it was so close you could see grain in the steel of the outside of it. It looked all like stainless steel. It wasn't completely semetrical either while it was spinning there were places on the shell that looked like bumps (it wasn't perfectly smooth) And it wobbled a bit. It made no noise and it was so close I think just beyond a stones throw away. All we did was stand there and watch it aprox 5 minutes. It suddenly starting spinning very fast and then in a blink of a eye it was half of the size. It was higher in the sky alot higher. We watched it after it had climbed high in the sky it then moved higher and corkscrewed upwards untill we could not see it anymore. And just as it dissapeared from sight there were 3 us airforce jets that came flying in they were green and had a white star inside of a circle on the wing tips.They came in from different directions. I was 13 there were 8 of us there 3 adults and 5 kids."],"Tags":"City","Country":"Canada","Source":"MUFON","Date of the Event":"07/31/1971 12:00 UTC","Weather Factors":"Unknown"}