{"Log Number":"US-03182013-0002","map":"<A HREF = \"http://maps.google.com/maps?q=34.189189,+-118.302836(46265)&iwloc=A&hl=en\"> mufon case (46265) map </A>","Tags":"City","City":"Burbank","Date of the Event":"03/08/2013 05:10 UTC","Region":"California","Source":"MUFON","Disposition":"Unresolved","Date Submitted":"03/18/2013 01:21 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/46265.html.txt","/var/www/straped/mufon/org/46265.html"],"Viewing Distance":"501 Feet - 1 Mile","Longitude":"-118.302836","Object Shape":"Triangle","Summary":"It was a double looking luminescent triangle with 3-D circles under it.","Case Number":"46265","Object Flight Path":"Hovering then path","trends":["There have been 39 other sightings in Burbank","There were no other sightings in Burbank on or around March 8th 2013"],"divs":["sighting detailsi had seen something (which i will also fill out another report for) a few nights before in the same area. i had been thinking about this strange object. i happened to go to the fresh and easy grocery store in burbank and as i pulled into the parking lot saw this odd object hovering east of where i was pulling in. it was luminescent, had almost a transparent quality, it almost looked as if it were made of clouds yet it was very geometrical. it had two very distinct lines with ball\\sphere\\circle shapes under it. i watched it and it just disappeared into the sky. it was broad daylight and very clearly unlike anything i have ever seen before. i have seen a lot of airplanes, military planes (i've lived near more than one military installation) but this was almost etherial - it was as real as an object could be yet it had a transparent, glowing quality to it and the odd thing of having two very distinct lines one on top of the other like railings that formed a perfect triangle. the spheres were connected underneath the object. i tried to find my iphone to take video or shots of it but it was turned off and by the time it powered on it was gone."],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Latitude":"34.189189","Object Features":"Patterned Surface, Other"}