{"City":"Vancouver","trends":["There have been 54 other sightings in Vancouver","There were no other sightings in Vancouver on or around January 11th 2013"],"Region":"Washington","Disposition":"Unresolved","Case Number":"46266","Source":"MUFON","Object Shape":"Circle, Flash, Other, Unknown","Log Number":"US-03182013-0003","Date of the Event":"01/11/2013 07:58 UTC","Tags":"City","Date Submitted":"03/18/2013 01:27 UTC","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsI was driving on HWY 14 on January 11, 2013 at 7:58 pm, I was going east in Vancouver WA, past Pearson airfield and approaching Evergreen shores when I saw a flashing, hovering object over the local hills. It seemed out of place even though there is a local airfield near the highway and an airport across the river. It didn't move, just flashed a white light and hovered. I got excited and turned down the radio (working fine along with my car)and noted the time and location. I looked again and slowed down as much as I could to see the object. I noticed it was over the trees on the hills, way over and to the right of a lit up cross on top of someones house. It was definitely not part of their display. Eventually, it seemed like it was past (behind) the hills. I noticed that a plane was approaching the object, and the object still didn't move, so I thought the plane must be approaching between me and the object. The object continued to flash in a rhythmic pattern, flash pause flash pause flash. Now I am used to seeing helicopters hovering and taking off, airplanes (large and small), landing and taking off, so I know the sounds, but I heard nothing but the cars around me. Eventually, I lost the object when I approached the base of the hills. I should mention that it's rare to see or hear helicopters in this area. I should also mention I know what Venus looks like, it was actually to the south-south east at the time."],"Object Features":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-122.659046","files":["/var/www/straped/mufon/html2text/46266.html.txt","/var/www/straped/mufon/org/46266.html"],"Summary":"Driving on HWY 14 going east I saw a hovering object that continually flashed a white light over the local hills.","Object Flight Path":"Stationary","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=45.646828,+-122.659046(46266)&iwloc=A&hl=en\"> mufon case (46266) map </A>","Latitude":"45.646828"}