{"Weather Factors":"Unknown","Longitude":"-71.280436","Sighting Duration":"04:00:00","divs":["Sighting DetailsI have been seeing ufo's over years both in daylight and night time. Some I have seen very close where I could see the portals. One was shouded in a cloud type that was also witnessed by my boyfriend in Switzerland at 2:00 a.m. It seemed to be hovering close to our balcony with the light pointed to the ground and rotating one direction and then the other. I tried to take a photo, but nothing came out. It did not seem to be doing anything so I went back to bed. Also in Switzerland,there was one always hovering over the Juras Mountains. I decided to photograph it and when I did the camera went off with individual clicks. Thought the camera malfunctioned, so went inside to look. To my surprise, there were 12 individual photos of symbols. I have no idea what they mean... Usually when I see one, if they are not doing to much, I go inside. At first I was bedazzled by them. Now is can get tiring except for a couple of photos and audio that I would like to know what it is about."],"Date Submitted":"03/18/2013 05:28 UTC","Object Features":"Other","Case Number":"46283","Viewing Distance":"Over 1 Mile, Unknown","Region":"New Hampshire","Country":"United States","Source":"MUFON","Latitude":"43.304067","map":"<A HREF = \"http://maps.google.com/maps?q=43.304067,+-71.280436(46283)&iwloc=A&hl=en\"> mufon case (46283) map </A>","Object Shape":"Disc, Fireball, Sphere, Star-like, Triangle","trends":["There have been 2 other sightings in Pittsfield","There were no other sightings in Pittsfield on or around June 19th 2010"],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","City":"Pittsfield","Summary":"I have seen many over the past few years. I ave seen them up close and far away.","Date of the Event":"06/19/2010 09:00 UTC","Log Number":"US-03182013-0020","files":["/var/www/straped/mufon/html2text/46283.html.txt","/var/www/straped/mufon/org/46283.html"],"Disposition":"Unresolved","Tags":"City"}