{"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=-37.968683,+175.657616(46280)&iwloc=A&hl=en\"> mufon case (46280) map </A>","Date Submitted":"03/18/2013 04:26 UTC","Tags":"City","Longitude":"175.657616","Object Shape":"Disc","Sighting Duration":"Undisclosed","Country":"New Zealand","Source":"MUFON","Summary":"Kayaking and taking scenic photos","Log Number":"NZ-03182013-0017","Viewing Distance":"21-100 Feet","City":"Lakr Karipiro","Case Number":"46280","Region":"Waikato","Latitude":"-37.968683","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/46280.html.txt","/var/www/straped/mufon/org/46280.html"],"trends":["There have been no other sightings in Lakr Karipiro","This sighting has never been favorited."],"Object Features":"Unknown","Date of the Event":"01/26/2013 12:02 UTC","divs":["Sighting DetailsKayaking and taking scenic photos of trees 50-60 meters ahead of me in Lake Karipiro. There was no fog and clouds were half a mile high in the sky just after a midday on a hot summer.My kid and girlfriend were 50meters away on land having a picnic and others were kayaking or skiing and i am the only one who saw this (but not until after i sae my photos only, most of my mates can see it now, some cant) I took 20 or so pictures that day and when i loaded them onto my computer yestuday i see that 2 pics that were taken 1-2mins apart show like the top rounded edge of a saucer and its flat on the very top(like a upside down plate)and a beam like a triangle shape like this (^) under the disc and bright light aiming at the tree, I dont class this as a sighting simply cos i never saw it - it just shows up on 2 pics camera only. I had to look at it a few times to figure out what it is, weather its cloud or camera trickey or weird sunlight conditions ... the straight lines on the 2 photos are too straight to be cloud formations. i thought it was spiritual since i am spiritual, many friends have taken pics of me and orbs or faces show up but this pic is more alien. Maybe a spirit of alien? Or did my camera pick up on the ships invisability technology that i know they have so we cant view them. Who knows.... have a look and you decide. Pic 1 is from the front and pic 2 is right angle 1-2 minutes later and it really hasnt moved at all. if it were cloud then the weird straight edges would have blown away and changed shape but the pics are the same. Enjoy Mark G"],"Object Flight Path":"Stationary"}