{"Latitude":"41.79788","map":"<A HREF = \"http://maps.google.com/maps?q=41.79788,+-107.232853(46297)&iwloc=A&hl=en\"> mufon case (46297) map </A>","Source":"MUFON","divs":["Sighting DetailsI was out watching the Comet Pan-Starr. It was getting late and I turned to look at the big dipper. I focused my binoculars on the second stars of the handle, Alcor and Mizer. I was going to look for the Galaxies which are near the last stars of the handle of the Big Dipper but I didn't know exactly where they were. I had only been looking for just a few seconds at the two second stars when an abject entered my field of view. It was moving quite fast and I followed it for a couple seconds thinking it was a satellite. I could make out what looked like a round shape and it was very bright. The first object was moving South South East by my estimation. A second less bright and somewhat fuzzy object came into view from the South. This object was moving North West, kind of diaginally to the first objects path. It was also moving much slower than the first object. The second object crossed paths with the first then stopped for a few miliseconds and reversed direction and sped up to meet the first. I took down the binoculars and thought, 'That wasn't a satellite.' I could not see either object without the binoculars. I tried to find them again with the binoculars but could not. I continued watching the sky for several minutes then went home."],"Summary":"I though it was a Satellite, at first.","Longitude":"-107.232853","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","City":"Rawlins","Country":"United States","trends":["There has been one other sighting in Rawlins","There were no other sightings in Rawlins on or around March 18th 2013"],"Region":"Wyoming","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/46297.html.txt","/var/www/straped/mufon/org/46297.html"],"Date Submitted":"03/18/2013 11:30 UTC","Date of the Event":"03/18/2013 08:40 UTC","Object Features":"None","Log Number":"US-03182013-0034","Weather Factors":"Unknown","Viewing Distance":"Unknown","Case Number":"46297","Tags":"City","Disposition":"Unresolved"}