{"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=29.385058,+-98.430569(46305)&iwloc=A&hl=en\"> mufon case (46305) map </A>","Disposition":"Unresolved","City":"San Antonio","Sighting Duration":"Undisclosed","Summary":"Red hovering lights seen above trees to the south east of the small lake dissapeared then more lights of the same description appear to the northeast side of the lake","Date of the Event":"02/23/2013 07:25 UTC","Latitude":"29.385058","Tags":"City","divs":["Sighting DetailsI had been fishing at a small lake on the east side of town with my son while my wife, daughter,8 sister in law, niece, and my sister in law boyfriend were walking the path around the lake. It was around 7:25 pm when my son asked me,\"what is that?\", well since I was fishing I look at the lake but the next thing I know I'm looking up above the trees to the southeast and see what I would say about 15 red glowing lights hovering above the trees in a distance my son asked again but I was still observing the lights as some stayed stationary others moved in syncrinized movements. two or three would move left then up then left then stop then would keep moving after a couple minutes I call my wife to tell her about the lights and she says no and then we hang up so I can take a video with my cell phone before I can open up the camcorder on my phone my wife calls me back and says a woman at the park came up to her and asked her about the lights well I hang up with her because I wanted to get it on video and I do. I take a short 2 minute video of the lights to the southeast but they were to far for my cell phone to get a good picture. I call my wife back and asked if she seen them and she says she looking at them right now I told her all the lights had vanished into the sky but she tells me that she is looking to the north and as I turn around there they are brighter then before and so I follow them with my camera phone and walk toward the lights because the lights of the lake were obscuring the view. so on the video as I pass the last light post you can see just behind the trees to the northeast the same lights doing the same thing as the lights from the southeast moving west. I run back to my camp to pickup and go I called my wife and told her we're going to follow it and so we head out but they disappear just as we get half a mile down the road never to be seen again. I really wish I had a better camera with me that night."],"Object Flight Path":"Stationary,Hovering then path","Source":"MUFON","Region":"Texas","Date Submitted":"03/19/2013 04:14 UTC","Longitude":"-98.430569","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around February 23rd 2013","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/46305.html.txt","/var/www/straped/mufon/org/46305.html"],"Object Shape":"Fireball","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-03192013-0007","Case Number":"46305","Object Features":"Unknown"}