{"Date of the Event":"06/05/1990 04:00 UTC","Object Flight Path":"Stationary,Hovering then path","Source":"MUFON","Summary":"Alien Tests Soil","Latitude":"41.889303","Object Features":"Patterned Surface","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/46307.html.txt","/var/www/straped/mufon/org/46307.html"],"Longitude":"-86.617127","Tags":"City","Country":"United States","Region":"Michigan","divs":["Sighting DetailsI saw an alien and a UFO in Sawyer Michigan in 1990. I was eight years old. There is a couple from Chicago who own a little cottage who are barely ever there...probably why the alien chose that spot. In watching one of the latest episodes of UFO HUNTERS I was astounded to hear of all the other activity right there in South Haven so close to my sighting. The UFO was hovering right over the cottage spinning really slowly and looked like two dinner plates, one turned upside down on top of the other...it was grey like made of metal...where the plates met there were many different colored lights but when the UFO started spinning faster the colors began to run together...I saw the alien outside of its craft...with an ultrabright yellow-white light surrounding it...It definitely glowed..I was in shock of awe and could not move at first...could barely makeout its outline but it seemed to be tall and skinny..lenghty.It was testing the soil with something that looked like those lights that commonly light walkways up to a person's house only the light from it was ultra bright neon green...I think it was testing the soil..once I could move I ran inside to get my parents and when I returned the alien and the craft were gone...I was amazed that it could leave so quickly."],"Viewing Distance":"21-100 Feet","Sighting Duration":"00:03:15","map":"<A HREF = \"http://maps.google.com/maps?q=41.889303,+-86.617127(46307)&iwloc=A&hl=en\"> mufon case (46307) map </A>","Disposition":"Unresolved","Case Number":"46307","trends":["There has been one other sighting in Sawyer","There were no other sightings in Sawyer on or around June 5th 1990"],"City":"Sawyer","Object Shape":"Disc","Date Submitted":"03/19/2013 05:28 UTC","Log Number":"US-03192013-0009"}