{"Tags":"City","Longitude":"-75.833272","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Log Number":"US-04042006-0007","Country":"United States","Source":"MUFON","trends":["There have been 3 other sightings in Elkton","There were no other sightings in Elkton on or around September 30th 2005","This sighting has never been favorited.",""],"Latitude":"39.606779","City":"Elkton","Date of the Event":"09/30/2005 10:00 UTC","Case Number":"4630","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.606779,+-75.833272(4630)&iwloc=A&hl=en\"> mufon case (4630) map </A>","Object Shape":"Star-like","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/4630.html.txt","/var/www/straped/mufon/org/4630.html"],"Summary":"What I thought was a star, suddenly did a lot of zig zaging and suddenly disappeared .","Region":"Maryland","Date Submitted":"09/30/2005 10:00 UTC","Object Flight Path":"Hovering then path,Path with directional change","divs":["Sighting DetailsI stepped out onto my back poarch late in October, 2005, which I do nearly night to check the stars and the weather. I live near the Philidelphia airport(30 miles away)flyway and having been a general aviation pilot, I watch airplanes aproachiing the Philly area all the time. On this night, I saw what I thought was a star in the southeast, where there should not have been a star, so I whtched it to see if it were a jet aproaching Philly. While I watched, it started a zigzag pattern, going counter clockwise and made a 540 degree turn in the space of about 5 to 8 seconds before disappearing. I watched the spot for several minutes and scanned the sky in that area for sometime before think that I may have seen something unusual. The next evening while shopping at the local Acma SuperMarket in Elkton, I mention this to my checkout and he said \"You aren't going crazy, I saw it too!\" We talked about it for several minutes both wondering aloud to whom and how we could report it. For myself, I have seen several object that I could not identify and have never before know a place to report them. This one did not go in a straight line and that is what caught my attention. This is the fifth such objuct I have observed in the past 55 years and the only recent one (three of those I now believe to have been falling space objects, either metors or metoeites). I lost sight of the object because it just seemed to go out like someone turned off the light or it excellerated so fast that it left my field of vision without my knowing it. It was about 30 degrees above the horizion all the time I observed it."],"Object Features":"Unknown"}