{"Source":"MUFON","Object Features":"Window(s)","Object Flight Path":"Stationary","Viewing Distance":"21-100 Feet, 101-500 Feet","divs":["Sighting DetailsIt was approx 9 pm,i was driving to the local convience store. I was traveling at approx. 45mph. I came from a blind turn onto the crest of the big hill,steep grade with a wide deep valley. In a split second i saw this huge,gigantic bright oval shaped object with oval windows that were lit up very very bright. The object itsself seemed to be like a kind of mercury sort of like a solid liquid mass,just there not moving. My window was down,i dont remember hearing any noise at all. I felt terror and awe struck all at the same time. I hit the brakes on my vehicle, it seemed as if i may hit it. I quickly realized how big it was and i could drive under it to get away. It seemed to fill the whole valley. As i passed under it i felt more afraid so afraid i didnt look in my rearview mirror to see if it was still there as i went up the other side of the hill. I was trembeling so badly i could barely drive. When i arrived at the store the 2 women working tried to calm me. I was to afraid to tell what i had seen but to afraid not to. I stayed there about30 minutes. On my drive home i was so filled with anxiety i could barely breath. I arrived home about 11.00. I didnt sleep at all,trying to convince myself it wasnt there or it was something else. I know what i saw,i know what it was. Even now years later everytime i drive down that hill i can picture it . I feel alot of stress sometimes becuz of what i saw. Later that month i accidentally got some kind of bright moving orbs in a picture of the storm damage. I cant upload the pics they are on my digital camera"],"Country":"United States","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/46304.html.txt","/var/www/straped/mufon/org/46304.html"],"Tags":"City","Disposition":"Unresolved","Summary":"It was so large i thought i would hit it.in the same split second terror set in,i knew it wasnt supposed to be there.","Object Shape":"Cigar, Oval","Date Submitted":"03/19/2013 04:04 UTC","Longitude":"-92.191393","Latitude":"37.837552","map":"<A HREF = \"http://maps.google.com/maps?q=37.837552,+-92.191393(46304)&iwloc=A&hl=en\"> mufon case (46304) map </A>","Region":"Missouri","Log Number":"US-03192013-0006","Sighting Duration":"Undisclosed","City":"Waynesville","Date of the Event":"12/03/2008 12:00 UTC","Case Number":"46304","trends":["There has been one other sighting in Waynesville","There were no other sightings in Waynesville on or around December 3rd 2008"]}