{"Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was on my way to my moms going South down Fairfax road. I came to a stop light and I noticed a red truck in the lane going North suddenly an enormous ship appeared it covered houses and apartment buildings the road it was circular shaped and had lights around the bottom part of it, I honestly don't remember the underneath of it. A little old man in a red pickup truck got out of his truck and watched it as well, I did not talk to him or think about it. I was standing outside my car at the stop light. As the Ship crossed all the buildings and road it moved very slowly and as soon as it was across the road completely is accelerated into a very high speed to where it vanished I jumped back inside my car and followed it to where I had believed it vanished inside Highland High school inside the School it was pitch black yet outside the School were the parking lot is was still light out, I had my two babies with me at the time in car seats and I was going to go inside the School, but then I worried that I might be taken and my babies would be left in the car and everyone would think I was killed or kidnapped I don't know so I didn't and stood there for a minute and got in my car and left. I don't know of anyone who have had this type of encounter other than me and that Little old man.. I wish I had proof yet I don't. I could say a lot of other things that have happened since then and recently but I am afraid to say or tell anyone. I just don't have proof, I just don't. So I am going to make sure I carry a camera with me every where I go. The truth is there is others from another world visiting us. I have seen laser beams, smaller ship tiny in formation making forms of aircraft, indescribable miraculous things, I have told many friends and family. I've seen something that reminded me of a man it's kind of hard to describe, all I can think of is rocket launcher it carried a plume of spiral smoke with no sound whatsoever. Now sir or mam there is some secretive things I haven't said that has happened in my bedroom visual things. But even I myself can't believe them and it happens only at night. This stuff has been bothering me so long, I just had to tell someone who knows of certain things. Anyway that is all."],"Summary":"An enormous ship appeared out of no where I got out of my car and watched it being so shocked at its size it accelerated and zoomed off where I followed it and it suddenly disappeared into Highland High school in the school was pitch black but outside","Viewing Distance":"20 Feet or Less","City":"Bakersfield","Disposition":"Unresolved","Region":"California","Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=35.274173,+-118.932128(46308)&iwloc=A&hl=en\"> mufon case (46308) map </A>","files":["/var/www/straped/mufon/html2text/46308.html.txt","/var/www/straped/mufon/org/46308.html"],"Tags":"City","Log Number":"US-03192013-0010","trends":["There have been 32 other sightings in Bakersfield","There were no other sightings in Bakersfield on or around April 17th 1992"],"Weather Factors":"Unknown","Latitude":"35.274173","Date of the Event":"04/17/1992 05:20 UTC","Object Features":"Dome, Window(s), Other","Longitude":"-118.932128","Country":"United States","Case Number":"46308","Date Submitted":"03/19/2013 05:41 UTC","Source":"MUFON"}