{"Weather Factors":"Unknown","Log Number":"US-03192013-0019","map":"<A HREF = \"http://maps.google.com/maps?q=35.057505,+-89.906692(46317)&iwloc=A&hl=en\"> mufon case (46317) map </A>","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/46317.html.txt","/var/www/straped/mufon/org/46317.html"],"Region":"Tennessee","Tags":"City","Source":"MUFON","divs":["sighting details at 8:30 p.m. on february 22, 2013, i was standing in my driveway enjoying a cigarette and a phone conversation with a friend. two to three minutes into the conversation, i noticed a very sharp sizzling sound. i turned to the location it came from, where i noticed what appeared at first as a ball of red, white, yellow, and possibly grey smoke that was roughly the size of a chinese paper lantern. (not popular in my neighborhood.) the first (as described above,) burned off it's emissions completely to form a gold\\ copper star, roughly the same size, just a more solid form of energy. i then noticed a second coming in behind it. they began traveling in an arc formation starting from approximately knee\\ thigh height. i ended the conversation, then headed inside to inform my father and sister (also direct witnesses) and made sure they were outside to observe the phenomena. after verifying that they were witnessing it as well, i also went back to grab my camera and begin filming and photographing. there weren't any feelings or emotions at this point, just reaction and collecting evidence. there were approximately 5-6 red star style energy craft travelling in an arc formation across the street, over the houses across from us, and through\\ over the treelines\\ powerlines (as is evident in my photographs) for a time period of 5-6 minutes. after witnessing a majority of the event, up to the ending portion for us, which was the last craft disappearing behind the treelines, we went back into the house and were in a state of humor at the event."],"Case Number":"46317","Viewing Distance":"Unknown","Summary":"5-6 Red Star Style UFO'S Flying In Arc Formation","Date of the Event":"02/22/2013 08:30 UTC","Date Submitted":"03/19/2013 03:36 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Other","Country":"United States","trends":["There have been 62 other sightings in Memphis","There were no other sightings in Memphis on or around February 22nd 2013"],"Disposition":"Unresolved","Object Features":"Other","City":"Memphis","Latitude":"35.057505","Longitude":"-89.906692"}