{"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/46319.html.txt","/var/www/straped/mufon/org/46319.html"],"Date Submitted":"03/19/2013 07:38 UTC","Tags":"City","Object Flight Path":"Stationary","Region":"Florida","Latitude":"24.628","Date of the Event":"03/05/2013 12:00 UTC","trends":["there have been no other sightings in dry tortugas\\fort jeffers","This sighting has never been favorited."],"Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=24.628,+-82.873247(46319)&iwloc=A&hl=en\"> mufon case (46319) map </A>","divs":["Sighting DetailsWe were filming out in the Dry Tortugas at Fort Jefferson for a show I am on. The sky is absolutely amazing, i've never seen so many stars in my life. The island is 70 miles off the coast of key west and 28 miles from Cuba. We could see planes, satellites, the milky way. if you are facing the front of the fort, we were standing on the beach to the right, and looking out over the ocean. I initially witnessed the light, which was a very bright orange color that appeared just above the horizon, at the height where the first line of stars were. I shouted to the other hosts of the show I am on, who turned their heads to look, but by the time they did it was gone. A minute later the light appeared again. Very bright orange light, and then just faded, pulsating out to nothing. This repeated a couple minutes later, and then a couple minutes after that. Each time, it would appear out of nowhere, just as bright as the last and then fade out slowly. Each time it would reappear it seemed to move locations a tiny bit from the last we saw it. (It moved about 3 fingers worth to the right if you held your hand out in front of you and closed one eye) This happened about 4-5 times before it stopped No idea what this could have been, considering there is NOTHING within miles of this island, and being bright and that far away- And all of us are very well versed in the area of the paranormal."],"Object Shape":"Unknown","Longitude":"-82.873247","Source":"MUFON","Case Number":"46319","Country":"United States","Weather Factors":"Unknown","Log Number":"US-03192013-0020","Object Features":"None","Disposition":"Unresolved","Summary":"Bright orange light just obve horizion, appeared then slowly faded out","City":"Dry Tortugas/Fort Jeffers"}