{"Object Features":"None","Tags":"City","Latitude":"28.791262","Country":"United States","Case Number":"46311","Log Number":"US-03192013-0013","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/46311.html.txt","/var/www/straped/mufon/org/46311.html"],"trends":["There have been 4 other sightings in Homosassa","There were no other sightings in Homosassa on or around December 31st 2012"],"Weather Factors":"Unknown","divs":["Sighting DetailsI had left work going home on Dec. 31, 2012, approximately 10:35-10;40PM. I was driving east on a road that is about a mile to where I would have to turn right going south. The road going east climbs a hill to where turning south is the high pt. As I am driving east, I am looking up and see what I first perceived at the moment to be one of the small planes from the nearby municipal airport(10 miles away approx)flying from north to south, when I realized there were no blinking lights. Studying it, I saw that it was more like an orange-red glowing ball. It is New Year's Eve. So, okay it is a remanant of a firework. Something about the consistency and movement of the orb was questionable. I could see that the path was going south very near where I needed to turn. I am racing up the hill to observe this object. When I made my turn to go south I could no longer see it, I was underneath. I had a half of a mile to drive. Not trying to break speed limits I wanted to get to my driveway so that I may get out of the car to observe the orb without having to concentrate on the road. I get to the driveway jump out of the car and it is right above me and its altitude higher than what I had perceived earlier. Still the same brillance and steady speed. I wanted to get my family outside to see this object so I had turned away from the sighting to run to the front door. I looked up to fix the path that the orb was following. I could not find the orb. It was gone. Disappeared. This all occured in the duration of approximately 5-7 minutes. Now I am curios, wondering if anyone else saw this object. I am a debunker. We do have a military base 85 miles south of us. Drone or UFO??"],"Source":"MUFON","City":"Homosassa","Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile","Summary":"Believed was a cub plane, realizing no blinking lights, just continuous orange-red illumination. (thought fireworks?) however kept a steady speed and direction, no compostition change, followed until it just disappeared,","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=28.791262,+-82.60795(46311)&iwloc=A&hl=en\"> mufon case (46311) map </A>","Date of the Event":"12/31/2012 10:35 UTC","Longitude":"-82.60795","Region":"Florida","Date Submitted":"03/19/2013 11:25 UTC","Object Shape":"Fireball"}