{"Weather Factors":"Unknown","Summary":"Star like to naked eye, moved so used binoculars & saw a gray disc with white lattice lights, black nucleus, crytal light bottom right, laser beam pointed NW when it turned","Sighting Duration":"Undisclosed","Source":"MUFON","Case Number":"46315","City":"Pinetop-Lakeside","Country":"United States","Region":"Arizona","Longitude":"-109.971398","Log Number":"US-03192013-0017","Object Flight Path":"Stationary","Object Shape":"Circle, Disc, Star-like, Teardrop","Tags":"City","Viewing Distance":"Over One Mile","Disposition":"Unresolved","Latitude":"34.154713","divs":["Sighting Details1. My husband was standing on our porch smoking a cigarette. He looked up at the sky and noticed a star or planet that kept moving up and down, left and right as if trying to maintain GPS coordinates. He thought it was GPS black helicopters and called me out to the porch. I looked at it through binoculars and saw a translucent ameoba type disc object with blicking red blue and white lights that kept moving from side to side. We walked away from the porch to obtain a better view from the yard and observed the disc between the large pine trees to the right and south of the moon. My husband viewed the object with night vision and I used the same binoculars. I saw a round disc that was dark grey colored with what appeared as white lattice covering it lengthwise and crosswise. The lattice appearance was lighted with white lights.The lights turned off and came back on from right to left crossing the disc. There was a black nucleus in the center of the disc and a crystal shiny glass looking object showing from the right lower corner of the disc. It's glass appearance was amazing. The top right of the disc appeared at one time to have dark colored strutures sticking out of it. The object appeared to turn and as it did it's shape changed to a diamond triagle sort, like it was squeezed from the open disc. At approximately 945 PM as the object did one of it's many turns it appeared that the structures created a pointed area on the NW side and my husband saw a red beam discharged from the disc. I did not see this with my binoculars, though I saw the shape change. After this a flame was observed where the crystal type light was. The flame was mostly red colored with a yellow middle and small blue color at the bottom. The flame actually wavered like fire at the top of it. This kept on for the following ten minutes when we decided to charge our video camera and look for it again the next evening as we could not take any pictures. What frightens me the most is the timing! We heard on the news today that 7 Soldiers NW from where we saw this thing, an explosion occurred at Hawthorne Military base when the Soldiers were supposedly loading a missle. Was this thing part of our missle defense? Or was this another country's UFO who fired a laser beam down to them? Or was this an ET? Or was this unrelated completely to the explosion. When I saw this on the news it make me feel vulnerable about reporting this to any gov. agency. We could have had sight of this all night, perhaps but could no longer handle the anxiety and went back inside our home to calm down. This is the first UFO I have ever seen and it scares me quite a lot. I was a believer before only because it makes sense. Though now we have actually seen one. My life will never be the same again. We are both Professional people from the Medical Field. Please check into this because of the timeline of the Soldiers death and our sighting. Thank you."],"files":["/var/www/straped/mufon/html2text/46315.html.txt","/var/www/straped/mufon/org/46315.html"],"Date of the Event":"03/18/2013 09:45 UTC","Date Submitted":"03/19/2013 01:47 UTC","Object Features":"Patterned Surface","map":"<A HREF = \"http://maps.google.com/maps?q=34.154713,+-109.971398(46315)&iwloc=A&hl=en\"> mufon case (46315) map </A>","trends":["There have been 6 other sightings in Pinetop-Lakeside","There were no other sightings in Pinetop-Lakeside on or around March 18th 2013"]}