{"Object Shape":"Circle, Fireball, Flash, Sphere, Unknown","Object Features":"None","Disposition":"Unresolved","trends":["There have been 56 other sightings in Detroit","There were no other sightings in Detroit on or around February 22nd 2012"],"files":["/var/www/straped/mufon/html2text/46316.html.txt","/var/www/straped/mufon/org/46316.html"],"Case Number":"46316","Date of the Event":"02/22/2012 12:00 UTC","Log Number":"US-03192013-0018","map":"<A HREF = \"http://maps.google.com/maps?q=42.378136,+-83.006398(46316)&iwloc=A&hl=en\"> mufon case (46316) map </A>","Region":"Michigan","Weather Factors":"Unknown","Object Flight Path":"Hovering then path,Path with directional change","Summary":"me and my brother [Name removed/cms/tg] was sitting in his living room we seen what we thought was a lighting strike fall from the sky look like sky opened up ;and down come silvery mercury sustance came in house turned into orb.","Sighting Duration":"Undisclosed","Date Submitted":"03/19/2013 02:20 UTC","City":"Detroit","Tags":"City","Country":"United States","Viewing Distance":"20 Feet or Less","Source":"MUFON","Latitude":"42.378136","Longitude":"-83.006398","divs":["sighting details hi,my name is [name removed\\cms\\tg] , one day last year 2012 i believe in feb. me and my brother [name removed\\cms\\tg] .we were sitting at his dinning room table talking, it looked like it was about to rain, it was what first appeared to us to be a lighting strike, but it was shinny like platium mixed with so many colors you could'nt tell the color .to me it came down slower than a lihgting, but faster the rate of falling , it came down an stop in the air by the window never touching the ground ,it was a silvery sustance that looked like mercury, it moved in under the closed window, came in ,it touched the sercurity bars that are on the inside of the window ,it sparked and turned into what looks like a miniture sun ,it started floating, it then started getting in front of my face ,then it kept trying to touch me forcing me around the table ,once it got me on the other side of table it go in my brother \"a\"'s face ,\"a\" said show what you look like,it then flashed out like a camera flash ,looked like it went back out the way it came out the window. about a week or two later, my friend [name removed\\cms\\tg] seen an orb go back in my broters house, he was sitting at my home across the street. another guy called [name removed\\cms\\tg], who live on the next block desribed to me about the sky opening up it sounded like it could have been the first incident. [name removed\\cms\\tg]"]}