{"City":"Conshohocken","Weather Factors":"Unknown","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Object Features":"Window(s), Appendage(s)","files":["/var/www/straped/mufon/html2text/46322.html.txt","/var/www/straped/mufon/org/46322.html"],"Viewing Distance":"101-500 Feet","Date Submitted":"03/19/2013 10:13 UTC","Region":"Pennsylvania","Source":"MUFON","Latitude":"40.061066","Case Number":"46322","Log Number":"US-03192013-0024","trends":["There has been one other sighting in Conshohocken","There were no other sightings in Conshohocken on or around February 14th 2013"],"Date of the Event":"02/14/2013 09:38 UTC","Object Shape":"Circle","Country":"United States","divs":["Sighting DetailsI am reporting this incident for my parents, who cannot stop talking about what they witnessed. They are not the type to believe this type of event, especially my Mom, and she seems startled over this event because she cannot explain it away. At the above time and date my mom left my sister's house to drive home. My sister lives three blocks away from my Mom. My mom drove to the top of my sister street, made a u-turn, and started to drive toward her house when she noticed an extremely bright orange light in front of her in the air. At first she thought it was a helicopter but as she describes it, it was too bright and was making no sound. When it was above her she stopped the car, opened the door, and leaned out to look at it. She describes it as extremely bright orange with barbs of orange spiking out of it. She said that it was so bright that she had a hard time making it out but thought that she saw narrow windows with orange light coming out and what looked like a flowing pacifier shape towords the top. It hovered there for a second and then started to travel past her. She was going to turn around and follow it but was scared and drove home quickly to tell my dad. When she made the right turn onto our street, she saw the object again in front of our house in the sky. It startled her because it had been going past her in a different direction and should not have been where it was. She ran into the house and started to scream for my dad telling him to go out onto the deck. When she reached the top of the stairs, they both went out on the deck and didnt see anything. My mom started to describe what happened to my dad and halfway in, they noticed the object coming around from the front of the house (moving from right to left), approximately 300 to 500 feet from them. She said the object was moving very fast (faster than any aircraft she had seen in the past) and then just stopped and hovered for 5 seconds. When it stopped my mother became very frightened (she says it was almost as if the object was watching them) and the extreme brightness scared her. It started to travel quickly to the left again. My parents then noticed a passenger airplane come over thier house (my parents live in a high traffic area for airplanes because they live in a Philadelphia suburb). When the airplane came into sight my mother said that the object started to dim by pulsing down until it was black almost as if the object was trying to disguise itself. She said that she could faintly make out the object in its black form and then it just dissapeared. I would like to add that my parents have lived in this house since 1978 and have seen all types of aircraft and planes fly overhead and have never seen anything like this. My Father is a retired Swimming Pool Contractor and my Mother is an office manager for State Farm Insurance. My mother never talks about this type of thing and I was suprised to hear how intense she was when she described what she saw. I am a Federal Police Officer who has never witnessed any UFOs myself but I believe my parents 100% and I am perplexed. I am curious to find out if you received any reports from the same area. My Father keeps bugging me to check into it. I became aware of your organization from various shows that I have watched on TV."],"Summary":"My Mother and Father witnessed an extremely odd occurence with a possible UFO","Sighting Duration":"Undisclosed","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=40.061066,+-75.287062(46322)&iwloc=A&hl=en\"> mufon case (46322) map </A>","Tags":"City","Longitude":"-75.287062"}