{"Date of the Event":"03/19/2013 08:00 UTC","divs":["Sighting DetailsMy step dad, sister and I were in the living area. He says \"Hey what is that?\" after he goes to look out the window. I jokingly say \"Is it a UFO?\" and with a serious face he looks at me and says \"I dont know what it is.\" So I look out the window and its moving um I would say south east then it starts going up and down. It looked like a fire ball at first but the light was pulsating then it would stop and you could see a silhouette of a flat top of something with it which I am guessing is the craft itself. I couldnt really see how big it was. I do want to say that right before ( i would say 3 mins) our lights flickered. My mother and I also ran outside after we lost sight of it over the houses and we saw it to the north east and then it hovered for a few seconds and just disappeared. My mother says she saw 3 plains in the sky after that. Which is the most we have ever seen. When I saw it I felt overwhelmed and excited. I was blown away. I am somewhat of a believer. I follow the stories and I read up on this stuff. Im not a crazed fanatic, I am a rational person when I look at these things and this is my first time seeing one. I have waited my whole life to see this for myself and I am honestly stoked! I will remember this forever. I am sorry I couldnt take a picture. We didnt have anything on hand and honestly we were just so amazed and in awe of it."],"Source":"MUFON","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Date Submitted":"03/19/2013 09:23 UTC","files":["/var/www/straped/mufon/html2text/46321.html.txt","/var/www/straped/mufon/org/46321.html"],"Sighting Duration":"Undisclosed","City":"Galena","Disposition":"Unresolved","Log Number":"US-03192013-0023","Longitude":"-82.893701","Region":"Ohio","trends":["There has been one other sighting in Galena","There were no other sightings in Galena on or around March 19th 2013"],"Country":"United States","Tags":"City","Latitude":"40.215794","Object Shape":"Fireball, Sphere","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=40.215794,+-82.893701(46321)&iwloc=A&hl=en\"> mufon case (46321) map </A>","Case Number":"46321","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Summary":"Fireball like thing, with flat top in silhouette. Hovering and going up and down."}