{"Log Number":"US-03192013-0025","Source":"MUFON","trends":["There have been 31 other sightings in Clearwater","There were no other sightings in Clearwater on or around March 19th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=27.968273,+-82.794003(46323)&iwloc=A&hl=en\"> mufon case (46323) map </A>","Region":"Florida","divs":["Sighting DetailsI was walking our dog at about 10:15pm. I looked up and noticed that there as no cloud cover as the local shopping plaza's light pollution can make it very difficult to see the stars. The sky was clear enough that I could see most of the major stars. I noticed to bright lights coming from the east, banking in a north-northeast direction. If I were to hold a small aspirin between my fingers with a fully outstretched arm, these orbs would have been that size. They came from south of the Courtney Campbell Causeway, almost from a southern direction like from that of southern Tampa. I could see the lights through the tree branches, it made me step into a break in the trees to observe more directly. At that point I could clearly see the light being emitted from both objects was pulsating erratically. They banked in unison maintaining a high speed, during the entire maneuver they did not keep a fixed distance but wavered somewhat, then rapidly closing distance between themselves to the point of almost touching themselves. I believe they may have accelerated somewhat as I lost sight of them into the treeline. There were no sounds at all, not of an engine, nor of a sonic boom which I would expect of something moving at that rate of speed. The area I live in has high airplane traffic, these were not commercial planes as the outline seemed clear. The light was for lack of a better term \"pure white\" like looking at a camera flash, yet it was soft and not glaring to the eye, steady at first, then pulsating randomly. The pulsing each performed were separate making the same pattern that I could tell. I stood watching to seem if whatever they were returned or would change direction from the treeline for about thirty seconds before going back inside to retrieve my camera and gather my thoughts as I felt shaken by what I had seen. From first noticing the lights to losing sight of them, the entire event lasted about 15 seconds, give or take a couple of seconds. As a side note, growing up my father was an aeronautical engineer. I have spent most of my life growing up near air bases. I am highly familiar with what military and commercial aircraft can do. The maneuver I saw these objects perform at the rate of speed they were travelling isn't possible, especially emitting no noise."],"Sighting Duration":"Undisclosed","Date Submitted":"03/19/2013 11:29 UTC","City":"Clearwater","Summary":"High speed white orbs moving closer then away from each other","Tags":"City","Object Features":"None","Disposition":"Unresolved","Latitude":"27.968273","Country":"United States","Object Flight Path":"Path with directional change","Object Shape":"Sphere","Longitude":"-82.794003","files":["/var/www/straped/mufon/html2text/46323.html.txt","/var/www/straped/mufon/org/46323.html"],"Date of the Event":"03/19/2013 10:15 UTC","Weather Factors":"Unknown","Case Number":"46323","Viewing Distance":"501 Feet - 1 Mile"}