{"Date Submitted":"03/20/2013 03:14 UTC","Region":"Virginia","map":"<A HREF = \"http://maps.google.com/maps?q=38.88631,+-77.10493(46327)&iwloc=A&hl=en\"> mufon case (46327) map </A>","Tags":"City","Country":"United States","Date of the Event":"03/05/2013 06:13 UTC","files":["/var/www/straped/mufon/html2text/46327.html.txt","/var/www/straped/mufon/org/46327.html"],"Longitude":"-77.10493","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Summary":"UFO filmed from airline window","City":"Arlington","Disposition":"Unresolved","Log Number":"US-03202013-0003","trends":["There have been 7 other sightings in Arlington","There were no other sightings in Arlington on or around March 5th 2013"],"Object Features":"Window(s)","Latitude":"38.88631","Object Flight Path":"Path with directional change,Path then hovering","Object Shape":"Sphere","Case Number":"46327","Sighting Duration":"00:00:30","divs":["Sighting DetailsWhile flying back from Washington, D.C. to Denver, Colorado I caught a UFO on video while taping the sky outside the window of the airliner. Flight was Frontier Airlines flight 725. Because of the low light level, my camera was not focusing so well on auto focus, so I used the Caribou image on the wing to focus. When I pulled back from the image, this is when I noticed a bright silver object that had suddenly flew into view. I noticed that it was moving up, down, and changing directions. I zoomed in with the camera and because of turbulence, I had a hard time keeping the object in sight. While viewing the object with my eyes, I noticed that it grew somewhat dull, then just shot off, but I'm unsure of the direction. It was clearly not a landing light from another aircraft. Frontier Airlines shows the aircraft altitude and speed on a small monitor on the back of each seat. I noticed that our altitude at the time was over 25,000 and our speed was about 400 MPH at the time. Please see the video and contact me if you have any questions."],"Weather Factors":"Unknown","Source":"MUFON"}