{"trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around March 20th 2013"],"Latitude":"40.717253","files":["/var/www/straped/mufon/html2text/46333.html.txt","/var/www/straped/mufon/org/46333.html"],"Viewing Distance":"Unknown","Summary":"A bright flashing Orange/Glow light hovering over Bushwick in Brooklyn","Region":"New York","City":"New York","Sighting Duration":"Undisclosed","Object Shape":"Circle, Flash, Oval, Star-like","Object Flight Path":"Other","Tags":"City","Date Submitted":"03/20/2013 09:55 UTC","Log Number":"US-03202013-0009","Object Features":"Unknown","Date of the Event":"03/20/2013 07:30 UTC","divs":["Sighting Details I was walking home from a family member's apartment. I walk everyday about fifteen blocks. On my way tonight at exactly 7:30, i looked up at the indigo sky which was beautiful. Here in Bushwick, Brooklyn, the planes hover a bit low to land at JFK or Laguardia. You can always tell a plane that's arriving or departing. There's no mistaking that. Tonight I notice a rather large orange light flashing object in the sky. At first i thought it was a bright star. After five minutes the light was dimming and pulsating. Then it started changing directions. I then think well, this can't be a plane. I could usually hear the sound of the plane but there was no sound. I keep my eyes on the object which begins to change and hover in different directions for about five blocks. And suddenly as I make my way across the street to my apartment, it completely disappears without a trace. A few other people near me stopped and wondered what the bright light was but they just kept moving dismissing it. I never stop in the street to look at stars, at least not this early in the night. The sun just set and the blue was light enough to provide more than sufficient visibility to distinguish between stars and planes. It was surreal. It felt like, what could this be? It was the most fascinating orange glow, And I wish I had a camera. My phone ran out of battery, so conveniently for whatever it was, I was not able to document it."],"Country":"United States","Longitude":"-74.000813","Case Number":"46333","Source":"MUFON","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.717253,+-74.000813(46333)&iwloc=A&hl=en\"> mufon case (46333) map </A>","Disposition":"Unresolved"}