{"Country":"United States","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.486291,+-114.315285(46334)&iwloc=A&hl=en\"> mufon case (46334) map </A>","Region":"Arizona","Summary":"That night we had power outage. Went outside to see if anyone was out and saw at least all of neighborhood was out. Looked up and saw two objects across from going in a clockwise motion, Then stop and traveled SW as they spread apart.","Object Flight Path":"Stationary,Other","City":"Lake Havasu City","Disposition":"Unresolved","Tags":"City","Log Number":"US-03202013-0010","Date Submitted":"03/20/2013 11:18 UTC","Longitude":"-114.315285","Object Features":"None","Source":"MUFON","Object Shape":"Other, Unknown","Viewing Distance":"Over One Mile","Date of the Event":"12/08/2012 12:00 UTC","Latitude":"34.486291","files":["/var/www/straped/mufon/html2text/46334.html.txt","/var/www/straped/mufon/org/46334.html"],"Weather Factors":"Unknown","divs":["Sighting DetailsOn December 8th 2012 myself and wife were watching TV. At about 9:00PM had a blackout lost of power. After about two or three minutes went outside in front of our home to see if anyone else had lost power. I notice that at least the whole neighborhood lost power. I walked to middle of road talked to my neighbor. Trun around just happed to look up and that is when I saw two objects (red lights) that look almost star like. I noticed that they were directly aross from each other and both moving at same speed clockwise. They did this for some time. I said to neighbor what do you think this is. Another neighbor standing behind me said its a UFO! I called for my wife to come out. As I was watching them rotate trying to hear anything. There was no noise. All at once they stop rotating or moving at all. Then about 10 sec. went by and they both started moving to the SW from us and also speading apart from each other. Then I saw a third object same kind of light come into view. I was fixed on this and yelled at my wife to come out again. Then all at once a white orb looking object flew over my head coming from northeast to southeast direction. This could of been a meteor maybe, because after it went over very fast going towards where three other objects were it disappered. My wife ran back into house very scared. I observed objects for about a total of about 15 to 20 min., until they got so far from sight they were hard to see. Oh I had called Unisourse Elec. and reported power outage just before I saw all this. They told me they would call back when they got power back. They did not call back and power outage lasted over one hour. Robert W. Thompson"],"trends":["There have been 30 other sightings in Lake Havasu City","There were no other sightings in Lake Havasu City on or around December 8th 2012"],"Case Number":"46334"}