{"Country":"United States","files":["/var/www/straped/mufon/html2text/4633.html.txt","/var/www/straped/mufon/org/4633.html"],"Summary":"Government people came to my house.","divs":["Sighting DetailsThis is not just an UFO report. A couple of weeks ago me and my friend videotaped a ufo landing in a field. We were at a local elementry school filming stunts we were doing off the playground equipment (i.e. slides, jungle gyms, and swings) when my friend was blinded by the object and nearly missed a pole he jumping to. We started recording the metallic looking object. The flash in his eyes was like being cuaght in the wrong position of a mirror and the sun. The object flew around a bit as if looking for something. It started to descend into a field. We ran straight towards it because it was blocked by some trees. When got into view of the Object it had already touched ground. The Object looked like a giant flat CD with a slightly domed tope and was made of shiny metal with no windows or doors from what we could tell. We couldnt tell what kept it propped up on the ground. We recorded it on the ground for about a 30 second period before it lifted off the ground and sped off toward the mountains at lightning fast speeds. About 3-4 minutes later 6 camo-colored helicopters raced after it. That night we made 3 copies of the tape. Then the next day we drove down the Fort Carson Military Base. We didn't have IDs to get into the base so we showed the tape the to the gate guards. they took our phone numbers, addresses, and a copy of the tape. They took us very seriously. We heard nothing from them until a few days ago. We were just hanging out at his house when his bell ringed. He answered the door and two men were standing there and asked his name. My friend replied and they shoved their way into the house. The two men looked almost identical, wore black suits, very pale skin as they had never been in the sun before, they were bald and spoke in monotone, the only color on thier face was their very red lips. they sat down with us and started asking us questions. They ased if we showed anyone else the tapes, like the media. we told them that we sent a tape to the Gazette, local newspaper. After about 10 minutes of questioning us about what we saw, by the way they wrote nothing down, they asked to see the two remaining tapes. We got the tapes and put one in the VCR and one of the men wanted to see the actual tape. As soon as the tape was done we gave the other one to them, then they started to get violent. they said if anyone asked if they were there to say no, if anyone asked about the tapes we were to say it was a hoax, if we told anyone about what we saw that day they would \"Lock up all our families and make sure nobody remembered us.\" they then continued to start searching his house. My girlfriend later said two men came by with a warrent to search the property. at my friend's house they even came across about an ounce marijuana and tossed it aside as if it were just another piece of paper. they the left abruptly. we now have no evidence of what we saw. You now understand why i have to remain unknown."],"Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Date Submitted":"03/30/2004 03:00 UTC","Longitude":"-104.700806","Sighting Duration":"01:00:00","Object Shape":"Disc, Other","Log Number":"US-04042006-0010","trends":["There have been 11 other sightings in Fountain","There were no other sightings in Fountain on or around March 30th 2004"],"Case Number":"4633","map":"<A HREF = \"http://maps.google.com/maps?q=38.682219,+-104.700806(4633)&iwloc=A&hl=en\"> mufon case (4633) map </A>","Source":"MUFON","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Latitude":"38.682219","Date of the Event":"03/30/2004 03:00 UTC","Disposition":"Insufficient Data","Object Features":"None, Dome","Region":"Colorado","City":"Fountain","Weather Factors":"Windy, Light"}