{"Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Longitude":"-93.72631","map":"<A HREF = \"http://maps.google.com/maps?q=38.764309,+-93.72631(46340)&iwloc=A&hl=en\"> mufon case (46340) map </A>","Sighting Duration":"Undisclosed","trends":["There have been 7 other sightings in Warrensburg","There were no other sightings in Warrensburg on or around March 18th 2013"],"Tags":"City","files":["/var/www/straped/mufon/html2text/46340.html.txt","/var/www/straped/mufon/org/46340.html"],"Weather Factors":"Unknown","Country":"United States","Latitude":"38.764309","divs":["Sighting DetailsI was returning to the Kansas City Area by Amtrak train on March 18, 2013. We left the Warrensburg, MO station about 5 minutes prior. I looked out the window (North side) at the view. It was farmland fields. The sky was bright blue and there were large cumulus clouds as far as the eye could see. I typically look at cloud shapes and as I looked up I saw several bright white objects flying and moving in a non-bird formation pattern (not a goose type formation of a v). I had no idea what this was and I positioned myself to see better. My instinct said grab your phone and video this but I knew they would be out of sight fast since the train was moving in the opposite direction. My intuitive response was to keep looking. I was riveted! So instead I counted them--which was not that simple since they kept changing positions in the group. Two would move one way then two would move another way--all remaining in the loosely formed group. There were 12 of these things! They were much higher than birds of prey fly. They looked to be the height that aircraft fly and just behind them was a cumulus cloud. The appearance of them was a very Bright white and I have to think their size was large since a I saw a vulture just seconds after they were out of view and its wingspan was about 5 feet across and these things were significantly higher than the vulture and appeared just as big. I recorded the sighting in my journal and sketched a diagram. I knew these were not birds--I have never seen anything like this before! I had to google search this and did not even know what terms to use to search it! I was hoping someone else would report this too."],"City":"Warrensburg","Case Number":"46340","Region":"Missouri","Object Features":"None","Date Submitted":"03/21/2013 10:21 UTC","Disposition":"Unresolved","Log Number":"US-03212013-0006","Summary":"I saw 12 bright white orbs at airplane flight level moving in a varied pattern near Warrensburg,MO","Object Flight Path":"Straight-line path","Object Shape":"Sphere","Date of the Event":"03/18/2013 01:35 UTC"}