{"Latitude":"35.254682","Longitude":"-101.643878","Object Features":"Unknown","City":"Liberty","Disposition":"Unresolved","Object Shape":"Boomerang, Circle, Oval, Star-like, Triangle","divs":["Sighting DetailsWalking to my car to go to quick trip in liberty off 291 highway, As I walked out of my apartment into the parking lot there was a woman on the phone yelling at me \"do you see that? do you see that?\" I pulled out my phone and took various pictures as well as a short video. Several other witnesses came from the apartment to witness it. After about 10 minutes they were gone and I got in my car and went Quiktrip. As I walked into Quiktrip an officer Was being dispatched over his radio to investigate the lights over office 291 highway. The officer seemed As though he did not believe, But went to investigate Before I left. When I was sitting there watching them they would circle and hover and then from the right side it appeared as if they were flying up from the ground and meeting the others blinking their lights off and on and forming some sort of triangular pattern.. And then they would fly straight up and disappear, Until finally only one was left. that was what I captured on my video. I will post the link to the video once I can get it uploaded on you tube from my phone."],"Date of the Event":"03/20/2013 08:30 UTC","Summary":"Walking to car, saw lights in sky","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path,Path with directional change","Source":"MUFON","trends":["There have been 12 other sightings in Liberty","There were no other sightings in Liberty on or around March 20th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.254682,+-101.643878(46349)&iwloc=A&hl=en\"> mufon case (46349) map </A>","Tags":"City","Case Number":"46349","Viewing Distance":"Unknown","Region":"Missouri","Log Number":"US-03222013-0002","Date Submitted":"03/22/2013 02:03 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/46349.html.txt","/var/www/straped/mufon/org/46349.html"],"Country":"United States"}