{"Summary":"Was shown object in clear blue sky","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=31.444056,+-97.409179(4634)&iwloc=A&hl=en\"> mufon case (4634) map </A>","trends":["There have been 4 other sightings in McGregor","There were no other sightings in McGregor on or around September 28th 0001"],"Source":"MUFON","City":"McGregor","Latitude":"31.444056","Case Number":"4634","Weather Factors":"None","Log Number":"US-04042006-0011","Object Shape":"Disc","Country":"United States","Region":"Texas","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/4634.html.txt","/var/www/straped/mufon/org/4634.html"],"Object Features":"None","divs":["Sighting DetailsAbove times are from memory around 1953. I was working at Air Force Plant 66 (Old abandoned bomb factory from WW II) while a civilian employee of Phillips Petroleum Company. I'd been recruited while employed in the labatory of Phillips Refinery in Kansas City, Kansas. Phillips had developed a lab model of a solid JATO unit at Bartlesville, Oklahoma and we were developing a working model with live firings. I was posted at \"Proving Grounds\" a distance from Area \"F\" on the reservation requiring driving to \"F\". My immediate supervisor was at \"F\", a small one story building with an adjacent parking lot. I'd come to \"F\" for some sort of business with my supervisor. Just inside the doorway on the left was an office, not my supervisor's. There was this fellow in there whom I'd never spoken with and had no idea what his name was. (All kinds of \"secret\" and \"confidential\" protocol around the place) However, on this particular day, as I was entering the building he called, \"Horn!\" I wasn't even aware he knew me! I acknowledged him and he got up from his desk and said, \"Did you see that flying saucer out there when you came in?\" I recall remarking, \"No, but I saw the cup and spoon.\" It wasn't unusual for remarks about going to the moon some day and such around the place. \"Come outside.\" I joined him in the parking lot where he pointed up toward the sky and said, \"See that?\" I didn't see anything and he persisted in drawing my attention towards the sky. Finally I saw a round disk shaped object, sort of like dull dark aluminum in color. It appeaared about like looking at a lead pencil head on. He asked me, \"What do you think?\" I really wasn't sure and suggested a weather balloon___maybe? I'd no more said that than the object abruptly moved in a straght line for a very short distance. He then said, \"Have you ever seen a weather balloon do that?' I, of course, answered, \"No\". Then I recall him saying, \"Now you've seen one. We used to see them all the time at Los Alamos.\" With that he turned and walked back inside and I followed and went on to my supervisor's office to take care of the business I'd come for. To this day, I really have no idea what I was seeing. It was too far away and had no distinguishing features. The only other strange and unusual thing I recall was when I was about twelve years old and was coming home late at night from a movie theater. As I was walking near my home I heard a definite spewing noise far above me which seemed to be traveling from the southwest to the Northeast. I could see nothing but could clearly hear the sound. It was similar to when one breaks (bends) a firecracker and then lights the exposed powder. That best describes the sound. Whatever it was it didn't seem to be moving particularly fast. By the way, that twelve year old reference? I'm seventy-four now. Do either of these incidents seem familiar to you? I watch with interest the History Channel programs on UFO and read as well. I can only consider the Roswell incident and the one at the air base in England really worthy of much consideration. While on a day off (Policeman at the time in KCK) there was a reported incident during my normal shift time in which there was much radio traffic of some sort of \"sighting.\" I talked to a fellow officer in which he related how two men came to his house shrotly after the incident. They seemed only interested in the distance (in degrees) the object was from the horizon. One, he said, mentioned some sort of oil spot that had been found on the desert floor in NM (The Roswell incident?) that had turned out to be, according to news reports at the time, ordinary 20 wt. motor oil. The fellow told him it wasn't motor oil. Of course, from my personal experience working in that refinery lab, there was no test that would determine the viscosity of an oil by sampling some sandy samples. Who knows? Like I said, the only two incidents that seem worth serious consideration are Roswell and the air base in England. I don't give a lot to my two incidents since I don't really have any information other than what I mentioned. That said, I appreciate that some organization is checking out whatever is happening. Some must be true."],"Tags":"City","Sighting Duration":"Undisclosed","Date of the Event":"09/30/0001 12:00 UTC","Disposition":"Hoax","Longitude":"-97.409179","Date Submitted":"09/30/0001 12:00 UTC"}