{"divs":["Sighting Detailsthe first night I saw this was march 2, 2013. it was in the sky to the west of my house and I have seen it almost nightly since then. then 2 nights ago (march 19) I noticed it to the east of my house. the first time I saw it I was driving home around 7:30pm and noticed many strange lights in the sky as though there were spotlights on the ground shining straight up, but there were probably 15 spots in the sky like this. it did not look like clouds at all. so when I got home I got my camera and went outside. the sky lit up with sparkles every time I took a picture but there was not a star in the sky. the only time I could see the sparkles was when the flash went off. the \"spotlights\" eventually faded away after about an hour and the sky was so clear and you could see the stars perfectly. but one of them was an off color and seemed to blink. so I got the camera again and zoomed in and took some more pictures. when I zoomed out and took some though, only this object would show up in the picture, even though you could see all the stars. last night (march 20) it stayed in the same general area, hovering behind my neighbors tree. it was higher than the tree, but my view of it was through the branches. I am interested to know what it is so I have been watching the sky since. between 8 and 9 pm almost every night there are 20 - 30 \"planes\" with flashing lights, moving faster than normal airplanes, coming from the north, south, and west all going east. they get directly east of my house, sometimes change directions, sometimes just hover for a minute or two and then they are gone. but they always fly east. I have tried many nights and have not been able to get a picture of any of them, only flashing white, sometimes red and white, lights on video. it usually happens right after dark, I have watched and waited during the afternoon, evening, as its getting dark but they never come until it is completely dark. and that is when I can see \"star\" as well. there was also one object on march 6 that came out of nowhere while I was taking pictures of the sky, it was bright orange, boomerang shaped, was only there for a couple seconds and gone. file 1 is the \"sparkles\" I could only with the camera flash. file 2 is the \"star\". both are from march 2, the first night. file 3 is a close up of the object from last night. file 4 is a video of the \"star\" from last night, bad video im sorry, I kept losing it in the branches of the tree. file 5 is from march 4 when the object was to the west over my house. file 6 is a video of the \"planes\" that I can never catch in a picture. files 7,8,9,and 10 are the boomerang object in the order that I took the pictures. if you would like to see more please let me know, I have so many other pictures from the last 3 weeks but could only upload 10."],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering,Other","files":["/var/www/straped/mufon/html2text/46344.html.txt","/var/www/straped/mufon/org/46344.html"],"trends":["There have been 2 other sightings in Pioneer","There were no other sightings in Pioneer on or around March 2nd 2013"],"Source":"MUFON","Object Shape":"Boomerang, Sphere, Star-like","Date Submitted":"03/21/2013 03:25 UTC","Date of the Event":"03/02/2013 10:00 UTC","Country":"United States","Tags":"City","Latitude":"41.68005","Viewing Distance":"501 Feet - 1 Mile","Case Number":"46344","map":"<A HREF = \"http://maps.google.com/maps?q=41.68005,+-84.553006(46344)&iwloc=A&hl=en\"> mufon case (46344) map </A>","Log Number":"US-03212013-0010","Summary":"has been seen almost daily since march 2, 2013","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Object Features":"Unknown","City":"Pioneer","Weather Factors":"Unknown","Longitude":"-84.553006","Region":"Ohio"}