{"Object Flight Path":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=32.986283,+-82.806918(46347)&iwloc=A&hl=en\"> mufon case (46347) map </A>","Country":"United States","Log Number":"US-03212013-0013","Longitude":"-82.806918","Date of the Event":"11/18/2012 12:00 UTC","Summary":"I observed up to 5 lights that would appear glow bright and fade fast.","Date Submitted":"03/21/2013 08:05 UTC","Object Features":"None","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","divs":["Sighting DetailsFour of us were at our hunting camp in Washington County Ga. It is dark in our camp at night. I was the first person to see the objects. I first thought it was an aircraft beacon. The light suddenly materialized an enlarged to a very bright Orange-Red Sphere. Then it suddenly turned off. It it then re-appeared in another part of the sky and stayed bright for approx. 30 seconds and moved at what appeared to be high rates of speed and making sudden 90 degree turns. I was trying to figure out what it was when suddenly 5 of the same objects appeared in a perfect Delta Formation. The Formation was slowly moving South to North. It was very dark that night and I couldn't make out a solid shape associated with the lights. The lights suddenly went dark and I ran to another building and got one of my Hunting Buddies to see the event. He saw several of the Lights and appeared to move at very high rates of speed. The numbers of lights varied from one to two and they moved around each other as they sped across the sky. There was no sound during this incident. I read that a sighting took place in Dublin,Ga. shortly after this incident. Our Club is located approximately 20 miles Northeast of Dublin. We have hunting in this location for almost 30 years and I have spent a lot of time there. I have seen numerous aircraft in the in night sky but have never seen anything like this. We got two other club members to observe the lights during this incident. They only saw about 5 minutes of the event. The event lasted approximately 15 minutes. Please let me know if you need any additional information. Thank You."],"Source":"MUFON","Latitude":"32.986283","City":"Sandersville","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/46347.html.txt","/var/www/straped/mufon/org/46347.html"],"Disposition":"Unresolved","trends":["There have been 5 other sightings in Sandersville","There were no other sightings in Sandersville on or around November 18th 2012"],"Object Shape":"Circle","Case Number":"46347","Tags":"City","Region":"Georgia"}