{"Date Submitted":"03/21/2013 06:16 UTC","Log Number":"US-03212013-0011","Case Number":"46345","Longitude":"-81.843741","Summary":"Bright white orb hovering over ground, grabbed camera recorded 30 minutes of multiple UFO's one went over my head.","City":"Boiling Springs Chesnee","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=35.289047,+-81.843741(46345)&iwloc=A&hl=en\"> mufon case (46345) map </A>","Disposition":"Unresolved","trends":["There have been no other sightings in Boiling Springs Chesnee","This sighting has been favorited 1 time."],"divs":["Sighting DetailsI was going to a convenience store. On my way I saw a bright white light that looked like it was on top of a distant radio tower. I thought it was odd because I've never noticed it before. On my way back home I passed that area again and when I looked it was now to the left of the tower but just as bright. I knew a plane wouldn't have still been there in that same area during my trip to the store so I went home and grabbed my camera. I parked in a field with a clear view and began recording. The hovering light stayed near the tower but was moving slowly in different directions and sometimes it would vanish. Then another appeared. Together they floated upwards at an angle to each other. Then again vanished. I observed this pattern and then one began coming my way. I filmed it as it flew overhead with a strange light or something that looked like it was emitting or being sucked into the front of it. As you would imagine a smoke cloud coming out of a jet but this was being sucked in the front as it traveled. I could see a weird halo that was not captured on the video for whatever reason but I could see it with my naked eye. After it traveled over my head and headed off I could then see what I hadn't noticed before, behind me. In the sky many of these things were around all in a formation and almost undetected to the naked eye. My camera picked them up perfectly. They were periodically flashing lights, from red, white and green. White was seen the most. When I got home and looked at my video I noticed how many there were. At least ten but I'm not sure if some were the same and just moving that quick to another part in the sky. I have the video and I contacted the local FAA to which I was told there was nothing unusual in my area last night and that I should maybe contact the police dept. I would love to have someone from MUFON look at my video. I'm a photographer so the video is very clear, even when it goes over my head. I also have photos from a separate event from the summer of 2012."],"Weather Factors":"Unknown","Source":"MUFON","Region":"South Carolina","Latitude":"35.289047","Object Flight Path":"Hovering then path","Object Shape":"Sphere, Star-like, Other","Date of the Event":"03/20/2013 09:10 UTC","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Object Features":"Wings, Unknown","files":["/var/www/straped/mufon/html2text/46345.html.txt","/var/www/straped/mufon/org/46345.html"],"Country":"United States"}