{"Latitude":"35.77255","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Tags":"City","Source":"MUFON","City":"Hickory","files":["/var/www/straped/mufon/html2text/46356.html.txt","/var/www/straped/mufon/org/46356.html"],"Object Shape":"Other","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.77255,+-81.320743(46356)&iwloc=A&hl=en\"> mufon case (46356) map </A>","Object Features":"Unknown","Case Number":"46356","Date of the Event":"03/21/2013 08:40 UTC","trends":["There have been 33 other sightings in Hickory","There were no other sightings in Hickory on or around March 21st 2013"],"Date Submitted":"03/22/2013 04:52 UTC","Region":"North Carolina","Sighting Duration":"Undisclosed","Longitude":"-81.320743","Weather Factors":"Unknown","Country":"United States","Summary":"object looked like a Ribbon twisting , rolling and moving width wise moving East to West covered my yard and out of sight in 5-7 seconds.","divs":["sighting detailsi live in the ne section of hickory,nc. it was march 21st at 8:40pm i had walked outside at 8:22 pm looking for the pan starrs comet i was having no luck and was about to walk inside when i just happened to look up toward orion when something caught my eye. it was moving very fast, but i had enough time to look at it through my 10x40 binoculars for several seconds. it was twisting and rolling just like a ribbon or a snake but moving width wise east to west as if a strong wind was pushing it. the breeze was maybe 5 mph but blowing west to east, there was absolutely no sound. the object was self illuminated almost pulsating a dull gold\\copper color but only on the bottom. like a light was shining on it from the ground but that wasn't the case. i started to run inside and call the local airport, but we are about to lose our airport's tower and i didn't want to bother them with a ufo report. the object passed over my yard and 2 of my neighbors yard toward a shopping center before it vanished from view. i do know geese fly at night but they don't glow or shimmer and they normally honk when they fly so they don't bump into each other, plus this wasn't a v shape. i live in a fly zone for the airport so i'm used to seeing aircraft at night, i'm guessing this was at least 1000 feet up and about 120 ft long like the 3 buses end to end give or take, but not very thick. ive seen several things i couldn't explain in the years past, but nothing like this and the effect it has had over me, i have been so on edge all day i just felt like i had to report it. i hope another backyard stargazer was as lucky as i and got to see it also. it was pretty amazing, i just wish i had taken my camera outside, but i hadn't."],"Log Number":"US-03222013-0008"}