{"map":"<A HREF = \"http://maps.google.com/maps?q=41.534884,+-87.269495(46353)&iwloc=A&hl=en\"> mufon case (46353) map </A>","Viewing Distance":"Over One Mile","trends":["There have been 6 other sightings in Hobart","There were no other sightings in Hobart on or around March 22nd 2013"],"Disposition":"Unresolved","Object Flight Path":"Straight-line path","Source":"MUFON","Weather Factors":"Unknown","Date Submitted":"03/22/2013 03:06 UTC","Longitude":"-87.269495","Object Shape":"Circle, Sphere","Tags":"City","Log Number":"US-03222013-0006","files":["/var/www/straped/mufon/html2text/46353.html.txt","/var/www/straped/mufon/org/46353.html"],"Object Features":"Unknown","Region":"Indiana","Sighting Duration":"00:00:30","divs":["sighting detailsi was standing outside looking towards the east, where just above the tree line i was watching 3 hawks flying around in circles. i looked maybe a foot to the left and something spherical or orb looking object caught my eye. it was just different i cannot explain. i focused on it as closely as i could, but it was silent and moving very quickly. when the object was to my north it faded into a tree line and i could not scope it back out.. at this time i looked back east and saw a commercial airline heading in similar direction so i compared the height and speed. the object had to be at least a 1-2 miles high, and moving in the area of 400-600mph, possible a little more. it had no characteristics of the airplane. it was just a orb\\spherical object moving se to nw, silent, and fast. it was a dull grey\\white metallic color. not shiny, but it slightly reflected the sun, in a very dull way. i am trying not to jump to any conclusion, but i am an avid sky watcher and it just seemed to be quite different from anything i've seen in the sky. it was not another airplane very high in the sky. i have lived here my whole life and watched airplanes coming into the chicago area, and this was not a plane!"],"Latitude":"41.534884","Date of the Event":"03/22/2013 01:27 UTC","Case Number":"46353","Summary":"Spherical object seen traveling 400-600mph w/ airplanes and birds in background for comparison","Country":"United States","City":"Hobart"}