{"Summary":"less than 20-25ft above me then followe my car at distance for 4-5 mins","trends":["There have been no other sightings in Hales","This sighting has never been favorited."],"Date Submitted":"03/22/2013 07:16 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=52.5219,+1.507947(46351)&iwloc=A&hl=en\"> mufon case (46351) map </A>","Longitude":"1.507947","Object Features":"Unknown","Log Number":"GB-03222013-0004","Weather Factors":"Unknown","Source":"MUFON","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Country":"United Kingdom","Viewing Distance":"20 Feet or Less","divs":["Sighting DetailsI was driving back from my ex's along a dark country road with green neons on under my car i look up just in front of me and just above the tree top is this triangle shape craft just skimming the trees it was huge each tip had a light on it that changed color between white, orange red yellow blue. it slowed and followed me for about 700 yards above the trees (while moving the triangle was spinning slowly. I tried to call my ex but had dead signal (this could of been poor coverage as i was in the middle of nowhere and the road is dodgey for signal but u usually get some signal at least) as soon as the craft had moved from above me and got to a fair distance my signal came back and i was able to call my now ex to tell her and her family what had happened. it then moved off to my left and got to a distance of 2 farming fields away and followed me until i was about to enter the village of hales at which point it shot of in a up and diagonal direction at speeds i know not possible by any known craft. the craft was low when it was above me you could see a distinct outline and the lights but the craft seemed either dull or partially see through say 20% - 25% transparent"],"Date of the Event":"10/20/2006 08:52 UTC","Object Shape":"Triangle","City":"Hales","Region":"England","Latitude":"52.5219","Tags":"City","Object Flight Path":"Path with directional change,Other","Case Number":"46351","files":["/var/www/straped/mufon/html2text/46351.html.txt","/var/www/straped/mufon/org/46351.html"]}