{"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.720823,+-73.996923(46363)&iwloc=A&hl=en\"> mufon case (46363) map </A>","City":"New York","Object Shape":"Sphere","Country":"United States","Date Submitted":"03/23/2013 04:45 UTC","Date of the Event":"10/09/2011 12:00 UTC","Tags":"City","Object Features":"Unknown","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around October 9th 2011"],"Object Flight Path":"Stationary,Hovering then path,Path then hovering,Other","Disposition":"Unresolved","Summary":"A bright white/greenish bright object","Latitude":"40.720823","files":["/var/www/straped/mufon/html2text/46363.html.txt","/var/www/straped/mufon/org/46363.html"],"Longitude":"-73.996923","Weather Factors":"Unknown","Region":"New York","Log Number":"US-03232013-0003","divs":["sighting detailsbefore i was going to bed last night, i caught this out our skylight. i thought it was the moon but it was fluttering. after a closer look and seeing the moon was in the opposite sky as where this was, and planes flying what looked to be way under it, i decided to snap a few pics. the first quickly took the pics from inside the house out the skylight which has a screen. i then went outside and took a clearer one. for sure it was not the moon, nor a plane or helicopter as it was hovering around same area fluttering all over the place. a bright white\\greenish bright object that i probably would have just thought it was a planet that you could see this time of year or something, until i noticed it was moving around enough, to where i was standing dead still, with all the house lights off and it was moving in and out of the square of the skylight very erratically. this was well beyond where their would be any flight traffic.at least a few miles higher. i watched it for about a half hour, including taking the pics. being so late and having to work in the morning, i had to call it a night so i can not say how long it was actually there besides what i saw. this is in staten island, ny, in the skies , back over the water from gateway to prince's bay. this is approximate logistics, as i am not an astronomer to tell you where in the skies it actually was. cn"],"Sighting Duration":"Undisclosed","Case Number":"46363","Source":"MUFON"}