{"City":"Las Vegas","Longitude":"-115.293632","Case Number":"46365","Viewing Distance":"Over One Mile","Sighting Duration":"00:05:00","trends":["There have been 229 other sightings in Las Vegas","There were 2 other sightings in Las Vegas on or around August 13th 1994"],"Source":"MUFON","Date Submitted":"03/23/2013 11:41 UTC","Log Number":"US-03232013-0005","Latitude":"35.997942","map":"<A HREF = \"http://maps.google.com/maps?q=35.997942,+-115.293632(46365)&iwloc=A&hl=en\"> mufon case (46365) map </A>","Weather Factors":"Unknown","Summary":"Strange lights over the sky","Country":"United States","files":["/var/www/straped/mufon/html2text/46365.html.txt","/var/www/straped/mufon/org/46365.html"],"Disposition":"Unresolved","Region":"Nevada","Object Shape":"Triangle","Tags":"City","Object Flight Path":"Path then hovering","Object Features":"None","divs":["Sighting DetailsThis event actually happen in August 13th 1994 however I am more interested in the past several months In September of 2012 I went back to Vegas to visit my abductors. I was at least telepathically raped and emotionally destroyed by what I saw. I went back to face them and or where I was possibly taken. I went back to where I saw it land and an Apache Indian was waiting for me unannounced to escort me on private property to take me to a hole I've been watching for ten years. That is when all my troubles began that is where I found a very unusual rock and that is where my camera was eventually destroyed. The hole can't be filmed at least by me I have tried several times. You can find my rock at We were waiting for each other 100 on you tube The first time I knew I filmed it yet when I reviewed it showed I never got that far. I believe I was given a very special rock which I will not part with but will bring it to who ever wants to investigate this. Since my first episode with my hole they removed my tracking device in my hand and cured my arthritis in my hip. Since then I have been in telepathic communication with them. They refuse to show themselves to me because I indicate that I'm to afraid and not sure I can handle it. They have responded to many requests they have told me that they live in the Pavo's solar system. I confirmed this under hypnosis with my therapist. I asked them to create a storm over Appleton Wisconsin on December 20th and I would be waiting for them at the Linden L at 2pm and Midnight on that date. The day before the winter advisory warning was 2pm through Midnight Appleton Wisconsin got hit with one storm all winter on that date with a foot of snow. My dispatch computer where I get my orders called me at exactly 12 midnight to the second. This is not possible and now have a record of that. I posted this event on youtube several weeks before and planning it much longer. No one knew how to contact me, It was not a coincidence it had to be them. They answered everyone of suggestions I have a rock I can't explain and they told me where they lived. I have many more requests that they fulfilled for me. I also have pictures of a mining company where they landed that also can't be explained. I know this isn't exactly what you want. I am willing to show my evidence talk to you on the phone as long as it takes to convince you I'm not crazy or come see you. I am not interested in you funding this situation but I need protection when I go back to vegas to finally know the truth. I am willing to surrender my camera that has all my video on it and you can take it apart to see why it was damaged. I admit that there is a possible chance that this is my imagination or I am creating these events to take place however I have them all very well documented and in advance. I have to go back on my own to find out. I am terrified to do it since each time I've gone they have altered my thoughts. I have to do it with or with out your help even if it means my death or disappearance. I want to do it alone and have to do it alone I just what someone to know what I'm doing and to track me when I go. I know it's not exactly what you are looking for but it's very real and worth your time to explore with me. Thank you please contact me and you will understand that this is real. I know this is real and that they do exist please watch how much I believe on you tube at or with the title How I communicate to my Alien friends, Thank you to find the truth you have to put out the effort like I am doing,"],"Date of the Event":"08/13/1994 08:30 UTC"}