{"map":"<A HREF = \"http://maps.google.com/maps?q=33.825756,+-78.671376(46360)&iwloc=A&hl=en\"> mufon case (46360) map </A>","Object Features":"Unknown","Object Flight Path":"Straight-line path","Date of the Event":"03/22/2013 07:10 UTC","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Source":"MUFON","Latitude":"33.825756","Country":"United States","Region":"South Carolina","Summary":"Saw this bright glowing star three times in different places in broad daylight with no cloud cover nearby. Totally just disappeared each time.","trends":["There have been 24 other sightings in North Myrtle Beach","There were no other sightings in North Myrtle Beach on or around March 22nd 2013"],"Date Submitted":"03/22/2013 10:58 UTC","Weather Factors":"Unknown","Case Number":"46360","Log Number":"US-03222013-0013","divs":["sighting detailsmy daughter and i were driving at 7 pm when she saw the object first. we live right near the nc\\sc state line. we were leaving calabash, nc heading to myrtle beach, sc when she first spotted it. she said there is a bright light moving in the sky. i could not find it myself, as i was also trying to drive. all of the sudden, she said it disappeared. we drove just a few miles up into sc and then i saw it. right in front of us!! it was not a plane for sure. just a big, bright light in the sky moving very slowly. my daughter agreed that it was the same thing she had just seen earlier. we were looking to see if there was anything in front of or behind this light to show us that it was just a plane. there was nothing at all. just a bright light that would dim and get brighter again and moving all by itself??? we watched it for app. 30 seconds as it traveled across the hwy. as we were both watching it, it vanished in an instant. there were clouds way off in the distance, but there weren't any near us or this object. nothing for this thing to hide behind or obstruct our view. we began to look around and saw a plane flying nearby. we could see that it was an actual plane!!! pretty obvious!!! no lights, as it was day light still. we drove onto the interstate about 5 miles up and my daughter saw it again. i couldn't find it once again this third time. she watched it for about 20 sec and then she laughed and said, \"it's gone again!!\" almost as if it knew we were watching it. it would just vanish. i even pulled over right when i watched it disappear the second time. i was parked right in front of where it was, and we saw nothing. if it had been a plane, we would have seen it again at some point and it couldn't just disappear. there is no way something could have just evaporated like that. this was so obvious and real, i hate no one else was with us to see it. again, this was not a plane. we both agreed it was pretty freaky!"],"Longitude":"-78.671376","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","files":["/var/www/straped/mufon/html2text/46360.html.txt","/var/www/straped/mufon/org/46360.html"],"City":"North Myrtle Beach","Object Shape":"Star-like"}