{"Log Number":"US-03232013-0004","Disposition":"Unresolved","Case Number":"46364","Weather Factors":"Unknown","Date of the Event":"03/22/2013 08:45 UTC","Summary":"Very low flying bright blue orb heading east to west. No noise.","Region":"New York","Tags":"City","Sighting Duration":"Undisclosed","City":"New York","files":["/var/www/straped/mufon/html2text/46364.html.txt","/var/www/straped/mufon/org/46364.html"],"Country":"United States","Source":"MUFON","Date Submitted":"03/23/2013 07:51 UTC","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Flash, Teardrop","map":"<A HREF = \"http://maps.google.com/maps?q=40.85373,+-73.862787(46364)&iwloc=A&hl=en\"> mufon case (46364) map </A>","Longitude":"-73.862787","divs":["Sighting DetailsLast night my wife and I went to our font yard to have, our nightly, cigarette break together. We were talking for about 3 minutes or so, when all of a sudden a bright blue orb with a redish trail, very low altitude flew east to west. It also continuously reflected a very bright whitish light - like the flash of a camera. It happened for about 6 seconds or so, but I do not think it was a meteor- these lights were unbelievably radiant and long lasting. I've seen meteors before - this in my opinion - was not one. My wife panicked and went upstairs to make sure the kids were ok. I stayed outside and 3 woman who happened to be walking by - I stopped and asked them if they had just seen that blue light in the sky. They had - and were in shock just as we were. We looked up to see if it would reappear but it was gone. It definetly wasn't any kind of plane - as I'm currently a student pilot and know about planes. And I don't think it was a meteor - cause aside from the way it looked - cause nothing could go that fast, that low, without making noise. I'm still shocked today, and neither my wife or I got a good night's rest cause of it. Of course I didn't get any pictures, as this was the last thing I expected to see last light and also it happened so fast."],"trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around March 22nd 2013"],"Object Features":"Other","Object Flight Path":"Straight-line path","Latitude":"40.85373"}