{"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=43.235179,+-75.89668(46362)&iwloc=A&hl=en\"> mufon case (46362) map </A>","Date Submitted":"03/23/2013 02:18 UTC","trends":["There have been no other sightings in Stoney Brook","This sighting has never been favorited."],"Viewing Distance":"501 Feet - 1 Mile","Latitude":"43.235179","Object Features":"None","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Country":"United States","files":["/var/www/straped/mufon/html2text/46362.html.txt","/var/www/straped/mufon/org/46362.html"],"Region":"New York","Case Number":"46362","Summary":"A round to oval semi-solid appearing object with ill defined borders made a rapid descent from an undetermined height to hover approximately 1/2 - 1 mile above the ground then accelerated at tremendous speed to the east abruptly changing.","Date of the Event":"07/15/1991 12:00 UTC","Object Shape":"Other","Longitude":"-75.89668","Log Number":"US-03232013-0002","Source":"MUFON","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","divs":["Sighting Details On the date of observation, I was in an open field on what was then privately owned property of the Gyrodyne Corporation on the North Shore of Long Island NY near the towns of Flowerfield and Stony Brook. The land is now owned by the State University of New York at Stony Brook. I was in the field that day practicing wilderness survival skills I had been developing after attending a survival school in New Jersey a few years prior. There were no clouds in the immediate vicinity as I have a habit of scanning the sky in order to identify any high flying birds that may be in the area i.e. red tailed hawks. I looked up and the movement of what first appeared to be a small cloud at an extreme height caught my attention in the southeast at approximately 70 degrees above the horizon from a reference point of 90 degrees which would have been directly above me. However, this movement was unlike any cloud movement I had witnessed during my previous, at the time, 30 years on the planet. What began as a tiny object grew rapidly during the course of its 3 to 4 second descent to a much larger object hovering at about the height of where helicopters might hover but much, much lower the airspace of jet aircraft. To estimate the size of this object, a common coffee table coaster held at arms length would have barely covered it at this distance. The object appeared silvery white, not exactly translucent but not exactly solid either. The edges of the object were ill defined and had the definite appearance of waviness, similar to a water mirage on a road on a hot day. I had the distinct feeling at the time that this object was either a spiritual manifestation of some sort or a terrestrial or extra terrestrial air vehicle exhibiting a high-tech form of camouflage. I observed this object hovering for over 5 minutes . I was seized my a feeling that this object was acutely interested in me and my activities. I started to consider that if this was of extra terrestrial origin or spiritual origin I was perhaps in some danger and my emotions ranged from a benign anxiety to alarm. Whether my feelings were perceived by the object or entities therein is unknown but the object accelerated from a standstill toward the east at what I can only describe as incredible speed . The object then appeared to execute a 90 degree turn to the south without slowing down but this angle was impossible to determine with accuracy from my vantage point. The object, due to this incredible speed, then disappeared from sight."],"City":"Stoney Brook","Disposition":"Unresolved"}