{"Date of the Event":"03/23/2013 12:00 UTC","divs":["Sighting DetailsI was outside backyard with my son and his friend. Around 9 pm Saturday the 23rd of March. My son was starting a small bon fire.The sky was clear as a bell. Small misty cloud to the south. I sat down facing the East and above my house there was a bright red orange somewhat yellow fireball shaped object. It seemed to just be still. I thought it was a plane at first but it didnt really move. There was no sound. I understand an object coming toward you may appear to be standing still. I watched it for a few minutes. It was large compared to the stars that were out. Very bright. In my backyard we have quite the view of sky. I looked down at the fire for just a couple minutes less then 5 minutes and looked back and it was like it disappeared into thin air. I looked all around in sky especially to the west and found nothing moving, no lights moving. Nothing but the still air and stars. I couldnt stop thinking about it the rest of the night. I recalled a fellow stating two weeks ago described something similar he saw over Bellingham bay and how quickly it moved with no sound."],"Case Number":"46379","Tags":"City","Sighting Duration":"Undisclosed","Object Features":"Unknown","Date Submitted":"03/24/2013 12:02 UTC","Country":"United States","trends":["There have been 27 other sightings in Bellingham","There were no other sightings in Bellingham on or around March 23rd 2013"],"Viewing Distance":"101-500 Feet","Source":"MUFON","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/46379.html.txt","/var/www/straped/mufon/org/46379.html"],"Weather Factors":"Unknown","Latitude":"48.759408","City":"Bellingham","Log Number":"US-03242013-0008","Summary":"{nd} Bright fireball like object sighted over house, no sound,,quickly disappears.","Region":"Washington","Longitude":"-122.50042","map":"<A HREF = \"http://maps.google.com/maps?q=48.759408,+-122.50042(46379)&iwloc=A&hl=en\"> mufon case (46379) map </A>","Object Shape":"Fireball","Object Flight Path":"Stationary,Hovering then path"}