{"Longitude":"-79.933681","Object Flight Path":"Straight-line path","Case Number":"46370","Weather Factors":"Unknown","trends":["There have been no other sightings in Penetanguishene","This sighting has never been favorited."],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=44.768768,+-79.933681(46370)&iwloc=A&hl=en\"> mufon case (46370) map </A>","files":["/var/www/straped/mufon/html2text/46370.html.txt","/var/www/straped/mufon/org/46370.html"],"Latitude":"44.768768","Source":"MUFON","Region":"Ontario","Object Shape":"Sphere","Date Submitted":"03/23/2013 11:05 UTC","Log Number":"CA-03232013-0010","Country":"Canada","Summary":"Pulsating orb of blue and red and white light visible through telescope. Appeared to spin and waiver left to right as it progressed higher in the horizon","divs":["Sighting DetailsI was in my backyard with my dogs and I texted my friend. He answered \"I'm watching that ufo I told you about\". Before he told me where to look I scanned the sky in the direction of his house and spotted a star that seemed to be flickering red and blue. From where I was visible through the branches of a tree. I tried to photograph it with my phone with no success. Then I got my camera ( 30x zoom 10 megapixel). But I had no tripod for it so the pictures were unclear and streaky. I went upstairs in my house and turned off all the lights in an attempt to view it through the open window. At this point it was much higher in the sky. And appeared to be dancing from left to right and spinning. I went out to the shed and got my daughters telescope. When I brought it inside it fogged up and I had to wait 20 mins or so for it to climatize. When I finally was able to see it through the viewfinder I couldn't believe my eyes. I showed my son and text my wife at work. She went outside to see it as well to the naked eye it was weird ..... But through the telescope it was obviously not a plane or a star it looked like a rip in time. Spinning and flashing and pulsating sort of spherical swaying from left to right but continuing to slowly move higher we observed it through the telescope for around an hour. And I just couldn't look anymore. It doesn't make sense. Nothing I have ever seen before Its still there now. Almost straight up now just can't keep watching it"],"Date of the Event":"03/23/2013 12:00 UTC","Object Features":"None","Tags":"City","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","City":"Penetanguishene"}