{"divs":["Sighting DetailsI spent the evening cleaning my garage. After I finished for the evening I went to the driveway to smoke a cigarette - approx 9:45 - and was looking up at the night sky and saw a bright orange orb over to the north coming across the tree line. I instantly yelled to my wife to come look at object. After she seen the object we got really nervous and starting scrambling looking for cameras and video camera. Video camera was dead. I then went back to the driveway to see it go across the sky. My wife then went to the back porch to see it come across the houses and headed to the west. I then moved to the back porch to observe. We both just stared at object in amazement of what we were witnessing. The object made no sound what so ever and no sudden moves in any direction. It started in the north and headed to the west. My wife and I watched the orange orb object going further in the western distance. After about 10 minutes the object then disappeared in a flash. After the object disappeared we both looked at eachother in amazement of what we both witnessed. throughout the evening we kept returning the porch looking for the object but to no avail. Roughly 20 minutes later a helicopter was heard in the the distance hovering over the similiar area. The helicopter was easily recognizable with its swishing noise and flashing lights. The object it we saw was blaze orange and made no sound. we have never seen anything like it. It was not a plane or helicopter or anything like that."],"Sighting Duration":"Undisclosed","Source":"MUFON","trends":["There have been 30 other sightings in Lafayette","There was one other sighting in Lafayette on or around March 23rd 2013"],"files":["/var/www/straped/mufon/html2text/46375.html.txt","/var/www/straped/mufon/org/46375.html"],"Date Submitted":"03/24/2013 08:56 UTC","Country":"United States","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Object Features":"Other","Case Number":"46375","Region":"Indiana","Disposition":"Unresolved","Longitude":"-86.887071","Object Shape":"Circle, Other","Tags":"City","Summary":"standing in driveway and looked up and seen orange orb strreak across sky from north to west then disappeared instantly after ten minutes","Date of the Event":"03/23/2013 09:50 UTC","City":"Lafayette","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=40.389515,+-86.887071(46375)&iwloc=A&hl=en\"> mufon case (46375) map </A>","Latitude":"40.389515","Log Number":"US-03242013-0004"}