{"Log Number":"US-03242013-0002","Tags":"City","files":["/var/www/straped/mufon/html2text/46373.html.txt","/var/www/straped/mufon/org/46373.html"],"Date Submitted":"03/24/2013 05:34 UTC","Region":"Kentucky","Object Flight Path":"Stationary","Latitude":"38.217432","Case Number":"46373","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Summary":"Cigar Shaped Object . Enormous size considering the approximated distance of the object.","Date of the Event":"03/23/2013 12:00 UTC","Object Shape":"Cigar","City":"Louisville","Object Features":"None","Longitude":"-85.688759","Source":"MUFON","Weather Factors":"Unknown","Country":"United States","divs":["Sighting DetailsAt about midnight, my friends and I started a campfire in my back yard. Shortly after we started the fire I noticed an anomalous object on the western horizon. I would say that the object was definitely elongated, or shaped like a cigar. If you were sitting down and you held an aspirin capsule at arms length it would be a good size reference for this object. It was a lime green color and it was glowing with a high luminosity. It made no sound and it did not move. It 'hovered' in the same spot for nearly 3 and a half hours , and everyone saw it. The only reason that we 'lost sight of it' was because it started raining and we had to go inside. The object was miles and miles away but I believe that it must have been massive considering the elongated shape was clearly visible and because of how bright it was glowing. I live next to the city so I can hardly ever see stars or other celestial objects anyway and this was a cloudy night. There were no other stars out tonight. I thought it could have been a comet but the object just was just to solid. There was no tail or streak and it was way to low on the horizon. All I could do was stare at it. I couldn't say anything to the people around me for a moment. Someone finally asked me what I was looking at and I was able to use reference points to show them what I was seeing. They saw it and nobody else could really come up with an explanation either. Im left baffled by this and I really don't know what to think right now. I know what I saw, and I know what I didn't see. What are we supposed to do about this?"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.217432,+-85.688759(46373)&iwloc=A&hl=en\"> mufon case (46373) map </A>","trends":["There have been 67 other sightings in Louisville","There were no other sightings in Louisville on or around March 23rd 2013"],"Disposition":"Unresolved"}