{"Disposition":"Unresolved","Log Number":"US-03242013-0015","divs":["Sighting DetailsMarch 22, 2013 at 7:54 PM driving East on Rt. 64 from Charlottesville, VA. About 1,500 feet from Exit 124 a radiant stream of blue light with some white in it flashed down at a 45 degree angle. Only for a few seconds. It first appeared about 400 feet to the left of the car and was about 400 feet above the ground headed to the right. It disappeared at about 100 feet from the earth. My time is exact, the place on the highway close, the distance and hight of the UFO approximate. I assumed immediately that this was a UFO event because there was no sound, and especially in the manner that the light just suddenly and silently appeared and disappeared, and the light was like a Photoshop creation for a television advertisement: by that I mean to say the light seemed hyper-real; it was so strongly colored! My wife was with me and saw it just as I did. The sky seemed relatively clear so I do not think that it appeared or disappeared behind clouds. I am no MUFON observer, but I have been a member of MUFON for over ten years, and I was in the Navy, and for a month or so worked in tracking fighter planes. But I am no expert in this. I don't know if this counts as an \"Oz\" situation, but we had just come from a visit to an \"energy intuitive\" and she (name withheld) and for no cost gave us some of the most profound insights of our lives for personal growth."],"Tags":"City","Object Shape":"Flash","Country":"United States","Case Number":"46386","Sighting Duration":"00:00:03","City":"Charlottesville","Object Flight Path":"Straight-line path","Region":"Virginia","Date Submitted":"03/24/2013 05:38 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.035076,+-78.471458(46386)&iwloc=A&hl=en\"> mufon case (46386) map </A>","Weather Factors":"Unknown","trends":["There have been 19 other sightings in Charlottesville","There were no other sightings in Charlottesville on or around March 22nd 2013"],"Date of the Event":"03/22/2013 07:54 UTC","Object Features":"None","Summary":"Radiant blue light suddenly and silently appears descends then disappears.","Source":"MUFON","Longitude":"-78.471458","Latitude":"38.035076","files":["/var/www/straped/mufon/html2text/46386.html.txt","/var/www/straped/mufon/org/46386.html"],"Viewing Distance":"101-500 Feet"}