{"Region":"Kentucky","Tags":"City","trends":["There have been 8 other sightings in Falmouth","There were no other sightings in Falmouth on or around March 23rd 2013"],"Disposition":"Unresolved","City":"Falmouth","Log Number":"US-03242013-0014","Longitude":"-84.333025","Case Number":"46385","Source":"MUFON","Sighting Duration":"00:03:00","files":["/var/www/straped/mufon/html2text/46385.html.txt","/var/www/straped/mufon/org/46385.html"],"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.676372,+-84.333025(46385)&iwloc=A&hl=en\"> mufon case (46385) map </A>","Country":"United States","Latitude":"38.676372","Date Submitted":"03/24/2013 04:44 UTC","Object Shape":"Disc","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting Detailsmy wife and I were going for a walk, and she decided to sit in our driveway instead.So I got a chair off the front porch for her and then I got one,we were enjoying the sunshine on a cool day. I just happened to look up over her head and in the sky was the disk.I asked her to look at it just to make sure my eyes wearnt playing tricks on me.at first I thought it was a black buzzard at first and then looked closer, and noticed it wasn t moveing.that got her attention, so she looked and she saw it. So I told her to keep an eye on it as I went to get my binoculers , I got them with in 5 seconds and was looking at the disk,and she looked at it too.we watched it for about one minute and we noticed a few planes flying above it, and with out a trace it was gone.when I looked at the disk I could only see the bottom and it was a shinny brass color on the bottom,From ware we were on the ground level it was about 70 % in the sky and it moved right over our heads at 90%and disappered just like that we lost it. I have see one once before in 1972 in my uncel s back yard in covington area with my cousin we were just kids, and just never talked about it, but it also was a silver disk,with naked eye, but with binockulers I saw the brass bottom. ,"],"Weather Factors":"Unknown","Summary":"saucer like flight was lower then jet flight s because it wasbetween us and a jet fumes above it, looked at it with binockulures, me and my wife both seen this.","Object Flight Path":"Hovering then path","Date of the Event":"03/23/2013 03:45 UTC"}