{"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=31.976869,+-99.895133(46390)&iwloc=A&hl=en\"> mufon case (46390) map </A>","Country":"United States","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Date of the Event":"01/02/2013 09:30 UTC","Longitude":"-99.895133","Case Number":"46390","Source":"MUFON","Disposition":"Unresolved","Sighting Duration":"Undisclosed","City":"Houston, possibly Katy or","Object Flight Path":"Stationary,Path with directional change,Other","Region":"Texas","Latitude":"31.976869","files":["/var/www/straped/mufon/html2text/46390.html.txt","/var/www/straped/mufon/more/46390_submitter_file4__Random777.jpg","/var/www/straped/mufon/more/46390_submitter_file5__Random779.jpg","/var/www/straped/mufon/more/46390_submitter_file6__Random781.jpg","/var/www/straped/mufon/org/46390.html"],"Object Shape":"Star-like","Object Features":"Unknown","trends":["There have been no other sightings in Houston, possibly Katy or","This sighting has been favorited 1 time."],"Log Number":"US-03242013-0019","divs":["sighting detailsi was driving my kids to their mother's heading north up interstate 45 entering clear lake\\webster area. i began to notice helicopters and airplanes in the sky which did not do more than barely get me to look up and watch them. i noticed multiple bright star-like objects far above them underneath the overcast sky, flying in slow swooping or curving tracks seeming to float further up into the sky. i was excited and started to look for more and noticed a larger and brighter star-object on the horizon floating downward slowly towards the tree line. i had no clue what these things were, they looked like stars. they were maybe a mile away, maybe more. but the light beams from them would pierce through the black sky much like a star's light would, and also had an iridescent twinkle to them. they looked just like stars. i focused on the larger one because i was excited to witness this and did not want to miss any more of what ever was going on. i felt an exciting tingle all the way to my finger-tips. i was incredibly intrigued and hollered to my kids to look but they would not stir from their sleep. which was odd, i also oddly gave up quickly trying to wake them. i began to video tape the objects. i video taped the larger object mostly and i think i saw it absorb another smaller one that seemed to come from the ground behind the tree-line. they object was to my left eventually almost below the trees, where i think it landed, and i could not track it and drive at the same time anymore. i have a couple grainy videos that i took with my crappy phone that i would love to give copies of, if they provide any help whatsoever."],"Summary":"Saw increased aerial activity while driving on highway, started noticing multiple UFO's behaving differently.","Date Submitted":"03/24/2013 08:51 UTC"}