{"Summary":"Observed UFO over Columbia River. Yellow lights shining on lumber yard below it. Traveled slowly Easterly.","divs":["Sighting DetailsI was Westbound on Hwy 14 at 1:30ish AM, returning home after working on my sisters mobile home. The only other car on the road ahead slowed and pulled over to the side of the road. I slowed and stopped thinking he needed help. I saw him looking to the south, over the river. When I looked over to the river, I saw the UFO, Eastbound and slowly descending, with two very large yellow lights on the underside shining straight down. The lights were illuminating a lumber yard on the bank of the river. It was roughly rectangular with the front edge rounded. The UFO descended to about 500 feet and then leveled out. It continued moving easterly until it was about roughly perpendicular to me and the highway. I got a good long look at the UFO during this time. It was pretty large and very clear. It was easily larger than several 747 aircraft placed wing to wing. It had two very large yellow lights on the underside at each end. The lights were about 8 feet in diameter and emitted a yellowish light. I could not see objects behind (through) the light beams. It was like they were opaque. The UFO itself was flat black in color. There were no other lights, portholes or features that could be seen. I listened carefully for any sounds the UFO might be making, but it was silent. I even turned my car's engine off to hear better. I estimated it's speed at about 35 MPH and very constant. Then a kind of spooky thing happened. The UFO shut off the two big yellow lights and and began a slow ascent. I had the feeling like the thing had spotted us watching it and decided to leave. When the UFO started its ascent it didn't pitch up like an aircraft would have done. It remained quite level and simply started ascending while traveling to the East. It continued climbing at about a 45 degree angle until it reached the overcast and slowly disappeared as it entered the clouds. The other guy on the road ahead of me watched the whole event. As soon as the UFO went into the clouds, he started his car and took off towards Vancouver. I wanted to go talk to him to see if he saw what I saw, but had no chance since he left so quickly."],"Country":"United States","Longitude":"-122.428088","Disposition":"Unresolved","Region":"Washington","Object Features":"Other","City":"Camas","files":["/var/www/straped/mufon/html2text/46391.html.txt","/var/www/straped/mufon/org/46391.html"],"Date of the Event":"01/16/1995 01:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.580597,+-122.428088(46391)&iwloc=A&hl=en\"> mufon case (46391) map </A>","Weather Factors":"Unknown","Date Submitted":"03/24/2013 10:18 UTC","Object Shape":"Unknown","Tags":"City","Case Number":"46391","Log Number":"US-03242013-0020","Source":"MUFON","Latitude":"45.580597","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 4 other sightings in Camas","There were no other sightings in Camas on or around January 16th 1995"]}