{"Viewing Distance":"501 Feet - 1 Mile","Summary":"Bright silver lightl stationary then left to the S directly away from me at high rate of speed. pilot 45yrs, no airccraft","Disposition":"Unresolved","Object Flight Path":"Hovering then path,Straight-line path","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=32.078168,+-98.285338(46393)&iwloc=A&hl=en\"> mufon case (46393) map </A>","Longitude":"-98.285338","Case Number":"46393","Region":"Texas","Date of the Event":"03/24/2013 02:30 UTC","Latitude":"32.078168","City":"Dublin","Sighting Duration":"00:01:00","trends":["There have been 40 other sightings in Dublin","There were no other sightings in Dublin on or around March 24th 2013"],"divs":["sighting detailsleft work shortly after 2pm sunday, 3\\24 going home to granbury,tx. from stephenville. i take the back roads instead of hiway 377, the commonly used route because of heavy traffic on 377, for safety reasons. i was on cr305 close to the erath\\hood county line. a very rural area and sparsely populated. almost no traffic. about 1420hrs a very bright silver light to the south caught my eye. it appeared round but was so bright it was hard to tell. i appeared to be about a mile away, at 5000' above ground, stationary. i stopped my car and watched it for about one minute then it shot away almost directly away from me to the south so i lost sight in less than a second. i have been a licensed pilot for 45 years and this was no known aircraft. this was a sunny clear day so the brightmess was really remarkable. i do not believe it was a reflection, again because of the level of brightness so that the light appeared to be eminating fron the object. i was very interested and curious, i was not frightened. \\"],"Weather Factors":"Unknown","Tags":"City","Source":"MUFON","Country":"United States","files":["/var/www/straped/mufon/html2text/46393.html.txt","/var/www/straped/mufon/org/46393.html"],"Log Number":"US-03242013-0022","Date Submitted":"03/24/2013 11:15 UTC","Object Shape":"Sphere"}