{"Latitude":"26.27246","Longitude":"-80.249175","Date of the Event":"03/24/2013 10:00 UTC","Log Number":"US-03252013-0010","Disposition":"Unresolved","Summary":"Hundreds of lights dancing around the sky","Weather Factors":"Unknown","City":"Coral Springs","Tags":"City","Viewing Distance":"Over One Mile","Case Number":"46405","Region":"Florida","Object Features":"Unknown","Source":"MUFON","divs":["sighting detailsme and my fiance were on our patio in margate facing west toward everglades when she saw the lights. i began to look and saw star like light in the sky, there were about three all dancing around each other flying up and across the sky. they would change direction instantly and then speed up and shoot across the sky. they were all over the sky almost like a swarm of locus but lights. they would shoot off up into space and then we would see more. if you looked at the horizon west, there were many of these lights which would then rise into the sky dance around and shoot up into space. the night was a full moon, the clouds were so thick and pink, that if they crossed under the moon it would block the moon out completely. the clouds also seemed like they were hiding these crafts. the ufos would come out of these clouds and go back in. it seemed like they almost had the ability to control the clouds, splitting them and then making them come back together. a group of these ufos would also come together and then the light would disappear but you could still see an invisible, cloak like look which was in a triangle type shape which would distort the sky and it would then take off. we were so amazed by this we started to call everyone we knew to look. every person saw the same thing we did! they were amazed. the whole thing lasted like 3 hours. we decided to drive closer around 12:15 to the everglades to see if we could get a better look. when we arrived, my fiance pointed out which looked like a plane and said \"there it is look\". it was traveling from east to west, maybe about 1mi up. i thought it was a plane but she told me to keep watching it. it was going pretty fast, then all of the sudden it stopped in mid air. it had a red\\orange glow. it hovered almost right above us for about 15 seconds when it took off straight up into space! the most amazing thing i have ever seen in my life. we have at least 5 other people in different locations throughout the city who saw the same thing. i tried to take pictures and video with my iphone and nikon, but the clouds and lights were too thick and the light was too dim for the camera to pick it up. i hope someone else got it."],"map":"<A HREF = \"http://maps.google.com/maps?q=26.27246,+-80.249175(46405)&iwloc=A&hl=en\"> mufon case (46405) map </A>","trends":["There have been 18 other sightings in Coral Springs","There were no other sightings in Coral Springs on or around March 24th 2013"],"Object Shape":"Disc, Flash, Oval, Sphere, Star-like","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Country":"United States","Sighting Duration":"03:00:00","Date Submitted":"03/25/2013 02:03 UTC","files":["/var/www/straped/mufon/html2text/46405.html.txt","/var/www/straped/mufon/org/46405.html"]}