{"Case Number":"46400","trends":["There have been 110 other sightings in Seattle","There were no other sightings in Seattle on or around March 24th 2013"],"Latitude":"47.645426","Sighting Duration":"Undisclosed","Date Submitted":"03/25/2013 06:42 UTC","divs":["Sighting DetailsWe live in Seattle on Queen Anne hill, north of the space needle. Sea Tac int. airport is close so we see planes all the time. My girlfriend hadjust gone to bed and I ssat down to watch something on netflix. Out the southern window I saw these two bright red lights through the leafless tree outside our building coming our direction. There was a low cloud cover and they didn't look \"right\" Looked like red road flares but not on the road. I thought they might be planes but they really didn't look like planes. Too brilliant and just red with a whitish center. I called to my girlfriend to come take a look. She did and told me she thought it was strangethat they were flying in a wobbly line. She knew I was a fan of funny things in the sky so it wasn't a shock to her when I had my phone, a flashlight and my shoes on by the time she turned from the window. I shot down 3 flights of stairs and out onto the street. I ran to where I could see them and didn't have a street light blinding me. I began to film after I wiped my phone's camera lens. I didn't want to be \"that guy\" I began to loose track of the lead object when I saw another making 3. I filmed them for a few moments and a jet came from around a building, climbing. It must have seen them. It passed so close. I'm guessing this based off the cloud cover it and they seemed to be under. The plane ascending into the clouds infront of the objects and out of sight within frame of the camera. It could be heard clearly but the objects remained visable and still moving North. They began to get lost in the clouds and I stopped filming. I lost sight of them moments later. The end...?"],"Object Features":"None","files":["/var/www/straped/mufon/html2text/46400.html.txt","/var/www/straped/mufon/org/46400.html"],"Country":"United States","Weather Factors":"Unknown","City":"Seattle","Disposition":"Unresolved","Source":"MUFON","Region":"Washington","Longitude":"-122.371648","Date of the Event":"03/24/2013 11:18 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=47.645426,+-122.371648(46400)&iwloc=A&hl=en\"> mufon case (46400) map </A>","Object Shape":"Sphere","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-03252013-0005","Summary":"Redish brilliant lights, 3 flying in a line. Plane passed scary close, on video.","Object Flight Path":"Straight-line path"}