{"Latitude":"42.018769","Object Shape":"Circle, Egg, Oval, Sphere","trends":["There have been 2 other sightings in Mansfield","There were no other sightings in Mansfield on or around March 24th 2013"],"Country":"United States","Date Submitted":"03/25/2013 01:39 UTC","Log Number":"US-03252013-0009","Tags":"City","Date of the Event":"03/24/2013 08:10 UTC","Longitude":"-71.196639","Object Features":"Unknown","City":"Mansfield","Object Flight Path":"Straight-line path","Summary":"8-10 red orange orbs in single line equal distant","Disposition":"Unresolved","divs":["Sighting DetailsI was on my way to dinner with my girlfriend when I looked out the window of her car. I first noticed these lights and thought it was just the Big Dipper. As I kept looking I realized they were too big of lights to be that. I kept my eye on them and pulled over in a place clear from trees it was at that time I realized there was about 8-12 big orbs in a single line equally distant. My girlfriend and I were shocked seeing these mysterious lights I took out my phone and attempted to record the phenomenon but the orbs wouldn't appear on my screen. So I pressed the home button and looked back up and almost all of them suddenly disappeared. For another 3 minutes I watched the last of them dissolve into the sky. I noticed after the first group of them dissapeared there was a plane there. It was very strange but also very cool I contemplated with my girlfriend saying maybe the government is testing new ships but it seemed to be bizzare for them to have that many in a line equally distant. Also we considered the meteor shower that happened this week but we ruled that out pretty quick considering the objects were moving up. This sighting opened me up to the thought what else is here on earth with us"],"Weather Factors":"Unknown","Region":"Massachusetts","files":["/var/www/straped/mufon/html2text/46403.html.txt","/var/www/straped/mufon/org/46403.html"],"Case Number":"46403","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.018769,+-71.196639(46403)&iwloc=A&hl=en\"> mufon case (46403) map </A>","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed"}