{"map":"<A HREF = \"http://maps.google.com/maps?q=38.961409,+-84.259486(46401)&iwloc=A&hl=en\"> mufon case (46401) map </A>","Weather Factors":"Unknown","Source":"MUFON","Country":"United States","Object Shape":"Chevron","files":["/var/www/straped/mufon/html2text/46401.html.txt","/var/www/straped/mufon/more/46401_submitter_file1__MUFON3.jpg","/var/www/straped/mufon/more/46401_submitter_file2__MUFON2.jpg","/var/www/straped/mufon/org/46401.html"],"Date of the Event":"02/08/1979 12:00 UTC","Region":"Ohio","Log Number":"US-03252013-0006","Disposition":"Unresolved","Case Number":"46401","Latitude":"38.961409","Tags":"City","City":"Kettering, OH","Sighting Duration":"Undisclosed","Object Features":"Unknown","Summary":"I witnessed 5 to 7 lights (in a chevron formation) hovering over northeast Dayton, OH in the late 1970's or early 1980's.","Longitude":"-84.259486","trends":["There have been no other sightings in Kettering, OH","This sighting has never been favorited."],"Date Submitted":"03/25/2013 07:50 UTC","Object Flight Path":"Stationary","Viewing Distance":"Over One Mile","divs":["Sighting DetailsI was on my way to my bowling league one night in the late 1970's or early 1980's. I believe it was wintertime, but not positive. As I turned right (north) onto Spaulding Road near Kettering, OH, I noticed a formation of 5 to 7 white lights off to my 10 o'clock position. The lights puzzled me, as they were in a chevron looking formation, and not moving. At first I thought I may be seeing reflections from behind my car, but noticing nothing behind me, I rolled down my driver's window and the lights were still there in the distance, and just hovering. At the time of my sighting, the road on which I traveled was in a bare state-run farm field. My view was unobstructed for about a mile. I slowed down to about 15 MPH and continued to view the lights for about 3 minutes until my view was obstructed by trees and residencial development. The lights were about 40-45 degrees elevation from ground level and appeared to be more than a mile from me. The overall size was enormous, but I couldn't determine the distance from me as it was dark outside. They appeared to be at least a mile away and possibly 2 miles. I never reported the sighting figuring that it had to have been seen my hundreds, and I therefore didn't need to report it. I wish now that I reported it then, as my recollection as to the date it happened and exact number of lights fail me. I have included two maps to show you where I was at the time, and the direction in which I saw the lights. Upon seeing the Phoenix lights of 1997 on a TV program, I could swear that I was viewing exactly what I saw in the Dayton area, in relative size, elevation, and approximate distance. I have enclosed 2 maps showing the location and destination where the sighting occurred. I would like to know if this occurance was reported, and if so, what it was that I saw. I am an Air Force veteran, and at the time of the sighting, I knew of nothing that the military had in its inventory that would have explained what I saw."]}