{"Object Flight Path":"Stationary,Path with directional change","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","Case Number":"4640","Date Submitted":"10/15/1982 12:00 UTC","Log Number":"US-04042006-0017","Source":"MUFON","City":"Gulf of Mexico","Date of the Event":"10/15/1982 12:00 UTC","Sighting Duration":"Undisclosed","Object Features":"Window(s)","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=29.458143,+-94.500581(4640)&iwloc=A&hl=en\"> mufon case (4640) map </A>","files":["/var/www/straped/mufon/html2text/4640.html.txt","/var/www/straped/mufon/org/4640.html"],"Disposition":"Unknown","trends":["There have been no other sightings in Gulf of Mexico","This sighting has never been favorited."],"Longitude":"-94.500581","Object Shape":"Disc","Region":"Texas","Latitude":"29.458143","Summary":"ufo crossed the sky and came to within 200 yds of us and stopped in sky at 15 degree angle.it took off and was out of sight in 3 seconds.","Tags":"City","divs":["Sighting DetailsI was first mate on gulf king 6,a shrimp boat.I was standing watch and talking with friends on the radio,when I noticed what I at first thought was a helicopter come from behind an oil platform about 2 miles from us.it was broad daylight,and clear about 8 am in the morning.there was approximatly seven boats towing together when this happened,so as the object came closer,people became silent on the radio until you could of heard a pin drop.being further away than the others I was the last to realize this was no helicipter.this object literally wove its flight path in and out amongst the boats and did it slowly.it finally came towards my boat and I just couldnt decide what to do when it came to a complete stop.it was less than a football field dead ahead of my boat and tilted at a slight angle about 75 ft. off the water.after about 2 minutes of just staring at this flying saucer I reached behind me for the binoculars,and turned my head just enough to see them.as I did so I saw a streak in my peripheral vision,and so I grabbed the binoculars and swept the sky from position angle 1-6 and 360 to no avail.about the same time every one started talking about what we had just seen and how fast it was.the radio and electronics on the boat never fluctuated or ceased to work.we all watched this thing for a good 10 minutes and saw it close up.it was real,and I have never seen it again"]}