{"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.792141,+-74.063758(46411)&iwloc=A&hl=en\"> mufon case (46411) map </A>","Longitude":"-74.063758","Date Submitted":"03/25/2013 10:58 UTC","Log Number":"US-03252013-0016","Object Features":"Unknown","Viewing Distance":"Unknown","Latitude":"40.792141","divs":["Sighting DetailsAround 9 P.M. I walked to the Shell gas station to buy Newport smokes. When I walked down toward the corner, my attention drew to the sky to the left because there was a brighter light than the other stars. I kept observing for about a minute, but then I decided to walk home and bring my video camera back to where I saw it, since my house was only a block away. What I saw was a heavy white light, it pulsated bigger and then drew back as it pulsated, but the pulsating was most clear at the edges of the circle, and the white color only remained white at the edges. It flickered more rapidly than the stars, and it changed colors in a repetitive fashion. The inner color changed from white to red to blue, and the depth of the color looked very unique. A policeman stopped his car and had asked me what I was doing because from his view it looked like I was recording somebody's house, but rather I was recording the sky above the house. I really can't remember any clouds. I told him that I tried to look at the surrounding stars, maybe try and see if the pulsating is happening elsewhere, or maybe it was my eyes, but both possibilities weren't valid. All the other stars looked like solid white stars. When I told him that, he walked toward me and then stood beside me to look at it. He said, \"Yeah I can see it. Is your camera getting it?\" I said, \"No, the zooming in is making it blurry.\" He didn't talk much after that and eventually he drove away. What I saw was very unique and unusual. I already posted a question about what I saw on Yahoo! Answers. Also, I never knew that MUFON was a legitimate organization until today when I read that a newspaper editor had told a citizen to go to MUFON. I haven't forgot what I saw. It's just affecting me but I don't why. I'm a 23 year old male. FYI: I dropped my camera in the hackensack riverbank, but I can still make a sketch."],"Sighting Duration":"00:15:00","Object Shape":"Circle, Flash, Sphere, Star-like","Source":"MUFON","Region":"New Jersey","Disposition":"Unresolved","trends":["There has been one other sighting in Secaucus","There were no other sightings in Secaucus on or around October 10th 2010"],"Object Flight Path":"Unknown","Case Number":"46411","Summary":"It made me stop walking. I was on my way home.","Weather Factors":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/46411.html.txt","/var/www/straped/mufon/org/46411.html"],"Date of the Event":"10/10/2010 09:00 UTC","City":"Secaucus"}