{"divs":["Sighting DetailsI was 18 years old. Sleeping with my adult girlfriend, she awoke first and woke me immediately. She was terrified and tried to get away by climbing over me toward the corner of walls. Hovered and moved about the room as if it had some sort of mission. Communicated with me telepathicly and told me it was not there to harm us. Hovered 2' from my hand and I wanted to swipe my hand through it ,as it told telepathicly not to, or I would be severely shocked. Hovered to the middle of the room and then leave through the wall. Approximately 2 -3 minutes later there was a knock at the front door and a very large Indian man form the reservation asked if we were ok and that a UFO was hovering over the house. I don't remember talking to him at length about it but my girlfriend did. I felt somewhat downloaded immediately after and felt that it now knew me somehow. I also have had 3 other experiences later with missing time and amnesia immediately after to the effect of not even knowing my name afterward. This happened to me 30 years ago. I saw a u tube video of the Wilshire crop formations where the 3 orbs hovered over the field and as they leave the crop formation appeared. That was approximately 3 years ago. My family knows my story from long ago and saw what I had described to them on the video years ago. I can tell more of my story about the other events. I am a brother, father, and husband and am not crazy about what happened long ago. I would like to talk to someone who might have more info about my experiences."],"Longitude":"-120.244447","Tags":"City","trends":["There have been no other sightings in Tuolumne","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=37.955268,+-120.244447(46413)&iwloc=A&hl=en\"> mufon case (46413) map </A>","Latitude":"37.955268","Summary":"telepathic communication hovering in my bedroom. I saw the same thing on a u tube video 3 years ago Wilshire England crop circle formation 3 orbs. More later for a 6 ;month period 3 other occasions","Country":"United States","Object Flight Path":"Path with directional change","City":"Tuolumne","Sighting Duration":"Undisclosed","Date of the Event":"05/20/1983 12:00 UTC","files":["/var/www/straped/mufon/html2text/46413.html.txt","/var/www/straped/mufon/org/46413.html"],"Object Shape":"Unknown","Case Number":"46413","Object Features":"Unknown","Weather Factors":"Unknown","Disposition":"Unresolved","Log Number":"US-03262013-0001","Date Submitted":"03/26/2013 12:03 UTC","Region":"California","Source":"MUFON","Viewing Distance":"20 Feet or Less"}