{"Log Number":"US-03262013-0004","Latitude":"29.787005","Region":"Texas","Summary":"Large golden orb seen on 4 nights a few weeks apart. The first two seemed to disentegrate, the recent one hovered thdn disappeared","Case Number":"46416","files":["/var/www/straped/mufon/html2text/46416.html.txt","/var/www/straped/mufon/org/46416.html"],"Object Features":"Unknown","trends":["There have been 21 other sightings in Katy","There were no other sightings in Katy on or around March 24th 2013"],"Tags":"City","Source":"MUFON","Object Shape":"Boomerang, Fireball","map":"<A HREF = \"http://maps.google.com/maps?q=29.787005,+-95.817656(46416)&iwloc=A&hl=en\"> mufon case (46416) map </A>","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Date of the Event":"03/24/2013 12:00 UTC","Object Flight Path":"Hovering then path","Viewing Distance":"Unknown","City":"Katy","divs":["Sighting DetailsI started seeing this object in Feb 2013. The first time I saw it I was sitting outside and noticed a fireball NW of Houston, which seemed to disintegrate. I thought it was a star or meteor. Two nights later I saw the same thing. On March 24th I went outside and I noticed the same fireball type of object west. I noticed the object because it was exactly like the fireball I saw disintegrate. I often watch and photograph the night sky, and knew it was not a planet or plane as we live in flight path and the planes are obvious.It seemed to be hovering with some slight movement the the south.I went inside to get my camera and when I came back out it was further NW. I took several pictures with a 250mm lense. Went back into to download the photos. Then went out 10 minutes later and it was completely gone. I was expecting to see this orb as I have been seeing others recently. I am enclosing some photos along with a photo I took of the moon tonight. I'm fairly good at still photography at night..it appears the object was moving."],"Longitude":"-95.817656","Disposition":"Unresolved","Date Submitted":"03/26/2013 01:32 UTC","Country":"United States"}