{"City":"Los Angeles","Sighting Duration":"Undisclosed","Country":"United States","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsApproximately a year and half ago 30 of us had witnessed a strange event that took place above are church on a Saturday. I would have to look into it the figure out a direct date. The event took place in San Fernando Valley California on Calvin Street next To Tampa Blvd. and Sherman Way. I know the time was approximately 230 to 3 o'clock because it was before church service. The objects appeared approximately at cloud height somewhat difficult to be sure from the lack of cloud cover. The objects were round with what appeared to be a small round sphere in the center. First I noticed one object then appeared several more, returning back to one object with no more than seven appearing at one time. I found your website while watching TV show on alien mysteries. I have to ask why the number seven? The objects were very difficult to see as if they were to blend in to the blue sky above. It took a great deal of focusing to be able to see the objects and of course the 30 of us talked about what they could possibly be the whole time."],"Object Features":"Other","Case Number":"46418","Tags":"City","Date Submitted":"03/26/2013 01:42 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.201033,+-118.553518(46418)&iwloc=A&hl=en\"> mufon case (46418) map </A>","Object Flight Path":"Stationary,N/A","Longitude":"-118.553518","Summary":"30 people saw one turn into 2 then 3 with a total of 7 object apearing then turning back to 1 object hovering at cloud level.","Region":"California","files":["/var/www/straped/mufon/html2text/46418.html.txt","/var/www/straped/mufon/org/46418.html"],"trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around April 1st 2011"],"Latitude":"34.201033","Source":"MUFON","Object Shape":"Sphere","Disposition":"Unresolved","Log Number":"US-03262013-0006","Date of the Event":"04/01/2011 12:00 UTC","Weather Factors":"Unknown"}