{"Object Shape":"Cigar","Viewing Distance":"Over One Mile","Latitude":"39.594815","Object Features":"Other","files":["/var/www/straped/mufon/html2text/46412.html.txt","/var/www/straped/mufon/org/46412.html"],"Longitude":"-78.415855","Disposition":"Unresolved","Country":"United States","divs":["Sighting Details1.)Riding my motorcycle in the Green Ridge State Forest. 2.)I stopped at a popular overlook to rest and enjoy the sight.(Point Lookout). A hawk screeched from above, which made me look up, and that is when I noticed the object. 3.) I knew immediately that I was witnessing something special and extraordinary. Nothing like I had ever seen. 4.)A cigar shaped object. Very shiny and metallic. Revolving slowly (I think) moving straight line to the NW. Very high in the sky (I think), and possibly very large. 5.)Only visible for about 5 seconds. I got real excited. Wished that I had seen it earlier on the horizon. Felt privileged to see it. 6.)Went beyond the tree line, out of sight. I know that this is a late report with approximate dates. When I got home I saw on the news that several people had witnessed UFO activity in the Hagerstown (MD) area shortly before my sighting. If you want the exact date, I could probably get it for you by contacting WHAG news. It was a beautiful autumn day without a cloud in the sky. You can see a lot of sky from Point Lookout. The object was coming out of WV over the Potomac river into MD W of Little Orleans in a NW direction. I am just glad that a hawk called above me or I never would have seen the craft. Probably never see anything like that again, but I will keep my head to sky!"],"Date Submitted":"03/25/2013 11:44 UTC","Date of the Event":"10/15/2012 12:00 UTC","Weather Factors":"Unknown","trends":["There have been no other sightings in Little Orleans","This sighting has never been favorited."],"Summary":"Cigar shaped, shiny metallic (like an airstream) revolving, large (I think), and high in the sky.","Region":"Maryland","City":"Little Orleans","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Tags":"City","Log Number":"US-03252013-0017","map":"<A HREF = \"http://maps.google.com/maps?q=39.594815,+-78.415855(46412)&iwloc=A&hl=en\"> mufon case (46412) map </A>","Source":"MUFON","Case Number":"46412"}