{"divs":["sighting details i was in the back yard with my dog and i looked up and saw this white orb for a few seconds and then it disapeared. a few weeks later i was out back and i looked up again and there where two orbs traveling together to the south and when they got about 2 or 3 miles to the south they stopped and the one on the left went to the east for about a 1\\4 of a mile and the other one waited until it came back and then they continued traveling south south west and dissapeard. the next time i saw them was about a month later. i was sitting at the computer and i heard a jet coming by really loud so i knew it was real low and i didn't think to much about it. so about 5 or 10 minutes later i heard the jet coming back so i got up and walked outside to see what was going on. by that time the jet was about a mile to the south and to the right of the jet was a single orb they continued on to the south. that is my story and i have seen them since. i still look up every time i go outside at night hopping they will return,but no luck yet.thank you"],"Log Number":"US-03262013-0002","City":"Omro","Case Number":"46414","Summary":"i saw a orb","Source":"MUFON","files":["/var/www/straped/mufon/html2text/46414.html.txt","/var/www/straped/mufon/org/46414.html"],"Longitude":"-88.752841","Latitude":"43.999544","trends":["There has been one other sighting in Omro","There were no other sightings in Omro on or around April 10th 2012"],"Object Shape":"Circle","Object Features":"None","Sighting Duration":"Undisclosed","Tags":"City","Date Submitted":"03/26/2013 12:53 UTC","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=43.999544,+-88.752841(46414)&iwloc=A&hl=en\"> mufon case (46414) map </A>","Weather Factors":"Unknown","Country":"United States","Date of the Event":"04/10/2012 09:00 UTC","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Region":"Wisconsin"}