{"City":"Courtenay","Tags":"City","Longitude":"-124.982692","Log Number":"CA-03262013-0011","Summary":"UFO hovering over house, observed during Aurora Borealis","Country":"Canada","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Viewing Distance":"21-100 Feet","Case Number":"46423","Date of the Event":"06/15/1998 12:00 UTC","Object Features":"Unknown","Disposition":"Unresolved","Object Shape":"Boomerang","map":"<A HREF = \"http://maps.google.com/maps?q=49.710488,+-124.982692(46423)&iwloc=A&hl=en\"> mufon case (46423) map </A>","Object Flight Path":"Stationary","Source":"MUFON","Latitude":"49.710488","trends":["There has been one other sighting in Courtenay","There were no other sightings in Courtenay on or around June 15th 1998"],"Date Submitted":"03/26/2013 01:23 UTC","Region":"British Columbia","divs":["Sighting DetailsThis happened when I was young, and it was during the summer time in 1998, June time perhaps? I'm unsure of the month so June is the estimate, and the Day has passed my mind, considering being young I tended not to pay attention to that. Around this time, I was living in Courtenay, BC, Canada. The night of this sighting there were Aurora Borealis present. We (my family) were watching the Aurora in some lawn chairs out in our backyard at around 9pm. I think we watched the Aurora for a good 30 minutes until we saw something appear directly above our house. My father actually pointed it out first saying \"Look guys, a UFO\", and that's when we all saw it. It looked like a line of 3-4 lights in crescent shape, the lights flashed in a pattern where the light moved to the right and the lights behind turned off. It just flashed this way constantly. The lights were white with yellow undertones and very bright. I couldn't see a structure behind the lights, but I assume it was black or some dark colour because some stars were obstructed behind it as it hovered still in place and silently. Upon seeing the craft we all had this sense of excitement, and watched it for 5 minutes (estimated). When we realized that it wasn't moving from above our house, we all got this sense of unease and dashed right inside. I don't remember much after that, and that was the last I saw of it."],"files":["/var/www/straped/mufon/html2text/46423.html.txt","/var/www/straped/mufon/org/46423.html"]}