{"Case Number":"46432","Sighting Duration":"Undisclosed","Object Shape":"Circle","Region":"Georgia","files":["/var/www/straped/mufon/html2text/46432.html.txt","/var/www/straped/mufon/org/46432.html"],"Disposition":"Unresolved","Viewing Distance":"101-500 Feet","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","Object Features":"Unknown","Weather Factors":"Unknown","Date Submitted":"03/26/2013 10:29 UTC","Tags":"City","Longitude":"-85.158873","Date of the Event":"06/15/1965 08:30 UTC","trends":["There have been 10 other sightings in Rome","There were no other sightings in Rome on or around June 15th 1965"],"Source":"MUFON","Country":"United States","Log Number":"US-03262013-0019","Summary":"2 UFOs observed. One sped off, the other seemed to wait for me to approach in car.","Latitude":"34.260808","map":"<A HREF = \"http://maps.google.com/maps?q=34.260808,+-85.158873(46432)&iwloc=A&hl=en\"> mufon case (46432) map </A>","divs":["sighting detailsi was 15 years old, it was a summer night about 8:30pm when my mother asked me to go to the store and pick up a wedding\\shower present. the store was to close at 9:00pm. this is a small town, so no other traffic on the road, i had all the car windows down and no radio on. i came around a slight right turn that was slightly higher elevation than the road ahead that was straightfor about 3 miles. i noticed 2 groups of lights on my left at about eye level - 2 green and 1 red. they appeared to be crossing the road slowly at a shallow oblique angle. i set my speed to be below the point where i guestimated they would cross the road. then 1 set of lights sped up and disappeared quickly to my right while the other set seemed to hover. as i approached, the lights \"floated\" across the road above me at barely above the telephone poles. i pulled off the road and leaned out of the car to get a better look aboe me. it was a large, circular shape dark against the night sky with the lighs clustered in the middle. it floated with no sound like a leaf back in the direction i had come from, then it reversed back to it's original path and disappeared quickly over the mountains with no sound and no apparent acceleration. even at that age i had an interest in unusual things and was a star gazer from an early age. at this point in history, there were a lot of ufo reports in the north georgia area. i feel even at that age i was an objective observer."],"City":"Rome"}