{"Log Number":"US-04042006-0020","trends":["There have been 122 other sightings in Pittsburgh","There were no other sightings in Pittsburgh on or around April 3rd 2006","This sighting has never been favorited.",""],"Object Features":"Undisclosed","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/4643.html.txt","/var/www/straped/mufon/more/4643_submitter_file1__UFO.jpg","/var/www/straped/mufon/org/4643.html"],"Country":"United States","Longitude":"-79.990226","Date Submitted":"04/03/2006 02:50 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.446935,+-79.990226(4643)&iwloc=A&hl=en\"> mufon case (4643) map </A>","divs":["Sighting DetailsThis event was witnessed by my friend and I as we were walking home from school yesterday at appromately 14:50 as we turned down a hill towards our street which is west at the bottom of the hill, We were facing North North West comming down the hill. I am avid aviation enthusiast so I am familiar with the silhouettes of commerical, military, and civilan, aircraft these object resembled none of the known aircraft. I observed the objects which were equally spaced in a tandem bank to what would be their port sides. The craft then disappeared into the sky which was very overcast at the time but their \"glow\" could still be faintly seen, when they reappeared about two to 3 seconds later there was only four and they were in pairs one pair was noticeably higher in altitude and to the left (our perspective) of the other pair. The craft then separated into the clouds individually for about two-three seconds again, When they emerged from the clouds again the fifth had rejoined the formation and they were in a tandem bank to their starboard sides again equally spaced between each other, the continued the bank until their formation was heading west (the formation for both banks was a column) the craft then went into a vertical climb at a very steep angle and at a high rate of speed and disappeared into the clouds again. They reappeared 4 seconds later in a delta formation and were banking to their port sides again, they broke formation and stacked themselves vertically in the center of the sky and hovered for about 25-30 seconds just pulsating, the upper four craft then \"slid\" down at the same time until the five were level with the horizon and then started another vertical but more gradual climb and proceed to do a \"continuous\" loop this lasted for 4 seconds they they broke off and I lost them in the clouds. When I reached the bottom of the hill I saw them for the last time before I turned west and caught a glimpse at the craft they were a \"Sting-ray\" shape but were completely smooth, they also looked to be surrounded by a \"haze\" I last observed them heading Northwest three were in the rear and abreast of each other with two leading abreast of each other, the outer most one of the \"three\" broke formation and slid up under and to the right of the leading two while the two in the rear climbed slightly above the leading three. throught this sighting the craft always maintained vertical and horizontal separation the distance between the craft was consistently equal there was also no sound that was accompaning any of this I lost sight of them in the clouds. My reaction to this was I could not believe what I was seeing and was bothered that for the life of me I could not identify what I was witnessing. when I first saw these objects I thought it might have been birds but after observing the first \"maneuver\" I ruled that out. I was actually mesmorized when I saw it I was excited and scared at the same time. A Cessna 172 flew over about 3 minutes later and my friend who has no interest in aviation looked up and said \"Now thats an airplane.\" I also filed a report with the National UFO Reporting Center. I just figured the more people who knew the better chance I might have of getting what I saw confirmed."],"City":"Pittsburgh","Viewing Distance":"Unknown","Summary":"5 Extreamely Bright Metallic Objects Observed in North Northwest Area Of Sky (Sting-Ray Shaped)","Disposition":"Insufficient Data","Sighting Duration":"00:06:30","Object Shape":"Boomerang","Source":"MUFON","Case Number":"4643","Latitude":"40.446935","Region":"Pennsylvania","Object Flight Path":"Undisclosed","Tags":"City","Date of the Event":"04/03/2006 02:50 UTC"}