{"Latitude":"46.675486","map":"<A HREF = \"http://maps.google.com/maps?q=46.675486,+-120.463253(46436)&iwloc=A&hl=en\"> mufon case (46436) map </A>","Object Flight Path":"Hovering then path,Path then hovering","Source":"MUFON","Tags":"City","Longitude":"-120.463253","Summary":"Friend woke me. Watched it with binoculars for several minutes next to star. Extreme acceleration to second object and stopped on dime next to it","trends":["There have been 15 other sightings in Yakima","There were no other sightings in Yakima on or around June 15th 1980"],"files":["/var/www/straped/mufon/html2text/46436.html.txt","/var/www/straped/mufon/org/46436.html"],"Case Number":"46436","Object Shape":"Unknown","Viewing Distance":"501 Feet - 1 Mile, Unknown","Date of the Event":"06/15/1980 03:00 UTC","Weather Factors":"Unknown","Country":"United States","Disposition":"Unresolved","Date Submitted":"03/26/2013 11:52 UTC","Region":"Washington","Log Number":"US-03262013-0023","Object Features":"Unknown","divs":["Sighting DetailsI was in army mechanized infantry. My friend melman woke up everyone and said he saw a UFO. I was only only in the M113 armored personnel carrier to get up and look. He said it zigzagged across the sky and pointed to it. I took my binoculars and looked at it. It was next to a star and was therefore easy to tell it was perfectly still. It blinked two lights just like what you would expect an airplain to do. Melman was quite excited and insisted that it zigzagged impossibly across the sky. I was trying to figure out what it could be when it shot across about 60 degrees of sky in less than a half second and seemed to instantly stop next to another one. I am an engineer and know that the acceleration this thing displayed was not even close to possible unless it used technology far beyond anything commonly known. Now I understood why melman was so excited. After another few minutes, one tuned white and seemed to shoot off toward space and disappeared in a few seconds. We got a call to move and so that was it. We didn't tell anybody it or even talk about it which seems a bit strange to me in hindsight. I don't think it was something from our military. It was way too fast. It was over a military base. I am quite sure it was a real object even though I didn't see anything but lights. I don't know why it would have blinking lights like an airplane or why it zigzagged assuming melman was accurate and I don't think he lied. To me, my attitude was, wow they really do exist. I will tell people about it from time to time but I see a lot of skepticism which is kind of annoying but understandable I suppose."],"Sighting Duration":"Undisclosed","City":"Yakima"}