{"Sighting Duration":"00:00:10","Case Number":"46445","Longitude":"-83.356029","Region":"Michigan","Source":"MUFON","divs":["Sighting DetailsIt was a warm July night in 1966. I was ten years old and my parents were in the kitchen playing cards with Canadian relatives. I was bored and went out front to sit on our porch. I noticed three neighbors two houses to the South of my location standing on their front lawn looking and pointing to the sky. I followed their line of pointing and sight and saw a glowing flourescent blue football shaped object coming from the East and heading directly towards me. The entire object was glowing! The object appeared low over the houses to my East and flew right over my head continuing in a Westerly direction. There were no clouds and I am sure it was not a searchlight. I saw it coming from a distance of about a mile. The entire sighting lasted approx. ten seconds. The neighbors had had time to set up a telescope in their front yard so it must have been there prior to me sighting it. The object never returned. I was a bit of a nerd in those days and knew my airplanes so I was very sure that I had just witnessed something different. Not a speeding blimp or an aircraft. Very close and very real. I'll never forget it!"],"Object Features":"Unknown","trends":["There have been 6 other sightings in Garden City","There were no other sightings in Garden City on or around July 30th 1966"],"Log Number":"US-03272013-0008","Tags":"City","Date Submitted":"03/27/2013 02:05 UTC","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/46445.html.txt","/var/www/straped/mufon/org/46445.html"],"Latitude":"42.336479","Country":"United States","Weather Factors":"Unknown","Date of the Event":"07/30/1966 12:00 UTC","Summary":"A light blue glowing football shaped object approached from the East and flew low over my head going West.","Disposition":"Unresolved","Object Shape":"Egg, Oval, Other","map":"<A HREF = \"http://maps.google.com/maps?q=42.336479,+-83.356029(46445)&iwloc=A&hl=en\"> mufon case (46445) map </A>","Viewing Distance":"501 Feet - 1 Mile","City":"Garden City"}