{"divs":["Sighting Detailsfew sites if i had good camera would get photo,s. triangle delta ,buzz,( like the sound you get from a fridge with the coolent bottle ) makes me believe there is some sort of freezing taking place. this was reported also back in 87 but the story told is bull nothing like the real ( sheffield incident) wich is on youtube, and another guy how does lectures. i was with the police out searching for crash retreval and it was not no where near what is reported. also light that before disapiars splits into three then vanish. next. no light seen but suddenly a flash in 4 to 6 different places you can tell there would be about 2to3 hundred yards between each flash in a line what is so fast i think it happens then you mind caches up split second.[ i would like to say i research on my own but keep my location secret but if anyone is interested please contact must have camera as i really want to be the first to film real objects not the rubbish on youtube . wether it is millatery or otherwise .these objects defo do not have engines . with a bit of time and right location you would see one up close . like i state the buzzing noise like power line i believe is some thin freezing . so that proves that it works on a bigger scale.any way please contact as i will this year be taking photo,s 100%. thanks youres jason"],"Source":"MUFON","Object Features":"Patterned Surface, Unknown","Latitude":"53.389859","Region":"England","Country":"United Kingdom","Tags":"City","Log Number":"GB-03272013-0004","Date of the Event":"08/07/1987 07:04 UTC","Date Submitted":"03/27/2013 09:00 UTC","Case Number":"46441","Sighting Duration":"10:01:02","trends":["There have been 11 other sightings in Sheffield","There were no other sightings in Sheffield on or around August 7th 1987"],"files":["/var/www/straped/mufon/html2text/46441.html.txt","/var/www/straped/mufon/org/46441.html"],"Disposition":"Unresolved","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=53.389859,+-1.461465(46441)&iwloc=A&hl=en\"> mufon case (46441) map </A>","Summary":"stealth like know where to be to not be seen","Longitude":"-1.461465","Viewing Distance":"21-100 Feet","City":"Sheffield","Object Flight Path":"Path then hovering","Object Shape":"Triangle"}