{"map":"<A HREF = \"http://maps.google.com/maps?q=43.234745,+-85.790601(46442)&iwloc=A&hl=en\"> mufon case (46442) map </A>","trends":["There have been no other sightings in Casnovia","This sighting has never been favorited."],"Longitude":"-85.790601","Summary":"Looked out my window and noticed an object that was moving with multi-colored blinking lights.","City":"Casnovia","Object Features":"Unknown","Weather Factors":"Unknown","Case Number":"46442","Date Submitted":"03/27/2013 09:45 UTC","Tags":"City","Sighting Duration":"Undisclosed","Region":"Michigan","Object Flight Path":"Stationary","Latitude":"43.234745","files":["/var/www/straped/mufon/html2text/46442.html.txt","/var/www/straped/mufon/org/46442.html"],"Viewing Distance":"Over One Mile","Disposition":"Unresolved","Source":"MUFON","Date of the Event":"03/27/2013 02:45 UTC","Log Number":"US-03272013-0005","Object Shape":"Star-like","divs":["Sighting DetailsMy daughter woke up and I took her downstairs around 2:40 a.m. She asked for a cup of water, so I went into the kitchen to get her one. After turning off the light, I noticed a very bright, blinking light off to the West. Initially I thought it was a planet, but then I realized it was moving back and forth and up and down. I took the cup of water to my daughter, and went back to the window to watch it move, realizing it had multi-colored lights that seemed to be red, blue, yellow, green and white blinking. It seemed to wobble slightly and then would move ever so slightly up and down and back and forth, with some movements that were much quicker than others. Thinking maybe it was a plane or helicopter, I then noticed an airplane flying at the same degree above the horizon and realized there was no way this was an airplane. I went upstairs and woke up my husband and told him to look at it. Ever the skeptic (and half-asleep), he swore he didn't see it moving, and told me to go back to sleep. I went to lie down for about 5 minutes and had to get back up to see it again to make sure I hadn't been seeing things. It was gone. There were no clouds, and no other stars or planets observable nearby."],"Country":"United States"}