{"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/46444.html.txt","/var/www/straped/mufon/org/46444.html"],"Latitude":"42.106447","Object Flight Path":"Straight-line path","trends":["There have been 14 other sightings in Binghamton","There were no other sightings in Binghamton on or around March 10th 2013"],"Country":"United States","Tags":"City","Object Shape":"Unknown","Region":"New York","Log Number":"US-03272013-0007","Source":"MUFON","Longitude":"-75.909934","Viewing Distance":"501 Feet - 1 Mile","City":"Binghamton","divs":["sighting detailsmarch 10th, a fairly warm eveining at approx. 8pm my daughter, myself and a neighbor across the street observed 7 amber colored orbs flying from south to north more or less following the chenango river. my daughter was out walking the neighbors dog. there was absolutely no noise associated with the orbs. we did hear an airplane flying behind us which was later verified to be delta flight #1578 flying out of the broome co. airport. our first thought was that they could be drones. we live in a complex of townhouses and condos situated across the street form one another which only allowed us to view 2 orbs in the sky at a time. they were flying equidistant from one another and there were a total of 7 orbs in all. i went into the house to grab my binoculars but by the time i got back outside the 7th orb was flying over and i never got to view them close-up. before i came back outside my daughter witnessed one of the last orbs stopping and moving from side to side before continuing to fly north. my daughter reported the incident to the local sherrif's dept.. a deputy took our report and verified the delta flight. he also called her a day later to let her know that a fellow employees brother had also seen the same lights two nights before we did, from the highway just south of our complex. the deputy also added that the lockheed martin plant in owego, new york conducts \"skunk\\snoopy\" operations from it's facility....but owego is southwest of here. that isn't the direction the orbs came from. he filed a police report and advised my daughter that chenango county would be advised of the incident also."],"Case Number":"46444","Date of the Event":"03/10/2013 12:00 UTC","Object Features":"None","Summary":"Single lights at equal distances from one another all flying Northerly direction, no noise, only one light each, total of 7 lights, not close together but equadistant from each other.","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.106447,+-75.909934(46444)&iwloc=A&hl=en\"> mufon case (46444) map </A>","Date Submitted":"03/27/2013 12:26 UTC","Weather Factors":"Unknown"}