{"Summary":"Saw fast low flying UFO on the way home at 377 and chapman, followed past nearby trailer park","Sighting Duration":"00:06:00","Latitude":"32.866678","Object Flight Path":"Straight-line path,Other","Weather Factors":"Unknown","Case Number":"46450","Date of the Event":"03/26/2013 03:40 UTC","Tags":"City","Longitude":"-97.248315","Source":"MUFON","Country":"United States","Disposition":"Unresolved","Object Features":"Unknown","Log Number":"US-03272013-0013","City":"Watauga","Viewing Distance":"Unknown","Object Shape":"Other, Unknown","divs":["Sighting DetailsAt around 3:30-3:45 AM I was headed home to the trailer park in Haltom City, stopped at a stop sign on Greenfield dr facing west towards 377. Ahead over the railroad tracks and treeline I saw a low flying craft with blinking lights which seemed to be nothing too strange almost like a helicopter. However it was flying very low, and very fast so I kept my eye on it as I continued to drive southbound on 377, looking at it to the west out of my passenger side window. The blinking lights seemed mainly to be red and blue. Eventually as I turned into the trailer park which was further west, I was a bit closer to the object than before, as I continued to watch it, traveling in the same general southbound direction as me, the lights pulsated in a circular pattern as the craft seemed to be flying at a diagonal or leaning angle. It was about a 45 degree angle, with the lower end of the craft on my left, or the southern edge of it. I couldn't make out any distinct shapes of the craft. But I became sure it was a UFO as I followed watching it increasing in speed. The lights began to change to purple and pulsated, no longer blinking in a circular pattern. Soon after a passed a treeline to a wide open view of the sky, it had disappeared. Nowhere to be seen."],"files":["/var/www/straped/mufon/html2text/46450.html.txt","/var/www/straped/mufon/org/46450.html"],"Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=32.866678,+-97.248315(46450)&iwloc=A&hl=en\"> mufon case (46450) map </A>","Date Submitted":"03/27/2013 11:11 UTC","trends":["There have been 4 other sightings in Watauga","There were no other sightings in Watauga on or around March 26th 2013"]}