{"Case Number":"46452","Latitude":"45.782657","City":"Mackinaw City","Tags":"City","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/46452.html.txt","/var/www/straped/mufon/org/46452.html"],"Summary":"Chevron-shaped, bright lights spaced evenly along outer edge of chevron, silent","Disposition":"Unresolved","Log Number":"US-03282013-0002","Object Shape":"Chevron","Date Submitted":"03/28/2013 12:24 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=45.782657,+-84.728837(46452)&iwloc=A&hl=en\"> mufon case (46452) map </A>","Region":"Michigan","Country":"United States","divs":["Sighting DetailsMy girlfriend and I, we were about to fall asleep in Huron Apartments in Mackinaw City some two weeks after the fourth of July. I made a call to the MUFON network the day after this event and was told this was probably some type of government flight path out of canada, which, looking back on the events of that night, I find impossible to believe. My girlfriend had a sudden desire to get up and smoke a cigarette. We had not been drinking and were not intoxicated, though I do drink and have used drugs. I am not religious or superstitious, nor prone to over exaggeration. We walked out to her porch, and I thought at the time, and she thought afterwards, that it was odd for her to want to just get up and smoke. It was no earlier than eleven thirty, and no later than one in the am. Within minutes of stepping out onto the porch, we both noticed a sort of wavering in the sky in the direction of the Mackinaw Bridge. The bridge towers and their position in town is very familiar to me, and it was above the towers that we saw the stars sort of waver, and then out of nowhere a pattern of very bright and obviously artificial lights began to drift to the southeast. The lights were a bluish-white, and did not twinkle or shift in luminosity. I would say there were approximately twelve lights, in equal distance from each other on the outer side of a chevron-shaped object. It sort of glided, stopped as it came above the apartment complex, and abruptly shifted towards the southeast. As it moved above us, we both felt mild stomach irritation, which I cannot say for sure was caused by the sighting, but which occurred nonetheless. (The next day my girlfriend was brought to St. Ignace hospital and treated for an unknown stomach condition). Also, I noted that the object was a pitch black, and that it reflected no light. An airplane, when it is near to the ground at night--I have seen them near Pellston Airport landing--will reveal the undercarriage somewhat near the lights. The lights on this object did not illuminate the material at all. It looked entirely solid, and definitely blotted out the stars as it passed over. The entire sighting lasted less than five minutes, and just before it headed to the southeast above the apartment complex, the chevron itself sort of rotated so that the tip of the V shape pointed in the direction it was heading. It seemed to accelerate and then literally wavered out of sight. I have no idea what this object was. I have lived in Northern Michigan my entire life. I have seen as many UFOs as anyone else living around here has, all of which can be written off to something else. I am a well-reasoned person, and this is the only time in my life I have ever seen something like this. I have always laughed at people ranting about UFOs, though I've always been interested in some of the stories. But this shook me. I have never seen anything like it. As I said, we both experienced mild nausea when looking at the object, which dissipated as soon as it vanished, but I cannot in good conscience say it was due to the object itself. Please if you have any other confirmed sightings from around this timeframe, any time in July, from this area, could you refer the witness to my email address. I would hate to die some day without having any clue about what this thing was."],"Object Flight Path":"Path with directional change,Other","Date of the Event":"07/17/2012 01:00 UTC","trends":["There have been 6 other sightings in Mackinaw City","There were no other sightings in Mackinaw City on or around July 17th 2012"],"Longitude":"-84.728837","Sighting Duration":"00:05:00","Object Features":"None","Weather Factors":"Unknown"}