{"Object Features":"Unknown","trends":["There have been 12 other sightings in Elkhart","There was one other sighting in Elkhart on or around March 27th 2013"],"Region":"Indiana","Case Number":"46457","files":["/var/www/straped/mufon/html2text/46457.html.txt","/var/www/straped/mufon/org/46457.html"],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Latitude":"41.665109","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.665109,+-85.967801(46457)&iwloc=A&hl=en\"> mufon case (46457) map </A>","Source":"MUFON","Summary":"heard a beeping sound never heard before. pulsating in precise increments traveling away slowly","City":"Elkhart","divs":["Sighting Detailsi was walking out of my house around 10:30 last night, march 27th 2013. I have lived at this address for about 5 years but have lived in Elkhart around 9 years. I have never before heard this sound but it was beeping and traveling across the town slowly. it was a quiet night, no traffic, it was cold, no wind. I heard it so clear. the beeping sounded like sonar equipment scanning the landscape. there were two beeps, that came right after one another and then paused about a second in between each set of beeps. this reoccurred for about 5 minutes. the beeping echoed all across the town. it travelled in a NE direction. after I heard it get about a mile or two away I heard the beeping speed up, it was now beeping on perfect half increments. same sound and same pitch though. this only lasted for about a minute or two and then the sound went away completely. it was definitely an object in motion. later on sirens went off around midnight, which is quite unusual. the tornado sirens are tested every SATURDAY at noon. this happened late at night on a WEDNESDAY. we are use to the tornado sirens in Elkhart, and everyone knows their sound. but this is not the sound I heard. this was something totally different. i was not the only one who heard it. i was with 2 friends of mine and they were waiting in the car for me to come out of my house. they heard it too. a friend of mine lives in Mishawaka a few towns over and said she heard the same thing. I did not see this object. but its presence was real. I was not threatened by this entity. I felt no danger. my friends were a little freaked out though. I would very much like to know what this beeping sound was."],"Object Flight Path":"Straight-line path,Unknown","Date Submitted":"03/28/2013 12:24 UTC","Viewing Distance":"501 Feet - 1 Mile, Unknown","Disposition":"Unresolved","Tags":"City","Date of the Event":"03/27/2013 10:30 UTC","Log Number":"US-03282013-0007","Longitude":"-85.967801","Object Shape":"Unknown"}