{"Object Shape":"Cylinder","Summary":"Saw light coming threw the trees over a ridge then relized it was a ufo! It then came over the lake and hovered and had a beam of light coming out of it shining on the lake! Then raised up and moved off to the north!!","Tags":"City","Date of the Event":"05/19/1982 06:30 UTC","Longitude":"-108.546939","Country":"United States","City":"Grand Junction","Object Features":"Dome, Insignia, Other","Viewing Distance":"21-100 Feet","Log Number":"US-03282013-0011","trends":["There have been 24 other sightings in Grand Junction","There were no other sightings in Grand Junction on or around May 19th 1982"],"Object Flight Path":"Path then hovering","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMe and a friend were fishing at a lake called Big Creek(which is about 30 miles south west of grand jct in the uncompaghre national forrest) about 6pm when we noticed a light coming over a ridge on the southwest side of the lake and we thought it was a vechicle but knew there was no road there! Then the craft came over the trees and over the lake and hovered for around 5 minutes and had a beam of light shining down on the lake! The whole event lasted about 20 minutes) We could see that it had doors(the rear door had what looked like a porch light on it! It also had a light on the front of it!! It also had a handrail and wrighting that looked like egyptian writing! It was about 60 feet away when it was over the lake! It made no sound! It was about as big as a school bus and had about the shape of a school bus! It scared us very bad and we thought we needed to put our camp fire out but do not remember putting it out! It then slowly raised above the tree line and moved off to the northeast! We told no one about this! The reason I am writing is because i had drawn a picture of it a few years later which I kept and my brother happened to see it years later and asked me what it was and then I told him the story and then he found your web site and is having me write this!! Also about a week before there was a sighting of a object(fireball) crashing(which alot of people saw)near a town called silt colorado which is just east of grand jct! So after we saw this object we thought it was a ufo looking for the one that crashed! There was an artical in the daily sentinal news paper in grand jct about the object people saw and it said people tried to find it but never did!! About a week later we went back up and went into the trees where it first came from and found a piece of what Ive always said was from the object that crashed the week before, and I still have it!!"],"Latitude":"39.06978","map":"<A HREF = \"http://maps.google.com/maps?q=39.06978,+-108.546939(46462)&iwloc=A&hl=en\"> mufon case (46462) map </A>","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/46462.html.txt","/var/www/straped/mufon/org/46462.html"],"Date Submitted":"03/28/2013 05:52 UTC","Case Number":"46462","Region":"Colorado","Disposition":"Unresolved","Source":"MUFON"}