{"Summary":"20-30 UFO's sighted in early evening sky below storm clouds (Chicago)","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Disposition":"Unresolved","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around March 26th 2013"],"Latitude":"41.885684","Object Shape":"Circle","Object Features":"None","Date of the Event":"03/26/2013 12:00 UTC","Weather Factors":"Unknown","Longitude":"-87.625098","Case Number":"46463","files":["/var/www/straped/mufon/html2text/46463.html.txt","/var/www/straped/mufon/org/46463.html"],"Log Number":"US-03282013-0012","Date Submitted":"03/28/2013 05:54 UTC","divs":["sighting detailswhen driving home from franklin park il. eastward on grand ave. to chicago, i witnessed between 2-3 dozen ufo's traveling high in the sky but below cloud cover. they were in formations of three and moving from the south end of the city to the north end of the city. they were far off in the distance, barely noticable... to far away to capture on my cell phone camera. at first, i thought they were birds or bats playing around and chasing each other in the sky, because of the way they were eratically moving around, but birds do not reflect or emmit light. i did not see the shape of the crafts, however; all i could see was tiny balls of light in the distance (which looked as though they were flying over lake mich., maybe 10 miles out in the distance from where i was at) and they blinked on and off. it wasn't until i saw a formation of three in a perfect traigular formation (the first few formations of three i noticed deviated from a perfect triagle), and then other traigular formations of three which followed after one another, that i began to realize that what i was witnessing was not birds or bats, planes, helicopters, kites, rc crafts, drones, or anything else i've ever seen before. the way how the crafts were blinking did not replicate the manor in which any comercial aircraft emmits its light beacon. i live in between two airports (midway\\ohare) and i am completely aware of the flight paterns of incomming and out going aircraft. additionally, i can most certainly decipher the difference between what an airliner or helicopter looks like and what they don't look like... the way how these crafts were moving did not fit into the scope of how traditional air craft fly and manuver. i've never seen a ufo before,nor ghosts, or anything paranormal for that matter. i have absolutely no rational explanation for what i witnessed. i'm definitely not a genius, but i am in a very technology based carrer and i am a college graduate.... thanks for listening!"],"Source":"MUFON","Country":"United States","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=41.885684,+-87.625098(46463)&iwloc=A&hl=en\"> mufon case (46463) map </A>","City":"Chicago","Tags":"City","Region":"Illinois"}