{"Object Shape":"Triangle","Date of the Event":"03/23/2013 12:00 UTC","Region":"Ontario","Log Number":"CA-03282013-0010","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=43.907075,+-78.937613(46461)&iwloc=A&hl=en\"> mufon case (46461) map </A>","Country":"Canada","Object Flight Path":"Stationary","Longitude":"-78.937613","Source":"MUFON","Date Submitted":"03/28/2013 04:57 UTC","files":["/var/www/straped/mufon/html2text/46461.html.txt","/var/www/straped/mufon/org/46461.html"],"Tags":"City","Sighting Duration":"Undisclosed","Latitude":"43.907075","City":"Whitby","Case Number":"46461","divs":["Sighting DetailsWas awakened by a very strange noise and the bedroom seemed to vibrate. Went to the window in our bedroom on the second floor and noted this huge darkish grey massive object over our homes. It was so strange I wondered what it was. The sky was blacked out but the edges were not. It occupied the space of almost the block of our homes. It was between one am and one thirty in the morning. There was this strange feeling. You just knew it was there. It hovered so low it scared me and then was gone in seconds. Something so large and yet so fast. The sound was not a rumble but like vibration with a extremely high pitched sound but not a wining noise. I knew it was a UFO immediately. I wasn't afraid at all in fact I attempted to see markings on the bottom surface of the object and looked at the points and sides. It just ascended and was gone. Not even a noise . It was huge! I didn't want to tell anyone. It was just right there over us. Amazing. Not my first experience. Wondered why it was here. We live near Lake Ontario and a marshy area. I have seen things out in the lake near here as well."],"Weather Factors":"Unknown","Disposition":"Unresolved","Object Features":"Other","trends":["There have been 3 other sightings in Whitby","There were no other sightings in Whitby on or around March 23rd 2013"],"Summary":"awoke to a strange sound, and looked out the window to see this massive object hovering over our house and the large area around it."}