{"Viewing Distance":"101-500 Feet","Source":"MUFON","Country":"United States","files":["/var/www/straped/mufon/html2text/46474.html.txt","/var/www/straped/mufon/org/46474.html"],"Date of the Event":"03/27/2013 09:30 UTC","Weather Factors":"Unknown","Disposition":"Unresolved","Case Number":"46474","trends":["There have been 3 other sightings in Rolla","There were no other sightings in Rolla on or around March 27th 2013"],"Summary":"Appeared oval with large white lights all around the edge with evenly spaces between the lights. There were two lights in the middle and the right light would go on and off. A helicopter followed shortly after.my friend","divs":["Sighting Detailsmy friend and I were traveling south on why 72 around 9:30 pm when we noticed an oval shaped object on the west side of the road. I have never seen a light in that area and remarked to my friend that I had never noticed a light out there before. He remarked that he also had never noticed a light in that area either. The object was hovering above the tree tops. It had large white lights around the edge and I remember thinking that they reminded me of those old Christmas round bulbs and they were very clear. There were two lights in the center and the right light would go on and off. I had this sense that the object was hovering at an angle so you could see all of the lights. We were in a hurry to complete a mission and continued our drive but regret not stopping and observing. My friend recalls the object differently than me. He thought it had color lights and that it moved and shimmered somewhat. He is color blind so I do not know if this would account for the difference in what we each observed. I thought I was seeing a UFO and after reflecting on the event believe that it was a UFO. Ft Leonard Wood is nearby and I am sure that the helicopter came from there."],"Object Shape":"Oval","Object Flight Path":"Hovering then path","City":"Rolla","Object Features":"Unknown","Date Submitted":"03/29/2013 12:45 UTC","Region":"Missouri","Longitude":"-91.704714","map":"<A HREF = \"http://maps.google.com/maps?q=37.871112,+-91.704714(46474)&iwloc=A&hl=en\"> mufon case (46474) map </A>","Sighting Duration":"Undisclosed","Latitude":"37.871112","Log Number":"US-03292013-0003","Tags":"City"}