{"Weather Factors":"Unknown","Country":"United States","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=46.002164,+-123.916938(46476)&iwloc=A&hl=en\"> mufon case (46476) map </A>","Case Number":"46476","Source":"MUFON","Tags":"City","Latitude":"46.002164","Summary":"bright red orb? type object moving from horizon upward","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/46476.html.txt","/var/www/straped/mufon/org/46476.html"],"Sighting Duration":"Undisclosed","Longitude":"-123.916938","Log Number":"US-03292013-0005","Region":"Oregon","trends":["There have been 5 other sightings in Seaside","There were no other sightings in Seaside on or around March 28th 2013"],"Object Shape":"Circle","Object Features":"Unknown","divs":["Sighting DetailsIn Seaside Oregon I stepped out my back door and was looking west toward the ocean when I saw a bright red orb type object moving upwards from the horizon. It was not blinking or flashing in any way and there was no other color other than red (This is the second time I have seen this type of object.. the last sighting was a couple weeks earlier and the object moved horizontally during that event). The object was very bright so drew my attention to it immediately (as did the previous event). I had my son come out and look. He brought binoculars and we both viewed it with them. I could hear no noise like aircraft or helicopter. We watched for about 3-4 minutes as it got higher in the sky, it looked as if it may be getting closer to us and we hoped for a better view to try to determine what it could be but it was lost in the cloud cover. My reaction was calm as I have seen closer objects in the past.. curious as to what it may be as this is the second time I have seen it. During this event it seemed to move slower than the first event but that could be the difference in travel direction (first one was horizontal this one vertical). Would really like to know what it is I saw."],"Object Flight Path":"Straight-line path","Date Submitted":"03/29/2013 01:55 UTC","Date of the Event":"03/28/2013 09:05 UTC","City":"Seaside"}