{"Object Flight Path":"Path then hovering","City":"Richfield","Source":"MUFON","Date of the Event":"04/04/2006 01:30 UTC","Case Number":"4647","Object Shape":"Sphere","Latitude":"44.885898","Disposition":"Insufficient Data","Object Features":"Unknown","Region":"Minnesota","map":"<A HREF = \"http://maps.google.com/maps?q=44.885898,+-93.276372(4647)&iwloc=A&hl=en\"> mufon case (4647) map </A>","Date Submitted":"04/04/2006 01:30 UTC","files":["/var/www/straped/mufon/html2text/4647.html.txt","/var/www/straped/mufon/org/4647.html"],"divs":["Sighting Details1. I was driving my car on an interstate highway going home (north, toward Minneapolis.) 2. I noticed something strange about the orange spherical object in the sky and kept looking at it. 3. Once it began moving sporatically and moving with purpose behind it, I knew right away that it was some kind of intelligence. 4. Orange, spherical, it moved from east to west in a sporatic manner, then stopped and another sphere emerged from it and they both remained stationary in the sky. 5. When I knew it was a UFO, I rolled down my window and continued to watch the object as I drove. I began screaming at it, telling it that I knew it was intelligent and that it was \"them\" and then I told it to do something really weird and once I did that, the object stopped in the westward sky, which is when another sphere emerged from it. I was excited the entire time. 6. Very easily. This happened with a lot of light pollution around me, tall trees and houses. So, when I attempted to exit onto the nearest road to try and continue tracking it with my eyes, I immediately lost these objects."],"Sighting Duration":"00:02:00","Weather Factors":"None","Log Number":"US-04052006-0001","trends":["There have been 3 other sightings in Richfield","There were no other sightings in Richfield on or around April 4th 2006"],"Longitude":"-93.276372","Tags":"City","Country":"United States","Viewing Distance":"Unknown","Summary":"An orange, spherical UFO coasted across the sky in a sporatic manner, stopped, then another sphere emerged from it and they both remained stationary."}