{"files":["/var/www/straped/mufon/html2text/46486.html.txt","/var/www/straped/mufon/org/46486.html"],"divs":["Sighting DetailsI was driving home from work and turned onto eastern road heading east. After turning on to eastern I noticed bright lights directly over the road about a mile ahead. I first thought it to be a helicopter until I realized the color of the lights. There was a bright white light with 2 smaller red lights on either side of it. Off to the side of those lights, and separated from them by about 20 feet,was a large bright green light. I drove directly under it and pulled into my driveway which was only about 500 feet past whatever it was. As soon as I pulled in my drive I got out of the car at the road. It was only 4 or 5 hundred feet in the air. It hovered about another 2 seconds and started moving southwest toward Rittman. I watched it for about a minute then it just instantly started heading northwest. I watched it head in that direction for 2 more minutes or so before I lost sight of it. There was no sound at all. No blinking lights. I must admit I am a little freaked out by how close it was and not hearing anything at all. I thought for a moment many an rc helicopter because I fly them. That was until I saw it moving many miles away. Also when it moved away the green light that was separated from the others was in the lead. They all stayed positioned to each other perfectly so I assume it was 1 thing not multiple. I wish it would of stayed there a little longer cause I was fumbling for my phone to get a pic or something. By the time I got it out it was already too far away for my phone to really pick it up. As soon as I lost site of it I pulled my car to the apartment and went inside. I looked up where to report UFO sightings and that led me here. Thank you."],"Longitude":"-81.729756","Object Shape":"Other","Log Number":"US-03292013-0015","City":"Doylestown","Source":"MUFON","Object Flight Path":"Hovering then path,Path with directional change","Latitude":"41.012899","Case Number":"46486","map":"<A HREF = \"http://maps.google.com/maps?q=41.012899,+-81.729756(46486)&iwloc=A&hl=en\"> mufon case (46486) map </A>","Disposition":"Unresolved","Summary":"lights hovering over road. i drove under them and parked. hovered above me then flew west.","Viewing Distance":"101-500 Feet","trends":["There have been 4 other sightings in Doylestown","There were no other sightings in Doylestown on or around March 29th 2013"],"Date Submitted":"03/29/2013 11:54 UTC","Weather Factors":"Unknown","Country":"United States","Tags":"City","Object Features":"Unknown","Sighting Duration":"Undisclosed","Region":"Ohio","Date of the Event":"03/29/2013 11:05 UTC"}