{"City":"Albuquerque","Longitude":"-106.561794","Date of the Event":"03/27/2013 11:30 UTC","Date Submitted":"03/29/2013 12:21 UTC","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was in my hobby room about 11:30pm on Wednesday, March 27, 2013 on the 2nd story which has an unobstructed view of the Sandia Mountain range. I turned out the light and looked towards the mountains as I do every night and saw an object over the mountain range which is over 10,000 feet that had very bright red and green lights but the red lights were brilliant red and were actually beams of light in the shape of very long triangles. One at the top of the object pointing up and one at the bottom pointing down to the ground. Both beams were 50-100 feet long and had very sharp points at the tip. The green lights must have been very small because I didn't notice them anymore. It moved back and forth over the mountain top then came down a little and started moving west over the houses in my direction so I immediately ran down the steps and out into the back yard which took about 15 seconds but it had disappeared. No sound, no planes, no helicopters. Just silence. There is a tram north of this sighting but the object was farther south and looked nothing like the tram as it was moving around and flying over the mountain. There is also a restaurant and light towers up there but all were north of this sighting and they are stationary. I have seen lots of planes and helicopters in this area, even hot air balloons, but I have never seen anything with beams like that."],"Object Flight Path":"Path with directional change","Region":"New Mexico","Tags":"City","Latitude":"35.174599","Source":"MUFON","Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.174599,+-106.561794(46480)&iwloc=A&hl=en\"> mufon case (46480) map </A>","Case Number":"46480","Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around March 27th 2013"],"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/46480.html.txt","/var/www/straped/mufon/org/46480.html"],"Log Number":"US-03292013-0009","Summary":"Object with two red triangular shaped beams moving back and forth over the Sandia Mountains near Albuquerque.","Country":"United States","Weather Factors":"Unknown"}