{"map":"<A HREF = \"http://maps.google.com/maps?q=43.212429,+-91.834029(46481)&iwloc=A&hl=en\"> mufon case (46481) map </A>","divs":["Sighting DetailsI was getting ready for work on the morning of 3-27, and a really nice looking sunrise started to come up so I decided to take a few photos. Normally when I want to take a picture of something I snap off a bunch of photographs in a row. Typically this gets me at least one of them that turns out really nice. I never heard or noticed anything during my picture taking. It wasn't until after I cropped and posted one of them on my facebook page in the morning on 3-29 that I noticed something that looked like a reflective glare above the sunrise. This prompted me to restore the sequence of photos that I took to see if this was apparent in all photos. At first going through the sequence nothing made itself apparent until I got aprox half way through them. I am attaching the last part of the sequence of photos that I took, 10 in all. Which show this object or glare rising and changing position throughout the sequence. I am guessing that I took all of the last 13 pictures within a 30 sec time frame. I had no inclinations of anything odd at the time the pictures were taken. I am still not sure if these are just glare or not, but thought it worth someone taking a more educated look at. Since this site will only let me upload 10 pictures I am attaching the last 10 in the sequence. I would be happy to send the rest if requested, and I kept the whole sequence of 25 photos if wanted as well."],"Case Number":"46481","Source":"MUFON","files":["/var/www/straped/mufon/html2text/46481.html.txt","/var/www/straped/mufon/more/46481_submitter_file10__PIC4015.JPG","/var/www/straped/mufon/more/46481_submitter_file1__PIC4006.JPG","/var/www/straped/mufon/more/46481_submitter_file2__PIC4007.JPG","/var/www/straped/mufon/more/46481_submitter_file3__PIC4008.JPG","/var/www/straped/mufon/more/46481_submitter_file4__PIC4009.JPG","/var/www/straped/mufon/more/46481_submitter_file5__PIC4010.JPG","/var/www/straped/mufon/more/46481_submitter_file6__PIC4011.JPG","/var/www/straped/mufon/more/46481_submitter_file7__PIC4012.JPG","/var/www/straped/mufon/more/46481_submitter_file8__PIC4013.JPG","/var/www/straped/mufon/more/46481_submitter_file9__PIC4014.JPG","/var/www/straped/mufon/org/46481.html"],"Sighting Duration":"Undisclosed","Date Submitted":"03/29/2013 01:53 UTC","Country":"United States","Object Features":"None","Viewing Distance":"Unknown","Disposition":"Unresolved","Tags":"City","trends":["There have been no other sightings in Calmar","This sighting has never been favorited."],"Log Number":"US-03292013-0010","Object Shape":"Oval","Weather Factors":"Unknown","Latitude":"43.212429","Longitude":"-91.834029","Date of the Event":"03/27/2013 12:00 UTC","Summary":"Taking pictures of the sun rise, didn't see anything until i looked at the pictures","City":"Calmar","Region":"Iowa","Object Flight Path":"Path with directional change"}