{"Region":"Indiana","Date Submitted":"03/30/2013 12:55 UTC","City":"Indianapolis","Latitude":"39.7674","Viewing Distance":"501 Feet - 1 Mile","Case Number":"46488","Country":"United States","Log Number":"US-03302013-0002","Longitude":"-86.158102","Tags":"City","Object Shape":"Triangle","trends":["There have been 126 other sightings in Indianapolis","There were no other sightings in Indianapolis on or around March 29th 2013"],"Date of the Event":"03/29/2013 11:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.7674,+-86.158102(46488)&iwloc=A&hl=en\"> mufon case (46488) map </A>","Source":"MUFON","Disposition":"Unresolved","Object Flight Path":"Hovering then path","Weather Factors":"Unknown","divs":["Sighting DetailsWe were walking around the circle downtown Indianapolis and The first time around we noticed a couple stars that appeared \"double\" and talked about them as we walked. Ten minutes later after a walk around downtown we made another lap around the circle. When we were at the point where we noticed the double stars before we looked to see if they were still there, they were gone. We then noticed a giant Triangle shape with 'dull gray' light emitting from the corners with what appeared to be faint light all the way around the triangle hovering over the city, it was hard to make out an altitude but it was pretty high in the sky. The shape stayed stationary long enough for us to see and question what it is and if each other actually saw it. The Triangle then slowly moved west and out of our view behind the buildings of downtown. From our perspective It was hoovering over the Conrad Hotel, then moved west, southwest out of our sight. We ran to try to get a better view several blocks away but it was gone by the time we made it to a place with a full view of the sky and horizon. The shape appeared to me to be hovering horizontal with the ground, one point pointing in the direction it was flying but from my wife's perspective she described it as like viewing a pyramid from the side..."],"Object Features":"None","Sighting Duration":"Undisclosed","Summary":"Giant triangle with dull grey lighted corners moving slowly west over the city of Indianapolis","files":["/var/www/straped/mufon/html2text/46488.html.txt","/var/www/straped/mufon/org/46488.html"]}