{"Longitude":"-84.371644","Country":"United States","Sighting Duration":"Undisclosed","Case Number":"4648","Object Features":"None","Latitude":"43.005862","files":["/var/www/straped/mufon/html2text/4648.html.txt","/var/www/straped/mufon/org/4648.html"],"trends":["There have been no other sightings in Ovid","This sighting has never been favorited."],"Region":"Michigan","Tags":"City","Date Submitted":"12/24/1988 09:20 UTC","divs":["Sighting DetailsWhile home on leave from the service, we were returning from a Christmas dinner from my grandmothers home in Elsie. My mom, dad, and brother were in the minivan as well. It was after 9 o clock and the sky was clear and star filled. About 20 minutes into the drive while looking out the passenger side window my mother noticed a luminescent blue sphere shape off to her right in the night sky. (this wouldve been placed true west) I looked at it and it was a solid blue sphere shaped object no blinking lights. It was interesting but nothing to cause any questions or such in our opinion. It was then about 30 sec later my mom blurted out..\"Look over there.\" On the east side of the sky (the drivers side) we could see a dark crimson sphere just like the blue one. We then looked over and could see the blue one in the same position that it was holding. My father had been driving about 50 miles an hour at the time due to good road conditions but slowed so we could get a better view of both of these lights. They always remained in front of our vehicle window which I mean to say is that we believed them to be traveling possible faster then us because they never truly moved out of our field of vision. My mom and dad rolled down thier windows to make sure we werent getting some sort of glare off a panel light. Both lights were there. It was when my dad stuck his head out the window quickly to look at the red light that it was he noticed a ivory colored light in front of but above the van. My dad slowed down to about 15 to 20 miles so we could see the three objects. They were situated as such. The white sphere was in the midle at a higher level then the other 2. The red sphere was lower on the east side of the road and the blue one was on the west side. It was a triangle pattern. The star field was not blotted out within this formation leading us to believe it was 3 seperate objects. After a minute the white sphere lowered slowly and then lined itself vertically with the other 2. The red and blue sphere's began to move towards the white one and they swapped places. Blue going to the east side and the red on the west. They then pulled closer to the white light and increased thier speed and we lost them near a clump of trees situated at M-21 which we were approaching at the time of the last visual contact. My main reaction was a mixture of confusion and astonishment. My adrenaline had me up for a little that night. I would be happy to provide a drawing to submit later for you if interested. Thank you."],"City":"Ovid","Summary":"3 spherical shapes above our van on clear night blue,red,white","Disposition":"Unknown","Source":"MUFON","Viewing Distance":"Unknown","Date of the Event":"12/24/1988 09:20 UTC","Log Number":"US-04052006-0002","Object Flight Path":"Hovering then path","Object Shape":"Sphere","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=43.005862,+-84.371644(4648)&iwloc=A&hl=en\"> mufon case (4648) map </A>"}