{"map":"<A HREF = \"http://maps.google.com/maps?q=34.477954,+-118.191642(46498)&iwloc=A&hl=en\"> mufon case (46498) map </A>","City":"Acton","Object Shape":"Unknown","Date of the Event":"03/30/2013 12:00 UTC","Summary":"Flickering light appeared to be coming at us, then disappeared.","Date Submitted":"03/31/2013 01:05 UTC","Object Features":"Unknown","Object Flight Path":"Stationary","Weather Factors":"Unknown","Longitude":"-118.191642","Sighting Duration":"Undisclosed","Case Number":"46498","Source":"MUFON","Viewing Distance":"Over One Mile","Latitude":"34.477954","trends":["There have been 2 other sightings in Acton","There were no other sightings in Acton on or around March 30th 2013"],"Tags":"City","Region":"California","Log Number":"US-03312013-0002","files":["/var/www/straped/mufon/html2text/46498.html.txt","/var/www/straped/mufon/org/46498.html"],"divs":["sighting detailssitting on my back porch, i live on the edge of the san gabriel mountain range, there is nothing behind my home but forest, there are very few lights in the area. i noticed as i was looking to the sw a flickering blue\\white light that seemed to be coming towards us from estimated 5 miles away. it may have been going away from us, i could not tell, but it seemed to coming towards us headed in a north direction of travel. i noticed it and joked, \"check out the ufo\", i thought it was an aircraft, normal one, it stayed at aprox the same spot in the sky for about 5 seconds and it disappeared, quickly faded out. it did not go below the horizon, or at least it didn't seem to. the light was in the sky for longer than 5 seconds because i noticed it before that, once i focused on it and pointed it out, it was only visible for a few more seconds and was gone. never seen anything like that before. i would guess it's location aprox above mt gleason. how i felt? i couldn't explain it away, it's the first time i've seen something and knew something was not right. somebody else had to have seen it as well."],"Country":"United States","Disposition":"Unresolved"}