{"Object Flight Path":"Undisclosed","Source":"MUFON","Country":"United States","Date Submitted":"08/20/2005 04:25 UTC","divs":["Sighting DetailsI can't remember the exact date but sometime last August(2005). I left my parents house for a few months and moved in with my sister just on the other side of town, one of these housing additions you see around here all the time now. Anyway one hot night,sticky,and clear,i was doing what i always did, i had been up all night watching t.v. and everything was normal. Keep in mind this is a housing neiborhood so there are houses and streetlights all around. About 4:20 or 4:25a.m. i was in my bedroom upstairs watching nick at nite. For no apparent reason i suddenly got an urge , not a voice in my head , just an urge to look out the window. I stood up and slowly peaked out the blinds, and when i did, across the street, right underneath a streetlight i saw 3 entities walking,a tall one, a shorter one and a tall one, in that order, the short one was between the tall ones.They were skinny, they had long limbs,slightly larger heads than humans, and they walked funny. One of the strangest things about this experience was that the exact second i looked out the blinds they were starring at me , like they knew i would look out the blinds at that exact second.Also, they were not walking side by side like three humans most likly would, they were walking in a strait line, and like i said they were walking funny, kinda like zombies in them old zombie movies, backs bent,arms just dangleing,knees bent,like they weren't using much muscle, and heads dangeling aswell but cocked to stare at me.However, because of lighting outside, and in my room, or somthing like that i couldn't tell what color they were or make out any specific facial features,they just looked like black shadows in the streetlight,but not blobs, very well defined,ok. They kept on starring at me and i kept on starring at them and they kept on walking untill i could not see them anymore cause' they went behind the other houses or something. Once they were out of my sight the next thing i remember was backing away from the window, puting my hands on my head and saying \"what do i do now\". Then i slowly fell to the floor, i could not use my legs at all.So i crawled to my bed and lyed down.I was panicing. I just lyed there in bed, my heart racing,my legs useless,and i've never had a harder time trying to keep my eyes open, but for some reason i was afraid to fall asleep, i thought i would never wake up again. As i sat there in my bed i thought about screaming for my sister to come help me, and then i even thought about calling 911,but i did'nt, i just laid down and tried to relax,hopeing all these feelings would go away soon, and they did, thank goodness. After a while i stood up and tried walking, it got better and better and eventually my heart beat went back to normal and i could walk again. Soon after that i fell asleep. I woke up the next day feeling normal'for the most part'. It was a buityfull day. Eight months later as i write this,the lingering psychological effects are slowly starting to diminish, and im getting better.No physical effects by the way."],"Disposition":"Insufficient Data","Summary":"three non human ,humanoid entities","Latitude":"39.710572","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.710572,+-86.394509(4649)&iwloc=A&hl=en\"> mufon case (4649) map </A>","Region":"Indiana","trends":["There have been 9 other sightings in Plainfield","There were no other sightings in Plainfield on or around August 20th 2005"],"files":["/var/www/straped/mufon/html2text/4649.html.txt","/var/www/straped/mufon/org/4649.html"],"Viewing Distance":"Unknown","Longitude":"-86.394509","Tags":"City","Weather Factors":"Unknown","City":"Plainfield","Object Shape":"Undisclosed","Log Number":"US-04052006-0003","Sighting Duration":"Undisclosed","Date of the Event":"08/20/2005 04:25 UTC","Case Number":"4649"}