{"Weather Factors":"Unknown","Latitude":"38.81053","Object Flight Path":"Stationary","Tags":"City","Viewing Distance":"101-500 Feet","Source":"MUFON","Summary":"Witness believes that he shot an entity while rabbit hunting as a child. Subsequently he saw a craft and believes he was abducted and taken onboard.","divs":["Sighting Details According to witness, the event happened in early spring of either 1969 when he was 6 years of age or in 1970 when he was 7 years of age. He said his dad got him a 22 cal. rifle when he was about 3, and taught him to shoot and hunt. The incident occurred in a desert area about 30 miles east of Reno at about 10 AM in the morning. Witness said he and his dad arrived at the location driving their Volkswagen Van. The weather was described as a clear day with a blue sky and crisp, clean air. Witness said his dad stayed with the van to drink beer, as he always did, while witness would go hunting rabbits his 22 cal. rifle. Witness said a minute or so into the hunt, he shot a rabbit, retrieved it and continued to hunt. According to him, it was just a minute or two later that he saw another rabbit and started to take aim when something within his peripheral vision about 8 to 10 feet away off to his right side caught his eye. He said he was startled and just turned his head slightly to the right and realized he was looking at a \"thing\" standing there, staring at him. He described the \"thing\" as about his the same height as he was, which he estimated to be about 4 feet tall, very skinny with long arms, large head with large dark eyes, and was grayish in color. He said he was immediately frightened but had kept his rifle pointed in the direction of the rabbit. Witness said he remembered keeping the \"thing\" within his peripheral vision and noticed that it started turning its head slightly to its right in the direction of the rabbit witness had intended to shoot. However, the \"thing\" then turrned its head back looking at him and simultaneously began raising its right arm,held straight out. Witness said he became extremely frightened and thought the \"thing\" was about to do something to hurt him, so he swung his rifle in the direction of the \"thing\" and fired one shot into the upper right side of its chest and it fell to the ground. As quickly as it happened, witness said he dropped both his rifle and the rabbit he had shot earlier, and ran back to the parked Van, crying and screaming for his dad. He said as he got to the Van, his dad, who may have been intoxicated from his beer drinking, began scolding him, wanting to know why he was crying and not hunting. Witness said he tried to explain to his dad that he had shot a\"thing\" and may have killed it. His dad purportedly responded by telling him he was only supposed to shoot rabbits, not anything else, and began asking him what he had done with his rifle. He said he told his dad what had happened as he continued to cry and pleaded with his dad to go back and see if they could help the \"thing\" he had shot. However, he said his dad was adamant and \"drunk\",and ordered him to go back to get his rifle and the rabbit he had shot and to keep hunting. Witness said he did as he was told and went back, found his rifle and the rabbit he had shot earlier, but the \"thing\" was gone. He said he looked around the area where it had been laying after he shot it to see if there was any blood but saw none. The very next thing he remembers is that as he was standing there where he had shot the \"thing\"when he suddenly saw a craft hovering just above the ground an estimated 200 feet away. He said he could only describe it as a cylinder or \"cigar\" shaped object, metallic looking and as long as a football field. The next detail he remenbered was being in some type of a \"room\"with beams like frame work and what appeared to be a lot of dust. He was frightened and crying, and the next he remembers is being in the back seat of the van, alone in the dark, crying for his dad who wasn't there. He said he now believes \"they\" still had his dad. The next that he remembers is he is with his dad in their van driving home in the dark. He said he asked his dad why it was dark since they always left the hunting area in the afternoon so they could get home and clean their rabbits before dark. Witness said he recalls his dad ignoring his questions and telling him he was going to clean the rabbits they had hunted that day when they got home even though it was dark. Witness said he is certain that he and his dad had both been abducted and somehow had been returned to their van. He said that his dad never said anything to him about the event again and would never discuss that hunt again. He said he never got over the experience, has felt guilty all of his life for shooting what he now believes was an \"entity\" and has never forgiven himself. Witness said he has seen and felt the presence of something watching him ever since his experience and is now willing to undergo regressive hypnosis with the hope of finding out what did happen after he shot the \"entity\" and if there was some meaning to why it happened. Witness underwent medical examiniations by different doctors recently due to problems he began having with his throat and ears. At least one of the doctors thought there was type of implant in one of his ears. Since he doesn't have health insurance, he couldn't pay for the procedure to remove it. Witness is convinced he has been taken many times, threreafter, and even believes he was in a craft which was just controlled by the placement of hands on the inside surface of the craft, there were no controls or anything tangible seen. About the first week of November 2012, while on land north of his homr he said he saw creatures, and has visions and dreams constantly. Witness told me he has had a spot of gray hair which showed up right after his experience, and as a kid, people that saw him wanted to know how a boy his age could have gray hair. He said there is much more he can tell us now and that he trusts me."],"Disposition":"Unresolved","Date of the Event":"05/01/1969 12:00 UTC","Object Shape":"Cigar, Cylinder","Date Submitted":"03/31/2013 08:44 UTC","Case Number":"46504","Object Features":"Other","Region":"Nevada","files":["/var/www/straped/mufon/html2text/46504.html.txt","/var/www/straped/mufon/org/46504.html"],"City":"Undisclosed","Longitude":"-116.415279","Log Number":"US-03312013-0009","trends":[],"Sighting Duration":"Undisclosed","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=38.81053,+-116.415279(46504)&iwloc=A&hl=en\"> mufon case (46504) map </A>"}