{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=44.749164,+-117.828633(46503)&iwloc=A&hl=en\"> mufon case (46503) map </A>","divs":["Sighting Detailsmy wife an myself walked two blocks over to the mini mart for a late nite snack as we headed back toward our home we noticed what appeared to be a pulsating star. upon our return we grabbed a couple pairs of binoculars. we had to say it was really wild so i phoned a freind over on the other side of town he waked into back yard an saw it also about that time my wife said hey theres another one and we got to looking and ther was 3 spread out through the sky in the south we then further inspected the nite skies and noticed 4 to the east.the first one disapeared on us only to be replaced by another one. we all get the feeling they are closer then the stars it is hard to say how close however. it is eery not having a clue as to what we are witnessing,it is twelve pm my wife is still watching them move ever so slowly over us as so is other local townsfolk it like being invaded by pulsating colored orbs of light.we are still watching this strange occurance as i end this reporting"],"Object Features":"None","Country":"United States","City":"Baker City","Log Number":"US-03312013-0008","Case Number":"46503","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/46503.html.txt","/var/www/straped/mufon/org/46503.html"],"Disposition":"Unresolved","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path","Date Submitted":"03/31/2013 03:08 UTC","Weather Factors":"Unknown","Region":"Oregon","trends":["There have been 2 other sightings in Baker City","There were no other sightings in Baker City on or around March 30th 2013"],"Summary":"looking into the southern sky tonite my wife and i noticed what looked to be a star flashing 4 colors then we saw 7 more 4 to the east also","Tags":"City","Longitude":"-117.828633","Date of the Event":"03/30/2013 10:00 UTC","Object Shape":"Unknown","Latitude":"44.749164"}