{"Tags":"City","Object Features":"None","Case Number":"46506","Latitude":"36.297854","map":"<A HREF = \"http://maps.google.com/maps?q=36.297854,+-92.248363(46506)&iwloc=A&hl=en\"> mufon case (46506) map </A>","Object Flight Path":"Path with directional change","Date of the Event":"02/27/2013 12:00 UTC","Source":"MUFON","Date Submitted":"03/31/2013 02:10 UTC","City":"Mountain Home","Country":"United States","Disposition":"Unresolved","divs":["sighting detailsi live on a hill overlooking lake norfolk in arkansas, the rear of my home faces south toward the lake norfolk dam. it was a cloudy, cold afternoon about 3:00 pm. i happened to be standing at my rear window looking out over the lake when from my left a brilliant crystal white ball of light raced south over lake norfolk toward the dam about 200 feet over the water.. it was lower than i was so i was looking a bit downward at it. it appeared to be about the size of a small bus or van, it was a brilliant crystal white. there is a row of trees that was between the object and me but there are no leaves at this time of year so i got a great look at it. it appeared to be rolling with flashing strobe lights, however it was passing behind the trees and i am not sure if it was actually flashing or the flashing was caused by the object passing behind the trees. as the object got south of me it slowed almost to a stop did a couple zigs and appeared to split into two or three small objects. it then continued slowly toward the dam and then disappeared. i never saw it rise above the tree line\\horizon. the sighting did not last more than about 15 seconds.i had no other feelings than wow what was that. a few weeks later i saw a program on tv showing the stephenville lights and i realized that they were about the same thing that i saw."],"Longitude":"-92.248363","Weather Factors":"Unknown","trends":["There have been 6 other sightings in Mountain Home","There were no other sightings in Mountain Home on or around February 27th 2013"],"Object Shape":"Sphere","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-03312013-0011","Summary":"Same as Stephenville lights","Region":"Arkansas","files":["/var/www/straped/mufon/html2text/46506.html.txt","/var/www/straped/mufon/org/46506.html"]}