{"Object Flight Path":"Hovering then path","trends":["There have been 3 other sightings in Reynoldsburg","There were no other sightings in Reynoldsburg on or around March 30th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.936352,+-82.817012(46510)&iwloc=A&hl=en\"> mufon case (46510) map </A>","Disposition":"Unresolved","Latitude":"39.936352","Tags":"City","Date Submitted":"03/31/2013 05:39 UTC","Longitude":"-82.817012","Weather Factors":"Unknown","Case Number":"46510","divs":["Sighting DetailsReynoldsburg, OH March 30, 2013. My wife was in the back yard at approximately 10:10 PM EST and called me to come see this. I saw 5 objects in the sky hovering at 2-5 miles away below the clouds. These 5 objects were dark in the center and had a red and white bright light outline. They were not in formation, but instead were moving back and forth in the same area. One would disappear and re-appear immediately on the other side of one that remained stationary (random leapfrogging). It seemed they were getting closer and then ascended and disappeared one by one. There was absolutely no noise. An airplane flew past the unknown cluster of 5 about a mile east going south as the 5 objects were ascending and disappearing. I assume the airplane was departing from CMH since we see airplanes taking off and landing from that area all the time. We were nervous and excited at the same time. Our dogs were also nervous and were running back and forth and barking at nothing in particular. I saw the pictures in MUFON case # 46507 and they are exactly like what we saw that night."],"Sighting Duration":"00:04:00","Date of the Event":"03/30/2013 10:10 UTC","Object Features":"Unknown","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/46510.html.txt","/var/www/straped/mufon/org/46510.html"],"Log Number":"US-03312013-0015","Region":"Ohio","Country":"United States","Object Shape":"Teardrop","Summary":"5 objects in sky hovering w/ random quick movement. White/red lights outlined dark object.","City":"Reynoldsburg","Source":"MUFON"}