{"Tags":"City","Sighting Duration":"00:02:00","Date of the Event":"08/17/1991 10:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.733464,+-82.205677(46528)&iwloc=A&hl=en\"> mufon case (46528) map </A>","Case Number":"46528","Date Submitted":"04/01/2013 05:39 UTC","Summary":"Large fireball that roared like a jet and slowly ascended, then disappeared","Disposition":"Unresolved","Country":"United States","Log Number":"US-04012013-0011","Object Shape":"Fireball","Region":"South Carolina","Object Features":"None","Source":"MUFON","Object Flight Path":"Other","City":"Modoc","files":["/var/www/straped/mufon/html2text/46528.html.txt","/var/www/straped/mufon/org/46528.html"],"trends":["There have been no other sightings in Modoc","This sighting has never been favorited."],"Latitude":"33.733464","Longitude":"-82.205677","Viewing Distance":"21-100 Feet, 101-500 Feet","divs":["Sighting DetailsA group of my friends and I were at my friend's family's lake house in Modoc, SC to celebrate her birthday. We were all in 8th or 9th grade, but I don't remember exactly. We were staying up late and nobody was drinking, by the way, all sitting on the dock outside. We heard a loud sound towards the adjacent hill, and all focussed our attention there, wondering what it could be. After about 30 seconds, we saw a large fireball that had intense directional thrust to the flames. It slowly ascended, about a foot a second, all the while roaring like a jet. Even though this seems counter to logic, I remember the thrust of the flames pointing skyward as it rose (seems so backwards then and now).It was intensely bright and lit up the surrounding woods. In all, it probably rose no more than 20 feet above the treetops and then simply disappeared, the sound and all. This all took no more than 3 minutes. Everything was as before except we all sat in stunned silence for a few seconds. I don't recall any of us speaking of it after that, which is a bit strange for teenage girls."],"Weather Factors":"Unknown"}