{"Log Number":"US-04012013-0008","files":["/var/www/straped/mufon/html2text/46525.html.txt","/var/www/straped/mufon/more/46525_submitter_file1__PICT0015.JPG","/var/www/straped/mufon/more/46525_submitter_file2__PICT0016.JPG","/var/www/straped/mufon/more/46525_submitter_file3__PICT0017.JPG","/var/www/straped/mufon/more/46525_submitter_file4__PICT0018.JPG","/var/www/straped/mufon/more/46525_submitter_file5__PICT0272.JPG","/var/www/straped/mufon/org/46525.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.648586,+-94.13245(46525)&iwloc=A&hl=en\"> mufon case (46525) map </A>","Disposition":"Unresolved","Longitude":"-94.13245","Country":"United States","divs":["sighting detailsi didn't personally observe the object in question, but found it when i checked the photographs taken by a game camera that was set up to photograph predators that might be bothering our sheep. sheep are in the photos and appear to be unaffected by the object, so assume there was no sound. the infrared camera was attached to a tree at the side of the pasture about 2 1\\2 feet off the ground and was stationary. it only took pictures when motion was detected and took numerous photos of sheep movement and other wildlife both day and night. i have included a photo progression of three photos (#16, #17, #18) taken one second apart, as well as one taken by the same camera in the same location in the daylight (#272) for perspective and one taken 18 seconds earlier (#15). the date and time are recorded at the bottom right of each photo. photo #0015 - nothing in the sky in this photo. photo #0016 - something dimly lit in the top right quadrant. possibly approach of object in photo #0017. photo #0017 - object in question is seen as a lighted rod with three triangles evenly spaced on top and four triangles evenly spaced on the bottom. photo #0018 - same as photo #1, taken one second after photo #3 shows nothing but dark sky. photo #0272 - photo taken in the daytime by same camera, which had not been moved, for perspective on where object was in comparison to the sky. it appears that the lighted object in photo #0017 may have been in between the camera and the pine tree."],"City":"Mena","Object Flight Path":"Unknown","Object Shape":"Other","Weather Factors":"Unknown","Region":"Arkansas","Tags":"City","Summary":"Photos taken by infrared game camera of rod-shaped object with triangle-shaped appendages","trends":["There have been 4 other sightings in Mena","There were no other sightings in Mena on or around March 28th 2013","This sighting has never been favorited.",""],"Sighting Duration":"00:00:02","Case Number":"46525","Latitude":"34.648586","Date of the Event":"03/28/2013 08:05 UTC","Date Submitted":"04/01/2013 03:49 UTC","Source":"MUFON","Object Features":"Appendage(s)","Viewing Distance":"Unknown"}