{"Sighting Duration":"00:10:00","Case Number":"46529","Region":"Saskatchewan","Weather Factors":"Unknown","Longitude":"-104.683303","Date of the Event":"08/15/1996 02:00 UTC","files":["/var/www/straped/mufon/html2text/46529.html.txt","/var/www/straped/mufon/org/46529.html"],"Latitude":"50.49412","map":"<A HREF = \"http://maps.google.com/maps?q=50.49412,+-104.683303(46529)&iwloc=A&hl=en\"> mufon case (46529) map </A>","Summary":"was scary crazy quick unreal!","City":"Regina","divs":["Sighting DetailsIt was a summer night me and my friend decided to sleep on the trampoline that night.I was about 11 yrs old at the time the date is very fuzzy because we never did report or write down the date...but looking back i believe it was about 1996 summer....we were both in our sleeping bags on our backs looking straight out into the sky when a ufo comes directly over top of us...it was big round and had orgy-red lights underneath it slowly rotating above us...it was soundless it shot off so fast not a sound came from it n i asked my friend did u just see what i did n his voice was scared and replied yes. suddenly it returned but lower this time my first instincts were to get out of there, as i freaked out to get my sleeping bag open there was a static show. from the trampoline and sleeping bag n ufo caused a serious static show it was going off like fire works lighting up if you've ever seen static at night its bright so imagine a bunch going off at once..i then ran off the trampoline inside the house. We told my friends mom but she did not believe a word us young kids were saying which i think prevented us from coming fwd with this at the time and report it.. we kept it a secret and it seemed me and my friend kind of forgot about it then one day it came back to me i asked my friend what he remembers and his story was a little bit different almost like his brain was trying to forget it. It bugs me that i don't have the exact date on this siting but i no what i seen was ufo and this is no made up story. I was feet from the ufo and it was straight above us so therefore looking right at us. i think if we feel alseep that night we would have been abducted no doubts specially after reading all these reports on here. I also wish we never ran into the house but i think that's just how us kids seen it. What really strikes me is the static that happen on the trampoline when we rushed out of there!"],"Log Number":"CA-04012013-0012","trends":["There have been 10 other sightings in Regina","There were no other sightings in Regina on or around August 15th 1996"],"Viewing Distance":"101-500 Feet","Date Submitted":"04/01/2013 05:59 UTC","Disposition":"Unresolved","Object Flight Path":"Stationary,Hovering then path","Country":"Canada","Source":"MUFON","Object Shape":"Circle, Disc","Tags":"City","Object Features":"Other"}