{"Sighting Duration":"Undisclosed","Summary":"very close proximity to UFO sighted on Sunset Rd near Greensboro Country Club","trends":["There have been 24 other sightings in Greensboro","There were no other sightings in Greensboro on or around November 30th 1987"],"City":"Greensboro","Country":"United States","Date Submitted":"11/30/1987 09:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.079135,+-79.787775(4653)&iwloc=A&hl=en\"> mufon case (4653) map </A>","Object Shape":"Saturn-like, Sphere","Log Number":"US-04052006-0007","Latitude":"36.079135","Case Number":"4653","Object Features":"Dome, Window(s)","Date of the Event":"11/30/1987 09:00 UTC","Disposition":"Insufficient Data","Viewing Distance":"101-500 Feet","Tags":"City","Region":"North Carolina","Weather Factors":"None","Longitude":"-79.787775","divs":["sighting detailsi was driving down sunset dr. w\\ a friend. when coming to the valley of the road, starting up the incline, we spotted something huge just above the treeline. you couldn't miss it. this was in a neighborhood w\\ homes on both sides of the road. we both got out of the car, and viewed a very large object (at least 150 ft) hovering above the trees. seemed light in color (not silver) w\\ oval windows around the sides that were colored (maybe pink, green and blue in sections). it made no noise, and after several minutes of watching it, it moved quickly up and to the right out of sight. it moved faster than anything i've ever known of without making any noise. my friend and i got in the car, turned around to go toward an open field, but never found it again. we were very confused about what we saw, and called the greensboro airport authority, and they told us (after transferring us around) that it was probably a jet re-fueler. that didn't sound right, so we again described what it looked like and what it did, and they said that's what it was. i have since seen a jet-refueler - and it looks nothing like what we saw. a jr would make noise - is not that shape, plus it would not be doing manuevers above a residential neighborhood. this happened a long time ago, but my memory is vivid. i am angry that this was laughed off by authorities and i was given misinformation. the least they could do is say \"we don't know\", or \"it can't be identified\". this is why i am posting it here. to add - no drinking or drugs were involved in this sighting."],"Object Flight Path":"Hovering then path","Source":"MUFON","files":["/var/www/straped/mufon/html2text/4653.html.txt","/var/www/straped/mufon/org/4653.html"]}