{"Weather Factors":"Unknown","trends":["There has been one other sighting in Bunbury","There were no other sightings in Bunbury on or around April 1st 2013"],"Latitude":"-33.324528","map":"<A HREF = \"http://maps.google.com/maps?q=-33.324528,+115.642494(46534)&iwloc=A&hl=en\"> mufon case (46534) map </A>","Log Number":"AU-04012013-0017","Disposition":"Unresolved","Object Features":"None","Source":"MUFON","Sighting Duration":"Undisclosed","Case Number":"46534","Date of the Event":"04/01/2013 12:00 UTC","Country":"Australia","Longitude":"115.642494","Summary":"Two very bright stars spotted side by side above the constellation hydra, suddenly fade and a few seconds later two sperate flashes of light with a pulse effect were seen in the same area.","Viewing Distance":"Unknown","Tags":"City","divs":["Sighting DetailsMe and my wife were on the balcony having a cigarette and looking at the stars when i noticed to very bright stars side by side above the constellation hydra, they were as bright as Venus is when its in our night sky. i know the night sky very well and knew that the only planet in view was Jupiter and had never seen these stars before. So we're watching these two stars trying to figure out what they are when suddenly the two bright stars began to fade until they completely disappeared, then a few seconds later we both witnessed a sudden flash of light like a very bright star turning on and off but like a pulse just below where we saw the two lights, and my wife witnessed and another flash of light not far from the same location. A few minutes later when trying to figure out what we saw, what looked like a bright satellite suddenly appeared above us and ran across the sky very quickly and disappearing as quick as it appeared. Ive observed plenty of satellite and meteorites in my life and have never seen anything like that."],"Region":"Western Australia","Object Flight Path":"Stationary,Straight-line path","files":["/var/www/straped/mufon/html2text/46534.html.txt","/var/www/straped/mufon/org/46534.html"],"Date Submitted":"04/01/2013 10:23 UTC","City":"Bunbury","Object Shape":"Star-like"}