{"files":["/var/www/straped/mufon/html2text/46533.html.txt","/var/www/straped/mufon/org/46533.html"],"Date Submitted":"04/01/2013 10:09 UTC","Object Shape":"Sphere","Source":"MUFON","Country":"United States","Tags":"City","Longitude":"-86.344908","map":"<A HREF = \"http://maps.google.com/maps?q=39.915973,+-86.344908(46533)&iwloc=A&hl=en\"> mufon case (46533) map </A>","Case Number":"46533","Object Flight Path":"Path with directional change","Summary":"orange very fast strobe light coming toward me, passed overhead lights went out on it then it changed direction instantly","Disposition":"Unresolved","Log Number":"US-04012013-0016","City":"Brownsburg","Weather Factors":"Unknown","Latitude":"39.915973","divs":["Sighting DetailsI left work at 820 pm and was halfway home. I was heading south on 1000E just north of 56 th street. I was watching two jets far away probably landing at Indpls Airport. Then to my right I saw What I thought to be a small plane coming toward me. That when it caught my attention because it had orange lights instead of red and green plus they were flashing really fast. I am still driving so it was hard to focus on it. By the time it got overhead I got my truck stopped and drivers window down. I stuck my head out and looked up at it and then it just went dark, lights out but with the full moon I could see it was round and it change direction. It was going NE and it instantly changed to South. I lost it after 3 to 4 seconds. Before I noticed it I had just a weird feeling and remember looking at clock on dash to make sure I had not dozed or anything and I was right on time then I saw it. I am a little paranoid now. When I watched it go dark and change directions and not be seen makes you wonder how many more are there and what do they want."],"Object Features":"Unknown","trends":["There have been 9 other sightings in Brownsburg","There were no other sightings in Brownsburg on or around March 26th 2013"],"Date of the Event":"03/26/2013 08:35 UTC","Region":"Indiana","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed"}