{"Case Number":"46539","City":"Cleveland","Region":"Ohio","files":["/var/www/straped/mufon/html2text/46539.html.txt","/var/www/straped/mufon/org/46539.html"],"Object Flight Path":"Path then hovering","Object Features":"Patterned Surface, Appendage(s), Wings","Latitude":"41.529278","Summary":"Bird Like structure with massive wings, with altenating human animal head, human head was monk like, animal head was a ancient lion.","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.529278,+-81.62097(46539)&iwloc=A&hl=en\"> mufon case (46539) map </A>","Date of the Event":"07/18/1988 04:30 UTC","Viewing Distance":"20 Feet or Less","Object Shape":"Other, Unknown","Disposition":"Unresolved","divs":["Sighting Details1. Where were you and what were you doing at the time? Pregnant and Sleeping next to my husband. 2. What made you first notice the object? I woke up and heard and saw a small like bird hitting the window. Then entered the room. I tried to wake my husband but he wouldn't wake up. 3. What did you think the object was when you first noticed it? Just a small robin bird hitting the window or injured bird trying to enter through the window. 4. Describe the object and its actions and motions in detail. When the bird entered the room, through the window, a vortex opened in the middle of the ceiling. Out of the vortex was a huge massive shadow of a winged structure. The wings spread across the bedroom ceiling. As the wings were flapping, tons of grey dust-like triangular flakes started to fall. As the dust flakes started to land on me, they turned very pretty platinum white flakes but they disappeared. I was screaming and the entity was holding me down and had my arms and hands pinned down spread across the bed. I told the entity that I am so scared that I am having a heart attack and my chest was solidly tight. But the entity said nothing but started this heavy wind gust down on me, as if it was trying to rid me of negativity and fear. I also told the entity that I have sinned and that I have problems with family and relationships. The entity took my advice and spread my legs and entered me with an appendage and pressing on my chest and pressing my babys head. As the entity was pressing on my chest with doctor like hands, all I could see was the cherib-like angel (that was sitting on the left wing of the angel taking notes with an ancient stylus pen and ancient tablet. At the same time, many cheribs were attached to each of the wings and they were all talking to each other about me and problems of the world. At this point, I was relaxed and stated I saw that pen in a history book and the paper tablet looks like papapyrus cloth. When I said that, the head on the entity turned from the monk like hood to a lions switching and shaking the head as if it was battling an evil entity that came out of me. I started to stare with the impression of why these two entities are fighting over me. As I was staring also it elevated me in the air and pulled me into a pasture were there were thousands of sheep and beyond the horizon, I saw a man with his back turned staring onto the horizon sunset with the sheep and I in back of him. As I was walking through the herds of sheep there was a disfigured sheep that looked as if it suffered radiation because it had many eyes and the head was larger than the rest of the herd.As I looked at one of the eyes, it had my reflection in it, as if it had been watching me for many years. Then I floated back in my body and the entity stated \"FEAR NOT, DANGER AHEAD\". It was staring at me,for 5-10 minutes after the statement and then folded the vortex like a thin flat inch 70inch flat screen tv and the huge bird like human monk-like animal spirit shrunk like a robin bird and flew out the window. I was yelling please take me I don't want to be here anymore. The little bird flew out the window without acknowledging what I said."],"Longitude":"-81.62097","Tags":"City","trends":["There have been 47 other sightings in Cleveland","There were no other sightings in Cleveland on or around July 18th 1988"],"Source":"MUFON","Date Submitted":"04/02/2013 01:17 UTC","Sighting Duration":"01:15:30","Weather Factors":"Unknown","Log Number":"US-04022013-0002"}