{"divs":["Sighting DetailsI was just getting off the 13 trolley after a half day school day and walking home to my house on a relatively sunny Wednesday afternoon. I had then walked up to my house and was just about to grab the door knob when a sudden almost electric feeling shot through my body and I just got a feeling that said \"look up now.\" Surely enough as I slowly looked up over the house I heard a sudden \"wooshing noise coming towards my direction and after a second or so the object suddenly appeared over the house and stopped there at almost what seemed like lightning speed. Spooked I moved back towards the sidewalk to get a better view of it. It was a huge object an oval and three circle lights in a triangle shape underneath like bright headlights and a domed cylindrical top part that was slightly away over the house and I didn't have a great perception but it had to have been the size of at least three cars I'll assume. It moved slowly towards the west direction from my house until I thought \"hey maybe they're friendly!\" and waved at it and shouted \"hey!\" It then suddenly stopped and shined a beam of light on me. It then started to move closer to me still slightly high in the air. Ironically, I just so happened to have a colorless and colored camera with me for a project I was doing with taking pictures and used the camera to try to take some pictures of the object as it moved slowly towards me. However, common sense kicked in and I became frightened because the light was now shining down on me and I thought \" hey I might get abducted\" and tried to move away from the light although it followed me and then I thought \"hey if I make my camera look like a gun maybe it will move away?\" I did and after a second or two it stopped shining the light and moved away towards the east. As it did and moved toward the tree I quickly entered the house and alerted my mother inside that there was a ufo over the house! She didn't come out but I then took my camera out as it was a little higher now and eastward and was able to take two pictures of the object. The first one didn't come out right and the second picture is kind of blurry and I'm not sure if it was my finger print or not but after that it went behind the large tree outside my house and when I went to look it was gone. A couple weeks later as I was watching video's online home alone around 7:00 at nightI suddenly heard a helicopter over the house and it got louder and louder and closer to the roof until it was literally shuttering the roofs rafters it was so close. I then ran into my room afraid that it might be some group searching for me like men in black or something and stayed in my room for about 5-10 minutes until it finally went away and about a couple hours later my family came home."],"Longitude":"-75.237743","Summary":"It was a Wednesday, and a half day from school. I grabbed the doorknob to my house when I suddenly got a feeling that said \"look up now.\"","Viewing Distance":"21-100 Feet","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.906135,+-75.237743(46541)&iwloc=A&hl=en\"> mufon case (46541) map </A>","Log Number":"US-04022013-0004","Tags":"City","Country":"United States","trends":["There have been no other sightings in Yeadon","This sighting has never been favorited."],"Date of the Event":"06/11/2008 01:30 UTC","files":["/var/www/straped/mufon/html2text/46541.html.txt","/var/www/straped/mufon/org/46541.html"],"Object Features":"Dome","Date Submitted":"04/02/2013 01:31 UTC","City":"Yeadon","Region":"Pennsylvania","Object Shape":"Circle, Cylinder, Oval","Case Number":"46541","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Weather Factors":"Unknown","Latitude":"39.906135","Source":"MUFON","Disposition":"Unresolved"}