{"Object Shape":"Circle","Country":"United States","Date Submitted":"04/02/2013 10:30 UTC","Date of the Event":"03/30/2013 09:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=30.379459,+-86.381212(46547)&iwloc=A&hl=en\"> mufon case (46547) map </A>","Source":"MUFON","Case Number":"46547","Weather Factors":"Unknown","City":"Miramar Beach","Object Flight Path":"Hovering then path","Latitude":"30.379459","divs":["Sighting DetailsI had just gone to bed, then I heard my neighbor yell, \"Hey Rick, come and see the UFO! I got up and went outside too see it. I stood under the craft that looked like a circular set of lights resembling beams of white light like a Car has. The craft moved in to position from over the top of my condo. It hovered without wobbling, but did move side to side slightly like it was being dynamically positioned. I thought it was one of the drones that Verizon now sells - but now I'm sure it was bigger than what they sell with many lights (5 or 6). My neighbors said they saw 3 flying drone type circular arranged lighted craft exit the Large Flying Wing Mothercraft! Also, a VERY,Very Bright Red lighted orb which seemed to control or exchange energy with the other craft! The Mothership would jump accross the horizon then really fast jump back! The 3 flying circular lighted drones and the red Orb left and returned to the Mothercraft. I think it may be advanced Military designs being used against and in route to North Korea!"],"trends":["There has been one other sighting in Miramar Beach","There were no other sightings in Miramar Beach on or around March 30th 2013"],"Log Number":"US-04022013-0010","Tags":"City","Summary":"Circular lighted, 5 or 6 lights, like car headlights, hovering, being dynamically positioned and returning to Mothercraft. Bright red light seen by neighbors and two more lighted circular arranged drones and large flying wing Mother ship jumping accross","files":["/var/www/straped/mufon/html2text/46547.html.txt","/var/www/straped/mufon/org/46547.html"],"Sighting Duration":"Undisclosed","Disposition":"Unresolved","Viewing Distance":"21-100 Feet","Object Features":"Unknown","Longitude":"-86.381212","Region":"Florida"}