{"Source":"MUFON","Region":"Illinois","files":["/var/www/straped/mufon/html2text/46549.html.txt","/var/www/straped/mufon/org/46549.html"],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=39.783751,+-89.647028(46549)&iwloc=A&hl=en\"> mufon case (46549) map </A>","Date of the Event":"03/27/2013 07:30 UTC","Latitude":"39.783751","Case Number":"46549","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","trends":["There have been 21 other sightings in Springfield","There were no other sightings in Springfield on or around March 27th 2013"],"Log Number":"US-04022013-0012","Date Submitted":"04/02/2013 11:00 UTC","Viewing Distance":"Unknown","Country":"United States","Tags":"City","Object Features":"Window(s)","Summary":"Triangle with long tail of five lights , In between this was a row of window ..All white lights with one blue light inside the triangle","Object Shape":"Triangle","divs":["Sighting DetailsMy granddaughter who took photos was in the car with her Mother, Uncle, and cousin. It was spring break they were coming from Mo. to my home in central Illinois. March 27, 2013.. When they were just south of Springfield my granddaughter thought the moon looked strange so she got her camera out to take photos. Then she notice a very large arrangements of lights. She took photos. When she showed them to me. I told her you got a perfect clear photo of a triangle.. She said Grandma . It keep changing shape of lights. Then she show me more photos. It was a triangle with a tail of five lights. She said it had windows between the main body and the straight long line of tale lights. . One small blue light was inside the triangle .. Her Mother could not see it. It was to the East and my daughter was driving due North. Her Mother kept telling her it had to be a plane. She told me Grandma it was no plane. It was huge.. She said she got scared a little when she seen it much closer..... My Son was in the back seat behind driver. his son was on the east side window but he is autistic so he would not be a witness."],"Sighting Duration":"Undisclosed","Longitude":"-89.647028","City":"Springfield"}