{"Object Shape":"Other","Object Flight Path":"Path with directional change","Disposition":"Unresolved","Tags":"City","Date Submitted":"04/02/2013 07:05 UTC","Latitude":"40.701651","Log Number":"US-04022013-0007","files":["/var/www/straped/mufon/html2text/46544.html.txt","/var/www/straped/mufon/org/46544.html"],"trends":["There have been 5 other sightings in Washington","There were no other sightings in Washington on or around March 30th 2013","This sighting has been favorited 1 time.",""],"Object Features":"None","Summary":"appx. 16-20 blinking lights, that changed shape. Several remained triangles until they disappeared.","Country":"United States","Case Number":"46544","Source":"MUFON","City":"Washington","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.701651,+-89.492906(46544)&iwloc=A&hl=en\"> mufon case (46544) map </A>","Region":"Illinois","Date of the Event":"03/30/2013 09:45 UTC","Longitude":"-89.492906","divs":["Sighting DetailsWe were in the backyard playing a lawn game @ appx. 9:45 PM on Saturday Mar. 30th 2013 ( Easter Eve ). My teammate was getting ready to throw when he stopped and said \" what the hell is that ? \" I looked up as did two of our friends looking toward the NW. There were appx. 16 to 20 lights that were slowly blinking.At 1st I was thinking this was a very large airplane, but reminded myself that there was no sound. My husband yelled out to get someone to record what we were seeing. My husband then grabbed his I phone and proceeded to record. We yelled at another friend to go get his kids ( ages 16, 11, and 10 ) to get them from inside the house as we wanted them to see this as well. The lights spanned appx. the width of a football field or more moving towards the east. This was not a fast movement and there was absolutely zero sound. As the lights moved east, they ramndomly blinked and formed a variety of shapes, some in triangles. As they turned slowly towards the direct north they formed triangles before disappearing. Another friend kept saying \"what is this \" \"what is this\". After they disappeared, we called the police dept. too see if anyone else had reported strange lights. No one had. We called the local TV station as well. No one reported seeing anything either. We sat down after all this disappeared and were trying to pick apart and rationally try to figure out what we had just witnessed. We rejected airplane as there was no sound and it would have had to have been a large aircraft. We also thought maybe it was several planes ( prop like ) but that would have meant 16 t 20 prop planes on a Saturday night. Not likely. We discussed a military operation, but again no sound. Not really sure what we witnessed. The video attached has to be viewed on full screen with lights out as this was recorded with a little iphone and that is the best way to view."],"Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown"}