{"Viewing Distance":"Unknown","Source":"MUFON","Date of the Event":"04/01/2013 10:30 UTC","files":["/var/www/straped/mufon/html2text/46548.html.txt","/var/www/straped/mufon/org/46548.html"],"Latitude":"31.083139","Object Features":"Dome","Region":"Texas","trends":["There have been 8 other sightings in Copperas Cove","There was one other sighting in Copperas Cove on or around April 1st 2013"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=31.083139,+-97.895941(46548)&iwloc=A&hl=en\"> mufon case (46548) map </A>","Summary":"Circular object with flashing lights hovers over homes in Copperas Cove,TX","City":"Copperas Cove","Disposition":"Unresolved","Country":"United States","Log Number":"US-04022013-0011","Sighting Duration":"Undisclosed","divs":["sighting detailsaround 10:30pm i went to open the window and when i pulled up the blinds i saw a circular object with flashing lights slowly hovering over homes here in copperas cove, tx. at first i thought it was a plane, but ive lived here since june 2010 and the planes that ive seen never fly so low, are loud, and never this shape with all those lights flashing in a circular direction. then i thought it was a helicopter, even though i know helicopters arent circular shaped however the propellers do go in a circular motion, i convinced myself that it could be that, so i listened for the sound and everything was silent. it was so weird. definitely wasnt a helicopter. so i called my husband to come quick because i wanted him to explain what i was seeing. at this point the object had moved west but my husband was able to observe it before our view would be obstructed by distant homes. after a few seconds of silence, my husband said, \"i think that was a ufo.\" my thought exactly but i didnt say it because i didnt want to sound dumb and\\or influence his thoughts. my husband is in the military and assured himself as well as me, that it wasnt flares. he seemed confused. he also noticed that i was feeling nervous and that i kept going back to look out the window so he then said, \"maybe it was a uav\". so i started to second guess myself. i got on the internet researched uavs and let me tell you, i am more convinced now that we saw a ufo. uavs are a significantly smaller, do not have all the lights i saw, and not circular (disc) shaped. after reading into uavs, i googled ufo sightings in copperas cove, tx and one other person commented about it, but just said it was scary, and didnt give much information. i would like to know that we arent the only ones that saw this. hoping other people come forward. should have recorded it."],"Object Shape":"Circle, Cylinder, Disc, Oval","Case Number":"46548","Object Flight Path":"Stationary,Hovering then path","Date Submitted":"04/02/2013 10:49 UTC","Weather Factors":"Unknown","Longitude":"-97.895941"}