{"map":"<A HREF = \"http://maps.google.com/maps?q=29.860821,+-90.045526(46543)&iwloc=A&hl=en\"> mufon case (46543) map </A>","Case Number":"46543","files":["/var/www/straped/mufon/html2text/46543.html.txt","/var/www/straped/mufon/org/46543.html"],"Summary":"clear fall evening husband and I saw a craft almost on the lot across the road. We had the windows open and drove very slowly next to it watching it until it ascended out of sight.","Weather Factors":"Unknown","Latitude":"29.860821","Country":"United States","Log Number":"US-04022013-0006","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Date of the Event":"10/04/1985 12:00 UTC","trends":["There has been one other sighting in Harvey","There were no other sightings in Harvey on or around October 4th 1985"],"Viewing Distance":"21-100 Feet","divs":["Sighting DetailsA few blocks from home going to the grocery about 9pm on a Sunday we came to the cross street and stopped. There was no other traffic out (not unusual)so when we saw this dark object hovering over the vacant land in front to the right of us, we asked each other to identify it and my husband turned on the road to the right (which is where we intended to go anyway) and very slowly drove up to the side of the vacant lot. We watched it through the front windshield until we were passing next to it and watched it through the side driver window all the while noting that there was no sound or lights. It was a blackish gray metal looking disk that had some texture or attached coverings like ridges. It seem like the grass moved slightly, but it was not more than maybe a good evening breeze would have done. At the time, we were alarmed, but more curious than scared. I was excited and wanted to find out what it was or if anyone else had seen it. After it started moving straight up it then veered slightly to the east continuing upward and it must have started moving very fast because it went out of sight rather quickly once it go so high. To estimate the size of the craft, the land it was hovering over was a vacant commercial lot, so in perspective, it was easy to estimate it had to be about 100 feet in diameter (at least). It was actually so dull and dark it was like looking at a metal aircraft with gray black primer paint which caused detail on it hard to see but easy to see the shape contrast against the sky. It didn't appear to have any lights on or in it. We were only a few hundred feet from the grocery parking lot and went in and parked. My husband stayed in the car and I hurried inside and just stood looking quickly around to see if anyone looked like they had seen it too. No one (but me) seemed to be acting unusual so we hurried home to wait for the 10pm news to see if any reports would be on. There was nothing in the media at all and we didn't know who to report it too without being called crazy, so we didn't talk about it at all. We live a few miles away from a navy base and the airfield is very active, but since my husband was a navy flight engineer on an aircraft carrier, I think we would have had some idea what aircraft it could have been. We had no sensible answer to describe what we witnessed that night but we both are certain that we saw something very real!"],"Region":"Louisiana","City":"Harvey","Longitude":"-90.045526","Object Shape":"Disc, Oval","Disposition":"Unresolved","Source":"MUFON","Sighting Duration":"Undisclosed","Date Submitted":"04/02/2013 02:52 UTC","Object Features":"Dome, Patterned Surface"}