{"Case Number":"46550","trends":["There have been 3 other sightings in Meadville","There were no other sightings in Meadville on or around October 20th 1984"],"City":"Meadville","Object Flight Path":"Path then hovering","Date of the Event":"10/20/1984 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.625552,+-80.157389(46550)&iwloc=A&hl=en\"> mufon case (46550) map </A>","Longitude":"-80.157389","Source":"MUFON","Object Features":"Unknown","Log Number":"US-04022013-0013","Region":"Pennsylvania","Object Shape":"Boomerang","Latitude":"41.625552","divs":["Sighting DetailsI was watching a show yesterday about a women from bucks county that saw a swarm of blinking light and it sounded a lot like what I saw, this happened over 28 years ago, and at the time when I mentioned it to anyone they thought I was crazy so I never mentioned it again, Ive told my husband and kid the story and got the same reaction, last night I told them thats the same thing I saw. this is my story.....I was with some friends coming back from visiting another friend at in Greenville pa. nothing special she just started college there and we went to see her and we were coming back route 18 then when we got on route 322 just out side of Conneaut Lake about 3:00am, I was in the back seat, just staring out the window when I notice lights, it looked like a big check mark, I looked at the speedometer to make sure my friend wasn't speeding thinking it was a police helicopter, but it didn't look like a helicopter, I now hear it described as boomerang, thats the best I can call it, I asked my friends if they where seeing it and they said, yes what is it, I tried to make out an exact shape but it was just to dark, it seemed to be tracking us off to our left just above the trees, all the way from Conneaut Lake heading east when we got almost to route 19 it shot straight ahead really fast then stopped and hovered over the mall we slowed down to see if we could see the shape better, we still couldn't tell, as we got almost to the mall it shot really fast across in front of us and stopped and hovered over a church, ,there is a stop light in front of the mall and it was red we stopped and just watch this thing, no more than 50yards away, and I'm not sure if it landed or what, but all of a sudden there was a swarm of thousands of bright blinking lights, I'd never seen anything like it in my life and I wanted my friends to pull over so we could watch it for awhile to see what it was, but they said no way and just kept driving, I turned around in the seat and watched it as long as I could see it, I was so excited, I think we just saw a UFO, I told my friends. I told other people about it thinking they would think it pretty cool but all I got was laughed at and teased so I never mentioned it again, to this day I can't even remember the friends I was with,but I remember the thing I saw and it was just like what that lady in bucks county saw, a swarm of thousands of bright blinking lights, it was over 28 years ago I'm 48 years old now and the time and date may be off a bit and I've never seen anything like it sense, but I did see it, and I keep watching thinking maybe I'll see it again someday. I'm reluctant now to even mention what I saw, because of the reaction a got then and even now, so please do not mention my name, but I thought you should know that the swarm of bright blinking lights, it happened back in the 80's too."],"Summary":"tracked us for sometime, off to our left, shot ahead fast,hovered over a mall,then shot across our path to the left,i don't remember it landing,I just remember a swarm of thousands of bright blinking lights,beside a church, we just kept driving.","Disposition":"Unresolved","Tags":"City","files":["/var/www/straped/mufon/html2text/46550.html.txt","/var/www/straped/mufon/org/46550.html"],"Date Submitted":"04/02/2013 11:31 UTC","Viewing Distance":"21-100 Feet","Sighting Duration":"Undisclosed","Country":"United States","Weather Factors":"Unknown"}