{"Country":"United States","Source":"MUFON","Latitude":"43.810556","map":"<A HREF = \"http://maps.google.com/maps?q=43.810556,+-70.416944(4655)&iwloc=A&hl=en\"> mufon case (4655) map </A>","divs":["Sighting DetailsHello: I went out to walk my cocker spaniel Cody around the block, as I do most every night. It was very dark and clear that night, and I could see many stars. As I was walking down my street, I noticed a very bright orange, or orange yellow object low in the sky almost due East. I've always been very interested in Astronomy, and have been an amatuer Astronomer since I was a young boy, so the object looked unusual to me. At first I wondered if it could be the planet Jupiter or Venus, which are often bright, but this object was too bright for that and the wrong color, and it was in the wrong part of the sky. It also appeared to be drifting very slowly. I would estimate that it was quite a distance away - to me it looked like a very bright orange star. It also shown with a very steady light - it didn't twinkle or flicker like most stars do. I watched it in amazement for a couple of minutes but then continued on my walk around the block. When I got back to my home, I searched the sky for it again but it was gone completely. Thinking that I may have lost it behind a tree or something (because it was rather low in the sky to start with), I kept looking, but never saw it again. When I was watching the object, I wondered if it could be a plane, but I doubt that. I saw no strobe lights or heard any noise whatsoever from it. The thing that rather held me spellbound about it was the brightness and the orange color. I put the sighting out of my mind for a few days, but never forgot about it. After about a week I decided that I should report it to you. I thought it was too unusual to just ignore. I am a computer programmer by profession, and consider myself to be rational and detail oriented, and not given to flights of fancy."],"Disposition":"IFO","files":["/var/www/straped/mufon/html2text/4655.html.txt","/var/www/straped/mufon/org/4655.html"],"Object Flight Path":"Hovering then path","Region":"Maine","City":"Windham","Tags":"City","Weather Factors":"Unknown","trends":["There has been one other sighting in Windham","There were no other sightings in Windham on or around March 30th 2006"],"Object Shape":"Star-like","Date Submitted":"03/30/2006 09:00 UTC","Object Features":"Unknown","Viewing Distance":"Over One Mile","Longitude":"-70.416944","Case Number":"4655","Summary":"Bright, orange yellow starlike object, drifting slowly in the sky for several minutes, then disappearing.","Date of the Event":"03/30/2006 09:00 UTC","Log Number":"US-04062006-0002","Sighting Duration":"00:05:00"}