{"divs":["Sighting DetailsHello Recently I saw something unexplainable, On March 24th at approx. 8:30pm I was in Waldorf, Maryland driving on Mattawoman-Beantown Rd in moderate snowfall, when I saw lights that appeared to be a small plane landing with its landing lights and I saw a red blinking light, although I thought I was weird because there is no airport near there, as I drove further up the road I noticed that it was hovering and not flying, I thought surely its a helicopter and I must have mistook the search light for landing lights. As we drove under the object, I could clearly see a Black Triangle with three red lights on the bottom that alternated flashing in a clockwise motion, no two light were on simultaneously, also there was a light at each corner that resembled a car's headlights but searching in a sweeping motion. I exclaimed WHAT IS THAT! My 13yo son stopped playing his tablet and looked at the object and said \"Wow that is weird\"...As we drove down the street the object stay perfectly still until we drove out of view. My girlfriend who was driving could not see the object as it was above the passenger side of the vehicle...she asked if I wanted to turn around and go back but my fear of being spotted trumped my curiosity.....After seeing it I drew a picture of it which I can email to you as we'll as a map diagram where this took place. On March 30th the object was spotted again approx. 11-1130pm in Waldorf Maryland less than 2 miles from the first sighting....This time the object flew overhead near the house off a friend of mine. I was not witness to the second event, but my friend that lives there witnessed the craft with two others. I've known this man since 5th grade and I'm a 31 yo man and he doesn't pull pranks or lie about these types of things nor would I..... Thank You"],"Date Submitted":"04/02/2013 09:22 UTC","Source":"MUFON","Latitude":"38.635673","Case Number":"46556","City":"Waldorf","Object Flight Path":"Stationary","Region":"Maryland","files":["/var/www/straped/mufon/html2text/46556.html.txt","/var/www/straped/mufon/org/46556.html"],"Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Date of the Event":"03/25/2013 08:30 UTC","Country":"United States","Weather Factors":"Unknown","trends":["There have been 3 other sightings in Waldorf","There were no other sightings in Waldorf on or around March 25th 2013"],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=38.635673,+-76.873847(46556)&iwloc=A&hl=en\"> mufon case (46556) map </A>","Longitude":"-76.873847","Log Number":"US-04022013-0019","Tags":"City","Object Shape":"Triangle","Object Features":"None","Summary":"Hovering Black Triangle in a Snow Storm - Mar. 25 2013"}