{"Latitude":"32.77837","divs":["Sighting DetailsI had just left my apartment in Dallas, Texas about 8:30 pm Monday, April 1st, 2013. I turned right out of my apartment complex on to Beckley Avenue heading north, and then I took an immediate left turn on to Greenbriar heading west towards Kessler Parkway when an aircraft flew out of the trees heading south. I knew it was not a helicopter. My mind tried to make sense of the shape and the white lights. I knew it was not an airplane. I thought it might be a blimp, but blimps do not refect white light. It was already dark outside and to my knowledge blimps do not fly at night. At first, the object looked like I was looking down into the bottom of a boat, but boats do not fly. I concluded that what I was looking at was a aircraft--a UFO if you will. It flew out of the trees moving south, stopped, hovered briefly between the trees, tilted slightly towards me, and descended. This all took place within 10-15 seconds. When it tilted and began to descend, I thought I saw a grey surface with a dome on top, but it was already in the top of the trees, and I could no longer see clearly. I was frustrated: I wanted to see more because I wanted to know what I was seeing. While I was looking at it dead on, before it tilted and descended, I noticed what I thought were panels or sectioned windows that formed a strip across the aircraft. The sections were difficult to make out. My friend was on his motorcycle in front of me while I was following behind him: I wanted to scream and honk my horn so that he would look up, but I knew that he wouldn't hear me over the engine of the motorcycle. I wanted to call him on the phone, but he wouldn't answer and there wasn't enough time because everything happened so fast. I thought about turning around in order to put some distance between myself and the trees the aircraft had just disappeared behind, but I knew that I wouldn't be able to see more because it had already descended. I didn't know what to do. I wanted to call the police so I did. I called 911 and spoke to a woman. I told her that I had just seen a UFO aircraft. She asked me where I was. (I am terrible at directions, new to the Dallas area, and I was slightly rattled.) I told her that I was traveling west on Greenbriar heading towards Kessler Parkway--that I was now passing threw the intersection of Kessler Parkway and Sylvan, just south of I-30, going to my friend's condo. I told her, \"I am not nuts. I am a school teacher.\" I was overwhelmed and a little shook when I arrived at my friend's condo, and a little scared. I wanted to know where it landed because the area where it descended appeared to be a neighborhood. There was no place for something that large to land. I met my friend at the gate of his condo where he approached my window to ask me a question, and I told him that I had just called the police to report that I had just seen a UFO aircraft. What I saw was not bouncing white lights, nor was it a white, oval shaped object jetting around from one place to another in the sky. What I saw was an aircraft of some kind. It appeared quite large. There was a plane in the southwestern sky in the distance with a red light. Judging from the plane in the distance and the trees the aircraft hovered between, the aircraft seemed quite large. I have no idea how large. It is very difficult to process something like this when something like this happens. Again, I was overwhelmed and scared when I arrived at my friend's condo: I did not want to be left alone outside while I unloaded my car at my friend's condo. I kept looking through the trees in the direction of Steven's Golf Course waiting for the aircraft to ascend. (I told several teacher friends the next morning when I arrived on campus. I don't care what they think: I know what I saw. Whatever it was I have never seen anything like it. I have never seen an aircraft descend straight down like that.) My friend and I drove back to my apartment so I could show him where I saw it. We drove around in the area where I thought it went down, but there are homes there, and no place for such a thing to land. I asked my friend if it could have landed at Stevens Golf Course, but he said the area I was pointing to was west of Stevens. I went home to my friend's condo, and I kept asking him what I should do. I wanted to call my brother-in-law who is an air traffic controller at Michum Airport, but it was too late. I wanted to call someone at Bell Helicopter, or UTA, or the News, or call the police back. I watched the 9:00 news and the 10:00 o'clock news hoping someone had called in and reported seeing what I had seen. Mostly, I just wanted to know if anyone saw what I saw around 8:30 pm on April 1st, 2013. Please let me know if someone else reported seeing something that resembles what I am reporting."],"map":"<A HREF = \"http://maps.google.com/maps?q=32.77837,+-96.843245(46564)&iwloc=A&hl=en\"> mufon case (46564) map </A>","City":"Dallas","files":["/var/www/straped/mufon/html2text/46564.html.txt","/var/www/straped/mufon/org/46564.html"],"Disposition":"Unresolved","Case Number":"46564","Weather Factors":"Unknown","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Object Features":"Window(s)","Country":"United States","Log Number":"US-04032013-0003","Date of the Event":"04/01/2013 08:30 UTC","Object Shape":"Blimp, Circle, Disc, Oval","Summary":"White blimp shape appeared out of the trees flying south, hovered, tilted toward me and descended straight down","Longitude":"-96.843245","Tags":"City","Sighting Duration":"00:00:15","Date Submitted":"04/03/2013 02:07 UTC","Region":"Texas","trends":["There have been 116 other sightings in Dallas","There were no other sightings in Dallas on or around April 1st 2013"]}