{"Sighting Duration":"Undisclosed","Latitude":"26.980101","trends":["There have been 11 other sightings in Port Charlotte","There were no other sightings in Port Charlotte on or around April 2nd 2013"],"Longitude":"-82.084645","Viewing Distance":"Over One Mile","divs":["Sighting DetailsMy friend and I were headed south on the highway and it was a very warm beautiful day. So I looked up in the sky and saw one jet flying with a long tail of exhaust behind it. About one mile left of the plane in the sky I could see what appeared to be four flying objects flying so fast that they were moving out of sight second by second. As I looked hard, I could see no wings! They were dark grey so I thought they were maybe fighter jets but they had no wings and there was no sound. So I pointed to my friend and told him to look up and tell me what he thought they were and he almost stopped in the highway. It caught him by shock too, so I felt so good I was not alone seeing this. The 4 objects then shifted positions as flying fast and were flying so close to one another they should have crashed and at one point they all looked as if they all piled up together to form one object and then flew apart again. They then flew even faster and out of sight. I was thinking how can anything withstand the pressure of that flying force and how were they flying with no wings? I am stumped. They flew out of sight as they went south and over water towards this large river area. There were mist like clouds they approached which made them appear harder to see as they flew out of sight as well."],"Object Flight Path":"Straight-line path,Path with directional change","Tags":"City","Object Features":"Dome","Country":"United States","Date of the Event":"04/02/2013 03:28 UTC","Object Shape":"Cigar, Oval","Date Submitted":"04/03/2013 03:01 UTC","files":["/var/www/straped/mufon/html2text/46567.html.txt","/var/www/straped/mufon/org/46567.html"],"Source":"MUFON","Log Number":"US-04032013-0006","Region":"Florida","Disposition":"Unresolved","Weather Factors":"Unknown","Case Number":"46567","City":"Port Charlotte","Summary":"4 long oval in shape objects were flying fast similar to 4 fighter jests, except there were no wings. The missing wings is what stunned me!","map":"<A HREF = \"http://maps.google.com/maps?q=26.980101,+-82.084645(46567)&iwloc=A&hl=en\"> mufon case (46567) map </A>"}