{"Viewing Distance":"Unknown","Weather Factors":"Unknown","Source":"MUFON","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=48.643456,+-96.910108(4656)&iwloc=A&hl=en\"> mufon case (4656) map </A>","Latitude":"48.643456","divs":["Sighting DetailsAt about 10'clock on the evening of 13 August 2003, I went outside on the back deck to have a smoke before I went to bed. I gazed up at the night sky to see how many planes and satellites I could see and count before I retired to bed. I just happened to look at an area of the southwestern night sky that was almost devoid of stars when a star-like light suddenly appeared from out of the blackness, grew with the intensity of an automobile's headlamps on high-beam at about a quarter mile away,then faded back out to nothingness without moving. It was as if the \"light\" was being operated by a \"dimmer-switch\", and lasted only 5 seconds or so from dim \"on\" to dim \"off\", bright white-white in color. The light got so bright that I remember I shielded my eyes and recoiled back thinking the light was shinning at me or coming right at me, much to my embarrassment later. Then, approximately 3 seconds later, I observed a very faint meteor streaking out of the northern sky and disappearing in the area of the southwestern sky , midway up, where the light had just disappeared. I put my binoculars on the spot where the light disappeared and saw nothing but blackness. At first I thought I had just witnessed a supernova, but thought otherwise because the event only lasted afew seconds. Then I got this feeling that maybe this \"light\" was not that far away, possibly in orbit or closer, and that the \"meteor\" was some kind of defense system, and the hair on the back of my neck stood up. Afterwards, I went inside and told both my mother and my brother what I had just witnessed outside. The next day at work I heard on the radio that the eastern US was experiencing a massive power outage and I couldn't help but wonder if what I saw the previous night had anything to do with it. Since that event, I've been somewhat hesitant to continue looking at the night sky because I cannot satisfactorily explain to myself what the heck it was that I witnessed that night."],"Region":"Minnesota","Case Number":"4656","Sighting Duration":"00:00:08","files":["/var/www/straped/mufon/html2text/4656.html.txt","/var/www/straped/mufon/org/4656.html"],"Disposition":"IFO","trends":["There have been no other sightings in Kennedy","This sighting has never been favorited."],"Longitude":"-96.910108","City":"Kennedy","Object Flight Path":"Stationary","Date of the Event":"08/13/2003 10:17 UTC","Date Submitted":"08/13/2003 10:17 UTC","Tags":"City","Object Features":"None","Object Shape":"Star-like","Summary":"star-like light in night sky came on, grow in intensity, then dimmed out completely, followed by very faint meteor streak from the north to where light dimmed out.","Log Number":"US-04072006-0001"}