{"Object Flight Path":"Straight-line path","trends":["There have been 2 other sightings in Richmond","There were no other sightings in Richmond on or around July 15th 2012"],"Log Number":"US-04032013-0005","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Latitude":"39.283496","Case Number":"46566","divs":["Sighting DetailsIm not sure that what I have seen was a ufo, but it is odd. Several times in a month craft will fly over town around 2am. These craft have a low rubble or roaring sound. Normally there are 1 to 3 craft and when greater numbers seem to fly in a line. The lights on them seem to flash in a pattern oddly match on all craft when more than one. They fly low in the sky far lower than comercial aircraft in the area and appear though to be about a jet sized craft. They always fly out of the sw and towards the ne. Now these may be some sort of niltary craft but are flying very low. An odd thing that is worth mentioning is that at least once a month following the same general fight direction, mulitple unmarked, dark grey to black helicopters fly over the area. These flights take place during the day and are extremely low as if searching for something. Im not one to jump to conclusions but these events have been happening for years now and to put it plainly are just odd. Your opinion would be appreciated."],"Region":"Missouri","City":"Richmond","files":["/var/www/straped/mufon/html2text/46566.html.txt","/var/www/straped/mufon/org/46566.html"],"Date of the Event":"07/15/2012 12:00 UTC","Tags":"City","Sighting Duration":"Undisclosed","Object Shape":"Other, Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.283496,+-93.964968(46566)&iwloc=A&hl=en\"> mufon case (46566) map </A>","Object Features":"Unknown","Longitude":"-93.964968","Summary":"The craft tends to fly overhead low in the sky around 2am from sw to ne seems to happen several times in a month","Date Submitted":"04/03/2013 02:53 UTC","Disposition":"Unresolved","Country":"United States"}