{"Log Number":"US-04032013-0017","Region":"Texas","trends":["There have been no other sightings in Socorro","This sighting has never been favorited."],"Country":"United States","Summary":"Witnessed what I believe to a Nova event, not a typical UFO sighting","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=31.658604,+-106.281037(46578)&iwloc=A&hl=en\"> mufon case (46578) map </A>","Date of the Event":"04/02/2013 11:14 UTC","Object Shape":"Circle, Flash, Sphere, Star-like","City":"Socorro","Tags":"City","Date Submitted":"04/03/2013 07:57 UTC","Disposition":"Unresolved","Object Features":"None","Object Flight Path":"Stationary","Source":"MUFON","Case Number":"46578","divs":["sighting detailsi was sitting in my fathers' backyard looking n\\nw at the big dipper and polaris, when all of a sudden there was a bright flareup approx 10 deg w and 5 deg above polaris (north star). it lasted approx 2-3 seconds but appeared to last much longer. first it started as a small ignition, as lighting a flare, and ended with a luminous flare up before it dissipated. like a tiny sun. this was not a flare as the position was fixed, no movement at all except for the burst of light. having been in the military, i'm very familiar how flares react in the sky. it's been windy here and dusty to boot so the light\\illumination was obscured by dust particles i imagine and therefore was yellowish to orange in color. this was not a moving object. i would classify this as an astronomical event and was very excited to witness whatever this event was, possibly a novae. as a stargazer since my teens, i've witnessed many strange lights in the sky but nothing ever like this. i don't believe i will ever witness anything like this in my life again and have searched the internet to find an appropriate institution to report this to but could only find mufon to be the most reliable source to do so. i am hoping that you can forward this to the proper entity as i feel there has to be some recording of this event to confirm what i witnessed. was truly spectacular and amazing. there are no hills\\mountains in the distance so it could not be far off headlights at least not for the size of the illumination that i witnessed. after the illumination ended, i waited another 30 minutes staring at the spot where it ignited to see if it would repeat and nothing. i'm very fortunate to have witnessed this i believe. thank you for this site and an opportunity to log my observation."],"Viewing Distance":"Over One Mile","Latitude":"31.658604","files":["/var/www/straped/mufon/html2text/46578.html.txt","/var/www/straped/mufon/org/46578.html"],"Longitude":"-106.281037"}