{"divs":["sighting detailsmy grandmother related this personal story to my mother while they were seated around the dining room table in about 1976. my sister & i were in the living room and listened to the conversation as she related it to my mom. she said that in the early 1950's when my mother was in school and her husband was at work in st. louis, she was outside hanging laundry on the clothes line. she then related that 4 or 5 \"little gray men\", came down the hill toward her in the back yard. she was frightened and ran into the house and locked the door. she then said that they came through the walls and got her. at this point my mother told her to shut up; that people would think that she was crazy and not to ever mention it again. she didn't. after my grandmother died in 1989, my mother burned her diaries. winfield, missouri was a very rural area in the early 1950's and before many ufo sightings were prevelent. my sister & i never talked about this event until after my grandmother's death, but wanted to share it for all that it is worth. my grandmother would have been about 40 years of age at the time of the \"incident\". this was on the old portwood road, (now hammett road), 1\\2 mile off of hwy. 47, between troy and winfield."],"Disposition":"Unresolved","Weather Factors":"Unknown","Tags":"City","City":"Winfield","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.000562,+-90.734368(46572)&iwloc=A&hl=en\"> mufon case (46572) map </A>","Latitude":"39.000562","Object Shape":"Unknown","Log Number":"US-04032013-0010","Sighting Duration":"Undisclosed","Object Flight Path":"N/A","Summary":"As told by my Grandmother at dining room table around 1976.","Date of the Event":"06/20/1951 12:00 UTC","Viewing Distance":"20 Feet or Less","Date Submitted":"04/03/2013 01:01 UTC","Region":"Missouri","trends":["There has been one other sighting in Winfield","There were no other sightings in Winfield on or around June 20th 1951"],"Country":"United States","files":["/var/www/straped/mufon/html2text/46572.html.txt","/var/www/straped/mufon/org/46572.html"],"Source":"MUFON","Case Number":"46572","Longitude":"-90.734368"}