{"Longitude":"-89.391898","Weather Factors":"Unknown","Log Number":"US-04042013-0007","Summary":"Large transparent object traveling at high rate of speed","map":"<A HREF = \"http://maps.google.com/maps?q=40.634735,+-89.391898(46588)&iwloc=A&hl=en\"> mufon case (46588) map </A>","Region":"Illinois","divs":["Sighting DetailsI was standing on my deck, smoking a cigarette and just happened to look up in the direction of the craft. The time was approximately 10 PM. This is the 3rd time I have seen this type of object. I did not report the first 2 because I assumed people would think I was crazy, stupid or both. The particulars of this sighting follow: *) The object is chevron shaped, V shaped, as far as I can tell. *) The object also appears to be transparent. The only way I could really see it is as a result of its motion. It had an appearance like the bottom of a glass jar while moving across the sky. *) The object appeared to be traveling at a very high rate of speed. There was a plane, flying roughly perpendicular, at a higher altitude which allowed me some kind of baseline for speed. In relation to that plane, this object appeared to be traveling at least twice as fast across the sky. *) The object appeared to be very large. Even though the distance between the object and I was significant and the object was hard to see due to its transparency. I had the feeling that it was very large. *) The object flew in a straight line. *) I was very scared. Almost irrationally scared. I remember purposefully thinking about not peeing my pants. I still am perplexed by this reaction. I am not a person prone to easy scares. *) Strangely, I do not seem to be aware of \"losing the object\". It just seemed to either stop moving, causing me to stop seeing its motion, or it just disappeared. I did not see it fly to the horizon. I tried to reacquire the object but I could see no other motion."],"Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Source":"MUFON","Object Shape":"Chevron","Tags":"City","Date Submitted":"04/04/2013 12:33 UTC","City":"Undisclosed","files":["/var/www/straped/mufon/html2text/46588.html.txt","/var/www/straped/mufon/org/46588.html"],"Latitude":"40.634735","Case Number":"46588","trends":[],"Country":"United States","Object Flight Path":"Straight-line path,Path with directional change","Object Features":"Unknown","Disposition":"Unresolved","Date of the Event":"04/03/2013 12:00 UTC"}