{"Disposition":"Unresolved","Sighting Duration":"Undisclosed","City":"Brentwood","Tags":"City","Object Shape":"Sphere","divs":["sighting detailsi went outside on 3\\23 to take out the trash and noticed two orange orbs in the north sky at roofline horizon. i observed them moving together south a bit for about ten minutes, then they hovered nearly directly overhead for about ten minutes, then went quickly to the east horizon, moving together, alternating from a narrow to much wider gap between them. they moved together in an esterly direction, when i lost track of them. the whole sighting lasted about twenty-five minutes. i first assumed they were planes or helicopters, but then noticed there were no flashing red, white or green lights, or noise -- and as they came directly overhead, i realized they were not anything i had seen before. i was cautious and uncomfortable and hid behind my car to stay out of the light and to avoid their notice. i'm still trying to figure out what it was. they didn't act like anything i had ever seen before. initially, i wasn't going to report this sighting, except that a friend told me a couple days later that she saw a report in fairfield, ca, a neighgoring town, that someone there also saw ten or more orange orbs (with video) on another ufo internet site."],"Object Flight Path":"Path with directional change,Path then hovering","Log Number":"US-04042013-0001","Region":"California","Object Features":"Unknown","Latitude":"37.931618","Summary":"two organge orbs from North... hovered, moving together, opening some distance, rejoined and moved quickly to east and separated by quite a distance.","Date Submitted":"04/04/2013 12:26 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.931618,+-121.637254(46582)&iwloc=A&hl=en\"> mufon case (46582) map </A>","Longitude":"-121.637254","trends":["There have been 5 other sightings in Brentwood","There were no other sightings in Brentwood on or around March 23rd 2013"],"Date of the Event":"03/23/2013 11:35 UTC","Country":"United States","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Case Number":"46582","Source":"MUFON","files":["/var/www/straped/mufon/html2text/46582.html.txt","/var/www/straped/mufon/org/46582.html"]}