{"Viewing Distance":"101-500 Feet","Log Number":"US-04032013-0018","Object Shape":"Triangle","Date Submitted":"04/03/2013 10:47 UTC","Disposition":"Unresolved","City":"Rochester hills","trends":["There have been 10 other sightings in Rochester hills","There was one other sighting in Rochester hills on or around September 15th 1994"],"Date of the Event":"09/15/1994 06:00 UTC","Latitude":"42.710548","Source":"MUFON","Object Features":"Patterned Surface","files":["/var/www/straped/mufon/html2text/46580.html.txt","/var/www/straped/mufon/org/46580.html"],"Longitude":"-83.127014","Region":"Michigan","Sighting Duration":"Undisclosed","Summary":"It was a huge Triangle as big as a football feild or bigger,dark color with a light at each corner.","Tags":"City","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=42.710548,+-83.127014(46580)&iwloc=A&hl=en\"> mufon case (46580) map </A>","Case Number":"46580","Country":"United States","divs":["Sighting DetailsMy wife and I were headed home with are 2 daughter's,wife was pregant with our third.We were going south on rochester road coming from lakeville,as I drove soth I looked out the windsheild too the southwest. I seen a bright light like a airplane headed toward's us in a northeartern direction.I was teasing my wife that it was a UFO,she said that there is no such thing.The object was getting closer and closer and I knew it was no airplane.As the UFO approach us I looked out my windsheild and drove right under the UFO.It covered the whole sky looking throught the windsheild,at that time my whole tingle from head to toe,like when your foot falls asleep.As I drove out from underneith it the feeling quit. I pulled right onto a dirt road and got out and watch this triangle UFO just glide off to the northeast.There was no noise at all none.There were about 15 other cars stop and pulled over watch this.My wife is very religious and this is hard for her too talk about,she think's everyone think's your crazy.I seen detail on this UFO a light at each corner.Just like the ones on TV.I know That other's have seen this I was there I need to talk too someone about this sometime.The next morning my wife called her mother and told her you will not beleive this ,but we seen a UFO last night.Then her mother said that there were UFO sighting's in ST.clair shores last night,report on the news. The feeling of my whole body tingling from head to toe I will never ever forget."],"Weather Factors":"Unknown"}