{"Tags":"City","Longitude":"-79.898668","trends":["There have been no other sightings in Point Marion","This sighting has never been favorited."],"Object Shape":"Unknown","Log Number":"US-04042013-0003","files":["/var/www/straped/mufon/html2text/46584.html.txt","/var/www/straped/mufon/org/46584.html"],"Summary":"White rectagular Object just aboved the field","Country":"United States","Disposition":"Unresolved","Region":"Pennsylvania","Source":"MUFON","Viewing Distance":"21-100 Feet","divs":["Sighting DetailsBehind the house I could see it in the dark it looked white At the time I had no idea what I was looking at. I was only 7 years old at the time. I had never heard of a UFO before It looked like a rectangle standing on end top leaning forward a little then the top and bottom came together then it was gone. It was over the field just a past the house I could see the tree line under it and part of the sky. I just stood there wondering what it was I may been a little afraid I felt my hair bristle and a chill went up my back. It just vanished. I had two sitings that was inside the house one each of two different houses in the first house was same one that I saw the UFO at. What I saw was a white Human Like Apparition in my bed room Standing at the foot of my bed I was very afraid of it. I moved my feet up turned on my side and covered my head up only my noes and mouth was uncovered I was only 10 or 11 years old at the time. The next house was about one mile from the first one I was about 14 years old then and the same thing took place there and I did the same thing as I did in the first house."],"Case Number":"46584","Object Flight Path":"Stationary","Date Submitted":"04/04/2013 03:42 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.738967,+-79.898668(46584)&iwloc=A&hl=en\"> mufon case (46584) map </A>","Latitude":"39.738967","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","City":"Point Marion","Date of the Event":"07/15/1951 12:00 UTC","Object Features":"Unknown"}