{"Object Shape":"Star-like","Viewing Distance":"Unknown","City":"Tucson","Latitude":"32.257004","Date Submitted":"04/03/2013 11:57 UTC","Longitude":"-110.870248","Object Flight Path":"Path with directional change,Path then hovering","Date of the Event":"04/03/2013 08:00 UTC","Log Number":"US-04032013-0018","files":["/var/www/straped/mufon/html2text/46581.html.txt","/var/www/straped/mufon/org/46581.html"],"Summary":"Mistook for a satellite, changed direction abrubtly","Region":"Arizona","Case Number":"46581","Source":"MUFON","divs":["Sighting DetailsTucson, AZ. I was taking the trash out at 8pm when I looked up in the sky and saw what I believed to be a satellite in the NW sky near the constellation Cassiopeia. I paused to view the satellite when it suddenly changed direction at high speed, then backtracked AGAIN at high speed. I attempted to take video with my iPhone but it was too dark. Approx 2 min after watching the 1st object, a 2nd object of exact size & shape joined it, also moving at sporadic directions and speeds. Sometimes hovering for several seconds, sometimes streaking across the NW quadrant of the sky but never leaving the area around Cassiopeia. The lights appeared to interact, almost dance with one another. It was overwhelming. I had never seen anything like this. There is a park in the direction of my sighting with illuminated field lights, so I tried to dismiss the lights as perhaps bats, or even high-altitude kites being illuminated by the field lights but once I called my sister (approx 5 miles away) who witnessed the same thing, I realized these had nothing to do with park-related activities. I did not lose sight of the object, but chose to come inside and report this immediately while it was stil fresh in my memory. As of 845 pm nobody else in the local area had reported this incident."],"Disposition":"Unresolved","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around April 3rd 2013"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=32.257004,+-110.870248(46581)&iwloc=A&hl=en\"> mufon case (46581) map </A>","Weather Factors":"Unknown","Object Features":"None","Tags":"City","Country":"United States"}