{"Object Shape":"Cigar, Cone, Chevron, Circle, Cross, Cylinder, Diamond, Disc, Egg, Fireball, Flash, Oval, Sphere, Star-like, Teardrop, Triangle","Case Number":"46599","Latitude":"47.011776","Sighting Duration":"Undisclosed","trends":["There have been 7 other sightings in Tumwater","There were no other sightings in Tumwater on or around March 15th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=47.011776,+-122.907953(46599)&iwloc=A&hl=en\"> mufon case (46599) map </A>","Country":"United States","Summary":"object appeared 3 blocks from me hovering above the road. while observing a driver approached the rear, appeared hypnotized","Region":"Washington","Log Number":"US-04052013-0003","Disposition":"Unresolved","Viewing Distance":"21-100 Feet","Date Submitted":"04/05/2013 02:02 UTC","City":"Tumwater","Date of the Event":"03/15/2011 07:30 UTC","Longitude":"-122.907953","files":["/var/www/straped/mufon/html2text/46599.html.txt","/var/www/straped/mufon/org/46599.html"],"Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","Source":"MUFON","Object Features":"Other","Weather Factors":"Unknown","divs":["sighting detailswhile returning from an evening walk at about 7:30 pm in mid march 2011, not long after the nuclear disaster in japan. as i rounded a corner off of elm st. i looked back down that street to suddenly see appear a star bright object, mercury vapor bright in color. burning bright and wavering, throwing out almost tangible color. i found myself back in the street i had just left, not knowing how long or how i had come back into the road i had just left. the object is brilliant now and is changing colors like a slide show backlit by lasers. it is beautiful. i can't make out a definite shape. it seems to be changing shapes with the colors it throws into the environment. the light has substance. i can feel it as it strobes and changes intensities. then, in my head i feel, not so much a voice as an overwhelming impression. it is here for me and it says so. it is performing these light and shape changes for my enjoyment while it,,,,gets ready to get me. i suddenly have the feeling something is behind me. there in the road behind me is a car, with a man at the wheel. gripping the steering wheel with both hands. he is just staring. i can see the flashes of light reflecting off his face and the windshield. i look back at the object above the road and it is now about half again as close as it was. just like that, it has come that much closer, and the odd thing is that it's aspect has not changed. i didn't realize it was so large. it continues to flash outlandish colors and is now putting on a full blown show of shape changes that defy a machine description. what is this? now i turn and the car is in the drive way of the house i've been standing in front of. the man is out leaning over the top of the car, he's tall and still just staring. i approach him and he is stiff as a board. when i look back to the object it is again half again closer to us. i feel the object as it goes on with the colors and shape changes. it is unbelievably beautiful. it beckons, calls to my head with something i understand. it wanted to take me on a journey, but now? i look at the man and he is paralyzed stiff. i wonder at his condition and am half turned to him and the object. pointing i yell out do you see that? he makes nothing. nothing. glazed over, staring. i reach out and take his head in my hands and point his head right at the object. and he just about falls over going relaxed on me! then he just looks right at me and says deadpan, yah, i see it. i've always seen it. at that moment i realize he has been literally scared stiff or completely terrified! and now as i look back from the reflections of brilliance in his eyes, the object\\entity is in the trees next door and i now realize it is really big there. and it is beyond descriptions now. changing into a ring there in the trees above us. i get an overwhelming \"communication\" that says we are going now and they can't stop for me with the other guy there. i yelled out to him they're going and grabbed his arm, running up under this object that has now become a burning silver ring above us. the ring is hissing now. the only sound it's made is this hissing right now. i feel it more than hear it. it is now a brilliant deep orange ring above the trees. the center has become the deepest violet\\black with red shocks streaming from top to bottom as the ring is standing on end in the trees not laying down flat. it is alive i feel. i'm not certain what it is, but it seems to be a life of some kind. and now it is going. it is gone. appears to be gone, over the horizon while still there in the trees for some odd reason. the man says how far do you think it is? and i say a long way. and the there is a clap, a boom and it is good and really gone. the man looked at me and just says, do you think we should report this? i tried to report it, but that didn't go so well, so i just said to hell with it. tried to report it to davenport at reporting center, but that didn't go well. it was too complex to get over to him i guess. at least in the format they used then. i haven't reported since trying then."],"Tags":"City"}