{"Region":"California","Latitude":"34.073731","Date Submitted":"04/05/2013 01:22 UTC","Viewing Distance":"20 Feet or Less","Sighting Duration":"Undisclosed","Summary":"it was an entity,diquised as a human being.","Tags":"City","Case Number":"46598","Log Number":"US-04052013-0002","Source":"MUFON","Object Features":"Unknown","Object Flight Path":"N/A","Date of the Event":"02/10/1992 12:00 UTC","Object Shape":"Other","Country":"United States","Weather Factors":"Unknown","City":"El Monte","Longitude":"-118.023697","trends":["There have been 7 other sightings in El Monte","There were no other sightings in El Monte on or around February 10th 1992"],"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/46598.html.txt","/var/www/straped/mufon/org/46598.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.073731,+-118.023697(46598)&iwloc=A&hl=en\"> mufon case (46598) map </A>","divs":["Sighting DetailsThis was a strange event,I got a letter in the mail that i was to receive a free camera,all i had to do was show up at a specific address at a specific time and date. note: this was a long time ago back in the early 90's.the location was in el Monte California,so me and my brother decided to go.upon arriving at the exact location we noticed that the address where we were led to was a vacant lot. we thought okay this was obviously a hoax,but to what end?,we were also very hungry and decided to go to the burger king across the street,it was here where the event took place.my brother told me what he wanted and i stood in line,about four people in front of me then this guy walks in who to me looked like a bum,dirty,cut off gloves,long brownish coat.and he got behind me and i remember looking at my brother and over to the cashier girl who also noticed this man.i feared he was going to ask for money,i expected it.instead he leans over and taps my shoulder and i turn to him and he asks me or rather questions me.he says \"you really don't know what time it is do you?,you don't know what 145 is? i turned around back towards the line and now the few people in front of me as well as the cashier girl noticed him and then all of they're faces turned to shock,i thought he maybe pulled out a knife or a gun,but instead what they witnessed was he simply vanished... i quickly turned behind me and he was gone without a trace,the lobby door just feet away stood still,he couldn't have made it out without one of us seeing him do so.now comes even the weirder part.by the time i reached the front of the line everyone including myself forgot what transpired just a few minutes earlier.this incident wasn't my first either concerning the number 145,and every time i encountered a human looking being,the situation was the same,they questioned me about the time,and 145.now honestly to me i have no idea the significance of this number,i was wondering if anyone else had ever experienced anything similar?"]}