{"divs":["Sighting DetailsIt was about 10:05 PM monday night. I was in the backyard with my dog and saw how clear the sky was and how bright the stars were. I watched a jet flying east to west go off in the distance and heard its engines as it moved away. I looked straight up and right where I was looking I saw two white lights in a row, very close together, one slightly smaller than the one in front of it. They were clear and looked like a jets lights from a commercial jet. but it moved incredibly fast and disappeared in a second in mid sky. It looked like it went higher and faster and then just vanished. There was no trail like from a comet and no flash and no sound. it was going north to south. I said it looked like a jet although the lights never blinked but I saw them clearly and it didn't appear to be extremely high up, no higher than a commercial jet would be. But I've never seen a jet move that fast and disappear that fast and seem to speed up. If I hadn't have looking right where it flew I wouldn't have seen it as it was gone in a second."],"Log Number":"US-04042013-0009","Object Shape":"Other","Region":"Pennsylvania","trends":[],"Latitude":"41.206802","Date of the Event":"04/01/2013 10:05 UTC","Longitude":"-77.189435","files":["/var/www/straped/mufon/html2text/46590.html.txt","/var/www/straped/mufon/org/46590.html"],"Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Object Features":"Unknown","City":"Undisclosed","Summary":"I was looking up in the sky at stars and saw two lights close together one after the other, one smaller. It was clear and looked to be a jet but it moved incredibly fast and disappeared in a second like it went straight up. No sound, no trail, no flash.","Country":"United States","Case Number":"46590","Tags":"City","Disposition":"Unresolved","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.206802,+-77.189435(46590)&iwloc=A&hl=en\"> mufon case (46590) map </A>","Date Submitted":"04/04/2013 01:37 UTC","Sighting Duration":"00:00:01"}