{"Date Submitted":"04/04/2013 03:11 UTC","Object Features":"None","divs":["Sighting DetailsI was driving back from dropping my daughter off at school and turned right on to Canton from Shallowford around 7:50 in the morning. This is a daily route. I looked up in the sky and noticed 2 planes going in opposing directions. There are always planes in the sky around this time of morning and you can see their trails. It was a sunny morning with clear skies. I suddenly noticed, between the two planes, a silver object in the sky, almost tin like, with an oval shape but not as elongated or perfect, almost as if it was squished but not a circle, it was wide though and gave a mishapen appearance and there was a darkness on the right side of the belly. it was much lower than the planes but I have no clue on distance so couldn't say how high. I was like, 'What in the world is that?!\" It was much bigger and much closer than the 2 planes and seemed to be moving somewhat to the left but not really much at all as I noticed the 2 planes growing further from it. I was driving and had to put my eyes on the road and my turn was coming up so I got over in the turning lane and stopped to see it more. I just stared at it trying to figure out what it was and comparing it to the 2 planes. I then looked left to make a turn and looked back up and it was gone. Very odd! I kept looking and saw the other 2 planes but not the object again. Not sure what it was. I so wish I could have looked longer at it. It seemed so close and so shiny, like tin or silver had just been polished and it gave the appearance that it was just sitting there. I don't think the sighting lasted more than 30 seconds. I'm so curious what it was and if anyone else saw it! There is a lot of traffic around that time."],"map":"<A HREF = \"http://maps.google.com/maps?q=34.052663,+-84.546918(46593)&iwloc=A&hl=en\"> mufon case (46593) map </A>","Summary":"Silver shiny object floating in sky near Canton and Shallowford in Marietta/Woodstock, GA","Region":"Georgia","Date of the Event":"03/26/2013 07:50 UTC","Case Number":"46593","Weather Factors":"Unknown","Object Flight Path":"Stationary","City":"Woodstock","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Latitude":"34.052663","Source":"MUFON","trends":["There have been 12 other sightings in Woodstock","There were no other sightings in Woodstock on or around March 26th 2013"],"Longitude":"-84.546918","Object Shape":"Oval, Sphere","Tags":"City","Disposition":"Unresolved","Country":"United States","files":["/var/www/straped/mufon/html2text/46593.html.txt","/var/www/straped/mufon/org/46593.html"],"Log Number":"US-04042013-0012"}