{"Country":"United States","divs":["Sighting DetailsOn the night in question a friend and I decided to go see a movie at the local drive-in in the Wicksburg area, we arrived at 7:30pm. We parked facing south-SE to view the movie. At approximately 9:05-9:10pm my friend that was seated in the passenger seat of my truck had leaned fwd intently watching the movie when she said; \"What the heck is that?\" I leaned fwd to see. I saw what could've be mistaken as reflection of lights on the windshield moving left to right in other words east to west in a straight line at 45 degrees off the horizon moving fast. I saw a semi-circle of faintly lit square windows facing me, going around the object the windows were vertically arranged and horizontal to the ground like movie film wrapped around a cylinder so I couldn't see the windows on the other side. The reason I'm describing the windows so intently is because that was all I could see of the actual craft, the only reason I knew it was solid is that it blocked out the stars within the circle of windows as it passed, it matched the dark sky perfectly with no reflection, none. I then looked for heat signature as the stars reappeared there were none. When I saw this I knew it was way different than anything I'd ever seen, so I got out of my truck as fast as I could to watch and listen for noise. Not a sound. Nothing moves that fast without making some noise. I watched this craft fly out of sight following the faint line of windows heading west toward Enterprise. I noticed during this encounter that nobody else had seen this, they were all still in there cars watching the movie, at least 200 people, incredible. It was impossible to judge altitude of the craft, my best guess was maybe 500-5000ft. The size matched a baseball in your outstretched hand at its closest to us. The shape, again best guess, was of the disk type with the ribbon of windows at its edge. Now a little about myself. I've been an aviation enthusiast since I was a little boy, studied them, most all of them, built over 200 models when I was a boy, studied to be an A&P mechanic and worked as a civilian contractor for the military for 25yrs. I've seen almost everything that flies civilian and military up close and personal, I can pick out by silhouette alone 99% of everything man made that flies. My friend that was with me has been an A&P mechanic for 20yrs and has lived in this area her entire life and with Ft. Rucker close by can tell you by sound alone, which helicopter is flying by. I'm 47yrs old and my friend is 50yrs old, aviation has been our lives. What we saw that night was beyond anything both of us could comprehend or understand. The aircraft, or whatever it was, seemed to be pulled through the air, not pushed like it would be with engines of any known type. The only word either one of us could come up with was \"Incredible.\" There is nothing man made, that I know of, that can do what I saw done that night. We do not have that kind of technology. \"Incredible\""],"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/46592.html.txt","/var/www/straped/mufon/org/46592.html"],"Weather Factors":"Unknown","Object Shape":"Disc","Region":"Alabama","City":"Daleville","Date of the Event":"03/30/2013 09:10 UTC","Tags":"City","Log Number":"US-04042013-0011","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Longitude":"-85.641922","Object Features":"Window(s)","Date Submitted":"04/04/2013 01:55 UTC","Summary":"At night saw faint glow of oncoming windows facing me same thing leaving me.","trends":["There have been 4 other sightings in Daleville","There were no other sightings in Daleville on or around March 30th 2013"],"Case Number":"46592","Latitude":"31.327648","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=31.327648,+-85.641922(46592)&iwloc=A&hl=en\"> mufon case (46592) map </A>","Source":"MUFON"}