{"Object Features":"None","Longitude":"-112.043218","Date of the Event":"03/15/2013 12:00 UTC","Sighting Duration":"Undisclosed","Country":"United States","Summary":"Several Star-like orbs observed during the daylight hours.","Case Number":"46609","Latitude":"33.488226","Log Number":"US-04052013-0013","divs":["Sighting DetailsI was laying in a lounge chair looking at the sky in my backyard. I saw a silver orb floating slowly from West to East in the sky. Even though it was Very high in altitude it caught my eye. At first I thought maybe it was white platic bag flying in the air. Then I began to see more coming from the same direction. Some where above the clouds and many where below the clouds. I would see one every five minutes going from west to east. Three objects where seen at the same time and where stationary for about 20mins. These objects looked like stars, but in the daylight. It is hard to describe. They were shiny and bright and just above. Imagine a star in the daylight if you can. I could not wrap mind around it. I kept thinking what can it be. It did not look like a plane (because some where stationary), or helicopter (because the altitude was way to high), or trash (because I know there is'nt that much trash in the air.I finally would lose sight of the object because it would move until I could no longer see it. It really boggled my mind. This was not the first time I have seen these objects. I really wish I knew what they are, This to me is uniquely a unidentified flying object."],"City":"Phoenix","Region":"Arizona","Object Flight Path":"Stationary,Hovering then path","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/46609.html.txt","/var/www/straped/mufon/org/46609.html"],"trends":["There have been 417 other sightings in Phoenix","There was one other sighting in Phoenix on or around March 15th 2013"],"Weather Factors":"Unknown","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=33.488226,+-112.043218(46609)&iwloc=A&hl=en\"> mufon case (46609) map </A>","Date Submitted":"04/05/2013 06:40 UTC","Source":"MUFON","Viewing Distance":"Unknown","Tags":"City"}