{"Source":"MUFON","Object Flight Path":"Other","Latitude":"30.164722","City":"Little Cypress","divs":["Sighting DetailsI was sitting in my car with my boyfriend in his driveway. We were just talking and I had the sudden urge to look left out of my drivers side window. When I looked I saw a huge ball of light enter the atmosphere, at first I thought it was a comet and proclaimed so, but then suddenly it imploaded and an aircraft was there instead. I freaked out and started yelling \"what is that?!\" this made my boyfriend want to look so we got out of my car fast and looked at it. It was at a low altitude and started to zig-zag higher and gain altitude. After it did this is flew very slowly in one direction, it had three lights on the outside of it, on one wing was a red light (I'm not sure if it was a wing but thats what I got from what I could see) in the middle it had a white light, and then on the opposite \"wing\" another red light. The lights would flash like this.. red, white, red......red, white, red from left to right and disappear (like one of those arrows flashing outside of a business to try to get more customers.) The lights repeatedly did this. I'm not 100 percent positive, but from what I could see it looked triangular. We kept looking at it until it was out of sight. Not even 5 minutes later I left my boyfriends house and headed home, I was about a mile away and seen the object still flying very slowly. I stopped to look at it again on the road (there was no traffic around) and I thought to myself as I was looking at it that I was going to tell people about what I had seen, right after I thought this the object made a sharp u-turn and headed right toward me. I panicked and started to drive away fastly, I couldn't keep my eyes on it because there was a lot of trees (I was on a winding, very curvy road.) I eventually arrived home and kept looking at the sky, making sure it didn't follow me, as far as I know it decided to leave me alone. When I told people about this they asked me if I took a picture of it and I didn't. The thought to take a picture didn't even cross my mind because I was awestruck."],"trends":["There have been no other sightings in Little Cypress","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=30.164722,+-93.756111(46605)&iwloc=A&hl=en\"> mufon case (46605) map </A>","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/46605.html.txt","/var/www/straped/mufon/org/46605.html"],"Viewing Distance":"101-500 Feet","Tags":"City","Date of the Event":"06/23/2012 09:10 UTC","Date Submitted":"04/05/2013 05:04 UTC","Object Shape":"Triangle","Disposition":"Unresolved","Region":"Texas","Summary":"I saw a ball of light come into the atmosphere and impload into an aircraft.","Country":"United States","Longitude":"-93.756111","Case Number":"46605","Log Number":"US-04052013-0009","Weather Factors":"Unknown"}