{"map":"<A HREF = \"http://maps.google.com/maps?q=45.022961,+-85.76018(46601)&iwloc=A&hl=en\"> mufon case (46601) map </A>","Weather Factors":"Unknown","Object Shape":"Triangle","Date of the Event":"08/15/1991 12:00 UTC","Date Submitted":"04/05/2013 03:22 UTC","Object Flight Path":"Path with directional change,Path then hovering","Latitude":"45.022961","Disposition":"Unresolved","divs":["Sighting DetailsIt was the late summer 1991 and I was with my girlfriend (future wife), her father and step mother in Leland, MI spending the weekend at a small resort. My gf and I had gone for a walk north along the beach of Lake Michigan. We walked a couple hundred yards up the beach and stopped to sit and talk and take it all in. It was getting near dusk but still well lit. While sitting on the beach I noticed something strange. There was a cloud that seemed out of place. It was much lower than any other cloud in the sky and moving steadily along in a southern direction. I just remember thinking to myself that this was very out of place and I kept looking at it without telling my gf. The cloud was triangular shaped or v-shaped with sides between 50 to 100 feet long. I guess it was probably at less than 300 ft. altitude and likely lower. Again it seemed out of place and the altitude was significant to me. It was just a short time later that my gf told me she felt and saw the same thing independent of me. Well after a few more minutes we decided to walk back up to the house the family was renting. As we approached the house (which had a west facing deck looking out over Lake Michigan) my gf's father was yelling \"get up here there are ufo's out there.\" I instantly had a shudder through my body and I knew what I had seen. He and his wife had both been on the deck when they described as the same cloud like, v-shaped object we had just seen minutes earlier. We rushed up to the deck and my father in law said, \"this shape just came out of a cloud and rushed out over the lake. you can see it out there now.\" At that moment he pointed out what he believed to be the object and said there was more than one, possibly three. As I watched with him I did see distant shapes move laterally and vertically on the horizon. Objects also appeared to fade in and out. We watched for several minutes. My mother in law was freaked and she went inside visibly shaken. I was getting shook up too and didn't want to see anymore either. By then the sun was setting and there was nothing along the horizon other than clouds. I cannot be sure what I saw on the horizon but I do know what my gf and I saw while on the beach and I am very sure my father and mother in law saw what they described."],"files":["/var/www/straped/mufon/html2text/46601.html.txt","/var/www/straped/mufon/org/46601.html"],"Longitude":"-85.76018","Region":"Michigan","Log Number":"US-04052013-0005","Sighting Duration":"Undisclosed","City":"leland","Summary":"With family in Leland, MI late summer 1991 saw triangular shaped cloud that moved overhead then zoomed west","Viewing Distance":"21-100 Feet","Case Number":"46601","trends":["There have been no other sightings in leland","This sighting has never been favorited."],"Object Features":"None","Country":"United States","Tags":"City","Source":"MUFON"}