{"Object Flight Path":"Stationary,Hovering then path","Date of the Event":"04/03/2013 04:10 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/46615.html.txt","/var/www/straped/mufon/org/46615.html"],"Sighting Duration":"00:00:10","Longitude":"-71.065878","City":"Everett","divs":["Sighting Detailsdriving home after doctor appointment saw through my windshield a silver cylindrical saucer like almost elipse type UFO just hovering about maybe 500 feet high,up to my 1 oclock ,witnessed for about 10 seconds or so.couldnt stop due to traffic to take a pic.I just stared at it super excited as it just hovered there.for size comparison it was the size of an M&M candy if you held it about 7 inches away from your eye.(also that kind of shape)seemed to be maybe 500 or 600 feet away,and maybe 500 feet high in the sky. it just hovered there no noticeable windows or con trails or disturbances,no noise cause i shut off my radio,it looked smooth,kind of like a keg that was flattened with maybe 3 different sections like the middle was more outwardly pronounced and the top and bottom were slightly rounder in fact kind of like the M&M candy again..as i drove (now the craft about 2 o'clock high),i saw it move just slightly (kind of away from me and down) the distance it moved was about the same width of the craft,then it just disappeared,like it just flicked out. i drove around the rotary ahead of me,and came back to see if i can spot this again,to no avail. I love my daughter Jenna more than life itself, and I SWEAR ON HER SOUL i SAW THIS CRAFT,no mistaking it for anything else. I was looking around the internet after this,and saw the videos from CNN's video of a craft in Denver Colorado,one of the pictures it showed loooked EXACTLY like what i saw,only the craft I saw wasnt moving fast like thiers was,as i stated it just hovered. I Know what i saw,but have no proof. I WILL NEVER FOR GET THIS Tony marcin"],"Tags":"City","Object Shape":"Circle, Disc","Case Number":"46615","map":"<A HREF = \"http://maps.google.com/maps?q=42.413781,+-71.065878(46615)&iwloc=A&hl=en\"> mufon case (46615) map </A>","Region":"Massachusetts","Summary":"saw UFO out windshield,maybe 500 feet high,silver,saucer hovering,then moved a bit away then just disappeared","Object Features":"None","Viewing Distance":"101-500 Feet","Latitude":"42.413781","Disposition":"Unresolved","Log Number":"US-04052013-0018","Country":"United States","trends":["There have been no other sightings in Everett","This sighting has never been favorited."],"Date Submitted":"04/05/2013 10:42 UTC","Source":"MUFON"}