{"Date of the Event":"09/10/2012 11:00 UTC","Object Shape":"Fireball, Sphere","Case Number":"46621","City":"Birmingham","Region":"","divs":["Sighting DetailsA friend and myself were taking a walk around the canal path at around 10pm. We walked into Cocks Moors golf course and took a stroll around it. One slow moving fireball looking sphere showed up in the distance over the trees, we couldn't make out what it was but knew it was not a plane or helicopter, it was too low and too small and well just clearly wasn't. We figured someone had released a lantern into the air or something similar, as this one was slowly coming towards us another one appeared over the trees on the exact same path as the first, then another one and then a final one. They were all several meters apart from each other, all moving in the same direction all following the same path. The first reached what looked like the edge of the golf course and lowered slightly, then hovered it didn't seem to be moving at all. The the other 3 all joined it, all changing their heights and the 4 formed a perfect 4 pointed diamond like shape in the sky, all equal distance from one another, a perfect shape. They then after a couple of minutes of hovering like that started moving on the path again, still in this diamond formation, they suddenly changed direction and all together, still in shape came towards our direction, at a much quicker pace than their previous path. My friends dog had begun barking at them and wasn't happy at all, we agreed with the dog that these things were dodgy and went back onto the canal path and half kept our eye on them as we walked back from where we came. I don't know where they went after that and haven't seen them since, though have been back several times."],"trends":["There have been 57 other sightings in Birmingham","There were no other sightings in Birmingham on or around September 10th 2012"],"Sighting Duration":"Undisclosed","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/46621.html.txt","/var/www/straped/mufon/org/46621.html"],"Summary":"Glowing fireballs over Cocks Moors golf course. Formed pattern in air.","Latitude":"52.447027","Date Submitted":"04/06/2013 08:45 UTC","Viewing Distance":"20 Feet or Less","Country":"United Kingdom","map":"<A HREF = \"http://maps.google.com/maps?q=52.447027,+-1.888078(46621)&iwloc=A&hl=en\"> mufon case (46621) map </A>","Longitude":"-1.888078","Object Flight Path":"Path with directional change,Path then hovering,Other","Object Features":"Unknown","Tags":"City","Log Number":"GB-04062013-0004","Source":"MUFON","Weather Factors":"Unknown"}