{"divs":["sighting detailsi looked out my kitchen window and first observed a star-like object high in the northeastern sky around 9pm est on 4\\5\\2013. i continued to observe said object until around 3:30am est on 4\\6\\2013. during this time, the object changed shape and position several times. sometimes, it looked like there was only one light, and other times, it looked like there were 3 or 4 lights across (from my perspective). at one point, near the end of my observation, i saw one red light. i could not tell if the red light was part of the same object or was a different object that had been emitted from the first object. the first object followed a gradual path from the northeast to the east and then gradually ascended. at one point, i saw a flame shoot out from the object. the first object reached a height that was nearly straight over my house. when i looked again at 5am est, it had either disappeared or was straight over my house. i live across from lunken airport in cincinnati and am aware of the flight traffic. i did not observe any planes landing or taking off during the night of my observation as there was a very low cloud cover, and i could not see them. i observe the skies on a nightly basis and see the usual objects, but this one was a bit different. i did get excited when i saw the red light in addition to the white and when i saw the flame."],"Tags":"City","Case Number":"46628","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=39.104456,+-84.427549(46628)&iwloc=A&hl=en\"> mufon case (46628) map </A>","Country":"United States","Log Number":"US-04062013-0010","City":"Fort Thomas","Longitude":"-84.427549","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Region":"Kentucky","Weather Factors":"Unknown","trends":["There have been 5 other sightings in Fort Thomas","There were no other sightings in Fort Thomas on or around April 6th 2013"],"Latitude":"39.104456","Date of the Event":"04/06/2013 03:30 UTC","Source":"MUFON","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/46628.html.txt","/var/www/straped/mufon/org/46628.html"],"Date Submitted":"04/06/2013 02:13 UTC","Disposition":"Unresolved","Object Shape":"Flash, Oval, Star-like","Summary":"starlike object that changed shape and emitted flame"}