{"Disposition":"Unresolved","Log Number":"US-04062013-0012","Summary":"Cigar shaped object traveled directly over me while I was on my back porch.","Weather Factors":"Unknown","Object Shape":"Cigar","Tags":"City","divs":["Sighting DetailsI was standing on my back porch when I looked up & saw a large cigar shaped object just above the trees traveling over me. I could only hear it when it was directly above me. It made a humming sound. After it passed over I could not hear it anymore. There were 2 solid white lights & 1 pulsating red light. The white lights were flush with the object (1 at each end on the bottom of the object) & the red pulsating light was in the middle on the bottom of the object. The object itself seemed to be dark but it was dark outside so I'm really not sure of the color. I stepped off my porch & followed it across the yard & watched it travel over the next 5 houses. It was traveling at a very slow speed (maybe 10-15 mph) & never changed direction. It traveled along the edge of the mountain that I live on until I could not see it anymore. The feeling I got was peaceful & curious. This is by far the strangest thing I have ever seen. This was the 2nd ufo that I have seen in 3 days. I have never witnessed any before these. Both were seen at my house in Brookside, AL. What is going on?!?!"],"Object Flight Path":"Straight-line path","Longitude":"-86.947161","Case Number":"46631","Source":"MUFON","trends":["There have been 2 other sightings in Graysville","There was one other sighting in Graysville on or around March 7th 2013"],"Object Features":"Other","Region":"Alabama","Date of the Event":"03/07/2013 07:30 UTC","Country":"United States","City":"Graysville","Sighting Duration":"Undisclosed","Date Submitted":"04/06/2013 03:26 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.621015,+-86.947161(46631)&iwloc=A&hl=en\"> mufon case (46631) map </A>","Viewing Distance":"101-500 Feet","Latitude":"33.621015","files":["/var/www/straped/mufon/html2text/46631.html.txt","/var/www/straped/mufon/org/46631.html"]}