{"Longitude":"-77.333697","Country":"United States","Sighting Duration":"Undisclosed","Log Number":"US-04062013-0019","Weather Factors":"Unknown","Object Shape":"Chevron","City":"Richmond","map":"<A HREF = \"http://maps.google.com/maps?q=37.507462,+-77.333697(46638)&iwloc=A&hl=en\"> mufon case (46638) map </A>","Tags":"City","Region":"Virginia","Date of the Event":"12/07/2002 02:15 UTC","Latitude":"37.507462","files":["/var/www/straped/mufon/html2text/46638.html.txt","/var/www/straped/mufon/org/46638.html"],"Disposition":"Unresolved","Viewing Distance":"101-500 Feet","Summary":"silent slow backward flying V shape","Case Number":"46638","Date Submitted":"04/06/2013 09:06 UTC","trends":["There have been 39 other sightings in Richmond","There were no other sightings in Richmond on or around December 7th 2002"],"divs":["Sighting DetailsI was working for the electrical union at the Richmond International Airport in Henrico,VA on December 7,2002. At approximately 2:15 AM I came out of one of the baggage handling areas and onto the tarmac heading to one of the other baggage areas for another airline. As soon as I stepped out the door I noticed what I first thought was an airplane, but very quickly changed my mind. I stopped walking and watched very calmly as this object came from the north end of the airport and headed south at approximately 50 to 70 mph. It was completely silent and did not change course or speed. There were about 8 or 9 yellow-orange,(not very bright), lights arranged in a backward flying V shape. It was about 20 degrees f and there was snow on the ground from the night before and it was foggy, but I had no problem seeing these lights in this V shape. I did not see any other lights like navigation lights or flashing lights. The lights stayed solid and unwavering the entire time. I was unable to see any structure of the object maybe because of the fog. I soon realized that I was the only one watching so I ran to the next baggage area yelling to the other electricians to come out. It was gone before anyone else could see it. The whole sighting lasted about 15 to 20 seconds. I would also like to note that the airport, at the time, shut down at midnight. No flights in or out after midnight."],"Source":"MUFON","Object Flight Path":"Straight-line path","Object Features":"Unknown"}