{"Viewing Distance":"101-500 Feet, Over 1 Mile","Disposition":"Unresolved","Object Features":"Patterned Surface, Other","Region":"Pennsylvania","Summary":"see three cross in sky in south, two went south one stayed, behind from noth came a round object that I could see under, it had probes, and a skin like material, went pass me and the cross then took off and both went south","Object Shape":"Circle, Cross, Other","trends":["There have been 122 other sightings in Pittsburgh","There were no other sightings in Pittsburgh on or around September 7th 2012","This sighting has been favorited 1 time.",""],"files":["/var/www/straped/mufon/html2text/46636.html.txt","/var/www/straped/mufon/more/46636_submitter_file1__IMG00059201108052037.jpg","/var/www/straped/mufon/org/46636.html"],"Latitude":"40.447645","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.447645,+-79.992666(46636)&iwloc=A&hl=en\"> mufon case (46636) map </A>","Log Number":"US-04062013-0017","Weather Factors":"Unknown","Country":"United States","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","City":"Pittsburgh","Longitude":"-79.992666","divs":["Sighting DetailsIt was just starting to get dark when I look at the moon and saw three black objects, they were shaped like a cross but very large, each at least 80ft x 40ft. Two turned and went south one behine the other and one stay. Then I look up and there was a round object about 100ft wide, it had a slow spin, I could see up into the bottom which was was at least 6ft deep. The object had a skin like surface, and had 8 probes, 4 large that reached out about 20ft 90deg apart and 4 smaller probes 10 ft each in between the larger which were also smaller in dia. No noise as it floated over me and I was able to get a pic, but it does not show any detail just a blob in the sky. You have to blow up the pic and see the object between the bottom two trees."],"Source":"MUFON","Tags":"City","Case Number":"46636","Date Submitted":"04/06/2013 08:59 UTC","Date of the Event":"09/07/2012 07:30 UTC"}