{"Case Number":"46637","trends":["There have been 417 other sightings in Phoenix","There was one other sighting in Phoenix on or around April 21st 2008"],"Longitude":"-111.96222","Log Number":"US-04062013-0018","Object Shape":"Sphere","Date Submitted":"04/06/2013 09:00 UTC","Summary":"4 metallic silver orbs that glowed red after sun went down blinking together like communicating hovered made patterns formed vertical line at end and disappeared.","Date of the Event":"04/21/2008 07:45 UTC","Latitude":"33.624163","Sighting Duration":"00:45:00","Region":"Arizona","Tags":"City","Source":"MUFON","Weather Factors":"Unknown","Viewing Distance":"Unknown","Country":"United States","Object Features":"None","files":["/var/www/straped/mufon/html2text/46637.html.txt","/var/www/straped/mufon/org/46637.html"],"Disposition":"Unresolved","divs":["Sighting DetailsMy family had just finished eating dinner and i was washing the dishes when my dad went outside to our back yard. he ran right back in and told the rest of us to come outside and see something. there were four orbs hovering in a diamond shape to the north, north west. I am not sure about the distance they were from me but they were a glossy metallic silver at first when the sun was still setting. as it got darker they were glowing red. they also looked too small to be carrying occupants. they were in front of clouds so we could clearly see four individual orbs that were solid but flashed in sequence once it got dark. they were hovering in a diamond shape at first and then the top orb blinked twice, the other three blinked twice and then they changed formation into a vertical line. over the course of around 45 minutes they formed the diamond, a vertical line, a lower case t shape and a upside down u or boomerang like shape. while this was happening my brothers and I were calling our friends to tell them to go outside and look to the north west and they all saw the orbs as well from different locations. I called six friends who all saw them but I am not sure about the amount my two brothers called. there is also a short home video of them in the boomerang shape, blinking, and moving on youtube under \"phoenix lights 4-21-2008\" but I did not record it and do not know who did personally. when they disappeared they formed the vertical line, the top orb flashed first followed by the other three, and then they went up together almost in a slithering motion and each went out individually at the same spot. I could not see anything in the spot where they went out. my first reaction when I saw them was to call my friends to see if they could see it from different angles and try to figure out what it was but we never could. I never felt scared but it felt like there was something looking right at me. I felt very calm and safe the whole time. I have since see the same things in around the same area on May 24, 2008 and over south central Phoenix on January 11, 2013. I also live under the flight paths of 3 airports and see all sorts of planes every day and I have seen military planes drop flares and I have never seen anything else look or act like these in my life."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.624163,+-111.96222(46637)&iwloc=A&hl=en\"> mufon case (46637) map </A>","Object Flight Path":"Hovering then path,Path then hovering","City":"Phoenix"}