{"Latitude":"34.278587","files":["/var/www/straped/mufon/html2text/4663.html.txt","/var/www/straped/mufon/org/4663.html"],"Object Features":"None","Date Submitted":"04/01/2006 12:00 UTC","divs":["sighting detailsmy mother and i had been painting my bedroom walls all morning. i was looking in my closet when i turned around to the outside wall, and inside\\under the awning that covers my 48 inch window that faces the street, there were three globes of light. as soon as i saw them they began to diappear, fading out from right to left, one at a time. as soon as they disappeared (about one second - it was really fast) i ran out of my room and told my mom and grandmother what i had seen. my mom raised her eyebrows and my grandmother suggested that perhaps some ets had wanted to see what i was doing in my bedroom. she told me that often times globes of light were et intelligences. she told me about brian scott who interacted with these intelligences many years ago. i was excited, and although it would have been easy to be scared, i wasn't. i went back to working in my bedroom and nobody saw any more globes of light. i wonder if i'll ever see them again - i'm going to be working in my room this weekend to finish it up. i am 13 years old and my grandma is diane johnson, the state section director for mufon ventura and santa barbara counties. i've been to lots of mufon meetings and there are \"alien\" things and pictures all around the house. i've talked to people who have had sightings, but never really thought it would happen to me. now i'm curious as to why they were here. btw this happened in the early afternoon - between 1 and 2 pm and it was bright light outside, but the globes, inside the awning were brighter and about 8 inches across."],"Case Number":"4663","Summary":"Three globes appeared under the awning to my bedroom.","Source":"MUFON","Sighting Duration":"Undisclosed","Longitude":"-118.502112","map":"<A HREF = \"http://maps.google.com/maps?q=34.278587,+-118.502112(4663)&iwloc=A&hl=en\"> mufon case (4663) map </A>","Log Number":"US-04092006-0002","Viewing Distance":"20 Feet or Less","City":"Los Angeles","Country":"United States","Object Flight Path":"Stationary","Date of the Event":"04/01/2006 12:00 UTC","Region":"California","Object Shape":"Circle, Sphere","Disposition":"Unresolved","Tags":"City","Weather Factors":"None","trends":["There have been 404 other sightings in Los Angeles","There was one other sighting in Los Angeles on or around April 1st 2006","This sighting has never been favorited.",""]}