{"Source":"MUFON","City":"Kings Mountain","Disposition":"Unresolved","Date Submitted":"04/06/2013 09:08 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/46639.html.txt","/var/www/straped/mufon/org/46639.html"],"Country":"United States","trends":["There have been 3 other sightings in Kings Mountain","There were no other sightings in Kings Mountain on or around November 16th 2008"],"Object Flight Path":"Straight-line path","Latitude":"35.206952","Region":"North Carolina","Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=35.206952,+-81.411137(46639)&iwloc=A&hl=en\"> mufon case (46639) map </A>","Tags":"City","Case Number":"46639","Sighting Duration":"00:03:00","divs":["Sighting Detailsi was taking my dog out to do her thing in the front yard at around 10:00 to 10:30 p.m.,,i caught somthing shinny out the corner of my eye, at first i thought it might be the headlamps of a jet liner, but it was'nt,it was a bright light, glowing, with no pulsating or flashing lights with it, this was a clear night and you can see the air liners real good with their strobing lights, it moved very silently and at a very fast pace, if i had to guess at speed from where i was standing, it went straight over my house at about 2 to 3 hundred m.p.h., i watched it go from n. to s. untill it looked a star , then i went back into the house. the odd thing is when i took my dog out the next night, i seen the same light, moving w. to e. at same rate of speed. the only thing about it was a made a criss-cross right over my house. it seemed like it was mapping. my wife and has witnessed some u.f.o. together also. i would really like to talk to someone about them. most of them has happened around where we live. thank you for your time."],"Viewing Distance":"Unknown","Summary":"ball of light moving at a steady rapid pace from n. to s., then from west to eastwas","Object Features":"None","Date of the Event":"11/16/2008 10:15 UTC","Log Number":"US-04062013-0020","Longitude":"-81.411137"}