{"trends":["There have been 70 other sightings in Columbus","There were no other sightings in Columbus on or around April 2nd 2013"],"Log Number":"US-04072013-0013","Longitude":"-83.074927","Object Features":"Other, Unknown","Object Flight Path":"Stationary","Case Number":"46657","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.947158,+-83.074927(46657)&iwloc=A&hl=en\"> mufon case (46657) map </A>","Date of the Event":"04/02/2013 01:59 UTC","Source":"MUFON","Tags":"City","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/46657.html.txt","/var/www/straped/mufon/org/46657.html"],"Viewing Distance":"Over One Mile","Disposition":"Unresolved","Summary":"I looked up at this light in the eastern sky that had a bright red and blue color. I got my telescope and looked closer to see pulsating red and blue object.There was a small star to the left of it.The Next night, no object in the same spot.","Country":"United States","divs":["Sighting DetailsI took my dogs out and looked for the Big Dipper to see what position it was in the sky.Then looking to the East I noticed a star that was twinkling brightly. I thought it might be Venus so I got my telescope out and located the star. There was two colors that I could see Red(L) and Blue(R). Both of them pulsated rapidly as part of the object.The object was stationary. I tried to focus my telescope so I could get a more detailed view but it stayed somewhat fuzzy, but I could still see the two colors. I did notice a regular star to the left of the object and it seemed normal and didn't twinkle or move. The next night I looked again and there was no object in the same place. Then again for the next few nights I didn't see it there. I don't know for sure if it was a planet. But I had viewed Venus before ,as small as it is with no details,and it had no radiant colors coming from it. Honestly I do believe it wasn't a planet but I'd be open to a confirmation that it was. YES I do think there is visitors among us."],"Object Shape":"Circle, Flash, Sphere, Star-like","Date Submitted":"04/07/2013 05:55 UTC","Latitude":"39.947158","Region":"Ohio","City":"Columbus"}