{"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.07926,+-118.399306(46651)&iwloc=A&hl=en\"> mufon case (46651) map </A>","Disposition":"Unresolved","Source":"MUFON","Date Submitted":"04/07/2013 10:21 UTC","trends":["There have been 8 other sightings in Beverly Hills","There were no other sightings in Beverly Hills on or around February 14th 2013"],"Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/46651.html.txt","/var/www/straped/mufon/org/46651.html"],"Region":"California","Viewing Distance":"Unknown","Date of the Event":"02/14/2013 09:30 UTC","City":"Beverly Hills","divs":["Sighting DetailsI was driving back from dinner with a friend on Valentine's Day when I a light caught my eye in my peripheral vision. I turned to see what it was and noted what could have been 6-8 orb-like lights moving around very quickly and in different directions. We stopped the car to see what it could be and saw these lights form changing patterns, often appearing in triangle formation. At times, one or more seemed to disappear and then they would reappear sometimes in the same place, sometimes in another position. They were very bright and very clear. I had no idea what they were but I was extremely interested to find out. After going on line, I was absolutely startled to see how many posted videos of exactly the same lights. I never would have believed any of this if I hadn't seem it with my own eyes and with another person who was just as amazed. My only regret what that I didn't have a video camera with me. After spending time on the internet, I see that UFO's are no longer an science fiction but indeed science fact. After this experience, I will never look at the night sky the same way."],"Case Number":"46651","Sighting Duration":"Undisclosed","Tags":"City","Object Features":"None","Longitude":"-118.399306","Object Shape":"Fireball, Sphere, Star-like","Latitude":"34.07926","Summary":"white orb like lights moving sometimes erratically, sometimes formingpatterns","Log Number":"US-04072013-0007","Weather Factors":"Unknown"}