{"Weather Factors":"Unknown","Tags":"City","Region":"New York","Latitude":"43.096214","Country":"United States","Sighting Duration":"Undisclosed","Object Shape":"Sphere","divs":["Sighting DetailsWhile driving with my father,sister and cousin (20 MILES EAST) of the City of Niagara Falls, we ALL witnessed a strange glowing orange object,like a glowing orangish light shooting across the sky.It was traveling northeast at a fast pace. We are all positive it was not military. We had the Niagara Falls Air Base fairly close.Within a minute of seeing this, two air force jets shot across the sky, the same direction of the orb.We all knew it was after the U.F.O. My father tried to follow the strange orb but it went out of site. We used to talk about this sighting every now and then. It has been so long now that it is just a memory, but we will never forget what it looked like and what the truth is about U.F.O's, they do exsist !!People can be a skeptic all they want but until you actually see a REAL U.F.O in person, not on t.v or read about things in books, no one can truly understand. Why am I writing this now? I found this site and figured what the hell, I'll give my story. I don't need to read stories to believe, but I must say that the Phoenix lights bring my experience every time I hear about it.We only saw one orb though. Thats all. Bye for another 30 years"],"Summary":"Myself,father,sister and cousin witnessed a strange glowing orb.","Date of the Event":"06/01/1979 12:00 UTC","Disposition":"Insufficient Data","Log Number":"US-04092006-0005","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/4666.html.txt","/var/www/straped/mufon/org/4666.html"],"Longitude":"-79.037739","Object Flight Path":"Unknown","Case Number":"4666","City":"Niagara Falls","Viewing Distance":"Unknown","Date Submitted":"06/01/1979 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.096214,+-79.037739(4666)&iwloc=A&hl=en\"> mufon case (4666) map </A>","Source":"MUFON","trends":["There have been 19 other sightings in Niagara Falls","There was one other sighting in Niagara Falls on or around June 1st 1979"]}