{"Object Features":"Unknown","trends":["There have been 4 other sightings in Honesdale","There were no other sightings in Honesdale on or around April 6th 2013"],"Sighting Duration":"Undisclosed","Longitude":"-75.250387","Weather Factors":"Unknown","Disposition":"Unresolved","Tags":"City","divs":["sighting details4\\6\\2013 my wife, daughter, and her friend had just got out of the car at the walmart in honesdale around 10:10 pm. they noticed flying orange lights coming from the south and stood there and watched them fly over towards the north. they first thought maybe airplanes but there were no blinking lights or sounds. there were 6 objects, all colored orange, flying in a jagged line type of formation. the objects held this formation for the duration of the event until they lost sight of them, which was approximately 5 minutes. i am told that they were traveling fairly slowly but may have been high up. i pointed out how a jumbo jet appears to fly slow when it is at altitude and they agreed that these objects could have been moving faster than they realized if they were high enough up. none of them were sure how high they might have been flying as they had nothing to gauge them by. others in the parking lot observed the lights as well....maybe 5 or 6 other people. what made this even more strange was that a friend of mine that lives about 20 miles south of us posted on facebook about seeing an orange \"fireball\" in the sky pass over his house at approximately 9:45 pm (same night, 4\\6\\13). i was sitting at home and got a call from my wife about the lights at about 10:15 pm and then a few minutes later i saw the post on facebook from my friend."],"Log Number":"US-04072013-0018","Viewing Distance":"Over 1 Mile, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.583115,+-75.250387(46664)&iwloc=A&hl=en\"> mufon case (46664) map </A>","Summary":"6 orange lights flying in jagged line from South to North over honesdale, PA","Object Flight Path":"Straight-line path","Region":"Pennsylvania","files":["/var/www/straped/mufon/html2text/46664.html.txt","/var/www/straped/mufon/org/46664.html"],"Source":"MUFON","Latitude":"41.583115","City":"Honesdale","Date of the Event":"04/06/2013 10:10 UTC","Case Number":"46664","Date Submitted":"04/07/2013 08:32 UTC","Country":"United States","Object Shape":"Fireball"}