{"trends":["There have been 24 other sightings in North Myrtle Beach","There was one other sighting in North Myrtle Beach on or around December 31st 2012"],"Source":"MUFON","Longitude":"-78.662502","Viewing Distance":"21-100 Feet","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Latitude":"33.827684","files":["/var/www/straped/mufon/html2text/46661.html.txt","/var/www/straped/mufon/org/46661.html"],"Case Number":"46661","Summary":"Ascending third floor stairs of three storey condo building. Orange orb, teardrop shaped light, directly infront of us, ever so slowly moving across in mid-air. Caught sec glimpse of solid grey/lead metal underbelly, as past over parking lot lamp post.","Region":"South Carolina","Log Number":"US-04072013-0015","divs":["Sighting DetailsUpon return to our three storey condo building, off 17-Bypass, North Myrtle Beach,S.C. 7:20 p.m. December 31, 2012. Beyond balcony of third floor landing, noticed orange colored teardrop light(3x larger than a light bulb) in mid-air. Parking lot directly below. Husband and I stood looking directly at teardrop shaped orange light while it moved across in straight line, eye level, ever so slowly. Light not clear brilliant, fuzziness to light. Without turning, I said to husband, \"what is that light.\" He said, \"helicopter.\" There was no noise. Infact everything was unusually quiet all around us, including the usual busy street traffic right beyond the condo parking lot. Everything was black beyond this orange orb light. Parking lot lamp posts usually light-up whole area. Could not see lights of one storey office building across from our building. Approx. minute, took orb to move in straight line, directly across from us. We said nothing to one another. It was like we were frozen in place, while our eyes watched. I caught a sec. of a glimpse of solid grey-lead looking metal beyond orange orb, where parking lot light post shone upward. It might of been the underbelly? Visually could not see anything else solid. Suddenly, husband and I turned away. We proceeded up stairs, entered condo. We never acknowledged what we saw until I mentioned \"the orange light\" the next morning. Husband insists it was a helicopter. Yet, he can't explain the lack of helicopter engines or why it would be flying through the parking lot of a three storey condo building? Three months later, I'am still trying to rationalize what we saw. Nothing makes sense. I cannot visualize something the width of a parking lot, moving, height of three storey building, without an engine sound. The most disturbing part of the event was our reaction during and after. Nothing was registering in our minds. We were numb-minded, not alarmed; no gasps; no fear; until the next day."],"Tags":"City","Date Submitted":"04/07/2013 06:57 UTC","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=33.827684,+-78.662502(46661)&iwloc=A&hl=en\"> mufon case (46661) map </A>","Date of the Event":"12/31/2012 07:20 UTC","Object Shape":"Teardrop","City":"North Myrtle Beach","Country":"United States","Object Features":"Unknown","Disposition":"Unresolved"}