{"Object Shape":"Triangle","Case Number":"4667","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/4667.html.txt","/var/www/straped/mufon/org/4667.html"],"divs":["Sighting DetailsAs above, I was standing on my back porch looking at the full or nearly full moon when a triangular shaped shadow crossed from the lower slightly right edge to the upper slightly left edge of the moon in a straight line. I would estimate the time it took to cross at perhaps three seconds. Then it passed beyond the upper edge and was not visible. I did not notice whether any stars appeared to be blocked out either before or after it passed, but it did not look to me as if the object were near the earth's surface. Of course, I had no way of actually telling how near or far away it would have been. I lived in Los Altos when I was young and was used to seeing jets and other aircraft in the sky, and got used to looking ahead of the noise when there were sonic booms, because whatever was there would be traveling faster than the sound. There was no sound at all when I saw this apparent shadow cross the moon's surface. I just thought it was a UFO because I couldn't think of anything else it would resemble, and as I said, I grew up near Moffit Field and was used to seeing all kinds of aircraft.The point of the triangle which was leading appeared to be facing 'upwards' in relation to the moon, which was near its highest point in the sky. That's about all I can say about the experience. I'll try to look up the date nearer sometime, as it might be in a diary or some other record of my own. I don't know if I ever entered it on this site before - might have you can check."],"Viewing Distance":"Unknown","Date of the Event":"11/30/1998 12:00 UTC","Log Number":"US-04092006-0006","trends":["There have been 127 other sightings in San Francisco","There were no other sightings in San Francisco on or around November 30th 1998"],"Disposition":"Insufficient Data","Source":"MUFON","Date Submitted":"11/30/1998 12:00 UTC","Country":"United States","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=37.7844,+-122.411986(4667)&iwloc=A&hl=en\"> mufon case (4667) map </A>","Longitude":"-122.411986","Summary":"I don't have the correct year or time but will try to look it up later. I was on my back porch looking at the moon probably between ten and eleven thirty when I saw a triangular shadow cross the face of the moon-about 1/16 of total area of full moon.","City":"San Francisco","Object Features":"None","Region":"California","Tags":"City","Latitude":"37.7844"}