{"trends":["There has been one other sighting in Upper Chichester","There were no other sightings in Upper Chichester on or around April 7th 2013","This sighting has never been favorited.",""],"Object Features":"None","Latitude":"39.843594","Case Number":"46670","Disposition":"Unresolved","Source":"MUFON","Date of the Event":"04/07/2013 09:53 UTC","Date Submitted":"04/07/2013 11:38 UTC","City":"Upper Chichester","Region":"Pennsylvania","divs":["Sighting DetailsIt was a clear night for sky watching and I was in the back yard, as I often do, checking objects in the sky. I had been outside since sunset. This incident occurred at 9:53pm. At the time I was following a high flying jet(facing the west)when these 4 definite oval shaped objects crossed my line of sight from left to right. They were traveling in a 'v' formation, equally spaced apart as indicated on the rough sketch I have supplied, going from due North to due South. They were not very bright but bright enough to see their shapes. Initially I considered them to be geese but they were too high and their formation was too rigid, so I discarded that idea. They moved very fast in a straight line across the sky. Much faster than any geese I have personally observed. The entire sighting only lasted no more than 10 seconds(from horizon to horizon). Having had 2 prior observations (1 report filed) of multiple objects traveling together I know these were not any conventional air crafts. Having seen many pictures & videos of UFOs, I would consider these to be UFOs. This was the first time that I have observed 4 objects, in formation, at the same time. The objects continued north and I lost sight of them in the distance. Just for the record, about 5 minutes after the initial sighting another object was seen (by me)by itself, traveling in the same direction. I only wish that someone else had witnessed what I saw tonight. Had others seen this they would really reconsider what they feel about UFOs...and their existence in our sky. At the time I was using high powered star watching binoculars. Specifically they are Zhumell 20 X 80 power binoculars, so I got a better than average view."],"Object Shape":"Oval","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/46670.html.txt","/var/www/straped/mufon/more/46670_submitter_file1__UFOsighting04072013.JPG","/var/www/straped/mufon/org/46670.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.843594,+-75.455719(46670)&iwloc=A&hl=en\"> mufon case (46670) map </A>","Summary":"While watching night sky 4 objects crossed my line of sight at high speed.","Country":"United States","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Longitude":"-75.455719","Weather Factors":"Unknown","Tags":"City","Log Number":"US-04072013-0023"}