{"Source":"MUFON","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.646619,+-121.803208(46674)&iwloc=A&hl=en\"> mufon case (46674) map </A>","Region":"California","Latitude":"39.646619","Date of the Event":"04/08/2013 12:00 UTC","Tags":"City","Log Number":"US-04082013-0003","Object Features":"Patterned Surface, Unknown","Weather Factors":"Unknown","Case Number":"46674","Object Shape":"Other","trends":["There have been no other sightings in Durham","This sighting has never been favorited."],"Date Submitted":"04/08/2013 12:21 UTC","Country":"United States","divs":["Sighting Details1. I was driving home after dropping off my boyfriend at work. I decided to take a photo of the surrounding landscape while on an on-ramp to the 99-North highway just because I thought it looked nice and there was no traffic around me which helped to form a good opportunity to take a photo. 2. I did not physically see the object when the photo was taken-- I had no idea that I was going to be capturing a photo of a UFO. I only noticed the object after looking over the photos I took when I got home. I noticed the object in the first photo I took but not in any of the others. 3. I initially thought that the object may have been a smudge on the windshield but I was not able to find anything on my windshield that resembled the object shown in the photo. 4. Since I did not actually see the object, I don't know what its actions were. However, the picture shows some sort of shape that I'm not exactly sure how to describe. It is colored darkly and is not shiny as far as I can tell. 5. During and after the photo was taken, I felt gleeful and glad to be in the scenario that I was in. 6. I did not ever have sight of the object."],"Disposition":"Unresolved","Sighting Duration":"Undisclosed","City":"Durham","Longitude":"-121.803208","Summary":"UFO found in cell phone photo taken; UFO not seen with eyes but appears in photo","files":["/var/www/straped/mufon/html2text/46674.html.txt","/var/www/straped/mufon/more/46674_submitter_file1__2013040807.54.18.jpg","/var/www/straped/mufon/org/46674.html"],"Object Flight Path":"Unknown"}