{"Object Shape":"Unknown","Log Number":"US-04082013-0006","Longitude":"-111.887991","trends":["There have been no other sightings in Murray","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Features":"Unknown","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/46677.html.txt","/var/www/straped/mufon/org/46677.html"],"Viewing Distance":"Unknown","Summary":"Three lights flying sporadically for roughly 10 minutes, then disappear in a blink of an eye.","Date Submitted":"04/08/2013 01:37 UTC","Date of the Event":"07/10/1987 12:00 UTC","Latitude":"40.666892","divs":["Sighting DetailsThis happened when I was about 7 years old when my family lived in an apartment complex in Utah.It was in between the late summer or early fall, and I was at a birthday slumber party for one of my girlfriends. All the girls, including a few parents, slept out on the tennis court. As we all settled down and looked up at the clear sky full of stars, we suddenly seen what we thought was a shooting star, only it didn't shoot down towards earth like stars normally do...it kind of did a squiggly move and it went so fast that it had a tail of light from the speed? In a funny way I can tell you it looked and moved like human sperm would? Then two more appeared and were moving the same way and all were about the same size. They would shoot off then come back in straight lines, but then they will move in a squiggly pattern off an on, as if they are playing or showing off? After about ten minutes they flew off and never came back. Everyone that was awake during that slumber party on the tennis court witnessed this event. I thought I would see posts or sightings reported by now, but apparently I couldn't find anything? And this happened when I was still only a child and I am in my 30's now. I did suffer a traumatic event as a child, but shortly after this occurred. So this means I can say that I don't think my mental health has anything to do with it. I actually forgot about it until a year of two ago."],"City":"Murray","Country":"United States","Region":"Utah","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.666892,+-111.887991(46677)&iwloc=A&hl=en\"> mufon case (46677) map </A>","Weather Factors":"Unknown","Source":"MUFON","Case Number":"46677"}