{"Region":"Ohio","Object Shape":"Fireball","Longitude":"-81.374057","Date of the Event":"04/09/2013 03:30 UTC","Log Number":"US-04092013-0008","map":"<A HREF = \"http://maps.google.com/maps?q=40.805717,+-81.374057(46689)&iwloc=A&hl=en\"> mufon case (46689) map </A>","Disposition":"Unresolved","divs":["Sighting DetailsAt 3:30AM on April 9th 2013.. I glanced out the window and noticed the sky was glowing south of me. It pulsed orange in color like flames, either inside the clouds or under. It was extremely intense, and did it in a huge part of the southern sky. My first impression was Ashland Oil company off raff road in Canton was exploding or something, I almost called 911 to report it but decided to not to. No noise, or sirens, I also thought it could have been big house fire, or warehouse fire lighting up the sky. Thinking of fire, I got my police scanner out and scanned through, but the radio activity was totally dead, except for an ambulance saying it was arriving at Mercy Medical Center. The sky after about 10 minutes, slowly dimmed within seconds, and it was gone. I searched the canton repository for reports of a fire, and even called them, but no information was given on anything like that happening. Whatever it was, if it was a fire that big, would have to have been reported, like I stated, I thought an Oil company was exploding. My only other guess was it was something above the clouds pulsing an orange light.. but it would have to of been stationary. I don't know how long it was in the sky before I seen it, but it lasted 10 minutes when I spotted it."],"Sighting Duration":"00:10:00","files":["/var/www/straped/mufon/html2text/46689.html.txt","/var/www/straped/mufon/org/46689.html"],"Country":"United States","Object Flight Path":"Stationary","Viewing Distance":"Unknown","Summary":"Intense glowing from the sky, from above the clouds maybe.","Tags":"City","Latitude":"40.805717","Weather Factors":"Unknown","Object Features":"None","trends":["There have been 13 other sightings in Canton","There were no other sightings in Canton on or around April 9th 2013"],"Case Number":"46689","Source":"MUFON","Date Submitted":"04/09/2013 12:49 UTC","City":"Canton"}