{"Case Number":"46684","Object Flight Path":"Path with directional change,Other","Tags":"City","Viewing Distance":"Unknown","City":"Mississauga","Longitude":"-79.669084","Object Features":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/46684.html.txt","/var/www/straped/mufon/org/46684.html"],"Region":"Ontario","trends":["There have been 20 other sightings in Mississauga","There were no other sightings in Mississauga on or around April 9th 2013"],"Weather Factors":"Unknown","Log Number":"CA-04092013-0004","Date of the Event":"04/09/2013 07:05 UTC","Summary":"5+ bright orbs flying in a V pattern, then split up to fly in opposite directions and at crazy spead, over Mississauga ontario","Country":"Canada","Sighting Duration":"Undisclosed","Date Submitted":"04/09/2013 08:31 UTC","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=43.586089,+-79.669084(46684)&iwloc=A&hl=en\"> mufon case (46684) map </A>","divs":["Sighting DetailsIt was around 7:00am, I had just opened the patio door curtains and sat on the couch to look at my e-mails. Less than 5 minutes after I had just settled down I saw bright lights moving in a strange V pattern caught my eye. I work in the airline industry and I know what an airplane moves like, and this was unlike anything I ever saw. I got up and went directly to the glass patio door and noticed that there were at least 5+ of these light orbs flying across the sky (below the dark day break clouds) At first they all were flying in the V formation to the left but then their pattern changed! They went in every direction possible, left right, up down...at that point I got very nervous....7:00 am above Mississauga Ontario, when most people are awake ? It felt uneasy to me..I decided that I could not be alone to witness this so I darted to the bedroom to wake up my fiance. But by the time he got to me most of them had already went up into the clouds. He only managed to get a glimpse of the last one ascending up into the sky."],"Object Shape":"Sphere","Latitude":"43.586089"}