{"Tags":"City","Object Features":"Unknown","Region":"Florida","trends":["There have been 27 other sightings in West Palm Beach","There were no other sightings in West Palm Beach on or around March 21st 2013"],"files":["/var/www/straped/mufon/html2text/46681.html.txt","/var/www/straped/mufon/org/46681.html"],"City":"West Palm Beach","Summary":"Bright white light followed by the loudest boom/bang I've ever heard in the distance to the south. A mystery boom.","Date of the Event":"03/21/2013 04:15 UTC","Date Submitted":"04/09/2013 01:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=26.718632,+-80.049625(46681)&iwloc=A&hl=en\"> mufon case (46681) map </A>","Object Flight Path":"N/A","Object Shape":"Flash","Latitude":"26.718632","Case Number":"46681","divs":["Sighting DetailsOutside at four in the morning and smoking a cigarette, I saw a bright white light in the direction I was looking (south) followed by a chest shaking bang or boom... Almost like the world's loudest gunshot times much more. Called the police over it and was informed that it was likely a transformer though their computers showed no outages. I looked into this type of event and found that it falls under the category of mystery boom. The closest event I can direct people to that's similar to what I saw is a video from surveillance taken in Salem, Massachusetts, albeit I was much further away... the video seems to be very close to the boom. I was several miles but it was very loud and the sound took no time to get to me. I didn't see any reports about this in the area, but I've seen many across the country and feel it should be considered ufo phenomenon. Add West Palm Beach, Florida to the list of places that have experienced a boom. At the time of this posting, more odd events occurred with well known friends in the area. Though this was worth reporting."],"Country":"United States","Weather Factors":"Unknown","Log Number":"US-04092013-0001","Source":"MUFON","Disposition":"Unresolved","Longitude":"-80.049625","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile"}