{"Summary":"6-10ft long cigar shape cylindrical object with greyish dull surface","Object Flight Path":"Straight-line path","Longitude":"-80.838987","Weather Factors":"Unknown","Case Number":"46697","Viewing Distance":"21-100 Feet","Date Submitted":"04/09/2013 09:00 UTC","files":["/var/www/straped/mufon/html2text/46697.html.txt","/var/www/straped/mufon/org/46697.html"],"Country":"United States","trends":["There have been 68 other sightings in Charlotte","There were no other sightings in Charlotte on or around April 5th 2013"],"divs":["Sighting DetailsI was on a US air flight 2646 from Austin Texas to Charlotte NC arriving around 3 pm in afternoon on April 5th. As we made final descent to Charlotte mcdouglas airport , I was looking out my window when I observed a unusual Object that caught my eye . We where roughly 200 feet from the ground when incident occurred. I was looking down at the cars on streets and people in their yards when a fast moving cigar shape object that appeared to be 6-10 ft in length flew past the plane going the opposite direction that the plane was traveling . Like it was leaving the airport and passing us. The object was between the plane and the tree tops, so I was looking down on it at a 45 degree angle. It appeared to be cigar shape with greyish dark dull exterior tapering slightly toward the ends of it .I followed it with my eyes with my fore head pressed against the window , I strained to see it as it disappeared out of view to the rear of the aircraft and was eventually blocked by the depth of the plane window. It appeard to be moving very fast and I tracked it only a couple of seconds before it zipped out of view. Even though the object was traveling in a straight horizontal path it seemed to begin to ascend a short distance after it passed the rear of the plane. I am a non believer in these sort of matters. I only report this out of curiosity of what it was I saw. I thought maby a balloon used for air direction , but I saw no visible teathers on the object and I thought wind indicators would have bright colors to make them visible to pilots. This was dull color and moving at fast rate of speed. I googled such balloons but found nothing like what I saw. I thought if it was a toy floating then flying it near landing planes would be dangerous to the airplane. There were no exterior features like fins or markings. I waited til my trip was over to reflect and finally write what I saw. Curious if it could have been a every day item that I mistook for a strange object. Perhaps a pilot or some one who lives in the neighborhoods near Charlotte airport could explain what it was a saw."],"Date of the Event":"04/05/2013 03:00 UTC","Disposition":"Unresolved","Region":"North Carolina","map":"<A HREF = \"http://maps.google.com/maps?q=35.231307,+-80.838987(46697)&iwloc=A&hl=en\"> mufon case (46697) map </A>","Log Number":"US-04092013-0015","Object Shape":"Cigar","Tags":"City","City":"Charlotte","Latitude":"35.231307","Source":"MUFON","Sighting Duration":"Undisclosed","Object Features":"None"}