{"Region":"Hawaii","Tags":"City","City":"Kapolei","Object Features":"Unknown","Weather Factors":"Windy","Log Number":"US-04102006-0002","trends":["There have been no other sightings in Kapolei","This sighting has never been favorited."],"Date of the Event":"04/05/2006 12:00 UTC","files":["/var/www/straped/mufon/html2text/4669.html.txt","/var/www/straped/mufon/org/4669.html"],"Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Latitude":"21.328596","Country":"United States","divs":["Sighting DetailsMy family and I were wading in Lagoon #3 at Ko Olina, a resort on West Oahu, from about 9:30-11:30AM, April 5, 2006. The weather was typically windy, sunny, with some clouds. At around 10:30-10:45 a pair of F-15s in formation made 2-3 passes over the beach. A third F-15 also made a couple of passes. They appeared to be on landing approach to Hickam AFB and may have touched down a couple times. Around 11AM my wife noticed a formation of white objects in the sky over the ocean to the west about 15 degrees over the horizon and drew our attention to them. I would estimate that they were initially arrayed vertically between 2,000 and 10,000 feet. The objects were drifting, my first thought was that they were large birds--albatross or somesuch. After further observation it became clear that the objects were too far away for us to see them if they were birds, and their altitude was well beyond the range that such birds inhabit. They were giving off their own light, which appeared now to be greenish-white, like stars but appearing in daylight on a sunny day. More objects appeared over the next few minutes. At their peak activity I counted exactly twelve of them at different altitudes. Some of the objects interacted or merged with each other, then separated again. Their darting movements are what initially made them register as birds. By this time other people in the water and at the beach had noticed the strange objects and were observing them with us. The objects gradually drifted south and from our vantage point gained altitude until they were at about 70 degrees relative to our position. The objects individually \"blinked out\" until there were no more than three. These last three grew fainter (presumably they were gaining altitude and putting distance between us) until they all had blinked out. This entire encounter lasted about 10 minutes. The F-15 patrol earlier did not appear to be making any sort of combat maneuvers when we saw them, but I speculate that they may have been at sea patrolling the area where the objects later appeared. One theory could be decoy flares released by an aircraft. However: 1. These objects interacted with each other, and changed direction, which is why we initially mistook them for birds 2. The objects gained quite a bit of altitude during our observation, which is inconsistent with a flare hypothesis. 3. The objects were not bunched or lined up as much as a volley of flares is. They were \"randomly\" distributed over a fairly wide area. I do not believe that these were seabirds for reasons already described and the fact that they were above any reasonable altitude for such birds. I am certain that these were not conventional aircraft. Which makes them unidentified flying objects, that I am reporting to MUFON. I would be curious if you received other similar reports."],"Case Number":"4669","Date Submitted":"04/05/2006 12:00 UTC","Summary":"UFOs - West Oahu","Source":"MUFON","Disposition":"Unknown","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=21.328596,+-158.121253(4669)&iwloc=A&hl=en\"> mufon case (4669) map </A>","Object Shape":"Star-like","Longitude":"-158.121253"}