{"Date Submitted":"04/09/2013 03:21 UTC","divs":["Sighting DetailsI was going back into the house after taking my dog for a potty break. I have been studying the stars with the help of my I PAD. Looking up one last time the stars were blinking out and coming back on. At first I thought tree branches were getting in the way,but realized there were no branches there. I could see no object . I carry a 2 million candle spot light and shone it at the black out stars area. Wow was I surprised to see a triangle shaped craft dull gray. The front was thinner and curved to a wider back. It moved very slowly from west to east. I kept the light on the craft for approximately 3 minutes. Then it started a smooth slow turn to the southeast. It stayed away from the city light glow and stayed in the darker areas. I was losing sight of the object and weny into the house to get binoculars. I went out on the top deck and searched but could no longer see it. The object made no sound.at any time. I live 10 to 20 miles from two airports. I saw one small airplane before and two small airplanes after I saw the object. I had horrible nightmares that night!"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=44.887981,+-89.654305(46692)&iwloc=A&hl=en\"> mufon case (46692) map </A>","Summary":"Triangle thinner near the front","Log Number":"US-04092013-0011","Object Flight Path":"Path with directional change","Longitude":"-89.654305","trends":["There have been 5 other sightings in Wausau","There were no other sightings in Wausau on or around April 5th 2013"],"City":"Wausau","Latitude":"44.887981","Case Number":"46692","Source":"MUFON","Object Features":"None","files":["/var/www/straped/mufon/html2text/46692.html.txt","/var/www/straped/mufon/org/46692.html"],"Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Sighting Duration":"00:03:00","Object Shape":"Triangle","Weather Factors":"Unknown","Date of the Event":"04/05/2013 09:30 UTC","Disposition":"Unresolved","Region":"Wisconsin"}