{"trends":["There have been 5 other sightings in High Point","There were no other sightings in High Point on or around April 8th 2013"],"Summary":"Changed direction from horizontal to straight verticle.","Viewing Distance":"501 Feet - 1 Mile","Case Number":"46694","Date of the Event":"04/08/2013 10:00 UTC","Country":"United States","Longitude":"-80.000878","Disposition":"Unresolved","Region":"North Carolina","Log Number":"US-04092013-0013","files":["/var/www/straped/mufon/html2text/46694.html.txt","/var/www/straped/mufon/org/46694.html"],"City":"High Point","divs":["Sighting DetailsAfter witnessing a large disk shaped object in the sky some months ago I have made it a point to look up in the sky when I go outside. Last night I was outside enjoying the pleasant temperatures and the clear night sky. I observed what I assumed was an airplane crossing over the sky heading generally from North to South. As I watched it I noticed that it was a single, very bright, white light, with no strobes. I didn't think anything about it till it turned and went vertical up into the sky. It went very fast and was so high in 4 or 5 seconds that it was completely gone and out of sight. From what I could tell I would guess that the light was at about 10,000 feet when I first saw it. It changed directions, verticle and very rapidly went up. My best guess is that the light faded out at say, 60 to 80,000 feet. It made no sound at all. I was completely shocked when I saw this and had to think about it for a moment to reason out if I had just seen what I thought I had seen. This occured in the Northern Guilford county area but, was so high from the ground I can't say for sure. I watched the sky for a while to see if I could observe any trace of the craft or any sign that it was some other occurence. All I saw was that in a short period of time two airplanes crossed paths in the exact spot where I saw the light go vertical. I was going to ignore it but, decided to report it here as it might be useful to someone."],"Object Shape":"Circle, Star-like","Source":"MUFON","Tags":"City","Latitude":"35.957032","Object Features":"Unknown","Date Submitted":"04/09/2013 08:01 UTC","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=35.957032,+-80.000878(46694)&iwloc=A&hl=en\"> mufon case (46694) map </A>","Weather Factors":"Unknown","Sighting Duration":"Undisclosed"}