{"Region":"California","Weather Factors":"Unknown","Object Features":"Other","trends":["There have been 3 other sightings in Fort Bragg","There were no other sightings in Fort Bragg on or around March 31st 2013"],"Sighting Duration":"00:08:00","Date of the Event":"03/31/2013 08:30 UTC","Latitude":"39.455203","Disposition":"Unresolved","City":"Fort Bragg","Log Number":"US-04092013-0010","Case Number":"46691","Source":"MUFON","divs":["Sighting DetailsI was on a delivery for a restaurant I work for, and stopped at the customers house, who ordered the food. Upon getting ready to exit my vehicle, I observed an orange orb in the sky. It was cloudy that night, and no stars could be seen. I got out of my vehicle, and saw another orange orb light up in the sky. I called my customers' out to come and see. We all watched a total of 4 of these orange orbs in the sky. I returned to the restaurant, and was telling my co-workers about it. As I was telling one my co-workers, another orange orb appeared in approximately the same area as before. Both of us witnessed this orange orb. The objects were decending in a south westerly direction--glowing bright and fading out with no tail, moving rather slowly. This is not the first time I have witnesses these orange orbs. Myself and a group of approximately 8 other people witnessed them on New Years Eve 2013--just after midnight. I did some research and found they were seen all over the world that night. The objects on this occation were ascending in a north easterly direction. Pretty cool stuff. Peace :D"],"Date Submitted":"04/09/2013 01:16 UTC","Object Flight Path":"Hovering then path,Path with directional change","files":["/var/www/straped/mufon/html2text/46691.html.txt","/var/www/straped/mufon/org/46691.html"],"Tags":"City","Country":"United States","Longitude":"-123.802674","Viewing Distance":"Over One Mile","Object Shape":"Oval, Sphere, Star-like","Summary":"5 Orange Orbs Seen Over Northern California Coast","map":"<A HREF = \"http://maps.google.com/maps?q=39.455203,+-123.802674(46691)&iwloc=A&hl=en\"> mufon case (46691) map </A>"}