{"Object Flight Path":"Path with directional change,Path then hovering","Case Number":"46707","Longitude":"-120.829026","Date of the Event":"04/09/2013 08:30 UTC","divs":["Sighting DetailsFor the past 2 years I have watched the stars nightly before heading inside for the evening. I do so because of previous sightings in Crooked River Ranch and because of an unexplainable sudden connection with the cosmos. Tonight I had already done my couple minute gaze, but had an urge to go back out and take another look. Oddly, I adjusted the canopy on my backyard swing so I could gaze at \"my star\" (the brightest, now in the Western sky). I say oddly here because it was already chilly outside and I have a broken hand so the extra effort on this night was odd. I had almost finished my cigarette when I spotted the orb. I first noticed the brightness and began looking for flashing lights or other indications of usual aircraft. I ruled out any flashes and could clearly see multi-directional movement while approaching me. As it came almost directly overhead I began scrambling for my phone to call my wife outside. While telling her to come outside the orb paused while overhead then continued course towards the E-NE. My wife joined me in viewing at this point and confirmed multi-directional movement, increasing brightness, and no flashing lights. I managed to get a video but it had already moved to our treeline and was too far away to be of any usefulness. While it was approaching I had the feeling that I had already expected this spectacle, and when it was overhead my body tingled from head to toe and I was filled with a feeling of happiness and calmness."],"Latitude":"44.307058","Viewing Distance":"101-500 Feet, Unknown","Region":"Oregon","Sighting Duration":"Undisclosed","Object Features":"Unknown","Source":"MUFON","Tags":"City","Weather Factors":"Unknown","trends":["There have been 3 other sightings in Prineville","There were no other sightings in Prineville on or around April 9th 2013"],"Log Number":"US-04102013-0004","map":"<A HREF = \"http://maps.google.com/maps?q=44.307058,+-120.829026(46707)&iwloc=A&hl=en\"> mufon case (46707) map </A>","Disposition":"Unresolved","Date Submitted":"04/10/2013 06:14 UTC","files":["/var/www/straped/mufon/html2text/46707.html.txt","/var/www/straped/mufon/org/46707.html"],"Summary":"Brilliant white orb moved above head paused, with directional movement, then continued on slowlyA","Object Shape":"Sphere","Country":"United States","City":"Prineville"}