{"Longitude":"27.878303","Date Submitted":"04/10/2013 05:11 UTC","Latitude":"-26.098574","files":["/var/www/straped/mufon/html2text/46706.html.txt","/var/www/straped/mufon/org/46706.html"],"Region":"Gauteng","City":"Roodepoort","divs":["sighting detailson 2013-03-29 me and my family had just moved into our new home we were renting in south-africa roodepoort scrooby street ruimsig. we were 2 adults and 2 children that witnessed the event. we were all sober and were having a barbeque at approximately 20:30 and it was on a friday. the sky was clear with no clouds and only stars. while we were sitting around the fire facing south my son said he observed a weird light in the sky to his left in the east. at first we thought he was joking but then we all looked up and was amazed to see a strange orange\\redish orb with a fire burning inside it moving towards us from east to west in a straight path not going right or left or up or down. the orb was moving slowly at a constant pace and made no noise whatsoever. while we were all watching it moved over our head at 90 degrees. we could all see the fire burning inside. it was defnitely not a flying disc or normal ufo and not matallic at all. my son tried to take a movie with his phone but it was totally blurry and not worth it wich was weird because we saw it clearly like a dull but burning fire inside the orb. we all fealt very peacefull and it was almost like an angelic experience. the orb continued its path right over our heads to the west. we watched it until it finally dissappeared over the horizon. we were all left dumbfounded but in awe of what just happened. the whole experience lasted about 5 minutes. yours sincerely fred"],"Date of the Event":"03/29/2013 08:30 UTC","Country":"South Africa","trends":["There have been no other sightings in Roodepoort","This sighting has never been favorited."],"Viewing Distance":"Unknown","Source":"MUFON","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=-26.098574,+27.878303(46706)&iwloc=A&hl=en\"> mufon case (46706) map </A>","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Case Number":"46706","Summary":"Orange Red Orb seen by me my wife and our 2 children above our new home just before we moved in on 2013-03-29...South-Africa Roodepoort","Object Flight Path":"Straight-line path","Object Shape":"Circle, Fireball, Sphere","Tags":"City","Log Number":"ZA-04102013-0003","Object Features":"Other"}