{"Region":"California","Log Number":"US-04102013-0001","Disposition":"Unresolved","Object Shape":"Triangle","Tags":"City","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-117.057756","Viewing Distance":"20 Feet or Less","Latitude":"32.61202","Summary":"This thing turned his head and looked at me as it flew by my living room , while I was taking the Christmas decorations.","Country":"United States","City":"Chula Vista","Date Submitted":"04/10/2013 03:25 UTC","trends":["There have been 11 other sightings in Chula Vista","There were no other sightings in Chula Vista on or around January 4th 2011"],"divs":["Sighting DetailsLet me first start by saying that after I saw this creature I forgot it for about 2 months. When I remembered, I couldnt stop talking about it to my Mom, husband, friend. I didnt mention it to my granddaughter, son or daughter. The rest of the family werent told either, I was afraid that they would be frightened enough that they wouldnt come over. My house was the house that had all the family gatherings. I guess the other reason I didnt mention it to the rest of the family is my husband teased me and laughed it off saying I had been over medicating. I do take meds but its for diabetes. I didnt like the idea of being laughed at, which leads me to mention now that this occurance was 2 years ago. Today I still cant sleep without having a light on in my family room, I do not stay up late by myself, when my husband goes on business trips I have my Mom stay with me. My husband, mother in law and 2 small dogs were asleep at 2:00am, morning but i was always up late. Taking down the decorations since it was now January and the New Years celebrating was over. I have a short 2 step ladder Im using and reaching up to remove lights attached to living room window when i step down off the ladder and decide to sit down for a break. The lamps are on, tv is playing and I sit on the sofa and i'm doin that when I see something flying by. Not in the middle of the room but closer to the wall where my step stool is. This thing flew, not with wings but like supermam would fly right by me. It was going south but actually turned its head around and looked at me. As it was looking at me it continued in the direction it was headed and flew right through my living room wall. As it flew by and out, my step ladder was right under it, it kicked my step stool so that i heard the metal sound like when someone would step on it or lean on it, metal sound. I could see right through it, i could see my wall, my painting on the wall, I could see right through it but it was clear as day. No loose clothing but a bald head, the funny thing is, the bottom half of this thing was in a triangular shape. Although it turned and looked at me I was frozen, it was just gone. I dont remember going to sleep after that.i couldnt figure out what had just went by. I am catholic and I spoke with my priest about this. In our bible it says there are 2 creatures, angels and demons. I just didnt get the feeling this was either of those. I dont want to say alien but what else is there? I couldnt understand why it came from my family room into my living room all the while my lights were on. It just didnt seem to care if it was seen, right? Or else it could have gone around my house, or even over my house, but it went through a lighted house with me looking right at it. My Mom later asked me if i made the sign of the cross to bless myself. I hadnt, I was so surprised that it had just flown by my desk that had all my blest saints, angels, candles and other statues on what I considered my altar area and it flew by with little consideration for any of that. I have since had my house blessed again but I really dont think it was demonic, I think it was alien. I hear noises and I wonder, is it coming back? Is this a regular pathway? From north to south? I laugh, me, a little mexican american woman in Chula Vista being visited. Its scary."],"map":"<A HREF = \"http://maps.google.com/maps?q=32.61202,+-117.057756(46704)&iwloc=A&hl=en\"> mufon case (46704) map </A>","Source":"MUFON","files":["/var/www/straped/mufon/html2text/46704.html.txt","/var/www/straped/mufon/org/46704.html"],"Object Features":"Other","Date of the Event":"01/04/2011 12:00 UTC","Case Number":"46704"}