{"Weather Factors":"Unknown","Case Number":"46728","Viewing Distance":"21-100 Feet","Date Submitted":"04/11/2013 01:08 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.687824,+-86.670282(46728)&iwloc=A&hl=en\"> mufon case (46728) map </A>","Object Shape":"Triangle","Log Number":"US-04112013-0002","divs":["Sighting DetailsI would like to start by stating for the record that I am prior-service military and am a trained observer. I was sitting in my bedroom at approximately 12:30AM with my window open when I heard a jet engine-like sound. I looked out of my window and observed a dark craft of triangular shape flying roughly 100 feet above treetop level, moving steadily along a southwest heading. It had a red signal light at the center of its ventral surface and white running lights on all three points. I thought it was an aircraft in distress because there are no airfields near my house and it displayed what appeared to be landing lights. I assumed it was an aircraft making an emergency landing. I immediately ran outside. I live in a residential lake of respectable size, with houses close together. While looking for the craft, I saw three more craft of the exact same configuration at approximately the same altitude (100 feet above treetop) and all of them were following the same southwest heading. One passed over my house and I clearly saw a dark hull. It was a solid craft. I am a believer in extraterrestrial life but I have never witnessed a UFO before tonight. I am both confused and excited. I lost sight of all four craft as they continued along their heading and out of my line of sight."],"Country":"United States","Sighting Duration":"Undisclosed","Latitude":"39.687824","Longitude":"-86.670282","trends":["There have been 2 other sightings in Coatesville","There were no other sightings in Coatesville on or around April 11th 2013"],"Source":"MUFON","City":"Coatesville","Disposition":"Unresolved","Object Features":"Other","Date of the Event":"04/11/2013 12:00 UTC","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/46728.html.txt","/var/www/straped/mufon/org/46728.html"],"Summary":"Multiple triangular craft over residential lake.","Region":"Indiana","Tags":"City"}