{"Weather Factors":"Unknown","Country":"United States","Latitude":"39.252123","map":"<A HREF = \"http://maps.google.com/maps?q=39.252123,+-76.516688(46729)&iwloc=A&hl=en\"> mufon case (46729) map </A>","Date Submitted":"04/11/2013 01:15 UTC","divs":["Sighting DetailsVery beautiful, and positive frequency from it. Seemed as if they were having fun. The flight pattern was straight up to the sky, coming straight towards me at a alarming rate like nothing ive ever seen before, i thought it was a nuclear bomb! Then all of a sudden it reduces its speed and slightly turns like a motorcycle wood, then increases speed again and is headed to a whole other direction 90 degrees right of them. Then the spacecraft moved as if it wanted to be seen, was like a dish with top as usually interpreted. Blue lights circulating the dome and every turn a white light sparks, u can clearly see the shape of the objects because how clear it was! The blue was vibrant and different i liked it, im just a young man from baltimore i have a great video i promise on my life i will drop dead right now if im exaggerating anything, i am happy to experience somthing that the WHOLE WORLD is questionable about. Give me a call guys thanks!"],"Date of the Event":"04/10/2013 10:45 UTC","Tags":"City","Log Number":"US-04112013-0003","Object Features":"Dome, Patterned Surface","Source":"MUFON","Summary":"Very beautiful, and positive frequency from it. Seemed as if they were having fun. The flight pattern was straight up to the sky, coming straight towards me at a alarming rate like nothing ive ever seen before, i thought it was a nuclear bomb!","Object Flight Path":"Path with directional change","Longitude":"-76.516688","City":"Dundalk","trends":["There have been 3 other sightings in Dundalk","There were no other sightings in Dundalk on or around April 10th 2013"],"Object Shape":"Bullet, Missile, Cylinder, Disc, Oval, Saturn-like, Star-like","Viewing Distance":"101-500 Feet","Region":"Maryland","Case Number":"46729","Disposition":"Unresolved","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/46729.html.txt","/var/www/straped/mufon/org/46729.html"]}