{"Sighting Duration":"00:01:00","Source":"MUFON","City":"Ambridge","map":"<A HREF = \"http://maps.google.com/maps?q=40.607323,+-80.206449(46724)&iwloc=A&hl=en\"> mufon case (46724) map </A>","Summary":"Blue halogen colored lights, progressive wave-like light, no blinkers such as a plane","Latitude":"40.607323","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/46724.html.txt","/var/www/straped/mufon/org/46724.html"],"Tags":"City","Disposition":"Unresolved","Country":"United States","Log Number":"US-04102013-0008","Date of the Event":"04/08/2013 09:00 UTC","trends":["There have been no other sightings in Ambridge","This sighting has been favorited 1 time."],"Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Date Submitted":"04/10/2013 09:03 UTC","Region":"Pennsylvania","Viewing Distance":"Unknown","Case Number":"46724","Object Features":"None","divs":["Sighting DetailsI was walking my dog prior to bed as I do every night. I always have been intrigued by UFO's and have seen a couple before so I tend to glance at the sky and just observe in case there is something odd. When I first saw the light I thought it was a plane, it looked like a conventional aircraft at a glance. I don't know why I even kept looking, but I did. I noticed that the light had a flowing pattern to it. It would light and seemed to follow a curved, sphere like or circular pattern. It was a blue halogen light type color, and there were no strobe, or blinker lights, as u would see on a plane or conventional craft, so I kept looking. The craft appeared headed for a cloud bank and looked like it would disappear soon. Prior to reaching this bank, when there was still a visible space between the craft and the clouds, it disappeared completely. I continued watching as there was an opening in the path of the craft where it would soon be visible again, but I never did see it again. After seeing it and thinking about it, I realized that a conventional craft would have had some form of red and green blinking light associated with it. I found it exciting, the unknown is always something that has intrigued me. This may not be the most incredible sighting, but I wanted to report it as I had never completed this after my previous sightings."],"Longitude":"-80.206449"}