{"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=46.661425,+-120.524077(46730)&iwloc=A&hl=en\"> mufon case (46730) map </A>","Tags":"City","Date Submitted":"04/11/2013 03:47 UTC","trends":["There have been 2 other sightings in Selah","There were no other sightings in Selah on or around August 11th 2006"],"Weather Factors":"Unknown","Log Number":"US-04112013-0004","Summary":"Red circle moving across sky. Meets up with second red dot and they play in sky.","Viewing Distance":"Over One Mile","Disposition":"Unresolved","Source":"MUFON","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/46730.html.txt","/var/www/straped/mufon/org/46730.html"],"Region":"Washington","Date of the Event":"08/11/2006 12:00 UTC","Country":"United States","City":"Selah","divs":["Sighting DetailsIt was a Summer night (I am going to say probably 7yrs ago.) I had just set up my telescope as it was starting to get dark. As I am setting it up I look up into the sky above the mountain behind my house. This mountain is an Army training center and the only aircraft there are helicopters. I see this bright red dot appear in the the sky to the SE. It was stationary not moving and was a steady red color with no blinking lights. As I am staring at this Red circle I see another Red circle appear directly above the mountain and slowly move toward the first red circle. The second red circle eventually gets to the fist red circle. NOTE that this circle is identical to the other one. Solid red and not blinking. The two red circles are sitting motionless in the sky next to one another. Pretty soon the second red circle which is to the left of the other red circle from my point of view rotates so that it is now above the other. It did this smoothly in an arc type movement. The two circles sit there for another minute then the red circle on top moves back down next to the other red circle just like it was before. Again they sit motionless in the sky (No sound and it was a clear night) pretty soon they start moving slowly to the SE over the hill and out of sight. I have lived on this property for 32yrs. I was born and raised here so I am very familiar with the helicopters that fly over head. 99% of them are blackhawks with the occasional Huey back in the day and an occasional Apache. With how clear the sky was the night this happened there is absolutely no way I would not be able to hear helicopters at 1000 or so feet in the air. The sound of the blades echos throughout the area even on cloudy days you can hear them. Also, all the helicopters around here have blinking lights and don't glow a solid red and are silent. I immediately called Air traffic control at the airport in the next town which is 10 miles away and they said the only thing that they show in my area was 1 small light aircraft. A couple minutes after talking with the tower that small aircraft flew over my house going NE. I am convinced this was not a helicopter. It sure as hell wasn't a plane because planes don't sit still in the sky making no noise. When all this started happening I yelled for my dad and he came outside and witnessed everything as well."],"Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Case Number":"46730","Object Shape":"Sphere","Latitude":"46.661425","Longitude":"-120.524077"}