{"Date of the Event":"04/06/2013 08:40 UTC","Region":"Alabama","Object Shape":"Circle, Star-like","Latitude":"33.528451","Summary":"looked up thur tree saw light moving. kept following to see if an airplane. continued a slow-moving line overhead. then it disappeared over a distance.","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.528451,+-86.79607(46747)&iwloc=A&hl=en\"> mufon case (46747) map </A>","Viewing Distance":"Over One Mile","Log Number":"US-04122013-0008","Longitude":"-86.79607","trends":["There have been 48 other sightings in Birmingham","There was one other sighting in Birmingham on or around April 6th 2013"],"Tags":"City","Case Number":"46747","Source":"MUFON","City":"Birmingham","divs":["sighting detailsi live at inntownsuites room 212, back edge of bldg. i always take notice of orion belt,ever since a kid it's always overhead, which is why i saw this light moving in the southwest sky. it was very shinny like a star but moving towards the city of homewood or busy roads ahead. more or less a large dot of brightness slowly crossing the sky overhead & into the neighborhood to the east of me. i was surprised & wished someone was with me. i lost sight it just disappeared as i watched it in the sky. if it had gone further it would have been over a busy area of town, shopping centers, fast food, and major roadways. i have lived at this spot for about 4 years. in the last year or so say 2011 till the present i have been amazed at what i have scened. this area is where the hotel is located kinda in a business zone,other than the night-shift workers at pepsi\\mt.dew and barber's diary. i could tell of other incidents but don't remember dates and details as well i listen to coast to coast heard someone say we should report what we are seeing. for some reason i began seeing more than i bargan for."],"Object Features":"Dome","Date Submitted":"04/12/2013 06:50 UTC","Weather Factors":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/46747.html.txt","/var/www/straped/mufon/org/46747.html"]}