{"Object Shape":"Sphere","trends":["There has been one other sighting in Homewood","There were no other sightings in Homewood on or around April 5th 2013"],"City":"Homewood","Object Features":"None","Log Number":"US-04132013-0001","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/46750.html.txt","/var/www/straped/mufon/org/46750.html"],"Case Number":"46750","Weather Factors":"Unknown","Latitude":"41.553413","Sighting Duration":"00:00:05","Date of the Event":"04/05/2013 12:00 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.553413,+-87.641893(46750)&iwloc=A&hl=en\"> mufon case (46750) map </A>","Summary":"Witnessed green orb hovering over quarry on I-80 near Chicago.","Longitude":"-87.641893","divs":["sighting detailsmy girlfriend and i were on our way home from the gas station around 11:50pm - 12:10am between friday night\\saturday morning on april 4th\\5th 2013. we were in the car and almost home, we were driving down a street that turns into cul-de-sac. we preceded for about 150 feet when we both felt like we needed to look up at the sky in front of us. we looked up at the sky and saw a ufo that seemed to be hovering between 1500 and 2500 feet over the thorton quarry on i-80 about 30 minutes south of chicago. it appeared for about 5 seconds and seemed to be descending very slowly. it barely descended and then disappeared. it did not fade out, just disappeared. it was like somebody turning off a flashlight. we stopped and kept watching the sky for about 5 minutes but we didn't see anything else, not even a trail. we were totally shocked and tried to figure out what else it could be. it was too low in the sky to be an airplane and there is no way it was a helicopter. it was absolutely silent and hovering perfectly steady. the quarry that it was hovering over is actually one of the largest quarries in the world."],"Disposition":"Unresolved","Region":"Illinois","Date Submitted":"04/13/2013 12:11 UTC","Country":"United States"}