{"Tags":"City","Date of the Event":"04/12/2013 11:49 UTC","divs":["sighting detailsleft my house to go to the grocery before a midnite closing time. i was 1\\4 mile from home in a large urban neighbor hood 1\\4 mile from a main thorough fare (state st 3700 block i was on taft 1 block from 36th st.) saw a red light in the se over houses and trees on south side of road. bright red with orange rays extending in front of its path. the rays were numerous and appeared like lens distortion with the naked eye. i examined it expecting it to be a plane but no other lights were visible. there was a very low cloud ceiling that was lit up from the streetlights of boise. the object was clearly lower than the clouds. i then wondered about the chinese lantern possibility but it was very bright. i pulled over the the side of taft and jumped out and realized it was moving toward me. it approached at about the speed of a small plane but completely silent. just then a man stepped out into the street and began moving his garbage can. i said, \"hey look up!\" he responded by asking what it was just as it passed over head. almost directly overhead but slightly east of us. i said that it was a ufo and he said he was glad i was there to confirm that we both saw it. i removed my cellphone and took a photo and started filming as it passed over the houses to the ne. as it began to gain some distance i attempted to make a call to someone at my house. my siri function answered that \"i'm sorry but that isn't possible at this time\" (cell service failure? i don't know) i tried again and call went thru but object was out of sight. photo is shakey and video does show object for 20 seconds as it gained distance."],"Date Submitted":"04/13/2013 08:11 UTC","Sighting Duration":"Undisclosed","Country":"United States","Object Flight Path":"Straight-line path","Summary":"Low flying bright red starlike light flying under clouds SE-NW silent emitting orange rays","Source":"MUFON","Viewing Distance":"101-500 Feet","Object Shape":"Star-like","trends":["There have been 69 other sightings in Boise","There were no other sightings in Boise on or around April 12th 2013"],"Weather Factors":"Unknown","City":"Boise","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.648088,+-116.233947(46756)&iwloc=A&hl=en\"> mufon case (46756) map </A>","Latitude":"43.648088","Log Number":"US-04132013-0007","Region":"Idaho","Longitude":"-116.233947","Case Number":"46756","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/46756.html.txt","/var/www/straped/mufon/org/46756.html"]}