{"Disposition":"Unknown","Case Number":"4675","Source":"MUFON","Weather Factors":"Unknown","Tags":"City","trends":[],"files":["/var/www/straped/mufon/html2text/4675.html.txt","/var/www/straped/mufon/org/4675.html"],"Region":"Montana","Object Shape":"Triangle","Object Features":"Undisclosed","City":"Undisclosed","Log Number":"US-04122006-0002","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Latitude":"46.887682","Viewing Distance":"Unknown","Longitude":"-110.357646","divs":["Sighting DetailsI was at home 3813 Vigilante Drive Great Falls MT, I was taking my dog out after supper about 8:00 PM.As soon as we got out in the yard, I noticed a black triangle at 10:00 in the sky.I knew it was an unidentifiable flying object as soon as I saw it.It was a black triangle. It was \"hanging\" vertically in the sky in one place. after watching it for about 30 seconds it moved quickly and erratically up and to the left(south), then back down in the same manner to the original position. I kept expecting it to disappear, but when after a short while it was still there, I figured I had nothing to loose by running to get my neighbor to witness it with me.She agreed that I was seeing what I thought I was seeing, and I left her and got my neighbors on the other side, husband and wife. There was no sound, it definitely wasn't a plane, jet or helicopter, or a bird. I did get my camera and took pictures, but when the light flashed to turn on the flash, I did, and all that did was reflect off my white fence and you can't see it(the object) in the sky. Only one picture, the first, came out. It looks so much smaller in the photo than it did looking at it in person. My neighbors and I are the only ones that know what that photo actually looked like when I took it. Then it started moving west and north, vertical, then horizontal, almost disappearing when it did this, then vertical and so on until it disappeared beyond the horizon. I am at the library and have no way to attach the photo."],"Country":"United States","Date Submitted":"04/11/2006 08:15 UTC","Date of the Event":"04/11/2006 08:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=46.887682,+-110.357646(4675)&iwloc=A&hl=en\"> mufon case (4675) map </A>","Summary":"Took the dog out, looked up and saw black triangle \"hanging\" at 10 o'clock. It moved quickly and erratically up and to the left, then back to first position. I ran and got neighbors to witness."}