{"Longitude":"-85.370917","Sighting Duration":"00:03:00","Region":"Indiana","Latitude":"39.925735","Tags":"City","trends":["There has been one other sighting in New Castle","There were no other sightings in New Castle on or around April 13th 2013"],"Log Number":"US-04132013-0012","Date Submitted":"04/13/2013 10:43 UTC","Weather Factors":"Unknown","Summary":"round yellow light seemed to rise the whole time it passed over rapidly and without sound appearance never changed as it passed over seemed to climb out of sight round fireball in appearance with no tail","divs":["Sighting Detailsi went out on my porch to smoke. i noticed a bright yellow light rising over my nieghbors house heading my direction.i thought it was landing lights but it was not white. as it passed over my house i was listening for sound and looking for beacon lights but there were none. i got off my porch to look back southeast as it passed over and it remained the same bright round yellow fireball looking light it appeared as it was coming towards me. it maintained the same rapid southeast risung course untill it vanished . i know it was rising bacause i did not have to go to the back yard to see it fly out of sight. it seemed quite low and close when i first saw it like it had just taken of from the northwest side of new castle. i have never seen anything like this before. i called the sheriffs department to see if anyone else had reported anything strange. he said people did not usually report these things. he did say that the northern lights were apparently visible on this night wich is extremely rare. this was not the northern lights nor was it a meteor. it was a craft of some kind. just not any craft i have ever seen. if you get any more reports on this sighting here tonight please inform me im baffled and do not want to feel crazy."],"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/46761.html.txt","/var/www/straped/mufon/org/46761.html"],"Viewing Distance":"Unknown","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=39.925735,+-85.370917(46761)&iwloc=A&hl=en\"> mufon case (46761) map </A>","Country":"United States","City":"New Castle","Date of the Event":"04/13/2013 09:15 UTC","Object Shape":"Fireball","Object Flight Path":"Straight-line path","Source":"MUFON","Case Number":"46761"}