{"Viewing Distance":"501 Feet - 1 Mile","City":"Hagerstown","Log Number":"US-04142013-0005","Object Features":"Unknown","Region":"Maryland","map":"<A HREF = \"http://maps.google.com/maps?q=39.669915,+-77.732526(46769)&iwloc=A&hl=en\"> mufon case (46769) map </A>","Disposition":"Unresolved","divs":["Sighting DetailsMy girlfriend and I had been looking for the Northern lights in our back yard earlier in the evening and became restless because we didn't see anything. We just assumed it was because of light pollution from the surrounding area so we went inside to watch the Capitals hockey game and kept checking Facebook for any local reports of the Northern lights. Our plan was to run outside if anyone reported seeing the pretty colors in the sky so we could get a glimpse of this phenomenon, since it might have been a once in a lifetime event in Maryland. This was the plan. We both fell asleep around 9:30 P.M. I woke up around 11P.M. and went to the kitchen to get a drink. I woke Amy up and she got on Facebook to check for any sightings of the Northern lights. I managed to look at the microwave clock because the door to the backyard is in the kitchen and that is when I noticed the time. I walked out the backdoor and in to the backyard while Amy was still on the computer. I was looking to the North for a minute or two and noticed nothing unusual. I happened to glance down closer to the horizon and to my right, which would have been east when something caught my eye. It appeared to be something moving slowly from east to west. I couldn't see what it was and the only reason I noticed it was because it blocked out the stars behind it as it moved. It made no sound and I thought it must just be a small cloud or smoke. The sky was perfectly clear, not a cloud in the sky. All of a sudden a perfect triangle of three lights appeared from this invisible craft or cloud and began to spin clockwise. At first I thought is was spotlights but then it began to move in a fast straight line to the west. The lights didn't blink, they were solid white the entire time. The object slowed down, the lights continued to spin and it just disappeared. I was dumbfounded. I love the paranormal and UFO programming on t.v. but am extremely skeptical because I had never seen anything to make me believe it to be true. If what happened next didn't happen I would still be somewhat skeptical. Right after the first object disappeared, a second triangle of lights appeared about halfway across the horizon, followed a similar path but this one seemed to appear, disappear, then reappear moving in a straight line to the same spot as the first object. It then seemed to, what I can only describe as disappear behind a veil, but the sky was clear, no clouds. At this point I was shocked and had crazy goose bumps. I began to yell for my girlfriend who I could see sitting in the dinning room on her laptop. I would have yelled for her to come outside to see it but it all happened in about a 10 to 15 second span. She came outside and tried to calm me down but I was 100% sure that I had just seen a real UFO and this scared her. We continued to look for it to reappear and that is when we both saw what appeared to be the shape of a flock of geese followed by two bright greenish white lights. This freaked her out and made me feel like I wasn't crazy. These other lights continued for about another hour on and off and in differing arrays and in different parts of the sky. Anywhere from one to four light in a straight row moving at varying speeds. We could see planes in the distance and these were not planes. Nothing we saw together was the same or as vivid or close as the triangles that I originally saw though. I don't know what I saw last night but it is unlike anything I have ever seen."],"Summary":"Looking for the Northern lights when three rotating triangular lights appeared low in the sky moved quickly in a straight line from east to west stopped then disappeared.","Object Shape":"Boomerang, Triangle","files":["/var/www/straped/mufon/html2text/46769.html.txt","/var/www/straped/mufon/org/46769.html"],"Object Flight Path":"Straight-line path","trends":["There have been 10 other sightings in Hagerstown","There were no other sightings in Hagerstown on or around April 13th 2013"],"Country":"United States","Tags":"City","Case Number":"46769","Latitude":"39.669915","Date of the Event":"04/13/2013 11:20 UTC","Sighting Duration":"Undisclosed","Source":"MUFON","Date Submitted":"04/14/2013 10:26 UTC","Longitude":"-77.732526","Weather Factors":"Unknown"}