{"map":"<A HREF = \"http://maps.google.com/maps?q=34.80298,+-86.7554(46764)&iwloc=A&hl=en\"> mufon case (46764) map </A>","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Object Features":"Other","Disposition":"Unresolved","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was letting my dog out to pee around 9:30pm tonight. This is the same scenario for my last UFO sighting several years ago. I'm looking up at the sky, 'wow'ing over how vivid the stars and moon are tonight. I stood up on top of a stone chair in the backyard in order to see the stars more clearly from the tree branches that were in the way. As I stood up I saw a flash of a white shooting star quickly pass upward but then just as quickly descended in a quick right turn and (I assume) disappeared because it went over the top of the roof where I could not see it. I ran to the front yard but it was gone. I don't know if it was a shooting star with a weird trajectory or some other strange but natural phenomenon. I had just woken up from a nap in which I dreamed of looking at the sky and seeing several UFOs and then posted on Facebook about my previous UFO sighting several years ago. So that was a bit weird and coincidental. After my first UFO sighting I have become a complete believer. I am only interested in what they are...if they are ET or our own government. I would love to know the answers to this enigma just like everyone else. Ever since my first sighting, I have been absolutely fascinated with the subject. I feel grateful that I have been enlightened and able to witness some of these amazing events happening in our sky."],"Viewing Distance":"Unknown","Case Number":"46764","Source":"MUFON","Tags":"City","Summary":"White glowing 'shooting star' that changed direction","Longitude":"-86.7554","Log Number":"US-04142013-0001","Region":"Alabama","Date of the Event":"04/13/2013 09:30 UTC","trends":["There have been 4 other sightings in Madison","There were no other sightings in Madison on or around April 13th 2013"],"City":"Madison","files":["/var/www/straped/mufon/html2text/46764.html.txt","/var/www/straped/mufon/org/46764.html"],"Latitude":"34.80298","Date Submitted":"04/14/2013 12:02 UTC","Country":"United States","Object Shape":"Bullet, Missile, Star-like"}