{"trends":["There have been 3 other sightings in Los Lunas","There were no other sightings in Los Lunas on or around December 14th 2012"],"Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Date of the Event":"12/14/2012 03:30 UTC","Date Submitted":"04/14/2013 03:13 UTC","Log Number":"US-04142013-0011","Summary":"large dull gray craft decended out of a storm cloud over Los Lunas, NM then headed SE behind a mesa. it wa to my left as i headed w on I-40.","Region":"New Mexico","Longitude":"-106.72926","Latitude":"34.811076","divs":["Sighting Detailsi was driving west on I-40 and was watching the sky as i topped 9 mile hill. As i continued to drive the clould started becoming more defined. as i passed the old canyoncito exit i still could see the cloud and then the craft came out of the cloud. it was half the size of the smaller mesa and lowered below the larger mesa. that is when i knew it was something more than the cloud. as it decended below the mesa it was slowly turning clock-wise, reminding of how an electric meter turns. i was afraid to stop and the weather was cold and windy that afternoon, and no other cars were stopping. i didn't think that i was \"spiritualizing matter\" because i never heard of a descripton like this, but i watched it for about 5 to 10 minutes. it was maybe a quarter mile in width,i don't know what the height could have been. there were no windows or lights, and i thought it might be a hologram since it was clouldy, but it was slowly moving and spinning.it was a dull gray that was the same color as the cloud before decending. it slowly moved between the mesa and at that time i was at the Los Lunas exit, after that i could not locate it in my rear view mirror. i think i called David Jacobs PhD, and or ICAR and left a voicemail. on monday my neighboor across the street came over and i told her about the ufo. she told me her relatives had stopped by on friday and they were upset after seeing something in the sky that looked like a merry go round on their way back from grants, nm to san fidel. the shape i saw was like a round layer cake in shape. during that next week there was unusual military activity, my landlord had seen some type of craft above the area hovering with a humming sound but the trees were not disturbed. he is a vetran and knows ths shapes and sounds of most military aircraft. we later called kirkland air force base and reported the low flying military craft and the two ufos. it was reported to base public affairs.i am not sure if this activity was due to local pueblo tribes conducting ceremonies.i was seeing orbs on and off for over a week that cause distress and panic. this object seemed to be very solid and i din't feel that goverment technology could produce something that masssive and dense. last visual i had it was traveling between the two mesa's."],"Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=34.811076,+-106.72926(46774)&iwloc=A&hl=en\"> mufon case (46774) map </A>","files":["/var/www/straped/mufon/html2text/46774.html.txt","/var/www/straped/mufon/org/46774.html"],"Weather Factors":"Unknown","Object Features":"None","Country":"United States","Tags":"City","City":"Los Lunas","Source":"MUFON","Disposition":"Unresolved","Case Number":"46774","Object Shape":"Other"}