{"Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Object Features":"None","trends":["There has been one other sighting in Beaufort","There were no other sightings in Beaufort on or around January 10th 2013"],"divs":["Sighting Details First saw these sitting on my back porch, which faces carrot island. Three large red-orange orbs. The light seems to be pulsating from within. They were following the coastline in a v formation, very slowly, toward Atlantic Beach. I first thought they were helicopters, until the first one stopped and hovered then the other two followed suit and they stayed there for 2 or 3 minutes making no sound at all. I was close enough I would have heard some kind of noise. Then one after the other they they took off straight up with lightening speed and disappeared. I First saw these glowing orbs in the fall of 2011. Last sighting was Jan, 2013. I have witnessed them, and there is always three, about eight times so far. Sometimes they are moving in the opposite direction (from Atantic Beach towards Harkers Island). Sometimes they shoot straight up, stop, zig zag, disappear, reappear then descend back to where they were all with lightening speed (definitely not a helicopter). I have never felt scared,I actually enjoy watching them. The pictures I have taken never turn out. Just wondering if anyone else in this area has witnessed the same thing."],"map":"<A HREF = \"http://maps.google.com/maps?q=34.718217,+-76.663819(46779)&iwloc=A&hl=en\"> mufon case (46779) map </A>","Log Number":"US-04152013-0002","Date of the Event":"01/10/2013 12:00 UTC","Country":"United States","Summary":"3 large red-orange orbs following the coastline.","Sighting Duration":"Undisclosed","Region":"North Carolina","City":"Beaufort","Source":"MUFON","Case Number":"46779","files":["/var/www/straped/mufon/html2text/46779.html.txt","/var/www/straped/mufon/org/46779.html"],"Tags":"City","Date Submitted":"04/15/2013 01:24 UTC","Viewing Distance":"Over 1 Mile, Unknown","Object Shape":"Circle","Longitude":"-76.663819","Weather Factors":"Unknown","Latitude":"34.718217","Disposition":"Unresolved"}