{"Viewing Distance":"Unknown","Object Features":"Unknown","divs":["Sighting DetailsWe had a fire going in the back yard hanging out with several friends. Around 9PM (around about). We hear a loud explosion like maybe a car accident. Then we noticed the power went out in the neighborhood. We call the power company and they said there was reported 1100 outages already. We think--Oh, a transformer blew maybe a car crashed into a pole or something. Maybe that's what the noise was. No biggie--we've got a fire going, we're having fun. About 15 or so minutes pass and we see a quick streak across the sky then it stopped and moved steady across the sky. It was a reddish-orange color. No flashing, no crazy movement. Just steady through the sky in a straight path. My first thought--Oh, maybe it's a helicopter because of the loud crash we heard. But there was no spotlight coming from it and no noise. Then we see another one. This one didn't move fist then slow down. It just moved slowly across the sky. Our friends house that we were at is in a wooded area but off a main road through Raleigh. When we first see the orange light it looks like it's just over the tree tops then went into the horizon. We saw a total of 6, one after another. Between 2 and 5 minutes apart. Another friend of ours shows up and he said that the main road is blocked off in several directions and the officer said that a tree fell and took out some powerlines. Power was restored at 11:30 When my husband and I left there is an intersection if we turn right and all of it is blocked off. That intersection is directly behind the neighborhood we were in. We trun around and the next intersection down is also closed off. There is also a right trun between the 2 intersections and it was also closed off. If a tree fell why were there several areas blocked off? We had to take a back road to get to the main road we needed to take. Also, if power was restored at 11:30PM and we left at 2:30AM--why were they still blocked off in several directions and still working in the area. The whole experience was strange. In the video I took I asked \"It would have a soptlight, right\" I asked that becasue someone said it was probably a helicopter. The light looks like it's flashing but it's not. It's just goin behind trees. Sorry it's shaky video--I was walking."],"Summary":"Solid orange lights (6, one after another) moving steady across the sky.","files":["/var/www/straped/mufon/html2text/46771.html.txt","/var/www/straped/mufon/org/46771.html"],"Source":"MUFON","Country":"United States","Latitude":"35.769223","Region":"North Carolina","map":"<A HREF = \"http://maps.google.com/maps?q=35.769223,+-79.01457(46771)&iwloc=A&hl=en\"> mufon case (46771) map </A>","City":"Undisclosed","Weather Factors":"Unknown","Date of the Event":"04/13/2013 09:00 UTC","Object Shape":"Circle","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Flight Path":"Straight-line path","trends":[],"Longitude":"-79.01457","Date Submitted":"04/14/2013 11:52 UTC","Log Number":"US-04142013-0007","Case Number":"46771","Tags":"City"}