{"divs":["sighting detailsi have been keeping an eye on the sky off and on for 45+ years. even a member of a ufo club for a short time around 1967 called project blue star. i'm ex military and am familiar with many aircraft. i was sitting in my driveway at 11pm on the night of aug 14, 1999 when i first saw two objects at 2 o'clock move from east to west at a high rate of speed almost straight overhead. their altitude seemed to be above jets and below satellites. they were offset by a short distance and could not tell if there were 2 objects or one. did not see an outline of a craft that the orbs were attached to. they were about the size of a quarter at arms length and were perfect circles, they had no fuzzy edges to them. they had their own light source - yellow\\orange. it was like i was watching a cartoon on a huge screen! i had a small 20x scope with me but i knew that if i tried to find them, they would have disappeared before i could focus in on them, so i observed them with the naked eye. sighting lasted about 5 seconds or so and disappeared in the distance (not over the horizon). they appeared to maneuver around each other slightly as they disappeared. heard no sound and the weather was warm and clear. stayed out until around midnight but saw nothing else except satellites and an occasional plane\\jet. had very little reaction to the sighting since almost nothing seems to phase me. it certainly was not a conventional aircraft."],"Source":"MUFON","Viewing Distance":"Over One Mile","Date Submitted":"04/15/2013 10:17 UTC","Disposition":"Unresolved","Object Shape":"Circle","Country":"United States","City":"Grandville","Latitude":"42.916008","Case Number":"46785","Sighting Duration":"00:00:05","Tags":"City","Region":"Michigan","Object Flight Path":"Straight-line path","Object Features":"None","Longitude":"-85.760898","map":"<A HREF = \"http://maps.google.com/maps?q=42.916008,+-85.760898(46785)&iwloc=A&hl=en\"> mufon case (46785) map </A>","Date of the Event":"08/14/1999 11:00 UTC","trends":["There have been 4 other sightings in Grandville","There were no other sightings in Grandville on or around August 14th 1999"],"Log Number":"US-04152013-0008","Summary":"Two perfect yellow/orange circles crossed sky from east to west in 5 seconds. Altitude above jets but below satellites. Looked like a cartoon!","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/46785.html.txt","/var/www/straped/mufon/org/46785.html"]}