{"Object Flight Path":"Path with directional change","Latitude":"42.282128","Disposition":"Unresolved","Date of the Event":"04/06/2013 01:08 UTC","Region":"Michigan","Date Submitted":"04/15/2013 10:23 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.282128,+-83.747071(46786)&iwloc=A&hl=en\"> mufon case (46786) map </A>","Viewing Distance":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/46786.html.txt","/var/www/straped/mufon/org/46786.html"],"City":"Ann Arbor","divs":["Sighting DetailsDuring the early hours of Saturday, April 6 in the year of our Lord 2013, myself and a close friend were sitting on the porch of my home waiting for another friend to arrive. For no apparent reason, or a reason I cannot explain or fully understand, we both looked into the sky at the same time and noticed a triangular shaped flying object unlike any other aircraft I have seen. It was dark blue color, as if trying to blend in to the night sky, however it was easy to make out a distinct triangular shape. There were 6 white lights on the bottom, assembled in a pyramid shape, as in the racking of the billiard balls on a pool table. At first, my friend and I watched this object not wanting to look away. I jumped off the porch once it left my plane of sight to try and follow the object, but it was moving too quickly and proceeded to go past the tree line and out of my sight. It was originally traveling in a south west direction, and stopped on a dime and made a 90 degree turn and proceeded to travel south east. It was difficult to see how high in the sky it was, and because of that, how fast it was going. The speed did not appear to be more than 100 miles an hour, though. The size of the object from where we were sitting would be the same size as a quarter held at arms length. After the aircraft left our plane of sight, we both looked at each other as if to question whether we really just saw that. We were in agreement that we had seen the same thing, and were both unsure what it could have possibly been. I quickly called a few friends of mine to report what I had seen. There was no alcohol or other substance use at any time during that night which would hinder our judgement."],"Case Number":"46786","Country":"United States","Object Shape":"Triangle","Object Features":"Unknown","Weather Factors":"Unknown","Source":"MUFON","trends":["There have been 18 other sightings in Ann Arbor","There were no other sightings in Ann Arbor on or around April 6th 2013"],"Log Number":"US-04152013-0009","Summary":"Triangle shaped object with 6 white lights on the bottom","Longitude":"-83.747071","Sighting Duration":"00:00:30"}