{"Viewing Distance":"Unknown","Log Number":"US-04152013-0005","Object Shape":"Fireball, Teardrop","Source":"MUFON","Summary":"Obseved 2 orange lights with tails fly out from the clouds in a straight line following each other. After the second one obthe first one the same thing happened two more times.","City":"Philadelphia","Sighting Duration":"Undisclosed","Region":"Pennsylvania","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/46782.html.txt","/var/www/straped/mufon/org/46782.html"],"divs":["Sighting DetailsWas grilling dinner in the back yard when I see a orange ball with a tail fly out from the clouds with a second one following it in a staight line path. At first I thought it might of been hellocopters. The lead ball of light stopped, starting pulsating, and then changed direction and than returned to the original stopping spot. It then began to dim at which point the second one flew into it and seemed to absored it and started to repeat the process as the first one until it just dimmed out. I am thinking to myself I just can't believe I had just seen that. After about 30 seconds two more repeat the same process. I ran in the house to call my brother first and than a niebor, so they could see it, both were not home. I go out side and a third pair repeats the process. The only difference was this last pair got a little further along in the sky than the other two pairs. Not sure what it was but it was pretty weird. Some may say I am nuts but I know what I had seen."],"Date of the Event":"04/14/2013 08:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.078803,+-75.01294(46782)&iwloc=A&hl=en\"> mufon case (46782) map </A>","Country":"United States","Date Submitted":"04/15/2013 04:46 UTC","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around April 14th 2013"],"Object Features":"Unknown","Longitude":"-75.01294","Tags":"City","Weather Factors":"Unknown","Case Number":"46782","Latitude":"40.078803","Disposition":"Unresolved"}