{"Viewing Distance":"Over One Mile","divs":["sighting detailsat approximately 8:00 pm on 4\\14\\13 location: southwest san diego, ca. city of imperial beach i and several others witnessed three objects flying in the night sky. the weather here has been cloudy and a coastal eddy or marine layer with drizzle all day since yesterday. at around 8:00 pm i had just gotten home with the family. i went outside to make a phone call on the front porch facing west, when i heard a boom sound; i started to speak to the person on the phone when out of nowhere a light appeared in the sky southwest of my location. i was talking with the person on the phone when i told him i was seeing something strange in the sky. i told him i would call back and try to film or photograph it. this first object appeared to by flying from south to north along the coast it originated over the ocean then disappeared from sight lasted approximately 5 min. the second object did the exact same thing that is when i called my neighbors to come out and see this we had no clue as what it could be. the object followed the same path but stayed in sight a little longer than the first one than it disappeared. the third object appeared as soon as the other had disappeared originated around the same spot and flew the same path as the others but this one lasted the longest. the objects where like fireballs very bright and red in color it was absolutely amazing my dog was freaking out and still is acting weird. i took photos and video. i am hoping that someone else had to have seen this along the coast near imperial beach or coronado, ca it was a sighting that lasted a long time in the sky. the total sighting lasted approx 20 minutes."],"Log Number":"US-04152013-0003","Tags":"City","Object Shape":"Fireball, Sphere, Triangle","Source":"MUFON","Country":"United States","Disposition":"Unresolved","Date Submitted":"04/15/2013 03:17 UTC","Case Number":"46780","map":"<A HREF = \"http://maps.google.com/maps?q=32.575067,+-117.117936(46780)&iwloc=A&hl=en\"> mufon case (46780) map </A>","trends":["There have been 4 other sightings in Imperial Beach","There were no other sightings in Imperial Beach on or around April 14th 2013"],"Region":"California","Object Features":"None","files":["/var/www/straped/mufon/html2text/46780.html.txt","/var/www/straped/mufon/org/46780.html"],"City":"Imperial Beach","Latitude":"32.575067","Longitude":"-117.117936","Object Flight Path":"Path with directional change,Path then hovering","Weather Factors":"Unknown","Summary":"3 bright red lights one after another flying low South to North a long coast line","Sighting Duration":"Undisclosed","Date of the Event":"04/14/2013 12:00 UTC"}