{"files":["/var/www/straped/mufon/html2text/46795.html.txt","/var/www/straped/mufon/org/46795.html"],"Country":"United States","Log Number":"US-04162013-0008","Case Number":"46795","Date Submitted":"04/16/2013 12:01 UTC","Viewing Distance":"N/A","Region":"New York","Object Features":"Unknown","trends":["There have been 19 other sightings in Albany","There were no other sightings in Albany on or around April 10th 2013"],"Source":"MUFON","Object Flight Path":"Unknown,N/A","divs":["Sighting DetailsIt was Wednesday morning April 10, 2013 at 5:15am, when I went out to get the morning paper. When I go outside every morning, I always look up at the stars. But this morning when I looked up at the Big Dipper, in the northwest part of the sky, and there was a bright object that seemed to reflect light just like a planet. It was below the lower hind end of the dipper. I had never seen anything in the sky at that location in the days, months or years leading up to this morning. I stared at it and 10 seconds later it just vanished. The object just disappeared, it didn't go in any direction. Looking up at the stars of the dipper, the stars appear as little dots. The object was about the size of a dime if you held your hand out in front of your face and make a small circle with your thumb and fore finger. I have seen airplanes and I am familiar with how they move. Planes always have blinking lights and just don't disappear, you can follow them very easily. I thought it was cool that I had finally seen something that I couldn't explain."],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=42.680706,+-73.768803(46795)&iwloc=A&hl=en\"> mufon case (46795) map </A>","Latitude":"42.680706","Weather Factors":"Unknown","City":"Albany","Longitude":"-73.768803","Date of the Event":"04/10/2013 05:15 UTC","Sighting Duration":"00:00:10","Object Shape":"Sphere","Summary":"Just below the big dipper there was an object reflecting light that just disappeared. I always look up in the morning this was something new.","Tags":"City"}