{"Tags":"City","Summary":"Unknown Bright Object NNE Deming, NM","files":["/var/www/straped/mufon/html2text/46791.html.txt","/var/www/straped/mufon/org/46791.html"],"Weather Factors":"Unknown","Date of the Event":"04/15/2013 11:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.25552,+-107.660503(46791)&iwloc=A&hl=en\"> mufon case (46791) map </A>","Log Number":"US-04162013-0005","Source":"MUFON","Viewing Distance":"Unknown","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Object Features":"None","Object Flight Path":"Path with directional change","Latitude":"32.25552","Longitude":"-107.660503","City":"Deming","Region":"New Mexico","divs":["Sighting DetailsI reside in the desert about 5 miles east of Deming and 5 to 6 miles north of the Florida Mountains. I went to my backyard to see if Jupiter was still visible. My wife and I watched it for three nights and saw it earlier this evening. When I looked in the sky NNE of my backyard, I noted a bright, star-like object that appeared to be pulsating from a bright white to bright blue. At first, I thought it was a bright star or planet, but while I watched, it appeared to move right, then left, up and down and left and right again. Sometimes it would go right then left to its original position. Sometimes it would go right then left back to the original position. I called my wife outside to see it. We looked at it though binoculars. When viewed through binoculars, the object appeared to have a tail due to movement of the binoculars. When I steadied it on a solid dumpster, the object was clearly visible and much brighter than the surrounding stars. The pulsating bright blue lights were visible with the naked eye but were clearer with the binoculars. We watched for about 30 minutes then I came inside to make this report. My wife is a skeptic but when I called her out to show her what I was watching, she was impressed and convinced it was not a star or planet. I do not believe it was a satellite due to the way it moved. The object was still in the sky when I came in to write this report."],"Disposition":"Unresolved","Case Number":"46791","Country":"United States","trends":["There have been 17 other sightings in Deming","There were no other sightings in Deming on or around April 15th 2013"],"Date Submitted":"04/16/2013 02:32 UTC"}