{"Country":"United States","Disposition":"Unresolved","Latitude":"47.8265","Object Features":"Unknown","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Summary":"object in sky that changed direction and appeared to become cloaked and then a bright flash","Log Number":"US-04162013-0006","Longitude":"-122.313721","Region":"Washington","Weather Factors":"Unknown","Date Submitted":"04/16/2013 03:37 UTC","City":"Lynnwood","Source":"MUFON","Sighting Duration":"Undisclosed","Date of the Event":"04/15/2013 10:10 UTC","Case Number":"46792","files":["/var/www/straped/mufon/html2text/46792.html.txt","/var/www/straped/mufon/org/46792.html"],"divs":["Sighting DetailsMe and a family member were out exercising kind of late in the neighborhood. Suddenly a bright light was moving above in our direction, at a very slow pace. Then it changed direction fairly fast and we noticed its light beam shining away from us. It did not make any noise at all that we could tell. My family member could not see where it went, but I was able to still see it faintly, but could not make out the shape. Then all of a sudden the light went out and we could not see it anymore. We continued talking about it as we were looking up at the same area, and then all of a sudden a really bright flash and what appeared like an ascention of some sort. It happened so quickly, but we felt kind of nervous, so we hid under a pine tree, feeling like maybe it had seen us. We did not see anything after that, but started to walk fast to get out of there. As we had time to think about what just happened, we felt that there is no way that it was a plane or helicopter, as we live near Boeing, and we know what sounds should be expected from a plane, etc. This made absolutely no sound at all. And also both myself and my family member have worked within the aerospace field for sometime, and are quite familiar with how things work"],"map":"<A HREF = \"http://maps.google.com/maps?q=47.8265,+-122.313721(46792)&iwloc=A&hl=en\"> mufon case (46792) map </A>","trends":["There have been 9 other sightings in Lynnwood","There were no other sightings in Lynnwood on or around April 15th 2013"],"Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Object Shape":"Unknown"}