{"files":["/var/www/straped/mufon/html2text/4679.html.txt","/var/www/straped/mufon/org/4679.html"],"Weather Factors":"Unknown","Date Submitted":"05/16/2003 10:00 UTC","Tags":"City","Source":"MUFON","divs":["Sighting Details 1. I was driving home late from state park training. 2. I saw some lights out the side of my window as I was driving. 3. I didn't know what it was. I thought it could be a huge helicopter are first. But it wasn't like any chopper or any hover craft I have ever seen. (I was in the Navy for 6 years and I have spent alot of time around vertical take off aircraft; harrier jump jets, helicopters,etc.) 4. It looked about 1 mile away slowly hovering over the treetops.I couldnt really make out the shape but it was big. It did have depth though. I could see what looked like running lights around the edges. It could have been triangle shaped but I really could not tell. It seemed to match the night sky in color, save for the lights. 5. I pulled over in my car and turned of the engine to see if I could hear it. I could not hear anything. I got out of my car to see if I could hear it better but I still heard nothing. 6. After about 5 minutes of watching it I gave up tring to figure it out and got back in my car and went home. PS: After working around military aircarft for 6 years I am not ashamed to say that I still don't know what it was. Any ideas ?please contact me."],"Case Number":"4679","Latitude":"36.704639","trends":["There have been 2 other sightings in South Boston","There were no other sightings in South Boston on or around May 16th 2003"],"Sighting Duration":"Undisclosed","Date of the Event":"05/16/2003 10:00 UTC","Object Shape":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Summary":"It appeared to be a silent flying craft of large size hovering and slowly moving at about 1mile distance . It had lights around sides and was over tree top level.","Log Number":"US-04132006-0002","Object Features":"Unknown","Region":"Virginia","Object Flight Path":"Stationary,Hovering then path","Longitude":"-78.893899","Disposition":"Unknown","City":"South Boston","map":"<A HREF = \"http://maps.google.com/maps?q=36.704639,+-78.893899(4679)&iwloc=A&hl=en\"> mufon case (4679) map </A>","Country":"United States"}