{"Object Features":"Other","Date Submitted":"04/16/2013 07:37 UTC","Log Number":"US-04162013-0017","Sighting Duration":"Undisclosed","Date of the Event":"01/05/1999 09:00 UTC","Region":"Ohio","City":"Toledo","files":["/var/www/straped/mufon/html2text/46804.html.txt","/var/www/straped/mufon/org/46804.html"],"Weather Factors":"Unknown","Longitude":"-83.548712","Disposition":"Unresolved","Object Flight Path":"Other","divs":["Sighting DetailsI was heading home with 3 other people in a car from the local YMCA. We were driving along a road that runs along side the Ottawa River when the passenger in the rear of the vehicle yelled at everyone to look out his side of the vehicle. I was sitting on the other side behind the driver and could not see anything at this time. The driver slowed down and came to a complete stop approx. 150 ft. away from this object. Everyone got out of the car to get a better look at the object. This is when I was able to first see the object for myself. It was a triangular shape object that was about 200-250ft in size. It was about 3 stories in height. The object had 1 round yellow light underneath the object for each corner (approx. 20ft in circumference). It also had 1 larger light directily in the middle of it (approx. 40ft in circumference). The object had 3 rows of illuminated lights that ran vertically from the bottom of the object to the top of the object in the location that I would call the \"rear\" that were slowly changing from red, orange, and yellow. It was a metallic object that had a dull dark green color to it that did not reflect any light. It just hoovered motionless with no noise at all while we gazed at the object. The object was approx. 30-40ft off the ground directly above the river (which was about 90ft from the road where we pulled over). The passenger who originally witnessed the object first began to walk toward the rivers edge closer to the object and I began to follow without hesitation. The driver was crying and screaming for us to come back into the car so we could leave. Again, my mind was focused on this object and I seemed to pay zero attention to anything else but the object. We both stopped where the rivers edge was and just starred at the object for about 2 minutes. I was close enough that I could have easily picked up a rock and hit the object with it. The object just sat completely still above the water and then literally disappeared without a trace of it ever being there. It did not fly away. It just disappeared. This whole incident lasted about 3-4 minutes, but seems like it lasted forever when looking back on it. I do not remember walking back to the car or even the drive home. I'm sure that we were all in some sort of shock as to what had just happened and the memory of driving home is just to meaningless to remember. I do not believe that we were abducted or anything of that nature. That being said, I do have a hard time trying to figure out why I walked directly to the object though. At the time I paid very little attention to the possible danger it may have possessed. It just seemed to draw to me in a way that I have a hard time explaining or even understanding. It was defiantly out of my nature to react in this fashion. At the time I was living at my parents house and when I arrived home I drew a picture of what I saw as I described the story to my mother. Later that night she contacted the other three passengers to hear the story from them and to make sure they were OK. My mother kept the picture and ended up calling me a few years later to show me a picture of a UFO that she happened to see on one of AOL's headlines. It was the exact same thing I saw, only a couple years afterwards. Over the passed couple of years I have seen other peoples descriptions and even videos of the exact same triangular shape UFO that I had witnessed. This is why I have decided to report this even though its not exactly a recent sitting. The incident that my friends and I had witnessed that night has been told to friends and family but not to the media or any other form of reporting agency to my knowledge until right now. I find it to be a very hard to think this vehicle was from another planet however I find it even harder to think that this vehicle is something that we as people have developed. If someone ends up reading this, you have probably realized by now that I'm not very good at telling a story via letter form. I have a much easier time speaking about the incident rather then doing this. If you would like me to explain or get into further detail about what I witnessed feel free to call me and maybe I can help relay the details a little better over the phone. Thank you for your time and hopefully this situation with this triangular object flying around our earth will eventually be figured out. Beau"],"trends":["There have been 35 other sightings in Toledo","There were no other sightings in Toledo on or around January 5th 1999"],"Summary":"triangular shape, hovered above water, a light underneath each corner of triangle and row of lights along the back, stood approx. 25ft from it until it disappeared","map":"<A HREF = \"http://maps.google.com/maps?q=41.670478,+-83.548712(46804)&iwloc=A&hl=en\"> mufon case (46804) map </A>","Source":"MUFON","Object Shape":"Triangle","Country":"United States","Tags":"City","Case Number":"46804","Latitude":"41.670478","Viewing Distance":"21-100 Feet"}