{"Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Date of the Event":"04/16/2013 08:30 UTC","Sighting Duration":"Undisclosed","Object Features":"Unknown","Region":"Kentucky","Case Number":"46802","files":["/var/www/straped/mufon/html2text/46802.html.txt","/var/www/straped/mufon/org/46802.html"],"Longitude":"-82.708792","map":"<A HREF = \"http://maps.google.com/maps?q=38.301676,+-82.708792(46802)&iwloc=A&hl=en\"> mufon case (46802) map </A>","divs":["Sighting DetailsON April 16th 2013 at approximately 8:15 pm I was sitting on a trampoline talking to a friend. As I looked to the South East ( sky was clear and sun had set)I noticed this object fast approaching at a high rate of speed (faster than any jet). This object looked to be about 1500 to 3000 feet up, and was much lower than any of the jets passing through at the time. It looked like it should pass directly over our heads. There was no sound from this object and it looked like it could be the size of a small automobile. Kind of oval in shape it had three major colors which flashed extremely fast and bright. The front color was red, the middle was the white color and was extremely bright. The back of the object flashed an orangeshish red. the flashing was as best as i can describe being like fireworks. The flashing lights were so bright that it would hide the object as if the light rays were being projected outward away from the craft. As the object started to pass overhead it just dissapeared before my eyes."],"Source":"MUFON","Summary":"observed object at 45 degrees SE traveling NW at high rate of speed. Body of object was flashing three extreemely bright colors in fireworks fasion at fast rate. Object traveled approxoimately 1/2 mile and then dissapeared in plain view.","City":"Rush","Object Shape":"Blimp, Oval","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been no other sightings in Rush","This sighting has never been favorited."],"Log Number":"US-04162013-0015","Latitude":"38.301676","Disposition":"Unresolved","Country":"United States","Tags":"City","Date Submitted":"04/16/2013 05:19 UTC"}