{"files":["/var/www/straped/mufon/html2text/4680.html.txt","/var/www/straped/mufon/org/4680.html"],"Case Number":"4680","map":"<A HREF = \"http://maps.google.com/maps?q=41.252454,+-73.931866(4680)&iwloc=A&hl=en\"> mufon case (4680) map </A>","trends":["There have been no other sightings in Montrose","This sighting has never been favorited."],"Date Submitted":"12/26/2005 11:00 UTC","Tags":"City","Summary":"2-3 star-like objects travelling in wooded area above ground:returned 5 times","Region":"New York","Log Number":"US-04132006-0003","Weather Factors":"Unknown","Disposition":"Unresolved","Longitude":"-73.931866","divs":["Sighting DetailsI was getting ready for bed. It was a very windy night-trees bending in the wind. And it was cold. I turned to face the windows,which face the south east, when I saw 2 bright lights moving in the woods, one following the other. At first I thought it was a car, but then I quickly realized that it could not be a car as there are no roads in the woods. The area is heavily wooded, very dark, a ravine, very steep. The lights moved slowly, one after the other. Then they disappeared, only to reappear in the opposite side of the woods, in a few seconds. Then I see 3 lights-intense white color-amazing-like a star-twinkling, back in the first area. I am amazed at the quality of light that they are. They cross the ravine, towards my apartment. They stop. I grab my old binocculars and believe I see one bronze colored object hovering about 20 feet above ground, right near the road. Then it gets confusing-the movement, that is-the lights roll over and turn toward the hill and disappear out of sight. I believe I saw red light below the white ones. I am real scared and close the lace curtains and back away from the window-hide. A few seconds later, I see 2 small orange lights bounce up the grassy hill nearer my apartment. Two days later the lights came back, then again on New Year's Eve-in a snow storm. My cat was on the bed when they came. Suddenly she ran to the window, looked up at the sky and then slowly walked to the window sill and looked down at the ground below. A friend witnessed the lights one evening. I continue to look for them, but they have not come back to date."],"Object Shape":"Star-like","Date of the Event":"12/26/2005 11:00 UTC","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Latitude":"41.252454","Country":"United States","Sighting Duration":"00:10:00","Viewing Distance":"Unknown","City":"Montrose","Source":"MUFON"}