{"Country":"United States","Region":"Texas","Weather Factors":"Unknown","Date Submitted":"04/16/2013 08:19 UTC","Longitude":"-100.408546","trends":["There has been one other sighting in Brackettville","There were no other sightings in Brackettville on or around October 30th 1949"],"Object Shape":"Sphere","Tags":"City","City":"Brackettville","divs":["Sighting DetailsMy experience with a UFO is set in the year 1949 and I'm guessing in the month of late October or early November. My parents, grandparents and I were sitting around the kitchen table drinking coffee about 3:00 in the evening. My grandparent's ranch is located about 25 miles northeast of Brackettville, Texas in Kinney county. Off in the distance, we began to hear a loud roaring noise coming from the east. Since it was a little early in the year for ranchers to begin using a flame throwing device known as a \"pear burner\" to burn off the thorns from prickly pear cactus pads, we became very curious as to what this could be. We quickly got up from the kitchen table and went outside to figure out what was making all the noise. The noise was quickly getting louder, and the source was getting closer and moving very fast. Suddenly, off to the left of a hill about a mile to the east, an object came into view. It was as big as my grandparent's ranch house, and it was very black in color. We could see it was trailing smoke, and it was now very loud, so loud you could feel it in your body. When it got to within about 50 yards from where we were standing, it made a sudden right angle left turn and passed in full view of us and was now heading south. As it passed from view and we could no longer hear it, we looked back to where we first saw it, and there was still a smoke trail. Also, there was a very pungent odor in the air. It smelled like burning sulfur or rotten eggs, and it was very strong. From the time we first heard the noise of this object and until it went out of sight, it took about 1 to 2 minutes. No one who lives in this part of Kinney County, Texas, has ever spoken about this incident. As far as I know, no person in the town of Brackettville has ever discussed it either. If anyone who reads this can shed any light on what we saw, please let me know. I would like to know what it was."],"Latitude":"29.317202","Source":"MUFON","Disposition":"Unresolved","Sighting Duration":"00:02:30","Date of the Event":"10/30/1949 03:00 UTC","Summary":"Large, round black object left smoke trail & rotten egg smell as it roared out of sight.","Log Number":"US-04162013-0018","Viewing Distance":"501 Feet - 1 Mile","Case Number":"46805","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=29.317202,+-100.408546(46805)&iwloc=A&hl=en\"> mufon case (46805) map </A>","Object Features":"None","files":["/var/www/straped/mufon/html2text/46805.html.txt","/var/www/straped/mufon/org/46805.html"]}