{"Longitude":"-122.1365","Latitude":"47.566793","Tags":"City","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Source":"MUFON","Log Number":"US-04162013-0014","trends":["There have been 10 other sightings in Bellevue","There were no other sightings in Bellevue on or around May 5th 1981"],"Date of the Event":"05/05/1981 12:00 UTC","divs":["sighting detailswhile driving o a bowling alley i noted a ufo overhead. the car stopped and there was silence. as i attempted to look out the window a bright yellow\\green light shone down forcing me to withdraw my attempts t look up. i could see an irregular edge which appeared to show the craft to be about the size of a city block as is blocked out the stars. i felt a sense that someone\\something was contacting me telepathically. it was a conversation asking me if i wanted to go with \"them\". i responded no, that i was a poor choice as i had several medical issues and family psychological issues. this appeared to end the connection and just as suddenly as it appeared it disappeared. i was going to arrive late to the bowling league so i was concerned that my team mates would require an explanation instead i arrived early by about 20 minutes. somehow i had gained about 45 minutes. i have no physical marks or indications of physical contact. i don't have any \"lost time\" from this incident. one of my co-workers at the hospital remarked that he had seen in and was disturbed that i was uncomfortable talking about it when i explained that i didn't want him to think i was trying to \"steal his thunder\". i have talked about some aspects of this with a couple of people but never told all of it."],"Case Number":"46801","Object Flight Path":"Stationary","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/46801.html.txt","/var/www/straped/mufon/org/46801.html"],"Object Shape":"Unknown","Country":"United States","Date Submitted":"04/16/2013 04:36 UTC","Region":"Washington","map":"<A HREF = \"http://maps.google.com/maps?q=47.566793,+-122.1365(46801)&iwloc=A&hl=en\"> mufon case (46801) map </A>","Summary":"Driving to Bowling alley when overhad UFO hovered and cntacted ein car telepthically","Disposition":"Unresolved","City":"Bellevue","Viewing Distance":"101-500 Feet"}