{"divs":["Sighting DetailsI was at work and snuck out the back for a quick butt, the area is on the second floor area that is less then 30i feet from the rivers edge, as i am looking around at the sky (which i tend to do often) i see nothing...then i look up at the bridge (which is about 8the storys high and no more than 100 yards from where i stood) i notice that. The street lights were much brighter. As i stare i notice them start to sway much like a balllon would with the calmness of a kite flying on windy day. I then realize what i am seeing. 4 Redish orbs hovering above the bridge blending in with the exact color of the street lights! They almost looked like they had candles lit inside of them that gave them a firey color to it. They hovered and i swayed for roughly 40 more seconds staying in the same spot, i then reach for my phone to take a picture....and as soon as the flash of it went off the zoomed so faast into the sky into the hevans. And beyond the stars. I managed to get a picture of them. When i went back inside to work, i was speachless aand couldnt think or even remeber how i got to work, this i is one of my three incidences. I am 22"],"Source":"MUFON","Disposition":"Unresolved","Log Number":"US-04162013-0019","Latitude":"42.971619","Date Submitted":"04/16/2013 09:21 UTC","Longitude":"-71.460179","City":"Manchester","Object Shape":"Circle, Fireball, Oval, Sphere","Date of the Event":"01/16/2011 12:00 UTC","Weather Factors":"Unknown","trends":["There have been 19 other sightings in Manchester","There were no other sightings in Manchester on or around January 16th 2011"],"Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Object Features":"Other","Summary":"red orbs which i thought were street lights at first","Tags":"City","Region":"New Hampshire","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.971619,+-71.460179(46806)&iwloc=A&hl=en\"> mufon case (46806) map </A>","Object Flight Path":"Hovering then path,Other,Unknown","files":["/var/www/straped/mufon/html2text/46806.html.txt","/var/www/straped/mufon/org/46806.html"],"Case Number":"46806"}