{"trends":["There have been 3 other sightings in Hershey","There were no other sightings in Hershey on or around October 10th 2005"],"Date Submitted":"04/17/2013 06:00 UTC","Longitude":"-76.657588","Object Features":"Patterned Surface","Weather Factors":"Unknown","Date of the Event":"10/10/2005 08:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.293306,+-76.657588(46814)&iwloc=A&hl=en\"> mufon case (46814) map </A>","Latitude":"40.293306","Disposition":"Unresolved","Tags":"City","Sighting Duration":"Undisclosed","Viewing Distance":"21-100 Feet","City":"Hershey","Source":"MUFON","Region":"Pennsylvania","Summary":"Two orange balls in sky that were low and rising, they disappeared but reappeared a few seconds later, when I leaned head out of car to look at them I was looking at a giant wing shaped aircraft hovering then disappeared within seconds","Object Shape":"Triangle","divs":["Sighting DetailsI was driving down Hersheypark Drive in October of 2005 to return home from shopping when my husband (passenger) and I noticed two orange orbs in the air that looked like flares. They were on the opposite side of the road over a field but close to the road. As we approached them (still about 50ft away) they disappeared and we honestly didn't think much of it. I decided to slow down since we were approaching the new HersheyPark Marquee and assumed they were doing something at the park (the marquee is just down the street from where we witnessed the \"Flare\" objects and it was a very brightly lit area). As we got closer they suddenly reappeared but at a higher altitude. Neither my husband nor I were alarmed since we thought it was an odd formation for flares but still thought it was from the park. The road didn't have a lot of traffic so I slowed down and had the car barely moving so we could watch and we lost sight of them (Since I was in my vehicle they were too close to view overhead). Something about the look of these was strange enough that I decided to stop the car and put my window down to look out and directly above our vehicle was a very large aircraft. It made no sound at all and had no lights on it (the two \"flare\" looking lights were gone). The object was gray in color and had a grid texture to it...similar to panels. It was so very large and honestly looked like a giant wing of a plane. It was approximately 30-40ft over us and as I previously stated there was not a single noise coming from the craft. The only lights were coming from the HersheyPark sign down the street which is very bright so I could make out a lot of detail. It did have some sort of font written on it (I would assume I was looking at the bottom of the craft) and the one thing that still strikes me is it looked very similar to the font used for NASA but it was too close and large for me to clearly make out what was written. It hovered for approximately 30 seconds than disappeared right in front of me. No noise, no trail....nothing. It simply disappeared. My husband could see part of this object but not as clearly and he was truly frightened. I am a skeptic and my first thought was we live near the Gap and the Harrisburg Airport...it must be a Military plane of some sort. When we started to drive again I looked up at the sky in front of us and in the distance there was a heavy concentration of white blinking lights. It was a beautiful evening with clear skies and we could see many stars out but this was different. In one area it looked like 100 planes were coming in a tight formation. Suddenly those blinking lights also just disappeared and the sky returned to normal. My husband and I told a few people when we arrived home but have always been cautious since we did not want to come across as crazy. I finally wrote this to you because I have always wondered if my experience was unique....the fact that I saw sooo much detail may be the clue that what some people are seeing could possibly be man made. It may also explain those orange orbs that people see at a distance. I have attempted to rationalize this incident for many years and will occasionally research aircraft in hopes that I can identify it as a military plane. The two things that always cause conflict with this theory is the fact that there was no noise at all and the aircraft disappeared in front of us. I know the Stealth planes can do a lot but I am not sure if they would have the capability to do this especially in a brightly lit area. It has been bothering me for many years and I am hoping that bringing our story out we may find an explanation to what we saw that evening."],"Case Number":"46814","files":["/var/www/straped/mufon/html2text/46814.html.txt","/var/www/straped/mufon/org/46814.html"],"Log Number":"US-04172013-0006","Object Flight Path":"Path then hovering","Country":"United States"}