{"Source":"MUFON","files":["/var/www/straped/mufon/html2text/4681.html.txt","/var/www/straped/mufon/more/4681_submitter_file1__Project1.png","/var/www/straped/mufon/org/4681.html"],"Tags":"City","trends":["There have been 32 other sightings in Bakersfield","There were no other sightings in Bakersfield on or around April 14th 2006","This sighting has never been favorited.",""],"Longitude":"-119.016352","Latitude":"35.382882","Country":"United States","Summary":"I saw an alien appear from a craft.","Log Number":"US-04132006-0004","Date of the Event":"04/14/2006 07:23 UTC","Region":"California","Disposition":"Hoax","Sighting Duration":"00:09:30","City":"Bakersfield","Date Submitted":"04/14/2006 07:23 UTC","divs":["Sighting Details1. I was playing a computer game in the living room of my house. 2.The sliding door was open for a breeze. My neighbors dog was barking unstopably. I saw the dog walking in circles wagging it's tail. It frequently looked towards the sky so i was curious as to what he was barking at. 3. To tell the truth it felt like i fainted. It was all too strange. I knew it was a ufo right off the bat. 4.This is where my heart began to jump...I witnessed a black,(fiber glass looking) triangular craft. It had 3 lights on the bottom. One at each point. There was a ring in the middle of the craft that was a luminous purple. Over the 9 minute period it was calmy revolving. 5. I lost my breath for a couple of seconds. Then i forced myself to stay calm. I looked at it for about a minute before yelling for anyone to come outside. It was hard for me to get the words out. A couple from nextdoor came outside and instantly looked at the craft. There was an awkward silence in the air. The couple from next door went inside to get a video camera. The craft hooverd slowly over my house and out of my veiw. I ran through the house and out the front door. Although there was nothing for miles besides a few flikering street lights. I took a few steps when i noticed a light to the left. The UFO had traveled about 300 yards in a matter of seconds. It had landed. There appeard from around the craft a small gray figure with an abnormally porportioned, egg-shaped head... 6.The being re-entered the aircraft. The UFO then suddenly shot out into the sky. I waited around for a couple of hours sitting on my lawn speaking with the couple from next door. We saw no more of the craft that night."],"Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Stationary,Hovering then path","Object Shape":"Egg, Triangle, Other, Unknown","Weather Factors":"None, Does Not Apply","map":"<A HREF = \"http://maps.google.com/maps?q=35.382882,+-119.016352(4681)&iwloc=A&hl=en\"> mufon case (4681) map </A>","Case Number":"4681"}