{"Viewing Distance":"Unknown","Object Shape":"Disc","Tags":"City","Sighting Duration":"Undisclosed","Country":"United States","files":["/var/www/straped/mufon/html2text/46825.html.txt","/var/www/straped/mufon/org/46825.html"],"Log Number":"US-04172013-0015","Date Submitted":"04/17/2013 11:08 UTC","Object Flight Path":"Path with directional change,Path then hovering","Region":"South Carolina","Date of the Event":"04/11/2013 12:00 UTC","Object Features":"Patterned Surface","Latitude":"33.824936","City":"North Myrtle Beach","Summary":"Bright orange orbs seen flashing off of the coast at North Myrtle Beach.","Case Number":"46825","map":"<A HREF = \"http://maps.google.com/maps?q=33.824936,+-78.677646(46825)&iwloc=A&hl=en\"> mufon case (46825) map </A>","divs":["Sighting DetailsMy brother and I went for a walk on North Myrtle beach around eight in the evening. On our return back to the hotel we caught a flashing glimpse of lights off of the coast not too far in the distance. Intrigued, we took a seat in the sand to watch the show. From a span of time between nine and ten at night, we witnessed multiple sightings of the orange lights that I mentioned earlier. They would appear for about thirty seconds at a time and then disappear, as if they hadn't been there at all. Ten minutes or so would pass and they would appear again, often in different locations, but always over the ocean. The orange light around the object would flicker completely around the orb. It was in the shape of a classic UFO, like something out of an episode of the Twilight Zone. It seemed as though there was a ring around the ship, the ring was what would blink. There were three unidentified objects, and my brother and I saw them four times before we left. If you witnessed this too, please email me. It would be a comfort to know that I'm not going crazy. I've never seen anything quite like this in my life. It definitely wasn't an airplane."],"Source":"MUFON","Weather Factors":"Unknown","Disposition":"Unresolved","trends":["There have been 24 other sightings in North Myrtle Beach","There were no other sightings in North Myrtle Beach on or around April 11th 2013"],"Longitude":"-78.677646"}