{"Region":"Oregon","Object Flight Path":"Stationary","Date of the Event":"04/10/2013 12:00 UTC","divs":["Sighting DetailsMyself and my boyfriend were driving west on Powell blvd, heading from Gresham, to the west hills around 5:00pm on Wednesday, April 10th. The weather was strange, changing from sunny to rainy, rainy to sunny and there were all kinds of cool looking clouds in the sky. So, me and my boyfriend were taking turns, snapping pics of the sky. it wasn't until 3-4 days later, while we were reviewing the pics, that we noticed what at first, we thought was a water spot on the windshield or something... that is, until closer inspection. We then realized that we have a picture of something unexplainable. A \"hole\" of some type in a cloud, with stationary or possibly, radiating rings with a definite distortion around the edge of the hole. I was still a bit skeptical, until I realized that the power lines in the photo are between the car and the cloud, so, whatever it is, WAS actually IN the cloud!! We didn't see this with our own eyes while taking the pic (or didn't notice it, which seems unlikely) so, it either happened really quickly, or wasn't visible to the human eye. If anyone has any info... or even a theory about what this is, by all means, please enlighten me. Ps. There is a photo that I have included that shows the same cloud, just seconds before, and if you look closely, you can see what appears to be light beginning to come through the cloud in approximately the same spot where the object is photographed in the following pic."],"Tags":"City","Latitude":"45.533282","Country":"United States","Date Submitted":"04/17/2013 06:24 UTC","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around April 10th 2013"],"Source":"MUFON","Object Shape":"Circle","Case Number":"46820","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","City":"Portland","Sighting Duration":"Undisclosed","Object Features":"Other","Longitude":"-122.666707","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=45.533282,+-122.666707(46820)&iwloc=A&hl=en\"> mufon case (46820) map </A>","Summary":"A cloud vortex or something.","Log Number":"US-04172013-0012","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/46820.html.txt","/var/www/straped/mufon/org/46820.html"]}