{"Log Number":"US-04182013-0009","Date of the Event":"07/15/1973 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.760168,+-82.626711(46834)&iwloc=A&hl=en\"> mufon case (46834) map </A>","Weather Factors":"Unknown","Region":"Ohio","Country":"United States","Source":"MUFON","Disposition":"Unresolved","Viewing Distance":"21-100 Feet","files":["/var/www/straped/mufon/html2text/46834.html.txt","/var/www/straped/mufon/org/46834.html"],"Summary":"apeared above round edge cigar shape round openings/lights?,inside and outside outside still.inside rotating clock then counter clock wiseround back end","Case Number":"46834","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Ontario","This sighting has never been favorited."],"divs":["Sighting Detailsi was in my apartment in back of the west park shopping center in mansfield ohio.the apartment complex is called the harwood apartments.the apartments has a road down the middle,at the end of that road on the right side was the apartments where i was living, we were the 2nd apartment on the far end.I walked out the door in the front, I looked up but im not sure why,and thats when i first noticed the edge of it moving straight foreward over me.holding my arms apart its width was at the aproxamnt 10 and 1 half to 1 and a half oclock angle. And i thought what the heck is that!It was moving at a walking speed.then i started to notice their were yellow white circles on the edge around 3 foot around each, and id say maby 5 ft. between each circle.then there were other openings or lights of the same size,and color on the inside and the same distance apart. the outside lights were stationary but the ones on the inside were rotating clock wise they apeared to slow to a stop then reverse direction(counter clock wise) then repeat this action over and over while i stood there with my mouth open trying to figure out what i was looking at.the end went over my head as the front end went aprox.50 ft.past the trees ahead.outside my door is a walkway to the sidewalk, a curb,a road, a parking area,a curb, about 50 ft. of yard,a creek,a railroad track (now a bicycle trail)then about 200 to 250 yards of woods that it went aprox.50 ft. passed before the back end went over my head.it was dark out,but i could make out the outlined edge which was cigar shaped.it dident make any sound at all.it dident move any leaves when it went over the woods in front of me;nor did i see the tree tops light up as it went over.so maby they werent lights. the object from begining till it ended over the trees lasted aproxamently 55 seconds.I dident drive back then,but later i drove downpark avenue west in the same direction that it was traveling.i estimated where it started and ended best i could and on my odometer it read 2 tenths of a mile."],"Object Shape":"Blimp, Cigar","Latitude":"40.760168","Date Submitted":"04/18/2013 07:07 UTC","City":"Ontario","Longitude":"-82.626711","Object Flight Path":"Straight-line path","Object Features":"Other","Tags":"City"}