{"Longitude":"-89.672178","Date Submitted":"04/18/2013 10:47 UTC","Date of the Event":"04/13/2013 03:30 UTC","Log Number":"US-04182013-0010","Object Flight Path":"Hovering then path","Tags":"City","files":["/var/www/straped/mufon/html2text/46835.html.txt","/var/www/straped/mufon/org/46835.html"],"trends":["There have been 4 other sightings in Picayune","There were no other sightings in Picayune on or around April 13th 2013"],"Sighting Duration":"00:00:03","Source":"MUFON","Viewing Distance":"20 Feet or Less","Object Shape":"Circle, Triangle","City":"Picayune","Weather Factors":"Unknown","Summary":"Small metallic object hovered momentarily off wingtip of my airplane","Country":"United States","Case Number":"46835","divs":["Sighting DetailsAt approximately 1530 CDT on April 13, 2013, I was piloting my airplane at 2,500' while approaching the Picayune, MS VOR, heading North. Nearing the VOR, I glanced out of my right window and saw a small (approx. 10-12\" wide), shiny metallic object just off the right wing. What immediately caught my attention is that this object momentarily remained stationary with my aircraft, which was traveling at approximately 140-150 MPH. The object remained stationary long enough for me to clearly see its shape which resembled a circular or oval shaped object with what appeared to be a small. triangular shaped dorsal winglet in the center of structure. After a short (2-3 seconds)time, the object slowly drifted away to the south. It is not unusual to have close encounters with birds when flying and these, by comparison, are very fast, brief events where the bird is not much more than a flash as your plane passes. On one flight years ago, I had a shiny metallic object shoot by my airplane. It took a few seconds for my brain to recognize that this was a small mylar balloon. When I first saw this object off my wing, I immediately thought that this was another mylar balloon. But when the object did not move and remained in a stationary position relative to my wing so that I was able to make out some detail of the object, I realized that this was not some object drifting through the atmosphere. After briefly staying off the wing, the object drifted away as opposed to rapidly disappearing from view. After the object was no longer in view, I was puzzled as to what I had just seen. Since then, I have tried to understand how any object other than another aircraft could keep pace with my airplane and then drift out of view rather than appear as a flash of something near the aircraft. After giving this experience considerable thought, I thought it best to provide some type of written record of my experience."],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=30.532149,+-89.672178(46835)&iwloc=A&hl=en\"> mufon case (46835) map </A>","Latitude":"30.532149","Region":"Mississippi","Object Features":"Appendage(s)"}