{"map":"<A HREF = \"http://maps.google.com/maps?q=40.25667,+-74.075(4683)&iwloc=A&hl=en\"> mufon case (4683) map </A>","Longitude":"-74.075","Object Flight Path":"Undisclosed","Object Shape":"Cigar","Object Features":"Undisclosed","Summary":"hovered over me at 2-3000 ft.","City":"Tinton Falls","Country":"United States","Tags":"City","Date Submitted":"04/15/1950 12:00 UTC","Disposition":"Insufficient Data","Latitude":"40.25667","Sighting Duration":"Undisclosed","divs":["Sighting DetailsWayside, NJ 1950 on our farm. I was flying a kite. The UFO suddenly appeared over head. It was motionless and made no sound. I knew it was nothing I had ever seen before. I was and still am interested in aviation. I was 11 at the time. I had no idea what it was. It was not a disc but rather a cigar shape. Dull metal, no windows or lights. I looked up since I had a funny feeling I was being observed. The kite was flying forward of me and the UFO was over my head. I looked at it for quite sometime. It did not move. The sun did not reflect off it, there was not bright area though the sun was very bright from behind me. I was about 5 or 6 acres from the house and after watching for 5 minutes or so I wanted to inform my mother. Just as I was about to run in the object moved from South to North. I had a clear view of both horizons. It traveled across the North horizon in less than a second. It did not begin slowly. It was at high speed instantly. I could not believe my eyes. How could it go so fast with out a build-up of speed. I ran home and told my mother and later my father. They told I was dreaming of airplanes and it was my imagination. Looking back I feel the UFO was around 2 to 3000 feet up and probably 100 feet long."],"files":["/var/www/straped/mufon/html2text/4683.html.txt","/var/www/straped/mufon/org/4683.html"],"Date of the Event":"04/15/1950 12:00 UTC","Weather Factors":"Unknown","trends":["There has been one other sighting in Tinton Falls","There were no other sightings in Tinton Falls on or around April 15th 1950"],"Log Number":"US-04142006-0002","Case Number":"4683","Viewing Distance":"Unknown","Source":"MUFON","Region":"New Jersey"}