{"Object Flight Path":"Stationary","Summary":"Flashing and pulsating multicolored orb like","Source":"MUFON","Viewing Distance":"Over One Mile","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/46836.html.txt","/var/www/straped/mufon/org/46836.html"],"Tags":"City","Log Number":"US-04192013-0001","Country":"United States","divs":["Sighting DetailsI Got a call from a friend that needed a ride. I always watch the skies it's one of the first things I do when I step outside. I saw what at first what appeared to be a very abnormal star I thought it was possibly a planet. The longer I looked at it I noticed that it would start to pulsate. It became larger and smaller and also change colors from red to green and blue. The color change would be both abrupt at times and smoother at other times. After about 5 minutes of staring at this thing I convinced myself that it was something natural I'd never seen before. As I left my office to pick up my friend I noticed that the object was following me as I drove. I knew it was moving with me because it was passing in front of and by other stars. At this time it would actually disappear and reappear. When I arrived at my destination I parked and waited for my friend to get in the car. As I waited I thought I had lost it, when it suddenly reappeared. I observed it staying stationary for about 3 minutes and it suddenly in the blink of an eye re-positioned itself in the sky. I'm no expert judging the distance but stars don't do that and planes certainly don't either. My friend got in the car I told her about what I was seeing and had her observe the object. She initially thought, as i did, that it was a star or planet until it started flashing, moving, and disappearing for her as well. After I dropped her off It followed me back to my office. I observed the same things for a while and then finally went back inside. This is my second sighting but my first in this area and the first report I've made. I feel honored to have witnessed something like this."],"City":"Gonzales","Sighting Duration":"Undisclosed","Longitude":"-97.452493","Region":"Texas","Latitude":"29.501626","Weather Factors":"Unknown","Date of the Event":"04/18/2013 11:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=29.501626,+-97.452493(46836)&iwloc=A&hl=en\"> mufon case (46836) map </A>","Disposition":"Unresolved","Case Number":"46836","Object Features":"Unknown","Date Submitted":"04/19/2013 12:48 UTC","trends":["There have been no other sightings in Gonzales","This sighting has never been favorited."]}