{"Object Flight Path":"Stationary,Hovering then path","Summary":"red light still/ then bright yellow flash started moving slow.in another location angled our way red, yellow, white lights hovered moving slow angle right went through power lines and trees in an easterly direction","Date of the Event":"07/28/2007 09:10 UTC","Weather Factors":"Unknown","Object Shape":"Unknown","Tags":"City","Date Submitted":"04/19/2013 01:21 UTC","files":["/var/www/straped/mufon/html2text/46838.html.txt","/var/www/straped/mufon/org/46838.html"],"Log Number":"US-04192013-0003","trends":["There have been 3 other sightings in Crestline","There were no other sightings in Crestline on or around July 28th 2007"],"Longitude":"-82.747361","Latitude":"40.773437","Case Number":"46838","Object Features":"Unknown","Disposition":"Unresolved","Source":"MUFON","Region":"Ohio","map":"<A HREF = \"http://maps.google.com/maps?q=40.773437,+-82.747361(46838)&iwloc=A&hl=en\"> mufon case (46838) map </A>","Country":"United States","City":"Crestline","divs":["Sighting Detailscoming tward pinecrest trailor court see a light in the sky,i asumed was a star or planet at an 11oclock angle tward the west.then it abruptly droped to a 930oclock angle then hovered for aprox 3 minutes then moved slightly to the right for aprox 3 minutes then moved slightly to the right hovered then went slightly higher then slighly lower then to the level it was before going up and down.and i thought its not far away so i was going to drive tward it and before i could respond it shot off to the north west.I saw it several more nights it was usually orange.one night it went tward bucyrus.Icould no longer see it so i got out a spotter telescope it was stationary and now red.then another day i saw a red light west again stationary.then i saw a yellow flash it started to move slowly south east.i drove my car east on middle town rd.to horning rd.turned right started over the bridge saw the object coming from the south west above the telephone poles to our right at a 9 and a quarter oclock angle (not 10 oclock)i dident go all the way to the stop sighn. the object turned its left twards my car covering almost my whole wind screen.i had my windows open,there was no sound.It moved half as fast as a sesond hand on a clock.It had a red light then hotizontal to that light a yellow and white light. then it angled to the south east thtough the middle of the high tension electrical lines on the metal towers,then through the oposite side of the trees on 39 following it going north east. I only drove a short way maby a mile in the direction it was traveling.then it was clear over by mansfield airport then circled back twards crestline. that was the last time i saw that object."],"Sighting Duration":"00:12:00","Viewing Distance":"21-100 Feet"}