{"files":["/var/www/straped/mufon/html2text/46832.html.txt","/var/www/straped/mufon/org/46832.html"],"divs":["Sighting DetailsSimilar to sighting I reported in MUFON Case Number 39678 - Same location and type of craft - clear skies - No clouds - Loud plane brought me outside onto patio then I observed the object in almost same location as previous mentioned case. This time there were NO clouds and a crisp cool evening with very clear skies. Object emitted similar lights - I observed through bino's again and it was clearly NOT a usual aircraft. I went inside after 5 minutes to try and get cameras but batteries were dead again (argh). After several minutes messing with cameras I went back outside and object was GONE with NO visable stars in that area that were anywhere as bright as the objects lights. Object had 3 white lights in a line, close together but space between lights. There was a reddish light on top of oval that appeared at irregular moments. There was also a smaller light on bottom, middle of object that was not as bright as the others. If only I had the proper equipment to capture images or video of these object. They are close enough to get quality images IF only I had proper equipment. It is very frustrating. In my opinion these object are near shoreline of protected, unoccupied coastal area of the SF Bay near some commercial complexes. From my position they were directly above a nearby buildings chimney while it was in the sky so I had a great reference point to guage the location it was above. The land I was on is much higher than the land it was above so my view of the object can be estimated by pointing your arm straight out front of yourself and raising your hand to head level to obtain my line of sight of the object. I really want to get some visual record of these events but you never know when they will become visable and it's usually extremely early in the day at about 2 to 3 am which is when they seem to be active."],"trends":["There have been 7 other sightings in Richmond","There were no other sightings in Richmond on or around April 18th 2013"],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=37.944508,+-122.341309(46832)&iwloc=A&hl=en\"> mufon case (46832) map </A>","Region":"California","Object Features":"Unknown","Date Submitted":"04/18/2013 06:25 UTC","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Case Number":"46832","Object Flight Path":"Hovering then path","Country":"United States","Object Shape":"Oval","City":"Richmond","Source":"MUFON","Latitude":"37.944508","Tags":"City","Sighting Duration":"Undisclosed","Log Number":"US-04182013-0007","Date of the Event":"04/18/2013 02:30 UTC","Longitude":"-122.341309","Summary":"Similar to sighting in Case Number 39678 - Same location and type of craft - clear skies"}