{"Date of the Event":"04/07/2013 06:23 UTC","Object Flight Path":"Hovering then path,Path with directional change","divs":["sighting detailsi had initially tried to contact the mufon investigator that had contacted me before via email but got no response. hello mr. (name withheld). it has been awhile since our last communication but i did not see it necessary to contact you without some kind of photographic proof. well, i finally got lucky and got a few pics of an object that i believe i had seen once before about a month and a half ago that ended up going on the same course. at that time my daughter had tried to film it with a digi cam but it had already sped out of range in a southern direction. this sighting was about 9:30 ish' p.m. i say \"it\" because i think it might be the same object, maybe that i saw and photographed this morning. both objects just appeared to be balls of light. it was about 6:20 this morning of 4\\7\\2013 and i was coming out of my parents house headed over to mine. as usual, i scanned the sky but did not see anything moving or out of the ordinary. i was in between both houses in the front yard and began playing with my two dogs(the dogs were not effected by the object) for just a bit when i decided to go ahead and proceed inside my house when i took a glance to the west skyward. at first one of the bright stars which i thought it was, was not moving but then all of a sudden it started moving which startled me. i watched it for about two seconds and it's direction was headed eastward toward the gulf or my direction. i then ran into my house and grabbed my camera which is a kodak z981. i have to tell you i did have a feeling of excitement with a bit of fear because i did not expect what i thought was a distant star or planet to just start moving. when i got back outside and was preparing the camera, the object then made a j movement and changed direction southward toward mexico with an increase in speed. i did however manage to get one good pic that is steady. the first is shaky but the object is somewhat visible. the second is shaky with no object but the third is decent with the object being able to be seen in photo view zoomed in. it does have a shape that reminds me of a tadpole flying backwards wich shows it actually has more than one light. this will be the third object i have seen that has taken the same southerly course toward mexico. the first being what my wife and i saw when i first submitted my report to mufon back in september of 2011 and the one i saw about a month and a half ago. i will probably get some rest now since i have been awake all night but i wanted to send you this as soon as possible."],"Weather Factors":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/46840.html.txt","/var/www/straped/mufon/org/46840.html"],"Disposition":"Unresolved","Longitude":"-97.720124","Region":"Texas","Source":"MUFON","Latitude":"26.231779","City":"Harlingen","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=26.231779,+-97.720124(46840)&iwloc=A&hl=en\"> mufon case (46840) map </A>","Log Number":"US-04192013-0005","Object Shape":"Star-like","Summary":"This will be the second time I have tried to report this, I tried last week. Starlike object that was still then began movement.","trends":["There have been 6 other sightings in Harlingen","There were no other sightings in Harlingen on or around April 7th 2013"],"Date Submitted":"04/19/2013 02:56 UTC","Tags":"City","Viewing Distance":"Over One Mile","Case Number":"46840","Sighting Duration":"00:11:00"}