{"Source":"MUFON","Summary":"UFO in Iowa","Country":"United States","divs":["Sighting DetailsIt was two years ago, I've only told about three of my closest friends about this night. It was mid March so there was still snow on the ground in Iowa, a buddy and I were driving along an old gravel road heading out to the nearest lake, which was only a few miles outside our small town. About half way there we came upon a hill, once atop the hill we see this massive thing in the middle of the road with three lights near the bottom and two above it. The lights were massive, they reminded me of spotlights, once we began getting closer to it we realized this wasn't any ordinary vehicle, it was taking up the entire gravel road, while gravel was being flung all around it yet it wasn't moving closer to us or it didn't appear to be. By then we were freaking out, goosebumps, chills and all. I was literally yelling at him to turn around as it was really hard to make out the vehicle with all the dust flying, but man were the lights bright. As we got within thirty- fifty feet from the UFO we finally were able to turn around and as we pulled into a farmers driveway the lights began shinning in and around our car just like giant spotlights. The colors continued to change from white, blue, green, and red. Just as we turned around and bolted out of there i quickly looked back at the giant machine when suddenly the three bottom lights appeared to move up towards the two top lights. I turned to my buddy to describe to him what i was seeing, only to turn back around moments later and the giant thing was just gone...completely gone. The UFO itself was massive, I mean taller than any semi or other vehicle I have ever seen. It was really hard to make out the shape of the UFO since gravel was flying all around it, it was dark, and the lights were extremely bright. It seemed almost to be hovering inches off the road or something as dust was flying everywhere but it wasn't moving towards us. At first when we saw it we thought it was some kind of farm equipment but the closer we got to it the more we realized this was something entirely different, no farm equipment takes up the entire road, nor is it that tall, nor do their lights change color and shine in like spotlights weaving in and out, back and forth. We did not see any beings nor have we ever gone back to that exact same road to check it out, I mean i was scared out of my mind I was 21 at the time. Never in my life have I seen something so unexplainable, yet terrifying. The last thing on our mind was seeing something odd that night, yet we found ourselves face to face with a giant unknown flying object. To this day i havent gone back out there, and most likely never will. I know what i saw that night, that night changed my life, rocked my beliefs and changed my views. I think about that night every single day and its been two years. For months i denied what i saw, trying to rationally explain it, but eventually common sense and logic got the better of me...there was no way to logically go about explaining what we saw that night besides for a ufo. Besides for the sound of us yelling and freaking out and also the dust that was being flung off against the giant ufo we didn't hear any other noise coming from the ufo."],"Date Submitted":"04/19/2013 05:25 UTC","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/46844.html.txt","/var/www/straped/mufon/org/46844.html"],"Sighting Duration":"Undisclosed","Longitude":"-95.002767","Case Number":"46844","Log Number":"US-04192013-0009","Tags":"City","Date of the Event":"03/14/2011 12:00 UTC","Region":"Iowa","Object Flight Path":"Other","Object Shape":"Triangle","Object Features":"Unknown","Weather Factors":"Unknown","City":"Newell","Viewing Distance":"20 Feet or Less","map":"<A HREF = \"http://maps.google.com/maps?q=42.605534,+-95.002767(46844)&iwloc=A&hl=en\"> mufon case (46844) map </A>","Latitude":"42.605534","trends":["There have been no other sightings in Newell","This sighting has never been favorited."]}