{"Summary":"ball blue with what looked like mop strings moving oround in the middle 2 of them","Case Number":"46842","Latitude":"40.769726","files":["/var/www/straped/mufon/html2text/46842.html.txt","/var/www/straped/mufon/org/46842.html"],"Date of the Event":"06/15/2007 07:05 UTC","City":"Crestline","trends":["There have been 3 other sightings in Crestline","There were no other sightings in Crestline on or around June 15th 2007"],"Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=40.769726,+-82.746758(46842)&iwloc=A&hl=en\"> mufon case (46842) map </A>","Log Number":"US-04192013-0006","Tags":"City","Source":"MUFON","Country":"United States","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Region":"Ohio","Disposition":"Unresolved","Object Shape":"Sphere","divs":["Sighting DetailsI was driving on middle town road shortly before the road 61 when i saw this sky blue ball going only around a car length in front of my car from left to right. in its center was what looked like grey mop strings moving around.it was traveling at aprox.3 times as fast as a second hand on a clock.or at aroung the speed of a jogger.it was aprox.18 inches in diameter,traveling south to east.i couldnt understand what i saw.and while i was still thinking about it.(object gone).I just crossed 61, still on middle town rd.up ahead around 1 and a half blocks i see a train is getting ready to go and i dident want to wait for it so i turned right at the only road before the tracks that will lead me around the train and back to pinecrest tralor court where i live. just as i turned right on that road from middle town rd.and went only about 100 yards there apeared another sphere the exact same as the other one in size and apearance only traveling ftom south west to north east at the same rate of speed. or heading tward one another the only thing i noticed different was when i turhed on the rd. right of middle town rd.and saw it aproach on the left it was high like it was clearing some trees but as it came away from the tree line across the field it lowered and went asross the road i was on around the same height which was around 5 ft.off the ground.I dident hear anything because i had my window rolled up. so if their was a sound it must have been low.also these seem to have been intelligently controlled. they seem to be searching sonething out."],"Sighting Duration":"00:00:12","Longitude":"-82.746758","Viewing Distance":"20 Feet or Less","Date Submitted":"04/19/2013 03:39 UTC"}