{"trends":["There has been one other sighting in Lenox","There were no other sightings in Lenox on or around August 20th 1975"],"Viewing Distance":"Over One Mile","City":"Lenox","Date Submitted":"04/21/2013 02:15 UTC","Summary":"5 eastbound points of white light in chevron formation, went to silent hover, lights slowly combined into one flash and UFO shot into space","Latitude":"40.884365","Tags":"City","files":["/var/www/straped/mufon/html2text/46873.html.txt","/var/www/straped/mufon/org/46873.html"],"Sighting Duration":"Undisclosed","Date of the Event":"08/20/1975 07:45 UTC","Country":"United States","Region":"Iowa","Object Shape":"Chevron, Unknown","Log Number":"US-04212013-0005","Disposition":"Unresolved","Weather Factors":"Unknown","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.884365,+-94.55385(46873)&iwloc=A&hl=en\"> mufon case (46873) map </A>","Case Number":"46873","Source":"MUFON","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","divs":["Sighting DetailsIn August of 1975 I was about to become a senior in high school. I and a young lady friend were driving around a small, quiet rural Iowa town just talking. I saw to the west, five brilliant white lights. The very high brightness of the lights is what first caught my attention. Each white light was about twice as large as an average star in the sky, in a chevron shape. The point of the chevron was pointing east, and the chevron appeared to be slowly and silently moving east. At first I thought maybe it was a military formation of aircraft, high up, heading from the west to the east. The Strategic Air Command (SAC) south of Omaha, is located west of the town's location. The lights were first seen by me at about 40 degrees above the western horizon, while driving west. The sun had set within the half hour, but sunlight still existed below the western horizon. We drove to a nearby school football field location, where trees would not obstruct our view of the moving chevron shaped lights. The weather was clear with no breeze and no sound at all. The chevron formation continued to slowly & silently get closer until it was about 85 degrees up from the western horizon. The UFO was high in altitude in the sky, maybe about as high as a commercial aircraft. At this point, a new, small pinpoint of light started blinking several colors at the center point location of all the much larger white lights in the chevron shape. The colors being blinked were red, green and white in a random pattern that sometimes repeated any one of the three colors. Even the blinking frequency or lack of blinking was random in timing. At this point the five large white chevron lights were appearing larger than when we had first seen them. From our perspective on the ground, the five white lights were now the size of buttons, only with some 3-D depth on them. All five of the larger white button size white lights in chevron formation all simultaneously started to slowly converge on the pinpoint of the blinking light.(in the middle of the large white lights) At the moment the five lights all converged on top of each other, there was a bright flash of white light and the UFO instantaneously shot off into outer space in a north-northeasterly direction at a steep angle away from Earth. There appeared to be a momentary light trail following the UFO out into space. It was viewable for less than a second and was multi-colorful. The young lady I was with seemed concerned and wanted to go home immediately. I took her home and then went to my uncle and aunt's home. I was both scared and yet very excited at the same time. I told my uncle and aunt about this occurrence and that we must call the Air Force immediately. My uncle's response repeated several times was a firm NO. He did not want the family to be associated with the occurrence, or notifying the Air Force. In the summer of 1975, I was a high school student spending the summer living with my uncle & aunt, while working on the family farms in Iowa...I did as I was told and did not spread this story beyond family and a few close friends. That was all over 35 years ago now."],"Longitude":"-94.55385"}