{"Country":"United States","trends":["There have been 126 other sightings in Indianapolis","There were no other sightings in Indianapolis on or around April 15th 2006"],"Object Shape":"Cigar, Egg, Flash, Sphere, Teardrop","divs":["Sighting DetailsIn my front yard smoking a cigarette and looking at airplanes on final to a local airport. The sky was extremely clear and blue. The object's bright reflection first caught my eye. At first I figured it was a plane, but it was small, didn't move and seemed to be at medium to high altitude. (I could gauge altitude by the 4 or so planes that flew by the object with no apparent idea it was there). I watched the object remain in the same spot for near 10 minutes. I grabbed my binos and tried to zoom in on the object. I couldn't focus on the object and could not discern the exact shape. The reflection didn't seem steady, but shimmered at times, but not pulsating. I watched the object slowly, very slowly move easterly towards the downtown and then stop. It remained in that position for a time. I looked around and saw that no one else was watching the object and the planes that flew by (all commercial airliners) at different altitudes seemed oblivious to the object. At this time I became intriqued because if it was a balloon...there would be strings below it, there was not. Also, the object held in a hover at medium altitude and was uneffected by upper level winds. I still could not focus on the object because the reflections were to bright. The object began moving again towards the southeast slowly, then mildly fast, then it stopped and hovered. The movement to each position took 5 to 10 minutes and the hovering time was near the same. The object grew distant and then came back and to the northwest. AFter 40 or so minutes it became hard to see it, but it was far off. I came back a few minutes later and it was gone. After the sighting I dismissed it as a weather balloon, but I asked this question? Balloons move with the air, this did not, why release a balloon in the middle of air traffic lanes? My roomie laughed me off saying it was a balloon. I'm really not sure what it was, but it acted much differently than conventional aircraft and it was no helicopter, too high and there was no sound. I don't know why, but I didn't take a picture. I recently moved here and my digicam is in a box somewhere. Next time, if there be one, I'll get the camera."],"Case Number":"4687","Summary":"Object was small, reflected sunlight, thus an exact shape was hard to discern even through binos.","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/4687.html.txt","/var/www/straped/mufon/org/4687.html"],"Viewing Distance":"Unknown","Longitude":"-86.148804","map":"<A HREF = \"http://maps.google.com/maps?q=39.775386,+-86.148804(4687)&iwloc=A&hl=en\"> mufon case (4687) map </A>","Latitude":"39.775386","Date Submitted":"04/15/2006 03:20 UTC","Object Features":"Unknown","Region":"Indiana","Date of the Event":"04/15/2006 03:20 UTC","Sighting Duration":"Undisclosed","City":"Indianapolis","Source":"MUFON","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Log Number":"US-04152006-0003","Weather Factors":"None"}