{"Sighting Duration":"Undisclosed","Latitude":"52.467986","Longitude":"-116.081488","trends":["There have been no other sightings in Nordegg","This sighting has never been favorited."],"Date of the Event":"06/01/2012 02:25 UTC","files":["/var/www/straped/mufon/html2text/46874.html.txt","/var/www/straped/mufon/org/46874.html"],"Source":"MUFON","Tags":"City","Case Number":"46874","Object Flight Path":"Path then hovering","Summary":"Ufos can be watched any clear night around nordegg alberta from 2-3 am. cannot film with iphone as soon as phone auto focuses the object dissapears like it knowes its being filmed.","map":"<A HREF = \"http://maps.google.com/maps?q=52.467986,+-116.081488(46874)&iwloc=A&hl=en\"> mufon case (46874) map </A>","Viewing Distance":"501 Feet - 1 Mile","Log Number":"CA-04212013-0006","Weather Factors":"Unknown","Date Submitted":"04/21/2013 03:03 UTC","divs":["Sighting DetailsFor the past few years now I have been going out to nordegg alberta to watch the skies. On a clear night from about 2-3am a solid light object can be seen flying arount the sky, brighter than a star and moves in every direction. When me or the people that I am with try and film or take a picture with an iphone, asbsoon as the phone focuses on the object it goes invisable. I have taken many people out to witness this and said to them.... watch as soon as your phone focuses on it it will dissapear.. and it does. It brightens up again uasually about 5 munites later everytime in a compleatly diffrent spot. I watch this everytime I go to nordegg. I have a 5mv green laser pen the goes 5 miles and on one occasion I have flashed it at this object and idbpulsated red back once for every three times I flashed it. I would also shine the laser directly at it and it would force the object to dart around to avoid it in every direction. I have many witnesses to this event as I was not alone. I can take anyone to nordegg and show them this on any clear night. I have never seen anything accelerate as fast as these objects nor have the ability to hover and dissapear. Whatever they are they are intelligent. If anyone wants to see a ufo for real nordegg is the place, they are always there."],"Object Shape":"Star-like","Disposition":"Unresolved","Country":"Canada","City":"Nordegg","Object Features":"Other","Region":"Alberta"}