{"Summary":"an bright object with a tail of flame that at first looked like a meteor but changed directions several times made a controlled landing, then returned to the air, flew a bit more then landed again.","Longitude":"-89.846771","Tags":"City","Case Number":"46870","Log Number":"US-04212013-0002","divs":["Sighting DetailsI was staying at my brothers trailer the evening this took place. I want to say I was around 16yrs old at the time. I'm 33 now and what reminded me of the event was when I was watching Alien Mysteries on Destination Truth about the Kecksburg sighting years ago. The reenactment of the witnesses description looked and acted exactly like what I witnessed just north of loami, Il. I had got bored and decided to take a walk through the trailer park around 9-9:30pm. I was facing North and seen what at first I thought to be a meteor falling to the ground but it didn't fall to the ground, it was moving from east to west in a downward path but stopped and changed direction and moved back towards the east. It then stopped again and moved back west hovered for a bit then began moving again towards the ground where I had lost sight of it for a moment, it suddenly came back into the air and moved east once again then back west and back towards the ground where I did not see it again. When it would move it appeared to have a tail of flame coming from it and the tail would change direction with the UFO. Like I said it appeared to be a meteor at first engulfed in flames but its movement was not the movement of a falling meteor, which I have witnessed several times, and can tell the difference. A meteor does not change direction several times, land, return to the air, fly around a bit longer then land again. All in all I would say the entire event lasted approximately 5mins. I couldnt believe what I had seen. It was pretty amazing, had I been in my vehicle at the time I would have tried to follow it and find where it landed. It was much to far away to get to it in time. It was probably a mile to 2 miles north of loami and west of springfield, il I returned to my brothers trailer and described what I had seen but no one believed me, they all assumed I was joking or had seen a meteor. There is another incident that I wrote off as a dream at the time and has nothing to do with this sighting. I remember waking up in my bed but not being able to move, in the corner of the room was a tall very skinny version of a normal sized \"grey\" alien with the large black eyes. Standing closer to my bed were two shorter, normal sized greys. They seemed to just be starring at me and that's all that I remember. I was much younger probably 10-13yrs old. Throughout my life I've had many occasions where I wake up in bed and can't move. I try to scream for help but nothing comes out and there is always a very strong, overwhelming feeling of not being alone. Like I am being watched, but I have never witnessed anything in the room with me other than when I had seen the greys when I was young. Maybe it was all just my imagination and I have read of instances where you are half asleep and half awake but can't move or talk because essentially your body is still asleep. Not sure what the correct term for that is. I pretty much wrote the first event off as a dream and all the other times as the half awake half asleep thing. Not sure if you guys are even interested in any of that, just figured I would share it."],"Region":"Illinois","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been no other sightings in Loami","This sighting has never been favorited."],"Weather Factors":"Unknown","Date of the Event":"08/01/1996 12:00 UTC","Object Shape":"Fireball, Star-like","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/46870.html.txt","/var/www/straped/mufon/org/46870.html"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.675606,+-89.846771(46870)&iwloc=A&hl=en\"> mufon case (46870) map </A>","Latitude":"39.675606","Source":"MUFON","Disposition":"Unresolved","City":"Loami","Date Submitted":"04/21/2013 02:14 UTC","Object Flight Path":"Path with directional change","Country":"United States"}