{"divs":["Sighting DetailsI went out to check on animals at 10 PM. To the south, I observed what I first thought to be two stars low in the horizon (about 25 degrees above horizon. It is a very clear night. I thought it was unusual to see two bright stars this low on the horizon so I watched them. They pulsated in color from white, green, blue and red very quickly. Over the space of 15 minutes, I observed these objects make sudden changes in elevation while moving to the left and right. They did not move in unison or any kind of pattern. I was a bit frightened when I saw one of them suddenly decend and bank sharply to the right and then to the left. Then it just stayed stationary. Remarkable. At this point I called to my step son and he observed the objects while they were stationary which wasn't very interesting to him. Planes do not fly like this. The best I can decribe the movement is that they were like a helicopter's movement but at a considerably higher speed. It's difficult to judge the distance but I estimate that it was at lease one mile. One of them appeared to be closer than the other. There were two other aircraft in the area, one during the event and one shortly after. There is a flight path below Mt. Monadnock to our south and I'm occustomed to seeing aircraft in the area. I have to say that I was a bit anxious about what I saw. My heart was pounding"],"Disposition":"Unresolved","Weather Factors":"Unknown","Region":"New Hampshire","trends":["There have been no other sightings in Dublin","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/46883.html.txt","/var/www/straped/mufon/org/46883.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.905833,+-72.060833(46883)&iwloc=A&hl=en\"> mufon case (46883) map </A>","Source":"MUFON","Tags":"City","Date Submitted":"04/21/2013 10:50 UTC","Country":"United States","Case Number":"46883","Object Shape":"Star-like","Latitude":"42.905833","Summary":"Two star like flickering objects abruptly changed direction to south","Sighting Duration":"Undisclosed","City":"Dublin","Longitude":"-72.060833","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Date of the Event":"04/21/2013 10:00 UTC","Log Number":"US-04212013-0015","Object Features":"None","Viewing Distance":"Over One Mile"}