{"City":"Undisclosed","Object Features":"Unknown","Latitude":"52.947806","Log Number":"CA-04212013-0018","Object Flight Path":"Stationary","Object Shape":"Diamond, Disc, Triangle, Other","Summary":"8 stationarys bright lights near and around Orion'betl.","Date Submitted":"04/21/2013 11:53 UTC","files":["/var/www/straped/mufon/html2text/46886.html.txt","/var/www/straped/mufon/org/46886.html"],"Source":"MUFON","Tags":"City","Sighting Duration":"Undisclosed","Case Number":"46886","Viewing Distance":"Over One Mile","Date of the Event":"04/21/2013 08:30 UTC","Disposition":"Unresolved","divs":["Sighting DetailsI was sitting in the livingroom watching a movie. I often glace out the window to look at the stars and the passing planes. At first I thought it was a plane but then I look back and it was stationary. I call my daugther out of bed to come and see this with me outside and she notice 7 more. I imidiatly called a friends to check it out. The light wear EXTREMELY bright. A red round one was at it center, mounted by littles yellow lights orbs, all sitted on a green bar. The green bar then became a row of little green orb pulsating to yellow and the top orb above the red one turn to green. It shape look as if it was changing from saucer to triangle to diamond. It moved a little but I didn't see it moved. Two of them, the bigger ones, alots of activities light changing colors and shape, while the other ones red light in the center pulsating and 4 greens light forming a diamond wear kinda fading away slowly and coming back (for about an hour). The most active ones for about 1:30. My feelings.. Wow! I mean I know of them but to see a live display was sensationel! My daugther was a little afraid, and my landlord was like me in \"awe\". The whole show lasted about 2 hours. I didn't see them disapear, while taking to my landlord about the sighting we turn to my 10 years old daughter.. she said she saw a bright white light and 'pouf!' they wear gone!"],"Weather Factors":"Unknown","Region":"Quebec","Country":"Canada","map":"<A HREF = \"http://maps.google.com/maps?q=52.947806,+-73.542456(46886)&iwloc=A&hl=en\"> mufon case (46886) map </A>","Longitude":"-73.542456","trends":[]}