{"Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=35.231457,+-101.829907(46888)&iwloc=A&hl=en\"> mufon case (46888) map </A>","Sighting Duration":"Undisclosed","Case Number":"46888","Disposition":"Unresolved","divs":["Sighting DetailsMy son and I were traveling west on a street about three miles north of amarillo, Tx. As we were about to approach a stop sign at an adjacent street, my son asked, \"Do you see some lights ahead of us?\" I looked and did not see lights. I said no I don't see anything. He then said while pointing, over there (toward the northwest). I looked again and I did see them approximately a quarter to half mile away. We then proceded to cross the street that we were stopped at and get a better look. We drove about a quarter of a mile until we were almost due south of the objects. We did not notice any movement at all. They appeared stationary. We did not witness any change in the lights intensity while watching them. I looked for evidence of aircraft, but there were no other lights blinking, or flashing. There were 8-10 of these orange lights arranged in a very narrow area in the sky. There was no real pattern to the arrangement of the lights other than they were more or less scattered in a narrow vertical area. Once we came to a stop to take a picture, they slowly moved into a cloud base without us getting the chance to take a photo. There was no visible light refraction from the clouds."],"Object Flight Path":"Stationary","Longitude":"-101.829907","Object Features":"None","trends":["There have been 15 other sightings in Amarillo","There were no other sightings in Amarillo on or around April 20th 2013"],"files":["/var/www/straped/mufon/html2text/46888.html.txt","/var/www/straped/mufon/org/46888.html"],"City":"Amarillo","Region":"Texas","Date Submitted":"04/22/2013 12:02 UTC","Summary":"8-10 orange glowing orbs","Object Shape":"Sphere","Weather Factors":"Unknown","Date of the Event":"04/20/2013 10:30 UTC","Country":"United States","Latitude":"35.231457","Tags":"City","Source":"MUFON","Log Number":"US-04222013-0002"}