{"Object Features":"None","Case Number":"46889","City":"Portland","trends":["There have been 17 other sightings in Portland","There were no other sightings in Portland on or around April 21st 2013"],"divs":["sighting detailsfrom the casco bay bridge waiting as the drawbridge allowed a ship to pass. observed from the ne horizon 2 separate lights\\craft with star like qualities approaching portland and ascending. i observed from approximate distance of 5 statute miles. 1st 2 lights were in twin formation but wove slightly toward and away from each other, their formation was akin to fighters. their ascent to approximately 2-3 thousand feet disappearing into possible cloud cover not to reappear. the second 2 lights looked and behaved identically and appeared approximately 2-3 minutes after the 1st pair disappeared. 2nd set of lights also intermingled slightly as they ascended and disappeared into possible cloud cover at 2-3 thousand feet. the last object also portrayed identical star like qualities approaching from the ne once again and ascending then disappearing into possible cloud cover at 2-3 thousand feet. all objects possessed star like qualities with a prominent yellowish light like a landing light on a commercial aircraft. objects were observed over the total of approximately 10 minutes and disappeared as they ascended above casco bay to the ne possibly above falmouth. all objects appeared from the same location on the horizon from the ne. no sound was observed due to my location in an urban area and the relative distance of myself from the objects. their speed may be approximated at 100-300 mph as they approached and ascended smoothly without acceleration or sudden movement. speed was constant and similar to a slow fighter jet. the objects did not pause, stop or change direction drastically."],"Source":"MUFON","Tags":"City","Latitude":"43.663691","Date of the Event":"04/21/2013 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.663691,+-70.252876(46889)&iwloc=A&hl=en\"> mufon case (46889) map </A>","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/46889.html.txt","/var/www/straped/mufon/org/46889.html"],"Summary":"5 sets of lights from NE acending. 2 pair and 1 trailing. all ascended & disappeared.","Object Shape":"Fireball, Star-like","Sighting Duration":"Undisclosed","Date Submitted":"04/22/2013 12:22 UTC","Log Number":"US-04222013-0003","Disposition":"Unresolved","Country":"United States","Region":"Maine","Longitude":"-70.252876","Object Flight Path":"Path with directional change","Viewing Distance":"Over One Mile"}