{"Latitude":"39.761343","Log Number":"US-04162006-0002","Disposition":"IFO","Weather Factors":"None","divs":["sighting detailsi was driving north on highway 93 coming from golden heading towards boulder.(coming back from taking pictures and walking my dog at red rocks amphitheater.) saw a group of reflective objects making different (odd unnatural)formations (very high up) in the sky slightly nw (started out n.)of my vehicle. they were moving in what i can only describe as a liquid type motion. kind of like mercury or oil in water. they moved in unison. i kept my eye on them while driving for about a minute or two. it struck me as very strange, so i pulled over on the side of the highway to get a better look. i wasn't sure what they were because i had never seen anything move that way. the very first thought that went through my head was \"those don't look like hang gliders or birds.\" they were too large to be birds at the altitude they were at and they were shiny. they were too high up to be hang gliders. they were far above any mountain peak visable in the area. they were moving very slowly, but the motions they were making didnt mesh w\\either of those things. the group split in half, w\\one half of the group mirroring the other half's motion. they were very reflective and all seemed to be identical. the objects were slowly \"dancing\" in that liquid motion overhead for about 5 min's. (i took a few pictures of them from my vehicle.)they then made a formation of a triangle (not a v) and jetted off very quickly headed nw(more west than north) and were gone. they left no visable trails and i did not hear any noise other than that of the traffic on the highway. hwy 93 is a well traveled road. there were many people on the road that day. i seemed to be the only one who actually stopped to take further notice of these. i'm definitely interested in finding out if anyone else reported seeing these objects. they were hard to miss. i have photos and will attatch the clearest one. you will need to zoooom way in on the cluster of objects. once you do you can make out their shape and tell that they are metallic and seemingly identical. i'm sending the pic unformatted\\unoptimized, so it is a large file. i would love to know what these were. i've tried to come up w\\an explanation. i only wish i had a video camera to capture the motion of them - the pics i took don't do them justice in that way."],"Region":"Colorado","Viewing Distance":"Unknown","Tags":"City","Source":"MUFON","Sighting Duration":"Undisclosed","trends":["There have been 28 other sightings in Golden","There were no other sightings in Golden on or around April 12th 2006","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=39.761343,+-105.21228(4689)&iwloc=A&hl=en\"> mufon case (4689) map </A>","City":"Golden","Summary":"Several reflective flying objects moving like liquid in sky over Hwy 93 in Jeffco CO. Near Rocky Flats.","Date Submitted":"04/12/2006 01:50 UTC","Object Features":"Dome, Wings, Other","files":["/var/www/straped/mufon/html2text/4689.html.txt","/var/www/straped/mufon/more/4689_submitter_file1__2006_0412dodo0058.JPG","/var/www/straped/mufon/org/4689.html"],"Object Flight Path":"Hovering then path,Path with directional change,Path then hovering,Other","Case Number":"4689","Longitude":"-105.21228","Country":"United States","Object Shape":"Saturn-like, Other","Date of the Event":"04/12/2006 01:50 UTC"}