{"City":"Sprague River","Case Number":"46891","Weather Factors":"Unknown","Summary":"Swirling mass controlled me physically","trends":["There have been 2 other sightings in Sprague River","There was one other sighting in Sprague River on or around December 21st 2012"],"Log Number":"US-04222013-0005","Date of the Event":"12/21/2012 01:30 UTC","Date Submitted":"04/22/2013 01:25 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.506112,+-121.489688(46891)&iwloc=A&hl=en\"> mufon case (46891) map </A>","Source":"MUFON","Viewing Distance":"20 Feet or Less","divs":["Sighting DetailsI had a weird experience on Dec. 21st, 2012. I had a drink before I went to bed and was feeling mellow. Six hours later I awoke incredibly afraid. I awoke thinking we were having an earthquake but instead I found that I was being rocked from side to side violently to the point of nearly flipping over. My body was totally relaxed yet my body was being lifted quite a bit off the mattress. I laid there just observing (really wondering \"what the hell\") was going on. The action started to quell as I reached out with my hands trying to grab the sheets to stabelize myself. I looked around the room and noticed a swirling in front of me. The mass was rotating in a clockwise direction and then froze in position. So now I was still looking at it with the door bent along with the rest of the room and its furnishings in that area all frozen in this clockwise position in that whirling mass. I could see streaks where the objects moved from as though one had taken a picture of a fast moving object. I turned to look at my husband sleeping. Everything was fine with him and everything on his side of the room was fine too. I looked in front of me but nothing had moved back into place yet everyting to the sides of this whirling were fine too. I was completely shocked. I moved my body and head but the room stayed as it was. I was getting pretty worried now because I have experienced a similar thing in which I absolutely couldn't wake my spouse no mater what I did. I got up and went to the kitchen to get a glass of orange juice. I walked past the frozen objects. I thought \"what the hell happened in there\". I thought, \"I feel ok,that couldn't have been real\"\". I walked back. Everything seemed ok. When I got near the bedroom I felt this rotation again and my body was being pulled from side to side bouncing off either side of the small hallway. I was being rocked again and I was rocked hard into the walls on either side of me and had to block the action by thrusting out my arm to support myself and block some of the blows. This only happened near the bedroom where the vortex took place. The whole physical senation was completely different in this area. Every place else in the house seemed fine. Everything in the bedroom had finally oriented itself correctly. I ran and threw myself into bed, closed my eyes, and hoped nothing else would happen. I talked to a trusted person in my temple and he thought that I was going through some type of a vortex. No I've never taken drugs. I take pictures of orbs outside here all of the time and one was previously shown in these files. Not too long after this I saw an orange orb in the house and I've never had these things in the house. I've taken a picture of a spirit in the front yard that made its image plain. Seriously does anyong have any knowledgable input on this? I don't have a sketch but just picture a very large clockwise swirling mass in front of you at least 10' wide with the rooms door and the immediate furniture swirling and bent going in the same clockwise direction in a very fluid movement then having them stop in place or freeze, if you will, with motion streaks staying in place to the bottom left of each object. Imagine everything to the sides of it are as normal as could be and functioning normally. This event happened on Dec.21st or 22nd 2012. I'm leaning toward the 21st. I don't know what colour it was because the room was dark and only a night light was on."],"Region":"Oregon","Latitude":"42.506112","Object Shape":"Sphere","Tags":"City","files":["/var/www/straped/mufon/html2text/46891.html.txt","/var/www/straped/mufon/org/46891.html"],"Disposition":"Unresolved","Object Flight Path":"Other","Country":"United States","Object Features":"None","Longitude":"-121.489688"}