{"Summary":"Oval shaped lights move indark north then e to ne","files":["/var/www/straped/mufon/html2text/46890.html.txt","/var/www/straped/mufon/org/46890.html"],"City":"Bangor","Region":"Maine","Weather Factors":"Unknown","Tags":"City","Source":"MUFON","Case Number":"46890","Viewing Distance":"101-500 Feet","Latitude":"44.847172","map":"<A HREF = \"http://maps.google.com/maps?q=44.847172,+-68.774665(46890)&iwloc=A&hl=en\"> mufon case (46890) map </A>","Longitude":"-68.774665","Log Number":"US-04222013-0004","Sighting Duration":"00:10:00","Object Flight Path":"Path with directional change","divs":["Sighting DetailsAt 5 am I was setting on the edge of my bed looking out my window to th northwest. Earlier I was admiring the huge bright moon while it slipped below the tree line. As I was taking a pill I looked up and saw 2 lights, shaped oval, hovering over an old Bomarc missile base about a mile or so to the Northwest, just appear out of the darkness. They just hovered there for about a minute not changing color or shape. I awoke my wife to see these lights, and just as she moved to see out the window they started moving to the East. They made no noise and the clear white light just kind of flickered slightly. They moved off to the east from the point I first saw them. Now I am a pilot with over 1200 hours in my log book and, who's father was a navigation tech. With both the USAF and with the Federal Aviation Admin. I grew up around Loring AFB and the Presque Isle airport (along with many nav sights in northern Maine). My point here is these lights were between me and the Bangor VOR, which sits a few miles off the north end of Bangor International Airport. There were no strobe or anti collision lights, no wing position lights, a red light should have been visible as they were approaching me and the left wing would have a red light marking it. As i said earlier, there was no sound at any time. The lights were about 2 to 3 football fields apart from the time the appeared until they moved out of my sight. I see aircraft flying over and around home most every day. BIA is the home of the 101st air refueling wing, flying KC 135 Stratotankers, which make a huge noise on take off and cruising overhead. Also we have a helicopter unit stationed here, flying UH 60 Blackhawks, which are also noisy. The lights approached no closer than 2 football fields near me. I saw no other lights or aircraft in the sky."],"Disposition":"Unresolved","Date Submitted":"04/22/2013 12:32 UTC","Object Features":"None","Date of the Event":"03/26/2013 05:00 UTC","Object Shape":"Sphere","trends":["There have been 18 other sightings in Bangor","There were no other sightings in Bangor on or around March 26th 2013"],"Country":"United States"}