{"Object Shape":"Other","Date Submitted":"04/22/2013 03:36 UTC","Latitude":"42.365653","Country":"United States","Summary":"No UFO sighting.","Object Flight Path":"N/A","Date of the Event":"11/10/2011 03:15 UTC","Region":"Illinois","Longitude":"-87.843974","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.365653,+-87.843974(46905)&iwloc=A&hl=en\"> mufon case (46905) map </A>","Case Number":"46905","files":["/var/www/straped/mufon/html2text/46905.html.txt","/var/www/straped/mufon/org/46905.html"],"Disposition":"Unresolved","Sighting Duration":"00:00:26","divs":["Sighting DetailsNo UFO sighting... ...[copy from personal x-file diary] A few nights after all these happenings, i sent out a mental message for direct alien contact, meaning no space-craft, just the physical entity; as i was taking out a bag of trash to the apartment building's dumpster. As i began to toss the bag of trash over the fence-gate, i seriously mean as i was about to do this action, i saw a black hole gaining larger in size, i knew i was going to meet a being of another species not of my own. Now, i finish tossing the bag of trash over the top and turning-around; i told my self verbally to remain phunking calm and do not let my mental-gaurd-walls to be lowered down at any time for my selfish sanity. It look-a-like a biped being with arms, humaniod form. Its skin was dark as it insisted on standing in the shade, out of the security lights from the aparment building where i resided. So, the skin texture was not clearly visual once it got into the shaded area. It may have scalely or reptilian apearance by skin, hands, and feet. If it had a tail, i could not remember for my life's sake, because i refused to let myself stir into its wholesomeness, including the fact its lower area of where the tail could exist, was in the darkest zone of my parking lot and landscape. It could have claws at the end of it's fingers, but i stood further back, as i was beginning to friegten my self for its intentions were unknown to me. I had a flash-back of a episode of oneof David Ickes's presentations. Got me thinkning that this was reptiliian in nature. When i decide to walk, i moved in way that a feline would its pray, but my target was reaching indoor of my apartment for self-security. i was alone, so i got scared. i thought i was brave enough for any entity. Once i got inside my apartment, i knew there would be no one to talk to about it. It was very late at night, about 2:30AM - 3:30AM. I decided to meditate to calm my self. it worked. After the encounter, i knew i wanted a pet, such as a pet i have been trying to get my landlord to allow me to obtain since i moved into it. Though i knew after five years to change their minds, i moved-out and into the apartment building where i reside now."],"Tags":"City","Source":"MUFON","City":"Waukegan","trends":["There have been 7 other sightings in Waukegan","There was one other sighting in Waukegan on or around November 10th 2011"],"Log Number":"US-04222013-0019","Object Features":"Other","Viewing Distance":"20 Feet or Less"}