{"City":"Undisclosed","Object Shape":"Unknown","divs":["Sighting DetailsI was at my home and I just finished Watching ancient aliens. When the episode finished I was left thinking how can people get so lucky to have have ccidental encounters weather it be any of the five kind. So I grabbed my digital camera and went out side to see if I could get lucky.it had just stopped raining and the skys were still clouded I picked a spot in the sky and started to record. I knew if I couldn't see anything with my eyes it didn't mean I could catch anything on video since cameras can see parts of the light spectrum humans can't. I Watch my video and saw nothing....until I went back and did a Frame by frame what I saw stunned me. At first I tried to de bunk it maybe it was a plane or a bug to close to the lens and for all this time I watched did research and tried to grasp if it was truly a u.f.o.it moved so fast in that one instant that it was in frame and out of it in less than a second.it made me happy that I may have got my very own clip and on purpose! At the same time I felt small like we are not the biggest thing in this universe.I just wish it was moving slower so I could have had a longer video.I hope you mufon can use ur resources to analyze the video and get to the bottom of what I recorded. One more thing I don't have a laptop so I can't upload the video I'm filling this out on My cell it would be cool if u had any field agents that can come and get a copy. Also this wasn't the first time I saw the object the second time was on a clear night about a month and a half ago when the moon Was full and just leaving its highest point in the sky I raised my hand reaching out to the moon when I saw the object fly by but at a much higher higher altitude this is when I new I was seeing things or really seeing something Im looking foward to hearing back from you. My cell is on hear I don't answer numbers I don't know so if you could please leave a voice mail and call again in ten min if I don't pick up or email me. Sincerely: Roberto Lavalliere P.s . I have the exact date on the video file but I'm sure I am close on The date. Best times to reach me are Tuesdays Wednesday friday or any day if the week after 7:30 pm."],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=27.672877,+-81.506914(46900)&iwloc=A&hl=en\"> mufon case (46900) map </A>","Summary":"blink and you will miss it","Tags":"City","files":["/var/www/straped/mufon/html2text/46900.html.txt","/var/www/straped/mufon/org/46900.html"],"Source":"MUFON","Date of the Event":"06/23/2012 07:15 UTC","Weather Factors":"Unknown","Latitude":"27.672877","Log Number":"US-04222013-0014","Object Flight Path":"Straight-line path","Object Features":"None","Viewing Distance":"Over One Mile","trends":[],"Country":"United States","Longitude":"-81.506914","Disposition":"Unresolved","Case Number":"46900","Date Submitted":"04/22/2013 11:19 UTC","Region":"Florida"}