{"files":["/var/www/straped/mufon/html2text/46906.html.txt","/var/www/straped/mufon/org/46906.html"],"Weather Factors":"Unknown","Object Shape":"Sphere","City":"Abington","Longitude":"-75.121759","Log Number":"US-04222013-0020","trends":["There have been 2 other sightings in Abington","There were no other sightings in Abington on or around April 17th 2013"],"divs":["Sighting DetailsI was looking up in the sky and saw a bright object that I assumed was a planet. As I was wondering what planet it could be the object brightened intensely, and I thought I might be seeing a supernova of a star. Then the object wiggled and began to move generally from south to north as it dimmed. The object then brightened again like it had before and started moving in a straight line, again generally from south to north. The object dimmed again and I never saw it again. I have seen planets in the sky all the time and have seen satellites when in less light pollution areas while camping etc.. The only way I can describe the distance the object moved is to hold you hand at full arms length away at the sky and make the space between your thumb and forefinger about 4 inches. This object seemed to be very high( probably in space in my opinion). The sad thing is I had my iPhone in my had the whole time and it never once occurred to me to film it. I'm not saying it was an alien craft but the fact is I don't know what it was and have never seen anything like that in my life."],"Tags":"City","Object Flight Path":"Hovering then path,Straight-line path","Viewing Distance":"Over One Mile","Case Number":"46906","Source":"MUFON","Date of the Event":"04/17/2013 12:00 UTC","Disposition":"Unresolved","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=40.122513,+-75.121759(46906)&iwloc=A&hl=en\"> mufon case (46906) map </A>","Country":"United States","Summary":"Saw what I thought was a planet, the the object brightened and I thought I might actually be seeing a supernova, then the object wobbled, dimmed, brightened again, moved in a straight line, dimmed and I never saw it again.","Latitude":"40.122513","Date Submitted":"04/22/2013 04:17 UTC","Sighting Duration":"Undisclosed","Region":"Pennsylvania"}