{"Tags":"City","trends":["There have been 6 other sightings in San Mateo","There were no other sightings in San Mateo on or around December 29th 2012"],"Region":"California","Viewing Distance":"501 Feet - 1 Mile, Unknown","Date Submitted":"04/22/2013 02:24 UTC","files":["/var/www/straped/mufon/html2text/46903.html.txt","/var/www/straped/mufon/org/46903.html"],"Sighting Duration":"Undisclosed","Log Number":"US-04222013-0017","Country":"United States","Disposition":"Unresolved","Case Number":"46903","City":"San Mateo","map":"<A HREF = \"http://maps.google.com/maps?q=37.554649,+-122.318772(46903)&iwloc=A&hl=en\"> mufon case (46903) map </A>","Date of the Event":"12/29/2012 11:30 UTC","divs":["Sighting DetailsBetween Christmas and New Year of 2012 I went outside my apartment in San Mateo California to empty the garbage. Upon returning to the apartment unit I looked up at the sky and spotted what appeared to be a meteor or shooting star entering the atmosphere from the east. As it came in from an angle it changed and was parallel with the ground. I thought to myself that this is not a meteor or shooting star. I continued to watch it move north westerly, disappear behind the roof of the house next door and reappear on the other side. I walked in the same direction to get a better look. It stopped in a north westerly direction. It was shaped like a sideways ice cream cone with oblong lighted windows covering the entire object from left to right and up and down. There was about four or five rows of these very long oval windows. The object was very flat in the front except for a very bright light which created an immense arc of light. Hearing a noise to my right, I gazed in that direction. When I returned to look at the object it had disappeared. I just checked my compass readings to make sure about the direction. I could not believe my eyes that this was the second sighting in a month since seeing another sighting outside of Lovelock, Nevada in November."],"Weather Factors":"Unknown","Object Features":"Window(s)","Latitude":"37.554649","Object Shape":"Cone, Unknown","Object Flight Path":"Stationary,Straight-line path,Path with directional change,Path then hovering","Source":"MUFON","Longitude":"-122.318772","Summary":"10 seconds at most from entry to disappearanace."}