{"Longitude":"-76.635459","Disposition":"Unresolved","trends":["There has been one other sighting in Dallastown","There were no other sightings in Dallastown on or around January 20th 1995"],"Date Submitted":"04/22/2013 06:07 UTC","Viewing Distance":"Unknown","Object Features":"Unknown","Tags":"City","Region":"Pennsylvania","Case Number":"46910","Date of the Event":"01/20/1995 12:00 UTC","Country":"United States","Source":"MUFON","Summary":"Dallastown, PA UFO's","map":"<A HREF = \"http://maps.google.com/maps?q=39.891728,+-76.635459(46910)&iwloc=A&hl=en\"> mufon case (46910) map </A>","divs":["Sighting DetailsI was 15 years old living in Dallastown Pennsylvania. It was a Saturday evening, myself and several friends were walking along the back streets north of the main road with a great view of the hills on the other side of the valley towards York. I don't recall what got our attention but we watched several bright lights hovering and slowly moving around over the hills on the horizon. At first we thought they were just distant airplanes with there landing lights on. But, after watching them for over 30 minutes, we realized they were flying the same pattern over and over again. The larger brighter white light would fly in slowly from the west to the east and hover in a certain spot. A dimmer smaller light would come in from the east to west more quickly and at a higher altitude, then fly slowly as it got closer to the first light. At some point when they got too close, the larger brighter light would fly off very quickly back to the west and the dimmer smaller light would shoot straight up and disapear. The cycle lasted about 2 minutes each time with about 5 minutes in between. We watched this continue over and over again. It went on so long that we had time to get more neighborhood kids out there and even run into my house and get a camera from my mother, who didn't care as much about it as she did getting to sleep for work the next day. At this point there are about 6-7 of us kids watching these lights replay the same cycle repeatedly when 3 low flying helicopters flew over our town heading towards the lights. They were close enough when they flew by that we could tell they were the big kind with two rotars on top but since it was dark I couldn't tell you what color they were. Each had a strobe on it which we could see as they went over the hills and formed a triangle around the area where the lights were. The helicopter strobes hovered there about 10 minutes and the lights stoped coming so we all got disapointed thinking they scared them off. But, just as suddenly as before, the two lights started there cycle again. We took a bunch of pictures, most of hat rims, fingers, and friends joking around, the only one that turned out was just a blob of light. About an hour and a half after all of this started it ended with a final cycle of the pattern that was different from the rest. This time, with the strobes from the three helicopters framing the scene, the brighter bigger light came in slowly from the west heading east and came to rest at a hover in it's usual spot. The smaller dimmer light came in more quickly from the east heading west and at a higher altitude. As it got closer to the brighter light, it slowed down. Then, we saw a small pulsing red light come out of the dimmer light. The small pulsing red light connected with the larger brighter one. At this point the dimmer light shot straight up as usual. But, when the pulsing red light connected with the bright light, sparks like fireworks started shooting out of it and it darted off down and west. It was very bright and startling, all of us jumped back, some had the instinct to run away a few steps, one girl even fell backwards. We watched for another hour but the lights never came back and the helicopter strobes eventually left. The following Monday, there were stories in the local paper about people in the area spotting the bright light with fireworks coming out of the back shooting threw the sky. They were dismissed as meteor sightings. The thing that never sat well with me was, the sightings in the paper matched the description of how the bright light looked at the end of the light show but the witnesses saw it on Sunday around 5:15pm. What we saw was on Saturday around 7:30PM. I can't explain what we saw that night, and although i looked many times, I never saw anything like it again. I still have several newspaper clippings from that weekend today."],"Weather Factors":"Unknown","Log Number":"US-04222013-0024","City":"Dallastown","Latitude":"39.891728","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/46910.html.txt","/var/www/straped/mufon/org/46910.html"],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Object Shape":"Fireball, Sphere"}