{"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Log Number":"CA-04232013-0003","Object Features":"Unknown","Object Shape":"Sphere","Case Number":"46924","Summary":"6 UFO's, Clear Skies,","Region":"Ontario","Country":"Canada","files":["/var/www/straped/mufon/html2text/46924.html.txt","/var/www/straped/mufon/org/46924.html"],"Latitude":"44.57878","map":"<A HREF = \"http://maps.google.com/maps?q=44.57878,+-80.93235(46924)&iwloc=A&hl=en\"> mufon case (46924) map </A>","Sighting Duration":"02:00:00","trends":["There have been 4 other sightings in Owen Sound","There were no other sightings in Owen Sound on or around April 22nd 2013"],"Tags":"City","Viewing Distance":"Unknown","Weather Factors":"Unknown","Disposition":"Unresolved","Date Submitted":"04/23/2013 01:04 UTC","Date of the Event":"04/22/2013 10:00 UTC","Longitude":"-80.93235","City":"Owen Sound","divs":["sighting detailsmultiple craft visible between 10-12pm -5 eastern time, august 22, 2013 sighting location - owen sound, ontario, canada. viewed from: lat 44.599177, lon -80.921860 came out to watch the meteor shower with girlfriend. control factors - 2 sober witnesses clear cloudless conditions multiple man made aircraft with standard red green flash visible multiple satalites travelling in smooth arc pattern visible multiple meteors visible sighting specifics - 6 ufo's, 4~ satalites, 3~ meteors, and 5~ jet liners with and without jet trail assorted ufo descriptions: 1 rainbow flashing ufo, western location, stationary with occasional immidiate sideways movement, stationary after movement to new location. movement judged relative to bright star next to it, movement seen while watching it. other stars in the area did not twinkle, rainbow flashing clearly noticable. brighter then all stars 1 white ufo travelling in straight line up through handle of big dipper relative to horizon, noticable immidiate angular change in direction relative to straight line of the spoon side wall stars. change in speed - slowed, then sped up. brighter then all stars. 4 white ufo's travelling through the spoon of the big dipper. both up and down relative to horizon. noticable smooth worble\\wave snake pattern to travel. brighter then all stars in sky. worble varied in speed and amplitude not only for each ufo, but also during each individual sighting. during one sighting a satalite was passing through the handle of the big dipper, difference in brightness, travel speed, and stability of course of flight noticable."],"Source":"MUFON"}