{"trends":["There have been 17 other sightings in Stuart","There were no other sightings in Stuart on or around April 22nd 2013"],"Latitude":"27.103991","files":["/var/www/straped/mufon/html2text/46920.html.txt","/var/www/straped/mufon/org/46920.html"],"Source":"MUFON","Region":"Florida","Object Shape":"Cross, Saturn-like, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=27.103991,+-80.271787(46920)&iwloc=A&hl=en\"> mufon case (46920) map </A>","Case Number":"46920","Disposition":"Unresolved","Log Number":"US-04222013-0034","Object Features":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Tags":"City","divs":["sighting detailsout walking the dog. as i approached the house, several colourful lights appeared from the north at a low altitude in a scattered group, seemingly several miles away. i assumed they were helicopters on a training mission. however, as they came closer i could see no strobes or navigation lights, specifically no green or whites, only red and orange. i have a pair of zeiss binoculars inside the doorway of the house so i quickly grabbed them and focused on the group of spread-out lights as they started to veer westwards, still some distance to the north of where i was. these are good binoculars, and i was able to get a detailed look at the objects. i saw no white aircraft strobes, nor flashing navigation lights. each shape appeared to be the same. they consisted of a broad central band of red\\orange colour, with what seemed to be an intense paler hat on the band, and a deep red spot of colour underneath. the shapes and colours pulsed slowly, each cycle lasting perhaps two seconds. as i watched they drifted to the west and each light disappeared in turn, perhaps because of some scattered cloud although i thought the objects were below it. i could hear no noise or distinctive aircraft disruption from that area, despite the wind being from that direction. at the same time i was able to clearly see light aircraft in the area, and a civilian passenger jet at high altitude. i was able to hear the noise of these aircraft with no problem. it may have been that the objects i was watching were too far away for oral recognition, but i thought they were within 2 - 4 miles range. the entire event lasted 2 minutes or so. i estimated the objects were probably travelling between 150 and 300 mph. i found it strange that they disappeared out of sight so suddenly."],"Weather Factors":"Unknown","Country":"United States","Summary":"multiple glowing shapes appeared from north and veered to the west. No strobes or navigation lights. The colours pulsed slowly","Viewing Distance":"Unknown","Date of the Event":"04/22/2013 10:50 UTC","City":"Stuart","Date Submitted":"04/22/2013 11:24 UTC","Longitude":"-80.271787"}