{"Object Features":"Unknown","Date of the Event":"04/22/2013 11:41 UTC","divs":["Sighting DetailsI was sitting on the tailgate of my pickup facing east and looking to the NNE. I was waqtching the meteor shower saw 1 almost full moon was very bright and to the south of me.I live in north Gainesville but 3 ,miles south of Lacrosse which I claim as where I live if anyone asks. at 11:41 PM I noticed a bright lite coming over the tree line if I were to guess where it qwwould have been I would say Starke fl. the sky was primarily clear there were a few hi level cirrius clouds. the moon was almost full and waning. as I sat on my tailgate I saw a light coming from the East going west maybe SW.it was as bright as a hundred watt naked bulb at 500 feet. The light then being very bright stopped and seem to go upward and backward. The light got dimmer and as it went upward at a 45 degree angle it got smaller and dimmer and then poof pothing. The entire sighting was approximatly 1 minute or a little less. My thoughts about this was more or less humdrum , not a very exciting sighting but it mite add a bit to another report. i felt no psychological or psychic effects no rush of adrenaline etc , very cut and drieded."],"Sighting Duration":"00:01:00","Date Submitted":"04/23/2013 12:51 UTC","Viewing Distance":"Over One Mile","Summary":"aspirin size bright white orb shape was gowing slowly from east to west then stopped got dim and shot off upward in a nnw direction got dim and disappeared","Longitude":"-82.369246","Disposition":"Unresolved","Case Number":"46923","map":"<A HREF = \"http://maps.google.com/maps?q=29.826238,+-82.369246(46923)&iwloc=A&hl=en\"> mufon case (46923) map </A>","Latitude":"29.826238","trends":["There have been 27 other sightings in Gainesville","There were no other sightings in Gainesville on or around April 22nd 2013"],"City":"Gainesville","Log Number":"US-04232013-0002","Country":"United States","Object Flight Path":"Stationary,Path with directional change","Tags":"City","Object Shape":"Star-like","Region":"Florida","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/46923.html.txt","/var/www/straped/mufon/org/46923.html"],"Source":"MUFON"}