{"trends":["There have been 4 other sightings in Post Falls","There were no other sightings in Post Falls on or around April 22nd 2013"],"Object Features":"Unknown","Latitude":"47.722228","City":"Post Falls","Viewing Distance":"Unknown","divs":["Sighting DetailsApproximately 11:15 pm, I went outside to smoke a cigarette on my front porch as I do every single night. From my porch I can clearly see the area where signal point sits. In fact the normal blinking towers are what I see on any clear night. I went outside and as I started to sit down I glanced up at the mountain as I always do and just below and to the left of the normal blinking signal light, there was a MASSIVE and extremely bright red light. It was way too large to be the normal things you might expect.. (headlights on a mountain road, an outdoor property light, camp fire in the distance) there is no way it was any of those. The size and distance would not match. I called for my husband and he tried to view it through binoculars but we couldn't make anything out other than what appeared to be a massive pulsating fireball. I watched it for probably 10 - 15 minutes total and it went from a very large and very bright glowing red to a dimmer orange and then began pulsating. I expected it to move as similar events took place last summer but it did not, it stayed where it was and took on the appearance of a glowing orange orb. After a few minutes of that, it dimmed even more, brightened up again a bit and then blinked out."],"Longitude":"-116.949806","Object Flight Path":"Stationary","Date of the Event":"04/22/2013 11:15 UTC","Object Shape":"Fireball","Source":"MUFON","Case Number":"46933","files":["/var/www/straped/mufon/html2text/46933.html.txt","/var/www/straped/mufon/org/46933.html"],"Sighting Duration":"Undisclosed","Country":"United States","Disposition":"Unresolved","Weather Factors":"Unknown","Tags":"City","Region":"Idaho","map":"<A HREF = \"http://maps.google.com/maps?q=47.722228,+-116.949806(46933)&iwloc=A&hl=en\"> mufon case (46933) map </A>","Summary":"Massive red/orange pulsating light in the tree line of signal point post falls","Date Submitted":"04/23/2013 01:54 UTC","Log Number":"US-04232013-0012"}