{"Object Flight Path":"Hovering then path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=32.033358,+-102.335177(46939)&iwloc=A&hl=en\"> mufon case (46939) map </A>","Date of the Event":"09/09/2012 04:05 UTC","Log Number":"US-04232013-0018","Weather Factors":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/46939.html.txt","/var/www/straped/mufon/org/46939.html"],"Case Number":"46939","Object Features":"Other, Unknown","Country":"United States","City":"Gardendale","Summary":"Observed huge cloud after rain noticed what appeared to be dark object inside cloud moving away from me then back toward me.Due to knowledge of extraterestials being telepathic closed my eyes and stated (I wanna see let me know). Comm ensued .","Source":"MUFON","Region":"Texas","trends":["There have been 3 other sightings in Gardendale","There were 2 other sightings in Gardendale on or around September 9th 2012"],"Sighting Duration":"00:10:00","Object Shape":"Other","Date Submitted":"04/23/2013 06:32 UTC","Latitude":"32.033358","Longitude":"-102.335177","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsI was at work at the time I was employed by Qmax america. I was on location in Gardendale tx. I was in my trailer while it was raining. After the rain subdued I went to my car for a cigarette. While sitting in my car I observerd a large cloud with a huge dark object hovering within the cloud.Being familiar with the Ufo phenemonon I then closed my eyey and stated I wanna see let me know and repeated this several timesdue to the fact I could feel a presence and have heard ET's are telepathic.Continued watching while cloaked im cloud move away from me then back toward me it did this afew times before I went back tomtrailer the next morning upon arriving at work at approxamently 6am observed amber colored object hovreing in the sky object proceeded to move west stopped abruptly became stationary appeared to shake a little while pulsating brighter then at the height of pulsation shot off back east as if it was projected from a skeet shoot and eventually disappear.Later that day while sittin outside my unit again felt an overwhelming presence. At this time la cloud of emence size came into view and I proceeded to photograph it .Everysince i've captured numerous photos of unexplained cloud phenomenon containg what I belive apparitions of Et's. It is my belief and soon to be yours that ET's have the capability to cloak themselves as clouds orco within the clouds. It is also my belief they are communicating through the cloud structure in the first file I submitted you will notice several faces in the clouds when held horozontially however when held diagonally you will notice different facial structures resembling the structures on easter island (i call them tiki men). The double sided nature of these cloud structures in my opion proves beyond a shadow of a doubt ET is real theu observe us and we ARE NOT ALONE. In each photograph submitted you will complex cloud formations use zoom when needed also because yhis phenomenon is foreign to you I think using the method of searching for the eyes in the photos will help you to find structures within the clouds. I have taken the initiave to have some photos blown up into poster and 8 by 10 sizes to be better observed."],"Disposition":"Unresolved"}