{"Longitude":"-116.559269","Log Number":"US-04232013-0010","Object Flight Path":"Straight-line path","Latitude":"33.795988","Weather Factors":"Unknown","Object Shape":"Chevron","Date of the Event":"04/13/2013 08:45 UTC","divs":["Sighting DetailsSaturday April 13th,2013 @pprox 8:45p Warm Sands Area Palm Springs, CA My cousin and I were chatting and smoking cigarettes on the porch. We were observing the upside down Big Dipper and remarking that Orion wasn't visible where we thought it would be. We were generally with our heads up. I was already gazing to the north as that is the direction my porch chairs currently face (and the Big Dipper). Over my hedges, then directly over our heads; I noticed shimmering zigzag patterns in the sky that I thought were birds only to realize there was an ominous very clear black outline of a much larger Chevron shaped craft. At this point my heart was pounding out of my chest. The zigzags were either reflective or transparent and were shimmering in the shape of smaller chevrons zigzagging. The craft was silent and there was absolutely no discernible propulsion system or exhaust. It seemed to be gliding. Once it had reached over our heads there was an umbrella blocking my view. The adrenaline rush propelled me from my chair and I grabbed my cousin out of his and spun him to the south so he could see its departure from our line of sight. He was describing the same generally fantastic details. Our hearts were visibly pounding for another hour after the event. We had both noticed the wildlife and bugs had gone silent and in fact it was dead silent during the sighting other than a garden fountain and the traffic on the other side of the walls and hedges, and of course our own heartbeats..."],"Region":"California","Disposition":"Unresolved","Summary":"Large Shimmering Chevron UFO-directly over our heads","Source":"MUFON","trends":["There have been 23 other sightings in Palm Springs","There were no other sightings in Palm Springs on or around April 13th 2013"],"Date Submitted":"04/23/2013 12:53 UTC","Country":"United States","Case Number":"46931","files":["/var/www/straped/mufon/html2text/46931.html.txt","/var/www/straped/mufon/org/46931.html"],"City":"Palm Springs","Sighting Duration":"Undisclosed","Tags":"City","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Features":"Patterned Surface, Other","map":"<A HREF = \"http://maps.google.com/maps?q=33.795988,+-116.559269(46931)&iwloc=A&hl=en\"> mufon case (46931) map </A>"}