{"Weather Factors":"Unknown","Date Submitted":"04/23/2013 02:22 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/46934.html.txt","/var/www/straped/mufon/org/46934.html"],"Viewing Distance":"Over One Mile","Longitude":"-80.345344","Summary":"I went out to see if I could see meteors and saw these other things instead. Lights flashing","Region":"Pennsylvania","Date of the Event":"04/22/2013 11:45 UTC","Latitude":"42.014223","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.014223,+-80.345344(46934)&iwloc=A&hl=en\"> mufon case (46934) map </A>","Source":"MUFON","trends":["There have been no other sightings in Lake City","This sighting has never been favorited."],"Object Flight Path":"Hovering then path","Country":"United States","City":"Lake City","Disposition":"Unresolved","Object Shape":"Other","Case Number":"46934","Log Number":"US-04232013-0013","divs":["sighting detailson april 22, 2013, i went outside to see if i could see the meteor shower. i looked up and immediately saw something that was not a meteor. the same thing i saw for the first time 1 1\\2 years ago. last night was the 3rd time seeing this. but, i looked around and saw 2 more. they were in a triangle, miles away from each other. the lights are what caught my eye. they were flashing lights. red, yellow, green, white, and a blue that could have been purple. i watched them for over 45 mins, hoping to see one take off so i could tell myself i wasn't crazy. i'm a skeptic...i'm interested, don't get me wrong. but, still a skeptic. i watched these things move! my friends kept telling me it was meteors, weather balloons, or possibly something sent up to catch a glimpse of the meteor shower. my friend took a walk to see if she could see anything and called me freaking out and scared. she saw all 3 too! we saw them move around a little, but only very short distances. i wanted to watch until they moved, but i couldn't. i can't stop thinking about it. i'm always looking to the sky in hopes of seeing something different and cool, but these scared me."],"Object Features":"Unknown"}