{"Object Shape":"Sphere","Object Flight Path":"Unknown","Date of the Event":"04/22/2013 03:25 UTC","Case Number":"46937","Source":"MUFON","City":"Mercedes","Disposition":"Unresolved","Latitude":"26.087704","Region":"Texas","files":["/var/www/straped/mufon/html2text/46937.html.txt","/var/www/straped/mufon/org/46937.html"],"Object Features":"Unknown","Longitude":"-97.929358","Summary":"Spheres with laser like light in the center","Viewing Distance":"20 Feet or Less","divs":["Sighting DetailsMuch of my childhood I would go to Illinois, my father had a job for roofing. My last year there was when I was in 8th grade. During that year (2007) I experienced something out of the ordinary. I woke up in the middle of the night with something standing next to my bed. What made things worse was that I couldn't move at all. Only thing I would be able to move were my eyes and eye lids. Didn't think much of it even though it felt so real. Then again it happened with the same \"thing\" being next to my bed, again I couldn't move. This would happen three times before I came back to Texas on November 2007. The dreams went away. (Mind you that I never thought they were dreams, but I considered the fact after letting my parents and brothers know about what was happening.) Then it happened again here in my home in Texas with something standing next to my bed. The last incident in which the \"thing\" showed up I was sleeping tv was left on and window was open being 1ft away from me. There was no gusts but it was a cool night. I started moving around to get comfortable. In the middle of my movement I felt a presence again and again I couldn't move. Facing the window being paralyzed I could see a figure outside my window. Getting use to what was happening to me I closed my eyes tightly till it left. Only this time I felt it come in the room. My eyes being shut I felt I wasn't in the room anymore. I heard what closely resembled rain drops. I woke up being morning already. It was the last time I saw it, but it wasn't the last time I would wake up being unable to move. My girlfriend recently moved in with me on February of this year. I told her what would happen to me. Like everyone else she didn't really believe it was real. On April 22, 2013 between 3:25-4:30. The strangest thing happened. Both me and my girlfriend saw two orange lights small in size but its physical mass could be seen. Both resembling circle shape flashed and vanished from my room, as a 3rd light appeared being blue in color appeared flashed and vanished. The lights we both witnessed we not ordinary lights, resembling laser like lights. I believe I have been visited by beings not from here. Only conclusion I came up with. Hoping for a response on my experiences. Thanks."],"map":"<A HREF = \"http://maps.google.com/maps?q=26.087704,+-97.929358(46937)&iwloc=A&hl=en\"> mufon case (46937) map </A>","Tags":"City","trends":["There has been one other sighting in Mercedes","There were no other sightings in Mercedes on or around April 22nd 2013"],"Date Submitted":"04/23/2013 06:15 UTC","Log Number":"US-04232013-0016","Weather Factors":"Unknown","Country":"United States","Sighting Duration":"Undisclosed"}