{"Tags":"City","Object Shape":"Circle","Disposition":"Unresolved","divs":["Sighting DetailsSeen a white light flying kinda' weeble wobbley through the sky @9:07 - 9:10pm tonight. Came from North going South South East making a long wobbley turn more easterly and fading out. No blinking lights, just a bright white dot of light. Managed to get a few pics. There were planes flying by in different parts of the sky too. One plane was coming form the east and looked like it would have met up with the light if it hadn't vanished. No marker lights, just one bright round spherical light. Even though it's flight pattern was forward it was going from side to side and up sideways down sideways up then to the side again. But in little movements, not big, \"weeble wobble\". Like a ball rolling forward that has too much weight on one side. It goes forward but the weight pulls it around a little not letting it go exactly straight. I did try to get some pics with a power pole that has a light on top of it and one with one of the deck post in it. The one with the deck post didn't come out too good and when I took the ones with the light pole was when it was fading out and it didn't even show up in the pictures (which is kind of strange if you ask me). It didn't seem to far, but it wasn't really close. Judging by most of the small planes I see, I would say it was lower than most but still a good ways up. Maybe mid way between here (our house) and town (Turlock). At first it was more less coming my direction at a low angle (35-40deg.??) and might have even flew overhead if it hadn't turned more to the east. No sound that I could hear. But it might have been too far and it was breezy out. I waited for the plane (coming from the east) to pass to see if it would show back up, but it never did. When that plane was closer I couldn't hear it either and it was about in the same location at one point. Picture - I was leaning up against the post and the shutter was open a little longer than a second or so. You can see stars in the background and the flight pattern of the object."],"Date of the Event":"04/22/2013 09:07 UTC","files":["/var/www/straped/mufon/html2text/46932.html.txt","/var/www/straped/mufon/org/46932.html"],"City":"Turlock","Latitude":"37.438266","Country":"United States","Viewing Distance":"Unknown","Object Features":"Unknown","Source":"MUFON","Longitude":"-120.915744","Log Number":"US-04232013-0011","Region":"California","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","trends":["There have been 8 other sightings in Turlock","There were no other sightings in Turlock on or around April 22nd 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.438266,+-120.915744(46932)&iwloc=A&hl=en\"> mufon case (46932) map </A>","Date Submitted":"04/23/2013 01:26 UTC","Case Number":"46932","Summary":"a white light flying kinda' weeble wobbley through the sky @9:07 - 9:10pm tonight","Sighting Duration":"Undisclosed"}