{"trends":["There have been 4 other sightings in Inglewood","There were no other sightings in Inglewood on or around April 20th 2013"],"Longitude":"-118.344021","Case Number":"46944","Viewing Distance":"Over One Mile","Object Shape":"Circle, Fireball, Oval","files":["/var/www/straped/mufon/html2text/46944.html.txt","/var/www/straped/mufon/org/46944.html"],"Log Number":"US-04232013-0023","Disposition":"Unresolved","Latitude":"33.97016","Object Features":"None","Date of the Event":"04/20/2013 08:19 UTC","Object Flight Path":"Unknown","Date Submitted":"04/23/2013 10:58 UTC","divs":["sighting detailsi was chilling at my house watching the los angeles clipper game with my dad in inglewood, ca on 4\\20\\13 at 8:19 p.m. when my uncle came in and said take a look at this...as i was walking to the door leading outside my house to the backyard he asked me \"are we being invaded?\"...i looked up in awe..there was like 20 orb like objects lite up like amber fire hovering in the sky. i instantly thought we were. i was waiting for rays to come out of the ufos. i then felt a chilling tingle and felt more at peace. then grabbed my phone i started taking pictures and video footage. as i was taking footage the orbs started to rise into formation as other ufos with spinning lights (blue, green, red, orange) hovered up out of the tree line. as the others pulled up into formation you could see that an airplane was traveling around the same path that they were in...some of these lights would blink in and out in a strange sequence. after about 25-30 mins slowly fadded off into a se direction. youtube footage: [link moved to fi section\\cms\\tg]"],"City":"Inglewood","Weather Factors":"Unknown","Summary":"Amber fiery orbs and some with spinning changing lights","Region":"California","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.97016,+-118.344021(46944)&iwloc=A&hl=en\"> mufon case (46944) map </A>","Source":"MUFON","Tags":"City","Sighting Duration":"Undisclosed"}