{"Object Shape":"Disc","Object Features":"Unknown","Tags":"City","trends":["There has been one other sighting in Llano","There were no other sightings in Llano on or around September 18th 2011"],"Log Number":"US-04232013-0025","Weather Factors":"Unknown","Case Number":"46946","files":["/var/www/straped/mufon/html2text/46946.html.txt","/var/www/straped/mufon/org/46946.html"],"Region":"Texas","Latitude":"30.723287","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Source":"MUFON","Viewing Distance":"Unknown","City":"Llano","divs":["Sighting DetailsOk, I took a picture two years ago and it keeps haunting me because of what turned up in when I reviewed the picture days later. First off, I completely believe we are not alone in this universe but I have never had any person proof, it's always been a gut feeling. I have sat staring at this picture for two years now trying my hardest to convenes myself that what I am seeing can be explained but now I am not sure about that and I wanted to submit the picture to you guys for review. I was out hunting with my friends and because their was no action that day we decided to go out by the pond and do some skeet shooting. I take lots of pictures so this event was something I wanted to capture for my memory book. When I reviewed the pictures after I got home one caught my eye and I could have sworn there is a huge flying disk in the sky and it freaked me out because it looks so real and it looks nothing like a plane or helicopter or anything I can make out. I did not see it in the sky at the time I took the picture and it does not appear in any of the other pictures I took at that location. I have not showed it to anyone nor have I tampered with it in anyway. I want you guys to take a look at it and tell me what you think! It might be nothing but I gotta know what yall think. Thanks guys!"],"Longitude":"-98.785602","Date of the Event":"09/18/2011 08:00 UTC","Summary":"shiny metallic disk","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=30.723287,+-98.785602(46946)&iwloc=A&hl=en\"> mufon case (46946) map </A>","Country":"United States","Date Submitted":"04/23/2013 11:30 UTC"}