{"Summary":"Bright starlike orb vanishes in flight witnessed by 3","files":["/var/www/straped/mufon/html2text/46947.html.txt","/var/www/straped/mufon/org/46947.html"],"Viewing Distance":"Over One Mile","Sighting Duration":"00:01:05","Weather Factors":"Unknown","Tags":"City","Date of the Event":"04/23/2013 08:55 UTC","Country":"United States","Longitude":"-87.698628","City":"Florence","map":"<A HREF = \"http://maps.google.com/maps?q=34.883275,+-87.698628(46947)&iwloc=A&hl=en\"> mufon case (46947) map </A>","Object Flight Path":"Straight-line path","Case Number":"46947","trends":["There have been 7 other sightings in Florence","There were no other sightings in Florence on or around April 23rd 2013"],"Source":"MUFON","Disposition":"Unresolved","Date Submitted":"04/23/2013 11:34 UTC","Latitude":"34.883275","Region":"Alabama","Object Features":"Unknown","divs":["Sighting DetailsTonight at home, me & 2 others witnessed the familiar star like orb that we see from time to time over our clear skies in low altitude.This time though we got a treat.We saw something that we've never seen this bright orb do before while in flight,it totally vanished right before our eyes. The sighting was short & only lasted a minute or a few seconds over.I was star gazing for about an hour before the sighting.Matter of fact,every since our last star like Orb sighting a few weeks ago,I've made it a point to go outside just after sunset & star gaze for awhile.As always,the very bright object was moving slow in a steady path but in a lower altitude than the last time seen.When gazing,I'm constantly looking around in all directions & the object seemed to just suddenly appear but I could be wrong.As soon as I spotted it I got inside the house as soon as I could & yelled for my wife to come outside.She came quickly & said yeah that's it again,so I yelled for my daughter to come out & look before it got further away.She came outside quickly & was viewing this object when within seconds,it vanished.And that was the shocker because even my daughter couldn't hardly believed that as bright as it was & as clear as we could see it,it just vanished.No trace anywhere,it was gone & out of sight. There were no clouds at the time & the moon was full.I had a cheap video camera on me,figured it was better than nothing but by the time I got the power on,that's when it was gone.See there was no getting fainter & fainter as it glided off into the distance,it was bright in a flight path & like a light switch it was off. There is something to this folks. I don't know what it is but strange things are going on in our skies.And these bright single star like orbs I believe are unique. We've never witnessed more than 1 at a time.It makes one think of a pure energy source."],"Object Shape":"Sphere, Star-like","Log Number":"US-04232013-0026"}