{"Object Shape":"Other","Object Flight Path":"Hovering then path,Path then hovering","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/46942.html.txt","/var/www/straped/mufon/org/46942.html"],"Country":"United States","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsWas I. My trailer at work while it wad raining once rain subsided went to my car for a cigarette. While smoking felt strong presence looked through front window and observed large cloud with huge object cloaked tithin the cloud.Having heard that ET's were telepathic I then closed my eyes and stated I wanna see let me know.Continued to observe object while still cloakef within the cloud move away from me then back toward me several times. I then returned to my trailer and resumed work. Upon arriving at work the next morning at approxamently 6am I then cobserved a amber colored object in the sky object proceeded to head west stopped abruptly pulsated getting brighter as it did so then appeared to shake a little and take off back east as if it hap been catapulted somehow. Later that day while outside my unit again felt an overwhelming presence at this time I looked into the sky and observed large cloud with structures .This will be the firy photo I submit to yoi. In the photo you will see facial structures whithn the cloud when viewed horozontially however when held diagonally you will notice facial structures resembling the structures on Easter Island I call them (tiki men). It is my belief ET's are cloaking themselves within clouds and observing us daily.It is my belief these photos are photogr aphic proof that WE ARE NOT ALONE."],"Region":"Texas","City":"Gardendale","Source":"MUFON","Log Number":"US-04232013-0021","Summary":"Wat at work while employed at Qmax america.While sitting in my car observed large cloud with huge dark object hovering within the cloud .Being familar with ufo phenomenon closed my eyes and stated I wanna see let me know.","trends":["There have been 3 other sightings in Gardendale","There were 2 other sightings in Gardendale on or around September 9th 2012"],"Latitude":"32.032888","Case Number":"46942","Sighting Duration":"00:10:00","Longitude":"-102.336847","Date Submitted":"04/23/2013 07:16 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.032888,+-102.336847(46942)&iwloc=A&hl=en\"> mufon case (46942) map </A>","Date of the Event":"09/09/2012 06:00 UTC","Object Features":"Unknown","Tags":"City","Weather Factors":"Unknown"}