{"Latitude":"38.933751","divs":["sighting detailsi walked out of the back of my house into the back yard. i turned south and proceeded to smoke my cigarette. i usually look up at the sky during the night time and tonight i just happened to notice a bright, star-like light\\object going across the sky. it was about the distance that a passenger jet would fly. 35,000 feet maybe? at first i thought it was an airplane, but noticed that it was too bright to be an airplane and there were no blinking lights indicating that it was an airplane. it was not producing any sort of streak or \"tail\" and was also not producing any sound from where i witnessed the object. it moved very smoothly from west to east and seemed to be going faster than a passenger jet would be able to go. it was very bright. so bright that i wasn't able to make out the shape of any object, other than an orb-like object that moved very much like an orb, but in a straight line. it had the color of a white star that you would see on a clear night sky, but it was much brighter and it was below the cloud line. as i was viewing this very bright object for the next 45 seconds or so, the object just seemed to vanish. i did notice though, that when the object seemed to \"disappear\" it was directly in front of the moon. however, it was no longer in the vicinity. i believe that if the object would not have been so bright, it would have been very possible to make out the shape of whatever that object was. in this case, that was not possible. it was not a plane or a shooting star i do know that."],"Region":"Colorado","Longitude":"-104.795435","Country":"United States","Sighting Duration":"00:00:45","Object Features":"Unknown","Object Shape":"Unknown","Tags":"City","Disposition":"Unresolved","Viewing Distance":"Over One Mile","Date of the Event":"04/23/2013 09:20 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/46949.html.txt","/var/www/straped/mufon/org/46949.html"],"City":"Colorado Springs","trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around April 23rd 2013"],"Date Submitted":"04/24/2013 12:22 UTC","Summary":"Bright, star-like shape moved quietly across the sky and vanished","Log Number":"US-04242013-0001","Object Flight Path":"Straight-line path","Case Number":"46949","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.933751,+-104.795435(46949)&iwloc=A&hl=en\"> mufon case (46949) map </A>"}