{"Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Object Shape":"Circle, Sphere, Star-like","City":"Castlegar","Date of the Event":"08/23/2011 11:10 UTC","files":["/var/www/straped/mufon/html2text/46941.html.txt","/var/www/straped/mufon/org/46941.html"],"Latitude":"49.323741","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"04/23/2013 07:17 UTC","Sighting Duration":"01:30:00","Summary":"noiseless star came straight at us stopped and hovered seemed to have a flash beam hovered for a minute then came closer turned west and vanished","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=49.323741,+-117.659334(46941)&iwloc=A&hl=en\"> mufon case (46941) map </A>","Region":"British Columbia","Source":"MUFON","Weather Factors":"Unknown","Longitude":"-117.659334","Tags":"City","Log Number":"CA-04232013-0020","Country":"Canada","Disposition":"Unresolved","trends":["There have been no other sightings in Castlegar","This sighting has never been favorited."],"Case Number":"46941","divs":["Sighting DetailsIn the summer of 2011 my sister and I were sitting outside on her patio having tea at night before we went to bed, when a bright star began to get larger. Being born in the airforce we both thought it was a helicopter. It appeared to be coming straight toward us as if it were heading over the house. We were facing south and it was coming at us from the southwest then changed direction and headed straight north toward us. It became incredibly bright which was when we began to doubt that it was a helicopter. The light became stationary in the sky over the town and flashed a beam. I thought it may be a search helicopter with a very much brighter than usual light searching for criminals or the like. It proceeded toward us again at which point I was looking to see if I could spot a pilot as the light became close enough that if it were a helicopter I should have been able to see occupants in it. It was then that I realized there was no sound coming from it. If it was a helicopter there should have been the chopper blade sounds which are unmistakable. The orb was stationary for approximately a minute then reappeared slightly toward the west as if it had jumped sideways then it simply vanished with no sound or trace. The weirdest thing was that when we checked the time, it was 90 minutes later when it should have been only about 10 minutes. I have always thought that ufo sightings were USAF black ops but this one has me scratching my head wondering."]}