{"Source":"MUFON","Sighting Duration":"Undisclosed","Date Submitted":"04/23/2013 11:57 UTC","trends":["There have been 3 other sightings in Summersville","There were no other sightings in Summersville on or around April 23rd 2013"],"Log Number":"US-04232013-0027","Viewing Distance":"Over One Mile","Summary":"a bright solid white light about size of a pie plate moving at a high rate of speed moving from the NW horizon to about 3/4 SW horizon changing direction at 90 degrees and then shooting straight up out of site no sound. no blinking lights","Object Shape":"Circle","Region":"West Virginia","Disposition":"Unresolved","Object Flight Path":"Path with directional change","Tags":"City","Longitude":"-80.787628","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.301898,+-80.787628(46948)&iwloc=A&hl=en\"> mufon case (46948) map </A>","files":["/var/www/straped/mufon/html2text/46948.html.txt","/var/www/straped/mufon/org/46948.html"],"Date of the Event":"04/23/2013 09:55 UTC","divs":["Sighting Details Myself an my wife were doing some evening yard work and had piled up a bunch of brush to burn in our fire pit. We decided we would burn the brush and sit and watch for some meteors during the meteor shower, at about 955pm I had stood up to warm my back against the fire and I was facing the North West Sky I noticed this bright round light moving towards us just over the tree tops behind my house, I quickly noticed it did not have any flashing red white or green lights that are required on all aircraft, I said to my wife for her to look at this light coming towards us and over our head, as she saw it she said what is that I said , well I don't know for sure, I can't see any flashing lights like a normal aircraft would have, but we should hear some type of engine noise in a few seconds as it gets over our heads and past us which is normally the case when you see a normal aircraft going past you then you hear the engine. I also noticed that it appeared to be covering a large amount of distance way faster than any aircraft I have ever seen, and believe me I have seen many, I was an Air Force Brat since the age of 6 and I also almost 9 years active duty in the Air Force. I said to my wife Im gonna get my Binoculars that were in my truck approximately 30 feet away from us,I kind of fast walked over to it grabbed them and headed back towards my wife a few steps as I was about to lift the binoculars up towards the object she said in an excited voice it just changed direction, I quickly looked up to get a fix on it with my eyes so I could put my binoculars on it and it appeared to have moved in an easterly Direction form when I last saw it and it appeared to be in a hover for a second then just shot straight up and out of sight within about a sec to second and a half, enough to know that it was getting smaller and not simply the light going out. There was no sound at all. We had seen several aircraft flying around before we saw the object all had the typical flashing red , green type lights and sound, as well as after we saw the object. Having been around every imaginable aircraft in our arsenal as well as many other countries aircraft, I can tell you for a fact this was not one of our Known aircraft. I hope others were out watching the meteor shower and saw the same object."],"City":"Summersville","Case Number":"46948","Latitude":"38.301898","Weather Factors":"Unknown","Country":"United States"}