{"Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=35.042817,+-84.891368(46943)&iwloc=A&hl=en\"> mufon case (46943) map </A>","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/46943.html.txt","/var/www/straped/mufon/org/46943.html"],"Source":"MUFON","Country":"United States","Date Submitted":"04/23/2013 09:48 UTC","Weather Factors":"Unknown","Disposition":"Unresolved","Tags":"City","Case Number":"46943","trends":["There have been 7 other sightings in Cleveland","There were no other sightings in Cleveland on or around April 23rd 2013"],"Latitude":"35.042817","Log Number":"US-04232013-0022","Viewing Distance":"Unknown","Longitude":"-84.891368","Summary":"My 15 year old daughter and I were outside and saw acigar shaped ufo, then felt rain no clouds in sky, daughter had goup on hand, daughter saw golden light in trees I saw 2 entities in same trees. After sighting saw about 7 or 8 jets.","Region":"Tennessee","Date of the Event":"04/23/2013 07:30 UTC","divs":["Sighting Details We were outside playing badmitten on a beautiful sunny day, it was around 7:45 in the evening. I have an injured ankle that was swollen at the time (But I was still capable for outdoor activities) and all of a sudden it felt copmpletely soaked and tingly (My whole right ankle and foot) I didn't want to tell my daughter in case she'd worry about me. I looked up and thought I saw a plane, when it really turned out to be a cigar looking white object floating silently above the treeline. I pointed it out to my daughter, who for some reason didn't take it seriously. I found this weird. As we were playing badmitten, I kept looking at it as it floated silently and slowly above the trees. It was going SW and then suddenly I noticed it was going N. Throughtout the duration of this time, I was constantly looking back and forth (quite often) and when I looked up after it turned N, I realised it had disappeared. I pointed it out, once again, to my daughter who actually didn't care and took the time to talk me into staying outside with her. This whole time, as well, I noticed our dog was acting strangely and looking at the trees it flew over. As I looked occasionally with him, I noticed two or three scaly figures walking where he was looking. I tried talking my daughter into going inside again, but she kept insisting everything was fine. Our dog started to walk in the direction, very slowly, the UFO had beein flying to. My daughter called for him and as did I, but when he came my daughter suddenly became serious about it all. She told me she saw a golden orange light off in the trees coming from the N angle. However, she once again insisted we stay outside. I then accidentally hit the birdie to my car and she went to get it when she complained to me that she was feeling raindrops when it was a cloudless sky. I felt it as well. Walking back, she complained to me that she had goo on her hand, but thought it was a possibility it came from the dog. Shortly after, we went inside. I decided to call my father who is interested in UFOs. Only after when we sat down to report the incident and the time did we realize how short time had really been throughout the sighting and being outside. My daughter and I actually argud about how long we were outside and the specific times and how we both felt we were out for hours. She decided to check the phone history to see when we had come in ( and just saying, I called my boyfriend shortly before we played as well) We realized it had to have happened over 15-20 minutes. Looking back, this gives us both shivers down our spines."],"City":"Cleveland","Sighting Duration":"Undisclosed","Object Shape":"Cigar"}