{"Summary":"The point of light traveled across the sky in a strange, but mostly straight path. Traveled what would be the eqiuvalent to about 8 inhes across the sky, then abruptly made a 90 degree turn and immediately dissappeared with no noise throughout.","Country":"United States","Weather Factors":"Unknown","Region":"Maryland","Date Submitted":"04/24/2013 02:59 UTC","Tags":"City","Latitude":"39.558236","Sighting Duration":"Undisclosed","City":"Bel Air","Viewing Distance":"Unknown","Source":"MUFON","Object Shape":"Circle","Case Number":"46951","files":["/var/www/straped/mufon/html2text/46951.html.txt","/var/www/straped/mufon/org/46951.html"],"trends":["There have been 5 other sightings in Bel Air","There were no other sightings in Bel Air on or around April 23rd 2013"],"Disposition":"Unresolved","divs":["Sighting DetailsI was smoking a cigarette with my friend, who will also confirm this sighting as he was standing right next to me. I've been an avid stargazer since birth, I follow UFOlogy, and I have always believed that we were not alone in the universe long before anybody had brought the debate up. Feeling quite robbed of my ability to see the Lyrid meteor shower last night, as there was very dense cloud cover in my area, I decided to see if I could see anything tonight. As we went outside to smoke, we light our cigarettes, and as we often do, looked up. I was just glancing around trying to decide which constellation to marvel at, and as I did I looked to what I think was the star, Alphard, I don't know my stars super well this was after the fact using Starmap 3D, anyway, what I thought was a star begins to move slowly across the sky. As I had just stared to watch it I thought, \"Oh, just another plane.\" As I live very close to BWI and there's constant air traffic over my house. But then as it got closer, I didn't hear any jet engine sounds as I normally always do, and as I watched it move across the sky, it seemed to be weaving, from left to right, in somewhat of a line, as it flew. I thought this was odd for a plane to be flying in this manner, and let out a, \"Hmph.\", as if puzzled and as my friend dave knew what that sound meant, he began to watch what I was as well. We both obseverd this object for about 5 minutes, and at the very end of the sighting it made a very abrupt 90 degree turn and the light vanished, which is something i have never observed personally until last night. It left me with goosebumpbs as I had been waiting my entire life to observe a UFO first hand, unfortunately without the foresight to bring a video camera I didn't capture anything. But it felt unreal to me, I tried as I could to logically explain away what we had both witnessed. Perhaps a sattelite, for example. But the more I tried, the more it seemed apparent to me that I couldn't explain away what I had seen, which led me to believe that I did in fact observe a UFO."],"Date of the Event":"04/23/2013 09:43 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.558236,+-76.281169(46951)&iwloc=A&hl=en\"> mufon case (46951) map </A>","Object Features":"Unknown","Longitude":"-76.281169","Object Flight Path":"Path with directional change","Log Number":"US-04242013-0003"}