{"Date of the Event":"10/05/2000 12:00 UTC","Tags":"City","Sighting Duration":"Undisclosed","trends":["There have been 2 other sightings in Irvington","There were no other sightings in Irvington on or around October 5th 2000"],"files":["/var/www/straped/mufon/html2text/46955.html.txt","/var/www/straped/mufon/org/46955.html"],"Region":"Alabama","Viewing Distance":"101-500 Feet","Latitude":"30.505034","Object Shape":"Triangle","Object Flight Path":"Straight-line path","Case Number":"46955","Country":"United States","Source":"MUFON","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=30.505034,+-88.238563(46955)&iwloc=A&hl=en\"> mufon case (46955) map </A>","Longitude":"-88.238563","City":"Irvington","Weather Factors":"Unknown","Object Features":"None","Summary":"larger than football field, no sound, blk matte triangle with whiite light at each corner could have hit it with a rock very slow over house .","Date Submitted":"04/24/2013 01:57 UTC","divs":["Sighting Detailsbbqing with family around 8:00 pm oct 2000 at our home in irvington al. it was me and my husband and it was dark. from the west across the street there is a wooded lot. over the trees came the object it was a black triangle matte finish with 3 white lights on the underside that were a constant glow, it was huge bigger than a football field its depth was maybe one to two stories tall, it was solid and it was moving very slowly. i could have hit it with a rock.and i started to shake. it moved right over us and was not making a sound, my husband thought he heard a humming sound but i did not hear it. we watched it move over us for about 30 sec then i ran into the house to get my daughter. when i came back out it was still moving to the east very slowly till we could no longer see it. it did not make a sound but just kept moving very slowly toward mobile al. i was phsically shaken not knowing what it was. my husband did not want to talk about it. we could not understand how something so big could just float by with no sound. we could just watch it and not believe what we were seeing. My husband thought people would think we were crazyif we reported it. i watched the news that night to see if anyone else had seen it but there was nothing about it. it was so large and that i can not believe no else had seen it. i was watching a ufo files program about sightings in illinois about the time we had our sighting, and the descritpion of the object was exactly the same as what we saw."],"Log Number":"US-04242013-0007"}