{"Country":"United States","Longitude":"-112.120134","Sighting Duration":"00:01:00","Latitude":"33.71244","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=33.71244,+-112.120134(46957)&iwloc=A&hl=en\"> mufon case (46957) map </A>","Tags":"City","Object Shape":"Unknown","Date of the Event":"04/25/2010 06:30 UTC","files":["/var/www/straped/mufon/html2text/46957.html.txt","/var/www/straped/mufon/org/46957.html"],"Region":"Arizona","Disposition":"Unresolved","Source":"MUFON","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around April 25th 2010"],"Summary":"rectangle black craft hovering between I17 @ Happy Valley Rd on West side close to juvenile detention center","Object Flight Path":"Stationary","divs":["sighting detailsi was traveling south on i17 on my way to work. i was carpooling with a co-worker. we were just past happy valley rd and before pinacle peak rd. on the west side of the interstate floating above the ground about 100 ft was a black rectangle about 30-50 feet long and about 10 feet in height. the black sides were smooth and dark, like blackened windows, along the sides of it as far as i could tell. on the bottom where white round circles about 3 ft in diameter, that covered the entire bottom. my co-worker said \"those things must be how it stays up there.\" as we passed by we went under the pinacle peak rd overpass. we turned back to see if it was still there and could not locate it. when the went on down i17 to work. it was approximately 630 am in the morning, as we had to be at work by 7 am. i believe it was sunday, but it could have been saturday. if it was saturday then it could have been as early as 530 am, because we had to be at work by 6 am. it was dawn or pre-dawn as the sky was starting to light up, but i don't remember the sun actually being up over the horizon. i am thinking that this happened about april 24\\25 2010, but it may have been at the end of march. i didn't know that you could report these type of things until now, but i have never forgot about it. my co-worker and i never discussed it afterward, only laughing at the time when we so it, saying that now we saw a ufo and it was sort of small and lame. there were very few cars on i17 at that time, and i have always wondered if anyone else saw it or reported it. it was not a balloon, and it was not hanging from anything, like a crane. i didnt think much about it until later, then it creeped me out. i was thinking that it looked like an observation room or deck that was floating in the sky, and not up on a ridge or on top a building were it should be. i was thinking that it was supposed to be invisible, and somehow the \"cloaking\" device was accidently turned off, or maybe they wanted to be seen for a brief time. anyway, would really like to know if anyone else saw it, or if it has been seen in the phoenix area before or after. i have no photo as we did not stop, but my photo is one i found on the internet that is close to what i saw. i am thinking that the photo is of a much bigger craft. thanks"],"Log Number":"US-04242013-0009","City":"Phoenix","Case Number":"46957","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","Date Submitted":"04/24/2013 04:51 UTC"}