{"Case Number":"46953","Source":"MUFON","files":["/var/www/straped/mufon/html2text/46953.html.txt","/var/www/straped/mufon/org/46953.html"],"Region":"","Viewing Distance":"Over One Mile","Object Shape":"Sphere","Country":"Bosnia and Herzegovina","Sighting Duration":"Undisclosed","City":"Sarajevo","Disposition":"Unresolved","divs":["Sighting DetailsI was at home, on my balcony smoking a cigarette. I live on a 5th floor so I have a pretty good view of the city and it's surrounding hills and mountains. I was looking at the sky, as I always do, when I'm on balcony. In the first minute I wasn't sure what I was looking at but after 2-3 minutes I started thinking that was my first UFO sighting. The object appeared out of nowhere and was stationary. It was emitting different lights including white, blue, green, red and yellow. It stayed there for about 4 or 5 minutes total. About 10 days after that I was at my balcony again looking at that part of the sky, where UFO appeared. Then it appeared again with same characteristics as before. This time it stayed for a little bit shorter period of time. At that time I was sure that what I saw was an actual UFO. Month or so, after the 2nd sighting I saw red light going forward and backward behind the mountain. It did that for about 10 to 15 times. I could see the path it was going on and it's trail was fading away as the UFO was moving away. Three months after that I was going out. It was about 6 or 7PM. The day was really sunny and I could see two dozens of airplanes and the trails they were leaving behind them. I looked at the \"Avaz Twist Tower\" and next to it I saw a metallic disc-shaped craft hovering in the air. The car was coming along the road so I had to step onto sidewalk and I turned my head for about a second but when I looked back at the sky nothing was there. I'm pretty sure that what I saw wasn't an airplane or helicopter because I'm used to seeing it all the time. I will never forget this short period of my life because I always believed in extraterrestrial life and now, I have witnessed something I saw reading about years and years prior to that."],"Date Submitted":"04/24/2013 12:53 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.856259,+18.413076(46953)&iwloc=A&hl=en\"> mufon case (46953) map </A>","Longitude":"18.413076","Weather Factors":"Unknown","Object Features":"Unknown","trends":["There has been one other sighting in Sarajevo","There were no other sightings in Sarajevo on or around August 8th 2012"],"Latitude":"43.856259","Tags":"City","Log Number":"BA-04242013-0005","Summary":"Orb-like, emitting different colors","Date of the Event":"08/08/2012 09:02 UTC","Object Flight Path":"Stationary"}