{"Latitude":"37.614296","Object Flight Path":"Straight-line path","Object Features":"Unknown","Disposition":"Unresolved","Summary":"I saw a bright object comming from the N-E, very bright went right over Patterson, CA 95363. Traveled S-E at a angle, no blinking lights or noise. I flashed my flash lite at it but no response. Lasted approx 25 to 30 secounds, it look low in the sky","Date Submitted":"04/25/2013 01:38 UTC","Longitude":"-120.947011","divs":["Sighting DetailsI was in my back yard looking at the stars, I do that mostly on a clear night, this time there was a full moon, but I still went out to look around. That is when I saw a bright object comming from the N-W, and it seem to go right over Patterson CA. at a angle to the S-E. It had no blinking lights on it and it was at least 2 times as bright as any star in the sky. As it went over head I flashed my flash light at it but I didn't get any response, I would not have flashed my light at it if it had blinking lights on it, also there was no noise at all comming from the object. I saw a object like this befor and they said it was Sky Lab? I look at my phone and it was 9:02 p.m. so if it was Sky Lab that should help. The object didn't make any weird moves or speed up or slow down any, and I think alot of people could have seen this object even with the full moon. On question #3, I didn't think it was a plane, I don't know why.#4 it was very bright and only one color, didn't make any quick moves.#5 I thought it would flash back when I flashed my lite at it but it didn't, and hope it wasen't Sky Lab.#6 It just went out of view."],"Weather Factors":"Unknown","Sighting Duration":"00:00:30","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=37.614296,+-120.947011(46965)&iwloc=A&hl=en\"> mufon case (46965) map </A>","trends":["There have been 48 other sightings in Modesto","There were no other sightings in Modesto on or around April 24th 2013"],"Source":"MUFON","Country":"United States","Region":"California","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/46965.html.txt","/var/www/straped/mufon/org/46965.html"],"Case Number":"46965","Tags":"City","City":"Modesto","Log Number":"US-04252013-0003","Date of the Event":"04/24/2013 09:02 UTC"}