{"Viewing Distance":"101-500 Feet","Region":"Osijek-Baranja County","Case Number":"46962","Disposition":"Unresolved","Latitude":"45.543131","Object Features":"Unknown","Object Shape":"Sphere","Sighting Duration":"Undisclosed","Summary":"orange star like sphere appeared out of nowhere moving with constant speed almost streight, glowed, disappeared, reapeared and immediatly changed direction from heading north to north-east with elevated straight path and disappeared","divs":["Sighting DetailsI opened a window before I went to bed. 10 seconds later I stared at the window opening looking at the clear night sky and suddenly bright orange light appeared out of nowhere aprox. 500m from my house. It glowed, had constant speed for 2sec and followed almost straight path. At first I tought it was another meteor falling down but than I relized there is no burning glow or tail or anything and before I could make any sense of it - it disappeared - only to make itselfe visible once agains just moment later, then it rapidly turned and continoued going straight foreward with an elevated path-opposite of falling! After a constant 2secs visible flight it disappeared again in thin air. There was no noise the whole time. I never saw a UFO before, I studied astronomy in high school and I know how celestial objects behave. After sighting I stared at the nigt sky for about 10min searching for the object. Finnaly i decided to share this with the world by typing UFO reporting in google with no hope of finding website like this."],"Source":"MUFON","Date Submitted":"04/24/2013 10:15 UTC","Longitude":"18.684561","Country":"Croatia","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=45.543131,+18.684561(46962)&iwloc=A&hl=en\"> mufon case (46962) map </A>","Tags":"City","Date of the Event":"04/25/2013 03:12 UTC","files":["/var/www/straped/mufon/html2text/46962.html.txt","/var/www/straped/mufon/org/46962.html"],"trends":["There have been no other sightings in Osijek","This sighting has never been favorited."],"Weather Factors":"Unknown","City":"Osijek","Log Number":"HR-04242013-0014"}