{"Object Shape":"Diamond","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=36.687075,+-93.86643(46963)&iwloc=A&hl=en\"> mufon case (46963) map </A>","Viewing Distance":"Unknown","trends":["There have been 10 other sightings in Cassville","There were no other sightings in Cassville on or around April 24th 2013"],"Source":"MUFON","City":"Cassville","Tags":"City","divs":["Sighting DetailsMy husband and I were out walking our dog Leroy up the Street toward the north. I looked up at the sky to see if anything was happening out of the unusual and sighted two blinking lighted objects speeding across the sky to the west of my backyard. It passed behind the tallest tree in our yard. The first two were very close together moving in a straight path for the most part. Just as they passed out of view the rearward one abruptly changed directions for a small space and passed the forward object, and they together passed beyond the horizon in a northerly direction. About ten seconds later a third object identical in lighting and direction as the other two objects. The objects were flashing lights on the bottom that not only varied in color but direction of the lights from side to side as well as back to front. There was no rhyme or reason to them some was all white and other times it had various colors some all the same and some were different colors and sometimes a single light in the middle of the bottom of the craft would show. All three craft showed these light patterns as they crossed the sky. The craft made no noise as they crossed the sky."],"Object Features":"Unknown","Longitude":"-93.86643","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Summary":"three UFOs with flashing lights moving at a great speed accross sky west of my back yard","Log Number":"US-04252013-0001","files":["/var/www/straped/mufon/html2text/46963.html.txt","/var/www/straped/mufon/org/46963.html"],"Region":"Missouri","Date of the Event":"04/24/2013 11:10 UTC","Weather Factors":"Unknown","Latitude":"36.687075","Date Submitted":"04/25/2013 12:45 UTC","Case Number":"46963","Country":"United States"}