{"Object Shape":"Star-like","City":"City of Industry","Tags":"City","Country":"United States","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.022854,+-117.948705(46974)&iwloc=A&hl=en\"> mufon case (46974) map </A>","Longitude":"-117.948705","Summary":"Bright star-like object hovering","Weather Factors":"Unknown","Object Flight Path":"Stationary,Straight-line path","trends":["There have been no other sightings in City of Industry","This sighting has never been favorited."],"Disposition":"Unresolved","Region":"California","Date Submitted":"04/25/2013 09:42 UTC","Latitude":"34.022854","Case Number":"46974","Log Number":"US-04252013-0011","Viewing Distance":"Unknown","Date of the Event":"04/07/1982 08:48 UTC","divs":["Sighting Details I returned home for the evening on April 7, 2013 at approximately 8:30 pm. Once I had gotten settled I went outside to feed my dogs. My dogs wanted to play instead of eat, so I was throwing a ball for them to fetch. As they raced into the backyard to retrieve the ball I noticed a very unusally bright star-like object hovering high above my neighbors house. I yelled out to my brother to come take a look at it. At first we thought it may have been a planet, but after a few moments of staring at it the object began to travel slowly heading northeast. I quickly pulled out my cell phone and began to record the object but I could not see it on the screen. When looking at it, it was very bright and stood out aganist the dark sky, yet I recorded 30 or so seconds of just dark sky. In my frustration I switched to the regular camera and snapped a quick photo. It continued to pick up speed still continuing in a northeast direction. There was a helicopter approaching underneath the object but it was very low in comparision to the height of the object. As soon as the helicopter and object were almost perpendicular to eachother the object immediately turned its light out like a switch and it was gone. After the sighting my brother and I were still talking about how crazy what we had just seen was when I remembered that I had taken a photo. At first glance it appeared I had gotten nothing but as I zoomed in and started cropping the photo there is definitely something there. However, the camera caught the object in a different way then what we had seen with our eyes. In person it appeared to be a massive star, yet in the photo it looks like a small grey glow-worm. When the photo is further enhanced it looks almost like a constellation with the dots connected. I have no doubt after seeing the enhanced photo that this is way beyond the technological capabilities we have established here. I still have no idea what it was but it is something my brother and I won't soon forget..."],"files":["/var/www/straped/mufon/html2text/46974.html.txt","/var/www/straped/mufon/org/46974.html"],"Source":"MUFON","Object Features":"Unknown"}