{"Log Number":"US-04252013-0009","files":["/var/www/straped/mufon/html2text/46971.html.txt","/var/www/straped/mufon/org/46971.html"],"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Object Features":"Unknown","Summary":"3 disc shaped craft sighting - approximately 4 hours of time loss","map":"<A HREF = \"http://maps.google.com/maps?q=42.462418,+-83.468227(46971)&iwloc=A&hl=en\"> mufon case (46971) map </A>","Object Flight Path":"Other","Longitude":"-83.468227","Country":"United States","Weather Factors":"Unknown","Object Shape":"Disc","Tags":"City","Source":"MUFON","Sighting Duration":"Undisclosed","Date Submitted":"04/25/2013 05:05 UTC","divs":["Sighting DetailsI was with a friend in an RV driving back from a road trip. Along the last part of our journey my friend said that she was seeing ufos in the sky. I didn't pay much attention to what she was looking at because I was focused on driving. At that point they looked like stars to me. We parked at Guernsey Dairy in Northville some time around midnight or 1 am and were going to sleep there for the night. We got out of the RV to stretch. I had a bottle of essential oil in my hand and dropped the cap. My friend said holy *#%^@$!! I was still looking for the cap that I dropped. She said look it is a UFO! At that point what I saw looked like a row of street lights. The lights were very bright however, I couldn't see anything. She was so shaken up it rattled me as well. So we got in the RV and drove to the nearest place we could think of, which was Meijer, down the road. When we got to Meijer it was getting light out! We got out of the RV and looked up into the sky. We saw 3 grey disc shaped objects floating up into the sky sort of like hovery the way leaves would fall from a tree, except going upwards. We tried to talk to several people coming out of the store but all ignored us except for one. That one person was a male and we asked him if he saw these objects ascending into the sky. He said that he could see them. We asked what they were, and named things like satellites, airplanes, etc. He said that they were none of the things that we mentioned and he said that he didn't know what they were. So we went back into the RV and tried to get some sleep. When we woke up after several hours we went to my ex mother-in-law's house to take showers. When my friend got out of the shower she showed me three red dots in the shape of a triangle on the right side of her belly. At that point for some strange reason I disregarded it! I made some excuse that maybe she had gotten bitten by fleas or something. It was bizarre, why would I disregard such a thing? So at any rate, I'm not posting this to freak anyone out. I just wanted to finally get this up on mufon. I had many many experiences after this, but nothing quite like this one. It would be difficult to explain what I've experienced with this sort of thing over the years, but I don't feel threatened by these encounters in any way. This may sound crazy after describing such an experience. What I can say is that these beings that are out there seem to be on another dimensional level"],"Case Number":"46971","Latitude":"42.462418","Disposition":"Unresolved","Region":"Michigan","City":"Northville","Date of the Event":"07/30/1995 12:00 UTC","trends":["There have been 11 other sightings in Northville","There were no other sightings in Northville on or around July 30th 1995"]}