{"files":["/var/www/straped/mufon/html2text/46982.html.txt","/var/www/straped/mufon/org/46982.html"],"Date of the Event":"07/24/1994 12:00 UTC","Tags":"City","Case Number":"46982","Date Submitted":"04/25/2013 03:06 UTC","Viewing Distance":"20 Feet or Less","Region":"Wisconsin","map":"<A HREF = \"http://maps.google.com/maps?q=43.076202,+-89.39603(46982)&iwloc=A&hl=en\"> mufon case (46982) map </A>","Log Number":"US-04252013-0020","Summary":"Woke up from sleep and saw entity watching me from an open window, watched each other then eventually lost consciousness","Country":"United States","Longitude":"-89.39603","Latitude":"43.076202","divs":["Sighting DetailsIt was 1994 or 1995 I am not too clear on the date because I was 4 or 5 years old at the time. I know it was late summer because it had to have been to be warm enough in Wisconsin to swim in a pool. Mom, Dad and my two brothers, one was my twin and the other was a year younger and has autism. We went up there to Madison to visit my uncles and other relatives. It was a long drive since we live in Arkansas. We drove up there. Anyway, after a long day, I guess I ended up falling asleep so I was put in this papasan chair with a blanket in a guest room. My mother tells me we all slept in the same room, I didn't hear any other noise from anyone in the house, but people must have been awake because no one else was in the room with me. It was like I was shielded from everyone else in that room or something. As I woke up, I seemed to be situated about 5 feet in front of the window in the chair. I am not sure but it seemed very quiet and dark. I remember feeling scared at first as I woke up, and when I looked at the window, because I saw light coming from it. There, right at the window, was an entity with its hands on the window sill, staring directly at me. As soon as I looked at its face, I immediately felt calm, unafraid, and actually curious. It, too, looked interested in me. You know how when you have the flash on a camera and you take a picture too close? How the light from the flash is so bright you can't really see the detail of someone or something? That's what the light on it's body looked like. A white light. But also, around its body, was this golden aura. Almost metallic looking. It seemed to tilt its head sideways slightly. I remember its eyes were small, black, but it seemed to have a reassuring look. I felt like everything was going to be okay. It was like it was comforting me somehow. And then, after that, I must have lost consciousness. It was an odd atmosphere in the room for sure. I cannot explain it. I know there are gray aliens, reptilians, and other aliens but I have never heard of this particular type. I have researched everywhere and have come up with nothing. From what I could tell though, it seemed to observe children as if it was guarding me or protecting me from something. That's how I perceive it."],"Source":"MUFON","trends":["There have been 23 other sightings in Madison","There were no other sightings in Madison on or around July 24th 1994"],"City":"Madison","Sighting Duration":"Undisclosed","Object Flight Path":"N/A","Object Shape":"Other, Unknown","Weather Factors":"Unknown","Disposition":"Unresolved","Object Features":"Appendage(s), Other"}