{"Log Number":"US-04252013-0021","Source":"MUFON","Summary":"2 UFO's same time. 1 BRIGHT-WHITE STAR-LIKE Obj. moving into position, 1 GIANT (1 mile long) Chevron, 100-300 feet from the ground.","Region":"Mississippi","files":["/var/www/straped/mufon/html2text/46983.html.txt","/var/www/straped/mufon/org/46983.html"],"Object Features":"None","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Longitude":"-89.332444","Tags":"City","Date of the Event":"10/01/2011 02:40 UTC","divs":["sighting detailsi had just moved into my apartment in hattiesburg within a couple months time, it was a low altitude overcast at night, but clear in certain areas. at the time i did not have a bed, i was a poor college student with a floor bed made out of my comforter and blankets on the floor in my bedroom. it got to be about 2:30am at night from a serious session of computer gaming. at about 2:40am i'd say, i had just laid down in my \"bed\"; i have a single large window in my bedroom which i close the blinds at night, the way i close them is facing downwards so i can look up at the sky laying near the window (head and body laying straight from the window, not sideways). as i take a look through the blinds, an extremely bright object came into my view near the side of the window, now at this point to me it looks exactly like what you'd see from the \"north star\" or a \"satellite\" reflecting the sun, it was that bright.. however, the way i knew it wasn't a star, or a satellite was that it continued to ascend in a diagonal angle (and it wasn't in our atmosphere), i could tell due to it passing each of the \"blind blades\" until it got to a certain point literally in the center of the sky, i'd say a few miles up, then started to \"wobble\" sort of \"bounce\" and very slowly move around, but while remaining in the same position. now to just to clarify, i'm fully aware of illusions of movements occurring when you stare at a far off object for too long, however i made a point of not doing this, basically \"refreshing\" my eyes and looking away every so often, while eventually getting off the floor and opening the window. now as all of this is happening, i catch something in the very right hand corner of my peripherals.. it was a large blacker than black, completely silent, possibly over 1 mile in size from one chevron end of the craft to the other, no visible externals of any sort, or lights. now let me make it clear, that it was dead-silent, also about 3am, and only likely to be no more than a mile away, it was meant to be stealth, and not seen, or heard. needless to say, a craft over a mile in size hovering\\moving in a straight line (opposite direction of the star object) with absolutely no noise, literally right over every hattiesburg building in altitude, gave me tremendous goose bumps as i called my friend dale immediately to tell him whats going on, as he's talking to me he's googling sightings in hattiesburg being the skeptic he is (very sneaky), he found a farmer family that had a sighting, and matched my exact description of the craft which completely blew his mind. also, keep in mind this guy is pretty closed minded, and very skeptical of everything; now i'm not that way personally, i was taught to never shut things out by my parents and i've always had a passionate interests and an absolute 100% knowing in other life beyond our planet visiting our world. it's common sense alone. as the large black chevron moved forward consistently it left my view after about 5 minutes because it went past the edge of the apartments brick-wall of my apartment complex, so i ran around front, outside, but couldn't see anything due to how heavy the overcast was on the south-side of my apartment, so i went back inside and watched the star-like object continue to \"bounce\" so to speak in it's same position for the rest of the night. i was unable to sleep, so i continued to play games until about 6ish-am in the morning, while checking on the light every hour or so.. however i could not see the object any longer as soon as day broke, and i finally went to sleep. various details - i tried to record or take pictures with my phone, sadly i had an iphone at the time, and the camera literally couldn't even pick up the bright star floating in the middle of the sky, and especially the black stealth object. i've had a few other absolute \"beyond what we know of mainstream technology wise\" sightings, and the best part which i will report the other sighting as well, was with 2 other witnesses that watched the entire thing with me. basically 5 blue-star objects, half-v formation going thousands of mph across breckenridge apartments only a couple miles up, and then split off like 5 bottle rockets strapped together \"loosely\" and vanished instantaneously going in all opposite directions of each other no trails, (all bright blue stars) and dead-silent. thanks for listening :) loved the steven greer sirius 2013 april 22nd documentary,that's what made me come here. i'll continue to update, i'm always looking up! (also my drawing of the craft should be wider \"wing\" span) but it's close. (please contact me through my email if you have any questions)"],"City":"Hattiesburg","Date Submitted":"04/25/2013 03:59 UTC","Object Shape":"Chevron","trends":["There have been 10 other sightings in Hattiesburg","There were no other sightings in Hattiesburg on or around October 1st 2011"],"Case Number":"46983","Country":"United States","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Flight Path":"Stationary,Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=31.337887,+-89.332444(46983)&iwloc=A&hl=en\"> mufon case (46983) map </A>","Latitude":"31.337887"}