{"Latitude":"46.139482","Source":"MUFON","Date of the Event":"04/24/2013 12:00 UTC","files":["/var/www/straped/mufon/html2text/46987.html.txt","/var/www/straped/mufon/org/46987.html"],"Log Number":"US-04252013-0025","Object Features":"None","Country":"United States","trends":["There has been one other sighting in Warrenton","There were no other sightings in Warrenton on or around April 24th 2013"],"divs":["sighting detailsmy husband and i went to the beach at fort stevens. it was a clear sunny day and about 70 degrees. we walked on the beach, noting that there were whales in the area during the past two days. we saw whales on 4\\23 and 4\\24\\13. my husband had to go to work, so we were leaving the beach at approximately 12:55 pm. i climbed up the dune and looked to the south, to tillamook head and seaside and saw two enormous black squares over the water. i have seen this view from ft. stevens for over 25 years of my life and knew that they didn't belong there. they were definitely not cargo ships, because of their height\\shape. they were not long, rectangular and close to the water, they were square and above the water. there is an old lighthouse in that area, that was completely obscured by one of the objects. they were miles away from us, but were absolutely huge-- bigger than a football field by 2 or 3 x. the objects stayed in place for a few minutes while we watched, then the one closer to the lighthouse sank into the water. the one to the right kind of sank into the water until about 2\\3 of it was submerged, then disappeared. they were enormous, black, had no lights. there was no mistaking their shape because it was crystal clear and sunny. they were well above the water and the horizon and very clearly not ships or boats."],"Longitude":"-123.931525","Tags":"City","Case Number":"46987","City":"Warrenton","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Summary":"Large black square sunk into ocean near Tillamook Head","Region":"Oregon","Date Submitted":"04/25/2013 10:24 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=46.139482,+-123.931525(46987)&iwloc=A&hl=en\"> mufon case (46987) map </A>","Disposition":"Unresolved","Object Flight Path":"Other","Object Shape":"Unknown","Viewing Distance":"Over One Mile"}