{"Log Number":"US-04262013-0004","Disposition":"Unresolved","Date Submitted":"04/26/2013 01:38 UTC","Region":"Utah","Case Number":"46993","Date of the Event":"04/25/2013 09:02 UTC","Sighting Duration":"Undisclosed","Object Features":"Other","trends":["There have been 73 other sightings in Salt Lake City","There were no other sightings in Salt Lake City on or around April 25th 2013"],"Source":"MUFON","Latitude":"40.69493","Longitude":"-111.967214","divs":["Sighting Details I got a strong urge to go outside, if I did that I'd see UFOs. It was like a voice in my head telling me it would be after 9:00 pm. The numbers 9:02, 9:08 popped into to mind and others times, but I only remember the first two. I have not gone out to look for a long time. I have been just noting I was being summoned, but refused to go outside.....refused to corporate with them. Anyway I decide to go outside and corporate this time. I take my binoculars and cell phone. My 10X50 binoculars are mounted on a tripod, which enables steady clear viewing. The first one at 9:02 pm..... I see it up high as told. It was maybe 12,000 feet in altitude? It was going very fast, it crossed half the sky in about 5 seconds. It was heading north. Appeared to be bright white round sphere. As usual nothing blinked on it, Just one solid round lit sphere. The second one was moving much slower, it was heading North-northwest. It went on the west side of the valley. I'm guessing it was about 9,000 feet in altitude. The time was 9:08 pm as told. Appeared to be bright white round sphere. Again no FFA marking lights, no sound, just a bright round glowing ball. Solid light. The third one was slowing coming over the valley from the west. It turned and headed towards me for a few moments. I was thinking great! It's going to come right over me! Then....as I thought of videoing it or photographing it......It then turned once I thought of doing this. It seemed to turn on purpose for me thinking this. It seemed this was not pleasing to them. So they turned and headed South-southeast. It was only about 6,000 feet or less in altitude. Bright white round sphere with no FFA marking lights. I could not hear any sound. As close as it was, I could have got good video footage. However, I have tried this a few times and got foiled for my efforts.....hahaha. I also knew if I don't do this, then they will come more often and get much closer next time. So I did not bother to try and did not want to irritate them. I know this sounds crazy to most everyone, but a few people will know exactly what I'm saying here. So I added this in the report for those select few that will identify with what they have experienced with UFOs too. The time for this one was 9:13 pm. I watched it for about 4 minutes? These bright white round spheres have a black small spot on the bottom of them, which is only visible up close and once they are over you. It can not be seen from a side view, only from a bottom view of this craft. The fourth was coming from the east side of the valley and heading North-northwest. It was moving slow. It then slowed down, appearing to stop and started to dim down slowly. It was soon not visible. It was bright white and I think it was at about 7,000 feet AGL. The time was 9:29 pm. I waited until almost 10:00 pm, but did not see it again or any others. After this one I did not observe anything other than a satellite, so I went back inside."],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.69493,+-111.967214(46993)&iwloc=A&hl=en\"> mufon case (46993) map </A>","Summary":"Four bright round spheres, 40 to 50 feet in diameter","Country":"United States","files":["/var/www/straped/mufon/html2text/46993.html.txt","/var/www/straped/mufon/org/46993.html"],"Object Flight Path":"Straight-line path,Path with directional change","City":"Salt Lake City","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Shape":"Sphere"}