{"Summary":"Bright star hovered, then shot around then hovered, then moved slowly overhead then turned dim and disappeared","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/46994.html.txt","/var/www/straped/mufon/org/46994.html"],"Region":"Arizona","Object Features":"Unknown","Sighting Duration":"Undisclosed","City":"Cottonwood","Case Number":"46994","trends":["There have been 13 other sightings in Cottonwood","There were no other sightings in Cottonwood on or around April 25th 2013"],"Date of the Event":"04/25/2013 08:08 UTC","Date Submitted":"04/26/2013 02:09 UTC","Object Flight Path":"Path with directional change,Path then hovering","divs":["Sighting DetailsI was outside on the phone with my mom it was 8:08p.m. Thursday night, April 25,2013. I saw a bright star. Then all of a sudden in moved. I watched for a second and it shot around and then hovered again. I thought I was seeing things. I told my mom I gotta go and ran in and got my daughter and fiance. By then it had moved quite a bit and was now in front of my house. My finance thought it was a star and I told him noooooooooooooo, it started way over there. It was hovering. then it took off slowly towards the moon. It started to dim and vanished. It was beautiful to behold. I was able to get one photo on my cell phone before it disappeared. The first photo you will see a small white light above the moon light. The second photo is the same picture that I blew up and cropped on my phone. I went back into the house all excited. My 11 year old daughter was still outside watching the sky. She came running in the house and said there were lots of planes out including the papparazzi. How cute is that? So I went back out and took a look. There were quite a few planes in the air and I could see how a child might of thought the paparazzi were here. She asked if it was going to be on the news. She wanted everyone to know. We stayed out for about another 30 minutes just starring at the night sky. The emotions we felt were pure excitement, a little freaked out and wanting another glimpse of the object we had just seen. It's been hours now and both of us are sill so wound up."],"Country":"United States","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.724405,+-112.007055(46994)&iwloc=A&hl=en\"> mufon case (46994) map </A>","Weather Factors":"Unknown","Viewing Distance":"Unknown","Latitude":"34.724405","Log Number":"US-04262013-0005","Longitude":"-112.007055","Source":"MUFON","Disposition":"Unresolved"}