{"Log Number":"US-04262013-0014","Object Shape":"Triangle","divs":["Sighting DetailsThis happened on a fairly warm, very clear night just outside my home around midnight. My friend and I were outside, laying face up on my paved driveway, talking and idly stargazing. I'd like to note that we'd been focused only on the area of the sky directly above us this whole time. About 15 minutes pass before I notice what I believe to be three stars. All of them are subtly brighter than the other stars in the sky, and even more striking is that they're perfectly arranged in an equilateral triangle. At this point I've been looking at it for approximately 45 seconds and have no reason to believe I'm not simply looking at stars, but I decide it's interesting enough that I point it out to my friend. I believe I said \"Look at that perfect triangle of bright stars\" while pointing. As soon as I complete my sentence, the triangle formation begins to spin slowly. We both sit up. The triangle's spinning increases in speed, though it never gets incredibly fast. We're both saying things like \"Oh my God,\" and \"What is it?\" This goes on for perhaps 15 seconds. Then it flashes, like a giant camera. The flash doesn't illuminate the sky the way lightning does--it seemed to flash \"on\" us specifically. I feel that this is an intentional acknowledgement that it knows we've seen it. Whether it was meant as a positive, negative, or neutral gesture, I can't say. Within 2 seconds of the flash, it begins to travel along a northwest path. This is where I can confirm that it's a solid craft because it blocks view of the stars as it moves. It's slow at first but rapidly gains speed. It's moving faster than a commercial airliner but not faster than a stealth aircraft. We begin to chase it, both of us felt a kind of happy awe at what we're seeing. We're laughing and panting as we follow it, but it quickly disappears into the distant horizon. Half-serious, I yell \"come back!\" in its direction. We both express some version of \"no one is going to believe this.\" Never saw it since."],"Date Submitted":"04/26/2013 02:26 UTC","Tags":"City","Country":"United States","Longitude":"-121.921246","Region":"California","trends":["There have been 6 other sightings in Pacific Grove","There were no other sightings in Pacific Grove on or around May 1st 2004"],"Source":"MUFON","City":"Pacific Grove","Object Features":"Unknown","Object Flight Path":"Hovering then path","Date of the Event":"05/01/2004 12:00 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.613316,+-121.921246(47003)&iwloc=A&hl=en\"> mufon case (47003) map </A>","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/47003.html.txt","/var/www/straped/mufon/org/47003.html"],"Disposition":"Unresolved","Sighting Duration":"00:02:30","Summary":"Solid equilateral triangle with star-like light on each of three tips.","Case Number":"47003","Latitude":"36.613316"}