{"Object Features":"Unknown","divs":["Sighting DetailsA simple sighting, but unforgettable. My brother and I were stargazing in the summer (July) of 1968. This was in the State of Maine,11:00PM. This was something we did at least twice a week. Laying back in lounge chairs. I was 17 years old, my brother 20. We would always point out to the other if anything was seen, like shooting stars. I spotted what I thought was a satellite, and pointed it out to my brother. He said \"I see it.\" Nothing unusual as we had seen many before. We were both following it when suddenly it changed direction abruptly. A change of 90 degrees, instantly. I said \"did you see that?\" Yes! Wow! My brother replied. We were both stunned that what we thought was a satellite had suddenly done something not possible for a satellite to do. Its speed never changed during its sudden change of direction. It continued across the sky until it was out of sight. Its speed remained constant beginning to end. I am 61 years old now and my brother and I still talk about that summer night. Like I said, simple but unforgettable."],"Source":"MUFON","Disposition":"Unresolved","Viewing Distance":"Over One Mile","trends":["There has been one other sighting in Kittery","There were no other sightings in Kittery on or around July 1st 1968"],"Country":"United States","Region":"Maine","Weather Factors":"Unknown","Log Number":"US-04262013-0011","Date of the Event":"07/01/1968 11:00 UTC","Latitude":"43.090151","Object Flight Path":"Path with directional change","Case Number":"47001","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/47001.html.txt","/var/www/straped/mufon/org/47001.html"],"Date Submitted":"04/26/2013 01:03 UTC","City":"Kittery","Longitude":"-70.769381","Tags":"City","Summary":"Looked like a satilite,then changed direction abruptly.","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=43.090151,+-70.769381(47001)&iwloc=A&hl=en\"> mufon case (47001) map </A>"}