{"City":"San Bernardino","Longitude":"-117.30768","Object Features":"Appendage(s)","Latitude":"34.137911","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=34.137911,+-117.30768(47014)&iwloc=A&hl=en\"> mufon case (47014) map </A>","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Tags":"City","Source":"MUFON","Summary":"orange glowing object","divs":["Sighting Detailsfirst noticed object in the sky at approx. 9:30 pm. pacific time in the eastern sky over southern California, full moon in the SSE sky. It was hovering glowing bright orange like a solid object. the entire thing was glowing. it appeared to have same color wings, or protrusions on either side of the object. I couldn't really tell the details, the relative size of the object was approximately a yard wide, relative to where I was standing. a guess a t actual size must have been smaller than a football field. the shape is hat shaped with inverse bottom. and side protrusions. possible disk shape. Again the whole thing was equally as bright a light source...I ran inside to get someone to look with me. after 30 seconds the other wintess and I returned tot the location I vwitnessed the object. by then it had sped off into the direction of the sunrise. it was still clear that the object was glowing orange and solid light source. witness number 1 went inside to get binoculars. witness #2 saw the object becoming more and more distant and star like...then dropping abruptly lower into the ambient light of the moon and then into the city lights on the horizon. then both witnesses saw the object change to a blinking light object that we believe was still the same object. we lost sight of the object in the bright coronal light of the moon, as it sped in the SEirection."],"Country":"United States","Case Number":"47014","Disposition":"Unresolved","Viewing Distance":"Over One Mile","Date of the Event":"04/26/2013 09:28 UTC","Date Submitted":"04/27/2013 01:38 UTC","files":["/var/www/straped/mufon/html2text/47014.html.txt","/var/www/straped/mufon/org/47014.html"],"Object Shape":"Sphere, Star-like","Region":"California","trends":["There have been 17 other sightings in San Bernardino","There were no other sightings in San Bernardino on or around April 26th 2013"],"Log Number":"US-04272013-0004"}