{"Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Tags":"City","City":"Florence","files":["/var/www/straped/mufon/html2text/47026.html.txt","/var/www/straped/mufon/org/47026.html"],"Object Flight Path":"Straight-line path","Date Submitted":"04/27/2013 08:16 UTC","divs":["Sighting DetailsIt was after 10PM and I went outside on my patio to smoke. I was sitting on a chair and saw what I thought was an airplane flying over the tree tops. ( I live in-route of one of the flight patterns at CVG.) I thought it was really bright...the lights were like that I had never seen before...orange and red and yellow. I was thinking to myself as I was smoking that it was strange...then I saw another one coming, and it was the same colors, and now I thought OMG, these planes are on fire...but then they didn't start to descend...so now I started to wonder what the heck was going on...and another one arrived, and over the tree-tops, more and more were coming...Now, I started to freak out! At this time a neighbor and a friend came out and I saw them looking up and they had the same look on their faces...shock...terror...my neighbor said goodnight to her friend and was coming back to our building and I said to her, \"You do see what I am seeing, don't you...\" and I asked her if she knew what the h** it was...she said she had no idea and it was freaking her out and that she was going back inside and I knew she was honestly scared, as I was...So, these UFO's are flying over my apartment and I am trying to think of a logical explanation as to what they were...They made no noise...The only thing that makes any sense to me is that they must be affiliated with the Air Force, some type of aircraft that is experimental...a classified mission...I don't know...The UFO's flew in the same flight pattern as plane's go to CVG, so they went over the roofs of my building and I didn't walk around to see if they were still insight...The last UFO was tagging behind and apparently had been doing so from how it looked to me. There had to be 12-15 of them...maybe more...I didn't count them, I was kind-of in shock...Still am. There has to be a logical explanation to what I saw...Oh...and I forgot to mention when about half of them had gone over, there was a jet flying at a really high altitude going in the opposite direction...I would think that he must have seen something, I don't know..."],"Case Number":"47026","Object Features":"Unknown","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=38.996954,+-84.619285(47026)&iwloc=A&hl=en\"> mufon case (47026) map </A>","Sighting Duration":"Undisclosed","Longitude":"-84.619285","Country":"United States","Latitude":"38.996954","Summary":"approx 15 ufo's appearing to be on fire flying over my home in a flight pattern toward CVG at about 10pm making no noise","Object Shape":"Diamond, Fireball, Oval","Log Number":"US-04272013-0016","Source":"MUFON","trends":["There have been 5 other sightings in Florence","There were no other sightings in Florence on or around April 26th 2013"],"Date of the Event":"04/26/2013 10:12 UTC","Region":"Kentucky"}