{"Log Number":"US-04202006-0003","Region":"New Mexico","City":"El Paso, Texas","Date of the Event":"10/11/2000 07:30 UTC","Tags":"City","Latitude":"31.803982","Longitude":"-106.205148","Case Number":"4702","divs":["Sighting DetailsMy husband just arrived home and yelled for me to come outside quickly - He pointed up and we watched as the UFO approached silently just slightly higher than the rooftops of the 2-story homes on our street. It stopped 2 houses away and hovered silently for over 3 minutes. I was afraid that if I left to grab the camcorder that I would miss it. There was NO sound - not even birds chirping. There was no breeze. It was still daylight and the object was between us and the bright sunset. We were paralyzed with excitement, astonishment and awe. We were looking up at the underside. The point was toward us and under the front point was a large round orange \"light\" that appeared to have a slow swirling movement within it. The light was like the bright orange of a flame. The bottom appeared black to us and had a linticular shape. After it hovered, the point of it very slight and slowly turned toward the north and it began to bank to its left slightly and moved to the north past the rooftop of our neighbor's house. I ran as quickly as I could back inside to run upstairs to our backyard balcony. By that time it had already moved many miles north over the desert toward Las Cruces, New Mexico. After it moved away it appeared to release a large clear teardrop shape from the center. There was no side to side or swinging movement in this teardop shape as it moved slowly from the bottom of the object to the end of it's \"tether\". We have estimated that if it were on the ground it would measure approzimately 25 feet from the front point to the rounded back and approximately 18 feet across at the widest part of the rounded back end. We have both seen many weather balloons from many angles and during various stages from release to flight. We have both also seen many hot air balloons from many angles and various stages from take off to flight. This WAS NOT a weather balloon and it WAS NOT a hot air balloon. I have avoided reporting anything due to fear of ridicule. Then after watching a show on UFOs on the History channel and seeing all the reports on your website I finally feel compelled to report it."],"Object Shape":"Teardrop","Object Features":"None","Weather Factors":"None","Date Submitted":"10/11/2000 07:30 UTC","Summary":"Approached toward us from west moving east - hovered silently overhead over 3 minutes then silently moved north","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=31.803982,+-106.205148(4702)&iwloc=A&hl=en\"> mufon case (4702) map </A>","Viewing Distance":"101-500 Feet","trends":["There have been no other sightings in El Paso, Texas","This sighting has never been favorited."],"Country":"US","files":["/var/www/straped/mufon/html2text/4702.html.txt","/var/www/straped/mufon/org/4702.html"],"Object Flight Path":"Hovering then path,Path then hovering","Source":"MUFON","Sighting Duration":"Undisclosed"}