{"Disposition":"Unresolved","Latitude":"30.402189","Object Features":"Unknown","City":"Foley","trends":["There have been 4 other sightings in Foley","There were no other sightings in Foley on or around April 26th 2013"],"Tags":"City","Source":"MUFON","Longitude":"-87.631617","map":"<A HREF = \"http://maps.google.com/maps?q=30.402189,+-87.631617(47022)&iwloc=A&hl=en\"> mufon case (47022) map </A>","Sighting Duration":"Undisclosed","Country":"United States","Viewing Distance":"20 Feet or Less","Weather Factors":"Unknown","Region":"Alabama","Case Number":"47022","Date of the Event":"04/26/2013 10:00 UTC","Date Submitted":"04/27/2013 01:22 UTC","files":["/var/www/straped/mufon/html2text/47022.html.txt","/var/www/straped/mufon/org/47022.html"],"Summary":"cold blue/bright white light flash","Object Shape":"Flash","Log Number":"US-04272013-0012","Object Flight Path":"N/A","divs":["sighting details roughly 10:43 p.m. est. 3 people inside of house near open window witnessed a cold blue\\bright white light flash which lit up the entire inside of house as well as the outside. this was observed as all 3 were facing different directions, for the most part. the flash last less than an approximated 1\\8 second. there was no audible \"boom\" or any other sound associated with the flash that was observed. although there was a silence defined by lack of the usual animal nighttime sounds. it was also observed by a friend in gautier, mississippi. *update: approx. 2.5 hours later army reserves were called in to the artillery in the exact area. they were told that the munitions cabinet was \"open\". that was reduced to stand-by and further deployment was not implemented. the sky was very clear early in the night with numerous stars visible & a bright moon to the south. but it had gotten only slightly less clear with light haze in the upper atmosphere indicated also by the ice crystal formed halo ring around the moon around the time of the flash. location history: house is situated in a rural location 360ft.south of hwy98. 200ft. from the end of barin naval airfield which is a very lightly used strip used for training pilots. it is mostly a wooded area with less than 2 small homes between the strip & above stated house. all 3 people have a history of law enforcement. one is an army veteran of 11 years. one is an artist and the other is now an activist\\humanitarian."]}