{"Region":"New Hampshire","Latitude":"43.626146","Sighting Duration":"Undisclosed","Log Number":"US-04272013-0018","Weather Factors":"Unknown","Object Shape":"Unknown","Date of the Event":"04/25/2013 09:35 UTC","files":["/var/www/straped/mufon/html2text/47028.html.txt","/var/www/straped/mufon/org/47028.html"],"City":"Wolfeboro","Country":"United States","Viewing Distance":"21-100 Feet","Object Features":"Unknown","Longitude":"-71.200534","trends":["There have been 3 other sightings in Wolfeboro","There were no other sightings in Wolfeboro on or around April 25th 2013"],"Summary":"I opened my front door, saw object in sky, many lights, hovering quietly, quite large, drifted away very slowly as though scanning.","Tags":"City","Object Flight Path":"Stationary,Hovering then path","divs":["Sighting DetailsI was watching TV & opened the front door to call my cat inside. There is a beautiful full moon tonight with clear skies. It was rising in the East to my immediate left, still below tree level. I live on a dirt road with thickly wooded trees all around me & a pond directly across the road. I looked up & to my slight right (West) & saw a very large square to rectangular craft in the sky just above the treeline with approximately 15-20 red, white, light orange & yellow lights around & underneath it. It was totally silent. It was stationary when I first saw it & then it moved extremely slow & down a bit. It stopped again & hovered for perhaps 20-30 seconds, then began to move slowly to the right & lower. My heart was racing, I knew what this was & I was very frightened. I ran back in the house & called to my daughter so she could witness it also, & we both went back outside on the porch & I pointed it out to her. It had moved enough so that a very tall pine tree in my yard was obscuring part of it, & at that time it's enormous size wasn't as apparent as it had been just 60 seconds earlier, but she did see enough of it to know it wasn't right. I became frightened for our safety & we both came back inside. I ran around and shut off all the lights & turned off the dishwasher & called my neighbor to tell him this craft was directly in front of his house above the treeline. He is a night-owl & he did not answer his cell phone at 9:35, which I thought odd. My cat was still outside, & frightened to death or not, I wanted to know my cat was safe I was curious. I went back out & quietly called to him, he did not come. I then called another neighbor two houses down & asked him to look outside & tell me if he could see it, & he could not. I walked around the yard in my slippers trying to locate the craft & I could no longer see it. I walked to the end of my 50 foot driveway & started walking up the road to keep looking. Suddenly all the peepers in the pond across the road who were loudly chirping stopped all at once, & I was now standing in front of the pond. I became extremely scared & thought it better I be close to the house with my daughter, & I scurried up the driveway as fast as I could. It is now an hour later & although I have checked many times, I can no longer see the craft. I wanted very much to take a photo with my cell phone camera, but the light on the home-screen was so bright & I didn't want to call attention to us. It is noteworthy to mention that I have seen multiple sightings of very bright lights hovering & then moving very slowly just above treetop over the pond & along it's shoreline across the road during the winter months when there are no leaves to obscure my sight. I have watched these with binoculars & I could see them clearly, just a very large, very bright, very white light moving painstakingly slow, & then the light would suddenly just be gone. I would scan around trying to see where it went, & then it would appear again quite some distance to the east, even lower in the sky. They made no sound. Then they would very slowly dip down lower & lower in the sky, well below the tree line, heading towards conservation land at the end of the road (wetlands) until I could no longer see them. Some nights I would see many of these odd objects, all heading the same way, (east) & all appearing from the west. There is a small airport in the west, and where they originate seems suspiciously close to it. I also see many small planes that do make sound & rise in the sky as they get closer to me, but these other things I see so frequently stay low & are silent. Also, last year in the middle of the day while outside in the driveway talking to neighbors, I, along with my husband & both neighbors saw a very bright but soft yellow light which was quite large, oblong in shape, come towards us low in the sky, silently, and skim slowly over us and off to the horizon. It was one of those \"Did you SEE that????\" moments. It was not anything resembling a plane, it was too slow, too low, & silent. I have several friends who live close to me who have witnessed unexplainable objects in the sky, both day & night. Just a few days prior to this incident I was talking on my cell phone with a close friend who has seen many crafts herself, & at 2:00 AM we were talking about our experiences when both our phones disconnected at the same time, & then both were frozen for approximately 5 minutes. This frightened both of us & we can not explain the strange incident. The night I saw this craft, at exactly the same time the same friend, who lives close to me due south, heard very strange non human \"chattering\" sounds on her baby monitor for close to 4 minutes. Something is going on around here."],"map":"<A HREF = \"http://maps.google.com/maps?q=43.626146,+-71.200534(47028)&iwloc=A&hl=en\"> mufon case (47028) map </A>","Case Number":"47028","Date Submitted":"04/27/2013 11:28 UTC","Disposition":"Unresolved","Source":"MUFON"}