{"Date Submitted":"04/27/2013 01:42 UTC","Date of the Event":"03/14/2013 06:40 UTC","Viewing Distance":"Unknown","Longitude":"34.947191","divs":["Sighting DetailsIt was on my birthday, I came home not long after 18:00. I noticed something in the sky, at first I thought that those were airplanes but there was no noise, and they circled too long above my village. I can't say that it was a true circle path but they were going around and around and every..1 minute (approx) they would almost touch each other and then continue,again and again and again. Each of them had 3 apparent lights. those lights would go on and off , not blinking, more like fade in and fade out. The two objects were perfectly synchronized with the fade-in-fade-out of the lights. I have a Canon 40D and a Canon 70-200 2.8 IS lens. I immediately ran and started taking photos.. It was much harder that I thought it would be. It was too dark, hard to focus, almost no stars, trees or clouds. Just plain dark. I tried recording a video of it but the **** Sony would not focus on it. I did records few seconds with a different camcorder that had manual focus (I just noticed it before they left). Anyway, I took many photos but it's hard to tell what it was from them. For approx 90 mins they were circling around the village and then suddenly they started..drifting west until they were too far to see. There was also an army helicopter (pretty common in Israel) but it was flying much much lower than the objects. Umm.. What else ? My family was mad at me for staying outside instead of celebrating my birthday :) I'm attaching some photos from my 40D."],"Source":"MUFON","Disposition":"Unresolved","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/47023.html.txt","/var/www/straped/mufon/org/47023.html"],"Case Number":"47023","trends":["There have been no other sightings in Kfar Bin Nun","This sighting has never been favorited."],"Log Number":"IL-04272013-0013","map":"<A HREF = \"http://maps.google.com/maps?q=31.861679,+34.947191(47023)&iwloc=A&hl=en\"> mufon case (47023) map </A>","Latitude":"31.861679","Tags":"City","Region":"","Sighting Duration":"Undisclosed","Object Shape":"Triangle","City":"Kfar Bin Nun","Summary":"Two triangled objects circling almost silently for almost 2 hours.","Object Features":"Unknown","Weather Factors":"Unknown","Country":"Israel"}