{"Object Shape":"Triangle","Viewing Distance":"Unknown","Longitude":"-105.772837","Region":"Colorado","Source":"MUFON","Case Number":"47036","Disposition":"Unresolved","Country":"United States","Date Submitted":"04/28/2013 04:16 UTC","trends":[],"Sighting Duration":"00:00:02","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.559721,+-105.772837(47036)&iwloc=A&hl=en\"> mufon case (47036) map </A>","Date of the Event":"04/27/2013 12:00 UTC","divs":["Sighting DetailsI was at home, on my porch at about 10PM Saturday April 27, 2013. I was laying on my back staring at the sky, looking at the stars, planes, whatever... I had just focused my eyes on an airplane when suddenly a giant white triangular shaped object appeared - it was directly above me, it was enormous, and it was moving amazingly fast. It traversed the entire sky - horizon to horizon in about 2 seconds. It was hard to reference the size, exactly, but I got the sense that it was a VERY large object VERY far away. I immediately knew it was something out of the ordinary -- I never once thought it was something else; it was a clear night, not a cloud in the sky, and I got a good look at it. It was definitely not a plane or helicopter or balloon or kite or anything like that. This thing was pushing the limits of physics. The corners of the triangle were rounded, and the lights were big circles -- the light was yellowish-white, and it was kind of dimly lit -- I really got the sense that it was very far away, WAY up in the sky. My immediate reaction was shock and excitement. I could NOT believe what I had just seen. I felt like I had seen a ghost, or peeked into an alternate dimension or something. It was an unbelievable feeling. The object did not have any direct effect on me or my emotions. I lost sight of the object as quickly as I spotted it - the entire moment lasted about 3 seconds. It was traveling in a straight line -- it simply flew over me. It came and went, just like that."],"Latitude":"39.559721","City":"Undisclosed","files":["/var/www/straped/mufon/html2text/47036.html.txt","/var/www/straped/mufon/org/47036.html"],"Object Flight Path":"Straight-line path","Summary":"Giant triangular shaped object with yellowish white lights on the corners","Weather Factors":"Unknown","Log Number":"US-04282013-0008","Tags":"City"}