{"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/47037.html.txt","/var/www/straped/mufon/org/47037.html"],"Summary":"Several Orbs over Brooklyn caught on rooftop security camera","Viewing Distance":"Unknown","Latitude":"40.65967","Case Number":"47037","Country":"United States","City":"New York","Date Submitted":"04/28/2013 04:44 UTC","Object Shape":"Sphere","Tags":"City","Object Flight Path":"Straight-line path","Log Number":"US-04282013-0009","trends":["There have been 579 other sightings in New York","There were 2 other sightings in New York on or around April 27th 2013","This sighting has never been favorited.",""],"Region":"New York","Date of the Event":"04/27/2013 06:36 UTC","Longitude":"-73.94428","map":"<A HREF = \"http://maps.google.com/maps?q=40.65967,+-73.94428(47037)&iwloc=A&hl=en\"> mufon case (47037) map </A>","divs":["sighting details1. where were you and what were you doing at the time? i have 4 low end security camera, recording 24 hrs pointed slightly off n-e-w and south pointed upward to the sky at about a 30 degree angle. 2. what made you first notice the object? i randomly picked a start time of 18:00 to review the days video capture. 3. what did you think the object was when you first noticed it? even with the poor image quality of the camera, i've spent enough time to know what a plane looks like and birds. this was way different, i know i caught a fleet of ufo's too much daylight to be sending off chinese lanterns. 4. describe the object and its actions and motions in detail. that camera is pointing se from a 11203 zip code. from the known angle of the camera, the object appears to be heading nw in a somewhat straight line. there should be a video attached. 5. describe your feelings, reactions and actions, during and after sighting the object. i install the cameras\\dvr system on the roof solely for this purpose cause if you look up long enough, you will see something. i had a tear in my eye cause i caught a something within days of installation and it already paid off. note: i'm not one to get excited over seeing videos of dots scrolling across the skies ( nor do i expect you to be of my video) but this one is a sign for me to get a better camera system. the ch2 video has most of the object and ch1 (pointed ne) has shows runoffs from ch2."],"Object Features":"None","Sighting Duration":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown"}