{"Case Number":"47038","Region":"Plovdiv","City":"Markovo","Object Flight Path":"Other","files":["/var/www/straped/mufon/html2text/47038.html.txt","/var/www/straped/mufon/org/47038.html"],"Viewing Distance":"21-100 Feet, Over 1 Mile","Date Submitted":"04/28/2013 07:07 UTC","trends":["There have been no other sightings in Markovo","This sighting has never been favorited."],"Object Shape":"Boomerang","Disposition":"Unresolved","Latitude":"42.063336","Object Features":"None","Date of the Event":"09/20/2009 12:00 UTC","Sighting Duration":"Undisclosed","Longitude":"24.703545","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.063336,+24.703545(47038)&iwloc=A&hl=en\"> mufon case (47038) map </A>","Log Number":"BG-04282013-0010","Source":"MUFON","Summary":"Lights like car lights behind the hill and then object fligh above us","divs":["Sighting DetailsWe were with the car in the mountain over Plovdiv City in Bulgaria near Markovo. Was midnight. We watch the light of the city over the hill. In my backside was the upper hill. I saw lighs in the sky over me like was thunderstorm behind us. You know how the sky is glowing when thunders appears. Then I turned arround and I saw this light over the hill, like car is coming. Lighe beams from the ground behind the hill towards the sky. And then I asked my friends: \"what is this... I think there is no road?\" After I turned again towards the City and the lights was behind us. After couple of minutes something like presence in the sky make me to look up. And suddenly something huge fligh over us to the city (prick when I write this) I can see me in the reflection but at the same time I can see the stars in sky... and that feeling - when something huge is over you, such a power - but no sound, just silence and then breez. I was shocked!!! Scared! immediately got in the car. Was like elongated crescent boomerang. And we all was so scared! Only one of us missed the object. We started the engine and left the place... was amaziing but fearfully. In the all way to the city we did not say not a word..."],"Tags":"City","Country":"Bulgaria"}