{"files":["/var/www/straped/mufon/html2text/47043.html.txt","/var/www/straped/mufon/org/47043.html"],"Date Submitted":"04/28/2013 12:00 UTC","Region":"Michigan","Object Features":"Unknown","Object Shape":"Circle, Star-like","Weather Factors":"Unknown","Tags":"City","City":"Milford Township","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.598338,+-83.59787(47043)&iwloc=A&hl=en\"> mufon case (47043) map </A>","Case Number":"47043","Source":"MUFON","Date of the Event":"04/27/2013 09:15 UTC","Latitude":"42.598338","Summary":"5 starlike lights in sky 3 in triangle shape 2 at bottom left point of triangle shape the 2 were moving and all were pulsating red lasted a few minutes","Country":"United States","Disposition":"Unresolved","Longitude":"-83.59787","Log Number":"US-04282013-0015","trends":["There have been 4 other sightings in Milford Township","There was one other sighting in Milford Township on or around April 27th 2013"],"divs":["Sighting DetailsIt was dusk not dark enough for any stars in the sky and no clouds at all. I was driving down the road and through the trees lights caught my eye. At first I thought it was stars but when I could see it clearly I realized it was not dark enough for stars and there was nothing else in the sky. I could see five bright lights when I got a break through the trees I saw five bright lights three were in a perfect triangle shape. The other two were just above the bottom left point of the triangle pointing upward. After a minute or so the two pointing upward became level with the bottom left point of the triangle after a few minutes the two were gone. Now just the three in the triangle were still there. I watched them for a minute then went through the drive thru after about three minutes I looked back and they were all gone. They were pulsating a red and bluish color and looked like stars but were bigger and brighter. I was very freaked out because I have never seen anything like this ever in my life. After coming back to work from my break I overheard other people who had seen it also who had no explanation for what it could have been."],"Object Flight Path":"Stationary"}