{"Object Shape":"Fireball","Log Number":"US-04202006-0005","Date Submitted":"07/14/1991 12:00 UTC","Date of the Event":"07/14/1991 12:00 UTC","Object Features":"Undisclosed","divs":["Sighting DetailsI'm telling this story, in the even that others may have experienced something like this or similar: This happened quite a while ago, I've told family about this but no one else. I was with my then boyfriend, we went to a Burger King on Arlington St. in Akron. It was a warm summer day and we had the car windows down, enjoying the weather. For some reason, when we arrived at Burger King, my then boyfriend decided that he was going to go inside the restaurant and purchase our food. I should have been slightly surprised by this because he hardly ever went inside a fast food restaurant but on this occasion he said he was going to go in. There was a line a the drive thru but it wasn't significantly long, just a couple of cars. Anyway, what struck me odd about what happened, as I reflect is that, even before I saw the big ball of fire in the sky, I was aware that it seemed like my boyfriend was taking to long in the restaurant. I had that thought. Well, my eyes noticed the big ball of fire in the sky, I looked at it, I wondered what the heck it was, I got out of the car and continued to look at it. It looked like it was flying. It wasn't descending, it was flying through the sky. I can't give you distances because I'm not good at that, but, I could see it very clearly. I have no idea how long I looked at the ball of fire, but I know that my next thought was that my boyfriend had been in Burger King way too long. It seemed like I had been waiting for him for about 30 minutes to an hour. Just really long. I was mad. I had made up my mind that I was going to first, tell him off for taking so long, and then tell him what I saw in the sky. Needless to say, when he came out of Burger King and I was fuming, he couldn't believe that I was accusing him of taking so long in Burger King. I was like \"what took you so long?\" He was making excuses and saying he had only been in there for like 10-15 minutes. It seemed way longer than that. He asked me why I was standing outside the car. I told him I saw something in the sky. We went back to my house in West Akron, turned on the t.v. and ate our food. I was convinced that something would be on the news about the big ball of fire, but no. I did call the then local news station, which was 23 Akron news, but they said that they had gotten calls and that the object was a meteor. I said no way. That big, flying, not falling. It as almost like it was on a certain course. And I can't explain why time for me seemed longer than for my boyfriend. I can't explain how that happened. I never looked a the clock to actually see how much time had elapsed. This is not my norm, usually I'll pay attention to things like that so I can have proof before I start belly-aching about something. I never checked the clock. So I have to believe that he really was only in BK for 15 minutes even though it seemed like close to an hour. I'm not saying what I saw was an alien UFO or anything, I'm saying that I experienced an usual event and it's worth sharing."],"City":"Undisclosed","Tags":"City","Summary":"Fireball in sky, time confusion","Viewing Distance":"Unknown","Case Number":"4704","map":"<A HREF = \"http://maps.google.com/maps?q=40.424577,+-82.904713(4704)&iwloc=A&hl=en\"> mufon case (4704) map </A>","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Longitude":"-82.904713","Region":"Ohio","trends":[],"Source":"MUFON","Latitude":"40.424577","Country":"United States","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/4704.html.txt","/var/www/straped/mufon/org/4704.html"]}