{"Case Number":"47049","Log Number":"CA-04282013-0020","files":["/var/www/straped/mufon/html2text/47049.html.txt","/var/www/straped/mufon/org/47049.html"],"trends":["There have been 10 other sightings in Regina","There were no other sightings in Regina on or around June 12th 2012"],"Weather Factors":"Unknown","Date Submitted":"04/28/2013 05:07 UTC","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Region":"Saskatchewan","Disposition":"Unresolved","Country":"Canada","Object Features":"None","Date of the Event":"06/12/2012 02:01 UTC","divs":["Sighting DetailsOn a sunny day in the summer around noon hour, the power went out so i decided to take a walk to McDonald's to grab something to snack on, Its not to far from my house. About a block away i was looking around the sky, when i noticed something silver and shiny was moving north, I stopped and began observing, Thinking it was not an airplane, It looked more glittery and small. there was a little cloud in the direction it was going, Then it came to a sudden stop, I was thought to myself \"wow this is not anything like an airplane\" so i went a little bit closer and it started to travel again stopping about two more times before finally the object stayed in one spot. It looked like it was going higher and fading while doing so... after about 10 minute's of observing the object it has finally disappeared. So i went about my short journey to McDonald's and back home. I went outside and thought id take another look to the sky, Only to find the exact same object from about an hour ago that day, This surprised me because it was near and very close to the house! But it was so high up there, All i could see is this tiny silver dot and just like the first time i saw this object it disappeared the same way. I haven't seen the Object after that."],"Source":"MUFON","City":"Regina","Viewing Distance":"101-500 Feet","Longitude":"-104.599567","Summary":"Seeing the same Object twice in one day.","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=50.459422,+-104.599567(47049)&iwloc=A&hl=en\"> mufon case (47049) map </A>","Object Shape":"Circle, Star-like","Sighting Duration":"Undisclosed","Latitude":"50.459422"}