{"Object Shape":"Boomerang, Unknown","Latitude":"40.772048","map":"<A HREF = \"http://maps.google.com/maps?q=40.772048,+-73.828324(47042)&iwloc=A&hl=en\"> mufon case (47042) map </A>","Date Submitted":"04/28/2013 10:37 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/47042.html.txt","/var/www/straped/mufon/org/47042.html"],"Object Flight Path":"Straight-line path","Tags":"City","divs":["Sighting DetailsI was watching the moon last night from my window, which had attracted me because of its reddish color. I was watching towards south east direction for no more than 2 minutes at about 10:26 is when I saw them. There were 3 heading NW, in unison and not breaking formation. The 3 were a good distance apart from each other and seemed to form a triangular shape. The most prominent thing about these crafts were their shape. I can't really describe what shape they were, but it wasn't a classic disc or cigar shape. Almost boomerang-like, and they were spinning within its own orbit with some pulsating lights emanating from within. All this occurred in the time frame of approximately 10-15 seconds as they then went over my neighborhood, over buildings and I lost view of it. They made no sound whatsoever, that I remember. This was my first actual sighting where I can truly say I saw in great detail the object and its properties as well as its movements. I quickly ran outside afterward trying to see if any more were coming, but nothing else was seen. I have to point out that it's a strange coincidence that just earlier I'd been watching a 911 seminar on Youtube by Dr. Judy Wood on evidence of breakthrough energy, and I remember thinking that some type of out of world energy must have played part in the disintegration of the World Trade Center. Again, strange coincidence. I will never forget what I witnessed last night. Gives me a great feeling finally knowing we are not alone in the universe."],"Longitude":"-73.828324","Viewing Distance":"101-500 Feet","City":"New York","Region":"New York","Object Features":"Appendage(s), Other, Unknown","Summary":"3 UFO's Observed Over Queens, NY","trends":["There have been 579 other sightings in New York","There were 2 other sightings in New York on or around April 27th 2013"],"Disposition":"Unresolved","Source":"MUFON","Case Number":"47042","Sighting Duration":"00:00:20","Country":"United States","Date of the Event":"04/27/2013 10:28 UTC","Log Number":"US-04282013-0014"}