{"Sighting Duration":"Undisclosed","Region":"Michigan","Date Submitted":"04/28/2013 03:45 UTC","Longitude":"-83.043284","map":"<A HREF = \"http://maps.google.com/maps?q=42.337067,+-83.043284(47048)&iwloc=A&hl=en\"> mufon case (47048) map </A>","files":["/var/www/straped/mufon/html2text/47048.html.txt","/var/www/straped/mufon/org/47048.html"],"Source":"MUFON","Date of the Event":"04/03/2013 10:10 UTC","City":"Detroit","Weather Factors":"Unknown","Object Features":"Other, Unknown","Latitude":"42.337067","divs":["Sighting DetailsImy son & I were driving eastbound on fenkell ave in Detroit when I saw a bright star in the sky. I had my son stop the car so I could take a video but he was impatient so I took two photos. We were at the corner of our block so we went home. My past experience & curiosity lead me back outside armed with video cell phone camera ready. Upon reviewing my video to my surprise they returned upon request but I only knew it upon review. More important the star like object in the eastern sky that I took pictures of looks like an ancient coin which I've captured before anothet time in btoad daylight on the one hand. On the second snap shot which was taken immediately afterwsrd is a bright cigar shaped object that clearly has two big watching eyes!!!:) Now a review of my video was one of the most incedible internal experience. The object wasn't an object there were two cigar shaped objects on video one has a golden brilliant radiating light the other has a magnificant brightness. They flew in unison & parallel but they do it with such speed. It was as if they were putting on a show for me because they knew my eyes couldn't see them at that point but they knew my excitement & belief in them would be heigthened upon me reviewing the video & pictures. They move with such speed & their craft appears to make a strange sound flufluflu flufluflu something like that. Later review of my video revealed that I had been sprayed by radiating light at least two or three times. Although I had a major medical procedure done 1week earlier my recovery was remarkable. After my experience I fell ill with gastritis & hospitalized for severe dehydration & the recovery time was three times the time it took to recovrr Re"],"Disposition":"Unresolved","Object Shape":"Circle, Cylinder, Oval, Sphere, Star-like, Other","Log Number":"US-04282013-0019","Case Number":"47048","Country":"United States","Summary":"I saw bright star golden color took pictures went inside home returned with video camera and what a show the objects returned upon request. I became quite ill severly dehydrated hopitalized w gastritis object flashed radiating light on me I don't kno?","Tags":"City","Object Flight Path":"Path with directional change,Path then hovering","trends":["There have been 56 other sightings in Detroit","There were no other sightings in Detroit on or around April 3rd 2013"],"Viewing Distance":"501 Feet - 1 Mile, Unknown"}