{"Object Flight Path":"Path with directional change","Log Number":"US-04282013-0028","Summary":"20 bright objects moving S-N in groups of 3-4 over 45 minutes","Country":"United States","Case Number":"47058","Latitude":"40.790278","City":"New York","Tags":"City","trends":["There have been 579 other sightings in New York","There were 2 other sightings in New York on or around April 27th 2013"],"Object Shape":"Sphere","Date Submitted":"04/28/2013 11:35 UTC","Longitude":"-73.959722","map":"<A HREF = \"http://maps.google.com/maps?q=40.790278,+-73.959722(47058)&iwloc=A&hl=en\"> mufon case (47058) map </A>","divs":["sighting detailsat 8:15pm on saturday 4\\27\\13 was in our private backyard with both daughters. backyard is located near west street on the east bank of the east river in the greenpoint section of brooklyn ny and has unobstructed view of manhattan skyline as well as open sky from south to north. observed were a series of 3-4 yellow-orange glowing orbs; they moved from south to north. the distance from point of observance appeared to be about 3\\4 of a mile which would place them on the west bank of the east river on the manhattan side. the 3 objects which remained equidistant from one another moved from south to north at about 30 degrees and at a speed greater (about 30% to 50% faster) than what i know to be standard commercial aircraft (lga is nearby and there were many other planes in the sky). the objects would then move up at a steeper angle (about 45 degrees) in their northward journey until no longer visible. my guess is the orbs reached an altitude greater than 30,000 feet then were longer visible. what makes this event of note is about every 4 minutes, 3 and sometimes 4 more orbs would make the identical journey across the sky. there were at least 20 orbs observed. my daughters took notice of this; the older one was scared--neither my younger nor myself was scared just more awestruck. i perused the web for any other sightings as described, but see nothing although noticed many, many similar sightings have occurred elsewhere; e.g. western new york state and arizona as i recall seeing in a youtube video. being this is new york city, someone else (or many others) must have witnessed the same event."],"files":["/var/www/straped/mufon/html2text/47058.html.txt","/var/www/straped/mufon/org/47058.html"],"Object Features":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"04/27/2013 08:15 UTC","Disposition":"Unresolved","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Region":"New York"}