{"Case Number":"47059","divs":["Sighting DetailsI was indoors while my wife was out on the front porch stargazing. She saw what looked like a bright planet in the western sky that she had not noticed before so she focused on it for a minute. The object began to move very slowly towards the south. The object moved so slowly that at first she was not sure it was moving. When she was sure the object was indeed moving she came inside to get me. I went outdoors and observed a bright glowing planet sized object approx 75 degrees above the western horizon traveling south at approx 5000 feet elevation. Grabbed a pair of binoculars that we keep on a porch table and observed the object best described as a luminescent pearl that wobbled erratically as it moved silently across the night sky. The object continued on it's southern trajectory as it traveled out of sight. The entire sighting lasted between two to three minutes. Went back outside about 10 minutes later to look for more objects but none were observed. This is the sixth time we have observed this and similar phenomenon at this location."],"Latitude":"29.325278","Sighting Duration":"00:03:00","Object Flight Path":"Stationary,Hovering then path","Summary":"Bright glowing stationary object began to move slowly.","Longitude":"-103.560278","Tags":"City","City":"Study Butte-Terlingua","Disposition":"Unresolved","Weather Factors":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/47059.html.txt","/var/www/straped/mufon/org/47059.html"],"Region":"Texas","Date of the Event":"04/28/2013 09:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=29.325278,+-103.560278(47059)&iwloc=A&hl=en\"> mufon case (47059) map </A>","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"04/28/2013 11:38 UTC","trends":["There has been one other sighting in Study Butte-Terlingua","There were no other sightings in Study Butte-Terlingua on or around April 28th 2013"],"Object Features":"None","Object Shape":"Saturn-like, Sphere","Log Number":"US-04282013-0029","Source":"MUFON"}