{"Summary":"Orb appeared heading downward toward ground, at appx. 200 ft. it made perfect 90 degree turn northward at steady speed","Disposition":"Unresolved","Object Shape":"Circle","Case Number":"47054","Longitude":"-83.251062","Log Number":"US-04282013-0025","Object Features":"None","Date of the Event":"03/23/2013 11:00 UTC","City":"West Liberty","Country":"United States","files":["/var/www/straped/mufon/html2text/47054.html.txt","/var/www/straped/mufon/org/47054.html"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=37.925366,+-83.251062(47054)&iwloc=A&hl=en\"> mufon case (47054) map </A>","Source":"MUFON","Latitude":"37.925366","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsMyself and a friend were traveling west on route 406 following another friend home from Morehead, Kentucky. We were in our vehicle about to cross the bridge which crosses Cave run lake and marks the county line of Rowan and Morgan counties. Suddenly a green orb which looked to be about the size of 2 beachballs came into our line of site traveling straight down at a steady speed in a very few seconds it made a perfect 90 degree turn and headed north traveling over the lake until it was out of sight. We immediately slowed down to watch and then blinked our lights at our friend in front of us to pull over into the nearby boat landing which is known as popping rock. Their was no one there and no boats out, besides this was way too far off the ground to be anything of the sort. Also, there were no nearby powerlines which could have created this. That was actually the second time I have seen this green orb, about 10 years earlier i saw the exact same orb, and if memory serves me well it seemed to be traveling at very similar speeds. This is the first time i have reported anything of the sort and actually had one other event happen to me about 7 years ago in Morehead which involved myself and a friend. I would be happy to share this with anyone interested, I am just not going into details here because of the length of time which has passed since. please contact me by phone if interested. Thanks, Donnie Langdon"],"trends":["There have been 2 other sightings in West Liberty","There were no other sightings in West Liberty on or around March 23rd 2013"],"Region":"Kentucky","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Date Submitted":"04/28/2013 08:27 UTC"}