{"Case Number":"47051","Tags":"City","Summary":"Was out at night and got chased by a ufo all the way back to our home. Neighbors came out, and we all watched a \"light show\" and the take off. However, couldnt explain lost time.","Viewing Distance":"20 Feet or Less","Sighting Duration":"Undisclosed","Object Features":"Dome","Region":"Florida","Object Flight Path":"Path with directional change","Date Submitted":"04/28/2013 07:04 UTC","Log Number":"US-04282013-0022","Country":"United States","Source":"MUFON","City":"Tampa","Date of the Event":"10/01/1998 09:00 UTC","Object Shape":"Blimp, Disc","Latitude":"27.956715","Longitude":"-82.447248","divs":["Sighting DetailsIt was a school night and the Bucks was playing at the stadium. Me and other family members wanted to go out for a movie at video store, but we got distracted by what we thought was a blimp from the stadium. So I asked my cousin \"driver\" to go towards it because I wanted to see if it said something on the side. However, after turning around and chasing it, it moved quickly away from us and so we turned around and headed back to the video store. I was fixed on the object with my sister next to me in the backseat of the car when we noticed it turned around and headed towards us again. So again we turned around to try to catch up to it, but again it went away from us. So now by this time my cousin \"the drive\" had enought and said that we needed to go and get the movies. So as we headed back down the street me and my sister are still looking back at this thing and start to ye'll that hey its following us and realizes its not a blimp. It was a UFO! And it was coming up fast behind us like a stone skipping across the water, and as you blinked it was even closer to us. We started driving crazy heading back home, with cars at stop lights witnessing this thing follow us. And mind you its low to the ground, just above the power lines. When we turned down a street, so did it. We were all screaming and when we finally made it to our appartment complex we ran out the car with the car still runing and all doors left opened. We were yelling and banging on everyones doors so that we could have help, witnesses, and protection. Anything! The UFO stopped just about a half a block way from us, above a large tree that was infront of an old abandond warehouse. Everyone was amazed and huddled up towards the back appartments furthest away from this thing. We all saw the colored lights flashing in order along the side of the UFO over and over, again and again. No noise, everything was still. Not even wind. It looked beautiful at that moment, I was not scared anymore. I felt calm. I seemed to be there for ten minutes. The surface was as black as black could be. Very smooth it looked like and still. The next thing I remember is seeing this thing leave, and it was as if someone plucked it our of the sky. So fast, straight up into space. The next moment I noticed that I was not really aware of my surroundings or what I was doing, and found myself on the couch of my neighbors next door. I never really tell my experiences to people in fear of being call craze or no believed however, ever since then I have not been able to stray away from what happened to us. I was a teen then and ever since I have had health issues which include my hair always falling out and nose bleeds, feeling dizzy for no reason. I would like to get the full story one of these days. Perhaps with the help of a hypnotist to recall what I can not. This experience changed my life. I feel some since of release by sharing my story."],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=27.956715,+-82.447248(47051)&iwloc=A&hl=en\"> mufon case (47051) map </A>","trends":["There have been 105 other sightings in Tampa","There were no other sightings in Tampa on or around October 1st 1998"],"files":["/var/www/straped/mufon/html2text/47051.html.txt","/var/www/straped/mufon/org/47051.html"],"Disposition":"Unresolved"}