{"Case Number":"4705","Log Number":"US-04212006-0001","Object Features":"Unknown","Summary":"1st apprd at -3 magnitude, brilliant array of scintillating red, orange, dk yellow, surrounded by satallite crafts","map":"<A HREF = \"http://maps.google.com/maps?q=34.153765,+-118.137476(4705)&iwloc=A&hl=en\"> mufon case (4705) map </A>","City":"Pasadena","Date Submitted":"04/20/2006 08:45 UTC","Longitude":"-118.137476","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path,Path with directional change","files":["/var/www/straped/mufon/html2text/4705.html.txt","/var/www/straped/mufon/org/4705.html"],"Date of the Event":"04/20/2006 08:45 UTC","Tags":"City","Viewing Distance":"Over 1 Mile, Unknown","Disposition":"Unknown","Latitude":"34.153765","Object Shape":"Fireball, Star-like","Weather Factors":"Unknown","Country":"United States","Region":"California","divs":["Sighting DetailsI arrived at my home in Pasadena, CA about 8:45 PM. I entered the dark house and started closing my blinds which I had left open in this morning for the plants to get sun. As I was closing the blinds in one window I notice a bright orange light just above the East, North East horizon. I was unable to tell how far away it was though. Atleast a couple miles. It's brightness captured my attention. As I know there is an airline path in that direction I waited and watched to see if it would turn, as usual, exposing it's navigation lights. The object did not seem to move. After about 30-45 seconds it moved slightly and the intensity of the light brightened to about a magnitude -3; quite large for what is usually in the sky. It was varying in color from red, orange, dark yellow, and white, similar to a bright flickering, scintillating star on a cold windy night but several times brighter and more orange. After a minute or so and moving a very short distance to the north east, approximately six tiny moving objects came around it over the top and some at the bottom. These were a golden-orange in color, steadly lighted but moved so freely in any direction. They were about a magnatude 2 or 3. It hit me like a ton of bricks! I knew exactly what I was seeing! I had a feeling of another reality as if I was seeing a ghost or some rare or forbidden sight. Because I've seen this before about ten years ago, I dropped everything and ran for my video camera. As I got outside the scintillation had stopped and the satallite crafts had disappeared. I did capture video of this eire bright orange object, down to a -1 to a 0 magnatude object, start moving south, behind and then out again from the trees. It's movement was steady but somehow it had an odd charactar about itself. It just didn't seem usual. It than was hard south when it went behind a building. I went down to the end of my street to capture more video but it was gone. Unfortunately, at the moment I do not have the technology to upload a video from a camcorder but I will forward it accordingly when I am able."],"trends":["There have been 26 other sightings in Pasadena","There were no other sightings in Pasadena on or around April 20th 2006"],"Source":"MUFON"}