{"Object Features":"Unknown","Summary":"While admiring sunset a glowing object was observed rising up and then a trail.","Date Submitted":"04/29/2013 08:30 UTC","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/47063.html.txt","/var/www/straped/mufon/org/47063.html"],"Tags":"City","Case Number":"47063","Region":"New South Wales","Disposition":"Unresolved","Viewing Distance":"Unknown","Log Number":"AU-04292013-0003","City":"Lithgow","Sighting Duration":"00:00:40","trends":["There have been 3 other sightings in Lithgow","There were no other sightings in Lithgow on or around April 29th 2013"],"divs":["Sighting Details It was about sunset. We'd just managed to get some nice photos of cockatoos and had come back outside to take photos of this glorious sunset over the mountains. While watching we saw a glowing object rising behind some of the clouds. I assumed it was a plane or a star at first, it was SO bright. The other witness believed that it was rising up, not towards us, and I wasn't sure... but I had to agree with her after a few more seconds. It was so bright as well. I still believed it to be a plane. Then it started to leave a trail of light and it was so bright that I started to doubt it. The other witness took photos of the sunset and the object. This object rose for about thirty seconds, max, before vanishing behind some thick clouds. The other witness could see it behind the clouds, it was so bright, she described it as if she could see the moon on the other side. We waited to see if it would come out the other side of the clouds or if we'd hear an engine from it. As we waited we saw a plane, with a jet trail, pass by lower down in a straight line. This time we heard the plane clearly after a few seconds. When we got to see the photos we realised it was pretty unusual."],"Longitude":"150.157408","Country":"Australia","map":"<A HREF = \"http://maps.google.com/maps?q=-33.480934,+150.157408(47063)&iwloc=A&hl=en\"> mufon case (47063) map </A>","Latitude":"-33.480934","Weather Factors":"Unknown","Object Shape":"Circle, Star-like","Date of the Event":"04/29/2013 06:00 UTC","Source":"MUFON"}