{"Source":"MUFON","divs":["Sighting DetailsI was in my garage listening to the radio when my son yelled for me to \"come see this!\" I asked if it was the full moon, he said \"no, just come see this!\" I went outside and my wife, son and I looked up to what appeared to be a fireball in the sky. My wife asked what it was, and I wasn't sure. It wasn't a glimmering star because it was too big and appeared to be moving. It wasn't the aircraft landing lights of a plane because of the size and shape. My thought was it may be an aircraft on fire coming into Bangor International Airport, so I yelled to my son to grab my camera. He came back outside seconds later, and I started snapping pictures of the object. Because it was getting dark and my hands were trembling my camera wouldn't auto focus but eventually I did get several pictures of the object. It appeared to almost fade out of sight, but then appeared to come back getting brighter and larger. My wife asked if it was going to crash and that it was coming right towards us. I snapped a few more pictures and the object appeared to split and disappeared. I put the pictures on my facebook wall hoping someone else had seen this, but so far I've just been ridiculed. This event happened over Exeter, Maine on April 27, 2013 at approximately 8:15pm. I'm 43 and worked nights for 9 years so I've seen shooting stars, aircraft, northern lights, etc., but this has me baffled and sends shivers down my spine."],"Viewing Distance":"Unknown","Log Number":"US-04292013-0007","Disposition":"Unresolved","Latitude":"44.929682","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Exeter","This sighting has never been favorited."],"Tags":"City","Weather Factors":"Unknown","Date Submitted":"04/29/2013 11:54 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.929682,+-69.156702(47067)&iwloc=A&hl=en\"> mufon case (47067) map </A>","Region":"Maine","City":"Exeter","Case Number":"47067","files":["/var/www/straped/mufon/html2text/47067.html.txt","/var/www/straped/mufon/more/47067_submitter_file1__001.JPG","/var/www/straped/mufon/more/47067_submitter_file2__002.JPG","/var/www/straped/mufon/more/47067_submitter_file3__007.JPG","/var/www/straped/mufon/more/47067_submitter_file4__010.JPG","/var/www/straped/mufon/more/47067_submitter_file5__006.JPG","/var/www/straped/mufon/org/47067.html"],"Country":"United States","Summary":"A bright light in the sky, thought it was a plane on fire","Object Features":"Unknown","Longitude":"-69.156702","Object Flight Path":"Path with directional change,Unknown","Object Shape":"Boomerang, Circle, Fireball, Triangle","Date of the Event":"04/27/2013 08:15 UTC"}