{"Disposition":"Unresolved","Object Features":"Wings","Summary":"Boomerang shaped craft in Central California","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=37.682899,+-120.925455(47078)&iwloc=A&hl=en\"> mufon case (47078) map </A>","Weather Factors":"Unknown","divs":["Sighting DetailsSitting in the spa under a cloudless cold night. I love to watch the winter stars and the high-altitude jetliners as they move across the night sky. The stars move slowly from east to west, and here the jetliners move swiftly from east to west as they make their way to the bay area airports. My wife went to bed early so I decided to soak in the spa for awhile (one beer when I got home and a single glass of wine with dinner). Facing due south in the spa a boomerang shaped, translucent object entered my field of vision (from behind and to the right) moving from NW to SE. Lack of visual reference cues makes this thing impossible to size, but it moved like a big object and the reflection of the street and city lights glowed dimly off the curved bottom surface at a seemingly moderate height, well below the airliner traffic. It made no sound and really seemed to be more a boomerang shaped disturbance in the air rather than a visible object. Speed was impossible to judge, except to say that it took 20 to 25 seconds to traverse my field of vision. I jumped up and stood in the spa to view as much of this thing as possible while it disappeared behind the houses across the street. This is the first clear and cloudless night in central California after many days of rain. Could the Airforce be out and about with some new toys?"],"Longitude":"-120.925455","Date Submitted":"04/29/2013 11:54 UTC","Source":"MUFON","Latitude":"37.682899","City":"Modesto","trends":["There have been 48 other sightings in Modesto","There were no other sightings in Modesto on or around January 11th 2005"],"Region":"California","Object Shape":"Boomerang","Sighting Duration":"00:00:25","Case Number":"47078","Log Number":"US-04292013-0017","Date of the Event":"01/11/2005 09:10 UTC","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/47078.html.txt","/var/www/straped/mufon/org/47078.html"],"Object Flight Path":"Straight-line path","Country":"United States"}