{"Sighting Duration":"Undisclosed","Summary":"3 lights in triangle formation, disappear one by one.","Weather Factors":"Unknown","Log Number":"US-04302013-0009","Object Flight Path":"Stationary","Viewing Distance":"Over One Mile","Object Shape":"Other, Unknown","Region":"Oregon","Latitude":"45.501173","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=45.501173,+-122.665293(47088)&iwloc=A&hl=en\"> mufon case (47088) map </A>","Case Number":"47088","Disposition":"Unresolved","divs":["Sighting DetailsSaw three lights in an equilateral triangle formation on the way back to SE Foster from Lake Oswego at about 8:30pm. At that time of year in Portland there is still quite a bit of light at this hour. I was in a car with three other people all of whom witnessed the same phenomenon. I first noticed three bright lights as we went over the Ross Island Bridge; I was looking back in the direction from which we had come, SW towards Lake Oswego. The light at the top of the formation was white and brightest while the other two were red-orange. I pointed them out to the other passengers and we all, save the driver, watched them intently as we continued driving along towards Powell Blvd. They appeared to be hovering variably up or down in the sky, and we pulled over at around SE 25th & Powell to watch them, realizing they we could not explain the lights' intensity nor their motion. One by one they disappeared, starting with the dimmer (although still very bright) two on the bottom, and finally the bright white light which crowned the formation. After they did not reappear for about five minutes we continued driving to SE ~60th and Foster, at which point they would have been invisible at our altitude. This makes me think they must have been about 200-300 ft high in the sky. We were all pretty convinced we had not been observing planes or helicopters given the eventual disappearance of the lights."],"Country":"United States","Date of the Event":"06/08/2012 08:30 UTC","trends":["There have been 158 other sightings in Portland","There was one other sighting in Portland on or around June 8th 2012"],"Date Submitted":"04/30/2013 08:37 UTC","Object Features":"Unknown","Tags":"City","Longitude":"-122.665293","City":"Portland","files":["/var/www/straped/mufon/html2text/47088.html.txt","/var/www/straped/mufon/org/47088.html"]}