{"Log Number":"US-04302013-0004","Longitude":"-111.494263","Viewing Distance":"Over One Mile","Object Features":"None, Unknown","Source":"MUFON","Date Submitted":"04/30/2013 11:25 UTC","Latitude":"40.648582","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.648582,+-111.494263(47084)&iwloc=A&hl=en\"> mufon case (47084) map </A>","Disposition":"Unresolved","Summary":"Did not see starship image with human eye when photos were taken.","Country":"United States","City":"Park City","files":["/var/www/straped/mufon/html2text/47084.html.txt","/var/www/straped/mufon/more/47084_submitter_file1__IMG0930.JPG","/var/www/straped/mufon/more/47084_submitter_file2__IMG0933.JPG","/var/www/straped/mufon/more/47084_submitter_file3__IMG0934.JPG","/var/www/straped/mufon/org/47084.html"],"Object Flight Path":"Unknown","Case Number":"47084","divs":["Sighting DetailsHusband and I were sight-seeing and driving towards Park City, Utah along Rt. 224. I was taking many pics with IPhone 4 through car window of Wasatch Mountains....the first pic submitted was taken through car window. I then asked him to pull off road so I could take a photo outside of car. The other 2 are without car window interference. When I reviewed the pictures a week or so later, I noticed an object above the mountain range that I did not perceive with my human eye when I took pictures. If you zoom in, it appears that a tether is coming out of the object and into the mountain. Not sure if this is optical illusion with mountain range however, in the first pic, the object looks like it is part of a a rock face set in a snow cap. The curvy looking \"tether\" could be rock ridge or ski trail. However, in the following 2 pictures, the \"tether\" becomes rigid and manipulated."],"Date of the Event":"04/12/2013 12:00 UTC","trends":["There have been 7 other sightings in Park City","There were no other sightings in Park City on or around April 12th 2013","This sighting has never been favorited.",""],"Region":"Utah","Sighting Duration":"Undisclosed","Object Shape":"Cylinder","Weather Factors":"Unknown"}