{"Summary":"Large Orange Balls of Light Moving Slowly Over Farm","Country":"United States","divs":["Sighting DetailsAs reported to ASD by phone: I was outside taking a smoke break at approximately 10:30 pm last night when something caught my eye to the Northeast. I saw eight balls of orange glowing light moving along at a very slow pace just about 15' above the ground and about 35' to 40' from where I was standing. They were not very bright, but had a glow about them with a defined edge then a softer edge around it, like some kind of a heat mirage. There was absolutely no sound at all and if I hadn't have been in that spot at that exact moment I would have missed them! They were the size of a basketball or larger - maybe up to 3' in diameter- and all the same size. There was no structure or appendages, and they were not sky lanterns, no flame flickering or candle underneath them, or anything like that, just solid glowing balls of light that moved up and down by as much as 10', but always keeping in a straight line path as if they had some purpose in mind and were under intelligent control. I was shocked and couldn't move from my spot - and didn't think to grab my camera. My dog sat watching them as well. Unfortunately, no one else was around to see this. I live in a rural area with no neighbors within sight. As the balls of light moved past my pond I could see their reflection in the water. It was a very eerie sight! The objects moved to the Southeast and out of sight. I watched them for about 20 minutes. They moved extremely slowly, at about 5 mph. My wife and I have seen unexplained objects in the sky in the past but nothing this close to us! I'd really like to know if anyone else saw this."],"Viewing Distance":"21-100 Feet","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/47087.html.txt","/var/www/straped/mufon/org/47087.html"],"Object Flight Path":"Straight-line path","Date Submitted":"04/30/2013 06:47 UTC","Longitude":"-94.52759","Case Number":"47087","Region":"Missouri","Object Features":"None","Weather Factors":"Unknown","Log Number":"US-04302013-0008","Tags":"City","trends":["There have been 4 other sightings in Grandview","There were no other sightings in Grandview on or around April 29th 2013"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.888261,+-94.52759(47087)&iwloc=A&hl=en\"> mufon case (47087) map </A>","Object Shape":"Circle","Sighting Duration":"Undisclosed","Date of the Event":"04/29/2013 10:30 UTC","City":"Grandview","Latitude":"38.888261"}