{"Country":"United States","Longitude":"-86.293546","divs":["Sighting DetailsI was outside in the back patio of my house smoking a cigarette. I saw what I thought was a plane coming from the direction of Lake Michigan. As it got closer I realized that it was not a plane as it was saucer shaped and flying just above the trees. The object glowed extremely bright white light over its entire surface. It passed just along the side of Columbus Avenue. The flight path was mostly constant though it moved down behind the top of a tree before adjusting its flight path back up just above tree top level. The object was angled in the direction it moved roughly 30 degrees. The object flew slow and made no sound. I watched it until I could no longer see it. I came into the house to try to look at it through a window but lost visual contact. This is not the first UFO I've seen relatively close but this one needs to be reported. You may use my name. You may investigate on the property. Please call or email first. You may contact me if you wish to. I tried. To take pictures and video but I'm only using a iPod and it only caught a pin point of light, not the entire object."],"map":"<A HREF = \"http://maps.google.com/maps?q=43.192575,+-86.293546(47090)&iwloc=A&hl=en\"> mufon case (47090) map </A>","Weather Factors":"Unknown","Date of the Event":"04/30/2013 09:45 UTC","Case Number":"47090","Object Shape":"Sphere","Date Submitted":"04/30/2013 10:25 UTC","trends":["There have been 3 other sightings in Norton Shores","There were no other sightings in Norton Shores on or around April 30th 2013"],"City":"Norton Shores","Object Features":"Dome","Tags":"City","Source":"MUFON","Log Number":"US-04302013-0011","Viewing Distance":"21-100 Feet","Latitude":"43.192575","Object Flight Path":"Path with directional change","Region":"Michigan","files":["/var/www/straped/mufon/html2text/47090.html.txt","/var/www/straped/mufon/org/47090.html"],"Summary":"Went outside saw UFO near constant flight path very bright white","Sighting Duration":"Undisclosed","Disposition":"Unresolved"}