{"Object Flight Path":"Path with directional change","Source":"MUFON","City":"Taylor","Disposition":"Unresolved","Object Features":"Unknown","divs":["Sighting DetailsMy husband and I had taken our dogs into the backyard before bringing them in for the night. We were sitting on the back porch discussing vacation plans and laughing at the dogs. We had been there for several minutes, and as we talked I was noticing the stars and asked about one that was flickering, I wondering if it was a satellite. Then I noticed a plane flying over from the north. That was when my eyes caught the dark triangle smoothly and slowly moving across the sky. From where I was sitting on the porch, the view to the sky is blocked by our privacy fence, and the power lines can be seen just above our fence line, they run along the road beyond an empty lot behind our home. I immediately jumped from my chair and ran forward, assuming it was some kind of car lights reflected on the power lines, hoping it was just reflected car lights. But then I could see even more clearly the large and very dark triangle shape with the pale lights at its edges. This thing seemed so massive, or low in the sky, or both! It was terrifying. It was high enough up and close enough to us that I could see it was triangular in shape- and I could make out pale, very dim lights larger on the side closer to me, and almost like I was just seeing a part of each of the lights on the further side. I was so shocked and could not believe I was really seeing this thing. I was yelling something about it (probably a string of bad words) and a vague area to my husband, trying to describe it or something. He didn't see it at all. It had happened so fast and it turned North and seemed to vanish. I am sweating, and very shaken up. I don't like this at all. That isn't strong enough language to describe how fearful I am about what I just saw. I really hope and pray that there is something on the news later about a secret flight of some new jet or something. Not good."],"Summary":"black triangle darker than the night sky but with spots of light around its edges, crossed sky and then veered more NW seemed to disappear","Case Number":"47092","Sighting Duration":"Undisclosed","Region":"Texas","Latitude":"30.616638","map":"<A HREF = \"http://maps.google.com/maps?q=30.616638,+-97.432387(47092)&iwloc=A&hl=en\"> mufon case (47092) map </A>","Longitude":"-97.432387","Country":"United States","Weather Factors":"Unknown","Log Number":"US-04302013-0013","Date Submitted":"04/30/2013 11:48 UTC","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Date of the Event":"04/30/2013 10:10 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/47092.html.txt","/var/www/straped/mufon/org/47092.html"],"trends":["There have been 3 other sightings in Taylor","There were no other sightings in Taylor on or around April 30th 2013"],"Object Shape":"Triangle"}