{"Object Features":"None","Date Submitted":"05/01/2013 11:58 UTC","files":["/var/www/straped/mufon/html2text/47098.html.txt","/var/www/straped/mufon/org/47098.html"],"Disposition":"Unresolved","Source":"MUFON","Longitude":"-94.870355","Country":"United States","Object Flight Path":"Stationary","Log Number":"US-05012013-0006","trends":["There have been 5 other sightings in Miami","There were no other sightings in Miami on or around April 30th 2013"],"City":"Miami","map":"<A HREF = \"http://maps.google.com/maps?q=36.878135,+-94.870355(47098)&iwloc=A&hl=en\"> mufon case (47098) map </A>","Object Shape":"Star-like","divs":["sighting detailsapril 30, 2013, from 9:00p.m. to 9:45p.m. central time, my wife and i viewed a very bright star like object south-west of our house, approximately thirty degrees up from horizon. my wife noticed the star like object while walking from garage to house. she asked me to \"quit watching television\"...\"come outside\"...\"look at this thing\". using some trees located between object and our view point for reference, the object was stationary the entire thirty minute observation. unaided eyes observation, the object was the brightest star in the sky and twinkled and changed color. using binoculars to view the object, a definite circular shape was observed and the color of the object cycled between red and blue. at about 9:15p.m., my wife mentioned \"light rays\" emitted by the object. i had the binoculars and i observed a yellow\\gold cloud several times bigger than the red\\blue object directly west(to the right) of the object. the yellow\\gold \"cloud\" vanished within seconds. i picked up the binoculars at 9:10p.m. and over the next twenty minutes i noticed the circular objects diameter slowly decreased by half...as if the object was moving in a direction 180 degrees from our point of view. using the binoculars was hurting my eyes and i went in the house at 9:30p.m.. my wife watched the thing for another fifteen minutes. at 11:00p.m., my wife went outside to view the object. she came back in the house one minute later and reported the object was no longer visible. i checked a sky map for bright stars or planets. no bright stars or planets listed for the south-west part of the sky. i will check tonight (may 1, 2013)the south-west sky for the blue\\red object. maybe there really is some bright star or planet not listed on sky maps...eh?"],"Tags":"City","Weather Factors":"Unknown","Latitude":"36.878135","Date of the Event":"04/30/2013 09:30 UTC","Viewing Distance":"Over One Mile","Summary":"Easily brightest star in sky, 5 second cycle of blue/red color change.","Case Number":"47098","Region":"Oklahoma","Sighting Duration":"00:30:00"}