{"Weather Factors":"Unknown","Object Flight Path":"Hovering then path","Object Shape":"Disc, Oval, Other","Log Number":"US-05012013-0005","Longitude":"-75.51959","trends":[],"Region":"Delaware","Case Number":"47097","files":["/var/www/straped/mufon/html2text/47097.html.txt","/var/www/straped/mufon/org/47097.html"],"Disposition":"Unresolved","Tags":"City","Source":"MUFON","Sighting Duration":"Undisclosed","City":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.918792,+-75.51959(47097)&iwloc=A&hl=en\"> mufon case (47097) map </A>","divs":["Sighting DetailsSome time during the last week of this past Jan. during the evening, my husband and I were sitting in our family room watching TV. I decided to go to the living room to have a cigarette as my husband doesn't smoke. The living room is in a different section of the house separated by three walls and 3 doorways. I was sitting in a chair in the southeast corner of the house with 2 windows to my left and to the right and also a door to the right. There was a lamp on to my left as well as a dim light across the room near the door going back in the direction of the family room. I heard what I thought were voices but then realized it was An owl! We have lived here for 20 years and have never seen or heard any owls here! Their hoos were, it seemed coming from all sides and were only hooing one at a time. Example: from right, HOO-HOO..HOO,,,HOO..Hoo, from left, HOO, HOO... Hoo.. Hoo and so on. Marveling at the loudness of the HOOs and the seemingly numerous Owls that had popped in for a visit, I went to the windows to see if I could pinpoint the locations. When I looked out into the darkness, they stopped, then I walked away toward the family room and they gave another series of HOOs. I entered the family room where I found my husband looking toward a large window somewhat at alert and with the volume muted on the TV. I told him what I heard and he said he heard them as well. I observed his body language more closely and determined that he was rather alarmed and startled which I found satisfying as I felt the same. We seemed to both de at the same time to go out with a flashlight to investigate but I stayed behind and walked quickly back to the living room to watch his progress. I didn't see him so I came back to the family room and he was already coming back through the sliding glass door. He seemed frustrated and agitated and stammered, \"Those things are long gone!\" I was quite startled because he had never progressed any farther than a few steps onto the patio. He had never gone all the way around to the front of the house where the sounds came from. I was disappointed so I went back to the living room without turning on lights this time to try to hear them again. I peered out the living rom door and I saw a huge disc in the sky barely moving coming straight from over our house going east! It had lights randomly blinking red, blue yellow and green! I went back to the family room and told my husband, he seemed totally uninterested and was watching TV again! I looked out the sliding glass doors that he had just a few moments ago re-entered and the craft was still quietly gliding, well, creeping along over the field next to our house! I thought how odd was because it seemed that there were small airplanes buzzing around it! I thought it would be in the news or something but never wAS. aNYWAY, I GRABBED A PAIR OF BINOCULARS AND SEEMED TO BE FUMBLING A BIT TRYING TO GET THE CAPS OFF. I LOOKED AT THE CRAFt and it was not focusing. I was suddenly extremely fatigued and had to go sit down. I glanced out the door and could still see it and asked my husband if he didn't want to see the UFO, he said, \"NO!\". That was it. We said no more and forgot about it."],"Country":"United States","Date Submitted":"05/01/2013 11:39 UTC","Object Features":"Other","Summary":"Husband and I in separate rooms both heard loud owl hoots, husband went outside with light, returned quickly, then I saw craft leaving from above house. moved very slowly","Date of the Event":"01/23/2013 07:00 UTC","Latitude":"38.918792","Viewing Distance":"21-100 Feet"}