{"Disposition":"Unresolved","Sighting Duration":"Undisclosed","Latitude":"42.479543","map":"<A HREF = \"http://maps.google.com/maps?q=42.479543,+-83.118348(47109)&iwloc=A&hl=en\"> mufon case (47109) map </A>","Log Number":"US-05012013-0017","Object Shape":"Disc, Triangle","Date Submitted":"05/01/2013 10:49 UTC","Country":"United States","Weather Factors":"Unknown","Summary":"7 hovering bright white objects with red tails coming off the bottom like a jellyfish","Tags":"City","Object Features":"None","Region":"Michigan","divs":["sighting detailson 4\\30 between 10 and 11 pm my fiance and i were sitting on the front porch and saw something in the sky. it was bright white with a red tail coming from the bottom of the object (like a jellyfish tenticle). it looked like a star at first but was brighter than all the stars around it and would dart up and down and side to side at random times. we watched this for about 20 minutes and during this time we watched 3-5 airplanes fly near it, so we knew it was not moving like an airplane. it was staying in the same general spot but moving almost like it was swimming in the sky. when we went outside an hour later, it was still there. at 330 am it had moved south (unsure how far). on may 1, 2013 at about 10 pm we observed the same kind of object in about the same spot it was the previous night. we looked to the south of the origianlly spotted object and there was another one! we then looked to the west and saw 3 more. then spotting 2 to the north. one that was north west of where we are was lower than the rest and the light tail was more vivid. they all seemed to have the same movements. i did't have a direct encounter with any of them, so there were no feelings except fascination. we have not lost sight of the objects. they are still there."],"Case Number":"47109","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/47109.html.txt","/var/www/straped/mufon/org/47109.html"],"trends":["There have been 8 other sightings in Royal Oak","There were no other sightings in Royal Oak on or around May 1st 2013"],"City":"Royal Oak","Source":"MUFON","Date of the Event":"05/01/2013 12:00 UTC","Longitude":"-83.118348","Viewing Distance":"Over One Mile"}