{"trends":["There have been 5 other sightings in Wareham","There were no other sightings in Wareham on or around May 1st 2013"],"Tags":"City","Latitude":"41.754088","Case Number":"47105","Object Flight Path":"Path with directional change","Object Features":"Unknown","Object Shape":"Sphere","Longitude":"-70.703106","Source":"MUFON","Viewing Distance":"Over One Mile","Date Submitted":"05/01/2013 10:22 UTC","Region":"Massachusetts","Disposition":"Unresolved","City":"Wareham","map":"<A HREF = \"http://maps.google.com/maps?q=41.754088,+-70.703106(47105)&iwloc=A&hl=en\"> mufon case (47105) map </A>","Country":"United States","divs":["sighting detailschecking out night sky. sighted venus & mars at about 2115 when first noticed sphere glowing blue-green and red. after 1\\2 hour it was joined by another on western horizon. by 2200 southern most object disappeared below tree line as the other traveled slowly north. as we turned away we noticed a third object with similar lights hovering in the east. it did not appear to be traveling toward us. we sighted all three objects with binoculars and concluded none to be planets, stars, or conventional aircraft of any kind we are familiar with. we were astounded and talked about it briefly. my son was skeptical, but could not account for objects especially as we sighted an airplane (not jet engined) flying low (about 1000-2000 ft.) to our south going west to east. normally helicopters fly to nearby hospital, but objects were definitely not choppers, and pavepaws radar base, coast guard base, and air national guard are about ten miles away to the south on cape cod, but no conventional aircraft came from that direction. these objects were larger than venus, moved slowly or hovered for long durations, and then moved off. could not have been saturn as that planet does not appear until close to dawn."],"Log Number":"US-05012013-0013","Summary":"Second consecutive night of observation of object traveling east-west slowly. Second night sighted three; two west one continued west other north; third approached from east.","Date of the Event":"05/01/2013 09:30 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/47105.html.txt","/var/www/straped/mufon/org/47105.html"]}