{"Longitude":"-86.873887","Summary":"Two star-like objects in formation, 12 o'clock high, then dissappear","Tags":"City","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Case Number":"4710","Date Submitted":"04/22/2006 11:30 UTC","Region":"Indiana","Log Number":"US-04232006-0001","files":["/var/www/straped/mufon/html2text/4710.html.txt","/var/www/straped/mufon/org/4710.html"],"Object Features":"Undisclosed","Latitude":"40.420462","Object Shape":"Star-like","Object Flight Path":"Undisclosed","trends":["There have been 30 other sightings in Lafayette","There were no other sightings in Lafayette on or around April 22nd 2006"],"Date of the Event":"04/22/2006 11:30 UTC","Disposition":"Insufficient Data","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.420462,+-86.873887(4710)&iwloc=A&hl=en\"> mufon case (4710) map </A>","Country":"United States","divs":["Sighting DetailsI was in the hot tub, which is where I am every night between 10:30 and 11:30 or so. I do not drink alcohol. Watching the sky looking for shooting stars or satellites. Saw what I first thought was a satellite moving from north to southeast, but then noticed there was another bright object behind it moving in unison. Watched for approximately two minutes when they both dissappeared. They were white in color, and did not appear again. I stayed out and looked for them for approximately 15 more minutes, searching the sky for any movement. Other than high flying planes, I saw nothing else. This appeared very odd to me. I have been living in this location for four years, and spend 5 of 7 nights in the hot tub before I go to bed. I am very used to looking at the night sky, but don't know the constellations well. I know what satellites look light when they pass over, and as I said, I first thought this is what I thought it was, until I saw the second light. These looked like they were coming off the tail of the little (or big) dipper. There were no clouds...sky was totally clear. They got close to a very bright star (planet?) at about 2 o'clock facing east, and just disappeared."],"Weather Factors":"Unknown","City":"Lafayette"}