{"map":"<A HREF = \"http://maps.google.com/maps?q=35.464233,+-82.35818(47102)&iwloc=A&hl=en\"> mufon case (47102) map </A>","Country":"United States","Case Number":"47102","Sighting Duration":"Undisclosed","Object Features":"None","City":"Gerton","trends":["There has been one other sighting in Gerton","There were no other sightings in Gerton on or around April 26th 2013"],"divs":["Sighting DetailsIn 53 years I have never seen any object in the sky like this orb. It's brightness and extremely slow movement across the sky was unprecedented in my experience. My partner Debbie and I were on the balcony porch of our home in Gerton, NC in the early evening of Fri. Apr. 26, 2013 when a remarkably bright ball of amber light appeared beneath low cloud cover to the southeast of our position. A gentle rain had just stopped. The orb appeared to be a ball of contain orange burning fire in the sky. As the single orb moved slowly toward us I could see that the circular shape of the light was well defined. It looked like a perfectly round glass ball of blazing light. The orb was not part of any craft but flew on its own through the sky. My initial thought was that what I was observing was inconceivable: a wingless and material orb of light flying under its own power. It was certainly not a balloon as it did not float or move about with the quite strong breeze blowing after the rain. The orb maintained a steady course. I ran indoors and got a pair of binoculars. I then ran outside into a large open meadow next to our home from which I had a clear view of the slowly flying orb. Through the binoculars I could clearly see a smoothly rounded amber orb attached to nothing else passing through the sky just beneath a low light-grey cloud cover. As the orb drew closer to our position it became more distinct. Its slow passage under its own power through the sky was inexplicable. I had the bizarre sense that I was witnessing something not of this world given the fact that the orbs flight seemed physically impossible. It passed by our position turning away from us to the north and finally rose up into the low clouds and gradually disappeared out of sight. I remained in the meadow for some time but never saw the orb come out from the cloud cover."],"Latitude":"35.464233","Object Shape":"Sphere","Weather Factors":"Unknown","Disposition":"Unresolved","Source":"MUFON","Summary":"Two persons observed very bright amber/red orb flying very slowly above a wooded ridge moving toward our location beneath low cloud cover. Orb move along a single direct flight path for approx. 5 mins. Orb rose and disappeared NE into clouds.","Date Submitted":"05/01/2013 05:19 UTC","Date of the Event":"04/26/2013 06:15 UTC","Log Number":"US-05012013-0010","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Region":"North Carolina","Longitude":"-82.35818","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/47102.html.txt","/var/www/straped/mufon/org/47102.html"]}