{"Source":"MUFON","Longitude":"-97.831625","Object Features":"Window(s)","Summary":"UFO flying over house with 2 other friends observing event","Date Submitted":"05/01/2013 05:30 UTC","Date of the Event":"07/20/2002 10:10 UTC","Sighting Duration":"00:04:00","Weather Factors":"Unknown","Object Shape":"Oval","divs":["Sighting DetailsI was in my back yard with 2 friends at about 10:00pm and we were sitting by the fire pit in my back yard. we were looking at the stars and the scenery around us when we noticed a red light with a white light on top of it so we thought it was just a airplane. we forgot about it and then a minute or 2 later it got closer and we herd a very low humming noise. we got up and walked closer as it was coming closer behind the tree line. when it got into view over my house we see a large oval object about 10ft over the tree line and about 100ft or so long and 50ft or more wide, it had three dome lights evenly spaced out down the under side of the object with the brightest white light i have ever seen, the object was a dark grey or dark black in color and made a very faint humming noise and was moving very slow maby about 2-5 mph. there was also white light beams coming from the object at different areas of the object scanning the ground and my house, the white light was like a laser beam it stayed the same brightness and same consistency from where it exited the object to where it touched the ground. after the object had made its way past my house it made a 180 degree spin as it was already moving. i felt so scared and my head hurt so bad, i started feeling sick to my stomach and i had goose bumps all over my body. me and my two friends were silent the whole time and we didn't know what to think about what just happened. the object continued north at the same speed and eventually the lights on the object got a little bit brighter and it picked up speed incredibly fast and was out of site in a matter of seconds. just writing this statement of what i saw or when i tell people of what happened that night i get goose bumps and it gets hard to breath. i will never ever forget that night and i can remember that night like it just happened yesterday. i'm not sure if it was aliens or human technology that we don't yet know of, but it was something that was not known yet to us all."],"Object Flight Path":"Path with directional change","Viewing Distance":"21-100 Feet","City":"Cedar Park","Disposition":"Unresolved","Case Number":"47104","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=30.483688,+-97.831625(47104)&iwloc=A&hl=en\"> mufon case (47104) map </A>","Country":"United States","Tags":"City","trends":["There have been 14 other sightings in Cedar Park","There were no other sightings in Cedar Park on or around July 20th 2002"],"files":["/var/www/straped/mufon/html2text/47104.html.txt","/var/www/straped/mufon/org/47104.html"],"Latitude":"30.483688","Log Number":"US-05012013-0012"}