{"Disposition":"Unresolved","Source":"MUFON","Region":"Indiana","Viewing Distance":"Unknown","Log Number":"US-05012013-0019","trends":["There has been one other sighting in North Vernon","There were no other sightings in North Vernon on or around April 30th 2013","This sighting has never been favorited.",""],"Tags":"City","divs":["Sighting DetailsAt home April 30 2013. Girlfriend outside smoking a cig. She yelled for me. She said look! What is that? It's not a star, is it? I said no. It's too close. It seems to be within our atmosphere. It was also too bright. Although it maintained it's position as if it were a star. I went to get the video camera and binoculars. Camera was no good. Binoc's were great. We could see, very distinctly, four primary colors. Blue, green, yellow, red. These colors were emitted as flashes of light. These flashes alternated and were patterned. They seemed to orbit some sort of circular craft. From 9:30 pm to just past 10:35pm, it remained in the same position and just about disappeared in the western horizon as the earth rotates. But then, while I was inside contacting a MUFON member (10:35pm til 11:35pm), at 10:50pm She observed the UFO ascend and fly north a great distance at an incredible speed. As if it didn't accelerate, it was just still then moving very, very fast. I went out to see while on the phone with a MUFON representative. I did observe it had move a great distance to the north, though I did not see it move to it's new position. I tried to film through the binoc's and have some very shaky video. Some good steady scenes, but not close or clear. The colored light are very visible. I had the hardest time zooming in thru the binoc's. Please be patient with the video. I watch all the UFO investigative shows, and this is the first time I have ever seen an Unidentified Flying Object. It was and still is an awesome feeling. There are some things people have to See and Experience for themselves to understand."],"Object Flight Path":"Hovering then path","Object Features":"Unknown","Date Submitted":"05/01/2013 09:04 UTC","Date of the Event":"04/30/2013 09:30 UTC","Latitude":"39.011635","Sighting Duration":"01:45:00","City":"North Vernon","Summary":"Observed object in West-Southwest sky. Flashing 4 distinct Primary colors: Blue, Green, Yellow, Red. Stationary 1 hour. Then moved north.","map":"<A HREF = \"http://maps.google.com/maps?q=39.011635,+-85.62046(47111)&iwloc=A&hl=en\"> mufon case (47111) map </A>","files":["/var/www/straped/mufon/html2text/47111.html.txt","/var/www/straped/mufon/org/47111.html"],"Object Shape":"Unknown","Longitude":"-85.62046","Weather Factors":"Unknown","Country":"United States","Case Number":"47111"}