{"Viewing Distance":"Over One Mile","Object Features":"Unknown","Region":"Ohio","Longitude":"-83.649366","Tags":"City","Disposition":"Unresolved","Log Number":"US-05022013-0003","Date Submitted":"05/02/2013 01:04 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/47114.html.txt","/var/www/straped/mufon/org/47114.html"],"Object Shape":"Fireball, Flash, Star-like","Case Number":"47114","divs":["Sighting DetailsMy friend and I were heading to Sabina from Wilmington and we noticed a flash of light falling from the sky. It was a couple miles away, prob between 10-20 miles. The time was 11:45pm and the sky was clear with a sleight haze. It was in the direction of South and looked like it might have crashed around Lees Creek. Unless the object disintegrated it had to of crashed to the ground, which is more than likely a field. The object looked like it was on fire, like a shooting star. The color started out orange and slowly transitioned to green. It was probably the size of a helicopter. It sort of left a trail, again it was like a shooting star, but it was leaving more sparks than anything. My friend thought it was a small asteroid falling from the sky. While I don't automatically label things as alien UFO that was my first thought. Exhilarated, my friend and I tried to drive out past Sabina to around where we thought it might have crashed (Lees Creek) but it was too dark to see anything and we didn't have a clear enough idea of where the crash happened. Giving up and low on gas we decided to head back toward Sabina from Snow Hill Road (an area closer to Lees Creek) we stopped the car on a lone country road. We got out and saw that 2 blinking lights had arrived in the sky above about where the crash would have been. They weren't moving or going anywhere. I would probably say they were small airplanes or helicopters but they weren't moving; although because they were miles away it might have just appeared that they weren't moving when really they were circling. We stood there for at least 10 minutes and the 2 blinking objects were still there. They were about as high as a helicopter would be if it were observing, so a couple hundred feet. I was fiddling with my phone to call a friend and tell him what was going on (as we've shared events like this with each-other)and my friend standing outside with me claimed he saw a flash of green light that lit up the whole sky. He can not determine where the flash originated from. We both wanted to drive out and follow the blinking lights to investigate more but my friends car was almost out of gas and no gas station was open. The haze in the sky was thickening anyway and we were losing visuals of the blinking objects in the sky. So we just headed home disappointed knowing there was nothing else we could do."],"trends":["There have been no other sightings in Lees Creek","This sighting has been favorited 1 time."],"Source":"MUFON","Latitude":"39.420062","City":"Lees Creek","map":"<A HREF = \"http://maps.google.com/maps?q=39.420062,+-83.649366(47114)&iwloc=A&hl=en\"> mufon case (47114) map </A>","Date of the Event":"05/01/2013 11:45 UTC","Summary":"A light fell from the sky. It started orange then turned green. Hovering objects at sight after.","Sighting Duration":"Undisclosed","Country":"United States","Object Flight Path":"Straight-line path,Other"}