{"Date of the Event":"07/04/1979 09:30 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","Latitude":"34.168874","Longitude":"-118.461205","Object Flight Path":"Stationary,Straight-line path,Path then hovering","trends":["There have been no other sightings in Sherman Oaks","This sighting has been favorited 1 time."],"files":["/var/www/straped/mufon/html2text/47125.html.txt","/var/www/straped/mufon/org/47125.html"],"Disposition":"Unresolved","Date Submitted":"05/02/2013 12:31 UTC","City":"Sherman Oaks","Object Features":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.168874,+-118.461205(47125)&iwloc=A&hl=en\"> mufon case (47125) map </A>","Case Number":"47125","Summary":"Large Mother Ship ejecting orbs over Sherman Oaks California","Object Shape":"Blimp, Cylinder, Oval","Region":"California","Tags":"City","divs":["Sighting DetailsWe lived on a dead end street directly next to a large community park that had fireworks diplays every fourth of July. My family and I were sitting on our roof watching the display. The direction of the fireworks was just to the south of the house about an eigth to a quarter mile away. Fireworks were slightly above eye level at that distance. I turned to the north to look around...you could see a couple other fireworks dislays way off in the distance. Then I noticed a semi transparent cigar or blimp shaped object moving very slowly from north to the south. I had to look for a few seconds to figure out that there was an object actually there. I thought it was a blimp because it was really big even at a distance. But, it was semi transparent and you had to really key in on it to get a good look. I judged it's alttitude to be somewhere between 1000 and 1500 feet. It moved closer to our location and I continued to watch it. As it moved close to us I alerted my family to look and they all turned and saw it. There were four of us on the roof at that moment with two more people in the back yard. As it approached it came directly overhead and then stopped. At that exact moment it lit up as a very bright solid white light that appeared to be rectangular shaped. I would roughly estimate it to be about the size of 1 or 2 football fields. After it became staionary small glowing bright red lights began to shoot out from all aroung the craft. They moved out in all directions in straight lines at a rapid rate of speed until each was out of sight. Maybe 20 or 30 total. I guess you could describe them as orbs, but they seemed to large to me. Maybe the size of VW's. Hard to say. After they stopped coming out the (mother ship) blinked out and appeared to be gone. The whole experience lasted about twenty-minutes. Never came public with this encounter until now, and don't know that anyone outside of my family actually saw it. A mystery to this day. I did hear of an encounter several years ago over France or England that sounded very similar in description of the craft, including the red orbs."],"Log Number":"US-05022013-0014","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown"}