{"Viewing Distance":"Unknown","Object Shape":"Flash","Date of the Event":"05/01/2013 12:00 UTC","Country":"United States","Latitude":"38.884845","Summary":"Looked like a star but to low and pulstated 10 diffrent colors.","Date Submitted":"05/02/2013 12:43 UTC","trends":["There have been 2 other sightings in Oakton","There were no other sightings in Oakton on or around May 1st 2013"],"Longitude":"-77.296877","Sighting Duration":"Undisclosed","Source":"MUFON","Tags":"City","Object Features":"Unknown","Case Number":"47126","divs":["Sighting DetailsI was sitting outside my friends apartment with him while he smoked a cigarette. After about 30 minutes of talking i looked up and for a couple of minutes i observed what was a stationary object that pulsated every color of the rainbow. After about 3 min i asked him if he saw it too. He said yes, We stood there for about 15 minutes watching it as it just pulsated, Red, Blue, Green, Orange, Purple, white, and so on. It constantly was changing color, after about 5 minutes a helicopter circled it. At the same time there was a slight faint white dot about 50 meters from it that went in and out and than just dissipated. In the time we were watching it we watched several planes fly above us and a helicopters going back and forth. After about 15 min i had to leave so i left him just staring at it. We had no idea what it was and it was way to low to be a star. We both had no idea what we were looking at and just stared at it and talked about what it could be. We both have seen UFO's in the past and were comparing it to our past experiences. Which to say the least this was new for us."],"Object Flight Path":"Stationary","Log Number":"US-05022013-0015","Region":"Virginia","files":["/var/www/straped/mufon/html2text/47126.html.txt","/var/www/straped/mufon/org/47126.html"],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=38.884845,+-77.296877(47126)&iwloc=A&hl=en\"> mufon case (47126) map </A>","City":"Oakton","Weather Factors":"Unknown"}