{"Summary":"Vehicle moving very slowly across sky to midway of viewing area. Then took off at rapid rate and vanished.","map":"<A HREF = \"http://maps.google.com/maps?q=47.464135,+-122.352309(47128)&iwloc=A&hl=en\"> mufon case (47128) map </A>","Date Submitted":"05/02/2013 01:18 UTC","Weather Factors":"Unknown","Tags":"City","Object Shape":"Chevron","Country":"United States","trends":["There have been 2 other sightings in Burien","There were no other sightings in Burien on or around June 25th 1965"],"Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Flight Path":"Straight-line path","divs":["sighting detailsi was in my early teens and camping out with a buddy in my backyard. we were laying on our cots looking up and talking when we saw this object, looking like a wing, directly overhead and so far up there that we can just make out it's shape. it was moving very slowly from south to north in a straight line. we started talking about it and wondered if it were a plane. couldn't hear any engines and it was moving extremely slow. flying wing? no, they were out of service quite a while by that time. as we discussed what it might be the object got to the halfway point of our viewing area (trees on the southside of the yard and house on the northside)and at that point we saw a flash from the back\\center of the object and it sped up in a split second to a rapid speed and disapeared from view before it got out of our line of vision. to this day i still don't know what it could of been. i discounted airliners as they fly faster than the slow movement of the object i saw and i can hear their engines. i'm very curious as to what this vehicle was. it was an interesting experience to be sure."],"Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/47128.html.txt","/var/www/straped/mufon/org/47128.html"],"Object Features":"None","Region":"Washington","Longitude":"-122.352309","Case Number":"47128","Log Number":"US-05022013-0017","Source":"MUFON","Date of the Event":"06/25/1965 12:00 UTC","Latitude":"47.464135","City":"Burien"}