{"Disposition":"Unresolved","Object Shape":"Triangle","Source":"MUFON","Summary":"Black triangle with yellow-orange bottom lights flying completely silent.","Longitude":"-118.402328","Region":"California","Case Number":"47129","divs":["Sighting DetailsMay 1st 2013 10:15 pm After having dinner I went outside to the balcony of my apartment to take a look at the sky. The sky was cloudy that night and the city lights reflected by the clouds gave them that dark orange color. As soon as I looked up I noticed an object with unusual yellow-orange lights on the bottom. As the object flew almost over my head I could see that it was solid and darker than the background sky what made possible to distinguish it's perfect triangle shape. The lights it had weren't very bright and I can't say exactly how many it had because of the short duration of the observation and also because of my excitement at the moment. But I can say it had one light at each one of the corners of the triangle and one more in between them, so three lights on each side and it definitely had a central light. They all had the same size and color. The object emitted no sound, if it was a conventional airplane it would had been easily heard and recognized. There was an airplane flying farther and I could see and hear it. Also the triangle spacecraft had no flashing lights what is commonly seen on regular airplanes and helicopters. It flew at constant speed that was about the same speed as when airplanes are approaching Los Angeles airport to land, the path was a straight line from SW to NE approximately. I lost sight of the the object as it flew away so I guess it had no lights on its sides."],"City":"Los Angeles","Log Number":"US-05022013-0018","Object Features":"Other","Country":"United States","Date Submitted":"05/02/2013 02:54 UTC","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=34.026517,+-118.402328(47129)&iwloc=A&hl=en\"> mufon case (47129) map </A>","Date of the Event":"05/01/2013 10:15 UTC","Latitude":"34.026517","files":["/var/www/straped/mufon/html2text/47129.html.txt","/var/www/straped/mufon/org/47129.html"],"Weather Factors":"Unknown","Tags":"City","Sighting Duration":"Undisclosed","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around May 1st 2013"]}