{"Tags":"City","Weather Factors":"Unknown","Object Shape":"Circle","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/47132.html.txt","/var/www/straped/mufon/org/47132.html"],"Object Flight Path":"Straight-line path","Country":"United States","Summary":"Massive quantities of UFO's flying in formation","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","trends":["There have been 2 other sightings in Columbia Heights","There were no other sightings in Columbia Heights on or around April 30th 2013"],"Date of the Event":"04/30/2013 09:49 UTC","Case Number":"47132","Object Features":"Unknown","Source":"MUFON","Date Submitted":"05/02/2013 05:31 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.043199,+-93.258764(47132)&iwloc=A&hl=en\"> mufon case (47132) map </A>","Latitude":"45.043199","City":"Columbia Heights","divs":["sighting detailsthis evening i was inside settling in for the night and something just told me to go and look outside. every chance i get, i watch the sky, so i immediately looked up when i went out the door. i just wanted to let you know that my wife and i both saw something in the sky the night of april 30, 2013 that was incredible. we saw hundreds of white circular balls of light\\orbs all traveling in formation, the same direction, towards the southwest. it was continuous flights for over 2 hours. nothing could be picked up on my android phone camera since they were traveling up so high. they were all flying at a slow speed with no sound. i know this isn't hard evidence since i was unable to get a video, but i wanted to get the word out there that there are ufo's in massive quantities in minnesota. i felt excited with what i saw and curious because i've always been a believer of existence of ufo's and other life. i never actually lost sight of the ufo's. after watching hundreds of them pass me overhead for over 2 hours, i finally just went inside and went to bed."],"Longitude":"-93.258764","Region":"Minnesota","Log Number":"US-05022013-0021"}