{"Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=39.354045,+-76.632292(47134)&iwloc=A&hl=en\"> mufon case (47134) map </A>","Log Number":"US-05022013-0023","Latitude":"39.354045","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/47134.html.txt","/var/www/straped/mufon/org/47134.html"],"Region":"Maryland","Country":"United States","Weather Factors":"Unknown","Summary":"I was laying on my bed calling the names of several beings for assistance as I had been attacked by several uknown entities. I had an audio recorder on at the time. I captured several beings or entities talking and some type of transport system","Object Features":"Patterned Surface","Object Shape":"Disc","Tags":"City","Date Submitted":"05/02/2013 06:28 UTC","City":"Baltimore","Source":"MUFON","Date of the Event":"08/11/2005 12:00 UTC","trends":["There have been 65 other sightings in Baltimore","There were no other sightings in Baltimore on or around August 11th 2005"],"Longitude":"-76.632292","divs":["Sighting DetailsI was in my 1st floor apt. in a house in Baltimore, MD laying on my bed which was very near to the front of the house. I had an audio recorder on because of noises that I began hearing in the house especially at night. I had been attacked by several unknown entities and severely so I was laying on my bed saying the names of several entities or beings from the Bible hoping an angel or somebody would come to help. I fell asleep calmly for the first time in a while and immediately as I entered the dream state an entity began to speak to me and I could feel the reverb in my skull. It asked if I wanted to go with \"them\" though I didn't see any being. I felt as if the entity was good and so I said yes. I got the feeling to look up and I did and I saw a cloud form out of nothing near above the street in front of my apt. (I was then standing outside... in the dream state). I saw a cloud form out of nothing about 100 ft. or less approx. above the street. Then a round silver craft appeared out of the cloud. For some reason I asked if I could take somebody with me to see the space ship and then the craft disappeared, but the cloud was dragged towards the south east. Then I went into another dream and I woke up (approx. 8 hours later). After I woke up I remembered the space craft and quickly grabbed my digital recorder and uploaded the data to my computer. After I did I noticed large wave patterns which meant a lot of noise. I checked it out and I heard several entities speaking and what sounded like a conduit openeing. Too a word that spoken by the entities in unison and then the sound of an electromagnetic oscilation shortly after I can be heard saying, \"Jesus Christ Jesus Christ\". So it was REAL! Something did happen and actual living entities or beings were there and were speaking and conducting some type activity."],"Case Number":"47134"}