{"Object Shape":"Egg, Oval, Star-like, Teardrop","map":"<A HREF = \"http://maps.google.com/maps?q=45.785782,+-92.381028(4713)&iwloc=A&hl=en\"> mufon case (4713) map </A>","divs":["Sighting DetailsI was at home sitting in my chair watching T.V.,I have a big window by my chair and I noticed something like a bright star,But it is alot closer! So I walked out to the end of my drive-way with my Binoculars and observe it for awhile. It has different colors, blue red yellow green. And on top of it.It looks like flams shooting up-ward,Like a rainbow above it! And it stays in one spot for awhile than it moves from side to side,and up and down.I was in the Air Force for 8 yrs and I never seen any plain do that! or any stars!I live on a dead-end road out in the Boo-nies so I dont have any town or city lights to interfear with what I and my Wife saw!I wish I would have a Telescope with a built in camera so I could get some real good pictures of it.This aint the first time we spotted this thing, My wife and I and our neighbors spoted this object before,But their was two other ones with it!I have called 911 and reported this before but they didnt even send any buddy out to check it out.Which didnt suprise me any.Kind of like Mayberry."],"Latitude":"45.785782","Log Number":"US-04262006-0001","Country":"United States","Weather Factors":"None","Tags":"City","files":["/var/www/straped/mufon/html2text/4713.html.txt","/var/www/straped/mufon/org/4713.html"],"trends":["There have been no other sightings in Siren","This sighting has never been favorited."],"Viewing Distance":"Over One Mile","Date Submitted":"04/25/2006 09:30 UTC","Object Flight Path":"Stationary,Path with directional change","Disposition":"Insufficient Data","Source":"MUFON","City":"Siren","Sighting Duration":"03:00:00","Longitude":"-92.381028","Region":"Wisconsin","Case Number":"4713","Summary":"Bright , Different Colors at times , Kind of Egg or oval shape , Stays in one spot like a star than moves up and down and side to side weird !!","Object Features":"Unknown","Date of the Event":"04/25/2006 09:30 UTC"}