{"Longitude":"-99.20145","files":["/var/www/straped/mufon/html2text/47133.html.txt","/var/www/straped/mufon/org/47133.html"],"Source":"MUFON","Date Submitted":"05/02/2013 05:39 UTC","Log Number":"BR-05022013-0022","Object Flight Path":"Path with directional change","Object Features":"Unknown","Country":"Mexico","Object Shape":"Triangle","Sighting Duration":"00:00:12","Region":"Morelos","map":"<A HREF = \"http://maps.google.com/maps?q=18.951818,+-99.20145(47133)&iwloc=A&hl=en\"> mufon case (47133) map </A>","trends":["There has been one other sighting in Cuernavaca","There were no other sightings in Cuernavaca on or around December 1st 1993"],"Latitude":"18.951818","Summary":"Ufo like a Belgium wave, without center light, in Brazil in the 90s","Tags":"City","Viewing Distance":"101-500 Feet","Disposition":"Unresolved","Case Number":"47133","City":"Cuernavaca","Date of the Event":"12/01/1993 12:00 UTC","divs":["Sighting DetailsMe, my cousin and her son were in front of our home, when the first triangle UFO appeared, doing a parabolic trajectory. In this moment we were talking in front of house as usual. We all saw the object simultaneously. When I saw I could not figure out what it could be because the object did not resemble any earthly aircraft or a balloon, at the same time I don't understand as a UFO initially because I only knew the shape of a flying saucer. Not quite finished the first object to pass, a second identical appeared in the same location as the first had started following the same path until it disappeared behind the roof also. The illustration depicts this moment. From the moment that the first object appeared yet on who the last one came out, stopped talking astounded by what we saw, until he returned to speak, this time of the sighting was that everyone thought it is a UFO (we use the term \"flying saucer\", although the UFO was triangular shape identical to the uploaded image). We lost sight of the object when it ended the trajectory going on behind the roof as in the illustration. After that we were afraid and went into the house. At this time I should have more or less about 9 years, my cousin about 30 years and the son a 7. The date is unknown, but in 1990 - 1995."],"Weather Factors":"Unknown"}