{"Object Shape":"Unknown","Date Submitted":"05/03/2013 03:29 UTC","Object Flight Path":"Hovering then path,Path with directional change","divs":["Sighting DetailsWent out to the back yard with the dog to enjoy the 78 degree weather. It was just after sunset and the air was still. Sitting down relaxing heard a distant pop boom sound that got my attention and all the dogs on the block began to all bark. Looking almost straight up and about 10 degrees to the west so at 80 degrees I saw a very bright object that was flashing or pulsing orang red yellow blue white lights randomly across it's shape that appeared to be rectangle. My first thought was fireworks as I looked up and instantly , as I saw the object thought airplane in trouble, but it was stationary or hovering. It remained stationary for over 30 seconds flashing brightly many colors orange red yellow blue white, lighting the sky around the object. It began to move very slowly in a arc or in a half circle as if it was going to circle around the block. I did not hear any other sounds besides the dogs barking. I yelled a\" UFO \" several times and ran through the house grabbing the camera at my computer desk. My 28 year old daughter followed me out to the front yard and also saw the object as it changed from a arc to a straight course to the south east. I turned on the camera and shot, the cam was set to full auto and the flash went off. The object seemed to pick up speed it was at 60 degrees from the horizon. I quickly set the focus to manual infinite turned off flash and shot again holding the cam as steady as possible leaned up against the car. I put the cam in movie mode and shot for another 30 seconds but did not see the object on the screen. I stopped the cam and could not see anything with my eyes. My daughter said it was gone as it appeared again bright orange and then disappeared before reaching the horizon at about 30 degrees. The first pic shows a bright orange streak, that was expected with the shutter time on auto but there seems to be a redish streak shooting in many directions that I don't understand as the power lines seem to blur slightly and not jet around. Second pic same as the first. I did not move the cam that much it seemed to me. was outside till after 12am saw nothing else. Must have cam ready for a encore."],"Viewing Distance":"501 Feet - 1 Mile","City":"San Lorenzo","Country":"United States","Log Number":"US-05032013-0004","Case Number":"47146","Region":"California","Tags":"City","Sighting Duration":"Undisclosed","Latitude":"37.641907","Longitude":"-122.155759","files":["/var/www/straped/mufon/html2text/47146.html.txt","/var/www/straped/mufon/org/47146.html"],"Summary":"distant pop boom sound looked almost stright up . saw flashing strobing red orange white blue lights in a rectangle shape completly still in sky.","map":"<A HREF = \"http://maps.google.com/maps?q=37.641907,+-122.155759(47146)&iwloc=A&hl=en\"> mufon case (47146) map </A>","Date of the Event":"05/02/2013 08:38 UTC","Object Features":"Other, Unknown","Source":"MUFON","trends":["There has been one other sighting in San Lorenzo","There were no other sightings in San Lorenzo on or around May 2nd 2013"],"Weather Factors":"Unknown","Disposition":"Unresolved"}