{"divs":["Sighting DetailsMultiple UFOs were caught on film briefly passing from the North West to the East over the North of Shrewsbury, Shropshire UK on 1st May 2013. They were caught on film with a Pulsar Recon 550 digital night vision monocular but could not be seen with the naked eye. They are not sky lanterns as they did not glow or flicker or give of a bright enough light, but they could be birds, although as this would have been above fields late in the evening, it is unlikely but cannot be ruled out. You can see in the footage that a civilian airliner was also traversing the sky at the same time and at 1 min 25 secs in you will see a small shooting star or meteor enter the atmosphere. Weather was calm with no wind and no clouds. Aircraft and balloons have been ruled out here so they remain unidentified. Once again this shows just how useful night vision equipment is when viewing in low light and dark conditions."],"Sighting Duration":"00:01:34","Case Number":"47147","Tags":"City","Weather Factors":"Unknown","Log Number":"GB-05032013-0005","Disposition":"Unresolved","Region":"England","Summary":"Multiple UFOs were caught on film briefly passing from the North West to the East over the North of Shrewsbury, Shropshire UK on 1st May 2013.","Latitude":"52.707303","Object Features":"Unknown","Date Submitted":"05/03/2013 04:46 UTC","Viewing Distance":"501 Feet - 1 Mile","trends":["There has been one other sighting in Shrewsbury","There were no other sightings in Shrewsbury on or around May 1st 2013"],"City":"Shrewsbury","Date of the Event":"05/01/2013 10:58 UTC","Source":"MUFON","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/47147.html.txt","/var/www/straped/mufon/org/47147.html"],"Object Shape":"Flash, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=52.707303,+-2.755327(47147)&iwloc=A&hl=en\"> mufon case (47147) map </A>","Country":"United Kingdom","Longitude":"-2.755327"}