{"Tags":"City","Log Number":"US-04262006-0002","files":["/var/www/straped/mufon/html2text/4714.html.txt","/var/www/straped/mufon/org/4714.html"],"Country":"United States","trends":[],"Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Summary":"observed ufo about 2 - 3 miles from my location, during my lunch hour at work.","divs":["Sighting Details1). Sighting occured at approximately 5:40pm on April 24, 2006 & lasted approximately 5-6 minutes. At the time of my observation of the ufo, I was sitting out in front of the loading area of my place of employment during my lunch break (I work for The Home Depot). 2). Sometimes during my lunch break, I will sit in this area, look southwards and watch the airplanes fly by. The Las Vegas Airport (McCarran International) is located about 3 miles south-east of where I work. As I was watching the passenger planes fly by one after another from the Airport heading westward, I happened to notice on one of the planes, what I thought at first was a piece of something - perhaps a piece of wing, fly up and begin to descend downward slowly under the plane. However, the plane kept flying onward so I immediately realized that nothing was wrong with the plane. Whatever this was, I would have to say that it must have been a safe distance from the plane as I would assume the pilot would have taken measures to steer away from it if it was too close. But for a split second I thought it was a part of the plane and that something fell off. 3). After I realized that the plane was fine and wasn't going to crash, I then concentrated on observing this strange behaving object. I don't consider myself an expert on judging what the object COULD have been, but I can certainly tell you what is was NOT. I was DEFFINATELY not a plane, helicopter, bird, blimp, balloon, a kite or a piece of debri just randomly floating around in the sky. Some other type of aircraft that I'm not familiar with? Possibly. But I never seen anything behave in the manner in which this thing behaved. 4). Where I was sitting - the roar of the planes gaining altitude can be clearly heard. However, this object was completely silent - at least I couldn't hear anything from where I was sitting. It is difficult to describe what the object looked like or its' size as it was too far away. My best guess was that it was round, flat and DEFFINATELY dark on one side and VERY HIGHLY reflective on the other. The best way I can describe its' movements was like that of a top rolling around on the floor as it loses momentum and falls down and moves about really fast. The wobble of this object was very fast and the flash of the reflective side was quite quick. Oddly, as the plane moved forward heading west, the object very slowly descended downward - I'm guessing 1,000 feet - I could be way off on that guess??? Then, it began to move toward the southeast in a everso slight downward manner until it leveled off and disappeared behind the horizon and buildings in the distance. All this time it is wobbling rapidly and continuing to reflect the suns light. I'd like to mention that it was partially cloudy that day. The planes flying by were at a too low of altitude to be as high as the clouds as they just recently departed from the airport. My guess is that the object was obviously much higher than the planes and much further away then the path of the planes. though at first the object appeared to be just a small piece of the plane, I would have to say that it would have had to be a much larger object than what would to first appear. 5). I kept my eyes fixed on this object and watched it like a hawk. I briefly looked about to notice customers going in and out of the store carrying on their business and shopping duties. I just looked around briefly to see if anybody else was looking up in the sky but I didn't notice anybody looking. I didn't want to leave and I intended to watch this thing for as long as I could. The only emotion I experienced was extreme curiousity. I just kept saying to myself, \"This is wierd\". 6). The horizon of the buildings off in the distance is where the object disappeared from my viewpoint. Before reporting this to MUFON, last night I turned on the local newscast to see if anybody else reported this - I heard nothing. So here I am reporting this and hoping that I'm not making a fool out of myself doing so. I told ONLY my roommate about it. Incidentally, I have an extreme interest in ufo's and I am quite familiar with Dr. Steven Greer's Disclousre Project. Whether this is something with a more down-to-earth explanation OR something of non-earth-based orgins is of extreme interest to me. Somebody else in Las Vegas - a major city MUST have seen this. I'm guessing that if it's something that is easily explainable, then that's why nobody else mentioned anything. If MUFON chooses to contact me, please do so on my Cell Phone number. I will return your call a.s.a.p. if I'm not immediately available. If MUFON does decide to investigate this sighting, I would be extremely interested in finding out what your discover if anything. I do not have any photos of this object whatsoever. HOPEFULLY, somebody out there does and maybe come forward."],"Object Flight Path":"Hovering then path","Region":"Nevada","map":"<A HREF = \"http://maps.google.com/maps?q=38.80732,+-116.414589(4714)&iwloc=A&hl=en\"> mufon case (4714) map </A>","Date Submitted":"04/24/2006 05:40 UTC","City":"Undisclosed","Case Number":"4714","Disposition":"Insufficient Data","Object Features":"None","Object Shape":"Circle, Disc","Source":"MUFON","Weather Factors":"Unknown","Date of the Event":"04/24/2006 05:40 UTC","Latitude":"38.80732","Longitude":"-116.414589"}