{"map":"<A HREF = \"http://maps.google.com/maps?q=31.975499,+-99.894853(47152)&iwloc=A&hl=en\"> mufon case (47152) map </A>","Object Features":"Wings, Unknown","Object Shape":"Triangle, Unknown","Log Number":"US-05032013-0010","Region":"Texas","trends":[],"Case Number":"47152","Sighting Duration":"Undisclosed","Date of the Event":"02/20/2013 01:30 UTC","divs":["Sighting DetailsMy husband and I were flying from Kansas City, Mo to McAllen, Tx on an American Airlines plane, around midday on Wednesday, February 20. I am not sure, but I believe we were someplace over Texas when something flew past the plane window. I had been looking out the window at clouds. We were probably at at least 30,000 ft so not much else could be seen. It was right before a big snowstorm hit Kansas City that night, and was very cloudy. Then I noticed another, much smaller object passing our plane, going in the opposite direction. It seemed closer than any other aircraft should safely have been, and was approximately on the same level as our plane, at the same altitude. My first impression was that it was a smaller plane. It looked about the size of a small jet, maybe military. However it was a gold metallic color and was a rounded V-shape, like a pudgy plane. The small end of the V was the front. There were no distinct windows, wings or tail but vague shapes of possible wings. It didn't look like any plane I had ever seen before, and I was surprised that was so close to the large jet I was in. Our plane was flying south and this object passed it on the west side and the smaller object was flying north, at a very high rate of speed. I was able to observe it for only about three seconds before it passed out of my view from the window. I didn't see any other objects or aircraft near it. No lights observed and no emmissions noticed. There was a slight reflection off the metallic gold body. I then looked around to see if anyone else seemed to have noticed it. Everyone I could see, including my husband, was either asleep or reading. The flight attendants had finished passing out refreshments and were nowhere in sight. I am sure the pilots would have been able to see this thing if they were looking out their window up front. I was sitting behind the bulkhead, in seat A of the first row in the first class section, so not far behind the cockpit. I couldn't hear anyone talking at all. I didn't mention this to anyone. But, it has been on my mind ever since I saw it because I can't come up with any reasonable explanation for what it might have been."],"Summary":"UFO seen from plane window over Texas, February 20, 2012","City":"Undisclosed","Latitude":"31.975499","Source":"MUFON","Tags":"City","Date Submitted":"05/03/2013 08:04 UTC","Object Flight Path":"Straight-line path","Viewing Distance":"101-500 Feet","Longitude":"-99.894853","files":["/var/www/straped/mufon/html2text/47152.html.txt","/var/www/straped/mufon/org/47152.html"],"Disposition":"Unresolved","Weather Factors":"Unknown","Country":"United States"}