{"Tags":"City","Date of the Event":"05/01/2013 03:25 UTC","Latitude":"42.656871","City":"Hastings Charter Township","Summary":"Glowing white object travelling South then made 90 degree turn to the East and disappeared into the Sky.","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=42.656871,+-85.352138(47150)&iwloc=A&hl=en\"> mufon case (47150) map </A>","trends":["There has been one other sighting in Hastings Charter Township","There were no other sightings in Hastings Charter Township on or around May 1st 2013"],"Object Shape":"Boomerang, Flash","Date Submitted":"05/03/2013 01:56 UTC","Longitude":"-85.352138","Weather Factors":"Unknown","divs":["Sighting DetailsI was in my car at a stop light facing East on M37 in downtown Hastings, Michigan at 3:25pm (EST) on May 1, 2013 when I saw a glowing white object travelling South then made a 90 degree turn to the East and disappeared into the Sky. At first it seemed to have white glowing wings. It changed it's shape to a blob of white and then disappeared into the bright blue sky. There were very few white clouds at the time but this object was definitely travelling at a steady pace like the wind blowing something across the sky. I thought it might have been some trash or a balloon in the sky but it was too far upwards in the sky to be trash flying around. When it suddenly turned from travelling South to East (directly away from me) and disappeared, I knew it wasn't a balloon or trash. When it disappeared, right after it made the 90 degree turn, it seemed to have left into a pinpoint in the sky. The whole event took approximately 10 seconds. Hope this helps!"],"Sighting Duration":"Undisclosed","Log Number":"US-05032013-0008","Object Flight Path":"Path with directional change","Region":"Michigan","Source":"MUFON","Object Features":"Wings","Country":"United States","Disposition":"Unresolved","Case Number":"47150","files":["/var/www/straped/mufon/html2text/47150.html.txt","/var/www/straped/mufon/org/47150.html"]}