{"Weather Factors":"Unknown","Country":"United States","Longitude":"-72.728333","divs":["Sighting DetailsExactly on the new years eve and evening at one minute past midnight 18 brilliant light orange orbs came over our home in perfectly straight lines from the north of England going toward the south and followed by a large disk craft which was dark grey but had markings and texture surface. This craft glided silently over the house and gradually tilted like a plane and turned to the east and flew and smoothly glided out of sight. It was a full moon and very clear and my wife also witnessed this. Calls to the airport showed negative feedback, but later on the internet scores of reports came in from people sighting the craft in the exact path we saw it going. I checked these Orbs to make sure they were not Chinese lanterns, and with powerful binoculars could see they were not flickering but were a solid bright lights like the bright orange light of a car indicator, they were so bright, that a Chinese lantern cannot glow or shine this bright , neither do they all travel in direct straight lines. These Orbs were too bright, going to parallel to each other and perfect formation. The craft had grids or making on like the underside craft of a star wars space ship. Scores of people saw these Orbs coming down from the north of England. We were looking out of the bedroom window and as it was a full moon, I said to my wife what happen to the moon, as was moving strangely in the distance, but suddenly I realised the moon was high in the sky and this was another round object moving towards us. It flew slowly directly overhead of our home and as I ran to the other side of the building and looked out of the front lounge window I watched it glide over the house into the distance and bear left going east. I was reading the books \"Nothing in This Book is True, But That's Exactly How Things Are\" by Bob Frissell, and and a number of other book where I had read to invite evidence of extraterrestrials and that very night I saw this event. Also My wife and I went to Bohol for holiday in the philippines and over our house where we stayed saw the very same Orbs near midnight again gliding over the house on the Island of Pangloa. On this occasion their were many witnesses as we all watched them fly over. Orbs showing up in photos have appeared many times once when I was doing a presentation in the Hilton hotel in London, they are in the photo right beside me in the mail entrance way, as well as other events."],"Region":"Vermont","Viewing Distance":"501 Feet - 1 Mile","City":"Berkshire","Disposition":"Unresolved","Object Shape":"Disc, Sphere","files":["/var/www/straped/mufon/html2text/47159.html.txt","/var/www/straped/mufon/org/47159.html"],"Object Flight Path":"Path with directional change","Log Number":"GB-05042013-0004","Date of the Event":"01/01/2011 12:00 UTC","Date Submitted":"05/04/2013 03:41 UTC","Case Number":"47159","Summary":"18 bright orange Orbs going in straight lines followed by disk craft","Latitude":"44.9525","trends":["There has been one other sighting in Berkshire","There were no other sightings in Berkshire on or around January 1st 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=44.9525,+-72.728333(47159)&iwloc=A&hl=en\"> mufon case (47159) map </A>","Sighting Duration":"Undisclosed","Object Features":"Patterned Surface","Tags":"City","Source":"MUFON"}