{"Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-114.049866","Source":"MUFON","Weather Factors":"Unknown","City":"Kingman","Summary":"strange lights in the sky viewed by my wife and i plus a friend on the other side of town","divs":["Sighting Detailslate evening was enjoying a conversation with a friend on the phone then she noticed something in the sky, living on the other side of town i went out to take a look and there in plain sight something in the night it had a slow movement and many lights 5 or 6 that i can remember that blinked in sequence from left to right. as they blinked they started off dim or soft colored and got brighter in the middle then soft at the end.the lights were all close enough to not have any gaps and actually the speed was enough to kind of make them overlap or blend in to each other. id say it was less then a mile away over the middle of town headed out north east. i could see it traveling towards the mountains and then lost sight as it went over, it took a wile to do this and id say the total time in my view was over 4 min. there was no sound or funny movements also no clouds in the sky. i was in shock and had enough sense to call out my wife to take a look. she got scared and went inside. i scanned the night to see other objects out to compare it to and had my choice of aircraft in the sky. this was defiantly not anything like Ive ever seen nor was it following a flight pattern like everything else. id say this would be one of the most interesting things Ive ever seen it sent chills down my spine and my wife running inside lol. my friend who was on the phone and gave a slight different account of the story but she was closer to it so i can only speak for what i believe i was seeing. hopefully other people come forward about the viewing. it was headed towards las vegas so maybe some reports will come from there"],"Case Number":"47157","Log Number":"US-05042013-0002","Latitude":"35.192153","Date Submitted":"05/04/2013 03:05 UTC","files":["/var/www/straped/mufon/html2text/47157.html.txt","/var/www/straped/mufon/org/47157.html"],"Sighting Duration":"Undisclosed","Date of the Event":"05/03/2013 08:40 UTC","Country":"United States","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=35.192153,+-114.049866(47157)&iwloc=A&hl=en\"> mufon case (47157) map </A>","Object Shape":"Unknown","trends":["There have been 35 other sightings in Kingman","There were no other sightings in Kingman on or around May 3rd 2013"],"Object Flight Path":"Path with directional change","Region":"Arizona","Object Features":"Unknown"}