{"Country":"United States","Weather Factors":"Unknown","Date Submitted":"05/04/2013 12:30 UTC","Tags":"City","Longitude":"-111.75987","Latitude":"34.87909","map":"<A HREF = \"http://maps.google.com/maps?q=34.87909,+-111.75987(47156)&iwloc=A&hl=en\"> mufon case (47156) map </A>","Object Shape":"Star-like","Date of the Event":"04/28/2013 08:59 UTC","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Viewing Distance":"Unknown","Summary":"They have been occupying the skys for 6 days now. Hovering and moving in sporatic directions with a constant color change","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/47156.html.txt","/var/www/straped/mufon/org/47156.html"],"Case Number":"47156","City":"Sedona","Region":"Arizona","Disposition":"Unresolved","trends":["There have been 47 other sightings in Sedona","There were no other sightings in Sedona on or around April 28th 2013"],"divs":["Sighting DetailsApril 28th I was outside smoking at around 10:30 pm. I saw what appeared to be a large star changing color. Then it started moving in a triangular motion, also left, then right. I ran nextdoor and woke my friend out of bed, calling her by the wrong name I was in such shock. She came out and also saw what I had seen. The next night we were with another friend and saw even more activity, including one rise straight up and fly off into the distance.On the third night I drove to my other friends house in Cornville to show him (the biggest skeptic I know), and he too saw them all changing color, but we did not see any major movement that night. It is now May 3rd and they still occupy the sky. None of us have video cameras, but would like someone to investigate these objects. I have never doubted that there was something else out there, but I NEVER in a million year thought I would witness what I have been seeing. I left my phone number, please feel free to call me with any further quetions, and PLEASE someone come out and video tape this!"],"Object Features":"Other","Source":"MUFON","Log Number":"US-05042013-0001"}