{"Date Submitted":"05/03/2013 05:22 UTC","Summary":"Metallic UFO Looking Almost As If It Was Made Of Mercury Hovering Between Two Chemtrails","Log Number":"US-05032013-0009","Object Shape":"Other","Latitude":"39.320107","divs":["sighting detailsi saw an amazing ufo yesterday at exactly 5:10pm 5\\2\\2013. i was traveling west bound down philadelphia road in rosedale to get to l&m crafts to buy some tattoo supplies with my brother and mom. at first i just saw a metallic orb shine in the sky for about a second or two but it was long enough to show my brother before it disappeared. i kept driving down the road for another half of mile or so before i noticed that the craft was back. there were two airplanes in the sky slightly ahead of the ufo both of the airplanes were admitting long \"chemtrails.\" the ufo was metallic in appearance but looked almost like a liquid instead of a complete solid. it was very strange it looked as though it was completely made of mercury. the shape of the craft was very odd as well it was almost the shape of a chestnut and due to being able to compare the ufo with the airplanes that were ahead of it you could tell that the craft was three maybe even four times the size of a commercial plane. the ufo hovered and bobbed there between the two chemtrails for about 45 seconds before it disappeared before our eyes. the ufo appeared to be very interested in the chemtrails made by the two airplanes."],"Object Flight Path":"Path with directional change","Date of the Event":"05/02/2013 05:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.320107,+-76.515519(47151)&iwloc=A&hl=en\"> mufon case (47151) map </A>","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/47151.html.txt","/var/www/straped/mufon/org/47151.html"],"Case Number":"47151","Tags":"City","Region":"Maryland","Disposition":"Unresolved","Longitude":"-76.515519","trends":["There has been one other sighting in Rosedale","There was one other sighting in Rosedale on or around May 2nd 2013"],"Viewing Distance":"501 Feet - 1 Mile","Object Features":"None","Country":"United States","Source":"MUFON","City":"Rosedale","Sighting Duration":"00:05:00"}