{"Tags":"City","Region":"Arizona","Latitude":"33.416105","Disposition":"Unresolved","Date Submitted":"05/04/2013 05:58 UTC","Object Features":"Wings","Date of the Event":"05/03/2013 10:00 UTC","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Longitude":"-112.238277","Country":"United States","Log Number":"US-05042013-0009","Sighting Duration":"Undisclosed","Object Shape":"Unknown","Summary":"three lights on a winged body with a red light flasing in a 5 or more point sequence on the body","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 417 other sightings in Phoenix","There was one other sighting in Phoenix on or around May 3rd 2013"],"files":["/var/www/straped/mufon/html2text/47165.html.txt","/var/www/straped/mufon/org/47165.html"],"Case Number":"47165","map":"<A HREF = \"http://maps.google.com/maps?q=33.416105,+-112.238277(47165)&iwloc=A&hl=en\"> mufon case (47165) map </A>","Source":"MUFON","divs":["Sighting DetailsWhile observing night sky from patio I noticed a faint red light near what appeared to be a star in the Southwest. I was curious and went to get binoculars but by the time I returned the object had moved, The star was actually part of an object. It was slow drifting and within 10 minutes was close to my position. I focused the binoculars on the object which was drifted past me towards the southeast now and found it appeared to be a long bar with 1 small but bright light on each end ( white and at one point green) and a red light in the middle flashing in a sequence around 5 or six spaces on the bar. the object changed direction several times but always seemed to move in a circular path that took it further west each time. This went on for over an hour until it became a faint light in the sky. On the last movement I took out my telescope and noticed the 'bar' was actually like a thick wing, though immense in length with the red light moving in fast sequence along it. there was a small tail wing attached but apparently no body to the object. The surface was beige and difficult to make out. It appeared to be at a high altitude and if you did not observe it head on (three lights facing) it appeared like just another star. I thought it could be drone, but it seemed too big and was moving over neighborhoods and the power lines, so that possibility seemed unlikely. Photos were not successful."],"City":"Phoenix"}