{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.700915,+-73.108715(4716)&iwloc=A&hl=en\"> mufon case (4716) map </A>","Longitude":"-73.108715","divs":["Sighting Details I WAS WALKING HOME FROM A BASEBALL GAME.I WAS WALKING ACROSS A WELL LIT PARKING LOT.I NOTICED A CREATURE IN THE PARKING LOT.I STOPED TO LOOK AT THE CREATURE.IT DID NOT NOTICE ME AT FRIST BUT WHEN IT DID IT LOOKED UP AT MY FACE.I CAN NOT REMEMBER WHAT THE CREATURE LOOKED LIKE OTHER THEN IT WAS SMALL.I CAN NOT REMEMBER IF IT HAD A TAIL OR WALKED ON FOUR LEGS OR HAD A TAIL.HARD AS I I TRY I GET A BLANK WHEN I TRY TO REMEMBER WHAT IT LOOKED LIKE.I DO REMEMBER I GOT THE IMPRESSION IT HAD INTELLIGENCE.NOT ON THE LEVEL OF A SMART DOG BUT GREATER. WHEN THE CREATURE NOTICED ME IT RAN UNDER A CAR.I PUT MYSELF AT A ANGAL SO IF IT LEFT THE CAR I COULD SEE IT FROM ALL SIDES.I STOOD THERE FROM 15 TO 20 MINTUES.A MAN CAME OUT OF A BULIDING,GOT IN THE CAR AND DROVE OFF.THE CREATURE WAS NOT THERE. WHEN I TRY TO REMEMBER WHAT THE CREATURE LOOKED LIKE I GET THE IMPRESSION OF A MONKEY FOR SOME REASON.THIS WAS NOT A MONKEY.I WAS NOT SCARED WHEN THIS HAPPENED-JUST CURIOUS.THE CREATURE DID NOT THREATEN ME IN ANY WAY. IT PUZZLES ME AS TO WHERE THE CREATURE WENT AND WHAT IT WAS. I LOVE ANIMALS AND HAVE BEEN TO MANY ZOOS.THIS CREATURE WAS NOT LIKE ANYTHING I HAVE SEEN BEFORE."],"Region":"Massachusetts","trends":["There has been one other sighting in North Adams","There were no other sightings in North Adams on or around August 15th 2003"],"Disposition":"Hoax","Date of the Event":"08/15/2003 09:30 UTC","Sighting Duration":"Undisclosed","Tags":"City","Summary":"A CREATURE","Country":"United States","Weather Factors":"Unknown","Log Number":"US-04272006-0001","files":["/var/www/straped/mufon/html2text/4716.html.txt","/var/www/straped/mufon/org/4716.html"],"Object Flight Path":"Undisclosed","Case Number":"4716","Object Features":"Undisclosed","City":"North Adams","Object Shape":"Undisclosed","Latitude":"42.700915","Viewing Distance":"Unknown","Date Submitted":"08/15/2003 09:30 UTC"}