{"Date of the Event":"07/01/2007 09:05 UTC","Latitude":"46.595043","City":"Ashland","trends":["There have been 4 other sightings in Ashland","There were no other sightings in Ashland on or around July 1st 2007"],"Object Features":"None","Date Submitted":"05/04/2013 02:45 UTC","Object Shape":"Sphere","Case Number":"47162","Viewing Distance":"501 Feet - 1 Mile","divs":["sighting detailsmy wife got a new camera and was an aspiring photographer. she is much better now:). anyways. the photos were taken from my inlaws house. same house she grew up in. the oredock is a local landmark that is almost completely tore down right now. a project that took 2 years. so we were taking photos with the sunset, as a memory before it was gone... she took 4 photos and decided it was too dark. at first we seen the orb that was a close up view. but we joked it was a ghost, and laughed it off. 3 years later i was going through old photos looking for work photos for advertising. i came across the dark pictures with the lit up hummingbird. i thought it looked artistic. so my wife started cropping, and lightened the contrast a bit. that's when we seen it. we zoomed into the orb and seen the details. we were shocked. we then lightened the other 3 photos and sure enough there were some in every picture... some time later i googled the description, and it led me to the mufon site. after reading the #26065 sighting report. i felt like they were narrating, and describing what i had photos of... read for yourself, but in a nutshell- \"silver raspberry shaped orb. bottom flattened out and a smaller orb came out. then became round again. the descripted seeds of the raspberry orb seemed to pop, and reform. in a boiling action\" look at the close up photo we have. i would describe the same way. flat bottom. i described it as a flat bottom gold ball with the dimples at different stages of pulsating\\popping light balls. then some of the larger orbs are flat bottomed and some are round. again at different stages of letting the smaller orbs out... both sightings at dusk. the parallels are strong. the only difference it i don't see any triangle of lights. then again. i didn't see or hear anything with my own senses. one i found interesting was the orb close to the ground that is half behind the large tree on the shore of lake superior. it seemed close. as was the close up shot obviously. have fun discecting it:) looking forward to others stories of the same thing."],"Longitude":"-90.877048","Country":"United States","Summary":"took photos of sunset/oredock. Seen the UFOs later in photos. Didnt see with eyes","Tags":"City","Log Number":"US-05042013-0006","Region":"Wisconsin","Object Flight Path":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=46.595043,+-90.877048(47162)&iwloc=A&hl=en\"> mufon case (47162) map </A>","Source":"MUFON","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/47162.html.txt","/var/www/straped/mufon/org/47162.html"],"Disposition":"Unresolved","Sighting Duration":"Undisclosed"}