{"map":"<A HREF = \"http://maps.google.com/maps?q=34.058705,+-118.142649(47169)&iwloc=A&hl=en\"> mufon case (47169) map </A>","Weather Factors":"Unknown","Object Shape":"Star-like","Source":"MUFON","Object Flight Path":"Path with directional change","Log Number":"US-05042013-0013","Country":"United States","trends":["There have been 4 other sightings in Alhambra","There were no other sightings in Alhambra on or around May 3rd 2013"],"Date Submitted":"05/04/2013 10:30 UTC","Summary":"A star that moved in the sky down the horizon very slow, pulsating as it went down the side of a tree out acros the city to the northwest. It has an energy aura that affected my eyes if I looked at it too long.","Object Features":"Unknown","City":"Alhambra","divs":["Sighting DetailsI have observed a starlike object for two years in the sky. At first it was after midnight. It moved very slowly down the horizon on one side of a tree then move behind the tree then move slowly off across the sky until I could not see it anymore. I observed this outside my bedroom window from where I live. My window faces west. There are power lines,a garage and a tree west from my bedroom window. When I first observed this starlike blinking object I was going to bed when I looked at this and it moved slightly. Stars don't move like that. I watched it from my bed. My eyes were affected. A tension seemed to build up then an aura would around the \"star\" and where I looked. It hurt. It moved in the sky for two hours then sink in the sky or move across the horizon til it moved behind the garage. It never dissappeared. It would appear for months then stop, then appear for months. Always the same pattern. Then last year it changed, as I looked at it, it moved it's pattern to the north of the tree, starting at the top and dropping down, slowly. Then it would cross my eyes and it be two then one. I would have to look away. In order not to see it I would have to close my shades, I hate that! Half way through last year it change it's times to before midnight. On cloudy nights I could not observe it so I figured it was above the cloud layer, because on clear nights there it was. I cannot remember if full moon night it was there because I am a witch so I am busy those nights. Since before Christmas it has not been around but last night I observed it again. I have watched the Citizens Hearing on Disclosure and I felt I should tell someone. It has really scared me. Going to bed is hard. I like to look at the sky at night and feel I cannot because of this thing in the sky I know nothing about, no one else sees it. Am I crazy! When I close my eyes to sleep I feel safe because I cannot see it. Is there someone to talk to?"],"Latitude":"34.058705","Disposition":"Unresolved","Viewing Distance":"Over One Mile","Tags":"City","files":["/var/www/straped/mufon/html2text/47169.html.txt","/var/www/straped/mufon/org/47169.html"],"Region":"California","Sighting Duration":"Undisclosed","Longitude":"-118.142649","Date of the Event":"05/03/2013 08:00 UTC","Case Number":"47169"}