{"Date Submitted":"05/04/2013 06:17 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=30.320418,+-97.688042(47166)&iwloc=A&hl=en\"> mufon case (47166) map </A>","Latitude":"30.320418","Region":"Texas","files":["/var/www/straped/mufon/html2text/47166.html.txt","/var/www/straped/mufon/org/47166.html"],"Source":"MUFON","Object Shape":"Sphere, Star-like","Country":"United States","Tags":"City","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around May 4th 2013"],"Case Number":"47166","Object Features":"None","Disposition":"Unresolved","Longitude":"-97.688042","Weather Factors":"Unknown","Summary":"Saw star-like object very slow moving in sky, appeared to briefly stretch in shape.","Viewing Distance":"Over 1 Mile, Unknown","Log Number":"US-05042013-0010","City":"Austin","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Date of the Event":"05/04/2013 04:53 UTC","divs":["Sighting DetailsStar-like object moving at same speed as jet stream cirrus clouds seen in eastern skies 453-458pm CDT from NE Austin, Texas. Through polarized glasses could easily see object at same magnitude as nighttime viewing of bright star or planet. A second witness also saw the star-like object from the same perspective. Three jet aircraft crossed the viewing plane during those five minutes -- two at high altitude (20,000 ft +) and one at low altitude on descent to Austin Bergstrom Int'l Airport. The star-like object was undeniably higher in altitude than the highest aircraft viewed. Though no clouds happened to move immediately near the UFO during the viewing period, it is believed the object would have been obscured. At one point, probably around 456pm, the object appeared to flash from a point to a vertical spire as if radiating out from a north and south polar orientation. The flash was narrow in width and lasted shorter than a second. The object moved out of view around 458pm, crossing below the treeline."]}