{"divs":["Sighting DetailsOn April 26, 2013 between the hours of 10:30pm - 11:00pm in Cambridge, Ontario Canada myself and a friend were outside having a smoke. I noticed that my friend was looking up into the sky, looking to the right. When I looked up I saw a orange fireball like object in the sky. The size of the object when it was first noticed was a bit bigger then a grapefruit. The object was in the sky for about 5 minutes. The object moved away and faded away. There was no trail behind it. It never blinked it was a solid color. It had a red ring around it. It just showed up all of a sudden. Moving across the sky very slowly,moving from right to left,no sound can from it. It was a clear night. No planes were in the area. We were looking at it and tried to come up with an answer to what it might be, we were talking for couple of minutes and while talking I mentioned to my friend about the sighting that myself and my boyfriend saw a few months ago, after I was done work, it was very similar, but the one by my work looked further away and looked a lot smaller then the one we saw in April 2013. I turned to my friend and said that we should get my boyfriend who was in the house. While we were talking it was still moving across the sky. My friend ran into the house to grab my boyfriend to come have a look. By the time he came out the object had moved further away and faded away."],"Country":"Canada","trends":["There have been 11 other sightings in Cambridge","There were no other sightings in Cambridge on or around April 26th 2013"],"files":["/var/www/straped/mufon/html2text/47163.html.txt","/var/www/straped/mufon/org/47163.html"],"Date of the Event":"04/26/2013 10:30 UTC","Date Submitted":"05/04/2013 04:11 UTC","City":"Cambridge","Sighting Duration":"Undisclosed","Source":"MUFON","Longitude":"-80.299933","Tags":"City","Object Shape":"Fireball","Case Number":"47163","map":"<A HREF = \"http://maps.google.com/maps?q=43.358328,+-80.299933(47163)&iwloc=A&hl=en\"> mufon case (47163) map </A>","Object Features":"Unknown","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Latitude":"43.358328","Log Number":"CA-05042013-0007","Summary":"Orange ball of light in the sky.","Region":"Ontario","Object Flight Path":"Straight-line path","Disposition":"Unresolved"}