{"Disposition":"Unresolved","Latitude":"35.699275","City":"Weaverville","Tags":"City","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/47170.html.txt","/var/www/straped/mufon/org/47170.html"],"Weather Factors":"Unknown","Region":"North Carolina","Source":"MUFON","Date of the Event":"05/04/2013 12:00 UTC","divs":["sighting detailsat first, what i thought was a star caught my eye out a second story window of my home because it was very bright and not white. as i looked closer, i noticed it was glowing with fuzzy edges as a fireball would. it was reddish-orange. within a few seconds, three more appeared. two were very close together above the others, each moving in circles but not touching, and two were below, closer to the tree line moving randomly up\\down and sideways. my two children observed them as well and watched while i ran to grab the phone to call our neighbor to tell her to look for them (they were hovering closer to her house). while i was away from the window, my daughter observed them going down past the tree line, continuing to move erratically as they descended. we lost sight of them after that and by the time my neighbor went out into her yard she saw nothing. i don't think i would have gone out to look around either way, but it did start raining shortly after they disappeared, so that made my decision to stay inside easier! the whole incident lasted less than five minutes, but it was the strangest thing i've ever seen in the sky in my life."],"trends":["There have been 2 other sightings in Weaverville","There were no other sightings in Weaverville on or around May 4th 2013"],"Object Features":"Unknown","Object Shape":"Circle, Fireball, Flash, Star-like","Object Flight Path":"Hovering then path","Summary":"Four star-like objects, reddish orange, glowing observed in northwest sky in Weaverville, NC","Case Number":"47170","Longitude":"-82.557715","map":"<A HREF = \"http://maps.google.com/maps?q=35.699275,+-82.557715(47170)&iwloc=A&hl=en\"> mufon case (47170) map </A>","Date Submitted":"05/04/2013 10:32 UTC","Country":"United States","Sighting Duration":"Undisclosed","Log Number":"US-05042013-0014"}