{"Country":"United States","Weather Factors":"Unknown","Date of the Event":"05/04/2013 12:00 UTC","Case Number":"47176","files":["/var/www/straped/mufon/html2text/47176.html.txt","/var/www/straped/mufon/org/47176.html"],"Tags":"City","Region":"California","Object Shape":"Circle","Latitude":"33.836846","Log Number":"US-05052013-0003","Longitude":"-116.539932","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","trends":["There have been 23 other sightings in Palm Springs","There were no other sightings in Palm Springs on or around May 4th 2013","This sighting has been favorited 1 time.",""],"divs":["sighting detailsi was outside this evening looking for my cat at approximately 8pm when i noticed a bright orange\\red object low in the sky over indian canyons which was moving from the southwest to the northwest toward palm springs. after getting a better vantage point i noticed a second object which was some distance behind the first but at a slightly lower altitude. both objects emitted the exact same fiery orange\\red colors. as the objects moved slowly through the sky i lost sight of the second object as it dropped behind the san jacinto mountain. i then ran into the house to get a family member and after about 30 seconds inside came back outside and noticed that the second object had looped back around to the southwest to about where i had first noticed it in the sky and it was once again moving toward palm springs. by this time the first object was high over the san jacinto mountain directly to my southwest. because of the distance between the two objects and the number of large palm trees in my yard i could only now focus on one object. so i watched the first object as it slowly moved over the san jacinto mountain toward the northwest. after a couple of minutes my relative told me that the second object was no longer visible in the sky. and about a minute later i watched as the first object appeared to stop moving forward and slowly blinked out."],"Source":"MUFON","Summary":"This evening I observed two glowing objects above Indian Wells moving N.W. towards Palm Springs...","Date Submitted":"05/05/2013 03:12 UTC","Disposition":"Unresolved","City":"Palm Springs","Object Features":"Unknown","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=33.836846,+-116.539932(47176)&iwloc=A&hl=en\"> mufon case (47176) map </A>"}