{"Object Flight Path":"Other","divs":["Sighting Details I lay down about 2 PM for a nap when I awoke at 4PM I felt nothing. At 6 PM the bend of my arm began to itch. I noticed a puncture wound like I had given blood. But I have mot given blood in over a month at the blood drive in Mayo from my right arm. I have a problem giving blood from my left arm there seems to be something in the vane that prevents a needle from going in.Some times there is a sticking sensation in my left arm.The Doctors can give me no answer as to what might be inside my arm at the vain sight.I was going to prepare supper when it started itching like crazy when I looked down then I saw the puncture wound. I thought it was a needle puncture in my vain. Saturday night after my bath I had hives on my back for about two hours before they stopped itching and went away. I thought nothing of the hives until today.It is now 7:30 PM and the puncture mark is still there. It dose not itch as much now as it first day."],"Object Features":"None","City":"Mayo","Date of the Event":"05/05/2013 12:00 UTC","Summary":"Lay down at 2 PM to take a nap, when I awoke at 4Pm I felt nothing. At 6 PM my arm started itvhing where you would give blood there is a smallmark like someone punctured my arm to take blood and it itched like crazy for about 15 to 20 minutes.","Weather Factors":"Unknown","Latitude":"29.943415","Sighting Duration":"02:20:00","Tags":"City","Country":"United States","Log Number":"US-05052013-0013","Longitude":"-83.271921","trends":["There have been 17 other sightings in Mayo","There were no other sightings in Mayo on or around May 5th 2013"],"files":["/var/www/straped/mufon/html2text/47185.html.txt","/var/www/straped/mufon/org/47185.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=29.943415,+-83.271921(47185)&iwloc=A&hl=en\"> mufon case (47185) map </A>","Case Number":"47185","Object Shape":"Other, Unknown","Viewing Distance":"Unknown, N/A","Date Submitted":"05/05/2013 07:32 UTC","Disposition":"Unresolved","Region":"Florida","Source":"MUFON"}