{"Date of the Event":"10/15/2009 06:00 UTC","Source":"MUFON","Country":"United States","Disposition":"Unresolved","divs":["Sighting DetailsI was driving to my house on this day I have been working on my perpetual energy machine thinking and reading about Nicholas tesla and as I was making a left unto east street , my van stop no light or any sound of engine. Alone some kind of energy pull me into a ship I saw some light but I felt a lot of energy like a magnet which pull in. I so a lot of people they all look like us and they communicate with me mentally no verbal, the ship was huge and a lot of machines they was trying to tell me about speed and energy. Well they took me from south Salem, NY to San Francisco, California and they show me a lot of things it seems like months but at the same time they took me back to the same location , I notice the golden bridge, the Panama Canal, the Verrazano bridge then to my van I notice that the time was the same. By the way they took something out of my skull, it looks like my brain. I would like some kind of test to find out what do they took. I have not been the same since. I think that I have the answer to the speed and the energy as we know. I would like to show some one how the ship operated and what kind of engine did I saw.. I feel that I've been watch"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.193999,+-73.518019(47188)&iwloc=A&hl=en\"> mufon case (47188) map </A>","City":"South Salem","Longitude":"-73.518019","Case Number":"47188","Tags":"City","trends":["There have been no other sightings in South Salem","This sighting has never been favorited."],"Summary":"Very intelligent cooperative and compressive","Date Submitted":"05/05/2013 08:23 UTC","Viewing Distance":"20 Feet or Less","Object Shape":"Other","Object Features":"Window(s)","files":["/var/www/straped/mufon/html2text/47188.html.txt","/var/www/straped/mufon/org/47188.html"],"Latitude":"41.193999","Object Flight Path":"Other","Log Number":"US-05052013-0016","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Region":"New York"}