{"Viewing Distance":"Over One Mile","Summary":"Saw UFO aproximately 75 degrees above horizon. Move insreasingly faster to the northeast. Redshift observed.","Longitude":"-86.292069","Tags":"City","Case Number":"47181","Sighting Duration":"00:00:07","files":["/var/www/straped/mufon/html2text/47181.html.txt","/var/www/straped/mufon/org/47181.html"],"City":"Montgomery","map":"<A HREF = \"http://maps.google.com/maps?q=32.375805,+-86.292069(47181)&iwloc=A&hl=en\"> mufon case (47181) map </A>","Weather Factors":"Unknown","Object Flight Path":"Hovering then path","Object Shape":"Fireball, Oval, Teardrop","Object Features":"Unknown","Source":"MUFON","Region":"Alabama","Date Submitted":"05/05/2013 02:21 UTC","divs":["sighting detailsmade a turn onto wares ferry road and was driving over an overpass on i-65. no power lines present. clear skies (observed many stars in my visual path) noticed bright object as i went around a curve in the road. object had a white center increasing yellowish hue to edges with thin red outline. i was traveling at approximately 35 mph. object appeared to be about 2 miles in front of me at 5,000ft agl. object moved to the ne at about 2 o'clock (away from my direction of travel)in a straight line increasing to a dramatic speed (object was rather stationary when first observed) best guess accelerated to over 4,000mph. object turned increasingly red as it moved away and turned completely red at last visible location. visually it was about the size of a basketball when first observed and was the size of a star (pinhead) when visibility was lost. best guess of total distance object traveled before losing visibility is about 15 miles. it either stayed at same altitude or descended slightly. first thought it might have been a reflection off a power line but no lines were present. checked windshield for dirt or something that could have caused an illusion but windshield was clear of any marks\\obstructions. i thought about it for a while and couldn't come up with an explanation hence why i am reporting it. it was an exhilarating observation. my opinion was it was not an aircraft that i know of that could move that fast. there were no lights in the area other than my headlights and stars where i was driving to cause a reflection. i have never before witnessed an event like this."],"Country":"United States","trends":["There have been 659 other sightings in Montgomery","There were no other sightings in Montgomery on or around May 5th 2013"],"Date of the Event":"05/05/2013 04:34 UTC","Disposition":"Unresolved","Log Number":"US-05052013-0009","Latitude":"32.375805"}