{"Object Flight Path":"Straight-line path","Summary":"snake like object came within field of view of eyepiece of telescope","Latitude":"43.396086","Object Shape":"Other","Disposition":"Unresolved","Case Number":"47187","Country":"United States","trends":["There have been 6 other sightings in Lake George","There were no other sightings in Lake George on or around May 1st 2013"],"Viewing Distance":"Unknown","Tags":"City","Object Features":"Other","Longitude":"-73.699402","divs":["sighting detailsmay 1st, 2013 temp: 64deg sky:clear telescope spaceprobe 3 76mm using a 25mm eyepiece for 28x. location: back yard what i was doing: star watching - astronomy. while looking for the owl nebula i saw a bright orange object cross my eyepiece field of view. the object size hard to tell but when first sighted it took up 1\\4 of my eyepiece. the object looked like a snake with a inner bright fire which was orange red in color, it moved like a snake it had s shaped body segments like a snake does when moving and there was a pulsating of the inner light starting from its end going to its head it seemed like the light was its motive force.it passed thru my eyepiece fov in about 1 1\\2 sec. just after it passed i looked up trying to find it with my naked eye but saw nothing of it.the pulsating was vary rapid bottom to top top was head nnw along the bottom of the big dipper. i never thought i would ever see a ufo but to see this puts a new twist to it. have anyone seen anything like this before? i was not going to report this my friends think ive cracked but i have to know i am not alone seening this kind of object."],"City":"Lake George","map":"<A HREF = \"http://maps.google.com/maps?q=43.396086,+-73.699402(47187)&iwloc=A&hl=en\"> mufon case (47187) map </A>","files":["/var/www/straped/mufon/html2text/47187.html.txt","/var/www/straped/mufon/org/47187.html"],"Source":"MUFON","Date Submitted":"05/05/2013 08:07 UTC","Log Number":"US-05052013-0015","Date of the Event":"05/01/2013 11:17 UTC","Region":"New York","Weather Factors":"Unknown","Sighting Duration":"00:00:10"}