{"Date Submitted":"05/05/2013 04:11 UTC","Longitude":"-73.997943","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around May 21st 1975"],"Log Number":"US-05052013-0011","Object Flight Path":"Stationary","Object Shape":"Disc","Source":"MUFON","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/47183.html.txt","/var/www/straped/mufon/org/47183.html"],"Summary":"Was walking to my friends house, we happened to look up to our right at the same time. we saw a saucer shaped object hovering above the street, just slightly higher than the house. it was silent. we ran back to my house. dont remember much after that.","Viewing Distance":"20 Feet or Less","Country":"United States","Date of the Event":"05/21/1975 03:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.718333,+-73.997943(47183)&iwloc=A&hl=en\"> mufon case (47183) map </A>","Case Number":"47183","Tags":"City","Region":"New York","divs":["Sighting DetailsI was about 15 years old, my friend was over my house and we were trying to find something to do.My friend asked me to walk with her to her house,down the block,same street,to ask her dad for some money.So we go,walk down my driveway,make a right.we are in front of the house next to mine when we both look up to the right and there is this saucer like object kind of mettalic looking but not super shiny,hard to explain.the object was completely silent and did not appear to move,it just hovered there sort of over the street next to my neighbors house.The house next door is a ranch and the object appeared only several feet higher than the house. This was a new neighborhood so the trees were still very small.This was in broad daylight and the object was very clear.we saw no lights,but there may have been a window of sorts,just this shape but same color as craft.we were so frightened we ran back to my house hid behind my garage. she looked at me and said \"did you see that\" but i couldnt say a word. no one ever believes me. but i know what i saw.This a true story."],"Weather Factors":"Unknown","Disposition":"Unresolved","City":"New York","Latitude":"40.718333","Object Features":"Window(s)"}