{"files":["/var/www/straped/mufon/html2text/47180.html.txt","/var/www/straped/mufon/org/47180.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=44.892904,+-75.185292(47180)&iwloc=A&hl=en\"> mufon case (47180) map </A>","Sighting Duration":"Undisclosed","Object Features":"Unknown","Tags":"City","trends":["There have been no other sightings in Morrisburg","This sighting has never been favorited."],"Summary":"object would get brighter then seemed to get duller and smaller","Longitude":"-75.185292","Latitude":"44.892904","City":"Morrisburg","Region":"Ontario","Disposition":"Unresolved","Source":"MUFON","Weather Factors":"Unknown","Viewing Distance":"Unknown","Object Flight Path":"Stationary","divs":["Sighting DetailsI was getting ready to go to bed and turned off lights and looked out the window facing North saw lights that did not seem right, watched for 5 minutes and the object did not move, the lights would be random flashing changing different colors from whit to red and the green and blue would happen very seldom. The object looked like it was hovering around Ottawa which is about 45 miles north. I went upstairs to look from the laundry room window. The object when the lights got brighter made it to appear that it was huge. Thought I could make it out but it was confusing as it seemed to be triangular in shape but then when it wasn't as bright it appeared round. I watched for about 10 more minutes and decided to call my neighbour to look at it, he thought at first it might be a satellite, but then changed his mind as it was not moving, then we thought helicopter but the object intensified again in brightness and it appeared the bottom and top enlarged, so not sure what we saw, just know I have never seen anything like it, the lights where totally random. I continued to watch it till about 12:45 am, decided to go to bed and would read or hear about it the morning, I got up about 20 to 30 minutes later and looked out and it was gone, wish I had my camera wife was away and she had it, I am going to look tonight and should have camera. Not say it was ET, or man made it was just weird, I believed that there was about 85 percent chance that there is life out there, but I would give it 5 to 10 percent that there where ET UFO's, not sure now...."],"Log Number":"CA-05052013-0008","Date of the Event":"05/05/2013 12:00 UTC","Date Submitted":"05/05/2013 02:00 UTC","Country":"Canada","Case Number":"47180","Object Shape":"Sphere, Triangle"}