{"Source":"MUFON","Longitude":"-98.488478","Disposition":"Unknown","Country":"United States","Object Shape":"Square, Rectagular, Other","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=29.428572,+-98.488478(4719)&iwloc=A&hl=en\"> mufon case (4719) map </A>","Date Submitted":"04/25/2006 06:30 UTC","Sighting Duration":"Undisclosed","Summary":"A dark oscillating object, roughly rectangular with projecting appendages, was observed drifting slowly southward over the City.","Weather Factors":"Unknown","Object Features":"Appendage(s)","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting Details1. I was in our office on the seventh floor of the GPM North Building, at 800 NW loop 410, San Antonio, Texas, looking out the South facing windows. I was working on a report with another office colleague. It was the afternoon, afterworking hours, probably about 6:30pm, as most other people were already gone from the office. 2. I first noticed the object, it seemed to be moving slowly, or drifting, and because it seemed to have some winglike projections that made me think it might have been a biplane, but moving like a helicopter, being somewhat unusual, I started watching it. 3. A biplane. 4. The object appeared to be dark, or black, roughly or irregularly blocklike in shape with some short appendages like wings which enlarged or disappeared, which seemed to indicate some rotation. You could not tell any surface detail, though in evening sun. It was my impression that it was sized similar to a light plane, and maybe a mile away when first seen, but those are guesses. When first seen, it was only at about a 20-30 degree elevation of view from our seventh floor level, so it seemed that maybe it might have only been up at an altitude of 500 or a thousand feet. It also seemed to cycle irregularly at times slightly larger then slightly smaller in size, which seemed to indicate that it might have been moving in a spiralling pattern as it drifted further away. It was not round, like a balloon would have been, or upside down teardrop shaped, like a weather balloon. 5. Two of us watched the object drift away. We both agreed that we could not identify it as either a plane or helicopter, as it was moving too slow to be a winged aircraft and had no profiles or shapes on the topside where the rotor of a copter would have been. We agreed that we could not twll what it was. We made no report to anyone, nor noticed any in the local papers the next day. 6. The object seemed to stay at a constant altitude, and drift slowly southward. It stayed visible quite awhile as a dark, diminishing dot, before it disappeared in the distance, still to the south. I did afterward notice that a frontal system had blown in, and there was a very strong north wind blowing, in the direction the object was drifting. There might be a possiblility of it being some odd inflatable shape being blown in the wind, however, it seemed to be moving slower than the wind was blowing and that would not explain the apparent motions."],"City":"San Antonio","files":["/var/www/straped/mufon/html2text/4719.html.txt","/var/www/straped/mufon/org/4719.html"],"Log Number":"US-04282006-0001","Case Number":"4719","Object Flight Path":"Undisclosed","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around April 25th 2006"],"Latitude":"29.428572","Date of the Event":"04/25/2006 06:30 UTC","Tags":"City"}