{"Date Submitted":"05/05/2013 08:57 UTC","Disposition":"Unresolved","Sighting Duration":"Undisclosed","trends":["There have been 4 other sightings in Southlake","There were no other sightings in Southlake on or around May 6th 2005"],"Longitude":"-97.206918","divs":["sighting detailsi was sitting on my back patio smoking at around 10 pm . when something caught my eye, i look up to see what looked like the belly of a large transport plane. there was a low ceiling of clouds that night and the exxon station a block away was reflecting a lot of light off this object or i my have not seen it. my patio faces north and this object came over my house heading directly north, paralleling pearson that runs north and south next to my house. as i was watching it i couldn't make out any wings, i figured maybe the darkness was keeping me from seeing them. so i thought maybe i could get a glimpse of the tail section. no couldn't see any tail section either. but i did see a white band or stripe around what appeared to be the end of the object, with some other letters or markings by the band. it was very low for an object this size to be flying, maybe 100-150 ft.? low enough i thought it might scrape the pine thicket where it was headed. trying to rationalize this, i thought drug smugglers coasting in to an airport, because there was absolutely no sound or lights. it was moving at about 30mph, slow but steady, in 15 or 20 seconds it disappered into the darkness. any airport was too far and in the wrong direction. i'am 15 miles from dfw airport which is southeast of me and alliance which is about the same distance to the northwest. wished i had called 9\\11, but i wasn't sure what i saw or what to report."],"files":["/var/www/straped/mufon/html2text/47193.html.txt","/var/www/straped/mufon/org/47193.html"],"Country":"United States","Case Number":"47193","Summary":"Noticed what looked like the belly of large transport going directly over my house at a low altitude.","Object Features":"Insignia, Unknown","Tags":"City","Log Number":"US-05052013-0021","Viewing Distance":"21-100 Feet","Region":"Texas","Date of the Event":"05/06/2005 10:00 UTC","Source":"MUFON","Latitude":"32.91399","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.91399,+-97.206918(47193)&iwloc=A&hl=en\"> mufon case (47193) map </A>","Object Flight Path":"Straight-line path","City":"Southlake","Object Shape":"Unknown"}