{"Weather Factors":"Unknown","Summary":"Friend and I saw bright white orb with tiny red dot attached under and at rear.","Date Submitted":"05/05/2013 09:11 UTC","Log Number":"US-05052013-0023","Country":"United States","City":"Sugar Land","Source":"MUFON","Case Number":"47195","files":["/var/www/straped/mufon/html2text/47195.html.txt","/var/www/straped/mufon/org/47195.html"],"Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Features":"Unknown","Tags":"City","trends":["There have been 7 other sightings in Sugar Land","There were no other sightings in Sugar Land on or around October 13th 2010"],"Object Shape":"Circle, Sphere","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","divs":["Sighting DetailsMy friend and I were at the end of my driveway hanging out when I noticed bright light rays shining through the trees from over the tennis courts moving seemingly slowly. I thought it was the sun at first but quickly dismissed the notion due to the fact that the light was so bright andd white and the sun was mainly below the horizon and the sun sets almost 180 degrees the other way. I thought it was strange because with all of the leaves on the trees light could not normally pass through that easily. It slowly hovered its way towards my neighborhood swimming pool which is across the street from my driveway at a slow speed. Once it was over the pool from my point of view My friend and I could see the orb in plain sight with no obstructions like trees in the way. It went on an arc shaped path all the way down my street. from my swimming pool across my street and then back across finally heading east until the Orb was out of sight. We didn't notice the little red tiny or orb which was maybe one 50th of the size of the larger white bright orb until it already passed the swimming pool and when it was flying away from us. The object seemed to maintain the same altitude throughout the sighting. It was definitely within the altitude height capabilities of a helicopter. My friend whose grandfather was a pilot and is familiar with our human aircrafts like planes and helicopters agreed with me when I ruled out it being either a helicopter or an airplane. The only reason why we concluded this was because of it's unusually quietness for such a low altitude and the pulsating sound it made. We thought it might be some military craft but wondered why they would experiment with such a craft over a heavily populated area. Sure enough about 10 to 15 minutes later at the exact same altitude going in the same direction the orb went, was a fighter type jet like an f16 or such. That is what really made us say ok, now the military is on to it. Afterwords I was kicking myself for not taking my phone out of my pocket to video record it. I was in such awe I didn't think about it. The bizzarre idea that the craft sent some sort of brainwave down to keep us from getting our phones out was also in my mind afterwards but I doubt that was the case. I can't remember the date but I'm sure it was I. 2010."],"Longitude":"-95.595884","Date of the Event":"10/13/2010 12:00 UTC","Latitude":"29.586084","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=29.586084,+-95.595884(47195)&iwloc=A&hl=en\"> mufon case (47195) map </A>"}