{"divs":["Sighting DetailsIt was July 2010 at aproximately 9pm and i was talking to my aunt on the phone while pacing the driveway of the home i was staying at. I turned towards the home i was staying at and saw a orange orb about 15-20 feet in diameter slowly glide powerline level towards the intersection. At first i didn't mention it to my aunt why i do not know and i continued to pace back and forth taking my eyes off the object but everytime i turned around it got closer and then i mentioned it to my aunt but for years i have spoken about being visited by what i call \"OLI\" Other Life form Intelligence. The orb itself seemed to be alive, for months before this sighting i saw red and white dots deep in space. The red dots being faster than the white ones but the white ones having the ability to split. Night after night i witnessed these red and white dots out in space i even heard my mother tell me there was a report on the news about red dots over the great lakes somewhere around the same weeks i was seeing what i was seeing. I no longer saw the red dots after the orange orb came. Back to the orange orb, the orb was about 30 feet from the drive way and didn't shine light on other objects although it was very bright. I turned my back many times but it got my attention when it changed course in an 90 degree angle and slowly went over the trees i didn't bother to follow it because odds are it won't be the last time i see a \"UFO\" and i was right because i've seen them since 2006 and have been visited without my knowning before that. I know they come and go and i know there are more than one species and more than one species has visted me."],"Object Shape":"Sphere","City":"Voorhees Township","Summary":"orange orb that seemed to be alive itself","files":["/var/www/straped/mufon/html2text/47192.html.txt","/var/www/straped/mufon/org/47192.html"],"Viewing Distance":"21-100 Feet","Source":"MUFON","Date Submitted":"05/05/2013 08:43 UTC","Date of the Event":"07/20/2009 09:10 UTC","trends":["There have been no other sightings in Voorhees Township","This sighting has never been favorited."],"Tags":"City","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.864324,+-75.021582(47192)&iwloc=A&hl=en\"> mufon case (47192) map </A>","Region":"New Jersey","Log Number":"US-05052013-0020","Latitude":"39.864324","Weather Factors":"Unknown","Longitude":"-75.021582","Country":"United States","Object Features":"Other","Disposition":"Unresolved","Case Number":"47192","Object Flight Path":"Path with directional change"}