{"Summary":"saw lights nd craft..I flashed my headlights and followed for about 300yards till it stopped and hovered over treetopsAA","divs":["Sighting Detailsas a housekeeper, I just finished working and was on my way home. It was dark out, but just getting dark. I was on the top of Yerry hill rd. outside of woodstock ny, going down the hill, and saw the craft above the trees. I always love to think that helicopters and other craft may see me, so I wave or flash my headlights to see if I get a response...sometimes small planes will tip their wings if they see you..it's fun. the craft was triangular with a v back or tail. The lights caught my eye in the dark, so I started flashing my headlights, thinking it was a government craft, and hoping they'd see me and maybe get a kick out of a civilian saying hi. Then suddenly, it stopped over the trees. I pulled over and kept flashing my headlights.I was thrilled it probably saw me! I was thinking hey hello! this is cool! It hovered over the tree tops for about ten min. before I decided to head home, since I got no flashing lights back, and nothing much happened. At the time my windows were open, and I had shut my car off. I started my car.. headed home..and thought it was probably a new kind of government craft being test driven...nothing more. Years later, when I told a friend about the incident, he asked what kind of sound the craft made, and I was surprised to recall that there was no sound AT ALL. That is what made me think it was a U F O. I had no fear or any uncomfortable feelings about the craft, which looked to be black with red blue and green lights. I never thought to report it,because I just thought it was one of ours. But when I realized it was silent, I was tickled to think it was an alien craft. I was not aware of M U F O N until just a short time ago. SO, that is my story, about my encounter with a suprising visiting craft!"],"Region":"New York","Case Number":"47194","files":["/var/www/straped/mufon/html2text/47194.html.txt","/var/www/straped/mufon/org/47194.html"],"Object Flight Path":"Path then hovering","Date of the Event":"09/12/2000 12:00 UTC","Disposition":"Unresolved","trends":["There has been one other sighting in Woodstock","There were no other sightings in Woodstock on or around September 12th 2000"],"Date Submitted":"05/05/2013 09:06 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.029551,+-74.147032(47194)&iwloc=A&hl=en\"> mufon case (47194) map </A>","Log Number":"US-05052013-0022","Latitude":"42.029551","Object Shape":"Boomerang, Triangle","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Source":"MUFON","Object Features":"None","City":"Woodstock","Viewing Distance":"21-100 Feet","Tags":"City","Country":"United States","Longitude":"-74.147032"}