{"Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Object Flight Path":"Straight-line path","Date Submitted":"05/15/1978 08:10 UTC","Weather Factors":"None","Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=46.864,+-67.998036(4720)&iwloc=A&hl=en\"> mufon case (4720) map </A>","trends":["There have been 2 other sightings in Caribou","There were no other sightings in Caribou on or around May 15th 1978"],"Longitude":"-67.998036","Region":"Maine","Log Number":"US-04282006-0002","Latitude":"46.864","Sighting Duration":"Undisclosed","Country":"United States","Summary":"Circular, Green, Glowing object , size of a dime at arms length. Disappeared over tree line.","Object Features":"None","City":"Caribou","divs":["Sighting DetailsI was out at night near one of the many potato fields in my home town. Most fields are separated by lines of trees. I was near some railroad tracks and was looking at the tree line on a nearby hill. The sun had set and it was dark plus my eyes were acclimated to the darkness, since there are no street lights where I was. Suddenly a green, glowing object, circular in nature, hazy on the edges passed in front of me above the tree line. The object was about the size of a dime held at arms length. It moved slowly and quietly across the top of the tree line and disappeared behind it. The tree line was about a quarter mile away and I don't believe the object may have landed. I didn't pursue it. At the time of the sighting, I was 21 years old and had been in the United States Air Force for 3 years. I was familiar with aircraft lights so I know for certain that this was no airplane or helicopter. It moved too slow to have been a meteorite either. My thoughts at the time were those of excitement and fear. I believe that we have been and are being visited by other life from the cosmos. I had never had an experience like this and haven't since."],"Case Number":"4720","files":["/var/www/straped/mufon/html2text/4720.html.txt","/var/www/straped/mufon/org/4720.html"],"Source":"MUFON","Date of the Event":"05/15/1978 08:10 UTC","Disposition":"Unknown"}