{"Region":"Ohio","Summary":"saw flying saucer move slowly across sky during daylight","Weather Factors":"Unknown","Date Submitted":"05/05/2013 10:49 UTC","Source":"MUFON","Object Flight Path":"Straight-line path","trends":["There have been 82 other sightings in Cincinnati","There were no other sightings in Cincinnati on or around August 1st 1966"],"City":"Cincinnati","map":"<A HREF = \"http://maps.google.com/maps?q=39.08053,+-84.57081(47200)&iwloc=A&hl=en\"> mufon case (47200) map </A>","files":["/var/www/straped/mufon/html2text/47200.html.txt","/var/www/straped/mufon/org/47200.html"],"Disposition":"Unresolved","Log Number":"US-05052013-0028","Object Shape":"Disc","Tags":"City","Longitude":"-84.57081","Country":"United States","Object Features":"Dome, Appendage(s)","Case Number":"47200","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsWhile exiting a house with my older and younger brothers we noticed nobody else outside, no cars, or no breeze. Very strange for our street. We were right across the street from where we lived so we were very familiar with everything. Then we heard what I would say sounded like you cupped your hands over your ears. Then we all saw the flying saucer slowly moving at about 10mph directly over and the houses across the street. It appeared to be brushed dull metal with some glowing lights that raced around the craft which gave it the allusion it was spinning. My older brother, about 7 yrs old ran back inside the house to get our parents while my little brother and I, only 5yrs old, watched in fear trying to hide behind the brick railing on the porch. When the flying saucer was directly across the street it was only about 100 ft away. I could see the bottom very clearly. The lights chases around the perimeter at about one revolution per second. there were three supports under the craft that would clearly be for landing but the craft continued to move at the sa me speed and direction. I could even see the craft had what appeared to be rivits, but much larger, for the landing gear as well as other areas of support for the craft. The craft was about 100ft. in diameter. As soon as the craft passed us there were only four more houses on the street until it ended into a hilly wooded area. Once it passed the final house it seemed to disappear as it accelerated with no sound at a speed that traveled out of sight in the blink of an eye. Immediately after the craft disappeared my brother, mother, as well as many others in the house poured out to see nothing. Ironically, at the same time, the street began to return to normal with cars, kids playing and regular activities. No one saw anything but us three. My mother proceeded to separate us and have us draw a picture of what we saw. She told us we all drew the same thing. I don't remember drawing anything as I was only 5yrs old, but my older brother and I to this day vividly remember what we saw."],"Sighting Duration":"00:01:00","Date of the Event":"08/01/1966 08:00 UTC","Latitude":"39.08053"}