{"map":"<A HREF = \"http://maps.google.com/maps?q=41.78537,+-72.515801(47202)&iwloc=A&hl=en\"> mufon case (47202) map </A>","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Shape":"Star-like, Unknown","Longitude":"-72.515801","Case Number":"47202","Viewing Distance":"501 Feet - 1 Mile","Region":"Connecticut","files":["/var/www/straped/mufon/html2text/47202.html.txt","/var/www/straped/mufon/org/47202.html"],"City":"Manchester","Object Flight Path":"Straight-line path","Country":"United States","Tags":"City","Date Submitted":"05/05/2013 11:26 UTC","Date of the Event":"08/01/2012 09:15 UTC","divs":["Sighting DetailsI've been reluctant to relay this story as there's not much to it, but I assume any details can help your cause. It was just after dusk and my living room Window has a great view of the sky. We live near an airport and see planes flying over all the time. However, this night I mentioned to my fiance, joking at first, that this one light looked odd and was a ufo. I meant nothing of it at first but we both started watching it for a while because it was flying very slow and was large. It kept coming towards oour house, maybe a mile out or so. It was dark so all we could see was a light but it wasn't like any light I've seen on a plane before. It got as close as a field less than a half mile from our house, still visible from our Window By tthis time we were both standing in front of the Window trying to figure out what this thing was. Then suddenly it dropped a green glowing \"blob\" into the field and flew off slightly quicker than its original pace. We heard no noise. That's all we witnessed, but it was pretty freaky and may be nothing at all, but I wanted to let you know. I'd prefer to remain anonymous, but feel free to contact me with any questions."],"Log Number":"US-05052013-0030","Object Features":"Unknown","Source":"MUFON","Weather Factors":"Unknown","trends":["There have been 14 other sightings in Manchester","There were no other sightings in Manchester on or around August 1st 2012"],"Summary":"Ufo flying near our house, dropped glowing green orb","Latitude":"41.78537"}