{"files":["/var/www/straped/mufon/html2text/47208.html.txt","/var/www/straped/mufon/org/47208.html"],"Case Number":"47208","City":"Undisclosed","Summary":"flying object low above the tree tops","Latitude":"44.324824","Country":"United States","Log Number":"US-05062013-0003","Region":"Michigan","Date of the Event":"10/31/1975 12:00 UTC","trends":[],"divs":["Sighting DetailsDriving west on M28 at night, just passed the Hulbert turn-off. There is nothing but darkness between Hulbert and Newberry on M28. I saw 2 white lights in the distance on the south side of M28. My initial thought was that they had build a new gas station with one of those huge signs up and I thought it was awesome because there was no where to stop and get gas at night between the \"Soo\" (Sault Ste. Marie) and Newberry. As I continued driving down the hill after the turn off to Hulbert, I noticed the lights were moving slowing at a diagonal to the road and were coming straight towards me. I realized it was low just above the tree line and huge. I wondered why the other cars didn't notice it that were coming east on M28. I slowed down and it keep gliding towards my car. I tried to wake up my son to witness it but I could not wake him up. He would not waken no matter what I did, shaking him and yelling his name. The object seem to glide, no noise - it came directly over my car and as I looked up at it through the windshield as it crossed over my car - it was so huge, I couldn't see any end of it. I don't know if it was round or oblong but it was unending. I could not see one end or the other. It was black underneath and there was a round cylinder section with sections up the sides. My headlights reflected off the machine - whatever it was. It was just blackness up into that round cylinder part. I just remember saying to myself - begging to it, \"please don't take me with you\" \"I have a son who is sick and I have to get to him\". I feared it would take us. It continued to move right over my car and towards the northeast - towards Hulbert. I was so scared, I drove a 100 miles an hour to Newberry to get away from it. I brought my brother and his friends back with me a little later to see if we could see it. It was no where in sight. I never want to see another object like that. It was not from here. A few years later I did see a black triangle object one night going to Rudyard on a back road. It appeared out of the fog and when the object seemed to notice I saw it, it simply vanished in front of my eyes. It was incredible and I wondered what that was. I had a strong feeling that was some stealth govt object at the time and I still do today. The first one was not of this world. It was too huge and too slow and absolutely quiet as it moved."],"Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","Longitude":"-85.598594","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=44.324824,+-85.598594(47208)&iwloc=A&hl=en\"> mufon case (47208) map </A>","Object Flight Path":"Straight-line path","Tags":"City","Object Features":"Other","Date Submitted":"05/06/2013 01:15 UTC","Source":"MUFON","Weather Factors":"Unknown","Object Shape":"Blimp, Chevron, Cylinder, Diamond, Triangle, Other"}