{"Sighting Duration":"Undisclosed","Date Submitted":"05/06/2013 12:14 UTC","Disposition":"Unresolved","trends":["There has been one other sighting in Mountain View","There were no other sightings in Mountain View on or around August 15th 1968"],"Date of the Event":"08/15/1968 06:30 UTC","Tags":"City","Region":"Missouri","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/47206.html.txt","/var/www/straped/mufon/org/47206.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.983314,+-91.78772(47206)&iwloc=A&hl=en\"> mufon case (47206) map </A>","divs":["sighting detailsit was a late summer afternoon,my cousin,a friend and myself were going into mountain view from the west on u.s.hwy. 60 when i saw something above the trees, about 100\\150 ft.it was an oval shaped black sphere with red pulsing through it. i didn't see any type openings or windows, but there was a silver globe or ball suspened under it, about 10 ft. or so.my cousin pulled off the hwy on to the shoulder of the road. got out of the car and stood by the car. while standing there for 2 or 3 mins. we did not hear any sound and the red pulsed through the black surface. all the sudden the silver ball appox 2 to 3 ft. in dia. disappeared up inside the sphere, i did not see a hole open up, but the ball went inside at that time i yelled at my cousin to get us out of there fast. we got in the car and sped away as fast as possible. the sphere mover along side us for at least 2 or 3 miles. then it made a 90 degree left turn and accended at a 45 degree and was out of sight in just a few seconds. i have more things that have happened to me , but i was alone when they happened. i will make another report soon. i heard they like to take twins, i am not a twin, but i do have two crowns on my head, so i was almost a twin. so i think they are interested in me also. more to come soon. thank you."],"Log Number":"US-05062013-0001","Country":"United States","Case Number":"47206","Longitude":"-91.78772","Summary":"oval shaped sphere hovered over tree 150/200 feet high and 200 feet away,it was black with red pulsing through it also had silver ball hainging inder it.","Source":"MUFON","Object Features":"Patterned Surface, Appendage(s)","Object Shape":"Sphere","Object Flight Path":"Stationary,Path with directional change","Weather Factors":"Unknown","Latitude":"36.983314","City":"Mountain View"}