{"City":"Peoria","Weather Factors":"Unknown","Latitude":"33.623177","Summary":"Very bright, very quick flash of blue ultra violet light.","files":["/var/www/straped/mufon/html2text/47204.html.txt","/var/www/straped/mufon/org/47204.html"],"Object Shape":"Flash","Disposition":"Unresolved","Case Number":"47204","Longitude":"-112.217677","Sighting Duration":"Undisclosed","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.623177,+-112.217677(47204)&iwloc=A&hl=en\"> mufon case (47204) map </A>","Source":"MUFON","Object Features":"None, Other, Unknown","Viewing Distance":"Unknown, N/A","divs":["Sighting DetailsAroud 4:00am while watching a television show I noticed a single flash of blue ultra violet light that came from either out side my bed room window or some how came from in my room itself.. This event is very difficult to explain.. My first reaction was a police officer must have pulled some one over right in front of my house. (You know, how they somtimes will just flash thier lights with out the siren to get the persons attention). Only this had no red light. Only a single blue flash. Im walking down my hall way twords the front door and I can already hear the rumbling of a small diesil motor. (The front door was open that night because we use our evap. cooler). The screan door was shut and locked. Just as I reached the front door a big black Mercedies utility van drove away. This van was huge and looked just like somthing you would see in a Men in Black kind of movie...I knew rite away, rite then, what is really going on with this alien stuff. After all this happend I started to understand things in a 4th dementional kind of way... I hope these words find the rite eyes. They are us. We are them..."],"Object Flight Path":"N/A","trends":["There have been 13 other sightings in Peoria","There were no other sightings in Peoria on or around January 1st 2013"],"Region":"Arizona","Date Submitted":"05/05/2013 11:41 UTC","Country":"United States","Log Number":"US-05052013-0032","Date of the Event":"01/01/2013 12:00 UTC"}