{"Sighting Duration":"Undisclosed","City":"Seattle","Log Number":"US-05062013-0009","Date Submitted":"05/06/2013 07:21 UTC","Tags":"City","Source":"MUFON","Latitude":"47.720464","divs":["Sighting DetailsMy boyfriend and I are both night-owls. We stepped out onto our East facing front steps to smoke, and I, incidentally, had my Macaw parrot on my shoulder. I was facing East, when we both heard a very loud ground shaking boom. As we both looked in the direction of the boom, (East) there was another lesser boom. They were milliseconds apart, but the second was quieter, kind of like a Boom, boom! Simultaneously a bright white fireball zoomed all the way from the eastern horizon, flew overhead, and disappeared over our house top going West, leaving a whitish trail which momentarily was visible from beginning to end, or, horizon to horizon. The space of time from hearing the booms, to the fireball passing over our heads was about 2.5 seconds. It was spectacular. I would compare the intesity of the first boom, which was the louder of the two, to being within 4 or 5 blocks of a large professional grade firework going off. BaBOOOM! My bird's normal reaction to something frightening is not to fly away, but to dig in with his claws, hunker down, and try to climb under any nook or craw in my clothing, which he did. I did have to immediately reaasure him, as he sensed my excitement and uncertainty of what had just transpired. This ranks way up there, with me, as in the top ten of very unusual or spectacular sitings I have ever had in my 60 years of life. One thing that distinguished this from any other fireball type sighting I have ever had, was that it was pure white, and I thought I caught a glimpse of orange. Other firealls were blue, bluegreen and green with flashes of orange, yellow or white coming off them. Only shooting stars which were much smaller have ever appeared all white, or blue-white. This was so close (or low) as to cause a sonic boom. After starting this report, I also made a non-emergency call to 911, both to report, and to find out if anyone else had reported the boom or the sighting."],"Weather Factors":"Unknown","Object Features":"Other","Disposition":"Unresolved","Summary":"Heard sonic boom, then white fireball passes over leaving trail","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=47.720464,+-122.291576(47215)&iwloc=A&hl=en\"> mufon case (47215) map </A>","files":["/var/www/straped/mufon/html2text/47215.html.txt","/var/www/straped/mufon/org/47215.html"],"Viewing Distance":"Over One Mile","Object Shape":"Fireball","Date of the Event":"05/06/2013 02:38 UTC","Country":"United States","Case Number":"47215","trends":["There have been 110 other sightings in Seattle","There were no other sightings in Seattle on or around May 6th 2013"],"Longitude":"-122.291576","Region":"Washington"}