{"Case Number":"4721","City":"Dallas","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.808065,+-96.763463(4721)&iwloc=A&hl=en\"> mufon case (4721) map </A>","divs":["Sighting DetailsI was driving along Royal Lane, approximately 1.5 miles east of Interstate 35E in the Dallas Texas area when I noticed an object slow to a stop above a residential area -- at my 11 o'clock position. At first, I thought this object was a police helicopter, but as I approached I could make out a arrow headed object with a thin tail. It is overcast tonight which helped, as the dull-grayish clouds help accent the black profile of the craft. It was difficult to distinguish the object's orientation, whether I was observing the bottom, side, etc, as the object was unlike anything I've seen before. It resembled the \"triangular\" shaped craft seen in ufo documentaries, however this craft was smaller, appearing approximately 40 ft from point to point. The object had a slow 20-30 mph northern trajectory, as I approached it (while driving) it stopped and hovered, then moved in a southern direction as I passed under it. This is a populated, highly trafficed area. The object was approximately 250 ft. in the air, made no sound. As I passed under the object I lost site of it. Also noteable were three bright lights in tight triangle formation towards the front of the arrowhead, with dimmer white blinking lights at each tip of the arrowhead and tail structure."],"files":["/var/www/straped/mufon/html2text/4721.html.txt","/var/www/straped/mufon/org/4721.html"],"Country":"United States","Region":"Texas","Sighting Duration":"Undisclosed","Latitude":"32.808065","Disposition":"Unknown","Log Number":"US-04282006-0003","Object Features":"Undisclosed","Source":"MUFON","Date Submitted":"04/28/2006 09:18 UTC","Longitude":"-96.763463","Object Shape":"Triangle","trends":["There have been 116 other sightings in Dallas","There were no other sightings in Dallas on or around April 28th 2006"],"Weather Factors":"Unknown","Date of the Event":"04/28/2006 09:18 UTC","Object Flight Path":"Undisclosed","Tags":"City","Summary":"triangular shaped \"arrow head with a tail\" object observed"}