{"Sighting Duration":"Undisclosed","divs":["Sighting Details I was in the Army at Ft. Irwin California in the Mojave Desert. It was around 2 AM in the morning. Was as clear of a sky as you could ask for. A friend and I were on Guard duty as everyone was sleeping. We were talking just doing our shift. We were not far from a mountain when we seen this object following the ridge line of the top of the mountain it was not moving fast at this point. The object was casting a solid light downward that was in a shape of a upside down cone. Meaning it was very narrow to wider. This object we just watched it go the length of the mountain at the top shining the light down. It made absolutely no noise at all. I have personally been on and seen most all of the military aircraft while in the military. It was not a military aircraft or any aircraft myself or my friend had ever seen. After the craft got to the end of the mountain top it moved very swiftly to the left or East. Maybe a mile or so from the mountain. This was just over our head maybe I would guess 1000 to 1500 feet above us. Light still shining downward. Then ,in an instant, the light reversed to the top of the aircraft shining upward. All at the same time in that same instant (bare with me it is difficult to describe what happened so you can visualize it)the light at that instant was shining in a cone shape making a not so big ring circle. The craft just ascended upward at a speed so fast it was gone instantly. When it ascended and instantly gone it made a very loud boom. Then the amazing part of this with the light. This is not easy to describe. Craft ascends in direction of the ring of light goes through the ring very loud boom and now the ring of light gets so bright it is like its day. While that is going on the Ring is expanding exponentially from the small ring of light to getting bigger and bigger at same time getting less bright as it gets bigger until it dissipates into nothing From what my friend and I could see from what I remember about it. The craft was kind of chevron shaped. It was a very interesting experience. My friend and I made the decision not to talk about it to anyone. As we were not sure how the military would react to us. I was in Artillery and I don't know what the protocol is when someone in the military would report such an event. Honestly I don't care what anyone thinks or believes me or not I know what I seen. My friend and I did not want to take the chance and find out. I am very sure other people had seen it as we were not the only ones out their in the desert. I had thought about reporting this story to MUFON a long time ago. I just felt like someone else should know. I would like to know if anyone has ever seen a similar event. Especially with the light."],"Tags":"City","Disposition":"Unresolved","Latitude":"35.26643","Region":"California","trends":["There has been one other sighting in Fort Irwin","There were no other sightings in Fort Irwin on or around June 15th 1994"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.26643,+-116.678655(47212)&iwloc=A&hl=en\"> mufon case (47212) map </A>","Longitude":"-116.678655","Object Features":"None","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"06/15/1994 02:00 UTC","Log Number":"US-05062013-0006","Object Shape":"Chevron","Summary":"Out in the desert with absolutly no light but the stars. Very clear night no clouds at all.","Source":"MUFON","Case Number":"47212","Weather Factors":"Unknown","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Date Submitted":"05/06/2013 04:22 UTC","City":"Fort Irwin","files":["/var/www/straped/mufon/html2text/47212.html.txt","/var/www/straped/mufon/org/47212.html"]}