{"Latitude":"32.448763","files":["/var/www/straped/mufon/html2text/47221.html.txt","/var/www/straped/mufon/org/47221.html"],"Object Features":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.448763,+-97.787917(47221)&iwloc=A&hl=en\"> mufon case (47221) map </A>","Sighting Duration":"Undisclosed","Country":"United States","Disposition":"Unresolved","Summary":"Unidentified colorful object erratically flying in the sky. No sound was emittng from the object.","Date of the Event":"01/17/2013 07:18 UTC","City":"Granbury","Object Flight Path":"Stationary,Path with directional change","trends":["There have been 11 other sightings in Granbury","There were no other sightings in Granbury on or around January 17th 2013","This sighting has been favorited 1 time.",""],"Tags":"City","Log Number":"US-05062013-0015","divs":["sighting detailswalking out to my car after work. (parking lot at the waterview senior living center next to the hilton. there was a red light blinking in the sky and it caught my eye. i first thought the object was an airplane but it was quiet and it kept changing colors. the object was triangular\\boomerang shape that seemed to have 3 distinct sides with a hollow center. it's motions were up and down and side to side (not necessarily in that order). it was very fast. i was perplexed as to what it was and became somewhat giddy with an adrenaline rush when i realized i could not identfy the object. i lost sight of the object when it just disappeared. one second it was moving erratically and changing colors, the next it was just gone. i got in my car and went home. *note* this detailed description was just spoken to me by my girlfriend karen. she is the one who witnessed the event and took the cell phone video. she shared it with me and i asked if i could share this with your site."],"Case Number":"47221","Date Submitted":"05/06/2013 04:43 UTC","Viewing Distance":"Unknown","Region":"Texas","Longitude":"-97.787917","Object Shape":"Boomerang, Triangle","Weather Factors":"Unknown"}