{"divs":["Sighting DetailsI HAD JUST RETURNED HOME FROM WORK, AT OR ABOUT MIDNIGHT, I PULLED INTO THE DRIVEWAY AND TURNED TO LOOK UP INTO THE SKY, I SAW A VERY BRIGHT STAR SHAKING AND SHIIMMERING VERY FAR AND HIGH, I HAD TO TURN AWAY FROM THE HOUSE TO SEE IT. I WONDERED WHAT KIND OF STAR WAS SO VERY BRIGHT AND WHAT WAS MAKING IT SHAKE SO, AS I TOOK A STEP TO GO INTO THE HOUSE I TURNED AGAIN AND IT WAS IN LINE WITH WAY I WAS TURNED... I STAYED AND STARRED AND TALKED TO IT... LIKE WHAT ARE YOU? WHAT IS IT YOU ARE WANTING? WHAT CAN I DO TO HELP YOU? ARE YOU A UFO?.... AFTER A FEW MINUTES I SAID TO THE WHAT-EVER.. WELL, I CAN'T STAY OUT HERE ALL NIGHT, I AM GOING INTO THE HOUSE, SO LONG... AND RIGHT BEFORE MY EYES THE BRIGHT SHIMMERING STAR LIKE OBJECT (IT WAS WAY, WAY UP INTO THE HEAVENS) JUST DREW BACK LIKE IT WAS BEING SUCKED INTO A STRAW AND WENT UP INTO AN AREA THAT HAD BASICALY NO VISIBLE STARS PRESENT.. I SAID WOW AND SAID GOOD NIGHT AND WENT INTO THE HOUSE AND GOT READY FOR BED AND WENT BACK OUT AND IT WAS STILL THERE, SO I WENT TO BED."],"Region":"Arkansas","map":"<A HREF = \"http://maps.google.com/maps?q=34.86982,+-92.100326(4722)&iwloc=A&hl=en\"> mufon case (4722) map </A>","Disposition":"Unknown","trends":["There have been 2 other sightings in Jacksonville","There were no other sightings in Jacksonville on or around September 25th 1988"],"Viewing Distance":"Unknown","City":"Jacksonville","Date Submitted":"09/25/1988 12:00 UTC","Object Flight Path":"Straight-line path","Case Number":"4722","Latitude":"34.86982","Summary":"I LOOKED UP INTO THE SKY AND SAW A STAR SHIMMERING/ SHAKING, VERY BRIGHT WITH-IN A MINUTE IT WAS ABOVE ME","files":["/var/www/straped/mufon/html2text/4722.html.txt","/var/www/straped/mufon/org/4722.html"],"Longitude":"-92.100326","Weather Factors":"None","Sighting Duration":"Undisclosed","Country":"United States","Object Features":"Unknown","Object Shape":"Star-like","Source":"MUFON","Log Number":"US-04292006-0001","Date of the Event":"09/25/1988 12:00 UTC","Tags":"City"}