{"files":["/var/www/straped/mufon/html2text/47225.html.txt","/var/www/straped/mufon/org/47225.html"],"Log Number":"US-05062013-0018","Country":"United States","Object Features":"Other","Source":"MUFON","Date of the Event":"04/04/1969 09:00 UTC","Weather Factors":"Unknown","City":"Waterbury","Region":"Connecticut","Longitude":"-73.048888","Object Flight Path":"Stationary","divs":["Sighting DetailsIt was 1969, dark and I had just finished chores after dinner. I realized I had forgotten to take in my laundry from a third floor porch pulley line. I stepped out to take in my clothes and did not at first take notice, but upon reaching out for the line, I could see the sky clearly out of sink. I visualized the sky from the tops of trees that edged our property. I was shaken really thinking the Russians had invaded. I ran in the house and checked my new baby boy and sat still for a minute or so wondering what I had just seen. I stepped back out for a peek to comfort myself having told myself I had experience Northern Lights. I am from Maine and had seen Norther lights and this was nothing like those at all. I was so scared, I left my clothing on the line, went back into the house and locked the door. I turned the news on to see if something had taken place that may have been observed by others and reported. Absolutely nothing was mentioned out of the ordinary. Surely, had we had a display of northern lights it would have been mentioned in the media. I did ask family and friends if they saw the lights and no one witnessed the display. I never drank or did drugs, I was not a nervous person, but this sure did confuse me. I was afraid to make any mention of it after that until viewing a documentary in 2013 about alien mysteries and the subject of the Orange light that appeared to a man driving one evening during 1969. Though I never had an answer for what I had witnessed, the explanation of his sighting refreshed my memory and gave me closure just in knowing I was not alone experiencing this. I have not had any such sightings since, but I would love to have it debunked!"],"Summary":"NOT AURORA,SOFT ORANGE GLOW SOMEWHAT BRIGHTER AT TREETOP HORIZON AREA","Case Number":"47225","Viewing Distance":"Over 1 Mile, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.567174,+-73.048888(47225)&iwloc=A&hl=en\"> mufon case (47225) map </A>","Disposition":"Unresolved","trends":["There have been 15 other sightings in Waterbury","There were no other sightings in Waterbury on or around April 4th 1969"],"Latitude":"41.567174","Tags":"City","Sighting Duration":"Undisclosed","Object Shape":"Fireball, Other","Date Submitted":"05/06/2013 08:23 UTC"}