{"Weather Factors":"Unknown","Log Number":"DK-05072013-0014","Source":"MUFON","Object Features":"Unknown","Object Flight Path":"Straight-line path","trends":["There have been no other sightings in Aalborg","This sighting has never been favorited."],"Case Number":"47247","Summary":"Moved as a starlike dot from South to North. During straight line flight it went really bright round light. Then went back to small dot as it was.","Date of the Event":"05/08/2013 12:00 UTC","Object Shape":"Circle, Flash, Sphere, Star-like","Region":"North Denmark Region","files":["/var/www/straped/mufon/html2text/47247.html.txt","/var/www/straped/mufon/org/47247.html"],"City":"Aalborg","Longitude":"9.924731","Disposition":"Unresolved","Date Submitted":"05/07/2013 07:12 UTC","divs":["Sighting DetailsI've seen a lot of movements in the sky lately. In Aalborg, Denmark. This one was the most affective. The most memorable out of all the sightings I've experienced. That is why this is my very first report also. Previously I've just seen flying orbs and huge stationary flashes in the sky. Like signaling that they are out there. 1) I was sitting in front of my apartment building waiting for some UFO sighting or movement. 2) It moved with constant speed and then went slowly really, really bright. 3) I knew instantly that this must be UFO (I've been waiting for this kind of sighting) 4) It's size was at first like normal (like average star) and its brightness the same. It moved with constant speed and during its flight it started to get bigger and brighter. Its brightness can be compared to full moon in a clear night sky. It was white. Then it went slowly back to its previous size. It didn't change or lose its direction or path. 5) I was by myself \"WOW\", \"cool\" and literally giggling. Totally amazed because this was what I've wanted to witness for a long, long time. 6) It appeared out of nowhere. Had its flight. Went back to its previous size and disappeared."],"Latitude":"57.034051","Sighting Duration":"00:00:20","Country":"Denmark","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=57.034051,+9.924731(47247)&iwloc=A&hl=en\"> mufon case (47247) map </A>","Viewing Distance":"Unknown"}