{"Object Shape":"Cylinder","Source":"MUFON","Date of the Event":"05/07/2013 09:40 UTC","Weather Factors":"Unknown","Tags":"City","Object Flight Path":"Straight-line path","Date Submitted":"05/08/2013 12:36 UTC","trends":["There have been 5 other sightings in Coon Rapids","There were no other sightings in Coon Rapids on or around May 7th 2013"],"Viewing Distance":"20 Feet or Less","map":"<A HREF = \"http://maps.google.com/maps?q=45.178649,+-93.291349(47256)&iwloc=A&hl=en\"> mufon case (47256) map </A>","Country":"United States","Object Features":"Insignia","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI bought an egg Mcmuffin and cup of coffee at the McDonalds on Foley and Northdale Blvds in Coon Rapids MN at about 9:15 AM on May 7th 2013. I traveled west on Northdale Blvd looking for a place to enjoy my breakfast. I decided to relax at Sand Creek Park in Coon Rapids. I parked on the west side of the park between the ball field and the railroad tracks. After I finished My sandwich and coffee at about 9:35 I stepped out of my car. Looking up to the SW I saw a white cylinder at approx. 5 miles out at an altitude of approx. 10,0000 ft. moving away from me at a moderate speed on a straight line. I got my camera out and captured a fleeting glimps on video before it was too far away. I was disappointed that I didn't get more of it. As I stood there a minute thinking I missed it I saw another Cylinder in the SW sky moving away at same speed along the same line. I didn't get this one on video. Now looking North West about three miles out I saw a third Cylinder moving at the same speed along the same line. I caught this one on video but I was very excited and my camera is very crappy. The Cylinders were about the size of a commercial airline fuselage without wings and tail, rounded on both ends with what appeared to be a black band around the middle I saw a Park employee and called him over. We looked up and saw a fourth White Cylinder moving at same speed along the same line. In all my excitement and poor camera work I only caught a glimps of the fourth Cylinder on video. It too moved away at the same speed along the same line. No more cylinders appeared."],"Region":"Minnesota","Summary":"saw 4 white cylinder ufo's with black band traveling nw to sw approx 2 min apart traveling at same speed along the same line","Longitude":"-93.291349","Disposition":"Unresolved","Case Number":"47256","Latitude":"45.178649","files":["/var/www/straped/mufon/html2text/47256.html.txt","/var/www/straped/mufon/org/47256.html"],"City":"Coon Rapids","Log Number":"US-05082013-0004"}