{"divs":["Sighting DetailsWas NCOIC of a guard shift. Recieved a report from a guard on duty of lights in formation to the South of us moving towards us slowly. Called up to higher headquarters. No military or civillian air traffic in area. Went out side observed 10 lights slightly brighter than stars in a triangle pattern moving towards our position approx 10km south of us. They were at about 50000 feet altitude heading 030. When they reached overhead of our position they stopped and moved into a tight circular pattern. We monitored them with NVGs and infrared scopes. The IR picked up a circular or spherical shape. The NVG showed they were indeed closer than the stars and much brighter. Binoculars showed a more spherical shape yet quite luminescent. They stayed in the circular pattern for 1-2 minutes before three headed at about 210 at a high rate of speed as to intercept something. The remaining 7 began patrolling the area headed in different directions for approx 5 min. After that all 7 scattered and left at a high rate of speed. That is when we lost contact. Higher advised that radar in Tallil never picked up anything. Nobody was able to make positive ID on what these objects were. 2 other soldiers did witness the event in its entirety. Another soldier witnessed part of the event, but was mainly manning a radio."],"Summary":"Lights moving in formations","Sighting Duration":"Undisclosed","Weather Factors":"Windy","Latitude":"31.989167","Object Flight Path":"Hovering then path,Path then hovering","Viewing Distance":"Over One Mile","Case Number":"4725","map":"<A HREF = \"http://maps.google.com/maps?q=31.989167,+44.924722(4725)&iwloc=A&hl=en\"> mufon case (4725) map </A>","City":"Al Diwaniyah","files":["/var/www/straped/mufon/html2text/4725.html.txt","/var/www/straped/mufon/org/4725.html"],"Source":"MUFON","Log Number":"IQ-04292006-0004","Region":"Al-Qādisiyyah","Country":"Iraq","Date of the Event":"06/15/2005 03:00 UTC","Tags":"City","Object Features":"None","Longitude":"44.924722","Date Submitted":"06/15/2005 03:00 UTC","Disposition":"Unresolved","Object Shape":"Sphere, Star-like","trends":["There have been no other sightings in Al Diwaniyah","This sighting has never been favorited."]}