{"Country":"United States","Object Flight Path":"Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=33.462026,+-94.06584(47251)&iwloc=A&hl=en\"> mufon case (47251) map </A>","Viewing Distance":"Over One Mile","Tags":"City","Longitude":"-94.06584","trends":["There have been 9 other sightings in Texarkana","There were no other sightings in Texarkana on or around May 7th 2013"],"City":"Texarkana","Log Number":"US-05072013-0018","Date of the Event":"05/07/2013 09:38 UTC","Case Number":"47251","divs":["sighting detailsi was outside smoking with my husband and i noticed the blue green light in the sky coming down as if it was a plane landing, then i notice it go upward in the same place it just came down, then it moved sideways and down, in a circular motion. my husband is a skeptic and i asked him what that was since he has an explanation for everything. he began watching the light move around in opposite directions and circular movements when it went below the tree line. we saw the object hovering around the treeline and then it disappeared where we could not see it anymore. i asked him if he thought it was a plane or a helicopter and he said no. the skeptic admits it was a ufo. i don't know if the object landed or what happened after it went out of view, we observed it in the same area of the sky for about five minutes (the whole time i smoked a cigarette i saw it). as soon as i saw the object i knew it was not a plane, a plane at night has flashing lights and red\\blue this was a blue green pretty solid but pulsated a bit but it was constantly visible (color). note: i thought the light was green and my husband thought it was blue."],"Date Submitted":"05/07/2013 11:12 UTC","Source":"MUFON","Object Shape":"Circle","Weather Factors":"Unknown","Summary":"blue green UFO changing multiple directions/hovering","files":["/var/www/straped/mufon/html2text/47251.html.txt","/var/www/straped/mufon/org/47251.html"],"Object Features":"Unknown","Sighting Duration":"Undisclosed","Latitude":"33.462026","Region":"Texas","Disposition":"Unresolved"}