{"Date Submitted":"05/08/2013 02:19 UTC","Viewing Distance":"Over 1 Mile, Unknown","Summary":"white glowing line that moved extremely fast leaving trail behind","Region":"New Jersey","City":"Fort Lee","Object Shape":"Bullet, Missile","Log Number":"US-05082013-0010","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=40.857533,+-73.966348(47262)&iwloc=A&hl=en\"> mufon case (47262) map </A>","Source":"MUFON","Latitude":"40.857533","Object Flight Path":"Straight-line path","Country":"United States","Weather Factors":"Unknown","Date of the Event":"05/02/2013 03:00 UTC","Case Number":"47262","Tags":"City","Sighting Duration":"Undisclosed","trends":["There has been one other sighting in Fort Lee","There were no other sightings in Fort Lee on or around May 2nd 2013"],"Object Features":"Other","files":["/var/www/straped/mufon/html2text/47262.html.txt","/var/www/straped/mufon/org/47262.html"],"Longitude":"-73.966348","divs":["Sighting DetailsIt was about 3am and I was traveling home from work. I was slowing down as I exited off of RT 95 in NJ, onto US1 towards Fort Lee, NJ. As I slowed down on the exit ramp- I glanced up at the sky noting how clear and blue it was. I was even smiling, as I noted how BLUE the sky was- it was a moment I will NEVER, EVER FORGET! My head was looking to the EXTREME left out of the front windshield- when I saw a short white glowing line in the EXTREME distance. The white line, which resembled what I can best describe as a ''pong paddle'' was moving so fast that in the short period of 7 seconds approx. ; caused my head to move from the left of the windshield to the far right. While the 'pong paddle' moved it had a bit of a pulsating light like flash, that never fully went dark- just a fast pulse like; leaving a trail of smaller white dots that would disappear after split seconds. I thought at first that this must be a rocket traveling and leaving a trail in its wake... but this thing was so fast to cause my head to go from far left to far right of the windshield, in only seven seconds or so. The object was moving the entire time fast. It did not slow down at the end, it just disappeared. It moved in what seemed to be a straight light slightly angled up- but more or less, it was traveling the path of a Plane on the horizon. That type of normal, across the horizon, flight path that we see everyday. However, I was overcome with the strange feeling that I did not know what I was looking at. I tried piecing it together over the next few days- and kept concluding that this object, in my view, was unidentifiable. Nothing has ever moved that fast in the night sky. Nothing I have ever seen or heard of, has every resembled the details of that object I saw in the night sky. It was weird. shrug- real weird."]}