{"Latitude":"45.529226","Log Number":"US-05082013-0011","Region":"Oregon","Viewing Distance":"Unknown","Date of the Event":"05/06/2013 09:15 UTC","Sighting Duration":"Undisclosed","divs":["Sighting DetailsForest Grove, Oregon, May 6, 2013, approx. 9:15pm local time. I was taking an evening walk in a wide open area after sundown when I noticed a slowly moving light in the sky at about 45 degrees above the horizon to the northwest. At first I thought it was the headlight of a private aircraft a few thousand feet in the air--but it had a strange color. After a minute or so, I realized it probably was not a normal aircraft. There were no red or green nav lights, nor any flashing lights; just a bright, steady coppery colored light. It was close to the color of a high pressure sodium vapor street light (NOT the low pressure, very yellow variety), but less pink and more coppery, and it appeared similar in size to Venus, and somewhat brighter, again much like an airplane. It traveled in a steady, straight line from northwest, to nearly overhead, just below the Big Dipper's tail, and continued to the southeast. There was no sound that I could hear. Once it passed overhead, the light became somewhat flickery (like a flame), but of the same color and intensity. It continued to the southwest until it disappeared behind some trees at about 10 degrees above the horizon. The event lasted about 4 to 5 minutes from when I first observed it. I am inclined to think it may have been a rocket, or a spacecraft re-entering the atmosphere. I checked the news and Googled for other witnesses, but found nothing. According to various spacecraft sighting prediction websites, it could not have been this ISS, nor an Iridium flare. There was apparently a couple of rockets fired by NASA (Equitorial Vortex Experiment) around that time from the Marshall Islands. But it seems like those would have been travelling a different direction than I observed. The object I saw would have been on an Alaska-to-Arizona sort of track, which is probably approximately perpendicular to the track a rocket would take originating from the Marshall Islands. I'm wondering if anyone else saw this, or has any information about what it might be."],"Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=45.529226,+-123.102183(47263)&iwloc=A&hl=en\"> mufon case (47263) map </A>","Object Shape":"Fireball, Star-like","Weather Factors":"Unknown","Object Features":"Unknown","Date Submitted":"05/08/2013 02:28 UTC","Disposition":"Unresolved","trends":["There have been 2 other sightings in Forest Grove","There were no other sightings in Forest Grove on or around May 6th 2013"],"City":"Forest Grove","Case Number":"47263","Country":"United States","Tags":"City","Longitude":"-123.102183","files":["/var/www/straped/mufon/html2text/47263.html.txt","/var/www/straped/mufon/org/47263.html"],"Source":"MUFON","Summary":"Possible rocket or spacecraft reentry"}