{"Case Number":"47277","Region":"Washington","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=47.56732,+-122.632936(47277)&iwloc=A&hl=en\"> mufon case (47277) map </A>","Tags":"City","Date of the Event":"07/13/1956 08:18 UTC","Summary":"saucer shaped 80ft across stilth black large plasma ring on bottom of craft no sound.","trends":["There have been 19 other sightings in Bremerton","There were no other sightings in Bremerton on or around July 13th 1956"],"Latitude":"47.56732","Log Number":"US-05082013-0023","Object Flight Path":"Stationary,Hovering then path,Path then hovering","Weather Factors":"Unknown","Country":"United States","Object Features":"Other","Sighting Duration":"Undisclosed","Object Shape":"Disc","Longitude":"-122.632936","divs":["Sighting DetailsIt all started in the summer of 1956. I just went side to play. I was the side of the house and I just happen to look up and see this large silent craft moving just at tree top level not making a sound .it was moving towards me slowly then stopped just over me. On the bottom of the craft there was a large plasma looking ring. It was very bright , and moved like liqiud in a clockwise direction.so I just looked up and started at it. Then while I looked up at the craft I started getting lighter. As I started to lift up I thought it was neet until I was about 10ft or so in the airtheni began to panic. Say please don, t drop me .then I passed out I guess, the next thing I rremember I am laying on this table , or it looked liked like one. There was movement all around me but everthing seem blurry. There no color to anything it was all gray. The creatures around me were a grayish color but thats all remember. There was this metal arm that came toward my face like they were going to put something in me I said to them that that would hurt me and then I heard a voice say it won, t hurt or I thought I heard it my head maybe not sure. Then all I remember was that iwas back on the ground, by the house so I went into the house I guessm by the way there was no beam of light when I was lifted up. The next morning it s Sunday and I was sick all ."],"files":["/var/www/straped/mufon/html2text/47277.html.txt","/var/www/straped/mufon/org/47277.html"],"Viewing Distance":"21-100 Feet","City":"Bremerton","Disposition":"Unresolved","Date Submitted":"05/08/2013 10:03 UTC"}