{"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/47274.html.txt","/var/www/straped/mufon/org/47274.html"],"Object Shape":"Circle, Disc, Triangle, Unknown","trends":["There have been no other sightings in Key Biscayne","This sighting has never been favorited."],"Date Submitted":"05/08/2013 06:43 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=25.674456,+-80.177913(47274)&iwloc=A&hl=en\"> mufon case (47274) map </A>","Tags":"City","Source":"MUFON","Country":"United States","divs":["Sighting DetailsMe and two close friends purchased a video game midnight release November 7, 2008. We played from 1:00 am to about 5:30 am. At that time, we decided to get some late night snacks at CVS and call it a night. We left my friend's condominium in his golf cart and headed to CVS. We take the street behind CVS and found ourselves interested in what we saw. Far away, high above in the sky was what looked like an ordinary airplane. But something about it was strange enough for us to park the golf cart in the middle of the street and get out of it. My two close friends and myself point at the object and find ourselves dazed. When we first saw the object far away it had three lights, two white lights on each end and one red light in the middle. Next thing we see is the object turn around in our direction, kind of like a giant U-turn. The object went from about a mile high in the sky to as close as approximately 50 feet above us, and it shut its lights off when it was near us. It was tough to make out the size and shape of the object but it was pitch black, possibly triangular, disc-shaped, or other flat like shapes. It was about half the size of an average airplane and made absolutely no sound, as if it was not even there. We asked each other \"is it going to crash\" because it was so low to the ground and flying in such a strange patter, it looked like it was falling up and down and catching itself in the air. The object was bobbing up and down and looked like it was flying slanted also. Next, it stayed hovering over a house on that street. We looked at the object for a while hovering over the top of someones home. We left the scene and finally went inside CVS. We were in the store asking each other what just happened and what was it we witnessed. I remember saying to my friends that while we were observing the object, I felt this eerie feeling in my gut that whatever it was we were seeing, did not want us to see it. My two friends said they felt the same things durning the encounter. After about twenty minutes of being inside CVS, we head back to see if the object was still there, and it was, still hovering over the same house. I said to my friend who was driving to speed up to the street behind the house that the object seemed to be hovering over to try and get a closer look. It took us one minute or less to get behind that street, we looked up, and the it was gone. The object took off as we went to go get a closer look. I have seen many things fly in my life but nothing that first of all made no noise whatsoever and flies in such strange motions. After witnessing a UFO I began to do research and found a lot of similarities between my encounter and those of the rest of the world."],"Region":"Florida","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Flight Path":"Path with directional change,Path then hovering","Date of the Event":"11/07/2008 05:36 UTC","Latitude":"25.674456","Case Number":"47274","Summary":"UFO sighting in Key Biscayne, one object.","Log Number":"US-05082013-0021","City":"Key Biscayne","Longitude":"-80.177913","Viewing Distance":"21-100 Feet, Over 1 Mile"}