{"Weather Factors":"Unknown","City":"Prescott Valley","Object Shape":"Cylinder","Object Features":"Appendage(s)","Date Submitted":"05/08/2013 08:51 UTC","Longitude":"-112.332197","divs":["Sighting DetailsI was in my back yard bird watching. An aircraft from a nearby airport was approaching my location. It was traveling from West to East at a fairly low altitude. I looked at the plane with my binoculars to see it up close when into my field of view came an object that was traveling in the opposite direction, East to West. I quit looking at the plane and followed the object and refocused the binoculars to get a better view. The object was cigar shaped, white in color and had two pairs of protrusions on each side that were short. They were not wings. There was no sound, no vapor trail and the object was evidently very high and was moving at a terrific speed. Suddenly it simply disappeared. Vanished in an instant like shutting off a light bulb. There were no clouds and there were no obstructions. The object simply vanished. The plane that I had been observing had by this time passed on. There was no interaction between the airplane and the object. The object was too high in altitude. The plane was much lower and flying in the opposite direction. The time of the observation of the object was about 6 seconds, then it vanished. My reaction was astonishment at the speed at which the object flew and the fact that it simply vanished so suddenly. Frankly it was creepy to realize what I had seen and what the object had done. The observation was admittedly short, but, what I saw is accurately described. I am familiar with various aircraft and this was definitely no airplane and was not a bird."],"Latitude":"34.691079","Viewing Distance":"Unknown","Source":"MUFON","Sighting Duration":"00:00:06","Country":"United States","Tags":"City","Date of the Event":"05/04/2013 09:48 UTC","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/47275.html.txt","/var/www/straped/mufon/org/47275.html"],"Log Number":"US-05082013-0022","Region":"Arizona","map":"<A HREF = \"http://maps.google.com/maps?q=34.691079,+-112.332197(47275)&iwloc=A&hl=en\"> mufon case (47275) map </A>","Disposition":"Unresolved","trends":["There have been 12 other sightings in Prescott Valley","There were no other sightings in Prescott Valley on or around May 4th 2013"],"Case Number":"47275","Summary":"Observed thru binoculars a fast moving cigar shaped object"}