{"Sighting Duration":"Undisclosed","Log Number":"US-05082013-0025","Summary":"3 orb, triangle formation, hovering before making quick coordinated maneuver","Source":"MUFON","files":["/var/www/straped/mufon/html2text/47279.html.txt","/var/www/straped/mufon/org/47279.html"],"trends":["There have been 5 other sightings in North Richland Hills","There were no other sightings in North Richland Hills on or around May 4th 2013"],"Date Submitted":"05/08/2013 09:41 UTC","Case Number":"47279","map":"<A HREF = \"http://maps.google.com/maps?q=32.870397,+-97.204004(47279)&iwloc=A&hl=en\"> mufon case (47279) map </A>","City":"North Richland Hills","divs":["sighting detailsufo\\orbs\\triangle formation witnessed hovering for a period of over an hour. after hearing a loud boom i rushed outside to investigate. (not claiming boom was related, but very ironic timing if it's not related) directly in my line of vision after walking out front was the ufo, essentially commanding my attention. (not in an overly telepathic way or anything like that). i have had reoccurring dreams for many years about seeing lights in the sky from the same vantage point, so i think that helped to command my attention to it more than anything else. i continued to tell myself it was a star, or drone, but the more i observed it, and the more others around me observed it, it became quickly apparent that it was neither of those things. i still kept telling myself it was a drone until i reviewed the footage. it wasn't until a couple days later that i discovered the formation, triangle pattern, and coordinated maneuver while editing the footage. that was when the full truth finally sunk in. i have at least 5 witnesses, and 3 vantage points of video footage to back me up. my wife and i even viewed the object through binoculars and clearly saw the strange light patterns through the binoculars as well. these lights were nearly impossible to see from the well lit streets just outside of the neighborhood, and has shown me how easily these types of things can be going on right under our noses without our knowledge. even while witnessing these objects in person, i didn't fully see or comprehend the multiple objects in formation. as it was happening, i told myself that the 2nd object was just a star that had been there the whole time. after viewing the footage, this clearly was not true. we eventually lost sight of the objects after driving for a better vantage point."],"Viewing Distance":"Unknown","Country":"United States","Date of the Event":"05/04/2013 11:05 UTC","Tags":"City","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Latitude":"32.870397","Region":"Texas","Longitude":"-97.204004","Weather Factors":"Unknown","Disposition":"Unresolved","Object Features":"Other, Unknown","Object Shape":"Boomerang, Chevron, Fireball, Flash, Sphere, Star-like, Triangle, Other, Unknown"}