{"Region":"Massachusetts","City":"Ipswich","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.684403,+-70.832056(4728)&iwloc=A&hl=en\"> mufon case (4728) map </A>","Date of the Event":"08/01/1956 12:00 UTC","Source":"MUFON","Longitude":"-70.832056","Disposition":"Unknown","trends":["There have been 5 other sightings in Ipswich","There were no other sightings in Ipswich on or around August 1st 1956"],"Object Flight Path":"Undisclosed","Tags":"City","Summary":"moonlike light moved towards us, then hovered over trees; suddenly disappeared when we approached it to; no sound at all. Reappeared following night, same time; crossed road in front of car that time.","Log Number":"US-04302006-0003","Object Features":"Undisclosed","Latitude":"42.684403","Object Shape":"Sphere, Star-like","Date Submitted":"08/01/1956 12:00 UTC","divs":["Sighting DetailsMy friend and I were driving on an unlighted wooded road near the Ipswich River on way to Hamilton from Rowley after midnight, returning from work. We both spotted a large,white sphere of light coming towards the road from the left. We never heard of flying saucers or UFOs at that time. At first we thought a plane was crashing. But then the light stopped just above the trees in front and to the left of the road. so we thought it was a helicopter, until we realized it made no sound. We weren't afraid, just curious, so we both got out of the car and began to walk towards it. It disappeared. I have no recollection of its zooming off, even. The following night, about a half hour later at night, my friend was returing from Hamilton. At approximately the same spot, a similar (same?) sphere of light zoomed across the road in front of the car, he told me. I wasn't there that time. We told our friends and family only, not for fear of ridicule, just because it never occurred to us to call the police or the newspaper."],"Case Number":"4728","Weather Factors":"Unknown","Viewing Distance":"Unknown","Sighting Duration":"00:10:00","files":["/var/www/straped/mufon/html2text/4728.html.txt","/var/www/straped/mufon/org/4728.html"]}