{"Date of the Event":"08/15/1985 05:30 UTC","Summary":"(historical by cfi) Slow traveling white orb, clear outer surface, 5 to 18 inches diameter, eight foot altitude, skipping across ground, 180 degree turn, first seen 600 ft away, travels around house, impacts son in chest.","Source":"MUFON","Sighting Duration":"00:01:00","Date Submitted":"05/09/2013 10:27 UTC","Longitude":"-86.279505","files":["/var/www/straped/mufon/html2text/47286.html.txt","/var/www/straped/mufon/org/47286.html"],"Tags":"City","Region":"Michigan","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=43.339191,+-86.279505(47286)&iwloc=A&hl=en\"> mufon case (47286) map </A>","Object Features":"None","Object Flight Path":"Path with directional change","Country":"United States","divs":["Sighting DetailsWitness (A), mother, was washing dishes at the kitchen sink on a partly cloudy late-afternoon on a Spring day, casually looked up and observed a silvery orb about 18 inches in diameter, traveling across the backyard at about six feet off the ground at a slow pace, close to and back-dropped by distant tree-line, approximately 600 feet away, traveling perpendicular to observer, in a westerly direction, toward her back yard. She had recently viewed a scientific report on TV about ball lightning and this fit the description as described in this documentary. She became concerned for her son who was in a downstairs, basement family room with a slider door walk-out into the back yard. She looked away, hurrying downstairs, calling out to him, without a response. When her son, witness (B), first came into sight from the bottom of the stairs, he was in stiff, stunned, standing position. He said he had been hit in the chest with ball lightning. After a few minutes, he came around to being able to talk, he said the ball lightning had come into the room, through the open slider doorway without screen door and hit him in the chest, directly at his heart. No hair has grown on this chest location and in memory of the incident, he has a Thor lightning bolt tattoo in this area. Witness (B), son, was in the basement family room, with the slider and screen door open partially, a thunderstorm began intensifying, so he went to close the slider door when he noticed out of the corner of his eye to the right, a bright bluish white orb the size of a softball, skipping across the yard, make a 90 degree turn toward him at the doorway. He saw a bright flash and the orb hit him in the chest in the heart location. The after affects were red skin in the area of impact, red spots and blotches over entire body for several weeks after, no hair growth in the impact area for the remainder of his life."],"Case Number":"47286","Log Number":"US-05092013-0005","City":"Muskegon","Weather Factors":"Unknown","trends":["There have been 11 other sightings in Muskegon","There were no other sightings in Muskegon on or around August 15th 1985"],"Object Shape":"Circle, Sphere","Latitude":"43.339191","Viewing Distance":"20 Feet or Less"}