{"City":"Huntington","Date of the Event":"08/12/2002 05:00 UTC","Case Number":"47281","Disposition":"Unresolved","Region":"West Virginia","Sighting Duration":"00:25:00","Date Submitted":"05/08/2013 11:54 UTC","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/47281.html.txt","/var/www/straped/mufon/org/47281.html"],"Tags":"City","Longitude":"-82.427026","Object Flight Path":"Straight-line path","trends":["There have been 15 other sightings in Huntington","There were no other sightings in Huntington on or around August 12th 2002"],"Source":"MUFON","Summary":"glowing cyclinder eventually chased by military jets became brighter then disappeared","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.412378,+-82.427026(47281)&iwloc=A&hl=en\"> mufon case (47281) map </A>","Object Shape":"Cylinder","Latitude":"38.412378","Log Number":"US-05082013-0027","Object Features":"None","divs":["Sighting DetailsI was driving with my son on I64 from VA to our home in Lexington, KY. My son was in the back seat of our my car and observed an object in the sky . He was a real fanatic about military aircraft (having watched many History Channel shows)and asked me, \"Dad, what's a pencil in the sky?\" I didn't know what he was referring to, and told him to check it out with our binoculars. He told me where to look, and I observed a cylindrical, glowing object to our left (south of I64). The object paced us for over 20 minutes. My son and I then both observed two military jets converging on the object. My son said the jet from the east was a Navy Tomcat and the other was an Air Force jet which came from the direction of Ohio (we were near the KY-OH border at the time). As the jets approached, the object began to glow more brightly (like a magnesium flare), then dimmed gradually until it disappeared entirely. The jets then broke off and headed back to base. I estimate the object was over 300 ft long based on the size of the approaching jets. I reported this story to KY MUFON; this account was published in the KY MUFON newsletter. I called the editor and was told I had observed a mother ship (the vehicle which launches the discs) but have not heard anything about this incident since, not has anyone in the government or media acknowledged events of this nature. Can you update me, please?"],"Country":"United States"}