{"files":["/var/www/straped/mufon/html2text/47282.html.txt","/var/www/straped/mufon/org/47282.html"],"Tags":"City","Longitude":"-97.738611","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Latitude":"30.276603","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Country":"United States","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Region":"Texas","Object Shape":"Chevron","Date of the Event":"05/08/2013 10:00 UTC","trends":["There have been 188 other sightings in Austin","There was one other sighting in Austin on or around May 8th 2013"],"City":"Austin","Case Number":"47282","Log Number":"US-05092013-0001","Summary":"saw wedge-shaped translucent object in sky travelling from south to north over SW Austin","divs":["Sighting DetailsI was lounging in my hot tub around 10:00 PM, looking up at the night sky as I often do, after an evening run. I noticed movement from the south in the sky, I was facing west in the tub. I looked and quickly saw what at first I thought was a high-power search light tracing along the bottom of the clouds. But almost right away I noticed that there WERE no clouds in the sky at that time. This of course startled and interested me so I sprang up and watched as this thing pass directly overhead, I'm guessing at about 2,000 ft, traveling exactly from the south to the north. Very deliberate motion, no wavering. As I watched it go by I noticed it was very clearly wedge-shaped and translucent-white, like the color of a cloud almost. But again, no clouds. To describe the shape, it was very much shaped like an Army Private 'chevron' arm stripe; angular and crisp. Almost exactly the same angle and width proportions of a chevron stripe in fact. It made no sound that I could hear (I had one low-power hot tub jet on, I couldn't turn it off since the tub was in 'filter mode', dang it). I didn't notice any lights on it, just a very slight glow to the whole shape. I waited and watched for another 10 minutes for a search light to cross the sky, but none did. A few wispy clouds drifted by while I was waiting - if there was a search light it would have lit those up. No video or pics unfortunately."],"map":"<A HREF = \"http://maps.google.com/maps?q=30.276603,+-97.738611(47282)&iwloc=A&hl=en\"> mufon case (47282) map </A>","Date Submitted":"05/09/2013 12:07 UTC","Object Features":"None"}