{"Object Shape":"Circle, Sphere","Summary":"me and my husband were sitting on back porch when i seen the green glowing orb flying just above the tree line of a distant mountain i grabbed my husbands face and turned his head and said look and he also seen it.","Longitude":"-80.230231","Latitude":"39.537473","Country":"United States","Weather Factors":"Unknown","divs":["Sighting DetailsIt was a warm night the sun had just gone down but it was still a little light in the sky. We always sit on the back porch and look at the sky,our back porch looks over an open field and in the distance you can see mountains,but in the field there are some very tall trees.I was looking up in the sky at the stars toward the west were the sun had just set and all of a sudden a green glowing orb appeared out of sky above the tallest tree in the field but i could tell that it was at least a mile or so away. It moved a little and when i grabbed my husbands face and pushed his head around i said look and it hesitated above the tree id say for at least 10 seconds and seemed like it went down behind the mountain,it did not make any noise but it glowed bright green and seemed like it had a darker core to it.Of course everyone we have told think were crazy but i know what i saw and both my husband and i have not forgotten.Found out about this sight on tv watching alien mysteries on the destination channell.we are still a little disturbed by this event."],"Object Flight Path":"Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/47291.html.txt","/var/www/straped/mufon/org/47291.html"],"Tags":"City","City":"fairmont","Log Number":"US-05092013-0009","map":"<A HREF = \"http://maps.google.com/maps?q=39.537473,+-80.230231(47291)&iwloc=A&hl=en\"> mufon case (47291) map </A>","Region":"West Virginia","trends":["There have been 5 other sightings in fairmont","There were no other sightings in fairmont on or around June 10th 2012"],"Date of the Event":"06/10/2012 08:30 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","Case Number":"47291","Disposition":"Unresolved","Object Features":"None","Viewing Distance":"Unknown","Date Submitted":"05/09/2013 05:26 UTC"}