{"Case Number":"47290","Object Flight Path":"Path with directional change","Source":"MUFON","Longitude":"-84.212036","Tags":"City","trends":["There have been 3 other sightings in Onaway","There were no other sightings in Onaway on or around May 8th 2013"],"Object Features":"Unknown","Weather Factors":"Unknown","divs":["Sighting DetailsMy wife @ I stepped on south facing deck for puff on cig,we both quit months ago,we're cheating! My wife said,is that a satellite ?,pointing to a bright star in between small round clouds.I said no,that's a star, the clouds are moving.Hold up your finger,just below the star and you,ll see it's not moving.I looked straight up and in between the clouds there were 3 small clusters of lights in a triangle shape.I told my wife to look!! whats that!! My first thought was that it was 3 jets in a real tight formation.I said they must be going to Afghanistan.I don't know if that's the way! but that's what my first thought was, military.The lights we're a dim red,not blinking or anything.I couldn't tell the speed as the little round clouds covered the lights.Of course!!! For the 5 or 6 seconds I did observe the lights they didn't appear to be moving very fast.My assumption was that they were going due north so I turned around looking straight up over the house, waiting for a break in the clouds. While I was looking straight up,Kind of scanning above ,my wife said look!!.She was behind me looking over me and to the northeast.Out of the clouds came a bright solid, not blinking light heading to the south east.Fast!! I looked at that then back up over the house to see the two, white blinking lights of two jets that appeared to be in pursuit of the object.The object went out of sight to the south east while I was still watching the jets, heading the same way.The clouds broke enough and I looked at the right time to see the jets go from heading due north and turn to the southeast. Now, I'm not sure if I even seen the jets when I first saw the triangle shape lights. They were, I'm guessing to the south,obscured by the small broken clouds. The time was 9.47 Pm May 8TH. I called The National UFO Reporting Center in Seattle Wash. and TV 7@4 News.No one else had yet called.Today, the 9th,Thursday, I heard of other people seeing the same event. I'm Still waiting to hear the other accounts."],"Object Shape":"Triangle","Region":"Michigan","Latitude":"45.361187","Log Number":"US-05092013-0008","map":"<A HREF = \"http://maps.google.com/maps?q=45.361187,+-84.212036(47290)&iwloc=A&hl=en\"> mufon case (47290) map </A>","Country":"United States","Summary":"Large triangle with 2 or3 jets in persuit","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Date Submitted":"05/09/2013 02:49 UTC","Viewing Distance":"Unknown","Date of the Event":"05/08/2013 09:46 UTC","files":["/var/www/straped/mufon/html2text/47290.html.txt","/var/www/straped/mufon/org/47290.html"],"City":"Onaway"}