{"Summary":"Over flight of UFO scanning Cayuga Lake.","Country":"United States","Latitude":"40.723583","Longitude":"-74.004113","Date Submitted":"05/09/2013 08:37 UTC","Source":"MUFON","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around September 2nd 1967"],"Date of the Event":"09/02/1967 12:00 UTC","Disposition":"Unresolved","City":"New York","Weather Factors":"Unknown","Case Number":"47296","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Log Number":"US-05092013-0014","Region":"New York","map":"<A HREF = \"http://maps.google.com/maps?q=40.723583,+-74.004113(47296)&iwloc=A&hl=en\"> mufon case (47296) map </A>","divs":["Sighting DetailsWe were camping at my friend's camp site on Cayuga Lake NY. It was turning to evening and we were sitting on the edge of a dock. The fog mist was coming on the lake for the evening and then we saw what looked like a blimp in the distance across the lake. We just sat and watched the object thought nothing of it. Slowly without a sound and not disturbing the lake mist it approached toward us. Nothing to to scarce or worry us until it was above out heads about 300 feet. It then stopped. It was a very large circular disk and had a dome feature underneath. It was directly above us while we were sitting on the dock. Three light's came from the bottom dome in red, green and blue. The light felt very hot so we panic'd and ran. I ran into the wood's and my friend ran under his family's camper. It seems like there was a time lose in that it was later than what it should be. My friend doesn't recall anything later when I questioned him about that event year's later. The craft was silent until it left us, the sound became pulsacting when it left. Alex Lakota"],"Object Shape":"Disc","Object Features":"Dome, Window(s)","Tags":"City","files":["/var/www/straped/mufon/html2text/47296.html.txt","/var/www/straped/mufon/org/47296.html"],"Object Flight Path":"Straight-line path"}