{"Longitude":"-71.07728","Object Shape":"Disc","Disposition":"Unknown","Country":"United States","Weather Factors":"Unknown","Date of the Event":"05/10/1978 05:00 UTC","Region":"Massachusetts","Viewing Distance":"Unknown","City":"Haverhill","divs":["Sighting DetailsI was backing out of my driveway, going downhill, so sky visible out dash. Watched in wonder about a minute, then jumped out of car and began knocking on door for my sister to come see it. By the time she came, it was quite far off, but she did see it. It came from the SE, making a circle (getting ever closer, then going away) at uniform height, just over the houses, which are on one of the highest hills in Haverhill, just west of the Merrimack River. It was of the \"two soup bowls\" type, silver in the sun, with blinking lights around the middle. It was definitely undulating. It made no sound. As soon as I saw it, I knew what I was looking at, though I was stunned to be seeing it. After it left, instead of calling the police or a newspaper, I left in my car, and told everyone I saw on the way to my (other) sister's house to look in the sky for the UFO I'd just seen. I'm sure they thought I was crazy (unless they'd seen one). I didn't stop the car. My sister also lived on the top of a hill, and I'd been hoping we'd all see it when I got there, so I was in a hurry. I never saw it again, and I never talked to anyone else that saw it. I can tell you that I was as excited during and after the sight as I've ever been in my life. Now I know that UFOs really do exist!"],"Sighting Duration":"00:06:00","Tags":"City","Date Submitted":"05/10/1978 05:00 UTC","Latitude":"42.776202","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Case Number":"4729","Log Number":"US-04302006-0004","Source":"MUFON","files":["/var/www/straped/mufon/html2text/4729.html.txt","/var/www/straped/mufon/org/4729.html"],"trends":["There have been 9 other sightings in Haverhill","There were no other sightings in Haverhill on or around May 10th 1978"],"Summary":"typical silver disk approached in circular pattern, turning away just over the Merrimac kRiver. Undulating; no sound; blinking lights around middle.","map":"<A HREF = \"http://maps.google.com/maps?q=42.776202,+-71.07728(4729)&iwloc=A&hl=en\"> mufon case (4729) map </A>"}