{"Date of the Event":"05/07/2013 09:10 UTC","Case Number":"47292","Object Features":"None","Summary":"Two dark objects, no lights, looked circular but hard to tell. Not sure how large or how high in the sky. I would estimate they were the size of a small airplane or hellicopter. Hovered with no noise.","Weather Factors":"Unknown","Region":"Alberta","Tags":"City","Latitude":"51.071218","Object Flight Path":"Stationary","Object Shape":"Circle","Sighting Duration":"00:10:00","map":"<A HREF = \"http://maps.google.com/maps?q=51.071218,+-114.11604(47292)&iwloc=A&hl=en\"> mufon case (47292) map </A>","files":["/var/www/straped/mufon/html2text/47292.html.txt","/var/www/straped/mufon/org/47292.html"],"Source":"MUFON","divs":["Sighting DetailsMy friends dropped me off at a c-train station so I could take the train the rest of the way home after a board meeting. It was just after 9 PM, twilight, sky was still pretty blue, with just a few scattered clouds. I crossed the tracks to get to the side of the terminal I needed to be on, bought my ticket and when I turned around and stepped out onto the platform two round dark objects caught my eye. They were visible above some tall trees on the other side of the block. They did not seem vary large but looked like they were very high in the sky. They hovered and did not seem to emit any sound. They were both in close proximity to each other. They were more or less stationary only moving slightly. Like they were being rocked about by the wind but were maintaining the same position.Kind of like buoys in water.They did not emit any light. The one on the right looked like it had several much smaller dark objects spinning around it. Kind of looked like a swarm of flies buzzing around it. There were very few other people around, but no one else seemed to take notice and I did not point them out to anyone. I tried to take a picture but could not get a good shot with the camera on my phone as the objects were to far away. I observed them in this state for about 3-4 min until the train arrived. I sat in a seat where I could continue to observe the objects through the window. They seemed to remain still as the train traveled north. I lost track of them after the train passed through an underground tunnel. We have a busy international airport here so I observe planes and helicopters in the sky regularly and these objects did not seem at all similar to that type of craft. I considered that they may be balloons or kites of some kind but it seemed odd how they were so high up and not moving at all how you would expect a kite or ballon to move. I know some commercial remote control drones can hover and go quite high, but there was two of them and very close together and no noise and I could not see any apparatus that devises like that typically have. ie: hellicopter blades, wings or fans. I'm hoping someone else saw it or if anyone could give me an explanation of what these objects might have been, I would be curious to know as I have never seen anything quite like that in the sky before."],"Date Submitted":"05/09/2013 05:29 UTC","Log Number":"CA-05092013-0010","Longitude":"-114.11604","Country":"Canada","Viewing Distance":"Unknown","Disposition":"Unresolved","City":"Calgary","trends":["There have been 76 other sightings in Calgary","There was one other sighting in Calgary on or around May 7th 2013"]}