{"Tags":"City","Date of the Event":"01/01/2010 04:30 UTC","files":["/var/www/straped/mufon/html2text/47304.html.txt","/var/www/straped/mufon/org/47304.html"],"Country":"United States","Weather Factors":"Unknown","Region":"North Carolina","Summary":"A BRIGHT WHITE ROUND OBJECT NO SOUND SEEMED OUT OF NOWERE IT ,SOLID NO OTHER FEATURES AFTER APPERANCE AND VANISHED AFTER 21/2 HRS ABOUT 20 MIN APEARED ,HOVERED THEN DECENDED BEHIND RIDGE AT STEEP ANGLE","Disposition":"Unresolved","Longitude":"-83.953718","Object Flight Path":"Stationary,Hovering then path,Path then hovering","Case Number":"47304","City":"ROBBINSVILLE","Source":"MUFON","Sighting Duration":"03:15:00","Date Submitted":"05/09/2013 10:58 UTC","Latitude":"35.426613","Log Number":"US-05092013-0022","trends":["There have been 3 other sightings in ROBBINSVILLE","There were 2 other sightings in ROBBINSVILLE on or around January 1st 2010","This sighting has never been favorited.",""],"divs":["sighting detailson 01\\01\\10 i drove to north carolina, natahala natl. forrest, slick rock, big fat gap regoin to hike , camp. this area is just off u.s. hwy.129, about five miles from deals gap at tennessee, n.c. boarder. hwy. is also known as the dragon.i was about 15 miles from robbinsville, n.c.to the east\\\\the entery into area ,you cross a bridge crossing the stream,right turn\\\\ this road you go about 100 yds., to split in road, one turning a sharp right,one straight to a gate about two miles from bridge blocking service road \\\\ after about 1\\2 miles i came up to a trail called the belden trail\\\\ i parked at that trail head, decided to hike to gated road,take that four a while\\\\ a have hiked that road and other trails in area serveral times. i began my hike at about 11:00 am it takes about or a little over 30 min. this road runs south ,southwest along a deep valley with stream. after about 4:00 pm i turned around, started back toward truck \\\\ and decided to take my time. after about an hour.as, came around a bend , i spotted a bright light that seemed to be halfway up slop ,n. n.e. from that vantage point, across valley ,other side or hwy.129, maybe three miles out. b the time i got back to gate it was nearly dark, i noticed a beem , faint , to my front left, over a near ridge . now as i had been seeing that for a good 11\\2 hrs.to two hrs.the light stayed seems in same spott,seemed brighter. hunters light ,maybe, i was thinking\\\\ i continued down excess f.s. road toword my truck\\\\ about 30min. later i came around a bend, and noticed the light was no longer visable\\\\ i was trying to remember if i had noticed no house lights ,or flood lights anytime i took that walk. there is a road that runs along that mountain that runs into a community on one end, and on the ohter end farms and a community to left about 1\\4 miles from intersection\\\\ this road turns right at crest of paved road that intersect with hwy. 129.that road can excessed by turning left on first left turn 3 miles from deals gapp past a dam .02 miles across from topoco lodge on right\\\\ there is one vacation houes about a mile from crest onto that mountain road\\\\ one driveway to house about 50 to 100 yrds to right down slope\\\\ no other\\\\ i had flashlight on watching my step\\\\suddenly a bright white round object appered, and just stayed stationary\\\\ after about 30 sec. the object began to slowly decend at an sharp angle till it dissapered behind slop angle down right to left.ridge slopped at steep angle\\\\ i rocked back one my heels\\\\ i felt very unnerved and a sense of fear, quickly\\\\ i turned off flashlight and began a quick step back 1\\2 mile to my truck\\\\ my thoughts was, did i see the same thing that i had seen for past 2 hrs.or so\\\\ i had park behind a slope that blocked any other view \\\\. i was reluctent to start vehicle for the thought ,what if it would bring some attention from that thing. but i started up turned around and headed back to hwy. 129\\\\ when i got back to hwy., i decided to turn toward robbinsville with cross between brave to not so brave \\\\ the dirrection runs up to were the creek enters chioa creek. i never seen it again\\\\ i have never seen anything that i called a strange object in sky\\\\ as a camper and hiker, my love for the out doors i have always loved to look skyward .i known of flooting latern that can be mistaken for ufo\\\\ i dont believe that this was the case\\\\no sound of fireworks, no gun shots \\\\ i think about this a lot and have told few\\\\ i wonder if there was an object that was detected in area by usaf or traffic control,any airport\\\\ im very much want to know what i saw\\\\"],"Object Shape":"Disc, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=35.426613,+-83.953718(47304)&iwloc=A&hl=en\"> mufon case (47304) map </A>","Object Features":"None","Viewing Distance":"501 Feet - 1 Mile, Unknown"}