{"map":"<A HREF = \"http://maps.google.com/maps?q=39.391111,+-74.593889(47305)&iwloc=A&hl=en\"> mufon case (47305) map </A>","divs":["sighting detailsmy sister, niece, son and i were driving down the atlantic city expressway when i noticed an object in the air. at first, i thought it was a star, but i realized that it was too close to be a star. it was a very bright yellow and light was emanating from it. i quickly turned to my sister and said \"***, what in the world is that?\" she looked and she had mentioned that she had seen something like it before a few winters ago. by this time the kids are looking out the window and they are beginning to panic. after looking at the object for a few seconds, it shot out what i looked like to me was a ball of fire. the ball was moving slow, and left a trail of light. then the ball came to a complete stop, it was below the main ball of light, but towards the right hand side of it....when the fireball stopped it completely changed to a yellow color just like the first craft, after a few seconds, both balls of light completely disappeared. we were so shocked at what we had seen that we didn't notice how fuzzy the radio had gotten, after a few seconds the radio station we were listening to were back to normal....i would also like to add that earlier in the day we saw what i could only describe as military drones flying in the area, this happened in the duration of 4 hours, we also saw 2 planed that looked like military cargo planed. about 1\\2 hour after the sighting we have heard various jet fighters."],"files":["/var/www/straped/mufon/html2text/47305.html.txt","/var/www/straped/mufon/org/47305.html"],"Date Submitted":"05/09/2013 11:24 UTC","Latitude":"39.391111","Disposition":"Unresolved","Source":"MUFON","Object Features":"None","trends":["There have been 8 other sightings in Egg Harbor Township","There were no other sightings in Egg Harbor Township on or around May 9th 2013"],"Viewing Distance":"Unknown","Log Number":"US-05092013-0023","Case Number":"47305","Object Flight Path":"Stationary","City":"Egg Harbor Township","Sighting Duration":"Undisclosed","Date of the Event":"05/09/2013 10:15 UTC","Summary":"Drones and Military Airplanes witnesses all day, we were shocked to see a fireball looking UFO","Country":"United States","Region":"New Jersey","Tags":"City","Weather Factors":"Unknown","Object Shape":"Star-like","Longitude":"-74.593889"}