{"Country":"United States","trends":["There have been 25 other sightings in Bowling Green","There were no other sightings in Bowling Green on or around April 30th 2006","This sighting has never been favorited.",""],"Log Number":"US-05012006-0001","City":"Bowling Green","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=36.99602,+-86.437742(4731)&iwloc=A&hl=en\"> mufon case (4731) map </A>","Viewing Distance":"Unknown","Disposition":"Unknown","Object Features":"None","Region":"Kentucky","Tags":"City","Sighting Duration":"Undisclosed","Source":"MUFON","Date Submitted":"04/30/2006 09:24 UTC","Summary":"Looking at the big dipper saw bright star-like obect moving under the dipper in a Straight line north west direction obect made a cruve or dip like I wasmove & disappeared","Latitude":"36.99602","Longitude":"-86.437742","divs":["Sighting DetailsI was taking out the dog, and was standing in the field next to the house looking in a northly direction it had rained most of the day but the sky was not cloudy to the north and west I look up at at the big dipper while the dog did his duty. just under the big dipper I saw a Bright soild star like light moving quickly in a North Westly direction it was moving in a straight line I though it mite be a satilite but then it made a cruve or dip like move and it disappeared like in to thin air.I was in wonderment I stood there for a few minutes to see if it would reappear near the star I saw it disappear closest to scaning the sky in the direction I thought it it would reappear. It didn't! This may sound crazy but, I thought at the time maybe it knew I saw it and went into seath mode or something. I went back to the house feeling odd with many strange thoughts racing thur my mind. So I just went to bed wondering. Got up this morning and thought I would report it to you."],"Weather Factors":"None","Object Flight Path":"Path with directional change","Case Number":"4731","Date of the Event":"04/30/2006 09:24 UTC","files":["/var/www/straped/mufon/html2text/4731.html.txt","/var/www/straped/mufon/more/4731_submitter_file1__Picture048.jpg","/var/www/straped/mufon/org/4731.html"]}