{"Tags":"City","trends":[],"Disposition":"Unresolved","Latitude":"27.893974","Country":"United States","City":"Undisclosed","Summary":"Yellow Orange Lights Multiplying Ascending Dropping and Merging before fading","Log Number":"US-05102013-0006","Longitude":"-81.58752","Weather Factors":"Unknown","Object Features":"None","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/47312.html.txt","/var/www/straped/mufon/org/47312.html"],"Region":"Florida","Object Shape":"Fireball, Star-like","Date Submitted":"05/10/2013 02:55 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","divs":["Sighting Details My fiance and I along with out little dog, were driving to Vero Beach Florida from Tampa Florida to visit out Moms for mothers day. It was around 9:30pm on a Thursday night heading East on Rt 60 toward Vero. I looked to my right to see 2 yellow orange lights in the night sky flying at the same altitude but not close enough together for me to think they were the same object. I remember thinking that planes that low shouldnt be flying at the same altitude as it could be dangerous. Almost as soon as I had that thought the 2 lights, which looked like ultra bright amber stars fused to 1 light. As soon as that happened I thought...Alright we that's not a airplanes. Almost immediately the now one light shot into 3, then shot off maybe 3 or three more. There seemed to be no pattern to it. I remember thinking it looked like some sort of slow moving odd firework. After it shot into these 5-6 orange yellow star lights they all stated rapidly dropping in the sky. We were driving past cow pastures and before they got anywhere near the ground they merged into 1 light again and vanished.I was yelling \"Whats the heck is that!\" \"What are those!\" over and over. My fiance looked only in time to see the one final light blink out. He started yelling \"The yellow orange light??? I saw it, what happened!?\". We then drove passed a more wooded area and though we kept our eyes locked on the tree line we saw no more lights. I have never seen anything of the sort. I have been searching online since we got to Vero Beach at around 10:30pm trying to see if anyone else saw it. I keep seeing one report in Google search results from around that time that seems to be reporting the same thing on this site but I cant seem to find the report once I open the link. I hope someone else saw this. It doesnt bother me that I saw it as much as it bothers me that I seem to be the only one. That stretch of 60 is pretty deserted except for cows."],"map":"<A HREF = \"http://maps.google.com/maps?q=27.893974,+-81.58752(47312)&iwloc=A&hl=en\"> mufon case (47312) map </A>","Case Number":"47312","Date of the Event":"05/09/2013 09:30 UTC","Object Flight Path":"Path with directional change"}