{"City":"Apache Junction","Viewing Distance":"Unknown","divs":["Sighting DetailsAt 5:15 a.m., while on my roof staring at the sky, I saw an object that was bright white in color moving very slowly across the sky. I wasn't sure what it was at first because it was moving too slow to be a plane. I then grabbed the binoculars that were next to me(because that's all I had with me at the time) so that I could see it more clearly. A few minutes later I noticed that a duller colored object of similar shape had joined it, trailing behind it to the right. A few minutes after that another craft that looked like two \"o's\" next to each other(like the number 8 on it's side) joined in and completed their triangular shape formation. The figure 8 craft left the formation, without me noticing, but joined back in a few minutes later. Without me noticing again, the two that joined the first one had left and the bright white one was left. For around 22 minutes I watched it go in big circles, make \"UFO type movements\" and also a movement that resembled a ball bouncing between two walls at medium-high speed before losing site of it as it traveled over my head. Also, and I'm not sure if there is any way to confirm this, but I also received several images in my left eye(I'm very right eye dominant so when I use binoculars my right eye is open while the left eye is closed)telepathically during the viewing of the craft. Some images appeared to me like small video-clips, and others appeared more like files with words and images and possibly blueprints on them. The only image I can remember, because it showed up 3 times or more, resembled what I would describe as a humanoid skull or face with tribal designs covering it. At one point while viewing the craft through the binoculars I believe, but not completely sure, that I saw the same image on the bottom of the craft and at which time the craft appeared to resemble a kite. After I got off the roof, I was looking at the sky to see if I could re-locate the craft again one last time before going inside and I received another image which looked like a Kalachakra-type image spinning around multiple times with the same tribal face image in the center. I've never experienced anything like this before and I don't know how it will affect me in the long run, but If somehow I could \"access\" the received information then it might give me some sort of closure to the whole situation."],"Region":"Arizona","Object Flight Path":"Path with directional change,Other","Sighting Duration":"Undisclosed","Latitude":"33.397204","Country":"United States","Log Number":"US-05102013-0009","files":["/var/www/straped/mufon/html2text/47315.html.txt","/var/www/straped/mufon/org/47315.html"],"Disposition":"Unresolved","Date of the Event":"05/06/2013 05:15 UTC","Summary":"three different objects, one object for majority, received telepathic images","Longitude":"-111.601436","Date Submitted":"05/10/2013 04:46 UTC","Case Number":"47315","Object Shape":"Circle, Triangle, Other, Unknown","Object Features":"Insignia","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.397204,+-111.601436(47315)&iwloc=A&hl=en\"> mufon case (47315) map </A>","Source":"MUFON","Tags":"City","trends":["There have been 16 other sightings in Apache Junction","There were no other sightings in Apache Junction on or around May 6th 2013"]}