{"map":"<A HREF = \"http://maps.google.com/maps?q=-38.048521,+144.162481(47316)&iwloc=A&hl=en\"> mufon case (47316) map </A>","Disposition":"Unresolved","Object Features":"Unknown","trends":["There have been no other sightings in Bannockburn","This sighting has never been favorited."],"City":"Bannockburn","Viewing Distance":"501 Feet - 1 Mile, Unknown","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Case Number":"47316","Country":"Australia","Longitude":"144.162481","files":["/var/www/straped/mufon/html2text/47316.html.txt","/var/www/straped/mufon/org/47316.html"],"Weather Factors":"Unknown","Summary":"Strange light hovering in sky, observed from backyard through binoculars, increased airtraffic promptly followed","Log Number":"AU-05102013-0010","Sighting Duration":"01:00:00","Tags":"City","Date of the Event":"05/10/2013 07:44 UTC","Latitude":"-38.048521","Date Submitted":"05/10/2013 06:45 UTC","Object Shape":"Circle, Disc, Triangle, Unknown","divs":["Sighting DetailsI was feeding my dog and walked out to throw the empty can in the bin when I noticed a strange light in the sky that did not look like a star. It began moving in erratic, nimble paths and stopped on a dime a number of times. I yelled out to my sister and we grabbed the binoculars and sat observing it for about 20 minutes to half an hour. Through the binoculars we could see that it had a shape and was solid, it had about 3 lights, though the number varied as the object moved, we mostly saw 3 main lights coloured red, yellow and pale green. They pulsated a little but did not blink. The object as far as we could tell was triangular, but may well have been circular or disc like as we observed from some distance. The size of the object is difficult to determine as distance is unknown but it was big enough to be identifiable as not any kind of aircraft we have ever seen or know to exist, especially in this area which receives only occasional distant air traffic. The object was too high and too maneuverable to be a helicopter, it also stayed in the sky on the one vague area for too long and made no noise. In addition to this it certainly did not look like a helicopter when observed through binoculars. During the sighting we noticed a number of planes appear on the horizon, that did not seem like civilian or commercial aircraft due to their speed and lights, as well as our identification of them through binoculars. At least 4 were counted heading toward the object, though significantly lower than it. Eventually they disappeared, presumably into the horizon, though the object stayed. Whether or not the aircraft were tied to the sighting or not is questionable. I would like to also that the object was still visible as I was filling out this report, observable out my window, it disappeared only recently and neither myself or my sister witnessed it disappear, or how it disappeared."],"Region":"Victoria","Source":"MUFON"}