{"Region":"Florida","files":["/var/www/straped/mufon/html2text/47320.html.txt","/var/www/straped/mufon/org/47320.html"],"Case Number":"47320","trends":["There have been 7 other sightings in North Port","There were no other sightings in North Port on or around March 26th 2013"],"divs":["Sighting DetailsShortly before the event I was in my home , the kids were sleeping and my husband was out getting a late dinner from Wendy's. I had arrived to my home only a couple hours earlier, after putting the kids to sleep and while my husband was out, I decided to turn the ac unit on, it hasn't been used for a while so I was very startled when shortly after I turned the unit on, the smoke detector alarm started going off. This caught me by surprise and scared me for a second ( I might be a little jumpy about smoke alarms because we did have a house fire , here, at Xmas 2008, that destroyed our home.) The alarm stopped going off on its own within seconds but I was so shook up and startled that I went outside my front door to calm down and have a cigarette. I live in an area where my neighbors have acreage. As I stood outside my front door looking across the street I saw a huge bright orange light. I've never seen such a bright large round orange light like that before so I continued to look. The light didn't move at first and I started to think it was some sort of helicopter, because the light was hovering. Then I realized that a helicopter at this range would be extremely loud. It was silent. After a few minutes, the light changed, I thought the aircraft was turning because of how the light kinda distorted, I realized that the object was now rising from the position I first saw it in. From my point of view I could see that the object wasn't just next to the trees, but it was rising. I was confused as to what I was seeing. The object started to come towards me and I felt a panic because I knew what I saw wasn't a plane or helicopter and it didn't appear to be far away from me to begin with, so as it very very slowly came closer I got scared and I wanted to go inside but I was fascinated with what I was seeing so as it got closer I walked toward the middle of my driveway, I watched as the object flew over the road I live on and went directly over my head. When I saw the object over the street I wondered how it could be so low to the ground moving so slow and not just drop from the sky. As it went directly over my head it flew just over the power lines in my yard, at this point I heard a very faint noise coming from the object. Very faint. I had to look directly up to see the underside of this object overhead. I could very clearly make out the outline. At first I thought it was triangular in shape but as I got a better look I could see that it resembled a missile in the way it had a cylinder shape front end and body and some soft edges around what looked like flaps or wings at the bottom or back end ofthe object.the bottom was flat, kinda like what I think a stealth bomber would look like from the underside. The orange light I originally saw was no longer present, but I did see a faint bluefish white light, very small in size, on the object. I also saw on the underside, not the sides or top, a few square lights. Randomly lit up. There were multiple square shaped spots that were lit up. These were not windows like on a passenger plan, it reminded me of a display screen with many squares, only a few we're bright, and these were not on the sides, the squares were directly over my head on the very bottom of the object. I watched as it continued on its path over my head, then over the patch of pine trees in my front yard, then it continued over the vacant lot next to me, the object was so low and moving so slow that the feeling of panic came over me again because for a second I thought what I was seeing was a plane, without engine sound, about to crash land. It was so extremely slow, I thought it was going to drop right in front of me but it didn't, and within a few seconds of it flying over head I couldn't see it anymore because it was so slow and low to the ground that once it passed by my trees, the trees blocked my view, that's how low it was. It was very large, like a passenger plane, but it didn't look like any plane I've ever seen. It was so slow moving and silent. It was dead silent that night, no traffic, no noise. If the object was a plane or helicopter I would have known, it was directly over my head. I haven't discussed this with many, only my husband who returned from Wendy's just minutes after it flew over head, I thought there was no way in the world he could have not seen it because he would have been traveling toward our house just a few minutes before he arrived home. The speed, the lack of sound and the weird lights on the bottom baffle me. I did make a sketch and illustrate the object and the positions of the lights but I have since lost it, however what I saw is permanently etched in my memory."],"Weather Factors":"Unknown","Viewing Distance":"21-100 Feet","Disposition":"Unresolved","Longitude":"-82.220632","Object Flight Path":"Hovering then path","Country":"United States","Sighting Duration":"Undisclosed","Source":"MUFON","Date of the Event":"03/26/2013 10:30 UTC","Tags":"City","City":"North Port","Log Number":"US-05102013-0014","Object Shape":"Bullet, Missile","Date Submitted":"05/10/2013 11:12 UTC","Object Features":"Window(s), Appendage(s)","Summary":"Saw super big bright orange light, hovering, then it ascended before coming directly toward me, then flew directly overhead about 20-30 feet above my head. And flew over my driveway tandem continued over the treetop.","Latitude":"27.098552","map":"<A HREF = \"http://maps.google.com/maps?q=27.098552,+-82.220632(47320)&iwloc=A&hl=en\"> mufon case (47320) map </A>"}