{"Date Submitted":"05/10/2013 04:50 UTC","trends":["There have been no other sightings in Wonewoc","This sighting has been favorited 2 times."],"Sighting Duration":"Undisclosed","Disposition":"Unresolved","Viewing Distance":"20 Feet or Less","Country":"United States","Object Features":"Unknown","Region":"Wisconsin","Tags":"City","Latitude":"43.63736","Object Flight Path":"Stationary","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.63736,+-90.221148(47327)&iwloc=A&hl=en\"> mufon case (47327) map </A>","Case Number":"47327","Log Number":"US-05102013-0021","Summary":"Relaxing on a downed tree over small creek and felt its presence. Perched on branch 5 feet behind me.","City":"Wonewoc","files":["/var/www/straped/mufon/html2text/47327.html.txt","/var/www/straped/mufon/org/47327.html"],"Longitude":"-90.221148","Source":"MUFON","Object Shape":"Other, Unknown","Date of the Event":"08/23/2012 12:00 UTC","divs":["Sighting DetailsThere's a place on my friend's farm that I go to and relax around total nature. I decided to video tape where I was to show my family and friends how blessed I am to be at such peace at this point in my life after living most of my life in turmoil, hurt, incarceration and angst. As I was talking on the video I panned around the entire area to show everyone how peaceful and serene the area I was in was. I was sitting on a storm-downed tree that had landed on another tree, which caused the downed tree to lay horizontally five (5)feet above the ground and over the small creek that the small waterfall made. After filming the area, I leaned back on the vertical tree the downed tree ended up against and relaxed. A few moments later I felt an urge to look over my shoulder. I stared behind me for a minute wondering why I felt this urge. I was in a densely forested area with many trees but with ample distance visage. I looked back there and noticed something different in my vision. Five feet behind me and about two feet above my line of sight and one foot to my left shoulder sat a branch. That's when I noticed something was a little more bleary in that spot. I didn't believe what I was seeing so I turned away to look at something else and then back. That's when I saw a distinct shape. I looked directly at it and felt that I saw it looking back at me. I then looked past the shape on both sides and got the outline. I then saw that it was reflecting the daylight and tree leaves around it. I noticed that it had two ears like an owl or house cat and a body that appeared to be like a chicken. I turned away again to make sure I was not hallucinating. I was not. I turned back to it overwhelmed by fear. This time I noticed that the side of the shape had a rounded feathers-like reflection to it. At this point I felt it seem to say, \"Can you see me? Are you looking at me\" That's when the tingling fear hit me. I didn't panic on the outside; just on the inside. I was about twenty feet away from the property end of the downed tree. I had walked the length of it to my spot. Now I had to walk back down it to get back to the property. I was afraid that if I panicked I would slip off the tree, fall to the ground five feet below and then be attacked by the life form. No one would know where I was nor find me until I rotted. Maybe. So, in mortal fear of being grabbed as I made it back along the tree I tried to act normal. I talked to my self just like I was talking while filming the video. I said, \"Well, time for me to head on back,\" in hopes of having it think it was a figment of my imagination. I made it off the tree and back over the barbed-wire fence (to keep the cows on the property), grabbed my bike and walked it back to the path. I was afraid that at any time, it would grab me. When I got back to the house told my friend and his daughter what had happened. They humored me. Later on I looked at the video and discovered that as I was filming I had turned the camera toward me and talked some more. To my amazement I actually have caught the life form on my video. It is over my left shoulder. I have tape of the \"invisible\" life form. I would like you all to analyze it and blow it up if possible. This is by far the strangest thing I have ever witnessed. I would be happy to show you the entire video and the place this all occurred. I have included a blow-up pic for now. Thank you."]}