{"Object Flight Path":"Stationary,Hovering then path","files":["/var/www/straped/mufon/html2text/47323.html.txt","/var/www/straped/mufon/org/47323.html"],"Sighting Duration":"02:00:00","Date Submitted":"05/10/2013 02:59 UTC","Date of the Event":"04/09/2013 03:30 UTC","Weather Factors":"Unknown","Region":"Kentucky","Latitude":"39.086371","Log Number":"US-05102013-0017","Viewing Distance":"101-500 Feet","City":"Covington","Disposition":"Unresolved","divs":["Sighting DetailsAt about 3:30am, animals (dogs cats) reacted to a humming sound and attracted the attention of the human occupants of the building where a low humming sound was heard coming from above. The witness, not me, (a retired nurse and avid UFO fan,) went out side and looking up saw a flattened cigar shaped craft with a gold colored rear end. Witness tried to take pictures and each time the camera failed to operate. Each time she could get the camera to work it would fail. But she finely got it to work and took two pictures The moment the second picture was taken, the craft vanished to the SW. Later, it was discovered that the the sighting was longer than at first thought. Their computer crashed and came back up after the craft left. The witnesses (Husband and wife) examined the computer and discovered that it was down up to two hours. Another witness, Said she was a sleep and told me that she was abducted and recalled being aboard the craft and passing a tall blonde haired man in a strange clothes. The reaction of the Animals was the dogs (across the street and all out side was wild barking and whining. The cats all scampered to the window and stared at the object."],"trends":["There have been 7 other sightings in Covington","There were no other sightings in Covington on or around April 9th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.086371,+-84.506104(47323)&iwloc=A&hl=en\"> mufon case (47323) map </A>","Case Number":"47323","Source":"MUFON","Summary":"A flattened cigar shaped craft hovered over four story building from 10 minutes to two hours.","Longitude":"-84.506104","Country":"United States","Object Features":"Appendage(s), Louvres","Tags":"City","Object Shape":"Cigar"}