{"Object Shape":"Circle, Fireball, Sphere, Unknown","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Longitude":"-73.061678","Region":"New York","Sighting Duration":"Undisclosed","Date Submitted":"05/10/2013 09:49 UTC","Source":"MUFON","trends":["There have been no other sightings in Bayport","This sighting has never been favorited."],"Disposition":"Unresolved","Country":"United States","Viewing Distance":"Over One Mile","Date of the Event":"04/06/2013 12:00 UTC","Latitude":"40.744792","Case Number":"47337","City":"Bayport","divs":["Sighting DetailsI was indoors when I heard my older sister and her best friend calling me frantically. (I am 61 and my sister is 63. Her best friend is about our age...) I thought someone had fallen down or something similar...When I got to where they were, outside on a patio deck connected to the house - I could now hear clearly what they were yelling. They were saying, UFO, Look!!! A UFO LOOK...!!! When I looked at what they were pointing to, I was sort of disappointed because I was expecting a saucer of something that was solid. Instead, what I say confused me because I remember saying to myself, 'how are they doing that?' What I was looking at appeared to be a roller coaster ride up in the sky about 50 feet above the distant treeline. A roller coaster ride though has a beginning and an end which I couldn't see. When this 'roller coaster' just kept traveling, I thought - wait a minute, that's not possible...This was an inner dialogue that I was having as I'm watching the objects and the time that this took for me to realize something was 'wrong' was about 10 seconds. The objects were reddish orange balls and seemed to be in groups of 4-6 connected in groups that were part of a 'train' that undulate up and down and I think initially seemed to emit a glow like trail inside or part of each group of balls..As I've said, they were going up and down, side-ways and moving in a direction - very much like a roller coaster would, except much more exaggerated as they got closer, or moved in a direction. The first appearance seemed to originate from Patchogue, coming from the South shore. This train of balls or roller coaster lights moved slightly West, towards us... I ran downstairs to the basement and retrieved a digital camera, ran back up and started to nervously taking photos. They seemed to slow down and spread apart always moving - except for a few seconds. Some of the lights seemed to freeze as I was taking pictures. They regrouped after a few seconds and continued in a North, North Easterly direction - until the lights seemed to fade out or just turn off... I would say that they seemed to maintain a general altitude of about 100 ft and they were about one mile away. Hard to say...Whatever it was had an order or control or intelligence that seemed 'special' and flew with a purpose of some type. It was a clear night and we could see at least two commercial airliners flying in the sky during the time we were seeing these objects. The commercial jets that we saw looked primitive compared to how these other objects traveled. Our jets flew much slow, blue lights blinking and in straight lines. Although I was very nervous I did take at least 3 or 4 photos which I will include. I called 911 and I was instructed to call some government agency that dealt with reports of terrestrial air plane problems. I forget the agency name. I called them and gave them this story but I gave some inaccurate info. I told the guy that the objects were heading in a Southwesterly direction instead of North, North Easterly direction. He took the info and said thank you and good bye."],"Summary":"At first seemed to be a 'floating roller coaster ride' in the sky but the red dots that seemed to have some form of connectedness just kept going northwesterly direction.","map":"<A HREF = \"http://maps.google.com/maps?q=40.744792,+-73.061678(47337)&iwloc=A&hl=en\"> mufon case (47337) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/47337.html.txt","/var/www/straped/mufon/org/47337.html"],"Object Features":"Other","Log Number":"US-05102013-0030"}