{"Country":"United States","trends":["There have been 188 other sightings in Austin","There was one other sighting in Austin on or around May 8th 2013"],"Disposition":"Unresolved","Source":"MUFON","City":"Austin","map":"<A HREF = \"http://maps.google.com/maps?q=30.273313,+-97.738861(47330)&iwloc=A&hl=en\"> mufon case (47330) map </A>","Object Shape":"Oval","Longitude":"-97.738861","Date of the Event":"05/08/2013 11:15 UTC","Latitude":"30.273313","Object Flight Path":"Path with directional change","Summary":"2 Orange/Amber objects descended from the NE, hovered at around 250 ft. then ascended gently going west","Case Number":"47330","divs":["Sighting DetailsLeaving the Whataburger at 11:15pm...prior to getting on Cameron Road I noticed a whirring sound and a few seconds later I noticed 2 light-objects moving from the NE toward my location and coming from hi to low elevation. There were 2 objects moving in a lose and changing formation in relation to eachother...they were descending toward my direction (I stopped the car immediately and got out to observe because of how strange they looked and moved...there was a very subtle wobble or side-to-side motion as they moved along. They stopped at an altitude between 200-300 feet, judging from the power-line height...they were very low and the whirring sound was very subtle and didn't last long. They would be pretty easy to miss because they did not give off light rays...they had a clear edge to them but still having an inherent orange illumination. As they moved westward above Hwy 290 I got back into the car and tried to follow. Somehow, without appearing to speed up they gained altitude and distance quickly...out of site by the time I reached the access road of Hwy 290 from Cameron Road. I moved onto 183North hoping to catch another siting of them but that wasn't successful. My girlfriend was in the car with me. She heard and saw the whole thing...we have a photo from her phone camera that we will upload soon for the report file. It clearly shows the 2 orb-like objects."],"Object Features":"None, Other","Weather Factors":"Unknown","Log Number":"US-05102013-0023","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/47330.html.txt","/var/www/straped/mufon/org/47330.html"],"Region":"Texas","Sighting Duration":"Undisclosed","Date Submitted":"05/10/2013 06:40 UTC","Tags":"City"}