{"Summary":"Sighted object atop and bobbing below treeline 1 mile away, moving west to east - it left sight, then returned- 5 times observed during 3 hours. Flashing 4 colors lights - looked random.","Tags":"City","trends":["There have been 9 other sightings in Brownsburg","There were no other sightings in Brownsburg on or around May 16th 1996"],"Object Features":"Unknown","Date of the Event":"05/16/1996 03:18 UTC","Disposition":"Unresolved","Log Number":"US-05102013-0025","Latitude":"39.854331","files":["/var/www/straped/mufon/html2text/47332.html.txt","/var/www/straped/mufon/org/47332.html"],"Case Number":"47332","Region":"Indiana","Object Flight Path":"Path with directional change,Other","Country":"United States","Date Submitted":"05/10/2013 08:07 UTC","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-86.428071","Weather Factors":"Unknown","divs":["Sighting DetailsIn the predawn morning of May 16, 1996: (There were two other witnesses, and I have never reported this before - but now I may be dying, and want this told to someone, whether investigated or not.) I was out on our brick patio behind the house, with a clear view of 200 degrees or so, from southeast, arcing through west, to northeast. The morning was clear, although there had been some clouds earlier (and before midnight on the 15th). I do not recall the phase or position of the moon. A flash of light to my left, roughly 220 degrees True, (I am a retired submarine navigator)and Position Angle about 20. The object moved slowly and steadily toward the west, which was from my left to my right, as I had been facing west. I could not at that time judge distance or size - but if it had been a ship at sea, I'd have estimated its angle-on-the-bow, based on its direction of travel, to be about starboard 10 to 20. There was nothing under it that I could see. From knowing this area, I know that at that time, the land in that direction was crop-fields for corn and soya, early in the season for either. Since that time a few housing developments have been built. My first chance to get an idea of size and distance came after several minutes, when the object flew over the southern end of a long tree-line, which ran south-to-north for about 1.5 miles. The tree-line's closest point to my house is slightly under a mile (land measurements given here). Once over the tree-line, I could confirm what before I had known might be an optical illusion: the course and speed of the object seemed steady, but it was definitely bobbing up and down. The tree-line was very uniform in height - but the craft was bobbing below it and out of sight, and then well above it as it moved. At this point I called my two teen-aged children, and was relieved that when I returned to the patio, the object was still there, moving exactly as before. We watched it until it passed out of our line of sight. I remained outside, and it returned 36 minutes later, reversing its previous path. I checked with the night editor of the Indianapolis Star to ascertain if anyone had reported anything unusual in the sky that night. He said that no one had, and asked me what I had seen. I gave him a brief description, and then I asked him if he thought that it could possibly have been the GoodYear Blimp, which was in the area to promote the upcoming Indianapolis 500, run on Memorial Day weekend. He said that it didn't sound like a blimp, and then he put me on hold and came back a minute or so later to tell me that the Blimp was not aloft, anywhere, at that time. I thanked him and hung up, not leaving my 'phone number or name. The nearest I can come to comparing the object to anything familiar, would be to say that in light-pattern, it somewhat resembled a police car's rooftop bank of lights - although the colors were not the same, and the size, which I estimate to be 500+ feet from first-light-to-last-light. Most of the time I thought I could make out dark silhouettes beneath the lights, and above it, extending out from each end of the lights both 'fore and aft. (This does not exclude, say, a saucer-shape, or most shapes - this is merely the way it looked, as it bobbed up and down behind the tree-line and then back again, as if on a rounded or straight course, but seeming always to be moving in roughly a straight line.) But again, I cannot be certain of the silhouettes. Then seemed more evident as I looked away, of couse, but the lights obscured any real chance for a good observation of the rest of the object."],"Object Shape":"Cigar, Other","City":"Brownsburg","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.854331,+-86.428071(47332)&iwloc=A&hl=en\"> mufon case (47332) map </A>","Sighting Duration":"Undisclosed"}