{"Country":"United States","Object Shape":"Unknown","City":"Hacienda Heights","Sighting Duration":"00:00:01","trends":["There have been 4 other sightings in Hacienda Heights","There were no other sightings in Hacienda Heights on or around May 9th 2013","This sighting has been favorited 1 time.",""],"Weather Factors":"Unknown","Date Submitted":"05/10/2013 09:43 UTC","Region":"California","Source":"MUFON","Longitude":"-117.945597","Log Number":"US-05102013-0029","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.983951,+-117.945597(47336)&iwloc=A&hl=en\"> mufon case (47336) map </A>","divs":["sighting detailsi am a california state licensed branch 3 (wdo inspector #43953), or better known as a \"termite\" inspector. i take pix during my inspections to document my findings so later when i write my report, i can go back & review. i was in hacienda heights just finishing my inspection. later (today 5\\10\\13), while going over the pictures i had taken for this inspection, i noticed an anomoly in one of the last shots i took while facing west\\north-west. hey folks, i am not claiming this to be a ufo! for all i know, it is some sort of lens flare or other explainable occurrence, but because it seems to have solidity and it is unlike anything i would usually see in the sky, i thought i'd send it to the experts for further analysis. maybe it's nothing at all, but i'll let you determine that. i heard nothing...i saw nothing...i felt nothing. i simply found a strange object in my picture and want you to take a look. to be honest, it looks a lot like a drywood termite swarmer (ironic), but a bug would not show up like this unless it was huge, like the size of a car---not to mention, drywood termites don't start their swarming season until september. again, i'm not holding my breath here. p.s.---i was using my iphone 5 to take the pictures"],"Object Flight Path":"Unknown","Case Number":"47336","Date of the Event":"05/09/2013 03:30 UTC","Latitude":"33.983951","Object Features":"Unknown","Summary":"Found anomoly in picture / did not see","files":["/var/www/straped/mufon/html2text/47336.html.txt","/var/www/straped/mufon/more/47336_submitter_file1__ANOMOLYORIGINALPICTURE.JPG","/var/www/straped/mufon/more/47336_submitter_file2__ANOMOLYCLOSEUP.jpg","/var/www/straped/mufon/org/47336.html"],"Disposition":"Unresolved","Viewing Distance":"Unknown"}