{"Object Features":"Unknown","Latitude":"29.399762","Sighting Duration":"Undisclosed","Case Number":"47346","City":"Del Rio","Date Submitted":"05/11/2013 05:18 UTC","Tags":"City","Viewing Distance":"Over One Mile","trends":["There have been 12 other sightings in Del Rio","There were no other sightings in Del Rio on or around May 7th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=29.399762,+-100.910207(47346)&iwloc=A&hl=en\"> mufon case (47346) map </A>","Disposition":"Unresolved","Log Number":"US-05112013-0006","Country":"United States","Longitude":"-100.910207","Summary":"I was outside smoking a cig.looking up at the big dipper turned to my left and s aw 3 stars in a triangle pattern and one started moving after a minute just disappeared,but then I noticed another one","Region":"Texas","divs":["sighting detailswilliam hornbostel may 7,2013 i had gone outside to smoke a cigarette. i was looking up at the stars when i thought to myself \"is that star moving?\" i was looking at a spot in the sky where there were 3 stars in a triangle pattern, the top right star all of a sudden started moving.i looked away then back to refocus and realized that it was moving,off to the right. after a fer seconds it just disappeared. i didn't see any clouds at all and thought it was strange but it must have been a satellite. but right after it disappeared i noticed another one moving in the same direction same same level as if it were following the first one and disappeared just about the same spot. i thought to myself there is no way that that was a plane,or a satellite. i had never seen 2 satellites following each other before.i don't recall any color and they were not blinking,they looked just like all the other stars in the sky. i text ed my roommate to tell him that's how i got the time. the next day i was at work and i found a post from someone online that i believe saw the same thing. ufo blogger site i think.so i pulled up a map and tried to investigate a bit.i do believe i was looking in the direction of alpine texas n.w. and although the details were not exactly the same i do think we saw the same event. oh yeah and i had gone inside and posted it on facebook that night as well.the post is still there case number 47268 log number us-05082013-0015 date submitted 05\\08\\2013 11:17 utc date of the event 05\\07\\2013 10:15 utc source mufon disposition unresolved summary 2 blinking red lights seemed about 1\\4to1\\2 mile apart then faded away. i observed nearly 3 minutes, but they were already there when i went outside.city alpine region texas country united states latitude 30.363798 longitude -103.71"],"Object Shape":"Star-like","Date of the Event":"05/07/2013 10:35 UTC","Object Flight Path":"Hovering then path","Source":"MUFON","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/47346.html.txt","/var/www/straped/mufon/org/47346.html"]}