{"trends":["There has been one other sighting in Laveen","There were no other sightings in Laveen on or around May 1st 2013"],"divs":["sighting detailswhile outside, near or at sunset, facing south+\\-, looking for orion, i noticed a faint point of light that seemed to be moving near where i thought the constellation should be. as i watched, the object flickered and began a rapid acceleration away from the patch of sky i was watching and disappeared over the mountains to the southwest. a short time later, in the same general area, after orion's belt became visible, a similar pinpoint of light (faint star-like) caught my attention, but closer to directly south of my location. again, it flickered and moved away at a seemingly impossible speed, leaving a faint streak as it accelerated. this same type of \"light\" appeared over and over, in more or less the same general area of the sky for an extended period of time, each time ending with the light flickering slightly then accelerating away at fantastic speed until i lost sight of them. although not shown in the check boxes above (because the options you offer do not cover the general observations i observed) i noticed the same thing happening in nearly every sector of the sky, around the clock, only during the day they are much more visible (provided the sky is not cloudy) and the objects are easily visible to the naked eye if you know where and when to look. the flashes during the day are as bright as a flash bulb going off and i can see the distortion of the air around the objects, then, when several are in formation, they all fly off at a high volocity. i have been watching this happen now for about two weeks and have noticed that there are several maneuvers the objects make that i had not noticed before; as a formation moves away, it will stop briefly then accelerate at a right angle, dip slightly at which time several of the objects in the formation will sling-shot away from the main body of formation, often in different directions but most often straight up, showing a faint trail\\tail of light behind each, each exceeding the altitude of the previous object until there are 5, 6, or 7 tiers high, then the entire formation accelerates away in the new direction at unbelievable speed leaving a disturbance in the atmosphere that can be seen by the naked eye. i have tracked them orbiting the laveen area while i put a laser on them until i get too dizzy to keep up, then they jet away -- out of sight. (when i put the laser on them, they don't leave until i stop tracking them with the beam). this has been happening around the clock as far as i can tell and i have counted as many as one craft per second materializing and joining a formation, then going into the above described behavior over and over again; the highest number i have counted in one formation is 20 before it started moving away and i lost count. my sightings are not limited to just laveen\\south phoenix; i have observed them in north phoenix, the west valley, the apache junction area and over the reservation to the south of phoenix. when viewed from the side at a distance, i can make out an actual vessel above the distortion. in addition, i have now noticed that this same activity has been captured on video where the subject being filmed is outdoors with a lot of sky in the background, on television. i have captured these activities myself on a small kodak ten mp still\\video camera from my back yard (video files attached). i do not have the expertise or software\\hardware to edit the clarity or contrast of the footage, but someone with the right equipment and software can clean it up and make the objects stand out better. please note that the time\\date stamp on the files is off because the battery went dead and i did not reset the time and date on the camera. if you have any questions, please feel free to contact me at the number above. kind regards"],"Case Number":"47343","map":"<A HREF = \"http://maps.google.com/maps?q=33.413337,+-112.1692(47343)&iwloc=A&hl=en\"> mufon case (47343) map </A>","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Sighting Duration":"Undisclosed","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/47343.html.txt","/var/www/straped/mufon/org/47343.html"],"Country":"United States","Region":"Arizona","Longitude":"-112.1692","Date Submitted":"05/11/2013 03:56 UTC","Object Shape":"Boomerang, Bullet, Missile, Chevron, Circle, Diamond, Disc, Fireball, Flash, Sphere, Star-like, Triangle, Other","Latitude":"33.413337","Viewing Distance":"501 Feet - 1 Mile","City":"Laveen","Summary":"small, star-like flash, brilliant large flash, orangish form appears, distortion/auora masks, then manouvers away in groups of 5 or more","Weather Factors":"Unknown","Log Number":"US-05112013-0003","Object Features":"None","Tags":"City","Source":"MUFON","Date of the Event":"05/01/2013 07:00 UTC"}