{"Date Submitted":"05/12/2013 05:09 UTC","Summary":"(GS) 6 to 10 bright orange orbs. 2 were traveling east to west while the otthers hovered. 1 desended to almost the horizon the ascended again. Possibly chinese lanterns?","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path","Object Features":"None","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Tags":"City","Log Number":"US-05122013-0010","Longitude":"-116.995516","Object Shape":"Sphere","Region":"California","Case Number":"47362","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.746564,+-116.995516(47362)&iwloc=A&hl=en\"> mufon case (47362) map </A>","Date of the Event":"05/11/2013 09:30 UTC","Latitude":"32.746564","Disposition":"Unresolved","trends":["There have been 4 other sightings in Spring Valley","There were no other sightings in Spring Valley on or around May 11th 2013","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/47362.html.txt","/var/www/straped/mufon/more/47362_submitter_file1__untitled.png","/var/www/straped/mufon/more/47362_submitter_file2__untitled1.png","/var/www/straped/mufon/more/47362_submitter_file3__untitled2.png","/var/www/straped/mufon/more/47362_submitter_file4__untitled3.png","/var/www/straped/mufon/more/47362_submitter_file5__untitled4.png","/var/www/straped/mufon/org/47362.html"],"divs":["Sighting DetailsThey might have been chinese lanterns but the flight path was a little strange for something like that. My girlfriend called me whilew she was driving home and told me to look up because there was 2 orange lights in the sky. I got excited and went out back to look but I couldnt see them. She tried to tell me where to look but it wasnt working. I couldnt find them. She was only a few blocks away so I ran out fron so she could pick me up and I could see them. She had already taken a few pictures on her phone and so were alot of other people who were driving next to her. After she picked me up she turned 1 corner and BAM! lights in the sky right in front of me. The 2 lower ones were hovereing and kind of moving side to side next to each other while the rest of them were motionless. 1 of them descended to almost to the horizon and then ascended again. We stopped a couple blocks after she picked me up to get a few more pictures. At this time several people were in there fron yards looking at the lights. 1 lady asked what they werew and I said they look like Ufos. and she said thats what she was thinking. We drove in there direction to get a better look and then another one appeared a little lower than them. After a few blocks they started dissapearing so we stopped to look again. At this time there was only 1 left and it kind of drifted up and dissapeared. The kinda looked like they were drifitin like baloons or lanterns at this point. But when I first saw them they were in a formation and not moving except for the 2 lowere ones. The light was flickerin like fire which made me think of the chinese lanterns. So I dont koow what we saw but it was really neat!!!!"],"Source":"MUFON","City":"Spring Valley","Country":"United States"}