{"Disposition":"Unresolved","Source":"MUFON","Region":"Minnesota","Longitude":"-92.481554","Case Number":"47364","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","divs":["Sighting DetailsIn the summer of 1981 or '82 I was 11 or 12 years old. We had a relative from Germany visiting, who was lets say was a \"higher up\" over there. He slept in my room so I was moved in my twin brothers room to sleep, he of course wouldn't give me the bed so I was to sleep on the floor. Well I couldn't sleep. So I got up at I'm guessing around 2am to look out the window to quell my boredom. My view of the sky was obstructed due to the over hang of our house and the neighbors roof. The space machine came soon after I went to the window, within 30 seconds. It came over the neighbors house towards our house and over it heading north. It was massive in size! It moved slowly and silently. It was the size and shape of a football stadium. I only saw the belly of the machine, the lights are still to this day undecidable. The entire thing was lite up and also had intricate lighting shades the same color detailing \"instruments\", to say it was neon lighting does it no justice. But that is the closest I can come to describing it. The absolute beauty of this machine was amazing. It simply glided over the house and I assume continued on it path north. I was fixed on looking at the object so I don't know if the ground was lite up. I was not scared at all, I was in complete awww, I new it was not from this planet. I told no one, not even my brother for years, back then you just didn't talk about stuff like that. I will always regret not doing more at the time but I was just a kid. I did also check my self at the time to insure I was not dreaming. I did thou do my own interrogation the next day of our company but I found out nothing. I will disclose every thing if I am asked. It's time the truth comes out of what and who is really out there. Thank you, Laura"],"Date Submitted":"05/12/2013 06:36 UTC","City":"Rochester","files":["/var/www/straped/mufon/html2text/47364.html.txt","/var/www/straped/mufon/org/47364.html"],"Object Flight Path":"Straight-line path","Tags":"City","Object Shape":"Oval","Latitude":"44.065419","Log Number":"US-05122013-0012","trends":["There have been 13 other sightings in Rochester","There were no other sightings in Rochester on or around July 15th 1981"],"Date of the Event":"07/15/1981 02:00 UTC","Country":"United States","Object Features":"Patterned Surface","map":"<A HREF = \"http://maps.google.com/maps?q=44.065419,+-92.481554(47364)&iwloc=A&hl=en\"> mufon case (47364) map </A>","Summary":"massive in size, lights covered entire belly, with darker detail around intricate(parts)"}