{"Disposition":"Unresolved","Object Shape":"Circle, Sphere, Other","City":"Madison","Latitude":"38.796852","Region":"Indiana","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI'm not sure how to decribe what I saw it kinda looked like the moon but redish orange and the moon was on the other side of me . It reminded me of the sun setting the path of it that is but I had just watched the sun set 2 hours before. When I first starting watching it it had the shape of a cerset moon. I went inside to plung in my camra and when I came back out I couldn't see it. 1 min later my son went out and came right back in and said he could see it again. By the time I got out there it looked like a full cicle black on the inside and redish orange on the outer ring which kinda made me think I was watching an eclispe. I was able to get a few pics before my camra died while it looked like a creset moon but I wasn't able to get one of the full cicle before I couldn't see it any longer. I lost sight of it it looked like it went down like the sun does at sunset. I have a love for the moon and am often taking shots of the stars and moon but I haven't and clue what it was that I and my 13 year old son seen. It was like nothing I have ever seen before!"],"Country":"United States","Summary":"I'm not sure how to decribe what I saw it kinda looked like the moon but redish orange and the moon was on the other side of me . It reminded me of the sun setting the path of it that is but I had just watched the sun set 2 hours before.","Date Submitted":"05/13/2013 12:13 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.796852,+-85.410772(47378)&iwloc=A&hl=en\"> mufon case (47378) map </A>","Tags":"City","Log Number":"US-05132013-0003","Case Number":"47378","Source":"MUFON","Object Features":"Unknown","Object Flight Path":"Other","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/47378.html.txt","/var/www/straped/mufon/more/47378_submitter_file1__IMG5726.JPG","/var/www/straped/mufon/more/47378_submitter_file2__IMG5727.JPG","/var/www/straped/mufon/more/47378_submitter_file3__IMG5728.JPG","/var/www/straped/mufon/more/47378_submitter_file4__IMG5729.JPG","/var/www/straped/mufon/org/47378.html"],"Date of the Event":"05/12/2013 10:45 UTC","trends":["There have been 4 other sightings in Madison","There were no other sightings in Madison on or around May 12th 2013","This sighting has never been favorited.",""],"Viewing Distance":"Over One Mile","Longitude":"-85.410772"}