{"Date of the Event":"04/07/2013 09:15 UTC","Object Features":"Unknown","Summary":"Noticed what first appeared to be a satellite moving west to east","Country":"United States","City":"Glen Rose","Object Shape":"Circle","Viewing Distance":"Unknown","Log Number":"US-05122013-0023","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=32.169299,+-97.787896(47375)&iwloc=A&hl=en\"> mufon case (47375) map </A>","Sighting Duration":"Undisclosed","Date Submitted":"05/12/2013 11:57 UTC","Case Number":"47375","trends":["There have been 8 other sightings in Glen Rose","There was one other sighting in Glen Rose on or around April 7th 2013","This sighting has never been favorited.",""],"Latitude":"32.169299","files":["/var/www/straped/mufon/html2text/47375.html.txt","/var/www/straped/mufon/org/47375.html"],"divs":["Sighting DetailsI was on the north side porch looking at the sky. I noticed an object in the western sky at about 10 o'clock that appeared to be a satellite. After watching for a moment, I moved to the yard and the object began to brighten. I realized that it was not a satellite because the object was not only larger than a satellite, but a lot brighter. I then began to look for blinking lights of an aircraft thinking that it could be a plane. After further observation, there were no blinking lights. I called my wife's phone, who was inside the house, to come and see. My younger son answered her phone. I told him to come outside quick to see this. He and my oldest son ran outside to see. We all witnessed the craft dim to the point that it looked as if it could be a satellite except for it's larger size. My oldest son pulled out his phone and started the 22 second video. We were witnessing it get so bright white that it burned our eyes; we saw spots afterwards. It began to dim a little as it went behind trees. I sent my youngest son in to get my wife and my oldest son climbed up onto the roof to get a better, unobstructed view. Now my oldest son's observation from the roof was that it was dim again. He reached to get his phone to get another video, but the object got extremely bright and went straight over to the east and gradually curved up like the blade of a knife and after a couple seconds, it disappeared. He wasn't able to get a second video before it was gone."],"Longitude":"-97.787896","Source":"MUFON","Weather Factors":"Unknown","Region":"Texas","Tags":"City","Disposition":"Unresolved"}