{"Viewing Distance":"501 Feet - 1 Mile, Unknown","Latitude":"38.99192","Date Submitted":"05/13/2013 12:01 UTC","Region":"West Virginia","Longitude":"-80.230157","map":"<A HREF = \"http://maps.google.com/maps?q=38.99192,+-80.230157(47376)&iwloc=A&hl=en\"> mufon case (47376) map </A>","Source":"MUFON","Summary":"Saw 6 glowing orange orbs coming from the NE going toward SE","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/47376.html.txt","/var/www/straped/mufon/org/47376.html"],"Object Features":"Unknown","Country":"United States","Tags":"City","trends":["There has been one other sighting in Buckhannon","There were no other sightings in Buckhannon on or around May 11th 2013"],"Sighting Duration":"Undisclosed","Date of the Event":"05/11/2013 10:15 UTC","Object Flight Path":"Straight-line path","Case Number":"47376","Log Number":"US-05132013-0001","Weather Factors":"Unknown","Disposition":"Unresolved","divs":["sighting details1)i was at my residence, i was on the second floor, walking from one room to another. 2)& 4) i looked out one window towards the ne and saw five large red-orange orbs coming slowly towards the se. i went to another window and saw an additional orb \"catching\" up to the other five. they were not in a straight line but looked as if each was flying side by side. the last one was catching up to the others. i opened the window to listen for any noise to rule out any type of aircraft,there was none. 6)in then went down stairs and out the back door to watch from outside, the orbs were either covered by clouds or had gone behind the large pine trees in the back yard and out of sight. there still was no noise from a craft. there were no planes in the sky,as flights come over our area day and night enroute to large airports. 3)when i first saw them i knew that they were ufo's as i knew that they were not any aircraft. i know what a helicopter and aircraft front nose lights look like and their color, these looked like the front nose lights but were orange instead of white and larger. 5)i was excited to see them, we don't have sightings around here very often. i went into the living room and told my daughter and husband what i had seen and that the orbs were gone, otherwise, they could have come out and as witnesses. i was in a state of happiness, and glad to have finally seen craft(s), i have not seen any for many years. i slept really well, and had no issues from this incident. however, i was upset that i couldn't have watched longer and that my family could not have seen them, i am sure of what i saw! today, may 12th, 2013, my daughter called and she had been talking to some friends who had also seen the orbs but they were more upset at seeing them. i think they were scared because we just don't have sightings here. i can get their names although i do not know them, if it is necessary. personally, it was interesting and exciting (not in a scary way) but knowing \"they\"\\beings exist and are showing themselves more and more throughout the world, is exciting! no pictures were taken the time was too short, should they reappear, i will try to get pictures."],"City":"Buckhannon"}