{"Region":"Texas","Summary":"Bright light in the sky that moved from west to east","Tags":"City","Log Number":"US-05132013-0004","Viewing Distance":"Unknown","Longitude":"-97.783136","divs":["Sighting DetailsOn the night of April 7th, 2013, I was on our north facing porch looking up at the sky. I noticed at about the 10 o'clock position in the sky, what appeared to be a satellite moving west to east. Upon further observation, I noticed that it was too big and bright to be a satellite. I moved down off of the porch onto the yard. I began looking for blinking lights signifying an airplane. When I saw no blinking lights, I called my wife's phone for her and the kids to come out and view the object. My youngest son answered my wife's phone and I told him to get oldest son and to come out right away. We observed the object dim and then brighten at which point the oldest son began the 22 second video with his camera phone. The object then became extremely bright to the point of burning our eyes and then dimmed a little. I sent the youngest son in to get my wife to see. Before she could come outside, the object disappeared behind the trees going east. My oldest son then climbed on the roof to get an unobstructed view as it proceeded toward the general vicinity of Comanche Peak Nuclear Power Plant. He climbed to the highest point of the roof holding onto our chimney. The object brightened again as he was getting his phone out to video. At this point, the object increased in speed and curved upward like a blade of a knife and then disappeared before he could catch another video."],"Country":"United States","Object Features":"Unknown","Sighting Duration":"00:10:00","Latitude":"32.176169","Object Flight Path":"Straight-line path","Source":"MUFON","trends":["There have been 8 other sightings in Glen Rose","There was one other sighting in Glen Rose on or around April 7th 2013","This sighting has never been favorited.",""],"Date Submitted":"05/13/2013 12:21 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.176169,+-97.783136(47379)&iwloc=A&hl=en\"> mufon case (47379) map </A>","files":["/var/www/straped/mufon/html2text/47379.html.txt","/var/www/straped/mufon/org/47379.html"],"Object Shape":"Circle","City":"Glen Rose","Weather Factors":"Unknown","Date of the Event":"04/07/2013 09:15 UTC","Case Number":"47379","Disposition":"Unresolved"}