{"Country":"United States","Disposition":"Unresolved","Date of the Event":"05/12/2013 09:20 UTC","Source":"MUFON","Latitude":"31.913656","trends":["There have been 8 other sightings in Comanche","There were no other sightings in Comanche on or around May 12th 2013","This sighting has never been favorited.",""],"divs":["Sighting DetailsI was traveling southwest on a main highway when a light in the sky caught my attention. This light was, at this time,directly in front of me. My first thought was that it was a very large falling star but quickly realized it was flying a straight path across the sky to the north. I also quickly realized it resembled nothing I had seen in the past such as a helicopter, weather balloon or airplane. It had no flashing or multicolored lights like you would see on an airplane or helicopter. I pulled over on the side of the rode trying to find my iphone which took me several seconds. I finally found it and jumped out of the car. By this time it was to the west. It was spherical and a dark orange in color. The center of the sphere was a pale yellow or off-white color. By the time I got my phone on video mode, it was going behind a tree then vanished before I could reposition myself on the other side of the tree. It must have turned toward the NW but seemed to have disappeared very quickly. If it was an airplane, I should have been able to see the lights once I was on the right sight of the tree. Another witness had stopped to watch it down the road from me. She was heading NE. She drove up to where I was parked and said, \"Did you just see that?\" We both were nervous and excited about what we had just witnessed. Neither one of us had ever seen anything like it before and we are both over 40. We had the exact same perceptions re: color, speed, size, etc. and both agreed it did not look like a typical aircraft of any kind. My video only captured it for a fraction of a second as it was going behind a tree. In the video, it's the orange light that goes through the trees, not the bright white light above it."],"Region":"Texas","Object Features":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-98.563366","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/47377.html.txt","/var/www/straped/mufon/org/47377.html"],"Object Flight Path":"Path with directional change","Case Number":"47377","Log Number":"US-05132013-0002","Date Submitted":"05/13/2013 12:05 UTC","Viewing Distance":"Unknown","Object Shape":"Sphere","Summary":"Large glowing orange ball or sphere of light traveling slow across western sky","map":"<A HREF = \"http://maps.google.com/maps?q=31.913656,+-98.563366(47377)&iwloc=A&hl=en\"> mufon case (47377) map </A>","City":"Comanche","Tags":"City"}