{"Country":"Guam","Object Features":"Unknown","City":"Talofofo","Longitude":"144.753056","Viewing Distance":"Unknown","Log Number":"GU-05132013-0011","Source":"MUFON","Date of the Event":"05/12/2013 07:45 UTC","Tags":"City","Object Shape":"Circle","Disposition":"Unresolved","Region":"","Case Number":"47386","Date Submitted":"05/13/2013 07:15 UTC","trends":["There have been no other sightings in Talofofo","This sighting has never been favorited."],"Summary":"3 separate bright (Venus bright) red lights appeared low in the western sky at ~1945 local Guam time, approached to the east, stopped, hovered, and made a hairpin turn to the WNW and faded into the night sky.","files":["/var/www/straped/mufon/html2text/47386.html.txt","/var/www/straped/mufon/org/47386.html"],"Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Latitude":"13.351667","map":"<A HREF = \"http://maps.google.com/maps?q=13.351667,+144.753056(47386)&iwloc=A&hl=en\"> mufon case (47386) map </A>","divs":["Sighting DetailsOn Guam, on 12 May, at about 1945 local time (0945 GMT) both my wife and I saw 3 separate, bright (Venus bright) red, moving lights in the western sky. The 3 lights were at about 15-20 degrees of elevation and about 245 to 260 degrees of azimuth. They were separated by about 5 degrees of azimuth, at approximately the same elevation, and all three were near the elevation of Orion, the moon and Jupiter, but approximately 15 degrees south of them. The objects made no noise that we heard, but moved towards us (to the east) and then made hairpin turns to the WNW and faded into the night sky. The entire event lasted no longer than about 5 minutes. We called ATCC at both the Won Pat International Airport and Anderson Air Force Base. Neither reported seeing anything on their radar during that time period. One of us is a private civilian pilot and a holder of a Ph. D. in Oceanography with much experience observing the night sky. Nothing of this nature has ever been seen before by this reporter."],"Sighting Duration":"Undisclosed"}