{"Country":"United States","Sighting Duration":"Undisclosed","Region":"Nevada","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=35.978222,+-114.834512(47383)&iwloc=A&hl=en\"> mufon case (47383) map </A>","Summary":"directly over us, huge, transparent but saw reflection of Vegas City lights on front edge","Tags":"City","Object Shape":"Boomerang","Case Number":"47383","Weather Factors":"Unknown","Date Submitted":"05/13/2013 02:41 UTC","Viewing Distance":"Over One Mile","Log Number":"US-05132013-0007","Longitude":"-114.834512","Source":"MUFON","Latitude":"35.978222","trends":["There have been 5 other sightings in Boulder City","There were no other sightings in Boulder City on or around September 13th 2001"],"City":"Boulder City","files":["/var/www/straped/mufon/html2text/47383.html.txt","/var/www/straped/mufon/org/47383.html"],"Date of the Event":"09/13/2001 12:00 UTC","Object Flight Path":"Straight-line path","Object Features":"Other","divs":["Sighting DetailsRight after 9-11, at about 4:30-5 am, still dark out, but cool enough for us to sit outside on our back patio drinking coffee as husband is getting ready to leave for work in Vegas. We both looked up at the same time (unexplainable, except we look at the stars often)and the lights of Vegas provided an outline on the forward edge of a really huge, silent, boomerang shaped object directly over us. Hard to determine the speed, but it was above us for several minutes before we lost it visually. The object we saw was transparent like a piece of clear window glass travelling across the sky from Boulder Dam towards Los Angeles. It was up there long enough for us to compare with each other what we were seeing. It was totally clear but sort of distorted the stars enough that you could see the shape of it. We have never reported it or done anything about it but we still talk about the incident often. Neither of us has ever heard about a transparent flying object before but we both know what we saw. Of course, we just looked at each other and remarked that we had definitely just seen an unexplained flying object. Since it was right after 9-11, it was pretty freaky trying to figure out what it was and why it was there in the first place. Right after that happened, the military moved in and took over the Hoover Dam and closed it for security reasons. The UFO was freaky but the military rolling into Boulder City to occupy the Hoover Dam was even freakier."]}