{"Summary":"Black sphere with orange light moving in arc like a meteor followed by another identical object on same path, then both meet then ascend together.","map":"<A HREF = \"http://maps.google.com/maps?q=40.403181,+-105.06542(47380)&iwloc=A&hl=en\"> mufon case (47380) map </A>","Latitude":"40.403181","Viewing Distance":"101-500 Feet","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Source":"MUFON","trends":["There have been 18 other sightings in Loveland","There were no other sightings in Loveland on or around May 12th 2013"],"Log Number":"US-05132013-0005","Region":"Colorado","files":["/var/www/straped/mufon/html2text/47380.html.txt","/var/www/straped/mufon/org/47380.html"],"Disposition":"Unresolved","Date Submitted":"05/13/2013 12:33 UTC","Longitude":"-105.06542","Object Shape":"Sphere","Date of the Event":"05/12/2013 08:05 UTC","Object Features":"Other","Country":"United States","City":"Loveland","Case Number":"47380","Tags":"City","Weather Factors":"Unknown","divs":["Sighting DetailsDaughter (age 12) witnessed event. She was standing outside in back yard of residential neighborhood for quite a while at sunset (her eyes were adjusted to ambient light). Her attention was drawn to the western sky by some especially rapidly moving white clouds. She saw a black, somewhat bumpy, spherical object with a steady glowing orange light moving in an arc. First thought: UFO! Then immediately afterward, thought it was actually a meteor about to hit the house. Ran to front yard, while shouting \"Look out!\" Lost sight of object. Ran back to the back yard (west) and saw an identical object traversing the same path. Ran to front yard (which faces east), saw both objects together at treetop level. Both objects continued to ascend together at constant speed at a slightly upward slant. She watched until they disappeared from view, then ran in to tell me. She thought she may have seen whirling blades, but is not sure about that. Witness is objective, interested in science, math, and physics and is not inclined to hysterics and does not lie. She does not read sci-fi, watch TV, or play computer games. She was extremely frightened by what she saw and concerned about a real danger of a collision from a physical object. She has perfect vision, does not wear glasses or anything. Wants it to be explainable as a toy or hobby remote control craft."]}