{"City":"Rohnert Park","divs":["Sighting DetailsDriving south on 101 I saw an object over Rohnert Park which appeared round, with red & blue pulsing lights, and lots of little white lights. I saw it from a mile north, down until I couldnt turn my head safely while driving. No place to pull over safely. I thought it was a UFO at first sight because it was unusual, and stationary. I noticed it as a fixed point, which I drove closer to. Upon passing, when I could look to my left to see it directly, it was about the size of a car, hovering in one place, and putting on a light show you'd expect at a rave, not on a flying vehicle. I felt to communicate with it telepathically. My thought was \"I can't believe what I'm seeing\" and I felt that an impulse came from the object to change my thought around it to \"I know what I'm seeing\". I was elated and wishing I could stop and look at it without having to drive. I was on a section of freeway where I couldn't pull over safely, so I couldn't stop and film it. I sent the feeling and message of love and peace, thumbs up. My gut feeling is whatever the intelligent source of this vehicle was, is very benevolent."],"Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Date Submitted":"05/13/2013 07:57 UTC","Source":"MUFON","Object Flight Path":"Stationary","Sighting Duration":"00:04:00","Longitude":"-122.693968","files":["/var/www/straped/mufon/html2text/47398.html.txt","/var/www/straped/mufon/org/47398.html"],"Country":"United States","Latitude":"38.345167","Case Number":"47398","Tags":"City","Region":"California","trends":["There have been 4 other sightings in Rohnert Park","There were no other sightings in Rohnert Park on or around February 8th 2013"],"Object Features":"None","Log Number":"US-05132013-0021","Summary":"I saw an object over Rohnert Park which appeared round, with red & blue pulsing lights,lots of little white lights. I saw it from a mile north, down until I couldnt turn my head safely while driving. No place to pull over safely.","map":"<A HREF = \"http://maps.google.com/maps?q=38.345167,+-122.693968(47398)&iwloc=A&hl=en\"> mufon case (47398) map </A>","Object Shape":"Disc","Date of the Event":"02/08/2013 09:20 UTC","Disposition":"Unresolved"}