{"Country":"United States","Summary":"An oval/oblong shape that was very bright orange like hot coals just hovering in the sky.","trends":["There have been 7 other sightings in Bay City","There were no other sightings in Bay City on or around May 4th 2013"],"Sighting Duration":"Undisclosed","Date of the Event":"05/04/2013 10:05 UTC","Tags":"City","Longitude":"-83.888522","Object Shape":"Fireball, Oval","Log Number":"US-05132013-0020","Source":"MUFON","Weather Factors":"Unknown","Region":"Michigan","map":"<A HREF = \"http://maps.google.com/maps?q=43.588582,+-83.888522(47397)&iwloc=A&hl=en\"> mufon case (47397) map </A>","Object Flight Path":"Hovering then path","Object Features":"Unknown","divs":["Sighting DetailsI am on the 6th floor of a highrise bldg and sitting on the sofa watching tv. During a commercial I looked outside like I always do. I saw a bright glowing thing up in the sky and jumped up and went close to the window. It was something I've never seen or heard of before. It was quite large considering how far it was from me and hard to explain what it looked like....could not see a structured vehicle because it was surrounded by a bright orange \"glow\" like hot coals in a campfire with no flames. I just kept staring at it trying to make sense of it, I didnt even think to grab camera or binoculors. I didnt want to leave the window because I just had to keep watching, I wanted to run tell someone but was afraid it would be gone. All of a sudden the orange glow shut off and I saw a very tiny red dot move away extremely fast heading west. It disappeared so fast it left me feeling shocked. I felt very afraid and closed my drapes. It was there for about 10 minutes while I was looking at it, I dont know how long it was there before I noticed it. I have never before seen anything in the sky,only planes, jets, helicopters,etc. I was shook up for hours afterwards. I found this website while trying to find out what I saw and if anyone else saw it. I think I'll keep a camera handy from now on."],"files":["/var/www/straped/mufon/html2text/47397.html.txt","/var/www/straped/mufon/org/47397.html"],"Viewing Distance":"501 Feet - 1 Mile","Case Number":"47397","Disposition":"Unresolved","Latitude":"43.588582","Date Submitted":"05/13/2013 04:54 UTC","City":"Bay City"}