{"map":"<A HREF = \"http://maps.google.com/maps?q=38.792663,+-104.730428(47403)&iwloc=A&hl=en\"> mufon case (47403) map </A>","Weather Factors":"Unknown","Region":"Colorado","Date of the Event":"05/11/2013 10:00 UTC","Longitude":"-104.730428","City":"Colorado Springs","Disposition":"Unresolved","divs":["Sighting DetailsI walked out in my backyard to let my dogs out. I saw three or four bright exploding lights directly overhead. High up in the sky. Five minutes later. I saw a black cloud or shadow low on the horizon heading my way. I thought it was a low storm cloud. It was dark and hard to see. I watched this cloud or black shadow continue to get closer. I lost sight of it a few times. All of a sudden it was coming over my back yard neighbors house.MY dogs started to bark like crazy. All I could see was a black dark shadow. I did not hear any noise other then my dogs barking. When it got over my carport and my next door neighbors house. the street light directly in front of my house came on. It has been not working right for a few months. When the light came on I immediately saw a dull gray object. I thought omg it's a drone. But it had no fuselage or tail. It had no rivets. And was smooth. there were no lights on it at all. I was less then a hundred feet from it. I only saw it illuminated for about four seconds. then I lost sight of it as it passed over the house. I was shocked. I let my dogs in as they were still barking. I got my camera went back outside got on my roof for about two hours. But did not see anything. I could not sleep. I don't understand what I saw."],"Country":"United States","files":["/var/www/straped/mufon/html2text/47403.html.txt","/var/www/straped/mufon/org/47403.html"],"Object Features":"Other","Case Number":"47403","Tags":"City","Summary":"I saw three exploding bright lights high up in the sky.Five minutes later I saw a black cloud heading my way.","Date Submitted":"05/13/2013 09:47 UTC","Source":"MUFON","trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around May 11th 2013"],"Sighting Duration":"Undisclosed","Viewing Distance":"21-100 Feet","Latitude":"38.792663","Log Number":"US-05132013-0025","Object Flight Path":"Path with directional change","Object Shape":"Boomerang"}