{"Object Shape":"Sphere, Star-like, Triangle, Unknown","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Country":"United States","Region":"North Dakota","Date of the Event":"05/15/2013 12:00 UTC","Weather Factors":"Unknown","Tags":"City","Log Number":"US-05152013-0002","Source":"MUFON","Summary":"watched a triangle craft proturde other crafts out of it and fly around and then gone.","map":"<A HREF = \"http://maps.google.com/maps?q=47.117416,+-101.301215(47419)&iwloc=A&hl=en\"> mufon case (47419) map </A>","Date Submitted":"05/15/2013 01:28 UTC","divs":["Sighting Detailsi was outside smoking and looked up like i always do at the sky. Then seen three trangle shaped crafts above me moving in circles in the sky and they looked like they were moving as one. then shot fast to the north of me and stayed moving around as said before. then i had seen orbs of light commming out of them flying around orbiting around the triangles shot a few beams of light to eachother for about 10 min. and then darted across the sky for about another 40 min. as the trianlge crafts were moving back to me. then the orbs had gone into the triangles and shot fast in the sky upwards and were gone. then four smaller dots blinking and flasing were sitting in the sky for about another 30 min moving sparaticly through the sky and making fast and slow blinking lights and got realy realy bright then dissapered like a ghost in the night and this is not my first sighting i have seen i see them about 3 to 4 times a week and have counted more than 16 crafts in the sky that i know are not planes from my military service that i have done."],"Case Number":"47419","trends":["There have been no other sightings in Center","This sighting has never been favorited."],"Longitude":"-101.301215","files":["/var/www/straped/mufon/html2text/47419.html.txt","/var/www/straped/mufon/org/47419.html"],"Viewing Distance":"Unknown","Latitude":"47.117416","Object Features":"None","City":"Center","Disposition":"Unresolved","Sighting Duration":"Undisclosed"}