{"Source":"MUFON","divs":["Sighting DetailsMy family and I were on the lake..been out there all day..we threw out some floats for cat fish around 8pm and headed back to the docks slowly cruising on the pontoon boat. as we can around the bend of one of the bays we could see the lights from the docks ..just above all the lights there was a small very shiny \"star\" i said to my son \"aw look at that star\" we all looked ..then it got bigger and and bigger..the light was so bright ..but didn't have a beam as anyother light would when shining at night...then as it came closer tp the boat wr stopped shut the boat off..the light started to dim...then it came about 30 ft from the boat or less. and hovered for a min or two..the slowly went to the left as it hovered over the water there were pulsating lights of silver tint it wasn't a huge craft but it waz big ..the light was so brighy at the beginning of the sighting it was unreal..it was so close to us and it was transparent or black at the same time ..i think i could see thru it but it was black at the same time..maybe from the sky i don't know.. it was pretty incredible"],"files":["/var/www/straped/mufon/html2text/47415.html.txt","/var/www/straped/mufon/org/47415.html"],"Viewing Distance":"20 Feet or Less, 21-100 Feet","Date Submitted":"05/14/2013 06:00 UTC","Region":"Arkansas","City":"Mountain Home","Tags":"City","Disposition":"Unresolved","Date of the Event":"05/12/2013 12:00 UTC","Object Flight Path":"Hovering then path,Path with directional change","Longitude":"-92.381346","map":"<A HREF = \"http://maps.google.com/maps?q=36.335395,+-92.381346(47415)&iwloc=A&hl=en\"> mufon case (47415) map </A>","trends":["There have been 6 other sightings in Mountain Home","There were no other sightings in Mountain Home on or around May 12th 2013"],"Case Number":"47415","Latitude":"36.335395","Country":"United States","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Summary":"triangular aircraft with no noise","Object Features":"Other, Unknown","Object Shape":"Star-like, Triangle, Other, Unknown","Log Number":"US-05142013-0010"}