{"Region":"California","Case Number":"47410","Summary":"Three giant white lights in a check mark formation","Longitude":"-118.135255","Tags":"City","Weather Factors":"Unknown","divs":["sighting detailsmy friend and i were going to ralphs to pick up some milk. as an avid sky watcher i forst noticed them while driving. we get to ralphs and park, and see them perfectly. we looked up and saw two giant bright white\\orange-yellow lights that didnt flash, almost directly on top of each other. they were not moving. other planes and helicopters were flying around, and they were all tremendously smaller, were all flashing and were moving. out of thin air a third one appeared, it was not cloudy nor was it hidden behind a building, tree, etc. the three than proceeded to make a check mark formation, still remaining just as big and bright and not flashing or blinking, and they seemed to almost teleport into position instead of move. they stayed stationary and hovering for two minutes, all the while other aircraft were flying around them. we had to go in a store for less than a minute, and when we came back there was not a trace of them anywhere. we looked all over the sky and drove around a bit, but did not see them again. when i first noticed it, i thought it was a helicopter. but it was too big, too bright, not flashing or blinking, and was not moving at all. i was extremely excited, because i have never seen aircraft make a checkmark position. they were brighter, yet still very high, than anything aircraft i've seen before, and literally did not move. i immediately grabbed my phone and started taking pictures."],"Date Submitted":"05/14/2013 01:44 UTC","trends":["There have been 9 other sightings in Downey","There were no other sightings in Downey on or around May 13th 2013","This sighting has never been favorited.",""],"Object Features":"Unknown","Viewing Distance":"Over One Mile","Date of the Event":"05/13/2013 09:21 UTC","Disposition":"Unresolved","Sighting Duration":"00:03:00","Object Shape":"Fireball, Star-like","Log Number":"US-05142013-0005","map":"<A HREF = \"http://maps.google.com/maps?q=33.933126,+-118.135255(47410)&iwloc=A&hl=en\"> mufon case (47410) map </A>","files":["/var/www/straped/mufon/html2text/47410.html.txt","/var/www/straped/mufon/more/47410_submitter_file1__image.jpg","/var/www/straped/mufon/more/47410_submitter_file2__image.jpg","/var/www/straped/mufon/more/47410_submitter_file3__image.jpg","/var/www/straped/mufon/org/47410.html"],"Source":"MUFON","Object Flight Path":"Stationary,Hovering then path","Latitude":"33.933126","City":"Downey","Country":"United States"}