{"Longitude":"-79.441157","Summary":"I was told by 2 coworkers that they seen this event 2 weeks earlier. (they told me before i actually seen the same)","Object Features":"Unknown","Tags":"City","Log Number":"US-05152013-0012","Date of the Event":"05/04/2013 10:30 UTC","Case Number":"47429","Sighting Duration":"00:21:00","Date Submitted":"05/15/2013 08:00 UTC","City":"Brocton","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Region":"New York","files":["/var/www/straped/mufon/html2text/47429.html.txt","/var/www/straped/mufon/org/47429.html"],"trends":["There has been one other sighting in Brocton","There were no other sightings in Brocton on or around May 4th 2013"],"Object Shape":"Disc","divs":["sighting detailsi was told by 2 coworkers that they seen these lights , objects, etc, 2 weeks, on a saturday, before i did. i seen 5 orange ufo's back in june 1984, which was also witnessed by several others including law enforcement. i have always studied the skies since my exp. in 1974. after my 2 co workers told me their story, which i believed them, as i interviewed the seperately, i just kind of kept their stories in my thoughts. on 04may13, my only day off of work, i started to do work around the house, as the weather was starting to let us all get some outdoor duties done. my friends described their incident as follows: sighted was approx. 25-30 red circular lights, very high up, no sounds & observed for about 15 mins. but, they said that the 25-30 were being led by a lone red light or? ahead of them.. when i seen them 2 weeks later, there were the same amt of lights, in a non formation pattern & at least 5 of them, breaking formation & doing little lite tricks or showing off if you will. but in my case, the lone ufo, (lite or ?) was at the rear of the undisciplined formation. i observed them for approx. 21 mins. i watched them till they disappeared. during this timetable, a jet airliner was above. it was moving at its reg speed, with red\\green lights. the ufo's, which were much, much higher were moving slow except for when the 5 were doing their little tricks for us, on earth to see. i know that these were ufo's as i have been amazed by them since 1974.my feelings are that, i remained calm . i enjoyed seeing them, once again & i would share my story with anyone who wants to hear it. i was a member of mufon, many years ago then dropped out due to military commitments. i would like to rejoin."],"Viewing Distance":"Over 1 Mile, Unknown","Latitude":"42.388669","Disposition":"Unresolved","Country":"United States","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.388669,+-79.441157(47429)&iwloc=A&hl=en\"> mufon case (47429) map </A>"}