{"Date Submitted":"05/15/2013 07:02 UTC","Source":"MUFON","Longitude":"-122.758233","Date of the Event":"05/15/2013 12:00 UTC","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Summary":"Round Object Light Flare (Intense White to Medium) with directional movement near star cluster \"Big Dipper\"","Weather Factors":"Unknown","Case Number":"47428","Log Number":"US-05152013-0011","Country":"United States","Latitude":"45.401946","Disposition":"Unresolved","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Object Features":"None","Region":"Oregon","trends":["There have been 4 other sightings in Tualatin","There were no other sightings in Tualatin on or around May 15th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=45.401946,+-122.758233(47428)&iwloc=A&hl=en\"> mufon case (47428) map </A>","divs":["Sighting DetailsWas watering my dog at 12:05 am, May 15th, 2013, prior to retiring and observing sliver of moon due west of my location, and transiting faint satellite headed south from north between myself and the moon. As I glanced up directly overhead to the \"Big Dipper\" star cluster, a large white light flared up near the second planet on the \"Handle\" of the Big Dipper, I first thought it was a Meteor burning up \"head on\" to my perspective as it was an instantaneous intense white light, then settled down to a smaller white glow about the intensity of the Space Station flying over. The object during the flare phase did not move, but as it started to settle down, it physically moved in a South East direction for the equivalent length two of the planets of the \"Big Dipper\" handle, then sharply changed direction to a due North direction until is was directly under the bottom of the \"pan\" of the Big Dipper, where it appeared the light started to fade out as if it was leaving directly away (going away) from the Earth. The whole episode took about 20 seconds. Unfortunately no photos or video, but intrigued to see if anyone spotted this event. There were no aircraft in the vicinity, and no nearby clouds for perhaps reflections."],"City":"Tualatin","Tags":"City","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/47428.html.txt","/var/www/straped/mufon/org/47428.html"]}