{"Object Shape":"Flash","map":"<A HREF = \"http://maps.google.com/maps?q=33.457377,+-112.071067(47434)&iwloc=A&hl=en\"> mufon case (47434) map </A>","Summary":"unsure if was ufo, two extremely bright blue flashes lit the entire sky from the horizon up, not lightening, no clouds, nothing i have ever observed before","Date of the Event":"05/16/2013 12:00 UTC","Weather Factors":"Unknown","Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/47434.html.txt","/var/www/straped/mufon/org/47434.html"],"Object Features":"None","divs":["Sighting DetailsAt 0040 hrs i was driving due east on alameda ave toward 59 ave when an extremely bright blue light lit up the eastern sky what appeared to be approx 1 to 3 miles in front of me for approx 3 second. I stopped my car in the middle of the road because i was so bewildered by weekday i had just seen and tried to go through what it could have been and immediately concluded that it was not lightening and was way to bright to be some sort of residential light. Just add i was considering what could have possibly created the massive brightness i had just witnessed and then another flash just as bright but about one second longer happened in the exact area as before. I was even more shocked the second time. I felt a wave of lightheadedness and some discomfort in my chest for about 20 seconds as i sat stopped in the road before i realized that i should probably not sit in the middle of the road so i began driving. I have never in my life seen a light of this nature. I do not know that this was a ufo but i did not know where else to report something of this nature."],"Sighting Duration":"Undisclosed","Region":"Arizona","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around May 16th 2013"],"Case Number":"47434","Disposition":"Unresolved","Latitude":"33.457377","Tags":"City","Log Number":"US-05162013-0003","City":"Phoenix","Viewing Distance":"Over One Mile","Object Flight Path":"N/A","Date Submitted":"05/16/2013 04:30 UTC","Longitude":"-112.071067"}