{"Date Submitted":"04/29/2006 12:00 UTC","Date of the Event":"04/29/2006 12:00 UTC","Summary":"At first, sphere shaped, white. Directly above us. Zoomed away (normal speed) then turned red. Came to us. Left us. Came to us. Left us. Then, it zoomed far above us and away, and then played with us. It opened up on the right side (my right side) and orb","files":["/var/www/straped/mufon/html2text/4743.html.txt","/var/www/straped/mufon/org/4743.html"],"Weather Factors":"Unknown","Latitude":"38.587012","Longitude":"-121.48468","trends":["There have been 83 other sightings in Sacramento","There were no other sightings in Sacramento on or around April 29th 2006"],"Object Shape":"Circle, Flash, Sphere, Star-like","Tags":"City","Disposition":"Unknown","Log Number":"US-05042006-0002","Case Number":"4743","City":"Sacramento","Country":"United States","Source":"MUFON","divs":["sighting detailsmy husband and i were up north in jackson, ca. he had a residential contract job. after his work day was complete,(9:30-10:45 (?) p.m.) he and i hung out in the backyard where a new rock\\grotto fountain was added to 'their' property. it was night. i said to my husband how very close the stars were--we can actually touch them. and then the center perfectly round 'orb', that was just above us, zoomed (at a 'normal speed (?)', it zoomed, but allowed our eyes to follow it -- its size changed, its color changed to red, a soft red. the thing is it zoomed to us and zoomed up in the sky, and did the same thing three times. then it was up in the very dark and clear sky, red, changing, like a pulse, and then the right side opened (?) and about five white orbs came out and darted into different directions. there was a low hum, and then quiet and then the red pulsing (game playing) thing in the sky just disappeared. our reaction? it's different to watch footage on the history channel or national geographic--but when you see something for yourself, it's not fake anymore. we weren't scared that evening. well, we were so in awe, we just didnt'have time to be scared. we just couldn't believe that what we saw. i didn't think it heard anything i said. the next day, when i woke up, i didn't want to talk but my husband had woken before me and told his \"spousal employers\" what he and i saw. i didn't want to talk. his employers (where we spent the whole weekend) called their neighbors (in an area where homes are built on the highest tops of mountains). the neighbors said they didn't see anything that night, but they had seen the same thing weeks before. two days later my mother called me and i told her what i saw. i told my mother i was a loon because i talked to 'it'. my mother asked me what made me think that it didn't hear me? what i said to it is when the low humming sound stopped. and then it disappeared. the whole next day and since, although i'm not scared, i questioned myself... ...i (this is very difficult for me to describe) my god. it was right there. i asked 'it' not to hurt me. i explained to 'it' that i could not help them. i repeated over and over again that i could not help them. it's not a game anymore, to me. i wonder? are we really ready? with much respect and awe, sincerely, jeannie neumann"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.587012,+-121.48468(4743)&iwloc=A&hl=en\"> mufon case (4743) map </A>","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Region":"California","Object Features":"Undisclosed"}