{"Object Shape":"Oval","files":["/var/www/straped/mufon/html2text/47430.html.txt","/var/www/straped/mufon/org/47430.html"],"Object Features":"None","Disposition":"Unresolved","Latitude":"37.433222","Tags":"City","trends":["There have been 6 other sightings in Mancos","There were no other sightings in Mancos on or around May 15th 2013"],"Log Number":"US-05152013-0013","Sighting Duration":"00:10:14","Date Submitted":"05/15/2013 10:29 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.433222,+-108.478407(47430)&iwloc=A&hl=en\"> mufon case (47430) map </A>","Source":"MUFON","Viewing Distance":"Over One Mile","Region":"Colorado","Summary":"Observed it in southern sky and watched it move very fast in all directions then witnessed it disappear out of the atmosphere rapidly","Weather Factors":"Unknown","Country":"United States","Longitude":"-108.478407","Case Number":"47430","Date of the Event":"05/15/2013 02:10 UTC","Object Flight Path":"Path with directional change","City":"Mancos","divs":["Sighting DetailsI had just finished watching a movie at the above address when I decided to go outside for a smoke. As I light my cigarette I looked to the south over a set of trees in the yard. That is when I noticed a brilliant glow of lights about 35 to 45 degrees off of the horizon. The lights were alternating red and red-orange in color. I thought that the lights were mars at first and tried to get my bearing on direction. I continued to smoke watching the lights blowing it off as a planet. Then the lights began to move very rapidly down towards the horizon. I was in shock so I called for my girlfriend to come and take a look. When I did this the lights began a very rapid accent toward the atmosphere. When my girlfriend did come outside from brushing her teeth I pointed the lights out to her and she was awestruck. No sooner than she got out there as if the craft knew we were watching the lights shut off. But, I could still make out the shape of the craft and what looked to be some kind of vapor trail as it exited the atmosphere at a high rate of speed. In all the viewing was about 10 minutes long."]}