{"files":["/var/www/straped/mufon/html2text/47431.html.txt","/var/www/straped/mufon/org/47431.html"],"Viewing Distance":"Over 1 Mile, Unknown","Object Features":"None, Unknown","Summary":"Late March 2013. Park City Utah. One ball-bearing sphere observed 15 minutes; additional objects seen only later on video review.","Object Flight Path":"Stationary,Straight-line path","City":"Park City","Longitude":"-111.496743","Object Shape":"Circle, Disc, Oval, Sphere","Region":"Utah","Source":"MUFON","Latitude":"40.655622","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Log Number":"US-05152013-0014","divs":["sighting details1) where: park city utah, by sr 40, jogging. about 3:30 pm, late march 2013. 2) what made me notice the object: happened to look up; it was a beautiful day, so i was taking in the sky. 3) my initial impression: a balloon. 4) description: object 1. looked like a reflective ball bearing. i immediately recognized it was not a balloon. the object i noticed simply hovered, minimal movement, reflective, completely silent. i took three video clips with my iphone. objects 2-5: i only noticed these on subsequent review of the video on a large screen. these move across my video screen, right to left, covering the entire field of view in less than 1 second. it really is just a peripheral flash of movement barely noticeable (in fact i did not notice it; my sister in law noticed it when i sent her the video nearly two months after the sighting\\video). frame by frame review on my big screen tv reveals possibly three more similar objects in motion, total of 5. 5) awestruck. 6) it simply faded from view. note: i have attached three short iphone video clips. img_2882-2884. img_2882 is the clip that shows multiple objects. attention to the 27 second mark (0:27\\0:44)"],"Weather Factors":"Unknown","Date Submitted":"05/15/2013 11:26 UTC","trends":["There have been 7 other sightings in Park City","There were no other sightings in Park City on or around March 28th 2013"],"Case Number":"47431","Date of the Event":"03/28/2013 03:30 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.655622,+-111.496743(47431)&iwloc=A&hl=en\"> mufon case (47431) map </A>","Tags":"City"}