{"Disposition":"Unresolved","Case Number":"47445","City":"Norton Shores","Object Shape":"Triangle","Date Submitted":"05/16/2013 06:49 UTC","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/47445.html.txt","/var/www/straped/mufon/org/47445.html"],"Latitude":"43.174614","map":"<A HREF = \"http://maps.google.com/maps?q=43.174614,+-86.258726(47445)&iwloc=A&hl=en\"> mufon case (47445) map </A>","Sighting Duration":"00:00:45","Country":"United States","Source":"MUFON","Date of the Event":"05/19/2012 11:45 UTC","Weather Factors":"Unknown","Object Features":"Unknown","Log Number":"US-05162013-0014","Summary":"Black Triangle beamed light down us for about 1 second. It was slow moving and completely silent.","Longitude":"-86.258726","Object Flight Path":"Straight-line path","trends":["There have been 3 other sightings in Norton Shores","There were no other sightings in Norton Shores on or around May 19th 2012"],"divs":["Sighting Details I didn't report this when it happened. I was a bit frazzled. On 5-19-12 at approx 11:45 pm I got the fright of my life. My son and I went to see a Megadeth and Rob Zombie concert in Grand Rapids Mi. We were camping afterwards at PJ Hoffmaster state park that night as it was near the venue...I am from Detroit area. Late evening after the concert, my son and I were taking a walk along the dark calm shores of Lake Michigan when suddenly a super bright light shined directly upon us (about 30 foot in diameter). It lasted about a second. It targeted us...we had NO flashlights...so it saw us infra-red...or some other way. We looked up and directly above us was a huge black triangle with a light in each corner that were also shaped like triangles...as they were literally on the pointed corners of the craft... they sort of looked like LED lights...a blueish-white color. My son looked up quicker than I did and was able to see two lights that formed the one-beam light source that shined upon us coming from the mid-front bottom of the craft that rolled back...like a pair of eyes. From my perspective I watched the beam of light travel away from us and go up the sand dune....remember, the beam only lasted a second or less. The solid black craft was a Dorito shape...about 100 to 200 feet in the air. It was COMPLETELY SILENT and moving VERY SLOWLY. It was no less than 50 ft. wide and 70 ft long. It was moving from Lake Michigan going slightly SE over our heads and traveled over the beach and sand dunes...and after about 30-40 seconds it disappeared over the tree line. We got a fantastic look at it up close because we could clearly see it against the night sky. It had right and left white rectangular strobing taillights that would alternate from one side to the other...kinda like what you would see on the back of a garbage truck. It was so close I could see many squares within the rectangles shaped taillights (like bricks in a wall). At first I thought is was a drone...because earlier on Friday we heard Rush Limbaugh talking about drones flying over Chicago to monitor the Occupiers. But the next day at home I saw pictures of those drones...they looked like an unmanned spy plane.....NOT AT ALL WHAT WE SAW. Also....immediatly afterwards we tried calling my wife on my son's cellphone...which was nothing fancy (I wish we remembered it had a crappy camera in it). The phone wouldn't work for 15 minutes and even then it kept dropping the call. We were able to use that same phone with no problem minutes before the sighting."],"Region":"Michigan","Tags":"City"}