{"Log Number":"CA-05162013-0011","Summary":"unknown object going straight up in the sky, unlike any airplane","Disposition":"Unresolved","Source":"MUFON","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/47442.html.txt","/var/www/straped/mufon/org/47442.html"],"Tags":"City","divs":["Sighting DetailsOk, so firstly id like to point out that this is my first time on this website (and realistically, any UFO website). dont get me wrong, i do believe that there is other life in the universe, ive just never witnessed anything to help clarify my belief. I was on my balcony looking at the sunset... there was some cloud, but not much. I live close to an airport, and regularly observe airplanes taking off and disappearing in the distance.. THIS WAS DIFFERENT!! I was gazing across the skyline (there were about 4 airplanes in the sky, very easy to distinguish regardless of their distance to me.. suddenly a rocket-like aircraft caught my eye, miles away in the distance. Straight away it caught my attention as the distance it seemed to be moving didnt make sense as it was already very very high in the sky.. this thing basically was going up.. and yes UP!!! at first i asked myself if this could be a tiny cloud, but after about a minute i realized it certainly was not a cloud. this thing seemed to be going up for about 6 minutes travelling at quite a pace.. then poof, it disappeared through clouds... again, i do want to point out that i am not a regular UFO spotter, nor have I ever claimed to see a UFO.. i am someone who has no problem distinguishing an airplane, no matter how high it is or whatever!! this is something i have never seen before, and im sure I never will again! my girlfriend was on the balcony with me, emailing her mother from her phone.I told her after 3 minutes, because i wanted to be sure that I wasnt seeing things or going crazy. As soon as i told her, and she began to observe it, she herself said, are we looking at a UFO. Im still in a little bit of shock about the whole event, as i am certain that what i saw was not a normal aircraft."],"Object Shape":"Bullet, Missile","Case Number":"47442","Longitude":"-79.63831","Latitude":"43.591525","Date of the Event":"05/15/2013 09:00 UTC","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Object Features":"Unknown","Country":"Canada","Region":"Ontario","map":"<A HREF = \"http://maps.google.com/maps?q=43.591525,+-79.63831(47442)&iwloc=A&hl=en\"> mufon case (47442) map </A>","Viewing Distance":"Over One Mile","City":"Mississauga","trends":["There have been 20 other sightings in Mississauga","There were no other sightings in Mississauga on or around May 15th 2013"],"Date Submitted":"05/16/2013 05:39 UTC"}