{"Longitude":"-106.806426","Object Flight Path":"Stationary,Hovering then path","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/47452.html.txt","/var/www/straped/mufon/org/47452.html"],"Log Number":"US-05162013-0021","Viewing Distance":"101-500 Feet","Tags":"City","Case Number":"47452","City":"Saratoga","divs":["Sighting Details09Dec2010, Appx: 1am, Main St. Saratoga, WY. Woke up because bucks were fighting outside my slider & hit the glass. Got my cellphone, & quietly went out the frt. door & slowly followed them toward the street. The were focused on something to the wsw of my place & on the other side of the street. Followed to the street the town went black & I was able to get this shot basically across the street but still above us. The deer weren't scared & I wasn't either. Then the light vanished & with in a minute or so the town lights came back on. When I took the photo all that was visiable was the bright lite, nothing else was visible. I emailed it to myself later that day to make sure that I could save it if something would happen to the phone. With not having a computer at the time I didn't open the file until last May 2012 & got a major surprise. Some how the camera had been able to stop time presay or the shutter speed was just slow enough to get thur the bright lite & get a clear shot of the craft with the lights behind it, in the shape of the craft."],"Date Submitted":"05/16/2013 10:59 UTC","trends":["There have been no other sightings in Saratoga","This sighting has never been favorited."],"Disposition":"Unresolved","Summary":"Fighting bucks outside my slider window woke me up, got my cell phone & went outside to follow the bucks where stopped in frt. yd. looking up then followed a bright lite wsw of us.","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.454962,+-106.806426(47452)&iwloc=A&hl=en\"> mufon case (47452) map </A>","Object Features":"Other","Sighting Duration":"Undisclosed","Region":"Wyoming","Source":"MUFON","Object Shape":"Fireball","Date of the Event":"12/09/2010 12:00 UTC","Latitude":"41.454962"}