{"Object Shape":"Unknown","Disposition":"Unresolved","Viewing Distance":"Unknown","trends":["There have been no other sightings in Jenson","This sighting has been favorited 1 time."],"Case Number":"47450","files":["/var/www/straped/mufon/html2text/47450.html.txt","/var/www/straped/mufon/more/47450_submitter_file1__ufo1.jpg","/var/www/straped/mufon/more/47450_submitter_file2__ufo2.jpg","/var/www/straped/mufon/org/47450.html"],"Source":"MUFON","Longitude":"-83.629916","Tags":"City","Date of the Event":"08/31/2011 09:00 UTC","City":"Jenson","map":"<A HREF = \"http://maps.google.com/maps?q=36.77703,+-83.629916(47450)&iwloc=A&hl=en\"> mufon case (47450) map </A>","Object Flight Path":"Unknown","Log Number":"US-05162013-0019","divs":["Sighting DetailsI did not take these photos. My friend was visiting & we were sitting around talking. I don't know what brought up the subject but it went to ufo's. My friend asked \"did I ever show you the picture I got on my ipod?\" I said no. She said she took it 2 years ago over Jenson, Ky. She had just bought the ipod & heard that it took really good photos so she went outside & started taking photos of the clouds in the night sky. She came back in & checked them. Most were black but she noticed one that had a light in the bottom corner. She zoomed in on it [which is the enlarged one] & saw what it was. She did not see or hear anything at the time she took it. She only showed it to her family & my son before showing me. She got a new ipod [or cell phone, I don't know which} & had everything transfered over to the new one. I could not believe what I was seeing when I first saw it. I asked her if she cared if I sent it to you & she said no. She is not one to make up stuff or fake things. She is a mother of 3 working to get her degree in physical therepy. She's very level headed & admits she does not know what it is. I asked her if \"ufo\" ever came to mind & she said yes but was not sure. So here's the pics. Hope you can find out what it is. You can contact me if you want to talk to her about it. I will make sure she gets your info. PS-Could not answer above questions right because I was not there."],"Sighting Duration":"Undisclosed","Region":"Kentucky","Date Submitted":"05/16/2013 10:17 UTC","Weather Factors":"Unknown","Summary":"I did not take these pics. My friend Thomassa did.","Object Features":"Unknown","Country":"United States","Latitude":"36.77703"}