{"Object Shape":"Blimp, Cigar, Other","Tags":"City","Disposition":"Unresolved","trends":["There have been 78 other sightings in Oklahoma City","There were no other sightings in Oklahoma City on or around May 5th 2013"],"Source":"MUFON","Longitude":"-97.72603","Date Submitted":"05/17/2013 02:25 UTC","Sighting Duration":"00:03:00","Case Number":"47458","Log Number":"US-05172013-0005","map":"<A HREF = \"http://maps.google.com/maps?q=35.58745,+-97.72603(47458)&iwloc=A&hl=en\"> mufon case (47458) map </A>","Date of the Event":"05/05/2013 11:30 UTC","divs":["Sighting DetailsTurned West on Hastings at the same time a white male jogger was looking into the sky at the same thing I was seeing.....so I know there was at least one witness. Looked like a larger aircraft coming in for landing, but then I realized it was not on descent, it was hovering and flashing red, white (maybe white spot lights). When I stopped at Surrey Hills Blvd, the craft was hovering about 500ft off the ground and about 500-600 feet to my South. I then thought to try to get video from my phone (I had just replaced the battery, and the phone previously wouldn't work without being plugged in....so I was rusty as to how to access and use the video camera). I turned South on Surrey Hills Blvd and started the video....the craft seemed to know what I was doing and proceeded to the South as I trailed it at approx 20-25 mph. Note that while stopped at Hastings and SHB, I rolled the window down to hear what sounded like what a \"thruster\" might sound like on the shuttle in space (an air propellant sound). In addition, I could swear that I started the camera sooner, when the craft was closer to me, but as it is, I only have a view of what it looked like pulling away from me. I thought it may be a \"lighter than air\" craft, since Sundance Airpark is located within 2 miles of the sighting, however I do not believe balloons can operate at night. Even if they can fly at night, I'm pretty sure no aircraft can have red lights at the tail (flashing and in a triangular patter). FAA requires aircraft light markers to be white strobe at the rear and red and green static lights (port and starboard) on the wing tips. What I would like to find is a good forensic photographer or videographer who can apply the appropriate filters to see what this craft was. I was close enough at the beginning that I could see that it was much longer than its width, thick like a clay brick, narrower in the middle like a dumb bell but not as thin at the hand grab section, corners appeared to be at 45 degree angles, looked like it was 2-300ft long and several stories high with no apparent windows seen in the dark; at least 6 red and 4 bright white flashing and static lights on very bottom, three flashing red lights at the tail in triangular shape (as seen in the video). I followed it South for .85 miles while attempting to video tape it; difficult due to twists in the road and losing the craft in the trees. I'll upload. Note that I have left a fictitious name, address and phone number as I want to remain completely anonymous I know what I may have in my possession. You can reach me by the provided email address, but it is not often accessed. I'm contacting MUFON first, because the only way I can get a copy of the video from my phone it to post on You Tube...........I really don't want to do that just yet. Thanks for your input. ooops, just realized that I am going to require assistance to get this video saved to a file. I've tried emailing to myself but it won't go through. The only option from my TMobile MyTouch phone that I can see may work would be to upload to YouTube."],"Viewing Distance":"101-500 Feet","Latitude":"35.58745","Summary":"UFO in Far NW Okc; Cell phone video","City":"Oklahoma City","files":["/var/www/straped/mufon/html2text/47458.html.txt","/var/www/straped/mufon/org/47458.html"],"Object Flight Path":"Hovering then path,Path then hovering","Region":"Oklahoma","Country":"United States","Object Features":"Patterned Surface, Other","Weather Factors":"Unknown"}