{"Summary":"Marine layer in bright orange red \"fireball\" in sky and changes flight pattern","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/47457.html.txt","/var/www/straped/mufon/org/47457.html"],"Log Number":"US-05172013-0004","Sighting Duration":"Undisclosed","Country":"United States","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=33.004144,+-117.285759(47457)&iwloc=A&hl=en\"> mufon case (47457) map </A>","Latitude":"33.004144","City":"Cardiff By The Sea","Object Features":"Unknown","Longitude":"-117.285759","Date of the Event":"05/16/2013 09:27 UTC","divs":["sighting details9:27pst cardiff by the sea, california, marine layer is heavy, i'm taking out trash and am forced to look up and acknowledge a bright glowing red\\orange fireball that is far away but i can see it glow beyond the marine layer, it appeared to flicker, travel nw, but appears to travel back south, gets bright then dimmed out to nothing in the sky. i was completely mesmerized by this dance and assumed it was a comet, satellite, or shooting star, so i didn't think to record it on my phone...but when i saw the object, round in nature, change direction, i ran in and got my phone. by this time 2 minutes passed and who knows how long it had been glowing since i first saw it. it appeared to shake back and forth, then loose it's color. i saw it positioned in the west, travel nw, light a slow shooting star, the completely turn direction to south... i texted my neighbor who is an astronomy buff: \"is there a comet tonight?\" \"i just saw a bright orange light in sky that was moving odd ways and it was bright for about 2 minutes then dimmed and now gone!\" i never got a text back from him...i don't see any stars and no planes. it looked like someone was flashing their headlight from the sky at me! this was so cool!"],"Tags":"City","Date Submitted":"05/17/2013 01:00 UTC","Object Flight Path":"Path with directional change","Case Number":"47457","Viewing Distance":"Over One Mile","Region":"California","trends":["There have been no other sightings in Cardiff By The Sea","This sighting has never been favorited."],"Source":"MUFON","Object Shape":"Circle, Fireball"}