{"Sighting Duration":"00:05:00","Country":"Canada","Region":"Ontario","Longitude":"-75.898684","Latitude":"45.308818","Date Submitted":"05/17/2013 11:34 UTC","City":"Ottawa","map":"<A HREF = \"http://maps.google.com/maps?q=45.308818,+-75.898684(47465)&iwloc=A&hl=en\"> mufon case (47465) map </A>","trends":["There have been 55 other sightings in Ottawa","There was one other sighting in Ottawa on or around May 16th 2013"],"Source":"MUFON","Tags":"City","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/47465.html.txt","/var/www/straped/mufon/org/47465.html"],"Object Features":"Unknown","Log Number":"CA-05172013-0011","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Object Shape":"Unknown","Date of the Event":"05/16/2013 09:15 UTC","Object Flight Path":"Straight-line path","Case Number":"47465","Summary":"6-8 Aircrafts flying EXTREMELY low, making loud noise (compared to fleet of helicopters) flying parallel westbound with flashing lights","divs":["sighting detailsat around 9:15pm, my wife and i were watching some evening television before going to bed, when we suddenly heard a distinct noise coming from our open window. my wife asked, \"what is that noise?\" to which i replied thinking it was a street sweeper (we live near a suburb construction site where street sweepers clean up the debris left on the civilian roads). when we realized it was \"not\" a street sweeper, we went on our front porch, where the distinct sound was getting \"louder.\" i told my wife i thought it was a helicopter, but could not see anything right away. right at that moment, an object appeared approx. about a mile (terrible with distance; could've been closer\\farther - it was dark out being 9:15pm at night)from where we were standing. we were also not the only witnesses, as at least 3-5 of my neighbours stepped out of their homes asking what the noise was. the object was flying extremely low; lower than an aircraft.....it was then followed by at least \"6\" other object similar in appearance, all heading in a parallel formation, coming from northeast, headed westbound towards arnprior\\almonte, on. when all of the object were clearly viewed, it sounded like a \"fleet of helicopters\" but clearly it was not helicopters. the night sky made it very difficult to view the shape of the objects, but what was distinct was the multi-coloured blinking lights surrounding the objects as they flew by....the most distinct feature though was the \"noise\" i cannot stress how loud it was, and how it sounded like a fleet of helicopters. i got on the phone with the local city\\311 asking if there were any reports.....they gave me a number for the local police. the local police operator heard what i witnessed and put me on hold....they then returned saying \"i am not crazy\" and that there was a \"counter terrorist drill\" being conducted by members of the rcmp and mp......funny how i don't recall the rcmp having access to aircrafts.....and why would they conduct the drill so late (9:15pm the event lasted about 5min.) and why in a residential area with (some) farmland? they did not appear to be \"airplanes\" nor \"helicopters\" and i also cannot stress how \"low\" they were flying.....and though i am a terible judge of distance, i will say they looked to be flying only about 1 mile above our houses. coincidentally, an earthquake occurred here today in ottawa, on where it originated west of here in arnprior, on (the direction the aircraft were flying). i recall when japan, chile and haiti had their earthquakes occur from 09-10', there was active ufo sightings occurring before the quake(s) hit.....the quake registered about 4.8 on the richter scale here in ottawa.... i updated and inquired if anyone else heard\\saw anything that night on my social networking outlets, and have received little-to-no feedback......aside from my wife, and 4-5 neighbours who witnessed\\heard this event, there has been nothing else to claim other than the slightly \"fishy\" report from the local police i received when i made the phone call. i am not one to fabricate a story like this, as i am not an \"avid\" ufo believer (though i do not think we are \"alone\" in the universe) but i can honestly say i have n-e-v-e-r encountered soemthing like this, and am looking for answers.... again event occurrence: date: thur may 16, 2013 time: approx. 9:15pm area: kanata\\ottawa, on canada occurence: 6-8 aircrafts flying \"extremely\" low coming from ne headed westbound towards almonte\\arnprior, on area. noise was very distinct sounding like fleet of helicopters or a \"train\" with blinking flashing lights flying parralel. shape could not be verified as the evening was very dark. approx. street areas where the objects were flying - huntmar\\palladium dr. kanata, on & hwy 417 - westbound. this is not a joke, i have not seen anyhting like this and it was very bizarre, especially with the earthquake occurring the following day almost \"12hrs\" after the initial occurence."]}