{"map":"<A HREF = \"http://maps.google.com/maps?q=41.958365,+-91.677073(47469)&iwloc=A&hl=en\"> mufon case (47469) map </A>","Longitude":"-91.677073","City":"Cedar Rapids","Object Flight Path":"Unknown","Viewing Distance":"20 Feet or Less","Case Number":"47469","Latitude":"41.958365","Disposition":"Unresolved","Log Number":"US-05172013-0016","Source":"MUFON","Tags":"City","Object Features":"Other","Date Submitted":"05/17/2013 01:32 UTC","Weather Factors":"Unknown","Summary":"sq 3 tired item on top my yardy copper iluminated","files":["/var/www/straped/mufon/html2text/47469.html.txt","/var/www/straped/mufon/org/47469.html"],"Object Shape":"Disc, Oval","Region":"Iowa","Sighting Duration":"Undisclosed","trends":["There have been 17 other sightings in Cedar Rapids","There were no other sightings in Cedar Rapids on or around October 15th 2011"],"divs":["Sighting DetailsLooked out west kitchen window 9:00 PM saw 3 tiered object on top my yardy, 2 feet sq, maybe slightly taller than 2 feet. Each tier had 3 ovals of illuminated, brushed copper appearance. Wasn't shiney, wasn't lit up, I thought illuminated, not pulsing, just there. Didn't have sound, no movement. The framework around the bottom similar to leggos, little sections with holes spaced evenly on each piece. It sat flat on top yardy all 3 tiers faced west, tilted up at an angle, heavenward. Right by edge of street back property, I thought someone had set whatever it was there. From window looked for anyone around. No one. Hurried to door to go outside, unlocked inside door, was about to open outside door I stopped. Was afraid to open that door! Went back to window and watched for minute or 2. Went into living room to think what to do and when I came back was gone! Sure wish I had kept on watching but didn't know it was leaving, didn't know what it was! Next day looked around yardy and it's top. Nothing left behind. No pattern in the dust on yardy top. I immediately drew a picture which I'm sending along with this article. After I had time to think about it I thought it was either sending a signal to mark this spot, or, was receiving something, possibly energy for traveling."],"Country":"United States","Date of the Event":"10/15/2011 12:00 UTC"}