{"Case Number":"47463","Log Number":"AU-05172013-0009","Disposition":"Unresolved","City":"Coorparoo","trends":["There has been one other sighting in Coorparoo","There were no other sightings in Coorparoo on or around May 17th 2013"],"Object Features":"None","Sighting Duration":"Undisclosed","Source":"MUFON","Longitude":"153.059149","Region":"Queensland","Country":"Australia","map":"<A HREF = \"http://maps.google.com/maps?q=-27.489841,+153.059149(47463)&iwloc=A&hl=en\"> mufon case (47463) map </A>","files":["/var/www/straped/mufon/html2text/47463.html.txt","/var/www/straped/mufon/org/47463.html"],"divs":["Sighting DetailsMy daughter and I where out jogging. When we had finished were playing on the work out equipment in the park. I am always looking at the sky. I love astronomy and the stars where looking great tonight. I put my head up just after showing Bella how to use the sit-up aperatus in the park. This thing looked like a shooting star, it came from over our heads and left no smoke trail. Naturally I pointed it out and said look at the shooing star.The light was a beautiful blue green with a bright blue core. then it seemed to float like it was completely weightless. As it fell it didn't burn up but slowed down and moved in a zig-zag flight path above a treeline near Norman Creek in Coorparoo. The location is a parkland and it is situated underneath the flight path for the Brisbane airport. This was flying way to low to be confused with a helicopter or some sort of toy. Both my daughter and I were alone in the park and there certainly no kids out playing as we had just run near where we suspect it had landed. It was difficult to determine where it landed as it dipped behind the trees and I saw it slowly decent and move further north. Both of us were very confused by the object but it seemed like it was under control of sorts. But it certainly didn't behave like an object under the control of gravity. A beautiful first sighting for my daughter.I have seen a few UFO's and obs in my time. For me it is unidentified, I wanted to explore the supposed landing site but my daughter was apprehensive and wanted to go home. Sorry no photo's but I really wanted to report this."],"Weather Factors":"Unknown","Latitude":"-27.489841","Summary":"This thing looked like a shooting star that left no smoke trail. Then it hovered...","Object Flight Path":"Hovering then path","Date Submitted":"05/17/2013 05:03 UTC","Tags":"City","Viewing Distance":"101-500 Feet","Date of the Event":"05/17/2013 06:05 UTC","Object Shape":"Circle, Sphere"}