{"Longitude":"-111.087331","City":"Undisclosed","trends":[],"Source":"MUFON","Case Number":"47462","files":["/var/www/straped/mufon/html2text/47462.html.txt","/var/www/straped/mufon/org/47462.html"],"Country":"United States","Sighting Duration":"00:01:30","Summary":"Wavy Cylindrical White/Shiny object stationary in sky for 30 seconds then propelled at a uniform speed towards horizon","divs":["Sighting DetailsDriving on major Blvd in Tucson AZ at 1 pm. Notice what at first is maybe a plane but soon notice it is not moving at all. The object is a horizontal wavy shape and the texture appears white and shiny. I pull the car to the side and fix my vision upon the object. I wonder if it is just an isolated dense cloud in the sky. It stands out because there are no clouds in the sky at this time what-so-ever. After I discern that it is not really a cloud I start to wonder if it is closer than it seems and is actually a coil that is placed on an electrical wire. I think this because the object is in my field of vision directly above electrical wiring. I am startled by this object and my first instinct is to text my wife to go outside and see the object. Soon after the object propels from stationary to mobile. It starts in a very smooth and uniform motion and continues without a noticeable change of pace. I watch for 20-30 seconds as it drifts towards the horizon then I drive off. I glance back a few times to see the object still in the sky but eventually lose sight of it."],"Tags":"City","Date of the Event":"05/16/2013 01:59 UTC","Viewing Distance":"Over One Mile","Object Shape":"Bullet, Missile, Cylinder, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.056368,+-111.087331(47462)&iwloc=A&hl=en\"> mufon case (47462) map </A>","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Log Number":"US-05172013-0008","Weather Factors":"Unknown","Object Features":"Unknown","Date Submitted":"05/17/2013 04:56 UTC","Region":"Arizona","Latitude":"34.056368"}