{"trends":["There have been 2 other sightings in Glen Cove","There were no other sightings in Glen Cove on or around May 16th 2013"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.864259,+-73.635004(47467)&iwloc=A&hl=en\"> mufon case (47467) map </A>","Region":"New York","Tags":"City","Date Submitted":"05/17/2013 12:27 UTC","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/47467.html.txt","/var/www/straped/mufon/org/47467.html"],"Viewing Distance":"20 Feet or Less","Case Number":"47467","Log Number":"US-05172013-0013","Latitude":"40.864259","Source":"MUFON","Sighting Duration":"Undisclosed","City":"Glen Cove","divs":["Sighting DetailsI was smoking a cigarette and happened to look at the sky and noticed what appeared to be spotlights circulation in the sky above. I attempted to determine which direction the spotlights were coming from and I could not determine the origin of the spotlights. I continued to view the spotlights and notice that there were circulating in the clouds along the edges of the clouds. It was a partly cloudy sky, so in between the clouds there was clear sky and stars noticeable. That is when I called my family out to view this strange phenomenon. My family were amazed and perplexed as I was. I was still not sure if it was spotlights or not until the clouds starting changing shapes and moving in a Southeast direction due to the wind or eart rotation. The movement of the lights remained consistent, moving along the outline of the clouds. My wife staring taking a video of the event and captured actual footage. Upon viewing the video, objects were observed that we could not see with the naked eye. In the video you can not clearly see the lights that I explained earlier, but the objects are visible moving in this circular motion."],"Longitude":"-73.635004","Summary":"Multiple circular spotlights","Disposition":"Unresolved","Object Flight Path":"Path with directional change","Object Shape":"Circle","Country":"United States","Date of the Event":"05/16/2013 12:00 UTC"}