{"Sighting Duration":"02:05:00","trends":["There have been 6 other sightings in Coventry","There were no other sightings in Coventry on or around September 10th 2002"],"Log Number":"GB-05172013-0019","divs":["sighting detailswhen i was about 11-12 years in 2001\\02 can't remember the year my mother had a bad fall and we went to the hospital. at around midnight we got out of the taxi at our house and i it was a clear night as i remember. being the only other person in i decided to sit and listen the radio mains powered with headphones on in my room. it must have been past midnight or 1.00am. suddenly the radio station i was listening to disappeared like a hoover or microwave had been switched on next to me. i had the urge to run to my bedroom window i still don't know why i did this perhaps because i thought a helicopter might be passing over. i then looked up and seen the start of a low flying triangle passing at low altitude i don't remember hearing any noise. it had 3 big white lights at each tip and a larger pulsating red one in the middle of it. i watched it glide over other people's homes before it west off into the distance while all i could see was the flashing red light in the far distance. i knew this was not a type of winged aircraft as it would have been dangerously low and the airspeed would have stalled the plane. it was too big to be a helicopter and considering they make noise what i seen didn't."],"Object Flight Path":"Straight-line path","Latitude":"52.374557","Summary":"Large triangle hovering over house (can't find GMT for time zone)","files":["/var/www/straped/mufon/html2text/47472.html.txt","/var/www/straped/mufon/org/47472.html"],"Date of the Event":"09/10/2002 01:01 UTC","Source":"MUFON","Date Submitted":"05/17/2013 03:33 UTC","Tags":"City","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=52.374557,+-1.526255(47472)&iwloc=A&hl=en\"> mufon case (47472) map </A>","Longitude":"-1.526255","Country":"United Kingdom","Viewing Distance":"101-500 Feet","Disposition":"Unresolved","Object Features":"Unknown","City":"Coventry","Case Number":"47472","Weather Factors":"Unknown","Region":""}