{"Source":"MUFON","Date Submitted":"05/05/2006 11:11 UTC","City":"Wollongong","Object Flight Path":"Undisclosed","Country":"Australia","Region":"New South Wales","Tags":"City","trends":["There has been one other sighting in Wollongong","There were no other sightings in Wollongong on or around May 5th 2006"],"Date of the Event":"05/05/2006 11:11 UTC","Summary":"A black circular object.","Latitude":"-34.424984","Object Features":"Undisclosed","divs":["Sighting Details Having lunch at Sandon Point at north wollongong,my partner and i were watching an unusually low flying,large plane (DC-9 or DC-10)flying over the ocean and banking in a southern direction. Wondering and discussing with my partner what the plane was doing. When the plane had finished banking south i noticed a round black object apear at a 45% angle and about a kilometre behind the plane.It was smaller than the plane. It approached the plane very rapidly and then slowed to the planes speed directly behind it within a second or two. The speed of the object was what got my attention and i asked my partner if he could see it also. We watched the object dart behind the plane a few times and then travel above the plane, it also stayed directly behind it for a while as though it was 'tail-gaiting' it. Just before the object dissapeared it moved in front and above the plane. It stayed with the plane for what seemed like 4-5minutes and then just vanished. I initially thought there may be a problem with the plane and a fighter jet may be escorting it,however eliminated this possibility as the object was too small for a jet, round and we heard no sound.( we would have heard a fighter jet!) We immediately thought we had seen something very unusual and un-identifiable and remembered the reports of recent and increased strange sightings in our area."],"Longitude":"150.893124","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Case Number":"4747","Disposition":"Unresolved","Object Shape":"Circle","Log Number":"AU-05062006-0002","map":"<A HREF = \"http://maps.google.com/maps?q=-34.424984,+150.893124(4747)&iwloc=A&hl=en\"> mufon case (4747) map </A>","files":["/var/www/straped/mufon/html2text/4747.html.txt","/var/www/straped/mufon/org/4747.html"],"Viewing Distance":"Unknown"}