{"Date Submitted":"05/17/2013 11:47 UTC","Viewing Distance":"101-500 Feet","Log Number":"US-05172013-0025","Tags":"City","Sighting Duration":"Undisclosed","Summary":"3 orbs seen flying over Flushing, seen at different times","Object Flight Path":"Straight-line path","Object Shape":"Unknown","Longitude":"-73.800566","Source":"MUFON","City":"Flushing","Weather Factors":"Unknown","Case Number":"47479","Disposition":"Unresolved","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/47479.html.txt","/var/www/straped/mufon/org/47479.html"],"divs":["Sighting DetailsWas walking along Northern Blvd, headed to pick up my child from school. Ever since witnessing UFOs on April 27th, I have been watching the skies ever more closely now. It was a sunny and clear day (save for the fact of zig-zagging chem-trails that are constantly seen every day) and I saw the first object headed south a few minutes after 2PM. I was able to track it in the sky upon which I finally arrived to my child's school and then lost sight of it. Soon we headed to the playground. There I was able to clearly make out 2 more, also headed in the same direction. I should note all 3 objects reflected the sun light, but only at different times, as it seemed the objects were rotating as they flew past, and not in a very fast speed. I should also note they were very high up, barely recognizable to the naked eye. Luckily I wear sunglasses with polarization and allow me to see things clearer. I should mention that the 3rd object I witnessed gave off a reddish color to it. Not sure if it was glowing red or maybe the surface was red in nature. I sure hope others saw them too. Seems like there's been an increase in activity. Something is definitely up!"],"Region":"New York","trends":["There have been 4 other sightings in Flushing","There were no other sightings in Flushing on or around May 17th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.762808,+-73.800566(47479)&iwloc=A&hl=en\"> mufon case (47479) map </A>","Date of the Event":"05/17/2013 02:04 UTC","Latitude":"40.762808","Country":"United States"}