{"Log Number":"US-05172013-0021","City":"Amherst","Latitude":"41.360122","Date of the Event":"05/16/2013 10:07 UTC","Summary":"Two lights looking E Meandered around sky for about 5 minutes","Viewing Distance":"Over One Mile","Disposition":"Unresolved","Object Features":"None","Date Submitted":"05/17/2013 04:27 UTC","Tags":"City","Object Shape":"Circle, Fireball, Sphere","Weather Factors":"Unknown","trends":["There have been 2 other sightings in Amherst","There were no other sightings in Amherst on or around May 16th 2013"],"Region":"Ohio","Sighting Duration":"Undisclosed","Country":"United States","files":["/var/www/straped/mufon/html2text/47474.html.txt","/var/www/straped/mufon/org/47474.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.360122,+-82.256082(47474)&iwloc=A&hl=en\"> mufon case (47474) map </A>","Case Number":"47474","Longitude":"-82.256082","divs":["Sighting DetailsI was taking out the garbage at little after 10 at night. The sky was clear in that direction. The moon was behind me. I like to look at the stars and pick out constellations. At that time I noticed this light. It was about 60 degrees from the horizon. It was larger than most things I've seen. I guess pill size is a good description. It glowed slightly. It was a red-orange color. It moved around but not in a straight line. It went back and forth and sometimes just paused. There was also a second light that I noticed a few seconds later. Initially it was lower and more southern than the first light, but not by much. The first light kind of stayed in the general area. The second light moved significantly. First it moved down in the sky diagonally. It then moved vertical to the horizon (at this point the objects were far enough apart that I could not watch both of them at the same time). Around this time the first light moved higher in the sky and faded away. The second object turned up and moved in an arc that took it to about the same degree at which I first saw it. It moved back into the general area that I first saw them in and the second light faded very close to the spot the first light did. I have never seen anything like this. I'm sure there's a reasonable explanation. I'm hoping you know what these are just to satisfy my curiosity."],"Object Flight Path":"Hovering then path,Path with directional change","Source":"MUFON"}