{"Region":"Pennsylvania","Country":"United States","Date of the Event":"05/15/2013 12:00 UTC","Source":"MUFON","trends":["There has been one other sighting in Coudersport","There were no other sightings in Coudersport on or around May 15th 2013"],"files":["/var/www/straped/mufon/html2text/47473.html.txt","/var/www/straped/mufon/org/47473.html"],"Object Features":"Unknown","Disposition":"Unresolved","City":"Coudersport","Case Number":"47473","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.777958,+-78.0183(47473)&iwloc=A&hl=en\"> mufon case (47473) map </A>","Tags":"City","Object Flight Path":"Path with directional change","Object Shape":"Sphere","Summary":"Saw a UFO in the sky in Coudersport Pa.","Log Number":"US-05172013-0020","Date Submitted":"05/17/2013 04:10 UTC","Longitude":"-78.0183","Latitude":"41.777958","divs":["Sighting DetailsI was at Cherry Springs State Park with a lady friend on the 15th for star gazing. Very great area for that, no light pollution, and it was a very clear night. We were laying on the trunk of my car when, at first she noticed it, a red light appeared. It wasnt a planet because it was moving. We seen multiple planes that night, we know it was not a plain, same with meteors, we seen 4 or 5 of them, it was not a meteor, meteors travel one direction, this moved multiple directions. This thing was very high up and difficult to see until you have your eyes locked on it. It was moving very fast and not in a straight line, it was clearly making turns, at one point looked like it was going in a circle. If you held your hands up about a foot apart, it would of traveled that distance in a matter of 2-3 seconds. And it was extremely high up. In an area with a lot of light pollution you wouldnt of been able to see it. The sighting lasted about 2 minutes then we couldnt see it anymore, we kept staring at the last spot we seen it and noticed movement in our peripheral vision, it was the same red light moving around and making turns. I should explain the red light more, it didnt look like it was illuminating light like a star or the moon was, it more just looked like a red object, from our view about the size of a pin, very small. Not saying it was other worldly, even though I strongly believe it could have been, there is no explanation I can come up with but Im not an expert, just a fan on learning astronomy and a believer in UFOs. Tried to get video footage and pictures, but from our view it was entirely too small to show up."],"Viewing Distance":"Over 1 Mile, Unknown","Sighting Duration":"00:05:00"}