{"Country":"United States","Object Shape":"Unknown","City":"Ottawa","trends":["There has been one other sighting in Ottawa","There were no other sightings in Ottawa on or around May 12th 2013"],"Date of the Event":"05/12/2013 01:15 UTC","Longitude":"-95.258882","Disposition":"Unresolved","Latitude":"38.618437","files":["/var/www/straped/mufon/html2text/47487.html.txt","/var/www/straped/mufon/org/47487.html"],"Source":"MUFON","Summary":"SNOW WHITE SHEET, STRAIGHT PATH, NO CHANGE IN ALTITUDE. ENDS OF SHEET MOVED UP AND DOWN- WINGLIKE. NOT WEATHER BALOON OR DEBRIS. 3 OTHER WITNESSES.","Log Number":"US-05182013-0007","Object Features":"Other","Viewing Distance":"501 Feet - 1 Mile","Region":"Kansas","map":"<A HREF = \"http://maps.google.com/maps?q=38.618437,+-95.258882(47487)&iwloc=A&hl=en\"> mufon case (47487) map </A>","Tags":"City","Case Number":"47487","divs":["Sighting DetailsTRAVELING BACK TO OKC FROM KCMO ON I-35. HAD 2 BLOWOUTS ON BACK TIRES AND SLOWLY GOT TO STORE AT WELLSVILLE, KS EXIT. COUPLE TOOK ME TO THE OTTAWA, KS EXIT (15 MILES)TO THE WALMART TIRE CENTER TO GET ONE OF THE TIRES CHANGED OUT SO THAT WE COULD RETURN TO THE CAR, WHERE MY WIFE WAITED, THEN PUT THE NEW TIRE AND THE SPARE TO TRAVEL BACK TO WALMART AND REPLACE THE OTHER. WE WERE SUPPOSED TO WAIT AN HOUR FOR THE WORK TO BE DONE. THE COUPLE WENT SHOPPING WHILE I WENT TO THE BACK LOT OUTSIDE THE STORE TO THE EMPLOYEE BREAK AREA FOR SMOKERS. I SAW A FLUTTERING WHITE OBJECT SOUTHWEST OF MY POSITION(I WAS FACING WEST)TRAVELING DIRECTLY NORTH. IT WAS SNOW WHITE AND FLAT. WHEN IT WAS CLOSE TO BEING DIRECTLY IN FRONT OF ME, I ASKED TWO LADY WALMART EMPLOYEES TO VERIFY MY SIGHTING. THEY, LIKE ME, THOUGHT DEBRIS OR A DEFLATED WEATHER BALOON. BUT, LIKE ME, THEY RULED EACH OUT DUE TO THE STABLE, CONSTANT, STRAIGHT PATH AT A PRETTY DECENT SPEED. A TIRE TECH CAME OUT OF THE BAY TO SEE WHAT WE WERE LOOKING AT. HE JUST SHOOK HIS HEAD AND SAID, \"I DON'T KNOW WHAT THAT IS\". IT WAS AT ABOUT 60 DEGREES ALTITUDE IN A CLEAR BLUE SKY. MY GUESTIMATE FOR SPEED WOULD BE 40 MPH, AS IT TOOK 10 MINUTES FOR IT TO MOVE 6-8 MILES OVER OTTAWA, KS. IT WAS MOVING PRETTY CLOSE, DIRECTION-WISE, TO A STAR IN THE NORTH SKY, WHICH WAS AT ABOUT 65 DEGREES. A STAR ON A CLEAR DAY? I GUESS IT WAS VENUS? MAYBE YOU WOULD KNOW. WHAT WAS INTRIGUING WAS THAT THE NORTH AND SOUTH ENDS OF THE 20' + SHEET WERE SLOWLY MOVING UP AND DOWN (WINGLIKE) AS THE MIDDLE JUST FURLED AND BOUNCED, LIKE A FLAG. IT WAS THE WHITEST-WHITE YOU COULD IMAGINE. MY WIFE AND I ARE IN OUR 60'S, RETIRED FROM THE FEDERAL GOVERNMENT, AND HAVE NEVER SEEN A UFO BEFORE. WE ALL WERE SO INTRIGUED BY THE ANOMALY, NONE OF US THOUGHT ABOUT PICTURES. HELL, I HAVE A DROID 8MP WITH VIDEO. I COULD JUST KICK MYSELF."],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Date Submitted":"05/18/2013 02:13 UTC"}