{"Date Submitted":"05/18/2013 12:11 UTC","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsRight after 10pm driving SSE on highway IH 45 5 miles SSE of Corsicana Texas, observed at 60 degrees left of my direction what at first I thought might be a helicopter hovering off to side of road about 1000 - 3000 feet (hard to tell), but surprised that lights were bright and each color was 2 rectangular bars (horizontal) lights red on one end and green on other end (appeared to be each end-hard to tell at night) which colors were a little like airplane BUT much brighter bars, not small round. Could not see outline of object but lights appeared to be at ends of a rectangle shape. What really surprised as I tried to look and drive was after about a mile, looking a bit back at it, I could then see a bright yellow (like bright traffic light yellow) also in shape of bars, not glaring but bright. This might have been another side or back of a triangle that the angle caused to look like a rectangle. These lights did not look like ANY aircraft, nor was there any white light or strobe as normally on aircraft. This bright yellow was NOTHING like landing lights. The lights were almost like a police car's lights or bright traffic light, but bigger, elongated and steady. It was Really strange. In Friday fast traffic I could not stop but wish I had anyway. I'm 54, good long distance eyesight, and have seen a lot of aircraft and lights and towers and this was nothing like that. It just hung up there, but it may have been moving slowly. It looked like it was around 1500 feet out and almost the same distance up. But it could have been as much as 3000 feet or more. I had to judge by how fast I moved past it. Hopefully somebody else saw it too. Please post if you did. There was a LOT of Friday night traffic from and to Houston-Dallas route. Somebody's bound to have seen it. B.D. Dallas area."],"Longitude":"-96.449939","Weather Factors":"Unknown","Country":"United States","Region":"Texas","Disposition":"Unresolved","trends":["There have been no other sightings in Corsicana","This sighting has never been favorited."],"Log Number":"US-05182013-0002","Source":"MUFON","Object Features":"None","Sighting Duration":"Undisclosed","Tags":"City","Object Shape":"Cylinder","Object Flight Path":"Stationary","Summary":"100 ft Long Rectangle - Light bars on sides hovering about 2000 ft from road 1000 ft alt","Date of the Event":"05/17/2013 10:08 UTC","files":["/var/www/straped/mufon/html2text/47482.html.txt","/var/www/straped/mufon/org/47482.html"],"Case Number":"47482","map":"<A HREF = \"http://maps.google.com/maps?q=32.065685,+-96.449939(47482)&iwloc=A&hl=en\"> mufon case (47482) map </A>","City":"Corsicana","Latitude":"32.065685"}