{"Region":"Minnesota","Country":"United States","Longitude":"-93.111857","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=44.982134,+-93.111857(47488)&iwloc=A&hl=en\"> mufon case (47488) map </A>","Case Number":"47488","Date Submitted":"05/18/2013 02:02 UTC","Summary":"Orange Lights playing follow the leader.","trends":["There have been 6 other sightings in Saint Paul","There were no other sightings in Saint Paul on or around May 14th 2013"],"Latitude":"44.982134","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Source":"MUFON","Log Number":"US-05182013-0008","divs":["sighting detailsi was in my backyard which faces south at between the evening hours of 9:30-9:50pm, i had just sat down in chair to relax after work,when i noticed a very orange light traveling from the west to east at a speed which seemed to be a rate of a fighter jet in motion, the light was about 30\\35 degrees above horizon at a distance of 1-2 miles, i lept out of chair to follow it, the craft had a grayish internal soft light emanating from within it then veered south easterly to disappear all this happened within a matter of seconds,not a sound was heard i,am standing there still looking up when 1 minute later the same type of light followed the path of previous craft, now i,am believing my eyes when again another light passed at same speed\\path. 1 minute later another light passes same distance as other two, then a fourth passes, all this took 5-7 minutes total, its as the lights were playing follow the leader, they all vanished quickly. i have excellent hearing and sight,what i saw but did not hear makes me feel very special!"],"Object Flight Path":"Path with directional change","Tags":"City","Sighting Duration":"Undisclosed","Object Shape":"Boomerang, Sphere","City":"Saint Paul","Disposition":"Unresolved","Weather Factors":"Unknown","Date of the Event":"05/14/2013 09:33 UTC","files":["/var/www/straped/mufon/html2text/47488.html.txt","/var/www/straped/mufon/org/47488.html"]}