{"Source":"MUFON","Case Number":"47481","Country":"Malaysia","Object Flight Path":"Other","Tags":"City","divs":["Sighting DetailsIt was late at night, at approximately 1:10AM. Myself and a family member (eyewitness #1 and eyewitness #2 respectively) just arrived home. It was a clear night sky with visible stars. Just as I entered the front of my house, I happened to look to the left side of the night sky and saw at first, what appeared to be a plane. As I continued to look, the object was unlike anything I've ever seen. In simple words, it was a 'rectangle with three lights at the bottom'. The three lights were whitish-yellow. There was a red blinking light in the middle of the three lights. I was expecting the object to either travel to its left or to its right, something I'm familiar with, indicating an airplane. Instead, much to my surprise, it was slowly and gently descending. I immediately asked family member (eyewitness #2) to get the camcorder from inside the house. During this time, I continued to look at the object, but the object was becoming fainter as seconds passed by. Eyewitness #2 then gave me the camcorder and with the camera in hand, I tried to film the object but by that time, the object was too faint to be seen with the camera and barely noticeable with the eyes. There was a hill there and the object most likely descended behind it. I managed to get a couple of 'blinks' on the video I filmed but it was just that, blinks and not able to notice the rectangle with three lights. The object was completely silent. As soon as we entered the house, I drew a sketch of what I saw and asked family member (eyewitness #2) to do the same, separately without going into too much details until we compared the drawings. Note: Eyewitness #1 had a longer viewing time of the object than Eyewitness #2."],"trends":["There have been 4 other sightings in Kuala Lumpur","There were no other sightings in Kuala Lumpur on or around May 18th 2013","This sighting has never been favorited.",""],"Longitude":"101.639194","Summary":"Rectangle with three white lights at bottom/on it with blinking red light in the middle.","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/47481.html.txt","/var/www/straped/mufon/more/47481_submitter_file1__2Copy.jpg","/var/www/straped/mufon/more/47481_submitter_file2__1Copy.jpg","/var/www/straped/mufon/org/47481.html"],"Latitude":"3.223604","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=3.223604,+101.639194(47481)&iwloc=A&hl=en\"> mufon case (47481) map </A>","Object Shape":"Star-like","Region":"Federal Territory of Kuala Lumpur","Object Features":"Unknown","Date Submitted":"05/18/2013 12:07 UTC","Log Number":"MY-05182013-0001","Date of the Event":"05/18/2013 01:10 UTC","City":"Kuala Lumpur","Disposition":"Unresolved"}