{"Region":"Missouri","Date Submitted":"05/18/2013 11:36 UTC","Sighting Duration":"Undisclosed","Country":"United States","Source":"MUFON","Weather Factors":"Unknown","Summary":"Extremely large Dark object with reflective bottom, no sound moving slowly north","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=39.740846,+-92.45621(47497)&iwloc=A&hl=en\"> mufon case (47497) map </A>","Case Number":"47497","City":"Macon","Longitude":"-92.45621","Latitude":"39.740846","Object Features":"None","Tags":"City","Log Number":"US-05182013-0016","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Other","divs":["Sighting DetailsThe time and date is approx. This happened as I and my friend were walking to my house after a high school event. I was dark and as we walked westbound, I noticed that the stars in the sky were all moving in the same formation to the north. I made my friend aware of this and we both watched as the stars turned out to be the refection of the street lights off the bottom of the enormous dark object that moved to the north. We were unsure of the altitude, but to my best memory it was maybe 1000 ft up. The object was either so large or so low that it filled 50% of my field of view towards the sky. We both ran to my house and both drew pictures of what we saw, his picture depicted a disc shape as mine was more of a curvature of the bottom of a large object. To this day I remember the sighting, and I'm glad someone else was with me to see it. There is absolutely nothing it could have been mistaken for, my regret is that I don't readily remember if it had edges like a triangle or disc or cylinder, its just been too many years. No sound, reflective bottom, enormous size, and moving north."],"Disposition":"Unresolved","Date of the Event":"01/10/1981 12:00 UTC","trends":["There have been no other sightings in Macon","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/47497.html.txt","/var/www/straped/mufon/org/47497.html"]}