{"Object Shape":"Sphere","Object Flight Path":"Unknown","Case Number":"47495","Tags":"City","Country":"United States","City":"Moore","Date Submitted":"05/18/2013 11:09 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.340595,+-97.476865(47495)&iwloc=A&hl=en\"> mufon case (47495) map </A>","trends":["There have been 23 other sightings in Moore","There were no other sightings in Moore on or around May 18th 2013","This sighting has never been favorited.",""],"Summary":"Shifted up & to the right, in sync, held pattern, humming & finally ascended out of sight","divs":["sighting detailsi was sitting on the couch next to a window watching the weather. thunderstorms on their way. other than a dim light above my front door, there is no lighting. my apartment faces the west & over looks trees. i noticed bright yellow orange orb like lights traveling up & to the right. i was frozen with fear as i have seen many program on similar experiences. as more appeared i made my way to the window & snapped a few pics w\\ my iphone. i called my ex tommy karr. he is very knowledgable about the unexplained. he didn't answer. i quickly filmed a video of the last of the lights traveling. my phone was close to dying so i stopped the video so i wouldn't risk losing it if my phone died. after the remaining lights disappeared into the sky the humming stopped. i sat on the floor near the window for about 10 mins. i was afraid to move. i sent the pictures to tommy & posted the video on facebook. i also sent it to a local news station. i was eventually able to send the video to tommy & he advised me to contact mufon."],"Object Features":"Unknown","Disposition":"Unresolved","Source":"MUFON","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/47495.html.txt","/var/www/straped/mufon/more/47495_submitter_file2__image.jpg","/var/www/straped/mufon/more/47495_submitter_file3__image.jpg","/var/www/straped/mufon/org/47495.html"],"Viewing Distance":"Unknown","Date of the Event":"05/18/2013 08:55 UTC","Latitude":"35.340595","Log Number":"US-05182013-0014","Region":"Oklahoma","Longitude":"-97.476865"}