{"Disposition":"Unresolved","divs":["sighting detailsafter a soccer game, past saturday (11\\may\\13), we had a barbecue outside in the backyard of the house. all familly started to go out and few minutes they called me and every body who was in the house. then my oldest son told me to look up and they there where this really round lights flashing randomly. unfortunatelly it was clouded and we can't tell more accuratelly how many where there. the clouds open and close visibility; so, we can't see clearlly to describe the approximate quantity or other details; but guessing, i will say they where no less than 30 and up to a hundred and in regards to movement i will say they where steady and then moved to south very slowly. if it wasn't for the quantity and that they didn't flyed in formation i cold probably say that they where military planes. one more thing is that 3 or 4 of this lights where brighter cause when clouds got together you can see them trough the cloud at least you can see a blur light. then i try to picture them, and told my boys to do it and they already try; but, it couldn't be done with cell phones, they just came out black..."],"Object Shape":"Flash, Sphere","trends":["There have been no other sightings in NL","This sighting has never been favorited."],"Weather Factors":"Unknown","Date of the Event":"05/18/2013 10:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=25.650846,+-100.38986(47507)&iwloc=A&hl=en\"> mufon case (47507) map </A>","Country":"Mexico","Object Flight Path":"Stationary,Straight-line path","Latitude":"25.650846","Date Submitted":"05/19/2013 03:10 UTC","Sighting Duration":"00:30:00","City":"NL","Viewing Distance":"Over One Mile","Tags":"City","Longitude":"-100.38986","Region":"Nuevo Leon","Source":"MUFON","files":["/var/www/straped/mufon/html2text/47507.html.txt","/var/www/straped/mufon/org/47507.html"],"Log Number":"MX-05192013-0009","Case Number":"47507","Object Features":"Unknown","Summary":"Lots of steady lights, like airplane, no formation all random, then went south."}