{"Log Number":"US-05072006-0001","Object Flight Path":"Path with directional change","Source":"MUFON","Weather Factors":"Windy","Longitude":"-106.644627","Case Number":"4750","trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around April 15th 1982"],"Date of the Event":"04/15/1982 03:05 UTC","Date Submitted":"04/15/1982 03:05 UTC","Object Features":"None","City":"Albuquerque","Country":"United States","Summary":"2 objects over Manzano mountains from 3am to 3:05am blinking rapidly","Disposition":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","Region":"New Mexico","Latitude":"35.088891","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsI was letting the dog outside and opened the front door which faces South. I opened the door and before I could open the screen door I noticed two large cigar shaped objects over the Manzano mountains. The objects were blinking rapidly and moving in circular motions. The color was indistinguishable. The main color was white but I noticed all the colors of the rainbow. When I first saw the objects, I wanted to go outside to get a better look, but I was 4 months pregnant with my son and became very afraid. I wanted to yell for my husband, but I was frozen in place. I could not speak or move, I just stood there and watched the objects, trying to take in the fact that I was seeing something that I could not explain. As I watched the objects I tried to understand how large they really were because they appeared large from the distance I was standing. Finally, I snapped to attention and yelled for my husband, when I turned back at the door, the objects were gone. Afterward, I was terrified of thinking that we are being watched. It was at least a year before I talked about it with anyone. I called Sandia Labs and reported the incident to someone who takes UFO reports and he said it is not unusual for people to delay making a report. I truly believe that what I saw that night was a UFO."],"map":"<A HREF = \"http://maps.google.com/maps?q=35.088891,+-106.644627(4750)&iwloc=A&hl=en\"> mufon case (4750) map </A>","Object Shape":"Cigar","files":["/var/www/straped/mufon/html2text/4750.html.txt","/var/www/straped/mufon/org/4750.html"]}