{"Region":"New Mexico","Latitude":"36.843689","map":"<A HREF = \"http://maps.google.com/maps?q=36.843689,+-107.984165(47501)&iwloc=A&hl=en\"> mufon case (47501) map </A>","Disposition":"Unresolved","trends":["There have been 6 other sightings in Aztec","There were no other sightings in Aztec on or around May 18th 2013"],"Viewing Distance":"501 Feet - 1 Mile, Unknown","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Tags":"City","Object Shape":"Disc, Sphere","Date Submitted":"05/19/2013 01:05 UTC","Log Number":"US-05192013-0003","Object Features":"Unknown","divs":["Sighting DetailsWhile sitting in my hot tub just after 9:00 pm I noticed two blue orbs coming over from out of the north. They were below cloud level. No sound. Best estimate for size; I'd say about 10 of them would fill the moon area. But since I really can't tell how high they were this isn't much help. These two were really not side by side when they went over but moved into that configuration as they went south. Guessing that they were about three miles south of me ,,,then a smaller red one joined up them from the left. It seemed to come up to them and almost instantly match speed. At about the same time I noted three more coming in from the north. Two blue ones with another red one between them. When those got south of my location there was one more blue one that followed. Their direction was generally south and a little east but they all seemed to wander slightly. The area is Aztec, NM. The colors remained constant in strength and the blue was almost like a neon blue color. All seemed to be round in shape. I almost wanted to wave at them but had second thoughts. They just went out of sight going south into the distance. I'd guess the time involved was 2 to 4 minutes."],"files":["/var/www/straped/mufon/html2text/47501.html.txt","/var/www/straped/mufon/org/47501.html"],"Longitude":"-107.984165","Date of the Event":"05/18/2013 09:10 UTC","City":"Aztec","Case Number":"47501","Country":"United States","Summary":"Two groups of three crafts (two blue and one red) then a single blue orb that followed.","Object Flight Path":"Path with directional change","Source":"MUFON"}