{"Case Number":"4751","Summary":"Three yellow balls of lights over the Gulf of Mexico. All the same size.","Object Features":"None","Weather Factors":"Unknown","Object Shape":"Circle","Date of the Event":"05/01/2006 08:15 UTC","trends":["There have been 10 other sightings in Destin","There were no other sightings in Destin on or around May 1st 2006","This sighting has never been favorited.",""],"Latitude":"30.400664","Tags":"City","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/4751.html.txt","/var/www/straped/mufon/more/4751_submitter_file1__DestinCondo.jpg","/var/www/straped/mufon/org/4751.html"],"Object Flight Path":"Stationary","Date Submitted":"05/01/2006 08:15 UTC","divs":["Sighting Details(1)My wife was sitting on the porch of our condo relaxing on a mild, half-moon clear night. (2)Our condo faces the Gulf of Mexico with an unrestricted view of the Gulf, and she noticed three, marble size yellow lights just above the horizion. (3)She knew they were not lights from a water craft, an airplane or ballons. The moon was illuminating the surface and nothing solid could be seen. My wife is a nurse, and was a captain in the United States Air Force for 8 years specializing in aerospace medicine. She owns her own company that investigate medical fraud. (4)The three yellow lights were aligned in a east to west angle upwards, with the bottom light about 5 degrees above the horizion with even spacing between each light (about 1 degree seperation). The lights were stationary for about 2 minutes then suddenly were not there anymore. The lights did not fly away, they just were not there anymore. (I was in the underground parking at the time of the sighting washing our golf clubs). (5)My wife watched the lights for about 2 minutes until they vanished suddenly. Being a trained professional nurse and former military officer, she remained calm during this time frame. She informed me of what she had witnessed and I write down the details. I was in the underground parking for about 15 minutes. Inside the condo were two of my digital cameras and a digital DVD camera but she did not know how to operate these devices. (6)The lights just suddenly vanished...in other words...they just were not there anymore."],"Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Region":"Florida","Sighting Duration":"00:02:00","map":"<A HREF = \"http://maps.google.com/maps?q=30.400664,+-86.493893(4751)&iwloc=A&hl=en\"> mufon case (4751) map </A>","Log Number":"US-05072006-0002","City":"Destin","Country":"United States","Longitude":"-86.493893"}