{"Date of the Event":"05/04/2013 09:05 UTC","Sighting Duration":"Undisclosed","Case Number":"47516","Viewing Distance":"Over One Mile","Source":"MUFON","divs":["sighting detailsit was friday, may 4th at approx. 9:05 p.m. gf and i were walking north on ft. myers beach, fl. we both observed at approximately the same time orange lights on the horizon. we were near the neptune hotel when we saw the first lights. we observed them approaching... they were bright orange, like a street lamp one would see from a distance of a mile away or so. we saw three at first. i thought they may have been several planes on approach to regional southwest airport, as we'd seen several commercial jets fly over us on the way to landing at rsw. the lights were not in a line, but they were flying in a south-southeast direction approaching. they varied in height between themselves by 500 - 1000 feet between the 3 of them as they approached. standing on the beach they appeared to be on the horizon just to the left of the last light on a building on the beach, and moving towards us from the north-northwest. the light would have been between st. james city, on pine island and pelican\\cape coral cities. traveling over the matlacha pass national wildlife refuge which is several miles to our north-northwest. i am guessing, but they appeared to be traveling several hundred miles per hour. i had observed several jets inbound to south west florida airport earlier in the evening as they were making their final approach, pass over where i was at. those jets travel at 200 mph on approach? these objects were moving at least 2-3x faster than the inbound jets were. the three traveled towards us, but not directly at us. on their current path of travel they would pass us out over the ocean on our left. as they neared the north end of ft. myers beach island, the objects appeared to change direction. the objects turned in a southwesterly direction. the objects were flying well above the clouds. perhaps at 2,500-4,000 feet. i am guessing the clouds were 1,500 feet ? that night. i have looked but cannot find that information. clouds were broken and not very large. we watched the objects as the traveled away and appear to disappear above the clouds. at no time did we observe the lights change to the standard red and white flashing strobe lights indicating a plane. we wondered what we have just seen, when 3 more lights appeared. they traveled in the same previously described manner. however the last light appeared to higher and it turned in a more westerly manner. we watched what appeared a commercial jet flight passing overhead, flying in a west northwesterly direction as we observed these lights the commercial jet appeared to be at 35,000 feet or so. these objects were well below the jet. in the approximate time of 10 minutes, we observed 15 of these orange lights approach in the same way as described, turn and head out over the gulf of mexico. two of the lights traveled in a west-southwest direction. those two appeared to be higher than the rest as they turned. all of the others traveled in the south-southwest direction. the lights came in 3, 3 again, then 4, then 2, then 3 again. just as one group disappeared out over the gulf, more would appear on the horizon. i live 2 miles from a large commercial airport in illinois. i see and hear jets, and propeller driven commercial and private aircraft everyday and night. i watch them on approach from 10 - 15 miles away. these lights did not appear to be known aircraft. they made no sound. i saw no standard red\\white, white strobe lights. i could not really tell shape. perhaps round. size ? 15 feet i'm guessing on the first light. i got a good look at it before it disappeared over clouds. i am am guessing it's size in comparison to commercial jets that flew over us 1 1\\2 hours earlier at a similar height. i tried to take cell phone photos. only one shows two orange lights. nothing definitive. i didn't have phone set to \"night mode\"... nuts. what were they ? i do not know."],"Object Features":"Unknown","Summary":"Observed 15 Orange lights flying near Ft. Myers Beach","City":"Fort Myers Beach","Longitude":"-81.944865","Date Submitted":"05/19/2013 10:56 UTC","trends":["There have been 2 other sightings in Fort Myers Beach","There were no other sightings in Fort Myers Beach on or around May 4th 2013"],"Disposition":"Unresolved","Log Number":"US-05192013-0017","Latitude":"26.455015","Tags":"City","Country":"United States","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Object Shape":"Circle","Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=26.455015,+-81.944865(47516)&iwloc=A&hl=en\"> mufon case (47516) map </A>","files":["/var/www/straped/mufon/html2text/47516.html.txt","/var/www/straped/mufon/org/47516.html"]}