{"Log Number":"US-05192013-0013","Weather Factors":"Unknown","divs":["sighting detailsi was leaving the 76 gas station located at 26101 pacific coast hwy, malibu, ca heading west or hwy 1 northbound, when i saw 6 or 7 glowing orange\\red objects in the distance looking toward where point dume is. they were in a large linear formation slightly scattered from top to bottom. the glowing objects were moving along the coastline at a slow pace. the objects were hard to make out in terms of what shape they were other than oval. i began to notice people who where driving in the same direction as me, begin to pull off to the side of the road to take pictures or just maybe try to understand what they were witnessing. the objects were almost directly in front of me to the left slightly when i began to pass obstructions to my left blocking my view for about 20 seconds. when i saw them again they were at my 9 o'clock and only a few could have be seen and the rest were beginning to disappear. they also picked up speed and began to move inland behind me. eventually all the objects disappeared. about 5 minutes later a black helicopter was flying low to the ground in the path the objects took, the black helicopter had only one blinking red light on the tail and was quiet for its large size. i text a buddy of mine afterwards who happened to be on westward beach that saw the same thing but not until the object passed by him, he was looking south toward the pacific, then eventually due east when watching the objects for a full minute."],"Date of the Event":"05/18/2013 09:30 UTC","City":"Malibu","Date Submitted":"05/19/2013 06:35 UTC","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/47512.html.txt","/var/www/straped/mufon/org/47512.html"],"Source":"MUFON","Longitude":"-118.805409","Case Number":"47512","Object Shape":"Oval","Summary":"6 or 7 glowing objects traveling along Malibu Coastline","Region":"California","Disposition":"Unresolved","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.014778,+-118.805409(47512)&iwloc=A&hl=en\"> mufon case (47512) map </A>","Latitude":"34.014778","Country":"United States","trends":["There have been 20 other sightings in Malibu","There were 3 other sightings in Malibu on or around May 18th 2013"],"Object Features":"Dome","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change,Path then hovering"}