{"Log Number":"US-05192013-0019","trends":["There have been 7 other sightings in Sun City West","There were no other sightings in Sun City West on or around May 18th 2013"],"files":["/var/www/straped/mufon/html2text/47518.html.txt","/var/www/straped/mufon/org/47518.html"],"Object Shape":"Star-like","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=33.666472,+-112.336573(47518)&iwloc=A&hl=en\"> mufon case (47518) map </A>","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Features":"Unknown","Country":"United States","Date of the Event":"05/18/2013 09:05 UTC","Longitude":"-112.336573","Summary":"Several fast flying 'stars' (UFOs )appeared in NW about 30deg above horizon from a shimmering area of night sky","Region":"Arizona","Tags":"City","Viewing Distance":"Unknown","Source":"MUFON","divs":["sighting detailsi was in my backyard around 9:00p (az)observing the sky in order to identify bright stars and constellations with a new star chart. i had the chart, a red light, and set of 8x40 bushnell binoculars. i had been out there 15-20 mins when this event occurred. i was looking generally northwest at what i believed was the star regulus and had started to look down at my chart when a movement at the corner of my vision on the left caught my attention. i looked in that direction and was a bit startled to see a section of the sky 'shimmering' with a cluster of what appeared to be stars in the middle of it. this was at about 30 degrees above horizon at a 300 degree compass heading. they immediately moved to my right \\ northerly and spread out all going in the same direction. i estimate they were about the size and brightness of the big dipper stars. thus i first was able to see them clearly with naked eyes but then watched them with binoculars. i estimate 15 or so in number. i immediately called to my wife who was sitting several feet away just inside our patio door to come quick and see this. when she came out i gave her the binoculars and said to look 'there' and tell ma what you see. she looked first without binoculars but could not see anything unusual with naked eyes. she then confirmed with the binoculars what i was seeing and estimated there were 20 or so of these 'lights' moving away. one thing that caught my attention was a group of 4 in the middle of the larger group that were in an evenly spaced diamond configuration but then the middle 2 moved inward towards each other which elongated the diamond. as i looked at the rest of the group that was spreading out more as they moved away i 'lost the diamond'. this entire event lasted approx 2 mins. i lost sight as they went due north and over a neighbors house."],"City":"Sun City West","Date Submitted":"05/19/2013 05:16 UTC","Latitude":"33.666472","Case Number":"47518"}