{"Case Number":"47521","Date of the Event":"05/18/2013 08:00 UTC","Region":"California","Source":"MUFON","Latitude":"34.194144","Longitude":"-118.380236","Object Shape":"Sphere, Triangle","Sighting Duration":"Undisclosed","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around May 18th 2013"],"divs":["sighting detailsi was on my balcony smoking a cigarette watching the sky, it was around 8pm and i was looking at the sunset\\orange sky. when i first saw the object, i noticed it because it passed in front of a red trail that a plane had left in the sky, making the black object stand out. when i looked to see exactly what it was, though, i couldn't make out any specific shape. it looked like a tiny black ball in the sky hovering around randomly, changing direction but moving slowly. it seemed to float like maybe a group of balloons tied together would if being pushed by the wind, but with the amount of altitude and directional changes, it seemed to be too active to be balloons. after staring at the object for about 45 seconds, i ran inside, grabbed my camera, attached the zoom lens as fast as i could, and hurried back to take as many shots as i could. it started nw, then made its way more north while dropping in altitude, then went back west passing low enough to be seen in front of the mountains. after that it came back up and went upwards and north. as i zoomed in and focused on the object, i noticed that it had more shape than i had seen. once i snapped a shot and looked back on my camera to see what it looked like though, that's when i got excited. it was three perfect circles combined to create a triangular shape. i then snapped as many pics as i could to try and get any sort of different angle on the object, but after maybe 7 minutes of shooting, i decided that i needed to get the tripod because the object was moving further and further away. i didn't want the shots to keep coming out blurry, so after i ran inside to grab the tripod, brought it back outside, and set the camera up on it, the object had disappeared. it was getting pretty far away by the time i got the tripod outside, but i could see it with my naked eye all the way up until i got the camera on the tripod. it was as if it was there, and then simply not. this very well could have been balloons, my hope is to get as much feedback as possible and get to the bottom of what this could be."],"Disposition":"Unresolved","Summary":"Could have been balloons, looked too dark and perfectly shaped though.","Viewing Distance":"Over One Mile","Date Submitted":"05/19/2013 08:50 UTC","Log Number":"US-05192013-0022","Tags":"City","Weather Factors":"Unknown","Country":"United States","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/47521.html.txt","/var/www/straped/mufon/org/47521.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.194144,+-118.380236(47521)&iwloc=A&hl=en\"> mufon case (47521) map </A>","City":"Los Angeles","Object Features":"None"}