{"Log Number":"US-05192013-0025","Weather Factors":"Unknown","City":"Asheville","divs":["Sighting DetailsEarly evening sky, orb suddenly began to glow brilliantly orange. Blinked out. Lit back up. Then disappeared. Moving north to south while looking west. Not a plane, too slow for an object entering our atmosphere. This took place while eating dinner with my wife outside. Object caught my eye and stopped menus sentence. I pointed at it but only lasted 5-8 seconds. Object was easily 100 times brighter than the early evening stars. The brightness varied a little before blinking out and then reappearing only to quickly disappear. I am very familiar with satellites, planes in our area, and objects burning up while entering our atmosphere. This was completely different in every way. I first thought it had gone through some clouds where upon closer investigation, the evening sky had cleared up completely and you could see many faint stars. Just wondering if anyone else saw this object. If I could describe it, it looked like what you see through night vision when an object begins to glow or get excited. However this was a brilliant orange and seen with the naked eye. Also far larger. At arms length was about the size of a pencil eraser."],"Date Submitted":"05/19/2013 10:13 UTC","Tags":"City","trends":["There have been 28 other sightings in Asheville","There were no other sightings in Asheville on or around May 19th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.619249,+-82.664896(47524)&iwloc=A&hl=en\"> mufon case (47524) map </A>","Disposition":"Unresolved","Country":"United States","Date of the Event":"05/19/2013 09:15 UTC","Case Number":"47524","Longitude":"-82.664896","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/47524.html.txt","/var/www/straped/mufon/org/47524.html"],"Object Flight Path":"Straight-line path","Object Features":"Unknown","Region":"North Carolina","Summary":"Brilliant orange glowing object over Asheville area if looking West.","Object Shape":"Fireball, Sphere","Latitude":"35.619249","Source":"MUFON"}