{"Tags":"City","Summary":"3 bright orange orbs playing follow the leader 1 min apart","map":"<A HREF = \"http://maps.google.com/maps?q=41.848394,+-90.179538(47520)&iwloc=A&hl=en\"> mufon case (47520) map </A>","Longitude":"-90.179538","Case Number":"47520","Log Number":"US-05192013-0021","Source":"MUFON","Latitude":"41.848394","Object Flight Path":"Straight-line path","Object Features":"None","Object Shape":"Circle, Sphere","trends":["There have been 2 other sightings in Clinton","There were no other sightings in Clinton on or around May 18th 2013"],"Region":"Iowa","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/47520.html.txt","/var/www/straped/mufon/org/47520.html"],"Sighting Duration":"Undisclosed","Date of the Event":"05/18/2013 10:00 UTC","Disposition":"Unresolved","Date Submitted":"05/19/2013 07:26 UTC","Weather Factors":"Unknown","City":"Clinton","divs":["sighting detailscamping saturday night bulgers hollow recreation area in eastern iowa along with my 14yo. nephew. around 10:30 pm we were sitting around the campfire when we both noticed a very bright orange\\copper colored light through the trees. at first sight i thought it was a meteor, but within 2 seconds i ruled that out. the light emerged from behind the trees and continued moving to the north west in a straight line. the color reminded me of the orange color of a streetlamp and seemed to be pulsing. the speed was at least twice as fast as small private planes i see all the time. there was no breeze and the campground was quiet and the object made absolutely no noise. we watched it for maybe 10 seconds until it went out of view behind some trees, so we moved a few yards until we could see it again and watched it continue to move off to the northwest until it went out of sight. we discussed what it could have been and walked back to the fire and just sat down when we saw another one, same speed and heading. we watching this one scrutinizing it for any signs of airplane marker lights or any engine sounds and saw or heard none. less than a minute later another one appeared same direction and speed once again. my nephew managed to get a picture with his cell phone camera, but nothing more than a small point of light is visible."],"Country":"United States"}