{"Disposition":"Unresolved","City":"Kitchener","Sighting Duration":"Undisclosed","Tags":"City","Latitude":"43.38302","Weather Factors":"Unknown","Viewing Distance":"Unknown","Country":"Canada","Object Flight Path":"Hovering then path","Source":"MUFON","trends":["There have been 15 other sightings in Kitchener","There were no other sightings in Kitchener on or around May 19th 2013"],"Log Number":"CA-05202013-0011","Object Shape":"Fireball","Region":"Ontario","Longitude":"-80.437824","files":["/var/www/straped/mufon/html2text/47535.html.txt","/var/www/straped/mufon/org/47535.html"],"Summary":"Red/yellow Glowing ball hovering and drifting slowly then moving in straight line with increasing speed","Case Number":"47535","map":"<A HREF = \"http://maps.google.com/maps?q=43.38302,+-80.437824(47535)&iwloc=A&hl=en\"> mufon case (47535) map </A>","Date Submitted":"05/20/2013 10:43 UTC","divs":["sighting detailsfireworks were being fired from neighbourhood street at the time approximately 9:35pm to 9:40pm may19th(location is 5nm from the waterloo international airport). at first it appeared to be one of these flying glow lanterns glowing appeared 30-40 degrees fairly low on horizon initially i observed it just to the right of where the fireworks were being launched. observed this glowing ball. at first dismissing it as fireworks. then noticed this fireball was just hanging there and drifting ever so slightly. then i observed the this glowing ball moving with increasing speed to the north west on an accelerating straight path. once it began to move from position near the fireworks it was moving several times the speed of an average airliner. it displayed no strobes or navigation lights identifiable as any private or commercial aircraft. this object appears exactly as observed and video recorded in mexico on the same day. see following link. same red\\yellow glowing objects with varying intensity varying speed from near stationary acceleration in a straight line. i am a licensed private pilot and the characteristics were unlike any normal aircraft. [link moved to fi section\\cms\\tg]"],"Date of the Event":"05/19/2013 09:38 UTC","Object Features":"None"}