{"Source":"MUFON","files":["/var/www/straped/mufon/html2text/4753.html.txt","/var/www/straped/mufon/org/4753.html"],"Region":"Michigan","trends":["There have been 11 other sightings in Port Huron","There were no other sightings in Port Huron on or around May 6th 2006"],"Disposition":"Insufficient Data","Date Submitted":"05/06/2006 10:08 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.970863,+-82.424914(4753)&iwloc=A&hl=en\"> mufon case (4753) map </A>","Latitude":"42.970863","Weather Factors":"None","Summary":"Circle like object was stationary, then it began moving toward the south toward a casino spotlight, shot off three unknown objects, then both vanished.","Date of the Event":"05/06/2006 10:08 UTC","City":"Port Huron","divs":["Sighting DetailsDarlene was intrigued by the moon. So I went outside to look at it, and noticed it was a clear night with all of the stars brightly shining. I went back in the house and asked my husband to come out and look at the stars. He was standing in our driveway looking up at the sky and we were discussing which star was the brightest. He then said to me \"look at that one there,that one is really bright.\" Then he said \" oh Sh** it's moving.\" So I then went from the porch and went in the driveway, and noticed the object moving as well. I was just shocked!! Then as it moved slowly across the night sky toward Canada, we had noticed a green tint to the object. We were asking each other what the heck it was and was questioning whether or not it was a plane? It had no sound to it.. so we knew it was'nt! Plus the speed of it was very slow!! Then he had told me to go inside and see what time it was. As I stepped on the porch, he yelled out \"Oh Sh**, Oh Sh**,look,look.\" I turned back around, and that's when we both witnessed three small objects being shot out from the larger object towards the left side of it. The smaller objects had a white glow to them. We were both pretty much shooken up to see this happen. As we were watching the three small objects move further away, the larger object disappeared, then the three objects vanished as well. We tried to see where they went, but no such luck!! Ali had went in and called the St.Clair County International Airport to see if there were any known flights in the area, and told them what we had seen. They said there was not any flights, and to keep watch of the sky. After about 15 minutes of this episode, there was a jet circling the area. We did keep watch for about an hour, and right before I went back in the house, I had noticed yet another small object in circular form, I called my husband back outside to see it. We both watched this object veer in zig zag pattern for about 3 mins, then it vanished out of sight."],"Sighting Duration":"00:08:00","Country":"United States","Object Flight Path":"Stationary,Straight-line path","Case Number":"4753","Longitude":"-82.424914","Log Number":"US-05072006-0004","Viewing Distance":"101-500 Feet","Tags":"City","Object Shape":"Circle, Other","Object Features":"Unknown"}