{"Region":"Queensland","Object Shape":"Fireball","Disposition":"Unresolved","divs":["Sighting DetailsI was driving home from town and I looked up and saw a bright fire in the sky. It was very high altitude and at first I thought it was a contrail until I noticed the fire tail was moving and not spreading out just disappearing like flames not smoke..it looked like an object alight with a firetrail like a comet. it was moving very slowly towards the north. The tail was flashing and moving like it was fire. but very comet like. I got home and called my son out. he could see it and we both walked over to the beach to watch it. As it moved North it started drifting sideways and the tail disappeared. I went up to others on the beach and pointed it out to them. They were amazed as it sat there drifting slowly, an orange ball in the sky above where the sun had set. They were saying it looked like a kite and then as we watched it the tail all of a sudden got bigger again from the ball, then smaller then it came right out again and it shot off sideways fast again from the difting it was doing and disappeared down towards the horizon. My daughter came home from her walk and the first thing she said was that she had seen a fire in the sky moving iwht a tail. Two other firends also saw it from hervey bay and Craignish."],"Latitude":"-25.25571","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Log Number":"AU-05202013-0011","Sighting Duration":"Undisclosed","Case Number":"47536","Summary":"Spotted Comet like object moving overhead slowly towards north. Followed object visually for aorund 40 minutes","trends":["There have been no other sightings in Toogoom","This sighting has never been favorited."],"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=-25.25571,+152.690556(47536)&iwloc=A&hl=en\"> mufon case (47536) map </A>","files":["/var/www/straped/mufon/html2text/47536.html.txt","/var/www/straped/mufon/org/47536.html"],"Date Submitted":"05/20/2013 10:46 UTC","Tags":"City","Date of the Event":"05/21/2013 05:15 UTC","Longitude":"152.690556","City":"Toogoom","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Country":"Australia","Source":"MUFON"}