{"Source":"MUFON","divs":["sighting detailson sunday may 19, 2013 at approx 9:45 pm eastern time in newmarket ontario, 3 witnesses notice 2 extremely bright orange \"stars\" glowing in the sky. we were outside watching the neighbours fireworks and gazed up further into the sky away from where this was taking place. it was a very clear, calm and cloudless night..perfect for stargazing. which is what we were doing in between fireworks. we noticed the first \"orange star\" nw in the sky.. it was pulsating,brightest light in the sky and very large.. hovering and we were comparing it to the moon and other stars. then we noticed the other one was located se in the sky. they were very high in the sky, but not quite as high as the stars or moon but very,very far away. (hundreds of miles?) it was not a plane\\helicopter\\fireworks or obstructed by clouds or buildings. they appeared almost as far as the stars so looked like fireballs with no distinct edges to the naked eye. they were in proximity to each other like the side of a perfect triangle. the nw one started to move suddenly, slow down, hover in a ne direction. then the se one began similar movements towards the sw direction until passing each other high in the sky. we could only track one at time and had to turn our heads to see the other one. the se one had now moved sw, and the nw one ne.. i was following the sw one at this time until it \"fizzled and faded\" like a flame.. the other one continued on a ne path until we lost sight if it due to trees down in the ravine below us. this went on for at least 20 minutes that we noticed them until we had to go in due to the chilly weather. my 15 yr old son, one of the witnesses, used his iphone to record the incident but upon playback (without being able to zoom, did not capture exactly what we saw) on his phone they just looked like 2 brighter orange 'stars'\\dots moving in the sky while all the others remained still) anyone looking in the sky at this time would have seen it too...and not mistaken it for any other known flying object. a few friends in guelph (1.5 hr drive away) also did."],"Date of the Event":"05/19/2013 10:00 UTC","City":"Newmarket","Viewing Distance":"Over One Mile","Object Flight Path":"Hovering then path","Country":"Canada","Latitude":"44.031036","Sighting Duration":"Undisclosed","Object Shape":"Fireball, Sphere, Star-like","Log Number":"CA-05202013-0013","Case Number":"47537","Disposition":"Unresolved","Longitude":"-79.482421","Weather Factors":"Unknown","trends":["There have been 6 other sightings in Newmarket","There were no other sightings in Newmarket on or around May 19th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=44.031036,+-79.482421(47537)&iwloc=A&hl=en\"> mufon case (47537) map </A>","files":["/var/www/straped/mufon/html2text/47537.html.txt","/var/www/straped/mufon/org/47537.html"],"Date Submitted":"05/20/2013 12:01 UTC","Tags":"City","Object Features":"Unknown","Summary":"OBSERVED 2 ORANGE GLOWING \"STARS\" (SMALLER THAN MOON AND 5X LARGER THAN ANY STAR/SATTELITE/PLANET VISIBLE IN THE LEAR SKY. FIRST ONE HOVERED NW, WHILE THE SECOND HOVERED SE HIGH AND FAR IN THE SKY BEFORE 'FIZZLING OUT\" LIKE A FLAME AND DISSAPEARING..","Region":"Ontario"}