{"files":["/var/www/straped/mufon/html2text/47548.html.txt","/var/www/straped/mufon/org/47548.html"],"trends":["There have been 16 other sightings in Newport Beach","There were no other sightings in Newport Beach on or around May 1st 2013"],"Object Flight Path":"N/A","Case Number":"47548","Country":"United States","Source":"MUFON","Latitude":"33.630964","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.630964,+-117.902545(47548)&iwloc=A&hl=en\"> mufon case (47548) map </A>","divs":["Sighting DetailsI was in my bed, just getting ready to sleep. Even at my most worn out moments, it takes me at least 4-5 minutes to fall asleep. I wasn't very tired at all, and had been in bed for about 30 seconds. In regards to noticing an object, I never saw a ship or disc, just vivid light. And I didn't have a choice in noticing this phenomena because I felt a sense of extreme emotional discomfort, as if I knew that I was going to be subjected to something against my will in the coming moments. It was a strange feeling because I still had the cognitive ability to realize that I wasn't asleep yet, but I didn't have the mental strength to wake myself up to a full state of awareness. I could hear myself resisting vocally, with \"No\" and \"Stop.\" As this started happening everything was getting more intense. There wasn't really a sound present in the experience, but more of a heavy layer of electric air. It was at this time that I experienced this \"heavy sound,\" and at this moment I remember rolling to my right side and placing my right hand under the pillow, palm to face. I can remember this because I had a brief window of mental strength where the fear subsided just long enough for me to move into this position, which has been my most comfortable sleeping position since I was a child. Everything was shaking at this point. Not like an earthquake, but much more powerful and compact. I know that both my bed, and my body were shaking, I can't comment on the rest of the room. The shaking I was experiencing was unlike anything I could every explain. I tried replicating the effect the next day by tensing all my muscles in my upper body, but I could only achieve maybe 10% of the overall intensity. If someone were to witness the experience I had while shaking, they probably wouldn't even notice that my body was in a turbulent state because it was so severe. After a couple seconds of this intense shaking, the electric weighted air felt as if it was syphoning upwards into a concentrated point, which caused my upper body to begin to lift off the bed. I was being drawn upwards for about 5 seconds until I was suddenly dropped back onto my bed. It was at this time that I had more of my self awareness back, and wasn't as fearful. I was wide awake at this point, but I still felt that heavy weight in the room. I desperately wanted to jump up and run into the bathroom and find my cat, for reassurance that I wasn't in a nightmare. But I couldn't move yet. Moments later, I could hear and feel the ceiling fan which I always have on high, and I jumped immediately out of bed and got the hell out of my room. I walked around distraught and utterly confused for a few minutes, but ultimately went back to sleep. I wouldn't take the time to write about this if I thought there was a slight chance it could have been from sleep deprivation, twilighting, dreaming, or any other psychological effect. I wouldn't even write this if it happened once. But it hasn't. It's happened twice."],"City":"Newport Beach","Region":"California","Sighting Duration":"Undisclosed","Log Number":"US-05212013-0004","Date of the Event":"05/01/2013 12:00 UTC","Longitude":"-117.902545","Object Features":"Unknown","Date Submitted":"05/21/2013 06:39 UTC","Viewing Distance":"20 Feet or Less","Disposition":"Unresolved","Object Shape":"Unknown","Weather Factors":"Unknown","Summary":"Experienced a beam of intense light and physical manipulation moments after lying down to sleep."}