{"Latitude":"39.120209","files":["/var/www/straped/mufon/html2text/47543.html.txt","/var/www/straped/mufon/org/47543.html"],"Weather Factors":"Unknown","divs":["Sighting DetailsStory: I was in a car coming home from getting food from a restaurant nearby. I saw an orange orb, which I immediately thought was a plane, and thought about how I had to travel for business the next day and was going to be on an air plane soon. This orb was the top of the triangle. I then shifted my focus to two more planes flying right behind the first, which were both the same size and color. I thought it was odd that the two orbs were both flying at the exact same speed, and then realized that all three orbs were traveling at the same speed. I then put two and two together and noticed the objects were forming a rigid triangle shape and were all traveling at the same speed and keeping the same distance. The second I came to the conclusion the orbs were in a triangle shape, they stopped together and just hovered over Cincinnati. I noticed how the object was completely translucent and that it seemed to be the size of the whole city (The large size could have came from my perspective). I was trying to take all of it in, as my friend took a right turn onto where I live. I had to travel up a hill and I was unable to see the object for about 15 seconds (Longest 15 seconds of my life). When we stopped at my house I was unable to see the object anymore. I thought it was over, but then I saw another of the exact same orb traveling very fast towards where the center of the object would have been. I ran up a hill (>1 minute maximum time) and by the time I reached the hill it was completely gone. Object: -Triangle shaped -Initially with three glowing orange orbs -Translucent -Seemed near city size -Fourth orb (exactly the same as the other three) flew into what looked like to be the center of the object Flight Path: -Triangle Flew South about airplane speed from North of Cincinnati -Stopped over Cincinnati and hovered -Fourth orb flew on the same flight path as the first 3 orb (Triangle structure) -Fourth orb flew much faster than the original three orbs -Fourth orb seemed to be flying in the middle line of the structure -Disappeared"],"Object Flight Path":"Path then hovering","Date of the Event":"05/12/2013 11:15 UTC","Object Shape":"Triangle","Sighting Duration":"Undisclosed","Date Submitted":"05/20/2013 09:39 UTC","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-05202013-0019","Case Number":"47543","trends":["There have been 82 other sightings in Cincinnati","There were no other sightings in Cincinnati on or around May 12th 2013"],"Summary":"Hovered over Cincinnati. A orange orb flew into the translucent triangle shaped object. Then disappeared.","Source":"MUFON","Longitude":"-84.487919","City":"Cincinnati","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.120209,+-84.487919(47543)&iwloc=A&hl=en\"> mufon case (47543) map </A>","Object Features":"None","Tags":"City","Region":"Ohio"}