{"Region":"Victoria","Case Number":"47541","Latitude":"-37.844224","Object Flight Path":"Other","Object Shape":"Flash","map":"<A HREF = \"http://maps.google.com/maps?q=-37.844224,+144.97605(47541)&iwloc=A&hl=en\"> mufon case (47541) map </A>","Viewing Distance":"20 Feet or Less","Date Submitted":"05/20/2013 07:47 UTC","trends":["There have been 40 other sightings in Melbourne","There were no other sightings in Melbourne on or around August 17th 1990"],"Log Number":"AU-05202013-0017","Tags":"City","Summary":"A metaphysical experience of an unknown entity. Tall/lean very white. Telepathically was informed he was \"an interstellar explorer\". I have experienced other intruders passing through death door or higher consciousness frequency.","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Source":"MUFON","Object Features":"Other","Longitude":"144.97605","City":"Melbourne","divs":["Sighting DetailsIt was approximately 4a.m. August 1990, whilst sleeping in my bed. I was dreaming of gazing up at the stars wondering if there was any life out there. Then a sudden immense flash of extremely bright light invaded my conscious space. I saw a very tall white entity. The light surrounding it was very bright and difficult to see the details. I telepathically asked \"what are you?\" and was conveyed via thought transference \"an interstellar explorer\". I felt this entity was somewhat like a \"scientist\" gathering and exchanging information. Our life force energy \"fused\". It was an overwhelming experience but positive. I awoke immediately after the event, \"knowing\" without any doubt it was \"real\". I felt a \"complete\" sense of \"calm accepting\" for at least a week after the event. I believe that we are and have been communicating all the time with other entities throughout the universe via our senses. Like Dr. Greer mentioned, via our \"higher consciousness\"."],"Weather Factors":"Unknown","Country":"Australia","files":["/var/www/straped/mufon/html2text/47541.html.txt","/var/www/straped/mufon/org/47541.html"],"Date of the Event":"08/17/1990 12:00 UTC"}