{"Longitude":"-75.145845","Log Number":"US-05212013-0002","Sighting Duration":"Undisclosed","Case Number":"47546","divs":["Sighting DetailsOutside smoking on the back porch. A continuous crunching sound from the yard next to us. There's no one outside, it's 1:32 in the morning, the neighbors don't have any pets, their fence is too high for anything to get in. The crunching stops as soon as we turn on the light, and then it starts and when we turn it out. We were both freaked out because this crunching sound was ridiculous, it was like an animal was going to town on something, but whatever it was was fenced in by a high fence. William went to the fence, and hit the side of it, and the fence moved, this heavy fence moved. He hit it again, and it moved again. The crunching had stopped. We went out to the front porch and he walked from the porch onto the ground, onto gravel, and went into our neighbors yard. There was nothing there, and there was no sign of anything. Whatever it was wasn't there anymore, and it left nothing touched. We live near the beach, and also farm land. We are both freaked out. We didn't start recording anything till after it happened, we started recording sound when he decided to go into their backyard."],"Country":"United States","Tags":"City","City":"Lewes","Date of the Event":"05/21/2013 01:32 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.763607,+-75.145845(47546)&iwloc=A&hl=en\"> mufon case (47546) map </A>","Source":"MUFON","files":["/var/www/straped/mufon/html2text/47546.html.txt","/var/www/straped/mufon/org/47546.html"],"Object Shape":"Other","Region":"Delaware","Weather Factors":"Unknown","Object Features":"Unknown","Summary":"An obnoxious crunching sound behind fence, 10 minutes after it stopped, when to go look and nothing was touched.","Date Submitted":"05/21/2013 02:45 UTC","Object Flight Path":"Unknown","trends":["There have been 6 other sightings in Lewes","There were no other sightings in Lewes on or around May 21st 2013"],"Disposition":"Unresolved","Latitude":"38.763607","Viewing Distance":"20 Feet or Less"}