{"Disposition":"Unresolved","Longitude":"-111.86847","Object Flight Path":"Path with directional change","Region":"Utah","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.92571,+-111.86847(47556)&iwloc=A&hl=en\"> mufon case (47556) map </A>","Country":"United States","Tags":"City","Date Submitted":"05/21/2013 02:51 UTC","files":["/var/www/straped/mufon/html2text/47556.html.txt","/var/www/straped/mufon/org/47556.html"],"Log Number":"US-05212013-0011","divs":["Sighting DetailsI was sitting in the bed of my truck talking on the phone. It was dark and I noticed 3 lights in the sky that looked different from the rest. I then noticed they were in a huge triangle shape and silently moving eastward, but very slowly. I was so shocked I couldn't think. I don't remember seeing stars between the lights, but I'm not sure if it was blacked out either. I just sat in awe and shock because it was so incredibly big and silent but defiantly moving. I'm not sure how long I was out there, but I do believe this was directly over my parents home. When it suddenly took off straight upward, silently, I came out of my \"trance\" and called my parents on my cell phone and told them to hurry out and see this thing. By the time they made it out the light was so high and so faint that they couldn't see it. I have never seen anything move that fast. This was also my first sighting so I had never heard of \"triangles\" either, until I googled Ufos later that night. I was so stunned to see this that I started to question if I had even seen it, but I'm sure of it now. I had never done drugs or drank anything. I was completely sober. I do recall being just a little scared, but mostly I was just shocked. It felt like time stood still."],"Weather Factors":"Unknown","Date of the Event":"06/30/2003 12:00 UTC","Summary":"I noticed the triangle slowly, silently moving above my parents house. It moved to the east and then shot straight upward so fast and so high I could no longer see it.","trends":["There has been one other sighting in Centerville","There were no other sightings in Centerville on or around June 30th 2003"],"Object Shape":"Triangle","Object Features":"Unknown","Latitude":"40.92571","City":"Centerville","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Case Number":"47556"}