{"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/47555.html.txt","/var/www/straped/mufon/org/47555.html"],"Latitude":"40.918","Object Features":"None","Log Number":"US-05212013-0010","Longitude":"-111.87216","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.918,+-111.87216(47555)&iwloc=A&hl=en\"> mufon case (47555) map </A>","Date Submitted":"05/21/2013 02:20 UTC","Date of the Event":"03/10/2013 07:30 UTC","Sighting Duration":"Undisclosed","Case Number":"47555","Summary":"5 in a vertical line. 1 was mid mtn level. 4 just slowly dimmed and disappeared. 1 slowly rose above mtn level then also disappeared. Like evaporation. Silent. Multiple witnesses. We were in the Walmart parking lot.","Country":"United States","City":"Centerville","Disposition":"Unresolved","Viewing Distance":"Over One Mile","trends":["There has been one other sighting in Centerville","There were no other sightings in Centerville on or around March 10th 2013"],"Tags":"City","Region":"Utah","Object Shape":"Sphere","Object Flight Path":"Stationary,Hovering then path,Straight-line path","divs":["Sighting DetailsI just exited Walmart just after dusk. I noticed people staring at the mountains in the east. There were 5 or 6 glowing golden lights in a vertical line ranging from well above the mountain top to one that was about halfway down the mountain. They were silent. I tried to take some video but they were not bright enough to show on the screen, but they were plenty bright in the sky. I just watched them do nothing for maybe 5 minutes. Others came out of the store and watched too. Slowly, one at a time the top few started to extinguish. I watched the one in the mountains slowly rise vertically where the others had been and it too just slowly vanished. There was an older man there who asked me what they were. I told him. I didn't know. This was my second sighting in 11 years so I felt calm but very excited to see something again. When it was over everyone just got in there vehicles and left."]}