{"Date Submitted":"05/21/2013 05:39 UTC","Longitude":"-79.817908","Disposition":"Unresolved","Sighting Duration":"01:00:00","trends":["There have been 7 other sightings in McKeesport","There were no other sightings in McKeesport on or around June 14th 2011"],"Country":"United States","files":["/var/www/straped/mufon/html2text/47557.html.txt","/var/www/straped/mufon/org/47557.html"],"City":"McKeesport","Region":"Pennsylvania","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=40.351112,+-79.817908(47557)&iwloc=A&hl=en\"> mufon case (47557) map </A>","Source":"MUFON","Case Number":"47557","Object Features":"Dome","Object Shape":"Circle, Fireball","Date of the Event":"06/14/2011 08:17 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Log Number":"US-05212013-0012","Latitude":"40.351112","divs":["Sighting Detailsmyself my 10 year old son, friends were outside talking when someone noticed out of nowhere that this thing popped up with no sound or notice. it just was there. I got on the phone and called the local news and of course they thought it was funny but I didn't especially when the neighbors came out and we were telling them when it just returned without warning. I took a photo but the object showed up much smaller then what I had seen. I also have video of two different sightings in the same area but can not say for sure what they were but one is triangle shaped and other than that it is a pretty clear video. I must tell you since this sighting I can only say if they want to harm us they will and we will never be able to stop them because if they have the ability to just show up without warning you will never know they are there until it is to late. I now find myself looking in the sky out my windows or driving and everything I do ,it has taken over my life and need to know if it was real or if I am crazy. Please help me figure this out............. The object was round, glowing orange and what looked like something sticking out of the top wobbeling. This thing was huge and it wasn't very dark out yet. You all are welcome to examine,keep or whatever you want with what I have."],"Tags":"City","Weather Factors":"Unknown","Summary":"orange glowing ball"}