{"Object Features":"None","Country":"United States","Case Number":"47551","divs":["Sighting DetailsI was in my car, on the way home, after picking up my son from work. It was about 12:30 AM, after midnight. A clear night, and little wind. I was just a few houses away from home, when my son yells out \"UFO!\" I looked in the direction he indicated, on his side of the car, and didn't see anything. As I was turning right into my driveway, I looked again, and saw a red light. I parked the car in my front yard, and quickly exited, and rushed to the side of the garage that I expected the object to be more easily seen. I was not prepared for what I saw. I truly expected it to be a helicopter, because when I first saw it, it was where helicopters are often seen, going to our local hospital. What I saw was an object, taller than it was wide, moving in a direction that paralleled our local ridges. It was moving at a moderate speed, and it was a bright red. Then, it changed color to a dark orange, but still a bright light. The color emminated from the entire object. As it continued on, the colors changed from bright red, to dark orange, then to a dull red, to dark orange, and back to bright red, in a pattern. And absolutely no sound. As it continued on it's path, it turned direction slightly more to the north. That's when I saw a small white round object, that seemed to come from around behind the main object, trailing it, and it made an orbit of the main object. When the smaller white light had come around the front of the main object, and went out of view behind it, the main object seemed to shrink, and just faded out. It didn't go out of view behind the ridge, or fade into the distance, it just disappeared. I wasn't aware my son was even next to me, until I heard him say \"Where did it go?\" I replied \"I don't know.\" He then said \"That was a UFO, for sure.\" The time that I observed it, standing by the side of my garage, was less than two minutes. I was very focused as I was watching it, and felt kind of disturbed when it had gone. I asked my son if he had seen the little white light, and he said \"Yes.\" I said \"Good. I was hoping my vision hadn't blurred, or something.\" We went into the house, and talked about it for a few minutes, and then went to bed. It was late, and we both had to work the next day."],"Sighting Duration":"00:01:45","Object Shape":"Cylinder","Disposition":"Unresolved","Longitude":"-114.279904","Summary":"Observed a bright light advancing in the night sky. It moved slowly, red and orange.Then, it disappeared.","files":["/var/www/straped/mufon/html2text/47551.html.txt","/var/www/straped/mufon/org/47551.html"],"Region":"Arizona","Tags":"City","Latitude":"34.46217","Date of the Event":"05/19/2013 12:00 UTC","City":"Lake Havasu City","Object Flight Path":"Straight-line path,Path with directional change","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Log Number":"US-05212013-0007","Source":"MUFON","Date Submitted":"05/21/2013 10:33 UTC","trends":["There have been 30 other sightings in Lake Havasu City","There were no other sightings in Lake Havasu City on or around May 19th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.46217,+-114.279904(47551)&iwloc=A&hl=en\"> mufon case (47551) map </A>"}