{"Object Features":"Unknown","Object Flight Path":"Stationary","Log Number":"US-05212013-0017","Country":"United States","Source":"MUFON","Region":"Georgia","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=33.344816,+-84.933993(47562)&iwloc=A&hl=en\"> mufon case (47562) map </A>","divs":["Sighting DetailsWe had gone to Franklin to pick up drinks.. On the way home we were talking ... And had looked over threw a clearing in the trees and saw 4really bright lights hovering .. We slammed on the breaks to look at it.. The we turned around to go back to park and see if we cloud tell what it was and it was gone.. We could see for several miles in every direction and it was gone. It was just barely above tree level.. So no plane or helicopterI have ever know of can fly that low with no noise. It was much to long to be a helicopter and to still for a normal plane. Then we left to come on home and right before we turned in threw another clearing I caught sight of it again but it was much much higher in the sky.. Around 6000 feet by this time. The lights on the initial sighting that werevthe two on either end were beach ball size and the two in the middle were a little larger than basket balls. It imited no sound. There were some planes in the Skye's way off in the distance... This is a regular flight path so we are quite aware of what plane light look like... This was in NO WAY the same."],"City":"Undisclosed","Sighting Duration":"Undisclosed","Tags":"City","Date of the Event":"05/21/2013 09:15 UTC","Disposition":"Unresolved","Latitude":"33.344816","trends":[],"Summary":"While traveling home from Franklin we were talking about how odd the lights of what we though was a plan looked but when we reached the hill top we saw it.. Just hovering there for about 30 sec or so. Then it was just gone like just gone","files":["/var/www/straped/mufon/html2text/47562.html.txt","/var/www/straped/mufon/org/47562.html"],"Longitude":"-84.933993","Object Shape":"Disc, Oval","Date Submitted":"05/21/2013 10:34 UTC","Weather Factors":"Unknown","Case Number":"47562"}