{"Region":"New Jersey","Log Number":"US-05222013-0001","Latitude":"40.770705","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","Summary":"Triangle shaped object lit with various covers moved slowly across sky","files":["/var/www/straped/mufon/html2text/47566.html.txt","/var/www/straped/mufon/org/47566.html"],"Date of the Event":"05/17/2013 10:05 UTC","Date Submitted":"05/22/2013 12:46 UTC","Source":"MUFON","divs":["sighting detailsi was driving on a residential road along a local golf course with three friends when i noticed a strange, big light in the sky over the golf course. it was there we noticed that object. couldn't have been more than 200-300 feet in the sky, moving slowly in a straight line south east. it was lit by a steady white\\yellow light, with a few other lights pulsating. at first glance i thought it may have been an airplane, but it was moving way to slow, there were too many lights and incorrect colors for airplanes, for example we saw blue on the object, and an airplane would not have a pulsating blue light. it kept slowly moving, and now starting to move behind trees close to us, so we continue driving along the golf course and surrounding roads to find it again. we eventually came across a parked car with a couple outside, watching it. we noticed a police officer pulled over as well and he appeared to be watching it. finally, after a few minutes, the object moved behind trees and buildings, and despite moving to different open areas and higher elevations, we could no longer see the object."],"Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=40.770705,+-74.376939(47566)&iwloc=A&hl=en\"> mufon case (47566) map </A>","Case Number":"47566","Country":"United States","Sighting Duration":"Undisclosed","Longitude":"-74.376939","Object Features":"Unknown","Tags":"City","trends":["There have been no other sightings in Florham Park","This sighting has never been favorited."],"Object Flight Path":"Hovering then path,Straight-line path","Weather Factors":"Unknown","City":"Florham Park"}