{"Case Number":"47570","Source":"MUFON","trends":["There have been 2 other sightings in Pleasantville","There were no other sightings in Pleasantville on or around May 20th 2013"],"City":"Pleasantville","Latitude":"39.40619","Date of the Event":"05/20/2013 12:00 UTC","Country":"United States","Summary":"Possible communication with beings","Disposition":"Unresolved","Viewing Distance":"N/A","Object Flight Path":"N/A","map":"<A HREF = \"http://maps.google.com/maps?q=39.40619,+-74.537126(47570)&iwloc=A&hl=en\"> mufon case (47570) map </A>","Object Shape":"Unknown","Log Number":"US-05222013-0005","files":["/var/www/straped/mufon/html2text/47570.html.txt","/var/www/straped/mufon/org/47570.html"],"Region":"New Jersey","Tags":"City","Sighting Duration":"Undisclosed","Object Features":"Unknown","Longitude":"-74.537126","Date Submitted":"05/22/2013 02:03 UTC","divs":["Sighting DetailsI've always been a skeptic of aliens and UFOs, up until two nights ago, and I feel lost and confused, that's why I am here. I would like to start off by telling you that about 3 weeks ago I saw an unidentified flying object that looked like a fireball in the sky, and since then I have felt like I am being watched. Two nights ago as I was about to go to sleep I saw something in my room through my peripheral vision. I don't remember going to sleep, but I do remember waking up in a metal room and I was lying on a metal bed and I was restrained. I struggled to turn my head and I saw many people lying in these metal beds just like mine and I focused on one in particular which I realized was my sister, it seemed that everyone was in some state of unconsciousness. At that point I realized that something was very wrong and I was conscious of the scary situation I was in. I started to panic and tried to free myself. At that point I realized that I was surrounded by short beings, they were grayish in color and seemed oblivious to the fact that I was trying to fight my way out of the restraints. Suddenly out of nowhere came a bright light and another being appeared, this one was taller and had a more oval shaped head with indentations in it and it was almost tan in color. It communicated with me telepathically and I asked it what it was doing to us and it said \"We are looking at your DNA.\" I asked it why it was doing this to us and it replied \"All humans have alien DNA, but not all humans have the same alien DNA\" I asked it where they were from and it said \"We come from Sirius\" and it also told me that they have been coming to me for a long time. At that point it disappeared and my fear returned and I started screaming from the top of my lungs, the next thing I remember is jumping up from my bed screaming waking up everyone in the house.I haven't slept for 2 nights now....."],"Weather Factors":"Unknown"}