{"Date of the Event":"05/22/2013 12:00 UTC","Object Shape":"Circle, Disc, Sphere, Teardrop, Triangle","Date Submitted":"05/22/2013 10:17 UTC","Weather Factors":"Unknown","Country":"United States","Latitude":"39.68778","Disposition":"Unresolved","Log Number":"US-05222013-0015","Object Flight Path":"Other","Sighting Duration":"00:00:40","Source":"MUFON","files":["/var/www/straped/mufon/html2text/47579.html.txt","/var/www/straped/mufon/org/47579.html"],"Summary":"3 lights formed shapes, danced in the sky","Viewing Distance":"Over One Mile","Object Features":"None","Longitude":"-105.001761","divs":["Sighting Details1. I was laying on a futon on my porch, listening to the radio and watching the night sky. 2. I was on the porch watching the sky for a total of 4 hours last night. from 10-2, I saw a LOT of stuff (more detail to follow). At 12AM, I saw what this report is about. And from 12-2, absolutely nothing happened. 3. I literally gasped when I saw the object because I knew it was something extraordinary, something very special and rare, something that I had never seen before and might never see again in my life. I got a huge adrenaline rush and I focused as hard as I could on keeping these things in view. It was instantaneous, I knew immediately that I was looking at something other-worldly. 4. I can't give a second-to-second replay of what these objects did, but in a nutshell, they did a beautiful \"dance\" in the sky. At least twice, they formed a perfectly symmetrical triangle that looked exactly like what I saw before (details below). 5. During the sighting, I was in awe. It was utterly breathtaking, a truly beautiful sight. I felt like this was a performance directed at me, that these things did a dance just for me, and they used the whole sky to do it. It was a magical moment. After the sighting, I was in disbelief. This is my second sighting in less than a month. This very closely resembled what I saw before, but was completely different at the same time. There was a moment of recognition... a moment when I thought, \"hey, I've seen that before!\" which in itself is mindblowing. On top of everyting *else* that I saw, I feel like maybe I'm meant to experience something, like maybe I am tuned into something and that maybe some kind communication, or acknowledgement of some kind could be meant for me. I felt a personal touch to what I saw - like the dance catered to my tastes, that it was performed for MY enjoyment. 6. They simply faded away into the dark, still dancing. Here's my account: Last night, I saw 3 lights travelling South to North at a very high rate of speed, at an unknown altitude but approximately 5000ft. They were bunched up like a handful of rocks -- I literally gasped when I saw it. I locked my eyes in, I sprung to my feet, and I watched intently. As it got to the other side of the sky, IT TURNED INTO THE SAME TRIANGLE I SAW ON APRIL 27th. It was a \"HOLY MOLY\" moment, for sure. I screamed for my girlfriend to come out, but she didn't hear me because the sliding glass door was shut; I had to take my eyes off for a split second. I REALLY didn't want to do that, but I DID... I got the door open, yelled for her, and then I jumped back and found the 3 objects in an almost vertical alignment, spaced what I figured was a mile or so apart.... and they were moving UP. I pointed at them and tried to get her to see it too -- she looked right at it!!!! But she didn't see it. Her eyes are bad, for one, and she'd been watching TV in a dark room when I called her so her eyes were having a hard time adjusting to the light I guess. I've been using the word \"dance\" to describe what they did because they really did dance. It was breathtaking. I've compared it to a marching band, or synchronized swimmers. It was very whimsical, and almost musical. I am having a hard time remembering the detail of each individual object -- I think they were circular or even football shaped, and I vaguely remember seeing a bright dot on at least one of them, but that could have been a star shining next to it or through it. I also remember what looked like a flashing light on one, but that also could have just been the flicker of the stars. I do know that they were 3 objects that interacted with eachother - not like aircraft, but like creatures. It's weird, but... they seemed to interact like dolphins. It was one of the most beautiful things I've ever seen in my life. It lasted 30-40 seconds or so, I think. To my dismay, they faded into the sky, still dancing. I watched for another minute or two hoping they'd come back, but they were gone. This sighting happened at 12AM; the 2 hours before the actual sighting (10-2)were VERY eventful, I could easily file two or three other reports about the *other* things I saw last night. I stayed out till about 2AM, but absolutely nothing happened between 12 and 2. :("],"Region":"Colorado","trends":["There have been 16 other sightings in Englewood","There were no other sightings in Englewood on or around May 22nd 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.68778,+-105.001761(47579)&iwloc=A&hl=en\"> mufon case (47579) map </A>","Case Number":"47579","Tags":"City","City":"Englewood"}