{"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","City":"West Brownsville","Tags":"City","Disposition":"Unresolved","Log Number":"US-05222013-0011","Case Number":"47575","Object Features":"None","Date Submitted":"05/22/2013 02:22 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.024241,+-79.890602(47575)&iwloc=A&hl=en\"> mufon case (47575) map </A>","Object Shape":"Sphere","Longitude":"-79.890602","trends":["There have been no other sightings in West Brownsville","This sighting has never been favorited."],"Source":"MUFON","Region":"Pennsylvania","Summary":"object over took two military jets made right angle turn exited at tremendous speed","divs":["Sighting DetailsI was exiting my vehicle at my house after work at 9:33 pm April 17,2013. I looked up at the night sky to observe the stars. I observed two jet flying side by side, they had to be military because they were close together. My estimation was 10 plane widths apart, traveling west and I heard no sound. The wing lights were about the width of my index finger at arms length. At the same time I noticed a bright white object overtake them from the east at a very high rate of speed. My first impression was that it was a light from a helicopter flying at a much lower altitude which would explain the difference in perceived speed. At this time no sound was heard. As the object arrived at the wake of the jet on the right it made a sudden right angle turn to the left changed color to a pink or light red and crossed the wake of the jet on the left and went south at tremendous speed. It was gone from my field of vision in less than a second, the surrounding houses and trees made it impossible for me to see it disappear over the southern horizon. At first I didn't realize what I had just witnessed, only after I played it over in my mind did I realize this object did things that weren't possible. It made that right angle turn instantly without slowing and increased in speed after the direction change. During the event I was without emotion, it as only after it was over did I have a feeling of eeriness."],"files":["/var/www/straped/mufon/html2text/47575.html.txt","/var/www/straped/mufon/org/47575.html"],"Country":"United States","Object Flight Path":"Path with directional change","Latitude":"40.024241","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"04/17/2013 09:33 UTC"}