{"Case Number":"47577","Latitude":"36.122096","Country":"United States","files":["/var/www/straped/mufon/html2text/47577.html.txt","/var/www/straped/mufon/more/47577_submitter_file1__IMGP1026.jpg","/var/www/straped/mufon/more/47577_submitter_file2__IMGP1028.jpg","/var/www/straped/mufon/org/47577.html"],"Tags":"City","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around May 11th 2013","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=36.122096,+-115.165796(47577)&iwloc=A&hl=en\"> mufon case (47577) map </A>","Source":"MUFON","Object Features":"Wings","City":"Las Vegas","Weather Factors":"Unknown","Longitude":"-115.165796","Date of the Event":"05/11/2013 12:00 UTC","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Object Shape":"Circle","Region":"Nevada","Date Submitted":"05/22/2013 04:34 UTC","divs":["Sighting DetailsAt about 1PM, I was sitting on our patio. I looked between the two palm trees and saw three white objects, in a V formation, flying north. They were flying at a very slow pace. I sat there for a moment, trying to figure out what I was seeing. Not planes, not birds, not kites. Drones? Totally silent. They continued to come in my direction, but the lead object had gone quite a ways beyond the two bringing up the rear. I called for my husband to come outside. We both stood there, trying to figure out what we were seeing. My husband thought he could see wings toward the rear of the objects. I ran back into the house and grabbed my camera, and dashed out onto the balcony to snap a picture. By then, the objects had stopped coming in our direction and seemed to be separating. Two of them continued flying in formation, and the third took off in another direction. Sadly, that is all of my story. I did get two of the objects in a photo, but as with many UFO photos, I've got mostly blue skies, with a couple of white dots."],"Disposition":"Unresolved","Summary":"3 white object in V formation seemed to glide through sky. No sound.","Log Number":"US-05222013-0013","Viewing Distance":"Unknown"}