{"divs":["Sighting DetailsTuesday, May 21, 2013 11:37 p.m. I was at home with my two little girls, I opened my front door to smoke, and I seen something moving across the sky with very bright red and white flashing lights. This object was not high enough for a plane, and there was no noise (except crickets),it moved slowly and the trees that it passed did not move at all. There was no ring of lights, or any other lights on the object as far as I could see. Then as it approached a wooden area by a neighbors house it just stopped, and hovered right above the trees. A few seconds after it stopped a bright beam of white light appeared, blinding even though I was about a football field distance from it. This spotlight effect lasted for approximately 15-20 seconds, and went off as quickly as it had came on. When the spotlight went off the red and white flashing lights reappeared, and the object remained hovering for a few seconds and then exited right back the way it came, this is when I really got spooked, because I know planes can not go backwards. I tried watching for it to pass through my line of sight but I never seen it leave. This object moved very slow, and no noise what so ever, no humming or roaring of engines, no disturbance of the trees or fields, and it went backwards after displaying a spotlight. I wanted to share my sighting for others to feel comfortable sharing theirs. Thank You,"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.27186,+-87.628012(47587)&iwloc=A&hl=en\"> mufon case (47587) map </A>","files":["/var/www/straped/mufon/html2text/47587.html.txt","/var/www/straped/mufon/org/47587.html"],"City":"Haleyville","Object Features":"Unknown","Latitude":"34.27186","Object Flight Path":"Path then hovering","Longitude":"-87.628012","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","Date of the Event":"05/21/2013 11:37 UTC","Date Submitted":"05/23/2013 02:39 UTC","Disposition":"Unresolved","trends":["There have been no other sightings in Haleyville","This sighting has never been favorited."],"Case Number":"47587","Viewing Distance":"101-500 Feet","Summary":"11:37 p.m, opened front door to smoke, I saw a few bright red and white lights moving slowly by a neighbors house, just watched it then it stopped,& hovered right above the trees, a bright almost spotlight appeared, 15- 20 seconds, went backwards,vanished","Tags":"City","Country":"United States","Object Shape":"Unknown","Log Number":"US-05232013-0004","Region":"Alabama"}