{"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Other","Country":"Philippines","Disposition":"Unresolved","Tags":"City","divs":["Sighting DetailsI looked out the window past 9pm when I saw this intensely bright white light hovering above (not directly above) an old factory. I thought it was a plane at first but it was too big to be one. MOVEMENT & APPEARANCE: It suddenly moved as if confused, like it was bouncing around (like a happy (or crazy wild) bunny) in a small-v pattern! (THIS WAS WHEN I LUNGED AT MY CAMERA :D) As it \"bounced\" and turned around in place, I found it had red and blue smaller lights on it as well, although white was the surface color. After about a minute it swooped down lightning quick in a slant direction and started spinning fast while moving around a tilted elliptical path. That's also when it appeared to have shape-shifted. It's kind of hard to describe the new shape. It was like an oval this time with maybe 4 or 5 dark, wide vertical louvres shaped like eyelets that apparently stayed on the same side, from my point of view, while revolving. It was spinning quickly but it was going around a bit slower. It just went round and round for like 10 or more times. I have no idea how it disappeared as the huge factory beside our house was covering the sight. I also wasn't able to see the full laps because of the obstruction, but im pretty sure of it's path as it reappeared from behind the factory every now and then. DOES THIS ALL MAKE SENSE?!? haha The event lasted for about 3-5 minutes. I don't know how far it was from me or how high above the ground it was. Unfortunately, I was too stoked to remember where my video cam was and I was afraid i'd miss the thing if i looked for it. I would've wanted to see more tho :) it was quite an experience. But never seeing anything like it before, i'm still skeptical."],"Longitude":"121.039867","Case Number":"47589","Region":"Metro Manila","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","City":"Mandaluyong City","files":["/var/www/straped/mufon/html2text/47589.html.txt","/var/www/straped/mufon/org/47589.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=14.587704,+121.039867(47589)&iwloc=A&hl=en\"> mufon case (47589) map </A>","Object Shape":"Oval, Sphere, Triangle","Date of the Event":"05/22/2013 09:15 UTC","Source":"MUFON","Object Features":"Patterned Surface, Louvres","trends":["There has been one other sighting in Mandaluyong City","There were no other sightings in Mandaluyong City on or around May 22nd 2013"],"Latitude":"14.587704","Date Submitted":"05/23/2013 05:33 UTC","Log Number":"PH-05232013-0006","Summary":"???UFO??? over Manila 5-22-13"}