{"Log Number":"US-05232013-0002","Date Submitted":"05/23/2013 12:22 UTC","trends":["There have been 3 other sightings in Paradise","There were no other sightings in Paradise on or around July 14th 2009"],"Source":"MUFON","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/47584.html.txt","/var/www/straped/mufon/org/47584.html"],"City":"Paradise","divs":["sighting detailsi was videoing a fire and watching the fire planes flying around it was the whisky flats fire 7\\14\\2009 at 3:11pm. i was in old magala up skyway road looking over the valley through a space in the trees and had a great view to see the fire. i did not see it until i was looking at my videos that i took and was deleting video off my phone to make room on my micsd card and that is when i found it on the video. i was so focus on the fire and planes that i did not see it, it was just to fast. it was travelling left to right with a slightly down word slope and the came back from right to left heading back up the valley. you lose sight of it as it pass is the trees. i would have to say it had to be going mock 3 or so. i used to live near an air base so i've seen lots of air craft flying over head and at high speeds. this thing was moving so fast it made the planes look like they where standing still and made no noise at all. i came so close to deleting it off my phone. i would like to say that years before i saw an sr 71 and a f18 fly down the same route at night with a full moon in the back ground boy i wish i had a pic of that it was so cool. i think that it is the south fork of the feather river canyon don't hold me to that."],"Longitude":"-121.620458","Case Number":"47584","Date of the Event":"07/14/2009 03:11 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.766816,+-121.620458(47584)&iwloc=A&hl=en\"> mufon case (47584) map </A>","Weather Factors":"Unknown","Object Features":"None","Summary":"like a flat top 3 steps down small to large and changed shape, got it on cell video.","Region":"California","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Disc, Unknown","Tags":"City","Latitude":"39.766816","Object Flight Path":"Straight-line path,Path with directional change"}