{"Date Submitted":"05/08/2006 02:00 UTC","Tags":"City","trends":["There have been 4 other sightings in Montpelier","There were no other sightings in Montpelier on or around May 8th 2006","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","Weather Factors":"Unknown","Object Shape":"Sphere","Date of the Event":"05/08/2006 02:00 UTC","Object Flight Path":"Unknown","Log Number":"US-05092006-0003","Disposition":"IFO","Source":"MUFON","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was sitting out side my house and taking pictures of my gardens which I do each year to see the progress. I was relaxing when I looked up. I always look up. For birds or whatever. I saw the moon over my roof top. It wasn't as bright as I might have wanted it and all that interesting but I took the shot. I came in a few minutes later after more shots of various emerging flowers. I called my wife and told her that I was about to put the pictures into my computer to look at. I did after we hung up. I lloked at the pic of the moon and saw the white dot. I blew it up and that is what you see. The next day I did it again to proof somethiung to myself and my wife. I took a bunch of photos of the sky and gardens. I saw a bird (hawk) up in the sky and snapped the shot of it. Thinking that I might be able to identify it later after blowing it up. I came in and voila! I'd like to say that his the first encounter but it isn't. It was a visual sighting. two of three or more. At night. All around february, spanning three years. Anyway I'm very surprized by these pictures. Who knows? I certainly don't. But they are a fact! Or I just seeing things? The other sightings..I reported them earlier."],"Region":"Vermont","Summary":"It's in the pictures that I took. I didn't see them when I took them.","City":"Montpelier","Latitude":"44.260059","map":"<A HREF = \"http://maps.google.com/maps?q=44.260059,+-72.575387(4758)&iwloc=A&hl=en\"> mufon case (4758) map </A>","Country":"United States","Case Number":"4758","files":["/var/www/straped/mufon/html2text/4758.html.txt","/var/www/straped/mufon/more/4758_submitter_file1__hmm.JPG","/var/www/straped/mufon/more/4758_submitter_file2__hmm2.JPG","/var/www/straped/mufon/org/4758.html"],"Object Features":"Undisclosed","Longitude":"-72.575387"}