{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.740427,+-104.976248(47581)&iwloc=A&hl=en\"> mufon case (47581) map </A>","Tags":"City","Summary":"Dancing Spaceship Troupe","Longitude":"-104.976248","City":"Denver","Weather Factors":"Unknown","Sighting Duration":"00:05:00","Latitude":"39.740427","files":["/var/www/straped/mufon/html2text/47581.html.txt","/var/www/straped/mufon/org/47581.html"],"Disposition":"Unresolved","Log Number":"US-05222013-0017","divs":["Sighting DetailsWhile sitting on my balcony, I heard the sound of a prop airplane. As I looked I saw a twin engine flying from NW to SE, looking past the craft I noticed, at first, was a flock of birds. Shortly after the airplane passed between myself and this flock of birds. I thought that was a really high altitude for a flock of birds, given that the aircraft was flying at around 1000-1500ft. The aircraft kept it's heading, the flock of birds was a circular formation above, and a pair hovering just underneath, slightly to the south of the larger formation. As I watched them, considering the height they were at, they moved about each other in precise slow orbits. They moved in curving seemingly random motions, but always the low, southern pair seemed to stay stationary. The best way to describe the motion of these objects would a coordinated airshow dance routine in the sky. As the birds turned, I noticed the reflections of sharp sunlight, contrasted by darker tones of something solid. Given my estimated altitude of these, what I now considered to be objects and not birds, around 5000-7000ft, the rate at which they climbed without effort, the tight patterns in which they moved, and the relative distance they were from me. This was all observed from a west facing balcony, looking west towards south Denver from Aurora. The event lasted 3-5 minutes, at which point, from staring into the sky for so long and focusing so hard, my eyes began to water and I was seeing spots. Clearing my now blurry vision, I looked back for them and there was nothing. I was deliberating and observing behavior too much to have remembered to grab my camera, which could obviously capture the objects at a much closer relative distance."],"Date of the Event":"05/21/2013 09:45 UTC","Object Shape":"Boomerang, Disc, Oval","Region":"Colorado","Viewing Distance":"501 Feet - 1 Mile","Case Number":"47581","Object Flight Path":"Stationary","Object Features":"Unknown","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around May 21st 2013"],"Date Submitted":"05/22/2013 10:47 UTC","Country":"United States"}