{"Disposition":"Unresolved","Tags":"City","trends":["There have been 7 other sightings in Jersey City","There were no other sightings in Jersey City on or around August 15th 2010"],"divs":["Sighting Details1. I was watching my brother play video games when I went to the window to check the backyard . 2. I was looking over at a building across the street from me. 3. I though it was apart of the buildings roof because of the color and size 4. It was just hovering in mid-air silent It was very still no air-craft can stay in one spot like this object was doing. 5.i called my brother over to look cause he did not believe me, when he came I pointed to him he was in shock so was i. We both were glued to the object we started talking to see what it was, I felt weird in my body like I was being watched I felt cold I analyzed the object I saw a great amount of detail on the object, I seen a cockpit I kept staring at it until I seen a figure in it. 6. Once I saw the figure it was grey or white color it had a big head and I could see it eyes they were big my brother seen it too, once I saw it the object just vanished In front of our eyes and I was scared because I could not understand what happened. My brother was sweating and nervous we were so scared we stood away from the yard and did not look out that window for a long time. Also after this event my brother seen a dark figure jump onto a roof across the street I seen it as well."],"Object Flight Path":"Stationary,Other","files":["/var/www/straped/mufon/html2text/47598.html.txt","/var/www/straped/mufon/org/47598.html"],"Date Submitted":"05/23/2013 04:41 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.739949,+-74.053077(47598)&iwloc=A&hl=en\"> mufon case (47598) map </A>","Date of the Event":"08/15/2010 01:00 UTC","City":"Jersey City","Source":"MUFON","Object Shape":"Diamond, Triangle, Unknown","Summary":"Copper color triangle shaped like a arrow point silent","Case Number":"47598","Sighting Duration":"00:10:00","Object Features":"Dome, Window(s)","Country":"United States","Region":"New Jersey","Log Number":"US-05232013-0014","Viewing Distance":"21-100 Feet","Longitude":"-74.053077","Latitude":"40.739949","Weather Factors":"Unknown"}