{"map":"<A HREF = \"http://maps.google.com/maps?q=40.088274,+-82.803516(47590)&iwloc=A&hl=en\"> mufon case (47590) map </A>","Date Submitted":"05/23/2013 08:23 UTC","Disposition":"Unresolved","City":"New Albany","Case Number":"47590","Sighting Duration":"Undisclosed","Log Number":"US-05232013-0007","trends":["There have been 11 other sightings in New Albany","There were no other sightings in New Albany on or around May 19th 2013"],"Region":"Ohio","Longitude":"-82.803516","Source":"MUFON","Country":"United States","Tags":"City","Date of the Event":"05/19/2013 10:00 UTC","Object Features":"Unknown","Summary":"10 objects flew East to West, then swift vertical ascent until no longer visable.","Viewing Distance":"Unknown","divs":["sighting detailsi was walking my dog on a dark street, sunday evening may 19, 2013 near columbus, oh. a bright orange\\yellow object caught my eye, in the sky to the east. i like watching planes so i kept looking at it. in next 30 seconds 5more orange\\yellow objects appeared, moving in the same direction, east to west, as the first object. the last 2objects were side by side instead of in a straight line. they all seemed to be pretty evenly spaced. i watched as they moved through the sky and i tried very hard to hear anything, something that would tell me that these were planes, but i heard nothing. they seemed pretty low in the sky as well as the appearance was larger than most planes i see fly overhead. in another 30 seconds my gaze had followed the six objects west, i looked east again and saw 4more objects, same size, same color, same flight pattern as the first 6, moving across the sky. i was completely fascinated and then quickly thought, pictures, i need pictures. i snapped a few high def pictures with my iphone. i was only able to capture 5 of the first group of 6 and then the final group of 4 and a short video. after i stopped the video i looked to the first group again and saw the lights ascend, swiftly, and then completely dissappear. i shifted to the last 4 and watched them more closely and they did the same thing. while i was taking pictures and especially during the video i became self conscious about any light i was shining on myself and briefly thought, \"i should get inside\". i did go inside and have been reluctant to say anything because i'm pretty sure people will think i'm a little crazy but i know what i saw and what i didn't hear."],"Object Shape":"Disc","Latitude":"40.088274","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/47590.html.txt","/var/www/straped/mufon/org/47590.html"],"Weather Factors":"Unknown"}