{"Latitude":"39.828345","Longitude":"-104.926382","Object Flight Path":"Straight-line path","Object Shape":"Diamond, Sphere","Tags":"City","Source":"MUFON","divs":["Sighting DetailsStanding on my back stoop smoking I was daydreaming and looking at the clear blue sky, I was thinking how great it was to have such a clear sky as it has been raining the last few evenings here in Colorado. I first noticed a \"something\" Thinking it was just crap in my eye I wiped my eye and stood transfixed as six shapes moved across the sky above my house. I did mental flips trying to explain what I was seeing. Not birds as they were, well just wrong and not eye crap as they were doing precision movements and didnt go away. I must say that it was very off-putting. They flew in a altering 5-1, 4-2 military like pattern but the speed at witch they switched it up was insane. I ran to get my camera but when I came back they where gone. Further note air traffic has been extreamly odd today. Just for consideration. Also there was a group of people in the vacant lot next to my house that seemed very startled but didnt say anything, when we made eye contact it would seem they were aware of what I was but we didnt exchange words, I was to frightened to say anything at the time."],"Date of the Event":"05/23/2013 06:18 UTC","Region":"Colorado","Summary":"squad of flyers in low orbit over Denver Colorado","Disposition":"Unresolved","Sighting Duration":"00:02:11","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Date Submitted":"05/23/2013 11:44 UTC","Case Number":"47604","trends":["There have been 4 other sightings in Commerce City","There were no other sightings in Commerce City on or around May 23rd 2013"],"Object Features":"None","files":["/var/www/straped/mufon/html2text/47604.html.txt","/var/www/straped/mufon/org/47604.html"],"City":"Commerce City","Log Number":"US-05232013-0020","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.828345,+-104.926382(47604)&iwloc=A&hl=en\"> mufon case (47604) map </A>"}