{"Object Shape":"Triangle","Sighting Duration":"Undisclosed","Date Submitted":"05/23/2013 11:46 UTC","Weather Factors":"Unknown","Latitude":"38.999016","Date of the Event":"05/22/2013 11:23 UTC","Disposition":"Unresolved","Log Number":"US-05232013-0021","divs":["Sighting DetailsI had stepped out back to put my dog on the chain so he could do his business. I look up and out of no where these orange lights appeared in a triangle formation, with perfect space between each light. When I seen it I froze, thinking of what all it could be, it couldn't have been an airplane because they don't fly that low, and there isn't an air port around here. If it was a Helicopter then I would've been able to hear It and there would have been flashing lights. It hovered there for about 10-20 seconds before moving east in still a perfect Shape. so I followed it and about 2 minutes passed before it just vanished in the blink of an eye. it was like nothing I have ever seen in my life, I was just frozen and I remember the first thing I thought was \"get a camera and get evidence and footage. and just then my back porch light started flickering and went dead, but it was a brand new light that I had just put in about an Hour before. My dog was going insane and was barking and yelping like I've never heard before. I waited for it for about another 30 minutes for it to re appear but never did. it was as silent as ever."],"Tags":"City","Case Number":"47605","map":"<A HREF = \"http://maps.google.com/maps?q=38.999016,+-92.314258(47605)&iwloc=A&hl=en\"> mufon case (47605) map </A>","Summary":"3 orange lights in perfect triangle formation","Longitude":"-92.314258","Source":"MUFON","Object Features":"None","City":"Columbia","files":["/var/www/straped/mufon/html2text/47605.html.txt","/var/www/straped/mufon/org/47605.html"],"Country":"United States","Region":"Missouri","Object Flight Path":"Hovering then path","Viewing Distance":"101-500 Feet","trends":["There have been 38 other sightings in Columbia","There were no other sightings in Columbia on or around May 22nd 2013"]}