{"Viewing Distance":"Unknown","divs":["Sighting DetailsOn January 4, 2006, I glanced at English Mountain and noticed a very large oval disc-like silvery-white object. It was darker around the bottom edges. Immediately it looked strange since you could tell it wasn't a cloud because of its perfect oval disc-like shape. From the couple of minutes I was able to observe it, there seemed to be some distince geometrical patterns associated with it such as squares running from the far edges reaching up to the top of the object. Something similar to the latitude and longitude lines you'd see on a map. The object wasn't moving at first and then after two minutes or so, it began reising upward very slow and suddenly shot straight up and out of sight as if it winked out, simply disappearing. When it shot straight up it punched through a thin layer of cloud cover leaving a hole in the clouds exactly the same shape as the object itself. Smoke trailed the object as it broke through the clouds. I would estimate that the object was 1 to 2 miles away and higher than English Mountain which is 3600 feet high. That would make the object very large in diameter. I got my camera and took photos within the first 3 to 5 minutes after the hole was made. The photos are still on my digital camera and have not been erased."],"Log Number":"US-05092006-0005","Tags":"City","trends":["There have been no other sightings in Chestnut Hill","This sighting has never been favorited."],"Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","Source":"MUFON","files":["/var/www/straped/mufon/html2text/4760.html.txt","/var/www/straped/mufon/org/4760.html"],"Latitude":"35.93","Date Submitted":"01/04/2006 08:18 UTC","Longitude":"-83.34028","Date of the Event":"01/04/2006 08:18 UTC","Region":"Tennessee","Case Number":"4760","Weather Factors":"Unknown","Country":"United States","Object Shape":"Oval","map":"<A HREF = \"http://maps.google.com/maps?q=35.93,+-83.34028(4760)&iwloc=A&hl=en\"> mufon case (4760) map </A>","City":"Chestnut Hill","Summary":"I saw a large silvery-white disc-shaped object in the sky."}