{"Country":"United States","Weather Factors":"Unknown","trends":["There have been no other sightings in Matamoras","This sighting has never been favorited."],"Disposition":"Unresolved","Summary":"2 glowing orbs traveled down my street then up and over the delaware river before disappearing","Object Shape":"Sphere","Case Number":"47602","Longitude":"-74.70041","Sighting Duration":"Undisclosed","divs":["Sighting DetailsAt about 1020pm I was lying in bed when I saw glowing oragne-red lights outside my bedroom window. I looked out and saw 2 large glowing red-orange orbs floating outside my house approximately roof level. i have seen these several times before, usually between 930 and 11pm, on and off since November 2012. The glowing orbs traveled down my street heading toward the river, floating, gradually rising and falling. I called my neighbor on the phone so he could witness it as well. The lights started moving away faster, and getting higher while I was on the phone. They went out over the Deleware River (approximately 2 blocks away) and drifted higher before completely disappearing from sight. Ive considered these objects alot as I have seen them several times. Them somewhat resemble the lighted lanterns from \"Tangled\" only much larger, and they do not move like lanters, since they synchronise with each other when there are more than one. There also seems to be a light tail or multiple tails. Sort of like a jellyfish. The objects no longer freak me out, although they are getting distressingly closer to my house. This was right outside my window. I would really like a logical explanation to them."],"Source":"MUFON","Latitude":"41.366446","Date Submitted":"05/23/2013 09:37 UTC","Object Flight Path":"Hovering then path","Log Number":"US-05232013-0018","Viewing Distance":"21-100 Feet","files":["/var/www/straped/mufon/html2text/47602.html.txt","/var/www/straped/mufon/org/47602.html"],"Object Features":"None","Tags":"City","Region":"Pennsylvania","map":"<A HREF = \"http://maps.google.com/maps?q=41.366446,+-74.70041(47602)&iwloc=A&hl=en\"> mufon case (47602) map </A>","Date of the Event":"05/22/2013 10:20 UTC","City":"Matamoras"}