{"Summary":"Craft with multicolored lights that hovers, changes direction quickly and has pulsating lights in a random pattern","map":"<A HREF = \"http://maps.google.com/maps?q=33.705273,+-111.973233(47607)&iwloc=A&hl=en\"> mufon case (47607) map </A>","Object Features":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path","divs":["Sighting DetailsWe have seen this object before but tonight observed it at approximately 10:00pm. The object was above the tree line and was pulsating and hovered, but then would change direction N, S, W, E. Sometimes it would change direction slowly, other times rapidly. I am not sure what the object was. I tried to take pictures and video but did not due it justice. I observed the object pulsate, change colors (white, blue, red, green), hover and move in different directions for almost 45 minutes. It made random movements directly North of where I was standing, then headed West of where it was in the sky and then began to hover again and move in random patterns. Near the end of my observation, it moved back toward the East but not quite to the spot where I first saw it and then began to descend below the tree line and I then lost sight of it. It glowed, pulsated, and changed colors randomly. Sometimes it would pulsate quickly, other times it would turn white and get very bright (not pulsate), then would fade and return to a random color pattern."],"Case Number":"47607","trends":["There have been 5 other sightings in Cave Creek","There were no other sightings in Cave Creek on or around May 23rd 2013","This sighting has never been favorited.",""],"Region":"Arizona","Weather Factors":"Unknown","Source":"MUFON","Viewing Distance":"Over One Mile","City":"Cave Creek","Longitude":"-111.973233","Date of the Event":"05/23/2013 10:00 UTC","Object Shape":"Circle, Flash, Oval, Sphere","Log Number":"US-05242013-0002","Tags":"City","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/47607.html.txt","/var/www/straped/mufon/more/47607_submitter_file1__ufo1.JPG","/var/www/straped/mufon/org/47607.html"],"Date Submitted":"05/24/2013 02:05 UTC","Latitude":"33.705273","Country":"United States"}