{"Region":"Texas","Country":"United States","Tags":"City","City":"Ingleside on the Bay","Object Flight Path":"Straight-line path","Viewing Distance":"21-100 Feet, 101-500 Feet","Object Features":"None","Date Submitted":"05/24/2013 03:33 UTC","Source":"MUFON","Summary":"Coming home at 4:00 am I saw what looked like a shooting star flash at tree level in front of my car.","Date of the Event":"04/30/2013 03:59 UTC","Latitude":"27.829352","trends":["There have been no other sightings in Ingleside on the Bay","This sighting has been favorited 1 time."],"Case Number":"47614","Object Shape":"Fireball, Star-like","files":["/var/www/straped/mufon/html2text/47614.html.txt","/var/www/straped/mufon/org/47614.html"],"Longitude":"-97.224114","map":"<A HREF = \"http://maps.google.com/maps?q=27.829352,+-97.224114(47614)&iwloc=A&hl=en\"> mufon case (47614) map </A>","divs":["Sighting DetailsI was coming home from my mother's house in the wee hours of the morning on or around April 30, 2013. I'd just turned down my street and was a few blocks away from my house when what appeared to be a shooting star or fireball just suddenly blazed up in front of me, a few hundred feet ahead; it went right over the road in front of me, moving from left to right as it appeared to begin to disintegrate over the tops of the trees, after which the trees blocked my view of it. The trees here are oak and are not particularly tall, so this thing was flying pretty low. I assumed it must have been a very low flying meteorite or something, but the more I look into that sort of thing, the less that seems plausible. It happened at exactly 3:59 am by my car's clock, and it stunned me so much that I hit the brakes and stopped in the middle of the road. I looked around to see if it was possible that someone had shot a flare or something, but nobody in the neighborhood was awake. I never saw it entirely disintegrate; it just looked like a shooting star had just shot passed me at close range and went over the trees. I even braced for an impact as my mind calculated when it might hit. There is a body of water nearby and it occurred to me that if it had landed, perhaps it landed in there. I don't know what it was. I don't believe in aliens, but it was definitely unidentified and it was definitely flying through the air. I figure it must be debris or something, but nobody can explain it or why it was shooting sideways instead of either going straight up or down. Anyway, I figured I'd add my account to the list of weird sightings. Thanks for the chance."],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Log Number":"US-05242013-0009","Disposition":"Unresolved"}