{"City":"Geelong","divs":["Sighting Detailsi know this makes the story sound like a lie but i was drunk and i had smoked a joint but i had and still have not ever suffered an occurence of hellucination. It was a friends 18th birthday so we camped the night at my other friends farm located in winchelsea about 100kms from melbourne Australia. it has been 11 years but i cannot forget what i and my 5 other friends saw i dont know if its a military project or not but here goes. it was approx 4am would have been a sunday morning we were sitting around a fire when i noticed what i first thought was a satellite, after about 5 seconds of veiwing said object moving i pointed it out to my friends which at that point stopped moving and began backtracking over its original flight path for another 5 seconds then stopped dead in its tracks, which freaked me out and got me excited also. Said object then proceeded to basically fly in triangular patterns stop go back and repeat. Looked at it through a rifle scope it did seem to have a roundish mettalic surface but cannot be too sure as it was mainly the light visible. after about 30 minutes of watching an awesome display of flight manouvers it seemed to have ejected a smaller object which gloewed just as bright as the first object only the smaller object was orbiting the larger object and when the large object would suddenly fly away the smaller object would catch up and continue its orbit. The object was veiwed for at least an hour and i only lost sight of it when i fell asleep. Reasons i think it was military are because it was as if someone was training in its flight because im gathering if it was ETs they would have known we were there i dont know all i know is i know what i saw. I also had another sighting about a year later, and currently i have a photo of a shpere thats mettalic in shape captured in broad daylight i would love to email it to you because its pretty incredible. Please do get back to me i dont really know who else to ask im from Australia MUFON and your the only organisation i could think of.The photo im attaching to this was taken on an iphone april 5th 2013 i was on the back of the truck my friends dad was in when he took 2 photos of a sign with his sisters name on it. The photos were taken in rapid succession. PLEASE ANALYSE Thank You for your time Guy Caudullo"],"Object Features":"Unknown","Source":"MUFON","Summary":"satelite??","Log Number":"AU-05242013-0007","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/47612.html.txt","/var/www/straped/mufon/org/47612.html"],"Viewing Distance":"Unknown","Object Shape":"Unknown","Date of the Event":"04/18/2002 12:00 UTC","Disposition":"Unresolved","Country":"Australia","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=-38.147114,+144.370548(47612)&iwloc=A&hl=en\"> mufon case (47612) map </A>","Object Flight Path":"Path with directional change","Case Number":"47612","Date Submitted":"05/24/2013 10:19 UTC","Region":"Victoria","Longitude":"144.370548","Weather Factors":"Unknown","trends":["There have been 3 other sightings in Geelong","There was one other sighting in Geelong on or around April 18th 2002"],"Latitude":"-38.147114"}