{"trends":["There have been 3 other sightings in Beach Park","There was one other sighting in Beach Park on or around May 25th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.43314,+-87.88682(47618)&iwloc=A&hl=en\"> mufon case (47618) map </A>","City":"Beach Park","Country":"United States","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Longitude":"-87.88682","Disposition":"Unresolved","Case Number":"47618","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/47618.html.txt","/var/www/straped/mufon/org/47618.html"],"Weather Factors":"Unknown","Latitude":"42.43314","Object Features":"None","Log Number":"US-05252013-0001","divs":["Sighting DetailsWhile visting my family's house a light caught my eye as I was on the phone with my girl friend. The object was moving then started to hover and then drifted back over. it stared to change colors dip down fly up and all over. At this point knew I was seeing somthing extra ordinary and started shouting for every one to go look outside. once we were outside we witnessed the object change color dip down fly up and all around. It was amazing and flew in such a fluid way ive never seen anything like it. it definitely seemed to have an interest in a certan little area,as it would keep dipping down, that seemed to be a common theme. at one point I ran inside to grab a flash light and then started to shine the light at it in a morris code fashion and right away i took notice and flew towards us almost like a curious bee. At this point my heart was pounding a bit because I did not know what was going to happen, but this was awesome. After a while it lost interest and went back to bumbling around over its lil area. a while later a family member conviced me to go chase it in a car.....with little luck. So all in all this thing was changing color at some points and at otheres it would be three or four spheres of color. it was hovering, going up, down,dipping,fast,slow it was very amazing to watch fly it just seemed to fly perfectly and flawless. And I deffinetly had the impression it was up to somthing as it mostly stayed in a defined area and would constently decened. The film was shot on a canon powershot a720."],"Object Shape":"Circle, Disc, Sphere, Unknown","Date of the Event":"05/25/2013 10:15 UTC","Date Submitted":"05/25/2013 01:58 UTC","Summary":"UFO sighted","Source":"MUFON","Region":"Illinois"}