{"Object Features":"None, Unknown","Region":"Florida","Viewing Distance":"Unknown","Date Submitted":"05/25/2013 08:02 UTC","Log Number":"US-05252013-0002","trends":["There has been one other sighting in Lake Buena Vista","There were no other sightings in Lake Buena Vista on or around May 24th 2013"],"Weather Factors":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/47619.html.txt","/var/www/straped/mufon/org/47619.html"],"Latitude":"28.375307","Summary":"Same as what was seen in Miramar, FL","Source":"MUFON","Disposition":"Unresolved","Object Shape":"Other","City":"Lake Buena Vista","Date of the Event":"05/24/2013 08:31 UTC","Country":"United States","divs":["sighting detailsi was taking pictures at epcot with my 10x optical zoom lens on my ipad 4, when i noticed this ridiculously bright white cloud up in the sky. it looked like the mist version of a cheap cfl bulb, or a tube fluorescent light. it dissipated like cotton candy, and *not* like a normal cloud. we watched it just...hang. what got my attention was the fact this \"cloud\" went behind some thunderhead clouds... that would make this thing a) really far away, and b) insanely huge. the pictures i have just do not do it justice. while i was taking the pics, and my g\\f and i were going \"wow! that's a bright cloud!\", someone else came up and asked me if i saw the blinking lights and showers of blobs coming out of it. i admit, i hadn't... but one of the pics i later monkeyed with (i still have the original as taken.) shows some odd artifacting around the object. its not consistent with what's in the rest of the pic. dark lines, small circles under the cloud, etc. i do not have the full ability to bring out the pic's qualities. now, before this event, we were on the opposite side of epcot, and had heard a loud \"thunder\" like noise. neither me or my g\\f saw lightening, or heard anything else thunder like. where we were was directly across from where i had taken the pic. i am guessing about 8 when we heard the boom. i looked, and someone reported this in miramar, fl around 8 pm on this site. miramar is like 200+ miles from us."],"Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Case Number":"47619","Longitude":"-81.549655","map":"<A HREF = \"http://maps.google.com/maps?q=28.375307,+-81.549655(47619)&iwloc=A&hl=en\"> mufon case (47619) map </A>"}