{"divs":["Sighting DetailsWe were returning from emptying trash at a campsite in the Shenandoah River State Park, VA around 11:30 PM, when we observed a stationary red-orange object glowing about 1-2 miles away under the current cloud cover, We recognized that the object was very unusual based on observing typical night time objects such as aircraft, balloons, flares, stars, planets, meteors, etc. As an amateur astronomer for over 40 years, I have never observed anything like this before. My brother, son, and I observer a stationary red-orange object that was stationary and glowing. We observed the object for about 10 seconds and then it faded out rather quickly. The object reappeared about 5 seconds later about a thousand feet above its previous position. The object glowed with the same color and intensity as before and then faded out about 5 seconds later. The object never reappeared. At the time of the observation there were no aircraft in the vicinity and the clout deck was about 5 thousand feet. The abject did not give off any sound nor did it move in a lateral direction. This siting occurred at the Shenandoah River State Park at an estimated elevation of 1100 feet."],"files":["/var/www/straped/mufon/html2text/47621.html.txt","/var/www/straped/mufon/org/47621.html"],"Country":"United States","trends":["There have been 7 other sightings in Front Royal","There were no other sightings in Front Royal on or around May 23rd 2013"],"Date Submitted":"05/25/2013 01:12 UTC","Summary":"Redish-orange sphere stationary for about 10 seconds","Disposition":"Unresolved","Sighting Duration":"00:00:30","Weather Factors":"Unknown","Case Number":"47621","Latitude":"38.919217","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Hovering then path","Region":"Virginia","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=38.919217,+-78.186685(47621)&iwloc=A&hl=en\"> mufon case (47621) map </A>","Source":"MUFON","Object Shape":"Sphere","Log Number":"US-05252013-0004","Date of the Event":"05/23/2013 11:35 UTC","Longitude":"-78.186685","Tags":"City","City":"Front Royal"}