{"Object Features":"Patterned Surface","divs":["Sighting DetailsI've witnessed three separate UFO incidents earlier in my life which led me to finally purchasing night vision gear and the means to capture the event should something occur. I've captured activity every night I've gone out and have recorded everything. I have hours of material, some of which is posted to my youtube account, spendiddragon1 I usually stop my recordings after 60-90 minutes each session as that's pretty much the laptop's battery life. Most objects are disks and orbs, and with night vision there is no discerning any particular color charatceristics other than the IR spectrum in which I record it (either B&W or NV green). My last two videos, UFOS ON A DARK AND STORMY NIGHT, and HOW TO DECLOAK UFOS are probably the most telling of the group. A short excerpt of the DARK AND STORMY video recently aired on UFO Planet. Keep up the great work and thanks for all you do! Nick"],"Date Submitted":"05/25/2013 04:09 UTC","City":"Richmond","Latitude":"37.549625","files":["/var/www/straped/mufon/html2text/47624.html.txt","/var/www/straped/mufon/org/47624.html"],"Log Number":"US-05252013-0007","Tags":"City","Sighting Duration":"Undisclosed","Country":"United States","Longitude":"-77.428218","Source":"MUFON","trends":["There have been 39 other sightings in Richmond","There were no other sightings in Richmond on or around May 18th 2013"],"Object Shape":"Circle, Cylinder, Disc, Sphere, Other, Unknown","Date of the Event":"05/18/2013 12:00 UTC","Summary":"Nightly activity captured with night vision IR; go to youtube for splendiddragon1","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Disposition":"Unresolved","Region":"Virginia","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=37.549625,+-77.428218(47624)&iwloc=A&hl=en\"> mufon case (47624) map </A>","Case Number":"47624","Weather Factors":"Unknown"}