{"Source":"MUFON","Sighting Duration":"Undisclosed","City":"Powhatan","Object Flight Path":"Path with directional change","Disposition":"Unresolved","Case Number":"47620","Date Submitted":"05/25/2013 10:04 UTC","Region":"Virginia","divs":["Sighting DetailsOn March 1, 2013, around midnight, I was preparing for bed, locking doors. When I went to my back patio door, I saw this bright orange-yellow glowing fireball surrounded by a bright red ring coming towards me in the sky from the west. It was about the size of a full moon and seemed to be as high as helicopters fly over my yard, but definitely not as high as commercial airlines. It went directly over my house. I ran to the front door and went out to the front yard. It then changed direction and began moving southeast. I watched it until I could no longer see it, but it appeared to be continuously moving southeast but slightly changed directions several times. It was beautiful and stunning to see! It made no sound and had no trail of smoke or lights, and maintained a steady elevation. I live in a somewhat rural area about 30 miles west of Richmond, Virginia, in Powhatan County. I felt amazed, awestruck and a little scared as to what this thing was; and ever since, I can't stop watching the sky, wondering if I will ever see it again. I hope so! There was no time to run get a camera or I would have missed seeing it."],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/47620.html.txt","/var/www/straped/mufon/org/47620.html"],"Viewing Distance":"101-500 Feet","Latitude":"37.551018","map":"<A HREF = \"http://maps.google.com/maps?q=37.551018,+-77.82408(47620)&iwloc=A&hl=en\"> mufon case (47620) map </A>","Longitude":"-77.82408","Object Shape":"Fireball","trends":["There have been no other sightings in Powhatan","This sighting has never been favorited."],"Object Features":"Unknown","Date of the Event":"03/01/2013 12:00 UTC","Country":"United States","Log Number":"US-05252013-0003","Summary":"yellow-orange glowing fireball surrounded by red ring went over my house, then changed direction to SE; no sound or trail;","Tags":"City"}