{"files":["/var/www/straped/mufon/html2text/47627.html.txt","/var/www/straped/mufon/org/47627.html"],"Object Shape":"Cross, Diamond","Summary":"four lighs diamond pattern, 1-3 miles apart, following USAF rocket launch","map":"<A HREF = \"http://maps.google.com/maps?q=27.781946,+-82.63483(47627)&iwloc=A&hl=en\"> mufon case (47627) map </A>","Date of the Event":"05/24/2013 08:27 UTC","Latitude":"27.781946","Longitude":"-82.63483","Disposition":"Unresolved","Object Features":"Unknown","Source":"MUFON","Case Number":"47627","Log Number":"US-05252013-0010","Viewing Distance":"Over 1 Mile, Unknown","Sighting Duration":"Undisclosed","Country":"United States","Weather Factors":"Unknown","Date Submitted":"05/25/2013 05:01 UTC","divs":["Sighting DetailsFrom St. Petersburg, we were watching the May 24, 2013, USAF satcom rocket launch. The rocket was clearly visable with no visual aid for approx. two minutes. However, we used binoculars and initially spotted the four lights, pulsating, hovering, and keeping a distance relationship (after spotting with the binoculars, we could barely make the lights with the naked eye). Best guess is that the lights were over or to the east of Orlando (but appeared miles from the rocket) and that based on the relationship to the rocket, the lights were spaced 1 - 3 miles apart. The lights then followed the rocket down range, then disappeared. At a time when it appears the rocket booster seperated, at least that's what we initially thought, we then saw only two of the lights continue to follow the rocket until we lost visual of the rocket. No doubt whatsoever that whatever was following the rocket was not conventional aircraft, although we could not define a structure, other that the lights maintaining a perfect diamond, or cross, relationship. Also, no doubt the \"lights\" followed the rocket down-range. Been searching on-line if anyone else saw the lights, and found that there were other witnesses. IT HAPPENED! We witnessed it for approximately 1.5 - 2 minutes."],"Tags":"City","Region":"Florida","trends":["There have been 4 other sightings in St. Petersburg","There were no other sightings in St. Petersburg on or around May 24th 2013"],"Object Flight Path":"Hovering then path","City":"St. Petersburg"}