{"Region":"Mississippi","Sighting Duration":"06:15:00","divs":["Sighting Details I was driving west along the beach on Hwy 90 in Gulfport at first light one morning. There was fog along the road and out into the water. But it was not a heavy fog and the few drivers on the road and myself were not slowing because of it. I looked out over the water and saw three large balls of fairly dim light aligned vertically just above the horizon out over the water. These balls of light were about the size of a quarter at arm's length. They appeared through the fog as sort of a dim yellow. The fog intermittently obscured parts of the balls but you could make them out pretty well. Other drivers must have seen them. I have never seen anything like this. I finally pulled over to the side of the highway to get a more stable view. These balls of light were large, dim (possibly because of the fog), and stationary and therefore unremarkable but inexplicable. I got back into my car and began to drive and when I looked again the lights were gone. I noticed that this month someone in Florida had seen the same thing out over the Gulf. Their description of it was was almost exactly what I saw."],"Case Number":"4763","Summary":"Three large balls of fairly dim light in vertical line just above the horizon","Tags":"City","Log Number":"US-05102006-0003","Source":"MUFON","Date of the Event":"10/15/1994 12:00 UTC","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=30.37597,+-89.085216(4763)&iwloc=A&hl=en\"> mufon case (4763) map </A>","Disposition":"Unknown","Country":"United States","Viewing Distance":"Unknown","Weather Factors":"Unknown","Latitude":"30.37597","Object Shape":"Sphere","trends":["There have been 8 other sightings in Gulfport","There were no other sightings in Gulfport on or around October 15th 1994"],"files":["/var/www/straped/mufon/html2text/4763.html.txt","/var/www/straped/mufon/org/4763.html"],"City":"Gulfport","Object Features":"Undisclosed","Longitude":"-89.085216","Date Submitted":"10/15/1994 12:00 UTC"}