{"Sighting Duration":"00:01:30","Disposition":"Unresolved","Region":"Ohio","Weather Factors":"Unknown","trends":["There have been 70 other sightings in Columbus","There were no other sightings in Columbus on or around May 25th 2013"],"Date of the Event":"05/25/2013 10:00 UTC","Object Flight Path":"Hovering then path,Path then hovering","Case Number":"47630","Latitude":"39.914128","Object Shape":"Fireball","Object Features":"Unknown","Log Number":"US-05252013-0014","Longitude":"-83.051528","Summary":"Burning yellow-orange light that dimmed and shrank as it appeared to move away from us","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Country":"United States","Tags":"City","divs":["Sighting DetailsMy girlfriend and I were watching TV at home when she noticed something odd glaring on the window. I got up and went out to the back deck and almost immediately saw a bright orange-yellow asymmetric orb. At first I thought it was a meteorite or a burning aircraft. It was proceeding south. The object seemed fairly close ( under 1 mile). It covered approximately 25 degrees of arc in eight seconds. At an altitude of approximately 35 degrees above the horizon. I called for my girlfriend and told her to go out to the front deck with me. By the time that the object became visible from the front of the house it was approximately half of its original size (initially the size was comparable to a thumb nail at arms length). It faintly looked as though it had a \"tail\" with a greenish tip but, instead of following behind it actually seemed as though it was leading the object. It was juting out at roughly a 7 o'clock position. After a few moments the object then hovered remaining static in both size and position. It then appeared to get slightly larger and move closer to us, and then began to shrink and drift to the south. Shrinking down to the size of a pen-head before disappearing into cloud cover. Our impression was that it was moving away, toward the west, giving it the appearance of shrinking. At first I was frightened thinking that something was about to crash, but within a few seconds I realized that it was something that I had never seen before. Living in a city with a major airport, and several large hospitals I've seen a lot of aircraft and this looked like nothing that I have never seen before. I did consider the possibility that it may have been a hot air balloon, but the air is fairly still tonight and the object moved too quickly and irregularly."],"files":["/var/www/straped/mufon/html2text/47630.html.txt","/var/www/straped/mufon/org/47630.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.914128,+-83.051528(47630)&iwloc=A&hl=en\"> mufon case (47630) map </A>","City":"Columbus","Date Submitted":"05/25/2013 11:04 UTC"}