{"Source":"MUFON","files":["/var/www/straped/mufon/html2text/47641.html.txt","/var/www/straped/mufon/org/47641.html"],"Latitude":"32.733009","Weather Factors":"Unknown","Longitude":"-97.3144","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=32.733009,+-97.3144(47641)&iwloc=A&hl=en\"> mufon case (47641) map </A>","Summary":"In front of Will Rogers Auditorium Ft Worth. Sitting on car hood reclined against windshield with a friend Both saw it. Saw on-line that on that date at least 4 other credible witnesses SE my location saw it.","Object Shape":"Disc","Viewing Distance":"20 Feet or Less","City":"Fort Worth","Region":"Texas","Date Submitted":"05/26/2013 03:32 UTC","trends":["There have been 128 other sightings in Fort Worth","There were no other sightings in Fort Worth on or around August 25th 1972"],"Log Number":"US-05262013-0008","Tags":"City","Case Number":"47641","Disposition":"Unresolved","Object Features":"Patterned Surface","divs":["Sighting DetailsSaw with a friend. I recently checked the dates and times approx and found out that we were not the only viewers that day. At least 4 others saw the same thing SE our location, prior to when we saw it. Very simple. Disc shaped and it looked like a disc that I had seen a picture of from the 1950's. It appeared to be silent and speed about 100-200 MPH between cloud cover. Full object was visble for under 20 seconds. I never doubted what we saw. The object was silver, like an airplane with what appeared to be rivited sections. It was definately not an airplane, blimp or any aircraft that I have ever seen flying. My Father worked in Los Angeles for Northrup aircraft in the 50's and Rocketdine. He once showed us a photo of a very similar vehicle at the plant he worked at. I am very happy to report this sighting and I now know that someone else saw it. I think the other viewers were military personell. The flightpath from where they saw the object took it right above us. It was a mid-day sighting with partial clouds. We immediately told someone who replied that we were seeing stars and he laughed. I do not believe that extra-terrestrials come trillions of miles to Earth on vacation and that they don't stop over for some R&R. I believe that my sighting was of a secret project by a government, maybe ours. I also don't believe that those same aliens come all that distance just to crash on the Earth...So...I know what I saw and I believe that it was made here on earth. 1. The object flew directly over our position. 2.I was looking skyward due to our position on the vehicle. 3.I thought it was a flying saucer. We. 4.I was not shocked, just a bit excited by the event. Calm. 5.It flew out of sight Northwesterly. I have no history of mental illness and I live in Fremont, California, unless that qualifies me for the aforementioned mental illness, lol, and near the Nothern cal Director of Mufon evidently. Call me."],"Date of the Event":"08/25/1972 12:00 UTC","Object Flight Path":"Straight-line path","Sighting Duration":"00:01:00"}