{"Log Number":"US-05102006-0005","Summary":"something flying with 2 lights and made no sound","Longitude":"-79.01512","files":["/var/www/straped/mufon/html2text/4765.html.txt","/var/www/straped/mufon/org/4765.html"],"Date of the Event":"09/20/2005 12:00 UTC","Object Features":"Undisclosed","Object Shape":"Unknown","Weather Factors":"Unknown","City":"Undisclosed","Disposition":"Unresolved","divs":["Sighting Details I was jogging on the track of the community park. I stopped to rest while laying on my back and looking at the darkening sky not expecting anything eventhough planes pass over regularly, I noticed what I believed to be a plane at first sight moving horizontally at about a quarter mile away, and one thousand meters high. I knew that I should have been able to hear the engine or jet of a of a plane at that distance and altitude, but there was no sound and there were only two big white lights alternating from what seemed to be the nose and tail unless it was flying side-way. I was so unsure of what it was that it startled me. It passed at the slow speed yet it was much bigger a small plane. As IT went over the small park silently and then got to the haze from the many lights of the hospital and businesses a short distance from the park yet along the objects path. It is at that point in the haze I got a glimps of its form from behind. I still don't know adactly what it looks like but it was clear to me that it was not a plane because there were no conventional wings that I could see, and it flew silently. Then it was gone as quickly as it came. Personally, I was glad to have seen another in the span of five years."],"Country":"United States","Sighting Duration":"00:00:30","Date Submitted":"09/20/2005 12:00 UTC","Latitude":"35.768823","Case Number":"4765","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","trends":[""],"Source":"MUFON","Tags":"City","Region":"North Carolina","map":"<A HREF = \"http://maps.google.com/maps?q=35.768823,+-79.01512(4765)&iwloc=A&hl=en\"> mufon case (4765) map </A>"}