{"Source":"MUFON","Viewing Distance":"Unknown","Region":"Ontario","Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","Tags":"City","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.059187,+-79.461256(47656)&iwloc=A&hl=en\"> mufon case (47656) map </A>","files":["/var/www/straped/mufon/html2text/47656.html.txt","/var/www/straped/mufon/org/47656.html"],"Object Features":"Unknown","Log Number":"CA-05262013-0022","Latitude":"44.059187","Date Submitted":"05/26/2013 10:46 UTC","City":"Newmarket","Object Shape":"Triangle","trends":["There have been 6 other sightings in Newmarket","There were no other sightings in Newmarket on or around May 26th 2013"],"Country":"Canada","Case Number":"47656","Disposition":"Unresolved","Date of the Event":"05/26/2013 09:35 UTC","Longitude":"-79.461256","divs":["sighting detailsat approximately 9:35pm i stepped outside into my backyard (in south newmarket) and immediately noticed a triangle of three white lights in the nw horizon, towards bradford\\west gillimbury. they looked like stars, in terms of size and appearance, except that they had never been there before, and they glittered gently or fluttered a reddish colour, but were predominantly white. i don't know how far away they were, but i held up my hand and the triangle was about the same size. at first i thought they were helicopters, but as i watched them they didn't move. a helicopter actually passed through the triangle while i stood there (about 10 minutes after i first saw them) going east or northeast. after approximately 15 minutes i noticed that they were slowly descending, relative to the power lines stretched across the same section of sky, but the movement was extremely slow. after about half an hour they had descended from about 20 degrees relative to the horizon to below the treeline and out of sight. the triangle formation was maintained the entire time. the bottom two went out of sight first, and by the time the topmost light had also slowly descended behind the treeline the bottom two would have either a)been on the ground, or b)been beyond the horizon, though it was hard for me to tell how far away they were. i should also note that the \"fluttering\" or \"glimmering\" was very subtle when i first noticed them, but as they got lower and lower the effect intensified, and while i could still see the last one through the trees the effect was strongest, and that's also when the reddish hue was most noticeable. for the duration there was no noticeable sound (ie: engines, propellers, etc), and there were no regular interval blinking lights as you might see on an aircraft (as i said, one actually passed through the formation (relative to my view of them, i think they were much farther away than the aircraft) with red and blue blinking lights, so i had immediate comparison). i'm hoping someone else saw them. i'd love to know what this might have been."],"Summary":"Three lights were in the direction of Bradford which gently pulsed were in a triangle formation that slowly descended below the treeline. Maintained the triangle formation the entire time over the course of about 30 minutes."}