{"Latitude":"34.196044","files":["/var/www/straped/mufon/html2text/47662.html.txt","/var/www/straped/mufon/org/47662.html"],"Tags":"City","Country":"United States","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering,Other","Disposition":"Unresolved","Source":"MUFON","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around May 26th 2013"],"Longitude":"-118.379936","City":"Los Angeles","Object Shape":"Fireball","Viewing Distance":"Over One Mile","Region":"California","Sighting Duration":"00:01:30","divs":["Sighting DetailsMy fiance and I were cooking bbq on our balcony and he pointed out a strange orange and red light in the sky. I have to mention, this is NOT the first time we've seen something in the same general area. The first time was on the 4th of July last year. But back to this incident. I looked up and saw the glowing red light and it did appear to be moving in a strange way, almost too slowly and in an indiscernible direction. I kept trying to make up my mind as to what it was. We live very close to the Burbank Airport so we see planes all the time. In this case, that familiarity allowed me to identify this as something different (again). We watched the light and I said \"is it still moving?\" I stared at it and noticed it moving slowly to the left and thought ok, maybe it's just a plane that's so far away it seems to be moving slowly. And then the light began to diminish very quickly, as though it were moving upward and out of view although I cannot say I saw anything move upward. It faded very steadily away into nothingness, almost evaporated. Moments later, a helicopter appeared and shined a light into the general area. It flew past where the light was and left, circling back around our apartment building. Neither my fiance nor myself noticed any sound from the helicopter although we may just have been excited, this being our second sighting. We also saw an airplane moments later and knew instantly that what we just saw was NOT any kind of aircraft we know about. As we looked at the plane I saw the red light flash one last time and go away. It occurs to me now that perhaps this was not the same red light. I can't be sure, but I am certain there was a second red flash after the first red-orange glowing light faded away. The first sighting was very similar, although the light was blueish green and not red. That time it also zig zagged a lot more and clearly shot upward into the sky at an extreme speed I have never seen before. It was still daylight so that may be why I was able to see the departure better. There were also more witnesses to the first sighting. Approximately 8."],"Date Submitted":"05/27/2013 02:04 UTC","Case Number":"47662","Weather Factors":"Unknown","Date of the Event":"05/26/2013 10:00 UTC","Log Number":"US-05272013-0003","map":"<A HREF = \"http://maps.google.com/maps?q=34.196044,+-118.379936(47662)&iwloc=A&hl=en\"> mufon case (47662) map </A>","Summary":"orange and red fireball appearing out of nowhere moving andhovering, then disapearing when helicopter approched","Object Features":"Unknown"}