{"Tags":"City","Date Submitted":"05/27/2013 05:55 UTC","Date of the Event":"06/12/1987 08:12 UTC","files":["/var/www/straped/mufon/html2text/47668.html.txt","/var/www/straped/mufon/org/47668.html"],"Weather Factors":"Unknown","Log Number":"US-05272013-0009","divs":["Sighting Detailshi i hope this isn't gov. ran bs anywaz THIS is the most significant story you will ever hear in the ufo community ok so i was in 6th grade went to camp in ca. i think it was calvin crest campgrounds by oakdale. there were approx. 50 kids and 5 adults . we were playing flashlight tag at night in the forest i came out of the tree s into a meadow facing a small pond and looked up and saw something that has changed my life a hovering craft it wasnt making a peep and it was so close i could throw a rock at it but i didn't. i started yelling who's got a camera and come out of the trees to see a UFO ! so the rest of the kids and adults were standing there staring at this ufo hovering above the small pond about 75 feet off the ground it was mostly dark metal greyish and it had one row of lights going around it in the middle and each light was a different color thats it! im still to this day wondering why me and some of the ppl ive contacted cant remember how it left ?? the ufo was probably about 40ft wide by 15ft tall . i am trying to contact anyone who was there period some ppl dont want to talk or even try to remember it . i remember it vividly and it came on the news when i got home!you should have seen my aunt face drop when it did cause i just got done telling her bout it ha! since then ive witnessed for sure one other and possibly two or three other ufos so im interested in regression i can handle it . so ive seen a lot of other ufo drawings similar and photos . i hope someone contacts me to help me get the 40 witnesses from this event."],"Object Features":"Dome, Patterned Surface, Other","Viewing Distance":"21-100 Feet","Latitude":"37.774545","Object Flight Path":"Stationary","Longitude":"-120.841844","map":"<A HREF = \"http://maps.google.com/maps?q=37.774545,+-120.841844(47668)&iwloc=A&hl=en\"> mufon case (47668) map </A>","City":"Oakdale","Region":"California","Object Shape":"Disc, Oval, Other","Country":"United States","Disposition":"Unresolved","Source":"MUFON","Summary":"6th grade camp 1987 40 or more witnesses i could have thrown a rock UFO","Case Number":"47668","Sighting Duration":"00:04:00","trends":["There have been 7 other sightings in Oakdale","There were no other sightings in Oakdale on or around June 12th 1987"]}