{"divs":["Sighting Details My wife, daughter and I were working in the backyard and had sat down under the carport to take a break. I looked up and saw two jet airliners at cruising level leaving contrails, one higher and farther away than the other. Noticed what appeared to be a shiny or white sphere-shaped object hovering closer in and lower than the two aircraft. Asked my daughter and wife if they see it and they do. As we discuss what this might be, it slowly moves left and up at a 45 degree angle. After about 10 seconds, it slows, stops, then begins moving right on a level course for about 15 seconds. As my daughter goes inside to get her phone and take a picture, the object moves up and right at a 45 degree angle, then quickly accelerates straight up. By the time my daughter gets back with her phone, it is now pin-point size and too close to the sun to see. When I first noticed it, I thought it might be a mylar balloon or a plastic shopping bag but was too big for the altitude it appeared to be at and movement was too erratic for the constant wind. Size at beginning of sighting was pea-sized held at arm's length. Would guess altitude to be 5000ft at beginning of event."],"Disposition":"Unresolved","Source":"MUFON","Date Submitted":"05/27/2013 11:12 UTC","Country":"United States","Date of the Event":"05/26/2013 02:00 UTC","Log Number":"US-05272013-0013","map":"<A HREF = \"http://maps.google.com/maps?q=35.623236,+-77.7078(47672)&iwloc=A&hl=en\"> mufon case (47672) map </A>","Weather Factors":"Unknown","Region":"North Carolina","City":"Walstonburg","Tags":"City","Object Features":"None","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/47672.html.txt","/var/www/straped/mufon/org/47672.html"],"Object Shape":"Sphere","Case Number":"47672","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Summary":"Shiny object hovers, climbs left, moves right, climbs right and then up out of sight.","trends":["There have been no other sightings in Walstonburg","This sighting has never been favorited."],"Longitude":"-77.7078","Sighting Duration":"Undisclosed","Latitude":"35.623236"}