{"Country":"United States","Object Flight Path":"Path with directional change","Source":"MUFON","divs":["Sighting DetailsA group of us were gathered around a bonfire in a wide open field way out in the country. The elevation is fairly high and we had a mostly 360 degree view of the sky. The sky was clear and the full moon had just risen. Someone said \"what is that\" and we all turned to the west and saw 3 bright orange lights way off in the distance. They were lined up vertically equally spaced and one of the lights moved around the other lights. The movement was smooth, quick and looked very deliberate, not random. The lights continued moving towards us. They weren't getting bigger, but the movement in our general direction was noticeable. They were star like in appearance but larger. At first I thought they were planets but it didn't make sense. Especially when they moved. After about a minute the lights dissolved. Approximately a minute later we all noticed 4 bright orange lights in the northern sky moving towards us equally spaced apart horizontally but at some distance from us. The lights were much lower to the ground. At first we thought maybe they were planes but the movement and spacing was not like a plane or a group of planes. The four lights went below our line of sight which was blocked by trees off in the distance. Everyone was surprised and a little bewildered by what we saw. Nobody could make sense of it. Two people had cameras but they were too caught up in the moment of watching the objects to remember to take a picture. The total observation time was probably about 2 minutes."],"Longitude":"-80.815368","Object Features":"Unknown","Region":"Ohio","Log Number":"US-05272013-0011","Summary":"3 bright orange lights in the Western sky just after moonrise then 4 lights in the North","City":"Powhatan Point","map":"<A HREF = \"http://maps.google.com/maps?q=39.860075,+-80.815368(47670)&iwloc=A&hl=en\"> mufon case (47670) map </A>","Object Shape":"Star-like","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Case Number":"47670","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/47670.html.txt","/var/www/straped/mufon/org/47670.html"],"Date Submitted":"05/27/2013 09:28 UTC","Date of the Event":"05/25/2013 10:00 UTC","trends":["There have been no other sightings in Powhatan Point","This sighting has never been favorited."],"Tags":"City","Latitude":"39.860075","Disposition":"Unresolved"}