{"Date of the Event":"05/26/2013 10:45 UTC","trends":["There have been 2 other sightings in Lakeside Marblehead","There were no other sightings in Lakeside Marblehead on or around May 26th 2013"],"Weather Factors":"Unknown","Viewing Distance":"Unknown","City":"Lakeside Marblehead","Object Shape":"Circle, Fireball","Sighting Duration":"Undisclosed","Source":"MUFON","Object Flight Path":"Other","Log Number":"US-05282013-0008","Country":"United States","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/47696.html.txt","/var/www/straped/mufon/org/47696.html"],"Longitude":"-82.754397","Region":"Ohio","Case Number":"47696","map":"<A HREF = \"http://maps.google.com/maps?q=41.561095,+-82.754397(47696)&iwloc=A&hl=en\"> mufon case (47696) map </A>","Summary":"There are several different objects from glowing orange orbs in a line and 2 stars flying in from different directions and then circling each other.","Date Submitted":"05/28/2013 09:24 UTC","divs":["Sighting DetailsIt was right around dusk with the sun just setting and light still in the sky off to the west. Our group was sitting around a fire that we had made in our backyard. We noticed what looked like glowing orange paper lanterns flying in a line above the houses next door to the west. We noticed the slow moving orbs because the fire was putting hot ash into the air above the houses and we noticed the one orange orb moving slowly from west to east. I stood up and walked up a slight hill behind us toward the east about fifteen feet from the fire when I noticed there was a lot more than one of them in a row. They moved from the west to the east in a line slowly until the lead light vanished in the sky. The line of orange orbs continued in the same direction with the light in the front until all the lights eventually disappeared in the sky. We thought they might have been paper lanterns people put in flight for memorial day. before the last few orbs vanished moving from west to east we noticed that there was two more orange orbs that moved the opposite direction as the original orbs moving across the tree line from east to west. The direction of the second set of orange orbs moving towards the first set did not make any sort of sense with the wind direction out over the lake that night. The orbs being paper lanterns but moving at each other with a slight wind out of the south did not make sense that they moved towards each other. The orbs all just vanished into the sky after several moments passed. About an hour after we seen the first orbs at exactly 10:45 pm EST I noticed another object moving across the sky out of the south. This object looked like a faint white star moving from the south heading to the north. the group thought it was a shooting star but didn't have a tail stream behind it. As it moved out of the south it kept speeding up and slowing down. The thing startled the most when it started to pulsate in the sky from a large white orb back down to a small white star. Everything was silent except for our dog barking. We followed it for some time thinking it was a shooting star breaking up as it moved from the south out over the lake in the north. As moved right over top of us we noticed a second star moving from the west to the east toward the first star. Just before they looked like they was going to collide with each other over the lake the two lights stopped made two circle patterns in the sky with each other and then vanished. The group of us really want to know if maybe what we say was lanterns and shooting stars but things don't add up right to make any sense of the situation. Please let us know if there was any satellites or maybe the space station that flew over, but that don't explain the two circles in the sky and vanishing."],"Tags":"City","Disposition":"Unresolved","Latitude":"41.561095"}