{"Longitude":"-87.981927","Object Shape":"Unknown","Object Flight Path":"N/A","Region":"Wisconsin","Disposition":"Unresolved","Date of the Event":"06/10/1997 09:30 UTC","Case Number":"47699","trends":["There have been 35 other sightings in Milwaukee","There were no other sightings in Milwaukee on or around June 10th 1997"],"Date Submitted":"05/28/2013 11:04 UTC","Log Number":"US-05282013-0011","Tags":"City","files":["/var/www/straped/mufon/html2text/47699.html.txt","/var/www/straped/mufon/org/47699.html"],"Source":"MUFON","Object Features":"Unknown","Viewing Distance":"21-100 Feet","Summary":"had seen an entity with red eyes. was unable to make out shape of body","City":"Milwaukee","divs":["Sighting DetailsI was making my lunch for work. At the time I was working 3rd shift, so it was approximately 930pm. Out of the corner of my eye, I noticed what appeared to be a set of car tail lights. My backyard butted up against the alley so it was not unusual to see cars back up into a garage at night...but this was slightly different. When I looked more intently, I noticed that these lights were not moving. I then thought it was a reflection of some kind,but it wasnt. After cancelling out the notion of this being a set of tail lights, I began to realize that what I was seeing was a set of eyes. In my backyard was a set of taller garbage cans that this thing was behind. Well, not behind,but in front of. There was a light down the alley a ways that lit up the area slightly but not much. This thing stayed in this spot where I was not able to make out its shape due to the fact that it was staying within the shadow. I then was trying to move my perspective by moving around the inside of the kitchen to try and get a different perspective on it. I was all this time trying to figure out what kind of animal this could be. I could think of none. This thing had pretty large eliptical eyes that glowed a bright red..My wife was sleeping in the bedroom at the time. I wanted to wake her up without leaving my position. I had a good feeling that if I left, this thing would be gone. I began screaming for her to wake up. With the loudness of my yell, and the fact that we were living in a small cape cod duplex, she should have woke up. I then began to think something may have been wrong with her since she did not respond, so I ran into the bedroom, and with just a slight nudge,she woke. Thought this was odd after my screaming.....When I came back to the kitchen, it was gone. Was hoping to have my wife as a witness but, was unable to. I told her what had happened. She seem to beleive me. I could not discuss too long with her because I had to go to work. I had to go to the area where this thing was by my garage to get to work. I did not see anything when I went out there. Kevin"],"Country":"United States","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.08,+-87.981927(47699)&iwloc=A&hl=en\"> mufon case (47699) map </A>","Latitude":"43.08"}