{"Object Shape":"Other","Region":"Wisconsin","Source":"MUFON","Date Submitted":"05/28/2013 01:47 UTC","Viewing Distance":"20 Feet or Less","trends":["There have been 2 other sightings in Fond du Lac","There were no other sightings in Fond du Lac on or around January 1st 1981"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=43.731176,+-88.431763(47692)&iwloc=A&hl=en\"> mufon case (47692) map </A>","Case Number":"47692","Latitude":"43.731176","Object Flight Path":"N/A","Date of the Event":"01/01/1981 12:00 UTC","Longitude":"-88.431763","files":["/var/www/straped/mufon/html2text/47692.html.txt","/var/www/straped/mufon/org/47692.html"],"divs":["Sighting DetailsThis is something that happened when I was 7 or 8 years old. I had never told anyone about it until a few years ago. This is going to sound a little odd - honestly I would like to say it was just a dream but to this day the memory still gives me chills. I was living in Wisconsin and one night I felt as though I had to go down to the basement. I didn't like the basement - especially my dads workshop at the back of the basement, because to a small girl it was scary, it had spider webs all over and my dad always warned me to stay away from the sump pump hole in his workshop. I hardly ever went in there but for some reason I went down there on this night after bed - everyone in the house was asleep. I believe it was the first time I was down there alone. I walked into my dads workshop and saw a glowing light underneath one of his workbenches. He had several holes drilled in the table tops and I was drawn to the light. I looked at the top of the table and saw a white glowing skinny, bony looking finger come out of one of the holes. The next thing I remember is I was standing face to face with this white glowing creature with huge black eyes and a small slit for a mouth. I thought it was like a weird little kid of some kind because it was my size. The body was extremely skinny, the head was large on top and small at the chin, I remember noticing that it had no ears. It seemed friendly and for some reason I assumed it was a girl. I was not scared at all and stood there having a conversation with it, except it didn't talk to me, it just seemed to send messages to my mind instead of talking. I remember thinking it was really cool. It made me think (by talking to my mind) that it had others close by and had to get back to them. I remember asking it if it wanted to see my swing set in the back yard and that is when I remember it telling me it had some kind of plane or ship to get to and it was located maybe across the street from my house. I don't remember going back upstairs at all or how the visit ended. I know this sounds insane but it really felt 100% real to me. At the time I was not scared but the next day I remember freaking out and being extremely scared of the incident. I believe I was told not to say anything about it because I remember being too scared to tell my parents. It scared me so bad I am 38 years old now and I only just told them a few years ago. I don't remember seeing ET or anything before this happened. We didn't watch a lot of TV, but later, as the years passed, I started seeing pictures on TV of \"aliens\" who looked just like the one I saw - the \"greys\" are the most similar ones I've seen - except this one seemed to glow. Every time I saw pictures of aliens, I was even more convinced that what I experienced was real, how could I have made up something so similar to everyone else?"],"City":"Fond du Lac","Object Features":"Other","Weather Factors":"Unknown","Tags":"City","Country":"United States","Summary":"N/A","Disposition":"Unresolved","Log Number":"US-05282013-0004"}