{"map":"<A HREF = \"http://maps.google.com/maps?q=41.686554,+-85.969367(47695)&iwloc=A&hl=en\"> mufon case (47695) map </A>","Log Number":"US-05282013-0007","trends":["There have been 12 other sightings in Elkhart","There were no other sightings in Elkhart on or around May 27th 2013"],"Object Flight Path":"Hovering then path","Viewing Distance":"Over One Mile","Tags":"City","divs":["Sighting DetailsMay 27th, approximately 10:07 PM, I was traveling westbound on 20 bypass south of Elkhart Indiana when I came into visual contact with 20 or so bright lights south of my location. I was on my way to work, but was able to observe the phenomenon for roughly 3-5 minutes. The weather was a light drizzle and overcast, which ruled out any star-like projection. The lights illuminated a yellowish color almost similar to a street light. I would estimate the distance within 2 to 3 miles, moving in my direction. As I traveled westbound in my vehicle, I rowed down the window and slowed to 15 mph to take a photo with my cell phone. The picture turned out well. The lights slowly moved north in my direction without any disruption in its flight plan. I believe I was caught in the moment, trying to eliminate probable causes. After several minutes, I believe I have witnessed multiple unidentifiable, flying objects. No noise, no erratic behavior, change of color, or flashing light. I lost site westbound after passing the location a few miles west. Again, no plausible explanation for what I viewed. I have never seen anything like it for that long in plain sight."],"Region":"Indiana","Disposition":"Unresolved","Object Shape":"Cylinder","Object Features":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"05/27/2013 10:07 UTC","Case Number":"47695","Source":"MUFON","Country":"United States","Weather Factors":"Unknown","City":"Elkhart","Date Submitted":"05/28/2013 09:19 UTC","files":["/var/www/straped/mufon/html2text/47695.html.txt","/var/www/straped/mufon/org/47695.html"],"Longitude":"-85.969367","Summary":"20 solid lights spotted south of 20 bypass and SR 19 south of Elkhart. Close, within miles , slowiy moving north. Witnessed for 3-5 minutes.","Latitude":"41.686554"}