{"Date of the Event":"05/27/2013 10:45 UTC","Object Shape":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/47690.html.txt","/var/www/straped/mufon/org/47690.html"],"Region":"North Carolina","Log Number":"US-05282013-0002","Object Flight Path":"Path with directional change","Source":"MUFON","Case Number":"47690","divs":["Sighting DetailsWas outside with my dog for her nightly bathroom break. I always observe the night sky during this time. I was looking up in the northern direction when I noticed a flying, flashing light. At first I thought it was just an airplane until I noticed that after every blink, the object appeared to be a lot further along its path than I anticipated. After focusing on this object as it was traveling west, I noticed it made an abrupt change in direction and went back east. After this I noticed another flashing light moving north. The first flashing light appeared to meet up with the second, then they both traveled north. Both blinked and judging by their positions as they blinked, appeared to be traveling at an enormous speed. They both appeared to travel along a set path, but then would disappear after every blink and reappear a lot further along their pathway. I observed another set of lights moving in the same manner, heading north towards the other two lights. All four lights then disappeared from my view due to trees blocking my view, heading north."],"map":"<A HREF = \"http://maps.google.com/maps?q=36.120969,+-80.070143(47690)&iwloc=A&hl=en\"> mufon case (47690) map </A>","Summary":"Several separate flashing lights that changed directions suddenly, north of KERNERSVILLE, NC","Weather Factors":"Unknown","Viewing Distance":"Over 1 Mile, Unknown","Date Submitted":"05/28/2013 01:21 UTC","trends":["There have been 4 other sightings in Kernersville","There were no other sightings in Kernersville on or around May 27th 2013"],"Latitude":"36.120969","Disposition":"Unresolved","City":"Kernersville","Longitude":"-80.070143","Tags":"City","Sighting Duration":"Undisclosed","Object Features":"Unknown"}