{"Country":"United States","Date of the Event":"05/28/2013 08:33 UTC","Region":"New York","Object Features":"Unknown","Log Number":"US-05282013-0016","Summary":"Object fluttering in sky over Flushing","Disposition":"Unresolved","Weather Factors":"Unknown","divs":["Sighting DetailsI witnessed an object kind of just hovering and twisting in the sky, as it made its way North, not at a very fast pace. I was standing facing West when I first saw it. I remember thinking, as I looked up at the sky right before the sighting, that I was just about to witness something, and it happened! Almost as if on command. I could make out that it had some kind of shape to it, as it was reflecting the sun light as it fluttered and twisted in different directions. It then started to turn direction, again, slowly and heading NE. By this point I changed my position and was watching it ascend and then it went behind cloud cover. I should mention this sighting was witnessed by me and 3 other women that were on the street corner of 168th street and 45th drive. One whom is a school crossing guard. Both me and one other person took pics with our cellphone camera. I took a total of 4 photos with my phone. Upon closer inspection of the pics, it was weird because the object isn't in any of the images. It just isn't there. Anywhere. Almost like it didn't want to be photographed. Perhaps some kind of cloaking technology that doesn't allow documentation of its existence? I should also mention that later today in the afternoon, just as I was about to pick up my kid from school, I lost an hour that I cannot account for. I'm not the type to be late for picking up my son, and as I went to sit at the computer to check the weather I realized about 1 hour had passed and it I was beyond late heading out. This happened at about 2:26pm. Not sure if it has anything to do with the UFO I saw earlier. But I can't explain where that one hour went. I don't recall falling asleep. I can't help but wonder if I may have been taken during that lost time. I am very disturbed by this."],"Tags":"City","trends":["There have been 4 other sightings in Flushing","There were no other sightings in Flushing on or around May 28th 2013"],"Date Submitted":"05/28/2013 04:09 UTC","Latitude":"40.747796","Viewing Distance":"501 Feet - 1 Mile","City":"Flushing","Source":"MUFON","Sighting Duration":"Undisclosed","Object Shape":"Unknown","Case Number":"47704","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/47704.html.txt","/var/www/straped/mufon/org/47704.html"],"Longitude":"-73.779813","map":"<A HREF = \"http://maps.google.com/maps?q=40.747796,+-73.779813(47704)&iwloc=A&hl=en\"> mufon case (47704) map </A>"}