{"Sighting Duration":"02:00:00","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Case Number":"47709","Weather Factors":"Unknown","Object Features":"Unknown","Date Submitted":"05/28/2013 05:48 UTC","Object Shape":"Circle","Source":"MUFON","Region":"California","Latitude":"38.242824","City":"Galt","Date of the Event":"01/20/2013 10:00 UTC","Tags":"City","Summary":"ufo landing in field","trends":["There have been 2 other sightings in Galt","There were no other sightings in Galt on or around January 20th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.242824,+-121.293959(47709)&iwloc=A&hl=en\"> mufon case (47709) map </A>","Country":"United States","Object Flight Path":"Path with directional change","Longitude":"-121.293959","Log Number":"US-05282013-0021","files":["/var/www/straped/mufon/html2text/47709.html.txt","/var/www/straped/mufon/org/47709.html"],"divs":["Sighting DetailsI was froging on the ranch were born raised at so wife and wife I Go on weekends my father been on ranch since 1957 when i was a boy my father would put a mantress in back of Dumtruck and would stay night in field and i see things fly at night. but did not thin k it would land in front of me ever but it did so when it land by the house i put every thing in the car wehont to the to the house pulled my cameraa out i took photos one after a other for a i got it hoovering the i got were its start to move very fast it Leave a cloud behind it. so i start taking photos in the front yard i got feeling like saming is look at me so i took every were front and back in the trees bush i was there 2 hours so on the way home my woife said you got same thing in your photos so started to look i got 5 Aliens in my photos there is more then the 5 if you look there is more and they on the ranch for 5 months now i took a mofon member to the ranch he got a Alien in his photo in the day time he could not belive it this was 5 months later they are still there and they play games with us my friend he is like a cousin to me we were born on the same ranch. i call he dad uncle and we get together on weekends and the Aliens play with them to we will sit in the car and play music and shake the car or they hit the car doors or knock on the house door and run the same with the car doors so i would get out of the car and look for the i ask what were they doing there they told me they were looking at the water. but i got photos of them every were on the ranch i ufos flying and on land 2 more ALiens and i had ghost hunter came to ey the house were the ufo landed by they were getting orbs they got one ghost they got evp talk to the ghost. but the camera was not there yet but when the got the were like kids they were they were let there so he ask why are you Let they told Us a ufo it fly right over us it was van and car we ask them did you get a photo they m no so i ask them did it look like this they said yes were did you get the photo at i told them Story. they did not see my photos that i have. they seen the ufo one."]}