{"Date Submitted":"05/28/2013 04:20 UTC","Weather Factors":"Unknown","Disposition":"Unresolved","Case Number":"47705","files":["/var/www/straped/mufon/html2text/47705.html.txt","/var/www/straped/mufon/org/47705.html"],"Latitude":"43.577908","map":"<A HREF = \"http://maps.google.com/maps?q=43.577908,+-116.219694(47705)&iwloc=A&hl=en\"> mufon case (47705) map </A>","trends":["There have been 69 other sightings in Boise","There were no other sightings in Boise on or around December 18th 2011"],"Object Shape":"Cigar, Disc","Sighting Duration":"03:00:00","Object Features":"Dome, Window(s), Other","divs":["Sighting DetailsMe, my daughter, her boyfriend, were the main witnesses. My son and my mom also saw strange lights in the sky. But the main witnesses saw a multiple strange objects in the sky along with new military helicopters that was doing planned maneuvers that night. On top of that we were having several military jet flybys. The object seamed to be going to a an area of the sky right above the my house. After about two hours passed and a disk shaped craft appeared out of no ware, like it was cloaked. it just hovered for about 20 minutes then very slowly, about 5 or 10 miles per hour, moved over my house. No sound but a very quiet and low electric humming. The disk was about 80 to 100 feet wide and had a lit dome on top that I could see humanoid shadow silo-wets. The second craft was a cigar shape about 200 feet long that very slowly moved passed the house just behind my house. Once again at a speed of about 5 to 10 miles an hour. This craft I was so close I could see the back ass end, it was glowing very bright red but not emitting any light beyond the craft. Both crafts followed the same path, came from S.E. of Boise, mountain area and left a N.E. Boise area, Idaho city area path. The crafts were metallic grey in color. Both crafts appeared to brake the laws of physic as I know of. I can not explain, I was not afraid, but I new I was looking at something made from beyond Earth. Call it instinct, I just new."],"Country":"United States","City":"Boise","Summary":"I witnessed two crafts up close and multiple crafts from a distance. One was a cigar shape the size of a large commercial craft.100 to maybe 200 feet long and 60 feet wide or so about. The second was a disk shape with a dome lit with human shaped shadows","Region":"Idaho","Date of the Event":"12/18/2011 06:00 UTC","Viewing Distance":"21-100 Feet","Longitude":"-116.219694","Tags":"City","Object Flight Path":"Path then hovering","Source":"MUFON","Log Number":"US-05282013-0017"}