{"map":"<A HREF = \"http://maps.google.com/maps?q=28.525808,+-81.301557(47700)&iwloc=A&hl=en\"> mufon case (47700) map </A>","Log Number":"US-05282013-0012","Source":"MUFON","trends":["There have been 112 other sightings in Orlando","There were no other sightings in Orlando on or around May 11th 2013"],"Latitude":"28.525808","divs":["Sighting Detailsleaving my aunts home about 9pm on the 11 of may 2013 when I observed to my left (north) 3 lights acending what apeared a little over a mile, seconds later 2 more followed the first 3, as I am recording these lights and airplane takes off from the orlando airport and I recorded a few seconds to have a comparison as to distance, sound and speed, go back to recording the lights by this time the first 3 had gone into the clouds and I continue recording the last 2 until they also go into the clouds. To my surprise when I arrived to my residence and sit down to watch the video its when I realized what the camera recorded that I did not see since I was only viewing the lights on the camera, at least 14 to 15 different objects and to my surprice I have on video when 2 of the ufo's are flying in my direction, for a few seconds they seem to stop and hoover a few hundred yards infront of me and they continue their flight right over me, what really struck me was that at no moment there was any sound, what the camera records as they fly over me it seems its the propulsion system as it was dark the only thing I can think of is the heat that was eminating from the ufo. The photos am attaching were taken on my computer as I had transfered the video on my computer screen whith the same camera I took the video with."],"Summary":"14 to 15 lights observed with overhead flight less than 300' above my self all recorded on video","Object Features":"Unknown","Viewing Distance":"21-100 Feet","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/47700.html.txt","/var/www/straped/mufon/org/47700.html"],"Date of the Event":"05/11/2013 09:10 UTC","City":"Orlando","Date Submitted":"05/28/2013 11:34 UTC","Region":"Florida","Case Number":"47700","Sighting Duration":"00:03:57","Tags":"City","Longitude":"-81.301557","Country":"United States","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Object Shape":"Circle, Other","Weather Factors":"Unknown"}