{"Date of the Event":"11/09/2012 07:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.794478,+-90.509684(47710)&iwloc=A&hl=en\"> mufon case (47710) map </A>","Longitude":"-90.509684","Disposition":"Unresolved","Summary":"String of orange-red lights that seemed to be part of a large, rotating craft.","Object Features":"Unknown","Log Number":"US-05282013-0022","Sighting Duration":"00:15:00","trends":["There have been 3 other sightings in St. Charles","There were no other sightings in St. Charles on or around November 9th 2012"],"Tags":"City","Date Submitted":"05/28/2013 06:13 UTC","Region":"Missouri","Case Number":"47710","Source":"MUFON","Latitude":"38.794478","Country":"United States","City":"St. Charles","Weather Factors":"Unknown","Object Flight Path":"Stationary,Straight-line path","Object Shape":"Disc, Fireball, Sphere, Unknown","files":["/var/www/straped/mufon/html2text/47710.html.txt","/var/www/straped/mufon/org/47710.html"],"divs":["sighting detailson friday night (11\\9) at around 7:30-7:45 local time i stepped outside to have a cigarette before getting ready to go to a movie at 8:30. my girlfriend and i were standing on our back porch which looks out to the northeast. just as we were about to go inside, i noticed off in the distance a string of four red\\orange lights in the sky. i stopped for a moment and then pointed them out to her. as we stood and watched, the lights began to move from east to west, keeping the same distance from each other and moving the same speed. we have several trees in our back yard and a several houses behind ours, but these things were just in the perfect spot where we could see them clearly. as we watched for a few seconds, we noticed the one that was farthest west went behind a tree and we could no longer see it, but as they continued to move, it never reappeared. at the same time, another light appeared from the east side moving in formation with the rest. this continued for a couple of more minutes. as one would disappear to the left side, another would appear on the right. it looked as if these lights were all part of one giant thing that was rotating in the sky. the lights themselves were moving in a semi-circle, but would never leave the path. after a couple of more minutes, my friends who i was going to the movie with came out to see what was taking me so long and i pointed the lights out to them. the immediately agreed that it wasn't normal and stood with us watching for another five minutes. before long several of the lights never returned. soon it was just one light moving across the path until that one disappeared as well. the lights themselves were just a solid red-orange color. they did not change color, blink or change size. where we live we see planes going in for a landing at the airport all the time and it certainly was not a plane or a helicopter. just taking a stab in the dark, based on the fact that planes were flying through the sky, i would say it was probably a good 10 to 15 miles away from us. based on where we were looking and how far away i think it was, it must have been near the marais temps clair conservation area."],"Viewing Distance":"N/A"}