{"files":["/var/www/straped/mufon/html2text/47713.html.txt","/var/www/straped/mufon/org/47713.html"],"trends":["There have been 417 other sightings in Phoenix","There was one other sighting in Phoenix on or around May 27th 2013"],"City":"Phoenix","Sighting Duration":"Undisclosed","Source":"MUFON","Log Number":"US-05282013-0025","Tags":"City","Object Flight Path":"Path with directional change","Object Shape":"Circle, Fireball, Flash, Oval, Star-like","Disposition":"Unresolved","Latitude":"33.531841","Object Features":"Unknown","Country":"United States","Weather Factors":"Unknown","Summary":"Explosion in sky, object left black smoke trail decending then before hit treetops it changed direction still with black smoke trail.","map":"<A HREF = \"http://maps.google.com/maps?q=33.531841,+-112.107915(47713)&iwloc=A&hl=en\"> mufon case (47713) map </A>","Longitude":"-112.107915","Date Submitted":"05/28/2013 07:18 UTC","divs":["Sighting DetailsI was walking out side admiring the chem trails from all the airplanes in the sky to which there was an unsual number of them this particular time. I looked down the street cause my friend was coming to pick me up and saw a red explosion with lots of black smoke fallowed by a sort of gun shot sound. then i noticed an object flying away from this explosion and a black obect headed straight for the ground as an airplane would with no control. A mass of thick black smoke trailed behind it breaking a couple times. then before it hit about treetop hight from ground it started fly again changing its direction from straight down to a perfect horizontal flight path to the right of its decention. it was not a rounded change of direction rather an abrubt back to life kind of thing. i snapped a couple shots of the object that flew away and the decention and black smoke trail but was unable to capture the change of direction due to the speed of it and i was in full digital zoom which is hard to control for a far objet thats moving so i could not get a fix on it. then it simply disappered but left the black smoke in the sky for a few hours till it was to dark to see anymore."],"Region":"Arizona","Viewing Distance":"501 Feet - 1 Mile","Case Number":"47713","Date of the Event":"05/27/2013 08:30 UTC"}