{"Log Number":"US-05282013-0027","Summary":"My Wife, Daughter and I observed this object that was bright and appeared to be falling","Source":"MUFON","Object Features":"None","Object Flight Path":"Path with directional change","Longitude":"-83.918681","Date Submitted":"05/28/2013 08:37 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.188672,+-83.918681(47715)&iwloc=A&hl=en\"> mufon case (47715) map </A>","divs":["sighting detailsyesterday, 5\\27\\2013 at around 3:15 to 3:30 pm, my wife, daughter and i were in our pool when my wife pointed out a \"white dot\" that appeared to be tumbling and falling over south hall county. we observed it for about 5 minutes before a cloud bank obscured it. it appeared to be shiny, depending on how the large surface was turned in our direction. it was erratic, and not under any apparent control. it had an erratic movement, both downward and laterally. with the motion it displayed, occasionally a larger, reflection surface appeared to us. we could not estimate the size, due to the altitude above the clouds, but had the idea of a tumbling door from an aircraft. when i realized it was moving laterally too occasionally, i went into the house to get my binoculars, but when i got back, it had disappeared behind the clouds and the tree line, based on the movements the last time we saw it. this was in a north, northeast direction from us. we speculated that it could have been maybe a door coming off an aluminum skinned aircraft. i have been watching out for reports, but have heard nothing."],"Region":"Georgia","Case Number":"47715","Viewing Distance":"Unknown","Disposition":"Unresolved","Country":"United States","Tags":"City","Weather Factors":"Unknown","Latitude":"34.188672","files":["/var/www/straped/mufon/html2text/47715.html.txt","/var/www/straped/mufon/org/47715.html"],"Sighting Duration":"00:05:00","Object Shape":"Triangle","City":"Flowery Branch","trends":["There have been 3 other sightings in Flowery Branch","There were no other sightings in Flowery Branch on or around May 27th 2013"],"Date of the Event":"05/27/2013 03:20 UTC"}