{"Country":"United States","Weather Factors":"Unknown","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/47728.html.txt","/var/www/straped/mufon/org/47728.html"],"Object Features":"Unknown","Latitude":"41.997427","Region":"Massachusetts","Tags":"City","Source":"MUFON","Longitude":"-70.707262","Date of the Event":"05/04/2013 07:00 UTC","Disposition":"Unresolved","City":"Kingston","Date Submitted":"05/30/2013 12:29 UTC","Sighting Duration":"01:00:00","trends":["There has been one other sighting in Kingston","There were no other sightings in Kingston on or around May 4th 2013"],"Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=41.997427,+-70.707262(47728)&iwloc=A&hl=en\"> mufon case (47728) map </A>","Case Number":"47728","Summary":"I know it wasn't Arcturus or Sirius, but was significantly brighter","divs":["Sighting DetailsI went out to have a cigarette on my back deck, which faces south, southwest, and thought I was watching a plane come in, until it stopped moving. i tried to rationalize what I was seeing and thought it could be a helicopter, but there was no sound. I knew it wasn't a satellite or the I.S.S. (which I had seen fly through the sky a few weeks earlier). I immediately thought I was looking at Arcturus or Sirius, but Sirius hadn't even risen above the horizon and I was able to locate Arcturus in the eastern part of the night sky almost directly above me; but whatever I was looking at was far brighter than Arcturus. I then received a call from my brothers girlfriend and told her to go outside and look in the direction that I was witnessing the object. The first thing she said when she found it in the sky was that it was pulsating and changing colors. Then she asked me what it was and if it could be a comet or asteroid. I had explained that if it were either of these that we would be seriously screwed because it would have a trajectory path towards Earth, and that it would be visible during the day time hours. While on the phone with her I had grabbed a pair of binoculars and steady them with a tripod. I was able to observe the object which was cylindrical in nature, like a cigar, rotate in the sky while changing colors and pulsating light. At one point it actually looked like an upside down jellyfish. It was very weird! When I had finished speaking with her I grabbed my camera and mounted it on my tripod and tried taking a few shots of the object before it disappeared behind the tree line. I sat there wondering what it was that I had just seen and why I wasn't seeing any other aircraft in the sky. Normally, I can sit and watch planes coming in to land at Boston fly a specific flight path, where this object was located; hence why I initially thought it was an airplane. The following night I thought I would try to look in the same area for the object I observed and was amazed to see it in the night sky for a second night in a row! I thought I could repeat the process on the third night, but it was no longer there. I thought I would try and give it a shot on the fourth night and again no luck, however the planes that take the flight path where the object was witnessed finally began running again, leaving me to believe that it was not coming back."],"Log Number":"US-05302013-0001","Object Shape":"Cigar, Cylinder, Disc"}