{"Date of the Event":"04/08/1967 11:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.783881,+-119.408542(47725)&iwloc=A&hl=en\"> mufon case (47725) map </A>","Region":"California","Longitude":"-119.408542","Date Submitted":"05/29/2013 10:14 UTC","trends":["There have been no other sightings in Finegold","This sighting has never been favorited."],"Tags":"City","Sighting Duration":"03:00:00","City":"Finegold","files":["/var/www/straped/mufon/html2text/47725.html.txt","/var/www/straped/mufon/org/47725.html"],"Disposition":"Unresolved","Weather Factors":"Unknown","Summary":"Light{star}fast,slow,near,far telepathic,peace,joy, lost time,wanted to go with them, refused ,kind. thought was dream, friend near had same dream","Source":"MUFON","Country":"United States","Latitude":"36.783881","Object Flight Path":"Path with directional change","Case Number":"47725","Log Number":"US-05292013-0010","divs":["Sighting Detailswas sleeping on a rock outside in Sierra foothills, next to new friend and her baby, had built a fire on the rock between us. Woke up suddenly and dreamily and sat up in my sleeping bag, in my left peripheral vision I saw my neighbor sit up at the same time looking upward as I was, the baby stayed sleeping. A star was talking to us in our minds, near,far,bright,dim,fast, slow,big,small, all these adjectives. I was covered with a feeling of peace and joy as had never felt before. I was sixteen. Don't remember any conversation,except when they told me they were going to leave, I asked, pleaded with them to take me with them, They kindly told me no and to lay down and go back to sleep, as I did. Out of the corner of my eye,saw my friend lay back down also. Also noticed the baby was still sleeping, but the fire was out, where it had been flaming before. Woke up the next morning and started to tell my friend of this wonderful dream I had, she stopped me and told me she had had the same dream. She wanted to go with them also, but worried about her baby. I would have just thought of this experience as just a dream, if not for another having the exact observations and feelings as me. I went home the next day and never saw her again."],"Object Shape":"Star-like","Object Features":"None","Viewing Distance":"Unknown"}