{"Date of the Event":"10/28/2012 06:45 UTC","files":["/var/www/straped/mufon/html2text/47727.html.txt","/var/www/straped/mufon/org/47727.html"],"Summary":"3 fireballs over the Organ mountains, triangle formation, random blinking on & off for 6 min.","Object Shape":"Circle, Fireball, Triangle","Tags":"City","City":"Las Cruces","Sighting Duration":"00:06:00","Latitude":"32.32534","Log Number":"US-05292013-0012","Longitude":"-106.754484","Country":"United States","trends":["There have been 24 other sightings in Las Cruces","There were no other sightings in Las Cruces on or around October 28th 2012"],"Object Flight Path":"Stationary","Weather Factors":"Unknown","Source":"MUFON","divs":["sighting details seen while driving southbound through town with my son. 3 yellow-orange fireballs\\lights\\orbs hovering just above the southern end of the organ mountain range. the sun had set 30 min or so, so it was dark out. the lights did not move. they formed a triangle formation. one on top, one directly below it, and one off to the right. they would occasionally blink out, in random order, but were on more than off. they never broke formation, never moved. they glowed, but did not shine like a regular light, no light emitted from them, as in they did not light up the sky around them. they were positioned just above the mountains in a close enough formation for my fist held out in front of me would have covered it. they were approx. 5 miles away from me. they were larger than any star in the sky above but much smaller than the moon (which was large and almost full, it had just risen). i have never before seen anything like this, as in lights do not behave like this or look like this as far as i know."],"Date Submitted":"05/29/2013 11:51 UTC","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=32.32534,+-106.754484(47727)&iwloc=A&hl=en\"> mufon case (47727) map </A>","Disposition":"Unresolved","Case Number":"47727","Object Features":"Unknown","Region":"New Mexico"}