{"City":"Undisclosed","trends":[],"divs":["Sighting DetailsMy sister , mother and my son and two of my sisters daughter were heading home from a Wichita Kansas shopping trip. It was late at night, no other cars on the road, no homes or lights in the area at the time. I was in the back seat of the car. I had the window down looking at the stars. I saw three bright dots in a formation, on a little in front of the other two shoot across the sky, high up where the sati lights are. There were no read light or other lights at all on these dots or ships. They went lightening fast across the night sky then turned in formation backward heading west. They had been traveling from the west toward the east. They made a sharp > turn looked just like the little sign I put up. Nothing I know of can do that, they did not look like they were all attached lights but could have beenI guess. I did not think so at the time. They went across the whole sky that I could observe then with out a moments hesitation went the other way. I know I was a UFO, only time I have ever seen one. Or three? I do not had direct time or year becasue it was so long ago, but I never forgot. I started not to even mention it, when I came across this site, but I thouhgt may be some one else might have reported the soame thing. We were heading back home to Garden city, and were about half way home, between Wichita and Garden when I saw this. All I got, sorry Linda Katz age 63 Garden city Kansas"],"Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=39.019532,+-98.475916(47730)&iwloc=A&hl=en\"> mufon case (47730) map </A>","Date Submitted":"05/30/2013 03:21 UTC","Summary":"Three lights high in sky above airplane flights, moving unbelievably fast. All three change course in a blink of an eye, and went farther than I could see.","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/47730.html.txt","/var/www/straped/mufon/org/47730.html"],"Source":"MUFON","Longitude":"-98.475916","Latitude":"39.019532","Sighting Duration":"Undisclosed","Log Number":"US-05302013-0003","Object Shape":"Star-like","Disposition":"Unresolved","Object Flight Path":"Path with directional change","Case Number":"47730","Weather Factors":"Unknown","Country":"United States","Tags":"City","Region":"Kansas","Date of the Event":"06/22/1978 12:00 UTC"}