{"map":"<A HREF = \"http://maps.google.com/maps?q=33.60903,+-117.691389(47733)&iwloc=A&hl=en\"> mufon case (47733) map </A>","divs":["Sighting DetailsWhile at Sycamore Park (facing north-west, overlooking Aliso Creek) stargazing with two friends, I noticed a brightly glowing object that appeared beneath power lines, to the right of a stand of trees, and above a house on a small hill. The object caught my attention because it appeared suddenly and was traveling in a different direction than the easily identifiable commercial aircraft that passed periodically overhead and followed an identical flight path. At first I thought the object might have been an airplane or helicopter with landing (or other) lights illuminated; but it was much brighter than any aircraft landing lights I had ever observed previously. It seemed to be traveling faster than the commercial aircraft in the sky. There were no blinking lights associated with this object. The glow suddenly faded over a period of approximately two seconds, transitioning from bright white, to soft blue-green, to faint blue-white. The object then disappeared. I mentioned the presence of the object to my friends, one of whom looked up just after it disappeared. I immediately wondered whether it was a satellite; although it had glowed brightly in a similar manner to a large meteor, it was moving much too slowly (800-1200 mph from my vantage point, assuming it was at roughly the same altitude as the commercial aircraft). The object then reappeared about six inches of sky to the right of its last observed location. It glowed a soft blue-green and faded to blue-white over a period of about three seconds. Again, I told my friends. It disappeared again, at which time I concluded that it was not a satellite, as I had never seen one glow brightly, disappear, reappear, then disappear again; it was unlike any aircraft, meteor, or satellite I had seen before. My friend had looked up again, but was too late to see it. The object reappeared a final time, some five or six inches to the right of its previous location, and one or two inches farther north. It seemed to have changed direction slightly. I told my friends once more, and one of them looked up, then exclaimed that she saw it, too. (The other had not been paying attention.) Again it glowed a soft blue-green and faded to a faint blue-white over a period of two or three seconds. I lost sight of the object when it did not reappear."],"Weather Factors":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/47733.html.txt","/var/www/straped/mufon/org/47733.html"],"Case Number":"47733","City":"Mission Viejo","Object Features":"Unknown","Disposition":"Unresolved","Object Shape":"Flash, Sphere, Star-like","Longitude":"-117.691389","Date Submitted":"05/30/2013 05:10 UTC","Date of the Event":"05/29/2013 10:00 UTC","trends":["There have been 10 other sightings in Mission Viejo","There were no other sightings in Mission Viejo on or around May 29th 2013"],"Viewing Distance":"Over One Mile","Object Flight Path":"Path with directional change","Sighting Duration":"00:00:30","Summary":"Object first observed when it suddenly glowed a bright white; object reappeared twice some distance from its previous position, disappeared three times. Eastbound, then north-eastbound.","Source":"MUFON","Latitude":"33.60903","Region":"California","Log Number":"US-05302013-0005","Country":"United States"}