{"Object Shape":"Triangle","Date of the Event":"05/12/2006 11:50 UTC","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.668621,+-110.698888(4773)&iwloc=A&hl=en\"> mufon case (4773) map </A>","Object Flight Path":"Path with directional change,Path then hovering","Tags":"City","Date Submitted":"05/12/2006 11:50 UTC","files":["/var/www/straped/mufon/html2text/4773.html.txt","/var/www/straped/mufon/more/4773_submitter_file1__triangle1.jpg","/var/www/straped/mufon/more/4773_submitter_file2__triangle2.jpg","/var/www/straped/mufon/org/4773.html"],"divs":["Sighting DetailsI was in my apartment for lunch. My wife and I heard the sound of really loud jet engines, so we went outside to see two F16's flying at extremely low altitude. I turned around to look the way that they had come, and noticed a glint in the sky. A moment later it moved so that I could see it clearly. It was a dull gray color, and triangular in shape. It straightened so that it was perpendicular with the ground, and I had trouble seeing it. It was about a thousand feet above the lake in the Bullfrog Marina at Lake Powell. The object seemed to phase in and out of visibility, appearing suddenly several thousand feet away from where it disappeared. It made no noise that we could tell. After about three minutes of watching the object, it just disappeared. As a side note, I was wearing sunglasses at the time that I spotted it. I have noticed that when I wear sunglasses, they filter out some light waves, making it easier to see rainbows in the clouds and stuff like that. If I had not been wearing my sunglasses, I do not think that I would have seen the object. Many of my neighbors saw the F16's, but my wife and I were the only people that saw the triangular object. I went to my truck and grabbed my binoculars and camera, but the object did not re-appear."],"Country":"United States","Log Number":"US-05122006-0001","Source":"MUFON","Summary":"I noticed a triangular Shaped UFO appeared above Lake Powell shortly after 2 F16's flew past at low altitude","Region":"Utah","Object Features":"None","City":"Bullfrog","Sighting Duration":"00:03:05","Longitude":"-110.698888","trends":["There has been one other sighting in Bullfrog","There were no other sightings in Bullfrog on or around May 12th 2006","This sighting has never been favorited.",""],"Weather Factors":"None","Case Number":"4773","Latitude":"37.668621","Viewing Distance":"Over One Mile"}