{"Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=30.508624,+-97.817394(47738)&iwloc=A&hl=en\"> mufon case (47738) map </A>","Object Features":"Window(s)","Case Number":"47738","Source":"MUFON","Country":"United States","files":["/var/www/straped/mufon/html2text/47738.html.txt","/var/www/straped/mufon/org/47738.html"],"Sighting Duration":"02:00:01","Longitude":"-97.817394","Viewing Distance":"21-100 Feet","trends":["There have been 14 other sightings in Cedar Park","There were no other sightings in Cedar Park on or around May 15th 2013"],"Date of the Event":"05/15/2013 02:00 UTC","Date Submitted":"05/30/2013 03:09 UTC","Weather Factors":"Unknown","Disposition":"Unresolved","Region":"Texas","City":"Cedar Park","Object Shape":"Cigar, Disc, Oval, Triangle","Tags":"City","divs":["Sighting Details- To start off, I can't remember my entire experience due to some of the abduction. I remember half of it but not fully. - -- I was sound asleep when suddenly it felt like I couldn't move. I awoke to find four six inch tall figures standing in my bedroom beside my bed staring at me and it looked like they were communicating to one another. They took me by the hand and led me to their space craft. Outside were around four to five other objects in the sky. The one I noticed that looked unusual was a flat square UFO, almost like an I-Pad but it had no windows or anything, just hovering in the air. I was led into a Triangular ship which had tables and other occupants of the crew. They sat me down on the table while the room got brighter until I blacked out. During my experience, I was seeing strange things in my mind. It showed the Earth in space with lava coming out of the Earth. I could see many more oval shaped UFO's flying around on Earth, they said there was an invasion coming sometime this year or next. I was shown people dying, buildings collapsing , the ground exploding, the sky was blood red, that's about all I remember seeing. I couldn't remember much of anything else during my experience but I do remember hearing something of December 21 2013-14. I am still recovering from the abduction but this was mainly about all I can remember at the time.. all I can say is I believe there is an invasion coming and we need to be ready, we need to prepare for this."],"Summary":"Abduction Early Morning.","Latitude":"30.508624","Log Number":"US-05302013-0011"}