{"trends":["There has been one other sighting in Kennett","There were no other sightings in Kennett on or around May 26th 2013"],"Case Number":"47737","Disposition":"Unresolved","Object Features":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/47737.html.txt","/var/www/straped/mufon/org/47737.html"],"Date Submitted":"05/30/2013 01:39 UTC","Date of the Event":"05/26/2013 02:00 UTC","Viewing Distance":"Unknown","Object Flight Path":"Stationary","Weather Factors":"Unknown","Longitude":"-90.021035","Object Shape":"Sphere","Region":"Missouri","map":"<A HREF = \"http://maps.google.com/maps?q=36.271236,+-90.021035(47737)&iwloc=A&hl=en\"> mufon case (47737) map </A>","Log Number":"US-05302013-0010","Sighting Duration":"Undisclosed","Latitude":"36.271236","Summary":"Large stationary object with rotating lights in Independence on two nights","Country":"United States","Tags":"City","divs":["sighting detailsas reported to asd in person - due to his position the witness wishes to remain anonymous so i put my own phone number down and an alias for the name. i felt it was important to report this since there have been so many reports of similar objects in the independence and blue springs areas over the past year. i have been observing a stationary object with rotating lights on it for several months in the eastern sky from my home in independence, missouri. the object looks white or silver, and it has very bright blue, green, and white lights on it that appear to rotate around at 1\\2 second intervals. it was always in the same location. it appeared to be the size of an aspirin held at arm's length on most nights. on may 18 and 26 i looked outside my window at 2:00 am and saw a similar object at about 30 degrees off the horizon and just over the tree line, only this time it was much closer and much larger - the size of a golf ball or larger, and was much clearer with the very bright lights being clearly visible. i happened to be watching tv late on both of these nights and saw the object stay in the same position for about 30 minutes, then just blink out and disappear. i just want to know what this thing is!"],"City":"Kennett"}