{"Region":"New York","Tags":"City","Country":"United States","Weather Factors":"Unknown","divs":["Sighting DetailsAbout 9pm, I was leaving a church meeting,I looked up as I saw an unusual light in the eastern sky, I thought it was most likely a plane I observed a diamond shaped object heading northwest then change direction to northeast, then fade out or disappear behind possible clouds, one minute later I saw another diamond shaped object heading northerly then change to north east both were flying at about 1000 ft up, and meandering slowing, I went to the long island sound to see if I could see anything, thinking perhaps they were just planes and the lights were playing tricks, nothing seen over Long Island sound except the usual small planes that fly around, those fly in a straight line and display running lites and strobes unlike the diamond shaped objects I saw. On my way back from the L.I sound area,on Pulaski rd heading west I looked to my left facing south and saw a bright light,flying in a straight line heading west I thought once again its just a plane, but just to make sure I stopped and waited for it to pass by an opening in the trees, thinking it would just keep flying west as a small plane would. It stopped then headed north east, ive never seen a small plane do that before, no sound. I am used to small and large planes as I live on L.I which is near Kennedy and Laguardia and a few small airports, so im used to all the sights and sounds of many different types of planes and helicopters. Im usually skeptical about these things but open minded about the possibilty of it being real, I dont go looking for these things but these lites really stood out!"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.864701,+-73.365728(47749)&iwloc=A&hl=en\"> mufon case (47749) map </A>","Summary":"Diamond shaped orange glowing object, no sound","City":"Greenlawn","Source":"MUFON","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/47749.html.txt","/var/www/straped/mufon/org/47749.html"],"Viewing Distance":"501 Feet - 1 Mile","Object Features":"None","Latitude":"40.864701","Longitude":"-73.365728","Log Number":"US-05302013-0022","Object Shape":"Diamond, Sphere","Disposition":"Unresolved","Date of the Event":"05/30/2013 12:00 UTC","trends":["There has been one other sighting in Greenlawn","There were no other sightings in Greenlawn on or around May 30th 2013"],"Case Number":"47749","Sighting Duration":"Undisclosed","Date Submitted":"05/30/2013 11:26 UTC"}