{"Longitude":"-75.180806","Summary":"goosebumps weird strange","Date of the Event":"05/30/2013 09:56 UTC","Case Number":"47747","Log Number":"US-05302013-0020","map":"<A HREF = \"http://maps.google.com/maps?q=40.538002,+-75.180806(47747)&iwloc=A&hl=en\"> mufon case (47747) map </A>","Disposition":"Unresolved","Viewing Distance":"Over One Mile","Region":"Pennsylvania","Object Features":"None","Object Flight Path":"Path with directional change","Country":"United States","Sighting Duration":"00:00:30","Tags":"City","Date Submitted":"05/30/2013 10:47 UTC","trends":["There have been no other sightings in Kintnersville","This sighting has been favorited 1 time."],"files":["/var/www/straped/mufon/html2text/47747.html.txt","/var/www/straped/mufon/org/47747.html"],"Latitude":"40.538002","City":"Kintnersville","divs":["Sighting DetailsIt was approx. 9;55 pm EST or so when my fiance and I stepped out on the front porch for a cigarette. Nice night, warm, clear sky. We had both lit up and we saw the same thing up in the sky just over our eye level - a streak of light. Both of us had the same reaction, saying 'what the. . .' out loud. I stood up , stepped off the patio to get another look. It wasn't particularly bright, but it was certainly noticeable. The white lit object seemed \"long\" at first, and quite small, which leads me to believe it was very high up there. Sort of looked like a very fast moving star. However the light was not steady - I don't want to say that it blinked, because it wasn't blinking, but almost as if it was disappearing and reappearing in a different area of the sky. Though as it turned - which it did, several times - you could follow it's projected path and guess where it would reappear. It seemed to circle over us twice or three times and then was gone. I didn't know what to think of the object as I viewed it. I had no explanation. In hindsight the woman thinks it could have been a firefly - fair, but they are typically lit up as yellow and hell, they certainly do not move so fast. I've never seen something move so fast in the night sky."],"Source":"MUFON","Object Shape":"Blimp, Bullet, Missile, Cigar, Cylinder","Weather Factors":"Unknown"}