{"divs":["Sighting DetailsIt was the early morning of December 20th 2012. Closer to 5:30am than 5am. We are often awake this late because My boyfriend works second shift. He and I went outside on the back porch to smoke cigarettes. We have an amazing view of the sky since we are located a few miles outside of any brightly lit town. Almost as soon as we stepped outside I noticed what at first appeared to be a very bright star. Problem was this particular star was far too large and bright and not located where any known star (that we can see from our porch) normally is. The bright white light was located maybe 55 degrees off the horizon in the northwest. I asked him \"what is THAT?\" and he looked curiously at the light and said in a matter of fact tone \"I don't know\" At this time my boyfriend decided to run in the house and get his dads attention. He was in the house no more than 30 seconds when the object started to move. Slowly at first it was just the bright white light looking as though it was decending. Then suddenly the light turns bright red and streaks towards me. It left a red trail behind it as it decended towards the horizon and came at me. Its lowest point on the horizon was approximately 30 degrees before it started climbing back towards 90 degrees when it was directly above me. When I saw it streaking red I started to scream to get my boyfriend to come back outside so he could see it too. By the time he got back outside (maybe a minute spent inside) the craft was visible AS A CRAFT. Both of us knew no one would believe we were seeing a UFO so we took out our phones to try and get a picture of it since it was close and we could see it in great detail. First He tried to takw a picture and when he opened up his camera the entire phone shut off. So I triend to take a picture with my phone and when I unlocked the screen the phone froze, then shut off also. our phones wouldnt turn on until the craft was far out of our sight. It was triangular with beigish orangey lights on each corner angle, with a large white circular light in the bottom middle of the craft. The midle light looked almost like a dome underneath. There was also a blue light on top of the craft. It seemed to slow down dramatically as it got closer to us. It was less than 500 feet above us, maybe 300 feet, it was hard to judge but I saw it very clearly. It didn't make a sound the entire time we saw it, even when it was directly overhead. It flew over the house. We ran around the house to follow it and we lost visual contact as it flew past the trees across the street. When I first saw it I knew nothing we know of on this earth moves like that, is shaped like that, flies like that, or is silent like that. HOWEVER something about the craft seemed very man-made. It was a physical aircraft that me and my boyfriend saw with our own eyes. I don't believe the technology originated here on earth. However I do believe that this craft was built here on earth. I have seen similar craft on you tube videos but who knows whats real or not on you tube. I saw this with my own eyes and my boyfriend was there seeing it with his eyes too."],"Log Number":"US-05302013-0021","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Source":"MUFON","Date Submitted":"05/30/2013 10:59 UTC","files":["/var/www/straped/mufon/html2text/47748.html.txt","/var/www/straped/mufon/org/47748.html"],"Weather Factors":"Unknown","Latitude":"41.264314","City":"LaGrange","Case Number":"47748","Longitude":"-82.157436","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=41.264314,+-82.157436(47748)&iwloc=A&hl=en\"> mufon case (47748) map </A>","Date of the Event":"12/20/2012 12:00 UTC","Summary":"Bright light streaked red towards me, dimmed greatly showing its lights and triangular shape, flew slowly and silently over the house then past the treeline","Object Features":"Wings, Other","Disposition":"Unresolved","Tags":"City","Region":"Ohio","Viewing Distance":"101-500 Feet","trends":["There have been no other sightings in LaGrange","This sighting has never been favorited."],"Country":"United States"}