{"Source":"MUFON","files":["/var/www/straped/mufon/html2text/47752.html.txt","/var/www/straped/mufon/org/47752.html"],"Log Number":"US-05312013-0002","Country":"Mexico","Longitude":"-111.007637","Object Flight Path":"Straight-line path","trends":["There have been no other sightings in Hermosillo","This sighting has never been favorited."],"Disposition":"Unresolved","Object Shape":"Chevron, Star-like, Triangle","City":"Hermosillo","Object Features":"Wings","Sighting Duration":"00:00:10","Case Number":"47752","Date Submitted":"05/31/2013 12:49 UTC","divs":["Sighting DetailsI was flying from Minneapolis, MN to Los Angeles, CA on a Delta plane, around midday on Thursday, May 30. I am not sure, but I believe we were someplace over Arizona when something flew past the plane window. I had been looking out the window at clouds. We were probably at at least 30,000 ft. I noticed another, much smaller object passing our plane, going in the opposite direction. It seemed closer than any other aircraft should safely have been, and was approximately on the same level as our plane, at the same altitude. My first impression was that it was a smaller plane. It looked about the size of a very small jet. However it was a gold metallic color and was a rounded V-shape, like a pudgy plane. The small end of the V was the front. There were no distinct windows, wings or tail but vague shapes of possible wings. It didn't look like any plane I had ever seen before, and I was surprised that was so close to the large jet I was in. Our plane was flying west and this object passed it on the south side and the smaller object was flying east, at a very high rate of speed. I was able to observe it for only about ten seconds before it passed out of my view from the window. I didnt see any other objects or aircraft near it. No lights observed and no emmissions noticed. There was a slight reflection off the metallic gold body. I am sure the pilots would have been able to see this thing if they were looking out their window up front. I was sitting behind the bulkhead, in seat A of the sixth row in the first class section, so not far behind the cockpit. I couldn't hear anyone talking at all. I didn't mention this to anyone. But, it has been on my mind ever since I saw it because I cant come up with any reasonable explanation for what it might have been."],"Viewing Distance":"101-500 Feet","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=29.083427,+-111.007637(47752)&iwloc=A&hl=en\"> mufon case (47752) map </A>","Summary":"I was heading west in a plane at about 30,000 ft. toward LA, when I spotted a bright, gold-colored small flying object moving quickly in the opposite direction","Weather Factors":"Unknown","Date of the Event":"05/30/2013 12:00 UTC","Latitude":"29.083427","Region":"Arizona"}