{"Weather Factors":"Unknown","Summary":"large in length and width has like a spot light on the sides. It moved with out sound even tho it was 100 ft in the air. It move very quickly off in the distance","Tags":"City","Sighting Duration":"00:02:00","Country":"United States","Case Number":"47751","Object Shape":"Diamond","Disposition":"Unresolved","Longitude":"-86.785017","Object Features":"Unknown","Source":"MUFON","Date Submitted":"05/31/2013 12:24 UTC","Log Number":"US-05312013-0001","trends":["There have been 3 other sightings in Cloverdale","There were no other sightings in Cloverdale on or around May 18th 2013"],"Date of the Event":"05/18/2013 11:00 UTC","divs":["Sighting DetailsI was on the bus on the way home sitting in the seat with my friend. I was looking out the window when I saw in the distance 5 lights together. The object move toward the bus what I was thought was it's front approaching the interstate. Then I saw the middle light was brighter and white unlike the others that were orange red and sometimes turn yellow but the middle light was like a spot light looking at the ground below it until it reach the interstate. Then the white light went to orange like the others and what I thought was the front turned to what look like the bottom of it was showing it was then I realized that what I thought was the front was not the front it was the side of the object it started to move east bound on the interstate speeding up as it went but it was still remaining low. I look over real quick to the side and I saw another object like the other one moving toward to my town of Cloverdale as we past by some trees I try to find it again but then I saw it high in the sky until it went so high that it disappeared. I was shocked what I saw it wasn't until the event was over that I realized others saw it too. I don't know how I should feel we always had strange activities with the cell phone towers and the military out here but that was the strangest thing I have ever seen living here."],"Region":"Indiana","Object Flight Path":"Straight-line path","Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=39.516368,+-86.785017(47751)&iwloc=A&hl=en\"> mufon case (47751) map </A>","Latitude":"39.516368","City":"Cloverdale","files":["/var/www/straped/mufon/html2text/47751.html.txt","/var/www/straped/mufon/org/47751.html"]}