{"Object Features":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/47769.html.txt","/var/www/straped/mufon/more/47769_submitter_file1__IMG5582.JPG","/var/www/straped/mufon/more/47769_submitter_file2__IMG5582Circled.jpg","/var/www/straped/mufon/more/47769_submitter_file3__IMG5583Dissapeared.JPG","/var/www/straped/mufon/org/47769.html"],"Summary":"I was taking pictures of a helicopter that suddenly appeared outside my resort. When I checked the pics I found other objects as well.","map":"<A HREF = \"http://maps.google.com/maps?q=34.87349,+-111.75159(47769)&iwloc=A&hl=en\"> mufon case (47769) map </A>","divs":["Sighting DetailsWhile vacationing at the Sedona Summit, I was sitting out on the balcony with my partner when I observed a helicopter positioned right in front of our building. Since I had my camera sitting there (I was reviewing pictures from our hike that day) I started taking a few shots of the helicopter. I did notice that there was something in the picture with the helicopter, but thought that it was just a bird or something. When I put the picture onto my computer, I saw that there were three objects on the photo. I have no idea what this was, but I did find it interresting and just wanted to share it with you. I've attached one with the normal photo and one with the objects circled. You have to actually blow up the photo so that you can see the additional two objects. If you will, also notice that I took another picture immediately and the three objects had just dissapeared. Just something weird and unknown to me."],"Weather Factors":"Unknown","Object Shape":"Unknown","Tags":"City","Latitude":"34.87349","Sighting Duration":"Undisclosed","Log Number":"US-05312013-0019","Object Flight Path":"Unknown","City":"Sedona","Longitude":"-111.75159","Country":"United States","Case Number":"47769","Date Submitted":"05/31/2013 09:33 UTC","Region":"Arizona","Disposition":"Unresolved","trends":["There have been 47 other sightings in Sedona","There were no other sightings in Sedona on or around May 21st 2013","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","Date of the Event":"05/21/2013 05:54 UTC"}