{"Date of the Event":"08/13/1972 12:00 UTC","Longitude":"-77.185435","Source":"MUFON","Country":"United States","Region":"Pennsylvania","Object Flight Path":"Other","Object Features":"Unknown","Date Submitted":"05/31/2013 02:33 UTC","Disposition":"Unresolved","divs":["Sighting DetailsMy wife and I were driving to Reading from Lebanon late night or early morning when she said \"something is moving around up there.\" I didn't see nothing and kept driving and she said \"I'm telling you, something is moving around up there.\" I thought I may have seen something, so I pull the car over, we both get out and were leaning on the front right fender. this thing looked orangish kind of like Aldebaran. It VERY slowly was moving up, down, back forth, maybe 45 seconds, or a minute, and 2-4 minutes since she said something in the car. then it (disappears) in a streak, IN A STREAK, going up and away from us. I report this even though it was so long ago, you can't do much with it, count me among one who knows we are not alone. Obviously, it was not man made, and though it's hard to imagine occupants withstanding the G force, there is technology somewhere that allows very fast travel, and perhaps light speed or better, really don't know, but very very fast indeed, to shoot off in a streak like that, and somehow compenstate for Gs, if occupied, which I would assume it was. we never talked about it, but after it streak off, wife said \"wow\", and I was wowed myself. also ran into a person a year or so later who saw it. He was on a moutaintop 20 to 30 miles from where I was. I heard him telling his story, and we talked and figured we saw the same thing. He was not alone, so there were others who saw it, but I don;t know who they were. Some day, everyone will know."],"trends":["There have been no other sightings in Between Lebanon and Readi","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.206842,+-77.185435(47760)&iwloc=A&hl=en\"> mufon case (47760) map </A>","Sighting Duration":"Undisclosed","Case Number":"47760","Viewing Distance":"Over One Mile","City":"Between Lebanon and Readi","files":["/var/www/straped/mufon/html2text/47760.html.txt","/var/www/straped/mufon/org/47760.html"],"Tags":"City","Summary":"Object moved slowly in zig-zag then shot off in a streak.","Latitude":"41.206842","Weather Factors":"Unknown","Object Shape":"Star-like","Log Number":"US-05312013-0010"}