{"Date of the Event":"05/30/2013 12:00 UTC","Latitude":"40.439994","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was returning via plane from a trip to the midwest, and while in Philadelphia airspace (to the best of my knowledge) I saw an object move west as I was traveling east. It had a slight upward trajectory, and as it approached some dark cloud cover, it stopped. Just stopped and hovered where it was, remaining in the same place relative to the plane I was in. It remained just in front of the cloud cover for the next several minutes while I pondered the event. I have had other sightings, and was thinking about the last one I had, a year ago Memorial Day driving from NYC to Elmira, NY, and wondering if I would see another one. Lo and behold, a few minutes later this object shows up and behaves unlike any known aircraft. After it remained in place for a while, it slowly started to descend through the cloud cover. As it did, it reversed direction and began traveling east, opposite to its original trajectory. As it descended, it disappeared from sight however it left a slit in the cloud cover, much like if you were to draw your finger through icing on a cake - you'd see a trench. That's what I saw."],"Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Path then hovering","Region":"Pennsylvania","City":"Pittsburgh","files":["/var/www/straped/mufon/html2text/47766.html.txt","/var/www/straped/mufon/org/47766.html"],"Date Submitted":"05/31/2013 07:01 UTC","Country":"United States","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=40.439994,+-80.00375(47766)&iwloc=A&hl=en\"> mufon case (47766) map </A>","Source":"MUFON","Weather Factors":"Unknown","Longitude":"-80.00375","Object Shape":"Disc, Oval","Object Features":"Unknown","Log Number":"US-05312013-0016","trends":["There have been 122 other sightings in Pittsburgh","There was one other sighting in Pittsburgh on or around May 30th 2013"],"Case Number":"47766","Summary":"Saw disc move across sky at same elevation of plane, then stopped and hovered"}