{"trends":["There have been 2 other sightings in Bay St Louis","There were no other sightings in Bay St Louis on or around June 15th 1982","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/4777.html.txt","/var/www/straped/mufon/more/4777_submitter_file1__CRW_3981j_RJ.jpg","/var/www/straped/mufon/org/4777.html"],"Date Submitted":"06/15/1982 11:30 UTC","Region":"Mississippi","Sighting Duration":"00:00:15","Object Flight Path":"Straight-line path","Disposition":"Unknown","Longitude":"-89.333322","Country":"United States","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=30.305326,+-89.333322(4777)&iwloc=A&hl=en\"> mufon case (4777) map </A>","Object Features":"None","Latitude":"30.305326","Date of the Event":"06/15/1982 11:30 UTC","Object Shape":"Oval","Viewing Distance":"101-500 Feet","Log Number":"US-05132006-0001","City":"Bay St Louis","Weather Factors":"None","Source":"MUFON","Case Number":"4777","Summary":"A glowing, indistinct lime green oval as big as the moon silently moved across the night sky.","divs":["Sighting Details I was outside walking to the shed which is just behind my house at 11:30 PM one summer evening in 1982 when I happened to look up towards the full moon. I was stunned to see a large glowing lime green oval moving slowly, silently, across the sky. It was already halfway across the sky when I first saw it. The object appeared to be moving at a constant speed angling in a downward direction. The entire object glowed the same color and its edges were indistinct with a green glow. It gave off no other light than this. There was no \"tail\". It appeared to be close, no more than 200-300 hundreds yard away and maybe 500 feet in the air. I stood and watched it move across the open sky and behind a few pine branches. I watched the object for about 15 seconds before it went out of sight behind a pecan tree, still on a downward direction never having varied its speed. The object stayed the same color and size for the entire sighting. When I lost view of it behind the tree I thought it might be headed down into the pasture behind the shed. I wanted to go see, but first I ran back into the house and grabbed my M1 carbine and put in the 30 round clip. I shook my sleeping wife and excitedly told her what I had seen and that I was going out to see where it was. Of course, she didn't even wake up. So I went out the back door and headed out towards the pasture. I saw nothing, found nothing. After awhile I calmed down although I stayed outside for about an hour looking up into the sky. I don't really know what I would have done had this object been hanging around in the pasture. Might not have had the guts to fire on it. And I remain struck by the fact that had I not been outside and looking up in those few seconds, this thing would passed silently by. Now the object was so large and bright and easy to see that I have always been able to remember just what it looked like and how it moved. So that anyone can see what I saw that night I have drawn the object onto a digital photograph that I recently took of the sky, complete with the full moon and some pine trees just about like they were the night of the sighting. This photo is a pretty good representation of what I saw in the sky that night. The red dashes indicate the object's direction. The color and luminosity of the object is fairly accurate."]}