{"Country":"United States","Object Shape":"Cone","trends":["There have been 36 other sightings in Henderson","There were no other sightings in Henderson on or around May 30th 2013"],"files":["/var/www/straped/mufon/html2text/47772.html.txt","/var/www/straped/mufon/org/47772.html"],"Tags":"City","City":"Henderson","Longitude":"-114.935238","divs":["Sighting DetailsI was sitting in the backyard with my dog, enjoying the evening. I was seated and just looking around the sky as I always do when I suddenly saw what I first thought was a red flare in the sky. It wasn't a flare because it kept glowing and glided through the sky with little effort and never changer color. I went and got my binoculars and upon closer view, the shape was was like an ice cream cone and had 3 rows of lights. The first row had 3 red lights, the second row had 2 red lights and the bottom row had one red light. They all burned with the same brightness. At no time did it have blinking lights like the other aircraft in the area. I live very close to the landing flight path to McCarren Airport. So I thought that was cool. Something different than I have seen before, but I have to say that I have seen over 50 objects that just didn't make sense in the night sky over the last 20 years. Thinking that was it, I sat down again and then another appeared in the same region and followed the same path as the other. All in all there were 8 objects total, separated by about 1-2 minutes, (first seen and then not visable). It was very strange and I have NEVER seen this before. Any help would be appreciated. Similar sightings?? It was almost scary, but thrilling at the same time!"],"Date Submitted":"05/31/2013 11:46 UTC","Region":"Nevada","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=36.011262,+-114.935238(47772)&iwloc=A&hl=en\"> mufon case (47772) map </A>","Viewing Distance":"Over One Mile","Latitude":"36.011262","Case Number":"47772","Date of the Event":"05/30/2013 08:40 UTC","Sighting Duration":"Undisclosed","Object Features":"Other","Disposition":"Unresolved","Summary":"Eight Objects Viewed Over Henderson, NV","Source":"MUFON","Log Number":"US-05312013-0021"}