{"Latitude":"34.402875","Disposition":"Unresolved","Source":"MUFON","Country":"United States","Object Flight Path":"Stationary,Straight-line path","Region":"California","divs":["Sighting Details 1989. I had been working for a contractor on his home just southwest of the Santa Barbara Zoo. I had been invited to eat dinner again but declined and started home. I was feeling tired and thought extra terrestrials,so popular should intervene and aid our advancement. As I walked passed the zoo I thought of what a zoo this is and did not think that funny. Looked into the west and said first to a couple stars that I had somewhat compared in brightness it's got to get better than this...and then I became focused on one specific (UFO) star and asked why can't you do something? You could have helped, done somethi.. you won't help.. figur..Tightening my teeth as if preparing to fight.. like I was going to attack that star. The star (UFO) went from stationary above Santa Babara N 32' - 70' from west horizon estimated altitude 60000 ft. directly to the south and in 7-8 seconds beyond my eyesight. During the late 80's and ealy 90's there were a few multiple sightings announced on the local radio stations. I remember the announcer DJ saying 'what a great way to conceal.. appear to be a star.' I have seen other UFO's, most recent in 2006, while driving towards Arizona to make a delivery as usual, lights crossed over interstate 10 near the California - Arizona border. Other truck drivers on CB radio had commented, \"did you see...\" and I said yes at the same tme as another driver cued in. We all saw it. Drove on. I have a first hand knowledge there are more than one species of extra terrestrials.So many horrible events TO SO MANY and so wide spread its better to speak about it in the PROPER AUDIENCE. I HAVE BEGUN publishing my videos on youtube and facebook. I have made copies to send to NASA,GHCC JPL, NRL Satellite, Guiness Book of World Records Application submitted for longest tractor beam study."],"Summary":"Returning home from work near SB Zoo. Looked up and said why can't you do something? Rage of EXCUSES F...EXCUSES. Then it went south 0 to mid southern horizon in 4-5 seconds","City":"Santa Barbara","Tags":"City","Object Shape":"Sphere","Case Number":"47779","Longitude":"-119.727531","trends":["There have been 20 other sightings in Santa Barbara","There were no other sightings in Santa Barbara on or around June 3rd 1990"],"Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Date Submitted":"06/01/2013 12:31 UTC","Sighting Duration":"Undisclosed","Object Features":"None","files":["/var/www/straped/mufon/html2text/47779.html.txt","/var/www/straped/mufon/org/47779.html"],"Log Number":"US-06012013-0007","Date of the Event":"06/03/1990 07:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.402875,+-119.727531(47779)&iwloc=A&hl=en\"> mufon case (47779) map </A>"}