{"Sighting Duration":"Undisclosed","Log Number":"CA-06012013-0001","City":"Greater Sudbury","Object Features":"Unknown","Tags":"City","Latitude":"46.650154","Weather Factors":"Unknown","trends":["There have been 12 other sightings in Greater Sudbury","There were no other sightings in Greater Sudbury on or around May 31st 2013"],"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/47773.html.txt","/var/www/straped/mufon/org/47773.html"],"Source":"MUFON","Case Number":"47773","Date of the Event":"05/31/2013 11:10 UTC","Region":"Ontario","Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","divs":["Sighting DetailsI had stepped outside to star gaze as I frequently do. As I stepped outside I made my usual quick inspection of the yard for bears (which is a must in my area) and proceeded towards my deck where I do most of star gazing. As I approached the deck I was looking up at the sky where I noticed an odd object in the sky in my immediate field of vision above the tree line. As it was consistent in it's glow I could tell it was not a aeroplane as it did not have the distinctive strobe lights and appeared larger than they do. As well, I soon realized there were actually three orbs flying in inline and their distance did not change between the three. I also ruled out meteors as the initial sighting began at 43 degrees of elevation and 182 degrees south and ended at 55 degrees elevation and 152 degrees south east. Another strange thing that happened at approximately 162 degrees was that the leading and lagging orbs both disappeared leaving the middle orb to continue its apparent upward trajectory for the final 10 degrees before it too simply disappeared. When I say disappeared I mean they basically just stopped being there. No fade, just like turning off a light bulb. As well, I had a clear and unobstructed view of the sky above our tree line. I was able to call two witnesses out of the house, but they were only able to witness the final orb...at which one of my witnesses explained how he had seen something similar in the summer of 2011 around the same time but in another city. It was exciting to see, as most of my gazing is uneventful. It was nice to see something that peaks curiosity."],"Date Submitted":"06/01/2013 12:55 UTC","Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=46.650154,+-81.002451(47773)&iwloc=A&hl=en\"> mufon case (47773) map </A>","Country":"Canada","Summary":"3 consistent orange with yellow cantered orbs traveling inline with unwavering distance between them.","Longitude":"-81.002451"}