{"Source":"MUFON","Date of the Event":"05/31/2013 09:30 UTC","Country":"United States","Region":"Maryland","Sighting Duration":"00:15:00","Viewing Distance":"Over One Mile","City":"Perry Hall","Object Shape":"Circle, Sphere, Unknown","Object Flight Path":"Straight-line path,Path then hovering","Object Features":"None","Summary":"Approx. 8 reddish glowing orbs travelled in seamless line, made diamond pattern, then vanished","map":"<A HREF = \"http://maps.google.com/maps?q=39.445521,+-76.455447(47770)&iwloc=A&hl=en\"> mufon case (47770) map </A>","divs":["Sighting DetailsApprox. 9:25-9:30 at night - at home, watching TV with Mom, when we hear Dad call, \"Strange lights outside!\" Immediately run out to see reddish orange, glowing orbs moving in a seamless, straight line, appearing over house line from SE. Four moved out first and continued in their direction, moved further away, then paused and formed a diamond shape. At this point I finally thought to go back in and grab my phone. Was able to record four more orbs moving into sight at same constant speed from same direction. Looked back to where original diamond had formed and it was gone. Mom ran back in house to grab binoculars - observed through them, they looked just like bright, orange, glowing orbs. Four orbs were moving steadily away to same place as previous four had made diamond formation. Made same diamond formation (too far away for my phone camera to pick up) and then disappeared. Did NOT move away - simply vanished. No sound made from them throughout. (In one video attached you can see two seem to vanish.)"],"Longitude":"-76.455447","Log Number":"US-05312013-0020","Disposition":"Unresolved","trends":["There has been one other sighting in Perry Hall","There were no other sightings in Perry Hall on or around May 31st 2013"],"files":["/var/www/straped/mufon/html2text/47770.html.txt","/var/www/straped/mufon/org/47770.html"],"Tags":"City","Case Number":"47770","Date Submitted":"05/31/2013 10:12 UTC","Latitude":"39.445521","Weather Factors":"Unknown"}