{"Viewing Distance":"Unknown","Log Number":"US-06012013-0013","Sighting Duration":"Undisclosed","divs":["Sighting DetailsOver the past few weeks I havebeen studying and practicing the CE-5 techniquesdevribled by Dr. Steven Greer. I have had very interesting results, but this week I am in rural GA where there is no light pollution or very much air traffic, and during my contact effirts I had several fly-ovets by star-like objects. First, the objects appeared and crossed part of the sky only to fade away, onceappearing to possibly move at a path away from the surface of the Earth. Later, there were four fly-overs by other star-like objects, silent, and then the aircraft started to show up. The planes flew as if to intercept the objects, on intercept courses, but they never caug At 5am, a plane made a very low flyover of my location. It was at the time I felt as thpugh there was something in the pasture behind my lication. And Iheard tones and a pulsing sound, almost like the sound you hear near a transformer. I then had a feeling like there was acraft inthe pasture but \"they\" felt it unsafe and unwise to \"fully materialise.\" ...whatever that means... There are four dogs here at this property where I am staying, and I feel its worth mentioning they becane very excited when it \"felt\" like something was in the pasture. This experience validated the realities of some of what Ive read from CSETI and I believe that further attempts will be benefitted by the use of some equipment to get objective data - suchas a camera with passive night vision and other recording devices for data collection. The presence of the aircraft makes me nervous though, as while the entire experience could have been cooincidence, it also could imply that there were others aware of my attempts at contact and of the ET response. That worries me."],"Tags":"City","Date of the Event":"06/01/2013 12:00 UTC","Object Features":"Unknown","Country":"United States","Case Number":"47785","Object Shape":"Star-like","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.072386,+-84.232688(47785)&iwloc=A&hl=en\"> mufon case (47785) map </A>","Source":"MUFON","Summary":"Several Alleged Satellites with Airplanes In pursuit","Region":"Georgia","Date Submitted":"06/01/2013 08:06 UTC","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/47785.html.txt","/var/www/straped/mufon/org/47785.html"],"Longitude":"-84.232688","Latitude":"32.072386","City":"Americus","Disposition":"Unresolved","trends":["There have been no other sightings in Americus","This sighting has never been favorited."]}