{"divs":["Sighting DetailsI was walking with my friend after visiting a local chip shop, we were talking and I looked up into the sky, as I often did because I was always seeing something interesting. When I first so it I knew straight away it was a flying saucer. I remember thinking my reaction was calm as if it was a normal thing, I said \"Look at that a flying saucer\". My friend couldn't beleive it and started jumping around in excitment, I observed the craft, which was orval shaped with a large viewing window at the front, this was amzing to me as I could clearly see people inside looking out of the window thats when my heart started racing. We watched as the craft flew slowly over us as if it had all the time in the world. There was no light from the craft maybe because it was just starting to go dark? The outer craft was a silver colour. My friend and I then ran up the hill to the working mens club that is where our family was, I know I was excited but I also knew they wouldn't beleive us and recall saying to my friend they wouldn't as she burst into the room telling her mum \"we've just seen a flying saucer\". After we had told of our sighting I think we just sat down and drank our cola. You ask \"how did you lose sight of the object\" well all I can tell you we started running back to the club after watching it fly over us towards another housing astate so I guess it carried on going at the same pace? We can't have been the only ones to see it? As the craft was below the clouds and very clear to see."],"Region":"England","Case Number":"47780","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Latitude":"53.390229","map":"<A HREF = \"http://maps.google.com/maps?q=53.390229,+-1.468095(47780)&iwloc=A&hl=en\"> mufon case (47780) map </A>","Summary":"Craft slowly flying above roof tops sighted by two children during the late evening.","Weather Factors":"Unknown","Longitude":"-1.468095","Log Number":"GB-06012013-0008","Source":"MUFON","Disposition":"Unresolved","Sighting Duration":"00:10:00","Object Shape":"Oval","files":["/var/www/straped/mufon/html2text/47780.html.txt","/var/www/straped/mufon/org/47780.html"],"Country":"United Kingdom","Date Submitted":"06/01/2013 04:29 UTC","Date of the Event":"07/17/1986 08:00 UTC","City":"Sheffield","trends":["There have been 11 other sightings in Sheffield","There were no other sightings in Sheffield on or around July 17th 1986"],"Object Flight Path":"Straight-line path","Object Features":"Dome, Window(s)"}