{"Log Number":"US-06012013-0014","Sighting Duration":"Undisclosed","Country":"United States","Weather Factors":"Unknown","Region":"Colorado","divs":["Sighting Details1. Sitting on my deck relaxing 2. Just looking at the mountains enjoying the view when they appeared in the 3 . I thought maybe a plane pulling a banner because the object near it was red 4 . The initial object seemed to be moving at a pretty good pace at first, but then it slowed and stopped. The red object trailing it continued to move around it but didn't go to far from it at first. Soon I saw two more shiny objects approach from the same direction, stop and hover similarly to the first. At one point all four objects appeared to be fairly close together. The initial object and the red object drifted off to the north. Shortly thereafter, the red object appeared next to one of the other shiny objects. Eventually, they also drifted off to the north. 5. Curiosity. I might be imagining this, but the birds in the area seemed to be acting strangely at the time the objects were in view 6. Drifted out of my view"],"Latitude":"39.557008","Object Flight Path":"Path then hovering","City":"Glenwood Springs","Date of the Event":"06/01/2013 05:15 UTC","files":["/var/www/straped/mufon/html2text/47786.html.txt","/var/www/straped/mufon/org/47786.html"],"trends":["There have been 4 other sightings in Glenwood Springs","There were no other sightings in Glenwood Springs on or around June 1st 2013"],"Summary":"4 objects approached from the east. First saw one shiny and one red that appeared to be traveling together. Shortly two other shiny ones appeared.","Case Number":"47786","Object Features":"None","Disposition":"Unresolved","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.557008,+-107.322306(47786)&iwloc=A&hl=en\"> mufon case (47786) map </A>","Object Shape":"Boomerang, Sphere","Viewing Distance":"21-100 Feet, Over 1 Mile","Longitude":"-107.322306","Tags":"City","Date Submitted":"06/01/2013 08:39 UTC"}