{"Date of the Event":"06/01/2013 10:15 UTC","Log Number":"US-06012013-0021","divs":["Sighting DetailsMy wife was having a smoke outside on our porch around 10:10 pm on 6-1-13 saint clair pa . She saw two large bright red- orange -white objects coming over the berma she was facing east and both objects were moving in a north western direction. She called me out and I seen them both. One looked like it was higher up then the other one .Then they both stopped at the same time and just stayed there for about one and a half minutes. Then the one that was higher than the other one either the lights dimmed real fast and went out or shot away very fast in a north direction . A few seconds later and the other one did the same thing.Also about two months ago we both saw a similar single large object at night this time a pure red in color. That one was going in a south western direction from our back porch. None of these objects have any kind of a sound coming from them. We also have a large triangular aircraft that flies around at night in this area also I personally have seen it twice . Its a large craft and sounds just like jet engines. It has a light in each corner and one in the middle of it. Just so everyone reading this knows that we have alot of military aircraft flying in this area all the time so I have no clue as to what is going on. I just know that alot of strange things are flying in our sky day and night.We both feel that it is time that something is said about all of this activity that we witness. And just for the record, my wife would always come in from having her cigarette on our porch and tell me about all of these strange things she would see in the sky and I would say something like -yeah sure your watching to many of those ufo shows on tv and laugh. Well I'm not laughing anymore."],"Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Features":"Unknown","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile, Unknown","Latitude":"40.719771","Object Flight Path":"Path then hovering","Summary":"wife and I seen two large bright red- orange -white objects moving together in night sky","Date Submitted":"06/01/2013 11:50 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.719771,+-76.189744(47793)&iwloc=A&hl=en\"> mufon case (47793) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/47793.html.txt","/var/www/straped/mufon/org/47793.html"],"Longitude":"-76.189744","City":"St. Clair","Object Shape":"Oval","Country":"United States","Source":"MUFON","Case Number":"47793","Region":"Pennsylvania","trends":["There have been no other sightings in St. Clair","This sighting has been favorited 1 time."]}