{"Log Number":"US-06022013-0004","trends":[],"Object Flight Path":"N/A","Case Number":"47798","map":"<A HREF = \"http://maps.google.com/maps?q=19.900596,+-155.579172(47798)&iwloc=A&hl=en\"> mufon case (47798) map </A>","City":"Undisclosed","Country":"United States","Weather Factors":"Unknown","Date of the Event":"10/02/2008 11:45 UTC","Date Submitted":"06/02/2013 01:03 UTC","Viewing Distance":"20 Feet or Less","Source":"MUFON","Object Shape":"Flash","Tags":"City","Sighting Duration":"02:12:07","Disposition":"Unresolved","Region":"Hawaii","Summary":"Paralyzed while watching TV in living room","divs":["Sighting DetailsI was sitting in my living room watching the Daily Show with Jon Stewart. It was a Wednesday night on Oct 2nd 2008 at around 11pm. My wife was lying next to me on the sofa sleeping. The next thing I remember was waking up to myself breathing in and out very deeply and trying to force my eyes open. As I did so, I noticed the light I had on in the kitchen was off and the light in the dining room was on. As I was trying to force my eyes open I noticed two beings standing directly in front of me, but I was too paralyzed to look at their faces. I could only see the tops of their heads. From the height of my TV on its stand, I could tell they stood exactly 4ft tall. I wear glasses, but in this state, I could see perfectly clear. I could see light emitting from the top of their heads in a wavy kind of way and to the right. The beings were snow white in color and their heads appeared very shiny. I was very afraid beyond any fear I have ever felt before in my life. As soon as I blinked, everything was back to normal. The TV was still on, but the show was over. I immediately woke my wife up and told her about what I had experienced. She is a very light sleeper and for her to not wake up from the noise I was making surprised me. I heard two aircraft moving at an extremely rapid speed just above our house fast enough to make the house rattle from its proximity at around 2am. Since that day and still today, I've noticed a small hole on the tip of my right thumb that will heal and return. Sometimes it would bleed in the mornings and it has yet to go away."],"Object Features":"Other","Latitude":"19.900596","Longitude":"-155.579172","files":["/var/www/straped/mufon/html2text/47798.html.txt","/var/www/straped/mufon/org/47798.html"]}