{"Sighting Duration":"00:05:05","Weather Factors":"Unknown","divs":["Sighting DetailsI was living in Tulsa Ok, and I was about 12 yrs old at the time. I was living in an apartment complex and was riding my bicycle to the office where I would normally check the mail. For some reason I could not understand, I had a feeling to look almost directly above my head to the sky. There were trees around me, but I could see the object very clearly. I cannot remember the exact time frame, but I know it was either spring or summer when I witnessed this. I could not comprehend what I was looking at. Nothing could make any sense in my mind as to what the object was or could be. It was a perfect sphere shaped object that sat without any motion whatsoever in the sky and it was reflective as if a mirror could be made into a sphere. The sculpture in Chicago of the bean shaped reflective surface would best describe it's appearance. I didn't feel anything other that I kept telling myself that I need to watch this and not move. For some reason, as I was sitting on my bike, I had moved forward and as I did, a tree branch blocked my view of the object, and it had disappeared from my view. At the time my younger brother was with me and I told him to look up because he would see a UFO. I'm not sure what made me say this, but I told him that. He witnessed the object move at the same time the tree branch had blocked my view. He told me that it shot to the right at a speed immeasurable to the human eye."],"Longitude":"-97.089787","Country":"United States","Case Number":"47795","Tags":"City","Object Features":"None","Date Submitted":"06/02/2013 12:06 UTC","Log Number":"US-06022013-0001","Object Shape":"Sphere","Date of the Event":"04/15/1993 12:00 UTC","Source":"MUFON","trends":[],"City":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.015892,+-97.089787(47795)&iwloc=A&hl=en\"> mufon case (47795) map </A>","Region":"Oklahoma","files":["/var/www/straped/mufon/html2text/47795.html.txt","/var/www/straped/mufon/org/47795.html"],"Latitude":"35.015892","Disposition":"Unresolved","Object Flight Path":"Stationary","Summary":"Silver spherical object hovering in sky","Viewing Distance":"501 Feet - 1 Mile"}