{"files":["/var/www/straped/mufon/html2text/47799.html.txt","/var/www/straped/mufon/org/47799.html"],"trends":["There have been no other sightings in Buffalo","This sighting has never been favorited."],"Object Features":"Unknown","Date of the Event":"05/31/2013 12:00 UTC","Tags":"City","Log Number":"US-06022013-0005","Viewing Distance":"Over 1 Mile, N/A","Disposition":"Unresolved","Weather Factors":"Unknown","Case Number":"47799","map":"<A HREF = \"http://maps.google.com/maps?q=45.178506,+-93.858199(47799)&iwloc=A&hl=en\"> mufon case (47799) map </A>","Country":"United States","Object Shape":"Circle, Flash, Star-like, Other","Sighting Duration":"Undisclosed","Summary":"bright white lights start out size of a star .","City":"Buffalo","Date Submitted":"06/02/2013 01:07 UTC","Latitude":"45.178506","Longitude":"-93.858199","Source":"MUFON","divs":["Sighting DetailsI was driving home coming into Buffalo on co35 looking at a flickerin white star then it became 2star size of a aspirin Northwest looking at them blowing up flickeringbig 5, 6 seconds went back to normal star size floated north moves like a satellite if you ever seen one they disappears cause it gets really small as they travel that's what these do. 23rd was a Thursday night almost midnight I experienced the same thing but I was at home got home from work I was on the deck there was four of them 1 Street West blowing up all big like an aspirin may be bigger all big for 5 seconds got small star move north faded 5 ,10 seconds later same thing but right above me like right by the big dipper blown up big in white for 5,6 seconds shriveled to the normal star size move towards the north moving faded disappeared 10-15 seconds later another one towards the south west blowing up all aspirin sizebig and white5,6 sec went to normal star size and faded away 10-15 seconds later correctly West were the first one i saw,normal star size blown up big white kind of flickering 5, 6 sec then went back to regular star size move slowly faded what I thought at first was a helicopter but obviously it was not no sound was a full moon that night but on the 31st fri night it was dark and storm comingsouthwest what are those I see more what are these I was in Coon Rapids on the 6th10th that's when I seen the first ones its always more than one .. only one person I know seen them hope there's more people coming to crazy.last couple years it was orange colored orbs last couple weeks I've seening white white ones. and its scary cause I feel like I'm being watched and I look up and then I experience this. something going on up there."],"Region":"Minnesota","Object Flight Path":"Straight-line path"}