{"Weather Factors":"Unknown","trends":["There have been no other sightings in Amesbury","This sighting has never been favorited."],"Summary":"Lights in formation disappearing the reappearing","files":["/var/www/straped/mufon/html2text/47806.html.txt","/var/www/straped/mufon/org/47806.html"],"Sighting Duration":"00:02:00","Date Submitted":"06/02/2013 02:49 UTC","Object Features":"None","Source":"MUFON","Object Shape":"Star-like","Date of the Event":"05/30/2013 08:15 UTC","Object Flight Path":"Stationary","Latitude":"51.158727","Region":"England","Longitude":"-1.759893","map":"<A HREF = \"http://maps.google.com/maps?q=51.158727,+-1.759893(47806)&iwloc=A&hl=en\"> mufon case (47806) map </A>","City":"Amesbury","Country":"United Kingdom","Disposition":"Unresolved","Log Number":"GB-06022013-0012","Case Number":"47806","divs":["Sighting DetailsI was travelling along the A345 from Salisbury and was approaching Amesbury. I noticed 6 (8 in total) very bright lights in the sky at my 10 o'clock position. As it was only approx. 8:15pm the light had only just started to fade as it's May. 4 of the lights were in an approximate horizontal formation rising slightly from left to right. the 5th light was below the 4th and the 6th light was to the right between lights 4 & 5 creating a triangle. The brightness was quite intense and seemed much brighter that aircraft landing lights. Over the space of about 30 seconds the lights went out in sequence from 1 to 4. Then after a short gap light 6 went out. When the lights went out there was nothing visible, I was expecting to see an aircraft but there was nothing. At this point I assumed maybe it was flares as Boscombe Down was a few miles away to my right. Light 5 stayed lit when lights 7 & 8 appeared in sequence to the right of light 5. These only remained for about 5 seconds and disappeared again 8 then 7. This left light 5 on its own again. I was finally able to stop in a bus stop (I'm driving a lorry). By the time I'd run over to a gate (There was foliage blocking my view) light 5 had finally disappeared. If I'd have thought about it I would have tried and video the event on my phone whilst driving although a bit risky. As I was driving a lorry I had a higher vantage point compare to the cars and had a fairly continuous view of the lights with the exception of a few trees."],"Viewing Distance":"Over One Mile","Tags":"City"}