{"Sighting Duration":"00:02:00","Log Number":"US-06032013-0002","Case Number":"47815","files":["/var/www/straped/mufon/html2text/47815.html.txt","/var/www/straped/mufon/org/47815.html"],"Summary":"First object looked like a satellite, but changed direction and speed. Second object may have been satellite, it had straight path and constant speed.","Object Flight Path":"Straight-line path,Path with directional change","divs":["Sighting DetailsOn June 1, 2013 I was out walking the dog and noticed how clear the sky was, so was looking up at the stars. It was sometime between 10:20 and 10:30 PM when I saw what I thought to be a satellite moving across the sky. When I first noticed it, I was looking NW at about 80 degrees from the horizon. It was bluish white in color with the brightness of a dim star, moving at a constant speed from north toward south. There was no evidence of any flashing lights such as one would see coming from a plane, hence my assumption it was a satellite. After a few seconds, it dimmed as satellites will typically do, but after losing sight of it for only a second, I was slightly surprised to see it brighten back to its original brightness. It was still moving straight at the same speed and along the same path as before. I was then even more surprised when I noticed it started to curve to the west, and then accelerate rapidly to the speed of a shooting star as it finished its turn westward. It faded quickly as it accelerated westward. The sighting of this object occurred within a span of about 30 to 45 seconds. I was still looking to the west where the first object disappeared, at about 60 degrees from the horizon, when 5 to 10 seconds later I noticed another moving object that also looked like a satellite, with the same color and brightness of a dim star. This object was slightly to the north of where the first object had disappeared and was moving west to east, at a constant speed typical of a satellite. It is my assumption that this is not the same object as the first one. I would have thought this was just a satellite if it hadn't been for the movement of the first object I had just witnessed. I watched the second object for one to two minutes. It passed overhead and stayed on a straight path at a constant speed for the duration, then dimmed and faded from sight at about 45 degrees from the horizon looking east. This second object was not remarkable and acted exactly like a satellite, but because of the first object I figure it is worth reporting. I continued walking the dog and looking at the skies for about 20 to 25 more minutes, but saw nothing else unusual. There were several planes passing during this time, with their telltale blinking lights, but no other satellite or UFO sightings."],"Weather Factors":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=35.757411,+-78.91625(47815)&iwloc=A&hl=en\"> mufon case (47815) map </A>","City":"Apex","Disposition":"Unresolved","Object Features":"Unknown","Date Submitted":"06/03/2013 12:23 UTC","trends":["There have been 3 other sightings in Apex","There were no other sightings in Apex on or around June 1st 2013"],"Region":"North Carolina","Object Shape":"Star-like","Longitude":"-78.91625","Viewing Distance":"Over 1 Mile, Unknown","Latitude":"35.757411","Date of the Event":"06/01/2013 10:20 UTC","Tags":"City","Source":"MUFON"}