{"Summary":"Glowing orange fireball like object seen in sky","Sighting Duration":"00:03:00","Date Submitted":"06/03/2013 01:22 UTC","Log Number":"US-06032013-0003","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/47816.html.txt","/var/www/straped/mufon/org/47816.html"],"Object Features":"None","Latitude":"41.985223","Object Shape":"Circle, Fireball, Sphere, Star-like","Region":"Illinois","Object Flight Path":"Path with directional change","Longitude":"-88.685257","Country":"United States","trends":["There have been 2 other sightings in Sycamore","There were no other sightings in Sycamore on or around May 31st 2013"],"Disposition":"Unresolved","Case Number":"47816","Date of the Event":"05/31/2013 08:40 UTC","Tags":"City","City":"Sycamore","Source":"MUFON","divs":["Sighting DetailsMy boyfriend and I were driving north on S. Main St. at around 8:45pm on May 13th, 2013. At first, I thought it was an orange street lamp flickering between the trees. Trees line the road mostly, obscuring the view of the sky. However, when we could clearly see the sky, I noticed it was much farther away and high in the sky. My boyfriend saw it as well. We drove slowly to keep watching it. It appeared to be like a fireball. It descended slowly then leveled off and traveled east. The path was not very long, and it did not move much in the sky. From our distance, it only looked like it moved a few inches total (it did not move across the sky, but slowly in a similar area.) At first, we thought it might be something coming into the atmosphere (some sort of meteor because it appeared to be on fire, though there was not much of a tail.) It was falling, but then it stopped descending and started to move east (or to the right.) That was when we started to question what it was even more. We were not frightened or uneasy, but excited and curious. We reached the small downtown area where there was a lot of streetlights, so it was becoming more difficult to see. I headed west on IL 64 to try and head to where there was less light and more open space. The object was now mostly behind us in the sky, so we had trouble seeing it again. Once we reached Peace Rd, I turned right (headed more north again, so it would be east of us, or to our right) and we were unable to find it again in the sky. We proceeded to our destination in town and back home within the next 30 minutes and kept our eyes out for it, but never saw it again."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.985223,+-88.685257(47816)&iwloc=A&hl=en\"> mufon case (47816) map </A>","Weather Factors":"Unknown"}