{"trends":["There have been 15 other sightings in Doraville","There were no other sightings in Doraville on or around June 2nd 2013"],"Date of the Event":"06/02/2013 04:05 UTC","divs":["Sighting DetailsMy girlfriend, her two daughters ages 18 and 7 and myself, had just gotten back I'm the road after pulling over momentarily to shelter ourselves during a very violent thunderstorm. We were then driving south on I85 South and entering I285 East. When I happen to glance to my left, right above the treeline, I noticed an extremely brilliant light. At first I thought that it was a spotlight of some sort, either from a plane or a helicopter. But then I realized that I was unable to see any sort of craft associated with this light. Not to mention that the light was very stable, almost as if it were affixed to a pole or something. So I pointed out the window and told everyone to look! At that time everyone just looked and remained silent for about 5 seconds. Then my girlfriend said maybe it's an airplane or a stadium light, I then replied if so where is the airplane and since when do they have stadium lights that are posted 3,000 feet in the air? As we pondered additional reasons for this phenomenon, we then found the treeline extending high enough to temporarily block our view of the light for maybe 2-4 seconds. After passing that brief portion of extended treeline, the light was no longer there, we looked in every direction possible from our vantage point. It was simply gone. The next thing I did notice however was some sort of small airplane which appeared to be making very abrupt and exaggerated maneuvers, I do not know if this is because of the light or due to the weather, but I can't help but think that perhaps the two incidences are related."],"Object Features":"None","City":"Doraville","Summary":"it looked like a star in the middle of a storm cloud.","Longitude":"-84.274356","Latitude":"33.902798","Sighting Duration":"00:00:45","Tags":"City","Source":"MUFON","Object Shape":"Sphere","Date Submitted":"06/02/2013 11:56 UTC","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Object Flight Path":"Stationary","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=33.902798,+-84.274356(47813)&iwloc=A&hl=en\"> mufon case (47813) map </A>","Case Number":"47813","Log Number":"US-06022013-0019","files":["/var/www/straped/mufon/html2text/47813.html.txt","/var/www/straped/mufon/org/47813.html"],"Country":"United States","Region":"Georgia"}