{"Latitude":"41.563122","Sighting Duration":"Undisclosed","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=41.563122,+-73.050296(47825)&iwloc=A&hl=en\"> mufon case (47825) map </A>","Object Features":"Unknown","Summary":"Same Orbs that I have watched from Short Beach in Stratford CT over LI Sound","Source":"MUFON","Tags":"City","Weather Factors":"Unknown","trends":["There have been 15 other sightings in Waterbury","There were no other sightings in Waterbury on or around June 1st 2013"],"Object Flight Path":"Stationary","Longitude":"-73.050296","divs":["sighting detailsi have seen many ufo,s so im always looking in the sky at nite. 4:00 am could not sleep went to have a smoke. looked up in the sky towards waterbury, ct and saw the orb. as always i waited to watch it fly over assuming it was a planes headlight. after it did not move for 20 mins went to get the camera. as usual batterys went dead. waited another 5 mins to make sure it was still not a plane before going back inside to get the camcorder. woke my wife up told her to go look. she came back in and said those are the same orbs we always see all over ct. by the time i got the camcorder and went outside the orb was gone. you can check this link out also. this is a report i made in 2008. [link moved to fi section\\cms\\tg] sorry mufon but i believe you people r part of the us government. i have 3 kids and a mortgage and dont have time to run to my computer every time i see a ufo. the orange orbs that pulsate a rainbow plasma in the center are consistently in the skys over ct. i have seen silver orbs like pinballs in the clouds in the daytime and the huge ship i saw in 2008. i have many images and videos but also many hobbies. it is so obvious that these orbs are constantly in the skys over ct so why will you people not admit to them. i have also experienced one close up but do you really think im going to tell people? they think its crazy. i was also followed by a craft 2 years ago around 6:00 in the morning. im to lazy to type this crap so if you ever want to see my images or interview me it fine. i dont want to be on tv. i do have lots of evidence but like i said i am lazy. just so you people know that prospect ct has tons of activity at nite. all kinds of jets, choppers, planes lots of military. im also now convinced that ufo and paranormal r connected."],"Case Number":"47825","Country":"United States","Viewing Distance":"Over One Mile","Date of the Event":"06/01/2013 04:24 UTC","files":["/var/www/straped/mufon/html2text/47825.html.txt","/var/www/straped/mufon/org/47825.html"],"Object Shape":"Sphere","City":"Waterbury","Date Submitted":"06/03/2013 12:07 UTC","Region":"Connecticut","Log Number":"US-06032013-0012"}