{"trends":["There have been 2 other sightings in Pittsburg","There were no other sightings in Pittsburg on or around June 2nd 2013"],"Disposition":"Unresolved","Longitude":"-94.69902","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=37.419234,+-94.69902(47822)&iwloc=A&hl=en\"> mufon case (47822) map </A>","Date of the Event":"06/02/2013 10:10 UTC","Summary":"Saw a glowing light appear, thought it was a star- more appeared. Saw triangle shaped UFO, 3 white lights, birds acting strange. Triangle-like formations- like they were positioning themselves... Lasted 1.5-2 hours","Log Number":"US-06032013-0009","Object Shape":"Fireball, Star-like, Triangle","files":["/var/www/straped/mufon/html2text/47822.html.txt","/var/www/straped/mufon/org/47822.html"],"Object Features":"Unknown","Sighting Duration":"Undisclosed","Case Number":"47822","divs":["Sighting DetailsMy friends and I were outside of my work Sunday night and I saw a really bright star, but as I looked at it it didn't seem quite right- then we noticed more star-like lights appearing near the first one I saw, starting small and dim- then glowing(with a sort of flicker). We all watched as the first one looked as though it was falling to the ground... I was seeing things right? Falling star surely... But it wasn't... More and more appeared all around the sky some moving over us in the sky some in the distance, but surrounding us above. At first we thought some sort of bombs were being released or something, it couldn't possible be a real UFO... No... I'm seeing things....I'd believe a nuclear attack in Kansas before multiple UFO's above us. But they kept moving... Some of them would sit in place for a while (two beside each other sat for at least an hour in the same spot then could be seen moving slightly to the left and the one beside it following.) Then I really began to take notice of what was happening. They were positioning themselves in certain spots, almost a triangle theme... There were at least 20-30 throughout the night, some just passed overhead and flew passed above, others took their place in the sky (some moving their positions, others just slightly moving, and some even falling slowly to the ground. I stared directly above and yelled for the others to look. A triangle shaped object with 3 white lights at each corner and one red between the two on the back of it. It flew faster than any plane ever could, and I heard no noise. nothing. glowing star... Much brighter than everything around them. What was happening. Just glancing at the sky anybody would believe those were stars, but staring over the span of 2 hours showed that no star could ever do that, move...disappear... We left to go back to my apartment then forgot one of us had left our car where we were, so we returned to get it. On the way I noticed something I had never really seen before... Birds.... Flying so low, so many of them. They NEVER do that. 100's flying so low.... At 12am? That's not right... Not like that...."],"Viewing Distance":"Unknown","Weather Factors":"Unknown","Region":"Kansas","Latitude":"37.419234","Country":"United States","Tags":"City","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","City":"Pittsburg","Date Submitted":"06/03/2013 05:57 UTC"}