{"Object Features":"Unknown","City":"Rochester","Date Submitted":"06/03/2013 03:35 UTC","files":["/var/www/straped/mufon/html2text/47821.html.txt","/var/www/straped/mufon/org/47821.html"],"Longitude":"-92.46295","Object Flight Path":"Unknown","Latitude":"44.0234","divs":["Sighting DetailsI would like to start out with that I have been an abductee for many years. I have had numerous encounters my entire life starting as a child to the present day. I have many other events I could tell but this is the one that stands out because of the scenario. The difference in this event is the fact that I was fully awake and conscious. Unlike most abductions where I am in a haze disillusioned state most likely due to the techniques used by the abductors. No I am not crazy. The incident started in the middle of the night at about 3am. I was in bed sleeping flat on my stomach. I was not fully asleep but groggy. The next thing is I felt something touch my left ankle. Did not think much of it until the touch turned into a grip on my ankle. My leg was lifted into the air. Startled I spun around and instantly went into a panic mode. There standing holding my leg was an entity commonly referred to as the Greys. Off subject I am a gun enthusiast and own many firearms. I sleep with a firearm near me. At the time I had a small 25 cal. pistol in a drawer near my bed. When I saw the entity I panicked and instinctively grabbed for my pistol. I pulled my pistol and aimed it at the entity at which time he dropped my leg. He turned and ran out of my room. This all took place in a matter of seconds. My kitchen was the next room to my bedroom. In the kitchen was my dog. I kept her in the kitchen at the time because she was having issues with peeing on the carpet. When the entity ran from my room I heard my dog scream in fear as if she was being beaten. The sound a dog makes when they are in severe pain or fear. I got up and ran in the kitchen. There was the entity standing by the kitchen wall with my dog about 5 feet from him yelping and crying really loud. I again aimed my pistol at the entity. He stared at me and I froze for a few seconds. I was just ready to pull the trigger when he turned and went right through the wall as if it was not there. I slowly walked in the kitchen at which time my dog stopped yelping but was still crying and extremely scared. I slowly walked over to the wall and noticed a slight rippling effect on the wall that looked like heat waves like on a hot day when you see heat coming off of hot pavement. I touched the spot on the wall where the entity went through and it was very hot. I stood there for a minute and touched it again and it had cooled back to normal. Here I was standing in the middle of my kitchen with a pistol in my hand thinking I cant believe what the hell just happened. I was in shock and just stood there for a few minutes. The next thing I did was I picked up the phone and called my uncle and told him what just happened. You have to remember this was 3am and he was not in a good mood to here something like this at that time in the morning. But after hearing what happened he came over. I let him in the back as that is where I was because the back door to the home was in the kitchen. He came in and we talked for a few minutes as he was trying to calm me down. He then went into the living room and told me come in the living room. He said look at the floor so I did. I could not believe what I saw. There was little child sized footprints on my living room carpet. I had vacuumed the carpet earlier before I went to bed so the carpet was all raised. But there on the floor was child sized footprints. Not barefoot but shoed prints. My uncle was shocked and was a little scared after seeing the prints. This is one of many incidents that I have had with the Grey entities. As I said this one is different because I was fully awake and aware as I am now writing this piece."],"Disposition":"Unresolved","Weather Factors":"Unknown","Object Shape":"Unknown","Summary":"Failed abduction attempt.","Region":"Minnesota","Country":"United States","trends":["There have been 13 other sightings in Rochester","There were no other sightings in Rochester on or around July 16th 1995"],"Date of the Event":"07/16/1995 12:00 UTC","Case Number":"47821","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=44.0234,+-92.46295(47821)&iwloc=A&hl=en\"> mufon case (47821) map </A>","Viewing Distance":"Unknown, N/A","Log Number":"US-06032013-0008","Source":"MUFON","Tags":"City"}