{"Log Number":"KY-06032013-0010","Region":"Demerara-Mahaica","Country":"Guyana","trends":["There have been no other sightings in Georgetown","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=6.804611,+-58.154831(47823)&iwloc=A&hl=en\"> mufon case (47823) map </A>","Summary":"observed shadow in sky which transformed into a craft then again a shadow which then disappeared","files":["/var/www/straped/mufon/html2text/47823.html.txt","/var/www/straped/mufon/org/47823.html"],"Date Submitted":"06/03/2013 10:46 UTC","Tags":"City","Date of the Event":"03/04/2013 11:10 UTC","City":"Georgetown","Case Number":"47823","Weather Factors":"Unknown","Source":"MUFON","Object Shape":"Chevron","Longitude":"-58.154831","Viewing Distance":"Over One Mile","Object Features":"Appendage(s), Wings","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Latitude":"6.804611","divs":["Sighting DetailsMy girlfriend and I were on the island of Grand Cayman sitting on 7 mile beach in the evening looking for shooting stars.It was a dark and moonless night with stars covering the night sky. There were minimal lights on the beach which allowed us a clear view of the night sky. At approximately 11:00 PM, my girlfriend said \"Whats that? I happened to be looking in the same diection and immediately answered, I dont't know. What we observed almost simultaneously was a dark shadow, very large, moving across the sky in a northerly direction, obscuring all of light from the stars as it passed by. After about 3 seconds, the shadow transfomed into a craft, which was visible for about 3-4 seconds and then seemed to cloak itself back into a dark shadow, as if becoming one with the surrounding sky and was gone. After it had disappeared, I asked my girlfriend to describe what she saw, since we both had a startled verbal response when we saw the craft materialize. What we saw was a large craft, that I estimated to be the size of a couple of Boing 747 aircraft, I am guessing to be at 5-10,000 feet in altitude, moving off to the north at a reletively high rate of speed, of at least several thousand miles per hour. The craft originally was the dark shadow we saw moving across the sky, and then began to materialize. The cfaft as I saw it was of a similar shape as the \" Bird of prey\" from the Star Trek shows. I saw Gull shape wings which had a solid navigation light running almost the entire length of the leading edge of the wings. It had no tail fin but in general was of a chevron shape.It made no sound, and had no other discernable lights. It appeared to have a protrusion off the front, which I would assume to be a cockpit type of area. My girlfriend described the craft as more of a \"V\" shaped craft, looking similar to a seagull without the head area and she did see the light on its edges, more of which she descibed as a glowing light. My eyes are much better than hers at distance, so I believe I got a better look at it. This craft stayed in our view for 3-4 seconds, and then in a very similar fashion from the creature in the movie \"Predator\", It seemed to dematerialize into the surrounding sky, or just get absorbed by it. We both talked about it in detail for days. We both saw that craft on that night, and know that what we saw was real. We talked about how if only one of us saw it, you would question yourself forever, if you just imagined something. In this case 2 sets of eyes and 2 minds saw exactly the same thing, so we will forever know the opposite. We witnessed a craft more than likely, not of this Earth."],"Sighting Duration":"Undisclosed"}