{"Tags":"City","trends":["there have been no other sightings in raleigh\\cary","This sighting has never been favorited."],"City":"RALEIGH/CARY","Object Shape":"Star-like","Sighting Duration":"00:00:30","Viewing Distance":"Unknown","Date of the Event":"09/25/2004 06:15 UTC","Region":"North Carolina","Object Flight Path":"Other","Source":"MUFON","files":["/var/www/straped/mufon/html2text/4782.html.txt","/var/www/straped/mufon/org/4782.html"],"Latitude":"35.791357","Log Number":"US-05132006-0006","map":"<A HREF = \"http://maps.google.com/maps?q=35.791357,+-78.781622(4782)&iwloc=A&hl=en\"> mufon case (4782) map </A>","Summary":"VERY BRIGHT STAR STATIONARY FOR 25 SEC WENT INTO QUICK MOTION AND DISAPPEARED IN 3 SEC","Date Submitted":"09/25/2004 06:15 UTC","Object Features":"Unknown","Case Number":"4782","Longitude":"-78.781622","Country":"United States","divs":["Sighting DetailsTHIS INCIDENT HAPPENED TO MY HUSBAND WHO IS STRICT SCEPTIC AND NON-BELIEVER OF ANYTHING HE CANNOT TOUCH. HE WENT TO TURN ON A POOL PUMP SHORTLY AFTER 6AM. HE NOTICED A VERY BRIGHT STAR NORTHEAST OF OUR BACK PORCH. HE THOUGHT IT WAS VERY UNUSUAL THAT THE STAR WOULD BE THIS BRIGHT SO EARLY IN THE MORNING. THIS OBSERVATION WITH HIM THINKING THE LATTER TOOK MAYBE 5 SECONDS. THEN HE WENT TO THE POOL PUMP. IT TAKES HIM ABOUT 20 SECONDS TO GET TO THE POOL AND TURN THE SWITCH ON. WHEN HE STOOD UP HE HAD A FULL VIEW OF THE STAR AGAIN (IT WAS STILL THERE, STATIONARY). HE WAS LOOKING AT IT FOR ABOUT 10 SECONDS. THEN THE STAR \"JUMPED UP\", AND DISAPPEARED TO THE LEFT (NORTH) WITHIN 3 SECONDS. HE STOOD AT OUR YARD FOR A COUPLE OF SECONDS LONGER, SINCE HE THOUGHT IT WAS ONLY A DREAM. HE LOOKED TO THE SOUTHERS SKY, AND THEN BACK AGAIN, AND THE STAR WAS NOT THERE. WHEN HE CAME INDOORS HE TOLD ME, TRYING TO MAKE A JOKE OF IT, THAT HE SAW \"YOUR UFO\", SINCE HE KNOWS ABOUT MY KNOWLEDGE AND INTEREST IN THIS SUBJECT. WE BOTH FORGOT ABOUT THE INCIDENT, UNTIL TODAY. WE WERE JUST CHATING, AND DISCUSSING CERTAIN SUBJECTS I STUDY AT A PRESENT TIME, AND CAME ABOUT HIS OBSERVATION THAT HAPPENED ONE AND A HALF YEAR AGO. THIS TIME HE ENCOURAGED ME TO REPORT IT."],"Weather Factors":"None","Disposition":"IFO"}