{"files":["/var/www/straped/mufon/html2text/47831.html.txt","/var/www/straped/mufon/org/47831.html"],"Viewing Distance":"20 Feet or Less, 21-100 Feet","Log Number":"US-06032013-0018","Object Shape":"Triangle, Other, Unknown","trends":["There have been 30 other sightings in Santa Rosa","There were no other sightings in Santa Rosa on or around September 18th 1983"],"Summary":"while driving home alone at @ 12 A.M. I saw red lights, like a powergrid in the park. It began lifting, then was above my car. I panicked. The entire road was red. UFO had rows of red lights at night it was the lights that defined shape of object.","Source":"MUFON","City":"Santa Rosa","Tags":"City","Case Number":"47831","Country":"United States","Object Features":"Other","Weather Factors":"Unknown","Latitude":"38.453397","Disposition":"Unresolved","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Date of the Event":"09/18/1983 12:00 UTC","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=38.453397,+-122.673258(47831)&iwloc=A&hl=en\"> mufon case (47831) map </A>","Longitude":"-122.673258","Date Submitted":"06/03/2013 04:15 UTC","Sighting Duration":"00:02:00","divs":["Sighting DetailsThis is the first time I reported this, even though I have told my family and friends. Either Sept. 17, 18, or 19, I was driving home alone close to midnight , possibly a little before or a little after. I had been to a meeting and was anxious to get home. I was travelling at about 30 miles per hour on Montgomery Drive where it passes the Spring Lake area of Howarth Park. I often took my son and his friends there and I was very familiar, at the time with the surroundings. From the street where I was driving, the grassy, tree-studded park was to my right and the Lake, several yards beyond it. As I was driving, I became aware of an anomaly in view. It appeared to be a structure very similar to some type of power grid with flashing red lights. It seemed to be stationary, fastened to the ground from where I saw it. My immediate response was that I never remembered seeing it there before. As I was trying to figure out what it was, the \"object\" began lifting off the ground at a jerky tilt slowly and within seconds, it was airborne. Fear hadn't quite entered the picture yet, but I was a little uneasy, perhaps, and looked back at the road for a second to concentrate on driving. Suddenly the thing was on top of me! (My car, that is.) The entire road became red under its lights. I really panicked because it was so close and for whatever reason, it had deliberately, unmistakenly headed right for me. It seemed to be hovering above my car approximately at telephone pole height. There weren't any other cars on the road, and I didn't know if I would make it out of there alive. My foot hit the pedal hard and fast and I remember getting home just a few minutes after midnight. As I walked in the door, my mother, who was watching my son was still awake. I said, \"Ma, I saw a UFO!\" She just said, \"Oh.\" I had reacted to whatever it was above my car as if I were its prey. That was my survival gut reaction at the time even though I had always wanted to find out about UFOs and of course, beings from other planets, etc. That encounter was just a little too close, however. For some reason, I felt the UFO was ours. It was just a feeling. There is more to this story, but I fear any subjective, rather than fact-based speculation might be foolish. A few years later, I called \"The Press Democrat\" newspaper to see if anything had been reported. There was an article which appeared in which local residents reported seeing strange green and blue lights that night at around 9:30, if I remember correctly. What I saw was different."]}