{"Country":"United States","files":["/var/www/straped/mufon/html2text/47838.html.txt","/var/www/straped/mufon/org/47838.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.278852,+-79.610243(47838)&iwloc=A&hl=en\"> mufon case (47838) map </A>","City":"Greensburg","trends":["There have been 21 other sightings in Greensburg","There were no other sightings in Greensburg on or around June 1st 2013"],"Object Flight Path":"Straight-line path,Path with directional change","Log Number":"US-06032013-0023","Summary":"over 30 reddish orange glowing lights in the sky","Disposition":"Unresolved","Longitude":"-79.610243","Object Shape":"Circle","Region":"Pennsylvania","divs":["Sighting Detailsit was on 6-1-13 at around 9:45 pm. my daughter was leaving to go to the store when she looked up in the sky. she saw the lights in the sky and came running in the house grabbing me out of the shower she threw the towel at me and said there is lights in the sky. i ran to the window where my husband was already looking out the window. i saw these reddish orange lights that was traveling from the younwood area towards the hempfield area in a straight line. i counted 33 lights as they reached just over 136 they would go straight up into the sky out of sight. one by one. and then when it was at the end of the line there was 4 lights two on top of the other 2 like the shape of a square they then seperated and took their turn in line to go straight up. after that there was nothing. my daughter was trying to take pictures and a video with her cell phone and it would not work. i have never seen anything like that ever and so the next day i searched the internet what it could of been and there is nothing to explain what we had seen. the news paper said it was meteors but we know different!"],"Latitude":"40.278852","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"06/03/2013 10:31 UTC","Weather Factors":"Unknown","Object Features":"Unknown","Source":"MUFON","Date of the Event":"06/01/2013 09:45 UTC","Tags":"City","Case Number":"47838"}