{"Tags":"City","Log Number":"US-06032013-0026","map":"<A HREF = \"http://maps.google.com/maps?q=40.381045,+-80.711265(47841)&iwloc=A&hl=en\"> mufon case (47841) map </A>","Country":"United States","Longitude":"-80.711265","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Object Features":"None","Date Submitted":"06/03/2013 10:53 UTC","Case Number":"47841","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Region":"Ohio","Source":"MUFON","City":"Steubenville","divs":["sighting detailsi was outside putting the garbage out when i observed a very bright star (or so i thought). it was a perfectly clear night on 6\\3\\13 at 10:30 at night. the light was easily the brighest 'star' in the sky, even moreso than i'd say when venus is at its brightest. i stood admiring it for a second when i realized it was moving. i watched it for about five minutes as it moved across the sky, moving west to east. as it progressed i saw it pass behind trees, in my line of sight and then appear on the other side of them as it made its progression. it continued in a straight line until it was out of sight on the eastern horizon. i don't know if there was any known asteroid or meteor but it didn't have a tail or a streak. it was just really bright and moved in a straight line. the light it gave off didn't blink or change from a steady white star-like light. after it passed to the east i noticed a plane coming from east towards the west (towards me) with the normal blinking lights on the wings etc but it was much higher up than what i saw moving eastward. i'm a horrible judge at size and distance and how high up something is but the thing i saw was much lower when compared with that plane i saw afterward. i wish i could have gotten a video of it but i left my phone in the house, not expecting i'd need it to take the trash out. if anyone is going to contact me, please do so through email. my wife won't believe this for a second so she's unlilely to pass along any message."],"Summary":"VERY bright starlike light moved west to east relatively quickly.","Object Shape":"Star-like","Latitude":"40.381045","trends":["There have been 2 other sightings in Steubenville","There were no other sightings in Steubenville on or around June 3rd 2013"],"files":["/var/www/straped/mufon/html2text/47841.html.txt","/var/www/straped/mufon/org/47841.html"],"Date of the Event":"06/03/2013 10:30 UTC"}