{"City":"Philadelphia","Sighting Duration":"Undisclosed","Region":"Pennsylvania","Disposition":"Unresolved","Log Number":"US-06032013-0027","divs":["Sighting DetailsWas watching TV, just before 10pm, looked out my living room window, and saw bright red star like object coming from the SW. Called over my brother to look at it, then watched it approach. As it got closer, we knew it was not a plane. It was not making any noise and not flashing light. Very big and bright red. When we went outside, it moved slightly to right, back again then to the right again, then back to straight NE direction. When it was just above where the house is, with us underneath, it flickered it's light, which became white, three times, then shut if off completly. When flying directly above us, when it had no cloud cover, you could tell it was perfectly round in shape, large and grey like. It had some dark circles on its surface. It flew it very straight and quick movement across the sky, and was completely covered by clouds once it passed our home. Unbelievable. I am a believer, my brother is not, but he is confused on what it is and checked to see if anyone reported it on the news. Neighbors were outside and saw it too."],"Date of the Event":"06/03/2013 12:00 UTC","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around June 3rd 2013"],"Tags":"City","Object Shape":"Circle","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/47843.html.txt","/var/www/straped/mufon/org/47843.html"],"Viewing Distance":"Unknown","Summary":"bright red star like object, zig zaged twice turned off light above neighborhood, circle shape","map":"<A HREF = \"http://maps.google.com/maps?q=40.084815,+-75.03116(47843)&iwloc=A&hl=en\"> mufon case (47843) map </A>","Latitude":"40.084815","Date Submitted":"06/03/2013 11:07 UTC","Country":"United States","Case Number":"47843","Longitude":"-75.03116","Object Features":"Patterned Surface","Source":"MUFON"}