{"Log Number":"US-06042013-0012","Date Submitted":"06/04/2013 05:57 UTC","Tags":"City","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/47857.html.txt","/var/www/straped/mufon/org/47857.html"],"Object Flight Path":"Path with directional change","Viewing Distance":"Unknown","Latitude":"35.998077","Disposition":"Unresolved","Sighting Duration":"Undisclosed","divs":["Sighting DetailsHi, I realize this isn't much to report. But I have thought about it for many years and with information I've heard during that time I thought I should say something to somebody. This event happened at night with a clear sky. I was standing outside my home when I saw a small travelling light in the sky which, at first, I thought may have been a plane. However, as I watched this light, travelling in the east, and moving in a southward direction, I noticed it slow dramatically, almost to a stop. Within a few seconds the object shot straight up. It had made a very definite course change on a sharp angle. The object travelled for a very short period, (possibly one second), then disappeared with what appeared to be an explosion, or ??? something. The explosion did not make any sound. It only appeared to be explosive because there was a shower, or burst of sparks as it disappeared. After that it was gone. It was not near to me as far as I could tell. It seemed to be a very long distance away. It also appeared as though it might have been in outer space,.... I'm not certain about that part. The only reason I've had a concern about this object for so long is that I know we do not have any technology which would allow any air ships to make such a sharp turn. Nor would it have disappeared so suddenly. That very same night, one of our local television stations reported that local police and some eye witnesses in Nashville had reported seeing a UFO. When this was reported I guess I put two and two together. It probably was the same object. I cannot add anything more to this. As I said, I know it's not much. But I am confident that what I saw did not operate within the technologies we possess now, nor then. I also have another report which happened at about the year of 1984 in another area of Tennessee. However, I think that one may have been military. I'm not certain. Thanks for taking the time to read my e-mail and take my information. I wish I could add more or be more help. Randall"],"trends":["There have been no other sightings in Bon Aqua","This sighting has never been favorited."],"Object Features":"None","Object Shape":"Unknown","Longitude":"-87.442005","Summary":"A light travelling which changed directions abruptly, with sparks.","Country":"United States","Source":"MUFON","Date of the Event":"10/15/1998 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.998077,+-87.442005(47857)&iwloc=A&hl=en\"> mufon case (47857) map </A>","City":"Bon Aqua","Case Number":"47857","Region":"Tennessee"}