{"Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Case Number":"47850","Tags":"City","Country":"United States","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Latitude":"41.24179","Object Features":"None","Object Shape":"Flash, Sphere","Log Number":"US-06042013-0006","Region":"Ohio","files":["/var/www/straped/mufon/html2text/47850.html.txt","/var/www/straped/mufon/org/47850.html"],"City":"Warren","map":"<A HREF = \"http://maps.google.com/maps?q=41.24179,+-80.782655(47850)&iwloc=A&hl=en\"> mufon case (47850) map </A>","Date Submitted":"06/04/2013 02:10 UTC","Summary":"Some were bright white round objects and others were dull white that blended in well with the stars","Disposition":"Unresolved","Source":"MUFON","divs":["Sighting DetailsOver the past three years I've noticed that in June and July things really start picking up in our night sky. Tonight was an amazing night to go out for stargazing. As I looked up, I thought at first I was looking at just stars. Then I realized, they were moving. As they passed, I pointed them out to my friends and my children. At first they thought they were looking at just the stars too, but once they focused they noticed a bunch of objects were moving in the night sky. There were no clouds in the sky, so it was not an illusion or our minds playing tricks on us. My daughter decided to take my phone and use the flashlight on it on one of the objects to try to communicate with one of them by flashing the light on and off again and it worked! We then went inside and got a normal flash light, they did not respond back but did with the phone. For three and half hours my daughter and I counted over 25 objects flying in the night sky disguised as stars. We also noticed when a plane would fly by, they would put their light out or would just disappear entirely. I can surely say that what we were seeing tonight was not airplanes or an aircraft that is of our world."],"trends":["There have been 8 other sightings in Warren","There were no other sightings in Warren on or around June 3rd 2013"],"Date of the Event":"06/03/2013 10:30 UTC","Longitude":"-80.782655"}