{"Case Number":"47851","Summary":"seen object on building stopped to take picture then it started towards us and we then proceeded on to the casino and were both very ill, and confused","Weather Factors":"Unknown","Log Number":"US-06042013-0007","Tags":"City","Object Flight Path":"Hovering then path,Path with directional change","Object Shape":"Cigar, Circle","trends":["There have been no other sightings in geyserville","This sighting has never been favorited."],"Latitude":"38.707476","Disposition":"Unresolved","Country":"United States","Date Submitted":"06/04/2013 02:14 UTC","Object Features":"Window(s), Unknown","divs":["Sighting DetailsWe were on our way to the casino, and on 101 north approximately 30 min from home. We were approaching out exit to the casino and my boyfriend said to me look what is that on top of the casino, which you are able to see from the freeway. I looked and i seen a big glowing ball, I said to him \" I am going to take a picture ok\" he said sure. As I took the exit to do so, all of a sudden my vehicle shut down and all my interior lights including my car stereo went out as if there were no power, i started to panic because I wasn't sure what was going on and my car only had 3,000 miles on it. I said to him what is happening? He didn't respond and I told him to get the time and then as i started to approach the stop sign my vehicle was on and my stereo lights and dash lights came back on. It was as if the power came on but not like my vehicle started it was just back on. I then proceeded to pull over to take pictures of the object and my boyfriend did also the object was a bright white but once i started to take pictures it turned orange and then started towards us. No sooner I took out my phone to take them, my boyfriend said to me \" Hey I don't know what the heck it is but whatever it is, It is coming straight for us, I laughed as i thought he was joking, I continued to take photos but I was only seeing my shutter open and close. My boyfriend started to put his phone away and said lets go its coming fast, he said I am getting out and going to walk i am not trying to get abducted. I have taken lots of pictures of orbs, and sphere's and other unidentified objects and thought this was one for my photo album. I continued to take photos and my boyfriend became uneasy and asked if we could go, I again chuckled and said ok just a few more. So I took a few more pictures and then proceeded on to the casino. We arrived at the casino about 10:50 or 11:00 pm, and we got out of my vehicle and i was unable to stand without holding on to my boyfriend, I told him that i felt weak and my legs were very weak, and so we went on the elevator and my head felt as if I were on a merry go round for hours, almost as if my brain was spinning and as we got off the elevator I then had to stop I told him i had to vomit and I thought we needed to leave and go to the hospital, I asked him how did he feel and he said \"not good I need to vomit to\" as I stood there I became very scared and said I don't know what is going on but i am weak, he told me to hold on to him and lets sit down inside then we can go if I didn't feel any better. I then remember being in front of the casino, but have no memory of what I did inside or how long before I felt better. Once we got home i connected my phone to my computer to see what we got in the photos. I looked at all the pictures and I had to lighten them because I wasn't able to see them. As i lightened them I was able to see the object as it approached us it was a lighted rod coming in multiple directions meaning left to right but as is approached us it had passed in front of a couple of vehicles that were passing by in actually passed right over the rear end of a vehicle, and I have a few photos of it coming straight for us, then i have a photo of a green object coming towards my vehicle and my boyfriend took pictures of the object and then an object with windows also my speedometer reads that while at a complete stop my vehicle states it is a 60 mph and my rpm's are at 3. My boyfriend accidentally took photos of inside my vehicle and there is a cigar like object in my car and my car clock was a fluorescent green and bright. This object seems to have a red color in the top of it and in the center of it. once the object go closer to my car the surrounding area became clouded as if there were a dust storm, i was unable to see the road and in one photo the object that had windows in it, the lines in the road were like they were all over the place they were no longer the painted line that were there at the beginning of this ordeal. I do have all the photos which i had to lighten. I am willing to take a polygraph test for my boyfriend and i, i will pay for them myself if necessary. I am also willing to go under hypnosis if possible, i believe they abducted us and I have some type of implant in my abdominal area. Since this encounter i have a burn like mark on my stomach and i can feel it move on occasion which if feels like a sharp object poking me I have actually felt it travel around my stomach area and when i experienced this that night i had felt it and I am very scared of not knowing what they did. I hope we can discuss this or maybe you can direct me to the right individuals for the hypnosis and polygraph. I am scared and no one believes us. Thank you so much annette gonzales"],"Date of the Event":"10/15/2012 08:50 UTC","Sighting Duration":"Undisclosed","Longitude":"-122.902765","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=38.707476,+-122.902765(47851)&iwloc=A&hl=en\"> mufon case (47851) map </A>","Region":"California","Source":"MUFON","City":"geyserville","files":["/var/www/straped/mufon/html2text/47851.html.txt","/var/www/straped/mufon/org/47851.html"]}