{"Sighting Duration":"Undisclosed","Object Features":"Unknown","Source":"MUFON","Date Submitted":"06/04/2013 06:40 UTC","Latitude":"26.309937","Log Number":"US-06042013-0014","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=26.309937,+-98.155333(47859)&iwloc=A&hl=en\"> mufon case (47859) map </A>","divs":["Sighting DetailsNot sure but I believe that I have been abducted many times. I believe that it started back in the late 1980's. There are several stories from waking in the middle of being taken out of my house by this tall being when I was stationed on Crete, Greece, to several recent ones. The reason I am reaching out now is because of the recent episodes and questions I have. I recently woke up with a round patch, about 1.5 inches in diameter, of hair missing from the left side of my head (above and to the left of my ear) to teeth that I think were pulled and put back. As for the teeth, I just woke up one day and had 2 very loose molars on the right bottom side of my jaw. They did hurt but that only lasted a few days. They are still loose but without pain. In November I awoke in the middle of another episode. I was in a hotel room and woke up hearing chirping sounds going back and forth. I was covered from head to toe in a white sheet and was surrounded in very bright white light. I felt something at the foot end and tried to kick at it as I was very upset. I just got heavier and could no longer move. I felt something near my shoulder at this point. I did try yelling for it to leave me alone. I know I got a few words out but again was only left heavier than before and unable to move or speak. I just kept hearing the chirping going on. I eventually just blacked out. When I woke up in the morning I felt extremely heavy with difficulty moving. I had a very hard time getting out of bed and to the shower. I had to give a speech at a university and as I was being led to the room I had extreme difficulty going up 2 steps. I fell back once and just pushed myself back to move on. At the same time I was in an extreme feeling of paranoia for a few hours. I had to sit outside for a while just to pull myself together. Anybody that knows me knows that I don't fear much of anything. I have been awakened a few times in the middle of something going on. On other occasions I have been aware of something going on but couldn't open my eyes but tried fighting my way out just to be completely unable to move while getting some words out - yelling for my freedom. I have twice seen the tall thin creature with the large head and small eyes. On one of those occasions I did see several short creatures with the large purple eyes looking at me. The tall one seems to be the abductor. The second time I saw the tall one it threw the sheets off of my feet at the foot of my bed. I remember it lightly slapping my feet. It was slightly hunched over looking at me with the little one scattered on both sides of it. That happened at my apartment in Texas. While in Greece, I don't know if it was returning me or trying to take me but I fought hard holding on to the couch with my rt leg and hand. It had me half way out of the large window that was as wide as I am tall. I am heavily involved in the spiritual having done several exorcisms. I am a hypnotist. I have 2 degrees (math and biology) and a paper away from my MS in computer science. Tests give me an IQ of 154. I was working for intelligence when I believe it all started. For some reason or another I don't like to sleep at night no matter how tired and will stay up as late as possible. I am not scared to go to sleep just don't seem to want to. I have many more details to each event but think they would be best spoken if there is any interest in them. Are these things happening to others? Thank you for your time."],"Tags":"City","Date of the Event":"11/20/2012 12:00 UTC","Object Shape":"Unknown","Viewing Distance":"N/A","Longitude":"-98.155333","City":"Edinburg","files":["/var/www/straped/mufon/html2text/47859.html.txt","/var/www/straped/mufon/org/47859.html"],"trends":["There have been 2 other sightings in Edinburg","There were no other sightings in Edinburg on or around November 20th 2012"],"Object Flight Path":"Unknown","Disposition":"Unresolved","Summary":"Abductions","Weather Factors":"Unknown","Country":"United States","Case Number":"47859"}