{"map":"<A HREF = \"http://maps.google.com/maps?q=34.80611,+-87.669481(47853)&iwloc=A&hl=en\"> mufon case (47853) map </A>","Object Flight Path":"Straight-line path","City":"Florence","Weather Factors":"Unknown","Log Number":"US-06042013-0009","files":["/var/www/straped/mufon/html2text/47853.html.txt","/var/www/straped/mufon/org/47853.html"],"Source":"MUFON","Tags":"City","trends":["There have been 7 other sightings in Florence","There were no other sightings in Florence on or around June 3rd 2013"],"Disposition":"Unresolved","Object Shape":"Sphere, Star-like","Region":"Alabama","Longitude":"-87.669481","Latitude":"34.80611","Country":"United States","Date of the Event":"06/03/2013 09:20 UTC","divs":["sighting detailsmufon is already working on my cases.i'm reporting tonight's sightings for others who might of experienced the same orb sighting tonight especially those who live in north west alabama.actually the gadsen report that came in prompted me to report online & i will have video of tonight's sighting on youtube shortly. the first light orb came in traveling low around close to 200-300 ft off the ground in straight path coming from the south heading north east.it was very very bright! brighter than sirius. it was moving extremely slow & about 5 mph. it took 4 minutes just to travel a few yards & over my yard.it was partly cloudy when this came over but was below the clouds. what's interesting, the gadsen report says he saw it going south west to north east but gadsen is southwest of north west alabama so logically it couldn't had been the same one.but with saying that we spotted a handful of other light orbs higher in the sky right after the low travelling orb & we saw them in all different directions. they will be medium bright & then get extremely bright all of a sudden & then dim & disappear.i noticed one of them still visible after thinking it was gone.they weave,wobble & hover sometimes & even make a curve in direction. anyway,i have a thought.imagine a bunch of these low`orbs scattered in a horizonal line sweeping through our country at the same time headed in the same direction for instance, all coming from the south\\ south west, headed in a north eastern direction? the light orbs that are a few thousand feet up are going in all directions. then again they might be all swarming up there & a few come down to say hi. the must like me a lot."],"Sighting Duration":"Undisclosed","Object Features":"None","Viewing Distance":"20 Feet or Less","Summary":"Bright Light Orb observed in close range plus others in the distance.linked with Gadsen sighting?","Date Submitted":"06/04/2013 03:31 UTC","Case Number":"47853"}