{"Date Submitted":"06/04/2013 06:36 UTC","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/47858.html.txt","/var/www/straped/mufon/org/47858.html"],"City":"Carcroft","divs":["Sighting DetailsIt was Tuesday 4th June 2013, 2am in the morning. I was in bed still awake as I couldnt sleep, and I just happened to see a light through the window blinds, and noticed it was moving. I then jumped up and opened the blind to see it. I was right, it was moving. At first, I thought it was a plane or helicopter, but there was no flashing lights or noise, which made me think it might be a meteor, but it had no trail. The object was bright, brighter than a normal star, brighter than any star Ive seen in the sky. It flew in a straight line, from West to East, and at a pace which I can only describe as faster than normal. It flew at a steady pace, but too fast for it to be a plane or helicopter. It was over the house and out of my view within 10-15 seconds. As soon as it went over the house and out of view I checked the time, which was 2am in the morning. My first thought after checking the time was 'have I just seen a UFO'. Im not sure how many people saw this, or what it was, but I feel it was a UFO. If anyone saw this, please comment. It must have flew across the UK between 1am-3am, so somebody must have seen it. After that I went back to sleep knowing Ive seen something strange that night. I cant wait to tell my friends and family."],"Summary":"Bright Light over Doncaster","Latitude":"53.587384","Tags":"City","Date of the Event":"06/04/2013 02:00 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","Longitude":"-1.175741","Object Shape":"Circle","Region":"","Case Number":"47858","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Log Number":"GB-06042013-0013","map":"<A HREF = \"http://maps.google.com/maps?q=53.587384,+-1.175741(47858)&iwloc=A&hl=en\"> mufon case (47858) map </A>","Country":"United Kingdom","Weather Factors":"Unknown","trends":["There have been no other sightings in Carcroft","This sighting has never been favorited."],"Viewing Distance":"Unknown"}