{"Date Submitted":"06/04/2013 03:25 UTC","Sighting Duration":"00:10:00","Object Flight Path":"Path with directional change","Country":"United States","Summary":"Why do i keep seeing ufos? im scared i dont know what to think.","Tags":"City","City":"San Pablo","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/47864.html.txt","/var/www/straped/mufon/org/47864.html"],"Region":"California","Log Number":"US-06042013-0019","Longitude":"-122.300362","Object Features":"Unknown","Latitude":"38.013031","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","divs":["Sighting Details, I have always been a sceptic when it comes to ufo,s and aleins how ever about 2 Months ago around 1 pm i looked up and saw 3 to 4 orbs following behind a airplane then out of no where they changed course it was like they where putting on a show. so since thenjust about ever ynight me and my husband come outside at night and just look up at the sky and we see flying objects in the sky. sometimes 3 or 4 they look like flying stars but go really fast and change direction with ease. i have even pointed a light at one and got flashed back it scared me very much. i dont talk about what i see with no one except my husband i think people will think im crazy...but LAST NIGHT I SAW THE BRIGHTIST BIGEST UFO IT WAS 11 PM AND ME AND MY HUSBAND WHERE OUTSIDE LOOKING UP AND WE SAW WHAT LOOKED LIKE A STAR BUT IT WAS MOVING VERY FAST AND THEN IT GOT BRIGHTER AND BRIGHTER IT JUST GLIDED ACROSS THE SKY IT WAS VERY SURREAL. WE SAW IT FOR ABOUT 10 MIN INTILL WE COULDNT SEE IT NO MORE DUE TO TREES THEN ABOUT A HOUR LATER WE SAW ANTHER ONE BUT IM SURE TONIGHT WE WILL SEE SOMETHING LIKE ITS HAPPING EVERY NIGHT . what i want to know is why are we seeing things almost every night are we the only ones that find objects flying all the time are there other people that see things liked this, am i seeing what i think im seeing? are they satellites? i dont know but i know im scared and not sure whats going to happen are we going to be invaded or does the goverment already have contact im just not sure but im sure i sound crazy but im really not i am a normal person. i would love some answers. i know for sure if someone would stand with me for 10 or 15 min you would see something unknown flying above. is there any one else that see things like us every night? as soon as we fix our camera we get video we tried but are camera broke it wont turn back on and i have tried my cell phone but u cant see anything"],"Date of the Event":"06/03/2013 10:00 UTC","Object Shape":"Star-like","Weather Factors":"Unknown","trends":["There has been one other sighting in San Pablo","There were no other sightings in San Pablo on or around June 3rd 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.013031,+-122.300362(47864)&iwloc=A&hl=en\"> mufon case (47864) map </A>","Case Number":"47864"}