{"Sighting Duration":"Undisclosed","Object Features":"Unknown","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Object Flight Path":"Stationary","Longitude":"-74.176605","Tags":"City","Date Submitted":"06/04/2013 10:49 UTC","Region":"New Jersey","Log Number":"US-06042013-0016","Date of the Event":"05/25/2013 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.071588,+-74.176605(47862)&iwloc=A&hl=en\"> mufon case (47862) map </A>","files":["/var/www/straped/mufon/html2text/47862.html.txt","/var/www/straped/mufon/org/47862.html"],"Source":"MUFON","Country":"United States","Object Shape":"Triangle","Case Number":"47862","trends":["There have been 3 other sightings in Mahwah","There were no other sightings in Mahwah on or around May 25th 2013"],"Summary":"three bright lights in western sky hovering in perfect triangle formation, low in sky","Disposition":"Unresolved","divs":["sighting details i was driving from ny to pa, a common trip for me. major highway 287 s\\w. heading west. clearly saw three bright stationary lights, looked brighter than stars. i always look at the stars, and never saw anything like this- this distinct. one of the lights was brighter than the other two. three lights were in perfect triangular formation. many miles high, many miles away. i took pictures and video, but not sure if it is visible. thousands of people must have seen it, because it was just above mountainline. sun had set maybe a half hour before and there was still some light in the sky. i lost sight of the objects when the road curved south, but then had a good view again when the road turned west. the three lights were there for at least ten to fifteen minutes, maybe longer. i drove south and lost sight. when i first saw the objects i felt elation and certainty this was an intelligent formation. my intuition said \"sirian\", but this is an opinion. i welcomed them with my thoughts and told them to stay as long as they liked. i thanked the lights. i was very grateful to see it. i always go on walks at night, always looking for lights or ships, and have not seen anything like this since the mass ufo sightings in the hudson river valley in the 80's. can provide media evidence at a later date- need to download it to computer."],"City":"Mahwah","Latitude":"41.071588"}