{"City":"LANDSBYGDEN","Summary":"When looking out in the window a spaceship had parked on our house roof.","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Log Number":"SE-06042013-0022","Case Number":"47867","Region":"Kronoberg County","Object Features":"Dome, Window(s)","Source":"MUFON","divs":["Sighting DetailsI was looking out in the window on the second floor. I felt sommeone was looking at me from outside it was night and saw no one but suddenly I felt it was over my head and looked up on our house roof and saw a black triangled spaceship had parked on our roof. I did not think before I was pulled out from the window and lifted up in the air. There was no sound from it and it was black in a special color that not reflected light. The next memory was that I saw a circle-formed grey spacship and I was looking if it had any number or letter on it as I thought it was an airplane and only 8 km is a small military airport. I was try to see if there was any living I could see in the small windows but it was only dark in them. I was never frighten. When I come back to my house was I standing on the same spot and I heard our TV and it was like they had stop the time and I could feel like I was flying from another dimension to another as it was like bump in time. Next day did the whole family waked up of a swish sounds outside and we looked in a window and saw small like a volvo car size circle formed grey spaceship flying up in our forest. They was at least 50 My man and our daughter drove up in the forest to see the spaceship but they was gone. It was one area in the forest I never pass by again because I felt like someone looked at me and I knew they had taaken me to that place. My whole life changed after this event. I joined the airforce and become a sergeant working with HAM-radio and maps I left my man and married a man in Texas and his parents had worked for NASA for 45 years working with maps. I have been visited in most of my life and they have talked to me. They have also trained me to sit in the air and they have taken foster from me and I think they have used my body to breed on and then take them out because I have been pregnant 15 times without the Doctor could see any foster only the placenta. They have taken my kids because I have so much love in me and emotion is something they not have. They do not feel anything and not understand that they can hurt us in their examination of people."],"Object Flight Path":"Stationary","Latitude":"56.797965","map":"<A HREF = \"http://maps.google.com/maps?q=56.797965,+15.324129(47867)&iwloc=A&hl=en\"> mufon case (47867) map </A>","files":["/var/www/straped/mufon/html2text/47867.html.txt","/var/www/straped/mufon/org/47867.html"],"Longitude":"15.324129","Object Shape":"Disc, Triangle","Date of the Event":"10/16/1994 12:00 UTC","Date Submitted":"06/04/2013 05:34 UTC","Tags":"City","Country":"Sweden","Disposition":"Unresolved","Viewing Distance":"20 Feet or Less","trends":["There have been no other sightings in LANDSBYGDEN","This sighting has never been favorited."]}