{"files":["/var/www/straped/mufon/html2text/47870.html.txt","/var/www/straped/mufon/org/47870.html"],"Viewing Distance":"101-500 Feet","Longitude":"-93.465416","divs":["Sighting DetailsThe witness was on his 3rd floor balcony at his apartment complex, he saw a black boomerang shaped object with reddish-orange dim oval lights under its wing tips silently approach his building until it was 300 feet away from the roof line. As it continued on a straight line path, it suddenly stopped and then made a 90 degree turn to the heavens. It accelerated away at unbelievable speed and faded away into the distance. The witness was in shock and awe at the speed and manuverability of the object. he realized that this was not a man made object. The object approached from the NW and flew off to the SW. The temperature was chilly with overcast sky and medium fog. There was no precipatation. The sighting was 5-6 seconds in duration. There was a \"weird quiet\" feeling in the air during the sighting. This was a second sighting of the same vehicle by this witness within a 5 day period. If you would like to refer to the details of the first sighting it is under Case #47499."],"Date Submitted":"06/04/2013 06:31 UTC","Summary":"The UFO was 300 feet from me as I stood on my 3rd floor balcony. It flew aways, stopped, then made a 90 degree turn. It accelerated away and faded into the distance.","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.857526,+-93.465416(47870)&iwloc=A&hl=en\"> mufon case (47870) map </A>","Object Flight Path":"Path with directional change","trends":["There have been 4 other sightings in Eden Prairie","There were no other sightings in Eden Prairie on or around May 23rd 2013"],"Date of the Event":"05/23/2013 12:00 UTC","Region":"Minnesota","Tags":"City","Log Number":"US-06042013-0025","Country":"United States","Source":"MUFON","Weather Factors":"Unknown","Latitude":"44.857526","Object Shape":"Boomerang","City":"Eden Prairie","Case Number":"47870","Disposition":"Unresolved","Sighting Duration":"Undisclosed"}