{"Longitude":"-75.923675","files":["/var/www/straped/mufon/html2text/47879.html.txt","/var/www/straped/mufon/org/47879.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.340978,+-75.923675(47879)&iwloc=A&hl=en\"> mufon case (47879) map </A>","Source":"MUFON","Date Submitted":"06/05/2013 12:00 UTC","Object Shape":"Circle, Flash, Sphere","Region":"Pennsylvania","Viewing Distance":"Over One Mile","Latitude":"40.340978","Disposition":"Unresolved","Country":"United States","divs":["Sighting DetailsAs I was sitting watching tv with my father, we were reading of our friends on Facebook who had seen an apparent UFO about 10 miles or so down the road. Thinking they were just seeing a plane we ignored it. While I was on my way to the bathroom I hear my father yell for me. As I come running out I see this orb in the sky, in the same direction and manor that our friends had reported. We both stood in awe as I yelled for my mother. She was too late to see it the first time as it simply disappeared. My father isn't sure what caught his eye but I studied the sky and sure enough, about 5 degrees lower another orb appeared alternating from red, green, yellow, white and grey in color. As soon as I saw it i futures it was a plane until I noticed the multiple colors, which I have never seen on an airplane, especially since it was stationary and still I knew it couldn't have been a plane. It was simply multiple colors, shaped as an orb that kept alternating colors until it vanished, perhaps reappearing or maybe it was another one, about 5 degrees lower than its first location. While standing there i began to freak out in all honesty. My immediate reaction was to call a buddy at the local ABC station who said he would look into it, which in a way calmed me down.. Perhaps making me realize that whatever happens, happens and it was indeed a UFO. Unfortunately the object hasn't returned yet, though I'm sure it will be back sometime tonight, I'll be watching!"],"Date of the Event":"06/04/2013 11:27 UTC","Weather Factors":"Unknown","Log Number":"US-06052013-0001","Object Flight Path":"Stationary","Object Features":"Unknown","Summary":"Orb-like with multiple, randomly changing colors","Tags":"City","Sighting Duration":"Undisclosed","City":"Reading","Case Number":"47879","trends":["There have been 42 other sightings in Reading","There were no other sightings in Reading on or around June 4th 2013"]}