{"Longitude":"-115.170746","Viewing Distance":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=36.120826,+-115.170746(47877)&iwloc=A&hl=en\"> mufon case (47877) map </A>","files":["/var/www/straped/mufon/html2text/47877.html.txt","/var/www/straped/mufon/more/47877_submitter_file1__20120313171140.jpg","/var/www/straped/mufon/more/47877_submitter_file2__Screenshot20130604221843.png","/var/www/straped/mufon/more/47877_submitter_file3__Screenshot20130604221849.png","/var/www/straped/mufon/more/47877_submitter_file4__2013060223.14.09.png","/var/www/straped/mufon/more/47877_submitter_file5__Screenshot20130604222415.png","/var/www/straped/mufon/org/47877.html"],"divs":["Sighting DetailsWe were vacationing in Las Vegas last spring break. We were sightseeing and I was taking pictures with my cell phone. I dont remember if we were on a bus or walking at the time but if we were on the bus I dont remember and ceiling lights that could have created the image. Any ways I did not notice the object or reflection until I got home a few days later. I did not photoshop the image and dont even know how to do it if I wanted to. The image shows a somewhat transparent saucer shape. I emailed mufon and he did a preliminary assessment and he noticed a dark object at the top left of the photo that I did not see until he pointed it out. I am a person that doesnt like drawing attention to themselves. I simply cannot explain what is on my photo and am seeking help explaining the out of place object. I will provide everything I can to prove I didnt fake the photo if needed. I will send the photo but it needs to be rotated so I will send the original photo and the rotated photo for viewing. Also I will send the details of both photos that were saved by the phone before and after the rotation."],"Latitude":"36.120826","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around March 13th 2012","This sighting has never been favorited.",""],"Disposition":"Unresolved","Date Submitted":"06/04/2013 11:24 UTC","Source":"MUFON","Date of the Event":"03/13/2012 12:12 UTC","Summary":"Photo taken on vacation in Las Vegas. Was not even noticed till days later","Case Number":"47877","Object Flight Path":"Unknown","Sighting Duration":"Undisclosed","City":"Las Vegas","Object Features":"Unknown","Log Number":"US-06042013-0032","Object Shape":"Cone","Country":"United States","Region":"Nevada","Weather Factors":"Unknown"}