{"Log Number":"US-06042013-0027","Object Flight Path":"Straight-line path","Latitude":"44.566312","Object Features":"None, Unknown","Summary":"Bright white light, No sound, light grey beams","Date of the Event":"06/04/2013 09:30 UTC","divs":["Sighting DetailsI am not sure what I saw and I know I have bad eyes but my brother, Father and mother all saw it and ran out side to see this thing fly over the house. This thing was so bright we thought maybe it was the space station but there was no blinking lights and the space station was not located over my property at this time. The light was very bright and looked like a star how ever it looked like it was in the upper atmosphere and had three grey light beams going in multiple directions. This thing had one grey light beam going directly under it and another two at angles of north and south just angled off the main beam directly under it. My brother was yelling come look come look and so I came outside and could not figure out what the heck I was looking at and we noticed planes going by in the same direction a lot lower then the thing we was observing. My brother had it on his phone trying to determine what it was but the phone came back with nothing and the object was moving very slow. I would not be surprised if others in the area saw the same thing we was looking at for a good 5-10 minutes. I wish my brother took a picture but I can explain it as clear as day because it just happened and started at 9:30 PM eastern and ended at 9:40 PM eastern after it went over the tree line and I could not see it any more. This is the first time I have ever seen any thing like it how ever my dad has seen this object before 20 or so years ago or at least an object like it that he cant explain. I figured it is best to document the event as best I can while it is still fresh in my mind. I have autism spectrum and I know what I saw and some things will stick for a life time and this will most likely be one of them unless said object can be explained."],"Case Number":"47872","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=44.566312,+-70.086681(47872)&iwloc=A&hl=en\"> mufon case (47872) map </A>","Viewing Distance":"Unknown","Object Shape":"Star-like","Region":"Maine","Country":"United States","Tags":"City","Longitude":"-70.086681","Date Submitted":"06/04/2013 10:00 UTC","trends":["There have been 2 other sightings in Chesterville","There were no other sightings in Chesterville on or around June 4th 2013"],"Sighting Duration":"00:10:00","Weather Factors":"Unknown","Source":"MUFON","City":"Chesterville","files":["/var/www/straped/mufon/html2text/47872.html.txt","/var/www/straped/mufon/org/47872.html"]}