{"Date Submitted":"06/05/2013 01:39 UTC","trends":["There have been no other sightings in Mexico","This sighting has been favorited 1 time."],"Tags":"City","City":"Mexico","Object Flight Path":"Straight-line path","Country":"United States","Object Features":"None","Object Shape":"Blimp, Bullet, Missile, Cigar, Fireball","Region":"Indiana","files":["/var/www/straped/mufon/html2text/47885.html.txt","/var/www/straped/mufon/org/47885.html"],"Latitude":"40.822264","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy son and I just got home from a BB King show. we were outside in the back yard telling my wife about the show. It is a very nice clear evening and enjoying the night air. My son and I saw the object at the same time. My first reaction was,\"What the hell is that\". It was moving slowly, or at least slower than you would expect an aircraft of that altitude or size. It just wasnt right. It moved in a steady straight line. No sound what so ever. We watched it for about a min or less, not sure. It had a short cigar to blimp shape. Was orange on the bottom and and deep red on the top. It actually looked like a blimp on fire. I have never seen such an objet as this and we live close to an air force base. We are used to seeing aircraft. It was so awesome that I couldnt stop looking at the sky so I stayed outside for awhile. About 25 min later,(approx: 11:43pm) I saw a couple high altitude jets fly over. Maybe a minute later I saw a white pulse of light, no sound. Just after the light, a lower altitude prop. plane flew over. I saw one more pulse of light in the same area around 12:10 pm. I have no idea what we saw but I am sure it was a controlled craft of some kind."],"Log Number":"US-06052013-0007","map":"<A HREF = \"http://maps.google.com/maps?q=40.822264,+-86.11555(47885)&iwloc=A&hl=en\"> mufon case (47885) map </A>","Viewing Distance":"Unknown","Summary":"looked like a slow but steady moving blimp on fire.","Case Number":"47885","Disposition":"Unresolved","Source":"MUFON","Weather Factors":"Unknown","Date of the Event":"06/04/2013 11:09 UTC","Longitude":"-86.11555"}