{"Object Features":"None, Unknown","Weather Factors":"Unknown","Country":"United States","Region":"California","Summary":"8- 10 white lights flying in formation, 2 rows deep headed from east to west in a straight path, slowly ascending into low clouds","divs":["Sighting DetailsNear corner of Beach Blvd and Talbert Ave. we were headed to our car, lights caught our eyes, 2 rows of evenly spaced, brightly lit flying crafts, at low altitude, (about same altitude as planes landing at Long Beach airport)in a evenly spaced formation from East to West heading from West Huntington Beach, towards Fountain Valley. In fact a passenger plane flew within close proximity to objects, at or around 9 pm on 6.4.13. Flying objects may have been visible to pilots. I first checked to see if the lights were connected to a larger object, like the bottom of a spaceship, but no, they were not connected. The lights had an orange glow, but mostly white. The objects, travelling at same or similar speed, followed in a line and slowly ascended into low clouds, without a sign or any deviance from path. I also considered if they were military helicopters for drones launched from Seal Beach base, based upon path. But could not come up with any conclusion that seemed reasonable. I videotaped for a few seconds, thinking it is possible we are viewing something from another world, but did not feel threatened. My spouse also witnessed the objects, agrees to this description and feels they are from outer space. We do not know if there were more than 10 because they were already passing as we exited the store. We waited and did not see anymore coming from the west, but only looked for a couple of minutes."],"Sighting Duration":"Undisclosed","Log Number":"US-06052013-0010","Date Submitted":"06/05/2013 02:05 UTC","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Case Number":"47888","Source":"MUFON","Date of the Event":"06/04/2013 12:00 UTC","files":["/var/www/straped/mufon/html2text/47888.html.txt","/var/www/straped/mufon/org/47888.html"],"Latitude":"33.716341","Disposition":"Unresolved","City":"Huntington Beach","trends":["There have been 49 other sightings in Huntington Beach","There were no other sightings in Huntington Beach on or around June 4th 2013"],"Longitude":"-117.963359","map":"<A HREF = \"http://maps.google.com/maps?q=33.716341,+-117.963359(47888)&iwloc=A&hl=en\"> mufon case (47888) map </A>","Object Flight Path":"Straight-line path","Object Shape":"Other"}