{"Date Submitted":"06/05/2013 02:02 UTC","Latitude":"33.616587","City":"Glendale","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=33.616587,+-112.187285(47887)&iwloc=A&hl=en\"> mufon case (47887) map </A>","Source":"MUFON","Sighting Duration":"00:03:00","Region":"Arizona","Case Number":"47887","files":["/var/www/straped/mufon/html2text/47887.html.txt","/var/www/straped/mufon/org/47887.html"],"Summary":"2 orbs not in unison but together in same direction of travel","Object Shape":"Unknown","Object Flight Path":"Path then hovering","trends":["There have been 52 other sightings in Glendale","There were no other sightings in Glendale on or around June 1st 2013"],"Object Features":"None","Tags":"City","Weather Factors":"Unknown","Disposition":"Unresolved","Log Number":"US-06052013-0009","Date of the Event":"06/01/2013 10:30 UTC","divs":["Sighting Detailsmy girlfriend and I arrived home Sunday night about 10:30 pm while walking to our door a strange light caught my eye to our east at first glance I knew this was not normal aircraft as there were no navigation lights it glowed a solid gold color and was traveling slowly in our direction I told my girlfriend to look up at it, as she did it began to pulsate in alternate colors from gold to red there was a light that was behind and lower in altitude that I noticed but thought was an airplane and continued to watch the pulsating light. it raised and lowered in altitude yet still traveling towards us at a very slow speed. now I realized the second light was without navigation lights as well. however the second object glowed a solid gold never dimming or pulsating and traveled at an even altitude the entire time. now the first craft began to dim and disappeared from sight. as the second craft reached the area where the first disappeared so did the second simply fade to black. I watched the area for a few more minutes yet they never did reappear. I had forgot my cell phone earlier that night and by the time she had fished hers out of her purse the second craft was fading out.I looked to my girlfriend and asked if she just saw what I saw, she agreed that whatever these were they were not anything either of us could explain. I personally am an avid believer in the fact that we are visited from other life forms and have witnessed similar sightings in recent times."],"Longitude":"-112.187285","Country":"United States"}