{"Source":"MUFON","Object Features":"None","Disposition":"Unresolved","Date Submitted":"06/05/2013 12:11 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.053655,+-76.639371(47895)&iwloc=A&hl=en\"> mufon case (47895) map </A>","trends":[],"Date of the Event":"08/20/2011 04:00 UTC","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/47895.html.txt","/var/www/straped/mufon/org/47895.html"],"Case Number":"47895","Latitude":"39.053655","Region":"Maryland","Viewing Distance":"21-100 Feet","Sighting Duration":"Undisclosed","Log Number":"US-06052013-0017","Tags":"City","Country":"United States","City":"Undisclosed","divs":["Sighting DetailsLet me start by saying that I believe that I have found something that affects their ability to control people, well at least the ability to control me,not completely just affect it. Its a type of pill but I don't want to make it public because I believe that people will abuse drug. It started when I woke up with a weird, like I have never felt before weird, pain in my inner about the middle of my thigh at around 2 or 3 in the mourning. The pain was so bad I never even looked at the clock. It was very intense it felt like it was my muscle kinda close to the bone, but it didn't feel like muscle pain. Now I can take alot of pain. Now this pain had me laying on the bathroom floor in a ball. I eventually got a couple hours of sleep. Later that mourning, I woke up at about 8 and it was still hurting just not quite as bad. I said something to my father about what happened and he offered me a pill. When I went to sleep that night, it started as an odd dream. I was 25 at the time but in my dream I was with a friend that i kinda lost touch with but was like my brother from the end of eighth grade untill we lost touch. I had just moved back in to my parents house maybe 2 weeks before, most of my stuff was still packed. I got the feeling like I was around 14 or 15 again. We were in the hospital in town, the cops were questioning us about something, and we were trying to get away and we came across my dog that died when I was around 18, and one of my earliest memories is getting this dog, I loved her as much as anything else in the world. We made it out the door and there was a car waiting for us I put my dog in and then my friend refused to get in the car, that was the only thing he did that seems to fit him. I talked him into getting in and he did, now she was a vicious dog at times and he wouldn't even really go near her when she was dying, the way I remember him he would have never got in! Then we got back to my parents house, which is in the middle of a bunch of woods. I started walking down the street and all of a sudden I was walking in the middle of this field, that is about a quarter of a mile from my parents house. Out of the corner of my eye I see what looks like 2 or 3(I can't remember now) greys. I look over and instantly this green light catches my eye. Then as soon as I focused on the light, they moved towards me in such a way..... I cant even describe it. I was instantly filled with more fear then I ever thought imaginable. I had a phobia of spiders before this, but now I see that that's not real fear. I still don't like spiders but I don't have a phobia anymore. As soon as they got close I woke up in my bed paralyzed. I could move my eyes and think but I couldn't make a noise or move anything. I started to fight it with everything I had, I was so confused I have never felt anything like it! I tried with everything to scream to my parents, to anyone I just wanted someone to help me, I felt so helpless. All I got out was a couple quiet noises or something, the only reason I could tell is that my dog(new dog I had for about 4 years) was staring at me tilting his head back and forth in a confused way. I snapped out of it, I don't know how long it went on for it felt like an eternity, and I felt a presence and like someone (or something) had been squeezing my arms and legs pretty tightly, almost like they were still there. I felt violated in the worst way I could imagine. I have had several incidents since this one, all started while I was sleeping, all the way up to as recently as last tues. June 4 2013. There were some incidents when I was on the same pill but there were a couple when I was on nothing. It seemed like I was regaining more and more control every time it happened until one time on March 23 2013. It looked like I was in my parents living room but I could tell I wasn't. long story short I was able to swing my limp arm at them. I was on that pill that day. Now I am not a drug addict this is all happening by pure chance, my teeth are breaking apart and cause me a great deal of pain. I am doing this because I NEED help. So PLEASE I have to know exactly what is going on, maybe with hypnosis it can help me to fully overcome it and put a stop to whatever is going on. I know its not likely but PLEASE I NEED HELP!!"],"Weather Factors":"Unknown","Longitude":"-76.639371","Object Shape":"Sphere","Summary":"I was sleeping, in my dream I was walking through a field when I noticed 2 greys. When they moved closer I woke up paralyzed."}