{"Case Number":"47899","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.930182,+-74.188872(47899)&iwloc=A&hl=en\"> mufon case (47899) map </A>","trends":["There have been no other sightings in Haledon","This sighting has never been favorited."],"Object Features":"None","City":"Haledon","Latitude":"40.930182","Date Submitted":"06/05/2013 02:19 UTC","Log Number":"US-06052013-0021","Tags":"City","Region":"New Jersey","files":["/var/www/straped/mufon/html2text/47899.html.txt","/var/www/straped/mufon/org/47899.html"],"divs":["Sighting DetailsMyself and two friends were in my automotive repair shop. We stepped out of the building onto the sidewalk and I stared up at the sky and saw a series of swirling lights. I pointed to the lights and they both acknowledged seeing them also. We stared at them for quite some time (twenty minutes)and talked about calling the police to verify what we were seeing. My one friend responded that they would think we're drunk, as we were having a few beers at the time. Beers aside we saw what we saw. While observing the objects a commercial airliner came into view, however it was impossible to determine the size or distance in relationship to the aircraft. The sky was clear no clouds, a bright sunny afternoon. The objects moved at incredible speed and seemed to vanish momentarily and reappear. We returned to the inside of the building. Approximately an hour later we exited the building about to go our separate ways and we three looked up in the direction of the lights and they were still there. I mentioned this event one or two occasions and as soon as the word \"Beer\" was mentioned, well you can guess the response. But we three know what we saw on that sunny day."],"Viewing Distance":"20 Feet or Less","Longitude":"-74.188872","Object Shape":"Cylinder, Sphere","Source":"MUFON","Date of the Event":"07/15/1999 04:15 UTC","Summary":"six spherical objects each moving independently and changing directions with incredible speed","Country":"United States","Disposition":"Unresolved"}