{"Viewing Distance":"Unknown","Date Submitted":"05/15/2006 12:00 UTC","Object Features":"None, Unknown","Object Flight Path":"Path with directional change","Case Number":"4790","Weather Factors":"None","trends":["There have been 42 other sightings in Lincoln","There were no other sightings in Lincoln on or around May 15th 2006"],"Longitude":"-96.681679","Country":"United States","Tags":"City","Latitude":"40.806862","map":"<A HREF = \"http://maps.google.com/maps?q=40.806862,+-96.681679(4790)&iwloc=A&hl=en\"> mufon case (4790) map </A>","Region":"Nebraska","Summary":"Orangish red light popped in from the star lit sky slowly moving West. Then turned North for about 10 seconds, finally turned South for about 2 min where it just poof was gone.","Sighting Duration":"Undisclosed","Object Shape":"Star-like, Unknown","divs":["Sighting DetailsI was taking my dog out for a walk at the end of the block of where I live. I noticed because I always like to look at constellations as I walk the dog. I thought the object was a jet at first glance. I then noticed that it was an Orangish red color not plane light color. The object also flickered intermittently like it was a star but was much too bright to be a star. The object moved at the same speed the entire time. It came in from my view out of the East heading West, then slowly turned to the North for about 10 seconds, finally slowly turned to head South. I watched it until it disappeared. However, the object wasn't so far away that it disappeared it poof disappeared. The entire experience lasted only 5 min. My reaction was a little scared and excited at the same time. I also said to myself they are back. This is the 4th sighting I have had of these same lights since July of last year. My wife has had 2 of these sightings. One of which the object was close enough to the ground to make her think it was a kite."],"Log Number":"US-05162006-0001","Date of the Event":"05/15/2006 12:00 UTC","files":["/var/www/straped/mufon/html2text/4790.html.txt","/var/www/straped/mufon/org/4790.html"],"Disposition":"Unknown","Source":"MUFON","City":"Lincoln"}