{"Disposition":"Unresolved","Latitude":"37.78101","Case Number":"47906","Sighting Duration":"Undisclosed","City":"San Francisco","Date of the Event":"06/04/2013 12:00 UTC","Object Flight Path":"Unknown","divs":["sighting detailsmy girlfriend and i were driving home from work on 280 south in san francisco around 11pm. i was driving and saw a bright green flash come from the south western side of 280 as we approached the alemany\\ glen park exits. i noticed it immediately thinking it was lightning but the weather was neutral and calm. it was not followed by thunder which we would have heard as the radio was off. i asked if she had noticed it but she hadn't. again another giant flash of blue light much like lightning occurred a minute or two later. we both saw this time and pondered if it could be fire works. later down the freeway we saw another green flash. after we got home and parked we exited the car. my girlfriend complained about a weird feeling. as we approached our house we saw a very bright red\\orange light flash behind us coming from the south east side of the city, it was followed by a buzz\\hum which sounded like nothing either of us have heard before. i went on facebook and asked if anyone else had seen this and one friend in redwood city wrote this:i'm in rwc, so i didn't experience it there in sf...this was just two very interesting coincidences, and i don't believe in coincidences...now i think i should do a reading on this and see what comes up? o.o my other friend wrote this: glad you want to pursue this, i know i have to. saw different colored flashes of light from my window looking south (i live off ocean by city college) around 1130. one of them delivered a shock to me and my roommate. i guessed after that it was some electrical issue but they appeared to be coming from somewhere much higher than the power lines, and their sizes and shape seemed somehow intentional and i would even say they were beautiful. it all lasted a couple minutes and i heard a number of emergency vehicles. any reports yet on this? the next day my girlfriend left for work at 7am and came back in saying there was a helicopter circling the neighborhood. she say it was black and white and had no markings or numbers like a police helicopter would have. please let me know if you find any more on this."],"Object Shape":"Flash","Country":"United States","trends":["There have been 127 other sightings in San Francisco","There was one other sighting in San Francisco on or around June 4th 2013"],"Region":"California","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.78101,+-122.415616(47906)&iwloc=A&hl=en\"> mufon case (47906) map </A>","Object Features":"None","Source":"MUFON","Summary":"4 bright flashes. Green twice, blue, red. Over 15 minute duration. Buzz and hum.","Longitude":"-122.415616","files":["/var/www/straped/mufon/html2text/47906.html.txt","/var/www/straped/mufon/org/47906.html"],"Log Number":"US-06052013-0028","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"06/05/2013 09:07 UTC"}