{"Case Number":"47908","divs":["Sighting DetailsI was on my boat with a friend fishing just outside port Jefferson Harbor. We were drifting SE-NW. The sky was clear and the sun was at about 40 degrees above the horizon to the WNW. I was actually just talking to my friend about how I believe in aliens and what I have heard and read about them recently. His response was he didnt really believe. so maybe 2 minutes after the conversation stopped I noticed something in the sky and said \"hey look at those birds.\" they were flying from the south to the north west over the water and just above a tree line about 1500-2000 feet away. My friend said \"thats not birds\" and I immediately realized that it was something else. the best way i can describe it, it was sort of cigar shaped, basically invisible except for what I thought was birds, maybe it was giving off heat or reflective waves that looked black to me. a good example of its shape is the spring from a click pen or a cork screw shaped but but spotty, by which i mean you can only see bits of it. almost like when you see an optical illusion on the horizon on a hot sunny day, except much more visible. This is really strange, because as I write this I have the television on and south park just started, the episode where the world gets visited by aliens for the first time ever. anyway I want to guess the object was 50feet in length and 15 feet wide. We watched it for about 40 seconds until it disappeared in the distance. when I first saw it, it was just wsw flying at a controlled pace going north west. we both just stopped what we were doing and stared until it disappeared. my friend was saying \"what did we just see\" over and over. We were both in shock and I told him I that I believe its UFO. When we fish out here we are always scanning for brids that might be eating schools of bait fish and thats why I noticed it. If I was to draw a description of what i saw, I would draw a spotted zig zag line. :;:;:;:;;"],"Date Submitted":"06/05/2013 09:38 UTC","Country":"United States","Object Features":"Unknown","Longitude":"-73.062773","Object Shape":"Cigar","trends":["There has been one other sighting in Port Jefferson","There were no other sightings in Port Jefferson on or around June 5th 2013"],"files":["/var/www/straped/mufon/html2text/47908.html.txt","/var/www/straped/mufon/org/47908.html"],"Object Flight Path":"Straight-line path","Region":"New York","City":"Port Jefferson","Date of the Event":"06/05/2013 07:20 UTC","Disposition":"Unresolved","Log Number":"US-06052013-0030","Viewing Distance":"501 Feet - 1 Mile","Latitude":"40.954878","Summary":"almost transparent and possibly giving off heat that seemed black that made it partly visable","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.954878,+-73.062773(47908)&iwloc=A&hl=en\"> mufon case (47908) map </A>","Sighting Duration":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown"}