{"City":"Halifax","divs":["Sighting DetailsAll in the matter of about 5 seconds. Looked out over horizon(late, dark) easily distinguishable out of normal civilian flight path. Travelling north fast, a green cigar-shaped object (almost night-vision color), but vivid streak beyond a mile. It made an abrupt change in direction seemingly toward me. I have seen many commercial planes in the area and helicopters before. Nothing has traveled this fast before. I thought it was a fighter jet at first, but the 180 degree turn and continued propulsion was nothing I have seen in any military or commercial aircraft. Once toward me it gave a brilliant white spot light. This light was quite strong. It dissipated quickly with the direction change. The white light did not reflect or project to nearby surroundings. With the white light now gone an appearance of a green cigar-shaped streak continued now south. The appearance was exact as when I first caught a glimpse. Very fast 180 with apparently no reduction in speed. I reached for my phone which was almost in my hand to begin with. One look away and it was gone. Absolutely no sound. There were no aircraft in the area at the time. I would put the speed near 15 times of normal commercial aircraft that taxi over Halifax which are \"always\" traveling south and move north toward runway -- approximately 4 thousand mph. I have seen a lot of aircraft. This was nothing I even come close to recognizing."],"Country":"Canada","Object Features":"Unknown","Object Shape":"Cigar","Viewing Distance":"Over One Mile","Source":"MUFON","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/47909.html.txt","/var/www/straped/mufon/org/47909.html"],"Weather Factors":"Unknown","Longitude":"-63.57532","Latitude":"44.648862","Tags":"City","Region":"Nova Scotia","Summary":"Green streak N abrupt 180 turn one bright light toward me, then green away S","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=44.648862,+-63.57532(47909)&iwloc=A&hl=en\"> mufon case (47909) map </A>","Disposition":"Unresolved","trends":["There have been 22 other sightings in Halifax","There were no other sightings in Halifax on or around June 5th 2013"],"Date of the Event":"06/05/2013 10:22 UTC","Case Number":"47909","Date Submitted":"06/05/2013 10:06 UTC","Log Number":"CA-06052013-0031"}