{"trends":["There have been 13 other sightings in Traverse City","There were no other sightings in Traverse City on or around May 4th 2013"],"Region":"Michigan","Object Features":"Unknown","Latitude":"44.75813","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","divs":["Sighting DetailsI went outside at about 10:45 pm to move my car off the street for the evening when I noticed a very bright orange object coming from the east. I walked out to my back yard and watched the object move from the east over my position just below some low clouds to the west before it vanished into the clouds. I thought it might be some kind of slow moving meteor. I turned north to go move my car when I noticed two more bright objects coming from the north over Grand Traverse Bay. All three objects then moved west at a slow speed and vanished. I stood in my back yard in for around five minutes wondering about what I had just observed when a fourth object moving from the east appeared. The fourth object was above cloud level and was no longer visible once it came over my position. I live close to the airport and noticed that I could hear a chopper running, however it seemed to stay at the airport. I would estimate that the sighting lasted about 4-5 minutes for the first three objects and 1-2 minutes for the fourth object."],"Log Number":"US-06052013-0025","map":"<A HREF = \"http://maps.google.com/maps?q=44.75813,+-85.62834(47903)&iwloc=A&hl=en\"> mufon case (47903) map </A>","Sighting Duration":"Undisclosed","Date of the Event":"05/04/2013 10:45 UTC","files":["/var/www/straped/mufon/html2text/47903.html.txt","/var/www/straped/mufon/org/47903.html"],"Object Shape":"Fireball","Weather Factors":"Unknown","Country":"United States","Date Submitted":"06/05/2013 04:39 UTC","Object Flight Path":"Straight-line path,Path with directional change","Longitude":"-85.62834","Source":"MUFON","City":"Traverse City","Case Number":"47903","Summary":"Four bright meteor like objects passed over Traverse City."}