{"Weather Factors":"Unknown","Region":"Wyoming","Country":"United States","Source":"MUFON","Summary":"3 small white orbs flying in formation over Alta, WY in Teton Valley (WY/ID)","Sighting Duration":"Undisclosed","Object Features":"None","Object Flight Path":"Path with directional change","Disposition":"Unresolved","Date Submitted":"06/06/2013 12:55 UTC","Viewing Distance":"501 Feet - 1 Mile","City":"Alta","Latitude":"43.758702","Date of the Event":"06/05/2013 10:00 UTC","Longitude":"-111.054154","divs":["Sighting Details First caught sight of object about 60* on southern horizon while standing on the front porch. (From Targhee Towne subdivision, just over the Wyoming state line in Teton Valley, near Driggs, Idaho) Larger than a star or planet, flying under 1 mile altitude. Object glowed white, looked like a single object, but when observed with binoculars, was actually 3 objects flying in tight triangular formation. Orbs moved silently northeast, curving in a wide arc, till they began to go through cloud cover. My husband, daughter and I moved to the back porch, looking through binoculars. My daughter got a great look at the formation through the binoculars of the 3 orbs before they ducked behind the clouds. At this point, the orbs were out of sight for less than a minute, then re-appeared as they continued traveling up over the mountains, just to the north of the Grand Teton. Looks like they flew right over Mary's Nipple up by Targhee Resort, about 6 miles away. Seeing strange things in the night sky is a regular thing in this Valley - I'll sign on again soon, and give a timeline of other various events over the years, with full details. Always happy to see our friends from way, way, way out of town :) I must admit, it's a beautiful place to sight-see. Although based on their past behavior, I think they were most probably checking out water resources in Alaska Basin. (I've seen about a dozen of these formations flying in and out of the basin over the years.) Objects eventually went over the mountains, dropping down below our line of sight. Entire encounter lasted about 4 minutes. ~3 White, glowing lights, no pulsing, steady curved flight-path, no sound, no vibration (sometimes you feel a charge while they pass over). We've had several sightings similar to this. ~Myself, my husband, and our 13 year old daughter were all witness to this encounter. If anyone wants to get together and chat about it - find me: Chris, in Targhee Towne, with the big garden. Folks will know who I am."],"map":"<A HREF = \"http://maps.google.com/maps?q=43.758702,+-111.054154(47915)&iwloc=A&hl=en\"> mufon case (47915) map </A>","trends":["There has been one other sighting in Alta","There were no other sightings in Alta on or around June 5th 2013"],"Object Shape":"Circle","Case Number":"47915","files":["/var/www/straped/mufon/html2text/47915.html.txt","/var/www/straped/mufon/org/47915.html"],"Log Number":"US-06062013-0002","Tags":"City"}