{"Object Flight Path":"Straight-line path","Object Shape":"Star-like","Region":"California","files":["/var/www/straped/mufon/html2text/47910.html.txt","/var/www/straped/mufon/org/47910.html"],"Disposition":"Unresolved","Country":"United States","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Longitude":"-115.948521","divs":["sighting detailsi was outside my house on flame avenue in salton city, ca admiring the amount of stars we could see that night. i noticed the object because i was scanning the sky for bright stars and planets. initially, i thought it was a star. when j noticed it moving, i thought it was a satellite. when i noticed it move very quickly, i realized it couldn't be a satellite. it picked up speed and disappeared outward into space. immediately after it did that, 2 government fighter jets flew by our house. i'm presuming due to the object. when i saw it, i was excited. when i was a 14 year old girl, i was lucky enough to witness a strange red\\orange ufo above me at the park in newport beach, ca. so after this small sighting at 28 years old (and this was nothing compared to my experience as a 14 year old) i was happy and elated to have seen something remotely similar. it helps to confirm a memory that is so profound in my life and my belief system. i lost sight of the object when it flew outward, away from our planet."],"Date of the Event":"06/04/2013 10:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.3015,+-115.948521(47910)&iwloc=A&hl=en\"> mufon case (47910) map </A>","Tags":"City","Latitude":"33.3015","trends":["There have been 4 other sightings in Salton City","There were no other sightings in Salton City on or around June 4th 2013"],"Source":"MUFON","Log Number":"US-06052013-0032","Object Features":"Unknown","Sighting Duration":"Undisclosed","City":"Salton City","Case Number":"47910","Date Submitted":"06/05/2013 10:38 UTC","Summary":"I saw what I thought was a star. Noticed it moving and thought it was a satellite. Then it picked up to a very fast speed and disappeared outward into space. Immediately then, two government fighter jets flew by as well. & into space."}