{"Sighting Duration":"Undisclosed","Summary":"Strange organic-type UFO with appendages","Case Number":"47914","Tags":"City","Object Shape":"Unknown","Date of the Event":"06/05/2013 05:45 UTC","Object Features":"Appendage(s), Other","Country":"United States","Log Number":"US-06062013-0001","trends":["There have been 579 other sightings in New York","There were 2 other sightings in New York on or around June 5th 2013","This sighting has never been favorited.",""],"Latitude":"40.774738","files":["/var/www/straped/mufon/html2text/47914.html.txt","/var/www/straped/mufon/more/47914_submitter_file1__IMG0283.JPG","/var/www/straped/mufon/more/47914_submitter_file2__OrganicUFObig.jpg","/var/www/straped/mufon/org/47914.html"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.774738,+-73.825694(47914)&iwloc=A&hl=en\"> mufon case (47914) map </A>","Source":"MUFON","Viewing Distance":"Over One Mile","divs":["sighting detailsi live and work in flushing, queens. i'd gone with my family in the evening of 6\\5\\2013 to watch my son's spring concert over at this school. upon traveling by foot, we first noticed it while walking east. the object was hovering in the south direction. luckily i had brought my new camera to record the school production. this occurred at about 5:40ish. we stood and watched it periodically and noticed it hadn't moved at all. it just floated there at a very high altitude. i snapped several shots and kept getting nothing at first. my camera is a cannon powershot sx500 and capable of zooming in quite a long distance while maintaining detail. it wasn't until we got to my son's school (still monitoring the object to make sure it was still there) that i brought it to other parents' attention. there were over 30 people all outside waiting to be let into the school. quickly, all eyes were turned to the skies. many met what they were seeing with confusion, keen interest and some skeptic. soon, even the skeptics were unsure what they were seeing with their own 2 eyes. the object was still hovering and unmoved. still giving off some kind of odd glow. after 4 more attempts with the camera, i finally managed to get it. it didn't take long for all those who witnessed what i'd seen, to be convinced, whether they believe in et's or not, that this was simply not something man-made, but rather some kind of organic life form. the object was gone once i left the school an hour later, with no trace of where it had gone to. i am excited and pleased to have a very clear photo of the sighting. i am hoping someone out there can tell me what this thing is!"],"Longitude":"-73.825694","Object Flight Path":"Stationary,Hovering then path","Disposition":"Unresolved","Date Submitted":"06/06/2013 12:22 UTC","Region":"New York","City":"New York"}