{"Country":"United States","Object Shape":"Fireball, Oval","Region":"Florida","trends":["There have been no other sightings in Miami Gardens","This sighting has never been favorited."],"divs":["Sighting DetailsAbout 8:15 pm twilight on a very raining day, I stepped outside the house to close the gate left open. when I looked to my left (SW) I saw an object hovering slowly towards my direction above the tallest trees, it looked like a fire lit chinese lantern, but it was a clear glass dome with the fire flickering inside flat grey bottom. I got upset thinking it was heading towards the trees in our yard, above the house and it kept going at about 10 miles per hour. I thought some careless person lit it up and it could cause a fire. the object never dropped down it kept going on a steady path going NE. One of my neighbors from accross the street drove up to his driveway and got out with his child and stood observing it also. I told him that could cause a fire. He nodded towards me, but never took his eyes off of it. I went inside to tell my husband. He looked at me like are you sure thats what you saw?. I posted the incident on my facebook after realizing I may have seen another UFO. I felt like an idiot, it never crossed my mind. It was raining, and it hovered in a windless looking path. Also the fact that it was see through, it look like a glass dome, which would be too heavy to be caught up on a wind stream. I was baffled, so finally I doing this report. I've yet to speak to the neighbor but my husband said he would. End of report."],"Weather Factors":"Unknown","Tags":"City","Disposition":"Unresolved","Latitude":"25.923482","files":["/var/www/straped/mufon/html2text/47921.html.txt","/var/www/straped/mufon/org/47921.html"],"City":"Miami Gardens","Viewing Distance":"20 Feet or Less","Date of the Event":"06/03/2013 08:15 UTC","Summary":"Glass like dome with a orange yellow fire inside floating like a chinese latern.","Sighting Duration":"Undisclosed","Case Number":"47921","Source":"MUFON","Object Features":"Dome","Longitude":"-80.265957","map":"<A HREF = \"http://maps.google.com/maps?q=25.923482,+-80.265957(47921)&iwloc=A&hl=en\"> mufon case (47921) map </A>","Log Number":"US-06062013-0008","Date Submitted":"06/06/2013 09:49 UTC","Object Flight Path":"Hovering then path"}