{"City":"Clarkston","Date of the Event":"06/15/2009 01:01 UTC","Log Number":"US-06062013-0009","trends":["There have been 10 other sightings in Clarkston","There were no other sightings in Clarkston on or around June 15th 2009"],"Object Shape":"Star-like, Triangle","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=42.70679,+-83.426115(47922)&iwloc=A&hl=en\"> mufon case (47922) map </A>","divs":["sighting details(historical case events timeline) jun 2009 at 01:01am; five mornings in a row, red light, fixed position in the east, appears to be 300 feet away, clarkston, mi. witness (a) walks out onto deck at exactly same time 5 mornings in succession, watches red pulsating light for 5 to 10 minutes, returns inside and goes to bed. witness did not observe the appearance nor disappearance of the red lighted object. \\ jun 2009 at 01:01am; witness (a) walks out onto deck, on the sixth successive morning, at exactly same time, observes orange pulsating, glowing light, at the same fixed position in the east, 300 feet away. orange light morfs into a black triangle with 3 white lights at the corners, with the domed orange light on the bottom, a little forward of center, shines down upon the water of nearby lake, 300 feet away, the black triangle is about 300 feet long, appears as a 8 to 9 foot thick triangle with embossed raised black chinese type lettering along this surface, black lettering on black surface, long white lighted window full length of rear surface, the black triangle follows the perimeter of a small lake as if searching for something. witness did not observe the appearance of the orange light nor disappearance of black triangle, clarkston, mi \\ jun2012 evenings, time unknown; five evenings in succession, a group of lights, multi-colors; white-red-green-blue, observed in the eastern sky traveling in a circle, with a black center, sometimes in slightly different locations in eastern sky, fenton, mi. \\ dec 2012 evenings, time unknown; several evenings in a row, a group of lights, multi-colors; white-red-green-blue, observed in the eastern sky traveling in a circle, with a black center, sometimes in slightly different locations in eastern sky, fenton, mi."],"Sighting Duration":"00:07:00","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/47922.html.txt","/var/www/straped/mufon/org/47922.html"],"Date Submitted":"06/06/2013 11:20 UTC","Longitude":"-83.426115","Region":"Michigan","Viewing Distance":"101-500 Feet","Tags":"City","Summary":"(by cfi djs) Red pulsating light fixed position / Orange pulsating light same position, morfs into black triangle / Multi-color lights traveling in circular pattern","Object Flight Path":"Hovering then path,Path with directional change","Object Features":"Window(s), Insignia","Latitude":"42.70679","Case Number":"47922","Source":"MUFON","Country":"United States"}