{"divs":["Sighting DetailsI was on my way home from my parents house with my wife though we took seperate cars, and as a UFO beliver I always like watching the sky for anything unusal. Driving down Alburtis Rd towards Macungie, PA I thought i saw a low flying object in the near distance but was blocked by the shipping warehouse after first seeing it. I was aproching the turn by Mack trucks and saw another car pulled off to the side of the road ( i do not know if they were there to watch the object or for other reasons) though they were pulled over at an odd spot. I drove up the road a bit and pulled over my the school bus depot. From there i rolled down my windows and observed the object for roughly 5 min then it moved slowly towards the mountains. After i lost it behind the trees I decided to head home knowing my wife would be wondering why i was so late though i wanted to follow it(just to deterime if it was a helicopter). Total time seeing the object in that spot would be roughtly 10 min though most likely slightly less. The object itself was low flying if i had to geuss i would say 300ft and it was just red light i was trying to see probing white light (like most natural aircraft) but did not see it. To be honest if i had to say it was most likely a helicopter but the bright red lights and lack of sound espcially for being seemingly so close made me think it could be somthing else. I work and live near the hospital and can hear their helicopter all the time and this seemed to be slightly lower too. I was just goin to let it go till i read an article today about MUFON Case #47879 in Reading whitch isnt too far away. Perhaps there is some corilation"],"Latitude":"40.498286","Tags":"City","Summary":"Maybe Just A Helicopter - But lacked Sound","Source":"MUFON","Case Number":"47927","Sighting Duration":"Undisclosed","Longitude":"-75.591274","Disposition":"Unresolved","Country":"United States","Date Submitted":"06/06/2013 03:52 UTC","Date of the Event":"06/05/2013 09:30 UTC","trends":["There has been one other sighting in Macungie","There were no other sightings in Macungie on or around June 5th 2013"],"Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/47927.html.txt","/var/www/straped/mufon/org/47927.html"],"Region":"Pennsylvania","Log Number":"US-06062013-0014","City":"Macungie","map":"<A HREF = \"http://maps.google.com/maps?q=40.498286,+-75.591274(47927)&iwloc=A&hl=en\"> mufon case (47927) map </A>","Object Shape":"Unknown","Object Flight Path":"Hovering then path","Weather Factors":"Unknown"}