{"Latitude":"48.574823","Date Submitted":"06/06/2013 11:24 UTC","Date of the Event":"06/05/2012 03:50 UTC","Summary":"Bright unblingking white light crossed the sky in three minutes.","Object Shape":"Unknown","trends":["There have been no other sightings in Amos","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/47935.html.txt","/var/www/straped/mufon/more/47935_submitter_file1__ovni05juin.jpg","/var/www/straped/mufon/org/47935.html"],"Log Number":"CA-06062013-0022","Object Features":"Unknown","Longitude":"-78.120293","Disposition":"Unresolved","Country":"Canada","divs":["Sighting DetailsShortly before 4:00AM, as I couldn't sleep I got up and dressed. I then looked out from my bedroom window facing west and immediately noticed a bright white light over the NW horizon, too bright to be a planet or a star. (It was about 3 to 4 times brighter than Venus can be at it's brightest.) I kept looking and noticed it was moving slowly without blinking. I got out to have a better look. I realised it didn't look like the jet airplanes I sometimes see in the sky. No blinking lights, just one very bright light. I went back inside and got my camera (Lumix DMC-FZ28, with an 18x zoom) and managed to film 40 seconds of it. In all, it was visible for about three minutes before it disappeared below the SE horizon. When I first saw it NW, it was about 25 degres. At its highest, facing south, about 35 degrees. I guess it must always have been more than one mile away. The observation occured between 3:50 and 3:55 AM. At this latitude, date and time, it's still night but the NE horizon is already turning blue. It was a clear sky. It was not a conventional plane, helicopter, satellite or chinese lantern. It looked white to the naked eye but the recording reveals colors"],"Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=48.574823,+-78.120293(47935)&iwloc=A&hl=en\"> mufon case (47935) map </A>","City":"Amos","Region":"Quebec","Viewing Distance":"Over One Mile","Case Number":"47935","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","Tags":"City"}