{"Source":"MUFON","City":"Fowler","Date of the Event":"06/05/2013 10:00 UTC","trends":["There have been 7 other sightings in Fowler","There was one other sighting in Fowler on or around June 5th 2013"],"Date Submitted":"06/07/2013 03:20 UTC","files":["/var/www/straped/mufon/html2text/47939.html.txt","/var/www/straped/mufon/org/47939.html"],"Sighting Duration":"00:30:00","Object Shape":"Circle, Fireball, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=36.616115,+-119.691458(47939)&iwloc=A&hl=en\"> mufon case (47939) map </A>","Case Number":"47939","Object Features":"None","Disposition":"Unresolved","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Weather Factors":"Unknown","Log Number":"US-06072013-0004","Tags":"City","Region":"California","Country":"United States","divs":["Sighting DetailsI live in a small town of 5,000 I live out in the country surrounded by grape vineyards. It is pretty quiet out here. At 10:00 PM on June 5, 2013 I seen from inside my window an orange object that caught my eye above a wide tree down the road from my home. I went out on our front porch steps looking at it also with my binoculars. It hovered at first. Then very slowly moved from left to right over the tree tops. Then slowing going at a snail pace speed it then moved down behind the trees then back out again. Then I seen a small plane with a white blinking light passing the object above heading south. The plane then turned back around towards the object looked as if to view it. Then the plane headed not South like it was but, North away from the object and left. Minutes later, I noticed two other planes coming from the north heading towards the object not getting too close circling it then left. The object then went further away heading west until it disappeared out of view. This object was NOT blinking and was silent. I watched it for 30 minutes. knowing it was not a plane at all. I was amazed I was able to see such a sight. 3 days prior to this event I was awoken by what sounded like a Military Helicopter around 1:30 in the morning. I am familiar with those sounds because, my husband used to be in the Army. The sound came above our house and lasted for several minutes driving me crazy. It was loud. No lights from the helicopter, just sound. I couldn't see anything and went back to bed. I have reported another UFO event I witnessed to the Sanger Paranormal Society. Two now to them. This last event to them b y email earlier tonight. I am the first Fowler resident that had reported UFO activity to the Sanger UFO Society they said. The weather that night when i seen that orange glowing object was perfect. Not hot not cold. Maybe a very light breeze. Clear night sky. I forgot to take any photos. Thank you"],"Longitude":"-119.691458","Summary":"Bright, glowing silent orange ball","Viewing Distance":"Over One Mile","Latitude":"36.616115"}