{"map":"<A HREF = \"http://maps.google.com/maps?q=36.783901,+-119.409322(47946)&iwloc=A&hl=en\"> mufon case (47946) map </A>","Longitude":"-119.409322","Object Flight Path":"Stationary","Case Number":"47946","Object Features":"Unknown","Viewing Distance":"Unknown","City":"Huintington Beach","divs":["Sighting DetailsI was walking from my garage back into the house when i felt the need to look up. I looke up and saw a star like orb. It looked just like a star but at mid day. It was stationary and very high up. The wind was blowing clousds by so I knew it was not a baloon. I was calling for my wife to witness as I ran to get video camera. While filming it was hard to see through flip out lense so it appears to move as i try to focus. The picture is a screen shot and shows good detail. While filming is dissapeared. I assume it went straight up. I saw one these a year ago and filmed whith my eye phone, not as good but same object. that sight had 3 in a triangle formation and an internet blog reported my sighting wioth several other people. this was the same except that went shot sideways at lightning spead and dissapeareded beyond clouds. That night I had very extreme dreams of being out of body. My wife reported me shaking and kicking while asleep. I remember being able to leave my body and float and be turned over and over.. Do not know what this was. Did anyone else see this in Huntington Beach on this day and time?"],"Summary":"Saw a star like orb in miday. Windy daw with clouds blowing by. Orb stayed stationary. Looked brighter than the sun. Hovered and the went straight up in seconds and then gone. Have video and photo","Country":"United States","Latitude":"36.783901","Disposition":"Unresolved","Weather Factors":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Log Number":"US-06072013-0011","Date of the Event":"05/25/2013 01:15 UTC","Tags":"City","Region":"California","Date Submitted":"06/07/2013 01:32 UTC","files":["/var/www/straped/mufon/html2text/47946.html.txt","/var/www/straped/mufon/org/47946.html"],"Object Shape":"Sphere, Star-like","trends":["There have been no other sightings in Huintington Beach","This sighting has never been favorited."]}