{"Latitude":"40.250655","Tags":"City","files":["/var/www/straped/mufon/html2text/47948.html.txt","/var/www/straped/mufon/org/47948.html"],"Longitude":"-80.184819","Log Number":"US-06072013-0013","Case Number":"47948","Summary":"saw a large orange/red light over a house as i was driving home. Stopped in shock...remembered my cell phone took 8 photos.","trends":["There have been 3 other sightings in Canonsburg","There were no other sightings in Canonsburg on or around October 22nd 2012"],"Object Shape":"Sphere","Object Features":"Unknown","divs":["sighting detailsi was driving up the hill towards my home when i noticed a large orang\\red orb hovering over a house....i thought to myself.what the hell is that...i found myself stopping my car in the middle of the road...got out of my car and it started to ascend, at which point i was saying out load what the f--- is that! several times. it then stopped, at which point i thought to get my cell phone and try and capture pictures of what i was witnessing...which i did...at this point it stopped and changed paths 2 times within seconds it was super high up and significantly smaller....2 dots of light fell from the first orb then they dissappeared. when i got home a few minutes later i called my sister and other family members ...i was completely freaked out by this experience... when i looked at the pictures i captured they looked nothing like what i witnessed with my naked eye..i did capture it and you can see the distance within seconds it traveled..from very large, hovering over a house to appearing to be a star. also , in the pics you can see smoke in odd shapes that i did not notice with my eyes..i remember thinking why isnt any one comin out of there homes wondering what the hell i'm doing so i can show them."],"Date of the Event":"10/22/2012 08:30 UTC","Date Submitted":"06/07/2013 02:29 UTC","Country":"United States","Region":"Pennsylvania","Object Flight Path":"Hovering then path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=40.250655,+-80.184819(47948)&iwloc=A&hl=en\"> mufon case (47948) map </A>","Weather Factors":"Unknown","Disposition":"Unresolved","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","City":"Canonsburg","Sighting Duration":"Undisclosed"}