{"Weather Factors":"Unknown","Log Number":"AU-06072013-0006","files":["/var/www/straped/mufon/html2text/47941.html.txt","/var/www/straped/mufon/org/47941.html"],"Disposition":"Unresolved","Date of the Event":"01/10/2002 12:00 UTC","Object Shape":"Unknown","City":"East Fremantle","Summary":"Tall Nordic angular looking beings.","Viewing Distance":"Unknown","Tags":"City","Case Number":"47941","Date Submitted":"06/07/2013 05:14 UTC","Longitude":"115.752663","divs":["Sighting DetailsWatching television, time approximately 7 pm. I am always a late sleeper, usually in bed by 4 or 5 am. I was not employed, at this stage of my life. I felt and overwhelming sensation, to go to sleep. The T.V turned into a static screen. I turned it off and went to bed. In my mind, I heard a loud metallic type noise. It sounded like a freight train. It began at a low noise level and increased to a very loud level. As if some thing was approaching me. Oddly enough, as loud as this metallic noise was, it was not discomforting in any way. The impression that came to me, was that this noise was part of a tunneling process.Tunneling through space. I was then standing in a round room, with 3 beings in front of me. The room, for the lack of a better word. Was a gun metal grey color,completely smooth. Instinct told me, perhaps a vessel of some kind. This room was completely empty of any structures. As my mind turned it's attention, back to the beings. The tallest of these beings, who I approximate was at least 11 ft tall. Was seated on a gun metal grey color chair, more like a throne to be precise. Behind him seemed to be a screen, though it was the same color as the room. It gave me the impression that it was a screen, due to the gaps or edges that defined it from the wall or room surface. This screen would have been about, 15 ft in length and 5 ft in height. He possessed angular features, from head to feet. He had long white hair, at least to his elbows. He wore a grey type flight suit, my best description. To his right hand side was another male being, similar looks, but about 10 ft tall. To his left was a female, about 9, 9 and half ft tall. The seated being seemed to be the one in charge. From what I have come to understand, through telepathy is how we communicated. I asked him, \" Why do you not show yourself to mankind? \" As his answer was being heard in my mind, the room transformed itself. For the lack of a better word. To a scene from World war 1. That was my impression. \" Mankind is a violent species, you are not yet ready. \" While my mind was hearing this, I took in visually the death and destruction around me. I seemed to be in a cratered and muddy field. It was dark, not so dark. Perhaps just after sun set. Bodies ever where, men running past me with bayonets fastened to their weapons. Charging an unseen enemy. I could see smoke and explosions erupting every where. I could see me falling, to the ground with anguished looks on their faces. It is if I was really there. Except that there was absolutely no noise, nor did I feel any fear. My next recollection was waking up at home, at about 1 am I guess. The T.V was on."],"Region":"Western Australia","Object Flight Path":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=-32.054541,+115.752663(47941)&iwloc=A&hl=en\"> mufon case (47941) map </A>","Country":"Australia","Object Features":"Unknown","Source":"MUFON","Latitude":"-32.054541","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in East Fremantle","This sighting has been favorited 1 time."]}