{"Date of the Event":"05/30/2013 12:00 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/47942.html.txt","/var/www/straped/mufon/org/47942.html"],"Disposition":"Unresolved","Summary":"Blue triangle over Charleston WV","Longitude":"-81.651446","Weather Factors":"Unknown","Object Shape":"Triangle","trends":["There have been 13 other sightings in Charleston","There were no other sightings in Charleston on or around May 30th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.354577,+-81.651446(47942)&iwloc=A&hl=en\"> mufon case (47942) map </A>","Log Number":"US-06072013-0007","Viewing Distance":"Over One Mile","Object Flight Path":"Hovering then path","divs":["Sighting DetailsMy British husband and I were driving through Charleston WV and on our way to KC,KS to pick up a puppy the following day. We were driving on I64 East at night looking off into the highway horizon. It was a clear night and out of nowhere a blue 3 light triangle appeared suddenly out of nowhere in one spot. I didn't see any nearby aircraft. At first I assumed it was an airplane and thought nothing of it...........until it moved. The way it moved was unlike anything I have ever seen even in advanced maneuvers. It suddenly moved down and over in a U shape at almost lightening speed then simply vanished into thin air. It didn't gradually fade away as if it were flying off into the distance like an airplane or helicopter.....nor can an airplane or helicopter move that particular way at that inhuman speed. I'm not making a call on what it is or whether its alien or not. I just know what I saw and although that night I didn't think much of it because my focus was on my drive and my trip....when I got back to work and started investigating what I saw I discovered that triangles are one of the most commonly seen UFO's. Then I saw all the photos.....the videos, the stories. Whoa. So So my husband and I felt the need to report it. We're both 45 and I've never believed one way or another in what they may be or may not be. I'm simply reporting what we both saw that night."],"Date Submitted":"06/07/2013 07:44 UTC","Case Number":"47942","Object Features":"Unknown","Region":"West Virginia","Latitude":"38.354577","City":"Charleston","Country":"United States","Source":"MUFON","Tags":"City"}