{"Longitude":"-120.836984","Source":"MUFON","Object Shape":"Star-like","Region":"California","Latitude":"37.495817","Country":"United States","divs":["Sighting DetailsDog was barking so I let him out and he ran towards a small bush, and then lost interest in it, then I looked to the East a saw a light blink just once and then it blink again it didn't have any running lights or stay lite up so when it blink I flash my light at it, when I did that it blink back and this happend for a few minutes. At one point it move from going to the North-West back to the East not much and blink and went back to approxmently where it was before and blink again and this took only about 1 secound, and it continue to move North-West, and we kept blinking about every secound or so and at one point it started to flash but dimed down real quick I flashed back but it didn't flash back, then I could here a Jet go over head from the South -West, and went to where the object has been. After the jet left I flashed my light again but didn't get no response, and that was the end of that. When I got back into bed I looked at my phone and it showed 3:16, I don't know how long I was in the back yard trying to get the object back but I would guess 15 minutes. And so I'm guessing this all happend around 3AM,6-7-2013. On the question 1. Watching my dog and looking at the stars 2. It was pretty bright when it lite up 3. I was hoping it would flash back and come towards me and make contact 4. It was moving North-West, and when we started to flash the light at each othere it would make quick movements and flash at the same time intill the Jet came, and in the middle of a flash from the object it went dim and out and that was the last time we made contact. 5I was not afraid and wanted to make contact with the object. 6. It dimed out."],"files":["/var/www/straped/mufon/html2text/47950.html.txt","/var/www/straped/mufon/org/47950.html"],"Tags":"City","Date Submitted":"06/07/2013 04:53 UTC","Summary":"Dog was barking in the morning, I let him out and went out myself with my flash light and would shine it in the air.","Disposition":"Unresolved","Sighting Duration":"00:03:00","trends":["There have been 8 other sightings in Turlock","There were no other sightings in Turlock on or around June 7th 2013"],"City":"Turlock","Viewing Distance":"Over One Mile","Date of the Event":"06/07/2013 12:00 UTC","Case Number":"47950","Object Flight Path":"Path with directional change","Log Number":"US-06072013-0014","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.495817,+-120.836984(47950)&iwloc=A&hl=en\"> mufon case (47950) map </A>","Weather Factors":"Unknown"}