{"Date of the Event":"01/01/2000 01:15 UTC","Disposition":"Unknown","Source":"MUFON","Weather Factors":"None","Region":"District of Columbia","Date Submitted":"01/01/2000 01:15 UTC","Object Flight Path":"Straight-line path","Case Number":"4796","Object Features":"Patterned Surface","Country":"United States","Longitude":"-77.031606","Object Shape":"Cylinder","Summary":"Amber-lit apparent cylindrical objects, approx 8, flying in straight line on same trajectory","City":"Washington","Tags":"City","Viewing Distance":"101-500 Feet","Latitude":"38.904412","map":"<A HREF = \"http://maps.google.com/maps?q=38.904412,+-77.031606(4796)&iwloc=A&hl=en\"> mufon case (4796) map </A>","Sighting Duration":"00:02:00","files":["/var/www/straped/mufon/html2text/4796.html.txt","/var/www/straped/mufon/org/4796.html"],"Log Number":"US-05182006-0002","divs":["Sighting DetailsI was on my way to the Foggy Bottom Metro Station in downtown Washington DC (George Washington University campus area). It was very crowded and slow moving toward the station's escalators, as this was after the \"2000\" celebration on the National Mall. One friend was with me, but did not see the UFOs. At first I was not really watching the sky, but saw out of the corner of my eye what I \"thought\" was a shooting star (but it would have to have been a really big shooting star!). I even said something to my friend, who wasn't really paying attention. So now I was watching the skies while very slowly moving from the street to the top of the escalators. That's when I started to see these very strange looking objects fly over downtown. I estimate I saw a total of about 8 objects; I saw 2 groups of 2 objects each flying very close together, but the others were \"by themselves\", although all 8 or so objects were flying in a straight line, one after another. Several seconds would elapse between one object and another (or pair of objects). I assume they were cylindrical shaped based on the peculiar lighting I saw. They all appeared the same. After \"seeing\" the \"shooting star\" (which most likely was one of these objects), the first I truly SAW must have been two of these objects very close to each other (which looked even stranger); after seeing a few not flying so close, I determined that they were all this cylindrical shape, rather than 2 shapes. They flew from a WNW direction to a ESE direction, almost directly above where I was at the time (slightly south of my position), and I estimate that their trajectory, if unchanged, would have had them pass over the White House and the US Capitol. No turns, no curves, no change in altitude...just a straight flyover, horizon to horizon. I had much more of a western horizon than an eastern horizon, as there was some park-like space beyond the escalators to the west, but 12-story buildings elsewhere, including to my east; therefore I saw them approach more than I saw them depart. I noticed no typical aircraft noise at all; however, it was a very noisy crowd I was in at the time...but the altitude of these seemed low enough that if they were conventional aircraft, some noise should have been noticed in spite of the crowd. I was quite stunned throughout the event. It is the most unusual thing(s) I have ever seen in the sky (unless I saw some in my early childhood, which is possible). I only said, and not loudly, at one point during the flyover, \"Am I seeing UFOs?\" My friend was not paying attention at all, but a bystander, a young man, just glanced at me and smiled politely. I did not notice anyone else observing these, but I wasn't really paying attention to the people around me at this time...in fact, I found myself suddenly at the top of the escalator. I wish I would have turned around and stayed longer to see if I could see more of these, but I was surrounded (the crowd was like sardines) and the only way seemed to be \"down\" at that point, so I and my friend entered the station like everyone else. It occurred to me that I had seen something very unusual and significant. I had a \"semi-belief\" in extraterrestrial life and UFOs prior to this, but this was just entertaining speculation. This event changed all of that. Now I was \"one of them\"....one of \"those people\" who have seen such things. So, in a way, it seemed like an \"initiation\". Certainly a \"paradigm shift\", and made a believer out of me for certain. I told my friend after we got seated on a Metro train about what I saw, asked her if she saw them. She said she did not, and she gave me a \"funny\" smiling look, like she was trying not to laugh. I will attach a Powerpoint presentation that made, which I presented last December at the Colorado MUFON meeting and holiday potluck. John Schuessler of Int'l MUFON was present as well. I will also attach a shorter one about a sighting I heard about around 1997, from a friend who worked at the CIA (Langley)."],"trends":["There have been 54 other sightings in Washington","There was one other sighting in Washington on or around January 1st 2000","This sighting has never been favorited.",""]}