{"divs":["Sighting DetailsI was walking the dog with my eldest daughter at 11:00pm, when I pointed to the sky and said pointing at the stars \"Look how pretty\", \"Who do you think made those?\" and just before I was about to go back in the home I looked to my left as I was facing my home and saw two red orbs flying in the distance, Orbs or red lights. We have a small airport nearby so I am accustomed to seeing small aircraft. This was no ordinary aircraft. Made no sound whatsoever, had no blinking lights indicating left or right wing. Just appeared as a glowing red object. I pointed it out to my daughter and she told me that she had seen that as well. As we watched, I realized there were two side by side or appeared in unison and then another came into view, then a fourth and a fifth. They seemed to be traveling at a normal rate of speed, similar to a helicopter I guess. They were coming from the south and traveling north east or just north. I remember seeing videos on the news where people explained away sightings like this saying that these were Chinese lanterns, I promise you they were not. I kept looking to see if I saw some flickering like a flame or watched to see if they appeared to be swept by the wind similar to a helium balloon and they did not. They appeared to be following each other. I told my daughter to get inside my truck and got my other two little ones in the truck as well. I grabbed my cell phone and tried recording. My recording is not very clear. It had a hard time trying to focus on the object itself. On my recording you can see an orb, it appears white on video but it was definitely red. I tried following them in the truck once I stopped recording. But by then they were almost completely out of sight. While trying to follow I did feel disoriented but I'm guessing that is probably due to feeling shocked about what I was seeing. I would like to mention that I have never seen anything like this at all, I am not even into U.F.O. sightings etc. But what I saw was real and I would love to know exactly what that those things were."],"Weather Factors":"Unknown","Object Features":"None","Region":"Florida","Tags":"City","City":"Wesley Chapel","Date Submitted":"06/08/2013 02:32 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=28.184611,+-82.344416(47962)&iwloc=A&hl=en\"> mufon case (47962) map </A>","Summary":"Me and my children witnessed 5 orbs come into view slowly, two in formation or unison and three others trailing.","Object Flight Path":"Path with directional change","Disposition":"Unresolved","Object Shape":"Fireball","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-06082013-0003","Country":"United States","Latitude":"28.184611","Date of the Event":"06/07/2013 11:00 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/47962.html.txt","/var/www/straped/mufon/org/47962.html"],"Longitude":"-82.344416","trends":["There have been 7 other sightings in Wesley Chapel","There were no other sightings in Wesley Chapel on or around June 7th 2013"],"Case Number":"47962"}