{"Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=33.713331,+-115.400429(47973)&iwloc=A&hl=en\"> mufon case (47973) map </A>","trends":["There has been one other sighting in Desert Center","There were no other sightings in Desert Center on or around November 20th 2012"],"City":"Desert Center","Region":"California","Longitude":"-115.400429","files":["/var/www/straped/mufon/html2text/47973.html.txt","/var/www/straped/mufon/org/47973.html"],"Object Shape":"Unknown","Summary":"Pulsating white light observed slowly moving toward me until passed overhead.","Tags":"City","Object Features":"None","Log Number":"US-06082013-0014","Date of the Event":"11/20/2012 05:54 UTC","divs":["Sighting DetailsI was hiking in the Mojave Desert near Desert Center, CA when I met two men camping for the night to watch for UFOs. They'd been doing this at the same spot for over 20 years and said they'd always see them. At dusk we saw a bright light about 30 degrees above the horizon to the northeast. It was pulsating and moving very slowly toward us. I shot video of it and watched for 5 minutes or so, then went to other things, until I noticed it passing overhead, perhaps 10 minutes later. By then I could see other smaller lights on it, one red and an outline that could have been square but the sky was very dark. No strobe lights. No sound. And estimated altitude of 5,000 - 10,000 feet. I assumed it must be a plane and did not observe it further but we were in a very remote and uninhabited part of the desert and 80-100 miles from the nearest airport at Palm Springs. Since then I've researched and cannot find evidence of the single bright pulsating light on other planes. Multiple pulsating light systems are used when landing and taking off to warn off birds but we were too far from any airport for that. My feeling after seeing this is that it was unusual for the slow speed and the single pulsating light and the fact that it seemed to be used for a beacon to draw attention to it. There was no other air traffic at the time. Later that night we observed normal very high planes at 30,000 feet or more. If this light was a normal aircraft light I would like corroboration of that but until then it is \"unidentified\" in my mind."],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Latitude":"33.713331","Source":"MUFON","Case Number":"47973","Disposition":"Unresolved","Country":"United States","Date Submitted":"06/08/2013 04:50 UTC"}