{"Object Features":"Unknown","divs":["sighting detailstoday, june 8th 2013 around 4:30pm i heard a very loud noise while in my backyard. at first i could not identify the sound or where it was coming from. as it came closer i though it was a low plane or a helicopter about to crash. it is not uncommon to see planes from the airport (ne) or helicopters on the way to the hospital(s) here in london, ontario. i looked up and it was a white triangular shaped aircraft flying under the clouds. i did not see any lights, nor any markings. it was coming from ne heading sw. it disappeared out of sight over our trees. i did not think anything of it and figured it was a stealth from the air show in st thomas, ontario. i asked my boyfriend tonight if he heard it fly over today while he was out front of the house. he answered, no. which i thought was very odd because of how loud it was. then i looked up the st thomas air show, which is not till june 29\\30 2013. i have searched the internet for something that looks like what i saw. the closes thing was the a-12 avenger ii experimental stealth bomber or the boeing 797. i can not say for certain what i saw but thought it was interesting and wanted to share."],"Tags":"City","Object Shape":"Triangle","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Latitude":"42.979008","Log Number":"CA-06092013-0007","Viewing Distance":"Unknown","Region":"Ontario","trends":["There have been 32 other sightings in London","There were no other sightings in London on or around June 8th 2013"],"City":"London","Case Number":"47988","Source":"MUFON","Longitude":"-81.217164","Date Submitted":"06/09/2013 02:19 UTC","Country":"Canada","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Date of the Event":"06/08/2013 04:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.979008,+-81.217164(47988)&iwloc=A&hl=en\"> mufon case (47988) map </A>","Summary":"I heard a very loud noise. I though it was a low plane or a helicopter about to crash. white triangular shaped aircraft flying under the clouds in straight line. No light, nor any markings.","files":["/var/www/straped/mufon/html2text/47988.html.txt","/var/www/straped/mufon/org/47988.html"]}