{"Country":"United States","Date Submitted":"06/09/2013 05:16 UTC","files":["/var/www/straped/mufon/html2text/47989.html.txt","/var/www/straped/mufon/org/47989.html"],"Object Flight Path":"Path with directional change","Sighting Duration":"00:00:10","Latitude":"30.050553","map":"<A HREF = \"http://maps.google.com/maps?q=30.050553,+-99.132319(47989)&iwloc=A&hl=en\"> mufon case (47989) map </A>","trends":["There have been 3 other sightings in Kerrville","There were no other sightings in Kerrville on or around June 9th 2013"],"City":"Kerrville","Log Number":"US-06092013-0008","Date of the Event":"06/09/2013 01:30 UTC","Object Shape":"Flash","Longitude":"-99.132319","Summary":"Bright Green Light Falls, makes a drastic change in direction","Object Features":"Unknown","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Region":"Texas","divs":["Sighting DetailsI, and a couple of other witnesses, saw a lime green object- a lot like a shooting star, fall downward, but i knew instantly it wasnt a shooting star when it changed direction and shot itseft upward in the sky. It looked like a check mark...well if you were to draw one; thats the path it took. And there were two or three quick stops where it fell towards the horizon, then it froze for a split second, nearly blending with the stars around it, and then it continued to fall ... but made an immediate turn-around upward- something a comet or meteorite doesnt do. The experience trully gave me chills. I was with 3 other people at the time, they said the same thing. We saw the same color and we all saw the same flight path. We also saw another group of people 50 yards from us- down a trail from where we were and one woman said she saw the same thing. I am totally open to accept it may very well have been a firefly, a shooting star or crazy glow toy people throw- but i know distance- i think most people can tell the difference between a floating firefly and a sharp, fast, distant darting light in the sky. Im an artist and i have a good understanding of object placament and distance. It was my first UFO sighting- but who knows for sure."],"Tags":"City","Disposition":"Unresolved","Case Number":"47989","Source":"MUFON"}