{"Weather Factors":"Unknown","City":"Brighton","divs":["Sighting DetailsI was on the phone, smoking a cigarette, on my balcony around 11:30pm on June 8th, 2013 talking to my boyfriend (who lives in Ohio). I was talking to him about work and things (typical before bed) when I saw a bright orange and red pulsing object (which I initially concluded was a plane) fly upwards out of the south eastern sky. It was slightly the wrong direction as the local airport (Romulus, MI about 40 miles South East) and came up from the horizon like plane ascending. I observed the object moving upward and pulsing colors (Red and Orange) and began taking images and video with my phone (while the headset was connected and in my ears so there is bleed over audio from the call) of the object. Suddenly as it ascended another object appeared beneath it. Then there were three total in a vertical line formation moving upwards. As the first two disappeared into the lower clouds two more appeared (5 total with only 3 visible at a time). The first three objects moved upward (Northward) along the skyline and disappeared (very little clouds that high up, I could see stars behind them). I also noted an aircraft (Commercial Passenger) flying towards them over my apartment building heading south-eastern to the airport in a landing pattern. The pilot could have seen these lights as well as the airplane was facing them in its flight path towards Romulus. The airplane was close enough I could distinguish its shape and lights (as is usual) and flew underneath of the objects as they ascended. The fourth object moved north east at a 45 degree heading away from where it began ascending over the trees (breaking the 90 degree rising formation of the first three objects) and disappeared into the clouds just above the treeline. The fifth object, glowing the brightest orange and slightly red, flew upwards and was completely directly over top of me. I could see stars behind it and very little clouds. When it was directly over the apartment building (as high up as an airplane in high altitude, not close enough for the craft to visible in detail) it disappeared into the upper atmosphere and was gone. I waited for more lights or objects to appear and did not see any. My neighbors were coming and going during the entire event but did not take note and got in their cars and drove away."],"Tags":"City","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Longitude":"-83.77455","Date Submitted":"06/09/2013 12:31 UTC","Summary":"Pulsating orange and reddish color (5 objects)","map":"<A HREF = \"http://maps.google.com/maps?q=42.524021,+-83.77455(47984)&iwloc=A&hl=en\"> mufon case (47984) map </A>","Latitude":"42.524021","Country":"United States","Region":"Michigan","Object Shape":"Sphere","trends":["There have been 8 other sightings in Brighton","There were no other sightings in Brighton on or around June 8th 2013"],"Disposition":"Unresolved","Source":"MUFON","Date of the Event":"06/08/2013 11:39 UTC","Object Features":"Unknown","Log Number":"US-06092013-0003","Case Number":"47984","files":["/var/www/straped/mufon/html2text/47984.html.txt","/var/www/straped/mufon/org/47984.html"]}