{"divs":["Sighting DetailsWas driving home from Dave and Buster's with the kids it was around 10:00 pm and was looking at the sky and I saw this strange lights and they were very bright and they were at first in the formation of a kite(it seems like a kite to me), I ask my husband if he sees it and he said yes and it was just stars, then I ask my oldest child to look and she said that is no stars, stars are not that bright and that stars don't move, that's when I saw the formation changed its now more in a v shape and now they are in three's. There was maybe 12 or more I was trying to keep an eye on it and all of a sudden it was there then it just completely disappear, my husband keep insisting it was stars but there is no way that it was stars. I feel weird cause I don't know or cant explain what it was and I didn't want to frighten my youngest so I agreed it was a star but I know and my eldest know that it wasn't a star, I tried to talk to my husband about it and he didn't want to talk about it, he keeps insisting it was just stars. I would really appreciate if anyone know any explanation for this or saw it as well. Thanks."],"Longitude":"-83.084179","Date of the Event":"06/08/2013 10:05 UTC","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=40.029827,+-83.084179(47980)&iwloc=A&hl=en\"> mufon case (47980) map </A>","Object Features":"Unknown","Weather Factors":"Unknown","Country":"United States","Case Number":"47980","Region":"Ohio","Object Shape":"Circle","Sighting Duration":"Undisclosed","Source":"MUFON","Log Number":"US-06082013-0021","trends":["There have been 3 other sightings in Hilliard","There were no other sightings in Hilliard on or around June 8th 2013"],"Tags":"City","City":"Hilliard","Latitude":"40.029827","Viewing Distance":"Unknown","Summary":"Strange lights at Fishinger Rd Columbus OH","Date Submitted":"06/08/2013 11:48 UTC","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/47980.html.txt","/var/www/straped/mufon/org/47980.html"]}