{"Sighting Duration":"00:00:45","Tags":"City","Longitude":"-8.594904","Latitude":"51.888026","Case Number":"47990","Date Submitted":"06/09/2013 07:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=51.888026,+-8.594904(47990)&iwloc=A&hl=en\"> mufon case (47990) map </A>","Country":"Ireland","Date of the Event":"06/01/2013 11:15 UTC","files":["/var/www/straped/mufon/html2text/47990.html.txt","/var/www/straped/mufon/org/47990.html"],"Log Number":"IE-06092013-0009","Object Flight Path":"Path with directional change","Object Features":"Unknown","divs":["Sighting DetailsThere were no triangles, no flying saucers, no red lights or cigar like objects...So there I was letting my dogs out last Saturday (1st of June 2013,around 23.20) its daily routine before heading to bed, I was going to show my boyfriend the North Star, it was all so static up there. I started to admire a bright star that stood out from the others when to my surprise I saw it just fade away. I was shocked BUT the last thing I thought of was 'UFO', it did get creepier when the 'star-like' sphere lit up in another area of the sky before slowly fading away once again. A perfect almost controlled dimming, as if someone was purposely dimming the light. It did this for a few more seconds, fading before moving somewhere else.It followed the same path but it took different directions. There were no clouds in the sky that night what so ever. At this point I called my boyfriend, still staring at the sky. His exact words were 'what the hell?', but like me he was skeptical, until the star like sphere descended a good bit and it increased to a tenth of its previous size and brightened up to a beautiful blue-white like color. Believe me in those mere seconds I pondered every option of what it might be, a plane, a jet, space debris,shooting star? but it moved in a determined direction, with controlled dimming and had no sound(which is what really disturbed me)it also descended and ascended, hovered and changed in size. It was shocking and emotional and I am not one for going out seeking these experiences. It was in fact really beautiful. It hasn't left my mind in a week now, I've told a few relatives but nothing compares to seeing it I guess. I guess maybe it did affect me in an emotional level perhaps because my brain experienced something illogical. Thanks for reading."],"Summary":"Star like light shock as it moved faded into the night sky and appeared some where else , same path different direction brighter","Region":"Cork","Disposition":"Unresolved","City":"Ballincollig","Viewing Distance":"Over 1 Mile, Unknown","trends":["There have been no other sightings in Ballincollig","This sighting has never been favorited."],"Source":"MUFON","Object Shape":"Circle, Sphere, Star-like","Weather Factors":"Unknown"}