{"Summary":"Pulsating light witnessed while fishing at Ohio River","trends":["There have been no other sightings in Yankeetown","This sighting has never been favorited."],"Date of the Event":"06/08/2013 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.917546,+-87.297782(47994)&iwloc=A&hl=en\"> mufon case (47994) map </A>","divs":["Sighting DetailsJune 8th, 2013 My nephew and I went fishing on the IN side of the Ohio river on Saturday June 8th. We were sitting on the Nth side of the river just East of a large power plant and factory on a dirt road running adjacent to the river. At sometime around 9 pm I noticed a bright light above the KY side of the river. Jokingly, I said to my nephew that here comes a UFO and went back to fishing and didn't give the light another thought. Earlier a plane had flown over coming from that general direction and I assumed it was another plane coming from the Owensboro area. Shortly afterward, my Nephew said \"what the hell is that\", he was pointing at the light which was now pulsating rapidly and moving up then down but was hovering, then it moved from our SE to the E over the river. The object was maybe 1 mile away when it went over the river. The object would hover and move up and down and the light would pulsate and get very bright then dim until it just either faded out or moved directly away from us rapidly and disappeared. Needless to say we were astounded by what we had just witnessed and kept our eye on the general area where we last say it. Maybe five or ten minutes later the object reappeared in the same general area that we first saw it and this time it was over the tree line closer to the river than earlier. The object became very bright and intense and a beam of light came down and thru the trees. It didn't appear to move at this time but just hover. The object became so intensely bright that it cast a reflection on the river and you could plainly see the bright object and the beam in the reflection. This lasted maybe 1-2 minutes then the beam stopped and the object began to move from the SE toward the E. As the object moved it became dimmer and either moved directly away from us or just faded out of view. We stood there on the river bank amazed at what we saw and could not come up with a valid explanation of what we saw. We saw what might have been the same object but much farther away again maybe 5 to 10 minutes later in the same area. I would estimate the total time from the first siting to the last as at least 20 minutes. The were a few boats on the river both private and barges that we could see. This was also much closer to the Boonville Boat club which is a large area of river camps and I would think that we were not the only ones to see this object."],"Region":"Indiana","Date Submitted":"06/09/2013 10:43 UTC","Tags":"City","Longitude":"-87.297782","Country":"United States","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Log Number":"US-06092013-0013","Latitude":"37.917546","Disposition":"Unresolved","City":"Yankeetown","Weather Factors":"Unknown","Object Features":"None","files":["/var/www/straped/mufon/html2text/47994.html.txt","/var/www/straped/mufon/org/47994.html"],"Object Flight Path":"Hovering then path","Case Number":"47994"}