{"Object Features":"None","City":"Brossard","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/47995.html.txt","/var/www/straped/mufon/org/47995.html"],"Disposition":"Unresolved","trends":["There has been one other sighting in Brossard","There were no other sightings in Brossard on or around June 8th 2013"],"divs":["Sighting DetailsComing out of the movies with 4 friends, we saw 2 orange lights (objects) in the sky moving slowly towards us. At the same time I noticed a couple looking up into the sky. At first I assumed they were small Cessna airplanes or maybe helicopters. As they came straight overhead, they disappeared. One of my friends said they are planes that are on the same flight path circling to land at Pierre Elliott Trudeau (Dorval) airport. Then we noticed 2 more orange lights (objects) on the horizon and were coming on the exact same flight path. They did the exact same thing; appeared overhead and disappeared. I assumed they flew up into the clouds. My friend explained that the clouds in the sky made the lights of the plane appear orange. I don't agree with this explanation. Then we saw 2 or 3 more on the horizon. They came on more or less the same path in the sky. I believe that one took a different path and then changed into a white light. As it got closer towards us, it appeared to be a white plastic bag floating down from the sky. Now I am doubtful that the plastic bag was originally an orange light. I am not sure now. The people I was with were not as intrigued as me and didn't pay as much attention as I did. I watched to see if these orange lights or objects would come back around to land at the airport as my friend suggested, but I never saw them again. My feeling was that these were not planes. I am not sure what to really think, but I really do not believe they were airplanes. I am hoping someone else reported this event."],"Tags":"City","Date of the Event":"06/08/2013 09:40 UTC","Object Shape":"Star-like","Source":"MUFON","Object Flight Path":"Straight-line path","Log Number":"CA-06092013-0014","Summary":"6 or 7 orange lights one by one on a similar path ascend in the sky and then slowly fade or disappear","Region":"Quebec","Viewing Distance":"Unknown","Case Number":"47995","Country":"Canada","Latitude":"45.454706","map":"<A HREF = \"http://maps.google.com/maps?q=45.454706,+-73.470661(47995)&iwloc=A&hl=en\"> mufon case (47995) map </A>","Date Submitted":"06/09/2013 11:15 UTC","Sighting Duration":"Undisclosed","Longitude":"-73.470661"}