{"City":"Hollywood","Tags":"City","Disposition":"Unresolved","Summary":"flying crafts following airplane, using same speed and direction","Object Shape":"Triangle","Longitude":"-80.289644","divs":["Sighting DetailsI observed 3 flying crafts. My attention was piqued when I realized they were too close to each other to be a normal flight path. I looked up and scrutinized better only to realize that one of the 3 aircrafts was a real airplane with mandatory green and red light and blinking white one. crafts are flying East to West. The other two flying crafts are on the north side of real airplane, no FAA required lights, just dull big orange ones on what seems to be their bellies. I heard only the plane not the other flying objects. Plane could have been on landing path to FLL airport, or could have departed from MIA airport. Plane is about between 5K and 10K feet high, thus moving rather slowly across the sky which gives me time to observe the other 2. My position is about 20 miles west of FLL airport. As I am following the aircrafts in the sky I am now looking westward since it is the directional trajectory, and soon loose sight as view is obstructed by neighborhood trees. I continue my walk and look up in the sky now eastwardly. 2 more of these unidentified crafts are following the first group, same apparent altitude, same size, same speed, same trajectory. Suddenly, one of the two accelerated upward and at a much greater speed disappeared into space. The second vessel continued on its trajectory, following it seems the first group. I am very sorry that I was the only one on the street to observe this event, I would have definitely called upon others to look up in the sky and co witness. Please feel free to contact me to corroborate this written report. thank you for including this report with I what hope will be others. I want an explanation , if any is available. thank you again. Veronique KRUP - 954 495 3858 ps: crafts did not land , cannot fill in section pertaining to landing soil vegetation"],"Date of the Event":"06/08/2013 10:30 UTC","Sighting Duration":"00:07:00","Object Flight Path":"Straight-line path,Path with directional change","Log Number":"US-06092013-0012","Source":"MUFON","trends":["There have been 18 other sightings in Hollywood","There were no other sightings in Hollywood on or around June 8th 2013"],"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/47993.html.txt","/var/www/straped/mufon/org/47993.html"],"Viewing Distance":"501 Feet - 1 Mile","Latitude":"26.041175","Country":"United States","Date Submitted":"06/09/2013 09:47 UTC","Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=26.041175,+-80.289644(47993)&iwloc=A&hl=en\"> mufon case (47993) map </A>","Case Number":"47993","Weather Factors":"Unknown"}