{"Sighting Duration":"Undisclosed","Object Flight Path":"N/A","Viewing Distance":"N/A","Log Number":"US-06092013-0015","Source":"MUFON","Date of the Event":"06/07/2013 03:00 UTC","divs":["Sighting DetailsOn the morning of Friday, June 7th, 2013, I looked out my bedroom window and saw a large disturbance in the weeds on the small hill behind my house. There appeared to be a somewhat round area, maybe 8 feet across, where the vegetation had turned very brown, almost scorched looking, and the plants were smashed down in one direction. In front of the round area was another area with smashed plants and brown vegetation but it was in more of a straight line. The way the plants were lying seemed to be mostly from right to left, facing the hill. There were some dead leaves on other nearby plants that appeared otherwise unaffected. The weeds of the same type that surrounded the area were also flattened down in one direction, but not brown. The scorched looking area still has a few remaining live plants. We have not sprayed any chemicals or any type of weed killer on the hill. When I looked at my pictures I noticed the round, white spot above the round patch in one picture, which I didn't see while taking the picture. My first thought was that it was a drop of water since it was raining at the time, but when I enlarged it, it seemed to be round and I thought maybe a raindrop would be tear-shaped, so I'm not sure what to make of it. We didn't see or hear anything unusual during the night or early morning before I saw the brown patch. We do have deer in the area, but they don't smash the weeds all in one direction or scorch the plants. Very puzzling. Probably just coincidentally, the same morning I discovered my garbage disposal and the vent fan over my stove weren't working. The breaker had been tripped so I reset it and they still don't work. My kitchen looks out on the hill in the back with the damage. In November 2011, I witnessed a large, dark, low-flying boomerang shaped object gliding very quietly over my yard, which I reported. I live right beside power lines. I had to reduce the size of the pictures to email them, but they haven't been manipulated in any other way. I still have the originals on my computer and my camera. I would be happy to supply samples from the area if someone wants to investigate."],"Object Shape":"Unknown","Latitude":"38.431695","Weather Factors":"Unknown","Object Features":"Unknown","Summary":"Somewhat round patch of weeds with scorched appearance and weeds flattened in a uniform direction","Country":"United States","files":["/var/www/straped/mufon/html2text/47996.html.txt","/var/www/straped/mufon/org/47996.html"],"Case Number":"47996","Longitude":"-77.388874","City":"Stafford","Date Submitted":"06/09/2013 11:35 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.431695,+-77.388874(47996)&iwloc=A&hl=en\"> mufon case (47996) map </A>","Tags":"City","trends":["There have been 3 other sightings in Stafford","There were no other sightings in Stafford on or around June 7th 2013"],"Disposition":"Unresolved","Region":"Virginia"}