{"Country":"United States","Object Features":"Unknown","Weather Factors":"Unknown","Summary":"Quiet glowing red orange lights slowly flying across the sky some in a line, others in side by side.","Tags":"City","Disposition":"Unresolved","Case Number":"47998","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/47998.html.txt","/var/www/straped/mufon/org/47998.html"],"Source":"MUFON","Region":"Texas","Date Submitted":"06/09/2013 12:03 UTC","Viewing Distance":"Over One Mile","trends":["There have been 5 other sightings in Allen","There were no other sightings in Allen on or around June 8th 2013"],"Date of the Event":"06/08/2013 10:20 UTC","City":"Allen","divs":["Sighting DetailsThere were 4 of us enjoying the evening, the night was quiet, very dark and VERY clear (not a cloud in the sky). You could see the stars up high in the sky when suddenly I spotted a red-orange light emerge from the east side of the horizon (behind the house tops). That light began traveling west when suddenly I realized that this light was followed by another and another, and another. It became a parade of lights in the sky that were almost evenly spaced, flying in arc form. Then there was a break in the parade and there were 3 lights in triangle formation. One of them seemed to get ahead while the other two got very close to each other - which made me fear they might collide. We realized the lights continued behind those, some coming at longer intervals until eventually they stopped. There had to be over 20 and I was able to video tape a bit of it with my phone. As I mentioned, the lights moved north west, heading OUT into the atmosphere (unlike a plane). I lived in Florida and witness a space shuttle take off so I can tell you that this was NO airplane flight but more like something that headed out into space. there were no other objects, airplanes or anything else in the sky while these objects flew across; but oddly, once they stopped, we saw a plane coming for a landing and that's when we compared its appearance and the sound it made with the lights we had just seen, verifying once again that those objects were not any kind of aircraft. The truth is that it was an eerie sight because of their slow constant speed and the silence. I have some video footage that i can submit at a later date if needed."],"Log Number":"US-06092013-0017","map":"<A HREF = \"http://maps.google.com/maps?q=33.133422,+-96.708777(47998)&iwloc=A&hl=en\"> mufon case (47998) map </A>","Object Shape":"Fireball","Object Flight Path":"Straight-line path","Latitude":"33.133422","Longitude":"-96.708777"}