{"Source":"MUFON","Log Number":"US-06092013-0027","divs":["Sighting DetailsI was putting my son to bed and a bright light caught my eye out of his bedroom window. Both of us saw a very large pulsating red, white, and blue strobeing circular light hovering in the trees. I first tried to take cell phone pictures but they only caught small looking light dots. Not at all what I was seeing. So I got my Canon Power Shot G3 camera out of the closet and the battery was dead because I had not used it for awhile. I grabbed the charger cord and plugged in and shot photos and video out of my sons window for more than one hour. The shape I was seeing was not changing, but the still photos show color changes and shapeshifting. Most of the frames I shot were just dark with no visible image, and many others were pictures of different color orbs, mostly blue. I had to suppress my flash because it ruined the pictures. So all of the photos are of the lights without any other light. I did not know what I was catching I just kept shooting. I also tried some video with my Canon camera but it only caught a moving small dot light similar to what I've seen on the internet. But the still photos were amazing, they caught shapes, colors and clear images. One clearly looks like an adult and a child made of lights. I stopped taking photos before it left and went to bed convinced that I must be seeing things! I thought I would go outside in the morning and find some pole with a light on top of it that I had not noticed before. A plane warning light or a cell phone tower that was just put up, but nothing was there. Just trees. I also did not know what I was catching as I had to use my viewfinder feature on my camera to enlarge the images. Since then I have downloaded them to my computer for further enlargement and what I captured is nothing short of amazing. I have kept the photos on my cell phone and Canon camera so that I can show them to someone for authentication. Right now I can't wait to have an expert look at them. I will share only one of my photos here but will show all of them to someone for authentication. I'm attaching an orb photo as that seems to be the more common one. I will hold my special photos as I feel they are not to be given away for free."],"Case Number":"48008","Date Submitted":"06/09/2013 07:42 UTC","Weather Factors":"Unknown","Object Flight Path":"Stationary","Tags":"City","trends":["There have been 2 other sightings in Estero","There were no other sightings in Estero on or around June 4th 2013"],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/48008.html.txt","/var/www/straped/mufon/org/48008.html"],"Object Features":"Other","Disposition":"Unresolved","Latitude":"26.399682","Object Shape":"Circle, Flash, Sphere, Star-like, Other","Country":"United States","Longitude":"-81.818439","Date of the Event":"06/04/2013 11:45 UTC","Viewing Distance":"21-100 Feet","Region":"Florida","City":"Estero","Summary":"Hovering strobing circular light that I photographed for more than one hour. Shot video and still photos. Light to the naked eye looked like a giant ball of strobing lights, but photos captured shapes shifting, multi colors, orbs and human forms.","map":"<A HREF = \"http://maps.google.com/maps?q=26.399682,+-81.818439(48008)&iwloc=A&hl=en\"> mufon case (48008) map </A>"}