{"Source":"MUFON","Object Features":"Dome","Tags":"City","Sighting Duration":"Undisclosed","Log Number":"US-06092013-0019","trends":["There have been 59 other sightings in Tulsa","There were no other sightings in Tulsa on or around June 5th 2013"],"Disposition":"Unresolved","Weather Factors":"Unknown","Object Shape":"Sphere, Star-like","divs":["Sighting DetailsIt was about 9:30 pm after my daughter had got off work. I had to pick her up. We pulled into the driveway and I saw a bright star-like object in the sky. It was brilliant like a star. Kind of like a real low flying satellite, no flashing lights. It was kind of like a candle flame. It moved not real slow but not fast at all either. It was a fluid and graceful movement. I have seen UFO's before and the movement is really different and not at all like our typical aircraft. It descended over some trees and we lost it. We went to get in the car and drove towards where it had descended but to no avail. Later that night I guess around 11:30 we rented a movie. We were sitting on the couch when out of the corner of my eye I saw a red beam that shone through our sky light. My daughter saw it the best and saw the beam through our skylight. She said it was two red beams. What is funny is at first we disregarded the beam. I said wasn't that a reflection off a cars break lights? My daughter said mom how could that be on the chair. I said your right. The window is far from our living room and I have never even noticed red lights before. We went on watching the movie and kind of blowing it off. Since we saw the unusual object I thought it was really weird. I feel it is also weird that I didn't think so at first. It was an orange red bright beam. This is my second sighting in this neighborhood. The other one I didn't report. I just don't want to sound crazy but I know what I saw. I had a witness this time. I am really worried that this could be a territory or something to extraterrestrials. There is a tree that faces my house and it has what is undoubtedly a alien Grey face etched into it. Everyone has noticed it. Is this a coincidence, just a natural thing or was it PUT there? I have forgot to tell Mufon about this for a long time. First one to notice was a neighborhood kid and that was a few years ago. Just keep forgetting and then there it is. I tried getting a photo see if you can see it. It is what appears to be a large alien grey head with a face frowning."],"Viewing Distance":"21-100 Feet","Longitude":"-95.95116","files":["/var/www/straped/mufon/html2text/48000.html.txt","/var/www/straped/mufon/org/48000.html"],"City":"Tulsa","Object Flight Path":"Straight-line path","Region":"Oklahoma","map":"<A HREF = \"http://maps.google.com/maps?q=36.102741,+-95.95116(48000)&iwloc=A&hl=en\"> mufon case (48000) map </A>","Country":"United States","Latitude":"36.102741","Date Submitted":"06/09/2013 02:14 UTC","Case Number":"48000","Summary":"Starlike Object and red laser beam.","Date of the Event":"06/05/2013 09:30 UTC"}