{"Summary":"Large bright yellow light. First fading then changing to orange/red/black","files":["/var/www/straped/mufon/html2text/48022.html.txt","/var/www/straped/mufon/org/48022.html"],"Object Features":"Unknown","divs":["Sighting DetailsI had just arrived home after stopping at the store. My eyes were immediately drawn upward to a bright yellow light. It was in the same direction that most small planes travel from, but it was a different color, much brighter and about 10 times larger than the small plane lights and much MUCH higher. (large planes come from another direction) It was northwest of my location, about 3-5 miles above the earth. For about 2 minutes, I watched this bright yellow light (slightly increasing in intensity) in a stationary position. It started to slowly move southwest for about 1 minute. As it remained in this path, the yellow began to fade. It then turned to orange and changed (slight curve) to a northeast direction. It changed again to red and finally black. For about a minute, I watched a black oval slowly traveling east northeast and then it disappeared completely. Just vanished. It could have been due to the marine layer. I did not really think it was a plane due to the size and color. I had suspicions that it could have been a comet, but it had no tail. The change of direction made me question this as well. I logged onto the internet to see if there were any comets passing the earth, but one was only 53ft long and the other was millions of miles away. Recalling the Halebop comet, they looked nothing alike. Halebop was stationary while I watched it. It was fuzzy and had a tale. This appeared brighter, clearer and closer. That night was the first time in my 44 years that I actually thought I could have seen a \"UFO\""],"Viewing Distance":"Over 1 Mile, Unknown","Region":"California","Date of the Event":"06/08/2013 08:35 UTC","Case Number":"48022","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Longitude":"-117.148345","Object Shape":"Oval, Sphere","Latitude":"32.719539","Country":"United States","Date Submitted":"06/10/2013 03:34 UTC","Log Number":"US-06102013-0006","Object Flight Path":"Hovering then path,Path with directional change","Tags":"City","Source":"MUFON","City":"San Diego","map":"<A HREF = \"http://maps.google.com/maps?q=32.719539,+-117.148345(48022)&iwloc=A&hl=en\"> mufon case (48022) map </A>","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around June 8th 2013"]}