{"Longitude":"-79.116513","Source":"MUFON","Case Number":"48027","Latitude":"43.833392","Viewing Distance":"Over One Mile","Object Flight Path":"Path with directional change","Summary":"A Flashing light moving in a SW to W directions changing various directions abruptly very high speedas if avoiding or being followed then about 15 seconds a winged american fighter plan flew over but light long gone","Date Submitted":"06/10/2013 12:23 UTC","trends":["There have been 2 other sightings in Pickering","There were no other sightings in Pickering on or around June 8th 2013"],"Date of the Event":"06/08/2013 11:38 UTC","Object Features":"None","files":["/var/www/straped/mufon/html2text/48027.html.txt","/var/www/straped/mufon/org/48027.html"],"Region":"Ontario","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=43.833392,+-79.116513(48027)&iwloc=A&hl=en\"> mufon case (48027) map </A>","Weather Factors":"Unknown","Tags":"City","Country":"Canada","Log Number":"CA-06102013-0011","Object Shape":"Flash","Disposition":"Unresolved","divs":["Sighting DetailsI was on my deck facing SE when I noticed the beautiful night shy but a little cloudy around midnight ,I noticed a plan traveling east bound around 3-5 miles up it seemed nothing special. Then I glanced straight up when a flashing light caught my eye traveling in a west direction about 5 miles up ,and each time it flashed in moved at quicker than a normal plane SPEED ,it was almost invisible only the flashing light seemed round in shape. Then it started zigzagging and flashing ,each time it flashed it moved at extreme speeds ,every flash changed directions from west to east to north to south as if avoiding or making a sign pattern ,all this happened within a less than 1 to 2 minutes total time span. Then it flashed for the last time and it disappeared what it seemed like a west direction ,then about less than 15 seconds travelling from the west to east direction ,I saw a American winged war plane traveling east direction about 5 miles high and it flew east .that was it. I know there is no known man made plane that can change directions that quick and seemed like it had stealth material only light flashing ."],"City":"Pickering"}