{"files":["/var/www/straped/mufon/html2text/4802.html.txt","/var/www/straped/mufon/org/4802.html"],"divs":["Sighting DetailsWhen we moved to Calif from Washington in 1953 I knew I would no longer be able to breath two nostrals worth of air in only one side of my nose. As we drove past the volcano MT. Hood in Oregon, the base was covered with clouds and I saw the tip of it in the sky and knew that was where THEY lived. I thougt no more than that about it until years later after going to a shrink and reading Whitneys book.I went into hypnosis and the spider had a alien head. I ran away from the shrink who hypnotised me. I then went to the place where I was held by the spider web and there was a sign on a stake on the ground, \"a glance into the forest, is a window into the universe.\" I have a little bump in the back of my neck I have always wondered what it is. The doctors have always told me to leave it alone. I would like to have it removed by you. I was born in La Grande Oregon St. Josephs hospital, July 28 1944 at 5:25 pm 100 years, 1 month 1 day and the same hour and most likely a few minute and seconds after Joseph Smith was shot on june 27 1844. A bullet stopped the poctet watch on John Taylor at 5:16 Pm and Joseph died a few minutes after that. Richard Willard was also in jail with the two of them. My ex husband who tried to kill me was Richard, and John Willard was his Lawyer, not taylor. Too far out for coincidence. Please contact me. I have many miracles."],"Viewing Distance":"Unknown","Region":"Washington","Case Number":"4802","Log Number":"US-05192006-0006","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=46.853669,+-121.758792(4802)&iwloc=A&hl=en\"> mufon case (4802) map </A>","Tags":"City","Weather Factors":"Unknown","Object Shape":"Unknown","Date Submitted":"07/24/1948 12:11 UTC","Disposition":"Insufficient Data","trends":["There have been no other sightings in Mt Raineer","This sighting has never been favorited."],"Summary":"I was skipping backwards ahead of family on a path at the base of Mt. Raineer in 1948. I was only 4 and was held in a giant web and saw a giant spider.","Date of the Event":"07/24/1948 12:11 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Latitude":"46.853669","City":"Mt Raineer","Longitude":"-121.758792","Source":"MUFON","Object Features":"Undisclosed"}