{"files":["/var/www/straped/mufon/html2text/48035.html.txt","/var/www/straped/mufon/org/48035.html"],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"06/10/2013 05:19 UTC","Region":"Alabama","Log Number":"GB-06102013-0017","Summary":"1983 - RAF Woodbridge - Extreme bright lights emanating out of woods **Military involvement**","Longitude":"-86.285813","Disposition":"Unresolved","trends":["There have been 659 other sightings in Montgomery","There were no other sightings in Montgomery on or around November 1st 1983"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.314593,+-86.285813(48035)&iwloc=A&hl=en\"> mufon case (48035) map </A>","Case Number":"48035","Country":"United States","divs":["Sighting DetailsWhen I was 8 years old I lived with my family on Woodbridge Air Force Base near Ipswich, England. Our house was the second duplex on a road to the east of the main gate. I was awakened sometime in the middle of the night to whistles blowing and men shouting. My father and sister were also awakened, so we all went to the front door to see what was happening (my mother slept through most of it). I saw armed GI's in their fatigues running alongside military vehicles that lined up along the road directly across from our home. The men ran down the street and into the woods about 15-20 yards to the southeast of our house. My dad rushed outside to find out what was going on, while my sister and I remained in the doorway of our home. At first I watched my dad talking to the soldier, but then my attention went back to all the activity that was going on... As I watched the soldiers running into the woods, my eyes lifted upward in the direction they were running. About another 50 yards further into the woods, I became transfixed by extremely bright lights filtering through the trees that were pulsating in all directions from one single location - on or near the ground. The lights were like rays or beams, similar to movie marquee lights. They were softly pulsating with glowing green and pinkish hues, and as bright as a football stadium - they lit up most of the forest within our view. I recall standing in the doorway completely mesmerized. This lasted for about five minutes. Then my dad returned with orders to gather the family and remain indoors, which is exactly what we did. It seemed the noise continued for another hour, and eventually I went back to sleep. In the morning it was as if nothing ever happened. In the next days and weeks rumors spread around the base, schools, and my dad's workplace, that a UFO had landed. For the past few years I have been in contact with a few of the people involved in the now infamous Rendlesham Forest Incident that occurred just weeks before my family moved to England. None of those individuals, including Nick Pope - formerly with the British Ministry of Defense - has any knowledge of what I saw. Unfortunately I cannot give an exact time of when this happened, but as far as my family and I could discern, this occurred sometime in the fall or winter of 1983. I can attest that it was not a downed aircraft, nor was it a forest fire. And it seems very unlikely that the Air Force would conduct base exercises (AKA \"war games\") so close to dependent housing in the middle of the night, unless we were under a direct threat from Russia, as it was the Cold War era. And I would assume there would be some kind of documentation somewhere, or that there is someone out there who either witnessed or participated in the event - I recall at least 20 to 30 individuals involved."],"Object Features":"Unknown","Source":"MUFON","Date of the Event":"11/01/1983 01:01 UTC","Object Shape":"Unknown","City":"Montgomery","Object Flight Path":"Stationary","Viewing Distance":"21-100 Feet","Latitude":"32.314593","Tags":"City"}