{"Source":"MUFON","files":["/var/www/straped/mufon/html2text/48038.html.txt","/var/www/straped/mufon/org/48038.html"],"Date Submitted":"06/10/2013 08:17 UTC","Viewing Distance":"Unknown","Object Flight Path":"Path with directional change","Disposition":"Unresolved","Date of the Event":"06/10/2006 09:00 UTC","Case Number":"48038","Object Features":"Other","Tags":"City","Latitude":"41.395535","Longitude":"-75.718066","Object Shape":"Cone, Other","Weather Factors":"Unknown","Log Number":"US-06102013-0020","Summary":"I saw a white upside down styrofoam cup type object emitting brilliant white flames silently traveling towards me one summer evening while sitting outside.","divs":["Sighting DetailsI was sitting on my rear deck at my home approximately 9 PM on June 10, 2006. I'm sorry I do not remember the exact date. There was no one else home at the time. My son was out for the evening. It was very quiet and peaceful outside and I was enjoying the evening. There were no children playing or any adults that I could hear or see. I did not have any lights on outside but there was a little light shining out from my kitchen. I was looking up at the night sky and looked to my left which would be a northeastern direction over my neighbor's roof and I saw what I thought was a plane but there was no sound. It appeared to be a small bright headlight, even though planes usually have two, and was steadily and slowly approaching as it was getting larger. We have an airport located not very far away and see a lot of planes coming and going. However, that night I did not hear or see any planes before, during or after the event. The path it was traveling in was coming directly towards me so I continued to watch it and as it got closer I realized it was not a plane and the bright headlight was really brilliant white flames. For a moment I thought it might be a balloon slowly descending but there was no balloon. Instead there appeared to be what looked like an upside down white Styrofoam cup type object. The flames were the brightest white I've ever seen. They were at such an angle that they were dominant and almost obscured the object behind them until it got closer. The flames were shooting out and flickering and I couldn't take my eyes off of it. I felt a little panicky as it came closer to me and decided if it got too close I would run in the house. It kept coming closer and I was about to run when it abruptly went to the left without turning or changing it's position. It was still facing me but moving left. It was moving at a quick pace and for some reason I was no longer afraid probably because it was going away from me. I ran after it out to my front yard wall as far as I could go and watched as it continued in the same direction and getting smaller as it traveled. It then suddenly ascended, not straight up, but at an angle in a northern direction and kept climbing until I could no longer see it. I was wishing there was someone out and about that I could have asked if they saw what I had seen but the streets were quiet and empty. I told my son as soon as he got home and he never doubted what I saw. He just wished he had seen it too. However, when I went to work the next day and told the people I ate lunch with, I was laughed at and even called a liar by one of them. I couldn't believe their reaction. I thought they were my friends. So I've kept it to myself for all these years but I've always wondered if anyone else has ever seen the same thing I have. So I decided to get in touch with you. I've watched many episodes about UFO's but have not seen anything like it as yet. I would love to hear from you if there are any other reports like this. Thank you for allowing me to share this with you."],"City":"Taylor","Region":"Pennsylvania","Sighting Duration":"00:03:00","map":"<A HREF = \"http://maps.google.com/maps?q=41.395535,+-75.718066(48038)&iwloc=A&hl=en\"> mufon case (48038) map </A>","Country":"United States","trends":["There has been one other sighting in Taylor","There were no other sightings in Taylor on or around June 10th 2006"]}