{"Object Features":"None, Unknown","Latitude":"32.362558","Tags":"City","divs":["Sighting DetailsI take pictures of the weather & clouds all the time. On the 6th, I was out walking my dog and taking pictures. It was probably around 2 or 3 in the afternoon. My camera is a digital Nikon. When I uploaded the photos, I noticed a small cylindrical object behind an airplane. At the time I took the picture, I hadn't noticed either one. I take my pictures so that they upload very large & I reduce their size by 80 to 85%. When I went to reduce this picture, I noticed the object. There was a golf tournament in nearby Memphis and I observed a blimp in the sky the day after this happened, but it looked very obviously like a blimp. This object in my picture does not have the 'under carriage' you see on a blimp and the size seems wrong. I played around with the picture & made it even larger and inverted the colors and the object is obviously there. Pictures taken in the same area of the sky within a few minutes of the same time this picture was taken do not show anything there, airplane or otherwise. I reduced the size of the picture to about what it was when I uploaded it and reversed the color inversion so that is back to normal. It is not a bird, or another airplane; I do not know what this is, which by my understanding makes it a UFO."],"City":"Undisclosed","Disposition":"Unresolved","Date of the Event":"06/06/2013 12:00 UTC","Summary":"I was out taking pictures & after uploading, noticed an object behind an airplane in the picture.","map":"<A HREF = \"http://maps.google.com/maps?q=32.362558,+-89.389518(48043)&iwloc=A&hl=en\"> mufon case (48043) map </A>","Viewing Distance":"Unknown","trends":[""],"Object Flight Path":"Unknown","Object Shape":"Blimp, Cylinder","Date Submitted":"06/10/2013 10:03 UTC","Log Number":"US-06102013-0025","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/48043.html.txt","/var/www/straped/mufon/more/48043_submitter_file1__000987706062013aa.JPG","/var/www/straped/mufon/org/48043.html"],"Region":"Mississippi","Source":"MUFON","Country":"United States","Case Number":"48043","Weather Factors":"Unknown","Longitude":"-89.389518"}