{"Country":"United States","Date Submitted":"06/10/2013 09:49 UTC","Object Flight Path":"Straight-line path","Longitude":"-93.234736","divs":["Sighting Details Witness to formation of 4 craft with black bands descending over Aquatore Park and passing northeast of Blaine Water Tower I left work in Anoka at 14:00 and was travelling east on Highway 10 when I saw aprox. 4 craft in formation moving north and directly parallel to the southbound lane of Highway 65. I first noticed the formation as it descended over the eastbound lane of highway 10 aprox. 600 yards from the front of my vehicle. Initially, the Polk St. Bridge (north to south) obstructed my vision but the craft were still visible as I approached. If you are familiar with the area, they would have passed over the Food and Fuel on 85th Ave. and highway 65 southbound just before descending in front of me and possibly 8 other vehicles heading eastbound. There were 2 vehicles astride two more vehicles at the same level, but the 2 farthest from me lagged behind about 10 feet or half of a vehicle. So, the 2 nearest to me were about half of a vehicle forward of the other 2 vehicles. They had an oval configuration with a slight dome and black bands around the center of the vessels. They were around 75 feet high at the point of descent and dropping down to treetop level over Aquatore Park when I lost sight of them behind the Blaine Water Tower. As I arrived at Highway 65 I looked over the park but they were gone. All in all, I saw them for around 20 seconds from start to finish."],"trends":["There has been one other sighting in Blaine","There were no other sightings in Blaine on or around May 15th 2013"],"Case Number":"48041","City":"Blaine","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Region":"Minnesota","files":["/var/www/straped/mufon/html2text/48041.html.txt","/var/www/straped/mufon/org/48041.html"],"Latitude":"45.134858","Date of the Event":"05/15/2013 02:15 UTC","Log Number":"US-06102013-0023","Source":"MUFON","Weather Factors":"Unknown","Object Features":"Dome","Sighting Duration":"Undisclosed","Summary":"Witness to formation of 4 craft with black bands descending over Aquatore Park and passing east of Blaine Water Tower","map":"<A HREF = \"http://maps.google.com/maps?q=45.134858,+-93.234736(48041)&iwloc=A&hl=en\"> mufon case (48041) map </A>","Disposition":"Unresolved","Object Shape":"Disc"}