{"City":"Glenwood","Summary":"Rectangle shaped object flew silently overhead","Log Number":"US-06112013-0006","map":"<A HREF = \"http://maps.google.com/maps?q=41.549315,+-87.593066(48050)&iwloc=A&hl=en\"> mufon case (48050) map </A>","Object Flight Path":"Straight-line path","trends":["There has been one other sighting in Glenwood","There were no other sightings in Glenwood on or around June 8th 2013"],"Case Number":"48050","Source":"MUFON","Weather Factors":"Unknown","Object Features":"Other","Country":"United States","Date of the Event":"06/08/2013 12:00 UTC","Disposition":"Unresolved","Object Shape":"Cigar","Longitude":"-87.593066","Region":"Illinois","Viewing Distance":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/48050.html.txt","/var/www/straped/mufon/org/48050.html"],"divs":["Sighting DetailsI was in my backyard laying on my back in a screen-sided tent texting on my phone. I noticed the object when I looked away from my phone and saw it silently making its way southeast overhead. I wasn't sure what I was seeing when I first saw it because I knew right away it was unlike any aircraft I have ever seen. It was rectangular in shape and a silver-ish gray in color. It had red, green, and white lights strobing around the entire craft in a counter clockwise pattern. At first I thought it was flying south but as I watched it I noticed it was heading in a more southeast direction. It was going at what seemed to be a constant and relaxed speed, a bit slower than planes usually fly but not by much. A few times it looked as if it turned slightly transparent or invisible but the lights stayed the same, it was under cloud cover so I don't think clouds were the culprit. It was completely silent and any plane or jet flying that low would have made noise. I felt calm and intrigued as I watched it. It certainly didn't seem like anything to be afraid of. I was going to get a video of it but the camera on my phone is horrible and wouldn't have picked it up. I sat and watched it disappear as it flew out of sight. I sat there for a moment and questioned what I saw and came to the conclusion that it was something rather unusual. I lost sight of it because where I live there are a lot of trees and houses and I couldn't see past them."],"Date Submitted":"06/11/2013 02:25 UTC","Sighting Duration":"Undisclosed","Latitude":"41.549315"}