{"divs":["Sighting DetailsMyself and a freind were standing on my back deck one night conversing, talking about various subjects and observing the night sky when all of a sudden a orange orb just appeared out of the sky at a distance from us, moved closer to us and began to descend closer to the tree tops, hovered in position for 20 seconds, changed direction several times and hoved in place again, then changing direction with it's position and altitude and then disappeared. My freind and I both continued our conversation and then after 2 minutes the orb reappeared, this time from a different position in the night sky from where it had originally appeared and began to perform a series of airial movements. At this point my freind and began to speak abpout what we were actually seeing, as this orange reddish colored orb made absolutely no audible sound that we could detect. We both simized that it was not an airplane based on the actual movements of the object, so I thought it could have been a helicopter. My freind went into the house and grabbed her high powered field binocculars and we started examining this object. I could not see any other structure pertaining to this object except the orange orb, which seemed to be spinning around the circumference of the orb its'elf. We both watched as this orb made abrupt stops, turns, accelrations, decensions and ascentions in the sky. I could not beleive this might possibly be an actual UFO, because at that time I really did not believe in them. As the object was overhead I took the binocculars and tried to trace from the orb to the ground to see if this was some kind of possible projection from another location. My friend and I did not see anything like that, after watching this object perform these manuevors for approximately 3 to 5 minutes, it ascended into the air extremely rapidly and disappeared again, not fading away, it just vanished. So sure enough after about 1 to 2 minutes it appeared again, so this time I went in the house and grabbed my wife and all 3 of us stood hear watching this object play around in the sky for about another 5 to 7 minutes, before disappearing for the last time. In all I guess we observed this object for a total length of about 13 to 20 minutes visable in the sky. This then prompted me to inquire if others had seen this object and I saw 1 other person had seen this object and sent in inquiry into a local Hagerstown newspaper. This also prompted me to start my own research and i have discovered that I am not crazy or seeing things as others have seen and even filmed these orange orbs,as well as many other types of crafts. I have been in the military and have seen and flown in different types of man made aircraft before, but I had never seen anything move in the manner that this object was able to move in terms of it's ability to manuveur, it's speed and it did not make a sound. And we were speaking in a normal somewhat quiet voice tone, at it's lowest descention point to us I would estimate that it would have been maybe 110 to 200 feet above us and roughly a quarter of a mile from us in distance. It was not to far from actually being over my back yard."],"Source":"MUFON","Disposition":"Unresolved","Object Shape":"Circle, Fireball, Oval, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=39.647013,+-77.713523(48058)&iwloc=A&hl=en\"> mufon case (48058) map </A>","Object Features":"Unknown","Latitude":"39.647013","files":["/var/www/straped/mufon/html2text/48058.html.txt","/var/www/straped/mufon/org/48058.html"],"Region":"Maryland","Country":"United States","trends":["There have been 10 other sightings in Hagerstown","There were no other sightings in Hagerstown on or around September 20th 2011"],"Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","City":"Hagerstown","Date of the Event":"09/20/2011 12:00 UTC","Longitude":"-77.713523","Case Number":"48058","Date Submitted":"06/11/2013 04:47 UTC","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Tags":"City","Weather Factors":"Unknown","Summary":"On back porch with my wife and friend when object appeared in night sky.","Log Number":"US-06112013-0014"}