{"trends":["There has been one other sighting in Medina","There were no other sightings in Medina on or around March 15th 1997"],"Viewing Distance":"101-500 Feet","Country":"United States","Case Number":"48063","Longitude":"-81.860327","Object Features":"Window(s)","Summary":"triangular craft at least six floors high, multiple level of Windows, it was only moving 5 or 6 mph","Date Submitted":"06/11/2013 06:54 UTC","Disposition":"Unresolved","divs":["Sighting DetailsI was driving home from work down Interstate 71. I noticed a large bright white light moving north on the east side of the highway, I knew right away what it was because no airplanes are that big. I stepped on the gas pedal to get down to it faster, I must have been going at least 90 mph. it made a turn to the west across the interstate, I was close at this point I pulled the car to the shoulder and shut it off. it was right there in the field just off the highway. I looked out the side view mirror of my car and seen traffic about 2 miles back, I got out and ran around the front of the car to the passenger side front fender, the craft was no more than 200 feet maybe 300 feet away from me, it was lower than the treetops the bottom edge of it. 3 large white lights underneath about 25 to 30 feet across, set at each corner of the triangle. 1 small red light in the center of the bottom about the size I don't know baseball it look small to me. I observed for different level of Windows on the north side of the ship moving to the West"],"Sighting Duration":"Undisclosed","Source":"MUFON","Date of the Event":"03/15/1997 11:38 UTC","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=41.139558,+-81.860327(48063)&iwloc=A&hl=en\"> mufon case (48063) map </A>","files":["/var/www/straped/mufon/html2text/48063.html.txt","/var/www/straped/mufon/org/48063.html"],"Latitude":"41.139558","City":"Medina","Log Number":"US-06112013-0019","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Tags":"City","Region":"Ohio"}