{"Disposition":"Unresolved","Object Flight Path":"Straight-line path","Latitude":"37.367782","Longitude":"-92.758111","Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","Country":"United States","files":["/var/www/straped/mufon/html2text/48062.html.txt","/var/www/straped/mufon/org/48062.html"],"Weather Factors":"Unknown","trends":["There have been no other sightings in Niangua","This sighting has never been favorited."],"Source":"MUFON","Tags":"City","Object Features":"None","Case Number":"48062","Date Submitted":"06/11/2013 06:22 UTC","Date of the Event":"06/10/2013 04:30 UTC","Summary":"Observed a bright sphere approaching overhead from west. Went over house headed easterly; seemed to be traveling the curve of the road, but remained on southern side of road which was treed.","City":"Niangua","Region":"Missouri","map":"<A HREF = \"http://maps.google.com/maps?q=37.367782,+-92.758111(48062)&iwloc=A&hl=en\"> mufon case (48062) map </A>","divs":["Sighting DetailsI was taking a small bag of garbage to the garbage unit out in the front yard. I walked out the front door and glanced up, watching birds. Something shiny caught my attention and I looked up and saw a sphere approaching from the west. At first I thought the sun was simply reflecting off of it, but it was too bright and as it moved the light didn't waver as it would have were it merely reflecting light. My first thought was that it reminded me of a satellite in the night sky. The way it moved, the single, unwavering light, and no sound. But of course it wasn't a satellite. Our house is surrounded by tall trees. The object skimmed over the treetops; perhaps about 35 to 40 feet above them. There was absolutely no noise coming from it. I looked away as I went down the steps towards the garbage can, then looked back up as I stepped onto the yard. It was finally dawning on me this was not something you look away from. It was now going over the house, still shining brightly like a powerful light bulb. It was moving along at a pretty good clip; maybe about 40 to 45 miles an hour. Lost sight of it for a second as it disappeared behind some treetops, but I trotted to the driveway and it came back into view for another couple of seconds, still heading easterly, before it again disappeared behind treetops. It would have gone over my neighbor's house next, but only because its path seemed to be following the road rather than heading in a strict eastern direction. It's path was bending slightly north as it made its way across our property and disappeared from view, as does the road. The south side of the road ~ which I live on and which the object was flying over ~ is fairly heavily treed as opposed to the north side, which is more open farm field. It occurred to me after the object disappeared that this was likely just a drone used by law enforcement, but as I pondered the event it seems to me that drones are typically used for spying, which requires stealth. So why would it be emitting light, and a very bright one at that? Furthermore, I've looked at many pictures of drones and none look like this object. Additionally, the speed was surprising. It was moving considerably fast and again, I'm not sure high-speed capabilities are characteristic of law-enforcement drones (or drones in general)."],"Object Shape":"Sphere","Log Number":"US-06112013-0017"}