{"Date Submitted":"06/11/2013 06:19 UTC","Object Flight Path":"Straight-line path,Path then hovering","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Latitude":"27.841961","Object Features":"Unknown","Disposition":"Unresolved","Case Number":"48061","Source":"MUFON","Country":"United States","Date of the Event":"05/08/2013 12:00 UTC","Object Shape":"Triangle","Tags":"City","City":"Babson Park","Summary":"3 bright white lights, blinking red light in center","map":"<A HREF = \"http://maps.google.com/maps?q=27.841961,+-81.518503(48061)&iwloc=A&hl=en\"> mufon case (48061) map </A>","Longitude":"-81.518503","files":["/var/www/straped/mufon/html2text/48061.html.txt","/var/www/straped/mufon/org/48061.html"],"trends":["There have been no other sightings in Babson Park","This sighting has never been favorited."],"Region":"Florida","Sighting Duration":"Undisclosed","Log Number":"US-06112013-0016","divs":["Sighting Detailsi was sitting on my back porch looking at the lake. on the horizon in the northeast i saw an object in the sky that i thought was an aircraft. upon further observation i saw it had no blinking green or blue lights like a commercial aircraft is required to have. then i thought it could have been military, so i grabbed binoculars and observed 3 bright lights stationary side by side in a horizontal pattern. then i noticed on the bottom a blinking red light. i tried to count the interval between blinks but it was all random. i also noticed the 3 white lights would almost change shape, but it seemed to be sending patterns of light from one end to the other. it was moving slowly away from me and began to dissapear into the horizon. i lost focus of the craft after about 30 minutes of observing it. i was really excited i saw this because i know for fact it wasnt commercial, and if it was military, i dont know an aircraft currently with 3 boosters on it. so i assumed i saw an expiermental aircraft. oddly enough 10-20 miles southeast of my home is the avon park airforce base. so this led to my assumption of military aircraft, but im not 100%. definetly odd, and appeared to be like the well talked about UFOs of the past. fit descriptions perfectly."]}