{"Object Shape":"Triangle","Date Submitted":"06/11/2013 09:39 UTC","Case Number":"48072","Weather Factors":"Unknown","Viewing Distance":"Unknown","City":"Arnold","Latitude":"38.401086","files":["/var/www/straped/mufon/html2text/48072.html.txt","/var/www/straped/mufon/org/48072.html"],"Longitude":"-90.374691","Region":"Missouri","Object Flight Path":"Stationary","divs":["Sighting DetailsWhile standing on patio listening to baseball game I noticed a very bright triangular light formation in sky. I have noticed other strange things in sky before I watch the sky rather diligently. I am quite familiar w star formations in the sky when I looked up I saw a triangle. Lights were very bright. Much brighter than surrounding stars. Spring triangle formation of stars could be seen in background. My triangle overlapped but offset at base of triangle from natural formation. As I stood there and looked my first thought was how bright the lights were and mainly why I Never noticed that particular formation before. I was awestruck. Lights stayed in place all night. At one point I noticed another light light very similar in brightness approach toward base of triangle. As it got close light disappeared. Around 11pm I called it a night. Light was still there. Next evening I looked at sky. No bright triangle Just the spring triangle formation At that point I realized how weird the preview evening was"],"Sighting Duration":"03:00:00","Country":"United States","Object Features":"Other","Disposition":"Unresolved","Summary":"Large triangle formation Much brighter than other stars. Was not the celestial spring triangle. Could see that on background","Tags":"City","Date of the Event":"05/07/2013 08:10 UTC","trends":["There have been 7 other sightings in Arnold","There were no other sightings in Arnold on or around May 7th 2013"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.401086,+-90.374691(48072)&iwloc=A&hl=en\"> mufon case (48072) map </A>","Log Number":"US-06112013-0028"}