{"Summary":"Didnt belive in UFO till I seen this.","Country":"United States","Longitude":"-95.36489","Latitude":"29.767583","Source":"MUFON","Log Number":"US-06112013-0026","Disposition":"Unresolved","Date of the Event":"08/12/2011 12:00 UTC","City":"Houston","Region":"Texas","Sighting Duration":"01:13:04","files":["/var/www/straped/mufon/html2text/48070.html.txt","/var/www/straped/mufon/org/48070.html"],"divs":["Sighting DetailsI was walking to bus stop to go to work. I was going underneath a tree when my awareness was directed upwards. I looked up and saw a star like object Directly over head. Pretty far up maybe the height regular planes fly when traveling to another state.It was still a bright day outside. There were clouds out but there were no clouds in the region of the ufo. I thought to myself \"hmmm this must be what a ufo looks like. But the only way for me to really know is for it to disappear.\" I was still walking while observing this. As I came from underneath the tree the star was gone. I had now stopped in my path. I decided to look up for a while, the object reappeared... It was turning invisible to visible like someone was playing with the fade to transparent but on Photoshop but in in real life. I observed this for 10 mins. At the brightest section of that \"fade adjusting\" it was bright like a star. It looked like it was reflecting the sunlight. It was silver in color like aluminum. At the mid of the fade I could actually see the shape and of the craft. The craft faded away. I started back towards the bus stop. Upon reaching the buss stop 10mins or so went by as i wondered and replayed the event in my head. The idea of recording it with my phone also dawned on me too. Sadly every time I took it out to record the event the UFO would turn fully invisible. Another couple mins would go by and it would come out again and this proceeded a couple times until I gave up trying to record it.Another star like object was on the horizon. I did not realize when it may of popped up or if it had been there the whole time. At this time the sun was starting to set and the color of the sky was of a orange hue. So at this point I believed it to be an actual star. Until It started to fade in and out again. I noticed that clouds around the object were being sucked up. I observed this for a while more than 10mins this time. Until it completely disappeared and didnt re appear. The buss was late by the way as expected.... I saw another star like object but this time it was south west heading east. This one could of been a plane but it had the same steady bright silver star like color as the other ones. It was also traveling pretty fast compared to planes in my opinion. It seemed like it was heading my direction. It disappeared and I realized the buss was just down the street.... The End. Didn't know of Mofun till the movie Sirius aired. Even then Ive seen so many ufo i didn't think it was relevant to list the events."],"Weather Factors":"Unknown","Date Submitted":"06/11/2013 09:22 UTC","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around August 12th 2011"],"Object Flight Path":"Stationary,Straight-line path","Case Number":"48070","Viewing Distance":"501 Feet - 1 Mile, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=29.767583,+-95.36489(48070)&iwloc=A&hl=en\"> mufon case (48070) map </A>","Object Shape":"Star-like","Object Features":"Unknown","Tags":"City"}