{"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Region":"Colorado","Date of the Event":"06/11/2013 08:25 UTC","Longitude":"-104.810033","Tags":"City","divs":["sighting detailsi was in the parking lot near the corner of illif and chambers in 80014 talking to my friend facing nne and out of the corner of my left eye i saw an object and then looked directly up. it was about the size of 3 quarters side by side. black with swirls\\stripes of dark brown. at first for the first few seconds it was a round ballon shape then looked like a butter bean. if you look at the side profile of a bean and it was heading from left to right, the left side\\back of it slightly dipped down and picked up speed. i would imagine it was about 40-100 feet above us. we continued to watch it as it flew directly east slowly rising in altitude picking up speed very smoothly. i would guestimate about 15-20 sec later it rose smoothly and fast to a higher elevation. i wondered why and then saw an airplane come into my view traveling from south to north that i assume was landing at denver international airport. in my opinion it rose in elevation to miss the airplane. it was 2 quarters higher than the airplane at the time. the airplane passed behind some trees and the object continued its path into the eastern distance and disappeared into a little pin dot. i felt a surrealness come over me, an awakening once i first saw it slightly tilt back. i believe i saw an object i cannot explain other than as i have wrote here."],"Latitude":"39.677163","Object Features":"Patterned Surface","Date Submitted":"06/11/2013 11:13 UTC","Country":"United States","Viewing Distance":"21-100 Feet, 101-500 Feet","Disposition":"Unresolved","Summary":"Black brown bean object heading east over head-went to high elevation for plane landing at DIA","files":["/var/www/straped/mufon/html2text/48077.html.txt","/var/www/straped/mufon/org/48077.html"],"Object Flight Path":"Path with directional change","Log Number":"US-06112013-0033","City":"Aurora","map":"<A HREF = \"http://maps.google.com/maps?q=39.677163,+-104.810033(48077)&iwloc=A&hl=en\"> mufon case (48077) map </A>","Case Number":"48077","Source":"MUFON","trends":["There have been 48 other sightings in Aurora","There were no other sightings in Aurora on or around June 11th 2013"],"Object Shape":"Circle, Disc, Oval, Other"}