{"trends":[],"Log Number":"US-06112013-0032","Latitude":"34.52124","Case Number":"48076","map":"<A HREF = \"http://maps.google.com/maps?q=34.52124,+-105.8605(48076)&iwloc=A&hl=en\"> mufon case (48076) map </A>","Object Flight Path":"N/A","City":"Undisclosed","Date Submitted":"06/11/2013 11:08 UTC","Weather Factors":"Unknown","Source":"MUFON","divs":["Sighting DetailsI was staying at my grandparents house for the summer. My grandpa and I were planning a fishing trip the next morning and we were to leave around 4:30. I was restless because the house was hot and I cannot sleep while I am hot. I cracked open the window and set the tv sleep timer on. I stayed awake well after the tv turned off (10 pm). I have always had a habit of sleeping with my head partially underneath the covers and my eyes peaking out for some reason and I think this night explained why. I saw a light come into the room (I was facing the wall underneath the covers at this point still). I slowly rotated trying to not disturb the blankets for fear of what I might see in the room. I had a very uneasy feeling. I started to sweat like crazy and was struck with fear once I turned over. I saw a dark figure standing at my bed side. It had a large head and skinny appendages and thin body. I could not able to move once I saw it. It stood there for a long time watching me. I could not yell or move. I was only 3 feet away from. Dare I move and let it know I was awake? I think not. I stayed there calm (still sweating) and scared. I eventually hit the point of exhaustion and passed out. I woke up the next morning tangled in the blankets soaked with sweat and tears. A year later I decided to bring this up to my mom. Before I even finished telling her about the green light, she filled in the rest of the story. She had said the same thing had happened to her when she was about my age. This made me no longer think it was a dream. I started thinking about the event. I remembered a prior incident. I had a dream I was falling from the sky and landed on my bed. However, I woke from this dream by hitting my bed hard and bouncing off of it. I was confused as can be. It made me start to wondering if anything else has happened before..."],"Date of the Event":"06/10/1999 12:00 UTC","Summary":"No UFO but humanoid like entity standing at bed side","Viewing Distance":"N/A","Tags":"City","Country":"United States","Longitude":"-105.8605","Sighting Duration":"Undisclosed","Object Shape":"Other, Unknown","Region":"New Mexico","files":["/var/www/straped/mufon/html2text/48076.html.txt","/var/www/straped/mufon/org/48076.html"],"Disposition":"Unresolved","Object Features":"Unknown"}