{"Country":"United States","Case Number":"48086","Disposition":"Unresolved","divs":["Sighting DetailsA friend and I were sitting in my backyard, first we played the \"crop circle noise\" recoding from the CSETI ET Contact Tools. Next we did about 15 minutes of the Dr. Steve Greer Guided Field Meditation. About 10 minutes after doing the meditation my friend felt the need to look in the exact location of where we saw the UFO. It was a bright white orb that at first looked like it could just be a meteor or satellite but then we both noticed that it changed direction (changed angle as if about to go North East), Our first sight of it was at about 85 degrees East and it traveled to about 120 degrees South East. Within 2 minutes of seeing that UFO we both looked at about 30 Degrees North and saw another UFO of the same size and approximate distance from the ground but this one had a reddish tint with its glowing white. This one traveled to about 105 Degrees East before it went out of sight. This UFO weaved up and down while flying. We lost sight of both UFO's due to them either vanishing or moving further out of sight. Within a minute of seeing the 2nd UFO a helicopter flew over from the South towards where we first saw the 2nd UFO. Spot lights from the ground underneath where we initially saw the 2nd UFO were moving around up into the sky lasting for only a few minutes. While I saw the UFO's I was just in awe of what I was seeing. After seeing it I felt a little nervous. Over the last couple weeks multiple helicopters have flown daily towards the 2nd UFO's starting position."],"files":["/var/www/straped/mufon/html2text/48086.html.txt","/var/www/straped/mufon/org/48086.html"],"Log Number":"US-06122013-0006","Object Flight Path":"Path with directional change,Path then hovering","Weather Factors":"Unknown","Tags":"City","Longitude":"-122.171842","Viewing Distance":"Unknown","trends":["There have been 9 other sightings in Marysville","There were no other sightings in Marysville on or around June 12th 2013"],"Region":"Washington","Latitude":"48.053664","City":"Marysville","Date Submitted":"06/12/2013 05:19 UTC","Sighting Duration":"Undisclosed","Object Shape":"Sphere","Summary":"2 UFO's were spotted within minutes of eachother followed by a military helicopter and then search lights.","Date of the Event":"06/12/2013 12:00 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=48.053664,+-122.171842(48086)&iwloc=A&hl=en\"> mufon case (48086) map </A>","Object Features":"Unknown"}