{"Disposition":"Unresolved","Date Submitted":"06/12/2013 04:11 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","Case Number":"48084","divs":["Sighting DetailsI had just spent a week hunting with two friends in the High Uintas Mountains in Utah. On our last day we packed up and where heading home. We had come up in two SUV vehicles so on the way back I was driving alone. We were going to meet up in Evanston at a restaurant to eat before the last push to where we lived in Utah. My two buddys where in the frist SUV and I was following them. As we reached Highway I noticed several deer just eating grass on the side of the Highway. I slowed down to look at the deer amazed that after a week of hunting not seeing any deer worth taking there large groups so close to the road. I was looking to see if there were any Bucks but all I could see was Doe's. When I looked up my buddys SUV was not in front of me the road was very curvy so I figured he was just out of sight but he could not have been more the 30 seconds ahead of me. I was pushing it a little trying to catch up to them but it was very dark with no moon up, and the road has not very straight. Most of the time there was nothing on both side of the road but woods. Somewhere near the Wyoming border I am not sure exactly which side, I had just came out of a slight right curve my radio went out, followed by my Jeep SUV beginning to slow down like my truck had just be shut off in neutral. Then from the field to my back right a huge bright light came on like a spot light. I remember turning to look at the light and then the light fading. I remember turning around and realizing the SUV had stopped rolling and was dead. I remember looking around not seeing any thing but the dark night, then the truck lights slowly came on. I was confused and scared. I started the jeep and just wanted to get away. I remember driving as fast as I could for about another 20 minutes or so to get to Evanston. When I arrived at the restaurant where my friends were already seated and there food was coming out. They told me they had been there for 25-30 minutes and asked me what talk me so long and gave me a hard time for driving so slow. I told them about the light but when they started giving me a hard time I just dropped it. This event has stayed with me very clearly over the years, I have told some of my close family and one or two friends. One friend of mine that I told brought it up in front of other friends to embrace me. So I really have just kept this to myself. They reason I am reporting this is when I came home today my son was watching a show on TV about a family that had a similar event happen to them and they mentioned they reported it to MUFON. I don't know what happened or think I ever will but I felt I needed to tell my story."],"Latitude":"39.32627","Log Number":"US-06122013-0005","Country":"United States","files":["/var/www/straped/mufon/html2text/48084.html.txt","/var/www/straped/mufon/org/48084.html"],"Region":"Utah","Longitude":"-111.090011","trends":["There have been no other sightings in Evanston Wyoming","This sighting has never been favorited."],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.32627,+-111.090011(48084)&iwloc=A&hl=en\"> mufon case (48084) map </A>","Object Flight Path":"N/A","Object Shape":"Other, Unknown","Object Features":"None","Tags":"City","Date of the Event":"10/20/1994 12:00 UTC","Summary":"Did not see a Craft, just a extremely high intensity bright light","Viewing Distance":"101-500 Feet","City":"Evanston Wyoming"}