{"Longitude":"-82.606481","Summary":"flying stars","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/48099.html.txt","/var/www/straped/mufon/org/48099.html"],"Latitude":"38.11305","Country":"United States","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Date Submitted":"06/13/2013 03:27 UTC","Sighting Duration":"Undisclosed","Source":"MUFON","trends":["There has been one other sighting in Louisa","There were no other sightings in Louisa on or around June 12th 2013"],"divs":["Sighting DetailsI stepped out to my patio at 11:02 PM eastern time. It's completely dark with no street lights within 700 + yards. It is a completely clear and calm night and the stars are bright and easy to see. I live directly beneath jetway J8 or J6 at (30*07'26.27\" N) (82*38'18.90\"W) and noticed 5 airliners in rout heading south west away from my back door like always approximately 35,000 feet give or take 5,000? So I know at least 1 or 2 of these airliners should have seen this also. As I'm standing out back looking southwest watching the airliners fly over and I noticed to my left a really bright star only that star is moving then I noticed it somewhat began to dim to a dark blue then got bright as a landing light Then dimmed to the color of a normal star then dark blue again where I all most lost it and Repeated this sequence 4 more time. As all this is happening I'm trying to put together what am i seeing? first I thought it was a plane then satellite and maybe it's the sun hitting it under the horizon and then it got to my 2 o'clock and just Instantaneously stopped and blended in with the surrounding stars!!! I didn't take my eyes away from it for over 30 seconds and it was just sitting still then I started to question if I was still looking at the same thing doubting I really just saw what I saw so I started to scan the sky again to try and regain sight of it. Then another light that looked like a landing light caught my eye at my 11 o'clock taking the exact same path only faster It seemed. Now this is where it gets scary. When the second one gets to the point where I lost the first one that blended into the stars The one I lost brightened back up and instantly matched the second ones speed and directly fell in behind the second one and following it out of sight and seemed to change directions to the north east? The colors I noticed were star white. Dark blue and bright halogen bulb yellow like a landing light or reflection from the sun off something metallic. They were the exact size of a normal star just looking up at night. This all happened in under two minutes and guessing if it had been continuous it would have crossed the horizon well under a minute. The airliners take 3 or 4 minutes from the time I can see them directly overhead. I could hear the airliners overhead but not the lights I were seeing. They had to be well over 70,000 feet if they were even in the atmosphere at all? I've had a pilots license 20 years this November So i have a little knowledge of what I'm seeing when I look up and I've never seen anything like what I saw last night so if anyone could please explained to me what I might have seen please feel free to contact me I'd love to hear your theory's."],"City":"Louisa","Region":"Kentucky","Case Number":"48099","Object Shape":"Star-like","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.11305,+-82.606481(48099)&iwloc=A&hl=en\"> mufon case (48099) map </A>","Disposition":"Unresolved","Date of the Event":"06/12/2013 12:00 UTC","Log Number":"US-06132013-0003","Viewing Distance":"N/A","Object Features":"Unknown"}