{"Case Number":"48098","Object Shape":"Fireball","files":["/var/www/straped/mufon/html2text/48098.html.txt","/var/www/straped/mufon/org/48098.html"],"Object Features":"Unknown","Date Submitted":"06/13/2013 03:26 UTC","Viewing Distance":"Over 1 Mile, Unknown","Longitude":"-83.57446","Tags":"City","Sighting Duration":"Undisclosed","Region":"Tennessee","map":"<A HREF = \"http://maps.google.com/maps?q=36.445412,+-83.57446(48098)&iwloc=A&hl=en\"> mufon case (48098) map </A>","divs":["Sighting DetailsMy cousin and I were outside in my front yard, I live in a very rural part of the country, so Im always looking at the stars, you can see everything..we were looking at the big dipper and I was explaining to her that you use it to locate sirius and explained the constellations actual name to her \"ursa major\" when I looked South over-head and noticed at first, a solid red-orange light speeding across the sky, at first I thought, \"thats a satellite.\" Then upon further observation I realized this object was not only moving waaaaaay to fast to be a satellite, but it was also too large to be a sattelite. There was a commercial airliner in the air at the same time as the object, and I could tell the object was flying a good distance higher than the airplane, and it still yet appeared much bigger, made no sound whatsoever, and was moving about twice as fast. It flew in a straight line path directly southwest and disappeared over the trees. This is one of many things I have seen. If anyone gets the chance, go to Washburn, Tennessee. It is located in Grainger County, Tennessee. It registers a 1 on the bortle dark sky scale, which means you can see at least 95% of the night sky and stars contained within that margin. You can see a whole mess of sightings down there."],"Country":"United States","Source":"MUFON","Latitude":"36.445412","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Log Number":"US-06132013-0002","Disposition":"Unresolved","Date of the Event":"06/04/2013 01:05 UTC","Summary":"solid to pulsating orange-red light flying at least mach 2 with no sound.","City":"Tazewell","trends":["There have been 2 other sightings in Tazewell","There were no other sightings in Tazewell on or around June 4th 2013"]}