{"Date of the Event":"06/12/2013 01:12 UTC","Latitude":"40.847091","files":["/var/www/straped/mufon/html2text/48107.html.txt","/var/www/straped/mufon/org/48107.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.847091,+-81.255252(48107)&iwloc=A&hl=en\"> mufon case (48107) map </A>","Object Flight Path":"Straight-line path","trends":["There have been 2 other sightings in Louisville","There were no other sightings in Louisville on or around June 12th 2013"],"Longitude":"-81.255252","Date Submitted":"06/13/2013 01:38 UTC","Disposition":"Unresolved","divs":["Sighting DetailsI wasn't very tired, so I went outside and sat in my driveway just outside my garage door. I was looking to my right, when a bright light in the sky caught my eye. I looked up and saw two glowing objects moving west to east, maybe 1500-2000 feet high. I then saw a third similar object quickly approach the other two, also from the west. The object to my right rapidly accelerated, passed the first unit and took the lead. The three objects then flew in a \"v\" formation. At this time they were directly overhead. They passed over the house and continued east. As I turned my head back to the west, three more objects, identical to the first three, quickly approached from the west in the same path as the first three, also flying in a \"v\" formation. I listened for sound closely for sound, and heard nothing. I also could not detect any vapor trail, etc. behind the objects. When I first saw these objects I said \"Holy crap,\" and just watched. Just as the second group of objects were passing overhead, I could hear a prop plane in the distance. I began scanning the sky for it's lights but couldn't see it. I wondered if the pilot saw the same thing I did. Then, from the east, the plane flew overhead, along the same flight path as the two sets of objects. In my mind, I couldn't see how the pilot could have missed them. The plane I saw was fling slow, maybe 100-140 MPH, at approximately the same altitude as the objects I saw. The plane appeared to be black, no wing tip lights, but did have a dimly lit tail light. The plane was a single engine prop and reminded me of a Cessna 172 (which I used to fly), but was a little larger. The plane continued west. In the instant I saw the first two objects, I thought \"meteorite.\" But I immediately realized they weren't because of the color, size and speed of them. Next, I thought \"UFO\" and thought they could have been military test flights or perhaps extra-terrestrial. I wasn't really frightened, but I remained very still as they all passed over. I wish I had a camera at the time. Now, two days later, I'm still thinking of the event, and felt that I needed to tell someone about it."],"Country":"United States","Object Shape":"Triangle","Case Number":"48107","Source":"MUFON","City":"Louisville","Tags":"City","Weather Factors":"Unknown","Object Features":"None","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Region":"Ohio","Summary":"3 glowing objects flying west to east followed by 3 more, all in a \"v\" formation","Log Number":"US-06132013-0011"}