{"Latitude":"40.767412","Object Shape":"Cylinder, Disc","Date of the Event":"06/24/1976 12:00 UTC","files":["/var/www/straped/mufon/html2text/48102.html.txt","/var/www/straped/mufon/org/48102.html"],"Source":"MUFON","Weather Factors":"Unknown","trends":["There have been 2 other sightings in Astoria","There were no other sightings in Astoria on or around June 24th 1976"],"Object Features":"Window(s)","Longitude":"-73.884117","Region":"New York","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.767412,+-73.884117(48102)&iwloc=A&hl=en\"> mufon case (48102) map </A>","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","City":"Astoria","Log Number":"US-06132013-0006","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","divs":["Sighting DetailsI was waiting for my boyfriend to park my car in a garages rented. I noticed a strange light in the sky and first thought it was a helicopter since we live by La Guardia airport but as we were walking back to my apartment it seemed to be following us. It was around 11 pm on a Sunday night the end of June 1976. As we were standing looking up at this UFO it seemed to come closer like it was watching us and then shot off and disappeared without a sound. Everything was so quiet. Then a friend walked by and he stood there with us watching the UFO. I started to get scared it came so close and I saw windows around the ship. I was scared that we were going to be abducted and said I wanted to go into my apartment. It definitely was watching us. We left and I called the 114 precinct and did not get an answer. I called the daily news and they said they received reports from Staten Island and Brooklyn and NJ and it was a broadway light. I said a broadway light does not have windows. They hung up and that was the end of my reporting it. I have spoken about it over the years. And since I am getting older I know what I saw and what I experienced."],"Case Number":"48102","Date Submitted":"06/13/2013 11:53 UTC","Summary":"Following felt watching me them hovering overhead taking off so fast no sound and returning. Very close and large.","Disposition":"Unresolved","Tags":"City"}