{"Case Number":"48105","Date Submitted":"06/13/2013 12:26 UTC","Weather Factors":"Unknown","Summary":"Reflective Metallic Oval Shape that hovered in place before turning in on itself as it disappeared.","Tags":"City","Object Features":"Unknown","Region":"Mississippi","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=30.371955,+-88.552297(48105)&iwloc=A&hl=en\"> mufon case (48105) map </A>","Longitude":"-88.552297","Viewing Distance":"Unknown","Latitude":"30.371955","Source":"MUFON","Country":"United States","Log Number":"US-06132013-0009","City":"Pascagoula","Date of the Event":"08/01/2011 12:00 UTC","Object Shape":"Oval","divs":["Sighting Details4 of us were in a 21ft Mako- Center console fishing boat. We were just next to one of the LHD battleships, fishing towards the shore and had decided to turn in and go home. As we started back south towards the boat launch I was sitting towards the bow in front of the console on the Starboard side and just happened to look up to the WSW. I saw this object that was over the southern most tip of the shipyard before the bridge that heads to the Home Port Island. It just sat there hovering. It was hard to tell the distance, and it all happened so fast. This metallic object that I can only describe as large and oval shaped that reflected light. It looked as if it began to turn in place. Yet as it did, it grew smaller. Within a matter of seconds it was gone. It had not \"flown away\", just vanished. It was as if it turned in on itself. It happened so fast I could not even point it out. I tried to explain what I saw to my friends, but you can guess how that went. I questioned myself about it for some time. Little did I know that in less than 1 year I would see the exact same thing again. For a long time I was mad at myself for not pointing it out immediately, but I tried to immediately rationalize the object. By the time I had my suspicions it was too late."],"Object Flight Path":"Stationary","Disposition":"Unresolved","trends":["There have been 4 other sightings in Pascagoula","There were no other sightings in Pascagoula on or around August 1st 2011"],"files":["/var/www/straped/mufon/html2text/48105.html.txt","/var/www/straped/mufon/org/48105.html"]}