{"Date of the Event":"07/04/1995 12:01 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.496972,+-117.671399(48108)&iwloc=A&hl=en\"> mufon case (48108) map </A>","Source":"MUFON","Object Features":"Unknown","Date Submitted":"06/13/2013 02:15 UTC","Weather Factors":"Unknown","Summary":"Weird String!!! A translucent string stretched several miles above community then abruptly bent about 90 degrees up to hovering object high in sky; then object ejected one smaller object NE and string disappeared; UFO disappeared too.","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Longitude":"-117.671399","files":["/var/www/straped/mufon/html2text/48108.html.txt","/var/www/straped/mufon/org/48108.html"],"Object Flight Path":"Stationary,Hovering then path,Other","divs":["Sighting DetailsThis event happened about 18 years ago, I was 13-14 years old while my buddy was 16 or so. Their was an entire community that witnessed it and a video exists with a neighbor but not currently available to me. My friend and I were playing basketball on my driveway when we noticed a translucent string above my house. It was stretched tight from west to east, and about no more than 6-8 feet above my one story house. We got on our roof to see it closer and it was like fishing string, translucent. My friends family came outside to see what we were doing on the roof and we explained the situation to them. They got their video camera and began filming. A neighbor across the street came out and saw the string also and asked where it came from. We explained from atop the roof it appeared to be coming from the beach area (west). He got in his truck and left to search for the origins of the string; by now more neighbors were outside. Meanwhile, we noticed the string elevated slightly (about five degrees) east towards a two story christian school behind my backyard (about 50 to 75 yards away). We went to the school and climbed on it's roof to get a better look to see how far the string went east. Surprisingly, when we got on the roof of the building we were astonished to find the string shot straight up, angled at about 100 degrees straight up (it was almost perfectly perpendicular to the roof top). We squinted our eyes as best as possible to see how far the string shot up and what it was attached to (a kite or balloon we thought). We noticed high above their existed a hovering dark object, about the size of this letter \"O\". It was a clear blue day but the object was too high to see much detail. As we stared at it the object a bit longer, maybe 10 minutes or so, we noticed the object ejected another object. The ejected object circled like a satellite around the main object for a few minutes, maybe five. Then the ejected object slowly traveled (I want to say north east, maybe east) while the original object remained hovering still, and then it too disappeared. I remember being so shocked at what I was witnessing I completely forgot about the string. I didn't notice if the string disappeared with the hovering objects, or earlier, but it too was no longer to be found. I think this event is unique because I've never heard anyone talk about UFO's and weird physics defying string. I'm hoping others have witnessed something similar to this event. I don't know why I'm barely coming out with this but I guess we had nobody to report it to back then and newspapers would not have taken our story. Now, with the internet, and my recent discovery that your organization exists, it just seemed appropriate. PS I'm a math teacher."],"Region":"California","Country":"United States","City":"San Juan Capistrano","Log Number":"US-06132013-0012","Object Shape":"Circle, Disc, Oval, Sphere, Unknown","Latitude":"33.496972","Case Number":"48108","trends":["There have been 5 other sightings in San Juan Capistrano","There were no other sightings in San Juan Capistrano on or around July 4th 1995"],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Tags":"City"}