{"Object Flight Path":"Other","Latitude":"37.075895","Summary":"Looked like birds but glowed in the dark? and had extreme speeds","Country":"United States","City":"Galena","Longitude":"-94.639671","Date Submitted":"06/13/2013 05:18 UTC","Tags":"City","trends":["There have been no other sightings in Galena","This sighting has been favorited 1 time."],"Date of the Event":"06/01/2013 10:00 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/48110.html.txt","/var/www/straped/mufon/org/48110.html"],"Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=37.075895,+-94.639671(48110)&iwloc=A&hl=en\"> mufon case (48110) map </A>","Log Number":"US-06132013-0014","Object Features":"Wings","Region":"Kansas","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet, Over 1 Mile","Case Number":"48110","Sighting Duration":"Undisclosed","Disposition":"Unresolved","divs":["Sighting DetailsI was outside on my front deck looking west about 10pm central time. Immediately i noticed these strange objects in the sky to the west. At first they appeared a mile or so away,really hard to tell but they looked like dim white stars glowing and then they would move at quick speeds and stop,then disappear,then some would reappear and make patterns and then disappear again. After a few mins I had my wife come outside,she saw them,gave me a funny looked and walked back inside. I kept watching for several minutes,all of a sudden one flew from the west straight to the south,several miles,within a split second. I really thought they were birds until i saw that happen. I texted several people and my sister and brother in law showed up. We all observed this event for an hour or 2. About 12ish they left and I went to bed. The very next night it happened again,but since then nothing. I tried recording with my Galaxy s3,but you cannot make them out,too dim. Hopefully with your equipment you can somehow see them,you can see me pan right and left trying to capture when they appear. Note you will see streetlights and the red light is a cellphone tower. I only looked at one vid once,once i uploaded on my pc.You can also see stars flickering,these are not the objects of course. Again they appear and move then disappear within a 2 second period. Hope you can see them."]}