{"Sighting Duration":"Undisclosed","Case Number":"48112","Log Number":"US-06132013-0016","Object Flight Path":"Hovering then path","Summary":"Sphere like object very bright started moving slowly away, the light dimmed leaving outline of sphere, transparent and then disappeared.","files":["/var/www/straped/mufon/html2text/48112.html.txt","/var/www/straped/mufon/org/48112.html"],"Date Submitted":"06/13/2013 07:55 UTC","Region":"Texas","Date of the Event":"06/12/2013 04:00 UTC","trends":["There have been 128 other sightings in Fort Worth","There were no other sightings in Fort Worth on or around June 12th 2013"],"Object Features":"None","Weather Factors":"Unknown","Source":"MUFON","Object Shape":"Sphere","Disposition":"Unresolved","City":"Fort Worth","map":"<A HREF = \"http://maps.google.com/maps?q=32.680032,+-97.354169(48112)&iwloc=A&hl=en\"> mufon case (48112) map </A>","Latitude":"32.680032","divs":["Sighting DetailsI've been interested in the Universe and physics for most of my life. I've spent many nights just gazing at the stars looking for unusual objects. I've seen hundreds of satellites moving slowly across the night sky. I've seen the space station as light reflected off of it from the sun as it moved across the sky. I used to see them more frequently living on a farm in Cross Plains, Texas. Now living in the city the lights keep me from seeing such a large number of stars and planets, but on some nights the visibility is good. On several occasions recently I've see what I initially thought was a satellite moving across the sky only to see it make a complete u turn and head the opposite direction and I've seen small dimly lit objects moving in different directions across the night sky changing speeds but nothing I could say for sure it was a UFO. Last night I was having a hard time sleeping, so at 4:00 am I got up and went out to the front porch, it was a good clear night. When I first stepped outside I look across the street toward the Western Sky where I frequently see bright planets and stars, but when I looked up this time I immediately saw this very bright circular object, it was a bright as a car head lamp at one block away. It didn't cast a beam, it glowed brightly. I first thought to myself wow that is the brightest planet I've ever seen, not even thinking about UFO's. As I stood there for a few seconds it started moving away from me, so I sort of ran toward the road to get a better view. As I did this, the light started to dim until all that was left was a round transparent sphere. It looked like a clear glass ball in the sky. As it kept moving away it slowly disappeared out of sight. I actually stood there for a few minutes with my mouth wide open staring at the sky. This was like nothing I've seen before. it was big and bright and made no sound. I didn't see any air traffic around for several minutes. I know the patterns the planes take as they approach the airports or take off. I also see fighter jets as they take off from Carswell, they usually fly very high once they get this far. This object was within our atmosphere. Hard to tell how high but to guess 5,000 ft or less. At that height I would guess it was 300 feet in diameter. It emitted its own light, not a reflection."],"Tags":"City","Longitude":"-97.354169","Viewing Distance":"501 Feet - 1 Mile","Country":"United States"}