{"Viewing Distance":"Over One Mile","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/48118.html.txt","/var/www/straped/mufon/org/48118.html"],"Log Number":"AU-06142013-0003","Date of the Event":"06/14/2013 10:15 UTC","Disposition":"Unresolved","divs":["sighting detailsi was standing in my backyard having a cigarette and i saw what i thought was a lantern crossing the sky above the roof tops in my suburb gainig altitude and travelleling at some speed. i thought nothing of it. i walked to the other side of my garden and it appeared in the distance over my roof line travelling in a northwards direction gainig altitude and speed away from me and into the darkened clouds then disappearing. i wasn't sure at the time what it was. (bright orange orb). then i seen two more orange orbs following in a similar direction a 30 - 60 seconds between each sighting. the last was closer and seemed brighter but followed the same flight path as the first two. there was no noise i could hear. i was fixated on them and unfortunetley didn't get any pictures.i just stared at them and was trying to work out what i could be seeing. i dismiss them being a lantern as they were really bright orange and disappeared from view within a minute. also there was hardly any wind. quite a freaky experience as i have never seen anything like this before. hopefully i won't be the only person reporting this as i live in a populated area of melbourne. this sighting has happened at night, the only feature i could see was the bright orange orbs. the date is the 14\\06\\2013. sighting ocurred at 10.15pm"],"Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=41.061529,+-76.227928(48118)&iwloc=A&hl=en\"> mufon case (48118) map </A>","Sighting Duration":"Undisclosed","Latitude":"41.061529","Date Submitted":"06/14/2013 09:23 UTC","Region":"Pennsylvania","Summary":"Three bright orange orbs flying","Case Number":"48118","Weather Factors":"Unknown","Longitude":"-76.227928","City":"Berwick","Object Features":"None, Unknown","trends":["There have been 2 other sightings in Berwick","There were no other sightings in Berwick on or around June 14th 2013"],"Source":"MUFON","Country":"United States","Tags":"City"}