{"Latitude":"33.984523","Region":"Texas","files":["/var/www/straped/mufon/html2text/48111.html.txt","/var/www/straped/mufon/org/48111.html"],"Object Flight Path":"Straight-line path,Path with directional change,Other","Longitude":"-101.337657","Object Features":"Unknown","Tags":"City","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Unknown","trends":["There have been no other sightings in Floydada","This sighting has never been favorited."],"Log Number":"US-06132013-0015","City":"Floydada","Object Shape":"Cigar, Circle, Cylinder, Disc, Flash, Other","Country":"United States","Weather Factors":"Unknown","Summary":"observed about 60 horizonal red lights in rows blinking simultainiously then 6 to 10 bright white vertical lights flashing upward in sequence from the red light field, later appeared a round object in front with several rows of white lights around it","Case Number":"48111","Disposition":"Unresolved","Date Submitted":"06/13/2013 06:37 UTC","Date of the Event":"06/06/2013 10:35 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.984523,+-101.337657(48111)&iwloc=A&hl=en\"> mufon case (48111) map </A>","Sighting Duration":"Undisclosed","Source":"MUFON","divs":["Sighting DetailsWe were traveling home from the Lubbock area after a doctor visit on June 6th, 2013, heading East on Hwy 62 moving between Floydada in Floyd County and Matador in Motley County just after 10:30 pm. We had stopped in Floydada for gas at 10:25 pm. I was driving the speed limit of 75 mph with the cruise control on. It was very dark because there was a new moon. My husband, first saw the red lights to the South of the highway. It was a huge field of bright sequentially blinking bright red lights and it was a little ahead of our position. My husband said to me \"Look at all those bright red lights. It doesn't look like any kind of airfield I've ever seen, besides this is Floydada. No airfields this large around here.\" Then I looked and commented that I didn't think airfields had rows of bright red blinking lights. Then he said \"They are blinking sequentially.\" We were only about a few of miles outside Floydada heading East. There were about 60 to 100 of these red lights in horizontal rows blinking simultaneously about a mile in length and about tree height above the plains. Then suddenly we noticed that we were alongside parallel to the field of red lights, just about in the middle. My husband was telling me excitedly about this as I looked over and saw the same thing. It was parallel with us. A few minutes after seeing the red light field become parallel to us, we then saw 6 to 10 bright white vertical lights appear within the red light field flashing upward in sequence. However, the white light \"pillars\" were not in sinc with the red lights. These vertical white lights continued for several minutes and then vanished. Since I was driving, my husband kept his eyes on the objects. I was looking as much as possible. The objects traveled parallel with us for about 10 to 15 miles continuously then slowed a bit so we were ahead about a quarter mile or so. Then suddenly they were back parallel to us. By now we were discussing how we were certain that this was and event like nothing either of us had ever encountered before and that these were something unknown and extraordinary. We were not afraid and did not have any feeling of urgency or anything. I wanted to pull over and watch but my husband was so tired and wanted to continue home. Then, however, another large object just appeared in front of the red light field. It was a round object, not a sphere but a very large circle or large cylindrical shape, flat on top and bottom, out in front of the field of red lights still blinking simultaneously. The round object had several rows of bright white light panels rotating around it. It appeared to be rotating slowly. This was all totally bazaar! These followed along parallel to us for another 10 miles or so until we came to the canyons of the Cap-rock off the plains where the highway cut into the canyons and blocked the view. We both think and talk about this almost constantly. It was incredible to see such a thing! We had to tell you about this. I am an amateur painter and I am attempting to paint the scene. I won't be able to do it justice."]}