{"Country":"United States","files":["/var/www/straped/mufon/html2text/48127.html.txt","/var/www/straped/mufon/org/48127.html"],"Object Features":"Unknown","Summary":"Color-changing, low-flying spherical object rapidly ascending, descending, doing aerobatics,","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Date of the Event":"06/05/2012 10:30 UTC","Region":"California","Weather Factors":"Unknown","Object Shape":"Sphere","Case Number":"48127","Viewing Distance":"Over One Mile","Longitude":"-117.02589","City":"Poway","trends":["There have been 7 other sightings in Poway","There were no other sightings in Poway on or around June 5th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.96428,+-117.02589(48127)&iwloc=A&hl=en\"> mufon case (48127) map </A>","Log Number":"US-06142013-0012","Tags":"City","divs":["Sighting DetailsI was outside on the front porch having a cigarette. I came to notice the light very quickly, as we have a very wide, unobstructed view over the Poway valley from our home in the hills. The light was bright; equivalent to a Xenon automobile headlight in the night sky from 2-4 miles away, and changing color in a random (to the best of my knowledge, random) manner. I did not see the structure of an object, just the light emanating from it. I was visiting my parents at the time, and asked my mother to step outside with me to witness this very unique spectacle. She stood with me for ten of the fifteen minutes that I was watching the object. The object moved swiftly over the town center, about four miles away from the spot where is was witnessed. It rapidly ascended, descended, did loops, sped up to striking high rates of speed, and made swift turns. The light continued to change color and remained at a similar intensity regardless of what direction it was moving. I was awe-struck by the rapidity of the ascensions, as the object would move from approximately 20 feet above the ground (relative to the floor of the valley) to over 1400 feet (relative to sea level, using a known landmark mountain as a reference point) in just a few seconds. There was no sound coming from the object. Familiarity with the topography of the valley and a known reference point; Black Mountain, standing at 1558 feet, were used to calculate approximate distances. The object swept across the valley at speeds of approximately 60 miles per hour, ascending and maneuvering at this maximum speed. There were short periods where the object would dive low and hover, then rapidly ascend to the maximum height from which it was witnessed, +15 degrees over Black Mountain, which is about ten miles from the home; the home itself stands at about 660 feet above sea level. My mother stated that she thought the lights (white, pressurized sodium) on the ground over a community park were brighter than normal in comparison to other nights, I disagreed and suggested that we check the next night to see if that was true. We could not reach consensus about the ground lights near the community park, I felt they were about the same intensity the next night. We both agreed that there was some sort of conventional explanation and didn't pursue the issue further. Neither of us have been able to determine what it was and we have not seen it again since. We agreed that the turns and maneuvers were not possible in an airplane or model, and that a model helicopter would not be able to bank or ascend so rapidly like we witnessed. So here I am, just over a year later, wondering exactly what it was we saw that night. I am certain of the date and time, I recorded it for later reporting. I witnessed this event from 2215-2230 and went inside the house after this, as neither of us had the time or energy to pursue an explanation. I hope to know some day what it was that we witnessed over the valley in the night sky."],"Date Submitted":"06/14/2013 04:30 UTC","Latitude":"32.96428","Sighting Duration":"Undisclosed","Source":"MUFON","Disposition":"Unresolved"}