{"Weather Factors":"Unknown","Tags":"City","Log Number":"MX-06142013-0009","Latitude":"19.077834","Longitude":"-104.288583","Country":"Mexico","Case Number":"48124","Sighting Duration":"00:00:10","Summary":"Flying from the ocean to land (south to north) two transparent (mimetised) wings, no central body in the middle, stars can be seen trough, i pointed it with my finger for 5 seconds and my wife could see it!! gone in the next 4 or five seconds, so lapse","Date of the Event":"04/20/2013 12:00 UTC","Object Shape":"Other","Disposition":"Unresolved","Viewing Distance":"20 Feet or Less","Source":"MUFON","Object Features":"Wings","files":["/var/www/straped/mufon/html2text/48124.html.txt","/var/www/straped/mufon/org/48124.html"],"trends":["There have been no other sightings in Manzanillo Municipality","This sighting has never been favorited."],"Region":"Colima","Date Submitted":"06/14/2013 01:17 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=19.077834,+-104.288583(48124)&iwloc=A&hl=en\"> mufon case (48124) map </A>","City":"Manzanillo Municipality","divs":["Sighting DetailsI was at the roof terraze with wife and friends,we were layed down watching for satelites (my friend vanesa had never seen one) We had seen so far, 2 satelites an one shooting star, every body was watching one cardinal point,thereabouts. I had the north, my wife was in the middle watching north east, suddenly i noticed the lines of two wings, transparent and mimetised with the stars, it looked like it did not float in the air but all the way around, that thing look like it was moving trough water, flyingo from south (ocean pacific) to north (in land) the wings were Kind like the egiptian or roman eagles, like any other wings i ever seen in diferent culture, I POINTED A T IT FOR 5 seconds untill my wife could see it, i put my head next to hers so he can follow my finger,she saw it for 3 seconds and the wings disapeared in the next two seconds, i asked her in front of my friend \"how did it look like\"? and at the same time we said \"long straight wings\" drawing the form in the air with our hands. I was not very happy to see that, it look frightening to me, even if i convince my self that the russians or gringos (iam an atheist...or was) have a superior technology than the one we been showed in tv and moovies, even if i stop being and atheist that thing did not look angelical or heavenly, my wife goes to a cristian church and she tought also that did not look friendly. That thing desapeared easy...1,2,3! I think (today) that: 1) There are things floating at night, or it is easier to watch tem at night than day, and these spcetres are \"good\" and \"bad\" trying to do something) 2)There are other planets watching us."],"Object Flight Path":"Straight-line path"}