{"Country":"United States","City":"Sonora","Tags":"City","Object Flight Path":"Straight-line path","divs":["Sighting Detailsmy 33 year old son came in the house Sade hay mom ufo,s out side red lights me my husband went to see I do not remember the date but it was the same night that nubeus the death star was to pass earth so I thought it was from that. but the very bright red lights moving north east didnt seam natural and not flairs they were not falling they were flying across the sky no sound 7 or more of them people acress the street were out there to watching them to no one could explain them my housebound has this instrument that measures distance and it side they were 10.000 feet up . we do not beleave in aliens and am shore there is some explanation and would love to no what it was. but now when we joke about them we say they are red not green. I think about it often and it bugs me not knowing I looked in the paper since so many people saw them I thought it would be in there but nothing all those lights and not a word wearied this small town everything is in the paper and are paper is really small"],"Summary":"(GS) 6 or more red lights the sae night as nubes pased earth we all thoght they were not, thay were moving with purpus nabers all sow them moving over the falls lots of them 10.000 fet we used an instrament my housbond has to chack d","Region":"California","Date of the Event":"03/19/2013 08:08 UTC","Case Number":"48128","Log Number":"US-06142013-0013","Latitude":"38.012782","map":"<A HREF = \"http://maps.google.com/maps?q=38.012782,+-120.292379(48128)&iwloc=A&hl=en\"> mufon case (48128) map </A>","Longitude":"-120.292379","Date Submitted":"06/14/2013 05:11 UTC","Object Features":"None","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/48128.html.txt","/var/www/straped/mufon/org/48128.html"],"trends":["There have been 4 other sightings in Sonora","There were no other sightings in Sonora on or around March 19th 2013"],"Sighting Duration":"Undisclosed","Object Shape":"Star-like","Source":"MUFON","Disposition":"Unresolved","Viewing Distance":"Unknown"}