{"trends":["There have been 4 other sightings in Lincoln City","There were no other sightings in Lincoln City on or around September 27th 1996"],"City":"Lincoln City","Date Submitted":"06/15/2013 04:56 UTC","Latitude":"44.962244","Region":"Oregon","map":"<A HREF = \"http://maps.google.com/maps?q=44.962244,+-124.014131(48148)&iwloc=A&hl=en\"> mufon case (48148) map </A>","Case Number":"48148","divs":["Sighting Details We were at a time-share condominium in Glen Eden, Oregon, on the night of Sept 27, which was the night of a lunar eclipse, which had drawn our attention to the eastern night sky. As we monitored the sky, I noticed, and pointed out to my spouse, an unusually orange object in the medium-low sky to our east-northeast. It displayed what could be described as normal aviation characteristics for what a small plane coming nearly at us would look like, apparently enlarging, rising slowly, and moving slightly to our right (south-east as we viewed it). The object apparently turned to its left(continuing the small plane flight path analogy) and momentarily dripped flaming orange material or objects that extinguished very quickly after falling from the main orange light. The orange object continued its apparent left turn and we managed to see it for a few more moments through the trees as it passed left-to-right about 25 degrees elevation before we lost sight of it. There were never any observable aircraft navigation lights. The total time of observation was about one minute at most. Time of observation was approximately 20:30. There is an airport very nearby. It was for that reason that we originally tried to 'sensibly put it together' to make the object be a small plane, even if one improbably on fire. If it was on approach after its left turn (it appeared to be that low) it was also going downwind for that runway, and the flight path eventually took it over and past the airport, anyway. We'd like to add that, in terms of hoaxing, that we know the possibility always exists. The area that the flaming object was dripping over is coastal Oregon forest, in September. Irresponsible as hoaxers may get, the chance of starting a forest fire with a low-flying fire-bomb as a prank in an area famous for its winds seems remote. And the object would have to have been rather complicated for what we saw it do: fly, apparently under control, on fire(?) in strong winds and drip flaming material. Whatever it actually was, it looked like a bucket of lava being sloppily lugged in the dark...we couldn't see the bucket, but we could see the lava glowing in it, and flaming as it spilled over the bucket rim. Still...we just don't know what we saw."],"Object Flight Path":"Path with directional change","Object Features":"Unknown","Longitude":"-124.014131","Object Shape":"Unknown","Log Number":"US-06152013-0009","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/48148.html.txt","/var/www/straped/mufon/org/48148.html"],"Country":"United States","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Summary":"observed fire-orange object appear to near then turn, 'dripping' flaming orange material that burned out quickly","Date of the Event":"09/27/1996 08:30 UTC","Source":"MUFON","Tags":"City","Viewing Distance":"Unknown"}