{"Weather Factors":"Unknown","Date Submitted":"06/15/2013 01:55 UTC","Latitude":"41.721963","Disposition":"Unresolved","trends":["There have been 13 other sightings in Oak Lawn","There were no other sightings in Oak Lawn on or around June 14th 2013"],"Tags":"City","Object Shape":"Oval, Star-like","Sighting Duration":"Undisclosed","City":"Oak Lawn","divs":["Sighting DetailsStar gazing as usual actually sighting are quite frequent here but I decided I should start sharing. What made me notice them is when I received a telepathic message of encouragement. I thought it was a meteor at first but there wasn't a tail. I know what the planes look like being close to an air port. What made me go \"Yep there they are\" was how they popped up into the clouds very fast like they were avoiding something. I was happy to see them again. They are becoming very active now. They are noticing the activity on earth and they are concerned. They have solutions to help but they want to know why no one who receives those solutions are doing anything about it. I am in frequent contact with them. They said something about Jupiter and a gravitational pull effecting the system. I don't know. They went into the clouds then disappeared *invisible shield*. I don't care if you don't believe me anymore. When they come I feel happier and my cats go nuts and start running and playing like they just had some cat nip. I will let you know when they come back. I asked if they had any messages and they said no just let the people enjoy the energy. They seem to influence us to love and not fight. There are other beings however that do the opposite. My friends up there are energy beings look like us but transparent and blue light. The others are less human looking. Here's a digital drawing. Again, it looks like meteors but doesn't move like them and meteors don't go up in the clouds they are on the outer atmosphere of Earth keep that in mind. Keep looking up trust me its going to get a lot more exciting all around the world."],"Region":"Illinois","Case Number":"48142","map":"<A HREF = \"http://maps.google.com/maps?q=41.721963,+-87.74411(48142)&iwloc=A&hl=en\"> mufon case (48142) map </A>","Summary":"Very nice visitation tonight they are coming closer now,","Source":"MUFON","Country":"United States","Object Flight Path":"Hovering then path","Object Features":"None","files":["/var/www/straped/mufon/html2text/48142.html.txt","/var/www/straped/mufon/org/48142.html"],"Longitude":"-87.74411","Log Number":"US-06152013-0003","Viewing Distance":"101-500 Feet","Date of the Event":"06/14/2013 09:11 UTC"}