{"Tags":"City","Case Number":"48141","Object Features":"None","Date Submitted":"06/15/2013 01:51 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.397421,+-123.371707(48141)&iwloc=A&hl=en\"> mufon case (48141) map </A>","Region":"Oregon","City":"Grants Pass","Object Flight Path":"Other","Source":"MUFON","files":["/var/www/straped/mufon/html2text/48141.html.txt","/var/www/straped/mufon/org/48141.html"],"Log Number":"US-06152013-0002","Weather Factors":"Unknown","Disposition":"Unresolved","Summary":"A large yellowish-white pulsating light caught our attention.","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-123.371707","Country":"United States","divs":["sighting detailswe were driving back from a party when we saw a large pulsating yellowish\\white light in the sky. at first i though it could be a headlamp from an airplane but the duration and characteristics seemed to void that. another thought was a planet but i have never seen a planet in that direction (nw) nor have i seen one pulsate like this one. it began at about 40 degrees on the horizon and slowly sunk to a mere 10 degrees or so over 20 minutes. i am always keeping my eye to the sky so this really caught my attention. i have seen objects in the past but i don't like to report much anymore yet this seemed to warrant a report and i was able to capture three separate videos which i have posted with this report. we had some pics but they turned out way to smeared during to a moving vehicle to be of use. my wife and i eventually lost sight since it ducked behind a distant hill. at 40 secs into the \"mufon2\" video you see it peak through the trees over the rogue river as we crossed the bridge in town."],"trends":["There have been 35 other sightings in Grants Pass","There were no other sightings in Grants Pass on or around June 14th 2013","This sighting has never been favorited.",""],"Latitude":"42.397421","Date of the Event":"06/14/2013 09:45 UTC","Object Shape":"Sphere, Star-like"}