{"Object Flight Path":"Straight-line path","trends":["There have been 2 other sightings in Dickinson","There were no other sightings in Dickinson on or around June 12th 2013"],"files":["/var/www/straped/mufon/html2text/48153.html.txt","/var/www/straped/mufon/org/48153.html"],"Longitude":"-102.782404","Log Number":"US-06152013-0014","Date Submitted":"06/15/2013 08:19 UTC","Source":"MUFON","divs":["Sighting DetailsI had to pick up my son at the Quality Inn here in town. We were standing in the parking lot on the west side of the building talking to a friend. I was facing south. As I was talking I noticed movement by my friends head. At first I thought maybe it was a flock of birds. But this late at night is not normal. As I watched it for a few seconds I noticed that the object or objects were spherical in shape. There was one larger sphere in the center surrounded by6 or 7 slightly smaller spheres. About half the size of the larger one. Everything stayed uniformed. The smaller spheres were not orbiting the larger one and they seemed to stay evenly spaced at all times. I asked my son and our friend what they thought it was. My son jokingly said it was a UFO. We watched it for about 10 to 15 seconds then the weird part happened. The smaller spheres all moved away from the larger one staying in the same formation they were in previously and returned to the exact positions. I would say 3 to 5 seconds later it just disappeared. No sound. No lights. It was hard to tell if it was glowing or if town lights were reflecting off of it. It looked to be maybe a reddish tan or reddish yellow color. The entire time I witnessed the object(s) was about maybe 20 to 25 seconds. I have always been skeptical about UFOs but over the last 3 years this is the second UFO(?) I've witnessed. The first being in colorado. As in both cases, what saw I can't explain or attribute its characteristics to anything I've seen before. Since my first sighting 3 years ago I try to spend alittle time every night just looking at the skies. You never know. Right?"],"Object Shape":"Circle, Oval, Sphere","Country":"United States","Object Features":"Unknown","City":"Dickinson","map":"<A HREF = \"http://maps.google.com/maps?q=46.880496,+-102.782404(48153)&iwloc=A&hl=en\"> mufon case (48153) map </A>","Sighting Duration":"Undisclosed","Latitude":"46.880496","Case Number":"48153","Tags":"City","Summary":"Larger sphere in center 6 to 7 spheres around it. Uniformed movement. Heading in an east to southeast direction","Weather Factors":"Unknown","Region":"North Dakota","Disposition":"Unresolved","Viewing Distance":"Unknown","Date of the Event":"06/12/2013 10:45 UTC"}