{"Latitude":"39.768403","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path,Path then hovering","Disposition":"Unresolved","Source":"MUFON","Log Number":"US-06162013-0003","Date Submitted":"06/16/2013 01:27 UTC","Country":"United States","Tags":"City","Summary":"at least 5 separate lights maintained jagged position relative to each other as they all drifted at the same rate in a diagnonal upward postion then all disappearing as they reached the same spot in the sky.","Region":"Indiana","Object Shape":"Unknown","Longitude":"-86.158068","files":["/var/www/straped/mufon/html2text/48159.html.txt","/var/www/straped/mufon/org/48159.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.768403,+-86.158068(48159)&iwloc=A&hl=en\"> mufon case (48159) map </A>","Viewing Distance":"Over One Mile","Case Number":"48159","Object Features":"Unknown","Weather Factors":"Unknown","divs":["sighting detailslooking south from carmel indiana around 9:45 p.m. on june 15 2013, at least 5 separate lights maintained jagged position relative to each other as they all drifted at the same rate in a diagnonal upward postion then all disappearing as they reached the same spot in the sky. flight was like a \"drift\". a straggler light came along toward the end and followed the same path and disappeared at the same point as the others. took no more than a few minutes. a helicopter appeared quite a bit lower and to the west of the lights around or after the time they disappeared. the objects at first looked like they might be lights inside of something set \"adrift\". they kept moving at a constant rate. they were too distant to make out a shape but did not appear to have much size (or size\\shape not visible due to nightfall conditions). one or two of the lights had a reddish hue while others appeared more white. one or two were not as bright as the others. some lights were more steady and others flickered. i did not feel anything unusual or hear any sounds from them. was walking my dog and did not have camera or phone to record but stood still to watch them until they disappeared (a few minutes)."],"trends":["There have been 126 other sightings in Indianapolis","There was one other sighting in Indianapolis on or around June 15th 2013"],"City":"Indianapolis","Date of the Event":"06/15/2013 09:40 UTC"}