{"Viewing Distance":"Unknown","Case Number":"48160","Country":"United States","Tags":"City","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=41.525304,+-90.574497(48160)&iwloc=A&hl=en\"> mufon case (48160) map </A>","City":"Davenport","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Date of the Event":"06/16/2013 11:00 UTC","Date Submitted":"06/16/2013 02:09 UTC","trends":["There have been 8 other sightings in Davenport","There were no other sightings in Davenport on or around June 16th 2013"],"Source":"MUFON","Region":"Iowa","Longitude":"-90.574497","files":["/var/www/straped/mufon/html2text/48160.html.txt","/var/www/straped/mufon/org/48160.html"],"Disposition":"Unresolved","Weather Factors":"Unknown","Latitude":"41.525304","Log Number":"US-06162013-0004","Summary":"Two orange/red craft due north, traveling NE acending to outer atmosphere","divs":["sighting detailsfor no reason, looked up to northern sky and noticed two orbs\\craft. walked outside house approximately 11:45am, looked due north and noticed two orange\\red craft\\orbs playing cat and mouse in northern sky. tracked the objects for roughly 5 minutes watching them take ne trajectory. they seemed to be traveling ne at the same time gaining elevation. moving very fast and silent(estimate to relation to experience watching conventional aircraft moving at same approximate altitude and distance of 100 miles north of my location in the sky was more than likely greater than 500 mph). we deducted that the craft were not commercial airplanes or jet afterburners. solid red in color. steady red glow, not blinking or pulsing light. my brother and i both witnessed the crafts\\orbs fading out as if they had tracked from a more westerly location or if they had taken off from the ground and were gaining altitude. we watched them swap position as if they were playing (dancing) with each other as they traveled out of atmosphere. clear ionization effects of craft started to dissipate when they seemed to leave the earths atmosphere into open space. we jumped into the car and traveled north out of the city to see if we could possibly track the crafts or gain sight of them outside of city lights. on our way out we noticed a couple of other vehicles with occupants looking in the same general direction we last spotted them. we know that we weren't the only ones that possibly noticed the two of them in the sky. we drove north for 15 minutes or so and tried to see any remnants. no luck. we both believe that what we saw were alien or unknown flying objects. did not feel any fear, mostly curiosity as we had not seen objects like these before."],"Object Shape":"Circle, Sphere"}