{"Tags":"City","Object Shape":"Sphere","Case Number":"48177","trends":["There have been 15 other sightings in Kitchener","There were no other sightings in Kitchener on or around June 15th 2013"],"Source":"MUFON","Weather Factors":"Unknown","Longitude":"-80.433103","Sighting Duration":"Undisclosed","Region":"Ontario","Log Number":"CA-06162013-0020","Object Flight Path":"Path with directional change,Path then hovering","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","City":"Kitchener","divs":["Sighting DetailsAt approximately 9:15 PM on Saturday, June 15, 2013, my fiance and I were in an apartment on Heritage Street in Kitchener, Ontario when I looked out my southeast-facing balcony to see two bright, red-orange balls of light - one slightly in front of the other - moving from the treeline at the horizon to 15-20 degrees from us. The first thing I noticed was their speed and silence. Then, they rotated slightly counter-clockwise and wavered towards each other, so close that their lights almost appeared to touch. They seperated again slightly, and hovered in place. By this time my partner and I were both on the balcony, watching, and then we saw 2 more of the same lights coming from south (rather than southeast), heading towards the first two. It was at this time the first two objects dimmed their lights (or perhaps, rotated the beam away from us) and we clearly saw them as being pitch black, perfectly spherical orbs. We did not see any details like wings, propellers, a tail, etc. They did not leave any trail of light nor did they have a corona. They moved more quickly than airplanes, and occasionally seemed to 'zig-zag' very quickly instead of flying in a perfectly straight line. Their movement was especially fast when the first two orbs adjusted their position before hovering. In formation, the orbs abruptly stopped hovering in place and ascended straight up, to be quickly lost in the cloud cover. I would guess the orbs to be about the size of a helicopter, but it is hard to judge. We called the Waterloo Regional Airport (close by, southeast of us as well) and asked them if they knew anything about the aircraft, and after holding for a short time, the answer we got was a big no."],"Object Features":"None","Latitude":"43.45519","Disposition":"Unresolved","Date of the Event":"06/15/2013 09:15 UTC","Country":"Canada","Date Submitted":"06/16/2013 11:35 UTC","files":["/var/www/straped/mufon/html2text/48177.html.txt","/var/www/straped/mufon/org/48177.html"],"Summary":"Four black orbs with orange-red lights moved, in pairs, from horizon to join in formation; hovered; turned off/dimmed lights, flew straight up as unit into clouds.","map":"<A HREF = \"http://maps.google.com/maps?q=43.45519,+-80.433103(48177)&iwloc=A&hl=en\"> mufon case (48177) map </A>"}