{"Object Features":"None","Log Number":"US-06162013-0022","Case Number":"48179","City":"Collegeville","Date Submitted":"06/16/2013 11:49 UTC","Object Flight Path":"Stationary","Country":"United States","Date of the Event":"06/15/2013 09:00 UTC","Sighting Duration":"Undisclosed","Object Shape":"Circle, Triangle","divs":["sighting detailswe were on our way back home from a cousins graduation party in collegeville. we were on our way to the pa turnpike. it was aproximantly 9pm. we were on pa 422 heading towards king of pursia when myself and my passengers saw these lights. between mm 179 and 189. four at first, then we say that one was a helicopter. the helicopter was flying by it. the three lights were circular and were in the shape of an obtuse isosceles triangle. they were white\\yellow. they were not blinking like the nav lights on the helicopter. it seemed as if they were attached to some sort of an aircraft. but after seeing them for a few minuetes(aprox. 4min) the lights just disapeared. the were there one minuete and gone the next. i dont think this has anything to do with this but we did see 2 military convoys on our 300 mile trip. both were in that area (within 75 miles). i think that they were well over 3000 feet in the air. at that height the aircraft seemed to be extremly large. from one corner light to the other light it seemed to be aproximatly 1 1\\2 to 2 feet viewed from our car. where as a 737 is only like 9 inches. it was probably a foot wide. it was a very large objeect. 1. on pa 422 heading towards the pa turnpike 2. i saw them and just thought what the hell is that 3. at first i thought it was stars, but after a second i realized that that would've been impossible because they were low 4. the round lights, white\\yellow in color. stationary for upwards of 5 minuetes or so, then disapeared all at once 5. it freaked me out seeing it. i knew it wasn't an aircraft that i have seen (im a airort buff, and soon to be an aviation electronics technican and it didn't look like anything i have ever seen) 6. it disapeared"],"Disposition":"Unresolved","Longitude":"-75.460835","map":"<A HREF = \"http://maps.google.com/maps?q=40.14895,+-75.460835(48179)&iwloc=A&hl=en\"> mufon case (48179) map </A>","Tags":"City","Summary":"THREE LIGHTS HOVERING OVER PA422 BETWEEN MM 180 AND 188 GOING TOWARDS KING OF PURSIA","Viewing Distance":"501 Feet - 1 Mile","Region":"Pennsylvania","Latitude":"40.14895","trends":["There have been 4 other sightings in Collegeville","There were no other sightings in Collegeville on or around June 15th 2013"],"files":["/var/www/straped/mufon/html2text/48179.html.txt","/var/www/straped/mufon/org/48179.html"],"Weather Factors":"Unknown","Source":"MUFON"}