{"trends":["There have been 2 other sightings in Reedsburg","There were no other sightings in Reedsburg on or around June 11th 2009"],"Object Flight Path":"Stationary,Path with directional change,Other","map":"<A HREF = \"http://maps.google.com/maps?q=43.532481,+-90.002626(48176)&iwloc=A&hl=en\"> mufon case (48176) map </A>","Tags":"City","City":"Reedsburg","files":["/var/www/straped/mufon/html2text/48176.html.txt","/var/www/straped/mufon/org/48176.html"],"Object Features":"Unknown","Weather Factors":"Unknown","Log Number":"US-06162013-0019","Latitude":"43.532481","Viewing Distance":"Unknown","Date of the Event":"06/11/2009 09:10 UTC","divs":["Sighting DetailsI was working in Reedsburg at the time. A friend of mine from work and myself where on the back roads on the ridges between Reedsburg and LoganVille. He was driving and I noticed three green fluttering lights in the sky. We both observed them as we drove and at first thought that they were aircraft. They moved in relation to each other as if they were in perfect flying pattern or they were lights fixed to the same object. After observing them move it became apparent that it was something different. They would move slowly together but at what seemed to be random moments they would dart across a third of the nights sky in a blink of an eye and leave a green trail when it did the trail would slowly fade from the intensity of the lights themselves to nothing. The lights would rotate standing still but not leave a trail nor would it leave a trail when moving slowly through the sky. We drove for a half hour and we would lose sight of them and regain sight in a part of the sky we weren't expecting them to be in. Finally as we were headed back to work they took off in a moment of a fraction of a second and all we could see was a fading green trail going out of our line of view of the sky. We weren't scared or anything like that. It seemed to be a long way away high in the sky we couldn't make out a vessel or anything it was just lights. I was excited to experience something not easily explained."],"Object Shape":"Unknown","Country":"United States","Region":"Wisconsin","Date Submitted":"06/16/2013 11:34 UTC","Summary":"Green lights fluttering a ways off in the distance left trails when they moved. Moved in pattern realtive to eachother","Case Number":"48176","Disposition":"Unresolved","Source":"MUFON","Sighting Duration":"Undisclosed","Longitude":"-90.002626"}