{"Tags":"City","Longitude":"-82.91087","Latitude":"38.311302","City":"Grayson","trends":["There have been 3 other sightings in Grayson","There were no other sightings in Grayson on or around June 15th 2013"],"Summary":"Five bright orange orbs of light noted by 3 adults, Three disappeared and one change color and direction at incredible speed and disappeared.","Case Number":"48170","Viewing Distance":"Unknown","Country":"United States","Object Shape":"Circle, Fireball, Sphere","files":["/var/www/straped/mufon/html2text/48170.html.txt","/var/www/straped/mufon/org/48170.html"],"Log Number":"US-06162013-0013","map":"<A HREF = \"http://maps.google.com/maps?q=38.311302,+-82.91087(48170)&iwloc=A&hl=en\"> mufon case (48170) map </A>","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Source":"MUFON","divs":["Sighting DetailsAbout 9:50PM Sat. evening, I stepped outside my house to find my step ladder on the north side of my garage. My son (22) and daughter (26) were in the pool on the south side of the house. I notice three bright orange lights in just west of me as I faced the moon. They slowly moved South to North in a near line. My kids saw five, my view was partially blockedy by trees. The last three just disappeared acording to the kids. I saw the second one change immediate direction and go up at incredible speed, looking more like a dull white star as it became smaller and disappeared. I came around the house and the kids were ecstatic to inform me of what they saw and I comfirmed it! Has anyone else reported these bright orange balls of light? The balls of light did not make noise, nor did they have aircraft navigation lights, red, green, or white. My daughter is a dentist and my son is a computer programmer. Poor quality cellphone photo. Thanks, Dr. Roger Fannin"],"Date Submitted":"06/16/2013 05:26 UTC","Date of the Event":"06/15/2013 09:50 UTC","Region":"Kentucky","Object Features":"None","Object Flight Path":"Path with directional change","Weather Factors":"Unknown"}