{"Source":"MUFON","Case Number":"48175","Weather Factors":"Unknown","Latitude":"38.623091","map":"<A HREF = \"http://maps.google.com/maps?q=38.623091,+-75.127637(48175)&iwloc=A&hl=en\"> mufon case (48175) map </A>","Country":"United States","files":["/var/www/straped/mufon/html2text/48175.html.txt","/var/www/straped/mufon/org/48175.html"],"Region":"Delaware","Date Submitted":"06/16/2013 11:33 UTC","Longitude":"-75.127637","Object Flight Path":"Stationary","Viewing Distance":"101-500 Feet","Tags":"City","Log Number":"US-06162013-0018","Sighting Duration":"Undisclosed","Object Shape":"Other","Summary":"Spotlight-like beam shining down to swamp area across from home","Disposition":"Unresolved","City":"Millsboro","divs":["Sighting DetailsI believe it was May of 2008. At that time I lived in the Longneck area of Millsboro, Delaware within view of the Indian River. Directly across the street was a large swampy wildlife preserve with the river directly beyond. The swampy area contained water deep enough for a kayak, and during a heavy rain even developed white caps. Really a lovely view from our third story deck. I often liked to go out on the deck to watch the stars. After living close to Philadelphia for so many years, complete darkness to observe the stars was a joy. This particular night I was looking at the stars when suddenly, and I do mean suddenly, a beam of light came out of the night sky and shone on the swamp directly in front of me. One second no light, the next a bright white light. Our complex was primarily owned by summer folk and they hadn't arrived yet, usually after Memorial Day they would descend like locusts. Therefore, there were no other townhouses occupied at that time on our street. We were one of the few year-round residents, hence total darkness. There was absolutely no sound and no sight of where the light was coming from. The light covered an area of approximately thirty feet in circumference, coming from an elevation of approximately 200 feet, and was perhaps 100 feet or more in front of me. I think I was in disbelief for quite a while, then in awe, then wanting to call my husband two stories below to come look, but afraid if I turned away it would be gone. So I stood tranfixed for about 20 minutes and the light never faultered it's position. Then it was gone, like someone had turned off a switch. Still no sound. My immediate thought was I had a UFO experience, and I still believe that. I don't tell too many people about it though. Don't really want to get measured for a white jacket. I told my husband the next day and while he listened politely I could tell he thought I'd lost it. However, that night it was back and I did call him to look. He was dumfounded. It only lasted perhaps ten minutes that night and I never saw it again. I have no evidence, only my experience which I will never forget. I was watching a program tonight about a woman who lived near Willow Grove, Pennsylvania in 2008, her sighting, and the ensuing MUFON investigation. It was the beam of light she described that caught my attention and compelled me to send MUFON the account of my experience."],"trends":["There has been one other sighting in Millsboro","There were no other sightings in Millsboro on or around May 28th 2008"],"Object Features":"Unknown","Date of the Event":"05/28/2008 12:00 UTC"}