{"Country":"United States","Summary":"When I first seen this object it looked like a helechopter dropping a parachute.","Region":"West Virginia","Log Number":"US-05202006-0007","Weather Factors":"Unknown","Date of the Event":"12/24/1996 04:30 UTC","files":["/var/www/straped/mufon/html2text/4818.html.txt","/var/www/straped/mufon/org/4818.html"],"Object Shape":"Egg, Oval, Teardrop, Other, Unknown","Source":"MUFON","trends":["There have been 13 other sightings in Charleston","There was one other sighting in Charleston on or around December 24th 1996"],"Tags":"City","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","City":"Charleston","Disposition":"Insufficient Data","Latitude":"38.35679","divs":["Sighting DetailsI was driving on interstate 64 headed east. It was about 4:30 am with no traffic, when I looked up I saw what looked like a helechopter dropping a parachute, and as I came closer to the site I noticed it was very low to the ground. I slowly reduced my speed,and pulled over to the side of the road, and stopped about 200 hundred feet from this object.I then rolled my window down to see what it was, and as I looked around the area I noticed a source of water maybe a creek behind a row of trees. When I got streight across from this object that made no sound at all it started moving very slowly behind the trees as I followed it. It came to a stop after 50 feet or so.My wife sitting next to me also was amazed, as we were parked on the side of the road just staring at it we could see a very large window shaped area with two or maybe three small round lights.One light was red, and the other one was green. After sitting there for two or three minutes staring at it my wife said lets get the hell out of here, so we left. I can't understand what at first looked like a helechopter from a distance with no sound what so ever could change it's shape like that. This object was only 15 to 20 feet from the ground. I also remember seeing some type of factory or plant not far behind this area."],"Object Features":"Undisclosed","Date Submitted":"12/24/1996 04:30 UTC","Longitude":"-81.630453","Case Number":"4818","map":"<A HREF = \"http://maps.google.com/maps?q=38.35679,+-81.630453(4818)&iwloc=A&hl=en\"> mufon case (4818) map </A>","Sighting Duration":"00:05:00"}