{"Object Shape":"Fireball, Flash","Weather Factors":"Unknown","Case Number":"48180","Disposition":"Unresolved","Object Flight Path":"Hovering then path","Summary":"multiple lights in woods rose up through trees then flashed images into mind lights","Tags":"City","Country":"United States","Region":"New Jersey","City":"Howell","Source":"MUFON","files":["/var/www/straped/mufon/html2text/48180.html.txt","/var/www/straped/mufon/org/48180.html"],"trends":["There has been one other sighting in Howell","There were no other sightings in Howell on or around April 5th 1994"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.164578,+-74.208267(48180)&iwloc=A&hl=en\"> mufon case (48180) map </A>","divs":["Sighting Detailsas I remember I was 20 or21 yrs old maybe 1994 95 the reason im trying to cantact mufon is because I have finally heard accounts similar to what I saw . there is a decent amount of woods behind my parents house one night I went out into backyard I noticed many little lights clustered out in the woods like little search lights like they were looking for something. I was trying to figure out what was the lights were just above ground level. suddenly I felt a terrifying feeling that whatever these things were it became aware I was watching it and the lights suddenly rose traveling out and up of the trees.i turned and began to run when something zapped me I was paralyzed and what seemed like something was just over my head I had to look at it it flashed many different symbols into my eyes.the beam for lack of a better word let me go I turned and ran as I was running toward front of house I remember stepping or knocking over a bucket of water in back yard, the next morning when I woke up my one sock was wet I went out in the yard and found bucket on side I felt crazy I thought I had a dream but my sock was wet and it was right where I remember (the bucket) I don't remember exact symbols flashed at me."],"Log Number":"US-06162013-0023","Viewing Distance":"21-100 Feet","Object Features":"Other","Latitude":"40.164578","Date Submitted":"06/16/2013 11:49 UTC","Sighting Duration":"Undisclosed","Longitude":"-74.208267","Date of the Event":"04/05/1994 12:00 UTC"}