{"Weather Factors":"Unknown","Latitude":"42.506434","Date of the Event":"06/16/2013 10:30 UTC","trends":["There have been 12 other sightings in Sioux City","There were no other sightings in Sioux City on or around June 16th 2013"],"Region":"Iowa","Source":"MUFON","files":["/var/www/straped/mufon/html2text/48188.html.txt","/var/www/straped/mufon/org/48188.html"],"Summary":"A triangular UFO was found hovering in the sky and remained there for several minutes until flying out of sight.","Date Submitted":"06/17/2013 03:53 UTC","Object Features":"Unknown","Case Number":"48188","Log Number":"US-06172013-0007","Country":"United States","divs":["Sighting DetailsI went outside the house at around 10:30 PM to find a bright object hovering in the sky. It was stationary, but flickered and looked like it was changing colors. It was very strange-looking, but I thought it might be a star. After watching it for several minutes and calling out a second person to view it, I got a pair of binoculars (7x50) from inside the house to get a better look at it. With the binoculars, I was able to see the object in much greater detail. From what I could tell, it was triangular in shape, with at least three lights (one on each side, one in the middle). The colors of these lights slowly alternated between red and white, one after the other, when seen through binoculars, but the object looked mostly white (pulsating) without binoculars. At around the same time I started watching with binoculars, the object began to move across the sky in a straight path towards us (the two witnesses). At one point during this flight, an actual plane flew under it (I think there was a lot of distance between the two). The plane and unidentified object were very different from each other. The plane, although closer to the ground, was much smaller (in apparent size). The plane went out of view much faster and the blinking lights on the plane were much clearer. The unidentified object took 2-5 minutes to fly across the sky over the house and go out of view. From what I could tell, there was no noise coming from the object. The entire sighting lasted approximately 10 to 15 minutes. Planes do not hover in place for minutes at a time and stars do not fly and have blinking lights. The object was bright enough to be visible in pictures, but the detail cannot be seen, so it just looks like an an extremely bright star. Video was taken but the quality is too poor to make out the object as it moved."],"Disposition":"Unresolved","Viewing Distance":"Unknown","Longitude":"-96.397297","Object Flight Path":"Hovering then path,Straight-line path","City":"Sioux City","map":"<A HREF = \"http://maps.google.com/maps?q=42.506434,+-96.397297(48188)&iwloc=A&hl=en\"> mufon case (48188) map </A>","Tags":"City","Sighting Duration":"Undisclosed","Object Shape":"Triangle"}