{"Object Shape":"Flash, Unknown","City":"Miamisburg","map":"<A HREF = \"http://maps.google.com/maps?q=39.645236,+-84.281568(48183)&iwloc=A&hl=en\"> mufon case (48183) map </A>","Sighting Duration":"Undisclosed","Longitude":"-84.281568","Object Flight Path":"Stationary","Tags":"City","Country":"United States","Date Submitted":"06/17/2013 01:47 UTC","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/48183.html.txt","/var/www/straped/mufon/org/48183.html"],"divs":["Sighting DetailsOne afternoon in late August of 2004, i was with a friend in Miamisburg, Ohio. I was sitting in a parking lot waiting for her to come out of a vets office, when i noticed a faint flash above the tree tops. I watched for a few seconds, thinking it was just a signal tower due to the color, I went back to listening to the radio. A few moments later i was looking into the trees when i saw the flash again, i looked up and realized the flash was a little to the left of where i saw the first. I starred up over the trees and noticed yet another flash to the right and down. That's when I realized there where no tower connecting the lights vertically. While waiting I witnessed flashing coming from six different positions, roughly 15-20 seconds apart, this continued for a good 10-15 minutes. It eventually just stopped and I continued watching until she came out and waited a few moments after just to show her, but no lights. I've tried contacting her a couple of times to get the exact location of the office, and the date, but she stopped talking to me shortly after the event."],"Case Number":"48183","trends":["There have been 7 other sightings in Miamisburg","There were no other sightings in Miamisburg on or around August 28th 2004"],"Summary":"pulsing lights over miamisburg ohio","Date of the Event":"08/28/2004 03:00 UTC","Object Features":"None","Source":"MUFON","Weather Factors":"Unknown","Region":"Ohio","Log Number":"US-06172013-0002","Disposition":"Unresolved","Latitude":"39.645236"}