{"divs":["Sighting DetailsI was getting ready for bed at approximately midnight, as I was walking to my sliding glass door to lock it I noticed a light reflecting on top of the trees and trailers next door moving quickly,( I live in a stilted house with a raised deck that overlooks my neighbors), I said to myself out loud \"what the hell is that\". I thought at first a large bird had flown so close to the glass that it distorted the light but immediately realized that this was impossible.I opened my door and stepped out onto my deck just in time to see this gigantic flying chevron or wing heading north and ascending at the same time. The only reason I could tell it was a flying object was because the lights were uniform in size a distance between them, and in between the lights the actual stars were blocked out. I felt it was cloaked to blend into the night sky because the lights looked like the surrounding stars. There was no sound and I watched as the object simply disappeared into the night sky. It looked as if it went through a wormhole or a tear in the fabric of space. I can't quantify the size exactly but it was larger that 10 747s side by side and relative to the size actually seemed to move slow as I watched it fly away. I was so mesmerized that I am not sure exactly how long I watched it but it could not have been more than 10 or 15 seconds. I have longed believed that we are not alone in the universe and have always wished to see something but felt the odds were astronomical, but my excitement at seeing this was so amazing I couldn't wait to tell my husband and son. I am truly a believer now. I wished I had just stepped out a few seconds or a minute sooner so I could have watched longer or been able to film this phenomenon."],"Summary":"Extremely large chevron with lights that looked like stars as if it was cloaked to blend into the sky. The only way to tell it was a solid object was that the lights stay uniform and moved with great speed while blocking out the stars in between the light","Sighting Duration":"Undisclosed","Object Features":"Unknown","Region":"Florida","Longitude":"-81.329069","Date of the Event":"04/26/2012 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile, Unknown","trends":["There have been no other sightings in Big Pine Key","This sighting has never been favorited."],"Tags":"City","Disposition":"Unresolved","Object Shape":"Chevron","Weather Factors":"Unknown","Source":"MUFON","Country":"United States","Latitude":"24.68802","Date Submitted":"06/17/2013 11:55 UTC","City":"Big Pine Key","files":["/var/www/straped/mufon/html2text/48196.html.txt","/var/www/straped/mufon/org/48196.html"],"Case Number":"48196","Object Flight Path":"Straight-line path","Log Number":"US-06172013-0014","map":"<A HREF = \"http://maps.google.com/maps?q=24.68802,+-81.329069(48196)&iwloc=A&hl=en\"> mufon case (48196) map </A>"}