{"Object Flight Path":"Path with directional change","Object Features":"None","Region":"Michigan","map":"<A HREF = \"http://maps.google.com/maps?q=42.657433,+-82.935968(48194)&iwloc=A&hl=en\"> mufon case (48194) map </A>","divs":["sighting detailsas many as 20 irregular shaped spherical object were seen moving from tree top height in an ascending path from n.w of my location to n.e. in the general direction of selfridge field. the object appeared yellow\\orange and were in pairs as they moved accross my sightline. as they moved east one object would appear to accelerate and ascend ahead of the other. occassionally one of the pairs would descend and appear to hover in the east approximately in the area of selfridge field. i also observed 2-3 objects leave the pairing and head in a directly north direction while the other one in that pairing continued to move east. my wife also observed these object. i first though they may be candle bags floating, however the speed change and directional changes did not seem to make that feasible from pairs of abjects that appeared to be moving in unison and then suddenly one would appear to accelerate or change direction. also, 1 or 2 of the object decended and slowed to near hovering while the other object in the pair acsended and accelerated. i tried to photo. with my cellphone but could not pick them up: perhaps too far for the technology of a not smart phone. perhaps a kids prank but the movement just seemed a little too strange to me."],"Tags":"City","Latitude":"42.657433","Summary":"Multiple spherical object in groups of 2-3 moving n.w to n.e. or directly n. slight wavering motion of sphere's that were yellow/orange. speed increased as objects moved awaay in ascending path 2-3 objects moved in to a lower trajectory.","Country":"United States","files":["/var/www/straped/mufon/html2text/48194.html.txt","/var/www/straped/mufon/org/48194.html"],"Date of the Event":"06/16/2013 10:30 UTC","Log Number":"US-06172013-0013","Viewing Distance":"Unknown","Object Shape":"Sphere","Longitude":"-82.935968","Source":"MUFON","Sighting Duration":"Undisclosed","Date Submitted":"06/17/2013 11:13 UTC","trends":["There have been 2 other sightings in Macomb Township","There was one other sighting in Macomb Township on or around June 16th 2013"],"Weather Factors":"Unknown","City":"Macomb Township","Case Number":"48194","Disposition":"Unresolved"}