{"Object Shape":"Circle, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=35.297497,+-78.009452(48190)&iwloc=A&hl=en\"> mufon case (48190) map </A>","Case Number":"48190","Latitude":"35.297497","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/48190.html.txt","/var/www/straped/mufon/org/48190.html"],"Object Flight Path":"Path then hovering","Tags":"City","City":"Dudley","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"21-100 Feet","Summary":"orbs followed me to my house hoverd , I drove away was followed ,came back home was followed ,they hovered at tree top ,looked thru rifle scope a calming feeling washed over me,","divs":["Sighting DetailsI was coming home from work it was about 1am,I turned into my driveway,a long dirt road,my house was a half mile off main road,driving down my road,I noticed a light in my rearview,in the new sub that was being built,I thought it was newly installed street lights,then the light started rising up too high to be a street light. I stopped my van got out,watched as several other lights begin to rise up from the ground level.they started moving in my direction at 40-50 feet high,they came within 200 ft.from me,I got back in my van and raced down my dirt road to my house.when I got out of the van I seen them coming.I watched them until they stopped overhead and hovered at tree top level.unnerved, I got back in my van and drove like hell away from there back down my dirt road to the main road.In a paniced state I drove to my friends house about 3 miles away,but he wasn;t home,Driving back to my house there was a orange dodge ramcharger driving like a bat out of hell,coming from the direction of my house.As I rounded the curve I seen the lights over the main road,genoa rd.The guy in the ramcharger must have seen them too..Driving about 80 mph I drove under the lights and back to my house.As I drove under the lights they started following me.When I got back to my house I could see them coming, when they came over my property I went in the house and got my guns and came back out.they were hovering over me no more than 50 ft.I could have thrown a rock and hit them.there were 7 white orbs about10-12 ft. wide.I raised my .22 rifle with a scope and was going to shoot,when I looked thru the scope to shoot,I could see right thru them, and see the stars behind them. as I was ready to pull the trigger, a very strong calming feeling washed over me..and I felt at peace like nothing I've ever felt.I propped my gun against light pole I was standing by, and just watched them for what felt like 10 min. they started leaving, heading in a line towards the full moon.I watched until they were out of sight. when I went back inside my house I looked at the clock and it was 4:30 am.. I know what I seen could not have taking more than 45 min to an hour.like Chris Bledsoe I can't explain the missing time.."],"Longitude":"-78.009452","Object Features":"None","Log Number":"US-06172013-0009","Date Submitted":"06/17/2013 09:36 UTC","trends":["There have been no other sightings in Dudley","This sighting has never been favorited."],"Country":"United States","Region":"North Carolina","Date of the Event":"06/15/1980 12:00 UTC","Source":"MUFON"}