{"Latitude":"47.49697","Summary":"White Light Center with a bright Redish glow around it was approx 1000 High Travelling at a good rate of speed. IF you want the Canon Raw images Contact me.","Tags":"City","Longitude":"-52.95572","Date of the Event":"06/15/2013 10:26 UTC","Object Shape":"Other","Object Features":"None","Disposition":"Unresolved","Case Number":"48193","Date Submitted":"06/17/2013 11:08 UTC","Country":"Canada","Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile","Region":"Newfoundland and Lab","files":["/var/www/straped/mufon/html2text/48193.html.txt","/var/www/straped/mufon/org/48193.html"],"Weather Factors":"Unknown","divs":["Sighting DetailsI had just left my telescope in my observatory and started to go inside.I stopped and scanned the sky as I usually do.I noticed a bright light coming towards me from the west south west just above the tree line. [ let me explain the area around my house. Behind my house the is a tree line, the highest part of the tree line is 40 to 50 ft.high and this high point is approx. 250 ft away from my house. this is the direction which the object came. In the front of my house approx 1 mile away there is a high hill, cliff,or small mountain approx. 420 ft. high and this is the direction which it went.] The ufo flew to the east north east. When I first noticed it I saw a bright light with a red glow around it. I first thought it was a Plane, approx 5 seconds later it was a lot closer and brighter .At that point I new it was not a plane. My Camera was about 14 ft. away on my dining room table, I keep my camera in a plastic bag, because of dust and dew. I had a bit of a problem getting the camera out of the bag,because of the excitement and the speed of the approaching ufo. By the time I got back outside again the ufo was almost overhead.IT had gotten very bright and the red glow had gotten very large.[Above I was asked if there was a shaddow, I guess there must have been a shadow becausr it travelled over me, but it all happened so fast and I was trying to get a few pictures I did not notice.] I then had to remove the dust cap, turn off auto focus, set the lens to infinity. By the time I got the object in the viewfinder, the ufo was going away from me, over the roof of my house. I had shot 2 pictures by this time. the ufo was getting progressively smaller the further it got away from me. I ran into the patio door through the house, out through the front door onto the front deck.It was after getting very small. There was a tree obstructing my view, I moved to my left to get a better view, but the object disappeared,behind the mountain in front of the house a few seconds later. I did not have time to get another shot.It only took 30 seconds give or take a few seconds from when I first saw the ufo and when it disappeared. the UFO was aprox. 1000 ft. high. Almost all the sky was covered with light cloud, but I could see the moon clearly through it. there were patches of heavier cloud.The Exposure were taken as CANON RAWS."],"map":"<A HREF = \"http://maps.google.com/maps?q=47.49697,+-52.95572(48193)&iwloc=A&hl=en\"> mufon case (48193) map </A>","Sighting Duration":"00:00:30","trends":["There have been no other sightings in Conception Bay South","This sighting has been favorited 1 time."],"Source":"MUFON","Log Number":"CA-06172013-0012","City":"Conception Bay South"}