{"map":"<A HREF = \"http://maps.google.com/maps?q=37.05689,+-120.849159(48204)&iwloc=A&hl=en\"> mufon case (48204) map </A>","Region":"California","Date Submitted":"06/17/2013 06:30 UTC","City":"Los Banos","Tags":"City","Sighting Duration":"Undisclosed","Case Number":"48204","Weather Factors":"Unknown","Disposition":"Unresolved","divs":["sighting detailsmy wife & two sons were returning from a funeral service from san jose. we were traveling on hwy 152 approximately 20 minutes ease of los banos at which time my wife first noticed a object with a blue light appear perpendicular to the highway and approximately a 1\\3 mile in front of our car. seconds later i caught a glimpse of the object and asked my wife :what is that? it's moving so fast and it's so low to the ground. we watched it for about twenty seconds as it went directly in front of us and then continued in a straight path and then it suddenly appeared to reverse direction and then these three bright lights appear (at this time it appeared the object was 1\\8 mile out to the right of us)horizontally and the object proceeded to descend\\hover about a 30 degree angle. the object landed and i wanted to stop and investigate however my wife said that we need to keep driving. i did not want to argue with her. if i was alone i surely would have stopped the car and walked however how long to see what was there. anyway that's what actually happened."],"Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"06/13/2013 12:00 UTC","Source":"MUFON","Object Shape":"Unknown","Summary":"Traveling extremely fast","Latitude":"37.05689","Log Number":"US-06172013-0023","Object Features":"Unknown","Country":"United States","trends":["There have been 6 other sightings in Los Banos","There were no other sightings in Los Banos on or around June 13th 2013"],"Object Flight Path":"Straight-line path,Path with directional change","files":["/var/www/straped/mufon/html2text/48204.html.txt","/var/www/straped/mufon/org/48204.html"],"Longitude":"-120.849159"}