{"Region":"New Jersey","Longitude":"-74.37302","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.860777,+-74.37302(48207)&iwloc=A&hl=en\"> mufon case (48207) map </A>","Date of the Event":"10/10/2012 05:15 UTC","Date Submitted":"06/17/2013 09:44 UTC","Object Shape":"Triangle","Latitude":"40.860777","Log Number":"US-06172013-0026","Case Number":"48207","Weather Factors":"Unknown","City":"Parsippany-Troy Hills","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Sighting Duration":"Undisclosed","divs":["sighting detailsi was searching for any simular reports of an object that i saw on 10-10-2012. i came across an exact sighting of what i saw and i have the video of it. below is the case\\log number of the sighting that matches what i observed. case number: 42814 log number: us-09252012-0009 as discribed by the observer in the case and log number above i also had the same plane which at times i wasn't sure who was following who. after i stopped taking video so i could try and follow the object the plane turned sharply toward the silver object. the object began to increase in speed until i could no longer see it. the object i saw was in parsippany, nj. i pulled over and took video from my cellular phone in amazement. i observed the object when it was a little closer prior to taking the video. this object was thick and solid and not a piece of floating trash. also at the time the video was taken there was little or no wind."],"Country":"United States","Tags":"City","trends":["There have been 2 other sightings in Parsippany-Troy Hills","There were no other sightings in Parsippany-Troy Hills on or around October 10th 2012"],"Summary":"Left work and saw object during commute home. Pulled off highway to take video of event until object was to far.","files":["/var/www/straped/mufon/html2text/48207.html.txt","/var/www/straped/mufon/org/48207.html"],"Source":"MUFON","Disposition":"Unresolved","Viewing Distance":"101-500 Feet"}