{"trends":["There have been 35 other sightings in Milwaukee","There was one other sighting in Milwaukee on or around June 16th 2013"],"Disposition":"Unresolved","divs":["Sighting DetailsI was watching the basketball game in the kitchen when I got a call that I wanted to take privately, so I stepped out of the side door of the house. As I was in a heated debate on the phone, I looked up and noticed something in the distance above the treeline. I stared at it, and as I did so, short bursts of flame began to come from the bottom of the object. The flame would switch from left to right as the object wobbled a bit; as if it was trying to maintain balance. That's when I yelled to my girlfriend to \"go get my camera\". She did, but it took at LEAST 40 seconds for her to do so. As I continued to stare at the object, waiting for my camera, I noticed that the flame at the bottom of the object began to lose it's intensity. As the flame went from a full flame to just a red glow, I noticed that the object was slowly losing altitude, and drifting slowly south east, toward Lake Michigan. As it dropped below the treeline, I began to run out of the yard and down the street so I can see around that particular treeline. I could, and again, I could see the object. The red glow at the bottom of the object was barely noticeable at this point, and the object began to descend more straight down than southeast and down as it was before. It began to lose altitude faster, until it went below the treeline at that location, which was approximately half a city block to the south of where I was when I first began to record. I waited at this location for about 30 minutes for the object to ascend or reapear, but it never did. While I was recording, I was not looking at the viewfinder; I was just pointing the lens in the direction of the object, so I had no idea if I actually had what I was seeing on the camcorder. But after a discussion with neighbors and others who were present, I went inside, connected the camcorder to the television, and began to view the footage. I've been from that point on, compelled to find out what I saw is. I contacted the local police, military, FAA, News Stations, etc., trying to find out if they had anything on the radar at that time and area of that day, but.....nothing; even though I expressed to them all that I had this thing on video!! This incident has not only caused me a great deal of concern, it has changed my life, and challenges many things I believe. I have always been open to the possibility of the existence of such things, but never saw anything that came anywhere near actually convincing me that they are real. All that has changed now though. That thing had no sound whatsoever, it had no wings, and it had no tail end. It looked almost like a giant church bell with a flame at the bottom. Had I not recorded what I was seeing, I would have long since just assumed it was something normal, that can be explained. But after viewing this thing in slow motion on zoom, I am convinced that it is not, and can not. I will be attaching a copy of my video with this report (If it will upload). My animus is to have an expert opinion of what it is that is on my video. it was certainly intelligently operated, and it was definitely a mechanical craft of some sort, and not a balloon or anything like that. I for some reason had a feeling of desperation as this thing was descending. It is the same desperate feeling I felt that made me look in that direction and up in the first place when I first noticed the object. I'm left feeling as though whatever it was, it was losing power, running out of fuel, or something to that effect, because it seemed to be struggling to maintain it's altitude. It was a struggle that It evidently lost. The object was moving slowly in the direction of the Lake; which leads me to believe that it was attempting to get out over open water. In fact, it seemed to be trying very diligently to do so. I have no idea if it landed in the water or over land. All I know is it landed or crashed somewhere slightly south east of where I was, and never came back up. After you review my video, please get back to me and let me know what you think. Thank you; verily."],"Weather Factors":"Unknown","Longitude":"-87.940835","Log Number":"US-06182013-0002","Summary":"Object was hovering with short bursts of flame coming from bottom. it was moving slowly to the south while descending.","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Object Shape":"Circle, Disc, Oval, Teardrop","Object Features":"Dome, Other","map":"<A HREF = \"http://maps.google.com/maps?q=43.119432,+-87.940835(48211)&iwloc=A&hl=en\"> mufon case (48211) map </A>","Date of the Event":"06/16/2013 08:41 UTC","Case Number":"48211","Date Submitted":"06/18/2013 12:47 UTC","City":"Milwaukee","Region":"Wisconsin","Object Flight Path":"Stationary,Hovering then path","files":["/var/www/straped/mufon/html2text/48211.html.txt","/var/www/straped/mufon/org/48211.html"],"Sighting Duration":"Undisclosed","Country":"United States","Tags":"City","Latitude":"43.119432"}