{"Weather Factors":"Unknown","trends":["There have been 10 other sightings in West Chester","There were no other sightings in West Chester on or around July 4th 2012"],"divs":["Sighting DetailsWest Chester, PA. July 4th, 2013, Approximately 10pm. I was out in my backyard with my 21 year old son. We were just hanging out enjoying the evening when I saw an odd flicker in the western sky. I got up from the table and watched it get closer. Because of the date and the flickering, I thought it was a rogue firework. As it got closer it appeared to be a delta shaped object in the sky (shape determined by light placement). I said, \"What the hell is that?\" My son got up and we both saw the object silently move directly above where we were. It was hard to tell how high it was. There were red lights on each corner, and, incredibly, the starboard, aft corner was completely engulfed in flames (so we didn't see a red light there). We watched it as it went from west to east, holding altitude, until it was out of sight behind trees and buildings(about 2 minutes). The fire we saw on the corner was not something small or in the form or shape of a fuel propellant; it was like watching a house on fire. I checked for reports initially of any aircraft experiencing such an event, but found nothing, and didn't really look into it any further. We never reported what we saw, until now. I just keep thinking how strange it was, and decided to finally share the event."],"Object Flight Path":"Straight-line path","Region":"Pennsylvania","Object Shape":"Triangle","Summary":"Triangle shape craft with red lights on each corner and on fire","Source":"MUFON","Log Number":"US-06182013-0016","map":"<A HREF = \"http://maps.google.com/maps?q=39.970094,+-75.599318(48227)&iwloc=A&hl=en\"> mufon case (48227) map </A>","Tags":"City","City":"West Chester","files":["/var/www/straped/mufon/html2text/48227.html.txt","/var/www/straped/mufon/org/48227.html"],"Date of the Event":"07/04/2012 12:00 UTC","Case Number":"48227","Date Submitted":"06/18/2013 07:09 UTC","Object Features":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Longitude":"-75.599318","Viewing Distance":"501 Feet - 1 Mile","Latitude":"39.970094"}