{"Summary":"Four UFO's in 12 minutes plus random sparking lights in Sky","Log Number":"US-06182013-0018","Object Features":"Unknown","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","trends":["There have been 110 other sightings in Seattle","There were no other sightings in Seattle on or around June 18th 2013"],"Date of the Event":"06/18/2013 03:15 UTC","Object Shape":"Flash, Sphere","Case Number":"48229","Longitude":"-122.326675","divs":["sighting detailsi was at home and went out to my front porch to smoke after a 1 1\\2 hr. nap. the sky was very clear as it had rained earlier and all the stars were out. i'm a stargazer and in seattle the opportunities to 'gaze' are fewer. i was orienting myself to the 3:00 am sky from how i saw it earlier. i was facing west over the top of my house. i saw several random spark-like flashes in the sky. i have previously seen high flying jets which had intermittent strobe flashes, but there were no jets in this case. i also saw what looked like the whole sky flashing as if there were lightning storms out of sight, but where i was, there were no clouds. i stared at what i thought was a planet about 10 degrees above my chimney, jupiter like in size..thinking what planet is that? after 3 or 4 seconds it suddenly took off heading south. i was astonished! as i followed it, it slowed way down, almost stopping, changed direction upward, then became dimmer star-like, and continued south. watching it change directions gave me a rush of goosebumps. i was able to follow it visually for close to 15 seconds, until i lost sight behind trees, while i was watching it, i became awared of a bright, (again what i thought was a planet, light through holes in the tree foilage in my left peripheral vision. after losing sight of the first object, i trained my attention to this object only to realize that it was also moving, and going toward the one i had just lost sight of. it was travelling east to west, and just like the first one, it was jupiter-like in size. i ran out into my yard to keep it in view. after 4 or 5 seconds, it went from bright to dim, and continued west, being in view for aprox 12 seconds. i went in to note the time and grab my binoculars. i stood out in the yard watching. the big dipper was low in the nw sky suddenly i saw a bright flash south of the big dipper and saw an obect travelling north toward the dipper. i saw another like object coming toward it at an angle very fast, then slowing and matching the first one's speed and direction. when the second one slowed down it emitted a brilliant red-orange flash. they travelled along and then through the stars making up the handle of the big dipper. i watched for some 25 seconds with binoculars until they both dimmed out of sight due to distance. i saw a number, maybe 4 o 5 random spark-like flashes in the sky, and called it quits when clouds began to move in. the sky was lightening towards the dawn."],"Tags":"City","Region":"Washington","Sighting Duration":"00:12:00","City":"Seattle","Latitude":"47.749228","Disposition":"Unresolved","Viewing Distance":"Unknown","Date Submitted":"06/18/2013 07:28 UTC","files":["/var/www/straped/mufon/html2text/48229.html.txt","/var/www/straped/mufon/org/48229.html"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=47.749228,+-122.326675(48229)&iwloc=A&hl=en\"> mufon case (48229) map </A>","Weather Factors":"Unknown","Country":"United States"}