{"Date of the Event":"01/07/1962 12:00 UTC","City":"Tulsa","Object Features":"Unknown","Region":"Oklahoma","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=36.1867,+-95.918099(48222)&iwloc=A&hl=en\"> mufon case (48222) map </A>","Weather Factors":"Unknown","Object Shape":"Disc","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/48222.html.txt","/var/www/straped/mufon/org/48222.html"],"Tags":"City","Case Number":"48222","Log Number":"US-06182013-0012","Country":"United States","Disposition":"Unresolved","Date Submitted":"06/18/2013 03:09 UTC","Latitude":"36.1867","trends":["There have been 59 other sightings in Tulsa","There were no other sightings in Tulsa on or around January 7th 1962"],"divs":["sighting detailsi was on a low hill at the intersection of pine and n. yale. i was delivering newspapers at around 4:00 am (+\\- 20 min) on january 7, 1962 (+\\- 7 days, best estimate). because of a previous sighting from this location appx. 3 weeks previous, i stopped again when i was at this location, to look around just in case i saw another. i was looking southward. i noticed what i at first took to be a meteor igniting in the atmosphere at high altitude, perhaps entering the atmosphere at 15,000 or so mph, or faster. it was glowing bright white when i first saw it, and it quickly began to glow much brighter as it descended from about 25-30 degrees above horizon to only three or four degrees above. it descended at an angle of about 75-80 degrees from east down to west. this was at an approximate distance of 8 miles to the south east: 8 south, 1 east. as the object descended it \"gradually\" (given the high speed) slowed until coming to a complete stop at an altitude of (at the estimated distance) of 5,000'. it remained therefor perhaps 10-15 seconds, gradually losing brightness until half apparent brightness. it then moved suddenly, going eastward at an apparent speed at that estimated distance of one mile in 2 to 2-1\\2 seconds, or perhaps 1500 mph. i lost sight of it as it simply dimmed out of view approximately five miles eastward of where it had stopped after descending."],"Longitude":"-95.918099","Source":"MUFON","Summary":"Very bright object descended at high speed, stopped in place, then move away.","Object Flight Path":"Path with directional change"}