{"map":"<A HREF = \"http://maps.google.com/maps?q=25.940934,+-97.461484(48233)&iwloc=A&hl=en\"> mufon case (48233) map </A>","Weather Factors":"Unknown","Date of the Event":"06/06/2013 06:00 UTC","Viewing Distance":"Unknown","Object Features":"None","files":["/var/www/straped/mufon/html2text/48233.html.txt","/var/www/straped/mufon/more/48233_submitter_file3__IMG8186.JPG","/var/www/straped/mufon/more/48233_submitter_file4__IMG8187.JPG","/var/www/straped/mufon/more/48233_submitter_file5__IMG8188.JPG","/var/www/straped/mufon/org/48233.html"],"Region":"Texas","City":"Brownsville","Summary":"star like object moving south by south east","Date Submitted":"06/18/2013 09:08 UTC","Disposition":"Unresolved","Object Shape":"Sphere","Latitude":"25.940934","Tags":"City","Source":"MUFON","Case Number":"48233","Object Flight Path":"Straight-line path","Longitude":"-97.461484","Country":"United States","Log Number":"US-06182013-0022","trends":["There have been 17 other sightings in Brownsville","There were no other sightings in Brownsville on or around June 6th 2013","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","divs":["Sighting Details1. Watching Television 2. My sister told me come out and look at object in the sky. 3. I thought it was a party balloon. 4. object appeared to be spherical. Object moved very slowly towards the SSE. 5. I looked at it a minute then grabbed camera. I later tried looking at it through telescope. 6. I lost sight of the object when it moved too far away. FYI We live in airport fly space. It is strange that no airplanes landed during or after, to the best of my recollection, after the event. The video was shot from a camera, image is not really good. There were other objects in the sky that seemed to appear from no where. at first i thought them to be birds in, what i would describe as a dog fight. But they disappeared. I did take video of one of the objects as it moved over my house but the camera was not good enough to capture. I will include it anyways. I did also capture video of the star like object."]}