{"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","files":["/var/www/straped/mufon/html2text/48237.html.txt","/var/www/straped/mufon/org/48237.html"],"Weather Factors":"Unknown","Date of the Event":"03/13/1997 12:00 UTC","Log Number":"US-06182013-0025","Disposition":"Unresolved","Date Submitted":"06/18/2013 10:17 UTC","Object Features":"Unknown","Viewing Distance":"21-100 Feet","Sighting Duration":"Undisclosed","Region":"Indiana","map":"<A HREF = \"http://maps.google.com/maps?q=39.471893,+-87.410409(48237)&iwloc=A&hl=en\"> mufon case (48237) map </A>","Object Shape":"Triangle","divs":["Sighting DetailsOn the night of March 13, 1997 at approx. 10 PM my wife and I stepped outside our home to show our daughter the comet Hale-Bopp, that was in the NW sky that night. As I pointed out the comet to my daughter, my wife suddenly yelled my name and said what is that. As I turned to see what she was yelling about, and pointing at. I instantly seen in the SW sky very low, just hovering, was an unidentified flying object. Suddenly the object started to move towards us, my wife for unknown reasons said it has seen us watching. (why she said this I do not know) As we watched it the object glided directly over us, We watched as the stars were occluded by the triangle shaped craft as it passed between us and the night sky. We observed that as it slowly passed overhead, the stars appeared to waver at the edge of the object, (reminded me very much of the way heat rises off a road surface in the distance on a very hot day). The underneath had several glowing lights that seemed to change colors from the color of bright beryl to violet as it increased speed. The object was much larger that our acre of property, it was silent and at low altitude, just above the tree tops. We watched as it suddenly increased speed and turned ENE and increased altitude with unbelievable SPEED until it was out of sight. At no time was their any noise, nor was wind blowing, we had clear skies horizon to horizon. I have pondered submitting this for 16 years now, and have decided to go ahead and submit this account as long as our identity remains absolute."],"Summary":"black triangle with colored lights below .","Longitude":"-87.410409","Latitude":"39.471893","Tags":"City","Country":"United States","trends":["There have been 22 other sightings in Terre Haute","There were no other sightings in Terre Haute on or around March 13th 1997"],"City":"Terre Haute","Source":"MUFON","Case Number":"48237"}