{"Object Shape":"Disc","Viewing Distance":"20 Feet or Less","Object Flight Path":"Stationary","Case Number":"48232","Date of the Event":"08/15/1961 12:00 UTC","Sighting Duration":"Undisclosed","Date Submitted":"06/18/2013 08:27 UTC","City":"Exeter","Tags":"City","divs":["Sighting DetailsThis was around 1961 in North Hampton New Hampshire. I was with my cousin walking towards my aunts house (an old schoolhouse across the street from a cemetery.) We were at the edge of the driveway, it was dusk, we looked up and saw a grey lead metallic colored disc shaped object right over our heads. Next thing we were walking into the house and had lost an hour in time. I don't know how I even new this. Years later I saw my cousin (we had lost contact for 30 something years) and reminded her of the event. She remembered it but not me being there with her. She said it happened several times to her but not with me. I remember reading the Barney and Betty Hill account in Life Magazine in later years that took place in Exeter, NH, A town close to my encounter. I used to stay in at my Aunts when I was young. I used to have nightmares every night and my aunt and uncle would tell me I was screaming. I said it was coming to get me. Not sure what this means. As a child I used to hear a pulsating noise coming to my window at night and I would hide under the covers until the noise would fade away. If it was real the whole neighborhood would have been up and outside. My brother said he saw a UFO coming in his window in the next bedroom. He doesn't remember any of it today. I still remember it because it happened on occasion in the house I grew up in. I used to get really bad nosebleeds. I've always felt I may have been abducted. My next door neighbor used to tell my mom she saw UFO's in the sky. Anyhow, every so often I think about it and when I see shows on tv it brings me back. I think I've read every book about UFO's and sometimes wish I didn't know anything about them. But the fact remains that I did see that one in New Hampshire close up and will never forget what it looked like or how it affected me. Okay, so I'm rambling. I am watching Alien mysteries and it made me come here and unload some memories."],"files":["/var/www/straped/mufon/html2text/48232.html.txt","/var/www/straped/mufon/org/48232.html"],"Object Features":"Dome","Longitude":"-70.942545","Weather Factors":"Unknown","Log Number":"US-06182013-0021","Country":"United States","Disposition":"Unresolved","Source":"MUFON","Region":"New Hampshire","map":"<A HREF = \"http://maps.google.com/maps?q=42.988859,+-70.942545(48232)&iwloc=A&hl=en\"> mufon case (48232) map </A>","Summary":"looked up, observed lead like disc shaped object. Lost 1 hour of time.","Latitude":"42.988859","trends":["There have been 6 other sightings in Exeter","There were no other sightings in Exeter on or around August 15th 1961"]}