{"Longitude":"-81.232617","Disposition":"Unresolved","trends":["There have been 2 other sightings in Ravenna","There were no other sightings in Ravenna on or around June 11th 2013"],"Date of the Event":"06/11/2013 10:00 UTC","Summary":"Fiery object seen moving silently, changing directions in night sky","files":["/var/www/straped/mufon/html2text/48238.html.txt","/var/www/straped/mufon/org/48238.html"],"Viewing Distance":"101-500 Feet","Object Features":"Unknown","Tags":"City","Source":"MUFON","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy husband and I were out camping. It was about 10 pm when my hubby and I went outside of the camper to grab a smoke. He noticed the object first and then pointed it out to me. It was moving in a completely straight path moving from west to east above the tree line, maybe about 300 ft. above us. The object then appeared to almost hover for a few seconds then changed direction quite abruptly to begin moving in an east to western direction. The object was observed by both my husband and myself for approximately 5 minutes total time before the object appeared to move behind a cloud. The object moved slowly not fast like a jet but like a slow moving balloon. The object appeared to glow like it was on fire, was somewhat round shaped but at times to me appeared almost triangular. It was a very bright object to say the least and was definitely NOT the sun or moon. It was after sundown and dark out and we could see the moon looked entirely different from the object above us. My husband is a military veteran and he said he's never seen anything like it in his life, not anything that he has seen in the military either. There is a military logistics and training facility close by (about 1 to 2 miles away), and we often see military planes and helicopters fly over the campground. In fact, that very night, we saw two C-135's large cargo military planes, fly overhead of the camp, but that was about an hour or so before the object was spotted. We just want to know what the object was. We are both totally perplexed and curious. Neither one of us has any ideas. It wasn't a star (too close to us), wasn't the sun, wasn't the moon, wasn't a plane (absolutely NO sound or trails), wasn't a jet or helicopter. etc. The object was large enough that we would have to hold up a penny or even maybe a quarter to cover it up in the sky. I know what I saw was a UFO in the sense that it definitely was an \"Unidentified Flying Object\", now whether it was some military unknown object or not of this world I do not know but would like to know."],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.166377,+-81.232617(48238)&iwloc=A&hl=en\"> mufon case (48238) map </A>","Case Number":"48238","Weather Factors":"Unknown","Object Shape":"Fireball, Triangle","Date Submitted":"06/18/2013 10:18 UTC","Log Number":"US-06182013-0026","City":"Ravenna","Latitude":"41.166377","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Region":"Ohio"}