{"Object Features":"None","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Viewing Distance":"Unknown","Longitude":"-95.364294","City":"Shenandoah","Sighting Duration":"Undisclosed","Date Submitted":"06/19/2013 09:54 UTC","Object Shape":"Circle","trends":["There have been 4 other sightings in Shenandoah","There were no other sightings in Shenandoah on or around June 18th 2013"],"Country":"United States","Date of the Event":"06/18/2013 12:00 UTC","divs":["sighting detailswas taking out the garbage late at night when i spotted a large white orb traveling slowly from nw to se in a straight line. i called my wife who also came outside and saw it. it was too low for a satellite and larger\\brighter than the brightest star. it was a clear night, no clouds. after the white orb disappeared behind some trees i continued to take the garbage to the curb when i observed another, yellow\\orange orb, traveling slowly from the north to se. it also disappeared behind some trees out of my view. no noise was heard in either event. both sightings seem to be traveling in a straight line. the yellow\\orange orb was similar to another sighting i had several months ago in approximately the same area. both lights were steady, not pulsating or changing colors. i tried to take a photo of the white orb only to find out that my new nikon camera wouldnt work. later i tested the batteries with a tester and they were okay but maybe they were just too weak??? consequently i didnt get a photo."],"Summary":"Large white light too low for satellite, traveling NW to SE - also orange orb N to SW about 60 degrees also","Source":"MUFON","Region":"Iowa","files":["/var/www/straped/mufon/html2text/48249.html.txt","/var/www/straped/mufon/org/48249.html"],"Log Number":"US-06192013-0009","Case Number":"48249","Latitude":"40.763683","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.763683,+-95.364294(48249)&iwloc=A&hl=en\"> mufon case (48249) map </A>","Disposition":"Unresolved"}