{"Object Shape":"Fireball, Triangle","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/48246.html.txt","/var/www/straped/mufon/org/48246.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.510501,+-85.939949(48246)&iwloc=A&hl=en\"> mufon case (48246) map </A>","Date Submitted":"06/19/2013 03:53 UTC","Latitude":"43.510501","Summary":"half on road harvest time for corn field thought it was a corn picker went straight up exteremly fast then north fast hovered over house jeted back toward me hovered over a different house i turned left traveraling west it was parreal with me around tree","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Longitude":"-85.939949","Log Number":"US-06192013-0007","Disposition":"Unresolved","Source":"MUFON","trends":["There has been one other sighting in Fremont","There were no other sightings in Fremont on or around October 12th 2012"],"Region":"Michigan","Date of the Event":"10/12/2012 12:00 UTC","Tags":"City","Case Number":"48246","Viewing Distance":"20 Feet or Less","Country":"United States","divs":["Sighting DetailsWork 2nd shift coming home from work 1120 pm . Corn harvest time thought it was a harvester lights all over half on road so i came almost to a stop. Went straight up very fast then headed north hovering over house i was lmoving down road watching it. It jeted straight at me the crossed over road hovering over another house .I turned coner headed west on 24th street it was parell to me just above treetops followed me as i traveled west i had a stactic electricy feeling hair was standing up i could see a car up ahead travleing toward me it jeted straight acrooss the sky then straight down hovering in the Gerber farm wast water plant field really clse to ground red white blue ononon light flashing until car passed blending in with the light a treament plant i continude west toward home thinking this cant be happing i thoight it was gone a orb of light travling fast came up behind me at frist i thought it was a motorcycle but the light was not round enough had a orbing out of focus look to it i stoped at stop sign the whole back of car lite up with a very intence light could no longer see orbing light was above car i took off turned around in church parking lot so i could see were it was it was gone i headed home scared to death .called husband working away from home."],"Object Features":"Louvres","City":"Fremont","Weather Factors":"Unknown"}