{"Weather Factors":"Unknown","Latitude":"38.670043","Tags":"City","City":"Cameron Park","files":["/var/www/straped/mufon/html2text/48248.html.txt","/var/www/straped/mufon/org/48248.html"],"Sighting Duration":"00:02:30","Object Features":"None","Country":"United States","Disposition":"Unresolved","Object Shape":"Flash, Sphere, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=38.670043,+-120.985994(48248)&iwloc=A&hl=en\"> mufon case (48248) map </A>","divs":["Sighting DetailsWas getting out of my car after returning from the circle K getting a late night snack, and happened upon a flash out of the corner of my eye up in the starry sky to the north. I thought maybe it was a supernova or some kind of explosion in space. But after a few seconds went by there was another light which seemed to stay on for about half a second and appeared to shrink in diameter when it went dark again. This object looked like it was coming in and out of existence, and travelling in approxomately a straight line towards the north pole. Every couple of seconds- another light would appear, lower on the horizon and more north, but also more dim, and slightly red like how the atmosphere makes light red when viewed across a low angle toward the horizon. The object was dimly seen between the pulses of light. But very low ambience caused the object to blend in with the background starlight, thus only blurry movement was observed between flashes which appeared larger than the object in question as if it were explosions between the object and my position. There was no other humans around to verify, but the crickets and insects stopped making noises, and a strange silence and calm filled the air. Then the object was too dim to see, and I assume it passed below my horizon shortly after losing track of it. It looked like the object was in low orbit, and emitting a ball of plasma every few seconds, but travelling very quickly (over 500mph). From what I had seen- it appeared that the object was coming from the south, moving north and had come in contact with the upper atmosphere. It looked like a meteor at first- but moved slower, and the timing was fairly precise between flashes. The pulses of light seemed to move independently of the object's actual location- as if it were only flashing in a straight line- but deviating from that heading very quickly, and returning to it, in between flashes. There were no other craft in the sky."],"Date of the Event":"06/19/2013 04:03 UTC","Case Number":"48248","Date Submitted":"06/19/2013 07:46 UTC","trends":["There have been 3 other sightings in Cameron Park","There were no other sightings in Cameron Park on or around June 19th 2013"],"Source":"MUFON","Object Flight Path":"Straight-line path","Longitude":"-120.985994","Viewing Distance":"Over 1 Mile, Unknown","Region":"California","Summary":"Observed a bright flash which caught my eye directly to the north of my location. After a few seconds, another flash, followed by a series of flashes in a row travelling north in high-altitude or orbit.","Log Number":"US-06192013-0008"}