{"Region":"California","Date Submitted":"06/19/2013 06:48 UTC","trends":["There have been 4 other sightings in Los Altos","There were no other sightings in Los Altos on or around June 18th 2013"],"Disposition":"Unresolved","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/48254.html.txt","/var/www/straped/mufon/org/48254.html"],"Object Flight Path":"Straight-line path","Object Shape":"Star-like","Longitude":"-122.071693","map":"<A HREF = \"http://maps.google.com/maps?q=37.378058,+-122.071693(48254)&iwloc=A&hl=en\"> mufon case (48254) map </A>","Tags":"City","City":"Los Altos","Country":"United States","Source":"MUFON","Summary":"Brother and I were outside looking up. He pointed out a Satelite with a laser pointer. Satelite abruptly flashes incredibly bright multiple times. 2 more seen afterwards within 30 minutes","Object Features":"Unknown","divs":["Sighting DetailsMy Brother and I were watching tv in the living room. He saw a weird light in the sky so we went outside to check it out. He then noticed what he believed to be a satellite. He then pointed a green laser pointer at it so I could identify where it was. 2 minutes later the object released an incredibly bright flash (i'd say 30 times+ that a low flying plane's flash). Another few flashes were let out within five minutes or so. The object was moving in a straight path through the night sky but ive never seen a flash like that. The object looked to be a star but it had a dark orange tint to it and moved across the entire sky and was out of vision within 15-20 minutes. My brother thought was weird and said well we wont see another one. To our amaze there was another object moving exactly the same within 15 minutes of loosing the other object behind a star. It had the same dark orange tint and moved once again in a straight pattern but we didn't want to point the laser pointer this time. There were no flashes but the object still looked very unreal and out of place. It followed a similar flight path as the one before and then vanished behind a star within 15 minutes. At this point we figured that was all we'd see, and at this point im kind of hoping we were right. But to no avail there was one more object in the night sky that didnt belong. It moved in a different flight path but continued on in a straight line. We were both just a little disturbed by what we saw and decided to make a report to see if anyone else has seen this."],"Log Number":"US-06192013-0013","Date of the Event":"06/18/2013 09:20 UTC","Latitude":"37.378058","Weather Factors":"Unknown","Viewing Distance":"Unknown","Case Number":"48254"}