{"Tags":"City","Source":"MUFON","Log Number":"US-06192013-0012","Sighting Duration":"00:30:00","Latitude":"25.959261","Case Number":"48252","Weather Factors":"Unknown","City":"Marco Island","Country":"United States","Summary":"AMAZING! APPROX. 3FT. HIGH OBJECTS ASCENDING TO 7 LIGHTS IN SKY THEN DISAPPEARING","Disposition":"Unresolved","Region":"Florida","Object Shape":"Cylinder, Sphere, Other","Object Flight Path":"Hovering then path,Path then hovering","Date of the Event":"06/16/2013 10:30 UTC","files":["/var/www/straped/mufon/html2text/48252.html.txt","/var/www/straped/mufon/org/48252.html"],"trends":["There have been 5 other sightings in Marco Island","There were no other sightings in Marco Island on or around June 16th 2013"],"Object Features":"Appendage(s), Unknown","Longitude":"-81.724809","map":"<A HREF = \"http://maps.google.com/maps?q=25.959261,+-81.724809(48252)&iwloc=A&hl=en\"> mufon case (48252) map </A>","Date Submitted":"06/19/2013 01:23 UTC","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","divs":["Sighting DetailsMY HUSBAND \"G\" CALLED FOR ME TO COME OUT ON LANAI, EXCITEDLY. I WAS AMAZED AT WHAT I SAW. LOOKING TOWARD GOODLAND AREA WERE BRIGHT RED LIGHTS 7, WE COUNTED. THEY APPEARED TO BE A HALF CIRCLE, THEN UP CAME, ONE AFTER THE OTHER SLOWLY [THERE WAS A LIGHTENING AND WIND STORM] THESE BRIGHT RED OBLECTS ABOUT 3-4 FEET IN HEIGHT. THEY NEVER MOVED IN ANY DIRECTION, JUST STRAIGHT UP. THEN SECONDS LATER 4 MORE BRIGHT RED OBLECTS ASCENDED AND ALL WERE GONE. NOW, THIS TOOK ANYWHERE FROM 20- 30 MINUTES. MY HUSBAND WHO IS A PILOT IS BETTER INFORMED ON DISTANCE AND HEIGHT. I COULD'NT SLEEP THAT NIGHT OR SINCE WONDERING IF I WOULD SEE THEM AGAIN. THIS HAPPENED ON SUNDAY, JUNE 16, FATHERS DAY . WELL, THE FOLLOWING MONDAY I CALLED OUR LOCAL PAPER, MARCO ISLAND EAGLE AND SPOKE TO A GENTLEMAN NAMED \"J\". I SPOKE OF OUR SIGHTING, HE WAS GOING TO A MEETING WITH OTHERS AT THE PAPER AND I HAVE NOT HEARD BACK. IT IS MOST PROBABLE THAT OTHERS HAVE WITNESSED THIS EVENT. I SENT AN EMAIL TO THE MUFON OF FLORIDA YESTERDAY JUNE 18,2013 BUT RECIEVED NO REPLY. FOR SOME REASON, UNKNOWN, I CANNOT GET BACK ON THAT SITE. I AM PUZZLED THAT NO ONE HAS CONTACTED US. MY DOG MOLLY BARKED THE WHOLE TIME. I AM STILL SO EXCITED EVEN WHILE WRITNG THIS TO YOU. WE SURE WOULD LIKE TO KNOW,IF ANYONE ELSE HAS REPORTED THIS EVENT.WE SHOULD HAVE PHOTO OF THIS ON OUR PHONE BUT AMAZEMENT OVER POWERED US AND WE DID'NT MOVE. WE DID'NT WANT TO MISS ANYTHING. IN CLOSING, I ASKED MY HUSBAND,DO YOU THINK CHINESE LANTERNS ? NO WAY, THEY WOULD HAVED MOVED WITH THE WIND. PLUS WHO IN GOD'S NAME WOULD BE SENDING OBJECTS TOWARD LIGHTS IN THE SKY LATE SUNDAY EVENING.......P.S. I GOT A PHONE # ON THE SITE BUT IT WAS NOT FOR MUFON."]}