{"Disposition":"Unresolved","Latitude":"41.092112","Summary":"Three circular clear/whitish objects hovering in the sky while I was driving","Object Shape":"Circle, Cylinder","Case Number":"48258","Country":"United States","Weather Factors":"Unknown","Date Submitted":"06/19/2013 08:41 UTC","trends":["There has been one other sighting in Nyack","There were no other sightings in Nyack on or around June 19th 2013"],"Source":"MUFON","Region":"New York","files":["/var/www/straped/mufon/html2text/48258.html.txt","/var/www/straped/mufon/org/48258.html"],"Sighting Duration":"Undisclosed","Longitude":"-73.913825","map":"<A HREF = \"http://maps.google.com/maps?q=41.092112,+-73.913825(48258)&iwloc=A&hl=en\"> mufon case (48258) map </A>","Viewing Distance":"101-500 Feet","Tags":"City","Date of the Event":"06/19/2013 01:50 UTC","divs":["Sighting DetailsI was driving home from school on the thruway. As I was merging off the exit I looked up in front of me and I noticed something in the sky. As I was going around the bend I had to turn my head to the drivers side window to see it since I was driving away from it. I clearly saw three clear to whitish objects closely together. It did not seem like they were moving. I wanted to grab my phone but it was dead. At first I thought maybe it was a plane, or a bird, but clearly planes dont hover, and I never saw a clear bird before. I also knew it wasent a plane because as I drove home I kept looking into the skies, and I saw another object with similiar color characteristics but then I realized it was a plane because it had wings and it was moving. I dont know what it was, but I know for a fact that it was nothing like I have seen before, and it was definitely not a plane. The feeling I got after the ufo sighting was confusion because I wanted to know what it was and I wanted answers. My heart was beating fast, and I asked myself, what did I just see? Did I just see what I think I saw? I lost sight of the object as soon as I got off the exit. I don't know why I didn't stop to watch it, I feel like by the time I actually comprehended what just happened it was too late to make that decision. I didn't really get to see what it was doing or hear anything. My sunroof was open and I feel like an object that close would make some kind of noise."],"City":"Nyack","Object Features":"Unknown","Object Flight Path":"Stationary","Log Number":"US-06192013-0016"}