{"Object Flight Path":"Straight-line path,Path with directional change","Object Shape":"Circle","Viewing Distance":"Over 1 Mile, Unknown","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=41.906545,+-87.783291(48250)&iwloc=A&hl=en\"> mufon case (48250) map </A>","Tags":"City","Date of the Event":"06/19/2013 11:01 UTC","divs":["Sighting DetailsShortly before 11 AM this morning, I was sitting on my balcony having a cigarette and facing east. It is very clear and sunny, and almost directly at 90 degrees I caught glimpses of several white (perhaps reflective?) star-like objects. They were about the same size as a pinpoint of light. Sometimes they seemed much brighter and slightly bigger, and may have been reflecting the sun. I observed at least five, separately for about 2-5 seconds each. Those were the most visible ones. Others seemed to have glowing edges and were more difficult to see and I saw perhaps the five-six of those. They seemed to be traveling in the same direction - north to south at a very high rate of speed. One of the very bright ones traveled east to west, right past the sun and became invisible when it stopped reflecting light. I saw that one for about 3-4 seconds. In total, I saw about 10 or more objects for very brief periods of time. I tried using my camera phone to capture these objects but nothing turns out that I can see, except for a dark object that enters the frame at :19, moving north to south, and disappears within a second. I did not see that when I was filming - I was trying to record the faint pinpoints of light. The dark object seems a bit lower than the lights I saw, at approximately 70 degrees. I recorded this from my balcony and you can see the sun in the upper right corner of the frame, and part of my neighbor's balcony above me. I live near O'Hare, and saw commercial air traffic before and after this incident. I did note that the jets left contrails, but the objects I saw did not. The objects were completely silent. This was the first time I have seen these lights during the day. I have seen them before at night in the same area, same place in the sky."],"Date Submitted":"06/19/2013 12:41 UTC","Object Features":"Unknown","Region":"Illinois","Longitude":"-87.783291","City":"Forest Park","Log Number":"US-06192013-0010","Weather Factors":"Unknown","Summary":"Several small white orbs, one fast-moving dark object","trends":["There have been 15 other sightings in Forest Park","There were no other sightings in Forest Park on or around June 19th 2013"],"files":["/var/www/straped/mufon/html2text/48250.html.txt","/var/www/straped/mufon/org/48250.html"],"Latitude":"41.906545","Country":"United States","Sighting Duration":"Undisclosed","Case Number":"48250","Source":"MUFON"}