{"Longitude":"-78.493861","trends":["There have been 19 other sightings in Charlottesville","There were no other sightings in Charlottesville on or around June 19th 2013"],"City":"Charlottesville","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Object Features":"Unknown","Region":"Virginia","Object Shape":"Oval","Latitude":"38.084937","Source":"MUFON","Disposition":"Unresolved","divs":["Sighting DetailsMy wife and I were taking our evening walk when we saw an object, approximately at 8:35 that was pulsating with blue-green and red lights moving at rapid speed moving in an S shape, randomly, then moved about 1,000 feet in less than one second and hovered at half a mile upwards to the east while emitting a sun bright light as it picked up speed, then moving in circular motion and rose to just below cloud level, again in less than one second. Hovered more, still with pulsating lights. Hovered for at least two minutes. It then dropped at least 500 feet as a plane flew overhead, plane 300 feet above the object (live near airport), it then went in a south west direction with the same sun bright flash of light (as if 75% of the craft lit up; both times), \"almost\" drowning out the pulsating lights. Came to a stop mid sky less than 500 feet above ground and then descended to treetop level instantly vertically. Lost sight of the object at that point. Would estimate object disappeared near Rivanna Reservoir about 3 miles from airport. Could not pick up object with my cell phone camera. pulsating lights got extremely bright at times, sometimes appearing larger due to the brightness. Amazing blue-green color, especially. No fear when seeing the object, but was amazed at the directional changes and patterns of movement as well as extreme speed. Knew at once what I was witnessing."],"Country":"United States","Log Number":"US-06192013-0018","Date of the Event":"06/19/2013 08:35 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.084937,+-78.493861(48260)&iwloc=A&hl=en\"> mufon case (48260) map </A>","Summary":"Pulsating lights, then bright flash when at speed circular movmenets ascend and descend in one second of thousands of feet, also left to right, hovering at different altitudes","files":["/var/www/straped/mufon/html2text/48260.html.txt","/var/www/straped/mufon/org/48260.html"],"Case Number":"48260","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering,Other","Date Submitted":"06/19/2013 09:50 UTC","Tags":"City"}