{"Tags":"City","trends":["There has been one other sighting in Hopkinton","There were no other sightings in Hopkinton on or around June 19th 2013"],"Object Shape":"Sphere, Star-like","Disposition":"Unresolved","Country":"United States","Date of the Event":"06/19/2013 12:00 UTC","Case Number":"48273","map":"<A HREF = \"http://maps.google.com/maps?q=43.19405,+-71.67456(48273)&iwloc=A&hl=en\"> mufon case (48273) map </A>","Source":"MUFON","Summary":"Bright white object, stationary flight path, changes path to follow airplane. What was not caught on film is up to you to believe","files":["/var/www/straped/mufon/html2text/48273.html.txt","/var/www/straped/mufon/org/48273.html"],"divs":["sighting detailsanother night of stargazing while listening to the bruins. sometime during second period of game 4 stanley cup, i noticed a heavy amount amount of air traffic in the sky. witnessed one plane actually tailing another. they were flying extremely close to one another, flew right overhead on me. didnt think much of it until i noticed both planes were out of view and then came back into view as they circled back from their flight path. they were flying ne and seemed to change path and head w-nw. i decided to keep my camera in my pocket at this point. about ten mins later during the second intermission of the hockey game, i noticed an exceptionally bright object traveling across the sky coming from the nw heading to se. no strobes unlike ever other moving object in the sky that night. i first thought it might be a satellite but it seemed to large and bright. i began to film. at :17 into clip you will see the roofline of the house dip into the picture as i also pick up on a stationary star viewable in my viewfinder. this was the brightest star my camera could pick up, but as you can tell the object was much brighter. you can witness an obvious change in the flight path as it moves away from the stationary star and seems to chase an airplane that is flying from s to n. plane is seen with normal strobing lights. i stopped filming as both plane and object were about to disappear out of my pov over the roofline to my barn. i stated to walk around the barn to gain a better view and what i witnessed next, i will kick myself in the ass for not getting filmed. the bright white object shrank to barely viewable red dot within 1-2 seconds and then vanished. i tried to start filming the second clip but was not quick enough to catch this event. the end of this event seemed to mimic the end of the event i reported on 6\\2\\13. a lesson to all, never stop filming!"],"Object Flight Path":"Path with directional change","Log Number":"US-06202013-0008","Date Submitted":"06/20/2013 01:33 UTC","Region":"New Hampshire","Viewing Distance":"Unknown","City":"Hopkinton","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Latitude":"43.19405","Longitude":"-71.67456","Object Features":"None"}