{"Date of the Event":"06/20/2013 03:11 UTC","Weather Factors":"Unknown","Object Features":"Dome","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","map":"<A HREF = \"http://maps.google.com/maps?q=35.10074,+-84.875148(48279)&iwloc=A&hl=en\"> mufon case (48279) map </A>","Source":"MUFON","Sighting Duration":"Undisclosed","Region":"Tennessee","Longitude":"-84.875148","Disposition":"Unresolved","Latitude":"35.10074","City":"Cleveland","files":["/var/www/straped/mufon/html2text/48279.html.txt","/var/www/straped/mufon/org/48279.html"],"Date Submitted":"06/20/2013 09:59 UTC","Object Shape":"Cigar, Disc, Star-like","trends":["There have been 7 other sightings in Cleveland","There were no other sightings in Cleveland on or around June 20th 2013"],"Case Number":"48279","divs":["Sighting DetailsPHONE CALL 3AM FROM IN-LAWS WHILE WE WERE ASLEEP, HUSBAND RUNS OUTSIDE TO OUR BACK DECK THAT FACES THE WEST AND RETURNS TO WAKE ME UP. I RAN OUTSIDE WITH HIM SO WE COULD WITNESS THIS TOGETHER. IT WAS A LARGE AIR CRAFT IN THE WNW SKY OF CLEVELAND, TN FROM OUR BACK DECK OF OUR HOME (LOCATED OFF OF DALTON PIKE, SE CLEVELAND AREA). AT FIRST I THOUGHT I WAS DREAMING AND IT WAS A HOAX BECUASE I DID NOT BELIVE IN SUCH CREATURES OR CRAFTS (WHATEVER THEY ARE). THE CRAFT WAS ACCURATELY DARTING LEFT AND RIGHT, THEN STOPPED MOMENTARITLY BEFORE MOVING STRAIGHT UP IN AIR. IT WAS ALMOST AS IF IT WAS SEARCHING FOR SOMETHING OR SOMEONE. THEN A SINGLE BEAM OF LIGHT EMERGED AS IT WAS \"SCANNING\" THE AREA OR CONTINUING A MORE IN DEPTH SEARCH. THIS OCCURRED MORE THAN ONCE WITH THE BEAM \"SCANNING\" ROUGHLY ABOUT 4 TIMES IN 4 DIFFERENT DIRECTIONS. THERE WAS A SMALL AIRPLANE (NO WHERE NEAR THE CRAFT THAT FLEW OVER OUR HOME, IT WAS LOUD AND YOU KNEW IT WAS A PLANE). THE AIR CRAFT IN THE DISTANCE WAS QUITE UNUSUAL AND I HAVE NEVER WITNESSED ANYTHING LIKE THIS IN PERSON. I HAVE ONLY SEEN SUCH CRAFTS IN MOVIES. THIS WAS A CREEPY FEELING FOR NOT ONLY MYSELF, BUT OUR FAMILY AS WELL. WE NEVER LOST SIGHT OF THE OBJECT, AFTER ABOUT 15 MINUTES OF OBSERVATION, WE DECIDED 7AM CAME EARLY AND WE HAD TO GO BACK TO BED SO WE COULD GET UP FOR WORK. TO OUR KNOWLEDGE, TI WAS STILL THERE AFTER WE WENT BACK IN THE HOUSE, I AM NOT SURE WHEN OR IF IT LEFT THE AREA."],"Tags":"City","Summary":"WITNESSED LARGE CRAFT IN DISTANCE DARTING, IT MOVED UP AND DOWN SLOWLY AFTER, BRIGHT LIGHTS AND ROTATING IN WNW SKY","Viewing Distance":"Over One Mile","Country":"United States","Log Number":"US-06202013-0013"}