{"Object Flight Path":"Stationary","Region":"Michigan","Object Shape":"Cone","Date Submitted":"06/20/2013 09:38 UTC","Summary":"Appeared to be like a meteor falling from the sky and stopped dead. Was able to view everything from tail to the head. Took 2.5 min to totally evaporate, starting from tail. Approx. 10 min later 2 minitary jets flew by.","Object Features":"None","Viewing Distance":"Unknown","Source":"MUFON","Log Number":"US-06202013-0012","Latitude":"43.546355","Date of the Event":"06/20/2013 05:50 UTC","Case Number":"48278","Sighting Duration":"Undisclosed","Disposition":"Unresolved","divs":["sighting detailsnot sure if this is any interest to you because this i would not consider a ufo just something unusual. going to feed the cats on the back deck and opened the sliding glass door. looked slighty,straight up, and straight behind me facing east. first thought, at the time, was a funny looking cloud but no clouds at all in the sky. second thought was a meteor falling to the sky but noticed it was frozen in the sky. from where i stood the tail was approximately 2-3 inches long and the head about 1\\4 inch in diameter. appeared to have approximately 10 streaky tails at first. slowly watched it evaporate starting from the tails and eventually the head, which took approximately 2-3 minutes. approximately 10 minutes later 2 military jets flew by but if it weren't for their trails would not have noticed them. using the same approximate measurements, the jets were approximtely 2 mm. the jets seemed to descended over the approximate area (from where i stood, but not sure on the distance from me)because their trails disappeared so know they began flying low. unfortunately no pictures. i wanted to keep watching to see what was in the head after the evaporatation. but saw nothing."],"trends":["There has been one other sighting in Deckerville","There were no other sightings in Deckerville on or around June 20th 2013"],"City":"Deckerville","Country":"United States","files":["/var/www/straped/mufon/html2text/48278.html.txt","/var/www/straped/mufon/org/48278.html"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=43.546355,+-82.840172(48278)&iwloc=A&hl=en\"> mufon case (48278) map </A>","Longitude":"-82.840172","Weather Factors":"Unknown"}