{"Longitude":"-94.438742","map":"<A HREF = \"http://maps.google.com/maps?q=39.437322,+-94.438742(48280)&iwloc=A&hl=en\"> mufon case (48280) map </A>","Latitude":"39.437322","Object Features":"None","Sighting Duration":"Undisclosed","Country":"United States","Log Number":"US-06202013-0015","Case Number":"48280","Region":"Missouri","City":"Holt","Tags":"City","Viewing Distance":"Over One Mile","trends":["There have been no other sightings in Holt","This sighting has never been favorited."],"Weather Factors":"Unknown","Date of the Event":"06/19/2013 10:30 UTC","Source":"MUFON","Object Shape":"Unknown","Disposition":"Unresolved","Summary":"saw bright object moving w. to e. somewhat overhead at apex then accelerated vanishing in red light","divs":["Sighting DetailsThis report comes from Missouri North of Kansas City approx 30 miles. I live in the country on a hill with no obstructions to the night sky and no street lights or buildings obscuring view. Our back deck is a favorite place to be on beautiful evenings. There were 6 witnesses including myself. A very clear night . We had observed Venus earlier to the West North....just above tree tops of horizon. This came from similar direction. Some one said to look could see Venus again? Was a very bright light moving West to East. So was not a planet or star. Someone said Space station. Which I and others have seen before but? The orbit was wrong ...in my thinking though am certainly no expert. So the light was first observed West very similar to Venus reckoning moved steadily in an East direction increasing in size due to proximity. In my observation was not within Earth atmosphere. The light reflection or inherent was white and very bright. As moved from East to West went over us. Not directly more like a 2 o'clock position. I thought object had shape to it hourglass or a length rectangular? There was never blinking lights as an aircraft just steady bright white light that increased again due to proximity. Object continued on West to East path . I say object because stars or aircraft don't do what we observed next. It seemed to be accelerating and gaining altitude ...path was steady throughout observation. Then ...the best way to describe was like a Star Trek ship going into warp factor....went up ...curving up and shot out of sight in a trail of red light then gone. I am 56 years young and this is first time I witnessed anything I felt could truly be categorized as a UFO. The other five witnesses concur and am sure glad they were there to verify what we all saw."],"Object Flight Path":"Path with directional change","Date Submitted":"06/20/2013 12:23 UTC","files":["/var/www/straped/mufon/html2text/48280.html.txt","/var/www/straped/mufon/org/48280.html"]}