{"City":"Saint-Cyr-au-Mont-d'Or","Tags":"City","Date Submitted":"06/20/2013 05:44 UTC","Case Number":"48284","Object Shape":"Sphere","Summary":"a bright light approached us. First thought it was airplane with landing lights. Then light was too bright for traditional airplane plus two sets of colored \"light rays\". Described arc trajectory slowly. Suddenly faded off. disapeared.","map":"<A HREF = \"http://maps.google.com/maps?q=45.815306,+4.817729(48284)&iwloc=A&hl=en\"> mufon case (48284) map </A>","Country":"France","Object Flight Path":"Path with directional change","divs":["sighting detailsironically enough i was talking about ufos with a guy that works on the renovation of our house after dinner. no misunderstanding, i am a practical man not a deluded ufo type. 11 pm, clear sky, a few stars, bright moon 3\\4. i saw a light approaching. first thought it was airplane with landing lights even though our location is still far from any airport. the light came drifting in our direction. it was way too bright for any craft. can't tell height. absolutely no blinking signal lights. just a very bright white orb. when it was closest to us we noticed two sets of small \"light rays\" like emmited on the edges of the light ball. one green, one red (see illustration). the ligth went over a low light cloud and was still very visible through it. i said \"this light is very bright\". my friend said \"indeed\". it past over us describing an arch changing smoothly its course. we changed our location to follow the object by sight. it went in the path of the very bright moon and was still clearly visible and very bright. speed was average. like floating. clearly not any type of chinese lantern though. too big and high. we watched it go away southward. then in 3 seconds it \"turned off\" and vanished."],"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/48284.html.txt","/var/www/straped/mufon/org/48284.html"],"Region":"Rhone-Alpes","Longitude":"4.817729","Weather Factors":"Unknown","Object Features":"None","Viewing Distance":"Unknown","Latitude":"45.815306","Date of the Event":"06/20/2013 10:55 UTC","Sighting Duration":"00:03:00","Source":"MUFON","trends":["There have been no other sightings in Saint-Cyr-au-Mont-d'Or","This sighting has never been favorited."],"Log Number":"FR-06202013-0019"}