{"Date of the Event":"07/15/1974 10:00 UTC","Case Number":"48289","Longitude":"-86.50806","Weather Factors":"Unknown","City":"St. Joseph","Source":"MUFON","Country":"United States","Summary":"2 lights came overhead too fast for any know propulsion, hovered over my car with it moving, stopped when I stopped and another light came on, a puff noise (no other) and took off at bullet speed","Object Flight Path":"Hovering then path,Path with directional change","files":["/var/www/straped/mufon/html2text/48289.html.txt","/var/www/straped/mufon/org/48289.html"],"trends":["There have been no other sightings in St. Joseph","This sighting has never been favorited."],"Log Number":"US-06202013-0023","map":"<A HREF = \"http://maps.google.com/maps?q=42.068717,+-86.50806(48289)&iwloc=A&hl=en\"> mufon case (48289) map </A>","Latitude":"42.068717","Tags":"City","Object Features":"Unknown","divs":["Sighting DetailsA friend and I were traveling south on Lakeshore drive when 2 unknown lights came zooming over us, stopped abruptly when it got over my car,following us at our speed of about 40 miles per hour. It was dark, and all I could see were the lights. I assumed it was a UFO, not that I believed in them at the time, but it was too strange and high -tech for humans even now! This was 1974. The ship, or whatever stopped because I stopped, thinking that I could get them to land. I liked \"the day the earth stood still\" and had thoughts of meeting an alien.I opened my car door so I could signal them but as soon as I did, a third light came on and it made a little air noise, like compressed air flowing for a split second and it shot off like a bullet. I guessed that it was a good 20 miles away in the first second of flight. We could see it go like a meteor southward and I could estimate that it was somewhere over the Benton Harbor airport area in one second. Lost sight because it kept traveling at that speed as far as we could tell. There was no other sound the whole time and I had my sunroof open that night. I could see it overhead staying right with my car as we traveled. After we stopped, people from the car behind me and in front of me came over and started talking to us about the UFO because they stopped when I stopped but were never that close to it. It appeared to be just above the treetops. The next day I was listening to the radio and a lady from St. Joseph was calling in to describe the same thing hanging over her house. She said it was there for about an hour. My friend said he could see a triangle shape from below the craft. We never reported it. One of the weirdest parts is when the friend came to my house about 10 years later and denied ever seeing anything. Then the next time I saw him ( another 10 years later ) the first thing he says is \"Hey, remember when we saw the UFO?\""],"Viewing Distance":"21-100 Feet","Object Shape":"Triangle","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Region":"Michigan","Date Submitted":"06/20/2013 11:38 UTC"}