{"Longitude":"-122.646613","Case Number":"48299","files":["/var/www/straped/mufon/html2text/48299.html.txt","/var/www/straped/mufon/org/48299.html"],"Disposition":"Unresolved","Weather Factors":"Unknown","Date Submitted":"06/21/2013 07:15 UTC","Region":"Washington","Viewing Distance":"Over One Mile","City":"Bremerton","Summary":"Myself and two others have been observing this craft nearly nightly for over a month... This specific instance the craft blinked into existance and then began getting brighter and brighter. It pulsated and hovered over the Bremerton Naval Station.","Object Shape":"Circle","Tags":"City","Country":"United States","Object Features":"Unknown","divs":["Sighting DetailsMyself and two of my friends were in the house watching movies when I observed the unknown craft, Circular in its shape, had returned once more. It blinked into being from nothing then became so bright, both a planes landing lights and even a star could not come close to compare to this crafts intensity. It always appears just over the top edge of our neighbors roof. I told the guys to look south out our front window facing the Bremerton Naval Station which is just under 2 miles away. It sat over the Bremerton Naval Station for quite a few minutes. We witnessed it pulsating every color of the rainbow spinning at a high speed and pulsating brighter then dimmer, brighter then dimmer. It began moving slowly toward the (East) Port Orchard direction and then blurred out. Honestly non of us know what it is nor care to speculate. It just is.... I'm amazed every time I see it and even called the Tacoma Narrows Airport asking if they have had calls on it. Jay told me no, but I should try to get video of it in flight."],"trends":["There have been 19 other sightings in Bremerton","There were no other sightings in Bremerton on or around June 19th 2013"],"Object Flight Path":"Stationary,Hovering then path","Log Number":"US-06212013-0009","map":"<A HREF = \"http://maps.google.com/maps?q=47.603869,+-122.646613(48299)&iwloc=A&hl=en\"> mufon case (48299) map </A>","Date of the Event":"06/19/2013 10:30 UTC","Source":"MUFON","Sighting Duration":"00:05:10","Latitude":"47.603869"}