{"files":["/var/www/straped/mufon/html2text/48304.html.txt","/var/www/straped/mufon/org/48304.html"],"Object Features":"Unknown","City":"Marshall","map":"<A HREF = \"http://maps.google.com/maps?q=39.100685,+-93.193721(48304)&iwloc=A&hl=en\"> mufon case (48304) map </A>","Region":"Missouri","Object Flight Path":"Path then hovering","Disposition":"Unresolved","Sighting Duration":"06:15:00","Source":"MUFON","Latitude":"39.100685","Date Submitted":"06/21/2013 01:20 UTC","Weather Factors":"Unknown","Country":"United States","Viewing Distance":"Unknown","Tags":"City","Log Number":"US-06212013-0014","Date of the Event":"04/30/2011 06:15 UTC","Case Number":"48304","Object Shape":"Disc","trends":["There have been no other sightings in Marshall","This sighting has never been favorited."],"divs":["Sighting DetailsNear dusk. After 6 but before 6:30. I was standing in my driveway having a cigarette and watching the sun set when I noticed this dark object moving towards me. Thought at first it was a plane but appeared to be flying very low in the sky. Next thought that maybe it was a balloon of some kind. As it got closer, I noticed it stop and hover in the sky for a brief time before resuming it's path which definitely freaked me out because I've never seen anything do that. As it passed overhead I realized that this was a definite disc shaped object. I don't like to be that cliche with my description but that's what it was. It made no noise which I thought was particularly weird for as close as it seemed to be. As it moved away towards the southeast I noticed a red light at the rear of the object. It didn't pulsate or blink or anything like that. It was just a solid light. It continued on it's path until it was so far away it was no longer visible. The whole sighting lasted maybe a minute. Even though I had my cell phone in my pocket, I didn't even think of taking video or a picture because honestly I was too stunned at what I was seeing. I live 40 miles from Whiteman Air Force Base(home of the Stealth Bombers) and I've seen all kinds of different aircraft. I've also seen blimps and stuff like that go right over my head but this was something different. I'm not saying that it was anything unidentifiable but it was definitely something I have never seen before or since. I've kept this to myself for so long because I didn't want people to think I was crazy or stupid."],"Summary":"Silent, dark disc shaped object moved slowly, hovered for a brief time then moved off again. Red light at rear observed","Longitude":"-93.193721"}