{"Tags":"City","Object Shape":"Circle","City":"Boise","Longitude":"-116.278636","trends":["There have been 69 other sightings in Boise","There were no other sightings in Boise on or around June 21st 2013"],"Date of the Event":"06/21/2013 06:35 UTC","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Country":"United States","Region":"Idaho","Object Features":"Unknown","divs":["Sighting DetailsI woke up at 6:00 am (MT) on June, 21, 2013,and started a pot of coffee, then went and got dressed. At 6:30 am I poured myself a cup of coffee then walked through the house to the backyard to have a cigarette. It was a beautiful morning with blue sky and several wispy clouds. I immediately noticed the round bright white object against the blue sky. I lit a cigarette and stood watching it. The object moved in a straight line, went through one wispy cloud, then against the blue sky, and into another wispy cloud - then disappeared. I stood there for another 15 minutes but it never came out. I was totally calm while watching the object. We have an airport a few miles away, but this object was too high to be landing. So, I figured it was a plane flying high, going to Seattle or Portland, but it did not come out of the little wispy cloud and it really didn't look like an airplane. Then I thought it was a satellite, but again it should have continued on a straight path, not disappear. A planet would not have moved in the sky. I am at a loss as to the identity of this object. I am reporting it because this situation happened and I wanted someone to know. I didn't get my camera because I wasn't disturbed by the object until it disappeared."],"map":"<A HREF = \"http://maps.google.com/maps?q=43.617232,+-116.278636(48302)&iwloc=A&hl=en\"> mufon case (48302) map </A>","Latitude":"43.617232","files":["/var/www/straped/mufon/html2text/48302.html.txt","/var/www/straped/mufon/org/48302.html"],"Case Number":"48302","Date Submitted":"06/21/2013 10:14 UTC","Sighting Duration":"Undisclosed","Log Number":"US-06212013-0012","Summary":"Round white object moved straight across sky then disappeared.","Source":"MUFON","Weather Factors":"Unknown","Object Flight Path":"Straight-line path"}