{"Date of the Event":"06/20/2013 09:45 UTC","divs":["Sighting DetailsOn Thursday June 20, 2013 approx 9:45-10pm in Canterbury N.H. We were outside watching fireflies on the path we have leading to our chicken coop; my boyfriend Damon and I noticed in the sky what we thought to be planes. I grew concerned when I realised how closely they were flying from one another. About 100 feet from where we stood the objects were coming from the direction of Shaker Village. There were 3 red bright lights round in shape. There were 2 red lights that were clearly separate objects following closely to a much larger object. It flew closer to us; approximately 50 feet above us rather quickly. We were able to get a good look of the flying objects threw an opening in the trees. I saw a triangular shaped flying object with a haze around it. The front object was very large in size with red lights, the 2 separate objects that were following it looked like red balls of light moving in their own paths. The 2 red lights were flying behind it never beside it. The 3 objects hovered slowly over the tree tops towards the north and over our pond in the back yard. We could not see them after they flew over the pond because of the many trees. Unfortunately my camera did not pick up what we saw, it actually turned off I fumbled around trying to turn it back on in the mean time keeping my eyes on the objects. I am disappointed I was unable to capture vital proof. I would like to find out if anyone else in the surrounding areas saw what we saw. My boyfriend did call the Canterbury police department and The National UFO Reporting Center. The center said they had a similar sighting called in from Connecticut that same night."],"Date Submitted":"06/21/2013 11:36 UTC","Latitude":"43.275723","Tags":"City","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=43.275723,+-71.526651(48303)&iwloc=A&hl=en\"> mufon case (48303) map </A>","City":"Concord","Source":"MUFON","Weather Factors":"Unknown","Viewing Distance":"21-100 Feet","Longitude":"-71.526651","Sighting Duration":"Undisclosed","Log Number":"US-06212013-0013","Object Shape":"Circle, Fireball, Triangle","files":["/var/www/straped/mufon/html2text/48303.html.txt","/var/www/straped/mufon/org/48303.html"],"Object Flight Path":"Path then hovering","Case Number":"48303","Country":"United States","trends":["There have been 23 other sightings in Concord","There were no other sightings in Concord on or around June 20th 2013"],"Object Features":"Unknown","Region":"New Hampshire","Summary":"3 flying objects in Canterbury NH Triangle shape and 2 red balls of light behind it."}