{"Object Features":"Unknown","Case Number":"48317","Region":"Ohio","City":"Lebanon","Summary":"Saw a bright, pulsating orange object -- moving in a direct line -- pass over a residential area in Lebanon, Oh.","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/48317.html.txt","/var/www/straped/mufon/more/48317_submitter_file1__sighting1.JPG","/var/www/straped/mufon/org/48317.html"],"Longitude":"-84.230409","Weather Factors":"Unknown","divs":["Sighting DetailsI was at work -- as a staff member at a group home -- in Lebanon, OH, in a residential area right on 63 by the Black Barn in Lebanon, OH. At approximately 11:45pm, I was summoned outside by a friend and coworker to look at what he thought was an airplane on fire. Upon going outside, I saw the object moving in a straight-line north-northwest (five people were present that witnessed this including myself). It was at a lower elevation than an airplane typically would be. It pulsed subtly a fiery orange which gave the illusion of an object on fire, but it moved unwavering in a straight light, had no tail or trace of light in its wake, and stayed a consistent yet vague roundish shape. It emitted no sound. I had no odd feelings watching it other than awe at something unknown. I took a photo of the object and a short video on my phone, but both only came across as a small light in the sky more white than what I witnessed with my eyes. While outside, when the object was overhead (and just to the East of us) someone made a comment that it smelled like a skunk outside. It took roughly a minute for the object to disappear into the clouds towards the horizon (North-Northwest from us). The skunk smell was gone by the time it passed out of sight. We remained outside long after the sighting, but witnessed nothing further. RE: Media attached. The first attachment is a photo. The bright orange light is a street lamp (and looks closer to the color of the object we saw than the object appears in the photograph). The second attachment is a video. For whatever reason, the video is tilted to the left where the ground is appearing up the right side of video."],"Object Flight Path":"Straight-line path","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Tags":"City","Latitude":"39.435409","Date Submitted":"06/22/2013 01:05 UTC","Disposition":"Unresolved","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.435409,+-84.230409(48317)&iwloc=A&hl=en\"> mufon case (48317) map </A>","Country":"United States","Log Number":"US-06222013-0003","Date of the Event":"06/21/2013 11:45 UTC","trends":["There have been 6 other sightings in Lebanon","There were no other sightings in Lebanon on or around June 21st 2013","This sighting has been favorited 1 time.",""]}