{"City":"Blythe","Date Submitted":"06/22/2013 12:14 UTC","Tags":"City","Source":"MUFON","Object Flight Path":"Path with directional change","Disposition":"Unresolved","Date of the Event":"06/20/2013 01:35 UTC","trends":["There have been 7 other sightings in Blythe","There were no other sightings in Blythe on or around June 20th 2013"],"Object Features":"None","divs":["Sighting DetailsIt was very early morning about 130am 140am and I forgot to take the trash to the street for pick up and really did not want to take it to the street that night. I was taking the can to the street and before I got there I looked up I could not say why I did not hear anything. That is when I saw it a orange round ball object that looked as if it moved in waves slower then faster it was moving with the and just made a wide turn and came right at me over the top of some homes on the river and it looked as if it stopped but I think it was my line of vision because it made like a U-turn and then went to the North Northeast. It looked brighter on the top and the bottom and it almost looked as if it was see though in the center of it it looked as if it was very close almost right over me. I ran into the house to get a camera and my cell phone and ran back out. I started to go back to the spot I saw it but went to the back yard and I think I could see it for a second but it would have been 3 to 4 miles away by then. I thought it was going to do the same thing as the first round orange ball like object but it had a dome over the ball. That object got so bright I thought it was going to bust into flames but it just disparaged just gone. This ball looked as if it was gone to get brighter and that maybe because it got closer to me. The thing was the way it moved like in waves. I have photos of other things but not right at me and almost on top of me. Before I ran I looked to see if I could spot a light beam from the ground that some one could have been doing this but nothing that would look like a flash lights beam going up. This was not a falling star this changed direction it turned from the river came back at me then made a U-turn the go North Northwest from me. Please if anyone also saw it post it and contact me i would like to hear what you saw. After I saw this I stopped and wrote down every thing right then the time the way it looked the way it was going it was wild really just wild. If I can add to this post later I will add a map and the way it was moving."],"Longitude":"-114.511696","Sighting Duration":"Undisclosed","Object Shape":"Fireball, Sphere","Country":"United States","Log Number":"US-06222013-0001","Latitude":"33.642788","Weather Factors":"Unknown","Region":"California","Summary":"Round in shape looked to move in waves and the top & bottom were brighter then the center","Case Number":"48315","Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=33.642788,+-114.511696(48315)&iwloc=A&hl=en\"> mufon case (48315) map </A>","files":["/var/www/straped/mufon/html2text/48315.html.txt","/var/www/straped/mufon/org/48315.html"]}