{"Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Longitude":"-107.916114","Tags":"City","Object Features":"Appendage(s)","Summary":"Family eating at a picnic table, saw object emerge from behind trees.","Region":"Colorado","divs":["sighting detailsmy family an i were eating on market street in meeker, co. we were seated on a table outside of a chinese food restaurant when i (don) saw a glowing orange\\white object emerge from behind a grove of trees about 300 yards away. i noticed it first because it appeared to be flying very slowly and with no noise or nav lights. i thought it might have been a plane or a balloon but since i spent a career in aviation and my son is at the united states air force academy (and had the object in his field glasses the entire time). it appeared and moved slowly from right to left at about 15-20 degrees above the tree line and was moving upward to the west and south as it gained altitude. it moved up, hovered, moved left then right, and began moving off to the south. others reported it in meeker to the local police department and i have the officer's name. having seen an object before and having an inherent interest in aviation, i knew this object was under some sort of control but had no typical general or military aviation characteristics. we all felt very surprised that we could not make sense of the object. no noise, no nav lights, and a strange shape and glow left us all a bit unnerved. we lost sight of it as it abruptly lost it's lights but my son who had it in his filed glasses, could see that the object was then black and spherical, about ten meters in diameter and continued to move to the south without lights of any kind until we lost it towards the horizon or somewhere in that area. multiple observers and witnesses in town, 6 there at the site."],"Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"06/17/2013 09:00 UTC","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/48311.html.txt","/var/www/straped/mufon/org/48311.html"],"Object Shape":"Boomerang, Egg","Latitude":"40.035825","Date Submitted":"06/21/2013 09:27 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.035825,+-107.916114(48311)&iwloc=A&hl=en\"> mufon case (48311) map </A>","trends":["There has been one other sighting in Meeker","There were no other sightings in Meeker on or around June 17th 2013"],"Case Number":"48311","City":"Meeker","Weather Factors":"Unknown","Log Number":"US-06212013-0021","Country":"United States","Source":"MUFON"}