{"files":["/var/www/straped/mufon/html2text/48312.html.txt","/var/www/straped/mufon/more/48312_submitter_file1__philly.JPG","/var/www/straped/mufon/org/48312.html"],"Case Number":"48312","Log Number":"US-06212013-0022","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around June 14th 2013","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Disposition":"Unresolved","Latitude":"39.950904","Region":"Pennsylvania","Date of the Event":"06/14/2013 12:00 UTC","Longitude":"-75.157457","Source":"MUFON","Object Features":"Unknown","Object Flight Path":"Path then hovering","Object Shape":"Circle, Disc, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.950904,+-75.157457(48312)&iwloc=A&hl=en\"> mufon case (48312) map </A>","Date Submitted":"06/21/2013 10:34 UTC","City":"Philadelphia","Weather Factors":"Unknown","Tags":"City","divs":["sighting details my grandmother contacted mufon many years ago with her past abductions and sightings. she was even contacted personally by then. i will not get into all of that as it is a very long story. but after my grandmother and i had coincidentally had another (short conversation) about her experiences, i soon after went to go visit my boyfriend who lives in the city. it was late at night and i had looked out the window at an extremely purple sky with a large and strange cloud formation. i instinctively felt the need to take a picture. so i borrow my boyfriends camera. i was unable to see any lights at all in the sky at the time, not even planes, on account of the cloudiness. i set the camera function to 'night landscape'. i know night vision is actually most preferred, but sadly didn't\\nor do i have it. but also very unfortunately, you don't get to see the very purple hue of the sky. still..after taking the picture, a formation of lights appeared at the top, nearly center of the picture and of the cloud formation. i'm not 100% on what it is, honestly. only picture it showed up in. i plan to try doing this with photo's in different places more often, so hopefully i will update soon!"],"Summary":"Appeared in a picture after the clouds and sky looked odd & felt urge to take it. Didn't see anything without the camera.","Viewing Distance":"Unknown","Country":"United States"}