{"Latitude":"42.045035","Longitude":"-79.143018","City":"Frewsburg","Disposition":"Unresolved","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/48320.html.txt","/var/www/straped/mufon/org/48320.html"],"Object Features":"Unknown","Date of the Event":"06/19/2013 09:35 UTC","Log Number":"US-06222013-0005","divs":["Sighting Details The 19th of June 2013 at about 930 pm she was on the porch in our frewsburg ny home and she called me to see these low flying airplanes. We watched as a red orb, steady red light, slowly moved across the sky, about 200 feet above the tree line. Almost immediatley we saw more. All 6 of these were slow and solid red light, one would stop and another would almost catch up to it and it would begin again...., we watched as they almost turned left in the sky and headed towards jamestown ny. as we watched, the first four just blinked out, the 5th slowed and then sped up and blinked out. the last stopped dead in the sky and stayed there for several seconds and then follwed the rest and then went up at an angle and then blinked out. I had taken pictures of these and still everyone does not believe me. My wife and son also stood there watching them. The local news said they were probably chineese lanterns......education level there is a definate drop off. These red orbs did not hover, blink or make any sound at all. they were very methodical. Their was no breeze, wind or anything. when one went higher it just barely passed in front of the moon and you could just wsee the orb...nothing else. I did research on the internet and found another similar sighting in many states in 2011 as well as one in frewsburg ny, 2011....june 19th....odd dont you think. These were too low for satellites and were not chineese lanterns....really. We stood in awe as they passed one at a time....each at vaired distances from each other. I hope someone with a level mind can explain these. I feel very strong in what i saw. I took over a dozen pictures...."],"Country":"United States","Source":"MUFON","Case Number":"48320","Summary":"red orbs over trees","Weather Factors":"Unknown","trends":["There have been no other sightings in Frewsburg","This sighting has never been favorited."],"Region":"New York","Date Submitted":"06/22/2013 09:20 UTC","Object Shape":"Fireball, Sphere","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.045035,+-79.143018(48320)&iwloc=A&hl=en\"> mufon case (48320) map </A>"}