{"Date Submitted":"06/22/2013 11:43 UTC","Viewing Distance":"21-100 Feet","Date of the Event":"03/11/2013 07:15 UTC","Object Shape":"Other","trends":["There has been one other sighting in Mount Dora","There were no other sightings in Mount Dora on or around March 11th 2013"],"Source":"MUFON","Object Flight Path":"Straight-line path","Log Number":"US-06222013-0011","Latitude":"28.80488","divs":["sighting detailsnot sure mufon would be interested because this event involved a vanishing person and no ufo. i have procrastinated submission of this incident to give time to think about what happened and to decide whether or not it would be of interest to anyone. i was out for my morning walk several months ago about 07:00 a.m. the weather was clear and the sun was rising behind some trees in the s.e. as i walked i noticed an obscure individual approaching on my right about 40-50 feet away. definitely a shadowy individual with indistinct features walking on the grass about 5 to 10 feet from the side of a church building. it cast a shadow, arms swinging, leg motion normal, gray shadowy outline with some depth detail. the individuals gate was unusually graceful and this is what sparked my interest to continue to watch him\\her in hopes of getting a better view as this person advanced along side of the building. the individual approached a position between me and a small tree (that i later measured to be ~6 inches in diameter) where it promptly vanished. it never came out from the other side of this small tree. i was dumbfounded, got a few goose-bumps and stopped to keep watch. after a few minutes i walked over to the spot to see if there was some alley or door or something i was missing. to my assessment there was no place this person could have gone in the seconds between seeing and not seeing it. bi-location or multi-dimensional or illusion? i definitely saw it and can't offer any explanation."],"Region":"Florida","Country":"United States","Tags":"City","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/48327.html.txt","/var/www/straped/mufon/org/48327.html"],"Disposition":"Unresolved","Object Features":"Appendage(s)","Longitude":"-81.681074","Case Number":"48327","City":"Mount Dora","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=28.80488,+-81.681074(48327)&iwloc=A&hl=en\"> mufon case (48327) map </A>","Summary":"Individual vanishing in clear view"}