{"Region":"Oklahoma","Object Flight Path":"Stationary","Summary":"These two objects appeared in a photograph. I didn't notice them while I was taking the picture.","Object Shape":"Triangle","Object Features":"Wings","Date Submitted":"06/22/2013 10:15 UTC","Tags":"City","Latitude":"34.840138","Viewing Distance":"Unknown","Country":"United States","City":"McAlester","map":"<A HREF = \"http://maps.google.com/maps?q=34.840138,+-95.637384(48324)&iwloc=A&hl=en\"> mufon case (48324) map </A>","Sighting Duration":"Undisclosed","Case Number":"48324","Weather Factors":"Unknown","trends":["There have been 6 other sightings in McAlester","There were no other sightings in McAlester on or around June 21st 2013"],"divs":["Sighting DetailsOn June 21, 2013 I decided to start marking the sun set as it met the horizon to make me a rock calendar kinda like Stone Hinge. I am calling it Mike Hinge. I picked out a spot on the west side of my property placed a rectangle rock next to a fence post and spray painted the post gray. I sat my Iphone on top of my tripod to mark the heading of where the sun was setting and what heading I was facing to make sure that I can make the same observation each month as the sun sets. I snapped a couple of photos of the sun setting and then turned my attention to the hills north of where I was standing. I snapped a couple of shots and then came into the house to download them on my computer. As I was going through the pictures I noticed these two triangle shaped objects that I had not seen while taking the pictures. I then cropped the pic to enlarge the objects. At first glance I thought they might have been birds but I've never taken any pictured of birds in flight that look like these. Upon further observation of the objects I noticed that the one on the left bottom appears to be behind some telephone wires that are approximately 150 yards down my driveway which makes the object appear to be Very Large. The second object appears to be behind the leaves of the tree that is approximately 30 yards in front of me and also appears to be Very large. I took two pictures just a few seconds apart and the objects are only in one of the photos. I'm not saying these are USO's well I guess they are because I can not Identify them. lol.. I just wanted to send the pics in to you and maybe you can help me identify what they are.. Thank you in Advance, Michael L. Dixon HMCS(SW)Retired p.s. I did notice prior to taking the photos my Iphone Compass was malfunctioning by loosing it's magnetic north settings."],"Log Number":"US-06222013-0008","Date of the Event":"06/21/2013 08:45 UTC","Longitude":"-95.637384","Source":"MUFON","files":["/var/www/straped/mufon/html2text/48324.html.txt","/var/www/straped/mufon/org/48324.html"],"Disposition":"Unresolved"}