{"Disposition":"Unresolved","divs":["Sighting DetailsWent home for vacation and Aunt asked me and my friend if we had seen UFO's told her no so when it got dark she took us outside and she pointed them out to us. There were 2 to 3 of them and they were hovering in the sky 1 would above the dam or plant while the other 1 or 2 would hover across the sky, they also would go up and down for a short distance then in a blink of an eye they would switch places. We observed this the entire mth we were there. There was also write ups in the local paper ( The Daily Interlake) about peoples cars staling and watches stopping when they were closer to the objects. These objects were doing things that no plane or helicopter could do. I think the 3 colors that would blink were white, blue and sometimes red. Mostly they were just white lights in the sky. I knew these were not planes and knowing they were going to be there once it got dark was surreal because I knew they were UFO's not something we could explain. They were still there when we went back to Ca. when our vacation was up. When ever I told anyone about it I was laughed at. People to this day still ask me hey seen any UFO's lately.+"],"Region":"Montana","Case Number":"48329","Latitude":"48.171281","trends":["There have been 4 other sightings in Kalispell","There were no other sightings in Kalispell on or around July 3rd 1976"],"Date of the Event":"07/03/1976 12:00 UTC","Sighting Duration":"Undisclosed","Log Number":"US-06222013-0013","Object Flight Path":"Path then hovering","City":"Kalispell","Country":"United States","Weather Factors":"Unknown","Date Submitted":"06/22/2013 11:53 UTC","files":["/var/www/straped/mufon/html2text/48329.html.txt","/var/www/straped/mufon/org/48329.html"],"Viewing Distance":"Unknown","Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=48.171281,+-114.328431(48329)&iwloc=A&hl=en\"> mufon case (48329) map </A>","Summary":"2-3 hovering nightly fot over a mth. 1 would hover over the dam or aluiminun plant while 1or 2 were above mountain area, then woulsdswitch places.","Tags":"City","Source":"MUFON","Longitude":"-114.328431","Object Features":"Unknown"}