{"Date Submitted":"06/22/2013 11:26 UTC","files":["/var/www/straped/mufon/html2text/48336.html.txt","/var/www/straped/mufon/org/48336.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.0413,+-70.791724(48336)&iwloc=A&hl=en\"> mufon case (48336) map </A>","Source":"MUFON","trends":["There have been 11 other sightings in Portsmouth","There were no other sightings in Portsmouth on or around November 15th 2003"],"Sighting Duration":"00:15:00","Longitude":"-70.791724","Tags":"City","Date of the Event":"11/15/2003 09:30 UTC","Summary":"Saw triangle craft with light at each point, at tree top height, do a 180 degree turn without slowing down 2 weeks after a possible abduction","City":"Portsmouth","Viewing Distance":"21-100 Feet","Weather Factors":"Unknown","divs":["sighting detailsi never believed in ufos\\ets until i saw a ufo in portsmouth, nh on banfield road (the back road parallel to route one) in november 2003. it was a triangle shape with a white light at each point. i instantly thought it was probably a plane since pease international tradeport runway was like less than a mile away. my girlfriend at the time and i were traveling south on banfield road and saw this white or orange or orange-white bright light through trees and finally it came over the road directly above us at tree height and as it was just about over us it instantly changed directions, doing 180 and heading back the way it came without even slowing down. we tried to chase it around the block (up to route 3 and back around) and still could see the bright light as i called my mom. then it was gone. i later speculated if it could be a hovering harrier aircraft but it doesn't have that light configuration and again it didn't slow down at all when it did the 180 directly over us. we were so shaken up and freaked out. i wish i could see it again someday. *[this sighting was a week or two after my girlfriend and i, in a hampton beach apartment, woke up naked in a fetal position on top of the covers with no memory of going to bed and my girlfriend found that her buttons were torn off her clothes (i would never ever rip her clothes no matter how drunk i was) and she had a mark on her breast of 3 dots that formed a triangle. i did not have any marks on my body nor were my clothes damaged.]"],"Region":"New Hampshire","Object Features":"None, Other","Log Number":"US-06222013-0021","Country":"United States","Latitude":"43.0413","Case Number":"48336","Object Flight Path":"Path with directional change","Disposition":"Unresolved","Object Shape":"Fireball, Triangle"}