{"Sighting Duration":"Undisclosed","Country":"United States","Weather Factors":"Unknown","Tags":"City","Object Flight Path":"Unknown","Viewing Distance":"Unknown","City":"Berlin","Region":"New Hampshire","Object Features":"Unknown","Object Shape":"Unknown","Longitude":"-71.179467","Latitude":"44.47264","Date of the Event":"06/20/2013 09:03 UTC","trends":["There have been 5 other sightings in Berlin","There were no other sightings in Berlin on or around June 20th 2013"],"divs":["Sighting DetailsI was in Berlin New Hampshire walking out of the building I work in looking up at the moon and this big gold color 4 pointed star just below left of the moon about the position of Venus. I was thinking that is a pretty star then it just faded out all the while I am hearing stationary jet engine like noise which caught my attention because we have very little air traffic here but the noise sounded like a jet engine as if it was being tested on a stand. I put my stuff in the vehicle and was reaching for my camera when there was 4 maybe five but I think 4 large circular lights just appeared one was a gold light the others were white and then I am not sure if one changed colors or if it was a new light but it was reddish orange in color the lights were just like some one switched them on and off they were there then the were not. Two were separate and spaced a part the other two side by side staggered from the two that were spaced out. they came on and went out all in about 3 or 4 seconds then the jet engine noise stopped. As I leave the area the headed north to the town of Milan I noticed a gold light moving at a high rate of speed headed in the same direction that I seen the other lights. I only wish I could have caught the lights on camera but I did not. I did however think it was awesome that I got to witness this event."],"Date Submitted":"06/22/2013 07:35 UTC","Summary":"Bright Gold color star below left of moon then faded away then 4 lights flashed on circular in shape white gold reddish orange then nothing but jetlike noises","Case Number":"48334","files":["/var/www/straped/mufon/html2text/48334.html.txt","/var/www/straped/mufon/org/48334.html"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=44.47264,+-71.179467(48334)&iwloc=A&hl=en\"> mufon case (48334) map </A>","Log Number":"US-06222013-0019","Disposition":"Unresolved"}