{"Object Shape":"Boomerang, Cone, Triangle","trends":["There have been no other sightings in Randolph","This sighting has been favorited 1 time."],"Weather Factors":"Unknown","Date of the Event":"07/03/2001 11:00 UTC","Date Submitted":"06/22/2013 12:29 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Country":"United States","Summary":"I watched UFO over Earth, to see comparisions ther are, stop asking why you didnt take a picture, after i literally pooped my pants when i faced the bomerange object then I froze, the color was mixed grey it moved about like it was alive it blended, mixed","files":["/var/www/straped/mufon/html2text/48331.html.txt","/var/www/straped/mufon/org/48331.html"],"Region":"Massachusetts","Case Number":"48331","map":"<A HREF = \"http://maps.google.com/maps?q=42.17799,+-71.04659(48331)&iwloc=A&hl=en\"> mufon case (48331) map </A>","Latitude":"42.17799","Object Features":"Dome, Window(s)","City":"Randolph","Disposition":"Unresolved","Viewing Distance":"20 Feet or Less","divs":["Sighting DetailsSitting in my chair eating a ham n cheese pocket something caught my eye a cone shape object spinning real fast the color was mesmurizing, went right by window i yelled ro my daughter we ran outside. Ther was many of these objects shotting all over the place i ran to the side of the house and a bomerange ship object raised up over my house, turned slowly, no noise , very quiet , so close i could see the color and shapes on it, a grey it swirled and mixed like it was alive. Over the baseball field ther was a long cylinder shaped, with flashing colors like greens and red but not our green and reds in front of it wher other cone shaped ships and more behind it, these moved quick, but the larger just coasted floated along. These cone ahape ones wher like playing with each other. Then above suddenly we saw 3 lights in a triangle shaped , light on each corner it moved up and down real slow and just turned (spun) around real slow it was huge you could see detail then it flew straight up as it turned and all the cone shaped ships disappear into it well it looked like that this event made my life hell when we spoke about it, so i stopped, ther was so much of them it was like they wher looking for the craft that shot down by my window they even shot down the street like they wher searching. I was so scared i literally pooped my pants, but i couldnt move our video camera died, so we had no footage, but it was an event in my life id never forget, but let me tell you this it was like an army scary if they wanted to and IF they had weapons on those ships we are screwed. I'll never,never forget I talked to a neighbor , he has been in this neighborhood for years he said that around 5 years prior he saw the same things scary we have moved since and never saw anything like that again, but every time i go out at night and its a clear sky sometimes u see in a distance the grey, small objects moving about I know what they are. I was not a believer untill that night in july."],"Log Number":"US-06222013-0015","Source":"MUFON","Tags":"City","Longitude":"-71.04659"}