{"Sighting Duration":"Undisclosed","Tags":"City","Source":"MUFON","Country":"United States","Summary":"Circular Pattern of multi-colored lights.","Region":"Pennsylvania","divs":["Sighting DetailsMy friend Chris and I were walking down the alley way between Garden and Mansion Streets. We were about a hundred feet from my house. I was walking him to his house. We joked with each other as we walked, then Chris said something that I didn't like, so I began chasing him. He hid under a box truck which was parked outside of the warehouse near by. It was night, so I wasn't going to follow him. Who knows what kind of animals were crawling around under the truck. I waited for a minute and looked skyward and sighed in anger. When I looked, I saw what I call a \"Flying Carousel\" I saw a pattern of multi-colored lights. The light moved around the object like Christmas chaser lights, only slower. I yelled for Chris and said. \"Chris, I'm not F%%king around, come out here and look at this.\" Chris emerged from under the truck and stood with me in the alley and we both watched the lights move northward until it was too far away we couldn't see it anymore. It didn't appear to have any structure only a circular pattern of lights. Note: I've seen a picture of something similar to this on various UFO television shows."],"trends":["There have been no other sightings in Pennsauken Township","This sighting has never been favorited."],"Log Number":"US-06232013-0010","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/48348.html.txt","/var/www/straped/mufon/org/48348.html"],"Viewing Distance":"101-500 Feet","Object Shape":"Circle","City":"Pennsauken Township","Latitude":"39.933726","Date of the Event":"08/17/2003 12:00 UTC","Case Number":"48348","Date Submitted":"06/23/2013 02:50 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.933726,+-75.062413(48348)&iwloc=A&hl=en\"> mufon case (48348) map </A>","Weather Factors":"Unknown","Longitude":"-75.062413","Object Flight Path":"Straight-line path","Object Features":"None"}