{"Source":"MUFON","Region":"Illinois","map":"<A HREF = \"http://maps.google.com/maps?q=41.581884,+-88.911139(48349)&iwloc=A&hl=en\"> mufon case (48349) map </A>","trends":["There have been no other sightings in Earlville","This sighting has never been favorited."],"Object Shape":"Disc, Oval, Saturn-like","City":"Earlville","Latitude":"41.581884","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Log Number":"US-06232013-0012","Longitude":"-88.911139","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/48349.html.txt","/var/www/straped/mufon/org/48349.html"],"Date Submitted":"06/23/2013 05:13 UTC","divs":["Sighting DetailsThis is an account of one of the several ufo sightings I have had in my life, I was 14 yrs old, and this was not the first. I was camping with my mom and step dad at Maple leaf Park camp ground in Earlville Ill during July of 1976. On one of the mornings just after breakfast, I decided to go swimming at the pond. I don't know why, but when I reached the beach area I picked up a small twig and began to draw a design in the sand. It wasn't much, just a 1 inch circle with a six inch triangle around it, then three dots just outside the flat lines of the triangle. I did this for three mornings on my way to swim. I still to this day can't remember why I traced these in the sand. Anyway, after I finished swimming on the third day I walked with a buddy of mine to the pool table house to shoot a few games of pool, and then we left. On our way back to the campsite some movement in the sky ahead caught my attention. As I watched I saw ten light gold colored discs flying in a triangle formation, moving between the cloud tops, right to left. I was walking east so I gathered that the objects where going north. All where identical and each had a darker orange band or stripe around the outer edge. They appeared to emit their own soft light and where a little fuzzy or blurred looking, sort of like a picture slightly out of focus. I watched for five to seven seconds and then I tapped my buddy on the arm, pointed to the sky and said \"Look at that!\", but when he looked up they where already behind the clouds and gone. He said, \"Look at what\". I stopped on the road and remember being a little upset that he didn't see what I did. I had a butterfly feeling in my stomach as the image of these things in my memory would just linger. They seemed to fly with a purpose. This is the third time I can remember seeing strange lights in the sky, I will write again to report the other times. Thank you, Robert L. Brown."],"Summary":"Formation of 10, luminous gold oval discs with perifferal orange band.","Weather Factors":"Unknown","Case Number":"48349","Object Features":"Patterned Surface","Sighting Duration":"Undisclosed","Date of the Event":"07/14/1976 12:00 UTC","Country":"United States","Disposition":"Unresolved"}