{"Summary":"saw about 18 glowing lights moving quickly from sw to ne and then dissapearing.","Country":"United States","Tags":"City","Log Number":"US-06232013-0008","Latitude":"42.023713","Viewing Distance":"Over One Mile","Date of the Event":"06/22/2013 11:30 UTC","Disposition":"Unresolved","Source":"MUFON","divs":["Sighting DetailsMy daughter and I were standing outside talking when she made an exclamation, what the hell? I turned and saw 3 glowing lights moving very quickly at what seemed a close and fairly low altitude. There were 2 lights forward of the third that was in the middle. These three lights were followed by two more at about a 2 or 3 second interval.the other lights seemed to follow at different intervals and slightly different altitudes, some higher some a little lower.they were all tracking from the sw to the ne. We would see the lights appear in the sw emerging from behind the trees at the end of the block but much farther away like a small plane would. They would then dissapear just slighty past what would be straight north.they were moving in the opposite direction of the way the clouds were moving in. In total we saw about 18 of them.they made no sound at all, my dad was a pilot and I was raised around planes of all sizes and commercial aircraft...these were not planes. No sound, no marker lights, no red or green strobes, also no chopper sounds like a helicopter. They seemed to pulsate an orange glow. They would ascend slightly just before dissapearing. I did get some footage with my digital camera but it is fuzzy and shaky. I got one with a very close zoom and maybe seemed to have a conical form but not sure. As far as my feelings and reactions...I do not think I have seen anything like this before and I watch the skies all the time, I think of my self as a star gazer...always on the lookout for a shooting star or the occasional satellite. This was very odd to say the least."],"Object Shape":"Fireball, Star-like","Object Features":"None","Longitude":"-88.335216","Case Number":"48346","files":["/var/www/straped/mufon/html2text/48346.html.txt","/var/www/straped/mufon/org/48346.html"],"Sighting Duration":"Undisclosed","Region":"Illinois","City":"Elgin","Date Submitted":"06/23/2013 02:24 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.023713,+-88.335216(48346)&iwloc=A&hl=en\"> mufon case (48346) map </A>","Object Flight Path":"Path with directional change","trends":["There have been 9 other sightings in Elgin","There were no other sightings in Elgin on or around June 22nd 2013"]}