{"Disposition":"Unresolved","Object Features":"Other","Object Shape":"Disc, Oval","Source":"MUFON","Country":"United States","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around July 16th 1995"],"Tags":"City","Latitude":"41.82705","Summary":"Waiting for bus when I noticed the two objects.","City":"Philadelphia","Longitude":"-80.467139","divs":["sighting detailsin the summer of 1995, i was 13. my late grandmother was taking my good friend bill and i to see batman forever in the theaters. as we waited for the septa bus at the corners of garden and beaver streets, in my home town of bristol, pennsylvania and noticed two asprin\\disc shaped objects which i thought were huge mylar balloons at first. there were two of them. these objects wobbled as if a mylar balloon would, however they were horizontal. there were two of them and one was slightly higher and further back then the other. i told my grandmom and bill to look and the three of us watched. the two objects moved over the row homes of garden street. once we reached the center of the street both objects hovered briefly, then began moving south toward philadelphia gaining altitude as they moved further away. during the bus ride to the movies. bill and i searched the skies, hoping to see them again, but we did not. when we got home later in the day, we told my late mother about what we saw and her reaction was. \"if my mother wasn't with you, i'd say you guys were nuts.\" this was only one of a few sightings, i've had. will submit the others. mike jordan."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.82705,+-80.467139(48345)&iwloc=A&hl=en\"> mufon case (48345) map </A>","Date Submitted":"06/23/2013 02:18 UTC","Log Number":"US-06232013-0007","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","Date of the Event":"07/16/1995 12:00 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/48345.html.txt","/var/www/straped/mufon/org/48345.html"],"Object Flight Path":"Path with directional change","Case Number":"48345","Region":"Pennsylvania"}