{"City":"Seattle","files":["/var/www/straped/mufon/html2text/48350.html.txt","/var/www/straped/mufon/org/48350.html"],"Sighting Duration":"Undisclosed","Source":"MUFON","Object Features":"None","Log Number":"US-06232013-0013","Date Submitted":"06/23/2013 05:13 UTC","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Region":"Washington","Object Shape":"Sphere","Viewing Distance":"Unknown","Case Number":"48350","divs":["Sighting Details I was not expecting to make another report so soon after a life altering sighting less than a week ago, yet here it is. As with the days ago sightings, I was on my porch smoking late at night, and sky-watching, which is something I've been doing a long time. Earlier in the day, knowing that a 'supermoon' was rising, I went out to observe it, and noted that 'chemtrails' were being laid in the night sky, which has been happening a lot lately. It is also maddening for star watchers like myself. I keep having the thought- Is there something in the night skies that someone does not want us to see? I am seeing a disproportionately high amount of odd phenomena on the very few clear viewing nights that have been available, and I don't exactly live outside and look constantly for these things. Odds are, I am seeing maybe 1% of what is out there, and yet I am still seeing a lot. I feel dutiful to report these sightings. For all I know, I or my partner and I, are the only ones in the whole city out there looking up in the middle of the night on a pretty regular basis. I hope we aren't the only ones. Please forgive the narrative...here's what I saw- The earlier haze was still in the sky, but most stars were now visible. I was facing West and just when I looked straight up, my eye caught an object rapidly moving East. I watched as it went straight overhead, and then without changing speed, abruptly changed direction in a rounded turn to the South, a turn far too fast and tight for any plane or jet to make. It was impossible to determine altitude, except that it appeared higher than the highest jets fly, and perhaps as high as satellites are. It was visually about the size of Mars, but very white. After it turned South I watched it until it eventually faded into the background haze, with total eye contact of aprox. 24 to 26 seconds."],"Country":"United States","Longitude":"-122.315383","Date of the Event":"06/22/2013 03:20 UTC","Latitude":"47.715795","trends":["There have been 110 other sightings in Seattle","There were no other sightings in Seattle on or around June 22nd 2013"],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=47.715795,+-122.315383(48350)&iwloc=A&hl=en\"> mufon case (48350) map </A>","Tags":"City","Summary":"Object travelling East turns South and fades into haze"}