{"Object Features":"None","Object Flight Path":"Path then hovering","Source":"MUFON","City":"Jefferson","Latitude":"36.420403","Date Submitted":"06/23/2013 02:12 UTC","Case Number":"48360","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=36.420403,+-81.473438(48360)&iwloc=A&hl=en\"> mufon case (48360) map </A>","Disposition":"Unresolved","Region":"North Carolina","Date of the Event":"06/22/2013 05:25 UTC","trends":["There have been no other sightings in Jefferson","This sighting has never been favorited."],"Tags":"City","files":["/var/www/straped/mufon/html2text/48360.html.txt","/var/www/straped/mufon/org/48360.html"],"Viewing Distance":"Over One Mile","Object Shape":"Star-like","Longitude":"-81.473438","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","divs":["Sighting DetailsThree of us, all adults, were talking out in the yard when a low passing plane caught our attention. Looking up we saw the plane pass and noticed a star light appearing object in the sky. It looked like a star at night with approximately the same brightness as the north star at night, however this was in broad daylight so the intensity must have been substantially greater. As we watched the light we saw it move an incrementally small distance and then stop. It repeated this process at least forty times in the more than half an hour we watched it. We finally lost it in the tree line. I am estimating the altitude to be at a minimum of 60,000' and the course from north to south from Wilkesboro, over Boone, and then south. Sky was clear in the area of observation but around the area were whispy clouds in strange patterns and unusual shapes looking like disconnected random mares tails (alto stratus)as well as repetitive ripples. I do not think the clouds we connected to the observation. We did not take any pictures realizing that it was too far away to provide any detail. I am a private pilot with 40 years experience and a local business man."],"Summary":"Observed a star like object in daylight with strange movements.","Log Number":"US-06232013-0023"}