{"divs":["Sighting DetailsI was camping at the lake (there were several people there but I was apparently the only person who saw this, which is very frustrating, but everyone else was doing something). I was sitting in my chair looking at the sky because the moon was so BIG that night and I was just taking in the scenery. The object appeared out of nowhere below the moon level but quite a bit above the treetops across the cove. It made no sound. It glowed with a greenish light and looked slightly flattened like a sideways oval. It made a whitish halo around it which could have been from the clouds. It moved from east to west for a few seconds and then disappeared again as suddenly as it appeared. It moved LEVEL. It was not falling like a meteor, it did NOT have a tail. I have seen many meteors or \"falling stars\" over the years and this looked nothing like that. This moved much too slowly and it was too big. I saw it, watched it for only a second and realized it was just weird so I opened my mouth to say \"Hey! Look at that!\" to my husband who was trying to start a campfire and had his back to what I was seeing, and before I could get the words out the object was gone. All I could say was \"Please tell me somebody else saw that...\" No one else did. I'd say that if I hadn't been looking at the sky when it happened, I probably wouldn't have seen it either. I stayed up late that night scanning the sky because I was hoping it would happen again so I could point it out- if other people could see it too then I'd know I wasn't nuts. It didn't happen again. As soon as we got home I started googling \"green meteor no tail\" and found this site. I just hope someone else out there saw what I saw. I had no idea what it was when I first saw it and I still don't. I don't know what to think because I've always been a bit of a skeptic about this kind of thing. I feel a little strange about submitting this report but I have to do something because it's been two days since it happened and I'm still a little shaken up."],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/48367.html.txt","/var/www/straped/mufon/org/48367.html"],"Sighting Duration":"00:00:03","Latitude":"35.219688","Weather Factors":"Unknown","Region":"Oklahoma","Date of the Event":"06/21/2013 09:30 UTC","Summary":"Green slightly flattened object appeared, moved east to west for about three seconds and then disappeared","Date Submitted":"06/23/2013 07:11 UTC","Longitude":"-97.257194","Object Flight Path":"Straight-line path","Tags":"City","Country":"United States","Disposition":"Unresolved","Log Number":"US-06232013-0030","City":"Norman","Viewing Distance":"Unknown","Object Features":"None","trends":["There have been 22 other sightings in Norman","There were no other sightings in Norman on or around June 21st 2013"],"Object Shape":"Oval","Case Number":"48367","map":"<A HREF = \"http://maps.google.com/maps?q=35.219688,+-97.257194(48367)&iwloc=A&hl=en\"> mufon case (48367) map </A>"}