{"Weather Factors":"Unknown","Object Flight Path":"Straight-line path,Path with directional change","Tags":"City","Latitude":"43.580534","trends":["There have been 20 other sightings in Mississauga","There were no other sightings in Mississauga on or around June 21st 2013"],"Region":"Ontario","map":"<A HREF = \"http://maps.google.com/maps?q=43.580534,+-79.769493(48364)&iwloc=A&hl=en\"> mufon case (48364) map </A>","Source":"MUFON","Case Number":"48364","Longitude":"-79.769493","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Country":"Canada","Viewing Distance":"Over 1 Mile, Unknown","Summary":"Orange Red - Lantern-Like Objects Flying In Formation","Date of the Event":"06/21/2013 10:40 UTC","Log Number":"CA-06232013-0027","Object Features":"Unknown","Date Submitted":"06/23/2013 05:05 UTC","City":"Mississauga","files":["/var/www/straped/mufon/html2text/48364.html.txt","/var/www/straped/mufon/org/48364.html"],"Object Shape":"Star-like","divs":["sighting detailsit was around 10:35 or 10:40pm est in north mississauga, ontario was reading in bed and noticed between the california blind slats a large orange light. at first i thought it was a flare. i rushed to the window. i tried to take pictures, but my digital camera could not focus and was getting the screen and was not working. i did then run out and tell my wife...jumped on our wooden deck and watched the last object trail behind the formation. i think the event, when i checked my watch officially ended at 10:45pm or so. below is what i wrote minutes after the event: \"....a few min ago i spotted 4 lantern like objects from my bedroom window - orange glow moving slowly and silently from n to nw direction. low on the horizon in a staggered formation...if anyone else has seen this let me know...squarish lantern-like object with steady fire-orange light - no flash or strobe....\" the day after i contacted yyz airport operations - lester b pearson. it was their first call of this nature according to the help desk (airport ops). i asked if i could get any radar confirmation of aircraft giving off a locator beacon flying in the milton \\ n. mississauga between 10:40 and 10:45pm june 21st. the person said that he would ask the \"tower\" to see if that information was available. if the radar saw objects but no locator beacon i thought we would have some kind of confirmation. i said the lights (lantern-like objects) moved in formation, silently northward and across what seemed to be from my perspective four or five house-tops - then turned into the clouds and disappeared in the northwest direction. when they turned there was no change in lighting...again..the fire red lantern-type illumination persisted. no fade, or change in light or exhaust indication. there was an ever-so-slight greyish out-line that made it look square and hence the lantern reference. the objects just moved in what appeared to be a northwest direction into the clouds - but its lighting characteristics did not change - it remained orange-red until it was covered by cloud. i have lived outside the yyz west-bound air-path for 12 years and know the local air traffic well. this was like nothing i had ever seen - nor could explain. if a regular jet line was a single dimension in size (white head-lights, flashing lights etc upon approach) this orange light was 4 to 5 times that size. it was just above the house-tops - so a 45 degree angle. distance and speed hard to tell, but it moved across my horizon - perhaps 6 house tops within a few minutes - under 5000 ft moving at a few hundred miles an hour? what made it stand out - it was large, flew in formation, silent and brighter than a jet-liner, lantern-like. it think it would be pretty-well impossible for anyone standing in the back-yard looking up to have not seen these lights. i don't know if it was some summer solstice festivel or a special terrestrial craft. i'd like to have a corroborating sighting or news from yyz radar. again, it would be impossible for radar not to seen these objects if they were airborne vehicles."]}