{"Source":"MUFON","divs":["Sighting Detailsmy dad was driving to work (he is a new paper deliver to jasper) the UFO crossed right in front of him in the high way, he said it was about 10 feet off the ground, he said it was a size of a house. but he didn't really see the object since it just looked like a blinding ball of light. he stopped in the middle of the road and took his camera out (he carry's it with him so when he goes to jasper he can take pictures of the wildlife) he started to film the UFO, but then he realized he had to pull over to the start of the road, for safety reasons. witch was the nothing but black part of the video. he stepped out ans started to film it. someone say him standing out with the camera, he soon pulled over and started to watch with him, then more and more people stopped. the UFO seemed to dart all over the sky coming closer then far away, it had to lights they would change colour every so often, between red, blue and green. the clolurs blinded into each other, but when it was on it side you could clearly see there was two lights. at some point of the video you could see faintly another one following it, my father said he never saw it until he look at the video. my dad got 4:43 mins of it, he had to leave to go do his job. the video camera is a little old so the video looks a little fuzzy, and it couldn't focus on the UFO since it moved to quickly. my dads friend Neal, once said saw something like this when he was child a long time ago, he said his father woke him up to go see it and he described the UFO, that sound quite like we saw. he said it stayed around for about half an hour, then quickly darted off. i also saw a UFO once it was around 5:00am, sadly i don't remember what the date was but i do know it was in 2012. when i had just started school. i was in my bed room, i happened in glance out of the window (it's very rare for me, since i tend to shin the sun like a goth) this one had 6 with lights witch where in circle, it was big about the size of a golf ball. witch i guess pretty big for being in the sky, but i saw nothing else the rest of it seem to match the sky. i was looking out my window when all of a sudden it appeared, seemly out of the blue then zoomed out way faster than any plane i've seen, and i never saw it again."],"trends":["There has been one other sighting in Edson","There were no other sightings in Edson on or around June 23rd 2013"],"Object Shape":"Circle","Weather Factors":"Unknown","Region":"Alberta","Date Submitted":"06/24/2013 12:58 UTC","Date of the Event":"06/23/2013 02:15 UTC","Case Number":"48380","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=53.5835,+-116.434502(48380)&iwloc=A&hl=en\"> mufon case (48380) map </A>","Sighting Duration":"Undisclosed","Summary":"Cricle object with, red gren blue lights","Latitude":"53.5835","City":"Edson","Viewing Distance":"21-100 Feet","Longitude":"-116.434502","Country":"Canada","Disposition":"Unresolved","Log Number":"CA-06242013-0006","files":["/var/www/straped/mufon/html2text/48380.html.txt","/var/www/straped/mufon/org/48380.html"],"Tags":"City","Object Flight Path":"Hovering then path"}