{"City":"Prescott Valley","Longitude":"-112.308736","Object Flight Path":"Path with directional change","Country":"United States","Tags":"City","Date Submitted":"06/24/2013 10:50 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.668905,+-112.308736(48387)&iwloc=A&hl=en\"> mufon case (48387) map </A>","Summary":"Unknown aerial object flew into a following vapor train in othereise empty sky and never reappeared.","Latitude":"34.668905","Log Number":"US-06242013-0013","Object Shape":"Oval, Sphere","Case Number":"48387","Sighting Duration":"00:17:00","Weather Factors":"Unknown","divs":["Sighting DetailsOn the morning of the 23 June 2013 I was on my front porch that faces East. The time was around 7:45 am. MST. I noticed in the sky to the East a short vapor trail that looked like a typical trail except it was all by itself in the sky and was squared off at both ends. It was about 7 or 8 times as long as it was wide. I got curious and went and got a pair of 10x50 binoculars. I looked at the trail and noted a bronze colored sphere at the south end in the clear part of the sky. The sphere's angle changed and it appeared somewhat oval. It appeared to have been going in a Southerly direction and was responsible for the contrail. The object was stationary when I saw it however. Then it changed direction did a 180 deg. turn and went back into the contrail. Since the contrail was alone in the sky and short in length, I expected the object to emerge from the other side. I observed the contrail for a number of minutes, 7:48-8:05 am MST. The object never reappeared. I checked at various distances from the contrail but saw nothing but blue sky. The object had gone back into the contrail and did not come out. Slowly the contrail lengthened due to upper atmosphere winds and still no sign of the object. Whatever it was it was not an airplane nor a weather balloon. No airplane etc. was involved in this event in any way. To put it another way the contrail \"swallowed up\" the object as the object never reappeared after going into the contrail. There was clear blue sky all around the contrail and object at the time of the sighting. I would request that the investigator who worked on case ##47275 do a follow up on this event as well."],"Source":"MUFON","Date of the Event":"06/23/2013 07:48 UTC","Object Features":"Unknown","trends":["There have been 12 other sightings in Prescott Valley","There were no other sightings in Prescott Valley on or around June 23rd 2013"],"Disposition":"Unresolved","Region":"Arizona","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/48387.html.txt","/var/www/straped/mufon/org/48387.html"]}