{"Object Flight Path":"N/A","Longitude":"-87.768538","divs":["Sighting DetailsI was sleeping, something woke me up for a second. I tried to go right back to sleep but my right hand was hurting. It started to hurt more and more, until it hurt severely. I sat up and looked at my hand under my phone light. What I saw Made me say no no no, there was A pencil eraser sized incision in the middle of my palm The skin wasn't removed there was still a small like the point of a pencil sized piece of skin still attached to my hand. It had an Orange liquid around the incision and a like liquid band aid shiny like glass, ultra transparent and clear liquid over it all the size of a dime. I couldn't believe what I saw. I had an overwhelming urge to go back to sleep I couldn't it hurt, I had to look at it again. I didn't want to look at it again. I looked at it again, I knew it was not normal. I knew this was serious and real. I tried to wake up my boy friend, I told him \"Get up!, there's a hole in my hand!\" I was smacking his shoulder, He said \"Go back to sleep there is nothing wrong with you.\" He would not look at my hand. All I wanted to do was go back to sleep. I looked at it for the third time and just shook my head and said \"This is nuts!, This is crazy! The cat must've did that.\" I laid back down and just would not believe what I was seeing. The overwhelming urge to go back to sleep prevailed. Why I didn't take a picture, Why didn't I wake anyone else up, Why I didn't touch it. I don't know. It was unbelievable. I woke up the next morning not thinking of it at all, not remembering anything. Until my boyfriend woke up, And said \"Oh yeah, (Sarcastically) What happened to the hole in your hand?\" All of a sudden I remembered it all, I looked at my hand immediately. Not a trace of it was there. I know what I saw, and I don't think there has been a day since then that I don't think about it, worry about it, and am freaked out about it. I've tried telling a few close friends and family. They don't even want to hear it. They tell me it didn't happen. I know what happened, I know what I saw, I know it was real. It was a surgical perfect incision with strange liquid. I want to know what happened to me, If this has happened to anyone else. In finishing I wasn't not supposed to see that."],"Object Shape":"Circle","trends":["There have been 15 other sightings in Tinley Park","There were no other sightings in Tinley Park on or around October 15th 2011"],"Weather Factors":"Unknown","Summary":"Awakened by pain in my right hand upon looking circular surgical incision with orange liquid around it and a shiny glass liquid over it all.","Date of the Event":"10/15/2011 04:35 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/48398.html.txt","/var/www/straped/mufon/org/48398.html"],"Log Number":"US-06242013-0024","Case Number":"48398","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.578374,+-87.768538(48398)&iwloc=A&hl=en\"> mufon case (48398) map </A>","Region":"Illinois","Tags":"City","City":"Tinley Park","Latitude":"41.578374","Viewing Distance":"N/A","Country":"United States","Disposition":"Unresolved","Date Submitted":"06/24/2013 07:59 UTC","Object Features":"Unknown"}