{"Weather Factors":"None","Summary":"3 glowing orange objects emmitting red balls of light","Country":"United States","Latitude":"36.46154","Disposition":"Insufficient Data","Log Number":"US-05242006-0001","map":"<A HREF = \"http://maps.google.com/maps?q=36.46154,+-77.654146(4839)&iwloc=A&hl=en\"> mufon case (4839) map </A>","Viewing Distance":"21-100 Feet","Object Features":"Window(s)","Date Submitted":"10/22/1968 12:00 UTC","Case Number":"4839","Object Shape":"Disc","Longitude":"-77.654146","Object Flight Path":"Hovering then path","Region":"North Carolina","Date of the Event":"10/22/1968 12:00 UTC","trends":["There has been one other sighting in Roanoke Rapids","There was one other sighting in Roanoke Rapids on or around October 22nd 1968","This sighting has never been favorited.",""],"divs":["Sighting Detailsmy father(anonymous) and his freind larry shearin, who was an air force fireman at the time, were out deer hunting on the roanoke river(in a power boat) at night that fall. they observed, for quite some time, three metallic objects, glowing orange. larry states that he could see them \"change\" into the saucer shape right before his eyes. they hovered for some time 25 yards away. larry and my father were hiding underneath a weeping willow tree, and actually observed them through the scopes of their 7mm magnums for, what larry said to be, forever. it's hard to tell how long because the sheer strangness of what they were witnessing could have made their time estimates horribly innaccurate. larry said they released 10 or 12 glowing red balls that descended and lit up the forest. he said he could here them whisling as they originally approached, and \"winding up\" with a crescendous wail before flying off and meeting high in the sky. he said the red balls stuck around longer, but eventually sped off into sky and were absorbed by one of the crafts. he then said, they disappeared into space in the blink of an eye, and were gone. larry's story also reeks of missing time. they said they couldn't believe that it was so late(early in the morning) when they made it back to camp. a game warden was waiting for them when they arrived and was \"absolutely berzerk\" after witnessing them himself. i have a wonderful recording of larry shearin telling the story. it is absolutely fantastic. i seriously doubt that they would ever make something like this up. i have taken this as fact every since i first heard the story when i was a little boy. this is actually the only reason i believe so deeply in the alien phenomenon. i am currently writing a novel with the sighting as the basis. if anyone can help me find out more about this type of sighting, i would be greatly relieved. can anyone shed any light on what the \"red balls\" may have been, and what their function might have been? i would gladly send in the recorded version of this story. i have no doubt that this is a primary document concerning a very real ufo encounter. the missing time possibility especially disturbs me, because i was my fathers first child 5 years later. i know that people report genetic manipulation, and the aliens are always portrayed to find the reproductive organs especially important. just a paranoid thought, but i think you get the picture. ANY info would again be greatly appreiciated. feel free to email me at grassisblue@hotmail.com if you would like to hear the recording. parham howell II"],"Source":"MUFON","Tags":"City","files":["/var/www/straped/mufon/html2text/4839.html.txt","/var/www/straped/mufon/more/4839_submitter_file1__whoa5.JPG","/var/www/straped/mufon/org/4839.html"],"City":"Roanoke Rapids","Sighting Duration":"Undisclosed"}