{"Log Number":"US-06242013-0016","Weather Factors":"Unknown","Object Features":"Unknown","Source":"MUFON","Longitude":"-73.94292","Latitude":"40.6582","map":"<A HREF = \"http://maps.google.com/maps?q=40.6582,+-73.94292(48390)&iwloc=A&hl=en\"> mufon case (48390) map </A>","Region":"New York","files":["/var/www/straped/mufon/html2text/48390.html.txt","/var/www/straped/mufon/more/48390_submitter_file1__IMG0079.JPG","/var/www/straped/mufon/more/48390_submitter_file2__IMG0080.JPG","/var/www/straped/mufon/org/48390.html"],"Sighting Duration":"Undisclosed","Tags":"City","Date Submitted":"06/24/2013 11:28 UTC","Object Flight Path":"Other","Date of the Event":"06/22/2013 09:30 UTC","Disposition":"Unresolved","Viewing Distance":"Unknown","divs":["Sighting DetailsI was outside making a video of the moon. The previous night I made one and the moon was pulsating with a mechanical sound, I wanted to see if it would happen twice. It pulsated briefly but not as before. Similar to the night before I saw a very bright star that was moving this time from east to northwest, I tried to capture it on video but it went in the direction of the moon and disappeared. So started taking pictures, when I looked into the camera while holding down the button I saw a small bright object to the left of the moon I snapped several pictures. the object appeared only in the first, it appeared as though it was moving. I'll attach a photo of the Object in IMG 0079, the following photo IMG 0080 doesn't show the object. I don't know what happened to the object. I felt o.k because I have seen these things before. I had a very close sighting with a large Object a few years ago that shook me up. This object was very low very large, looked like something out of startreck movie, but now I'm not scared anymore. I realize that they somehow connect to thought, whenever I think about them I usually see them shortly. And I have had contacts with different types of beings, mostly while asleep.I've gotten over the fear so now I'm able to mention it."],"Case Number":"48390","Summary":"I saw a glowing object going towards the moon looking like a ball of light","Object Shape":"Circle","Country":"United States","City":"New York","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around June 22nd 2013","This sighting has never been favorited.",""]}