{"Log Number":"US-06242013-0021","map":"<A HREF = \"http://maps.google.com/maps?q=41.952242,+-71.694184(48395)&iwloc=A&hl=en\"> mufon case (48395) map </A>","Case Number":"48395","Object Flight Path":"Hovering then path","trends":["There have been no other sightings in Pascoag","This sighting has never been favorited."],"Region":"Rhode Island","Viewing Distance":"20 Feet or Less","Summary":"overcast skies, temp in the 60's, noticed a red glow in trees about 20 feet up from ground level in a heavily treed area. rural, no street lights. Lasted about 20 minutes and it seemed to be performing acrobatics for me. left suddenly.","Sighting Duration":"Undisclosed","divs":["Sighting DetailsWalked out into the night on my porch and noticed something glowing in the trees in the back of the property. There are no street lights and it is very dark. The night was overcast. the object was hovering about 20 to 25 feet above the ground in a very treed area. There is nothing in the back of the property this is very rural with a lot of trees. It was glowing red and seemed to have some spots between the glowing lights meaning it was not dense. Decided to take some pictures and went inside the house to upload them. The pictures reflected white glowing objects in different shapes, note, I was seeing a red glowing object not white it seemed it was performing tricks for me. I went back outside and took more pics and then it suddenly broke up into 3 smaller white objects and disappeared. The digital pic of #240 is really the most interesting and you may have to play with the zoom ect to get it in focus. I would really like some feedback on this please."],"Weather Factors":"Unknown","Disposition":"Unresolved","Object Features":"Other","files":["/var/www/straped/mufon/html2text/48395.html.txt","/var/www/straped/mufon/org/48395.html"],"Tags":"City","Latitude":"41.952242","Date of the Event":"04/01/2013 12:00 UTC","Longitude":"-71.694184","Date Submitted":"06/24/2013 03:50 UTC","Source":"MUFON","City":"Pascoag","Country":"United States","Object Shape":"Circle, Sphere"}