{"Longitude":"-121.012501","divs":["Sighting DetailsMy wife and I and a friend were standing outside of our recording studio after a jam session and we noticed a bright star below the big dipper. We looked at it a about 30-seconds and then it just vanished into thin air. About five minutes later, a star-like glowing object traveling South-East went right above our heads and then made an abrupt right turn, changing direction now going South. The object then passed between two stars and when it did, the object and the two stars disappeared. Right before it disappeared, it ejected something out the back. I was filming at this point and caught the object on video (clip provided). Not more than three minutes later, we observed the same type of object in the sky West of us and it traveled North for about five seconds and then disappeared into thin air. This one I did not get on film. My friend that was with us is a scientist and an astronomer and he said that is was not a satellite or the I.S.S., but indeed was something unexplainable."],"Object Shape":"Sphere","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Summary":"I was standing outside of our recording studio when all of a sudden a glowing object appeared out of nowhere.","files":["/var/www/straped/mufon/html2text/48391.html.txt","/var/www/straped/mufon/org/48391.html"],"Country":"United States","trends":["There have been 10 other sightings in Grass Valley","There were no other sightings in Grass Valley on or around June 21st 2013"],"Source":"MUFON","Weather Factors":"Unknown","Case Number":"48391","Tags":"City","Sighting Duration":"00:03:10","Log Number":"US-06242013-0017","City":"Grass Valley","Region":"California","Date Submitted":"06/24/2013 12:13 UTC","Date of the Event":"06/21/2013 11:12 UTC","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=39.218616,+-121.012501(48391)&iwloc=A&hl=en\"> mufon case (48391) map </A>","Latitude":"39.218616","Object Flight Path":"Path with directional change"}