{"Object Flight Path":"Path with directional change","Longitude":"-93.728093","Region":"Louisiana","Case Number":"48392","City":"Bossier City","Object Features":"None","Country":"United States","files":["/var/www/straped/mufon/html2text/48392.html.txt","/var/www/straped/mufon/org/48392.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.521755,+-93.728093(48392)&iwloc=A&hl=en\"> mufon case (48392) map </A>","trends":["There have been 8 other sightings in Bossier City","There were no other sightings in Bossier City on or around June 23rd 2013"],"Disposition":"Unresolved","divs":["Sighting DetailsAt 2100I was standing outside with my wife looking at the supermoon rising in the east, when I saw an unusual orange-reddish light due NW that brighter than any stars or antenna masts markers in the sky. It was slightly moving N-NW , then stopped for about 45sec, then traveled SE, then changed direction instantly moving NNW again, it was at an unknown distance, but no more than a mile or two away at a 45 degree angle. It's orange red color was steady for about 3 minutes while traveling NNW, then became a little dimmer as it changed direction south, then dimmed and resembled a star for a minute and was stationary, then became even brighter and began traveling NNW again. But not as fast as it was originally for about 2 minutes. The light then dimmed and resembled a star for about 3 minutes, then disappeared entirely. My home is directly above the landing path for Barksdale AFB, and being prior military and having B-52s and all kinds of other planes flying and approaching at all times of the day and night I a certain this was not a plane or jet. There is no jet engine or strobe light in the world that can put out the light we saw, or move and hover like this. My wife and I had our suspicions about the UFO, but on my way to work the next morning the local radio station KVKI DJ was talking all morning abouta UFO that approached Barksdale AFB airspace, the tower hailed it 3 times to no avail and dispatched fighters. Who knows what they saw, but this area, particularly the AFB has had numerous sightings over the past few years & with the base housing half of our nuclear bombs & missiles, why not come check it out? I have seen some weird things in my life in thesky as I work outside in remote locations, but nothing like this before."],"Date Submitted":"06/24/2013 01:32 UTC","Date of the Event":"06/23/2013 09:09 UTC","Sighting Duration":"Undisclosed","Source":"MUFON","Tags":"City","Log Number":"US-06242013-0018","Latitude":"32.521755","Weather Factors":"Unknown","Object Shape":"Flash","Viewing Distance":"Unknown","Summary":"Aerial multiple-lights"}