{"Weather Factors":"Unknown","City":"Sacramento","Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/48397.html.txt","/var/www/straped/mufon/org/48397.html"],"Date of the Event":"06/13/2013 12:00 UTC","Country":"United States","Disposition":"Unresolved","Region":"California","Source":"MUFON","divs":["Sighting Detailson june 13 about 2;30-3;00 I went in to soak my legs in the bath tub. I got in and laid back. there is a large window next to the tub and we keep the blinds at an angle so we can look out and see the sky. I was watching the birds outside and a passenger jet went over. we are over the takeoff pattern for sacramento airport for jets heading east. then about 2 minutes after the jet flew past I noticed a triangle object in the sky. at first I thought it might be a bird, however there was no division between the body and wings. this was just a triangle. also at the height it was, a bird wouldn't have seemed to be going so fast and its heading was perfectly straight. it looked to be about 3 times the height of the jets that fly over our house look to be. it was going from east to west so it was flying against the normal jet traffic, but like I said it was much higher in the sky. it was a dull slate gray or black in color, and it seemed to have a circle on the bottom. honestly I can't say it wasn't a b-117 fighter although I see jets of all types where we live and I have never saw a b-117.there are air force bases all around sacramento so I cant really count this out, but if it was a b-117 he was headed some where awful fast. the duration was about 3 seconds..."],"Log Number":"US-06242013-0023","Object Features":"Other","Tags":"City","trends":["There have been 83 other sightings in Sacramento","There were no other sightings in Sacramento on or around June 13th 2013"],"Latitude":"38.642955","Date Submitted":"06/24/2013 07:54 UTC","Case Number":"48397","Summary":"dull blackish triangle moving extemely fast near sacramento airport","map":"<A HREF = \"http://maps.google.com/maps?q=38.642955,+-121.539627(48397)&iwloc=A&hl=en\"> mufon case (48397) map </A>","Sighting Duration":"Undisclosed","Object Shape":"Triangle","Longitude":"-121.539627"}