{"Sighting Duration":"Undisclosed","Object Features":"Unknown","Weather Factors":"Unknown","Summary":"3 very brightredish-orange lights, then a single white flew out to the north then came back inside the other 3.","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/48396.html.txt","/var/www/straped/mufon/org/48396.html"],"Tags":"City","Region":"Kansas","Case Number":"48396","City":"Kechi","Latitude":"37.794628","Object Flight Path":"Stationary,Path with directional change","Disposition":"Unresolved","Date Submitted":"06/24/2013 07:39 UTC","trends":["There has been one other sighting in Kechi","There were no other sightings in Kechi on or around June 24th 2013"],"divs":["Sighting DetailsWell I live in kechi,ks and was wondering if anyone had reported seeing an object in the early hrs on June 24th. This was approximately 1:oo am , if looking straight up it would have been 5 to 10 degrees to the south and 15 degrees to the west. I was letting the dog out, and looking at the stars when I noticed this object, which I do not think was in our atmosphere. It appeared to be in space, but had to be very large. There were 3 orange to amber lights, very bright. I watched it for 5 min or so, then wondered if my eyes were playing tricks on me. So I closed my eyes and counted to 60 very slowly, then looked again. Lights were still there. So I watched for a few more minutes, then a smaller white light come out of it, flying straight north. with incredible speeds. It then made a u turn, and flew back to the 3 other lights. I am one of those skeptics from being in the military (usmc), knowing the gov and military have plenty of aircraft the public has no knowledge of. I believe that 99.99 percent of sightings is just unknown manned aircraft. But there is no way this could fall into that category. This was most definitely in space. And had to be extremely large. I would be interested in hearing if anyone else had seen this object. Thank you,"],"Viewing Distance":"Over One Mile","Country":"United States","Longitude":"-97.282929","map":"<A HREF = \"http://maps.google.com/maps?q=37.794628,+-97.282929(48396)&iwloc=A&hl=en\"> mufon case (48396) map </A>","Source":"MUFON","Log Number":"US-06242013-0022","Date of the Event":"06/24/2013 12:00 UTC"}