{"Object Features":"Unknown","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around June 19th 2013"],"Latitude":"40.716843","Log Number":"US-06252013-0001","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/48405.html.txt","/var/www/straped/mufon/org/48405.html"],"City":"New York","Country":"United States","Source":"MUFON","divs":["sighting detailswent outside to check if decorative solar yard lights were charged up and on in front of yard at about 2245. sky was clear and i was admiring the few constellations i could see which is not often due to the city light pollution. what caught my attention was a black smudge moving north from the south in the sky but i thought it was possibly a smudge on my reading glasses so i removed them (i have 20\\20 distant vision). as it passed quickly and silently overhead (at about the altitude of an aircraft) i could make out very dim blue\\gray spheres of light on each side of it. it was a black triangle with round lights, barely visible, two on each side with one in the front for a total of five, but none on the rear. the rear of it was not defined. it happened too quick for an attempt to capture it on camera. i banged on my front door for a family member to come witness this with me, but it was too late. it happened within 30 seconds. it was very fast and silent and blended in with the evening sky and the lights did not become apparent until it began to pass away from me. it was troublesome to post this as i am not a ufo fanatic, however, i realize the importance of reporting these events and i find it hard to believe that this was man-made. i was in awe and not at all afraid."],"Object Shape":"Chevron, Triangle","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Tags":"City","Case Number":"48405","Date Submitted":"06/25/2013 01:26 UTC","Region":"New York","Object Flight Path":"Straight-line path","Summary":"Black triangle with dim blue lights on each of two sides and one at the front, no lights on rear","Date of the Event":"06/19/2013 10:45 UTC","Longitude":"-74.004213","map":"<A HREF = \"http://maps.google.com/maps?q=40.716843,+-74.004213(48405)&iwloc=A&hl=en\"> mufon case (48405) map </A>"}