{"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/48400.html.txt","/var/www/straped/mufon/org/48400.html"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=50.274155,+-119.28214(48400)&iwloc=A&hl=en\"> mufon case (48400) map </A>","Latitude":"50.274155","Object Flight Path":"Path with directional change","Date of the Event":"08/19/2011 12:00 UTC","Longitude":"-119.28214","Case Number":"48400","trends":["There have been 4 other sightings in Vernon","There were no other sightings in Vernon on or around August 19th 2011"],"Object Features":"None","Tags":"City","Viewing Distance":"21-100 Feet","Disposition":"Unresolved","Object Shape":"Oval, Sphere","Date Submitted":"06/24/2013 09:47 UTC","divs":["Sighting DetailsI decided to go outside one evening around 8:30 9:00 PM I wheeled ouside our lobby and stoped at an incline i leaned back to strech and thought i saw a lite up abouve in the sky. I leaned back a second time to have a better look. What i saw next scared the crap out of me, I looked around quickly for people there was no one. I yeld 2 or three times for attention. I then started to observe them. I remember wishing i had brought my phone to call police and was still qite frightend. I started straining to make details of the 3 sphears moving very slowly south. I estime the size to be 12 to 14 feet in diamiter, Transparent and dimly aluminated. Two were close together and slowly sircling each other the sircling slowed stoped then reversed direction. The third was farther away anf fallowed the other two. They were moving very slowly south 4 Km per hour. No sound at all. I estimate they were about 80 to 100 feet from me almost directly over head at first. I looked around for people once more and was frustrated and still afraid. They slowly went behind the building next door. I thought of wheeling down to the street to fallow but it was dark and i was alone and just to afrade."],"Region":"British Columbia","Summary":"3 12' to 14' foot dimly aluminated transparent ball like. two manuvered","Log Number":"CA-06242013-0026","Sighting Duration":"Undisclosed","City":"Vernon","Country":"Canada"}