{"Sighting Duration":"Undisclosed","Case Number":"48409","Weather Factors":"Unknown","Object Shape":"Unknown","Viewing Distance":"20 Feet or Less","trends":["There have been 27 other sightings in Evansville","There were no other sightings in Evansville on or around December 11th 2005"],"City":"Evansville","Date of the Event":"12/11/2005 10:15 UTC","Date Submitted":"06/25/2013 12:18 UTC","Tags":"City","Source":"MUFON","Region":"Indiana","map":"<A HREF = \"http://maps.google.com/maps?q=37.973769,+-87.565(48409)&iwloc=A&hl=en\"> mufon case (48409) map </A>","Object Features":"None, Other, Unknown","Longitude":"-87.565","Disposition":"Unresolved","Summary":"Ufo hovering above house, two straight beams of circular light not like a flashlight came from above house out of blackness.","divs":["Sighting DetailsI was watching television and I heard something outside on the porch deck. I thought maybe there was somebody outside. So I walked slowly over to the back door leading to the deck and checked to see if it was locked. It wasn't so I locked it. I then sat on the couch to look out the row of windows to see if someone was on the deck outside and then I looked to see if somebody was in the yard behind our house. All of a sudden a beam of circular light appears 6 feet away from me onto the deck. It was about 1 foot in diameter. The beam was not like a flashlight or a dull porch light. It was bright white almost too bright I couldn't even see the color of the deck anymore. I watched one of our cats run around one of the lights as if it was scared. Then another light appeared exactly the same as the first, the second beam of white light appeared about 3-4 feet from the first beam of light. They both were stationary, I just stared and I had no clue what these lights were, because I knew they were different than any lights I had ever seen. So I started looking up and the lights were coming from darkness in the sky right above the house. I knew what I was seeing was not possible or was very rare to ever happen, and then the thought of aliens and UFO popped in my head. I tried my best to study the beam of light and how it could be so perfect and straight. It was as if the light came from its source and then there was no trace of it leading to the circle itself but there it was a circular beam of white light. I watched the first light disappear, and after that I ran away from the windows. Now that I think about it I have a theory of what this possibly was. What if there was aliens visiting earth and the beams were there to pick them up to beam or materialize the aliens back to the ship. The cat was scared so maybe the cat sensed or saw the aliens they could have been invisible and beamed up to the UFO. Just like in star trek how the people would stand on the white circle to be beamed down to the surface of a planet."],"Country":"United States","Latitude":"37.973769","files":["/var/www/straped/mufon/html2text/48409.html.txt","/var/www/straped/mufon/org/48409.html"],"Object Flight Path":"Stationary","Log Number":"US-06252013-0005"}