{"Date Submitted":"06/25/2013 09:50 UTC","trends":["There have been 17 other sightings in Stuart","There were no other sightings in Stuart on or around June 23rd 2013"],"Object Flight Path":"Stationary","Case Number":"48408","Longitude":"-80.189886","Country":"United States","Region":"Florida","Summary":"We saw the lights from our bedroom window at about 11:45PM","Date of the Event":"06/23/2013 11:45 UTC","Object Features":"Unknown","Source":"MUFON","Tags":"City","divs":["Sighting DetailsI saw my wife looking out the bedroom window and questioned her about what she saw. She said there was a light in the north sky that had not moved for several seconds. I saw it and got my binoculars to get a closeup view. What I saw was 2 horizontal rows of 4 lights each. They were like :::: I also noticed what looked like a reflection off shiny metal around the lights. I handed the binoculars to her and she could not find the light. While I was trying to help her find it, I looked away for a few seconds. When I looked back, it was gone. She said she saw a blue flash near the ground and then the light was suddenly in the SE sky. Then it disappeared. I was excited to see what I believe was a UFO because I have been a believer for many years. My wife has always been skeptical and she was quite shaken about what she saw. I think her attitude may have changed. I forgot to mention that when my wife first saw the lights with her naked eye she saw a different light pattern. :: :: I hope you get the idea. . . . The lights were closer together, but this is the general pattern."],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Shape":"Cylinder","Latitude":"27.11843","files":["/var/www/straped/mufon/html2text/48408.html.txt","/var/www/straped/mufon/org/48408.html"],"Viewing Distance":"Unknown","Disposition":"Unresolved","City":"Stuart","Log Number":"US-06252013-0004","map":"<A HREF = \"http://maps.google.com/maps?q=27.11843,+-80.189886(48408)&iwloc=A&hl=en\"> mufon case (48408) map </A>"}