{"Tags":"City","Region":"Wyoming","Log Number":"US-06242013-0027","trends":["There have been 3 other sightings in Jackson","There were no other sightings in Jackson on or around June 2nd 2013"],"divs":["sighting detailsme and my partner were flagging traffic for a highway maintenace project washing bridges near the teton county \\ sublette county line along u.s. 191. the water truck had gone back for another load of water and we were waiting for them backed into a pull out listening to the last few minutes of rush limbaugh and eating our box lunch. it was a clear blue wyoming sky with just 3 or 4 puffy normal looking clouds you could see change shape as they went down wind (south). then i happened to see the object and said \"what the f#@k is that? it looked exactly like one of those parasail parachutes, white, the top maybe a bit brighter white than a normal parasail, and it cast a shadow on its underside like it was hollow on the underside. it was about a quarter mile away from us and above the horizon of the red creek drainage, outlined in the blue sky. a pilot of a parasail at that range, he and his rigging would have been clearly visible. my partner frantically tried to find his binoculars to no avail. it moved across the wind to the south west at a slow rate of speed, and went behind the mountain top. we then drove up the highway to see if we could see where it went, but never got another look at it, as the trees were too tall. i tried to theorize what it was. \"could it be a piece of plastic caught up in a up draft from a construction site? no, it did not change shape of any kind, it just moved horrizontally across the prevailing wind, and out of sight. then i remembered i had a cell phone and could have taken a picture. as homer simpson says, \" dough! !\".my question to your site is \"has anyone else seen something like this?\" t"],"Source":"MUFON","Disposition":"Unresolved","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/48401.html.txt","/var/www/straped/mufon/org/48401.html"],"Sighting Duration":"Undisclosed","Latitude":"43.488169","Object Flight Path":"Hovering then path","Object Shape":"Other, Unknown","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-110.755898","Summary":"It looked like a white parasail parachute, fully deployed, but no pilot.","Date of the Event":"06/02/2013 01:10 UTC","Case Number":"48401","map":"<A HREF = \"http://maps.google.com/maps?q=43.488169,+-110.755898(48401)&iwloc=A&hl=en\"> mufon case (48401) map </A>","City":"Jackson","Weather Factors":"Unknown","Country":"United States","Date Submitted":"06/24/2013 10:17 UTC"}