{"Region":"Illinois","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Tags":"City","Summary":"Observed a glowing object traveling in a straight line from the southeast to the northwest. The cylinder shaped object glowed like fire. Appeared to be traveling in a straight line or slightly upwards. Did not appear to be falling like a meteor.","map":"<A HREF = \"http://maps.google.com/maps?q=42.21325,+-88.247685(48403)&iwloc=A&hl=en\"> mufon case (48403) map </A>","City":"Cary","Viewing Distance":"Unknown","Case Number":"48403","files":["/var/www/straped/mufon/html2text/48403.html.txt","/var/www/straped/mufon/org/48403.html"],"Latitude":"42.21325","Country":"United States","Date Submitted":"06/24/2013 10:44 UTC","Sighting Duration":"Undisclosed","Log Number":"US-06242013-0029","Disposition":"Unresolved","divs":["Sighting Details1. We were in the backyard looking up at the sky for shooting stars. 2. The object was glowing like fire. It was traveling from southeast to the northwest. We noticed it coming over a tree line in our backyard. 3. We have absolutely no idea what the object was. We have never seen anything like it before. It did not appear to be a meteor. 4. The object was the color of fire....like a glowing ember. It traveling in a straight line at a consistent altitude or risely slightly as it traveled to the northwest. My guess is that the speed was the same as a small aircraft. There was no side to side movement. There was absolutely no sound. It did not appear to be falling like a meteor. 5. We both stood up from our chairs to watch it as it went over the house. I mentioned to my husband that we should say out loud to each other what we just saw so that we did not forget. Our feelings were that of amazement and wonder. 6. The object traveled to the northwest until we could no longer see it from that distance."],"trends":["There have been 7 other sightings in Cary","There were no other sightings in Cary on or around June 20th 2013"],"Source":"MUFON","Date of the Event":"06/20/2013 10:15 UTC","Object Shape":"Cylinder, Oval","Longitude":"-88.247685","Object Features":"Unknown"}