{"Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Object Features":"None","Tags":"City","Weather Factors":"Unknown","Latitude":"42.986707","Case Number":"48411","Log Number":"US-06252013-0007","Date Submitted":"06/25/2013 02:16 UTC","Region":"Wisconsin","Date of the Event":"06/22/2013 12:00 UTC","Summary":"Bright orange/red/yellow ball flew in from E, hovered 20sec, turned and ascended back E climbing at a slight angle.","Object Shape":"Fireball, Sphere, Star-like","trends":["There have been 35 other sightings in Milwaukee","There were no other sightings in Milwaukee on or around June 22nd 2013"],"Disposition":"Unresolved","Country":"United States","City":"Milwaukee","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=42.986707,+-87.881418(48411)&iwloc=A&hl=en\"> mufon case (48411) map </A>","files":["/var/www/straped/mufon/html2text/48411.html.txt","/var/www/straped/mufon/org/48411.html"],"divs":["sighting detailsi was walking n on south kk whennotice what i thought was a flare. the object was traveling w towards my direction. it slowed to a stop and hovered for 20sec. there was no sound or smoke\\vapor coming from it. from the distance of around 500ft it appeared to be 200-300ft from the ground. it appeared to be searching for something. it seemed to about the size of a small van. after hovering it turned back e and slowly ascended away from me at a slight angle until it disappeared into the hazy distance. the object had a burning quality shimmering between orange\\red\\yellow colors. it's shape orb-like and didn't alter much except for the fire-like shimmering. i felt compelled to walk towards it. may have just been curiosity, but it's almost like it was putting a question in my mind that i can't quite remember. i took a photo with my iphone. it's a little shaky and no ground reference is in the shot. i have enhanced slightly to make it less grainy. i have attached both copies. the coordinates for the object when it hovered are approx: 42.992439 -87.881799"],"Source":"MUFON","Longitude":"-87.881418"}