{"Sighting Duration":"Undisclosed","Date Submitted":"06/25/2013 07:46 UTC","trends":["There have been 4 other sightings in Los Altos","There were no other sightings in Los Altos on or around September 22nd 2011"],"Tags":"City","files":["/var/www/straped/mufon/html2text/48417.html.txt","/var/www/straped/mufon/org/48417.html"],"Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Summary":"Star started getting closer and closer. After hovering near, it went behind mountain.","Object Shape":"Star-like","Country":"United States","Longitude":"-122.116152","map":"<A HREF = \"http://maps.google.com/maps?q=37.382978,+-122.116152(48417)&iwloc=A&hl=en\"> mufon case (48417) map </A>","Object Features":"None","Latitude":"37.382978","Case Number":"48417","Log Number":"US-06252013-0012","Region":"California","divs":["Sighting DetailsMe and my friend decided to go to Foothill College's observatory. After we realized it was close, we sat in the parking lot for a while deciding what else we could do. We star gazed for a little and saw this star moving closer and closer. It was moving very slowly and there was no sound so we assumed it was far away. We thought it was a plane until we realized it was actually very close and there were no blue or red lights on it. There was no sound at any time during the encounter. It travelled in a straight line towards us from it's original place in the sky. It was at it's brightest before it decided to hover near us. After it decided to stop and hover about 50-100 feet away from us. It seemed to be trying to communicate or send a message. My friend had a \"connection\" to it. Whenever he took a step right it moved left. Whenever he stepped left it went right. He did this about 3 times and I saw this very clearly. We decided to approach it and get closer. As soon as we attempted this it ascended slowly and moved away slowly. There was absolutely no sound as it went around a mountain near to the observatory. Unfortunately, we were not able to follow it and that was the last we saw of it. I will never forget what happened. I felt excited and I wanted to get closer. I did have a little anxiety, but I was not scared. I was extremely curious!"],"Date of the Event":"09/22/2011 09:30 UTC","Disposition":"Unresolved","Viewing Distance":"21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile","City":"Los Altos","Source":"MUFON"}