{"Viewing Distance":"Unknown","Case Number":"48415","Object Shape":"Sphere","Country":"United States","Latitude":"34.495273","trends":["There have been 22 other sightings in Victorville","There were no other sightings in Victorville on or around June 22nd 2013"],"files":["/var/www/straped/mufon/html2text/48415.html.txt","/var/www/straped/mufon/org/48415.html"],"Sighting Duration":"00:00:15","map":"<A HREF = \"http://maps.google.com/maps?q=34.495273,+-117.354385(48415)&iwloc=A&hl=en\"> mufon case (48415) map </A>","Source":"MUFON","Region":"California","City":"Victorville","Object Flight Path":"Straight-line path","Date of the Event":"06/22/2013 11:51 UTC","Longitude":"-117.354385","Log Number":"US-06252013-0010","Date Submitted":"06/25/2013 07:13 UTC","divs":["sighting detailswe were walking outside earlier in the evening and some distance (a few miles away high up in the sky) i noticed a strange white light that kept appearing, sweeping across our direction seemingly sideways like a lamp in a light tower, and then disappearing, and then reappearing elsewhere a few seconds later only to do the same thing. we saw this five or six times, wondered what it was, but went inside the building. the light made no noise what-so-ever that we could here, but it was far away so we thought maybe it was a police helicopter. now we don't think so anymore. later that evening, my friend was standing outside, noticed light moving across the sky from west to east. his phone was already in the camera app and so he pointed it up at the light clicked the zoom button and snapped the photo. he came in and showed me the photo and i didn't know what to make of it, but after looking at this in the computer we see this was much much more than just a floating light. the shape of the light and the flares coming off of it seem abnormal, like a stretched hexagon. the source of the light can not be seen, even though this was the \"super moon\" night where the moon was supposed to be the biggest because it was as close to the earth as it ever gets on this evening\\morning. next to the light but seemingly floating independent from it there is a shiny milky colored or grey sphere. around the sphere is a reddish colored aura as if it is also eminating some kind of light radiation in an spectrum we can't see, but somehow affected the image sensor on the camera. it is a possibility that the redness is lens-flare, but i've not seen lens flare from lights before. we did a test with a bright light on the ground and the same camera phone looking directly at the light, unshaded and it did not produce any noticeable lens flare and did not blind the camera to anything beside or behind the light. the light in the sky produced no noticeable noise although it moved much like a helicopter. my buddy's room mate who was inside at the time had seen the same light earlier when we were out away walking fly over the apartment complex. he said he was trying to sleep but then this brilliant white lights passed through all the windows in the building and there was no noise associated with the light. the light had also very visibly upset the cat."],"Tags":"City","Summary":"Bright Illuminating Light Appeared, Flew West to East, Disappeared WIthout Noise","Object Features":"Unknown","Weather Factors":"Unknown","Disposition":"Unresolved"}