{"Object Shape":"Boomerang, Egg, Teardrop","Log Number":"US-06252013-0008","Viewing Distance":"501 Feet - 1 Mile","City":"Graham","Longitude":"-79.391616","Date of the Event":"06/24/2013 09:45 UTC","trends":["There have been 4 other sightings in Graham","There were no other sightings in Graham on or around June 24th 2013"],"Latitude":"36.071776","Weather Factors":"Unknown","Case Number":"48412","Tags":"City","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Summary":"20 object & 3 B-2 Bombers followed","Source":"MUFON","Country":"United States","Sighting Duration":"00:15:00","Date Submitted":"06/25/2013 02:40 UTC","Region":"North Carolina","map":"<A HREF = \"http://maps.google.com/maps?q=36.071776,+-79.391616(48412)&iwloc=A&hl=en\"> mufon case (48412) map </A>","Object Features":"Unknown","divs":["Sighting Details-At approximately 21:45Hrs EDT, I felt a rumble from inside my house. When I exited the front door, looking up from the bottom of the steps, I observed a string of lighted objects which looked at first like Helicopters WITHOUT Rotors at approximately 5,000 feet AGL. -One by one they changed an Easterly Azmuth to a South by South East Azmuth. Each one making the turn Southernly, in a straggled formation behind one another with approximately 1,000 yards spacing. -One headed due East about three miles and seemed to hover in observation of the others, another one was East, hovering in observation as well, but only a mile East of entire formation. All appeared to be at approximately 5,000 feet AGL. -It took about 10 minutes for them to Ingress & Egress my line of sight from West Horizon to SSE Horizon. -As soon as they had made their Egress, I noticed a slight rumbling sound, & observed overhead at my zenith position, three B-2 Bombers one in front of the other about 2,000 ft apart following the formation South by South East. -Just before disappearing over the Horizon, they filed into a loose one-mile arrow-shaped formation. I could only observe rear red beacons from each of the Bombers. -I have observed the excessive sound from an entire Flight of Helicopters before. I have observed several B-2 Bombers many, many times, and the sound of both is deafening, but these Helicopters seemed to have no rotors, and made a buzzing rumble sound. -Not enough noise to alert the dogs next door. The B-2 Bombers made a buzzing sound, and again not enough noise to alert the dogs next door. -My attempt to film with my smartphone failed, as It just would not adjust to the light conditions. Seemed that neither of the recordings of these objects could be seen NOR heard on my cellphone. THIS IS HIGHLY IRREGULAR. Only the lights from the house next door and only several of the objects appeared on both videos that I recorded."],"files":["/var/www/straped/mufon/html2text/48412.html.txt","/var/www/straped/mufon/org/48412.html"]}