{"City":"Cassville","Viewing Distance":"Unknown","Object Features":"Window(s)","Region":"Missouri","Tags":"City","Country":"United States","Longitude":"-93.86166","Latitude":"36.689635","trends":["There have been 10 other sightings in Cassville","There were no other sightings in Cassville on or around June 24th 2013"],"Log Number":"US-06262013-0003","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Disposition":"Unresolved","Case Number":"48421","Date Submitted":"06/26/2013 12:31 UTC","files":["/var/www/straped/mufon/html2text/48421.html.txt","/var/www/straped/mufon/org/48421.html"],"Summary":"multiple UFO's seen over several nignts, activity here is really pick up size movement and type","Weather Factors":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy husband and I go out for our late walk for our dog between 10:30 and and 11pm. For the last three nights we have had multiple UFOs and types, sizes, paths, you name it it seems we have had it. Sunday night we had two different types of UFOs, one a set of 6-8 small square dull white colored objects headed from northeast to south east. They were irregular in size and shape but square is the closest I can make them to be. Just north of where we were standing on our street (which goes North to South) The group of white objects stopped suddenly and until I looked east I saw the diamond shaped craft with the multiple colored lights that we have seen recently has heading north east to north west. The group proceeded south from there in a quick speedy basis. The diamond shaped one headed on west in supersonic speeds, none of them seem to be aware of each other Last night I took our dog out for his walk around the same time and I observed a blimp shaped object flying really fast from south to north, It was doing corkscrew type fight path it had rectangular windows along the sides that changed from white to red to yellow and back to white blinking off between light colors and all windoows apeared to change color at the same time. Tonight our local object was running all over the place as if he was challenging them to come back. Other than our local one there were no other visable UFOS in our area."],"map":"<A HREF = \"http://maps.google.com/maps?q=36.689635,+-93.86166(48421)&iwloc=A&hl=en\"> mufon case (48421) map </A>","Object Shape":"Blimp, Diamond","Date of the Event":"06/24/2013 11:10 UTC"}