{"City":"Fort Worth","divs":["Sighting DetailsA couple of weeks ago I had seen a bright planet looking light over the houses across the street that slowly moved away and light dimmed leaving only an outline of a transparent round object. This was the first UFO sighting that was completely different than all others. Since then I've been out gazing at the sky at all hours of night looking for moving or unusual objects. I normally see several satellites moving across the sky, which look like small stars moving at constant speeds. Monday morning at 5:15am I was looking and I had been checking out satellite positions on the NASA Satellite Web site. I was looking straight up when I noticed what first appeared to be a Satellite moving from NW to SE. As it passed what appeared to be a far away star the little light started following the bigger light at a slower speed. In addition to seeing the light it appeared to have an outline of an cigar shaped body that was mostly transparent except from the reflection from the bright Moon. The cigar shape was towing the light behind it. It could only be seen briefly as it moved away from the light. Ten minutes later I saw another solid bright light moving East to West at a similar speed as the first object. I was able to get a better idea of the height of this object as a fighter jet flying at high altitude with red lites flashing flew overhead. Both the plane and the object appeared to be at similar heights over 40,000 ft. I had another high altitude jet fly by at the same height a few minutes later. Both jets were flying in normal flight patterns of traffic at high altitudes maybe upwards 40,000 ft. Higher than normal. I was able to see a slight reflection of the object where it wasn't lit up, that's how I new it was close to the height of the planes because I could see the unlighted bottom of the planes also. I went back in to check the NASA site and there were no Satellites flying over Texas at anywhere near that time. So that would make them unidentified. This sighting wasn't nearly as dramatic as the one two weeks ago but very interesting. I have no doubt the past sighting was from something out of this world. The memory is burned into my mind."],"Sighting Duration":"Undisclosed","Country":"United States","Longitude":"-97.366145","Viewing Distance":"Over One Mile","Date of the Event":"06/24/2013 05:15 UTC","Weather Factors":"Unknown","Summary":"several satellite looking objects moving in various directions at 50,000 ft","Object Flight Path":"Straight-line path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=32.675369,+-97.366145(48422)&iwloc=A&hl=en\"> mufon case (48422) map </A>","Source":"MUFON","Latitude":"32.675369","Tags":"City","Case Number":"48422","Object Features":"Unknown","Date Submitted":"06/26/2013 01:14 UTC","Log Number":"US-06262013-0004","Object Shape":"Sphere","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/48422.html.txt","/var/www/straped/mufon/org/48422.html"],"Region":"Texas","trends":["There have been 128 other sightings in Fort Worth","There were no other sightings in Fort Worth on or around June 24th 2013"]}