{"divs":["Sighting DetailsMe and my girlfriend were walking home from our nearby friends house pretty late at night around 1 or 2 in the morning. We had just turned off of Linwood st. left onto Glendale st. in Roseville MI. I happened to glance up the sky was very clear and in front of us to our left there were 4 extremely bright and low white lights, 2 in the middle very close and 2 on the outside so it was this line coming towards us very slowly. I didn't immediately know what it was due to how low and bright it was i have seen aircraft headlights on coming towards me but these lights were a purer white almost like a fluorescent bulb white. It was to the point that i was freaked out and stop my girlfriend and just kept saying \"thats the real thing, thats the real thing\" As the line flew towards us we noticed the shape of the craft and because of how low and slow this object was flying we could make it out clearly. The craft was a Y-shaped craft with the bottom part of the Y being the front. This craft resembled how a 747 would be shaped except THERE WASNT A TAIL. And i know this due to the stars passing behind it as a reassurance. There were 5 lights on this craft. The 2 close white lights that were in the middle were directional inset headlights on the front of the craft (we know they were inset into the front because as it passed over we couldn't see them anymore they faded consistently with just being blocked out of line of sight) the 2 outer lights were on the tip of the wings and they were HUGE white orbs attached and very thoroughly lit throughout these were the only lights we seen the entire experience. The last light was a pulsing very red light that was in the bottom of the V on the back of this craft NOT on the bottom (we know this because we could only fully see this light as it was moving away) and it did not blink it pulsed, it stayed on red the whole time and just pulsed brighter like when it wanted to not consistently and not blinking like an aircraft light does on and off. The noise was weird because for how slow it was going and low it wasn't until the object was past overhead quite a bit that we heard the engine and it wasn't a normal airplane or jet engine it was uniform (not wavering or changing pitch or loudness like conventional craft) and it was quieter it was almost stealth like in nature. It took about 6 minutes for this craft to fly over it came from the NE and headed from Roseville towards Detroit. We lost sight of it over the houses ad it kept flying off. We were both talking about it for a long time and thought about it and the more we thought about it, the less likely it seemed it was a normal aircraft. So I finally decided to report it because I think it was something very weird and by definition it was a UFO."],"trends":["There have been 14 other sightings in Roseville","There were no other sightings in Roseville on or around January 15th 2013"],"Log Number":"US-06262013-0006","Object Features":"Wings","files":["/var/www/straped/mufon/html2text/48424.html.txt","/var/www/straped/mufon/org/48424.html"],"Latitude":"42.491995","Viewing Distance":"101-500 Feet","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","City":"Roseville","Source":"MUFON","Disposition":"Unresolved","Region":"Michigan","Object Shape":"Triangle","Summary":"Y-shaped no tail 4 white lights 1 red pulsing light in the V of the Y-shape","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.491995,+-82.933653(48424)&iwloc=A&hl=en\"> mufon case (48424) map </A>","Tags":"City","Date of the Event":"01/15/2013 01:30 UTC","Longitude":"-82.933653","Case Number":"48424","Date Submitted":"06/26/2013 02:18 UTC","Sighting Duration":"Undisclosed"}