{"Region":"Washington","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=47.698279,+-122.315779(48425)&iwloc=A&hl=en\"> mufon case (48425) map </A>","Object Features":"Unknown","divs":["Sighting DetailsMy partner and I were outside on the front porch smoking, and I had dimmed all the lights in the house to skywatch, as there was a clearing in the sky after some of the heaviest rain I have seen in years. The air was very clean, with a few light clouds in spots. I was looking straight up when I saw a blue-white object streaking overhead, and passing beside the top of the 125 ft Douglas Fir in our front yard. I said \"LOOK!\", to my partner who saw it right away, too. All we could say to each other without taking our eyes off of it is \"Oh my God, look how fast that thing is going!\" Neither of us have ever seen anything that fast, other than a meteorite, and this was definitely not a meteor, and we just don't have anything capable of that speed. This object was on a steady path, had no flashing lights, and seemed to be lighted by its own power (rather than reflected sunlight). The SE to NW trajectory is one that we have never observed in a satellite, but this was no satellite. That speed would fling it into outer space. My partner and I agreed that it's speed was at least four times the speed of a satellite. It had to be travelling several thousands of miles per hour. In the check-box, for lack of better description, I checked 'star-like', but star-like is more a pinpoint of light, and this was larger than that, I want to say visually it had width as one would perceive when viewing a planet. It was blue-white, but more blue than white. Also, it was not extremely bright, yet was highly visible for the duration we were able to view it, and did not fade in brightness as it got farther away, though it appeared gradually smaller due to distance. From the second we saw it, it was 90 degrees overhead, and it was at 30 degrees from the horizon just a few seconds later, when we lost sight due to clouds low on the horizon. Both my partner and I are wondering what is going on in the Western Washington skies, as this is my 3rd sighting in as many weeks, and too many to count since the first of the year, several of which were shared sightings. I am an avid amateur astronomerof many decades and have no problem discerning satellites, jets, and the ISS from the phenomena we have witnessed and are reporting."],"Case Number":"48425","Country":"United States","Object Shape":"Star-like","Date Submitted":"06/26/2013 03:35 UTC","Latitude":"47.698279","trends":["There have been 110 other sightings in Seattle","There were no other sightings in Seattle on or around June 25th 2013"],"Disposition":"Unresolved","Longitude":"-122.315779","Log Number":"US-06262013-0007","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","City":"Seattle","Source":"MUFON","Weather Factors":"Unknown","Date of the Event":"06/25/2013 11:15 UTC","Object Flight Path":"Straight-line path","Summary":"Object crosses sky at incredible speed","files":["/var/www/straped/mufon/html2text/48425.html.txt","/var/www/straped/mufon/org/48425.html"]}