{"Object Features":"Patterned Surface","Source":"MUFON","Region":"Texas","divs":["Sighting DetailsWatching TV. Decided to go to sleep. Took my dog, Cleo (dachshund) out to do her thing. I was standing under my porch. Pretty dark. No outside house lights on. We live out in the country. After standing there for about ten seconds, I noticed a brilliant white light just pop out of nowhere. Only about 15 feet away. It appeared to be just off the ground. It was right next to the front right tire of one of our cars. And only about 1 to 2 feet in size. Very hard to describe. Mostly white with some greyish tints to it. Appeared to have structure inside and some movement. Outer shape did not look like any particular shape. If I had to say, it was mostly round but jagged-edged. I observed it for a good 10 to 15 seconds. I froze! My dog (Cleo) apparently saw it too cause she went crazy barking at it! However, she would not approach it. I reached back to open the front door to call my wife to come quick. I wanted her to see this. She was half asleep and didn't respond quick enough. I never took my eyes off of it and I saw the light suddenly vanish. Or at least to my eyes it did! Cleo continued to bark in the general direction of where it was. I saw her move towards it and noticed her head was following something straight up! She was definitely still seeing something. I kept looking up but I could not see anything. I had to calm her down. My wife made it outside only to find me gazing up. I've worked in the machine vision industry for most of my career. Mostly in R&D. We deal with lighting design utilizing the entire spectrum including UV and infra-red lights. I am also an accomplished photographer. I'd like to think I know a little bit about light! But after last night, maybe not! I've never seen anything like this. It was a very pleasing light. In fact, I'd say even beautiful! But I must admit I have no idea what it was. If I had to guess, I saw some sort of natural phenomena that we don't know about yet. We went inside, my dog Cleo was the first one in! It was obvious she was startled. Didn't sleep much last night just thinking about it."],"Sighting Duration":"Undisclosed","Log Number":"US-06262013-0016","Disposition":"Unresolved","trends":["There have been no other sightings in Burnet","This sighting has been favorited 1 time."],"map":"<A HREF = \"http://maps.google.com/maps?q=30.750323,+-98.382096(48434)&iwloc=A&hl=en\"> mufon case (48434) map </A>","Weather Factors":"Unknown","Country":"United States","City":"Burnet","Object Flight Path":"Stationary","Summary":"Getting ready for bed. Went outside to take my dog out. Light suddenly appeared just in front of us.","Longitude":"-98.382096","files":["/var/www/straped/mufon/html2text/48434.html.txt","/var/www/straped/mufon/org/48434.html"],"Latitude":"30.750323","Date Submitted":"06/26/2013 03:24 UTC","Date of the Event":"06/25/2013 11:00 UTC","Case Number":"48434","Tags":"City","Object Shape":"Unknown","Viewing Distance":"20 Feet or Less"}