{"Tags":"City","Date Submitted":"06/27/2013 04:45 UTC","Object Features":"Unknown","Date of the Event":"06/01/2013 10:13 UTC","Region":"Pennsylvania","Disposition":"Unresolved","divs":["Sighting DetailsMr Preston Schwortz age 63. Retired registered nurse. Was relaxing in his 6th floor apartment. Just finished messing with his computer. Went to sit down on couch. Time was 22:13. (10:13 pm). This is actual recorded time from camera. The evening was humid. Looking out his window. Mr Preston Schwortz noticed 3 yellow orange burning balls of lights. They seemed to be in a triangular formation. Quickly Mr Schwortz. Went across to a desk. 3feet away. To activate a Digital camera. Successfully capturing three images. Mr Schwortz stated many times the lights seemed to be acting like Coleman lantern flames. Also that the flames intensified and that it left at a rapid rate. He also stated the lights or flames were in one one at a time. Once all three lit it got brighter momentary. Then gone. All this in less than 3 minutes. During interview I was able to photograph the tree line. Also fro my observation determined Mr Schwortz was intelligent and forth right. Also determined the objects location by way of image to comparison to back ground. To be 24 deg NE of his position. At a angle of view to tree line. Of 79 deg. This also takin in account that Mr Schwortz is 5ft 4 inches. I was able to determine the object was with in 2000 ft. Also the back ground lends credibility to photo. As a comparison of location. Only one frame is in my opinion credible. But offers no distinct mass. Only the triangle formation of lights."],"Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Fireball, Triangle","files":["/var/www/straped/mufon/html2text/48448.html.txt","/var/www/straped/mufon/org/48448.html"],"Summary":"Three yellow orange fire balls in sky. In triangle position.","trends":[],"Weather Factors":"Unknown","Source":"MUFON","Country":"United States","Case Number":"48448","Object Flight Path":"Hovering then path,Unknown","City":"Undisclosed","Latitude":"41.207222","Longitude":"-77.185405","Log Number":"US-06272013-0003","map":"<A HREF = \"http://maps.google.com/maps?q=41.207222,+-77.185405(48448)&iwloc=A&hl=en\"> mufon case (48448) map </A>","Sighting Duration":"Undisclosed"}