{"Source":"MUFON","Case Number":"48449","Sighting Duration":"Undisclosed","Tags":"City","Date of the Event":"01/09/2009 01:30 UTC","Log Number":"US-06272013-0004","City":"Huntington","trends":["There have been 2 other sightings in Huntington","There were no other sightings in Huntington on or around January 9th 2009"],"Region":"Texas","files":["/var/www/straped/mufon/html2text/48449.html.txt","/var/www/straped/mufon/org/48449.html"],"Weather Factors":"Unknown","divs":["Sighting DetailsI could not sleep for some reason. Went to front door and looked out and craft was hovering just above trees. It executed upright manuever and floated down to within 5-8' from ground. Then floated back up and the turned vertical. After a few seconds I heard a uuf sound and there was a rear ignition, now what was strange was that as it ignited it started at the center and spiraled out like a bullseye, then shot of. As it descended I could see what looked to me like 4 red glowing windows. there were no wings on it no any at the rear. My family thought I was nuts until it was in the Lufkin daily newspaper the next day about ufo sightings. I can think of no other explanation other than it must have returned. A small section of woods across the street from me appeared to glow in the dark on the forest floor for 2 nights. Lufkin used to be a hub for Bush inter. Airport but that changed after that time. I had the strangest feeling that the craft was trying to extract something, maybe it did. personally I wish I had never seen it, but I did. Military craft have been active in the sky ever since. This craft executed manuevers contrary to gravity and it was not of this demension, or from earth. I guess I am just imagining but somehow I felt I would see it again, but I guess it was only wishful thinking. I was mesmerized while this happened, unable to call out for my family. I am a retire Lt of police from Houston PD and you wou would think I would have collected some evidence. I have a friend who said his brother shot a picture of it parked near a home but I have yet to see it. I stand ready to assist you, though I have no decent camera or eqpt."],"Summary":"hoovered, executed 90 degree upright manuever, descended to w/i 5' of ground then floated back up","Longitude":"-94.576594","Viewing Distance":"101-500 Feet","Object Shape":"Cigar","Latitude":"31.277687","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=31.277687,+-94.576594(48449)&iwloc=A&hl=en\"> mufon case (48449) map </A>","Object Features":"Window(s)","Object Flight Path":"Hovering then path","Date Submitted":"06/27/2013 07:23 UTC","Disposition":"Unresolved"}