{"Weather Factors":"Unknown","Object Features":"Unknown","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=37.038716,+-112.501205(48445)&iwloc=A&hl=en\"> mufon case (48445) map </A>","files":["/var/www/straped/mufon/html2text/48445.html.txt","/var/www/straped/mufon/org/48445.html"],"Sighting Duration":"Undisclosed","Country":"United States","Latitude":"37.038716","Date Submitted":"06/27/2013 01:16 UTC","Disposition":"Unresolved","Object Shape":"Unknown","Longitude":"-112.501205","Viewing Distance":"21-100 Feet","Source":"MUFON","Log Number":"US-06272013-0001","Tags":"City","Summary":"taken by small people","Date of the Event":"06/01/2013 12:00 UTC","City":"Kanab","divs":["Sighting DetailsI had awaken and went pee. I thought there was something in the bedroom, but I said to myself that it was all right. I would take care of it later. and noticed the time was 3:05 am (a habit I have of noticing the time, so I can calculate how much time I have before I have to wake up). I started to go back to sleep and then I said, wait a minute, what was in the room. And I lifted my head off my pillow and I thought I was dreaming. But I realized that I was not really awake and not really sleeping and I looked at the foot of my bed and noticed small people. Two or three at the base of the bed. One right next to me, just looking. They had control of my mind. I was not afraid, I felt like I had experienced this before. I at first wondered how they got into the house. And when I wondered that, They communicated telepathically that opening doors was nothing. And almost simultaniously I was elevated and going with them. I could not cry out and wondered why my wife was sleeping through all this. She is a light sleeper. Then it occurred to me that they were doing everything telepathically anyway and not making a sound. This is where my memory stops. I don't know if I physically went on a ship with them, or not. I do remember the wind in my face. And being put back into the bed. I looked at the clock and it was 4:22. Went to sleep. End of story. Not quiet. I felt like I had done this before, well several years ago, 1997. I drive truck and a manager of Kanab custom meats at the time. I was on my way back from a small town in southern Utah when I remember coming over a null in the road and there was a bright light. And no more recollection. But I got home an hour later than normal. And I wondered what the hell happened. I remember just glimpses, like being lifted up and such. And once again wind in my face. And also I have a red blemish on my right hand back side just below the knuckle. It has been there every since 1997. Its tender to touch. Now I don't know if the two experiences are connected. But I feel like this has happened several times since 1997."],"Case Number":"48445","trends":["There have been 2 other sightings in Kanab","There were no other sightings in Kanab on or around June 1st 2013"],"Region":"Utah"}