{"Country":"United States","Date of the Event":"06/09/2012 12:00 UTC","Log Number":"US-06262013-0024","City":"Corbin","Case Number":"48443","Object Flight Path":"Straight-line path","Latitude":"36.958669","Object Features":"Unknown","Tags":"City","Longitude":"-84.090486","Summary":"Triangular mass with a single pulsating light at each corner, with one vertex in flight direction","Region":"Kentucky","trends":["There have been 3 other sightings in Corbin","There were no other sightings in Corbin on or around June 9th 2012"],"files":["/var/www/straped/mufon/html2text/48443.html.txt","/var/www/straped/mufon/org/48443.html"],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Shape":"Triangle","Viewing Distance":"Unknown","Source":"MUFON","divs":["Sighting DetailsAs I was standing in my driveway around midnight coming in from town, as I closed my car door I was looking westerly and noticed a triangular mass heading towards my direction. At first due to a hazey atmosphere that night, no stars visible, I thought to myself how odd it was to see three aircraft low enough to be visible. However, as I continued to observe the lights, there were no sounds as though low flying planes were in the area. Even a higher altitude jet would've been audibly observable in the area this occurred. What I noticed the most was an eerie silence as the object passed over head and out over the horizon towards the east. It was moving too quick to be humanly possible for high altitude, which would have been impossible to see from the haziness anyway. But even if it were three close moving private jets, there were no sounds to be heard. Once the three lights went out of sight, every neighborhood animal in the adjoining areas began to make excessive noises at once. Dogs barking histericly, horses in a close farm along with cows began to go crazy. All simultaneously with no other provocation other than the dim lights passing overhead. I had a feeling of disbelief and fright because no human object would've been visible in the atmosphere without some sort of audible tone of an engine accompanying."],"Disposition":"Unresolved","Date Submitted":"06/26/2013 11:49 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.958669,+-84.090486(48443)&iwloc=A&hl=en\"> mufon case (48443) map </A>"}