{"Longitude":"-80.48549","Weather Factors":"Unknown","City":"Key West","Case Number":"48459","Source":"MUFON","Viewing Distance":"Over One Mile","Region":"Florida","trends":["There have been 11 other sightings in Key West","There were no other sightings in Key West on or around June 15th 2013"],"Date of the Event":"06/15/2013 12:00 UTC","Summary":"Geo-stationary point of light","Object Shape":"Star-like","Object Flight Path":"Stationary","Sighting Duration":"00:20:00","Date Submitted":"06/27/2013 05:35 UTC","Object Features":"None","divs":["sighting detailsjust after sun down june 15, 2013, waiting for regulus to sight the moon's arc distance with a sextant. expected venus to appear low in the western sky, regulus about 45 degrees and the moon near zenith. a bright light which i mistook for regulus appears before venus. while unusual, i mistook it for regulus and sighted the moon against it. i observed them converging at 15 min arc\\ min in my sextant. of course that is impossible for any celestial object, because the earth is moving at that speed, so all celestial objects appear to move with it. the moon's apparent motion is 30 sec arc \\min against the stars. satellites move much faster. nothing stands still. i now realized it was not regulus. i took the light's altitude to confirm it was standing still. it was geo-stationary. it was hovering over the same point on earth between 200 miles and 3500 miles west of my location. i can demonstrate the math upon request, but won't here for brevity. this light was far from the positions possible for geo-stationary satellites which are far too dim to see anyway. i sighted it for twenty minutes. then it simply disappeared. switched off. went dark. nothing in the atmosphere could have behaved this way. nothing in space could have remained stationary without controlled powered flight. nothing manmade could maintain geo-position. we just don't have the power yet. it seems to me that since most people would have overlooked the significants of the unique properties of this light i observed, these events must be far more common that we imagine to make it probable enough for me to observe. my calculations suggest that for a likelihood of my observation to be greater than negligible such an event must occur unobserved 11 times per every hour somewhere in the world."],"files":["/var/www/straped/mufon/html2text/48459.html.txt","/var/www/straped/mufon/org/48459.html"],"Latitude":"27.837976","Disposition":"Unresolved","Country":"United States","Log Number":"US-06272013-0014","map":"<A HREF = \"http://maps.google.com/maps?q=27.837976,+-80.48549(48459)&iwloc=A&hl=en\"> mufon case (48459) map </A>","Tags":"City"}