{"trends":["There have been 4 other sightings in Warminster","There were no other sightings in Warminster on or around March 1st 1981"],"Country":"United States","Region":"Pennsylvania","Log Number":"GB-06272013-0007","map":"<A HREF = \"http://maps.google.com/maps?q=40.209818,+-75.094637(48452)&iwloc=A&hl=en\"> mufon case (48452) map </A>","Source":"MUFON","Object Features":"Window(s)","Viewing Distance":"21-100 Feet","files":["/var/www/straped/mufon/html2text/48452.html.txt","/var/www/straped/mufon/org/48452.html"],"Object Flight Path":"Straight-line path","Summary":"Came over a brow of a hill with bend to the right. Flying saucer shaped craft was just starting to cross the road, right to left at tree height. Going very slowly and making a loud intermittent humming sound.","Tags":"City","Disposition":"Unresolved","Date of the Event":"03/01/1981 11:02 UTC","Date Submitted":"06/27/2013 08:29 UTC","divs":["Sighting DetailsI had finished work in the town of 'Salisbury' late in the evening and was travelling home to 'Warminster' 25miles away. The time was about 2300hrs and it was a clear night. I can't remember now if it was raining or not. As I drove over the top of a hill the road then goes around to the right immediately after the top, there just starting to cross the road at tree height was a flying saucer. It was so low I braked and stopped the car and watched in amazement . I was properly about 50m away, there was no mistaken what it was. It crossed from right to left at a very low speed (crawling speed). It seemed to be similar to an average picture you wound see of people's perception of what a flying saucer should look like. It was dark in colour and had port holes around the middle with lights that could be seen shining through. It was about the size in length of a London bus. It made a very distinct sound; a loud humming noise. I sat and watched it cross. It was that close I could see the lights shining through the porthole windows. Once it had crossed and was now in a field still going at the same speed I then drove to the bottom of the hill and pulled in to a lay by . I could still see it from its lights. It went at the same speed and direction for a further 2 mins. It then stopped shot straight upwards and a fast speed, quite high. Then after another minute it went like a shooting star straight up and was gone. I then went home and told my Mum & Dad, they suggested I go to the police station and report it which I did straight away. There was a police sergeant on duty at the time and when I told him that I wanted to report the sighting he said 'we get a lot of sightings of UFO around here', he didn't really believe me. He took a statement and then I went home again. 1. It was a long time ago around the end of 1980 or up to April 1981. I did have the exact date and time in a diary which I can't find. If needed I could work out the date. 2. I was 19 or 20 years old at the time. 3. No one ever really believed me so I never really spoke about it after a few months. 4. It was that close I realize now that I'm one of only a few who have been the close to one."],"Longitude":"-75.094637","Latitude":"40.209818","Sighting Duration":"Undisclosed","Case Number":"48452","Weather Factors":"Unknown","Object Shape":"Disc, Oval","City":"Warminster"}