{"Region":"Missouri","City":"Cassville","Case Number":"48458","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Log Number":"US-06272013-0013","Object Shape":"Star-like, Unknown","Latitude":"36.687475","Summary":"{nd} White square UFOs back earlier in the evening than usual","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/48458.html.txt","/var/www/straped/mufon/org/48458.html"],"Weather Factors":"Unknown","Date Submitted":"06/27/2013 04:47 UTC","Longitude":"-93.86315","Tags":"City","Object Features":"None, Unknown","Object Flight Path":"Stationary","Country":"United States","Date of the Event":"06/26/2013 09:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.687475,+-93.86315(48458)&iwloc=A&hl=en\"> mufon case (48458) map </A>","Source":"MUFON","divs":["Sighting DetailsLast night I took my dog for a short pee break in the front of the house which faces east along a north south running street. As a looked about for anything unusual, I spotted a group of the dull white object as seen several days ago. This time our local UFO caught them coming through our area because they came through earlier than usual. It was circling around the group which this time was up in the upper statratusphere I think. While he was doing that the smaller objects I have often seen with it were in a lower altitude. As I had been standing there a yellow object started flashing his light and coming lower and at me, I think it was trying to warn me that what ever these new objects were not something to be around and was trying to warn me to get back into the house and that is what is what I did. I figured it knew more than I did. I have seen these smaller craft on more than one occassion fighting other UFOs as fighters. I have known since shortly after discovering their existance they were also aware of me. This is the first time I have had one of them approach me and made me feel better. It came down to tree top level trying to warn me."],"trends":["There have been 10 other sightings in Cassville","There was one other sighting in Cassville on or around June 26th 2013"]}