{"Object Shape":"Disc, Fireball, Star-like","Sighting Duration":"00:02:00","Log Number":"CA-06272013-0012","Case Number":"48457","Source":"MUFON","files":["/var/www/straped/mufon/html2text/48457.html.txt","/var/www/straped/mufon/org/48457.html"],"divs":["sighting detailsit was a cloudy night on june 26th 2013 at 11:15pm (last night). i was having a cigarette out the window of my 5th floor apartment, facing north, when i saw a bright white light with a smaller red light descending from the clouds towards my direction (south). i thought my eyes were playing tricks on me, and thought nothing of it, but then i kept watching and smoking, and then i saw 2 very bright white lights moving from west to east across the sky, just over a bridge leading to the downtown core. they were moving very quickly, faster than any airplane (maybe the speed of a jet or a meteor?). for a moment i thought it could have been a terrorist attack, or planes about to crash into the downtown core because they were traveling incredibly fast and dangerously close to the ground in a busy city centre. i called for my boyfriend to look out the window, and he missed them. but then around 5 seconds later, there were 2 more similar objects (large, very bright white lights) moving in the same direction (east) very quickly. my boyfriend saw the latter objects as well. once the objects went further east, our view was obstructed by buildings\\condos further northeast. i kept watching, and i saw them actually weaving through the buildings\\condos. i thought they may have been some kind of helicopter or meteor, but the objects did not make any sounds, and they were moving up, down, and side-to-side around the buildings\\condos, almost like how flies are able to buzz around people but they moved incredibly quickly, as if gravity did not affect them. then they moved northeast, into the clouds. in total, i saw about 4 or 5 objects (5 if i count the first object that descended from the clouds as a separate object than the 4 i saw moving horizontally from east to west). during the event, i tried to take a picture, but the objects were moving too fast for me to turn on my iphone screen and to take the video\\photo. i took a picture of the direction where the objects disappeared into, but it is dark, poor quality, and you can only make out the city lights. after the event, i heard planes flying overhead. it is strange because the planes made noticeable sounds of propelling through the air, but the objects did not make any sounds."],"Longitude":"-123.109987","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","trends":["There have been 33 other sightings in Vancouver","There were no other sightings in Vancouver on or around June 26th 2013"],"Weather Factors":"Unknown","Date of the Event":"06/26/2013 11:15 UTC","Object Flight Path":"Straight-line path,Path with directional change,Other","Tags":"City","Region":"British Columbia","Object Features":"None, Unknown","Date Submitted":"06/27/2013 04:05 UTC","Country":"Canada","Summary":"Multiple BRIGHT white lights moving very quickly through major city skyline, soundlessly.","City":"Vancouver","Disposition":"Unresolved","Latitude":"49.264826","map":"<A HREF = \"http://maps.google.com/maps?q=49.264826,+-123.109987(48457)&iwloc=A&hl=en\"> mufon case (48457) map </A>"}