{"Date of the Event":"06/26/2013 06:30 UTC","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=53.526254,+-2.25166(48450)&iwloc=A&hl=en\"> mufon case (48450) map </A>","Sighting Duration":"Undisclosed","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/48450.html.txt","/var/www/straped/mufon/org/48450.html"],"Region":"","divs":["Sighting Details My partner and I were at home,watching youths playing football on a busy road junction in front of the house, when she said ''what's that?'' I looked up to see the object travelling a level course right to left (South to North)at approximately 20 degrees above the horizon. My first thought was it could be a Microlight aircraft but it seemed to rotate as it flew. It stopped in mid air holding stationary at the same position. At this point I got my camera from a downstairs room and took a photo from the front garden of my house. It took approximately fifteen seconds to get the camera and take the first photo. Within a few seconds I took a second photo by that time the object had turned away from me and travelled Eastward. It then climbed to an elevation of approx. 30 degrees travelling East North East. At this point we could not see it with the naked eye, so I took a third photo regardless of that fact, including a building and roadside lamp standards for reference. I took a further two photos within the next thirty seconds( then I took three photos of a Goldfinch that had landed in a tree close by) finally taking my last UFO photo (photo six) within the following thirty seconds. The object is purple in colour and seems to have a 'hull' or fuselage with 'wings' that appear to have dihedral. It also has four other 'wing' or 'plane' like protrusions which seemed to move up and down(I have enlarged first two photos) When I downloaded the set onto my computer, I realised I had captured side view and rear view of what turns out to be the first object. A second object appears in the fifth photo. There are also two other objects down to the right, one of which appears to be a dark 'orb' shape over the street light.Our feelings were purely of curiosity."],"Latitude":"53.526254","Summary":"Second witness drew my attention/object appeared suddenly travelling level North/ became stationary/ revolved /ascended East/stopped but not visible to naked eye","Object Shape":"Other","Case Number":"48450","Source":"MUFON","Longitude":"-2.25166","Object Features":"Appendage(s)","Country":"United Kingdom","Log Number":"GB-06272013-0005","Tags":"City","Date Submitted":"06/27/2013 07:52 UTC","trends":["There has been one other sighting in Prestwich","There were no other sightings in Prestwich on or around June 26th 2013"],"Object Flight Path":"Stationary,Straight-line path,Path with directional change,Path then hovering","Weather Factors":"Unknown","City":"Prestwich"}