{"Country":"United States","Log Number":"US-06272013-0009","Source":"MUFON","Viewing Distance":"Unknown","Object Features":"Dome, Window(s)","Tags":"City","Disposition":"Unresolved","Object Flight Path":"Unknown","trends":["There have been 3 other sightings in Addison","There were no other sightings in Addison on or around December 7th 1989"],"Sighting Duration":"Undisclosed","City":"Addison","Region":"Texas","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.96306,+-96.821868(48454)&iwloc=A&hl=en\"> mufon case (48454) map </A>","Case Number":"48454","divs":["Sighting DetailsIn 1989 I did coke and went to night clubs. Ok I was imature. But this was the only ET event I have ever experienced and I will never forget it. I have been straight since 1991. On this evening I did not pick up a girl, so I gave up and went home. As soon as I came in I closed the garage door and I shut the kitchen door and then a bright light covered me. Yes, I was high on coke but I thought this light was a spiritual experience because I felt so free of stress. UNUSUAL. The next thing I knew is I was aboard a craft that seemed round with translucent walls. I could see the Earth and I could see the moon. Once we got to the moon we came to a hugh cigar craft in orbit. It had disks and arrow heads flying in and out of it. It was like a sworming bee hive. I could tell you much more and send you my biography of my life and the event if you are interested. Since the Citizen's Hearing, I did not feel as scared anymore and I felt compiled to let you know about my experience. It has taken me over 22 years to get it all down and finally I compiled and hid most of it as part of a biography and cure for cocaine addiction. Maybe because cocaine was involved others I have mentioned my experience to; have not taken me seriously. I know when I told Stanton Freedman a little bit about what I saw, he really got pissed off. How can telling about what I experienced with aliens and the secret military make someone so angry in this business? One thing that makes mine so different and sensational, is the US Military and the Greys abducted me because of my cocaine use (at the time). They wanted to study that. That is what most people just don't believe but it is true, I was a \"person of interest\" because I did coke and managed the laboratory without any sleep for weeks and months at a time. This of itself was a valuable study for them. What I am finding is that just to mention the word cocaine, makes many people uncomfortable. Like the n word or the f word; there is also the c word. My abduction experience was ONLY ONE incident that happened back in 1989 while I was a manager and chairmen of an analysis laboratory in North Dallas. It has changed my life forever. During this experience (when I orbited the moon) I receive an implant, I found out what our secret military is really doing, learned about nano technology (unheard of at that time), I had direct interaction with the Grey group mind and saw, learned and dowloaded into my brain all the workings of our world - I am still getting it all down, I am still writing about it. I saw things at that time that even the small bits that I understand are starting to come out now. Still no one has talked about. Just so you know, I have been totally straight and free of all alcohol and drugs since 1991. But that experience was real and I still have dozens of notebooks full of things that no one believes that only the surface subjects I have been able to validate so far the rest is too deep or too strange. My abduction was different from most that I have read about or the ones I have met. I am originally from Northweat Florida and attended all the Project Awareness expos in Gulf Breeze and Pensacola. Yes, I met, know or heard all the biggest names in the UFO world, but none of them or their findings seemed to match up with my experience. . There are a few (Linda Molton Howe, John Mack, Dan Burisch and Dr. Steven Greer) that I trust, really admire and celebrate their work and wish I could contact them about what happened to me. I like Linda's work and she signed one of her books for me, I believe it was A Strange Harvest. Poor John has gone on to the happy hunting grounds. I emailed Dr. Steven Greer a few months back requesting to get his help to remove my implant, but I guess he is busy with Sirius now. I am willing to send you my biography, if you are interested in reading about my experience. (you will not be bored). As much as I would like to declare myself a \"great fiction - adventure\" writer, I can not claim that. I will go to my grave demanding that it is all true, for no other reason than because it is. If no one believes me, fine, but I don't need to know what those little girls at Fatima heard, I already know more. I have had issues. The doctors said I would have to have a liver transplant to survive in 1992 but I refused and they called me \"delirious\". So I adapted that \"pen name\" as a cover. At first I was scared to bring out my story and so I wanted to cloak it a bit with the pen name and cure for addiction. Then I heard one researcher say \"the best way to hide the truth is put it right out in the open\". Maybe that is what I have done, but so many can not get their minds around it. Maybe you can. Its time for someone like you to know. Please email me back if you are interested and I will send you my story,"],"Object Shape":"Cigar, Disc","Latitude":"32.96306","Longitude":"-96.821868","Summary":"At 2 am I came inside my house and a very bright light appeared, next thing I know I am aboard the craft","Date of the Event":"12/07/1989 12:00 UTC","Date Submitted":"06/27/2013 12:14 UTC","files":["/var/www/straped/mufon/html2text/48454.html.txt","/var/www/straped/mufon/org/48454.html"]}