{"Latitude":"38.904942","Object Flight Path":"Unknown","divs":["sighting detailson june 25th 2013 approx. 7:30 pm i took pictures of my car. while downloading the pix to pc, i noticed a strange object in the sky. after noticing the object i went outside to take more pictures of that area of the western sky. that object did not show, but other objects showed in the photos. strange objects were not detected in some of the pictures. i also, zoomed in on the object by using a pc software and was able to capture a close-up. the following day on the 26th, after a thunderstorm, approx. 6:30 pm, i decided to take pictures of the same area of the sky. i could not see any objects with my naked eye, but did see an object showing in the photos. some of the specs are from raindrops on the window, because i took those pictures through the glass on the porch, but there is a distinct object directly in front of the sun breaking through the clouds. today 6\\27\\13 at approx. 9:00 am i once a again took pictures of the western sky. at first i thought there was nothing. however, as i looked harder i see approx. 4 objects in the clouds at a distance. there seems to be a lot of ufo activity going on in the western skies. one cannot detect this with their naked eye, but my aiptek mpvr 2k6 camcorder can detect the objects."],"Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/48456.html.txt","/var/www/straped/mufon/org/48456.html"],"Case Number":"48456","Sighting Duration":"Undisclosed","Object Features":"Appendage(s)","map":"<A HREF = \"http://maps.google.com/maps?q=38.904942,+-77.029206(48456)&iwloc=A&hl=en\"> mufon case (48456) map </A>","Object Shape":"Circle, Sphere","Tags":"City","Summary":"strange objects in the sky","Longitude":"-77.029206","Date Submitted":"06/27/2013 02:50 UTC","Weather Factors":"Unknown","Disposition":"Unresolved","City":"Washington","Date of the Event":"06/25/2013 12:00 UTC","trends":["There have been 20 other sightings in Washington","There were no other sightings in Washington on or around June 25th 2013"],"Region":"Maryland","Log Number":"US-06272013-0011","Source":"MUFON","Country":"United States"}