{"map":"<A HREF = \"http://maps.google.com/maps?q=28.043991,+-82.707014(48464)&iwloc=A&hl=en\"> mufon case (48464) map </A>","Object Features":"Other","trends":["There have been 5 other sightings in Oldsmar","There was one other sighting in Oldsmar on or around June 27th 2013"],"Object Shape":"Sphere","Disposition":"Unresolved","Log Number":"US-06272013-0019","City":"Oldsmar","Object Flight Path":"Straight-line path","Date of the Event":"06/27/2013 11:27 UTC","Country":"United States","Longitude":"-82.707014","Summary":"bright light heading,n.dimmed.and out.north,heading","files":["/var/www/straped/mufon/html2text/48464.html.txt","/var/www/straped/mufon/org/48464.html"],"Date Submitted":"06/27/2013 10:51 UTC","Region":"Florida","divs":["sighting detailssaw a bright light ,heading north,dimmed on heading,then totaly out,north,heading, more sightings from my location,once a week, also one sighting folloeing an ac 130 coast gaurd plane just before dark 830 pm about. many sightings here. not normal aircraft. sightings with commercial air craft and military aircraft in the air. you guys should visit around here.. no joke.strange air craft flying around mostly at night.when i can see them better, my kids have seen this also..also i would like to add ,the ufo that was seen in the ice land volcano plume i saw here in the middle of the day a year ago,about.west of my location. very weird stuff..for more info. on all of what i have seen here you may call me 727 403 2345. on 6 23 13 i also saw a triangle craft light up very high in the night sky release two dark round craft one went west the other went south,very fast rate of speed not normal craft,the larger triangle craft went north and gone,up..pls contact me would like to share my info. with you guys. i have lived here for 10 years and love the night sky.. and come to like seeing the weird air craft here.. not satelights or normal air craft ,i have freinds who are pilots\\military. and have lived around military bases all my life.sir. have a great day.. many sightings here over the years.."],"Weather Factors":"Unknown","Case Number":"48464","Tags":"City","Source":"MUFON","Viewing Distance":"Over One Mile","Latitude":"28.043991","Sighting Duration":"00:05:00"}