{"map":"<A HREF = \"http://maps.google.com/maps?q=38.957391,+-84.395814(48462)&iwloc=A&hl=en\"> mufon case (48462) map </A>","Date of the Event":"06/21/2006 10:20 UTC","trends":["There has been one other sighting in Alexandria","There were no other sightings in Alexandria on or around June 21st 2006"],"Source":"MUFON","Country":"United States","Tags":"City","Object Features":"Unknown","Disposition":"Unresolved","Object Flight Path":"Path with directional change","Log Number":"US-06272013-0017","Region":"Kentucky","Sighting Duration":"Undisclosed","Date Submitted":"06/27/2013 08:33 UTC","Weather Factors":"Unknown","Latitude":"38.957391","Longitude":"-84.395814","divs":["sighting detailsi was laying outside at night in the grass watching the stars like i sometimes do when i'm bored or upset. i noticed a bright orange\\reddish ball of light that i happened to notice moving funny and oddly large to be anything i've seen before, like a planet on it's closest nights, but bigger than that by far. the light was a steady glow, no pulsing or anything. it moved somewhat slowly way above me from the sw toward the sw. it would then stop (yes, just hang there) and turn a sharp change in direction (not like a loop, but like a corner), and it did this a few times. it would change direction quickly, but then move slowly. it then zig zagged a few abrupt times and shot off out toward the nw. it was way above me, so i couldn't see fine details, but i have never seen a plane or even bird move that quickly on a direction change. my father had actually seen the same thing (come to find out when i went inside and told him) but years ago when he was alone driving down a back road. he said the one he saw was seemingly following him from above. when he stopped the car and got out to see what the hell he was whitnessing, it stopped, hovered a momnent, then shot off. this was in 2006 or 2007, june. sorry i can't remember the year any better. i felt like my heart was going to burst, my throat was clogged with wonder and excitement of curiosity, and i must say, it changed my opinion on what may be around us without our knowing. i would love to experience it again. even at a distance, it was one of the most beautiful speciticals i have ever seen."],"Object Shape":"Fireball, Star-like","Viewing Distance":"Unknown, N/A","City":"Alexandria","Case Number":"48462","Summary":"Laying outside on my back and noticed bright ball of light moving. Stopped, changed direction, stopped again, changed direction, eventually shot off. Lasted a good minute. No planes in area at that time.","files":["/var/www/straped/mufon/html2text/48462.html.txt","/var/www/straped/mufon/org/48462.html"]}