{"Summary":"Saw 3-4 star like lights in the sky. And then saw a comet? break up.","City":"Thornton","Date Submitted":"06/28/2013 03:55 UTC","Object Shape":"Star-like","Case Number":"48467","trends":["There have been 7 other sightings in Thornton","There were no other sightings in Thornton on or around June 27th 2013","This sighting has never been favorited.",""],"Region":"Colorado","map":"<A HREF = \"http://maps.google.com/maps?q=39.870871,+-104.964104(48467)&iwloc=A&hl=en\"> mufon case (48467) map </A>","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/48467.html.txt","/var/www/straped/mufon/more/48467_submitter_file1__LIGHTS.jpg","/var/www/straped/mufon/more/48467_submitter_file2__LIGHTS1.jpg","/var/www/straped/mufon/org/48467.html"],"Object Features":"Unknown","Date of the Event":"06/27/2013 11:10 UTC","Sighting Duration":"00:05:11","Country":"United States","Log Number":"US-06282013-0003","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Tags":"City","Latitude":"39.870871","divs":["Sighting DetailsMe and my mom were standing outside cause it was hot in the house. I looked up and me and my mom started to just look at the stars. I saw a star like object and then noticed it was moving. It was going in a northerly direction. Pointed it out to my mother but she didn't have her glasses on. It moved and then slowly disappeared. I'd have to say that if you put a ruler up to the sky and measured the object it would have moved 2-3 inches in the sky. Me and my mom then decided to sit outside and just observe the sky. We saw the usual planes, helicopters and stuff. But then I noticed 2 more starlike objects moving south this time, one in front of the other, moving the same speed. My mom saw them as well. Then she pointed out another small, starlike object moving across the sky, this time I couldn't see the one she was talking about. Then we turned and looked behind us and saw this weird, cone like shape, more like a parabola; if you were looking at it from the side shape of light. It moved slowly then dissipated into a star like shape then dissipated fully. Then we saw a asteroid or something, break apart in the sky. We saw it come down from the West, it glowed orange, then broke up into 2-3 smaller pieces and then went out. Not sure what the small starlike objects were. My best guess is that they were satellites because of the South to North direction they were going. The parabolic light, I'm not sure of. And well, the falling star was a falling star. I've attached pics, just some photoshop stuff illustrating what I saw, they're not actual images."],"Source":"MUFON","Viewing Distance":"Unknown","Longitude":"-104.964104"}