{"Object Shape":"Disc, Saturn-like, Sphere, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=39.259448,+-76.735305(48474)&iwloc=A&hl=en\"> mufon case (48474) map </A>","Longitude":"-76.735305","files":["/var/www/straped/mufon/html2text/48474.html.txt","/var/www/straped/mufon/org/48474.html"],"Date Submitted":"06/28/2013 02:20 UTC","Case Number":"48474","Object Features":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Flight Path":"Unknown","divs":["sighting detailsthis information is being filed by the maryland mufon sd following a 1hr personal interview with the witness. note that the witnesss home phone listed above is that of his mother and that the email address is that of his mother. the witness, a 40 year black male, unemployed for the past 2 years following an auto accident, has had numerous sightings brginning at age 8. prior to his accident, the witness was employed, and has alwaws been employed, in sales. for the past 2 years he has been photographing what he considers ufo sighting that he has encountered within a block or so of his residence. he showed me a number of these photos. unfortunately they are stored on his camer phone which has a very small screen. the camera phone is a sprint scp-2700, with a resolution of 1.3 mp. the photos i saw were of supposed \"creatures\" in the foliage. while suggestive, the images on the camera phone were too small to be seen clearly. these images need to be downloaded to a photshop-like software program where they can be scaled up for better viewing and analysis. based on his lokg term history of sightings, the witness is convinced he is recording ufos, orbs, creatures, etc. the witness is a pleasant, well spoken individual, who is utterly convinced he is being led into these encounters. he will continue to believe his photos are the evidence until\\unless they can be clearly shown to be othersise. the witness claims to be not computer literate, so his photos will have to be downloaded by soemone who is."],"City":"Catonsville","Viewing Distance":"20 Feet or Less, 21-100 Feet","Source":"MUFON","Disposition":"Unresolved","Latitude":"39.259448","Log Number":"US-06282013-0010","Date of the Event":"05/12/2013 12:00 UTC","trends":["There have been 3 other sightings in Catonsville","There were no other sightings in Catonsville on or around May 12th 2013"],"Region":"Maryland","Summary":"A 32 year history of encounters, the most recent of creatures in the foliage","Tags":"City"}