{"Country":"United States","Region":"Ohio","Longitude":"-81.506821","City":"Cuyahoga Falls","Source":"MUFON","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Date Submitted":"06/28/2013 03:07 UTC","Summary":"Large glowing red light coming toward us then ascended","Date of the Event":"06/27/2013 11:04 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Tags":"City","files":["/var/www/straped/mufon/html2text/48475.html.txt","/var/www/straped/mufon/org/48475.html"],"divs":["sighting detailson 6\\27\\13 at 11:04 pm i was taking the dog out before bed. a large, bright, glowing, vividly red, pulsating light caught my eye in the ne sky. it was coming rapidly in my direction (travelling sw). my first thought was it was one of those floating lanterns, but it was traveling way too fast. i also though perhaps it was an airplane, but knew that the red light would not be in the front of a plane. it made no noise, which is what startled me. i waited to hear something, but i didn't. i ran to the house and yelled for my husband to come out quickly. with the speed it was traveling, even though he was just a few feet from me, i thought we would miss it going over. he came out and when we looked back up, the light was dimmer and a bit smaller and seemed farther away, yet still coming toward us. the light appeared a little less red now - a little orangy red. as i was explaining to him what it had looked like before he came out, he noticed that it had appeared to have stopped. we then heard an airplane which was traveling west to east. we stared at the object for probably 1 minute and the entire time it did not move. the sound of the airplane disappated. i positioned myself so that a power line was in my line of sight for reference. the power line blocked my view of the object, which was perfect because this way i would be able to tell which way it moved, or if it stayed stationary. i was surprised to see it ascend (as in away from the earth). my husband also commented that it looked like it was going up and getting dimmer. it continued to ascend and appear smaller and smaller and eventually cloud cover obscured the view. my husband went back into the house saying, \"you tell me....what was it? you're the one who doesn't believe.\" i continued to watch the sky for another five minutes, but did not see it again. i know this is crazy, but it's almost as if it \"froze\" while the airplane was in the area. i am not a believer, however i cannot explain what we saw and i frequently study the night sky."],"Case Number":"48475","Latitude":"41.153558","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Object Shape":"Fireball, Sphere","Log Number":"US-06282013-0011","map":"<A HREF = \"http://maps.google.com/maps?q=41.153558,+-81.506821(48475)&iwloc=A&hl=en\"> mufon case (48475) map </A>","trends":["There has been one other sighting in Cuyahoga Falls","There were no other sightings in Cuyahoga Falls on or around June 27th 2013"],"Object Features":"Unknown"}