{"Country":"United States","Date Submitted":"06/28/2013 09:27 UTC","Sighting Duration":"Undisclosed","Longitude":"-74.398481","Latitude":"40.059724","City":"Undisclosed","Viewing Distance":"Unknown","Case Number":"48479","Date of the Event":"06/22/2013 12:00 UTC","Disposition":"Unresolved","Object Flight Path":"Path with directional change","Object Features":"None","files":["/var/www/straped/mufon/html2text/48479.html.txt","/var/www/straped/mufon/org/48479.html"],"Summary":"Was taking pictures of the super moon with my new camera. From below the moon came 2 orange orbs which me and my daughter thought were fireworks at first. They \"rose \" quickly and moved to our west. No noise at all.","Weather Factors":"Unknown","Source":"MUFON","trends":[],"Log Number":"US-06282013-0015","map":"<A HREF = \"http://maps.google.com/maps?q=40.059724,+-74.398481(48479)&iwloc=A&hl=en\"> mufon case (48479) map </A>","divs":["Sighting DetailsI was outside my home and taking pictures of the super moon with my new camera. After taking a shot or two, 2 orange orbs shot up directly below the moon. At first we thought they were fireworks. But then they moved up and over to the left of my house. Although they seemed to move in a path like a helicopter and at the height of a helicopter, they made absolutely no noise whatsoever. In addition, they seem more to be floating than being run by any type of mechanics. I took pictures and was just able to download them on my computer today since I am learning how to use my camera. I was surprised to see the results. These objects were 100 percent not a helicopter, plane or balloon. They also were not stars or planets. My best guess is they are some type of geological or atmospheric phenomena. The only problem with that is that they seemed to know where they were going and not moving in a haphazard fashion. They were definitely travelling together. I will try to download the original photos as well as the photos of the moon I took that night. I also will include a couple that i cropped and zoomed in on. In one of the pictures, the object seems like three blurry white globes. The objects floated out of sight."],"Tags":"City","Region":"New Jersey","Object Shape":"Circle"}