{"Tags":"City","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/48481.html.txt","/var/www/straped/mufon/org/48481.html"],"Viewing Distance":"Over One Mile","Country":"United States","Date of the Event":"06/28/2013 10:31 UTC","Object Shape":"Sphere, Star-like","Source":"MUFON","Object Flight Path":"Hovering then path","Case Number":"48481","Weather Factors":"Unknown","Disposition":"Unresolved","Summary":"2 star like objects sitting ,then moved one went s.w.,the other n.e. obove some clouds.","Longitude":"-82.702844","trends":["There have been 5 other sightings in Oldsmar","There was one other sighting in Oldsmar on or around June 28th 2013"],"Latitude":"28.035078","City":"Oldsmar","Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=28.035078,+-82.702844(48481)&iwloc=A&hl=en\"> mufon case (48481) map </A>","Object Features":"Other","Date Submitted":"06/28/2013 11:17 UTC","divs":["sighting details6-28-13,about 10:30 pm. i was looking at the stars, for about 5-10 mins. then noticed two stars started moveing in different directions,far up , looked like stars at first then started to move one went s.w. the other n.e. cuveing a little not straight paths,during flight the one heading n.e. brightened, then dimmed, went above some clouds and gone. the other i lost in the sky haze from the lights from the ground. 2 commercial air craft were in the sky at the time,and then a helicopter \"bay life flight\"type, heading n.w. just as i lost them.i have seen this type of masking\\hiding, before.. they will come in and sit like stars and after a while start to move,or just be there blacked out ,then light up a little bit like a dim star ,sit a little and then move and not just straight paths.sometimes fly off at great speeds. or in flight black out ,but i sometimes can still see them fly blacked out depends on the weather,and if i have my binoculars.. i see many strange unexplained objects in the sky here.. comeing and going.. its hard to tell all that i have seen here in the past ,but tonight was weird two objects,heading in two different directions after sitting together. for how long they were there sitting, i dont know.but again not normal.. aircraft,ect. thank you and have a great day ..my phone 727 403 2345. i am not a good typest.."],"Log Number":"US-06282013-0017"}