{"Case Number":"48480","Date of the Event":"07/14/2005 12:00 UTC","Weather Factors":"Unknown","Object Shape":"Sphere","Latitude":"20.211944","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/48480.html.txt","/var/www/straped/mufon/org/48480.html"],"Date Submitted":"06/28/2013 10:28 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=20.211944,+-87.465833(48480)&iwloc=A&hl=en\"> mufon case (48480) map </A>","Object Features":"None","Source":"MUFON","Sighting Duration":"01:00:00","Longitude":"-87.465833","City":"Tulum","Country":"Mexico","Object Flight Path":"Unknown","Tags":"City","Log Number":"MX-06282013-0016","Region":"Quintana Roo","trends":["There have been 3 other sightings in Tulum","There were no other sightings in Tulum on or around July 14th 2005"],"Summary":"Objects in the photos were discovered around 2 years after taken","Disposition":"Unresolved","divs":["sighting detailswe were on a cruise and took a field trip to the tulum ruins, it was july 17th 2005 around noon and extremely hot, in all honesty, i did not see any of these objects until i went over the photos a couple of years later when in one of them there was something that caught my attention and i went over the other ones discovering more \"objects\". i posted a couple of these on youtube and the comments are that these objects are balloons. if you see a map of the tulum ruins, you can see that the main temples sit on the edge of a hill with their back to the ocean. there's a very narrow beach behind them and we went down there where nobody was flying any balloons, we were all from the cruise ship and nobody lives close to the temples. on the one photo that started it all,109b, there's something yellowish-greenish but to its left and above, there's a bright sphere that when you zoom into it looks to have some antennae. fyi i had to put a check mark in a few boxes that really should have been n\\a but the option is not there, otherwise the submit button does not work. i leave it up to you to draw your own conclusions, and i would appreciate some feedback. thank you. raul fagundez."]}