{"Object Flight Path":"Straight-line path","trends":["There have been 4 other sightings in Oxford","There were no other sightings in Oxford on or around June 24th 2013"],"Country":"United States","Object Features":"Patterned Surface","Longitude":"-75.998884","Object Shape":"Cylinder","Date Submitted":"06/29/2013 01:10 UTC","City":"Oxford","Disposition":"Unresolved","divs":["Sighting DetailsEarlier in the day we had a violent thunder storm that had hail and tornadic like activity. I couldn't sleep because the weather channel said that there was another line of storms coming through, although they never did. I decided that I would just sit up in bed for a while and say my evening prayers.I was not tired. I have a habit before I go to bed at night that I always look outside my bedroom window because I love to look at the stars, and I was also checking on the weather that evening. There are no street lights where I live, it is very dark at night. We are surrounded by Amish farms. I like it dark when I sleep so all the inside lights were off as well. As I scanned the area I saw an object that I could not explain. It was cylinder in shape. It stood out against the night sky and it was a blotchy reddish orange color that pulsated. There was no noise; no airplanes, no animals, no cars, no thunder, nothing. It was dead silent. It was moving very slowly from right to left over my neighbors houses. I followed it with my eyes as it passed 2 houses, it had a steady path that was so slow I wondered how it was even staying up in the air. It was not fuzzy looking, it had a solid out line. Just under the top of the cylinder it had a thin lighter red band or ring that really stood out to me. As it approached the third house it simply vanished. It was just gone. Needless to say I stayed up and watched the sky for about another hour, and it didn't return. I still an amazed by what I saw, but at the same time it is somewhat unnerving. I do not drink. I do not do drugs. I am not crazy. I know what I saw."],"Log Number":"US-06292013-0002","Case Number":"48485","Region":"Pennsylvania","Summary":"I looked outside my bedrm window about 2:30 am. I saw a large cylinder shaped red object moving from right to left slowly above the tree line.","Tags":"City","Date of the Event":"06/24/2013 02:30 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/48485.html.txt","/var/www/straped/mufon/org/48485.html"],"Latitude":"39.785796","map":"<A HREF = \"http://maps.google.com/maps?q=39.785796,+-75.998884(48485)&iwloc=A&hl=en\"> mufon case (48485) map </A>","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed"}