{"Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Region":"Nebraska","files":["/var/www/straped/mufon/html2text/48486.html.txt","/var/www/straped/mufon/org/48486.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.798795,+-96.671554(48486)&iwloc=A&hl=en\"> mufon case (48486) map </A>","Summary":"Saw two star-like lights, 11:03 pm Central and 11:25 pm Central","trends":["There have been 42 other sightings in Lincoln","There were no other sightings in Lincoln on or around June 28th 2013"],"Case Number":"48486","Object Shape":"Star-like","Object Features":"Unknown","Log Number":"US-06292013-0003","Latitude":"40.798795","Source":"MUFON","City":"Lincoln","Country":"United States","divs":["sighting detailsfrom my deck i observed the first star-like light at 11:03 pm central time, to the sw about 20 degrees above the horizon, ascending to the north. duration was about 10 seconds before i lost sight of it due to roof overhang. no blinking lights associated with this star-like light. the second star-like light was observed at 11:25 pm about 30 degrees up from the ssw horizon, ascending and moving to the north. this second star-like light appeared to be either farther away or smaller. i watched it move from the ssw past the 90 degree mark overhead and then lost it against the night sky. it appeared to get smaller or farther away as it passed the 90 degree mark directly overhead. no flashing lights, just a solid star-like light. both lights were straight-line in their path\\direction. immediately after the 11:03 pm central sighting, i observed 3-5 planes in a west\\east and east\\west direction, to the south at about 30 - 40 degrees off the horizon. the planes all had flashing\\blinking lights. additionally there was a helicopter that made at least 3 passes at low altitude over this part of the city, appearing to fly from the se to the nw. it is not clear whether the plane traffic or helicopter was connected to the sightings, but my guess is that the activity was more than \"normal\" for this time of night, based on what i've seen in the past at this time. visibility is clear, low 70's in temperature, and very little if any wind. lots of stars visible in the night sky."],"Longitude":"-96.671554","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Disposition":"Unresolved","Date Submitted":"06/29/2013 01:11 UTC","Date of the Event":"06/28/2013 11:03 UTC","Tags":"City"}