{"trends":["There have been 134 other sightings in Kansas City","There were no other sightings in Kansas City on or around June 28th 2013"],"Log Number":"US-06292013-0004","map":"<A HREF = \"http://maps.google.com/maps?q=39.100826,+-94.572667(48487)&iwloc=A&hl=en\"> mufon case (48487) map </A>","Country":"United States","Date of the Event":"06/28/2013 12:00 UTC","divs":["Sighting DetailsI went out my back door to smoke a cigarette on the porch, and as I was standing there I thought I heard someone yell \"Let go of me\" or something of that nature. I walked out further into my backyard in the direction of the noise and was looking and listening in the distance trying to see if there was someone being attacked or if it was possibly just some older neighborhood kids playing around. As I was visually scanning the area I noticed a glowing red object in the upper northwest corner of my field of vision which immediately caught my attention. It looked like it was too low or too big to be an airplane. Also it did not blink at all - the color and light were consistent the entire time I saw it. It appeared to be somewhat elongated vertically and at its closest point to me, I may have seen a yellow \"flagpole-like\" light or beam coming out of the top. However, the most outstanding characteristic was the speed of the thing. It passed from where I saw it initially to several miles southeast of my house in a matter of seconds - so fast, it was like something falling (but not quite as fast as a shooting star) except it was traveling horizontally. In fact my first theory was that it was a shooting star, or meteor or some kind of space debris, but as it came closer I lost all confidence in that assessment. As a point of reference, a high flying plane passing over the length of my house would not even make it from end to end in the time this thing cleared my entire visible range of the sky. At one point I considered running into the house to grab my binoculars which were maybe 10 feet inside the house, but I was pretty sure I would miss it if I went inside even for the short period of time it would have taken me to grab them. For the most part, I did not feel threatened in any way. Although as it approached its nearest point I do remember thinking \" maybe I shouldn't be standing out here like a sitting duck\" and considered that I should probably go back inside - but of course I didn't. I finally lost sight of it as it got smaller and smaller moving away from me, then just seemed to vanish. I actually felt like I should have been able to see it diminish in size for a bit longer than I did. I was just very suddenly gone. * I have to add a disclaimer here that the beam part may be due to my own vision issues (seeing starbursts or fuzziness around lights), outside of that though, I am 100% confident as to what I saw.*"],"Sighting Duration":"Undisclosed","Source":"MUFON","Object Flight Path":"Straight-line path","Longitude":"-94.572667","files":["/var/www/straped/mufon/html2text/48487.html.txt","/var/www/straped/mufon/org/48487.html"],"Region":"Missouri","Tags":"City","Object Shape":"Cylinder, Fireball, Teardrop","Object Features":"Unknown","Summary":"Very very fast, glows reddish/orange but does not blink, vertically elongated, possibly a yellowish beam coming out of the top, larger or lower than a high flying airplane","Viewing Distance":"Unknown","Date Submitted":"06/29/2013 01:51 UTC","Case Number":"48487","Latitude":"39.100826","Weather Factors":"Unknown","City":"Kansas City","Disposition":"Unresolved"}