{"Viewing Distance":"501 Feet - 1 Mile","Summary":"Fireball straight line path, suddenly stopped and revealed saucer and just hovered before flying off.","Date Submitted":"06/29/2013 01:02 UTC","City":"Butler","Tags":"City","Object Shape":"Disc","files":["/var/www/straped/mufon/html2text/48497.html.txt","/var/www/straped/mufon/org/48497.html"],"Disposition":"Unresolved","Country":"United States","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.869376,+-79.885593(48497)&iwloc=A&hl=en\"> mufon case (48497) map </A>","Case Number":"48497","trends":["There have been 6 other sightings in Butler","There were no other sightings in Butler on or around June 12th 1969"],"divs":["Sighting DetailsI am trying to remember what year this sighting was. I believe it was called Gritzinger's Lake(?) in Butler. My mom was pregnant at the time. I have a brother born July 1966 another on May 1969 and last on September 1971. I believe it was 1969, but was wandering if anyone can pinpoint this event? I remember a large fire ball shooting through the sky and then suddenly stopped. At first we thought it was a meteor. It only took MAYBE a minute for the fire to disappear revealing a silver saucer shaped flying object just hovering maybe 500 yards away. There was no noise from the craft. The center looked like it may have had windows and looked like it was internally illuminated. We could see what looked like figures at the windows but it was just a little too far away. I remember being extremely scared when I saw the transformation from fireball to saucer. There were colored lights on the bottom. We gathered up our things, as did other people at the lake and went to our cars. My dad drove along the dirt road and the craft followed the cars. Once we hit the highway, I watched as it took off at a very high rate of speed into the night sky. I was wandering if anyone else ever reported this? Are you able to find out anymore info and relay it back to me? I have told a few people about this and of course I was teased and ridiculed. I thought about Kecksburg, but it never landed AND it flew off. Never went fishing back there again, however I would like to visit it but cannot find this place. My parents have since passed, and would never talk about it except the name of the lake and that was it. Not sure if that is the correct spelling of the lake, or if it just SOUNDS LIKE Gritzinger's Lake."],"Object Features":"Dome, Window(s)","Sighting Duration":"Undisclosed","Object Flight Path":"Path then hovering","Longitude":"-79.885593","Log Number":"US-06292013-0013","Latitude":"40.869376","Weather Factors":"Unknown","Date of the Event":"06/12/1969 12:00 UTC","Region":"Pennsylvania"}