{"Object Flight Path":"Path with directional change","Disposition":"Unresolved","Case Number":"48499","Tags":"City","divs":["Sighting Details1. Sitting in front yard on couch with husband, watching the stars- and airplanes - overhead. 2. Appeared to be a plane or jet coming INTO the airfield 3. An airplane 4. Was on a normal landing path towards airfield but there were no blinking lights so we both watched it. Light appeared to be moving straight in, then ?hovered right to left. moved horizontally West to South. At wich point i pointed with my left hand toward the light and was shocked between my pointer and middle fingers before getiing into a full pointing position. my husband saw the very apparent reaction to being shocked and i actually saw the electricity enter my hand. The light then moved faster creating a waterlike wave in the sky, as though looking through wet glass I could see the body of a dragon-like shape down to it's scales, but not clear by any means. The light faded in thin air to a South-West direction. 5. I was scared and felt like running untill I was shocked. then I immediately felt as if my job was to sit still, watch and understand. I didn't move or speak for at least another 1-2 minutes. 6. Again, the light just faded and dissolved into the atmosphere. It was gone"],"Log Number":"US-06292013-0015","Date of the Event":"05/20/2012 12:00 UTC","Object Features":"Other","Viewing Distance":"101-500 Feet","Date Submitted":"06/29/2013 02:22 UTC","Sighting Duration":"Undisclosed","Object Shape":"Other","Latitude":"42.233557","files":["/var/www/straped/mufon/html2text/48499.html.txt","/var/www/straped/mufon/org/48499.html"],"Country":"United States","Source":"MUFON","Weather Factors":"Unknown","Summary":"saw assumed plane- stopped forward motion, came straight toward- disolved in thin air","Region":"Oregon","City":"Klamath Falls","map":"<A HREF = \"http://maps.google.com/maps?q=42.233557,+-121.77533(48499)&iwloc=A&hl=en\"> mufon case (48499) map </A>","trends":["There have been 19 other sightings in Klamath Falls","There were no other sightings in Klamath Falls on or around May 20th 2012"],"Longitude":"-121.77533"}