{"Date Submitted":"06/29/2013 07:14 UTC","Latitude":"41.28781","Summary":"just a night out fishing","Country":"United States","Longitude":"-88.285618","Log Number":"US-06292013-0020","Object Features":"None","Viewing Distance":"Over One Mile","Source":"MUFON","City":"Coal City","Region":"Illinois","Object Flight Path":"Path with directional change","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=41.28781,+-88.285618(48504)&iwloc=A&hl=en\"> mufon case (48504) map </A>","Sighting Duration":"00:03:00","Date of the Event":"07/15/2011 11:17 UTC","Weather Factors":"Unknown","divs":["Sighting Detailsmyself and a friend was bass fishing at night. using surface lures i caught a 3# bass released it lit up a smoke leaned back in the seat looked up to check out the stars..i then saw a satilite moving from south to north i pointed it out to my buddy and we watched it moving like a satilite should we were faceing south when it got to oure 10:30 position aprox..it lite up bright.a real bright white..it then id what i call a J HOOK and was going to fast for any satilite it was out of sight and over the horizion in 1 maybe 2 seconds it was at high altitude no sound ..i looked at my buddy and his response was wtf.....it blew my cookies.....i stated i hope that was military..but we have nothing that could move that fast or turn that sharp and that fast..before i could finish my cig. the south horizion,out of oure line of sight was several briliant pure white flashes....we joked that was some starwars sht and we called it a night.i am ex army my buddy lived their for 10+yrs it is a private lake...i used to joke and heckle all ufo sightings ..nothing like getting gang probed by ET..in closing i know that i saw something that was not from this planet and my friend stands with me on this one..every time i think back or we discuss this it freaks me out was it military can a satilite move in that fashion did we have a 70s flashback lol i dont drink or smoke anything funny for the last 30 yrs i am in my mid 50s and of sound mind.....thank you for letting vent i am sure you folks take this a little more to heart than some of me other friends.when this subject comes up yes i am at the blunt of their jokes......."],"files":["/var/www/straped/mufon/html2text/48504.html.txt","/var/www/straped/mufon/org/48504.html"],"Object Shape":"Bullet, Missile, Flash, Sphere, Star-like","trends":["There have been no other sightings in Coal City","This sighting has never been favorited."],"Case Number":"48504","Tags":"City"}