{"Source":"MUFON","City":"Minneapolis","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.01864,+-93.234573(48510)&iwloc=A&hl=en\"> mufon case (48510) map </A>","Viewing Distance":"501 Feet - 1 Mile","Summary":"Pulsating orange/yellow/red orb with starlike features, FAST!","Object Shape":"Fireball, Oval, Star-like","Log Number":"US-06302013-0001","Sighting Duration":"Undisclosed","Tags":"City","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Case Number":"48510","Disposition":"Unresolved","Date Submitted":"06/30/2013 12:04 UTC","divs":["Sighting DetailsI just left the house for an after-dinner walk and as I was about 100 yards N, I saw an orange-yellow pulsating \"star-like\" object moving rapidly from NE to SW in an almost straight path. As I watched trying to identify the object (I'm a private pilot), it stopped, moved S, halted, then moved N, then resumed its original path, all within a few seconds. It was completely silent, there was no sound whatsoever associated with the object (or any other object in the sky). I knew then this wasn't any typical aircraft. There was no other air traffic in view near the object and no real cloud cover. A light breeze of maybe 5 knots. I would estimate its altitude at least 5000 ft but it was hard to judge as the object was VERY bright but not really \"emitting\" light, more like just \"being really bright in a star-like way\" if that makes sense..? The light coming off of it was alternately bright and less bright, pulsating between yellow-orange and red-orange in color. The color seemed to \"dull\" as the object changed directions, but its directional changes were VERY fast and VERY brief & abrupt, then it would resume its SW path. As the object moved behind a large tree across from the school parking lot, I tried to gain a better view but when I came around I noticed it had stopped and was mid-directional change again, then resumed its SW path. It seemed to accelerate its movement at that point (still headed SW), because it then covered the distance from approx. 2-3 miles NNE to almost directly above me to 2-3 miles SW of my home (a ground distance of prob. 10 miles total) in about 10 seconds. The object continued to accelerate so I ran back and into the house to grab my wife (it took maybe 60 seconds total to run back, get her, and come out, and I was watching the object moving SW right up to the point where I went inside). I really wanted her to see it too, but when we came out to the backyard I described what I was seeing and we both scanned the entire sky and it was nowhere to be seen. I was bummed. I had seen the unexplained \"orbs\" on YouTube and this looked like a very similar to many of those. I wish I had seen its \"departure\" or had my phone on the walk."],"Longitude":"-93.234573","files":["/var/www/straped/mufon/html2text/48510.html.txt","/var/www/straped/mufon/org/48510.html"],"Object Features":"Unknown","Date of the Event":"06/29/2013 10:38 UTC","Country":"United States","Region":"Minnesota","Latitude":"45.01864","trends":["There have been 52 other sightings in Minneapolis","There were no other sightings in Minneapolis on or around June 29th 2013"]}