{"City":"Las Vegas","divs":["Sighting DetailsMay 21, 2006, 10:45 AM: From room 3072 of the Paris Hotel, I was watching airplanes approach from over the hills east of Las Vegas, turn and land at McCarran airport. At the point where the planes were turning I noticed a small object, that I initially thought was a balloon, coming towards the strip. In less than 5 minutes from when I spotted it, the object slowed down above the Wynn golf course area. It stayed in this area for about 5 minutes. It was not stationary at this point, but moving slowly westward. It then started picking up speed and moving in a north westerly direction and was out of my site in less than 5 minutes. It was barley visible as it left my field of view from the hotel window. From the point that it slowed down, I had a decent view of the object as it was directly in front of me. It was fairly high up, but well under the cloud cover. The object appeared mostly white with a patch of darker, gray on it. It seem as though it was probably the size of a car or van. The shape was not perfectly round; it seemed as though it was more pyramid shaped but very rounded. It also looked to be rotating. I am not sure what it was, but I could tell that it was not a balloon. It was not bobbing with the wind and the size was much too large for the height that it was at. It was not a plane as it would have dropped out of the sky as it moved slowly over the Vegas strip area. There were helicopters flying well north of the object and were clearly visible as helicopters. It was not an object I could identify and I did have a fairly close and clear view of it."],"Log Number":"US-05282006-0002","Date of the Event":"05/21/2006 10:45 UTC","Object Shape":"Diamond, Oval, Sphere, Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=36.123726,+-115.167606(4851)&iwloc=A&hl=en\"> mufon case (4851) map </A>","Object Features":"None","files":["/var/www/straped/mufon/html2text/4851.html.txt","/var/www/straped/mufon/org/4851.html"],"Longitude":"-115.167606","Summary":"Small white object over Las Vegas","Sighting Duration":"Undisclosed","Region":"Nevada","Disposition":"Insufficient Data","Latitude":"36.123726","Case Number":"4851","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around May 21st 2006"],"Date Submitted":"05/21/2006 10:45 UTC","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Weather Factors":"Unknown","Source":"MUFON","Tags":"City","Country":"United States"}