{"map":"<A HREF = \"http://maps.google.com/maps?q=42.37281,+-83.34525(48529)&iwloc=A&hl=en\"> mufon case (48529) map </A>","Longitude":"-83.34525","Object Features":"None","Disposition":"Unresolved","Date Submitted":"06/30/2013 02:50 UTC","files":["/var/www/straped/mufon/html2text/48529.html.txt","/var/www/straped/mufon/org/48529.html"],"Weather Factors":"Unknown","City":"Livonia","Object Shape":"Circle","Latitude":"42.37281","Date of the Event":"06/29/2013 03:25 UTC","trends":["There have been 16 other sightings in Livonia","There were no other sightings in Livonia on or around June 29th 2013"],"Viewing Distance":"21-100 Feet","Sighting Duration":"Undisclosed","Summary":"3 reddish orange objects flying through the sky, appearing one at a time and leaving one at a time.","Region":"Michigan","Case Number":"48529","Country":"United States","Tags":"City","divs":["Sighting DetailsIt was just before 3:30 in the morning when my friends and I were in my back yard. I had just mentioned to them that it seemed unusually bright out for the time of night that it was. We heard a loud boom that seemed like it was coming from the south (our left). It sounded like an M-80 went off, or something bigger. We looked to the north (out right) and saw a big flash of light from behind a tree. Immediately after the flash something that looked like a reddish-orange fireball appeared from behind the tree (from our vantage point) and began to move through the sky above us. It did not fit any description of any aircraft we've ever seen or know of. It didn't keep a straight path, but would zig and zag, while still moving in the general direction of going south. It even stopped and hovered in the sky at one point. While our eyes were transfixed on the hovering orb-like object, a second object with the same appearance came out from the same area as the first one. When that happened the first object continued moving south. A third object (with the same appearance) then appeared and joined the second object. They \"flew\" close together while the first object continued moving south and disappeared into the clouds. The remaining two then began moving in that direction, still with a zig-zag pattern and periodically stopping, until they too disappeared into the clouds. The entire experience was only a few minutes. The objects made no noise while they were in the sky. The only noise we heard was the initial boom sound. We were all in awe of what we'd seen and waited a bit longer to see if the objects would re-appear, but we didn't see them again after that."],"Log Number":"US-06302013-0019","Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering"}