{"Region":"Utah","divs":["Sighting DetailsAt approximately 0040 on 30JUN2013, I stepped exited my house and stood on the back porch to have one last cigarette before bed. The street where my house sits runs directly North-South. Probably 90% of all streets in the smaller Utah cities run either directly North-South or directly East-West. The back of my home faces directly 270 degrees west. While smoking, I was looking up at the stars, and enjoying a beautiful clear view of the sky. One star, situated at about 70 degrees elevation, at 270 degrees west, suddenly increased 10X (times) in both brightness and intensity. The star flashed brightly for one, may two seconds, then simply disappeared. The star was NOT in the middle of any clouds, and I remained outside, studying the stars for another 10 minutes, searching for any aircraft or anything that could explain what I had just witnessed. I live near both an Air Force Base and an international airport. I am retired military, so I know what airplane lights look like. While searching the sky, I saw NO other aircraft, No other odd lights, No moving lights or stars (such as a satellite or high flying aircraft), I saw no blue or red lights which would normally accompany the wings of an aircraft that would have been either arriving or leaving any of the nearby airports. Since the 4th of July holiday is near, NO BASE OPS have been ongoing for the last few days, meaning, I have not heard any F-16's, A-10's, or C-130's for a few days now, which rules out what I saw being any nearby military aircraft. Since it was the 29th and 30th of the month, NO Air Reserve OPS were ongoing. I have seen some strange things in the western sky at night in the past, more specifically on a heading of 210 degrees from my back porch, which would take my line of sight directly towards the Dugway Army Test Range and Test Center."],"Sighting Duration":"00:00:02","Date Submitted":"06/30/2013 03:11 UTC","Tags":"City","Date of the Event":"06/30/2013 12:00 UTC","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=41.142566,+-112.047158(48530)&iwloc=A&hl=en\"> mufon case (48530) map </A>","Viewing Distance":"Over 1 Mile, Unknown","files":["/var/www/straped/mufon/html2text/48530.html.txt","/var/www/straped/mufon/org/48530.html"],"Summary":"Brightness and intensity of star increased ten-fold, then vanished","Longitude":"-112.047158","Latitude":"41.142566","City":"Clinton","Object Features":"None","Weather Factors":"Unknown","Log Number":"US-06302013-0020","Country":"United States","Object Flight Path":"Stationary","Source":"MUFON","Case Number":"48530","trends":["There have been 4 other sightings in Clinton","There were no other sightings in Clinton on or around June 30th 2013"],"Object Shape":"Star-like"}