{"Object Flight Path":"Other","Log Number":"US-06302013-0021","Region":"Texas","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","City":"Humble","Viewing Distance":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/48531.html.txt","/var/www/straped/mufon/org/48531.html"],"Disposition":"Unresolved","Object Shape":"Blimp, Oval","Source":"MUFON","Longitude":"-95.240124","map":"<A HREF = \"http://maps.google.com/maps?q=29.99282,+-95.240124(48531)&iwloc=A&hl=en\"> mufon case (48531) map </A>","trends":["There have been 7 other sightings in Humble","There were no other sightings in Humble on or around June 30th 2013"],"divs":["sighting detailsjune 30, 2013 i live on the flight path to bush intercontinental airport (iah). i was sleeping & i woke up to the sound of a jet coming in for a landing. it was unusual because they usually don't have a lot of planes coming from that direction after about midnight or 1am & i knew it was later than that because i went to bed a little after 1am. i could see a bright light shining through my shades. (i have matchstick shades w\\ a canvas backing. they are for privacy, not light blocking) and i remember thinking, \"the moon is really bright tonight.\" i was laying there trying to go back to sleep when i saw the light slowly move from the right side of my window to the left side. and i thought, \"the moon can't move like that.\" and i sat up & watched the light slowly move back to the right & as it was moving i noticed that the light appeared to be shimmering. i opened the shade to get a better view of the sky & the light wasn't the moon. the moon was peeking out from behind a cloud & it was a half moon & an orange color. the light i was seeing was bright white, oval\\football shaped and under the clouds. it was a shimmering light, like the way sunlight plays on the surface of choppy water, except this was in the sky. there were faint rainbows at the edges of the light and it was just moving back & forth across the sky. i kept thinking, \"am i really seeing this. am i dreaming? is this real? what is it?\" i looked away, rubbed my eyes to make sure i was awake, & looked back & it was still there. and then i thought, \"oh my god, where's my phone.\" i ran to get my phone to film it & when i got back it was gone. i was facing east, it was about 45 degrees above the horizon. the moon was above the clouds & about the size of a nickel. the light was below the clouds & about the shape of a football but the size of a tennis ball maybe a little bigger. i checked the time when it was all over & the clock read 3:17 am. i checked iah's website & they had qatar airways 6075 from atlanta land at 3:30 am & that was the only plane that came in at that time & it was late it had been delayed 80 min in atlanta. i have no idea what it was. i would expect it to be explained as some sort of astronomical phenomenon like aurora borealis or ball lightening."],"Summary":"White Shimmering Light in eastern sky about 3:12 to 3:17 AM June 30, 2013","Date of the Event":"06/30/2013 03:17 UTC","Object Features":"None","Date Submitted":"06/30/2013 03:22 UTC","Country":"United States","Case Number":"48531","Latitude":"29.99282"}