{"Region":"Kansas","Log Number":"US-07012013-0002","Longitude":"-94.625904","map":"<A HREF = \"http://maps.google.com/maps?q=39.122133,+-94.625904(48538)&iwloc=A&hl=en\"> mufon case (48538) map </A>","Country":"United States","Object Shape":"Triangle","City":"Kansas City","Object Features":"Unknown","Source":"MUFON","Case Number":"48538","Object Flight Path":"Path with directional change","Viewing Distance":"101-500 Feet","Date of the Event":"06/30/2013 11:04 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/48538.html.txt","/var/www/straped/mufon/org/48538.html"],"Date Submitted":"07/01/2013 01:04 UTC","Tags":"City","trends":["There have been 27 other sightings in Kansas City","There were no other sightings in Kansas City on or around June 30th 2013"],"Summary":"It was hovering/flying in the general direction of a train that has been stalled on tracks for a few hours.","Latitude":"39.122133","divs":["Sighting DetailsMy girlfriend and I were driving to get ice cream, but we could not drive on our usual route because it required crossing the train tracks. There was a train stalled on the tracks for a number of hours, and there was no sign of it being repaired. So, onward we went, through some back roads to get to Price Chopper for ice cream. I first noticed what I thought was a red star, but then I noticed that it was moving. To my surprise, I noticed that the alleged star was moving, and moving towards our car. The red-orange light was moving smoothly towards us from the north. It was flying noiselessly and slowly turning southwest. As it was passing overhead, we noticed its wedge shape, similar in shape to a slightly rounded isosceles triangle. We stopped in the middle of an intersection to watch it as it flew over us. Nobody else was on the street. My girlfriend felt unnerved by its silence. I felt excited by the sighting, and wanted to follow it, but as it got closer, I felt a little unnerved as well. We turned east to continue on our errand, and then we turned south. As we turned south, we spotted the object again, flying over the treeline. The object was moving in the same direction that we were traveling. We lost sight of it under the treeline. We looked for the object in the sky in the parking lot of price chopper, but did not see anything."],"Disposition":"Unresolved","Sighting Duration":"00:03:00"}