{"Object Shape":"Bullet, Missile, Triangle","files":["/var/www/straped/mufon/html2text/48532.html.txt","/var/www/straped/mufon/org/48532.html"],"Weather Factors":"Unknown","Date of the Event":"06/29/2013 08:38 UTC","Disposition":"Unresolved","Region":"Tennessee","Sighting Duration":"Undisclosed","Log Number":"US-06302013-0022","map":"<A HREF = \"http://maps.google.com/maps?q=35.056688,+-84.868554(48532)&iwloc=A&hl=en\"> mufon case (48532) map </A>","Case Number":"48532","divs":["Sighting DetailsTime was 8:38 pm, my daughter (15) and I were outside playing badmitton. We always wait to go out until later because of the heat. It was a clear cloudless day. We had reported another UFO in same area and same flight path back in April on here. Well, once again moving slowly, almost as if floating but with a path of constant movement I said to my daughter, look there is that object again. I told her I want to see this close up and ran into the house for binoculars (thats all I have to magnify it). So when I came back out my daughter had come up onto our back deck and said in an excited voice, look there are two of them. Well the first one that caught my attention was moving from SE to NW. This other object was moving from NW to SE, they did pass by each other rather close and I thought they might collide, of course they didnt. Neither one of them made a sound. So I held up my binoculars, and first observed the 1st object, moving from SE to NW, it was long and white with a black pointed tip, and no observable wings. Then I looked at the other object moving from NW to SE and it was triangular silver shiney, no wings. I had my daughter observe them as well and she saw what I had seen as she described them out loud to me. But the rocket one she said had what appeared to be flames coming from the back of it. I took another look and sure enough there were orange yellow, what appeared to be flames, but they were not flowing like flames. More a steady light source. Well, my daughter had turned on her cell phone camera, and said look mom I can not even see these objects in my phone. All you could see was blue sky. She kept trying to capture one of them but they never showed up on her camera. This is the second time we have had this kind of thing happen, in our April report we actually did see aliens in the trees and an oragne light and felt rain on a cloudless clear evening. There is something going on here that I can not figure out. I would love sonme answers,but I suppose we all would on all these cases reported. I have reported several things to MUFON, you know what they are all in the same location. In our yard I mean. Out back."],"Date Submitted":"06/30/2013 05:06 UTC","Country":"United States","Object Features":"None","City":"Cleveland","Viewing Distance":"Unknown","Latitude":"35.056688","Source":"MUFON","Object Flight Path":"Path with directional change","Tags":"City","Summary":"Playing Badmitton with 15 year old daughter observed what we thought was same object we observed in April, this time there were two objects","Longitude":"-84.868554","trends":["There have been 7 other sightings in Cleveland","There were no other sightings in Cleveland on or around June 29th 2013"]}