{"Disposition":"Unresolved","Case Number":"48545","Date of the Event":"06/30/2013 10:05 UTC","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","divs":["sighting detailsabout 5 minutes after 10 pm, hm the dog outside but came right back in and called for me (mg) to come look at something in the sky. it was a ufo. then there was a second one, and then a third one. after i saw the first one, i ran back in the house and got my mobile phone and came back outside and took one short video and one photo. i knew the resolution would be nothing like seeing it in person and it was also after the ufos had already become much smaller, too. hm got his camera which is much higher resolution than my phone camera and took three videos. but again, this was already after the ufos were smaller than they first appeared. the ufos looked like hot air balloons might look with bright, flame-like, flickering, intensely red lights in the center, but they did not move like hot air balloons would move. the clouds were moving slowly toward the ocean (south\\southeast), but these ufos were not moving that direction. the first one moved quickly inland and became blurry and larger and dimmer as it went, and moved faster and faster. before the first one disappeared, the second one appeared and it was very bright and red and flickering like fire in the center. it was up really high, like they all were, and it also moved inland and became smaller and smaller and disappeared. the third one appeared, all bright and red and flickering and distinct, but it soon started moving up higher and moving away and it also became smaller and disappeared upwards and to the south\\southwest. after all this we were still looking at the sky to see if there would be any more of them when there was a \"shooting star,\" meteorite, or whatever. (also, we moved to this location only a month ago so we don't know how rare this is, but 9 hours before this happened, the power went out here for 30 minutes. the next door neighbor, who has lived here a long time, told me that never happens here, but other neighbors doubt her memory, so i don't know which is it, but the power company reported the outage affected from 100 to 300 houses. additionally, about a week previous, a fighter jet strafed this location. it was extremely low and extremely fast and extremely loud, so much so that the locals came out to see what was going on. it was very unusual. aircraft are lot allowed to fly that fast and that low in populated areas. it was very strange.) the ufos looked the way hot air balloons would look, but they also looked like flares attached to balloons or parachutes would look, except for the fact that they moved contrary to the wind direction. the next morning i called the local air national guard and coast guard. i asked them if they might know what these ufos were and if there were any military aircraft exercises the previous night. all i got from them was an instant, \"no, no, no sir, we don't know what that is, we haven't had any reports of that, there weren't any military exercises last night.\" neither of them wanted to talk about it or suggest any possibilities for what the ufos might have been."],"Object Shape":"Sphere","Date Submitted":"07/01/2013 12:18 UTC","Log Number":"US-07012013-0009","files":["/var/www/straped/mufon/html2text/48545.html.txt","/var/www/straped/mufon/org/48545.html"],"Tags":"City","Sighting Duration":"Undisclosed","Object Features":"Unknown","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 6 other sightings in Galveston","There were no other sightings in Galveston on or around June 30th 2013"],"Region":"Texas","Latitude":"29.260204","map":"<A HREF = \"http://maps.google.com/maps?q=29.260204,+-94.840049(48545)&iwloc=A&hl=en\"> mufon case (48545) map </A>","Longitude":"-94.840049","Country":"United States","Source":"MUFON","Summary":"Three UFOs in Galveston TX at 10 PM on June 30, 2013","City":"Galveston"}