{"Date Submitted":"07/01/2013 12:46 UTC","Object Shape":"Sphere","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-79.82429","Sighting Duration":"Undisclosed","Object Features":"None","Weather Factors":"Unknown","Country":"United States","Latitude":"42.242257","Log Number":"US-07012013-0010","Region":"Pennsylvania","Case Number":"48546","Source":"MUFON","Date of the Event":"06/29/2013 10:10 UTC","Summary":"Four Orange Orbs Over Lake Erie near North East, PA","Object Flight Path":"Hovering then path,Path then hovering","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.242257,+-79.82429(48546)&iwloc=A&hl=en\"> mufon case (48546) map </A>","files":["/var/www/straped/mufon/html2text/48546.html.txt","/var/www/straped/mufon/org/48546.html"],"City":"North East","Disposition":"Unresolved","trends":["There have been 3 other sightings in North East","There was one other sighting in North East on or around June 29th 2013"],"divs":["Sighting DetailsMyself and two other family members were walking our dogs down Lakeside Drive in North East, Pennsylvania (a town just northeast of Erie, PA) at around 10:00pm near our home when we saw an orange orb traveling over Lake Erie, less than a quarter-mile from the beach which is located down the lake bank that runs parallel to the street (the bank drops about 30 feet to the beach below). The orb traveled west to east across the lake and it was flying low at around 200 feet. It was a solid orange glow, similar to a flare but not pulsating and there was no trail or sparks behind it. There was a single blinking white light at the rear of the object but no visible wings or any other lights that one would see on a plane. It traveled in a slow arc across the lake and we moved to the edge of the lake bank to get a closer look. The sky was growing dark but was not pitch black in the area we were looking because the sun sets direct over the lake, in the horizon in the direction of Canada. 30 seconds later we saw another orange orb of the exact same appearance (orange orb with a blinking white light in the rear) move in the same flight pattern behind the previous object. When it moved across our field of vision, we lost sight of the first object behind some trees along the lake bank. The second object also soon disappeared behind these same trees from our field of vision. 30 seconds after this second object disappeared, two orange orbs appeared, one following the other in the same direction, travelling west to east. Both objects stopped and hovered over the water. The one in front suddenly lost its orange glow but a solid object remained silhouetted against the sky and changed directions northward in the direction of Canada. During this time, the object in the rear slowly descended to the water below. It landed on the water and stayed there for 10 seconds before the orange glow suddenly darkened and there object sank into the water, leaving ripples behind that were visible by the faint bit of moonlight across the lake. Two men in a truck pulled up near our road after the objects were out of our sight and told us they were looking for a way to view a lightweight air craft that they were told was being launched over the lake. I believed at the time that they must have heard something on a police scanner about some sort of demonstration over the lake but I have yet to hear anything in the Erie Times or on the news. After about 10 minutes we saw fire trucks and police cars heading in the direction of Orchard Beach Park, in the direction from where the objects originated in our field of vision. We also saw a Coast Guard vessel and two police boats searching the water where the last orb sank. After using search lights they eventually stopped and focused on one area, the same area where we saw the object sink. So far no one else has reported this sighting to my knowledge."]}