{"Region":"Illinois","Date of the Event":"06/30/2013 07:25 UTC","Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/48551.html.txt","/var/www/straped/mufon/org/48551.html"],"City":"Undisclosed","Longitude":"-89.393428","Summary":"Saw black oddly shaped craft with red and blue lights soar over the neighborhood in broad daylight","Disposition":"Unresolved","Case Number":"48551","map":"<A HREF = \"http://maps.google.com/maps?q=40.643025,+-89.393428(48551)&iwloc=A&hl=en\"> mufon case (48551) map </A>","Sighting Duration":"Undisclosed","Country":"United States","Log Number":"US-07012013-0015","Source":"MUFON","Object Shape":"Unknown","Object Features":"Unknown","trends":[],"Viewing Distance":"101-500 Feet","divs":["Sighting DetailsMy husband and I were sitting in the back yard Saturday night around 7:20 pm when he pointed out something odd in the sky. It was black and when I first saw it I thought it was just a bunch of 3 very large black balloons floating to the south of us. It was such an odd shape that I ran to the middle of the yard to get a better look and while I couldn't discern what it was because the shape was so odd, I was going to dismiss it as a bunch of balloons based on it's movement. But, as I stared at it I saw toward the top red and blue flashing lights - and that's when my heart stopped because it hit me I had no idea what it was I was looking at. It was low, and nearby. Too low to be a plane, chopper, kite, etc. There was a sound that sounded like an engine, sort of a low hum but for some reason I didn't associate it with the craft. It didn't seem to \"fit\". So as I was watching it I was trying hard to see the shape. It was still very bright out and I could see that it was jet black with a sort of \"T\" shape. The top of the \"T\" being some sort of wings or blades, and the \"leg\" of the \"T' being dragged below it. The top of the \"T\" looked sort of bulbus and the lights were at the top. I really don't know how to describe it because I couldn't really make it out it was moving pretty fast, it seemed to almost float. As it was heading south it was decending until it went out of view, not far from my home. My husand and I were both convinced it may not have been big enough to be piloted by anything, but not small enough to be some fancy remote controlled toy. maybe it was a drone? It moved like a floating black icecream cone with circular wings and lights at the top with the \"cone\" dragging below it. It was strange at how black it was. I wish I knew what it was."],"Date Submitted":"07/01/2013 05:44 UTC","Latitude":"40.643025"}