{"Object Features":"Appendage(s)","Object Flight Path":"Straight-line path","Case Number":"48566","Longitude":"-81.438686","Country":"United States","Source":"MUFON","Region":"North Carolina","Viewing Distance":"Over One Mile","Tags":"City","Summary":"Cluster of boxes that appeared to be in orbit.","City":"West Jefferson","Date Submitted":"07/02/2013 06:15 UTC","trends":["There have been no other sightings in West Jefferson","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Shape":"Unknown","Log Number":"US-07022013-0011","Latitude":"36.346686","Date of the Event":"06/10/2013 10:30 UTC","files":["/var/www/straped/mufon/html2text/48566.html.txt","/var/www/straped/mufon/org/48566.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.346686,+-81.438686(48566)&iwloc=A&hl=en\"> mufon case (48566) map </A>","divs":["Sighting DetailsI was walking from my storage building returning from starting a fire in a boiler we use to heat our potable water. Upon looking up at the stars for a minute I saw something moving. After focusing on it I was able to see that it looked like a cluster of boxes seemingly all connected moving in unison. I was very excited thinking I was looking at the space station. I was only able to watch it for less than a minute when it disappeared into the tree line. It appeared to have at least two white external lights and I could see it clearly enough to see different colors of grays on the various surfaces of the box like shapes making it look very much three dimensional. I saw at least three boxlike shapes. All of this made me believe it was the space station. I didn't think much about this until I was describing this to my cousin, an electrical engineer who is working on the reentry vehicle for NASA. He is also a star watcher. He said it would be impossible to see the kind of detail I described if I were actually looking at the space station due to its high altitude. This convinced me to report this. I would conclude that either this is a true UFO or it was actually the space station that somehow was enlarged due to some optical modification like the harvest moon enlarging due to refraction at the horizon. In either case it was an incredible sight."],"Weather Factors":"Unknown"}