{"Region":"New York","map":"<A HREF = \"http://maps.google.com/maps?q=42.770548,+-78.609759(48564)&iwloc=A&hl=en\"> mufon case (48564) map </A>","divs":["sighting detailsi was 11 at the time, my mother and older sister were in the garage. it was early evening and i was shooting baskets. off in the distance, about 1\\2 mile i saw a light coming at me. i was thinking after i looked again , \"wow that's a low flying plane or helicopter,\" i heard no noise. that's when i felt it wasn't a plane or chopper. i kept looking as it slowly came over the treetops. most of the trees were maple trees, and i would say approx 75-120 ft tall around . as it got within 1,000 ft of me, it was now more or less in the open as it glided over the backyards. i started to feel helpless and stared at it , wondering what it was. our garage had the basketball hoop on it and i was facing it as i stated earlier, shooting baskets. i then turned and to my front now faced the cherry tree we had on our property line. the cherry tree stood approximately 12-15 ft. high. the object was now clearly not man-made at all, even at eleven i realized it right away. i saw a sphere like object sort of flat on the bottom. it was a yellowish color, not glowing or anything like that, not round as it kind of flattened out on the bottom, like it was the \"cockpit\" and it was approximately 25-30 ft. across. i say \"cockpit\" as it was then about 250 ft. above and about 50 degrees i saw them. i now clearly saw 2 occupants and they were silhouetted by the \"cockpit\" light. the one to my right was apparently standing up, arms spread apart standing upon the \"control panel?\". the other occupant was sitting down, as i could only see \"it's\" shoulders and head. both figures were silhouetted, but they had round looking heads, slim bodies. the craft may of been gliding slow for this took like 10-15 minutes to observe. as it passed overhead, i remember no shape to it, i stuttered out to my sister **** come here look!. i looked back and the craft now slowly had already climbed into the sky and within the few seconds it took for me to cry out and her to come out of the garage it was gone. she said she didn't see it, but due to my excitement, knew i had just seen something. i jumped on her bicycle and rode to the school parking lot, about 1500 ft. away. i didn't see anything but stars. i have reported this before 2x in my life, once to some online site that claimed they were reputable, the name i don't remember as it was like 30 some years ago i did that. i also had reported it to mufon about 6 years ago, never heard nothing. i also asked for the disclosure project aka dr. greer to contact me, all i got was an auto response. i was in the military and carried a tsci of top secret umbra with gamma access. i also had a second sighting, which was seen by myself, my sister, and my uncle and aunt. it was noted on a radio station too that night. i will submit that report as well, if anything becomes of this one. the proverbial ball is in your court."],"City":"East Aurora","Case Number":"48564","files":["/var/www/straped/mufon/html2text/48564.html.txt","/var/www/straped/mufon/org/48564.html"],"Longitude":"-78.609759","Object Shape":"Sphere","Sighting Duration":"Undisclosed","Object Features":"Unknown","Weather Factors":"Unknown","Viewing Distance":"21-100 Feet","Country":"United States","Object Flight Path":"Path with directional change","Disposition":"Unresolved","Summary":"A ball of light no noise came at me above the treetops. It cam within 2000ft and i saw it was carrying 2 occupants. One was standing with arms spread out , the second was sitting","Date of the Event":"06/14/1970 09:30 UTC","Date Submitted":"07/02/2013 03:10 UTC","Log Number":"US-07022013-0009","Tags":"City","trends":["There have been 2 other sightings in East Aurora","There were no other sightings in East Aurora on or around June 14th 1970"],"Latitude":"42.770548","Source":"MUFON"}