{"Object Shape":"Disc, Oval","Summary":"Two glowing objects in the sky that seem to be traveling together over Brossard, QC","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","City":"Brossard","Viewing Distance":"Over One Mile","trends":["There has been one other sighting in Brossard","There were no other sightings in Brossard on or around July 9th 2006"],"Sighting Duration":"00:00:05","Log Number":"CA-07022013-0006","divs":["sighting detailsjuly 9th 2006 8:30pm est on this slightly cloudy summer night, my wife, son and myself were visiting our newly bought land near quartier dix30 in brossard, qc. we spent a good 20 minutes walking around on our land and i took a number of pictures with my canon powershot a620 camera. at the time we were there, there were no sounds, no stars or planes in the sky. you could only see a blue sky with high altitude cloud levels. at 8:45pm est i took a picture of my wife and son overlooking the land where you can see the houses being built nearby. the view also provided a clear view of the sky. at the time i took the picture there was nothing in the sky. after our visit, we left the area and headed home. it is only a number of years later that i noticed, while re-examining the pictures, that the picture i took of my wife and son was also showing 2 glowing objects in the sky that seem to be traveling together (approx 1\\2 mile apart). one of these glowing objects seemed to show a small but visible trail. the object with the trail seemed to show a disc-like shape. as i explained initially, when i took this picture there was nothing in the sky. these 2 objects only appeared on camera. when i took the picture the flash was on as well as the ir (infra-red) light to help minimize rabbit eyes. i'm not sure if this somehow contributed to the appearance of these objects but when i took the picture there was nothing in the sky that was visible to the naked eye. today i am quite certain that these are actual ufo objects which were not meant to be seen by the naked eye. the image submitted to mufon is the original high-res picture. it has not been modified or changed in any way. it also contains the complete exif metadata information."],"Country":"Canada","Source":"MUFON","files":["/var/www/straped/mufon/html2text/48560.html.txt","/var/www/straped/mufon/org/48560.html"],"Longitude":"-73.444763","Date Submitted":"07/02/2013 08:39 UTC","Latitude":"45.445604","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=45.445604,+-73.444763(48560)&iwloc=A&hl=en\"> mufon case (48560) map </A>","Region":"Quebec","Case Number":"48560","Object Features":"Other","Date of the Event":"07/09/2006 08:45 UTC","Disposition":"Unresolved"}