{"Summary":"Unusual flickering, moving orange light in the sky over Tacoma.","Region":"Washington","Country":"United States","Object Shape":"Unknown","Case Number":"48568","Object Features":"Unknown","City":"Tacoma","Date Submitted":"07/02/2013 08:31 UTC","Disposition":"Unresolved","Date of the Event":"07/01/2013 10:30 UTC","Source":"MUFON","Sighting Duration":"00:05:00","Viewing Distance":"Unknown","trends":["There have been 29 other sightings in Tacoma","There was one other sighting in Tacoma on or around July 1st 2013"],"files":["/var/www/straped/mufon/html2text/48568.html.txt","/var/www/straped/mufon/org/48568.html"],"Latitude":"47.232845","Log Number":"US-07022013-0013","divs":["Sighting DetailsReading in bed about 10:30 pm, 7-1-13, in central Tacoma, WA. Happened to look out the open window to the northwest and saw a very unusual moving light in the sky that flickered randomly with a flame-colored light, at first with small, close red lights trailing just behind the orange glow on either side. The light would dim randomly, then reappear, never quite disappearing, with a flickering quality that was quite flame-like, but slower. Impossible to state size or distance, nor was any object outline observed -- just the light against a dark sky. Grabbed binoculars but they were out of focus, however saw now steady orange, four-lobed blob, no red lights, no aircraft navigation or landing lights or strobes. Went downstairs and out to the street, in time to see now faint object disappearing to the ENE. The flight path was similar to that taken by commercial jets flying into SEA from California, but such aircraft have their landing lights on by the time they are passing my house, and no landing lights or any other normal navigations lights were observed. Plus, the object or whatever it was did not turn sharply towards the north and descend as it passed NE Tacoma as the jets do, but continued level flight in an ENE direction. And I can hear such aircraft through a closed window-- this thing was silent with the window open. Very strange."],"Tags":"City","Longitude":"-122.464316","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=47.232845,+-122.464316(48568)&iwloc=A&hl=en\"> mufon case (48568) map </A>","Weather Factors":"Unknown"}