{"Summary":"Possible sighting my opinion.","Region":"Queensland","Date Submitted":"07/03/2013 03:27 UTC","City":"Brisbane Airport","Latitude":"-27.3854","Object Features":"Unknown","Log Number":"AU-07032013-0005","Case Number":"48575","Country":"Australia","Weather Factors":"Unknown","Longitude":"153.120038","trends":["There have been no other sightings in Brisbane Airport","This sighting has never been favorited."],"Object Flight Path":"Straight-line path","Date of the Event":"07/01/2007 04:00 UTC","Sighting Duration":"Undisclosed","Disposition":"Unresolved","divs":["Sighting DetailsHi, I'm a very keen aviation photographer. On the date, 1st of July 2007, I went out to Brisbane Airport to take photo's of aircraft. I spent several hours out there, say 10am till 6pm. I would usually take my camera (Canon EOS 350D at the time) which would have a spare battery, six 1GB CF cards. By 6pm those cards would be full. On this day I took three lenses. Canon 100-400mm, Canon 70-200mm (which was used for the attached shot) and a Sigma 18-200mm. During the morning the was a bit of mist, but cleared to a nice sunny day. Somewhere around 4pm a Qantas 767 aircraft departed for Melbourne. At this point the jet was around 400-500ft and climbing. The object in question seems like its much further away than the aircraft. Looking at the image, the plane is climbing out over the runway (rwy 19) towards the south, I was standing at the north end of the international terminal.Looking east, towards Fisherman Island (an artificial island where the oil & cargo shipping terminal is). Several people I've shown this photo to are unsure as to what it really is. Personally, I was firing a whole series of photo's, Usually if its a bird. The image before and after would also show this. Though in this case both only show the plane. I wasn't aware of this till I went home and reviewed all my photo's and saw that spot. I emailed a few friends of the days photo's and included this amongst them. Next morning at work all of them question what it really is... I'm still thinking it maybe a bird out of focus, really hope its not... I just thought I'll share with you and see what your opinion maybe. Also the attached image is a full size unedited. Cheers, Norbert Vari"],"Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/48575.html.txt","/var/www/straped/mufon/more/48575_submitter_file1__VHOGFYBBN.jpg","/var/www/straped/mufon/org/48575.html"],"Source":"MUFON","Object Shape":"Cigar, Oval","map":"<A HREF = \"http://maps.google.com/maps?q=-27.3854,+153.120038(48575)&iwloc=A&hl=en\"> mufon case (48575) map </A>","Tags":"City"}