{"Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=39.313137,+-76.754329(48578)&iwloc=A&hl=en\"> mufon case (48578) map </A>","divs":["Sighting DetailsFirst of all, I have seen this starlike light before. I saw it hovering over my neighbors house in December. It scared me then. My daughter lives down the street from me and I told her to be careful because I am a star watcher and I have seen other things that I cannot explain. I did not see it again until that April 19, 2013 on my way to work at 6am. I pulled out of my garage and turned onto Johnnycake Rd. When I made the turn onto fairbrooks, I saw this bright starlike light. It was really low, and I thought, oh maybe it was a drone. It was still a little misty out and it was still a little dark, but not real dark. I made the turn onto Fairbrooks and then turned onto Greengage to Security Blvd. That only takes about 2 minutes. When I got to the stop light at Security...the first light..I looked up above the stop light and that light was there. I did not see it move to this position and I did not see it move in December. However, this time it moved right over my car. I looked up through the sun roof and all I saw was the most beautiful blue light I had ever seen. I cannot describe the color. ONly one blue light over the closest side to the passenger seat. It made no sound, I could see no shape, nothing. It passes my car going in a steady line heading toward the Centers for Medicade and Medicare Services (CMS). The light turned Green and I went forward trying to look in my rear view mirror. I looked and it was no where in sight. I have not seen it since. Did anyone else see this? There were other cars at the light, but I did not look at them. That night I told my family. I was shaken and they knew I was serious. Then a few day later my daughter called me and said that she saw it. She said it looked just as I described and did not move. She did not see underneath it. Her friend was with her and neither one of them had an explaination for what it was."],"Weather Factors":"Unknown","Object Features":"Other","Country":"United States","Latitude":"39.313137","Source":"MUFON","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/48578.html.txt","/var/www/straped/mufon/org/48578.html"],"Date of the Event":"04/19/2013 12:00 UTC","Summary":"I turned on to Johnnycake As I approached the turn onto fairbrooks,huge white and gold star like light was hovering over the trees.I got on Security Blvd hovering then it went right over my car-saw a blue light under no sound or solid object","Case Number":"48578","Longitude":"-76.754329","Viewing Distance":"20 Feet or Less","City":"Woodlawn","trends":["There have been no other sightings in Woodlawn","This sighting has never been favorited."],"Tags":"City","Region":"Maryland","Date Submitted":"07/03/2013 10:04 UTC","Log Number":"US-07032013-0008","Disposition":"Unresolved","Object Flight Path":"Hovering then path,Path then hovering"}