{"divs":["sighting detailsi was at my child's camping trip in the hills above the pigeon point lighthouse. we were on a very flat level \"plain\" above the pacific ocean, about 1\\2 mile from the beach, a mile south of the lighthouse. around 9 pm a couple of teen camp counselors said they saw a ufo. i thought it was a joke, but looked in the direction they pointed. here is what i saw. three lights in a roughly-triangular configuration were moving parallel to the coast, their apparent distance putting them maybe 300 yards off the beach. their configuration was what you would see if a 3-masted sailboat were passing, with one light at the top of each mast, the middle mast lower and the front and back higher, and the front two masts a bit closer together than the back and middle. but this was too large to be a sailboat because, at the distance this object was, the masts would have been 500 feet high. this also was too fast to be a sailboat, because the lights were traveling at a speed i'd estimate, again assuming the perceived distance is correct, of about 100 mph. it moved from due west to southwest, and then out of sight, within a period of 4-5 minutes. basically it was three lights moving in such perfect synchrony that they appeared to be attached to one single object. it was perfectly silent. now that i've heard about the black triangle, i think it could've been one of those, with a light at each corner."],"Disposition":"Unresolved","Longitude":"-122.375085","City":"Pescadero","Object Shape":"Chevron, Triangle","trends":["There has been one other sighting in Pescadero","There were no other sightings in Pescadero on or around May 8th 2000"],"files":["/var/www/straped/mufon/html2text/48570.html.txt","/var/www/straped/mufon/org/48570.html"],"Region":"California","Log Number":"US-07022013-0015","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.256944,+-122.375085(48570)&iwloc=A&hl=en\"> mufon case (48570) map </A>","Country":"United States","Sighting Duration":"Undisclosed","Date Submitted":"07/02/2013 11:44 UTC","Latitude":"37.256944","Object Flight Path":"Straight-line path","Source":"MUFON","Tags":"City","Summary":"Triangle of Lights","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"05/08/2000 12:00 UTC","Weather Factors":"Unknown","Case Number":"48570"}