{"Longitude":"-97.195588","Case Number":"48574","Latitude":"35.661726","Country":"United States","Object Shape":"Cone, Circle","Sighting Duration":"Undisclosed","City":"Luther","Tags":"City","Viewing Distance":"101-500 Feet","Source":"MUFON","Summary":"Looked like an upside down ice cream cone with pulsing blue lights around the bottom.","trends":["There have been no other sightings in Luther","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=35.661726,+-97.195588(48574)&iwloc=A&hl=en\"> mufon case (48574) map </A>","Date Submitted":"07/03/2013 02:11 UTC","files":["/var/www/straped/mufon/html2text/48574.html.txt","/var/www/straped/mufon/org/48574.html"],"Weather Factors":"Unknown","Object Flight Path":"Path with directional change,Path then hovering","Disposition":"Unresolved","Date of the Event":"06/26/2013 12:00 UTC","Log Number":"US-07032013-0004","Region":"Oklahoma","Object Features":"Unknown","divs":["Sighting DetailsThree of my children were driving home from Edmond, Oklahoma to Chandler,Oklahoma. When they neared Luther,Oklahoma on Route 66 they saw what appeared to be a n upside down ice cream cone with blue pulsing lights around the bottom of the craft. It moved slowly and at a low altitude . It was moving east and they were able to follow it for a short distance in their car. The whole while my daughter was texting me all of the details and was very frightened. She said the craft suddenly disappeared and they continued their drive home. They had only driven a few miles when the craft reappeared above them and seemed to follow them for a few miles. They were terrified. Just as suddenly as it had appeared it disappeared again. My son, who was driving, said he rolled down the car window and that the craft made no sound and appeared to hover about 100 feet above them before it disappeared. He said it did not fly away but seemed to just vanish. My daughter attempted to take video but no craft was visible upon rlay but their voices could all be heard."]}