{"Latitude":"43.127655","City":"Brantford","divs":["Sighting DetailsI was on my balcony, on the 4th floor, at about 10pm, looking south. I was watching the fireworks that people were letting off and waiting for the professional show in the park nearby. I looked at the treeline about 1 km away, in a SE direction, and saw 2 bright orange lights. I at first thought that it was two planes, since there's an airport nearby, but there were no flashing lights normally associated with them, and they didn't move right. I watched them move NW circling around each other. I called my husband out to see them and we watched them start to go west. One went SW and became dim, while the other one continued west until it disappeared. I tried to videotape them, but I have a Blackberry, and this one doesn't seem to take video well. About 15 minutes later, one of the lights came back, traveling from SE to NW. It didn't go in a straight path, but instead at one point did a quick direction change, like a quick left turn, and then continued on. About 15 minutes after that, the fireworks started and the light came back again. It flew to the area of the fireworks, hovered for about a minute, then continued back in a NW direction. By this point a few of my neighbours were out watching the fireworks and I heard one of them ask her friend was the strange glowing light was. The fireworks ended about 15 minutes later, but I did not see them after that. I barely remember the fireworks since I was concentrating too much on looking for the lights."],"Country":"Canada","Date of the Event":"07/01/2013 10:00 UTC","Region":"Ontario","Object Features":"Unknown","Case Number":"48586","Longitude":"-80.274033","trends":["There have been 9 other sightings in Brantford","There were no other sightings in Brantford on or around July 1st 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.127655,+-80.274033(48586)&iwloc=A&hl=en\"> mufon case (48586) map </A>","Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Tags":"City","Date Submitted":"07/03/2013 10:51 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/48586.html.txt","/var/www/straped/mufon/org/48586.html"],"Object Shape":"Circle, Disc","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Summary":"Glowing lights on Canada Day","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Log Number":"CA-07032013-0016"}