{"Case Number":"48583","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=43.534441,+-89.994406(48583)&iwloc=A&hl=en\"> mufon case (48583) map </A>","Country":"United States","files":["/var/www/straped/mufon/html2text/48583.html.txt","/var/www/straped/mufon/org/48583.html"],"City":"Reedsburg","Source":"MUFON","Date Submitted":"07/03/2013 07:51 UTC","trends":["There have been 2 other sightings in Reedsburg","There were no other sightings in Reedsburg on or around June 30th 2013"],"Sighting Duration":"Undisclosed","Tags":"City","Weather Factors":"Unknown","Latitude":"43.534441","Summary":"Observed 7 red orange lights in a triangle formation lights going out 1 at a time moveing slow in a east to west straight line.","Date of the Event":"06/30/2013 08:30 UTC","Longitude":"-89.994406","Region":"Wisconsin","divs":["sighting detailswife was out on porch just sitting, i came out to talk to her and she asked if there was fireworks tonight i said no, wife was looking up at sky and saw lights coming over the church across the street and asked me what was that, and i called my son out to look at them too and we didn't know what the lights were. there were 7 red\\orange colored lights that were the size between softball and basketball size that were evenly spaced in a triangle formation, 2 of the lights on the right hand side went out one at a time, it was moving slow between 5 and 10 miles per hour, it moved over us in a east to west direction and as it moved over us they went out one at a time. there was no sound and it was a clear night and we couldn't see anything but just the shape of the lights. the whole sighting took about 5 minutes as we watched the lights we felt surprised and overwhelmed wanted to go grab camera but didn't because we were mesmerized by the lights. when we saw the last light go out, went inside and turned on the police scanner to see if there where other reports about the lights, the rest of the night we feeling confused about what we just seen, because we didn't know what we saw"],"Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","Log Number":"US-07032013-0013"}