{"files":["/var/www/straped/mufon/html2text/48589.html.txt","/var/www/straped/mufon/org/48589.html"],"Object Features":"None","Date of the Event":"09/28/1980 12:00 UTC","Longitude":"-79.359994","Object Flight Path":"Straight-line path","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=43.753001,+-79.359994(48589)&iwloc=A&hl=en\"> mufon case (48589) map </A>","Log Number":"CA-07042013-0001","Latitude":"43.753001","Weather Factors":"Unknown","Case Number":"48589","Summary":"A massive , white rectangular object flew slowly south across the city at a high altitude in full view of me and a group of witnesses.","Country":"Canada","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","City":"Toronto","Region":"Ontario","divs":["Sighting Details I'd like to preface my story by saying that based on what I've learned about physics, it seems improbable that beings from another planet are visiting ours. The vast majority of physicists agree. On the other hand, credible witnesses have experienced events science can't explain. Assuming both are true,what's left? It was the fall of 1980, late Saturday afternoon. The sky was a sharp bright blue without a cloud in sight. My girlfriend and I were driving southbound along Leslie St.toward York Mills Rd. in suburban Toronto,a busy section of town at any time. She was at the wheel, which was not the norm. The passenger side window was down. I glanced up and noted the crispness of the blue overhead. As I turned my head back to watch the road, I realized my eye had caught something up above. I remember immediately saying to myself \"what the heck is that little cloud doing in a perfectly clear sky?\" I looked up again and saw that it wasn't a cloud at all. It appeared solid, white and it was way up there. I knew it was something odd and quickly asked my girlfriend to pull off the road. We turned into the parking lot of a restaurant called \"Teddy Kennedy's Ribs,\" on the easst side of Leslie Just before York Mills. A group of about a dozen restaurant patrons were already gathered outside looking up at this thing. It was incredibly exciting, surreal. People were squealing and shrieking at the sight of the object. We looked at each other and asked \"can you believe it?!\" The object was rectangular in shape, reflective and white like any airplane high up there and it was huge. The first thought that popped into my head was \"giant aircraft carrier.\" It seemed to be at least that big if not bigger. It appeared to have substance. It was bulky and long. It was too high to make out any other details. Without any reference points, I judged it to be at an altitude of maybe 40,000 ft, where passenger jets fly their highest. It loped along in a striaght line north to south much slower than any jet I'd ever seen. It took that thing 20 minutes to cross the sky. The entire population of Toronto could have seen it, if only they'd looked up."],"Object Shape":"Unknown","Tags":"City","trends":["There have been 136 other sightings in Toronto","There were no other sightings in Toronto on or around September 28th 1980"],"Source":"MUFON","Date Submitted":"07/04/2013 12:06 UTC"}