{"Case Number":"48599","Longitude":"-117.183089","Object Flight Path":"Straight-line path","divs":["Sighting DetailsNAS North Island. Coronado, CA 2:30AM 1JUL2013 W, SW, and SE Please only use my first name if this is reported to anyone or in media. I have been inspecting helicopters as a Plane Captain SH-60H,F,S MH-60R for over 2 years at NAS North Island about 1-2 miles from the Pacific. have been working from 10:30PM-7:00AM for the past 9 months. This is not the first time I have seen something interesting, however this was the most obvious to anyone focused on the sky. I had just finished inspecting a bird when, I saw a very distant light that seemed to be changing from blue to red to white, and I thought it was a star. It was very far away directly W, as we have a true north line 200 yds from my flightline and verifies it was directly W.. I watched it for about 5 minutes, then started looking around the sky to see if I could spot anything else. I saw another similar looking light emitting object in the SW. They were the same distance, it appeared, and I started looking around the entire sky to try to spot anything else. I then saw an object closer, but still very high flying directly over the base heading SE with 3 flashing white lights. I could not take any photo or film because it is FOD and not allowed for me to have while performing my duties. Even if I did I do not believe I would have been able to catch much because it was so high, but the lights appeared to flash in sequence and I believe I saw the outline of a triangle when the lights would flash and illuminate. I have seen information on the TR-3B craft before, and I am not certain but I believe that is what I saw. However, it was flying slow, like a plane and not like a super fast UFO zooming off with hypersonic speed. It made NO NOISE, which troubled me as I hear all kinds of military aircraft, as I work on a flight line next with multiple airstrips and I recognize all kinds of aircraft. I pointed it out to a friend of mine who was also inspecting the helicopter and he saw what I pointed out but did not offer any opinion. I have been looking at the sky every night since October, as I work 10:30PM-7AM and this is the interesting thing I have seen. I have friends that have seen other things, and I have as well but this is the one that caught my attention most as I am very skeptical considering how many types of aircraft fly from and over our base. I have seen many shooting stars and interesting things, but I usually just pass them off as it is something from the base. After I saw the objects, the sky got cloudy and was then cloud covered. I drove away from my job to a darker area to try to see the objects better and it was completely cloudy when I got closer to the ocean and further from the city and base lights. I was not able to see any of the 3 again."],"Latitude":"32.685885","Weather Factors":"Unknown","City":"Coronado","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/48599.html.txt","/var/www/straped/mufon/org/48599.html"],"Date Submitted":"07/04/2013 02:10 UTC","Summary":"While inspecting helicopter at NAS North Island I believe I saw a TR-3B or something like it on Monday at 2:30AM","Source":"MUFON","Viewing Distance":"Over One Mile","trends":["There have been no other sightings in Coronado","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Region":"California","Country":"United States","Tags":"City","Object Shape":"Triangle","Date of the Event":"07/02/2013 02:25 UTC","Log Number":"US-07042013-0011","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=32.685885,+-117.183089(48599)&iwloc=A&hl=en\"> mufon case (48599) map </A>"}