{"Log Number":"US-07042013-0003","Summary":"Husband and I saw 6solid colored lights hovering in a crescent shape no sound then slowly disappear one at a time","Object Features":"None","Object Flight Path":"Hovering then path","divs":["Sighting DetailsMy husband and I went for a drive around Lake Jacomo July 3 2013 on Woods Chapel Rd. We saw some fireworks when we noticed a group of lights that weren't fading out.There were six yellow orange lights that were hovering higher in the sky. they were in a crescent shape and did not blink like airplane lights. We pulled off the road into a parking lot to watch them to see what they were doing. Slowly the lights just disappeared one at a time. Earlier in the evening there had been a thunderstorm with a lot of lightening. in fact all of the traffic lights and street lights were not working which made it seem spooky. We also passed a repair truck driving slowly looking for something wrong with the lines. We made a remark to one another that it made us feel like Dreyfus in \"Close Encounters\". When we drove back to the road keeping our eye on the sky there had been a wreck of 3 cars at the intersection;it was so dark without the lights it seemed really scary to me. I probably should say family has had other events with this subject. We even had Budd Hopkins come to our home to investigate our family and our various events throughout our lives. So this is just another one to add to our history."],"Sighting Duration":"Undisclosed","Region":"Missouri","Country":"United States","Date of the Event":"07/03/2013 09:40 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.005457,+-94.310109(48591)&iwloc=A&hl=en\"> mufon case (48591) map </A>","Latitude":"39.005457","Weather Factors":"Unknown","City":"Blue Springs","Disposition":"Unresolved","Tags":"City","Date Submitted":"07/04/2013 12:19 UTC","trends":["There have been 28 other sightings in Blue Springs","There were no other sightings in Blue Springs on or around July 3rd 2013"],"Object Shape":"Star-like","Source":"MUFON","Case Number":"48591","files":["/var/www/straped/mufon/html2text/48591.html.txt","/var/www/straped/mufon/org/48591.html"],"Viewing Distance":"Unknown","Longitude":"-94.310109"}