{"divs":["Sighting Details I was walking from one barracks to another, and something caught my eye in the sky. I looked up and saw a round object, rolling and tumbling, leaving a long luminous trail behind it, and the trail disappeared as the object traveled. To make an accurate description, it looked like a basketball, with holes in it, and smoke or vapor was coming out of every hole as it rolled and tumbled in the sky. I watched it for 15-20 minutes as it traveled in the sky. The outside temp was -20 degrees, so I stayed outside and watched it in the clear night sky as long as I could stand the cold. During the time I watched it, it didn't travel all the way across the horizon, but was still moving slowly when I went inside. I yelled at another man who was outside, and said, \"Do you see that?\" He answered, \"Yeah, but I don't want to.\" A few years later, I wrote a report about the sighting and sent it to the Smithsonian Institution in Washington, DC. They answered with this statement: \"What you saw was a meteor. They can do strange things sometimes.\" I've seen many meteors in my 75 years of life, and that was no meteor. For one thing, it didn't move very fast. And then, it wasn't bright like a meteor, but was like a dull brown. There was no fire visible."],"Object Flight Path":"Path with directional change","Source":"MUFON","Object Features":"Patterned Surface","map":"<A HREF = \"http://maps.google.com/maps?q=52.971798,+-60.296439(48608)&iwloc=A&hl=en\"> mufon case (48608) map </A>","Log Number":"CA-07042013-0020","Weather Factors":"Unknown","Object Shape":"Cylinder","trends":["There have been 2 other sightings in Happy Valley-Goose Bay","There were no other sightings in Happy Valley-Goose Bay on or around January 12th 1967"],"Sighting Duration":"Undisclosed","Date of the Event":"01/12/1967 10:10 UTC","Date Submitted":"07/04/2013 07:46 UTC","Region":"Newfoundland and Lab","Longitude":"-60.296439","files":["/var/www/straped/mufon/html2text/48608.html.txt","/var/www/straped/mufon/org/48608.html"],"Summary":"Smoky brown ball rolling and tumbling in the sky, leaving a luminous trail.","Viewing Distance":"101-500 Feet","Case Number":"48608","Latitude":"52.971798","Disposition":"Unresolved","City":"Happy Valley-Goose Bay","Country":"Canada","Tags":"City"}