{"map":"<A HREF = \"http://maps.google.com/maps?q=37.091567,+-94.508041(48606)&iwloc=A&hl=en\"> mufon case (48606) map </A>","Region":"Missouri","Log Number":"US-07042013-0018","Disposition":"Unresolved","Case Number":"48606","Sighting Duration":"00:10:00","Longitude":"-94.508041","Source":"MUFON","Latitude":"37.091567","trends":["There have been 11 other sightings in Joplin","There were no other sightings in Joplin on or around July 1st 2013"],"Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Date Submitted":"07/04/2013 07:05 UTC","Object Flight Path":"Hovering then path","Summary":"observed Two glowing orbs in sky.","divs":["Sighting DetailsOn July 1 2013 in Joplin Missouri I got home around 930. I let my dogs out and was standing on my deck when I looked up and saw what I thought was an airplane on fire. It looked about the same distance I have noticed small aircraft flying maybe 10000 feet. It began to hover. No movement or sound. I ran to get my binoculars. When I got back it began moving in an arc toward the South. While I was watching it another appeared in the same location as the first. I then looked at it and was able to see with the binoculars 4 black round spots in the center of the red and yellow glow. The 2nd one then moved in the exact same arc and then stopped above the first and was still. The first then just disappeared from few and soon after so did the second. I am a professional intelligent grown woman who saw something I can't explain. It wasn't fireworks or chinese lanterns. I have lived long enough to know the difference. I have since googled this and found there are people all over the world who have experienced this. I think about it often as I am the type of person who wants to know the answer but perhaps there is none. The entire episode was approx. 10 minutes."],"Tags":"City","Date of the Event":"07/01/2013 10:00 UTC","Object Features":"Patterned Surface","Object Shape":"Fireball","City":"Joplin","files":["/var/www/straped/mufon/html2text/48606.html.txt","/var/www/straped/mufon/org/48606.html"],"Weather Factors":"Unknown"}