{"Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/48601.html.txt","/var/www/straped/mufon/org/48601.html"],"Latitude":"36.107603","Object Shape":"Unknown","Tags":"City","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=36.107603,+-115.100686(48601)&iwloc=A&hl=en\"> mufon case (48601) map </A>","Weather Factors":"Unknown","Object Features":"Unknown","Date of the Event":"07/03/2013 11:45 UTC","Longitude":"-115.100686","divs":["Sighting Detailswas driving home from work (roughly 11:45pm) noticed off to my right 3 bright red glowing objects. Saw from a distance at 1st thought helicopters but as I got closer, they were low, just over the 2 story apartment building. As I got closer they were also a lot smaller. Hard to describe shape really the glow was more square shaped. The closest one hovered over the apt bldg then started going straight down slowly then disappeared. The 2nd moved off toward the trees and I lost the sight of that one. The 3rd moved off in to the distance then just disappeared. What I find very strange is I've seen this before. A couple months back, not sure how long it's been, but under a year. Same bright red glowing object hovering. I was also on my way home from work, roughly about the same time, only there was 1 and it was not even in the same area. This was about 10-15 miles apart. That one looked just like the 3 of these. I was really close to this one. I stopped NY car, got out and it was right above me. Hovered then moved really slowly, like gliding off to the northeast. Scared me enough that I actually called 911. After I saw it, I saw a helicopter in the area. Not sure if it was in relation to the same thing. All I know is my family thinks I'm crazy, but I know what I saw. I did get a quick clip on my phone of the 3rd one off in the distance, but you can't really make anything out and it was way off in the distance."],"Disposition":"Unresolved","Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","Case Number":"48601","Log Number":"US-07042013-0013","Date Submitted":"07/04/2013 06:16 UTC","trends":["There have been no other sightings in Paradise","This sighting has never been favorited."],"Source":"MUFON","City":"Paradise","Region":"Nevada","Summary":"3 bright red lights site hovering about 50ft apart. Roughly the size of a basketball."}