{"Object Shape":"Oval","Object Flight Path":"Straight-line path","Region":"New Jersey","City":"Denville","Disposition":"Unresolved","Case Number":"48619","Weather Factors":"Unknown","Object Features":"None","Source":"MUFON","Viewing Distance":"Unknown","Date Submitted":"07/04/2013 10:55 UTC","Tags":"City","Log Number":"US-07042013-0031","map":"<A HREF = \"http://maps.google.com/maps?q=40.894281,+-74.487073(48619)&iwloc=A&hl=en\"> mufon case (48619) map </A>","trends":["There have been 4 other sightings in Denville","There were no other sightings in Denville on or around July 4th 2013"],"divs":["Sighting DetailsI keep my eyes on the skies. Leaving the Denville fireworks at approximately 9:45 with my husband walking approximately SSW when I spy an orange light coming in from the South. I noted the orange color and decided to watch it. I point it out to himself who looks and immediately pronounces it a plane. I point out to him that it is very bright orange with no blinking navigation lights. He takes notice and agrees. It is heading approximately North and I cannot make out the shape of the craft except to say that the bright steady light was an extended horizontal oval as it came closer to overhead. The flight path was smooth and moderately fast. I guess it could have been a Chinese lantern but the shape and the unwavering course and steady pace say maybe not. I'd be interested to know if you get any other reports. I lost sight of the object when my husband pulled me onto the curb for fear I might be hit by a car. The light came from the south and moved nearly overhead toward where the fireworks had been. My feelings were of intense interest. I am now experiencing feelings of overheating and sweating though I am in my air conditioned home. I don't know if this is related. I also reported this to Ken Pfeifer. I have had other sightings in the past, some (like tonight) in the company of others."],"Latitude":"40.894281","files":["/var/www/straped/mufon/html2text/48619.html.txt","/var/www/straped/mufon/org/48619.html"],"Date of the Event":"07/04/2013 09:45 UTC","Summary":"Bright steady orange light observed in Denville NJ about 7-8 minutes after the fireworks","Country":"United States","Sighting Duration":"Undisclosed","Longitude":"-74.487073"}