{"Disposition":"Unresolved","Region":"Kansas","Case Number":"48629","City":"Overland Park","Object Features":"Unknown","Latitude":"38.913453","Summary":"Two orange red glowing orbs moving about 100ft apart in a straight line moving in perfect incision at a diagonal rising in elevation orb on left slowing faded out first followed by light on right disappearing in an instants no fading","Date Submitted":"07/05/2013 12:28 UTC","Source":"MUFON","trends":["There have been 34 other sightings in Overland Park","There were no other sightings in Overland Park on or around July 4th 2013"],"Weather Factors":"Unknown","Date of the Event":"07/04/2013 10:45 UTC","Object Flight Path":"Straight-line path","Tags":"City","Object Shape":"Circle","Sighting Duration":"Undisclosed","Longitude":"-94.69634","map":"<A HREF = \"http://maps.google.com/maps?q=38.913453,+-94.69634(48629)&iwloc=A&hl=en\"> mufon case (48629) map </A>","Country":"United States","Log Number":"US-07052013-0005","files":["/var/www/straped/mufon/html2text/48629.html.txt","/var/www/straped/mufon/org/48629.html"],"Viewing Distance":"501 Feet - 1 Mile","divs":["sighting detailsit was 10:45 in the evening my husband, son and i were leaving our old home after picking up some of our things as it was right by where we were viewing the fireworks this evening. i was walking across the street to retrieve the mail when i casually looked up into the sky a was stopped dead in my tracks by what i saw. i know that everyone's first reaction will be duh it's the fourth of july buys trust me these were no fireworks. what i observed were two bright glowing round orbs\\lights red-orange in color in a perfect diagonal formation with a distance of around 100ft between them. my husband was called my name and i couldn't seem to find my voice i was so shocked at what i was witnessing. the lights proceeded to move northwest never straying from their formation. after what seemed like an enternity but was around 35 to 40 seconds the light on the left slowly began to fade out until it fully disappeared, the light on the right meanwhile was still fully bright and moving along. after another 10 to 15 seconds the second light on the right disappeared immediately, not fading just gone. still in shock i waited a while looking at the sky to see if the lights would return which they did not. there was never a sound only the noise of traffic. we asked those we saw in the neighboorhood if they had seen it as well including a police officer and everyone's answer was no. while i enjoying watching shows on aliens and ufo's i have always been a skeptic, but what i experienced tonight has truly shocked me and made me question the age old question are we alone? i'm hoping that by reporting this to mufon that i can get some answers or clarity to what i saw and experienced tonight."]}