{"Country":"United States","City":"New York","divs":["Sighting DetailsAt around 9:30 pm on July 4th, 2013 my family and I were about 2 blocks away from the Hudson river, in a very large crowd of people on the corner of 11th avenue and 50th street waiting for the fireworks that were starting at 9:30 pm. I was with my father's girlfriend and her daughter while my dad was off looking for a better vantage point to see the show. Everyone in the crowd was facing West towards the Hudson. I believe I heard a helicopter flying lower than usual behind us so I turned to look, and I remember tilting my head back quite a bit to get it into view. Above two buildings (I am not sure the exact angle or the building names), two red lights appeared moving from south east to north east followed by a helicopter. The lights had a solid outline but still bright. The lights were larger than any light I had ever seen in the sky before. They almost looked like two red traffic lights however there was absolutely no glow to them unlike if you were to look at a stop light at night. (I have observed airplanes and landing gear lights and radio tower lights in the sky before and all of them have a slight glow to them.) They moved north across the sky and were followed by a helicopter and I noticed that about halfway between my vantage of the buildings, each lights seemed to slow down and get slightly dimmer but remained the same size. I got my father's girlfriend's daughter's attention and she observed the lights as well, and she became nervous that something was going to happen as it was our first time in New York and she had never seen anything like these lights before either. I also noticed that at least two other people had turned around and saw them as well so I know there were other non-related witnesses. They were speaking some sort of Asian language as they pointed up at them. I tried to also get my dad's girlfriend to see the lights but they were gone before I could get her attention. The sighting lasted no longer than 30 seconds as the two lights and helicopter passed over a building to the north east. I didn't think too much more about it at the time as the fireworks began to start over the Hudson to the west. About five to ten minutes later my dad's girlfriend asked me if I had cell service because she was trying to reach my dad. I checked my phone as did her daughter, and none of us had service. I tried calling my dad and my phone would not connect the call. So I started writing a text message to him and pressed send. It took a minute or two but finally I got confirmation that it was sent and all three of us immediately got our service back. At first I did not connect the two events until after the fireworks show, at 10 pm, after meeting back up with my dad, I told him about what I saw and he said that he had lost service for a few minutes as well and he was a few blocks to the south of us. His girlfriend heard my report for the first time as well and asked if we saw a UFO. I told her that I did not know, but that made me remember how many UFO sightings were also reported having interference with electronic equipment and that got me thinking. On our walk back to the hotel, I was almost constantly looking up in the sky trying to get another glimpse of the object for better observation but to no avail. When we got back to our hotel at around 10:30, I got online and looked for any reports of red lights in the sky that night but found none. I made this report because I know that other people saw the same thing that I did and I would like to know what it was as I am very intrigued. I used to be very interested in UFO phenomenon however within the past few years I have somewhat dismissed the fact as being misidentified aircraft of some sort. The way these lights looked, being unlike anything I have seen before, really has captivated me and I am very interested to see other reports or even get an explanation of what it could have been. My dad gave the opinion that the government may have wanted to stop cell phone communication during the firework show as it was creating some very loud explosion noises that echoed through the buildings behind us. After writing this report I am going to go on to Microsoft Paint and make a rough diagram of what I saw."],"Weather Factors":"Unknown","Date of the Event":"07/04/2013 09:25 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.798608,+-73.951292(48622)&iwloc=A&hl=en\"> mufon case (48622) map </A>","Region":"New York","Sighting Duration":"00:00:30","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around July 4th 2013","This sighting has never been favorited.",""],"Log Number":"US-07042013-0034","Object Shape":"Circle","Object Features":"None","Viewing Distance":"Unknown","Source":"MUFON","Longitude":"-73.951292","Summary":"Two solid red lights/orbs with no glow followed by a helicopter.","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/48622.html.txt","/var/www/straped/mufon/more/48622_submitter_file1__July4th2013.jpg","/var/www/straped/mufon/org/48622.html"],"Date Submitted":"07/04/2013 11:33 UTC","Object Flight Path":"Straight-line path","Case Number":"48622","Latitude":"40.798608"}