{"Summary":"a line of 5 orange-red color lights in straight line moving slowly and then turning to the north","Log Number":"US-07052013-0002","Weather Factors":"Unknown","Date Submitted":"07/05/2013 12:15 UTC","Case Number":"48626","Latitude":"28.488016","City":"Orlando","Region":"Florida","Object Shape":"Star-like","Country":"United States","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/48626.html.txt","/var/www/straped/mufon/org/48626.html"],"Longitude":"-81.372478","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile, Unknown","trends":["There have been 112 other sightings in Orlando","There were no other sightings in Orlando on or around July 4th 2013"],"Date of the Event":"07/04/2013 09:15 UTC","Tags":"City","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=28.488016,+-81.372478(48626)&iwloc=A&hl=en\"> mufon case (48626) map </A>","divs":["Sighting DetailsWe were watching fireworks over Little Lake Conway on 4th of July 2013. The Orlando International Airport is in the distance to the east of us. The planes take off and land in one of two directions, north and south. Coming towards us from the eastern sky were 5 orange-reddish lights in a line formation. This was very odd because there were planes coming in for landing from the north. Nothing ever comes from the east, it is in the way of the planes path to the airport. The lights continued to come towards our direction steadily until they reached the end of the lake where we were standing then they turn to the north, at this point they were at the closest point to us. We could not make out what shape they were. We did not hear a sound from them. We watched them continue moving in a very smooth movement all 5 of them stayed in a row at a set distance from each other. The color is not a color of any aircraft we have ever seen. This is the second time we have seen these orange colored lights in this area. Both times they were in places that planes do not fly. We know the path of the planes for the airport. We often sit at the lake and watch them come in for landing over the lake from the north to the south. The light then went behind the clouds one at a time. We were both in awe once again to see this twice in Orlando."],"Object Flight Path":"Path with directional change","Object Features":"None"}