{"Latitude":"41.58566","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Summary":"Flickering, glowing orangish-red ovals moving silently alone, in pairs and in a triangle from south to north at same altiitudes","City":"Lockport","Weather Factors":"Unknown","Source":"MUFON","Case Number":"48635","Object Features":"None","Date of the Event":"07/04/2013 09:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.58566,+-88.050182(48635)&iwloc=A&hl=en\"> mufon case (48635) map </A>","divs":["sighting detailslooking to the west and saw a strange glowing red\\orange object moving from southwest to northeast. we watched it move northeast until it vanished from sight. 15 minutes later we were driving and saw another one almost overhead and moving to the north. we followed it as best we could until it too moved to far away to see. after returning home a few minutes later we saw another one in the east (the others were in the west) also moving slowing to the north. then about five minutes later we saw another moving to the northeast in the east. then suddenly we saw two, then three in a triangle and them three more moving together at the same rate of speed and the same size silently move to the north and then moving to far away to see anymore and then after an hour of this, there were no more. they all looked perfectly identical. flickering glowing tear-drop shaped objects. all the same altitude airspeed and direction. they were perfectly silent with no flashing navigation lights and they looked the same from all directions whether from the back or sides of front. we were just curious at first then grew very excited as we saw more and more and them fleets of these things in formations. they all moved north and got too far away to see anymore. ne. this time i had binoculars and saw them close up. they looked like bright red\\orange balls of light slightly flickering. my wife saw it too. in total the entire event was just over one hour. from about 9:30pm to 10:30pm and then from 11:35pm to 11:50pm at midnight we retired indoors."],"Object Flight Path":"Straight-line path","Region":"Illinois","Object Shape":"Teardrop","Date Submitted":"07/05/2013 12:59 UTC","Country":"United States","Tags":"City","files":["/var/www/straped/mufon/html2text/48635.html.txt","/var/www/straped/mufon/org/48635.html"],"trends":["There have been 4 other sightings in Lockport","There were no other sightings in Lockport on or around July 4th 2013"],"Log Number":"US-07052013-0010","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-88.050182"}