{"Region":"Florida","Case Number":"48632","divs":["Sighting DetailsAs I was traveling home from store I saw an orange colored orb traveling at the rate a small plane might in a northwesterly direction. I was driving down a street that was relatively well wooded so I only caught glimpses of it before I turned east on a road to take me to my house. Being the 4th of July I thought it may have been some type of firework,but frankly none I had ever seen before. I arrived home less than 10 minutes later, and as I was standing in my driveway speaking with my neighbor about the local festivities I glanced skyward and a similar orb,with the same speed and northwesterly trajectory passed (in the distance) above the roofline of my home, as well as her home's roofline. She observed it,and we yelled to her husband and daughter who were actually sitting on the roof of their one story house watching the various fireworks to turn around and look at the object. We all observed it travel that northwestern route for probably less than 90 seconds and then (at least from my perspective) disappear as it went below the roofline of my neighbor's home. With cacophony on noise from the various fireworks, it was impossible to know if it made any sound. It's size and luminosity was at least twice what Venus would be at its brightest times. Being a retired police officer I can definitely say it was not any firework, or a Chinese lantern. Nor was it the space station, an orbiting satellite or anything launched from nearby Cape Canaveral or the KSC! My neighbor, who was on his roof, is a highly skilled computer programmer, he had no idea what the orb was. His spouse, who was in the driveway with me didn't have a clue either as to what we witnessed.Their daughter, who also saw it, is nine years old. Both orbs I viewed appeared identical. I do not believe they were one in the same, as the speed of the first would not have been fast enough for it to circle around so that I could have viewed it a second time when I arrived home. Nonetheless, that is a remote possibility that cannot be ruled out.I made these observations approximately between the hours of 2045 and 2105 EDT. There was probably 2 miles distance between my 2 sightings. I did not photograph either object as I had left my iPhone home as this was just a quick run to the grocery store.I can say these orbs looked very similar to some recent photos and videos of orange orbs I have seen on the internet."],"Object Flight Path":"Straight-line path","Summary":"Saw two orange orbs approximately 10 mins apart, one while traveling home from store anotheAsr after after I got home while s","trends":["There have been 3 other sightings in West Melbourne","There were no other sightings in West Melbourne on or around July 4th 2013"],"Longitude":"-80.658541","Source":"MUFON","Latitude":"28.061256","Object Shape":"Sphere","Weather Factors":"Unknown","Country":"United States","City":"West Melbourne","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/48632.html.txt","/var/www/straped/mufon/org/48632.html"],"Date of the Event":"07/04/2013 08:45 UTC","Log Number":"US-07052013-0007","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=28.061256,+-80.658541(48632)&iwloc=A&hl=en\"> mufon case (48632) map </A>","Disposition":"Unresolved","Tags":"City","Date Submitted":"07/05/2013 12:38 UTC","Sighting Duration":"Undisclosed"}