{"Longitude":"-119.409332","Log Number":"US-07052013-0015","Region":"California","City":"Undisclosed","Summary":"grey oval with glowing flashing lights","Case Number":"48639","Date Submitted":"07/05/2013 01:35 UTC","Object Flight Path":"Straight-line path","Source":"MUFON","Weather Factors":"Unknown","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=36.787081,+-119.409332(48639)&iwloc=A&hl=en\"> mufon case (48639) map </A>","trends":[],"divs":["Sighting DetailsMy father went outside to smoke a cigarette, and about five minutes later he's shouting my name to come outside. When i came out he pointed to the sky (which was pretty clear other than the fireworks going off) and I saw an object in the sky hovering very slowly it completely stood out because the night was so clear it was grey and standoffish. It almost looked 3d against the sky, it moved slowly in a straight direction. I had been observing for about a minute and a half when a firework went off in that direction and it just got sucked into the sky. It all happened very quickly. I tried getting it on video on my phone,but had no luck because it was too dark outside I ended up only recording our reactions to what we were seeing. This isn't our first time experiencing something like this we saw a UFO Christmas 2011 hovering literally above our neighborhood and one point it was right above a tree we have in our front yard. We were pretty terrified because it was so close and completely strange. That UFO was a orange reddish color and the edges were fuzzy against the sky and when it was right above our tree everything got creepily quiet and you could almost hear a hum. This time I was frozen in fear I couldn't even move to get my phone and when I ended up snapping out if it it was too late and it was gone."],"files":["/var/www/straped/mufon/html2text/48639.html.txt","/var/www/straped/mufon/org/48639.html"],"Object Features":"Unknown","Object Shape":"Oval","Latitude":"36.787081","Country":"United States","Date of the Event":"07/04/2013 12:00 UTC","Viewing Distance":"Unknown"}