{"trends":["There have been 4 other sightings in Enumclaw","There were no other sightings in Enumclaw on or around July 4th 2013"],"divs":["Sighting DetailsI was outside setting a trap for field mice that live in the shoulder of the road next to the mobile home park I live in. I look up and watch what I thought was more fireworks, but it was 4 lights coming from the southwest. There was distance between each other, whether it was equal distance I couldn't tell you. Then each consecutive light went out, and went black. I then watched two of them, as they went black, head towards the cascade mountain foothills. This was at 10pm and I know it wasn't crows or turkey vultures heading towards the foothills. The objects from when the were lit, to when they were black, moved slow, they didn't zig zag, jump around, hover or anything else, they just went slow and made a heading n.easterly. Then a separate light, again like a low powered flare, came into view from a more south easterly direction, and when it passed over the main hiway I am next to (hiway 169), it too went dark, but I couldn't see it's shape because of the street light that was in my eyes. I thought they might of been planes or helicopters but even with the fireworks noise, there were no lights after they went dark, no noise, they just were slow moving objects. I lost sight of the objects as they headed east towards the foothills, it's cloudy out and I could see the objects against the clouds. The last object that was by itself I couldn't follow once it went black because of the street light across the street."],"Object Shape":"Circle","Longitude":"-121.980666","Country":"United States","files":["/var/www/straped/mufon/html2text/48638.html.txt","/var/www/straped/mufon/org/48638.html"],"Sighting Duration":"Undisclosed","Region":"Washington","Object Flight Path":"Straight-line path","Case Number":"48638","Latitude":"47.197011","Summary":"4 lights close to each other with muted brightness of flares, then they went black","Date Submitted":"07/05/2013 01:35 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=47.197011,+-121.980666(48638)&iwloc=A&hl=en\"> mufon case (48638) map </A>","Log Number":"US-07052013-0014","Date of the Event":"07/04/2013 10:00 UTC","Object Features":"Unknown","Source":"MUFON","Weather Factors":"Unknown","Disposition":"Unresolved","City":"Enumclaw","Viewing Distance":"Over One Mile"}