{"files":["/var/www/straped/mufon/html2text/48646.html.txt","/var/www/straped/mufon/org/48646.html"],"Date of the Event":"07/04/2013 10:15 UTC","trends":["There have been 67 other sightings in Independence","There were no other sightings in Independence on or around July 4th 2013"],"divs":["Sighting DetailsWhile taking video of the neighborhood's fireworks, I noted a light that seemed to be neither a plane (there was one of those and it looked very different), nor a helicopter (I've seen those regularly), nor the fireworks I was trying to tape. The only way I can describe it is, it looked like one of those Chinese lanterns that float up into the air when released, with a flickering candle inside a bag. I thought that's what it was, and that someone had gotten creative with their particular Fourth of July display. But after a few moments I realized the bag would have to be awfully big to be seen at that distance. It wasn't that unnerving; in fact the fireworks I'd come out to observe distracted me a couple of times. But it seemed to drift, only it repeatedly approached the area as if curious about the fireworks, then retreated, using the same apparent \"drifting\" motion. From my vantage point, it seemed to be over the nearby Hawthorne Place apartment complex, more or less; sometimes a little past it. When I went out later in the evening, after the fireworks were long over (about 1:00 a.m.), the object was long gone as well. To be honest with you, I may or may not have had a traumatic encounter with \"something\" in the past. There is a \"punch biopsy\" mark on my right shin just below the knee, which my late parents swore they had never taken me for such a procedure. (It appeared in childhood.) In the early 1990's, I began having flashbacks to something, I still don't know what, but whatever it was was frightening. **The only reason I tell you this is, that's one of the things that was very odd about this \"ufo\" (if I can use that term) which I'm reporting now. Looking at it, I felt calm, and even thought it was quite beautiful. With my history, you'd think that if I believed I was looking at a \"UFO\", I'd be under the bed wetting myself and crying for Mommie two minutes later. But that was not the case. I'm reporting only one witness, me, because I didn't talk to the neighbors; they were pretty intent on blowing things up and cheering about it at the time. Besides, I was in my pajamas & wanted to get back inside--and make sure my cats weren't in there popping Valiums or anything. (lol) Well, thanks for listening. I hope this info is useful for you in some way."],"Source":"MUFON","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Longitude":"-94.357253","Region":"Missouri","Weather Factors":"Unknown","Object Flight Path":"Other","Latitude":"39.111068","Case Number":"48646","Country":"United States","Object Features":"None, Other","City":"Independence","Log Number":"US-07052013-0022","Date Submitted":"07/05/2013 03:12 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.111068,+-94.357253(48646)&iwloc=A&hl=en\"> mufon case (48646) map </A>","Summary":"Resembled chinese floating lantern, only much larger. Candle-like flickering light from within.","Viewing Distance":"101-500 Feet","Tags":"City","Object Shape":"Unknown"}