{"map":"<A HREF = \"http://maps.google.com/maps?q=47.184174,+-122.139015(48642)&iwloc=A&hl=en\"> mufon case (48642) map </A>","Disposition":"Unresolved","Summary":"Black spheres flew across sky at start of 4th of July fireworks towards Mt Rainier","divs":["sighting detailswent out on the 4th of july with my four kids at the onset of neighbors fireworks. as we waited and watched for fireworks, a huge black circular sphere flew above us (at about 30 feet). it seemed to glow with a reddish\\orange light at the bottom. within ten seconds, no more light was visible and the black sphere flew across in a straight line towards mt rainier. i observed it with curiosity. it was unaffected by wind and did not move off course; it just went straight by us and we watched it continue until out of sight. within a minute, three more spheres flew off heading the same direction as the first one and then seemed to change course and again head straight towards mt rainier. they were farther away in the distance in tree lines of evergreen trees, but i could estimate that they were large by the fact that they were dwarfing the trees. additionally, within another minute, two more spheres flew by in a straight line. at this time, firework displays began all over and the night sky darkened. i did not see any more after that. scared me and my kids out of our minds. they were huge black spheres (about 5-10 feet in diameter or bigger from where i was standing) that were completely silent. they were way too big to be balloons. they went in a straight direction without anything propelling them. what has the ability to do that? what could they possibly be?"],"Sighting Duration":"00:05:01","City":"Bonney Lake","Longitude":"-122.139015","files":["/var/www/straped/mufon/html2text/48642.html.txt","/var/www/straped/mufon/org/48642.html"],"trends":["There have been 4 other sightings in Bonney Lake","There were no other sightings in Bonney Lake on or around July 4th 2013"],"Tags":"City","Object Features":"None","Case Number":"48642","Object Shape":"Circle, Sphere","Source":"MUFON","Log Number":"US-07052013-0018","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Date Submitted":"07/05/2013 02:16 UTC","Latitude":"47.184174","Viewing Distance":"20 Feet or Less, 21-100 Feet","Region":"Washington","Country":"United States","Date of the Event":"07/04/2013 09:05 UTC","Weather Factors":"Unknown"}