{"Sighting Duration":"Undisclosed","Source":"MUFON","Case Number":"48651","map":"<A HREF = \"http://maps.google.com/maps?q=45.425097,+-122.778837(48651)&iwloc=A&hl=en\"> mufon case (48651) map </A>","Longitude":"-122.778837","trends":["There have been 11 other sightings in Tigard","There were no other sightings in Tigard on or around July 5th 2013"],"Country":"United States","Region":"Oregon","City":"Tigard","Latitude":"45.425097","Object Flight Path":"Straight-line path","Object Shape":"Egg, Oval, Sphere","Summary":"line of 7 pulsing objects slowly moving from N to S over Tigard, OR","divs":["sighting detailscame out onto deck for a smoke at 12:30 am before bed. looking out to the north, saw a bright red-orange\\yellow-orange object moving slowly in my general direction. as my daughter and i watch the skies frequently and she was inside, i called her out to see what i was looking at. she was outside within 30 seconds by which time a second object was also in the sky, following the same basic line of flight. just as the first object was about to go out of our view - behind a tree to the ne - a third object appeared in the northern spot from which the first two had originated. so there were three objects viewable in the sky at the same time. this was from 12:33 to 12:36. we viewed the objects both with the naked eye and with binoculars. the best way to describe the objects is to say they were egg like (without the shell). the \"whites\" of the eggs were approximately one and a half times larger than the \"yolks\" and the yolks were the light source of the objects and rotated in a similar fashion to police lights in that they seemed to spin in the bottom of the \"egg\" and illuminated brighter and dimmer as they spun. almost immediately after the third object went behind the tree in the ne which was the last point we could see them, a fourth one appeared in the northern sky from where the original three had originated. a second one followed suit before the fourth one was no longer viewable; there were two in our field of vision at this instance. about 2-3 minutes after the fifth one had gone behind the tree there was another, and approximately 4-5 minutes after the sixth there was a seventh. we had also seen a similar object west of our position at 10:45 pm (on the 4th of july) and (though we didn't really think so) concluded that, logically, it must have been a chinese lantern. it was moving way too fast for us to really believe that, but we didn't want to let our imaginations run away from us and we had not observed it intently with the binoculars. seeing the 7 others after midnight convinced us that the first\\earlier object was one of the same types. the objects that we observed were moving very smoothly and relatively slowly through the sky, taking about 2 to 2.5 minutes apiece to move across our field of view; probably about 8 miles of travel total with the nearest point being a bit less than a mile away. the last object we saw was at 12:44 in the early morning of july the 5th."],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/48651.html.txt","/var/www/straped/mufon/org/48651.html"],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Date Submitted":"07/05/2013 04:48 UTC","Tags":"City","Date of the Event":"07/05/2013 12:00 UTC","Disposition":"Unresolved","Log Number":"US-07052013-0027","Object Features":"Other"}