{"Date of the Event":"07/04/2013 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=29.978212,+-95.693919(48667)&iwloc=A&hl=en\"> mufon case (48667) map </A>","Object Flight Path":"Path with directional change","Case Number":"48667","Tags":"City","Viewing Distance":"21-100 Feet","divs":["Sighting DetailsWe were all sitting outside to watch fireworks because it was the 4th of July, and a friend and I were on a waterslide and saw this bright object. So we go and get out family and it was bright green flying North, then we pointed at it, and it started coming torwards us, and turned red. After a few seconds of watching it, the object turned neon blue, and split into 2 objects It only lasted for a few seconds before it returned into one big green and red object. My uncle syarted recording it but the video only came out as a tiny white ball thay gradually becomes larger as it flew over our house. Once over the house we ran to thw front door, and within 2 seconds it was very far. So everyone but a few people went inside and as we were talking about it, we started hearing a weird peircing noise that gradually became louder and started to sound like soundwaves. It would go in one ear and out the other and it made us just sit their for a few seconds before we jumped up to get the rest of the family. Once we all calmed down we went outiside at about 3 am. Nothing more happened, but it was a very weird inncident! Nobody of the people that experienced it really believed in aliens, but we are firm believers. now"],"Latitude":"29.978212","trends":["There have been 3 other sightings in Cypress","There were no other sightings in Cypress on or around July 4th 2013"],"Longitude":"-95.693919","Source":"MUFON","Summary":"greean and red lights the once it hovered over us it made a buzzing sound.","City":"Cypress","Country":"United States","Region":"Texas","Weather Factors":"Unknown","Date Submitted":"07/05/2013 12:22 UTC","Disposition":"Unresolved","Object Shape":"Flash, Other","files":["/var/www/straped/mufon/html2text/48667.html.txt","/var/www/straped/mufon/org/48667.html"],"Sighting Duration":"00:05:30","Object Features":"Patterned Surface","Log Number":"US-07052013-0043"}