{"Latitude":"38.411532","Longitude":"-90.368685","Source":"MUFON","divs":["Sighting DetailsI witnessed eight objects that I would call a UFO. All were like flying lanterns, like fire glowing in the sky moving at high speed. Appeared while there were fireworks going off. I observed these lights for over an hour. I also have video of the event(s). I was at first skeptical as to what these objects were. One of the first I witnessed, the light began to pulsate closer to the town of Arnold, MO. The light then went out and in the light of dusk, I could make out the shape of the craft. It resembled a turtle shell and from the distance I would say that the craft was very large. I was able to make out two craft as such, and was also able to see the shape of a craft as it passed over my home without lights. The lights turned off, and I was able to make out the same shape of a large craft that physically blocked out the night sky. I have seen things like this in my life, but never in this detail. I also believe that I also saw one of these craft on the date of July 3, 2013. The craft that day was exactly the same as on July 4th in description but only with the fire like appearance. As I have mentioned, I do have video of the craft(s) with and without lights. It was an amazing event and I plan to monitor the sky above my home for further evidence. If someone would like to contact me to view these videos or to interview myself, I am more than happy. The second witness to most of this sighting was my 6 year old son, he saw them as flying lanterns and was quite helpful in pointing them out. The first sighting on July 3, 2013 had four adult witnesses including myself. I do not currently have access to these videos, but I will upload them at your request."],"Region":"Missouri","Object Shape":"Disc","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.411532,+-90.368685(48668)&iwloc=A&hl=en\"> mufon case (48668) map </A>","files":["/var/www/straped/mufon/html2text/48668.html.txt","/var/www/straped/mufon/org/48668.html"],"Disposition":"Unresolved","City":"Arnold","Date Submitted":"07/05/2013 12:31 UTC","Object Features":"Dome","Date of the Event":"07/04/2013 12:00 UTC","Case Number":"48668","Log Number":"US-07052013-0044","Country":"United States","Summary":"looked like fire flying through the sky. when closer to town, lights turned off and was able to see craft.","Object Flight Path":"Straight-line path","Tags":"City","Weather Factors":"Unknown","Viewing Distance":"Unknown","trends":["There have been 7 other sightings in Arnold","There were no other sightings in Arnold on or around July 4th 2013"]}