{"Viewing Distance":"Over 1 Mile, Unknown","Source":"MUFON","Disposition":"Unresolved","Tags":"City","Date of the Event":"07/04/2013 08:30 UTC","City":"Puyallup","map":"<A HREF = \"http://maps.google.com/maps?q=47.110809,+-122.340184(48661)&iwloc=A&hl=en\"> mufon case (48661) map </A>","Case Number":"48661","Log Number":"US-07052013-0035","Summary":"Several Red fireball objects 1st at 8:30 from East, then more appeared from different directions flying back and forth above Puyallup South Hill between Meridian and Waller Rd.","Region":"Washington","Latitude":"47.110809","Weather Factors":"Unknown","Date Submitted":"07/05/2013 10:24 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/48661.html.txt","/var/www/straped/mufon/org/48661.html"],"divs":["Sighting DetailsI was outside about to start fireworks when I noticed a very bright red fireball slowly traveling in the sky. Not a firework. It continued to glow beat red. My attention went to what I saw so I kept looking at it however it dimmed out and disappeared. 2 minutes later I caught another one through some trees (lots of trees where I am) I ran to try and get a better look to see if it was what I had just seen and there were two together moving across the sky. in kind of a pattern, slight direction changes viewed while visible. Then other ones were visible in other directions spanning a good distance, like 1-2-3 miles apart?? Hard to tell. They were all over But I never saw more than 4 at one time. They're real good at disappearing. As soon as the fireworks died down so did the sightings. Although it felt as if they were still there, you just couldn't see them. (Strange feeling) This is three years in a row now that I have had sightings here on July 4th. I also have Pics and Video of all three years now. I feel like everyone thinks I'm a nut, but I know what I'm looking at. I got excited that they did come because I had expressed curiosity as to if they'd be here again. Other friends and family members saw it also. Last year scared the heck out of me and I reported it to nuforc and got no response from anyone. I wasn't as affected this time because it wasn't any more intense than the year prior. And the first year on July 4th I witnessed a ufo it was 1 black round or oval disc. No fireballs. I'll expect them next year too. I just hope one day I have an answer to this mysterious fireball sighting. It's hard to imagine the government has no knowledge of this Independence day visit. Too many people are seeing them!"],"Longitude":"-122.340184","Object Shape":"Fireball","trends":["There have been 13 other sightings in Puyallup","There were no other sightings in Puyallup on or around July 4th 2013"],"Sighting Duration":"Undisclosed","Object Features":"Unknown","Object Flight Path":"Path with directional change,Path then hovering"}