{"Tags":"City","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=49.769622,+-94.482492(48662)&iwloc=A&hl=en\"> mufon case (48662) map </A>","Sighting Duration":"Undisclosed","Summary":"Three bright stars in triangle shape faded out of sight","Date of the Event":"06/30/2013 11:30 UTC","Country":"Canada","Latitude":"49.769622","Viewing Distance":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/48662.html.txt","/var/www/straped/mufon/org/48662.html"],"Date Submitted":"07/05/2013 10:44 UTC","Case Number":"48662","Disposition":"Unresolved","Weather Factors":"Unknown","Longitude":"-94.482492","Log Number":"CA-07052013-0036","divs":["Sighting DetailsI was sitting at a fire the evening of June 30th, 2013 and was staring out at the southern sky. The stars had not been out long and I noticed three stars. They caught my eye because they were slightly brighter then the rest. I stared at them for a short time (aprox. 30 sec) while I was listening to some conversation and then the three stars faded out, like you would see if a cloud passed over them. I thought it was strange because it was a clear night so I remained focused on the spot in the sky where they were and noted the stars around the location. I waited for 2-3 minutes but they did not reappear nor was there any clouds moving in the area of the sky where they were. It was also strange that all three of these lights faded out at the same time. There was also no movement of the three lights while they were visible. I grabbed my phone to check Google Sky Map to see if there are any stars in the location of the three that I saw. From what it was showing, there are no visible stars in that location of the sky which would explain what I saw. All of the other stars that were visible after the sighting showed up on the Google Sky Map app. I grew up on a farm and have always had a fascination with the stars and have spent many hours of my life staring up at them. I've seen meteors, comets, the ISS, satellites, planes and helicopters in the night sky and I have never seen anything like what I did that night."],"City":"Kenora","Object Flight Path":"Stationary","trends":["There have been 4 other sightings in Kenora","There were no other sightings in Kenora on or around June 30th 2013"],"Object Shape":"Triangle","Region":"Ontario"}