{"Summary":"Saw Bright orangish orb appear out of nowhere. Traveled extremely slow. Saw 6 more to the west a few minutes later then another one following same path as first","Region":"Michigan","Case Number":"48675","City":"West Branch","Tags":"City","Object Shape":"Circle, Fireball","trends":["There have been 2 other sightings in West Branch","There were no other sightings in West Branch on or around July 4th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=44.337182,+-85.044155(48675)&iwloc=A&hl=en\"> mufon case (48675) map </A>","Longitude":"-85.044155","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Date Submitted":"07/05/2013 02:19 UTC","Country":"United States","Source":"MUFON","Date of the Event":"07/04/2013 10:20 UTC","Object Features":"Unknown","Object Flight Path":"Hovering then path,Path then hovering","Latitude":"44.337182","Weather Factors":"Unknown","Sighting Duration":"00:10:00","divs":["Sighting DetailsIt was last night (July 4th) and I had just came home from work. It was approximately 10:18. I walked into my house, which sits behind my Moms house. I walked in and was looking to the east because I could hear fireworks. Didn't see anything. Walked into the house, set my keys down and my other work stuff then walked back outside. Looked toward the east again. A big orange ball appeared over the building next door to my house. It just appeared. If it had been following a path, I would have seen it. Ran back inside and grabbed my cellphone. Started filming at 10:21pm. The ball seemed close to me but also far away, if that makes sense. There was no noise. It travelled directly over my house then over the golf course behind me and disappeared. It didn't seem to travel upward but got smaller and smaller and disappeared. I stood there for a minute or so scanning the sky. In the southeast, I saw six orange balls about a half mile or so away. All like what I had just witnessed but smaller. They were in a straight line, seemed to come together (almost forming two triangles) then disappeared. I went and got my dog and came back outside. A few minutes later, I saw another orange ball appear in the same spot as the first one. It travelled the same path as the first and disappeared in the same spot. I know it was July fourth and everyone has been teasing me (except one friend from another town who witnessed the exact same thing a couple months ago in a town over an hour away) but this was NOT fireworks and not a plane. Between the small fireworks being set off (we did not have a fireworks show here in my small town), there was absolutely no noise. This was so close I should have heard something. I am one of the biggest skeptics you will meet when it comes to UFOs but this was unexplainable. I was fascinated yet creeped out all at the same time. I stayed outside another 10-15 minutes but saw nothing else. I did get crappy cellphone video of the two orbs that travelled over my house but the six smaller ones did not show up on my video"],"Log Number":"US-07052013-0051","files":["/var/www/straped/mufon/html2text/48675.html.txt","/var/www/straped/mufon/org/48675.html"],"Disposition":"Unresolved"}