{"Viewing Distance":"N/A","Weather Factors":"Unknown","Date Submitted":"07/05/2013 03:38 UTC","Log Number":"US-07052013-0055","trends":["There have been no other sightings in Forest","This sighting has never been favorited."],"Date of the Event":"03/01/2012 12:00 UTC","City":"Forest","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=37.363753,+-79.289749(48679)&iwloc=A&hl=en\"> mufon case (48679) map </A>","Region":"Virginia","divs":["Sighting DetailsI did not have a sighting of a UFO. I picked up a free real estate brochure over a year ago in the Lynchburg, VA area. Going through the brochure, I saw a picture of a home in a new subdivision that has an apparent UFO hovering above it. This is not just a speck in the picture and is a fairly decent size. It has the traditional saucer shape and appears to be a distance behind the home. It is not a tower or structure of any kind behind the house. I have subsequently gone to that subdivision and it is a wide open rural area. At the time I decided not to do anything, since I was certain that many other people must have seen this photo and would report it. I returned to the area this past October to search for properties again. Since the agent we were using is also the agent that had listed this property originally, I brought my copy of the brochure with me. I showed her this picture and she was surprised by it. She said that no one had ever brought this to her attention before. She made copies of the page and asked other realtors there to get ahold of the original photo, which was taken by a photographer for the firm. This agent is one of the co-owners of the real estate agency, so she did have the clout to pursue this. She seemed to genuinely agree that this looked like an apparent UFO. I have not been in touch with her following that time. I told her that we would also be looking into properties in the Pocono area in PA and would contact her if we decided on the Lynchburg, VA area. I don't know what the outcome was but she seemed determined to pursue it. I did mention MUFON but I don't know if she knew about your organization. I feel that you should see this photo and follow up on it. For all I know, no one has bothered to do anything about this and I should at least notify you about it. If you are interested, please contact me at the email address listed above."],"Object Flight Path":"Unknown","Summary":"Photo of a new construction home in real estate brochure shows apparent UFO above the house.","Latitude":"37.363753","Case Number":"48679","Source":"MUFON","Disposition":"Unresolved","Country":"United States","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/48679.html.txt","/var/www/straped/mufon/org/48679.html"],"Longitude":"-79.289749","Object Shape":"Disc","Sighting Duration":"Undisclosed"}