{"Country":"United States","files":["/var/www/straped/mufon/html2text/48672.html.txt","/var/www/straped/mufon/org/48672.html"],"Disposition":"Unresolved","Date Submitted":"07/05/2013 12:52 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.493651,+-73.045757(48672)&iwloc=A&hl=en\"> mufon case (48672) map </A>","Object Features":"Patterned Surface","Sighting Duration":"Undisclosed","Object Shape":"Disc","Viewing Distance":"101-500 Feet","Date of the Event":"07/04/2013 09:00 UTC","Case Number":"48672","Latitude":"41.493651","Longitude":"-73.045757","Source":"MUFON","Log Number":"US-07052013-0048","Object Flight Path":"Straight-line path","trends":["There have been 6 other sightings in Naugatuck","There were no other sightings in Naugatuck on or around July 4th 2013"],"Region":"Connecticut","Summary":"Looked like a flare but didn't burn out. Then I was able to see grayish disk type craft.","divs":["Sighting DetailsWe were sitting out on the deck. The area is quite dark and not much ambient light. At first when it appeared we thought it was a firework since it was the 4th. When the object didn't burn out we realized that it wasn't a firework at all. It started as a \"fireball\" glowing like a flare. Then as I followed it behind some trees and the trees blocked the glowing part I could see the actual craft that was much larger then the glowing part. The glowing part was near the front of the craft. The craft was a dull grayish in color with no other lights and emitted no noise. I then lost the object behind the trees as it continued its northerly path. Then at 10pm it was back. Again coming from the south heading due north but a little higher in the sky this time. We're not sure is this was the same one we saw at 9 or a second one. The \"flare like\" glow was identical but the night sky was much darker so this time we couldn't see the actual craft. If I didn't see the actual craft the first time I would have thought that the glow was the craft whe in fact the craft itself was much, much larger. I was able to capture 2 photos and a minute of video before we lost sight of it in the distance."],"City":"Naugatuck","Tags":"City"}