{"Sighting Duration":"Undisclosed","Country":"United States","Summary":"Saw orange/red golf ball sized object moving south/east holding a vertical line","City":"Washington","trends":["There have been 82 other sightings in Washington","There were 3 other sightings in Washington on or around July 4th 2013"],"Object Features":"Unknown","Date of the Event":"07/04/2013 10:15 UTC","Date Submitted":"07/05/2013 04:56 UTC","Latitude":"38.904152","Case Number":"48682","Tags":"City","Log Number":"US-07052013-0058","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Region":"Washington","files":["/var/www/straped/mufon/html2text/48682.html.txt","/var/www/straped/mufon/org/48682.html"],"Longitude":"-77.031956","divs":["Sighting DetailsOn July 4, 2013 at approximately 10:15PM we were looking west from Silver Lake in Everett, WA, watching the fireworks displays and witnessed a roughly golf ball sized orb moving from north to south, high over the tree line, above the Paine Field area. It stood out because it was much larger and more stable than the fireworks and it didn't follow the usual pattern of fireworks exploding and fading in the sky surrounding it. This is a heavily traveled small craft air corridor and we are confident it was not a small aircraft or helicopter as it's speed, shape or lighting was not comparable to either. At first we thought it was the afterburner from a military jet leaving Paine Field, but then ruled that out as it made no associated noise and was moving far too low and far too slowly to be a military jet. Also, if it were a afterburner our perspective of it would have changed as the jet changed course. This \"orb\" remained steady and true. It maintained a steady speed, altitude and horizontal flight line for a couple of minutes then appeared to smoothly turn east, with no change in speed, somewhere over what may have been Shoreline, WA. We continued tracking it east a bit further and observed it slow slightly over what might have been the Seattle or Bellevue area. It is difficult to be sure of the distances involved. It then very gradually came to a stop and hovered for a moment. It appeared to \"fizzle\" or \"fade\" a bit and gradually disappeared. We couldn't tell if it simply vanished or was moving south at a higher rate of speed and faded from view. An acquaintance told us it is common for people to light Chinese lanterns and float them on the 4th. I can't say with any certainty what this was, but we are certain it was like nothing we witnessed before and it prompted me to make this report."],"map":"<A HREF = \"http://maps.google.com/maps?q=38.904152,+-77.031956(48682)&iwloc=A&hl=en\"> mufon case (48682) map </A>","Object Flight Path":"Straight-line path,Path with directional change","Disposition":"Unresolved","Object Shape":"Circle, Sphere","Source":"MUFON"}