{"Weather Factors":"Unknown","divs":["Sighting DetailsI was walking my dogs along my street in mid-town north of the Plaza a few minutes before midnight--probably during a 10 window between 11:45 and 11:55 PM (I was home by 11:57) on July 3, 2013 and noticed a fairly bright \"star-like\" object moving from SW to NE. It was a pinpoint of light at this stage, looking a lot like Mars on a clear viewing night in color in luminosity. What attracted my attention was that it was a solid reddish-orange in color with no other apparent running lights or flashes. It was moving fairly quickly, too fast to be an airliner at altitude, and completely silently. Having lived in the same neighborhood all my life I am familiar with the traffic patterns of most normal aircraft overhead in the area and the track of this object did not confirm to the usual norms. I did not believe it to be a small fixed wing aircraft because of the lack of other running lights and no sound at all. Additionally, it traveled with a vague side-to-side motion, somewhat like a speedboat hitting waves on water. It was clearly not a helicopter. Other possibilities I considered were a lighted balloon--which seemed unlikely due to brightness and speed--and some kind of fireworks or flare, which also seemed unlikely as the light was relatively bright, but star-like and constant rather than like that of flare and it showed no characteristics of \"burning\", smoke or other emission. I observed the object for about 10 seconds before I passed under (and it passed over) the canopy of a couple small trees along the street. At this point the object had attracted my attention but I still thought it was probably something typical and which had just looked \"odd\" for some reason. I was fairly dismissive of it at this point. Odd lights in the night sky are not impressive to me. When I passed out from under the canopy of trees, having lost sight of the object for about 10-20 seconds, I tried to get another look at it. At first I didn't see it at all, which puzzled me because it was a fairly bright light and moved relatively fast compared to the background sky. I made a quick estimation of where it should have been, based on the line of direction and speed it was traveling when I went under the trees. At that spot, I saw something that looked totally different than the reddish-orange pinpoint of light. This object looked essentially like a \"smoke-ring\". It was still slightly reddish-orange but could no longer be described as a \"light\". It was circular in shape, approximately the size of a penny held at arm's length and had a darker center than the outer margin. This object was difficult to see against the night sky. It had a center \"hole\" or dark area which was darker than the outer ring but still not as dark as the night sky. I could not tell if this object was still emitting a very weak light or if it was visible due to reflected light from ground sources. It still maintained a slight reddish-orange color throughout though. It continued in the same line of travel--SW to NE with a vague side-to-side fluttering motion--at the same apparent speed it had been traveling before I lost sight of it behind the canopy of the trees. Being close to the Fourth of July Holiday, I immediately considered whether this could be some kind of fireworks artifact or residue but concluded that, despite its \"hazy\" look and indistinct outer margin, this object was remaining coherent and unchanging in shape and density. I was not hearing the sound of any fireworks around this time at all and had it been a vaporous object, smoke, haze, mist, etc, I have no doubt that whatever velocity wind it would have taken to move it that fast would have torn it apart. This was one of the most compelling and striking aspects of the object; the fact that it looked indistinct but somehow remained consistent in appearance. It did look like it was possibly translucent but it never passed in front of any stars or other objects in order for me to really assess that possibility. I believe this object to be the same star-like light that I had observed before passing under the trees based on its position, speed and direction of travel. The only subsequent change in its appearance was it appearing to grow smaller, consistent with a solid object moving away into the distance. I watched this \"smoke-ring\" like object for probably 15-20 seconds before I lost it behind another row of trees to the north-east. My reaction to the initial light was one of mild curiosity but mainly dismissal. An unusual light in the sky might merit a second look but these are relatively common-place and meaningless. It was when I saw the \"smoke-ring\" like object that I became very puzzled. I have never seen anything like it. I am familiar with the night sky; I know where the ecliptic can be found, can sight and name the major planets and basic constellations. I've seen any number of \"shooting stars\" and have witnessed objects a few times burning up in the atmosphere that were later reported to have been \"space junk\". I've seen fireworks, flares and even once launched a night-time hot air balloon made from a laundry bag. This object looked like nothing I've ever seen before. It was far too slow to be a meteor or space-junk and it moved too quickly to have been an airliner. It was completely silent and did not resemble a private plane or helicopter and once it appeared in the \"smoke-ring\" form, actually had an unquantifiable aspect to it that made it seem almost \"unreal\" somehow. I have no doubt I saw it though. I even glanced away for a second and looked back at it and it was moving quickly enough that I had to look, not where I'd last seen it, but where it had moved to. If I can offer a subjective impression, my feeling is that whatever this object was, when I first sighted it as a pin point light, it was much higher in the sky and coming toward me and descending at the same time. It seemed, when I first came out from under the trees, that the object, which now had a visible shape instead of being just a \"light\", had \"powered down\" and was maintaining a level flight. Again, at this point, the object was nearly as dark as the night sky, barely visible and I recall thinking at the time that if I hadn't known pretty much exactly where to look for it, I could have been almost staring at the sky and probably wouldn't have seen it. My feelings afterward are of curiosity. I don't claim this was a \"space-craft\" or \"flying saucer\". I can't demonstrate anything of the sort. It was, however, a most unusual object, the like of which I have never seen before and I've very interested in learning whether anyone else might have seen it. I have no doubt though of what I saw and I'm not looking for external validation of the sighting so much as to whether anyone else might have additional details or, perhaps, an explanation for what this object might have been."],"Viewing Distance":"Unknown","Disposition":"Unresolved","Date of the Event":"07/03/2013 11:50 UTC","Tags":"City","trends":["There have been 134 other sightings in Kansas City","There were no other sightings in Kansas City on or around July 3rd 2013"],"Latitude":"39.034027","Object Shape":"Disc, Star-like","Source":"MUFON","City":"Kansas City","Log Number":"US-07052013-0059","Object Features":"Patterned Surface","map":"<A HREF = \"http://maps.google.com/maps?q=39.034027,+-94.581474(48683)&iwloc=A&hl=en\"> mufon case (48683) map </A>","Country":"United States","Sighting Duration":"Undisclosed","Date Submitted":"07/05/2013 05:10 UTC","Longitude":"-94.581474","Summary":"Relatively bright star-like object which became hazy \"smoke-ring\" but maintained consistent shape","Case Number":"48683","Region":"Missouri","files":["/var/www/straped/mufon/html2text/48683.html.txt","/var/www/straped/mufon/org/48683.html"],"Object Flight Path":"Straight-line path"}