{"Longitude":"-78.881084","files":["/var/www/straped/mufon/html2text/48688.html.txt","/var/www/straped/mufon/org/48688.html"],"Object Features":"Unknown","Object Flight Path":"Straight-line path","Log Number":"US-07052013-0064","trends":["There have been 52 other sightings in Myrtle Beach","There were no other sightings in Myrtle Beach on or around July 3rd 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.69365,+-78.881084(48688)&iwloc=A&hl=en\"> mufon case (48688) map </A>","Summary":"When first observed there were 4 objects travelling in a formation from south east to northwest.","Date of the Event":"07/03/2013 09:40 UTC","Case Number":"48688","City":"Myrtle Beach","divs":["Sighting DetailsWhile working as a private security contractor at an apartment complex along Burcale Road, I was talking to a colleague from work when I observed 4 brilliantly lit objects moving from the south east to the north west. I asked my colleague if he was seeing the same objects and he stated yes he saw them also. The objects appeared orb like and had a brilliant white light that appeared to turn amber along the very outer edge of the light then would go back to white light. There was no sound associated with the objects and they moved much slower then an aircraft. Their track took them through, what I know to be, the flight path for incoming aircraft into Myrtle Beach International airport. My first thought was they were aircraft, flying dangerously close to each other, with very bright landing lights. But their path was towards Conway, SC and away from the airport. My colleague and I moved closer, from a parking lot to a lawn area between some buildings and Burcale Road. I went to get my phone to take a picture. My phone was in a pocket on my tactical vest. It took me no more than 30 seconds to get the phone, turn it on, and begin the camera function on the phone. When I presented the camera I could see that there were now only 3 objects. I snapped the picture. When I asked my colleague what happened to the other object, he stated to me that it had fallen straight down and was trailing what he called \"sparks\" then disappeared. My colleague and I are both veterans and both stated that the objects resembled a star cluster flare, used by U. S. military aircraft. But there had been no aircraft or even sounds of low flying aircraft, either just prior to, during, and after we observed the objects. I also noted that there had been no report as there is with a military aircraft deploying star cluster flares. The picture shows the objects just prior to us losing sight of them behind the tree line on the west side of Burcale Road."],"Tags":"City","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Region":"South Carolina","Disposition":"Unresolved","Date Submitted":"07/05/2013 06:08 UTC","Weather Factors":"Unknown","Object Shape":"Circle, Sphere, Star-like","Latitude":"33.69365","Sighting Duration":"Undisclosed"}