{"Object Features":"None","Country":"United States","divs":["Sighting DetailsFor the past couple of months on any clear evening star-like objects were observed in a general west to east orbit during which objects made erratic movements (up down side ways with no pattern to movements). Sightings occurred after dark at approximately 9:30 pm to midnight. The number varies from 1 to 4. Movements are sharp and erratic with multiple directional changes. Initial thoughts were space stations or stars but with the movements observed these are definitely something else. Noticed shape changes on several instances. In several instances airplanes were present noting objects were star-like and definitely far above the planes. Initial sighting was just looking up on a dark evening gazing at what I thought was a star when I noticed erratic movement of object. Asked another person to verify. That person indicated not only was the object I observed moving erratically in an unnatural manner but there was another object acting in a similar manner. After a period of about 15 minutes went back inside. Went back out about a half an hour later, objects had moved slightly east of initial position but were acting in the same manner. One would think these were stars but the movement patterns, change in brightness and occasional shape changes made me realize these are abnormal sightings! it should be noted objects do not disappear but are there whenever we look on any clear evening! Sightings are occurring in my driveway. Observations made with both the naked eye and with binoculars."],"Disposition":"Unresolved","City":"Clarendon Hills","Viewing Distance":"Over 1 Mile, Unknown","Source":"MUFON","Case Number":"48684","Object Shape":"Sphere","Date of the Event":"06/15/2013 12:00 UTC","trends":["There have been 3 other sightings in Clarendon Hills","There were no other sightings in Clarendon Hills on or around June 15th 2013"],"files":["/var/www/straped/mufon/html2text/48684.html.txt","/var/www/straped/mufon/org/48684.html"],"Date Submitted":"07/05/2013 05:48 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=41.801392,+-87.935649(48684)&iwloc=A&hl=en\"> mufon case (48684) map </A>","Tags":"City","Longitude":"-87.935649","Latitude":"41.801392","Log Number":"US-07052013-0060","Weather Factors":"Unknown","Region":"Illinois","Summary":"star-like objects erratically changing directions on a random basis"}