{"Date Submitted":"07/05/2013 04:02 UTC","Case Number":"48680","Country":"United States","Tags":"City","Date of the Event":"07/04/2013 10:30 UTC","Longitude":"-94.294288","Log Number":"US-07052013-0057","trends":["There have been 2 other sightings in Bella Vista","There were no other sightings in Bella Vista on or around July 4th 2013"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.462896,+-94.294288(48680)&iwloc=A&hl=en\"> mufon case (48680) map </A>","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Latitude":"36.462896","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/48680.html.txt","/var/www/straped/mufon/org/48680.html"],"divs":["Sighting DetailsMy wife and I were sitting outdoors when I first spotted what I thought to be a roman candle firework (it was the 4th of July) but it kept going in a straight path for about a minute until it quickly faded out. A few minutes later I saw more similar object heading in the same direction (WNW ). They too faded out one at a time as they went away leading me to believe the red lights were forward facing. One more passed overhead followed by one more - only the last one just went dark instead of fading out. We live on the flight path to our regional airport and are quuite use to planes as they come in to make thier final turn to the runway. The planes are probably below 5,000 ft as the airport is only 20 minutes away so I think I can make a reasonable estimate of their altitue and speed. The objects in question I would estimate to have been around 10,000 ft and travelling 200 - 300 MPH. But they made absolutely no noise and we can easily hear planes flying in to Tulsa which is over an hour away. since it was dark out, I have no idea of the physical size or shape, although I did try to observe if any backgroud sky-light or stars got blaked out after the objects went dark. I saw no such effect."],"Source":"MUFON","Object Features":"None","Region":"Arkansas","City":"Bella Vista","Object Shape":"Unknown","Object Flight Path":"Straight-line path","Summary":"1 object, then 3 in formations, two more singly."}