{"Object Features":"Unknown","trends":["There have been 26 other sightings in New Orleans","There were no other sightings in New Orleans on or around July 4th 2013"],"Date Submitted":"07/05/2013 06:11 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.006605,+-90.114529(48689)&iwloc=A&hl=en\"> mufon case (48689) map </A>","City":"New Orleans","Tags":"City","Log Number":"US-07052013-0065","divs":["Sighting DetailsNew Orleans,Lake Marina ave.Between 8:30 and 9:15. My girlfriend and I rust left a restaurant and were looking for a place to see fireworks, we walked toward the marinas looking for a pier. That was when I noticed lights in the sky that were not moving, they were flashing red then green,then bright white, but the white lights lasted longer then the rest, about seven seconds then back to the red and green lights. I noticed the lights because they where in a place were nothing should have been, they were over the lake, and very high.I pointed this out to my girlfriend,it just hovered there flashing.As we walked looking for a pier we were going in the direction of the lights, the sun had just started to set, it was not dark yet. We walked for about eight minutes,that's when I took out my iphone and started to take video of the object. As we walked closer I could make out a shape, a dark solid something with flashing lights, in a place it should not have been hovering in the middle of the sky with no support. As we got closer I started to feel uncomfortable and told my girlfriend to turn around. As we left I still continued to video the object. We stopped at a Walgreen drugstore to call a cab to back to our place,as I look back in the direction we just walked I could still see the object flashing, then nothing,it just wasn't there. But I did get about five to seven minutes of the object."],"Latitude":"30.006605","Object Flight Path":"Stationary","Summary":"Near the pries on lake Pontchartrain,looking north we noticed lights in the sky with no structures around it. They started","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Case Number":"48689","Source":"MUFON","Object Shape":"Sphere","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-90.114529","Country":"United States","Date of the Event":"07/04/2013 08:30 UTC","files":["/var/www/straped/mufon/html2text/48689.html.txt","/var/www/straped/mufon/org/48689.html"],"Region":"Louisiana"}