{"divs":["sighting detailsthe object was first spotted through my windshield as i approached a fill in station, i watched the object cross the night sky and was amazed how its color and speed and lack of flashing lights drew my children and myself in. i was hoping that the object be just a helicopter or plane but the longer we examined what was in the sky the more clear it became that we could not explain what we were seeing. i filled my vehicle with fuel and headed to the hotel in which we were sleeping for the night which was about 5-8 miles from the gas station. as we approached the hotel we noticed the object again and this time we had time to stand outside the vehicle and try and get video footage with my iphone and ended up with a little over 3 minutes of footage of the object changing colors,elevation and direction within seconds. the object had strange patterns of flight path and colors and was extremly fast but could stop on a dime and remain stationary prior to redirecting and\\or changing colors. amazing!!!"],"Sighting Duration":"Undisclosed","Summary":"The object flew across the sky changing flight paths abruptly and elevation and color also changed","Source":"MUFON","Tags":"City","trends":["There have been 18 other sightings in Lubbock","There were no other sightings in Lubbock on or around July 4th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.583213,+-101.846226(48690)&iwloc=A&hl=en\"> mufon case (48690) map </A>","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile, Unknown","Case Number":"48690","Latitude":"33.583213","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering,Other","Country":"United States","Date Submitted":"07/05/2013 06:36 UTC","Log Number":"US-07052013-0066","City":"Lubbock","files":["/var/www/straped/mufon/html2text/48690.html.txt","/var/www/straped/mufon/org/48690.html"],"Disposition":"Unresolved","Object Shape":"Circle, Oval","Longitude":"-101.846226","Date of the Event":"07/04/2013 11:10 UTC","Region":"Texas","Object Features":"Unknown"}