{"files":["/var/www/straped/mufon/html2text/48693.html.txt","/var/www/straped/mufon/org/48693.html"],"Longitude":"-89.621758","Log Number":"US-07052013-0068","City":"Springfield","Source":"MUFON","trends":["There have been 21 other sightings in Springfield","There were no other sightings in Springfield on or around July 4th 2013"],"Object Features":"Other","Date Submitted":"07/05/2013 06:58 UTC","divs":["Sighting Details The UFO I saw was about 70 feet away and 20 feet above the ground.It was dark orange and the material the UFO was made out of emitted a bright orange light. The structure of the UFO was comparable to a upside down light-bulb. At the bottom of the UFO there was a single hole that i could see inside the craft through, the hole was also emitting red-orange light with a ball of red-orange light that was positioned at the center of the hole in the UFO without struts or bars attached to it. I heard the trees moving and I looked to my left near the top of the trees at my home and saw the UFO hovering behind the tree. The UFO then slowly moved at a speed around 10 mph to the end of my street. I yelled to my girlfriend who was beside me to look and I pointed at the UFO. The UFO immediately started hovering higher and moving away from my location at around 30 MPH and gradually built up speed and rose higher until it was no longer visible. After seeing the UFO, two of my friends and I were watching the skies for the UFO in case it returned. We watched for about an hour and noticed six other red orbs in different locations in the sky, Three of the six orbs were flying individually. The other three orbs were in a triangular formation and flying in the same direction as if part of the same aircraft."],"Disposition":"Unresolved","Viewing Distance":"21-100 Feet","Weather Factors":"Unknown","Tags":"City","Region":"Illinois","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Summary":"Bright Lightbulb Shaped Glowing Red-Orange","map":"<A HREF = \"http://maps.google.com/maps?q=39.75745,+-89.621758(48693)&iwloc=A&hl=en\"> mufon case (48693) map </A>","Sighting Duration":"00:07:00","Date of the Event":"07/04/2013 09:30 UTC","Country":"United States","Latitude":"39.75745","Object Shape":"Other","Case Number":"48693"}