{"Region":"Missouri","divs":["Sighting DetailsWhile driving on a local highway at around 10:15pm, I saw a bright, fuzzy red light traveling at a low rate of speed over Herculaneum, Missouri. I noticed something odd about this light, so I pulled off at the Herculaneum exit and stopped to observe. I tried to drive its approximate location, but the light went out. I returned to the highway and observed the object reappear near Pevely, MO moving southwest. I pulled off at the Pevely exit and followed it as it moved over a quarry, but I could not pursue further. This object was *not* fireworks. It was a slow moving, low flying, bright object. It made no discernible noise. It was a still night and the object would have been traveling opposite of the normal wind direction, so it probably wasn't a balloon or Chinese lantern. I did not observe running lights, however conditions were slightly hazy due to fireworks. The next day, I talked with a MUFON member who observed an object matching the exact description of this object moving south over Arnold, Missouri at roughly the same time-frame. It flew consistent with the speed and altitude of an ultralight aircraft."],"Object Features":"None","files":["/var/www/straped/mufon/html2text/48706.html.txt","/var/www/straped/mufon/org/48706.html"],"trends":["There have been 2 other sightings in Herculaneum","There were no other sightings in Herculaneum on or around July 4th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.268388,+-90.38012(48706)&iwloc=A&hl=en\"> mufon case (48706) map </A>","City":"Herculaneum","Source":"MUFON","Weather Factors":"Unknown","Longitude":"-90.38012","Case Number":"48706","Object Flight Path":"Path with directional change","Country":"United States","Object Shape":"Fireball","Date Submitted":"07/05/2013 11:10 UTC","Latitude":"38.268388","Log Number":"US-07052013-0080","Summary":"Red Glowing Object - Pevely/Herculaneum","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Date of the Event":"07/04/2013 10:15 UTC","Disposition":"Unresolved","Tags":"City"}