{"Summary":"Reddish Orange Glowing Balls","Date of the Event":"07/04/2013 12:00 UTC","Log Number":"CA-07052013-0078","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=51.256845,+-85.321804(48704)&iwloc=A&hl=en\"> mufon case (48704) map </A>","Case Number":"48704","Object Shape":"Circle, Fireball","files":["/var/www/straped/mufon/html2text/48704.html.txt","/var/www/straped/mufon/org/48704.html"],"divs":["Sighting DetailsI was outside getting my dog inside when I saw a light and thought it was a helicopter over the 401. The local police only have one helicopter, so after the third sighting I thought the objects were flares, but flares don't move in a horizontal direction. I witnessed about the 30 objects heading in north west direction as if they were following the highway. The seemed to follow the same path and have the same altitude. After several minutes I went to the front of my house to see the path these things were taking and asked my neighbours to come outside to make sure I wasn't seeing things. Both my neighbours witnessed the same reddish orange objects flying in a straight line every 10-12 seconds. They saw about 6 in total. The objects appeared to be ascending in a slight incline as they headed towards the west - but this could be my angle of observation - before I lost sight of them. I could tell by looking though a hole in a tree across the street foliage these objects weren't too high but I couldn't tell the exact angle. I heard no sound from the objects only the background noise of the city. The speed moving across the sky was approximately the same as a civilian aircraft. When I was researching my experience on the internet some comments and website suggested Chinese Lanterns but these objects were moving too fast in what appeared to be a purposeful direction on what appeared to be a almost windless night. Both of took some pictures but the objects appear to be mostly red and more dull on mobile. Let me know if you want them. However, my personal email is down right now; should be up tomorrow."],"Region":"Ontario","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Source":"MUFON","Viewing Distance":"Unknown","Longitude":"-85.321804","City":"Undisclosed","Latitude":"51.256845","Date Submitted":"07/05/2013 10:58 UTC","Object Features":"Unknown","trends":[],"Country":"Canada"}