{"trends":["There have been 7 other sightings in Charter Township of Clinton","There were no other sightings in Charter Township of Clinton on or around July 5th 2013","This sighting has never been favorited.",""],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.571227,+-82.926659(48707)&iwloc=A&hl=en\"> mufon case (48707) map </A>","Region":"Michigan","files":["/var/www/straped/mufon/html2text/48707.html.txt","/var/www/straped/mufon/org/48707.html"],"Object Shape":"Triangle","Weather Factors":"Unknown","Country":"United States","Date Submitted":"07/05/2013 11:12 UTC","Longitude":"-82.926659","Log Number":"US-07052013-0081","City":"Charter Township of Clinton","Summary":"there was 1 bright red ball and then a 2nd 1 appeared roughly a mile away from the 1st one both were heading in the same direction changing course several times","Sighting Duration":"Undisclosed","Tags":"City","Date of the Event":"07/05/2013 10:05 UTC","Disposition":"Unresolved","Viewing Distance":"Over One Mile","divs":["Sighting DetailsIt was roughly 10:05 pm I was taking my trash out and fireworks were going off in the neighborhood I looked up to see them and that is when I noticed a bright red circular ball in the sky, it was very low in the skyline, at 1st I thought it was a helicopter except there was no noise and it changed direction in a way that I knew it was no ordinary aircraft, it went right then left I took a picture of it on my camera phone, and then a 2nd one joined it, it looked roughly a mile apart from the 1st one and then they ZIPPED away at an amazing speed heading NW, the whole event lasted roughly 2 minutes. I didn't have alot of time to react but I did manage to get 1 picture, this was so exciting this has been my 3rd sighting of a UFO since I was a kid. The red ball had long extensions appearing to be wings of some sort extending from both sides of it, this was flying very low as my picture has my neighbors house in the background and that is how I was able to see the extensions which I call wings but they were too big to be wings of a normal craft at that height. I then called my brother in law cause I was so excited, he only lives a mile away, cause I wanted him to go outside and see if he could see it but as I said it happened so fast by the time he went outside they were gone"],"Object Features":"Appendage(s)","Object Flight Path":"Path with directional change","Latitude":"42.571227","Case Number":"48707"}