{"files":["/var/www/straped/mufon/html2text/48709.html.txt","/var/www/straped/mufon/org/48709.html"],"Summary":"At first believed was a bright star or planet. Pulsating and flashing light.","Object Features":"None","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Shape":"Other","Viewing Distance":"Over One Mile","Date of the Event":"07/04/2013 09:00 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.760871,+-73.789968(48709)&iwloc=A&hl=en\"> mufon case (48709) map </A>","Object Flight Path":"Hovering then path","Disposition":"Unresolved","Region":"New York","City":"Flushing","Case Number":"48709","trends":["There have been 4 other sightings in Flushing","There were no other sightings in Flushing on or around July 4th 2013"],"Tags":"City","Country":"United States","Log Number":"US-07052013-0083","Latitude":"40.760871","divs":["Sighting DetailsOn the night of 4th of July I was out in front of my house and on the sidewalk with my son and neighbor lighting up sparklers when I noticed what I believed to be a really bright star or a planet, but then realized that in mere minutes it had a trajectory and was moving away from us. I first witnessed it facing west and it continued heading in that direction until we lost sight of the bright object. Immediately at first seeing it, I called my wife to come out with my cheap Sony digital camera and I began snapping away. It was sort of light out when I began but it soon darkened outside. I should point out that with the naked eye, the bright object appeared to be emitting its own light source and it kept flickering and flashing. Again, thinking \"okay maybe just a star or planet\". There was no sound that I heard. It didn't fly away like plane nor did it move like a helicopter. It was just... well, just stationary. ... but looking closely at the photos, I was shocked. This thing appears to have a classic serpent shape of some kind with sentience to it. It is very much alive and flying through the sky and unlike anything I have ever witnessed. It is not a firecracker or the result of fireworks being fired in the sky either... My buddy who was with me has never believed in this sort of stuff. After last night, and seeing the photos he now no longer questions whether we are not alone. *update, I witnessed the same bright object appear near same sky area and moving towards west. This time I photographed it from my kitchen window."],"Longitude":"-73.789968","Date Submitted":"07/05/2013 11:26 UTC"}