{"map":"<A HREF = \"http://maps.google.com/maps?q=27.915349,+-81.985416(48702)&iwloc=A&hl=en\"> mufon case (48702) map </A>","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Summary":"Sighting that appeared to be an airplane at first but moved too quickly and darted back and forth to be an airplane.","divs":["Sighting DetailsI had stepped out onto my patio at night, around 10 pm, and noticed a light in the sky. At first it looked like an airplane because it was blue with a red blinking light to the left side of the craft. However, it was moving very quickly straight upwards, a lot faster than any aircraft I had ever seen, so I watched it because it was quite unusual. Then it stopped completely and suddenly. It then moved towards the left very quickly, then stopped.. I was then calling for my boyfriend to come and look at this since he is an aircraft inspector and what I was seeing was quite bizarre. He came out as soon as he could. When he got there, the craft had moved back into it's original position, but then the blue light changed to green but the red light was still blinking and then it slowly started to descend in the sky and disappeared behind the tree tops. Some other people were lighting fireworks off in the neighborhood, but not in that area that the craft was in and I've never seen a firework or anything of that nature perform these maneuvers or blink in the way it was blinking because it looked just line any other airplane. But I've never seen an aircraft or helicopter move as quickly as this did and perform these impossible feats either. My boyfriend saw it for the last 10 seconds and when I told him what it had done he told me that it would be impossible for any aircraft to do that and I agreed."],"Tags":"City","Longitude":"-81.985416","Region":"Florida","Latitude":"27.915349","Object Shape":"Unknown","Case Number":"48702","Weather Factors":"Unknown","Date Submitted":"07/05/2013 10:30 UTC","Object Features":"Unknown","trends":["There has been one other sighting in Mulberry","There were no other sightings in Mulberry on or around July 5th 2013"],"Log Number":"US-07052013-0076","Sighting Duration":"00:01:00","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/48702.html.txt","/var/www/straped/mufon/org/48702.html"],"Date of the Event":"07/05/2013 10:00 UTC","Disposition":"Unresolved","Country":"United States","City":"Mulberry"}