{"Object Features":"Unknown","Summary":"Seen cigar shaped object in sky. Sun reflected off of it, was gleaming silver, shone for about 30 seconds, did not move, and simply disappeared. Dissappeared as if the sun stopped hitting the object and making it appear. Cloaking technlogy exposed?","Disposition":"Unresolved","Case Number":"48716","Tags":"City","Weather Factors":"Unknown","Date Submitted":"07/06/2013 12:55 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Country":"United States","Object Shape":"Cigar","Object Flight Path":"Stationary","divs":["sighting detailswas driving home from wal-mart at approx. 2:30 pm seen an cigar shaped object just appear out of no where about 45 degrees from horizon and over a mile high in sky. the object was gleaming a silver color and appeared to have the sun beaming off of it making it visible. the sun was not beaming off of me or the car. the sky was cloudless in this area. it was visible for 30 seconds then became instantly invincible. it was not a reflective object on my window as i stuck my head out window and seen it in sky. i feel as it perhaps had cloaking technology and the sun shining on it is what made it visible and once the sun didn't hit it no more is when it became invisible to my naked eye. i say this because it seemed that it was there but not there. a hologram almost but like i said high in the sky and not from anything in my car as i seen it when i stuck my head out window. the precise location is 30 seconds before the intersection from osawa blvd and shoal line blvd aripeka\\spring hill florida."],"Date of the Event":"05/13/2013 02:15 UTC","trends":["There have been no other sightings in aripeka","This sighting has never been favorited."],"Latitude":"28.462739","Longitude":"-82.650291","files":["/var/www/straped/mufon/html2text/48716.html.txt","/var/www/straped/mufon/org/48716.html"],"Source":"MUFON","Region":"Florida","Log Number":"US-07062013-0003","City":"aripeka","map":"<A HREF = \"http://maps.google.com/maps?q=28.462739,+-82.650291(48716)&iwloc=A&hl=en\"> mufon case (48716) map </A>"}