{"Summary":"two orange lights drifted across the sky over neighborhood","Date of the Event":"07/05/2013 10:05 UTC","Source":"MUFON","Date Submitted":"07/05/2013 11:29 UTC","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Flight Path":"Path with directional change,Path then hovering","Log Number":"US-07052013-0084","Tags":"City","Case Number":"48710","Disposition":"Unresolved","City":"Seymour","map":"<A HREF = \"http://maps.google.com/maps?q=35.885541,+-83.768885(48710)&iwloc=A&hl=en\"> mufon case (48710) map </A>","Latitude":"35.885541","files":["/var/www/straped/mufon/html2text/48710.html.txt","/var/www/straped/mufon/org/48710.html"],"Country":"United States","Region":"Tennessee","Viewing Distance":"Unknown","Object Features":"None","Longitude":"-83.768885","trends":["There has been one other sighting in Seymour","There were no other sightings in Seymour on or around July 5th 2013"],"divs":["Sighting DetailsI was leaving my parents house with two of my children when I noticed a odd colored light in the sky traveling east. I stopped and lety oldest son out to get his friend who was spending the night and pulled forward 50ft to the end of the road to watch the object but didn't see it. I got the two boys into the car and drove around looped around the neighborhood which took approximately 35 seconds at which time we again saw the object but this time flying south directly over my sons friends house at which point i took out my cell phone and started recording the object we were joined by 5 other observers who all saw the object who all noted the lack of sound and the pulsating of the light and watched it until it disappeared at which time i stopped the recording. as we were all standing in the road talking about it my sons friend pointed north and said there's another one which was travelling at a high rate of speed. Once it got over the neighborhood it substantially reduced its speed and travelled almost directly overhead headed south I quickly turned on my camera on my phone again. We again heard no noise and noticed that it pulsated like the other object we watched it as I flew over the neighborhood at which point some artillery fireworks went off about a quarter mile from us in the path of the object at which point it came to a complete stop for 5-7 seconds and proceeded in the same direction for another 10 seconds before also disappearing. I do have both video files but am unsure if the will be of any value but will include them"],"Object Shape":"Other"}