{"Sighting Duration":"00:10:00","Tags":"City","files":["/var/www/straped/mufon/html2text/48717.html.txt","/var/www/straped/mufon/org/48717.html"],"trends":["There have been 3 other sightings in Warsaw","There was one other sighting in Warsaw on or around July 5th 2013"],"Viewing Distance":"501 Feet - 1 Mile","Region":"Indiana","Object Features":"Other","Log Number":"US-07062013-0004","Longitude":"-85.855851","Object Flight Path":"Path with directional change","Latitude":"41.255077","Source":"MUFON","Summary":"circle of lights standing on end","Case Number":"48717","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.255077,+-85.855851(48717)&iwloc=A&hl=en\"> mufon case (48717) map </A>","Country":"United States","Disposition":"Unresolved","Date of the Event":"07/05/2013 12:00 UTC","Date Submitted":"07/06/2013 12:59 UTC","divs":["Sighting DetailsI was watching the tv and saw a very bright red light out the window. At first I thought it might be some sort of firework but it didnt explode and it was traveling horizontaly. I saw two objects approximately 1 minute interval between them. When the third object appeared I grabbed my binoculars and went outside for a better look. The object was bright and moving slowly. There was no sound at all. It was low enough that I'm sure I could hear a sound if it made one. It was lower than any airplanes I see around here. The object was made up of 7 lights in the form of a circle standing on end. I could see that the lights were separate but fairly close together. It went behind some trees but I could see it through them. It made a very abrupt turn to the east and seemed to lose altitude and I lost it in the trees as it got lower. I was very excited to see the object. I have never seen anything like it. I forgot to mention that the object was moving from south to north before it made a turn to the east. Also, I could not see a solid object that the lights could have been attached to."],"Object Shape":"Other","City":"Warsaw"}