{"Longitude":"-73.764201","Object Shape":"Sphere","Object Features":"None","Viewing Distance":"Over One Mile","Date Submitted":"07/06/2013 03:12 UTC","Case Number":"48728","Date of the Event":"11/10/1974 08:30 UTC","Log Number":"US-07062013-0016","files":["/var/www/straped/mufon/html2text/48728.html.txt","/var/www/straped/mufon/org/48728.html"],"divs":["Sighting DetailsDuring attendance at SUNY at Albany between 1973-1974 I was visiting a friend. while in his back yard I looked up and saw a bright white spherical object traveling straight across the horizon. The object moved up to a commercial plane from behind and made a dead stop in front of the plane as to let the pilots see it. Immediately after it stopped in front of the plane it then made a right turn (90 degrees) and shot straight up so fast that the object blinked off. I recounted to my friend what happened as he was putting clothes in his laundry room. He his girlfriend and mine all looked at me and said nothing. I was not under any influence of ANY type of drug or alcohol. Around 11:00pm that same night we all we watching television when the news report came on as a news flash that the pilots of that plane reported the UFO sighting. This news report not only shocked my friends but allowed me to live all these years with the peace that I was not imagining what I saw. I tried to search the MUFON database but could not find any recorded report although the Albany NY new station must still have the archive of the story. Is there any way I can find out more about that incident? Unfortunately I only recall that it may have occurred between October 1973-November 1973. I would appreciate any feedback no matter how limited. Thanking you in advance for your time and consideration. JP Nieves"],"City":"Albany","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.662459,+-73.764201(48728)&iwloc=A&hl=en\"> mufon case (48728) map </A>","Sighting Duration":"Undisclosed","Region":"New York","Object Flight Path":"Path with directional change","Disposition":"Unresolved","Country":"United States","Source":"MUFON","Weather Factors":"Unknown","Latitude":"42.662459","Summary":"Ultra high speed stopped in front of airplane","trends":["There have been 19 other sightings in Albany","There were no other sightings in Albany on or around November 10th 1974"]}