{"Date of the Event":"07/04/2013 10:20 UTC","Summary":"Bright orange light In sky, stationary at first, than moved in straight line before quickly moving up and over than blinking out.","Source":"MUFON","files":["/var/www/straped/mufon/html2text/48720.html.txt","/var/www/straped/mufon/org/48720.html"],"Sighting Duration":"00:01:30","divs":["Sighting DetailsMy wife and son and I were on our way home from watching the fireworks in downtown Fort Myers on the 4th of July. We were on SE 1st Ter in Cape Coral traveling west, when at 10:20pm my wife noticed a bright stationary orange light in the northern sky. I stopped the car and could see the light through the passenger side window. My wife opened the \"Star walk\" app from her Iphone and pointed it in the direction of the light. The Star Walk app reported a satellite in the approximate direction. Since we were only a few houses down from our home I quickly drove to our driveway and got out of the car. The light was now moving west in a straight line about as quickly as a jet. It appeared to have made a considerable jump from its original position in the sky, but since we were now a few houses down from the original sighting, It is hard to say how much distance it actually traveled. The light traveled west for a couple of seconds than quickly jerked up and over (what appeared to be up and left) before blinking out. It should be noted that there were fireworks going off in various parts of the sky as it was prime time for such a display. I'm sure that there is an explanation for the light, but at this time I cannot explain it."],"Object Features":"Unknown","Case Number":"48720","Date Submitted":"07/06/2013 09:44 UTC","Weather Factors":"Unknown","trends":["There have been 16 other sightings in Cape Coral","There were no other sightings in Cape Coral on or around July 4th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=26.649072,+-81.946812(48720)&iwloc=A&hl=en\"> mufon case (48720) map </A>","Object Flight Path":"Stationary,Straight-line path,Path with directional change","Latitude":"26.649072","Tags":"City","Log Number":"US-07062013-0008","Region":"Florida","Country":"United States","Object Shape":"Sphere","City":"Cape Coral","Viewing Distance":"Unknown","Longitude":"-81.946812","Disposition":"Unresolved"}