{"Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Log Number":"US-07062013-0010","map":"<A HREF = \"http://maps.google.com/maps?q=42.734173,+-84.627981(48722)&iwloc=A&hl=en\"> mufon case (48722) map </A>","Tags":"City","trends":["There have been 54 other sightings in Lansing","There was one other sighting in Lansing on or around July 4th 2013"],"Object Shape":"Sphere","Disposition":"Unresolved","Object Features":"Unknown","City":"Lansing","Date Submitted":"07/06/2013 11:01 UTC","files":["/var/www/straped/mufon/html2text/48722.html.txt","/var/www/straped/mufon/org/48722.html"],"Object Flight Path":"Path with directional change","Summary":"multiple objects in the sky,..several of us seen this event for more than 15 minutes","Case Number":"48722","Latitude":"42.734173","Weather Factors":"Unknown","divs":["Sighting Detailsme and my mother were watching fireworks display so our eyes where already on the sky...i was on ground level..my mother was on 3rd floor balcony overhead from me..i noticed a red ball in the sky off to my right...which was northeast direction,i yelled up to my mother on the balcony\"do you see that?\".she replied \"i see it\" i knew right away what this was because this was the 3rd year in a row i have witnessed this happen..after watching 1 red light for a few minutes hovering in one spot..a second and third red light caught my attention.(looking to the northwestish)..they were moving in a striaght line just above the treetops...once they got directly north from our position they simple dissappeared..a few seconds later they appeared again to the northwest..but this time there were 5 objects..they repeated the same movement process several times while everytime this action was repeated the formation gained an object..when the fireworks stopped the lights faded completly not to be seen again...i have seen this same exact event happen 3 years in a row...i will have video set up next year."],"Date of the Event":"07/04/2013 10:30 UTC","Source":"MUFON","Longitude":"-84.627981","Country":"United States","Region":"Michigan"}