{"Source":"MUFON","Sighting Duration":"Undisclosed","trends":["There have been 95 other sightings in Atlanta","There were no other sightings in Atlanta on or around June 21st 2013"],"Summary":"observed very large craft , drop already 200 ft, stop, and powdered to either take off very fast or dissappear","Weather Factors":"Unknown","Case Number":"48723","Longitude":"-84.378672","Disposition":"Unresolved","Date Submitted":"07/06/2013 11:10 UTC","Log Number":"US-07062013-0011","City":"Atlanta","Latitude":"33.758395","Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=33.758395,+-84.378672(48723)&iwloc=A&hl=en\"> mufon case (48723) map </A>","Object Shape":"Diamond","Country":"United States","Object Features":"Other, Unknown","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/48723.html.txt","/var/www/straped/mufon/org/48723.html"],"divs":["Sighting Details1) on Glenwood ave and second, on the way to I-20, going to work with my fiancee. 2) straight ahead of us, i noticed a very shiny object in the sky, in the distance. 3) at first i thought it had to be either a 747 or a large military transport plane, reflecting a large amount of sunlight. It looked like very shiny metal reflecting light. 4) the object at first was moving to the south at a normal speed. It suddenly drops perfectly vertically, not in a plane dive fashion, at least 500 ft. It then shifted to the left about 500 ft. The craft then started to get smaller, as if it were flying directly away from us. Then some word kind of distortion, or haze, in a circle shape, materialized around the craft and it was just gone. 5) disbelief and excitement, I'm a believer but had never actually seen anything i could not explain. Scrambling, trying to get my phone to take a video, i couldn't get it out so i kept my eyes on the craft. 6) the craft vanished, it didn't fly out of view, it flew into or through something and was gone. The craft had to be massive. Larger than any plane."],"Region":"Georgia","Date of the Event":"06/21/2013 12:00 UTC","Tags":"City"}