{"Object Shape":"Fireball","trends":["There have been 173 other sightings in Houston","There was one other sighting in Houston on or around July 4th 2013"],"Sighting Duration":"Undisclosed","Date of the Event":"07/04/2013 08:45 UTC","Log Number":"US-07062013-0015","files":["/var/www/straped/mufon/html2text/48727.html.txt","/var/www/straped/mufon/org/48727.html"],"Longitude":"-95.36239","Summary":"Objects moved high & steady across the sky w/flame like shimmer. As they passed overhead the lights disappeared but objects were still visible for awhile.","Disposition":"Unresolved","Weather Factors":"Unknown","divs":["Sighting DetailsWe were at my daughters home to celebrate the 4th. It began to rain and we thought we were not going to be able to view the fireworks displays from the neighborhood. As we were watching our favorite movie \"Independance Day\" (a tradition now since the movie first shown) the rain stopped. Before the movie ended we heard neighbors starting to pop their fireworks so we went outside to view the light shows. As we were looking up into the sky we noticed high above all the activity 3 objects moving in formation (one-behind-one) coming from a southerly direction and moving northerly. They appeared to be moving faster than an airplane moves, and there was no sound coming from them. They were glowing as if there was a flame but the glow was steady, not out of control. As they moved from beneath our direct line-of-sight the glow disappeared but the object which appeared to be black from our line-of-site was still visible. After a while, some other objects (4) coming from the southern area appeared and moving toward a northeasterly direction (same shapes and glows). My daughter attempted to catch the flights on her smartphone but at the distance of the objects the video did not come out real clear. She still has the video on her cell. Others that saw these objects were my husband and my daughter's husband. Shortly after the objects flew over a plane appeared in the distance but not as high as the objects in question and we heard the sound of the plane. The plane was coming from the southeast heading north and it had just missed where our line-of-sight pattern criss-crossed with the objects. Then from the south a helicopter came flying overhead and again we heard it and it appeared lower than where we saw the objects flying. We lost sight of the objects as they disappeared from our sight in the distance."],"Region":"Texas","Country":"United States","Object Flight Path":"Straight-line path","Date Submitted":"07/06/2013 01:58 UTC","Object Features":"Unknown","Tags":"City","Source":"MUFON","Viewing Distance":"Unknown","Case Number":"48727","map":"<A HREF = \"http://maps.google.com/maps?q=29.762833,+-95.36239(48727)&iwloc=A&hl=en\"> mufon case (48727) map </A>","City":"Houston","Latitude":"29.762833"}