{"Longitude":"-98.307826","Log Number":"US-07062013-0023","Date Submitted":"07/06/2013 05:20 UTC","Disposition":"Unresolved","Date of the Event":"05/03/2013 10:00 UTC","Viewing Distance":"Over 1 Mile, Unknown","Case Number":"48735","Sighting Duration":"Undisclosed","Country":"United States","City":"Walters","Summary":"2 glowing fireballs in the northern sky","Source":"MUFON","Region":"Oklahoma","Object Features":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/48735.html.txt","/var/www/straped/mufon/org/48735.html"],"Weather Factors":"Unknown","trends":["There have been no other sightings in Walters","This sighting has never been favorited."],"Object Shape":"Fireball","Latitude":"34.359808","divs":["Sighting DetailsI went out on the deck late at night to smoke and saw a fireball in the sky to the north. It wasn't moving just appeared to hover in the sky. I watched it wondering what it could be. It was there a couple of minutes then just disappeared. I went inside where my granddaughter was watching tv and told her i had just seen something odd. My first ufo. I was curious and went back out and sure enough it appeared again in the same place but now there were two of them. I told my granddaughter to come and look. Reluctantly she did and was amazed at what we were looking at. I told her to go get her Dad. Both of the fireballs disappeared again but reappeared after a bit. My son saw them as they were reappearing. One of them at one point descended slowly downward and then disappeared behind the tree line. It was visible behind the trees until it went out again. We got the binoculars out but it didn't really help. We watched them come and go four or five times for about an hour. We finally decided they weren't going to do anything except hover and disappear so we went inside. I did look out my bedroom window a couple more times that night but never saw them again."],"Object Flight Path":"N/A","map":"<A HREF = \"http://maps.google.com/maps?q=34.359808,+-98.307826(48735)&iwloc=A&hl=en\"> mufon case (48735) map </A>"}