{"Object Features":"None","Weather Factors":"Unknown","Date Submitted":"07/06/2013 08:36 UTC","trends":["There have been 2 other sightings in Eufaula","There were no other sightings in Eufaula on or around January 12th 1980"],"map":"<A HREF = \"http://maps.google.com/maps?q=31.891272,+-85.145488(48747)&iwloc=A&hl=en\"> mufon case (48747) map </A>","Source":"MUFON","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/48747.html.txt","/var/www/straped/mufon/org/48747.html"],"Disposition":"Unresolved","Date of the Event":"01/12/1980 12:00 UTC","Log Number":"US-07062013-0034","Sighting Duration":"Undisclosed","Case Number":"48747","divs":["Sighting DetailsIn the late 70s early 80s riding in a van about daybreak, myself and 4 of my band mates were on the way back to Atl. Ga. from a show we had done. I was in the back of the van when I heard one of the guys say , look at that star or light, I cant remember which, is following us. I went to the front of the van and looked out and saw a bright lite that appeared to be following us. I explained to them that it just appeared that way because we were doing about 60 miles an hour. We continued to watch for several minutes and by this time it was completely daylight. No stars in the sky except this bright light. That's when I started watching real close. It appeared to be stationary but still looked like it was following us if that makes sense. This had gone on for about 30 minutes. Without warning the light as I will call it, dropped down about tree level and accelerated very fast ahead of us. At this point I knew it wasn't just a star in the sky. It appeared to move very fast effortlessly and at some times dropped below tree level. We could only see it through the trees. All this time that went by, about 50 minutes, we never saw another vehicle or person other than ourselves. Just as fast as it appeared, it disappeared. Just seconds after it disappeared, we started seeing cars and other vehicles. We were all pretty freaked out, so we pulled over and talked about what we had seen. I only told a few people in my life about this for fear of them thinking I was crazy. I was so thankful I had several other people with me or I wouldn't have believed it myself. Over the years I lost contact with most of those guys, except one. We have remained good friends over all these years, and still to this day we talk about that mourning on the back roads of southern Alabama. He says he doesn't discuss it with anyone but me because he knows I saw the same thing he saw. One thing I forgot to mention, Its been 30 years. About 15 or 20 minutes after we first noticed this object, we pulled over on the side of the road, got out of the van and just looked at the object. It looked like a bright star, but only a few hundred yards in the sky. At that time, it never moved. Just sat there. What was strange to us at the time was, no clouds, no stars in the sky, and it was completely daylight by this time. Not until we saw it accelerate past us through the trees that we knew something wasn't normal. I never have been able to explain to myself what I saw."],"Longitude":"-85.145488","Latitude":"31.891272","Summary":"Myself and 4 other people observed a UFO","Object Shape":"Star-like","Object Flight Path":"Hovering then path","City":"Eufaula","Country":"United States","Region":"Alabama","Tags":"City"}