{"Viewing Distance":"501 Feet - 1 Mile","divs":["sighting detailswalking west and saw what looked like contrails but very short and realized it was a hollow cylinder that was illuminated on the 12 and 6 o'clock edges reflecting the setting sun. the object took up 1.5\" of the sky. it was at approx. 7,000' moving right to left or nne to sw or ssw however, every 15 seconds it changed direction 90 degrees to the right (west) then back to the left (south) again and repeated these zig zag steps until it went out of sight. an approx. guess is 300' or larger operating a slow to moderate speed (less than airliners but faster than cessna type craft. oddly, the 90 degree changes of direction were not apparent until after it was moving in that new direction. no shapes, wings, tail or gradual arc. no abrupt changes either, it is best described as a glide to the right then left at a consistent pace. a ring lof light encompassing the cylinder travelled from left to right and faded at the right end. it appeared to offer a form of propulsion as the lights moved directly proportional to the right as the object moved left. the hollow light is best described as a partially lit florescent tube without the glass. the band of light (moving left to right) was not visible on the lee side of the hollow light. only on the side facing me was the light band visible. silent and easily seen. there must be more people who saw this. feelings and reactions: mixed, confused, analytical, recording and certain. how did i lose sight: it travelled over the gulf of mexico and eventually moved away from us. addendum: i yelled and yelled for my neighbor to come out of the house and she came at the end of the sighting and her position is unfortunately inconclusive. she only saw one distant turn and then it faded out. this is very real and not a mistaken id, i am a professional ocean and celestial observer with 60 years of experience and i am positive of what i saw. this thing (?) was\\is not man made."],"Latitude":"26.660755","Country":"United States","Summary":"hollow cylinder energized with moving band from left to right","Case Number":"48746","City":"Cape Coral","map":"<A HREF = \"http://maps.google.com/maps?q=26.660755,+-81.963545(48746)&iwloc=A&hl=en\"> mufon case (48746) map </A>","trends":["There have been 16 other sightings in Cape Coral","There were no other sightings in Cape Coral on or around June 17th 2013"],"Object Flight Path":"Path with directional change,Other","Tags":"City","Longitude":"-81.963545","Date Submitted":"07/06/2013 07:42 UTC","Date of the Event":"06/17/2013 07:45 UTC","Object Features":"Unknown","Sighting Duration":"Undisclosed","Object Shape":"Cigar, Cylinder","Source":"MUFON","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/48746.html.txt","/var/www/straped/mufon/org/48746.html"],"Region":"Florida","Log Number":"US-07062013-0033","Weather Factors":"Unknown"}