{"trends":["There has been one other sighting in Soddy-Daisy","There were no other sightings in Soddy-Daisy on or around March 7th 1994"],"files":["/var/www/straped/mufon/html2text/48743.html.txt","/var/www/straped/mufon/org/48743.html"],"Region":"Tennessee","Source":"MUFON","Country":"United States","Viewing Distance":"101-500 Feet","Tags":"City","Disposition":"Unresolved","Case Number":"48743","Longitude":"-85.19079","Object Shape":"Triangle","Summary":"Saw Triangle like Object hovering over treetops to my left (SE), i was driving on Hwy 27 going South towards Chattanooga to go to work.","Date of the Event":"03/07/1994 07:30 UTC","Date Submitted":"07/06/2013 06:24 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.235902,+-85.19079(48743)&iwloc=A&hl=en\"> mufon case (48743) map </A>","Latitude":"35.235902","Object Features":"None","City":"Soddy-Daisy","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Log Number":"US-07062013-0031","divs":["sighting detailsi don't really remember the exact month, sometime in the winter\\spring of 1994. i was driving from dayton, tn to work in chattanooga, tn.. i usually left at around 7am every morning to get to work by 8 am. i was driving on hwy 27, the main road to chattanooga from dayton and at about 7:30am (sun was starting to rise- dawn), i noticed a light hovering over the tree line just south east of my position, about a few miles north of soddy daisy. there were some cars on the road but not a lot. at first i thought it might be a helicopter. but as i got closer the lights seemed a bit... off. i was traveling about 55 miles an hour and the object still was not moving.. as a matter of fact, it was so still, it was almost like it was sitting on a table or something. didn't adjust to wind or anything. so i kept my eyes on it and as i got closer i notice that the lights seemed to be triangular in shape.. probably about 6 or so on the underbelly and the object itself was shaped like a triangle.. the color of object looked dark, maybe black, probably due to sun not being up yet.. i didn't seen any blades like a helicopter would have, nor any kind of engine or exhaust. it just sat there. when i passed it up, i looked back in my rear view mirror and it was still there. didn't move at all. and it stayed there until i passed the point where i couldn't see it or the trees anymore. i mentioned it to my family and we really tried to explain it away.. again, helicopter was the only thing it could be, but it wasn't. i am 85% sure. i am a very analytical person. i tried to take in as much detail as i could and really couldn't explain what it was. if it were today, i might say it kind of looked like a stealth f-117 fighter but without fins or any protruding parts, and those don't hover. i remember it like it was yesterday. it was strange and interesting at same time. if it was a ufo, then i feel honored to have seen one."],"Weather Factors":"Unknown"}