{"Object Flight Path":"Stationary,Straight-line path,Path with directional change","Case Number":"48750","Source":"MUFON","Latitude":"38.107186","Date Submitted":"07/06/2013 09:51 UTC","Object Shape":"Star-like","Sighting Duration":"06:00:00","Summary":"2 Stars repositioning themselves. 4 identical shooting stars","files":["/var/www/straped/mufon/html2text/48750.html.txt","/var/www/straped/mufon/org/48750.html"],"Longitude":"-122.248007","Disposition":"Unresolved","Country":"United States","Weather Factors":"Unknown","Tags":"City","Viewing Distance":"Unknown","Object Features":"Unknown","City":"Vallejo","Date of the Event":"07/05/2013 11:30 UTC","divs":["Sighting DetailsI was walking my dog around 11:30pm on Friday night, in the suburb of Glen Cove, in Vallejo, CA. There was a slight haze, so not many stars were visible at the time. I had been looking at two particularly bright lights, wondering which stars they were. They were north about 25 degrees off the horizon. I started looking forward, but they were still in my peripheral vision. As a light post passed between the lights and myself, one seemed to move behind the pole quicker than the other. I figured it was because I was walking, so I stopped to observe. This is when one of the lights started accelerating. I was confused at first because I didn't understand how I could have mistaken a satellite for a star. The initial speed was that of a satellite, but it only went a short distance before it doubled and then tripled, at least, the normal speed of a satellite. After it had traveled about 20 degrees along the horizon, it came to a complete and immediate stop. It then began to move higher in the sky and then stopped again. All this happened in less than 3 seconds. I started to wonder if the star that I thought stopped, was there all along and the original object just happened to disappear from sight around it. However, the second bright light I was originally observing, began moving in the same direction. It came to a stop just passed the first star and under it. Just then a third light came into view forming a triangle with the other two. Within a couple of minutes, two shooting stars sequentially took the same trajectory, and started at the same position the lights traveled. I assumed they were shooting stars because they appeared out of nowhere. I kept walking my dog looking up the whole time. About 15 minutes later, a third shooting star, same trajectory, same path. After I got home, I went out back to stargaze and about 30 minutes after the third shooting star, a fourth one did the same thing. The 3 lights remained in the same position until about 4, which is when I was finally able to fall asleep. For all I know, they are still there..."],"Log Number":"US-07062013-0037","Region":"California","trends":["There have been 12 other sightings in Vallejo","There were no other sightings in Vallejo on or around July 5th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.107186,+-122.248007(48750)&iwloc=A&hl=en\"> mufon case (48750) map </A>"}