{"Log Number":"US-07062013-0043","City":"Colfax","Country":"United States","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/48756.html.txt","/var/www/straped/mufon/org/48756.html"],"Object Shape":"Circle, Disc, Sphere","Summary":"2 huge blue flashes then a large solid orb above us, stationary then shot off","Sighting Duration":"Undisclosed","trends":["There have been 3 other sightings in Colfax","There were no other sightings in Colfax on or around July 15th 1997"],"Object Flight Path":"Stationary,Hovering then path,Straight-line path","Date of the Event":"07/15/1997 10:30 UTC","Source":"MUFON","Date Submitted":"07/06/2013 11:32 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.10938,+-120.944736(48756)&iwloc=A&hl=en\"> mufon case (48756) map </A>","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsFriend and myself sitting in a field one night next to his house. All of a sudden there were two quick bright blue flashes that illuminated everything within view like daylight but a solid blue color. I was able to see a hill about a mile away like daylight when this happened. My friend was looking down and clearly remembers seeing the angle of the shadows being cast from the blades of grass by the blue flashes. Because of this he knew the object wasn't directly above us but slightly off to the side some. We both instantly looked up out of instinct and above us was a large solid white orb completely stationary. It seemed close but due to being in the sky at night it was hard to judge actual distance. I always thought it was just under 100 feet off the ground but my friend thought more like 300 feet. I would give a visual estimate of size as around 9 full moons in the sky if that makes sense. The object was close enough that I could see almost like small red bands of electricity sparking around the skin of the object, almost as if it was shedding some form of excess static electricity. After a few seconds of not moving it shot off in an instant to one side. The speed of the movement left a large white tail behind, the width of the object itself, so it was rather wide in the sky. A second later the tail disappeared after the object, this was an incredible sight. It was like seeing the old enterprise enter warp speed the way the stars would streak past. The orb itself was solid in color like looking at a white light bulb. It never fluctuated or dimmed this was definitely a solid object not ball lightning. I am a very logical person and I have searched and searched for other explanations since but there is nothing capable of the movements we witnessed. To me I have always felt like there were some key aspects to our sighting that may hold important clues. I feel the blue flashes have something to do with how the object got where it was sitting when we saw it. I know meteors and such cause those bright flashes when entering a certain layer of our atmosphere. Blue flashes from meteors are rarer but are caused from certain types of material make up being burned up on entry if I remember correctly. Knowing that, and that what was in the sky above was not anything like a meteor since it was stationary, I believe the blue flashes were simply the effect of it entering our atmosphere. Most likely any object entering our atmosphere at high speeds would cause some type of flash so I feel this fits. Secondly the electrical sparking that snaked around the object at first seems important. There was only a little amount of this and it seemed to quickly dissipate. To me the object got to where it sat from wherever. which was like step one for it. Then as it discharged excess energy it was also prepping for its next move, ie reached earth now prepping to move to next location. Anyways after it shot off we ran across town to another friends house who's dad was a local policeman. We new he was very interested in ufos so we wanted to let him know. He was pretty interested in what we had to say. The next day we ran into him again and he told us that there were many reports that night of people seeing the object around the general area. One couple even reported it following them as they drove down placer hills road that night and that they were very scared trying to get away from it. I have seen my fair share of questionable things in the sky but I'm very skeptical even though I do believe in ufos and aliens. I have a few really special and unique experiences but even those don't hold a candle to the scope and clarity of this event. That's why I decided to share this. Also I think it bears mentioning that the friend I was with seemed to be a magnet for ufo activity growing up. He is the most trustworthy person I know and he is almost always with people when he sees things so I hold his experiences as very credible. And unfortunately for him ufos and aliens terrify him, me I just want answers and as much real knowledge on the subject as I can find. This event for me made there no question about aliens. I know it's all on my word but this event did happen as I told, so if the event is looked at with an open mind I believe there may be some valuable info gained from what we witnessed. Even now 15 or so years later I still think about that event daily, the details have been burned into my mind, and I wouldn't want It any other way, although I really really want to know who occupied the object."],"Object Features":"None","Region":"California","Weather Factors":"Unknown","Case Number":"48756","Latitude":"39.10938","Longitude":"-120.944736"}