{"Log Number":"US-07072013-0002","Object Flight Path":"Stationary","Latitude":"34.763908","Sighting Duration":"Undisclosed","Case Number":"48761","divs":["Sighting DetailsMaybe there is others that may have seen the 2 super large lights in the night sky,that is what I really would like to know. It was years ago, it could have been 2004 but I am thinking that is was on a nice night in 2003. I had gotten off work late at night, as I entered the outskirts of Chino Valley AZ, the sky was black and no moon any where in sight, and you could not even see any stars. As I was driving north along Hwy 89 in the direction of Paulden AZ,I looked to my left,(I think the light must have caught my eye) and above the hills there was 2 huge white lights, about twice the size the moon looks, sharp clear edges around the lights, no glare like from car lights, the space between the two lights would have fit one more the size of light. There were no other cars on the road at the time, for about 10 minutes I would turn my head to see if the lights were still there, I would look at the road then turn to look at the lights, they never changed, just stayed in one place, I was trying to think of what it could be, at first I thought it might have been an airplane, then I thought maybe it was two helicopters but then there was on sound, it did not move, the size stayed the same. After about ten minutes I turned my head and it was gone, nowhere in sight, and it had only been a minute or less from the last time I saw it. It was not long after the lights had gone that a car or 2 went by me.I was in aye, a UFO never really crossed my mind till I got home. I told my husband and about all he said was ya, so I just kind of dropped it from my mind. But to this day I still watch the skies when out at night and even during the day my eyes turn to the sky."],"files":["/var/www/straped/mufon/html2text/48761.html.txt","/var/www/straped/mufon/org/48761.html"],"Summary":"Two sharp white hugh Moon shape lights, at least twice the size of the moon, were very bright but no glare like car lights.","trends":["There have been 5 other sightings in Chino Valley","There were no other sightings in Chino Valley on or around July 20th 2003"],"Weather Factors":"Unknown","Country":"United States","Source":"MUFON","Date of the Event":"07/20/2003 11:30 UTC","Disposition":"Unresolved","Tags":"City","City":"Chino Valley","Object Shape":"Circle","Date Submitted":"07/07/2013 12:11 UTC","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=34.763908,+-112.453469(48761)&iwloc=A&hl=en\"> mufon case (48761) map </A>","Object Features":"Unknown","Region":"Arizona","Longitude":"-112.453469"}