{"files":["/var/www/straped/mufon/html2text/48771.html.txt","/var/www/straped/mufon/org/48771.html"],"Case Number":"48771","Latitude":"51.409728","Date of the Event":"07/07/2013 02:00 UTC","divs":["Sighting DetailsWe were sitting on a bench in batheaston facing south in the car park it was a cloudless night and we were deciding how to get home (we were camping at browns folly nature riserve but decided to leave after hearing gun shots ) I was looking at the stars like I always do. I was looking toward browns folly in direction but higher up, as my eyes were scanning the patch of sky my attenchen was taken by one star that became 3 lights creating a triangle shape ( pointed it out to companion) and moving thurther apart. At first the triangle was symmetrical then it tilted, as it tilted the lower points moved away from the top point and stayed close together then they flew around eachother, then I couldn't see them anymore so I looked for the top point and it was still there and stayed there. My companion says he could still see the other 2 that I thought had disappeared, as I looked where was pointed out to me I couldn't see them properly ( when I focused on them I could see them but at the same time I couldn't ) we sat there for a bit longer and I keeped trying to see the 2 lights but it was still the same so we left and as far as we know that is how it stayed."],"Source":"MUFON","Object Flight Path":"Path with directional change","Object Features":"Unknown","Log Number":"GB-07072013-0011","Tags":"City","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Date Submitted":"07/07/2013 09:11 UTC","Summary":"Looked like 3 stars, created triangle then flew apart making it bigger 2 danced round eachother, changed positioning then still","Disposition":"Unresolved","Longitude":"-2.317202","Country":"United Kingdom","Region":"England","map":"<A HREF = \"http://maps.google.com/maps?q=51.409728,+-2.317202(48771)&iwloc=A&hl=en\"> mufon case (48771) map </A>","Viewing Distance":"Unknown, N/A","City":"Batheaston","Object Shape":"Sphere","trends":["There have been no other sightings in Batheaston","This sighting has never been favorited."]}