{"Summary":"3 blinking cloud-style objects above city","Case Number":"48777","Latitude":"51.166667","Tags":"City","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Longitude":"71.433333","Disposition":"Unresolved","Region":"","Date Submitted":"07/07/2013 11:58 UTC","Country":"Kazakhstan","Object Features":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=51.166667,+71.433333(48777)&iwloc=A&hl=en\"> mufon case (48777) map </A>","Date of the Event":"06/22/2013 12:00 UTC","Object Shape":"Other","Weather Factors":"Unknown","divs":["Sighting DetailsWe were watching tv when we saw though the window some lights blinking. We at first thought it was firecracker in the sky. But there was no noise and it did not stop blinking. We noticed it had a shape of a big dark cloud, that was blinking light as if it was formed by blinking stars. The blinking was random inside the cloud and the cloud was moving steadily. It went all the way from SE to S at the same height and as soon as we bearely saw the first cloud-object, we noticed the second one, coming from the same direction and doing the same thing. We took some pictures in the cell phone and videos with the tablet, but nothing can be seen. The second cloud-object did the same thing as the first, and as in the first, as soon as we could see the second going away, we noticed a third one coming from the same direction. This time we got a green laser and pointed to it, and as soon as the laser bean was on the cloud-object (that had random lights blinking), the random lights stopped blinking, although we could still see a dark cloud-object, there was no more blinking. The best way to describe the object is if you imagine a big dark cloud with blinking random stars on it."],"trends":["There have been no other sightings in Astana","This sighting has never been favorited."],"City":"Astana","files":["/var/www/straped/mufon/html2text/48777.html.txt","/var/www/straped/mufon/org/48777.html"],"Log Number":"KZ-07072013-0016","Viewing Distance":"Unknown"}