{"divs":["sighting detailsmy mother was outside, we were getting ready to go to the store. i was inside and she suddenly rushed in and frantically told me to come outside. i did, and we both witnessed first 1 red\\orange orb slowly ascending from west to north west. it wasn't burning just a solid glowing light. i thought at first it could have been some type of firework. however, the object was moving too slow, it was not burning, there was no smoke or trail of any type, and no sound. then a few minutes later from the same direction another one appeared, same description. i was really starting to wonder what was going on then. i'd never seen anything quite like it. also take into mind that i watch the sky very often and have seen lots of things( some strange) but never like this. then a couple of minutes later i saw another one, same path as the others. shortly after that another appeared. i waited to see if i could see any more of them, but nothing else appeared, except an airplane in a completely different spot when the orbs were not visible anymore. i have seen other strange things in the sky before, but nothing quite like this. i do believe there are some strange things out there unexplained. any information on this would be much appreciated. we do live around a well populated area so i'm sure we weren't the only ones to witness this."],"Country":"United States","Tags":"City","Object Flight Path":"Straight-line path","Date Submitted":"07/07/2013 11:52 UTC","Sighting Duration":"00:17:00","Object Shape":"Fireball","Date of the Event":"07/05/2013 10:00 UTC","Region":"Kentucky","Source":"MUFON","Summary":"They were glowing red/orange orbs slowly ascending, no bilking lights, wasn't on fire no noise","trends":["There have been 9 other sightings in Paducah","There were no other sightings in Paducah on or around July 5th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.072205,+-88.640224(48776)&iwloc=A&hl=en\"> mufon case (48776) map </A>","City":"Paducah","Disposition":"Unresolved","Log Number":"US-07072013-0015","Longitude":"-88.640224","Weather Factors":"Unknown","Case Number":"48776","files":["/var/www/straped/mufon/html2text/48776.html.txt","/var/www/straped/mufon/org/48776.html"],"Viewing Distance":"Unknown","Latitude":"37.072205","Object Features":"Unknown"}