{"Latitude":"39.978382","Region":"New Jersey","Object Features":"None","Log Number":"US-07072013-0016","Disposition":"Unresolved","City":"Moorestown","Date of the Event":"07/06/2013 12:00 UTC","Case Number":"48775","Viewing Distance":"Over One Mile","Object Flight Path":"Path with directional change","Source":"MUFON","trends":["There have been 4 other sightings in Moorestown","There were no other sightings in Moorestown on or around July 6th 2013"],"Date Submitted":"07/07/2013 10:30 UTC","files":["/var/www/straped/mufon/html2text/48775.html.txt","/var/www/straped/mufon/org/48775.html"],"Tags":"City","divs":["Sighting DetailsI was traveling with my fiance down westfield road when we spotted a police officer make a sharp turn and park down a street. Seemed normal till we saw him observing a bunch of glowing red orbs in the sky. At first we thought it could have been a flyover for the last day of fireworks but as time went on this scenario seemed less likely to be. They were all traveling in close proximety to one another. There must have been over 15 of them. The red lights were flashing sequentially bright then dull bright then dull. The objects didnt flutter or change direction suddenly. They didnt dissappear either. They were over 500 above in the sky and moving fast for the distance they appeared away. At the time there were helicopters in the air, not close to them or viewing them, but you can tell the difference. If your from the area you know its wide open fields and theres always at least 3 helicopters in the sky. There were also planes flying above to. Im curious as to what the cop saw or why there were over 5 other cars pulled to the side of the road but i cant seem to find answers or other peoples sightings."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.978382,+-74.947436(48775)&iwloc=A&hl=en\"> mufon case (48775) map </A>","Summary":"over 15 bright orbs spotted traveling together in sky","Weather Factors":"Unknown","Object Shape":"Circle, Cylinder, Sphere","Sighting Duration":"Undisclosed","Country":"United States","Longitude":"-74.947436"}