{"Tags":"City","Date of the Event":"07/06/2013 09:45 UTC","Object Features":"None","files":["/var/www/straped/mufon/html2text/48783.html.txt","/var/www/straped/mufon/org/48783.html"],"Log Number":"US-07072013-0021","Case Number":"48783","Longitude":"-82.991014","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","City":"Columbus","Country":"United States","Date Submitted":"07/07/2013 04:51 UTC","Region":"Ohio","Weather Factors":"Unknown","Source":"MUFON","Object Shape":"Star-like","Disposition":"Unresolved","trends":["There have been 70 other sightings in Columbus","There was one other sighting in Columbus on or around July 6th 2013"],"Summary":"Unknown group of 4-5 lights sighted in sky. Moved, then flew away","divs":["sighting detailsmy family and i were driving north on i-71 near columbus, oh. approx. 9:45 pm 7\\6\\13. as we were 15-20 min. s of columbus, i noticed a bright light up in the sky to the south\\southeast of the interstate. it seemed like an airplane but it caught my eye because it was brighter than i would expect. i pointed it out to my wife and children (age 7 & 4). then the light lowered altitude and broke up into 2-3 lights. then 2-3 other lights appeared. sometimes a light (or lights) would go off, and others would appear. it seemed there were 4-5 total but we usually could only see 3-4 at a time. at this point, my wife got out her iphone and started video which is very inconclusive and hard to see - you can hear us describing what we are watching. the lights then headed east \\ southeast and our view was obstructed by trees and the interstate was going in the opposite direction. we were all 'shell shocked' since we really didn't know what we just saw or what happened. not freaked out or scared or anything, just quiet and all just looked wide-eyed at each other and said 'that was really weird, what the heck was that'. i want to believe these were helicopters heading toward rickenbacker airport. that would be the most feasible answer to what we saw. that said, being a witness to the altitude change, lights changing on and off, formation moving in and out etc., i just don't think it was helicopters. after i got home and did online research, these look almost exactly like the videos i found online from phoenix, chicago, and many other places with lights in the sky ufos. that's all i have."],"Latitude":"39.965826","Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=39.965826,+-82.991014(48783)&iwloc=A&hl=en\"> mufon case (48783) map </A>"}