{"Object Shape":"Star-like","Object Flight Path":"Path with directional change,Other","City":"Clyde","Longitude":"-99.503176","Viewing Distance":"N/A","Disposition":"Unresolved","Date Submitted":"07/08/2013 01:07 UTC","Log Number":"US-07082013-0002","Tags":"City","divs":["sighting detailswas taking the dogs out for their last run and business for the evening. i live in the country and look at the sky alot in the evening, love watching the stars, satellites and misc other objects in the sky. i was leaning over the side of the deck and looking at polaris which is right out my front door and to the side i seen 2 light flashes, i was tired and so i squinted my eyes and asked my self what was that, i reached into the house and grabbed my night vision goggles and looked in the area again, there were 2 stars side by side going east, and to my delight i seen another flash bigger this time and a larger star. i was still looking at the other ones along with the new one and they suddenly changed direction 90 deg one went due north and the other south, the one that was a little larger because i guess was closer to me started going west, then the funniest thing occured it started doing circles\\cartwheels like it was just playing in space lol i thought wow thank you for the giggle, and it straighten out and went west and fast. i see them all the time one had 2 ever made me laugh by what they were doing. thank you for letting me share. i turned this in before on my nook where i have a mufon app but i guess it didn't take."],"Weather Factors":"Unknown","Sighting Duration":"00:01:47","Object Features":"Unknown","trends":["There have been 4 other sightings in Clyde","There were no other sightings in Clyde on or around July 1st 2013"],"Source":"MUFON","Latitude":"32.390667","map":"<A HREF = \"http://maps.google.com/maps?q=32.390667,+-99.503176(48794)&iwloc=A&hl=en\"> mufon case (48794) map </A>","Date of the Event":"07/01/2013 10:17 UTC","Country":"United States","Case Number":"48794","Summary":"Flashes and then start like orbs showed up","files":["/var/www/straped/mufon/html2text/48794.html.txt","/var/www/straped/mufon/org/48794.html"],"Region":"Texas"}