{"Date Submitted":"07/07/2013 10:28 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"20 Feet or Less","Latitude":"43.582287","Source":"MUFON","Object Features":"Other","Region":"Ontario","Date of the Event":"07/03/2013 10:10 UTC","Disposition":"Unresolved","Country":"Canada","files":["/var/www/straped/mufon/html2text/48790.html.txt","/var/www/straped/mufon/org/48790.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.582287,+-79.700558(48790)&iwloc=A&hl=en\"> mufon case (48790) map </A>","Summary":"Bright Floating Sphere of light with a Tail or Trail seen at close range","Object Shape":"Circle, Sphere","trends":["There have been 20 other sightings in Mississauga","There were no other sightings in Mississauga on or around July 3rd 2013"],"Weather Factors":"Unknown","divs":["sighting detailsthis was the very first time i witnessed an unidentified flying object. no idea what it was for certain but i am assuming it was likely a scout vehicle or possibly a controlled object that collects data of sorts, it was not large enough to be a main ufo craft. no idea what was piloting this object. it caught my eye because it was bright. it must have been following the roofline of my house which has a high pitch and straightened out after it passed my eavestrough then continued slowly in what appeared to be a straight line . my husband did not notice the object as it passed right above him because he was bent down picking up tools or still working. i was so focused on trying to figure out what it was and every detail on it, that i did not even tell my husband till i could no longer see the object anymore. it was a jaw dropping experience but i remained totally calm, no fear at all and feel this helped me to remember it vividly. at first, i thought what an odd firecracker flying way to low down, it was literally only as high up as my eavestrough on my 2nd story house, but i quickly realized this object was not fireworks of any type. this bright white-yellowish-orange flying sphere of light with what appeared to be a tail or trail coming out the back of the object (the tail through me off because in all the times i ever heard or read about these things no mention of a tail), the tail or trail coming from behind this object was not as uniform in shape as the sphere but appeared to be part of it (one continuous unit). there also appeared to be a swirling\\marbling effect continuously changing within the object which appeared to be swirling in a light orange, yellow and white, as though it was chemicals or gasses not properly mixing. it was completely silent and unusually slowly moving (coasting\\floating) appearing to remain at the eavestrough height level, but remained below the height of the tallest evergreen tree it floated by (which my husband estimates is about 20ft up while standing on our deck or 25ft from the ground level), it proceeded through our backyard moving in a straight line heading in a se direction, then proceeding between the 2 houses behind our house towards the street directly behind our property . size comparison to a known object for comparison purposes only, this object appeared to be the same size as a large pilates exercise ball, a moving ball of light, the object definitely illuminated the space which surrounded this object. one of my sons friends local to my area, also witnessed either the same or similar object right around the same time. she saw it stop flash and pulse several times then leave her sight. the picture i uploaded is not one i took, it is for comparison purposes only, it is one from the internet that is the only picture i could see that looked just like it as it floated away, although the colours are off."],"Tags":"City","Log Number":"CA-07072013-0027","City":"Mississauga","Case Number":"48790","Object Flight Path":"Straight-line path","Longitude":"-79.700558"}