{"Country":"United States","Object Features":"Other","Object Flight Path":"Stationary,Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=44.212485,+-69.974152(48803)&iwloc=A&hl=en\"> mufon case (48803) map </A>","Summary":"Shortly after 1 am let dog out and saw a stationary \"blob\" in sky. Got binoculars, much smaller, could see horizontal oval shape with minimum five lights, pulsating, I believe center light was red. Lights sent spiking beams. Don't know what it was!","Disposition":"Unresolved","Longitude":"-69.974152","Log Number":"US-07082013-0011","Region":"Maine","trends":["There have been no other sightings in Monmouth","This sighting has never been favorited."],"Case Number":"48803","Object Shape":"Oval, Sphere","files":["/var/www/straped/mufon/html2text/48803.html.txt","/var/www/straped/mufon/org/48803.html"],"Date Submitted":"07/08/2013 02:09 UTC","Latitude":"44.212485","City":"Monmouth","Date of the Event":"07/07/2013 01:08 UTC","Viewing Distance":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","divs":["Sighting DetailsThe dog woke me at about 1 am needing to go out. I put her out and saw a large, \"blob\" of light in the sky, much, much bigger than stars or satellites. I went to another part of the house and got binoculars. When I returned the light was much smaller, closer to the size of a star. I trained the binoculars on it and saw an object with a horizontal, oval shape that had I believe five lights, adjacant in a horizontal line,the center one I believe was red. All of the lights were pulsating and sent spikes of light up and down. I woke my husband but when he got to the window, the object was gone. As he went back to the bedroom, I again spotted a moving light and trained my binoculars on it. It was the same object I had just observed. I saw it very briefly again and then it disappeared. I really don't know what I was looking at. The object appeared to move left to right, from the large \"blob\" to the smaller sized light. Then it moved away in a northerly direction. I remain perplexed by the incident. I keep replaying it in my head, but have not yet figured out what it might have been."],"Weather Factors":"Unknown","Tags":"City"}