{"Region":"Florida","divs":["Sighting DetailsIt was about between 10pm and 11pm I cannot remember what exact time it was. I was inside on my couch holding my new grandchild. My son in law came rushing in after walking the dog and rushed me and my daughter outside. There were only two lights left after I went outside they were very high up. When the lightening struck you could see some of them in the clouds. Very odd lightning as well as there was no sound. My son in law said that they changed into different flight patterns but it was in seconds, nothing a plane or balloon could do. Apparently other people were watching them as well. I only saw the two pulsate and then blink out. They were completely stationary when I went out. My daughter saw a neon green one a few months earlier but it was in cloud cover as well. I will keep an eye to the sky from now on. I was not much of a believer but I am starting to wonder. From my research they have been in this area a few times but residence were told they were weather balloons with lights attached to them. I believe if more people were outside sky watching every night instead of watching TV (like me, LOL) there would be tons of reports. P.S. I didn't have time to get my camera and I am not sure if I could have captured a picture as they were very high in the night sky."],"files":["/var/www/straped/mufon/html2text/48801.html.txt","/var/www/straped/mufon/org/48801.html"],"Sighting Duration":"Undisclosed","Object Flight Path":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=28.188485,+-82.72407(48801)&iwloc=A&hl=en\"> mufon case (48801) map </A>","Log Number":"US-07082013-0009","trends":["There have been 18 other sightings in New Port Richey","There were no other sightings in New Port Richey on or around July 7th 2013"],"Object Features":"Unknown","Longitude":"-82.72407","Country":"United States","Object Shape":"Unknown","Summary":"20 to 30 amber lights moving in several patterns. then blinked out one by one. There was a lightning (no thunder) and people were lighting off fireworks","Latitude":"28.188485","Weather Factors":"Unknown","City":"New Port Richey","Disposition":"Unresolved","Viewing Distance":"Over 1 Mile, Unknown","Tags":"City","Date Submitted":"07/08/2013 12:43 UTC","Case Number":"48801","Date of the Event":"07/07/2013 10:24 UTC","Source":"MUFON"}