{"Object Shape":"Sphere","Source":"MUFON","Summary":"Observed 4-5 red, glowing orbs while watching July 4th fireworks.","files":["/var/www/straped/mufon/html2text/48800.html.txt","/var/www/straped/mufon/org/48800.html"],"Log Number":"US-07082013-0008","Tags":"City","Object Flight Path":"Path with directional change,Path then hovering","Country":"United States","trends":["There have been 5 other sightings in Wyoming","There were no other sightings in Wyoming on or around July 4th 2013"],"divs":["Sighting DetailsI was watching July 4th fireworks (2013) from my window. It was approximately 10:15 - 10:30 pm. The fireworks were directly East of me and probably no more than about two miles away. I noticed one red, glowing orb start to ascend to the left of the fireworks. Its size and brightness caught my eye and, at first, I thought it was the finally firecracker being launched (again, because it was so big, I assumed they were going to have a big finish). The orb appeared (from my perspective) just a bit over the horizon but still very low. Instead of bursting into a firecracker shape, it continued to slowly rise. It kept climbing then hovered for about five seconds, then re-started its climb while curving a little to my left (its right). It kept going until it climb as high as I could see (about as high as a plane would be if you watched it after it took off from an airport and it reached its maximum ascent) then it stopped. Then a second red, glowing orb appeared in the same spot as the first one did before it started to climb, and it too started to ascend. Almost immediately, a third, then a fourth appeared (there may have been a fifth one also). These rose together (slowly like the first one) but very soon after the last one launched, they formed what looked like a parallelagram. They pretty much followed the same path as the first orb including hovering where it did, then upon their continued climb, curved to my left. This group kept climbing until it almost reached the first orb, then all of them dimmed and eventually, disappeared. It wasn't a cloudy night so I don't know if their dimming and disappearance was do to their lights just dimming or because they moved directly away from me making them disappear as they got farther way. Throughout the sighting, I was pretty fascinated by what I was observing. I also quickly realized, this was NOT part of the show. Since I had no idea what they were, they qualified as UFOs but I, obviously, didn't know if they were military or alien or whatever. I also was thinking at the time, if these orbs were military or alien, why would they make such an obvious appearance at a Fourth of July fireworks display when they had to know a lot of people would be able to see them."],"Date of the Event":"07/04/2013 10:30 UTC","Case Number":"48800","map":"<A HREF = \"http://maps.google.com/maps?q=42.909589,+-85.722443(48800)&iwloc=A&hl=en\"> mufon case (48800) map </A>","Disposition":"Unresolved","Weather Factors":"Unknown","Latitude":"42.909589","Longitude":"-85.722443","Date Submitted":"07/08/2013 12:18 UTC","City":"Wyoming","Object Features":"Unknown","Sighting Duration":"00:10:00","Viewing Distance":"Unknown","Region":"Michigan"}