{"City":"Centerville","Object Features":"Dome","files":["/var/www/straped/mufon/html2text/48817.html.txt","/var/www/straped/mufon/org/48817.html"],"Object Flight Path":"Hovering then path","Longitude":"-95.968782","Source":"MUFON","trends":["There have been 3 other sightings in Centerville","There were no other sightings in Centerville on or around January 24th 2013"],"Tags":"City","Region":"Texas","Country":"United States","Latitude":"31.263408","map":"<A HREF = \"http://maps.google.com/maps?q=31.263408,+-95.968782(48817)&iwloc=A&hl=en\"> mufon case (48817) map </A>","Viewing Distance":"Unknown","Log Number":"US-07082013-0025","Object Shape":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"01/24/2013 12:00 UTC","Summary":"noticed 1 light at 1st in the sky..thought it was a plane, star, etc but it strobed and hovered and very slowly moved.. then saw a 2nd 1 after that.","Weather Factors":"Unknown","divs":["Sighting DetailsIt was late January 2013 on a Saturday night. I was at my brother's for the weekend and had stayed up late to watch a Hitchcock movie with him and my nephew. My brother & I decided to step out and have a cigarette on his front porch. As we stood there sharing a smoke together & were small talking I noticed a \"bright star\" type light that seemed stationary in the sky. I pointed it out to my brother (who is a 30 + police veteran) and he acknowledged it seemed pretty bright, too. As we hung out together talking, we kept looking at the light and noticed that was very slowly moving across the sky but at a speed so slow that if your didn't really watch it, you would probably wouldn't notice the movement. Our interest was peaked and we started wondering what the heck it could be. The object began to strobe different colors & continued to do so throughout the entire event. My brother called for his son to come outside & look at it as well. We noticed it slowly went from left to right across the sky and a slow declined angle toward the distant tree line. My brother told his son to go get his high definition binoculars that he uses for police work. Upon his son returning, we began taking turns looking at the lights with the binoculars and could see that there was some type of object with exterior strobing lights in the sky. We got pretty excited & also dumbfounded and kept debating what it could be. At about that time my nephew pointed out a 2nd light in the sky... very very similar, if not exact to the 1st 1 we had been observing. This 2nd object was first observed at a further left end of the sky.. and under a long horizontal cloud that was more misty than thick. The 2nd object hovered in the bottom area of this thin cloud and began moving in the same manner as the 1st object, i.e., slow but strobing. Its direction was heading from around the bottom of the cloud cover and more toward the center of the sky. We probably stayed outside observing it for 45 min- 1 hr and when we went back inside to finish the Hitchcock movie (about 10 mins of the movie left) the objects (both of them) were still there in the sky strobing and very slowly moving. The 2nd 1 seemed to be moving further away because it got smaller. The 1st 1 seemed just as bright but lower in the sky. When I left to go to his camper to get some rest objects were still there but I went on to bed. My brother related to me later that after I went to bed he and his son stepped out to see if they were still there and they were. The next morning of course it seemed like all we could talk about and the objects were not there anymore. I'll never forget it."],"Disposition":"Unresolved","Date Submitted":"07/08/2013 08:37 UTC","Case Number":"48817"}