{"Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/48812.html.txt","/var/www/straped/mufon/org/48812.html"],"Log Number":"US-07082013-0020","Summary":"A huge fireball flying overhead","Source":"MUFON","Object Features":"Unknown","Date Submitted":"07/08/2013 06:23 UTC","Viewing Distance":"Unknown","trends":["There have been 4 other sightings in Longview","There were no other sightings in Longview on or around July 4th 2013"],"divs":["Sighting DetailsI live in Longview, Washington. On July 4th I saw what appeared to be a UFO. This could not have been a Chinese sky lantern or a firework. I got video of it but it's not the best and certainly couldn't be used to support my claim. I would rather just tell you what I saw and maybe there's radar evidence of it or something. At 10:30 I arrived back with my mom to our house from our local firework show. We got out of the car and that's when my mom noticed something in the sky. At first we thought it was a plane burning and about to crash somewhere around our house. We kept watching this huge ball of flame keep moving and pass over our house and into the next horizon. This thing had to have been at jet-liner altitude and was about 2 or 3 jets wide and about 2 long, I mean it was huge especially when we saw it pass over us. Went from horizon to horizon in about 2 or 3 minutes and was in a direct line. It was seen in the Portland area and passed off as Chinese lanterns but I saw it in Longview and I can certainly say it was not one. It headed in a line which came from the beach and was traveling West to East. I just want to know if it was a satellite or a plane or if maybe I saw was something truly special. Thanks a bunch- Kyle Shay"],"map":"<A HREF = \"http://maps.google.com/maps?q=46.147198,+-122.930927(48812)&iwloc=A&hl=en\"> mufon case (48812) map </A>","Weather Factors":"Unknown","Country":"United States","City":"Longview","Sighting Duration":"Undisclosed","Tags":"City","Disposition":"Unresolved","Case Number":"48812","Region":"Washington","Date of the Event":"07/04/2013 10:32 UTC","Longitude":"-122.930927","Object Shape":"Boomerang, Fireball","Latitude":"46.147198"}