{"Summary":"This was a very loud 'music' maybe 4 notes, repeated & faded up.","Sighting Duration":"Undisclosed","Longitude":"-122.333696","Weather Factors":"Unknown","Case Number":"48811","City":"Estacada","Region":"Oregon","Disposition":"Unresolved","divs":["Sighting DetailsThis morning at 6am, I was sleeping and woke up to a very loud noise. I sat up in bed. My dogs (3 of them) barked a few short barks. The noise was sort of like music, maybe 3 or 4 notes played over and over. Same sound. Almost like the movie Close Encounters, but the music was different. It sounded mechanical, like a giant machine. My two dogs stopped barking and my 3rd started to howl. He never howls. I live in a rural area and no neighbors close by. I went onto the deck without the dogs, I didn't want them to run after something. As soon as I opened the door my dog stopped howling. I stood on my deck and looked up, it was a cloudy morning and I couldn't see anything but I could hear it really loud. I said out loud 'what the hell is that?' I couldn't see anything. Now, I do believe in UFO's and always joke of the mother-ship coming to get me, but for a brief instant I did think this was it. That is how odd it was. I went back in my house and locked the door behind me and got back in bed. The sound eventually got fainter and was gone. It was coming from above and it was not a sound I could replicate or describe. The best I can say is it was machine like. There are no trees above me, there isn't anything. I am up in elevation. No airports. Viability in the sky was low due to clouds. After the sound left, about a half hour later, I went outside with one of my dogs, the dog that was howling. He is able to track planes in the sky that fly at about 30,000 feet, so he has some sense of things beyond most dogs. There was a strange mist or fog around. Not usual and I thought it was weird. I looked back at my dog who was starring into the sky. And looking around like I was. I know whatever it was, he felt it too. I am not crazy (well, not more than most) and I have no explanations. I did call my closest neighbor and he said normally he is up at that time, but for some reason he could not get up this morning. He did not hear it. My pets behaved strange for a few hours after. I have no explanation at all. I wish I would have thought to record it with my cell."],"Date of the Event":"07/08/2013 06:05 UTC","Country":"United States","Object Shape":"Unknown","Object Features":"Unknown","Viewing Distance":"Unknown","Date Submitted":"07/08/2013 06:18 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.289566,+-122.333696(48811)&iwloc=A&hl=en\"> mufon case (48811) map </A>","Latitude":"45.289566","Object Flight Path":"Unknown","files":["/var/www/straped/mufon/html2text/48811.html.txt","/var/www/straped/mufon/org/48811.html"],"Tags":"City","trends":["There have been 2 other sightings in Estacada","There were no other sightings in Estacada on or around July 8th 2013"],"Log Number":"US-07082013-0019","Source":"MUFON"}