{"map":"<A HREF = \"http://maps.google.com/maps?q=39.310069,+-76.880168(48822)&iwloc=A&hl=en\"> mufon case (48822) map </A>","Summary":"Appeared during photo shoot of Howard Co. Balloon Festival. Disappeared behind photographing balloon. Object unknown; curious/ looking for examiners for photos.","Date of the Event":"05/17/2013 09:32 UTC","Log Number":"US-07082013-0030","Weather Factors":"Unknown","Longitude":"-76.880168","Case Number":"48822","Disposition":"Unresolved","City":"Ellicott City","Country":"United States","files":["/var/www/straped/mufon/html2text/48822.html.txt","/var/www/straped/mufon/org/48822.html"],"Object Features":"Dome","Sighting Duration":"Undisclosed","Source":"MUFON","Latitude":"39.310069","Region":"Maryland","trends":["There have been 10 other sightings in Ellicott City","There were no other sightings in Ellicott City on or around May 17th 2013"],"Tags":"City","Viewing Distance":"Unknown","Object Shape":"Disc, Saturn-like","Date Submitted":"07/08/2013 11:50 UTC","Object Flight Path":"Stationary","divs":["Sighting Details Earlier in May, my mother heard about the Balloon Glow and suggested that we go check it out. It was our first time, even though it's a yearly event, and we both figured it would be a good place to shake off the dust from our cameras. On the 17th, we drove out to Howard Co. It was fairly cloudy at first, but the weather seemed to cooperate the later it got, and the moon decided to peek out. I didn't realize the time until after I took my photographs; mom had the watch on, but it was dark. Overall, without looking at my RAW files, it was 9-10PM. I was working on my last set: a hot-air balloon floating up into the night sky, trying to work in the moon, when I saw a rotating, flashing light. It reminded me of one of those light up toys you can buy at the circus where lights flash off and on, spinning quickly in a circle--or like a police light bar--hovering high over an apartment complex. I had no idea what it was, but for the sake of curiosity I fired a few photographs off. The balloon sailed down, obscured my vision, and by the time it landed, the lit object in the sky was gone. Honestly I thought I hadn't taken any photographs of it at all. In the next few days, I set up Adobe Photoshop Elements and began fixing up a few photographs, adding exposure and reducing noise (adding exposure brightens a photograph, and since it was dark, the higher the ISO or sensitivity to light setting on a camera, the more noise--the gritty bits in a photograph--there is). Eventually I got into the images that I took near the end of the night, and when I brightened the one in question, a shape became visible. It couldn't have been a lens flare; I'd debunked some of my other photographs earlier. A small, remote-controlled helicopter was flying around the field while the balloons were being taken down, but I hadn't seen it in the time I was taking pictures of this particular balloon. The object has a definite shape, the classical UFO look. I brought mom over to check the files and she seemed as stunned as I am. We didn't want to make any assumptions, but seeing the image for the first time certainly made it hard not to."]}