{"Object Shape":"Circle, Sphere","Sighting Duration":"00:03:00","Disposition":"Unresolved","Weather Factors":"Unknown","Case Number":"48820","Latitude":"47.61415","Date Submitted":"07/08/2013 10:42 UTC","Summary":"Orb-like object, glowing in a hazy, white light","Longitude":"-122.329231","divs":["Sighting DetailsI was on my balcony facing east over Lake Washington just before 10:00pm, taking a break from hanging pictures around the condo. Stepped outside to take a short rest and enjoy some of the clear, night air. A rapidly ascending light caught my eye over the treetops. It appeared to be in an almost straight ascent at a pretty high speed and I thought it was a laser or something at first. Then I noticed that as it passed in front of clouds it didn't refract light at all, but rather just blocked them from view as would an object. It made several slight, directional changes and speed changes as it ascended. I called my girlfriend to see it and she observed it as well. I described it as a 'very motivated balloon with thrusters'... as it did appear to have an almost 'floating' quality about its flight - but ascended much too rapidly and changed directions to be a balloon (unless there are new, High-performance types that I have not seen). As it got higher up it dimmed and became obscured behind clouds, and reappeared from time to time as it ascended. I lost sight, but my girlfriend caught a last glimpse of it what would have to be several miles up at this point. Then it was gone. I've never seen anything like it -- and would not have thought of myself as a 'UFO Reporting Type Person' -- but I'm pretty up on modern aviation and this didn't seem to have any flight characteristics I'd seen before -- nor did it seem like a random light or laser. I scanned the news the next day, but didn't see any other sightings -- though would be interested in hearing from anyone else who might have seen it. I tried to catch it on my iPhone, but couldn't find it on the small view-screen - and so opted to observe instead of fumbling with my camera. It appeared to be coming from somewhere just East of Lake Washington -- a bit South of the 520 bridge - but could have been up to a couple miles farther east for all I know."],"Log Number":"US-07082013-0028","Tags":"City","files":["/var/www/straped/mufon/html2text/48820.html.txt","/var/www/straped/mufon/org/48820.html"],"Viewing Distance":"501 Feet - 1 Mile","City":"Seattle","Region":"Washington","Country":"United States","trends":["There have been 110 other sightings in Seattle","There were no other sightings in Seattle on or around July 7th 2013"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=47.61415,+-122.329231(48820)&iwloc=A&hl=en\"> mufon case (48820) map </A>","Object Features":"Unknown","Date of the Event":"07/07/2013 09:49 UTC","Object Flight Path":"Path with directional change"}