{"Tags":"City","Country":"United States","Date of the Event":"08/07/2012 11:30 UTC","Longitude":"-71.39035","City":"Providence","divs":["Sighting DetailsThe exact date and time are estimated because I did not know where to legitimately report this sighting at the time of the incident. In the summer of 2012, in Edgewood, RI, on Narragansett Bay adjacent to Stillhouse Cove, at night, I, and a friend, were inside his house working on the computer, when we witnessed glowing orange orbs (at least six...) which appeared from the west moving over the water in an easterly direction. At first we thought they were military helicopters shining down lights, because of their size, but when we ran out to the deck there was no sound from their direction, or otherwise. There were just these glowing orange orbs moving in unison, but not in a pattern. The size of the orbs were what you would expect if a large helicopter were moving above the rooftops and shining a light large enough to obscure the shape and presence of the helicopter. Their path varied slightly, changing directions, hovering intermittently, then slowly moving across the water toward the opposite side of the bay where they disappeared into some cloud cover on the other side. It spanned just a few minutes. No strange noises, sensations or emotions. We watched with rapt curiosity...no fear...just focused interest. Astonishing moment."],"Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/48824.html.txt","/var/www/straped/mufon/org/48824.html"],"trends":["There have been 27 other sightings in Providence","There were no other sightings in Providence on or around August 7th 2012"],"Date Submitted":"07/09/2013 01:55 UTC","Latitude":"41.770962","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=41.770962,+-71.39035(48824)&iwloc=A&hl=en\"> mufon case (48824) map </A>","Log Number":"US-07092013-0002","Source":"MUFON","Region":"Rhode Island","Weather Factors":"Unknown","Object Features":"None","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Viewing Distance":"501 Feet - 1 Mile","Summary":"Over Narragansett Bay observed orange glowing orbs(5-6) that traveled W. to E. in unison...varied path with intermittent hovering. The grouping crossed the bay then disappeared into cloud cover on the opposite side.","Sighting Duration":"Undisclosed","Case Number":"48824"}