{"divs":["sighting details got in my swimming pool for a night swim and as i began floating on my back i looked up at the stars. i was startled to have a very bright light shinning directly at me. i have seen aircraft approach lights before (naval aviation 10 yrs) so i quickly dismissed the idea of it being an aircraft. the angle would be to steep. the light was almost directly above me. the light faded out and then re-appeared taking approximately 4-6 second intervals from bright to dark. i have also seen satellites in the night sky and i assumed that this is what it was. how ever i have never seen one with a light. as i am writing this i am realizing that the object was not moving as fast as a satellite but close to it. i continued to try and track it and realized that as it would go dark it would appear farther to the west... still headed in a n\\nw direction. each time it would go dark i would try to anticipate where it would appear and i was wrong until i figured it out. i began to use a star and a notch in my wall to be sure. always appearing to the west of where i thought it should be. it continued in the same direction until i lost it. very dusty conditions here in the phoenix area at the time. i don't know if this was just an odd satellite or something else. i felt the need to let someone know."],"Latitude":"33.476365","Log Number":"US-07102013-0001","map":"<A HREF = \"http://maps.google.com/maps?q=33.476365,+-112.082475(48843)&iwloc=A&hl=en\"> mufon case (48843) map </A>","Viewing Distance":"Unknown","Object Flight Path":"Straight-line path,Path with directional change","Date Submitted":"07/10/2013 12:31 UTC","Weather Factors":"Unknown","Region":"Arizona","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around July 8th 2013"],"Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/48843.html.txt","/var/www/straped/mufon/org/48843.html"],"City":"Phoenix","Sighting Duration":"Undisclosed","Case Number":"48843","Source":"MUFON","Longitude":"-112.082475","Object Features":"Unknown","Disposition":"Unresolved","Country":"United States","Summary":"pulsating light traveling n/nw with a lateral shift when dark.","Tags":"City","Date of the Event":"07/08/2013 09:10 UTC"}