{"trends":["There have been no other sightings in Colac","This sighting has never been favorited."],"Source":"MUFON","Country":"Australia","Object Features":"None","Viewing Distance":"Unknown","Tags":"City","Disposition":"Unresolved","Longitude":"143.584438","Latitude":"-38.340044","Date Submitted":"07/10/2013 01:23 UTC","Case Number":"48845","Sighting Duration":"Undisclosed","Date of the Event":"12/31/2012 10:30 UTC","Log Number":"AU-07102013-0003","Object Shape":"Sphere","Summary":"Three large orange orbs hovering directly above","map":"<A HREF = \"http://maps.google.com/maps?q=-38.340044,+143.584438(48845)&iwloc=A&hl=en\"> mufon case (48845) map </A>","files":["/var/www/straped/mufon/html2text/48845.html.txt","/var/www/straped/mufon/org/48845.html"],"Region":"Victoria","City":"Colac","divs":["Sighting DetailsNew Year's Eve 2012 visiting a friend at Colac Victoria. The sky was crystal clear and we were sky watching for any signs of UFO's in the distance. We went inside to get something, came back out and directly above were three huge orange orbs glowing and hovering, it's as if they were watching us. They seemed to be hovering about the height of where a helicopter would fly, but they definitely were not helicopters. At first I couldn't believe what I was seeing, as there was NO SOUND at all. They hovered above us for a few minutes then slowly glided off to the North East towards Melbourne, until we lost sight of them. While driving to Colac from Melbourne (3 hour drive) earlier that day I had been listening to Dr. Steven Greer's cd's on the CE-5 protocols and I was very focussed on this all day. I can't help but feel they actually came to me because I was so focussed on the CE-5 protocol. We certainly did not feel threatened at all and looking back, I wish I had tried to communicate telepathically, as this may have been what they were waiting for. Unfortunately the cameras were in the house and I didn't want to run inside in case I missed something. I will NEVER FORGET this unbelievable encounter for as long as I live and every time I think of it, it puts a smile on my face."],"Object Flight Path":"Hovering then path","Weather Factors":"Unknown"}