{"City":"Hooksett","Summary":"Glowing almond shaped object, moving at incredible speed. Appeared to be skipping across sky. Followed by a black triangle moving in opposite direction.","Object Shape":"Sphere, Triangle","Country":"United States","Log Number":"US-07092013-0018","Latitude":"43.101071","Longitude":"-71.458048","map":"<A HREF = \"http://maps.google.com/maps?q=43.101071,+-71.458048(48841)&iwloc=A&hl=en\"> mufon case (48841) map </A>","Source":"MUFON","Viewing Distance":"Unknown","trends":["There have been 2 other sightings in Hooksett","There were no other sightings in Hooksett on or around July 9th 2013"],"Sighting Duration":"Undisclosed","Object Features":"Unknown","Weather Factors":"Unknown","Region":"New Hampshire","Date of the Event":"07/09/2013 09:31 UTC","divs":["Sighting DetailsI was using my downstairs bathroom and happened to notice an object out the back window. The object was only in view for about 10 seconds. What I saw was a glowing almond shaped object racing across the sky, almost as though it was skipping like a rock would across a lake. My gut reaction was it was a light source outside, however i was able to follow it accross the horizon as it got smaller. The object was moving from south to north and was difficult to judge any sound or exact size as I was inside the house. Immediately following the first object, a black triangle shaped object crossed the same path in the opposite direction moving west to east. After seeing the first object, i went outsode to see if I could explain the lights. This craft was solid black, had three defined glowing white corners and a red pulsing light directly in the center. The triangle object made a low rumble sound as I watched it from my back deck. It was moving slowly across the sky, not unlike a conventional aircraft would. However the sound, shape and light configuration were not familiar to me."],"Disposition":"Unresolved","Object Flight Path":"Path with directional change","Case Number":"48841","Tags":"City","files":["/var/www/straped/mufon/html2text/48841.html.txt","/var/www/straped/mufon/org/48841.html"],"Date Submitted":"07/09/2013 10:12 UTC"}