{"Date of the Event":"06/07/2013 12:00 UTC","Object Flight Path":"Path with directional change","Disposition":"Unresolved","trends":["There have been 5 other sightings in Alliance","There were no other sightings in Alliance on or around June 7th 2013"],"Latitude":"40.933935","Date Submitted":"07/10/2013 01:02 UTC","Country":"United States","Weather Factors":"Unknown","Region":"Ohio","Longitude":"-81.154176","Case Number":"48851","Source":"MUFON","Object Shape":"Fireball, Sphere","Log Number":"US-07102013-0009","Tags":"City","Summary":"We observed a glowing orange light travel over our barn, turn slightly, then ascend straight up rapidly.","divs":["Sighting DetailsMy wife and I were laying in bed at midnight watching TV when I looked out our bedroom window and saw a bright orange flame above our horse barn. I told my wife and jumped out of bed to get my glasses and we both went to the window as I thought either my barn was on fire or an airplane was on fire. We both watched it traveling slowly westbound and, as it was going over my house and out of sight I ran and turned off the house alarm so I could open the front door and watch it. I opened the south door and went outside. Both of us saw it. It was very bright orange, round, and looked as if it had flames trickling around it. It also had a perfectly round white center. It was not too far away and was about the size of a dime or penny held at arms length. It was slowly changing direction from sw to nw and suddenly shot straight up and out of site in the clouds. The cloud layer was very low that evening so it probably was not too high up. I can tell you it was NOT an airplane, meteor, flare, balloon or anything that we had ever seen before. We're not too crazy, I'm retired Army, now a high school teacher and I work part-time as a deputy sheriff and my wife is a nurse, so we're not too prone to fantasy. We can just say that this was something extremely unique and something we had never seen before. The most interesting aspect of the sighting was the fact that this thing had the appearance of flames trickling around it. There was no trail behind it of any kind, just the round, bright orange ball. When it ascended it went straight up at a very high speed into the clouds before it went out of site. When it was over our barn when we first observed it it was much larger and brighter,about the size of a quarter which made it so alarming as a fire. This makes me believe it was gaining altitude as it was moving from east to west. I should have grabbed my phone to video it, but things happened too quickly."],"Object Features":"None","City":"Alliance","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=40.933935,+-81.154176(48851)&iwloc=A&hl=en\"> mufon case (48851) map </A>","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/48851.html.txt","/var/www/straped/mufon/org/48851.html"]}