{"Latitude":"39.177602","Object Features":"None, Appendage(s)","Case Number":"48858","Weather Factors":"Unknown","Object Shape":"Other","Tags":"City","divs":["Sighting DetailsI went out my front door to have a cigarette, my daughter came out with me. As we sat on the steps, I noticed a bright yellowish light on a hilltop to the southeast. It looked to me like the whole top of the hill was on fire but my daughter said it was a plane because we could hear one. It cleared the hill and when it did I could see it was huge-full moon sized. It got smaller as it came closer to us though. As it came closer the jet sound faded. The sound had actually been a plane far to the west. It stayed below the cloud cover and as it got closer we could see the lights. It looked like an Egyptian eye. It also had 3 lights above or on top of it. They were thin long lights. One was vertical and centered on top of it, the other two were on either side of the center one and one slopex to right one to left. It looked like a crown on top. Only the lights could be seen, I have no idea if the lights followed the outline of the object or not. It flew silently from southeast to north below the clouds and pazsed over my house. We stepped out into the yard so we could keep it in sight as it passed over our house. When it was over our back yard it simply winked out, but the light seemed to waver or shimmer first. The objects speed was about the same as an airplane. Feelings? Mainly disbelief. I have spent most eveni.gs stargazing for the past 40 years and this is the only time I have been absolutely certain as I was seeing it that it was not a satellite or conventional aircraft. Hope you guys can tell me wjat it was."],"Longitude":"-81.943705","Object Flight Path":"Straight-line path","City":"Coolville","Summary":"egyptian eye shaped object flew from southeast to north then disappeared.","files":["/var/www/straped/mufon/html2text/48858.html.txt","/var/www/straped/mufon/org/48858.html"],"Region":"Ohio","Viewing Distance":"101-500 Feet, Over 1 Mile","trends":["There has been one other sighting in Coolville","There were no other sightings in Coolville on or around June 29th 2013"],"Source":"MUFON","Date of the Event":"06/29/2013 10:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.177602,+-81.943705(48858)&iwloc=A&hl=en\"> mufon case (48858) map </A>","Log Number":"US-07102013-0016","Date Submitted":"07/10/2013 10:18 UTC","Country":"United States","Sighting Duration":"Undisclosed","Disposition":"Unresolved"}