{"Summary":"2 ufos seen over 2 nights. One starlike on the first night. 2nd craft closer and seen from bottom.","Region":"Arkansas","Object Flight Path":"Stationary,Hovering then path","Longitude":"-92.40683","Sighting Duration":"Undisclosed","Viewing Distance":"20 Feet or Less, Over 1 Mile","Disposition":"Unresolved","Object Shape":"Star-like, Unknown","divs":["Sighting DetailsThe first one that I saw...I was hanging out with two friends standing outside one of their houses. I first noticed the starlike object and pointed it out. It was much brighter than a star and when we all watched it, it shot off at incredible speeds and was gone. I remarked about how I had never seen one before and one of my friends said he saw them all the time. The second was when I and the friend who had seen them before, were coming home from the movies. We turned down my parents road and during a clear long straight stretch, I noticed the craft right above us. It was larger than I could tell...maybe a football field. I can't remember if it was circular or not but it looked black against the sky that was a kind of purple at the time. What I do remember is that there were lots of lights under the craft. We slowed down and drove underneath it very slowly. I told my friend to turn around just about a fourth of a mile and when we went back to the place it was gone. I haven't told anyone but friends and family about my experience because I'm afraid of being seen as crazy. I've been having strange dreams about when I was little and staying at my grandmothers house. I'm in bed and a light comes through the window. I look outside and there is a silver craft by the tree. In my dream I feel like I should hide. I used to hate going to my grandmothers house when I was little. I would spend one night and then scream and cry for my parents to come and get me. I'm not sure if these are just dreams or if I am remembering something. I have 3 children and having these dreams really worries me for them. I'd kinda like to find out what's going on with me. There is so much more than I can put down here. Please help."],"Date Submitted":"07/10/2013 01:50 UTC","Source":"MUFON","City":"Springhill","Latitude":"35.192418","files":["/var/www/straped/mufon/html2text/48852.html.txt","/var/www/straped/mufon/org/48852.html"],"Weather Factors":"Unknown","Object Features":"Other","Date of the Event":"11/01/2004 12:00 UTC","trends":["There have been no other sightings in Springhill","This sighting has never been favorited."],"Log Number":"US-07102013-0010","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=35.192418,+-92.40683(48852)&iwloc=A&hl=en\"> mufon case (48852) map </A>","Case Number":"48852","Country":"United States"}