{"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Other,Unknown","Source":"MUFON","Log Number":"US-07102013-0011","Tags":"City","Summary":"we still some times see them here from my back yard.","City":"San Francisco","trends":["There have been 127 other sightings in San Francisco","There were no other sightings in San Francisco on or around July 3rd 2013"],"divs":["Sighting DetailsI have seen multiple sightings, but we can see the best from my back yard after sunset, when is clear (we have a lot of fog here) but is the usual to see something weird in the sky, we live behind a small mount range that protects the San Francisco Sfo. and some how I think SFO. can not see them but we can, I had also witness a round disc like UFO. at the Bay Bridge, but when I got close enough it was gone, (weird). My son, wife, and I were hanging out in the back yard witness flashing lights strait on top of our heads, my son and I, in an other time we witness a flying glowing orb, mush like a small flying sun, at low altitude and very slow, (jaw dropping event) at least for us it was, and the continuous flying of objects with add lights that are going at a super fast speed up so high that I think that the light that we see it is the reflection of the sum on it sun, after sun set with in an hour more or less, and that gives me the idea that they are metallic or Gray in color and they can cast the light of the sun, even when is dark here because the height in which they fly, I think that's why we can see them here."],"Date Submitted":"07/10/2013 02:21 UTC","Weather Factors":"Unknown","Country":"United States","Latitude":"37.739994","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Longitude":"-122.448956","Object Features":"Window(s), Other, Unknown","files":["/var/www/straped/mufon/html2text/48853.html.txt","/var/www/straped/mufon/org/48853.html"],"Object Shape":"Circle, Disc, Fireball, Sphere, Star-like, Other, Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.739994,+-122.448956(48853)&iwloc=A&hl=en\"> mufon case (48853) map </A>","Date of the Event":"07/03/2013 09:00 UTC","Case Number":"48853","Region":"California"}