{"map":"<A HREF = \"http://maps.google.com/maps?q=36.175197,+-86.777833(48869)&iwloc=A&hl=en\"> mufon case (48869) map </A>","Date Submitted":"07/11/2013 05:02 UTC","Object Features":"Patterned Surface","Region":"Tennessee","Country":"United States","trends":["There have been 72 other sightings in Nashville","There were no other sightings in Nashville on or around July 8th 2004"],"Disposition":"Unresolved","Source":"MUFON","divs":["Sighting DetailsI was driving on Old Hickory Blvd at Brick church Pk. at 12:A.M. I thought I saw a hot air ballon shaped like a a can of soup. Then I realized it was night time and the craft was headed to three large cell towers and a lot of guide wires. As I got closer the bottom was luminated yellow-orange about 15% up and the craft had angled facets that started at the bottom and was lost in the dark but, you could see the outline of the the craft. It moved over the hill I followed it to the other side it would move and stop dim a little get brighter move and stop. then it moved around the towers and I lost sight again. I drove down Brick Church Pk. and it started to slow over a pasture near I-24 the light got dark and I could see the outline of the craft and it was not there after a short time. If it had been a ballon it would have never made it across the hills ,terrian and the towers and wires and where did the thing go... I know it has been nine years but I remember it like yesterday and it just does not add up. call me if you need anything 615-357-7705"],"Date of the Event":"07/08/2004 12:00 UTC","Tags":"City","Longitude":"-86.777833","files":["/var/www/straped/mufon/html2text/48869.html.txt","/var/www/straped/mufon/org/48869.html"],"Latitude":"36.175197","Sighting Duration":"00:20:00","Case Number":"48869","Log Number":"US-07112013-0009","Viewing Distance":"501 Feet - 1 Mile","City":"Nashville","Summary":"I saw a cylinder shaped craft pass through three large towers and wires","Object Shape":"Cylinder","Object Flight Path":"Path then hovering","Weather Factors":"Unknown"}