{"Tags":"City","Log Number":"US-07112013-0006","Summary":"Brightened 10x to 100x then dimmed back to star-like. Saw again 8 min later just star-like, same path","Viewing Distance":"Over One Mile","Latitude":"39.112798","Case Number":"48866","Date of the Event":"07/11/2013 03:54 UTC","Object Shape":"Fireball, Star-like, Teardrop","Source":"MUFON","Object Features":"None","Region":"Ohio","trends":["There have been 82 other sightings in Cincinnati","There were no other sightings in Cincinnati on or around July 11th 2013"],"Country":"United States","divs":["sighting detailsi was walking on 7\\11\\2013 around the soccer field at the university of cincinnati, gettler stadium, at 3:54am when due west, the direction i was walking at the time, a light appeared in the sky at 40 degrees up. the object was moving quickly at the size of star-like and quickly brightened to extremely bright, 10 to 100 times brighter than anything in the sky and to the size of an aspirin in the shape of a teardrop. so bright i felt like i was having a beam of light pointed at me. then it dimmed all the way back down to star-like. at first, it looked like it was moving east, south east, towards me and across my view toward the south. however, after it dimmed, it appeared to just be moving south, south west. a loud boom or bang bounced off the ground near the campus toward the direction of the object. it is possible the noise was unrelated to the object, possibly a trash truck dumping a dumpster. after dimming, i followed the object across the sky with my unaided eye for about 20 seconds until i could no longer see the object due to distance and clouds. 8 minutes later, at 4:03am, in the same area of the sky and moving in the same direction i saw what appeared to be the same object moving the near exact path across the sky. i didn't see any brightening of the object this time. it too, about 10-15 seconds later disappeared due to distance and clouds. i was at the stadium from 3am til almost 5am and saw no other objects like it, nor heard any other loud booms. i thought it was a meteor skipping off the atmosphere, but once i saw it again, it seemed too much of a coincidence. the object appeared to be extremely far away. possibly flying over between west side of cincinnati and indiana border."],"Date Submitted":"07/11/2013 05:50 UTC","City":"Cincinnati","files":["/var/www/straped/mufon/html2text/48866.html.txt","/var/www/straped/mufon/org/48866.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.112798,+-84.50502(48866)&iwloc=A&hl=en\"> mufon case (48866) map </A>","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-84.50502","Object Flight Path":"Straight-line path","Disposition":"Unresolved"}