{"Date of the Event":"03/12/2013 12:00 UTC","Weather Factors":"Unknown","Summary":"Bright orb, Was located high in the night sky it Looked like the moon but brighter, then dissapeared","Longitude":"-121.964188","Log Number":"US-07112013-0002","map":"<A HREF = \"http://maps.google.com/maps?q=47.859377,+-121.964188(48862)&iwloc=A&hl=en\"> mufon case (48862) map </A>","Object Shape":"Sphere","Latitude":"47.859377","divs":["Sighting Details1. I was at home in my house, and talking on the phone. However this event didn't cause any interference for me. 2. What made me notice the object was that it appeared be be extremely bright outside in my back yard, so I went to investigate. 3. When I first saw it I thought it was just a full moon and didn't pay much attention to it, Then I realize the moon was in a different location. 4. The object was spherical in shape, and stationary. Extremely bright and almost seemed to have a slight pulse as it lit up everything. I could see clearly as if it was was mid day. 5. When I thought It was a ufo, I didn't think much about it. However I kept watching to see if it would do anything else. I didn't feel scared or threaten, if anything I was more curious. After the object left I was a little disappointed that it didn't do much then it did. 6. The object flashed then took off into the sky in a arc shape and was gone from sight. I will note that as it was leaving I had a idea of the distance it was from me do the the fact of the object changing size when it departed. However I could be wrong. Meaning it was either extremely large in shape and far away.... or small and closer then I realized. The only reference I have is that I had mistaken it for the moon because it was so big. I thought it was the moon and roughly the same shape."],"Region":"Washington","Viewing Distance":"N/A","Object Flight Path":"Stationary","Date Submitted":"07/11/2013 12:32 UTC","Country":"United States","Case Number":"48862","Disposition":"Unresolved","trends":["There have been 6 other sightings in Monroe","There were no other sightings in Monroe on or around March 12th 2013"],"Object Features":"Dome","Tags":"City","City":"Monroe","Sighting Duration":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/48862.html.txt","/var/www/straped/mufon/org/48862.html"]}