{"Disposition":"Unresolved","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","City":"Mercersburg","Date Submitted":"07/12/2013 08:36 UTC","Log Number":"US-07122013-0007","Date of the Event":"07/04/2013 12:00 UTC","trends":["There have been 2 other sightings in Mercersburg","There were 2 other sightings in Mercersburg on or around July 4th 2013"],"Region":"Pennsylvania","files":["/var/www/straped/mufon/html2text/48882.html.txt","/var/www/straped/mufon/org/48882.html"],"Country":"United States","Source":"MUFON","Object Shape":"Sphere","Object Features":"None","Latitude":"39.795004","Tags":"City","divs":["Sighting DetailsMy husband and I were on our front porch July 4, 2013, around 9:50 p.m. We heard distant fireworks and thought maybe we could see them. As we started to go back into our house, two objects in the eastern sky caught my husband's eye. It was a very clear night. We live in a rural area with no street lights and have the most amazing view of the sky. We both watched - they were round, orange lights, and they moved from south to north. They were apart, but moving consistently. There was no sound, nothing was blinking or pulsating, and the lights remained steady. They didn't appear to us to be moving quickly, but we had no idea how close or far away they were. I tried to catch a video on my iPhone but, since I had only recently gotten it, had no idea how to do a video. I was able to take a picture but there are no reference points to it so it just appears as a non-descript light. Our view was obscured briefly by a large tree, so we watched the sky where we thought they would emerge, but nothing. We wondered where they could have gone and began talking about what they could be - airplanes, drones, satellites, etc. The lights were obviously not consistent with an airplane's, and the general consensus about drones is that they have no lights! I immediately wanted to go on the web to see if anyone else saw these lights and as we turned to go back into the house, another one went by! It was the very same size, moving at the same pace, and in the same flight path. It, too, was silent and unblinking. We watched it go past the same tree and didn't see it emerge either. Just last night, July 11, 2013, at 11:00 p.m. my son came bursting through our bedroom door to tell us that there was another orange light in the sky (he didn't witness last week's sighting, just his own on July 11, 2013). I immediately got up and went out to the front porch with him. There it was, the very same color and shape as the 3 my husband and I saw exactly a week before but, this time, it was just hovering. There was no sound, no blinking lights. We watched it for about 15 seconds. The light disappeared, came back on, then went off again permanently. We couldn't see it again. My son and I talked about how it was a Thursday night again and that maybe something went around the earth in an orbit that was exactly a week, but we were both still amazed. It is now 8:30 Friday morning, July 12. I am online once again trying to find out if anyone has witnessed these lights and I want to make a report of my own. I'm finding reports of glowing orange lights in the sky from as far back as a year ago, and others as recently as last week. We are excited to think that it could be \"other-worldly\" and find ourselves sitting on our porch every evening with the hopes of seeing these lights again."],"Summary":"3 lights moving in the eastern sky, south to north 7/4/13; 1 light of the same description hovering in same area 7/11/13","Object Flight Path":"Straight-line path","Case Number":"48882","map":"<A HREF = \"http://maps.google.com/maps?q=39.795004,+-77.863098(48882)&iwloc=A&hl=en\"> mufon case (48882) map </A>","Longitude":"-77.863098","Weather Factors":"Unknown"}