{"Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path,Path with directional change","divs":["Sighting Details1pm- I was outside doing yardwork, when a helicopter approached from the south. It was s military Blackhawk with no observable markings, traveling at high elevation and speed. Despite the altitude, the engine noise was very loud, which led me to believe it was at full throttle. Traveling behind it were three dark objects, what I first thought were birds due to their small size and erratic movements. As the helicopter got closer, it became apparent they were at similar elevation and speed. The objects were tiny, almost invisible unless silhouetted against a cloud. They were some kind of plate shape (wide and thin) and spent most of the observed time banking, leaving only the slim profile to observe. They were black, and very, very small. As far as I could tell, they changed elevation easily. In the first 60 seconds of my observation, they trailed behind the helicopter, flying in a triangle formation. It was very big and loose, the three individual objects banking in and out of formation. In the last 60 seconds, the broke formation and gained altitude. At least one got ahead of the helicopter, twisting in a S maneuver out of my line of sight. The other two climbed above the clouds, one totally disappearing, the other visible only briefly in breaks of the cloud. The helicopter never deviated course or speed during this time, it continued on a NE heading. The objects appeared to be above it at all times, at least a thousand feet at the beginning, and then slightly more by the end."],"trends":["There have been 2 other sightings in Mount Orab","There were no other sightings in Mount Orab on or around July 12th 2013"],"Latitude":"39.031876","Region":"Ohio","Summary":"Three small objects trailed a military helicopter, erratically changing altitude and formation","Source":"MUFON","Date Submitted":"07/12/2013 02:13 UTC","Object Features":"None","City":"Mount Orab","Log Number":"US-07122013-0011","files":["/var/www/straped/mufon/html2text/48888.html.txt","/var/www/straped/mufon/org/48888.html"],"Weather Factors":"Unknown","Date of the Event":"07/12/2013 01:05 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.031876,+-83.914412(48888)&iwloc=A&hl=en\"> mufon case (48888) map </A>","Sighting Duration":"Undisclosed","Country":"United States","Disposition":"Unresolved","Longitude":"-83.914412","Object Shape":"Disc","Case Number":"48888"}