{"divs":["sighting details1. traveling north on western avenue, passing 72nd street, in oklahoma city. followed object down 50th street towards penn street, to 44th street and may ave. 2. i noticed the object through the windshield of my truck, to the n\\e above the power lines and rooftops, estimate less than 1500 ft. agl. the object was irradic in its flight stability and direction. 3. at first i believed it was an aircraft in distress, with the pilot struggling to maintain control and flight stability. 4. the object was traveling in a non-direct flight path from the n\\e to the s\\w, ascending and descending, wobbling, hovering, flipping over, reflecting light in certain relationship to the sun. the craft was definitely under intelligent control. i followed the craft and observed it travel towards will rogers international, then back towards the n\\e, then n\\b. 5. intensely fascinated and investigative. 6.the object traveled to the n, was below scattered cloud cover, then above it, just s of sun on horizon. traveled over sun ascending then turned n\\w and ascended quickly out of visual sight."],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=35.47377,+-97.513468(48887)&iwloc=A&hl=en\"> mufon case (48887) map </A>","Disposition":"Unresolved","Case Number":"48887","Sighting Duration":"Undisclosed","Object Features":"Unknown","trends":["There have been 78 other sightings in Oklahoma City","There were no other sightings in Oklahoma City on or around July 11th 2013"],"Latitude":"35.47377","Date Submitted":"07/12/2013 12:51 UTC","Log Number":"US-07122013-0010","Date of the Event":"07/11/2013 06:20 UTC","Summary":"Dark colored elongated object.","Source":"MUFON","files":["/var/www/straped/mufon/html2text/48887.html.txt","/var/www/straped/mufon/org/48887.html"],"Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Region":"Oklahoma","City":"Oklahoma City","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Longitude":"-97.513468","Object Shape":"Cigar","Tags":"City"}