{"Object Flight Path":"Straight-line path,Path with directional change","Object Shape":"Sphere, Other","Latitude":"42.58338","Object Features":"None, Appendage(s)","divs":["Sighting DetailsIll make this brief, 1st ufo has been around my house for several weeks. Does show a pattern in directional changes. Rectangle, with 4 smaller rectangles at each corner. Sometimes pulses, but it's not bright. At first I thought it was a safelight catching the sun, then it came back, but from a different direction and light pulse patterns. It also becomes extremely bright, bright enough to compete with the moon when it's full. I don't want to sound crazy but, when it is about to appear, I get a feeling that someone is watching. When this happens not to far afterwards this object appears. I've woken out of a dead sleep from this feeling, almost like a trained Marine Recon Sniper. Similar feeling occurs with the second object. Second object(s) 2 white balls of light that are somewhat transparant, but isn't... If that makes anysense. Walking along a busy street and two appear out of nowhere. After I got over the shock at how close they were, I reached for my phone to take a picture, and then when I returned my attention to the objects, they were gone. Funny thing is, when I was going on my walk, I was thinking to myself \"I wonder if ill ever be able to see a ufo type object in the daylight.\" Well, sort answer...yup. Before this appeared same feeling, like someone was watching me."],"Source":"MUFON","Summary":"2 ufos. First one red rectangle pulses and brightens. Sphere, white some what clear Dissappers","files":["/var/www/straped/mufon/html2text/48890.html.txt","/var/www/straped/mufon/org/48890.html"],"Weather Factors":"Unknown","Case Number":"48890","map":"<A HREF = \"http://maps.google.com/maps?q=42.58338,+-83.179016(48890)&iwloc=A&hl=en\"> mufon case (48890) map </A>","Date Submitted":"07/12/2013 02:23 UTC","trends":["There have been 18 other sightings in Troy","There were no other sightings in Troy on or around July 12th 2013"],"Sighting Duration":"00:00:11","Disposition":"Unresolved","Longitude":"-83.179016","Country":"United States","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Tags":"City","City":"Troy","Date of the Event":"07/12/2013 10:36 UTC","Log Number":"US-07122013-0013","Region":"Michigan"}