{"Disposition":"Unresolved","Source":"MUFON","Object Flight Path":"Hovering then path","Date Submitted":"07/12/2013 11:50 UTC","divs":["Sighting DetailsOn July 12th 2013 at 10:15 PM I walked out on to the porch look at my flower bed and some vegetables i had planted when i looked up at the west ward sky. It was lightning in the distance back twords Lawndale and Fallston NC, but it was far enough away that there was no sound. It hadn't rained or anything so i thought \"well there is a storm on the way.\" As the clouds parted i saw a bright object. My first thought was that \"That is cool looking.. it has to be the moon shining through the clouds.\" This is where i realized it was something different because the moon never rises west where we live. I watched it for a moment and noticed the lightning or electricity. It was white and blue and it was bouncing around INSIDE the circle. I watched it for approximately 1 min 30 seconds trying to figure out exactly what i was seeing, then the object suddenly grew very bright and in an instant, flew off quickly north by northwest almost blinding me for a second. As my eyes grew accustomed to the darkness again i saw a perfect triangle of clouds or smoke glowing in the sky where the object had been. This wasn't a trail like an airplane would leave and it was only in one spot. The triangle was perfect and looked like some kind of wierd smoke ring. It was bigger than the circle that had made it, almost like the circle would have fit directly into the middle of the triangle. Scared, i turned and ran into the house shouting for my wife and son and daughter in law to come and see. Wife was washing dishes and son and daughter in law had just come in so they were in his bedroom. I ran to the sink and pulled my wife's arm and turned and ran back out the door. By the time we got outside, the triangle was fading, but still visible. It persisted and vanished before our eyes in approx 2 mins or less. Me my wife and my son all saw the triangle of smoke. My daughter in law did not see the triangle because she was reluctant to come outside in the dark because of the insects. Shaken, i came in and wrote down what i saw, the time and direction that it went and a small sketch of what it looked like. I called my dad and was on the phone with him as i walked back outside. The time is now 10:35 PM. I abruptly hung up the phone with my dad when i saw the object come into view again in what appeared to be the same position as before. Running back into the house i yelled frantically once again \"ITS back!!.. dad called me crazy .. but its back again!!\" for my family. I ran into the computer room and grabbed the camera from my desk to try and get a picture. While i was grabbing the camera, my son ran outside and to the end of the cement and saw the object. My daughter in law didn't see it because she was busy chaining the dog on the porch this time. The dog wasn't barking or anything. Whatever it was, was far enough away that it didn't spook the dog. My son said that it was triangle shaped object with blue and white lights that faded out within a 10-15 seconds. By the time i got out the door past my daughter in law and to the ground in the front yard far enough north to see past the tree limb to get a picture, it was gone. No bright flash, no smoke triangle this time. Nothing.. Just darkness. I took a few shots of the sky where the object had been, but there was nothing there. My son drew a small sketch on the back of the paper when we came back into the house about 20 mins later, that i had drawn mine on. It showed the position in the sky that he saw it and the shape. His description matched mine. Understand this was a circle at first, that i saw, that appeared huge. I thought it was the moon. It appeared that large in the sky. Then it filled with electricty and suddenly took off northward at great speed with no sound. The cloud that it left behind was a perfect triangle shape and thick. I couldnt have drawn a perfect triangle like this. It almost pulsated, but i think that may have been my eyes adjusting back to the darkness after the flash. I thought at first i was crazy, but my wife and son saw the triangle in the sky and then later it returned and my son saw the craft. I have been trying to understand what i saw and all i can think is that maybe the reason i didn't see the triangle craft the first time was because it was powering up or something for the burst of speed and maybe the pull of the air around it created the triangle cloud. I wish i could give you more detail but thats what i saw."],"Object Shape":"Circle, Triangle","Object Features":"Other","Date of the Event":"07/12/2013 10:15 UTC","files":["/var/www/straped/mufon/html2text/48897.html.txt","/var/www/straped/mufon/org/48897.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.377649,+-81.467331(48897)&iwloc=A&hl=en\"> mufon case (48897) map </A>","Sighting Duration":"00:04:00","Log Number":"US-07122013-0020","Longitude":"-81.467331","Weather Factors":"Unknown","Latitude":"35.377649","Viewing Distance":"Unknown","Tags":"City","Summary":"Huge ball of light filled with electricity and then a triangle smoke cloud","trends":["There have been 3 other sightings in Shelby","There were no other sightings in Shelby on or around July 12th 2013"],"Case Number":"48897","City":"Shelby","Region":"North Carolina","Country":"United States"}