{"Region":"Ontario","Date Submitted":"07/13/2013 09:42 UTC","Country":"Canada","Source":"MUFON","files":["/var/www/straped/mufon/html2text/48906.html.txt","/var/www/straped/mufon/org/48906.html"],"Disposition":"Unresolved","Viewing Distance":"Over One Mile","Object Features":"None","Object Shape":"Sphere, Star-like","trends":["There have been 15 other sightings in Hamilton","There was one other sighting in Hamilton on or around July 12th 2013"],"divs":["Sighting DetailsI live in a marina. We were out on the terrace enjoying the evening coolness. Mostly clear sky with some clouds. Quarter Moon in the West. My wife was facing south, looking out into the harbour. I was facing her and looking into the harbour. All of a sudden she shrieked my name and said look up. Thankfully she pointed directly up but slightly left. Thankfully I looked up over my left shoulder into the sky above. And I saw it as it flew over our roof and flew across the harbour and across Lake Ontario. It was a huge oval, very brightly lit...whitelight. For want of a better description the light pattern within the oval looked snowflake like. It was travelling at a great rate of speed. Hard to judge, but I would say faster than our fastest jet. As it crossed the lake towards the City of Toronto it just vanished. We were stupefied at first. Then we looked out at the other terraces. We only saw two other couples having dinner but from their angle and the fact they were in strong conversation it was obvious they missed it. Several of the boats were occupied but again people were drinking and conversing and looking down. I saw no sign of commotion. So I had to assume we were the only ones who witnessed the event. Unsettling because other people would have added to confirm what we saw. My wife and I quickly went over the facts and we both were in total agreement with what we saw, in terms of height, angle, size, color of lights, rate of speed. We stood out on the terrace for the next half an hour. We stared out at the lights of Toronto. Which is about 25 miles away as the crow flies. Approx distance. There was a cloudy skyline. Twice we saw a huge oval light pop up and seeem to hover and pulsate. It was a mixture of color in terms of light. White and orange. It seemed way too large to be a plane going to or coming from the city airport. I could observe a few planes in the sky during this time in and around Toronto and they were small pinpoint white lights that you usually associate with a passenger jet. What the two appearances were I cannot speculate. They appeared for ten seconds and disappeared. Perhaps my eyes were playing tricks on me. But the original sighting of the huge oval is definitive to me. I know that was something I was seeing as it was and that it was something I have never seen before. All I can say about the appearance of the two quick hovering light events over Toronto within 15 minutes of the incident is that we sit on our terrace all the time at night and look out at Toronto and Ive never seen those two light events before. So it seems attached to the flying object that I did clearly see. Thank you for taking my report."],"map":"<A HREF = \"http://maps.google.com/maps?q=43.23357,+-79.689686(48906)&iwloc=A&hl=en\"> mufon case (48906) map </A>","Latitude":"43.23357","Object Flight Path":"Straight-line path","City":"Hamilton","Log Number":"CA-07132013-0007","Tags":"City","Case Number":"48906","Summary":"looked up in the sky and ths huge white light oval-snowflake movnig at a super fast speed flew directly over us and disappeared on the horizon","Sighting Duration":"00:00:10","Date of the Event":"07/12/2013 09:45 UTC","Weather Factors":"Unknown","Longitude":"-79.689686"}