{"Summary":"Watched bell watched shaped red-Orange object Fly Over east field then hovered above trees","Log Number":"US-07132013-0003","Weather Factors":"Unknown","Tags":"City","Date Submitted":"07/13/2013 01:39 UTC","Region":"Indiana","Latitude":"41.084768","Country":"United States","Disposition":"Unresolved","divs":["sighting detailsi was outside on the deck facing north at approximately 1:30 in the a.m. an approaching glow from just over the trees to the north east of my location caught my eye. it seemed to come out of nowhere due to the low altitude and treeline in that direction. i looked up and over the trees from the north & slightly east appeared a red-orange bell shaped object approximately one quarter mile up. it passed me at approximately 300 yards to the east there were no audible sounds from craft. as it passed it was moving at a steady speed with no discernable variation of altitude or speed. naturally i freaked out, (i've seen numerous unidentified objects before but never this close). i ran inside to grab my camera. when i returned outside (about 10 seconds later) i could not locate it. i ran to the east edge of the house, it had travelled further south clearing the field to the south of the house reaching a wooded area. i watched it slow down and hover momentarily. it looked to be hovering at the top of the trees across the field. i watched it change from its red orange color to a dark goldish yellow color as it descended. it disappeared from my line of sight behind the trees approximately 1\\2 mile away. i attempted to take pictures of the hover & descent but it was too dark and i didn't have the camera settings ready for night pics and video. there were no usable pictures or video. it did appear however that the area the object should of occupied was \"washed out\" while the rest of the exposure appeared normal. i believe this was caused by the object. after i lost sight of the object i returned inside quite shaken up. i opened up the blinds in the windows facing south. i did some dishes so i could look out the window and to take my mind off what i had seen and occupy some time while waiting to hopefully see this again. i had the windows open so i could listen for anything out of the ordinary. i heard some unusual noises from outside, i was already on edge so i then closed all the windows & blinds in the house. a few more minutes passed and i had a feeling that i should look out the window just then. i pulled back the blind, (there are railroad tracks about 25 feet from the backside of the house that are elevated blocking visibility) i looked in the previous direction & saw nothing, i opened the blind fully, just then a huge! crescent\\cross shaped craft with a greenish aura around it & 4 or 5 red lights on the underside ascended from behind the railroad tracks. it flew directly over the top of the house, i ran out the front door to see it ascend at 45deg quickly and entirely silent. there were no obvious signs of propulsion. i attempted to take pics with my iphone of the ascent those did not come out either. have not seen bell shaped object again."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.084768,+-85.628038(48901)&iwloc=A&hl=en\"> mufon case (48901) map </A>","Object Shape":"Chevron, Cross, Egg, Teardrop","City":"South Whitley","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Viewing Distance":"21-100 Feet, 101-500 Feet","trends":["There have been 2 other sightings in South Whitley","There were no other sightings in South Whitley on or around March 19th 2013"],"Source":"MUFON","Longitude":"-85.628038","Sighting Duration":"00:15:00","Date of the Event":"03/19/2013 01:30 UTC","Object Features":"None, Dome, Wings, Unknown","files":["/var/www/straped/mufon/html2text/48901.html.txt","/var/www/straped/mufon/org/48901.html"],"Case Number":"48901"}