{"trends":["There have been no other sightings in Irvin","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=29.407705,+-82.246448(48905)&iwloc=A&hl=en\"> mufon case (48905) map </A>","files":["/var/www/straped/mufon/html2text/48905.html.txt","/var/www/straped/mufon/org/48905.html"],"Object Features":"Unknown","Case Number":"48905","divs":["Sighting DetailsMe and my 2 brothers were going home after playing some tennis in a small town next to where we live. My brother was driving his car, I was in the passenger seat and my youngest brother was in the rear seat. On the way home approximately 7-8 miles from our small farm I was talking to my brother ( the driver ) and out his window I seen a strange glowing object heading across the field in our direction, I pointed it out to my brother ( the driver ) and told him to pull over, He than seen the ufo and told me no that he wasn't pulling over, but he finally did after a few seconds. Once he pulled over he said that he wanted to go ( while observing from the car ) and I said no way I want to see this and grabbed the keys out of the ignition, got out of the car and sat on the hood while to 2 brothers stayed in the car. This is what I saw, It was a glowing circular ( not perfectly round ) noiseless ufo a little higher than treetop level coming right over us from west to east at about 2-3 miles per hour, it was a guess approximately 60 feet in diameter. It was so close that I had to look up at it and couldn't see the top at that point. I do remember that it had a very bright glow that didn't hurt your eyes as I looked at it, but I could not see any spinning or other lights. The thing that was weird I remember the most is that once it got over our car I was looking up at this thing and it seemed to slow down just a little bit more and I remember feeling weird but not scared that this thing new everything about me. Sort of like it was observing me. Than it crossed over the other side of the street still in a westerly to eastern direction and still moving at approximately 3 miles per hour than disappeared in the blink of an eye leaving no trail. I than got back into to the car gave my brother the keys and he drove home without saying a word, he was the first one to eneter the house and I remember my mom asking me what is wrong with your brother he looks like he just seen a ghost, I than told her what happened. My brother I found out later got so scared about the incident he messed his pants and still to this day will not talk about it unless pushed."],"Date of the Event":"09/10/1978 12:00 UTC","Viewing Distance":"21-100 Feet","City":"Irvin","Source":"MUFON","Weather Factors":"Unknown","Object Shape":"Oval","Disposition":"Unresolved","Region":"Florida","Log Number":"US-07132013-0006","Tags":"City","Longitude":"-82.246448","Country":"United States","Latitude":"29.407705","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Summary":"Will never forget this event with my brothers.","Date Submitted":"07/13/2013 08:24 UTC"}