{"Summary":"My friends and I were watching fireworks on July 4th when we noticed a yellowish/reddish orange orb move low and slowly accross horizon. Then it started pulsating blue!","Country":"United States","Log Number":"US-07132013-0006","Object Shape":"Circle, Fireball, Oval, Sphere, Star-like","Longitude":"-80.587555","Tags":"City","Sighting Duration":"00:00:55","files":["/var/www/straped/mufon/html2text/48904.html.txt","/var/www/straped/mufon/org/48904.html"],"Viewing Distance":"501 Feet - 1 Mile","Latitude":"28.037082","City":"Palm Bay","Disposition":"Unresolved","Object Features":"Unknown","Object Flight Path":"Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=28.037082,+-80.587555(48904)&iwloc=A&hl=en\"> mufon case (48904) map </A>","Case Number":"48904","Region":"Florida","trends":["There have been 13 other sightings in Palm Bay","There were no other sightings in Palm Bay on or around July 4th 2013"],"divs":["sighting detailsi was at my friends house in palm bay, florida watching the fireworks on july 4th. we were talking about ufos, aliens, and life on other planets. all of the sudden i look over to see a yellowish\\reddish orange orb! i first noticed the object because of it's unusual size, glow, and the way it moved across the sky. when i first saw the object i had no idea what it was. i quickly busted out my droid razr phone, and took a video of the orb as it moved from a nw direction to the nw... low and slow... the object slowly seemed to hover\\move silently. after about 30-40 seconds of viewing, the orb began to radiate a specific blue color. it wasn't like anything i'd ever seen from common aircraft like planes, helicopters, or whatever else is up there. the closest analogy is like a deep sea jellyfish that radiates it's bio-luminescence colors, except it was wavering mostly blue throughout the orb. randomly. my feelings were that this was something of an extraterrestrial nature, but obviously we had just been discussing ufos and aliens so this seemed too coincidental to be true. i'm an avid ufo junky, and i am a firm believer that there are technologies and entities that exist and operate without the public's common knowledge. i walked away from this experience believing i had witnessed, and video recorded a possible ufo or a real ufo of an extraterrestrial nature. like always, my friends were mostly laughing at me before this experience happened while i ranted on about previous ufos i had witnessed, and several other reasons why i believe a lot of the cases and report to be 100% true. then literally after laughing hysterically at some of my claims we turn our heads to see this beautiful orb moving across the sky. then it changes colors from the orange\\red glow to radiating blue. our minds were officially blown, and i felt relieved that maybe it happened for a reason! i lost sight of the object as it moved to the nw, and i fiddled around with my camera phone making sure i had gotten a video of the experience."],"Date of the Event":"07/04/2013 11:01 UTC","Weather Factors":"Unknown","Date Submitted":"07/13/2013 04:10 UTC","Source":"MUFON"}