{"Date Submitted":"07/13/2013 06:34 UTC","divs":["Sighting DetailsWas mowing the lawn at in-laws home on a yard tractor, traveling south at the time of happening. I was paying extra attention as I was mowing the county road edge of the yard, watching for on coming traffic to pop up over a hill. I saw at about 300 yards away a transparent rotating object moving east to west at a very high rate of speed. About 1-2 feet off the ground maybe, close to 4 feet in diameter. The object had depth of a couple feet, was if you were looking through a crystal, resembled a bladed impellor rotating on edge. Object was spining super fast in a circle vertically, (like a tire on a car). Object was moving at 40 to 50 mph. Object was running along the edge of the corn field, the green corn stalks enabled me to see the depth of the object, as if looking through plexiglas or a crystal. The corn stalks did not move, but the tops of the corn plants shook viloently. About 25 feet from reaching the county road, the spining object shot upward at about a 35 degree angle, and was not visable anymore. No noise above the riding tractor was noticed. I thought what the hell, wasn't going to tell anyone. Decided to tell my wife. She could tell I wasn't lying about what I saw."],"Log Number":"US-07132013-0016","Object Features":"Other","Date of the Event":"07/13/2013 11:30 UTC","files":["/var/www/straped/mufon/html2text/48915.html.txt","/var/www/straped/mufon/org/48915.html"],"Source":"MUFON","City":"South Bend","map":"<A HREF = \"http://maps.google.com/maps?q=41.656009,+-86.237816(48915)&iwloc=A&hl=en\"> mufon case (48915) map </A>","Object Flight Path":"Straight-line path,Path with directional change","Viewing Distance":"101-500 Feet","Disposition":"Unresolved","Region":"Indiana","Object Shape":"Circle","Summary":"Crystaline like whirling circle ran down the edge of the corn field at a high rate of spee, turned upward at 45 degrees and was not visable","Case Number":"48915","Country":"United States","Latitude":"41.656009","Sighting Duration":"Undisclosed","Longitude":"-86.237816","trends":["There have been 38 other sightings in South Bend","There was one other sighting in South Bend on or around July 13th 2013"],"Weather Factors":"Unknown","Tags":"City"}