{"Country":"United States","Region":"Ohio","Object Flight Path":"Path with directional change,Path then hovering","Source":"MUFON","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Chagrin Falls","This sighting has never been favorited."],"Log Number":"US-07132013-0014","Latitude":"41.429852","Object Shape":"Star-like","divs":["Sighting DetailsI was with my girlfriend sitting on the hood of her car looking at the stars. I was just looking around and I saw this star that was moving around randomly, so I pointed it out to my girlfriend. The star-like object appeared to be moving around in no particular direction, until it got to some grouping of stars where it looked like it was \"vibrating\" or moving up and down then it just stayed there. What made me question this was the fact that there is no aircraft that can move that freely, back and forth, so quickly and randomly. Also, it was extremely too high up to be any kind of human aircraft. I decided it could not be any sort of UAV because UAVs are unable to move in different directions the way this did, also not a satellite for the same reason. I believe before I saw it I saw a shooting star as well, if it is significant at all. I was very calm when I saw it and tried to rule out every possibility and could not come up with anything. The object did not disappear either as far as i could tell i unfortunately had to leave however i am going back out tonight around the same time and look for it."],"Case Number":"48913","Summary":"it appeared to be a star and it was very random","City":"Chagrin Falls","Weather Factors":"Unknown","Date of the Event":"07/12/2013 11:50 UTC","Date Submitted":"07/13/2013 02:47 UTC","Tags":"City","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.429852,+-81.3911(48913)&iwloc=A&hl=en\"> mufon case (48913) map </A>","Disposition":"Unresolved","Viewing Distance":"Over One Mile","Longitude":"-81.3911","files":["/var/www/straped/mufon/html2text/48913.html.txt","/var/www/straped/mufon/org/48913.html"]}