{"Tags":"City","Source":"MUFON","City":"La Porte","Summary":"2 ? flickering flames observed in sky","divs":["sighting detailsmy nephew (john) and i went outside (me first then he joined me) to watch the fire works for the 4th of july celebration. i first observed and then told my nephew about a dark red object moving very slowly several miles west of us. it was not a plane because of its speed and the object seemed to have a flickering effect like a candle would in a gentle breeze. i watched this object for about 2 minutes before it vanished into the clouds or above them. after a few minutes my nephew went back into our apartment because he was getting tired of the mosquitoes. about 2 minutes later i observed another similar object south of me either in the clouds or above the cloud line. the object was in a northeastern path and i observed this object for about 1 1\\2 minutes before it vanished from site because of the clouds at the same time i was trying to capture it on video. this was the last i seen of it. the object appeared to be my fire emitting friend i have seen many times before. all i could see was the flickering of what appeared to be was the flame. because of the objects distance and altitude, my guess would be that both objects had to be large \"ships.\""],"Case Number":"48912","trends":["There have been 32 other sightings in La Porte","There were no other sightings in La Porte on or around July 4th 2013"],"Log Number":"US-07132013-0013","Longitude":"-86.728938","Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.638684,+-86.728938(48912)&iwloc=A&hl=en\"> mufon case (48912) map </A>","Latitude":"41.638684","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/48912.html.txt","/var/www/straped/mufon/org/48912.html"],"Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Sighting Duration":"00:01:30","Region":"Indiana","Viewing Distance":"Over One Mile","Date of the Event":"07/04/2013 08:30 UTC","Country":"United States","Date Submitted":"07/13/2013 02:10 UTC"}