{"trends":["There have been 28 other sightings in Arvada","There was one other sighting in Arvada on or around July 4th 2013"],"Log Number":"US-07142013-0002","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/48925.html.txt","/var/www/straped/mufon/org/48925.html"],"Region":"Colorado","Longitude":"-105.138018","divs":["Sighting DetailsMy wife and I decided last minute to watch the fireworks at Lutz field in Arvada. We found a spot on a small hill and set up a blanket several blocks from, and West of the firework location. The show began normally and about 15 minutes in I glanced to the left of the Easterly fireworks (NE) and caught sight of an orange orb hovering. My first thought was a helicopter, and I vocalized this to my wife. I offered that perhaps it was a Chinese lantern, being Independence day. She watched with me as a second identical orb blinked on to the right of the first and then split into two, creating a third orb. The third orb then split itself to make a fourth. All objects began \"dancing\" around one another slowly. Their movement was very fluid and methodic as they descended and ascended around one another. Suddenly one of them blinked off and the other three came together to form a deliberate triangle. They hovered unmoving for several seconds in that formation and then the fourth blinked back on and one at a time the objects made a hook turn and drifted to the Northeast below tree line and out of our sight. We were both in awe during the entire event, our attention drawn fully away from the fireworks. There were other people around us who seemed to be too enthralled in the show to notice. If anyone else did they did not vocalize it. I believe my wife was a little frightened because she wanted to leave immediately after the last orb was no longer visible. I convinced her to stay and we finished the show. Unfortunately the objects were too dim and small to capture on our cell phones. Later that same night we observed another strange event on which I will file a separate report as the time and location is different."],"Disposition":"Unresolved","Object Features":"None","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.797964,+-105.138018(48925)&iwloc=A&hl=en\"> mufon case (48925) map </A>","Case Number":"48925","City":"Arvada","Date Submitted":"07/14/2013 12:30 UTC","Date of the Event":"07/04/2013 09:45 UTC","Sighting Duration":"Undisclosed","Source":"MUFON","Object Shape":"Other","Tags":"City","Object Flight Path":"Hovering then path,Other","Summary":"Multiple orbs seen at fireworks show. They \"danced\" around one another and blinked off and reappeared again for about five minutes.","Latitude":"39.797964"}