{"City":"Lakewood","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=39.661223,+-105.109818(48928)&iwloc=A&hl=en\"> mufon case (48928) map </A>","Date of the Event":"07/04/2013 10:10 UTC","trends":["There have been 39 other sightings in Lakewood","There were no other sightings in Lakewood on or around July 4th 2013"],"Region":"Colorado","Log Number":"US-07142013-0005","Latitude":"39.661223","divs":["sighting detailsmy wife and i were on our way home from fireworks in arvada at approximately 10:10 pm. we were heading south on kipling st and we caught sight of a bright blue\\purple flashing in the sky to the left of us (west). i continued paying attention to the road and asked her to keep an eye on the lights. i pulled off into a parking lot on a hill and parked the car facing west. the cross made of lights on mount lindo was directly in front of us. we observed the light hovering just above the mountain ridge to the left of, and above the cross. the lights seemed to be coming from one object that flashed rapidly and in a color sequence. two small red lights on top and a blue light on the bottom, then the red lights would blink off, and the blue light would change to a blue-green almost teal color, then back to solid blue, and then the red lights would reappear. this pattern continued in a rapid flashing. my wife thought perhaps it was a police car on the mountain, however being familiar with the mountain i knew that the lights were too high to even be on it. we observed the flashing for several minutes. i was somewhat excited to be witnessing a second event in the same night. suddenly the bandimere speedway fireworks began at 10:30 and since the lights were still flashing and unmoving, we decided to stay and watch the show. mid-show i glanced up the mountaintop and noticed that the lights were gone. i was bummed that i had missed it. we finished the firework show and i put the car in gear and pulled forward to u-turn, but hit my breaks mid-turn with my jaw on the floor. my wife gasped as she took noticed of what i observed. the lights were back, flashing in sequence in the exact same spot. i wanted to stay and observe more but my wife was tired and we agreed that after our sighting in arvada and now lakewood,we had filled our quota of unexplained events. we headed home dumbfounded and excited."],"Object Flight Path":"Stationary","Country":"United States","Case Number":"48928","Object Shape":"Unknown","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/48928.html.txt","/var/www/straped/mufon/org/48928.html"],"Date Submitted":"07/14/2013 01:10 UTC","Tags":"City","Object Features":"Unknown","Source":"MUFON","Longitude":"-105.109818","Summary":"Driving home from fireworks and noticed a bright flashing blue, green and red light hovered above the cross made of lights on the side of Mount Lindo"}