{"Object Shape":"Sphere","Longitude":"-105.776857","trends":[],"divs":["Sighting Details#1...I left home walking south at roughly 10 am dec. 13,1993 Sunday. Walked 5 blocks to bus stop, as I sat waiting, I noticed a shiny faint object in the sky... Did not think much of it...got bus at roughly 10:15 am... Went west on bus for 30 min. Got off bus and walked west... As walking looked at same space I saw object and it did not not move... I was curious as to why I moved and it didn't ... 15 min. Later I arrived at my destination and still noticed it did not move. I was around 4-6 others and asked them if they see what I see... All agreed that what I was seeing for now one hour in the same place, they also said I see it, how did you see that ? I stated that it had been there a hour before I even got to show you. We all watched all watched a sporting event on television until half time ( 1 hr 30 min) later we all went to the deck and looked at the same area and saw object exactly where it was hours before... We all looked at each other and new something is off... Not a star, or planet or star we agreed because it still did not move...all others began to say ok I saw nothing but it is right there still. We all (I) included kinda forgot about it except me...that day as far as I can recall was special in town, the president of the USA was in town and also Pope John Paul meeting at Regis University... To me it all makes sense now... I believe what I saw was some sort of protection for having the two most important and influential people on this Planet being near.. I felt amazed at what I saw, completely right since others aknowledged the same thing I saw then say never saw it... I just need to tell my story to someone that believes what they saw as I did, the others won't have anything to do with me.. I've seen a couple who where there that day in the past and they will not even aknowledge that I even watched the game with them or was there or that they saw anything ... This is not about them, this is about what I saw, what I know I saw and what I can't explain to myself or others what I saw... A friend in a different kind of support group recommended that I contact u... That was in 2007... I've got to make this report for my own good... Maybe, well I don't know.. I've finally reached out, out of fear I've held back in my own belief of what I know I saw for multiple hours... I would like Luke to know more info about that day if possible... Hence my reporting finally...thank you..."],"Tags":"City","Source":"MUFON","Log Number":"US-07142013-0008","map":"<A HREF = \"http://maps.google.com/maps?q=39.552391,+-105.776857(48931)&iwloc=A&hl=en\"> mufon case (48931) map </A>","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Summary":"Witnessed stationary object in same place in air space over time and relocation by self","City":"Undisclosed","Date Submitted":"07/14/2013 02:24 UTC","Disposition":"Unresolved","Country":"United States","files":["/var/www/straped/mufon/html2text/48931.html.txt","/var/www/straped/mufon/org/48931.html"],"Date of the Event":"12/13/1993 10:30 UTC","Object Features":"Dome","Region":"Colorado","Latitude":"39.552391","Object Flight Path":"Stationary","Case Number":"48931"}