{"trends":["There have been 6 other sightings in Georgetown","There were no other sightings in Georgetown on or around July 14th 2013"],"files":["/var/www/straped/mufon/html2text/48936.html.txt","/var/www/straped/mufon/org/48936.html"],"City":"Georgetown","Region":"Kentucky","Case Number":"48936","Object Shape":"Sphere","Object Flight Path":"Straight-line path","Date Submitted":"07/14/2013 02:21 UTC","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Date of the Event":"07/14/2013 12:00 UTC","Summary":"Large red light noted flying NE-SW over 2-3 mins. followed by a 2nd identical light on same path about 2-3 mins later","map":"<A HREF = \"http://maps.google.com/maps?q=38.196954,+-84.581541(48936)&iwloc=A&hl=en\"> mufon case (48936) map </A>","divs":["Sighting DetailsWife & I were sitting outside when I noticed a large red light coming out of the NE. At first we thought it was a Chinese lantern, but it moved very fast along a specific path. Only a single light was observed on the craft and it was somewhat hazy in appearance. For a brief moment I thought I glimpsed a reflection from the light on an unlit, rear surface, but I couldn't be positive. No noise was noted and the object maintained a constant rate of speed along its path. It continued its flight until it passed out of sight in the SW and its appearance lasted about 2-3 minutes. About 2-3 minutes after it passed out of sight, another identical object appeared from the same direction traveling along the same course. Once again, no noise. We live under the flight paths of commercial airlines from Cincinnati and Lexington and nothing that we have ever seen comes close to these objects in appearance. Helicopters from KY Nat. Guard commonly pass over, but it is clear from their racket and movement that they are choppers. In addition, most of our air traffic moves N-S and the only planes we see on an E-W course are usually seen at very high altitudes. These objects looked to be at an altitude of about 1000 feet and moved relatively fast. Faster than choppers, but slightly slower than a fighter jet. Needless to say, one object was unusual, but two was unbelievable!"],"Source":"MUFON","Object Features":"None","Log Number":"US-07142013-0012","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Longitude":"-84.581541","Country":"United States","Disposition":"Unresolved","Latitude":"38.196954"}