{"Object Features":"None","Object Flight Path":"Hovering then path","Longitude":"-84.259497","Summary":"Circular shaped, glowing object, hovering but moving slowly, then traveling at a speed of at least thousands of mies per hour","Weather Factors":"Unknown","Log Number":"US-07142013-0015","trends":["There have been 10 other sightings in Richmond","There were no other sightings in Richmond on or around December 15th 1969"],"Case Number":"48939","Date Submitted":"07/14/2013 02:51 UTC","Date of the Event":"12/15/1969 12:00 UTC","Source":"MUFON","Latitude":"37.692171","Object Shape":"Circle, Disc, Sphere","Viewing Distance":"101-500 Feet","City":"Richmond","map":"<A HREF = \"http://maps.google.com/maps?q=37.692171,+-84.259497(48939)&iwloc=A&hl=en\"> mufon case (48939) map </A>","divs":["Sighting DetailsIn December, 1969, four of us--three 18 year old college students and one professional, were traveling south on Interstate 75, returning home after a University of Kentucky basketball game. South of Richmond, but north of Berea. All four of us saw an object overhead, directly in front of us, with an apparant altitude of a few hundred feet. The size cannot be estimated because the actual altitude could not be determined, as there were no clouds or hills, mountains, etc., behind the object.. The object was round, and glowing with a white color, giving an appearance similar to that of a floresent light, but round, i.e. a circle shape. At that time, so far as I was aware, flouresent lights were only tube shaped, whether straight, or sometimes bent into a circle. I am referring only to the type of light produced by the object. The object had an apparant size larger than a full moon, and the brightness was similar to that of a full moon on a clear night. It was definitely NOT, however, the moon. The object was hovering, moving very slowly from east to west. As we watched, the object suddenly accelerated to a speed far faster than it would seem would be possible within the laws of physics, and moved beyond the western horizon so quickly that it was virtually instantaneous. At the point of the sighting, we were going down a long slope on the interstate, and the terrain was such that there was a very wide, unobstructed view toward the western horizon, of several miles. \"Accelerted\" is actually not the correct word, because \"acceleration\" implies that the speed increased from a slow speed to a faster speed through a process of going faster and faster. To the contrary, the object appeared to have NO TRANSITION from the slow east to west hover to a speed which covered miles from our location to the western horizon in, perhaps, a hundreth of a second. The four of us agreed that we would not report the incident because of the ridicule that we would probably suffer. About six years after the sighting, I saw a newspaper story in the Louisville Courier-Journal newspaper about a professor at Eastern Kentucky University, which is located in Richmond, who was gathering information about a large number of unexplained UFO sightings in the Richmond area over the previous several years. The article pointed out that the US Army Bluegrass Depot, a storage area for nerve and other weapons grade gases, and perhaps other weapons, is located just south of Richmond. I wrote to the professor, telling him about the sighting in 1969, and offering to meet with him if he wished He returned my correspondence, saying to contact him if I was in Richmond in the future, but did not seem anxious to hear the details of the sighting. I never met with him. All three of the observers who were students at the time are now professionals: an accountant, a pharmacist, and an attorney."],"Sighting Duration":"Undisclosed","Country":"United States","Region":"Kentucky","Tags":"City","files":["/var/www/straped/mufon/html2text/48939.html.txt","/var/www/straped/mufon/org/48939.html"],"Disposition":"Unresolved"}