{"Date of the Event":"07/13/2013 10:15 UTC","Object Features":"None","Tags":"City","files":["/var/www/straped/mufon/html2text/48946.html.txt","/var/www/straped/mufon/org/48946.html"],"Weather Factors":"Unknown","Log Number":"US-07142013-0022","Country":"United States","Sighting Duration":"Undisclosed","Longitude":"-72.821762","Disposition":"Unresolved","Region":"Massachusetts","Case Number":"48946","Object Flight Path":"Hovering then path","Object Shape":"Circle, Star-like","Summary":"Red lights just above the horizon. Started one at a time then two at times independently moving and being stationary at times. At one point three lights moving up in a traingular formation.","Source":"MUFON","Date Submitted":"07/14/2013 08:53 UTC","divs":["Sighting DetailsA group of friends and I were sitting out at on the deck enjoying the evening when I spotted a single red light just above the horizon to the east. I watched it move slowly in a few different directions and during this time it would flicker blue and red. Initially I thought it must be a plane or helicopter. The light then disappeared. Another light then appeared within a minute or so to the left of where the first light appeared. This light behaved in the same ways although it never flickered blue. For the next twenty minutes or so we observed these lights appearing and disappearing in the sky just above the horizon. They would be stationary and then move in different directions from time to time. The movements were generally slow but did exhibit short bursts of higher speed at times. Along with these reddish lights there were also bursts of orange and yellowish light appearing just above the horizon at times lasting for about one second at a time. Initially they appeared to maybe be fireworks but there was no different colors, and they were randomly appearing at different locations along the horizon to the east. These lights were hologram like in appearance and were in cone and circular patterns. As the initial red lights continued to appear and disappear they became more frequent and at times there were two separate lights visible. At approximately thirty minutes into this event we witnessed a total of four red lights in a triangular formation travel upward. One of these lights vanished after about four seconds but three of the lights continued upward in this formation and appeared to travel west in our direction since they grew in size. During this movement they also appeared higher in the sky to a point of approximately 40 degrees above the horizon. These lights too soon disappeared as they faded out and a fog moved into our area. Approximately two hours later the fog cleared out and none of these anomalies could be seen."],"trends":["There has been one other sighting in Heath","There were no other sightings in Heath on or around July 13th 2013"],"Latitude":"42.673417","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.673417,+-72.821762(48946)&iwloc=A&hl=en\"> mufon case (48946) map </A>","City":"Heath"}