{"Latitude":"43.621912","Region":"Wisconsin","map":"<A HREF = \"http://maps.google.com/maps?q=43.621912,+-88.729304(48953)&iwloc=A&hl=en\"> mufon case (48953) map </A>","Summary":"Observed 4 glowing white objects moving south to north and then north to south","divs":["sighting detailsour son, 9, came in from stargazing to tell us he'd seen four large glowing white (golfball sized) objects traveling from south to north. they were in a group and moving very fast. his total sighting was less than 3 seconds. he came in to get us and ran back outside, with me following. he observed three of the same size and shaped objects traveling now north to south. this is not the first time he's observed these same objects in our vicinity. he was understandably excited about having seen these, but at the same time nervous about what he'd seen and what they are, considering he's seen them before. we did observe a jet traveling about 20,000 feet above after the second set of lights were observed. the objects were fast-moving and glowing white, according to my son. on 7\\13\\2013 i observed about 4:30 am a large, silent \"plane\" above our town. it was pulsating green and white on wing tips and a red light on the nose. this was an extremely large plane and yet it made no noise and moved slower than a jet would at that altitude. i would estimate it to have been about 15,000 feet up but again, no sound. it was headed in a southeast-northwest direction."],"City":"Waupun","files":["/var/www/straped/mufon/html2text/48953.html.txt","/var/www/straped/mufon/org/48953.html"],"Date of the Event":"07/14/2013 09:30 UTC","Tags":"City","Country":"United States","Longitude":"-88.729304","Viewing Distance":"Over 1 Mile, Unknown","Sighting Duration":"00:00:05","Object Features":"Unknown","Log Number":"US-07142013-0028","Case Number":"48953","Source":"MUFON","Date Submitted":"07/14/2013 10:51 UTC","trends":["There have been 6 other sightings in Waupun","There were no other sightings in Waupun on or around July 14th 2013"],"Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Object Shape":"Sphere","Disposition":"Unresolved"}