{"Viewing Distance":"Over One Mile","Summary":"This yellow bright object moved in grid pattern, seen by approx. 15 other people. then took off at a rapid speed.","Region":"Queensland","Disposition":"Unresolved","Case Number":"4895","Object Features":"None","trends":["There have been 27 other sightings in Brisbane","There were no other sightings in Brisbane on or around January 31st 1985"],"Object Shape":"Disc","Date Submitted":"01/31/1985 11:30 UTC","City":"Brisbane","Object Flight Path":"Path with directional change","Country":"Australia","Tags":"City","divs":["Sighting DetailsWE WERE IN THE MIDDLE OF BRISBANE CITY, STOPPED AT TRAFFIC LIGHTS, OLD INEBRIATED GUY WAITING FOR CHANGE OF LIGHTS TO GREEN, POINTED UP AND SAID TO NO ONE IN PARTICULAR \"I KNEW THEY WERE UP THERE\" I SAID TO MY HUSBAND WHAT IS HE RAMBLING ON ABOUT, AND THEN EVERYONE (ABOUT 15 OTHER PEOPLE) LOOKED UP AND SAW THE SAME THING, BRIGHT YELLOW ROUND DISC,IT MOVED IN A GRID PATTERN, FORWARD STOPPED, IMAGINE A SQUARE THREE SIDED, THAT IS THE PATTERN IT TOOK, IT LOOKED TO ME LIKE A MAPPING EXERCISE....AFTER ABOUT 7 MOVES, IT ZOOMED OFF...AT A RAPID RATE...I SAID TO MY HUSBAND WHAT THE HECK WAS THAT? HIS ANSWER WELL IT ISN'T ONE OF OURS. WE HAVE NO PROOF OF THIS SIGHTING, AS NOTHING WAS EVER PUBLISHED IN THE MEDIA....MADE ME WONDER WHY, AS IN A DENSE POPULATION OTHERS HAD TO HAVE SEEN THIS, AND WE HAD JUST EXITED A MOVIE THEATRE, SO THERE WERE OTHERS THAT SIGHTED THE SAME THING...EXACT DATES CAN'T REMEMBER, KNOW THE TIME WAS AFTER 11.30PM....THIS IS FACTUAL...AND I'VE NEVER SEEN ANOTHER...IT WAS AWESOME TO SEE, AND HAD OPEN MIND BEFORE, BUT I BELIEVE NOW WE ARE NOT ALONE IN THIS UNIVERSE OF OURS, AM I SCARED...NO...BECAUSE THEY ARE FAR IN ADVANCE TO US, AND SO FAR HAVE LEFT US ALONE, WOULD SAY THEY WATCH US LIKE ANTS IN A NEST...WE MAY EVEN BE RELATED IN A SENSE. I AM FEMALE BORN 7TH MAY 1943...NOONE OF CONSEQUENCE JUST SHARING THIS WITH YOU...ON THE BIBLE..THIS IS FACTUAL."],"files":["/var/www/straped/mufon/html2text/4895.html.txt","/var/www/straped/mufon/org/4895.html"],"Sighting Duration":"Undisclosed","Log Number":"AU-06052006-0004","Date of the Event":"01/31/1985 11:30 UTC","Latitude":"-27.462603","Weather Factors":"Unknown","Longitude":"153.033412","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=-27.462603,+153.033412(4895)&iwloc=A&hl=en\"> mufon case (4895) map </A>"}