{"files":["/var/www/straped/mufon/html2text/48961.html.txt","/var/www/straped/mufon/org/48961.html"],"trends":["There have been 19 other sightings in Elk Grove","There were no other sightings in Elk Grove on or around July 14th 2013"],"Latitude":"38.416079","Longitude":"-121.362448","Summary":"saw two bright star-like objects about 1/2 mile apart move towards ea other, passed closely and slowed then changed spots and hovered at opposite spots","Weather Factors":"Unknown","Log Number":"US-07152013-0008","Disposition":"Unresolved","Case Number":"48961","Tags":"City","Object Features":"Unknown","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.416079,+-121.362448(48961)&iwloc=A&hl=en\"> mufon case (48961) map </A>","Country":"United States","divs":["sighting detailsi went outside in our yard to walk our dogs before putting them to bed. i always star gaze because our sky is usually clear and i love seeing meteorites and shooting stars. i first noticed what i thought was a pretty large \"slow\" shooting star move from south (almost above my house) to east almost directly in line with me and stop. i continued to watch it and it wiggled a bit then went forward just a bit then stopped. i had a feeling like it was looking at me and tried to talk myself out of it. then it started slowly moving toward the north and that's when i saw the second bright light that had been in the northern sky all along start moving toward the first light. i watched as they approached each other and slow as they passed each other almost stopping to hover. they were really close together. they paused just about 5 seconds then continued until they had changed spots with each other. i thought they might be planes and got worried when they headed toward each other. when they stopped at the opposite places i knew they were not planes or stars. i decided to lay down on the patio since my neck was getting stiff so i could watch them. at this point the first light was now in the northern part of the sky and the second one was just slightly to the east of me where the first one originally stopped about 1\\2 mile apart. the two were bright white lights that seemed to flicker and brighten. they were too far up to see any details. i tried to figure out what they were, maybe satelites? then while laying there i felt strange so i quickly got up and went into the house with the dogs. they were still flickering in those spots when i went into the house. total time watching them was about 5 to 8 min i think. i don't know if they are still there but i wasn't going to look! i googled to see if any reports of unusual things or satelites in the sky but haven't found anything."],"City":"Elk Grove","Region":"California","Object Shape":"Star-like, Unknown","Source":"MUFON","Date Submitted":"07/15/2013 02:52 UTC","Date of the Event":"07/14/2013 09:45 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path"}