{"Object Flight Path":"Straight-line path","City":"Columbus","Log Number":"US-07152013-0015","Country":"United States","files":["/var/www/straped/mufon/html2text/48968.html.txt","/var/www/straped/mufon/org/48968.html"],"Summary":"Sighted a hot air balloon like object traveling silently in the night sky from east to west. The object appeared to be a glowing red-orange orb, we thought there was a flame beneath it, which is why we thought it was a hot air balloon.","Date of the Event":"07/14/2013 10:30 UTC","Date Submitted":"07/15/2013 05:29 UTC","Case Number":"48968","Object Shape":"Circle, Fireball, Sphere","Latitude":"39.20379","map":"<A HREF = \"http://maps.google.com/maps?q=39.20379,+-85.91342(48968)&iwloc=A&hl=en\"> mufon case (48968) map </A>","Object Features":"None","divs":["Sighting DetailsOn Sunday, July 14, 2013 a friend and I were taking our dogs for their nightly walk. We typically go around 9 PM after the heat of the day wanes, but last night we got a late start. I left my house at 10:10 PM. I'm sure of this time because, I was using my pedometer on my phone and it records the time. I had paused just after beginning the pedometer to text my friend because I had seen flashes of lightening and wanted to make certain he still wanted to go. Since we didn't know whether the lightening was heat lightening or the precursor to a storm, we decided to go ahead with the walk. Based upon the information on my pedometer, I probably met my friend about 10:20 PM. Since it was so late, we decided to cut the walk short. We were going to take the alley on the west side of the Bartholomew County Public Library, which intersects with 7th street. Just after we entered the alley (at approximately 6th Street), my friend pointed towards the sky and said, \"Look at that.\" We have often talked about the fact that he typically is not very observant, so it was surprising that he had noticed the object in the sky. I glanced to where he was pointing, a bit eastward of the alley that we were standing in. Once again, based upon my calculations from my pedometer, this would have been approximately 10:30 PM Eastern time on Sunday, July 14, 2013. My first thought upon seeing the object was that it was a hot air balloon. However, I was surprised that a hot air balloon was flying at night. My friend and I, both, had the impression that this object was a balloon. However, whereas I thought it was a hot air balloon, he thought it was a helium balloon. The object, orb like, glowed a reddish-orange against the night sky. The reason I thought it was a not air balloon was because it appeared to have a flame beneath it, that glowed a yellowy gold color. Both of us thought that it was the flame that was reflecting up into the object, giving it the reddish-orange color. As the object passed directly overhead, I could see that it did not have the standard gondola that hot air balloons have. It also appeared that it wasn't as big as a hot air balloon in diameter. Years ago when I lived in Florida, I lived in a flight path for hot air balloons. I watched several pass over my house almost on a regular basis. Although I couldn't determine just how high up this object was, what I was aware of, was that from the distinction that we could see, that it would have been close enough that I could have heard the flame of the fire going into the balloon, if it had been a hot air balloon. Besides, having watched so many hot air balloons pass over, I knew that they don't have the fire burning all the time, but that the flame is shot up in spurts as needed. This object was traveling across the sky at a very level pattern. As, I said, I don't know how high the object was, but it was below the cloud bank. The other thing that I noticed was that although we watched this object for 5 - 10 minutes, that it was traveling at a much quicker speed than what a hot air balloon travels, typically. But it was certainly not as fast as what an airplane would travel, nor did this object in any way resemble an airplane. My friend's initial impression was that it was a large helium balloon with a flame beneath it. So, individually, we both had the impression that this object was balloon shaped and we both had the impression that it had a flame beneath it. However, the flame was directly beneath it, like a hot air balloon, and this object was traveling across the sky from east to west-northwest. We watched it until for some time, until we lost it on the horizon in the distance. I knew that we had seen something out of the ordinary, as in not an airplane or any other typical object we would see traveling in the night sky. Upon arriving home at 10:45, I immediately began searching the Internet to see if anyone else had seen the object. I \"googled\" various websites, and checked all of the local news outlets, to no avail. At this point, I am unable to find any other mention of a sighting of this object."],"Region":"Indiana","Tags":"City","Disposition":"Unresolved","Weather Factors":"Unknown","Viewing Distance":"Unknown","Longitude":"-85.91342","trends":["There have been 14 other sightings in Columbus","There were no other sightings in Columbus on or around July 14th 2013"],"Source":"MUFON","Sighting Duration":"Undisclosed"}