{"City":"Xenia","Case Number":"48960","trends":["There have been 6 other sightings in Xenia","There were no other sightings in Xenia on or around July 14th 2013"],"Date Submitted":"07/15/2013 01:43 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.681315,+-83.917123(48960)&iwloc=A&hl=en\"> mufon case (48960) map </A>","Summary":"Saw 10-12 sauser about 30' wide yellow red lights pulsating at about 3000 ft. Headed to wright pattrick AFB at dusk 50mph. I swear!","Sighting Duration":"00:07:00","Country":"United States","Region":"Ohio","Longitude":"-83.917123","divs":["Sighting DetailsThis evening around dusk I was walking my dogs and looked up and saw an object over a building coming from the southeast just under the cloud cover that was broken coverage. Then there were more coming over at various levels most under the clouds but some above. They were in a loose group about a mile long from first to last going only about 50 miles an hour. There was no sound at all. I was mesmerized by this as they were headed directly toward wright patterson AFB about ten miles from my house. I observed craft with multiple glowing areas as i would not say lights because they were diffused. There were about 8 or so of these under each of the craft. They were too far away for me to get any more than able to say i saw these were real solid craft and not just lights in the sky. I watched them for several minutes until the cloud cover and haze obscured them from view as they were probably about five miles away from me again headed in a direct line towards wright-patt. I have seen a couple of events in the seven years i have lived in the xenia ohio area. None were this close and this many as i just had to report this sighting. I was an avionics tech in the navy and have an extensive knowledge of aircraft and also of flight observation. Meaning that these craft were clearly seen by me. They were close enough to say they were solid objects and not reflections on the bottoms of clouds. They arent swamp gas and i dont B. S. about something this serious. Im concerned very much by this sighting because of where they were headed the low altitude and speed they were going. I could only say with being in such close proxcimity to several civilian and military bases i conclude they were in an approach pattern to wright patt. Your guess is as good as mine as to who they are or what they are doing here. Sincerly submitted today."],"files":["/var/www/straped/mufon/html2text/48960.html.txt","/var/www/straped/mufon/org/48960.html"],"Latitude":"39.681315","Weather Factors":"Unknown","Source":"MUFON","Date of the Event":"07/14/2013 09:45 UTC","Log Number":"US-07152013-0007","Object Shape":"Circle, Disc","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Tags":"City","Object Features":"Other, Unknown","Object Flight Path":"Straight-line path"}