{"Object Flight Path":"Stationary","Summary":"Big, Bright, Orange Perfect Triangle That got smaller then dissappeared","Country":"United States","divs":["Sighting DetailsI was on the computer, my boyfriend was going towards the backyard to light a fire..He came to a stop when he saw a big, bright triangle in the sky. At first he thought it was a fire in the distance, but realized it was up in the sky. He dropped what he was holding and ran into the house to get me, He told me to come see this \"big orange triangle\" in the sky..When I got outside It WAS still there, there were tree's in the way at first so I had to try to get a visual. Then I saw what he told me about, a big, bright orange triangle..He told me it had gotten smaller since he was outside and then while I was watching it, it got smaller, seemed more like a circle but it might be because it was disappearing off in the distance. We both felt very creeped out, because we couldn't think of a single explination. We stood there for a few minutes and we both saw a huge shooting star (meteor), and then watched a plane flying in the opposite direction. What we saw was definitely unexplainable, and was not an air plane, a star, or a helicopter."],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.745963,+-75.515125(48975)&iwloc=A&hl=en\"> mufon case (48975) map </A>","City":"Earlville","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Object Features":"Unknown","Region":"New York","Disposition":"Unresolved","Tags":"City","Longitude":"-75.515125","Date of the Event":"07/15/2013 12:00 UTC","Object Shape":"Triangle","Latitude":"42.745963","Weather Factors":"Unknown","Log Number":"US-07162013-0001","trends":["There have been 2 other sightings in Earlville","There were no other sightings in Earlville on or around July 15th 2013"],"files":["/var/www/straped/mufon/html2text/48975.html.txt","/var/www/straped/mufon/org/48975.html"],"Date Submitted":"07/16/2013 01:17 UTC","Case Number":"48975"}