{"Disposition":"Unresolved","divs":["Sighting DetailsMy friend and I were walking north on Broad St. and turned left on East Front Street (heading west). We noticed 3 bright lights in the sky to our right (north). We then walked right on Boat Club Court to walk north to get closer to the objects, stopping at the intersection of Boat Club Court and Union Street to take out my IPhone. I took one photo and one video of 3 bright lights over and beyond the Navesink River, in a north-northeast direction. The lights hovered and wobbled in the distance; they moved together in a path, and one-by-one vanished. Then another bright light appeared through the clouds, followed the same path as the 3 before it, and then also vanished. About 4 minutes later, about 2 jets (with contrail and blinking lights) flew past from west to east in the area where the bright lights had been. Then we noticed what we thought was a helicopter (blinking lights and hovered) in the distance, also near where the bright objects appeared."],"Object Shape":"Sphere, Star-like","Case Number":"48971","map":"<A HREF = \"http://maps.google.com/maps?q=40.352613,+-74.066642(48971)&iwloc=A&hl=en\"> mufon case (48971) map </A>","Longitude":"-74.066642","Log Number":"US-07152013-0018","Object Features":"None","Latitude":"40.352613","Object Flight Path":"Hovering then path","Viewing Distance":"Over One Mile","Summary":"viewed 3 bright lights facing north-east over Navesink river; stationary, then moved, then disappeared","Country":"United States","Source":"MUFON","Date Submitted":"07/15/2013 09:53 UTC","Sighting Duration":"Undisclosed","Region":"New Jersey","Date of the Event":"07/13/2013 09:11 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/48971.html.txt","/var/www/straped/mufon/more/48971_submitter_file1__IMG0801.JPG","/var/www/straped/mufon/org/48971.html"],"trends":["There have been 3 other sightings in Red Bank","There were no other sightings in Red Bank on or around July 13th 2013","This sighting has never been favorited.",""],"City":"Red Bank","Weather Factors":"Unknown"}