{"Region":"California","trends":[],"Viewing Distance":"Over One Mile","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=36.785611,+-119.409952(48977)&iwloc=A&hl=en\"> mufon case (48977) map </A>","Country":"United States","Latitude":"36.785611","Object Shape":"Circle, Sphere","City":"Undisclosed","Date of the Event":"07/16/2013 11:56 UTC","Object Flight Path":"Stationary,Path with directional change","Tags":"City","Log Number":"US-07162013-0003","Sighting Duration":"Undisclosed","Source":"MUFON","Disposition":"Unresolved","Longitude":"-119.409952","Case Number":"48977","divs":["Sighting DetailsI live near Disneyland and while I was going out to roll up my car windows, I looked east towards Santiago college right along Chapman Ave. I looked around because it was so quiet and not a plane in the sky. that's when I noticed a very bright blue green ball of light I thought was a meteor or something traveling parallel to the horizon. But it sped up and stopped on a dime without slowing down just laser fast to zero in a blink of an eye, then accelerate like no kind of terrestrial craft even dreamed of yet...much less manufactured. It hovered for about 10 sec wiggling left right up down then it flew up at about a 45' angle then dropped back at the opposite angle toward the ground and stopped again and moved left to right slowly and instantly dropped yet again at an amazing burst of speed and stopped again for about 5 sec. finally looping back south toward the ground and out of my sight. The way it made deliberate turns stops accelerated, decelerated, flew forward and backwards with pin ball maneuvers is evident it is not an organic ball of ice, iron, rock ricocheting around our airspace, nor is it an earthly aircraft. That craft was under intelligent control, possibly remotely, possibly internally, who knows! Like I said the skies were so strangely vacant at that time and what ever that was had the spot light at center stage and wasn't trying to hide. C'mon people someone out either looking towards Trabuco canyon or living there had to see this too. Where ya at. No you're not losing it that was the real deal."],"Date Submitted":"07/16/2013 04:03 UTC","Summary":"bright turquoise ball traveled south to north from 22frwy & 57 ascened quickly zig zagged bursted forward then dropped like a rock and stopped in mid air went up then down like a pin ball & rt then lft","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/48977.html.txt","/var/www/straped/mufon/org/48977.html"]}