{"Object Shape":"Cigar, Cylinder","map":"<A HREF = \"http://maps.google.com/maps?q=37.230538,+-80.180928(48974)&iwloc=A&hl=en\"> mufon case (48974) map </A>","Log Number":"US-07152013-0021","Country":"United States","Region":"Virginia","Sighting Duration":"Undisclosed","Date Submitted":"07/15/2013 11:13 UTC","Case Number":"48974","Summary":"Thought it was two airplanes flying in sequence side by side, then it turned and it looked like a cylinder, it was huge, when it turned the lights went from side by side to front to back","trends":["There has been one other sighting in Elliston","There were no other sightings in Elliston on or around July 15th 2013"],"Object Features":"Unknown","Weather Factors":"Unknown","Viewing Distance":"Unknown","Latitude":"37.230538","Source":"MUFON","Longitude":"-80.180928","divs":["Sighting DetailsI walked outside to check on my hound dog who was barking, after checking on him I was looking up at the stars and moon. I noticed right above me in the north sky it looked like to airplanes flying side by side in sequence, the reason that I thought this was, the lights looked like normal airplane lights at first. I thought man that is a big plane, then I thought well that is two planes flying together. Then as it passed over, the lights turned a different direction, from N to NW, but when they turned, they turned together like a solid object, and went from being side by side to one set of flashing lights in the front and another set in the back, that is when I really could see a little detail of something connecting the two sets of flashing lights, it looked like a cylinder, it was dark out, but the moonlight helped a lot. The lights at first, like I stated before were flashing the normal airplane colors, but when it turned they started flashing blue, white, gold, read, orange, green, the blue, then white. It was very strange, and very large. Airplanes fly over my home every day and night, and I have never seen anything as big, nor with the colors of light, and with the shape that it appeared to have. I witnessed this from about 5 to 7 minutes, until it kept its NW direction and got out of my sight, the last thing I saw was a white pulsating light in the distance."],"Date of the Event":"07/15/2013 10:04 UTC","files":["/var/www/straped/mufon/html2text/48974.html.txt","/var/www/straped/mufon/org/48974.html"],"Disposition":"Unresolved","Tags":"City","Object Flight Path":"Path with directional change","City":"Elliston"}