{"Object Shape":"Other","Log Number":"US-07162013-0007","map":"<A HREF = \"http://maps.google.com/maps?q=37.779179,+-97.467267(48982)&iwloc=A&hl=en\"> mufon case (48982) map </A>","divs":["Sighting DetailsSunday July 14, 2013 - 9:00-9:15 P.M. WSW direction about 50deg azimuth my wife was out at the store and when she came home, she was running into the house and very excited. she told me there was something out by the moon that she had never seen before. when i went out to look, i saw a green, almost \"T\" shaped object floating around the moon. it looked like it was between me and the moon but stayed close to the moonlight. i would say it was at least 5 miles away, maybe more. it floated around the moon going in counterclockwise cirlces for about 2-3 minutes and i was able to snap a couple of pictures with my phone. after about 4 minutes though it began its departure. it shot south and up and then north and up in a zig zag pattern and then it was gone. it did not accelarate at an unbelievable rate but it was faster than anything i have ever seen. and i live in the air capitol! once i saw it start leaving i ran inside to grab my good camera (my wife is a professional photographer) that would have been much better than my phone. i watched the skies for about another hour afterwards but saw nothing else except a few airplanes pass by. again, i live in an area with a lot of airplane traffic, these were nothing out of the ordianry. i have the pictures i took on my phone and i have the negatives to prove they werent photoshopped. i have played with some editing software a bit to try and clear the pictures up but the phone's camera severely limited me. i made some crops so the entity could be seen better. i also have the originals."],"Summary":"green \"T\" shaped entity seen near moon","Sighting Duration":"00:04:00","Country":"United States","files":["/var/www/straped/mufon/html2text/48982.html.txt","/var/www/straped/mufon/org/48982.html"],"Case Number":"48982","Latitude":"37.779179","Object Flight Path":"Other","Date of the Event":"07/14/2013 09:15 UTC","trends":["There has been one other sighting in Maize","There were no other sightings in Maize on or around July 14th 2013"],"Object Features":"Unknown","Disposition":"Unresolved","Tags":"City","Source":"MUFON","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Longitude":"-97.467267","City":"Maize","Date Submitted":"07/16/2013 09:54 UTC","Region":"Kansas"}