{"Case Number":"48984","map":"<A HREF = \"http://maps.google.com/maps?q=28.19331,+-82.729645(48984)&iwloc=A&hl=en\"> mufon case (48984) map </A>","Tags":"City","Date of the Event":"07/04/2013 10:30 UTC","trends":["There have been 12 other sightings in Holiday","There were 4 other sightings in Holiday on or around July 4th 2013"],"Viewing Distance":"21-100 Feet, 101-500 Feet, Unknown","Latitude":"28.19331","files":["/var/www/straped/mufon/html2text/48984.html.txt","/var/www/straped/mufon/org/48984.html"],"Region":"Florida","Date Submitted":"07/16/2013 12:34 UTC","Source":"MUFON","Country":"United States","Longitude":"-82.729645","divs":["sighting detailsjuly 4, 2013, between 10:30-11 pm i was sitting outside facing north w my boyfriend when i saw something bright or burning descending towards us. at first glance i thought it was an ember from fireworks falling because it was so bright but it wasn't falling, rather it was hovering slowly from east to west. it seemed to descend closer to us and move even more slowly to the west. we were debating what it could be. the only thing i'm familiar w that could fly like that is a helicopter. it had been cloudy\\rainy off\\on all day so we were wondering aloud if it was a helicopter with its searchlight turned on but obscured by clouds. even while speculating we knew it was unlike any helo or aircraft we've seen before. it was completely silent. in simplest terms it was like a ball of fire in the sky that randomly varied in brightness and color. it didn't have defined edges rather it was hazy or diffuse. i kept thinking that as it seemed to descend lower (and glow brighter orange) it would be more discernible but the closer it got it seemed more blurry. it seemed to follow an east to west course. at its closest though (maybe 100 feet? hard to judge distance and size) it looked like the fire\\glow seemed to emit upwards from a flat bottom (saucer shaped?); the fireball looked more dome shaped closer. i couldn't discern a flat bottom but only briefly it did appear the light wasn't emitting downwards due to some straight line boundary. when it was further away it seemed round\\oval and the light appeared to emit\\radiate evenly in all directions) it moved so slowly and at first stayed as low or lower than a helo would fly. we observed it for a few minutes feeling mostly in awe and a little frightened. i went in to get my teenage daughter and her friend and a camera or phone (bf stayed outside). even though this took maybe one minute by the time i got back outside it had travelled a good distance away (a mile or more maybe) & while the girls saw the bright, flickering light that moved oddly (directional maneuvers like a helicopter but faster than a jet when it left) it was too far away when they came out to be as stunned as my boyfriend and i were. as it left it appeared to be heading from east to west then arced to the northwest and ascended at an amazing rate of speed. we were sober btw. i am so glad my bf saw it too, because he is very practical and would never believe it had he not seen it himself. i have no idea the size of this thing but if i had to guess i'd say it was probably smaller than a helo."],"Object Flight Path":"Hovering then path","Object Features":"Dome, Unknown","City":"Holiday","Log Number":"US-07162013-0010","Object Shape":"Disc, Fireball, Oval, Sphere, Star-like","Summary":"Saw orb (fireball) in sky July 4, 2013, red/orange/white changed colors and varied in brightness/intensity, approached very slowly and silently, NO NOISE, left very quickly","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Disposition":"Unresolved"}