{"Country":"United States","City":"Greenwood Village","Date of the Event":"07/15/2013 09:12 UTC","Sighting Duration":"00:03:30","Region":"Colorado","Case Number":"48996","Disposition":"Unresolved","Weather Factors":"Unknown","trends":["There have been 2 other sightings in Greenwood Village","There were no other sightings in Greenwood Village on or around July 15th 2013"],"Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Object Shape":"Disc","Summary":"Disc shaped, glowing craft quickly came towards location then hovered back and forth before it left.","Longitude":"-104.894955","map":"<A HREF = \"http://maps.google.com/maps?q=39.600805,+-104.894955(48996)&iwloc=A&hl=en\"> mufon case (48996) map </A>","Source":"MUFON","Log Number":"US-07162013-0022","Latitude":"39.600805","files":["/var/www/straped/mufon/html2text/48996.html.txt","/var/www/straped/mufon/org/48996.html"],"Object Features":"Dome","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsOn July 15th 2013, a little after 9pm, at a concert at Fiddler's Green, with my husband, I noticed an object traveling very fast towards the venue from the Northwest. There had been several airplanes flying overhead occasionally, however, this did not look or move like a plane or a helicopter. Right after I noticed it, the craft slowed down and hovered for a few seconds, then it circled around back and forth on the West side of Fiddler's Green. I immediately thought it was something odd and turned my husbands attention to it so he could tell me what he thought. He also thought it was something odd, and not just a plane or helicopter. We had never seen anything identifiable move in all directions like that. When it was at it's closest point to us we could both clearly see it's green, blue, red and white lights pulsating and definitely saw it spinning. You can hear me say it in the video. I started recording after viewing it for about a minute and a half. The object seemed curious, as if it were scouting the area, particularly the venue we were at. After circling a couple of times it headed back Northwest out of our sight. I couldn't decide if it was something military or something \"not of this world\". I have been very interested in unexplained phenomenon for many years, so I have been excited and curious to find out what it is we actually witnessed, and if anyone else witnessed it. I was completely sober, unlike many of the people there at the concert, so my vision and perception of what I saw was definitely clear."],"Date Submitted":"07/16/2013 09:12 UTC","Tags":"City"}