{"Weather Factors":"Unknown","Country":"Canada","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Region":"British Columbia","Date of the Event":"05/24/2012 06:30 UTC","Object Flight Path":"Path with directional change,Path then hovering","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=49.086195,+-122.426001(48991)&iwloc=A&hl=en\"> mufon case (48991) map </A>","files":["/var/www/straped/mufon/html2text/48991.html.txt","/var/www/straped/mufon/org/48991.html"],"trends":["There have been 3 other sightings in Abbotsford","There were no other sightings in Abbotsford on or around May 24th 2012"],"Tags":"City","Source":"MUFON","Date Submitted":"07/16/2013 04:01 UTC","Summary":"I apologize for the blurriness however the objects where at around 20,000' to 25,000' or about 25 miles straight up. And I was so excited and so shaky.","divs":["Sighting DetailsThese are a few photos viewed from my backyard at around 6:30pm. My wife and I both witnessed around 9 UFO,s over a 5 min period then they just decided they had finished whatever it was they were doing, and as quickly as they appeared they disappeared! They were moving in all directions, stopping and then continuing in opposite directions. Absolutely no sounds heard. Then they would light up from red, then change to white in no real pattern. You have to realize how far away these are. I was watching the sky and noticed two of them go in front of the daytime moon, then my wife came out. I yelled at her to grab the camera and tripod so she did. And to notice them in broad daylight because of the lights on them, they must have been very bright. If you look under all of them it looks like some kind of exhaust or propulsion coming from them. My wife was a skeptic but I can truly say she isn't anymore. The last photo is the vessel shape. You need to know that they appeared as a bright little star to the naked eye then when they all appeared they were flashing bright red and white colors and moving up down and sideways with very sharp and decisive moves. The fourth photo was taken with my cannon 300x zoom then computer zoomed 1000x's more. You see these objects were about 22miles straight up...."],"Latitude":"49.086195","Log Number":"CA-07162013-0017","Case Number":"48991","City":"Abbotsford","Longitude":"-122.426001","Object Shape":"Bullet, Missile, Other","Object Features":"Other"}