{"Date of the Event":"10/21/1974 07:10 UTC","Sighting Duration":"Undisclosed","Log Number":"US-07162013-0021","Source":"MUFON","Date Submitted":"07/16/2013 09:14 UTC","files":["/var/www/straped/mufon/html2text/48995.html.txt","/var/www/straped/mufon/org/48995.html"],"Viewing Distance":"20 Feet or Less","Object Features":"Unknown","Country":"United States","City":"St. Charles","Tags":"City","Disposition":"Unresolved","divs":["Sighting DetailsI had two abductions. One in 1974 and the other in East Texas 1996. I know 1974 was long ago, but I didn't want people to think I was crazy and have held this inside for many years and only now feel like I can tell. I was 26, married, had 4 children. It was about 7pm, dark, winter time, I was driving home and felt like someone was watching me. I couldn't shake the feeling. I had to calm myself down. And then, I was at home. That confused me. I went on to bed that night, not remembering the fear I had earlier of someone following me. Suddenly, I was awake and staring into the big black eyes of a creature, standing on my right side. His arms were long and he was just skinny and a grey appearance. I tried to scream, but couldn't. Nor could I move. I could see my husband sleeping in my peripheral view. As I said, the creature was at my right side, and three others, much smaller standing at the foot of the bed. I felt like the one at my right, was some kind of instructor and the three were learning from him. They seemed a little afraid of me and huddled close. Then the one close to me spoke to my mind and I understood his thoughts. He said, \"I won't hurt you, and you won't ever remember this.\" Then, he took an instrument like a pen with a light and touched my upper groin area. It was then, I remember being naked. And as he ran this pen object down from my groin, and down my upper thigh, I started screaming from the pain, only no sounds were coming out. I screamed for my husband to wake up and help me. It felt like the object was pulling all of my tissue out of my leg, extracting everything away. He took the object to my right above my knee and pulled it away. He was right, the next morning, I remembered nothing. But I started having nightmares. They were all the same; a huge black spider coming down his web from the ceiling to hurt me. I would jump out of bed, screaming, and take whatever object that was near me and start swinging, screaming, \"get away from me!\" My husband, of course, would wake up and try to to calm me down. He was clearly shaken by this strange behavior of mine. It frightened him. After the third nightmare, and reaction to it being the same; I then remembered. I was terrified, and worried that if I told my husband he would think I went insane. So I said nothing. After remembering, the nightmares ended. The second one was when I lived in East Texas. I was 48. I was at home alone asleep. My husband a truck driver was gone. I woke up and saw flashing red, yellow, blue, green lights in a circled pattern in my front yard. I was watching them from my bed. The pattern seemed to be going around a dark disk shape. Suddenly, I wasn't in my bed anymore but on a steel oblong table. The same grey (instructor I'll call him) spoke to me telepathically, \"I won't hurt you.\" I spoke back telepathically, \"that's what you said to me the last time. You lied.\" There were other greys around the table 4-5 watching. He took out an instrument and ran it slowly over my brain like doing a massage. It was shaped like a pen also with a light. As he moved the pen to different areas of my brain, the sensation was so euphoric, I really didn't want him to stop. I never experienced such sensation. Then when he was done, he spoke again, \"See, I told you so.\" And as odd as it seemed, it looked like he was pleased in my response. And strangely, as well, I wasn't afraid any more of him. My first two husbands passed away without me telling about this. My third husband I told, but he just can't believe it. There is a friend who found out about my story, and he was ecstatic. He also is a believer and had several visitations. It felt so good to be around other people who have experienced an encounter with aliens. I have no proof except I have osteoporosis, had 3 hip replacements. The right hip had to have another one only three years later. The doctor said, I just didn't have enough bone. I wonder if it wasn't from the first abduction on my right leg. I wish I had more evidence. If I get to meet this instructor again, I feel in my inner being, he would let me ask questions. But thanks for being out there for all of us who have had the experience. It is such a relief, to know we are not crazy. ps my occupation: Retired register nurse."],"map":"<A HREF = \"http://maps.google.com/maps?q=38.793198,+-90.507464(48995)&iwloc=A&hl=en\"> mufon case (48995) map </A>","Weather Factors":"Unknown","Object Flight Path":"Unknown","Case Number":"48995","trends":["There have been 3 other sightings in St. Charles","There were no other sightings in St. Charles on or around October 21st 1974"],"Latitude":"38.793198","Summary":"extracting substance (bone marrow?) from my right groin area and thigh","Region":"Missouri","Longitude":"-90.507464","Object Shape":"Disc"}