{"trends":["There have been 6 other sightings in Aztec","There were no other sightings in Aztec on or around August 27th 1997"],"Object Shape":"Circle","Weather Factors":"Unknown","Longitude":"-108.046504","Date Submitted":"07/17/2013 11:56 UTC","Latitude":"36.894445","Region":"New Mexico","Viewing Distance":"N/A","Object Features":"Other","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=36.894445,+-108.046504(49006)&iwloc=A&hl=en\"> mufon case (49006) map </A>","files":["/var/www/straped/mufon/html2text/49006.html.txt","/var/www/straped/mufon/org/49006.html"],"Summary":"August 27th 1997 Aztec NM","Sighting Duration":"Undisclosed","Country":"United States","Date of the Event":"08/27/1997 12:00 UTC","divs":["Sighting DetailsApproximately between 11pm and 4am. Awakened by the dog at approx 11pm or 12am checken on animal for water, food, condition. Animal was ok and satisfied. went back to bed, back to sleep... 30 to 45 min maybe longer awakened by the dog again, sounded distressed and yelping. Went back outside and checked to see if dog was bothered by something. Looked around and saw strobing lights approximately 3 miles NE of property. Got binoculars and looked, retrieved, child, dog and keys to vehicle and drove into town to the nearest location or approximate location for a closer look. Found above a water tower just out of town near the back side of the high school ... looked again in binoculars to large to determine size had a smaller attachment to it and we became scared and tried to hurry out off the bluff but the road had been rutted out by water washing off the bluff. once off the bluff drove back out of town to residence, let the dog out and it ran away, never saw the dog again. arrival time was approximated 330am to 4am loss track of time. next morning friend arrived at the home and told us there had been a UFO siting and I told her we saw it, we had a contact with it. Didnt report it because it seemed like it was normal and not important to anyone but us. Later I attempted to find out if there had been other instances of other 1997 sightings. Emailed Roswell and it was unimportant to them. Saw a show on Larry King Cnn and got the mans name who stated there was a sighting in Arizona and contacted him by email and the return email seemed unimpoartant to them.... I let it go untill I began to experience harassing events approximately 2009, began with a property purchase and my dogs being poisoned , my PC stolen various other torments. Called about the Aztec research by Mr. Ramsey and I was directed to report it online. have tried to search it out myself and I am not getting any responce. MHMR thinks I am crazy and I need medication because of my intuitive information that happenes to me. Dont know what else to do! Followed the trail as far as I can alone, need help!"],"Object Flight Path":"Stationary","Source":"MUFON","Log Number":"US-07172013-0007","Case Number":"49006","City":"Aztec","Disposition":"Unresolved"}