{"Date of the Event":"06/15/2013 10:00 UTC","Object Flight Path":"Path with directional change","Object Shape":"Fireball, Other","Longitude":"-122.473334","Sighting Duration":"00:01:45","Region":"Washington","Date Submitted":"07/17/2013 08:01 UTC","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=48.756727,+-122.473334(49003)&iwloc=A&hl=en\"> mufon case (49003) map </A>","Latitude":"48.756727","Country":"United States","Object Features":"Patterned Surface","files":["/var/www/straped/mufon/html2text/49003.html.txt","/var/www/straped/mufon/org/49003.html"],"Summary":"Saw descending red glowing orb. Light went out and revealed a gray metallic craft (see sketch) that came down in front of us and rotated around to turn right and then left as it descended behind trees and possibly landed.","Source":"MUFON","Log Number":"US-07172013-0006","City":"Bellingham","divs":["Sighting Details At about 10PM I was driving down a road in the middle of Bellingham, WA towards the I-5 on-ramp when I saw a red orb light that was about 5 times bigger than a star in the southern sky, off to my left. I turned left and immediately pulled off the road and jumped out of the car and quickly grabbed my binoculars out of the trunk and viewed the red orb light as it got very small and went out. There was a medium gray colored looking craft where the light had been. It silently descended quickly to almost right in front of me, directly above (60 - 100 ft) the road. It slowed at this point to rotate around. I had a great view of it. It was textured metal looking with a larger rounded front and a square rear area where two exhaust engine holes were (see sketch). It was about the size of a large tall SUV but not an extended length. I didn't see any windows or insignia, nor even tiny lights. For a second there I felt some concern we might be it's target but then it turned east over a building, into the back parking area and then north as it dropped below the tree line. It knew precisely where it wanted to go. With extreme precision it manuvered itself down and executed perfect turns avoiding electrical poles, wires and street lights. It was very stealth. It also timed it's descent to when the traffic was very light. We don't recall anybody driving past us while we watched it. As it descended, it pretty much followed the road as it descended from the southern sky heading north. After the UFO descended behind the trees, we drove around searching for it but didn't find it. It didn't occur to us to drive into that building's parking lot. I went back 4 days later and drove into that parking lot during the daytime and discovered some woods were located where the UFO appeared to go. I found a small clearing where it could have hid out of sight. I also took photos of the field where the grass was mashed down and blown around some. I don't know that the UFO mashed the grass. The mashed down grass looked a little yellowed. It could be that deer slept there. I did not see any deer. I talked to a couple of neighbors in the area and one thought it might have been that night that their tv power or reception flickered a bit."],"Case Number":"49003","Viewing Distance":"21-100 Feet","Tags":"City","trends":["There have been 27 other sightings in Bellingham","There were 2 other sightings in Bellingham on or around June 15th 2013"],"Weather Factors":"Unknown"}