{"Case Number":"49015","Latitude":"42.152747","Viewing Distance":"21-100 Feet","Tags":"City","Sighting Duration":"00:02:00","Region":"Massachusetts","Object Flight Path":"Hovering then path","Disposition":"Unresolved","Date Submitted":"07/18/2013 01:06 UTC","Date of the Event":"07/17/2013 10:00 UTC","Object Features":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.152747,+-72.488197(49015)&iwloc=A&hl=en\"> mufon case (49015) map </A>","trends":["There have been 21 other sightings in Springfield","There was one other sighting in Springfield on or around July 17th 2013"],"Longitude":"-72.488197","City":"Springfield","Log Number":"US-07182013-0002","Summary":"red, glowing, circular in shape","divs":["Sighting DetailsMy boyfriend and I were standing outside of his car in a small parking lot, around 10:00 pm in Springfield MA on July 17, 2013, when something strange caught my eye. It appeared to be fairly low in the sky but still high enough so that I was unable tell if it was something out of the ordinary until it descended more. I first witnessed it about 100 feet above the ground. From where i was standing I first spotted it in the upper right portion of the sky. I'm unsure which direction (north, south, east, or west). We thought it was an airplane at first but there were no flashing lights, just a glowing, solid, red, round object. I could tell it was not on fire. There were absolutely no clouds in sight. It slowly moved across the sky, descending toward the ground from right to left. It made no noise at all. It seemed only about 15 to 20 feet away from the ground when it was closest. The red color then completely faded, leaving the same small shape only it appeared to be a very light gray color and was almost transparent. The color reminded me of how the moon looks in the middle of the day. It from right to left in a descending motion. I witnessed it for approximately 2 minutes before it completely vanished. and I have never seen anything like it in my life. I didn't fear it, I was just interested in knowing what it possibly could have been. I provided an image from the internet that is remarkably similar to what we witnessed."],"Source":"MUFON","Object Shape":"Circle, Fireball, Oval, Sphere","files":["/var/www/straped/mufon/html2text/49015.html.txt","/var/www/straped/mufon/org/49015.html"],"Weather Factors":"Unknown"}