{"Latitude":"42.731765","Source":"MUFON","trends":["There have been 7 other sightings in Iowa City","There were no other sightings in Iowa City on or around July 17th 2013"],"Object Shape":"Triangle","Viewing Distance":"101-500 Feet","Region":"Iowa","Disposition":"Unresolved","Tags":"City","Date of the Event":"07/17/2013 10:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.731765,+-93.647734(49017)&iwloc=A&hl=en\"> mufon case (49017) map </A>","Weather Factors":"Unknown","divs":["Sighting DetailsI was driving to work on my scooter(moped) from eastern side of Iowa City, headed to western part of Iowa City, I was on East Burlington Street headed west, right after I passed through the intersection of South Gilbet and East Burlington, I noticed what seemed to be some lights above me, as I drive this road every day It seemed a little odd. When I looked up I was just in peer shock!!! There was a VERY LARGE craft above me, it blocked out all stars and a majority of the night sky. The object looked as though it was hovering at first, however, as I continued on East Burlington in a west direction I came to a red stop light at Linn Street, that's when I got a superb look at it. Being on my scooter I had a NON obstructed view of the craft, the craft wasn't hovering, it was moving very, very slowly SE at no more than 1-5 knots. THERE WAS NO SOUND WHAT SO EVER! The lights on the craft where interesting, there where 2 lights, one was a pink to red to white light, the other was a blue to green to white light. The lights where slowly changing like Christmas tree lights. The craft was a triangle shape in dark color, I cant say it was black necessarily but it was very dark (it was night). I unfortunately was already late to work and could not take a photo. How ever I did observe the craft as I continued to work until buildings obstructed my view, this sighting from start to end was roughly 5-10 minutes. I grew up next Moffitt Air Field in Mountain View, Ca, where I have seen everything from the Space Shuttle (NASA is on Moffitt) to Stealth Bombers (prior to being announced to the public) landing at Moffitt before I was even 12 years old. My step-dad also worked at Aimes Research Center (He was a robotics engineer) at Moffitt, and I was in the Navy and and worked for NATO. I have been stationed in Iceland, Meridian, Norfolk, just to name a few. I was ALWAYS on a naval air station, I am very proficient in air craft for obvious reasons, and I have never seen any thing like this, EVER!!"],"City":"Iowa City","Log Number":"US-07182013-0004","Object Flight Path":"Stationary,Hovering then path,Other","Date Submitted":"07/18/2013 02:14 UTC","files":["/var/www/straped/mufon/html2text/49017.html.txt","/var/www/straped/mufon/org/49017.html"],"Country":"United States","Case Number":"49017","Object Features":"Unknown","Sighting Duration":"00:10:00","Summary":"Craft Moving at very slow rate, maybe 5 knots in SE direction above downtown Iowa City","Longitude":"-93.647734"}