{"Object Features":"None","City":"Tulsa","Country":"United States","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was in my living room with my wife and daughter. We was watching television. all of the sudden we heard a very loud jet or big helicopter outside, it was so loud that I thought maybe a plane was going to crash into the neighborhood, my daughter and I ran outside to see what it was. the trees were obstructing my vision , I could not see the aircraft but it was definitely something military. I was about to go in the house and noticed approx 5 - 10 glittering lights on the horizon spaced out , I could see them through the trees. I was mesmerized, I noticed a star over the tree tops that was flashing red, blue, yellow, white, I assumed it was a satellite, but the flashing lights on the horizon were moving , some were stationary. we then went up to our 2nd floor balcony to get a better view, by then there was my 2 daughters, my son and his friend , my wife and my self on the balcony. then the lights started flying over head, they were very faint. we would randomly see them all over the sky. they would fly in a straight path. one of them was flying over head then it got very bright then dimmed out and disappeared, we watched it for about 10 - 15 seconds. at one point it looked like one came off of another and turned into 2 . there was not flashing lights on any of them. several times we would see commercial aircraft fly over like normal. these objects were much higher up than the commercial airplanes. we all woke up still thinking about it. I had chills, it was awesome!"],"Longitude":"-95.988415","Latitude":"36.156342","map":"<A HREF = \"http://maps.google.com/maps?q=36.156342,+-95.988415(49029)&iwloc=A&hl=en\"> mufon case (49029) map </A>","Date Submitted":"07/18/2013 02:11 UTC","Log Number":"US-07182013-0016","Summary":"heard a very loud jet or chopper , went outside saw sparkles on the horizon, then several silent objects overhead.","Case Number":"49029","Region":"Oklahoma","Tags":"City","Object Shape":"Circle, Unknown","Disposition":"Unresolved","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Source":"MUFON","files":["/var/www/straped/mufon/html2text/49029.html.txt","/var/www/straped/mufon/org/49029.html"],"Date of the Event":"07/17/2013 08:30 UTC","trends":["There have been 59 other sightings in Tulsa","There was one other sighting in Tulsa on or around July 17th 2013"],"Object Flight Path":"Hovering then path,Straight-line path"}