{"Viewing Distance":"20 Feet or Less","Summary":"I did not witness the initial sighting as I was asleep in the car.","Object Flight Path":"Stationary","Log Number":"US-07182013-0022","Object Features":"None","divs":["Sighting DetailsIn 1963, my family was driving from Memphis to Mesa. I was only 18 months but my mother talked frequently of the time my father saw lights that he could not identify. He was in the Army, ultimately becoming a Green Beret. That was all that was ever said while my father was alive. After his death in 2002, my mother began telling more of the story. The light flew right over the car. My father was suddenly driving on a different highway. It was two hours later than he thought. My mother knows nothing about UFOs, much less abductions. At the time, my mother was 5 months pregnant with my younger brother. I was watching a program that mentioned the Lonnie Zamora case and looked up Socorro on a map. When I spoke to my mom next, I asked her about the drive from Memphis to Mesa. \"did we take 40 into Flagstaff?\" \"No, we went south on 25 and took 60 to Phoenix\". that put us in Socorro, four months before the Lonnie Zamora incident. I remember as a child, odd memories that seemed like vivid imagination. I remember at the age of five, living in a haunted house. My sister and I shared a room and my 3 year old brother slept in my mom's room. This happened while my father was in Viet Nam. I would see a bright flash and then the ghosts would come. They would walk past my bedroom, down the hall to my mother's room. There were always two small ghosts and one tall ghost. In another house, I remember being so scared at night. My \"other\" family would come and take my brother. I used to be so afraid that they would leave me behind and I used to hold my brother's hand very tight so when they came to take him, they would wake me. I remember being upset with them that my brother got to fly and I didn't. One night, they let me hover across a field next to our house. There were some other odd dreams I had as an adult regarding the abduction. One dream over two different nights. My brother lived for years in Dallas working the night shift for about 7 years and living a very isolated life. He currently lives with my mother to care for her."],"Region":"New Mexico","Weather Factors":"Unknown","Source":"MUFON","Date Submitted":"07/18/2013 10:54 UTC","Disposition":"Unresolved","trends":["There have been 3 other sightings in Socorro","There were no other sightings in Socorro on or around December 18th 1963"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.06594,+-106.884836(49035)&iwloc=A&hl=en\"> mufon case (49035) map </A>","Case Number":"49035","Object Shape":"Oval","Longitude":"-106.884836","Date of the Event":"12/18/1963 12:00 UTC","City":"Socorro","files":["/var/www/straped/mufon/html2text/49035.html.txt","/var/www/straped/mufon/org/49035.html"],"Country":"United States","Tags":"City","Sighting Duration":"Undisclosed","Latitude":"34.06594"}