{"Tags":"City","Longitude":"-84.890727","Region":"Indiana","Object Features":"Unknown","Date of the Event":"07/17/2013 10:00 UTC","Summary":"red fire ball like orb gliding through sky","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.827869,+-84.890727(49033)&iwloc=A&hl=en\"> mufon case (49033) map </A>","Log Number":"US-07182013-0020","divs":["Sighting Details I was sitting on my porch watching my son and nephew when a red fireball, glowing orb suddenly ascended from the horizon tree line in the field in front of my house (approximately .5-.75 of a mile away). It stopped about half way between the moon and the ground. It hovered for a little a bit ( a red, glowing ball at this point). It then sped up, heading southeast (now it looks white and cylindrical and somewhat out of focus) I describe its movements as gliding or floating. We continued to watch it go and then it was gone like it just disappeared. I was the first to witness called my youngest son and nephew to look first they saw it. Then ran in the door to get my other two sons and husband to see it. Husband had no interest. Oldest son said it looks like a firework but I don't have my glasses on and they both went inside. So I, my 2 sons and nephew stayed to watch it. The two youngest boys started taking pictures with cell phones. So we do have some pictures. Although the pictures do not quite show what we were witnessing. The iphone showed white bright streaks and the LG showed bright red and yellow lights in a saucer shape. I was not scared maybe excited but really just trying to grasp what I was looking at. We are used to seeing Medivacs and airplanes in our dark skies but this was nothing like those. That is why I was so excited to have the others witnessing it with me. I also was realizing that when we see helicopters there is usually some kind of noise. There was no noise coming from this object. We estimate the whole scenario took no more than 10 minutes. NOTE: The pictures seemed to have removed the red glow. What is left seems to be \"saucers\"."],"Weather Factors":"Unknown","Date Submitted":"07/18/2013 10:13 UTC","Object Shape":"Circle, Disc, Fireball, Sphere, Star-like","trends":["There have been 5 other sightings in Decatur","There were no other sightings in Decatur on or around July 17th 2013"],"Source":"MUFON","Latitude":"40.827869","Case Number":"49033","Disposition":"Unresolved","City":"Decatur","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Country":"United States","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/49033.html.txt","/var/www/straped/mufon/org/49033.html"]}