{"divs":["Sighting DetailsI was taking stuff like laundry outo the back yard ready for it to rain becuase weather changed suddenly, with low dark clouds moving in, but no thunder or lightning observed. I had just emptied the kiddie-pool so I could move it to another spot on the grass. looked up at the clouds - I like stormy-lloking skies. I first thought it was a plane reflecting the sun's light back at me. It looked pretty and curious so I kept warching as it emerged silently from a low dark cloud perhaps a few miles away, a the most. It first wasmoving north-north-westerly, then slowed, hovered a moment and moved theother way, with anapparent speed of perhaps 80mph tops, not superfast, but no slouch either. It maintained apparent altitude, went into and out of the cloud and reversed directions briely then went again in a relatively consistent speed and altitude, under the low dark cloud, to the south. I ran an called in myback door for someone to come quick and my wife and sone came and looked with me searching the sky for several minutes, but it had vanished. It was surreal. I was (and am) incredulous and speechless, in awe - it defied explanation. I am critical and skeptical of anyone that reports this stuff - even with photos or videos. I know whatI saw, though, and just want to know if I am alone in this sighting. I notified the police, local airport, and local newspaper - basically again to see if anyone else saw it - nobody I know of yet."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.978866,+-82.39779(49032)&iwloc=A&hl=en\"> mufon case (49032) map </A>","Object Shape":"Circle, Fireball, Sphere, Star-like","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Disposition":"Unresolved","Object Features":"None","Latitude":"42.978866","Summary":"Hot humid weather, storm seemd to be rolling in - observed object moving in, out and back under a low, dark clod","Longitude":"-82.39779","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/49032.html.txt","/var/www/straped/mufon/org/49032.html"],"Region":"Ontario","Tags":"City","City":"Sarnia","Viewing Distance":"Over One Mile","Case Number":"49032","Date Submitted":"07/18/2013 09:53 UTC","trends":["There have been 16 other sightings in Sarnia","There were no other sightings in Sarnia on or around July 18th 2013"],"Date of the Event":"07/18/2013 12:00 UTC","Log Number":"CA-07182013-0019","Country":"Canada","Source":"MUFON"}