{"Latitude":"52.039861","Summary":"had brief glimpse of silent black craft moving at tremondous speed across the road in front of me","Disposition":"Unresolved","Log Number":"GB-07182013-0017","divs":["Sighting DetailsI was driving my work van carrying out my normal rounds on a hot, clear morning. I started work at 7am and was not tired. I was driving along the A10 from royston towards Buntingford, travelling at 40 mph behind a line of traffic stuck behind a lorry. As I was driving up an incline of around 30 degrees I suddenly saw a large black solid object flash at tremendous speed across the sky between the trees lining both sides of the road. I had my windows down and the radio on at low volume but the craft was absolutely silent. The sighting occured between 9:30 and 9.45 am. Approximately 3 seconds later I reached the top of the hill and cleared the trees. I slowed down slightly to look across the fields in the direction the object had travelled (right to left) but saw nothing in the skies. The object had no wings that I saw but appeared to have a short, swept back tail fin. My first thought was that it was a jet but it appeared to be very low, just above the tree line, and was completely silent. It was far too large to be any native UK bird. I wonder if any jets were flying in the area at that time"],"Date Submitted":"07/18/2013 02:14 UTC","Object Shape":"Bullet, Missile","Weather Factors":"Unknown","Viewing Distance":"21-100 Feet","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=52.039861,+-0.020846(49030)&iwloc=A&hl=en\"> mufon case (49030) map </A>","files":["/var/www/straped/mufon/html2text/49030.html.txt","/var/www/straped/mufon/org/49030.html"],"Country":"United Kingdom","Longitude":"-0.020846","Object Flight Path":"Straight-line path","Case Number":"49030","City":"royston","Sighting Duration":"Undisclosed","Object Features":"None","Source":"MUFON","trends":["There have been 2 other sightings in royston","There were no other sightings in royston on or around July 18th 2013"],"Date of the Event":"07/18/2013 09:30 UTC","Region":""}