{"Weather Factors":"Unknown","Summary":"bright orange star headed N. stops. continues going W.stops, flashes look like ( :l ). turned S and went up so fast.stops,turned black, then few flashes&gone. iwas shining my flashlight before direction changes.","files":["/var/www/straped/mufon/html2text/49039.html.txt","/var/www/straped/mufon/org/49039.html"],"City":"Fort Bragg","Viewing Distance":"Over 1 Mile, Unknown","Country":"United States","Sighting Duration":"Undisclosed","Source":"MUFON","Region":"California","Date Submitted":"07/19/2013 02:59 UTC","Disposition":"Unresolved","Case Number":"49039","Object Shape":"Star-like, Unknown","Tags":"City","Object Features":"Unknown","Object Flight Path":"Stationary,Straight-line path,Path with directional change,Other,Unknown","Date of the Event":"07/18/2013 09:46 UTC","Longitude":"-123.782954","Log Number":"US-07192013-0002","trends":["There have been 3 other sightings in Fort Bragg","There were no other sightings in Fort Bragg on or around July 18th 2013"],"divs":["sighting detailsi went down the block as everynight to walk my dogs for night. its usually between 9&10 pm.pac. so we went by the wiggly giggly park the next street over. i was looking at the bightness of the moon- looked behind me to see a huge wall of dark fog at the ocean..just under a star. as i turned back around to feel for my phone and have someone see the ocean- i seen this bright orange flying thing coming from i guess s\\sse. and so i had to figure outwhere to turn my attention. i went with the moving thing. and its orange, thats cool! so like a deer in the headlights, im totally tripping out at what im trying to make of it. we dontget planes much here as it is. so i look at it-nope, not a plane-uh or a satalite...(?) hmm..wtf? so i creap out to expose it from behind the tree branches. i see it stop..just stop.. so i start to second guess the whole satalight thing. i had a mag light and flashed it towards it. ******** on&off. like searching for help...so then it turns and heads w towards the coast. im just staring at it until it stops again..a few air miles in. now this is when it let off its show off bright red lights that looked like a sad face.. weird. but they would glow and glow brighter! i expected something to shoot out. but i flashed my light again.. and it turned s.. and went up, up& faster up. showing it bright glowing lights. then it just turned loose i guess cus something came off it. like how a rocket drops its firething..but this this kept its form as it fell and dissapeared. it hit a nice speed for itself, and then went black..like all gone.. few sec later.. it appeared then gone. no more. just stars and i kept looking as we walked back home. but i came home and got online asap!"],"Latitude":"39.43693","map":"<A HREF = \"http://maps.google.com/maps?q=39.43693,+-123.782954(49039)&iwloc=A&hl=en\"> mufon case (49039) map </A>"}