{"Case Number":"49045","Log Number":"US-07192013-0008","Date of the Event":"07/15/2013 11:00 UTC","trends":["There have been 2 other sightings in Nevada","There were no other sightings in Nevada on or around July 15th 2013"],"Region":"Missouri","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=37.834094,+-94.325642(49045)&iwloc=A&hl=en\"> mufon case (49045) map </A>","Country":"United States","Tags":"City","Weather Factors":"Unknown","Object Shape":"Sphere","Disposition":"Unresolved","Summary":"Bright light approached from NE, vanished in a couple secs in the E; 45 min later another showed up W of me","Sighting Duration":"Undisclosed","Date Submitted":"07/19/2013 12:33 UTC","divs":["Sighting DetailsJuly 15, 2013 I was sitting outside my apt facing north watching the stars. I had been out a good hr and half or so, and I was passing the time by texting a friend. At approximately 2300 I was in the middle of typing a text when I got this feeling to look up so I did and from behind a tree going Southeastish was this big, bright, steady light moving silently. It seemed like it was low and close, by the brightness and size of the light. I was immediately filled with awe...my skin began to tingle with the unexpected surprise of seeing this!! As I watched it move, growing excited that it's path was going to come a little closer for a better look, it began to dim until it looked like a star in the night. It flew like that for a second or so and was completely gone!! Where it had been positioned before it dimmed I should've been able to still see it decently, but it was completely gone. It totally blew my mind!! The entire sighting lasted approximately 8 secs or so. Approximately 45 min later on the other side of the sky was the same kind of light...looking and flying identical except it appeared to be a little further away and was heading north this time. Like before, I was in the middle of a text when this one came out from behind a tree heading north. After a few seconds it disappeared in the same manner as the 1st one. This sighting lasted approximately 5 secs."],"Object Flight Path":"Straight-line path","City":"Nevada","files":["/var/www/straped/mufon/html2text/49045.html.txt","/var/www/straped/mufon/org/49045.html"],"Object Features":"Unknown","Longitude":"-94.325642","Latitude":"37.834094","Source":"MUFON"}