{"Case Number":"49044","Log Number":"US-07192013-0007","Summary":"Two distinctly different ufos. They both hovered and changed brightness. They both exhibited purposeful behavior/maneuvers. Partitions/windows noted in one with upper/lower levels. No other activity noted - no occupants noted.","trends":["There have been no other sightings in Jamestown","This sighting has never been favorited."],"Object Shape":"Sphere, Other","files":["/var/www/straped/mufon/html2text/49044.html.txt","/var/www/straped/mufon/org/49044.html"],"Viewing Distance":"Unknown","Longitude":"-84.954178","Source":"MUFON","Object Features":"Window(s)","divs":["Sighting DetailsI sleep out on my sunroom at treetop level. I was going to bed when I noticed bright lights reflecting on the floor. I looked out the windows toward the west and saw an object hovering. I could not tell how far away or how large due to tree -leaf interference but it appeared to be quite close and large. No sounds were heard. The top surface appeared flat with the section below having what appeared to be compartments, or partitions rather than \"windows\". There was a dark, dense level beneath these, with another level of compartments, or partitions beneath the dark dense level. Then below the second level of compartments was what appeared to be a flat surface. So it was not round. It had depth, width, and height. The compartments were large and black. What lit up and blinked randomly was the surface around the compartments. The colors were consistently white, yellow, blue, red, and green. I could see the reflection of the light emanating from it reflected on the trees and leaves around it. Some light from it reflected even into the sunroom. I could determine no pattern to the blinking changing colors. It remained stationary - not wavering or wobbling or shifting at all. There were times when I studied it with a monocular and could see quite clearly. I saw no movement within the craft. There were times I wondered if I might be witnessing a hologram. While observing this object, I noticed brightening light reflecting in a different area of the floor of the sunroom. I had to bend forward from my chair to see the source. When I looked through the treetops I thought it was the moon, although I wasn't sure. ( I'm not sure what phase the moon is currently in in this area.) I returned my attention to the other object. After a short time, I noticed the light on the floor getting brighter from the \"moon\", so I turned to look and didn't even have to bend forward in the chair before I saw what was obviously NOT the moon! This object was a bright, gold orb. It grew larger and brighter. As I watched it, it either became smaller or moved very quickly far away. Then it became one gold light with a smaller gold light to the right with a gold \"bar\" shape forming beneath it. I had been witnessing these two objects for, I suppose, about half an hour or more. Nothing about the first object changed. It just hovered and blinked. I felt compelled to simply accept that they were there and that was that. I went to bed. They were still hovering when I retired. These are not the only or first UFOs I have witnessed here."],"Object Flight Path":"Stationary","Disposition":"Unresolved","Tags":"City","City":"Jamestown","Region":"Tennessee","Date of the Event":"07/16/2013 10:40 UTC","Sighting Duration":"Undisclosed","Latitude":"36.468582","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.468582,+-84.954178(49044)&iwloc=A&hl=en\"> mufon case (49044) map </A>","Country":"United States","Date Submitted":"07/19/2013 11:08 UTC"}