{"Country":"United States","Region":"Ohio","Sighting Duration":"00:30:00","Summary":"UFO hovered in front of house, power went out, then flew off knocking down trees","map":"<A HREF = \"http://maps.google.com/maps?q=41.104913,+-81.535091(49046)&iwloc=A&hl=en\"> mufon case (49046) map </A>","Longitude":"-81.535091","Object Features":"None","Viewing Distance":"20 Feet or Less","Log Number":"US-07192013-0009","Date Submitted":"07/19/2013 01:40 UTC","Source":"MUFON","Object Flight Path":"Hovering then path","Object Shape":"Unknown","Date of the Event":"07/19/2013 02:00 UTC","files":["/var/www/straped/mufon/html2text/49046.html.txt","/var/www/straped/mufon/org/49046.html"],"Latitude":"41.104913","Tags":"City","Weather Factors":"Unknown","Disposition":"Unresolved","divs":["sighting detailsit was around 2:00 am on july, 19 2013. i was asleep when the power in our house went out. my partner came downstairs to grab candles and flashlights when he and i noticed something outside one of our windows. it had three lights all in a row with a yellow\\white tint. by the time we had a good look of it, it bolted off to the right, heading down towards memorial parkway. we decided to get in my car and follow it. as we were driving down the road, all the street lights were off and debris from street lights were present all over the road. it was pitch dark and was hard to see. eventually, we had to turn around as three large trees were down, covering the whole road making it impossible to search further. as we turned around we were stopped by a police officer (who was following us down the road). he had no answers but asked if we saw anything. without sounding too suspicious, my partner said he saw weird lights when the power went out. we drove home and eventually police cars, fire trucks and and power trucks were investigating the area. i've done some research today looking for more answers or if anyone else witnessed what i saw earlier this morning but i haven't found anything."],"City":"Akron","Case Number":"49046","trends":["There have been 20 other sightings in Akron","There were no other sightings in Akron on or around July 19th 2013"]}