{"Sighting Duration":"Undisclosed","Source":"MUFON","City":"Holyoke","trends":["There have been 3 other sightings in Holyoke","There were no other sightings in Holyoke on or around July 16th 2013"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.218786,+-72.643651(49043)&iwloc=A&hl=en\"> mufon case (49043) map </A>","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/49043.html.txt","/var/www/straped/mufon/org/49043.html"],"Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","Longitude":"-72.643651","Country":"United States","Log Number":"US-07192013-0006","Viewing Distance":"101-500 Feet","Date of the Event":"07/16/2013 09:40 UTC","Disposition":"Unresolved","Object Shape":"Disc","Latitude":"42.218786","Region":"Massachusetts","divs":["Sighting DetailsI was talking to my husband on the telephone when I noticed the object approaching my house - traveling over the tree line and coming across the Connecticut river to the Holyoke side. The lights were really bright. I could tell it was not a plane or helicopter as the shape was different and it made no sound. It traveled very slowly and appeared to hover at times. I ran out on our deck as it disappeared when crossing over my house. It was really strange. The phone and electrical service in my house were not affected. The next morning I went out into my back yard and noticed lots of dark spots on a new stone patio that we just had put in. The spots do not come up when scrubbing them. It just looks like something dark splattered all over the patio. The spots do not appear to be oily, they almost look like burn marks. There are also some spots on an area of shingles on the roof of my house. I did not hear anything about this on the news, however I decided to Google and see if anyone had reported seeing anything. Sure enough someone in the Belchertown and Amherst Ma, area reported a sighting on the same date and just a little earlier than when I sighted the object. This makes the fifth sighting for me in the past 40 years."],"Tags":"City","Summary":"An oblong shaped object with solid bright white lights approached my house over the tree line and crossed the Connecticut river to my side. I did not hear any sound. It disappeared after it went over my house.","Date Submitted":"07/19/2013 10:40 UTC","Case Number":"49043"}