{"trends":["There have been 18 other sightings in Dana Point","There were no other sightings in Dana Point on or around July 17th 2013"],"Viewing Distance":"501 Feet - 1 Mile","Case Number":"49041","map":"<A HREF = \"http://maps.google.com/maps?q=33.475472,+-117.694668(49041)&iwloc=A&hl=en\"> mufon case (49041) map </A>","divs":["Sighting DetailsI was returning from making deliveries in San Diego in a bobtail truck I drive for the company I work for. It was about 8:45 pm. As I was approaching Dana Point, I saw this craft to my right, over the Dana Point Harbor! What caught my attention was the color of the craft. It was completely a blueish green. It was bright, but the light seemed to be coming from within. It glowed like a neon, but brighter. I estimated being about 500 to 800 feet high over the harbor. As your approaching Dana Point from the freeway, it makes a sharp curve to the right. I wanted to stop, but I was in the center lane at this point. As I was turning with the curve, I looked at my outside rearview mirror and saw the craft. It had turned completely red!! I new I had to go back!! I got of the next off ramp, Ortega Hwy. I got back on freeway and headed back. I was getting off at PCH1. As I was approaching off ramp, I saw the craft coming inland! It was descending slowly over Camino Capistrano, which is a major thru fare, crossing PCH. At this point it had the colors of white, blue, and green! Their is a large hill north of Camino Capistrano, and I could see homes behind the craft, because it was lower the the hill. I lost sight of the craft because of trees lining PCH. I came to Camino Capistrano and turned right, and parked behind Dennys restaurant. I had a camera in my glove compartment. I grabbed it hoping to see the craft reappear, To my disappointment it didn't...........All this happened in a span of twenty minutes. From the time I first saw the craft, to parking at Dennys. I know this area well. The Harbor has a multitude of restaurants and shops. next to the harbor, their is an over night beach camping grounds. It was a beautiful night, hundreds of people must have seen this. I hope I'm not the only one to post this on MUFO. Its sad to say, the majority of the people these days have there faces glued to there iPods and phones, that they don't see whats going on over there heads. This is my third UFO sitting. Im just sorry I wasn't able to get a closer look at this wonderful looking craft. All I can do is keep looking at the sky, like I have been doing most of my life. I know I will get another chance!!"],"Summary":"While traveling north on I 5 freeway, observed craft over Dana Point Harbor","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/49041.html.txt","/var/www/straped/mufon/org/49041.html"],"Country":"United States","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Longitude":"-117.694668","Latitude":"33.475472","Date of the Event":"07/17/2013 08:45 UTC","Date Submitted":"07/19/2013 04:35 UTC","Weather Factors":"Unknown","Sighting Duration":"00:30:00","Object Features":"Unknown","City":"Dana Point","Region":"California","Tags":"City","Source":"MUFON","Object Shape":"Disc, Oval","Log Number":"US-07192013-0004"}