{"Object Flight Path":"Path with directional change","Country":"United States","divs":["Sighting DetailsI had fallen asleep at around 12 pm on the couch. I awoke and went outside for a smoke at a little after 3 am. When I got outside, I began to see orbs flying rather slowly across sky. They came from different directions and traveled in different directions. I got out a high powered flashlight and started flashing the light at them with two pulses at a time. They did not pulse back the two times that I did just one long pulse or what I would call bloom for about two seconds. After continuing to communicate in this way with various orbs for a while, all of a sudden, there were small and large jets all over the area. They seemed to be searching for the orbs. I watched the jets, maybe 6 total and figured the orbs were finished for the night. Then another showed up. It was moving very fast though. After a while, the jets left the area and I saw another orb. This one seemed to react to where I was guessing it would go. It also bloomed more than the rest just at my wishing it would without signal. Very interesting behavior. I decided to wake up my girlfriend. She came out and spotted two rather quickly. They were flying a little higher when she was present. After she went to bed, the sun began to come up. I asked aloud if I could get one more spectacular display. I felt silly, but I really felt as though the lights were reacting to my actions and thoughts. I even had a witness to prove to myself that these orbs were really flying overhead. It was bright enough that I could not see a single star. Suddenly, the largest brightest orb yet flew closer to me than any other. As I got excited and felt an almost electric charge in the air, the orb bloomed from white into a huge spectacular green glow over about two seconds. It definitely reacted to my emotions. After words, it made a 90 degree turn and flew away at high speed. One of the strangest events of my life. I have seen many unexplained things in the sky and see orbs quite often. I had no apprehension that night and the lights responded to that by coming closer and responding to me. I would never believe it if someone told me the same story and I expect no one to believe me. Take it for what it is worth. Next time you see an orb, as I know some of you see them as frequently as I do, try to communicate with it and do not fear it. You may be surprised at the response you get. This is by far the craziest thing I have ever written, but it happened sure as the sunrise that morning. I think they responded to me and the military responded to them. Amazing."],"Region":"Louisiana","Source":"MUFON","Log Number":"US-07202013-0005","Object Features":"None","files":["/var/www/straped/mufon/html2text/49059.html.txt","/var/www/straped/mufon/org/49059.html"],"Longitude":"-92.635727","Date Submitted":"07/20/2013 05:27 UTC","Latitude":"32.526775","Tags":"City","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=32.526775,+-92.635727(49059)&iwloc=A&hl=en\"> mufon case (49059) map </A>","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 6 other sightings in Ruston","There were no other sightings in Ruston on or around July 18th 2013"],"Date of the Event":"07/18/2013 03:45 UTC","Summary":"Orbs glowing and pulsating changing from white to very bright green","Disposition":"Unresolved","City":"Ruston","Object Shape":"Sphere","Case Number":"49059"}