{"Object Shape":"Other","Case Number":"49053","files":["/var/www/straped/mufon/html2text/49053.html.txt","/var/www/straped/mufon/org/49053.html"],"Latitude":"35.47675","Date Submitted":"07/19/2013 11:07 UTC","Country":"United States","Object Features":"None","Object Flight Path":"Straight-line path","Source":"MUFON","Sighting Duration":"Undisclosed","divs":["sighting detailson the night of july 4th, around 11:00 pm, give or take 30 minutes or so, i was walking our dog in the back yard, watching for any fireworks being shot off by neighborhood kids. i'm an aviation mechanic\\enthusiast and routinely look at the sky just to see what i can see. i suspect what i saw was a man made satellite or other object in orbit, but i am puzzled. what i saw was two red lights close together, side by side. moving roughly from overhead to the north. after watching it for about 20 seconds, the red lights were replaced by what looked more than anything like a very bright reflection, possibly from a mirrored surface, circular in shape. i've seen satellites, the shuttles, and the iss before, but i have never seen anything throw such a bright reflection or light before. that lasted for about 2-3 seconds, then that faded, the red side by side light reappeared, and shortly after that, a cloud formation blocked my view from about 45 degrees on down to the trees. i didn't really think that much about it until a few days later. that's why my recollection of the time of the event isn't exactly precise."],"Weather Factors":"Unknown","trends":["There have been 6 other sightings in Yukon","There were no other sightings in Yukon on or around July 4th 2013"],"Longitude":"-97.734457","Tags":"City","Viewing Distance":"Unknown","Log Number":"US-07192013-0016","Summary":"Twin red lights, turned to bright large circular light, back to red lights.","City":"Yukon","map":"<A HREF = \"http://maps.google.com/maps?q=35.47675,+-97.734457(49053)&iwloc=A&hl=en\"> mufon case (49053) map </A>","Date of the Event":"07/04/2013 11:00 UTC","Disposition":"Unresolved","Region":"Oklahoma"}