{"Weather Factors":"Unknown","Case Number":"49050","Tags":"City","Date of the Event":"03/01/2013 11:00 UTC","Object Flight Path":"Path then hovering","files":["/var/www/straped/mufon/html2text/49050.html.txt","/var/www/straped/mufon/org/49050.html"],"Country":"United States","Longitude":"-120.654802","Latitude":"35.292202","divs":["Sighting DetailsWhile sitting in the hot-tub at 11 pm on a clear night, a red-orange orb \"flew\" into sight from the North. Since we are 2 miles N of the SLO County airport, we oftentimes see small aircraft and commercial craft fly over in the landing pattern. This time, I happened to look up and see this \"orb\" fly in, but it stopped a mile or so short of passing over our house (my wife and I were both witnesses). As my wife went to get out of the tub, I said, \"Look at that strange red object glowing in the sky. It is much brighter than a star or an airplane, and it stopped on approach and just stayed stationary, after drifting a few degrees over to the West.\" She replyed, \"Looks like Mars is on fire, I need to get out!\" (She was too warm, not afraid or anything like that.) I remained in the tub observing the object which did not move. During that time, I was able to observe several commercial planes in the sky and could clearly hear them overhead at 30,000 feet, or so. I would guess these orbs, judging on how they drifted or flew into San Luis airspace, were ca. 5000 to 7500 feet high. Hard to judge, but I have flown planes in the past and often watch them fly in and out of the SLO airport, the control tower light of which is visible from my back yard and hot-tub. A couple minutes after my wife went inside, and I've been observing the orb for several minutes, five more orbs drifted in from the same direction (North) and stopped moving, then one orb drifted, as if intelligently, over to the west a bit to join the first orb. The other four stayed in place. At that time, I ran in to tell my wife to come back outside, and I grabbed our binoculars for better observation. It was hard to focus on the objects so I laid on the back deck to better brace myself and steady the view. From that vantage I could see through the binoculars that there was no \"structure\" to observe, and what looked like a glowing orb(s) was actually a red-orange light that was moving or rotating very rapidly and in a random fashion. They all looked like that. As my wife and I were watching, talking, and trying to figure out what they might be, they just kinda faded-out. First the four that stayed together, then the one that drifted over to the first, and then the first one faded-out lastly. It all took place over about 12 minutes time."],"Summary":"red-orange orbs flew in from North, hovered for about 10-min, then one-by-one kinda blinked-out.","Source":"MUFON","Object Features":"None","Region":"California","Date Submitted":"07/19/2013 05:44 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.292202,+-120.654802(49050)&iwloc=A&hl=en\"> mufon case (49050) map </A>","Object Shape":"Fireball, Sphere","Viewing Distance":"Over One Mile","Log Number":"US-07192013-0013","Disposition":"Unresolved","City":"San Luis Obispo","trends":["There have been 8 other sightings in San Luis Obispo","There were no other sightings in San Luis Obispo on or around March 1st 2013"],"Sighting Duration":"00:12:00"}