{"Summary":"I woke up and looked out window. Saw a glowing orange ball in distance behind house across street. It glided very smoothly across sky in a controlled ascent.","Viewing Distance":"Over One Mile","Object Shape":"Circle","City":"Ottawa","Object Features":"Unknown","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Date Submitted":"07/20/2013 04:06 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.42853,+-75.688853(49058)&iwloc=A&hl=en\"> mufon case (49058) map </A>","divs":["Sighting DetailsI woke up, unable to sleep about 2:45 a.m. at my house in Ottawa's west end (former Nepean, near Bayshore Shopping Center). I got up from bed about 10 mins. later and looked out window. I noticed a glowing orange light behind neighbour's house across street, facing SE. It was in the distance, perhaps 1-2 kms. away. It was moving across the sky in a slow, smooth arc. While it is not unusual to see planes in they sky at night as the airport is south of here (about 17 kms.), several things were unusual to me: 1) The light was a bright, glowing orange with the center a slightly more intense colour than the edges. 2) The object glided sooo smoothly. 3) The object was moving at quite a high speed. 4) The object was not moving in a path normal to what I have witnessed from airport landings and take-offs in the area. This object was ascending from an area that was to the west of the airport. I knew when saw the object it was not a plane. I have sometimes heard helicopter flights in this area at night, so I wondered if it could be a helicopter, however it was gliding too smoothly and moving too fast to be a helicopter, also, while I have seen infrared light on board a helicopter at night this was a completely different (the entire object was lit). I wondered if it could be a satellite. The object moved from across the sky in an arc pattern, extremely smoothly. There was no contrail. I tried to measure the speed by observing the space between 2 trees and it took 20 seconds to cross this space which was, from my bedroom window, about 300 feet. The object was about the size of an aspirin. At the time I first noticed the object there were clouds moving low on the horizon in the same direction as the object. I very much wanted to wake my husband but felt it more important that I continue observation of the object as it was moving and I knew there was not time to get binoculars either. I lost sight of the object when it moved behind a tree in my sightline, it did not emerge or emerged too low to be seen by me."],"Country":"Canada","Weather Factors":"Unknown","Case Number":"49058","Source":"MUFON","Disposition":"Unresolved","Date of the Event":"07/20/2013 02:50 UTC","Tags":"City","trends":["There have been 55 other sightings in Ottawa","There were no other sightings in Ottawa on or around July 20th 2013"],"Region":"Ontario","Longitude":"-75.688853","Latitude":"45.42853","files":["/var/www/straped/mufon/html2text/49058.html.txt","/var/www/straped/mufon/org/49058.html"],"Log Number":"CA-07202013-0004"}