{"Disposition":"Unresolved","Latitude":"37.969753","trends":["There have been no other sightings in parkville, mo or Riversid","This sighting has never been favorited."],"Tags":"City","Summary":"Redish Orange Lights forming a triangle shape","divs":["sighting detailsi currently work for a contracted navy parts base outside parkville, mo. an employee came pulling up at my guard shack and pointed them frantically to me saying look at those lights over there. i looked and to my astonishment there were prolly 15+ glowing redish-orange orbs in the sky northwest over the wooded area of parkville it seemed. i would guess to say they were a few miles away from the english landing park that direction. i sat there and watched the lights come up from the horizon at nighttime. at first i assumed it was flares but as the lights all came up 1 after another in sequence order it seemed strange. then when they were up in the sky they started moving and making a triangle formation. the triangle stayed that way for a good 45 minutes just sitting there and then just ended. 10 minutes later it happened again as i stated above and lasted until about 9pm cst. directly after the lights stopped around 9 pm 4 black helicopters came over parkville\\riverside where i work at a very very low altitude. i would say they were prolly 150 ft in the air, enought to where i could see the latchs on the side of the doors on the helicopters at night time. no lights wre on, on any of the helicopters and they were all moving at a amazingly fast pace. i did not see anything more after the helicopters and i can only think of what happened."],"Log Number":"US-07202013-0006","Region":"Missouri","Source":"MUFON","Country":"United States","Date of the Event":"04/16/2013 07:43 UTC","Object Shape":"Triangle","Longitude":"-91.830243","Date Submitted":"07/20/2013 09:37 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Path then hovering","files":["/var/www/straped/mufon/html2text/49061.html.txt","/var/www/straped/mufon/org/49061.html"],"Weather Factors":"Unknown","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.969753,+-91.830243(49061)&iwloc=A&hl=en\"> mufon case (49061) map </A>","City":"parkville, mo or Riversid","Object Features":"Unknown","Case Number":"49061"}