{"Viewing Distance":"Over One Mile","Tags":"City","City":"Albuquerque","Object Shape":"Fireball","Region":"New Mexico","Sighting Duration":"00:10:00","map":"<A HREF = \"http://maps.google.com/maps?q=35.109001,+-106.525108(49067)&iwloc=A&hl=en\"> mufon case (49067) map </A>","Object Flight Path":"Hovering then path,Path with directional change","Case Number":"49067","Longitude":"-106.525108","Date of the Event":"07/19/2013 09:30 UTC","Country":"United States","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/49067.html.txt","/var/www/straped/mufon/org/49067.html"],"trends":["There have been 129 other sightings in Albuquerque","There was one other sighting in Albuquerque on or around July 19th 2013"],"divs":["Sighting DetailsPlaying baseball in the dark at Matheson Park. 4 of us in the group. I noticed the object and told my friend that it looked unusual. Other people with us said it might be a balloon. One said it could be an airplane but i pointed out that the light is the wrong color. Someone mentioned that it could be a comet, but the object was much too close. Someone mentioned the possibility of a helicopter, but the light from the object was bright, steady, and orange, and was only interrupted by clouds. The skies were cloudy and a bit stormy, so a manned ballon also would not be practical. The object was glowing orange and in and out of the clouds. It hovered, moved toward us, all at about 40 degrees elevation to the south. It then descended for a few seconds and moved slightly left and right. After about 5 minutes, it receded quickly (my guess is 250 knots plus) to the west and faded out of view in the clouds. It was difficult to determine the shape of the object, as the light emitted was so bright, however one person in my party suggested that it was shaped like a \"tall soup can.\" We wondered how many other people saw the object, being over such a populated area. We were disappointed that none of us had our cellphones with us so at to take photos."],"Disposition":"Unresolved","Latitude":"35.109001","Log Number":"US-07202013-0013","Summary":"Object emitted orange glow, remained stationary, then descending somewhat, then receded at a high speed","Weather Factors":"Unknown","Date Submitted":"07/20/2013 04:20 UTC","Source":"MUFON"}