{"Tags":"City","City":"Mount Vernon","Sighting Duration":"Undisclosed","Object Features":"None, Other","Region":"Indiana","Disposition":"Unresolved","Latitude":"37.967615","Date Submitted":"07/20/2013 04:56 UTC","Country":"United States","Object Flight Path":"Straight-line path","Date of the Event":"04/15/2013 09:40 UTC","Object Shape":"Chevron, Triangle","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=37.967615,+-87.717447(49068)&iwloc=A&hl=en\"> mufon case (49068) map </A>","Summary":"It was a black surfaced triangular object. It had a blue light that pulse slowly and an orange light that pulsed faster than the blue light","trends":["There has been one other sighting in Mount Vernon","There were no other sightings in Mount Vernon on or around April 15th 2013"],"Weather Factors":"Unknown","Case Number":"49068","files":["/var/www/straped/mufon/html2text/49068.html.txt","/var/www/straped/mufon/org/49068.html"],"divs":["Sighting DetailsMe and my mom were driving home from scouts near the saint Phillips inn area, we turned onto the road that takes us home and opened the sun roof, because it was warm. I pointed out something in the sky to my mom that appeared stealth bomber shaped. She looked. It was also going quite slow, slow enough not to be a plane. It was shaped like a triangle but with a little triangle cut out of the back. It also had orange and blue pulsating lights. We continued to drive looking at it. It was dark but we could see the outline of whatever it was by the lights aforementioned on it. It made no evident noise. We were tired from a long day and did not desire to pursue it. We were driving west along the road as it was going in a straight line north east. We stopped for a second and watched as it disappeared over the tree line. We were generally shocked. I tried to get my iPod out to tape it. It did not get any good tape of it. We continued on home and that's it. The closest big city was Evansville but the closest city was Mount Vernon ."],"Longitude":"-87.717447","Source":"MUFON","Log Number":"US-07202013-0014"}