{"Disposition":"Unresolved","City":"Greater Sudbury","Case Number":"49073","trends":["There have been 12 other sightings in Greater Sudbury","There were no other sightings in Greater Sudbury on or around July 20th 2013"],"Object Flight Path":"Unknown","Viewing Distance":"Unknown","Log Number":"CA-07202013-0019","map":"<A HREF = \"http://maps.google.com/maps?q=46.49063,+-80.932232(49073)&iwloc=A&hl=en\"> mufon case (49073) map </A>","Tags":"City","Country":"Canada","Region":"Ontario","Object Shape":"Cigar, Star-like, Other, Unknown","files":["/var/www/straped/mufon/html2text/49073.html.txt","/var/www/straped/mufon/org/49073.html"],"divs":["sighting detailshello i was up late last night star gazing, i was looking at a group of stars that i see almost every night. it was shaped as a small triangle with a fourth of to the lower right, the one on the lower right for no apparent reason split into two separate, stars\\orbs the second star ascended upwards at a gradual pace. i have notice this happen on different occasion but this time it was connect to the lower one and kind of looked like a string or stick. it appeared to get brighter as it ascended vertically. my wife at the time was getting ready for work so i ran to get her when we returned it was just a single star, i maid a comment jokingly about great its going to make me look like a fool. so i began to describe it to her, as i was doing so it started to do it again, it was by far the brightest thing in the sky at the time, it keeped doing this at a constant pace ascended into a straight line of light then descended back into a single point, it repeated this behavior for at least 30 minutes. it could of went on much longer not sure i ended up going to bed, im not sure but there were defanently two orbs it was hard to tell because it was very bright when it would begin to ascend, im not sure if it was a straight line of light or several orbs emerging from each other in a straight line, it was very high and from were i was it appeared to be a dote that would change into a line roughly or several dotes in close proximaty about 2 to 4 inches in length also as it ascended it got brighter and appear to get wider. i am extremely fascinated by this and would love to hear some feed back if you have any. thanks rick"],"Summary":"saw what apeared to be a star then a second one emerged acende straight up then looked like a vertical line of light then decended back to original point","Longitude":"-80.932232","Weather Factors":"Unknown","Sighting Duration":"00:30:00","Date of the Event":"07/20/2013 12:00 UTC","Date Submitted":"07/20/2013 08:39 UTC","Latitude":"46.49063","Object Features":"Unknown","Source":"MUFON"}