{"Object Shape":"Cylinder, Sphere, Triangle","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.636085,+-89.392068(49077)&iwloc=A&hl=en\"> mufon case (49077) map </A>","Region":"Illinois","City":"Pinterest grove","Date Submitted":"07/20/2013 11:14 UTC","trends":["There have been no other sightings in Pinterest grove","This sighting has never been favorited."],"Tags":"City","Viewing Distance":"Over One Mile","Object Features":"None, Unknown","Source":"MUFON","divs":["Sighting DetailsI was driving down route 20 passing through Pingree Grove in Illinois, around 10:45 this morning, I'm a cloud enthusiast, my eyes caught a straight white line in the sky about 2 inches long and there was something in front of it,or back, that seemed to be in the state of flux that I really couldn't make out the shape,I tried to take a picture as I was driving but could not, as I drove the to objects were still in the sky for several minutes.. I kept thinking stop and get a picture, but couldn't because construction was going on a bridge right as I was passing under I 90, on 20 going north towards the TA truck stop, as I started to pull over the object that was in front of the tube shaped (white) object pulled away then it seemed to then take form into a silver oval object, which could of been the sun reflection on the object, and took off, the other white tubular object seemed to take off the other direction north with in seconds it disappear. And all I could think of is did any of those guys working on the bridge see that."],"Summary":"While driving noticed a stable tube shaped object in sky, with some thing fluttering in front of it","Latitude":"40.636085","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/49077.html.txt","/var/www/straped/mufon/org/49077.html"],"Date of the Event":"07/20/2013 10:45 UTC","Longitude":"-89.392068","Disposition":"Unresolved","Country":"United States","Log Number":"US-07202013-0022","Case Number":"49077","Object Flight Path":"Stationary,Path with directional change"}