{"Object Flight Path":"Straight-line path","Longitude":"-84.19623","Weather Factors":"Unknown","trends":["There have been no other sightings in Kalida","This sighting has never been favorited."],"Source":"MUFON","Region":"Ohio","Object Features":"None","Disposition":"Unresolved","divs":["Sighting DetailsFigured it important to tell someone about strange object(s) that pasted directly overhead ..over middle of our town of Ottawa, Ohio on June 8th 2010 approximately 9:00. Just before the sun had set. I believe it would help in some way in order to understand which is why I sending this email. I have no idea if you are even the right people to contact. After four days and then last night having someone else confirm to my wife and I that atleast three more people witnessed the same things.... I thought it important to explain to someone who may be able to tell us what this was. These people we know who live at least one mile away in Glandorf, Ohio saw the same object pass over their property. Same descriptions ...moving slowly , amber colored lighting at some point and dark circular object directly overhead, and is not making any sound. Conditions weather wise were extremely calm and clear, no way of wind guiding its path or speed. My wife and I both saw at least two of the same things at our home. I have additional information and rendering of what I saw, just too much to include with this message. I would ask that this email and my name be held extremely in confidence. I am looking for possible explainations, not attention. My thinking is that it is absolutely impossible that more people could not have witnessed this..... people within the communities of Ottawa and Glandorf had to have seen this because of how obvious these objects where directly above the communities."],"Object Shape":"Disc, Sphere","Log Number":"US-07202013-0017","Latitude":"40.980434","Summary":"Viewed 3 objects over residence in Ottawa, Ohio","City":"Kalida","Tags":"City","Case Number":"49071","files":["/var/www/straped/mufon/html2text/49071.html.txt","/var/www/straped/mufon/org/49071.html"],"Country":"United States","Viewing Distance":"101-500 Feet","Date Submitted":"07/20/2013 07:29 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.980434,+-84.19623(49071)&iwloc=A&hl=en\"> mufon case (49071) map </A>","Sighting Duration":"Undisclosed","Date of the Event":"06/08/2013 09:00 UTC"}