{"Latitude":"8.88","Object Features":"Unknown","Source":"MUFON","Longitude":"76.6","Viewing Distance":"Over 1 Mile, Unknown","Summary":"Flashed Hovered & moved with trails at three points with bright light & very close when compared with stars or even moon .","Tags":"City","Date Submitted":"07/21/2013 04:25 UTC","divs":["Sighting DetailsThis happened before 2003 , but really cant remember the date. We usually have power cuts in kerala,India . One day during the power-cut (around 7.30pm) i went and climbed on to the border wall of our compound, near the car shed, so that i could chat with my neighbor buddy,who came out due to the power-cut. We were having a casual talk for a long time, mosquito were biting us & suddenly both of us saw a bright light on the skies a bit towards the north, it was not as big as a moon but seemed as if it was very near than that of the moon, and was the size bigger than that of the stars,it hovered for a while and disappeared leaving trails of light giving us an idea that it moved to the east direction ,while we were watching the skies it immediately reappeared in the skies towards the east direction but not too far away, In between my friend asked , what is this & i didn't gave any reply.Suddenly we saw it moved towards the west direction, leaving trail for a while , and hovered for the final time & disappeared. Both of us were stunned and were speech less, we didn't had the courage to speak it to others because of the feeling that no one would believe us. I told it my father . He seemed to be normal and didn't question much.. The chapter was closed , Until i came up with some close friends who were really interested in UFOs..I spoke out to them and no one els. After 2004 for my surprise i again saw the same type of light flashing hovering & then moving ,this time direction pattern changed and my dad was also with me, it was during the summer season , we used to sleep in the top of our house for a while... As we were talking both of saw this and i told him that this was what exactly i saw years before along with my friend, and he too was confused , because we have seen meteorites ,shooting stars etc, but never such an event and the direction by which it moves the trails, its closeness to the earth etc, we could clearly say that it was not a natural event ..... i will try to draw how they appeared to me in Photoshop and upload"],"Object Shape":"Circle, Flash, Saturn-like, Star-like","trends":["There have been no other sightings in Kollam","This sighting has never been favorited."],"Date of the Event":"11/01/2003 07:30 UTC","files":["/var/www/straped/mufon/html2text/49088.html.txt","/var/www/straped/mufon/org/49088.html"],"Country":"India","map":"<A HREF = \"http://maps.google.com/maps?q=8.88,+76.6(49088)&iwloc=A&hl=en\"> mufon case (49088) map </A>","Case Number":"49088","Sighting Duration":"00:00:35","Disposition":"Unresolved","City":"Kollam","Region":"Kerala","Log Number":"IN-07212013-0009","Weather Factors":"Unknown","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering"}