{"Object Flight Path":"Stationary","Object Shape":"Unknown","Object Features":"Unknown","Case Number":"49086","Longitude":"-82.73521","Latitude":"43.526686","map":"<A HREF = \"http://maps.google.com/maps?q=43.526686,+-82.73521(49086)&iwloc=A&hl=en\"> mufon case (49086) map </A>","Log Number":"US-07212013-0007","Tags":"City","Summary":"Undescribed Flashing Lights in Sky in Michigan Thumb Area M25","Country":"United States","Date Submitted":"07/21/2013 03:17 UTC","Sighting Duration":"Undisclosed","City":"Deckerville","Disposition":"Unresolved","Date of the Event":"07/21/2013 12:00 UTC","Region":"Michigan","divs":["sighting detailsmy daughter and i were driving north on m25 in the thumb are of michigan. we were heading home from a road trip. we left the city of harbor beach at approx 11pm. we looked at our mapquest, which said we should have been home in the northern detroit area in 2 hours 20 minutes. i remember we were driving and i was looking at the lake and said to my daughter that it was pretty and close. she said, what was that? i said what? she said that light over there. i said \"i dunno, its probably lightning'. so i looked to the right (west) and saw a flash of light also. i thought maybe it was lightning. it was on the west side of m25, not on the lakeside. then we cleared some trees. there was a corn field about 100 acres. the light was in the middle and you could see that it was flashing also on the trees. we said, maybe its a lighthouse. but then the lights got faster, and we realized it was the wrong side of the road and in the middle of a field. seconds later the lights sped up, changed color and looked like a spinning top upside down. to me, the lights looked blurry and colorful. then the next thing we know we are at port huron. my daughter says, \"that can't be port huron, its 30 minutes still, look at my map\". and i did and it said we were 30 minutes away. also we got home at 12.30 ish so our total trip from harbor beach to warren mi was 1 1\\2 hours, not possible. but that's the case. also we had cell phone drops when on the phone."],"Source":"MUFON","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","trends":["There has been one other sighting in Deckerville","There were no other sightings in Deckerville on or around July 21st 2013"],"files":["/var/www/straped/mufon/html2text/49086.html.txt","/var/www/straped/mufon/org/49086.html"]}