{"Country":"United States","Disposition":"Unresolved","Object Shape":"Triangle, Other","Date Submitted":"07/21/2013 01:16 UTC","Weather Factors":"Unknown","Source":"MUFON","divs":["sighting detailsinitial sighting; haubstadt, gibson county, indiana, july 12 2013, 9:20 pm. walking to vehicle after dinner at local restaurant. looking in western sky. noticed 3 glowing red-orange lights, in triangular outline, stationary in western sky about 30 degrees above the horizon. lights resembled glowing embers of spent fireworks, but did not have a significant change in size, color,intensity or apparent position. lights were not \"large\" but were easily observable and appeared larger (maybe 3x)than \"normal\" stars. two of the 3 lights appeared to be along a n-s horizontal line. the third was below this \"line\" (perhaps 5 degrees) and was closer to the northern light than the southern light. got in the vehicle and drove toward the lights...approximately 1\\2 mile. individual lights and overall triangular shape did not appear to change (or grow larger - suggesting it was some distance away). at this point the \"lower\" light began to move \"up\" and \"north\" toward the northern light along the horizontal line. as it approached near the \"northern\" light, both the \"lower\" and \"northern\" lights appeared to pulsate (like a fireworks ember going out) and both faded out to dark. neither the \"northern\" or \"southern\" light appeared to move during this period. perhaps 30 seconds afterwards, the \"southern\" light also faded out in a similar manner. another 30 to 60 seconds later, a \"new\" light (very similar to the original 3) appeared in the same area in the sky...near where the original \"northern\" light was located. it appeared to move relatively rapidly and steadily along a horizontal line from north to south. in less than 5 seconds it also faded out to dark. subsequent, random observations over the next hour or so, resulted in no additional sightings or information."],"Case Number":"49094","Object Flight Path":"Stationary,Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=37.979229,+-87.56783(49094)&iwloc=A&hl=en\"> mufon case (49094) map </A>","Log Number":"US-07212013-0015","Longitude":"-87.56783","Latitude":"37.979229","City":"Evansville","Tags":"City","files":["/var/www/straped/mufon/html2text/49094.html.txt","/var/www/straped/mufon/org/49094.html"],"Sighting Duration":"Undisclosed","trends":["There have been 27 other sightings in Evansville","There were no other sightings in Evansville on or around July 12th 2013"],"Viewing Distance":"Over 1 Mile, Unknown","Summary":"3 red-orange \"glowing\" spots of llight in western sky. triangular form. 1 moved to another. both faded out. 3rd faded shortly thereafter. 4th? appeared moving steadily from N to S. faded out within 60 seconds","Object Features":"None","Region":"Indiana","Date of the Event":"07/12/2013 09:20 UTC"}