{"Disposition":"Unresolved","Latitude":"40.022813","Date Submitted":"07/21/2013 03:16 UTC","City":"Riverside","Tags":"City","Country":"United States","Log Number":"US-07212013-0018","Weather Factors":"Unknown","Sighting Duration":"00:04:00","trends":["There has been one other sighting in Riverside","There were no other sightings in Riverside on or around July 20th 2013"],"files":["/var/www/straped/mufon/html2text/49097.html.txt","/var/www/straped/mufon/org/49097.html"],"Summary":"Five or six red orbs flying in formation under the front clouds of storm front","Longitude":"-74.962415","Object Features":"None","Object Shape":"Circle, Fireball","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.022813,+-74.962415(49097)&iwloc=A&hl=en\"> mufon case (49097) map </A>","Viewing Distance":"Over One Mile","divs":["Sighting Details I was walking my dog in my back yard around 9pm on July 20th. The sun was set but a little day light remained. I looked to the east to watch a lightning storm moving north from the south east. The sky above me was clear, I could see stars. The storm clouds were lighting up when I noticed five red balls of light flying in a 1,2,2 formation. I thought they were a formation of helicopters at first, but they made no noise. As they traveled under the front of the storm clouds from east, south east, I notices a sixth orb appear from behind my neighbors house flying higher then other five. I ran to my rear door to tell my girlfriend to come out. By the time she came out she could see the last two orbs before they went behind other neighbors house. The orbs were now travaling north. I ran out to the front of my house and could see the last orb, (the last orb looked a lot farther away from then they were before.)It went into a cloud and that was it. The orbs did not blink, they stayed solid red. Very weird event."],"Region":"New Jersey","Date of the Event":"07/20/2013 09:00 UTC","Case Number":"49097","Object Flight Path":"Path with directional change"}