{"Disposition":"Unresolved","Region":"California","Summary":"Object seen on Steven's Trail in Auburn, CA","Source":"MUFON","divs":["Sighting DetailsMy friends and I were on a hike on a popular trail in Auburn, California, when we decided to stop and rest about a mile down the trail. There is a rock that protrudes from the mountainside that overlooks most of the canyon and river below that is ideal for photographs and provides a large vantage point of the surrounding mountains. We were all taking turns doing yoga at this vantage point and taking pictures with an iPhone 4, and reviewing them immediately after. Upon reviewing the clarity of several of the photos that were taken seconds apart, we noticed an unusual object in the sky in one of the photos that did not appear in the pictures taken seconds before and after. The object appears to be a diamond shape with two narrow appendages protruding from the bottom and has a metallic appearance due to the reflection of the sun. We all climbed as high as we could to see if the object could still be seen with no such luck. There was very little breeze and we saw no further aircraft or any kind of balloon for the duration of the hike. If we had not captured the object in that very brief moment, we would have most likely never seen the object as it made no noticeable sound, left no apparent trail in the sky on a nearly cloudless day, and it disappeared from sight immediately. We are not sure what the object is, but it appears to be large in size due to the focus in the foreground vs the slight blur of the object over the horizon line."],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.904325,+-121.07209(49108)&iwloc=A&hl=en\"> mufon case (49108) map </A>","files":["/var/www/straped/mufon/html2text/49108.html.txt","/var/www/straped/mufon/org/49108.html"],"Object Flight Path":"Unknown","Date of the Event":"07/14/2013 12:00 UTC","Date Submitted":"07/22/2013 01:05 UTC","Object Shape":"Diamond","Case Number":"49108","Latitude":"38.904325","Object Features":"Appendage(s)","Longitude":"-121.07209","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Log Number":"US-07222013-0001","Tags":"City","trends":["There have been 7 other sightings in Auburn","There were no other sightings in Auburn on or around July 14th 2013"],"City":"Auburn","Country":"United States"}