{"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Region":"California","Date Submitted":"07/21/2013 09:00 UTC","City":"Yosemite National Park","Object Features":"Unknown","Date of the Event":"04/24/2013 09:04 UTC","Object Shape":"Sphere","Disposition":"Unresolved","Log Number":"US-07212013-0023","Latitude":"37.84884","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=37.84884,+-119.53287(49103)&iwloc=A&hl=en\"> mufon case (49103) map </A>","divs":["Sighting DetailsI was in Yosemite Valley on April 24th 2013, scouting a location for photos of the \"Moonbow\" at Yosemite falls. Standing along Southside Drive just west of the chapel looking roughly North towards Upper Yosemite Falls. At about 9pm (9:04 on the camera time stamp), myself and another person who was out for the same reason noticed a very bright spot of white light coming over the ridge just left (west) of Yosemite Falls. It was considerably larger than the stars as well as the airplanes that are frequently visible in the area. We got the impression that it was moving very fast, relative to what we assumed were commercial airliners in the distance. We could not make out a shape other than the round spot of light. It did not blink, pulse or change intensity, it remained constant except as it passed through or above the clouds. It was not below the clouds, other than that, we had no idea how high it might be. It seemed to change course very slightly a couple of times before we lost sight of it crossing over the ridge to the south of us. Total viewing time was probably about 1 minute. It did not appear to be making any sound or leaving any kind of a trail. I have seen many meteors, a comet, satellites in the night sky, lots of airplanes and some missile launches during the day and night. This object did not resemble any of those things in any lighting conditions I have observed. I was planing on taking photos of the night landscape using a wide lens and long exposure. There was no time to switch lenses and settings so I just used what was already set and got a single 20 second exposure just before losing sight of the object. Although the shutter was open for 20 seconds, the object went out of view about 5 seconds before the shutter closed. The ridge top and trees are at the bottom of the photo, looking roughly south. I did not take time to let the vibrations settle before opening the shutter, resulting in some blur and the squiggly stars. The object seems to suddenly appear at about center of the original photo, this is the point where the shutter opened. I also attached a cropped photo for a closer look at the objects path and a photo of Yosemite Falls showing the clouds and stars present just a minute later, looking towards the north. The object first came into view over the ridge near the left edge of this photo."],"files":["/var/www/straped/mufon/html2text/49103.html.txt","/var/www/straped/mufon/more/49103_submitter_file1__GLE0903.JPG","/var/www/straped/mufon/more/49103_submitter_file2__GLE0903c2.JPG","/var/www/straped/mufon/more/49103_submitter_file3__GLE0904.JPG","/var/www/straped/mufon/org/49103.html"],"Viewing Distance":"Unknown","trends":["There have been 2 other sightings in Yosemite National Park","There were no other sightings in Yosemite National Park on or around April 24th 2013","This sighting has never been favorited.",""],"Object Flight Path":"Path with directional change","Summary":"April 24th 2013 Apx. 9pm. Unusually bright light crossing Yosemite Valley roughly North to South, in or above cloud level. Appearance and location very different from clearly marked airplanes in the area.","Case Number":"49103","Tags":"City","Longitude":"-119.53287","Country":"United States"}