{"trends":["There has been one other sighting in Valongo","There were no other sightings in Valongo on or around July 10th 2013"],"Source":"MUFON","Object Shape":"Fireball, Sphere","Date of the Event":"07/10/2013 12:00 UTC","files":["/var/www/straped/mufon/html2text/49119.html.txt","/var/www/straped/mufon/org/49119.html"],"Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Latitude":"41.188759","City":"Valongo","Country":"Portugal","Longitude":"-8.498352","Weather Factors":"Unknown","Log Number":"PT-07222013-0011","Region":"Porto District","Object Flight Path":"Path with directional change","Disposition":"Unresolved","Date Submitted":"07/22/2013 05:10 UTC","Summary":"Balls of light, like orbs going in many directions, changing path rapidly. They would appear, turn light off whlie flying and then appear in the same path much farther away.","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=41.188759,+-8.498352(49119)&iwloc=A&hl=en\"> mufon case (49119) map </A>","Case Number":"49119","divs":["Sighting DetailsMany ufos here in portugal. For the last weeks I've seen almost everyday maybe 4 times a week, from 9 pm to 6 am, many balls or orbs of light going in many directions, flying in a staright line and while flying they disappear and then appear or turn the light on and they are much farther away but in the same direction and path, then they are heading in a directions, suddenly they turn off or disappear from nothing they appear again flying in the opposite direction. When we see them they are heading in a normal speed then they like progressively turn the light off the light loses its brightness and they keep flying till they disapear completely, when they get very bright, it seems like they are going to explode they seem to get bigger as the light gets more strong and it is very beatiful looks like a flash in the sky. Pretty weird, the fact that they appear to get bigger and seem they are going to explode qhen they get brighter."],"Tags":"City"}