{"Viewing Distance":"Unknown","Country":"United States","Case Number":"49110","Date of the Event":"07/08/2013 03:30 UTC","Object Features":"Unknown","Object Shape":"Sphere, Star-like","Source":"MUFON","Summary":"Bright Light Observed","Object Flight Path":"Stationary","Region":"Kansas","Latitude":"37.387973","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Tags":"City","Date Submitted":"07/22/2013 05:03 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.387973,+-94.708226(49110)&iwloc=A&hl=en\"> mufon case (49110) map </A>","trends":["There have been 2 other sightings in Pittsburg","There were no other sightings in Pittsburg on or around July 8th 2013"],"files":["/var/www/straped/mufon/html2text/49110.html.txt","/var/www/straped/mufon/org/49110.html"],"Log Number":"US-07222013-0003","divs":["sighting detailsit was around 3:30 in the morning i went out into my backyard to smoke, i glanced to the west and noticed what appeared to be an usually bright \"star\" in the sky to the west. i found it to be strange, i own a telescope and keep track on when planets will be visible so i can go out for a viewing, so i knew that there shouldn't be any planets, especially as bright as what i saw, in the position that it was in. i'm not sure how long it was visible prior to me going outside and noticing it, but it remained visible for roughly 20-30 seconds as i was observing it. during that time it was completely motionless staying in the exact same spot when suddenly it made this upward movement and within 2 seconds the object\\light just faded away. during when it was visible there were no sounds at all that could be heard and the light wasn't blinking, it was just a solid steady whitish light. when i got back in, i pulled up ir satellite to see if there were clouds in the sky and maybe the light faded due to going behind clouds but there were no clouds in the area. perfectly clear night. i am left with no explanation as to what i saw, or why it was there in the sky. in my 32 years of being alive, i have never witnessed anything unusual in the sky."],"Longitude":"-94.708226","Weather Factors":"Unknown","City":"Pittsburg"}