{"files":["/var/www/straped/mufon/html2text/49118.html.txt","/var/www/straped/mufon/org/49118.html"],"Date of the Event":"07/20/2013 10:20 UTC","Region":"Ohio","Disposition":"Unresolved","Longitude":"-82.992894","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Latitude":"39.968456","Log Number":"US-07222013-0011","City":"Columbus","Tags":"City","Case Number":"49118","divs":["Sighting DetailsMy boyfriend and I were driving home and as we were driving I looked out the passenger window and saw what looked to be fireworks glowing in the air. As I continued to watch the lights stayed in they sky. I told my boyfriend to look and he saw the same lights; therewere about 12-15 of them. When we continued to watch them hover over the city they began to sprea out, changing their Big Dipper like formation. They were glowing and changing color from a white to a red-orange. After about 2 minutes we arrived at home, got out of the car and ran to look at the sky again. When we could see them many had disseapared however, there were about six left. Behind them was a helicopter that had its search light shining straight at them. Then all of the lights were disappearing one after another rapidly. All that was left in the sky was the helicopter with its search light still shining. We had no idea what we were looking at but it was like nothing we have seen before. Neither of us believe in \"aliens\" but we can't think of any kind of explanation for what we saw."],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.968456,+-82.992894(49118)&iwloc=A&hl=en\"> mufon case (49118) map </A>","Object Features":"Unknown","Object Shape":"Star-like, Other","Viewing Distance":"Unknown","Country":"United States","trends":["There have been 70 other sightings in Columbus","There were no other sightings in Columbus on or around July 20th 2013"],"Date Submitted":"07/22/2013 12:50 UTC","Source":"MUFON","Summary":"Hovering in a Big Dipper like pattern then began to change direction spreading further apart"}