{"Date of the Event":"07/21/2013 12:00 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/49122.html.txt","/var/www/straped/mufon/org/49122.html"],"Case Number":"49122","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around July 21st 2013"],"Log Number":"US-07222013-0014","map":"<A HREF = \"http://maps.google.com/maps?q=39.955635,+-75.157579(49122)&iwloc=A&hl=en\"> mufon case (49122) map </A>","Disposition":"Unresolved","Object Shape":"Sphere","divs":["Sighting DetailsI was sitting by my pool watching a big cumulus cloud. A Black dot came from the left and at first I thought it was a bird but it was just a round dot, it had no wings. It kept flying fast and on a steady arc through the sky. It was below the clouds, but the clouds were high in the sky, so I figure it was at least 5000 feet up. It seemed like it would be about a third of the size of a regular airplane. It all happened in about 30 seconds and went across most of the sky in that time so it was faster than an airplane. As I was watching it it took me about 20 seconds to realize I could not explain what it was. I sat up on the edge of my chair so that I could continue to watch it. When it disappeared into some light cirrus clouds in the East I thought, where are the binoculars when you need them?! My feeling was, really? Was that a UFO? Like a small personal craft or something? At the rate it was going it would have been to the Jersey shore in another couple of minutes and to Europe in an hour or two. I am just curious and found your sight because I was looking on Google to see if a UFO could look like what I saw, ie. no lights, just a small sphere in broad daylight. My husband said maybe it was a satellite, but it was below the high clouds!"],"Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile","Region":"Pennsylvania","City":"Philadelphia","Object Features":"None","Source":"MUFON","Latitude":"39.955635","Country":"United States","Tags":"City","Date Submitted":"07/22/2013 08:57 UTC","Summary":"I was sitting by my pool watching a big cumulus cloud. A Black dot came from the left and at first I thought it was a bird but it was just a round dot, it had no wings","Longitude":"-75.157579","Sighting Duration":"00:00:30"}