{"Weather Factors":"Unknown","Tags":"City","Longitude":"-122.5927","City":"Novato","Viewing Distance":"Over One Mile","Object Shape":"Diamond, Oval, Sphere, Triangle","Latitude":"38.105377","Country":"United States","Case Number":"49120","Sighting Duration":"00:01:50","divs":["sighting detailsmy mother and i were in my room watching tv when we heard a loud roar outside. we ran to the window. it was a cop tat was out at my neighbors house. as my mom was preoccupied watching that go down, i noticed a light in the sky. i watched it, and it was just a plane, but i filmed it anyway since it seemed to be government, or at least non commercial. i walked outside and watched it fly away. about a few minutes later i saw a similar object to the ufo i saw on 07\\14\\13 in novato. the sighting began at 10:04 pm. i started filming it asap. it was orange colored, and there were multiple lights. all were behaving differently. one large, bright one on the bottom and about 2 on the top. the bottom one was constant, the top ones were blinking\\\"dancing\". it hovered in place for a little bit and then slowly drifted south\\southwest. it was very low to the ground just nearby the indian tree preserve mountains. i filmed it until it disappeared around 10:06 pm, just after my camera ran out of film! the ufo is moving from right to left in the footage. i am standing in my backyard, facing the indian tree preserve. the flight path of the ufo was from the vicinity of the indian tree preserve to josef hoog park. when i uploaded the footage to my computer and enhanced it, i could see the large lower light, a faded light on the left that was constant, and 3 - 4 smaller lights on the top blinking and \"dancing\" (a total of about 5 - 6 lights) it was cold outside. very quiet. there was barely even a breeze. during the sighting i heard no noise. nothing. in the enhanced video, you can see the indian tree preserve mountains horizon. below it, in the valley, is where the ufo was hovering. in the enhanced video, you can see two faint lights on the right floating towards each other. as i properly set up my cameras options and tilt it towards the sky, and back down again, you will notice that the lights have converged together. they are now acting as one unit! some are dancing with each other, some are just floating with the rest. note. i repeat. if you watch the video closely, especially the enhanced version, two dim lights are seen in the beginning of the video on the right. they move closer to each other. then i moved the camera up and back down. by this time the lights were in a cluster and there were more than 2. the enhanced footage starts with the object cropped and zoomed, then replays the video un-cropped\\zoomed. it is easier to see this event happening in the un-cropped\\un-zoomed portion of the video. in conclusion, the objects appeared and converged, then hovered in place, then proceeded to slowly move south. there is also a blinking light in the sky in the beginning of the video above the horizon. i didn't watch this object. it probably was just a plane anyway. i listed that there was a plane in the vicinity of the sighting, though the blinking light that i saw was much further away from the craft i witnessed and i do not think it had anything to do with what i saw. minutes later, a government airplane flew by the area. the footage was shot handheld on a panasonic ag-dvx100b attached is the flight path, original untouched video, and the enhanced video."],"trends":["There have been 18 other sightings in Novato","There was one other sighting in Novato on or around July 21st 2013","This sighting has been favorited 3 times.",""],"files":["/var/www/straped/mufon/html2text/49120.html.txt","/var/www/straped/mufon/more/49120_submitter_file3__ufoflightpathJuly21withoutmylocation.png","/var/www/straped/mufon/org/49120.html"],"Date Submitted":"07/22/2013 05:34 UTC","Date of the Event":"07/21/2013 10:04 UTC","Object Features":"Unknown","Log Number":"US-07222013-0012","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=38.105377,+-122.5927(49120)&iwloc=A&hl=en\"> mufon case (49120) map </A>","Summary":"Strange Hovering Lights Dancing With Each Other Low to the Ground","Disposition":"Unresolved","Region":"California","Source":"MUFON"}