{"Tags":"City","Log Number":"US-07232013-0008","Object Shape":"Sphere","Country":"United States","Date of the Event":"07/21/2013 01:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.325195,+-79.61267(49133)&iwloc=A&hl=en\"> mufon case (49133) map </A>","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Summary":"Saw a red ball appear and rise up to travel left to right then disappeared. Then another red sphere appear and travel basically the same path and disapeared","divs":["Sighting DetailsI was on the 11-7 shift at work on Sat. July 20,2013 into Sun. July 21,2913. About 1:10 am or so we were sitting outside on break facing basically to the West when I noticed a red sphere appear over one of the buildings in the distance. There was an orange security light in our eyes but this object was a solid red color that appeared to be brighter. That's what caught my attention. I got up to get a closer look. It then traveled west to northeast on a steady rise about tree level and disappeared. It was partly cloudy and the moon was to our left. This lasted about 30 seconds. Then another red sphere appeared and one of the ladies on break saw this one and said what the Hell is that? I said that's why I got up to get a better look as there was one right before this one. We watched as it did basically the same thing as the first object and disappeared too. About 30-40 seconds for this one too. We thought maybe it was those Chinese Lanterns but there was no flickering of the object and it stayed a solid red with no glow or exhaust to it. There also was no sound to it. They both could have disappeared behind the clouds. Not sure but they both just appeared on the horizon. They didn't rise up. They were just there then they rose up a bit and traveled left to right. There didn't appear to be any wind blowing at the time where we were sitting. The pictures are of the second object. The first one is what we saw with the naked eye. I enlarged the picture for a little more detail."],"City":"Jeannette","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/49133.html.txt","/var/www/straped/mufon/more/49133_submitter_file1__IMG20130721011441456.jpg","/var/www/straped/mufon/more/49133_submitter_file2__IMG201307210114414561.jpg","/var/www/straped/mufon/org/49133.html"],"Date Submitted":"07/23/2013 01:51 UTC","Latitude":"40.325195","Longitude":"-79.61267","Disposition":"Unresolved","Case Number":"49133","trends":["There have been 2 other sightings in Jeannette","There were no other sightings in Jeannette on or around July 21st 2013","This sighting has never been favorited.",""],"Region":"Pennsylvania","Object Flight Path":"Hovering then path","Object Features":"None"}