{"Source":"MUFON","Summary":"It sounded like it had a small propeller but it was so low i could see it was shaped like a torpedo","Disposition":"Unresolved","Object Flight Path":"Straight-line path","trends":["There have been 2 other sightings in Bayonne","There were no other sightings in Bayonne on or around May 15th 2013"],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/49130.html.txt","/var/www/straped/mufon/org/49130.html"],"Date of the Event":"05/15/2013 10:39 UTC","Region":"New Jersey","Tags":"City","Latitude":"40.673464","Longitude":"-74.108409","divs":["sighting detailsafter parking my car at around 10:30 as i just got home from school. i collected my belongings from the car closed the car door and started walking out of the driveway, is when i noticed a buzzing noise and i looked up and didn't think much of it at first because i live within 3 miles from the newark airport and large planes and helicopters are a common occurrence. i started walking in to the house and it occurred to me that i could film this thing with my smart phone. so the video is only 1\\4 of the time i was watching it. what was weird about it was it sounded like it had a propeller like a model plane, but it is illigal to fly any toy aircraft in my area because of the airport. i stared filming it from my porch and when i did the smartphone flash came on, at that it started moving slowly away in a southeast direction to the cornor of the next block, as it moved away 3 lights came on on the bottom red, white and blue they were triangular but with a circular edge. as far as the objects appeareance it was shaped like a inverted torpedo orange in color. after it move away i went in the house to get my son to come out to see it before it went out of sight. we went back outside and i pointed towards the southeast the direction it had gone but it wasn't there anymore, it was right back where i orginally saw it right above us. it was like it was aware of us being there and stated moving east towards the airport and then out of sight. with all that said if i had to make a guess it was some kind of survalance drone. i'm submitting two versions of the same video the .wmv is a converted file that i posted on facebook but the other is the original."],"Country":"United States","Date Submitted":"07/23/2013 10:28 UTC","Log Number":"US-07232013-0006","map":"<A HREF = \"http://maps.google.com/maps?q=40.673464,+-74.108409(49130)&iwloc=A&hl=en\"> mufon case (49130) map </A>","Viewing Distance":"101-500 Feet","Object Shape":"Bullet, Missile","City":"Bayonne","Sighting Duration":"Undisclosed","Object Features":"Other","Case Number":"49130"}