{"City":"Vineland","Date of the Event":"07/23/2013 09:55 UTC","Country":"United States","Sighting Duration":"Undisclosed","Date Submitted":"07/24/2013 12:08 UTC","Viewing Distance":"501 Feet - 1 Mile","Summary":"Blue-green orb observed descending west of Waterford, NJ.","divs":["Sighting Details7.23.13 I was driving home from the auto parts store in Hammonton, N.J. and had to stop at friends house to drop off some oil that he needed to top off his vehicle. We spoke for a few minutes and as we were conversing I was looking towards the White Horse pike (Rt. 30) where a dealership is located. While my friend was speaking I witnessed a distinct blue-green (more of a mid-aqua), oval shaped, orb rapidly descend. It was a vertical oval that emitted an aqua color. The instance only lasted about 2 seconds, but it was very clear that it was an oval, brightly lit (in a way), object that descended very rapidly. The highest I observed could have been a couple of miles up as I don't have anything I could reference to get a more accurate measurement. It descended to maybe 15-20 degrees above the horizon. Granted a tree blocked some of my view as it neared the lowest observable altitude. But I could definitely see it through the branches. The part I witnessed un-obscured it did not leave a tail or blur above it (as it moved straight down). It seemed more of a rapid descent than a free fall. It was not a blinding bright light, but bright enough that it immediately drew my attention towards it. I quickly told my friend to look and asked my friend if he had seen what I just witnessed, but he was looking at me while speaking. He turned in the direction I observed the object, but he was too late. I explained what I saw but he didn't seem too impressed. I even walked into the neighbors yard to try and get a better look and maybe even see a fire or smoke in the distance fearing it was an aircraft that may have crashed. Many airplanes were in the night sky, but they seemed to keep on their path. About 10-20 seconds after the sighting it occurred to me to check the time on my phone just incase it coincides with something else later. The clock on the phone read 9:55. The earliest it could have been when I saw the object is 9:54:40 (40 seconds after 9:55.) I didn't see anything and kept talking to my friend for a few minutes before heading home. As I drove home (less than .5 miles away) my curiosity got the best of me so I decided to travel in the direction of the objects would-be landing area. I drove for about 15 minutes but didn't see helicopters, planes, or emergency vehicles anywhere to give a clue as to the location. I gave up and decided to go home. When I went on Google maps, I realized that I was traveling a bit too far north of the direction I observed the object. I included a screen shot of the map with red line depicting the direction I was facing when I saw the object. The blue lines shows a broader field of vision to help narrow down the possible sighting direction. (not sure if I explained myself very well there). I don't believe the object was a comet, meteor, plane, or left over fireworks from the 4th of July. The object did not change brightness, nor did it sparkle, flash, leave a trail, tail, or anything of the sort. It was a solid aqua glow as it rapidly descended. Maybe someone else just happened to be looking at the same direction at the same moment as myself and can back me up, or at least give a clue as to what it may have been. It was like as falling gem in the sky."],"files":["/var/www/straped/mufon/html2text/49142.html.txt","/var/www/straped/mufon/org/49142.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.486377,+-75.025964(49142)&iwloc=A&hl=en\"> mufon case (49142) map </A>","Case Number":"49142","Longitude":"-75.025964","Object Features":"None","Latitude":"39.486377","Weather Factors":"Unknown","Tags":"City","Log Number":"US-07242013-0001","Source":"MUFON","trends":["There have been 9 other sightings in Vineland","There were no other sightings in Vineland on or around July 23rd 2013"],"Object Flight Path":"Other","Region":"New Jersey","Disposition":"Unresolved","Object Shape":"Oval"}