{"Object Flight Path":"Stationary","Object Shape":"Circle, Oval, Sphere","Case Number":"49145","City":"Grand Island","Date of the Event":"07/24/2013 11:45 UTC","Country":"United States","Date Submitted":"07/24/2013 01:39 UTC","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=40.902366,+-98.369802(49145)&iwloc=A&hl=en\"> mufon case (49145) map </A>","Summary":"2nd sighting in my life, this one was witnessed with my mother in the parking lot of my apartment building.","divs":["Sighting DetailsLooking west out of my apartment door on stollypark road I look at the stars as im smoking my cigarette and one certain point of light looked odd to me, or like I had never seen a star look or act that way... When you just looked at it it looked like a floating orb, or star but when i focused on it and actually watched it for over 20 minutes shapeshift, change color, hover still, go up, down. It looked like it was bobing in the air. I kept watching and saw it shooting out little orbs and sometimes the one orb would turn into two, then back to one. It seemed at times to be rotating very very fast or at least the very bottom of it was. When i focused, the orb of light seemed to have little lights within it, spinning around its venter. I focused on the area around the orb to see what else i could manage to see, it seemed like the orb had a force field that I could see when the object would move because it would make the space around it ripple and warp the area around it, like droping a rock into water but in a closed ball around this object.. Then points of light began to appear, hover, then instantly vanish and appear somewhere else.. I was standing watching all this happen with my mother and she saw the exact same thing. A couple times i could have swore i saw little beams of light shoot off the object like solor flares off the sun, it would just shoot of it almost like a jet of gas would look. Im not sure if this was a craft with being inside it, or if it itself was the being, hovering as an orb or light, then shifting, changing shape, becomming two, then merging together again, random bulges and twisting motions and rolling made it look like it couldnt decide what it wanted to look like ."],"Latitude":"40.902366","Source":"MUFON","trends":["There have been 9 other sightings in Grand Island","There were no other sightings in Grand Island on or around July 24th 2013"],"Weather Factors":"Unknown","Tags":"City","Longitude":"-98.369802","Region":"Nebraska","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Log Number":"US-07242013-0004","files":["/var/www/straped/mufon/html2text/49145.html.txt","/var/www/straped/mufon/org/49145.html"]}