{"Tags":"City","Case Number":"49157","Object Features":"Dome, Patterned Surface","map":"<A HREF = \"http://maps.google.com/maps?q=40.085835,+-123.813614(49157)&iwloc=A&hl=en\"> mufon case (49157) map </A>","City":"Garberville","Weather Factors":"Unknown","Sighting Duration":"00:04:00","Country":"United States","Disposition":"Unresolved","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Object Flight Path":"Path then hovering","Object Shape":"Disc","Source":"MUFON","Longitude":"-123.813614","divs":["Sighting DetailsI needed some fresh air and wanted to investigate the new enviroment of Eureka California. My friend and I had moved there in October 1996, and I had been told the river near Garbrville was a good destination to start. I was driving 50 mph taking in the scenery and as I rounded a curve I noticed a disc shaped craft near the ridge line across the river.Possibly a half mile away, I watched it move north slowly and then it headed slightly towards me. It was not noticeable because I was traveling straight south and then into another s-curve. Then as I came out of that curve I looked and it was directly east of me and much closer.I was concerned because there wasn't alot of traffic.When a car passed going north I tried to make eye contact and the man and women but they did not look in my direction. I watched the craft another 10 -15 seconds and then it vanished from sight. I arrived into Garberville 5-7 minutes later and had a cup of tea. I wasn't sure what to do and hoped nothing happened to anyone,the news paper did not have any reports until a few days later when a small group reported a similar sighting.The first and second views were at an excellent angles. The first at a 45 degrees, the sunlight was just over the ridge and the lighting was picture perfect. The second was equally good, because the craft was just slightly north and east so the reflection off of the craft showed a main body as having a shiny surface rotating clockwise. The dome shape on top was reflective and white silver a touch lighter in color than the main body and not rotating."],"trends":["There have been 4 other sightings in Garberville","There were no other sightings in Garberville on or around March 13th 1997"],"Date of the Event":"03/13/1997 10:30 UTC","files":["/var/www/straped/mufon/html2text/49157.html.txt","/var/www/straped/mufon/org/49157.html"],"Summary":"Driving south to see some scenery along US 101, I rounded a curve and noticed a disc shaped aircraft moving along the ridge to the southeast. The craft came closer and hovered about 100 yds. away.","Region":"California","Latitude":"40.085835","Log Number":"US-07242013-0015","Date Submitted":"07/24/2013 07:32 UTC"}