{"Tags":"City","Weather Factors":"Unknown","Summary":"it was the beginning of a storm It was lightening and thundering when I saw this orangish redball of light in the sky. i thought it was an airplane at first but it just went across the sky behind .my house. And then a other one followed it. it made no sou","Date Submitted":"07/24/2013 03:41 UTC","Viewing Distance":"Unknown","Object Features":"Unknown","Date of the Event":"07/19/2013 12:00 UTC","Log Number":"US-07242013-0010","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Latitude":"43.234417","Disposition":"Unresolved","Case Number":"49152","City":"Northville","files":["/var/www/straped/mufon/html2text/49152.html.txt","/var/www/straped/mufon/org/49152.html"],"Object Shape":"Fireball","map":"<A HREF = \"http://maps.google.com/maps?q=43.234417,+-74.168717(49152)&iwloc=A&hl=en\"> mufon case (49152) map </A>","Longitude":"-74.168717","Country":"United States","divs":["Sighting DetailsI was on my deck watching a a lightening and Thunder storm approaching.I was watching the sky when I saw this reddish orange ball of light traveling in the sky coming over the trees and then I ran to the other side of deck to see it disappear in the trees.At that point I screamed for my husband to come out and started to tell him what I had just seen,when he said there it is and another one appeared and went in the same direction and disappeared.At that point we were both kind of confused what we had just seen and went in the house.I actually first thought it was some kind of plane but when it was in view we could see it wasn't. It moved like a plane. It wasn't a plane my husband suggested ball lightening but it didn't fit the criteria. We both started feeling like we may have just seen an unidentified flying object. IT WASN'T like a flash in the sky.It moved like an airplane would."],"Source":"MUFON","Region":"New York","trends":["There have been 2 other sightings in Northville","There were no other sightings in Northville on or around July 19th 2013"]}