{"files":["/var/www/straped/mufon/html2text/49154.html.txt","/var/www/straped/mufon/org/49154.html"],"Object Shape":"Oval, Star-like","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","Weather Factors":"Unknown","Longitude":"-123.077114","Region":"Oregon","trends":["There have been 68 other sightings in Eugene","There were no other sightings in Eugene on or around July 23rd 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=44.058979,+-123.077114(49154)&iwloc=A&hl=en\"> mufon case (49154) map </A>","Source":"MUFON","Latitude":"44.058979","Case Number":"49154","Log Number":"US-07242013-0012","divs":["Sighting DetailsHot night, went outside and observed bats chasing bugs, then noted star-like object to the West (just south of eugene airport) before any true stars were yet visible. Got binoculars and began observing. Saw self-illuminated object, constant light, which did not appear to be moving. Over time, however, it did change location. When first observed it was to the South of the tallest tree to the West, eventually it was directly above the tree, then within 50 minutes it was to the North of the same tree. At first I thought it was a star, yet it was too light outside to view any stars at 9:10 PM. Suspicious, I observed it through binoculars, and it was obviously NOT a star, rather a self-illuminated object. I could not detect movement, object seemed to hover soundlessly, yet over 40-50 minutes I observed it, it made its way NW of its original position. I felt an excited anticipation to be observing such an object. I went inside periodically to write down what I was observing. I observed the object until it moved so far to the NW that it disappeared behind the trees to the West of my house. Had it remained, I would have stayed outside observing, continuing to observe the object. I did take a photo of the \"orb.\" Earlier this year (in the spring)I had observed a glowing orb that meandered soundlessly and slowly (yet with observable movement)at less than 500 feet, so I have been taking note of unusual lights ever since. This is the first similar object I have observed, still this object was at a greater distance from me and behaved differently than the meandering object (also self-illuminated) seen previously. This object seemed to glow with a whiter light than the meandering orb, the light of which had more of a yellow glow to it. During my observation at least 3 airplanes took off or landed and MUST have been able to see it!"],"Object Flight Path":"Hovering then path","Date of the Event":"07/23/2013 09:10 UTC","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Summary":"Object appeared star-like prior to stars being observable(too light outside).Observed w/binoculars, lighted orb,just South of airport. Changed location over time but could not ascertain movement except over time.","Country":"United States","Tags":"City","City":"Eugene","Date Submitted":"07/24/2013 06:27 UTC"}