{"Latitude":"32.880702","divs":["Sighting DetailsI had got back from getting married in Hawaii and was enroute to Chandler AZ. Interstate 8 I was running west to east when out of the south appeared a missile shaped craft traveling a couple hundred miles per hour. I watched it pass overhead maybe 500 feet and there wasn't any noise. One of the first thoughts I had was Mexico firing missiles into the US?? I had heard of the drug cartel employing a similar strategy to deliver drugs but this craft continued to the small mountains directly noth and disappeared. The small town just north is visible and so as a visual aid to distance the craft passed over that town and would then need to have stopped immediately before entering Chandler AZ. When I arrived to the truck stop in Casa Grande another driver asked me why I wasn't going to report what I had just saw? That caught me off guard and I realized others obviously must have seen it although no one was as close as I was. The nearest person would have been a rancher a half mile away, if he had happened to see it. There were no other vehicles on I8 for at leat 2-3 miles west or east of me."],"Object Flight Path":"Straight-line path","Country":"United States","files":["/var/www/straped/mufon/html2text/49162.html.txt","/var/www/straped/mufon/org/49162.html"],"Object Features":"Other","Weather Factors":"Unknown","trends":["There have been 35 other sightings in Casa Grande","There were no other sightings in Casa Grande on or around December 17th 2005"],"Longitude":"-111.754952","Tags":"City","Source":"MUFON","Disposition":"Unresolved","Region":"Arizona","Sighting Duration":"Undisclosed","City":"Casa Grande","map":"<A HREF = \"http://maps.google.com/maps?q=32.880702,+-111.754952(49162)&iwloc=A&hl=en\"> mufon case (49162) map </A>","Case Number":"49162","Viewing Distance":"101-500 Feet, Over 1 Mile","Object Shape":"Cylinder","Summary":"Driving tractor trailer from San Diego CA.to Casa Grande AZ truck stop to pick up in Chandler AZ.","Log Number":"US-07242013-0020","Date of the Event":"12/17/2005 12:00 UTC","Date Submitted":"07/24/2013 08:26 UTC"}