{"trends":["There have been 2 other sightings in Macomb Township","There was one other sighting in Macomb Township on or around June 17th 2013"],"Country":"United States","Date Submitted":"07/24/2013 07:56 UTC","Case Number":"49160","Object Flight Path":"Unknown","Summary":"UFO seen under a severe storm","files":["/var/www/straped/mufon/html2text/49160.html.txt","/var/www/straped/mufon/org/49160.html"],"Date of the Event":"06/17/2013 04:58 UTC","City":"Macomb Township","Latitude":"42.670876","Tags":"City","Object Shape":"Cigar","Sighting Duration":"Undisclosed","Region":"Michigan","Object Features":"Unknown","Weather Factors":"Unknown","divs":["sighting detailsi captured this picture of a craft while taking photos of a severe storm. the day was june 17th, 2013 at 4:58pm (est). unfortunately, there was no sound from this craft, nor did it get my attention while shooting this picture. sad, i did not get the opportunity to watch it. a couple of weeks after i took the picture, i noticed a cigar shape object just underneath a severe storm cloud. as i zoomed into this object, i noticed it had little resemblance of an airliner. i know there wasn't any aircraft flying in the area of this severe storm, because the intensity of the storm was extremely high. i am about 40 miles away from any domestic\\international airports. they do not take this area as a flight path due to the military airbase about 3 miles away. also, there was no military planes flying due to the weather conditions. they do not fly at this time of day, even if it is a clear day. this ufo seemed to have been hovering underneath this storm. it is approximately 1 mile from my residence. i took the picture looking north. in the top, left hand area of the picture, you can see the craft relatively clear. i enhanced a couple of the copies of the original picture and also included the non enhanced picture of the ufo. it made it easier to see the craft with the enhancements. the other two pictures are the same areas of the storm, but taken in different locations. only a 1.5 minute difference between all 3 pictures. these pictures are not enhanced. file 1: original picture file 2: sepia enhanced file 3: color enhanced file 4: picture taken just before craft is visible file 5: first picture taken of storm. (2 behind pictured craft)"],"Log Number":"US-07242013-0018","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Longitude":"-82.927243","map":"<A HREF = \"http://maps.google.com/maps?q=42.670876,+-82.927243(49160)&iwloc=A&hl=en\"> mufon case (49160) map </A>","Disposition":"Unresolved"}