{"Country":"United States","Case Number":"49169","Latitude":"31.971449","Source":"MUFON","Weather Factors":"Unknown","City":"Undisclosed","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=31.971449,+-99.898723(49169)&iwloc=A&hl=en\"> mufon case (49169) map </A>","Viewing Distance":"101-500 Feet","Region":"Texas","Object Shape":"Circle, Disc","Disposition":"Unresolved","Object Features":"Unknown","trends":[],"files":["/var/www/straped/mufon/html2text/49169.html.txt","/var/www/straped/mufon/org/49169.html"],"Date of the Event":"07/22/2013 09:00 UTC","divs":["Sighting DetailsOn the 7-22-13, I was traveling by myself northwest down 410. I exited on Northwest Military Drive around 9:00 pm. I first noticed the red, blue and green lights spinning in a circular motion. I wasn't sure what i was looking at, but after noticing how it was hovering, disappearing and moving in a southerly to northerly path and changing direction of flight at incredible speeds I could only guess it was a strange spacecraft. Since there is no turn around coming off Northwest Military I had to turn around on the first residential street to my right. I turned around and waited at the light, but could not see the flying object. I waited for a few minutes trying to locate the craft. When the light turned green I turned to my left and the craft appeared to me again this time on my left side. It felt like it was hovering so close to my vehicle, but i couldn't make out how big the object was. It stayed hovering right off the side of the street, but i didn't notice anyone else slowing down to look. It felt like i was the only one seeing this thing. I was excited to see the object, but i felt it was only trying to make an appearance to me. I cant believe no one else has reported this event it was right off the freaking freeway. I lost sight of the object after I turned crossed over the bridge heading toward the stoplight. I turned left and entered the 410 entrance going back northeast toward North Star Mall. I looked to my left and noticed it faded away into the night. It was pretty clear that night and we had a lot of moonlight."],"Tags":"City","Summary":"Exiting Northwest Military Drive coming from 410 east.","Log Number":"US-07242013-0027","Date Submitted":"07/24/2013 11:58 UTC","Object Flight Path":"Hovering then path,Path with directional change","Longitude":"-99.898723"}