{"Object Shape":"Disc","Region":"Colorado","Disposition":"Unresolved","trends":["There have been 18 other sightings in Loveland","There were no other sightings in Loveland on or around July 24th 2013"],"Case Number":"49168","Object Flight Path":"Path with directional change","Summary":"{nd} I observed a goldish-coppery disk to the north, moving west, it abrubtly banked northwest allowing me to see the underside, leveled out and moved northwest farther into clouds.","divs":["Sighting DetailsI live in west Loveland,Colorado, near the foothills, I was grilling on my patio on the west side of the house. It was near dusk, but still light out.My grill faces east. I turned and looked southwest (over my right shoulder)observing the clouds low over the mountains had kind of a smoky look to it.It made me wonder if we had another forest fire in the area.I then turned back to the grill to turn my dinner over and stepped back to the left a little and movement in the sky to the north caught my attention. There was low -lying cloud cover and the object was traveling in the base of the clouds. It was disk shaped and traveling from east to west. There was absolutely no sound except an airplane in the distance somewhere and it was so low in the clouds that it almost looked like it had a slight layer of mist around it. The disk shaped object traveled slowly to the west, then banked to the north west allowing me to see the entire underside of it. It headed north into the clouds. I stayed there looking for it for about 30 seconds and caught a glimpse of it in a break in the clouds, just for a few seconds as it was flying away from me, and then it disappeared. There were no lights on it when I saw it, and it moved silently and smoothly."],"Viewing Distance":"Over One Mile","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.404356,+-105.105361(49168)&iwloc=A&hl=en\"> mufon case (49168) map </A>","Date Submitted":"07/24/2013 11:40 UTC","City":"Loveland","Sighting Duration":"Undisclosed","Tags":"City","Log Number":"US-07242013-0026","Date of the Event":"07/24/2013 08:02 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/49168.html.txt","/var/www/straped/mufon/org/49168.html"],"Latitude":"40.404356","Country":"United States","Object Features":"Other","Longitude":"-105.105361"}