{"Weather Factors":"Unknown","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/49163.html.txt","/var/www/straped/mufon/org/49163.html"],"Longitude":"-99.852893","map":"<A HREF = \"http://maps.google.com/maps?q=30.527691,+-99.852893(49163)&iwloc=A&hl=en\"> mufon case (49163) map </A>","Tags":"City","Object Flight Path":"Straight-line path","Country":"United States","City":"El Paso","Region":"Texas","Object Features":"None","Latitude":"30.527691","Summary":"I was driving tractor trailer as a full fledged professional driver after completeing my CDL course and OTR training.","Date of the Event":"07/10/2004 10:30 UTC","Sighting Duration":"Undisclosed","trends":["There have been 39 other sightings in El Paso","There were no other sightings in El Paso on or around July 10th 2004"],"Case Number":"49163","Object Shape":"Disc","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-07242013-0021","Date Submitted":"07/24/2013 08:56 UTC","Source":"MUFON","divs":["Sighting DetailsI had crossing Texas by nightfall on my mind and traffic was easy. The weather was cooler than usual and I was confident I would make my way to Atlanta Georgia on time. I watched this craft which I thought I was dreaming or maybe after viewing several in my youth, I might be getting used to seeing them. Anyway I opened my eyes as wide as I could to see what I belived to be a space craft traveling pretty fast maybe 150-200 mph then speed up to 500 mph in a couple seconds. It was coming right at me then passed right in front of me and I thought it was going to attack me or something. Then I saw a US military aircraft, guessing F-16 attempting to follow it. 30 seconds later another F-16 followed but on a slightly northwest path meaning the craft traveling south to north followed by thefirst F-16 South to Nortth must have changed direction to have the second F-16 head NW. There were no other vehicles on that stretch of Interstate 10 for a 15-20 minutes, which might or might not be normal.I had thought I missed some kind of public announcement about alien craft being chased PARK IT until further notice.I looked back on the incident when I stopped in Midland Texas for a soda and ask if any government announcements and the cashier looked at me kind of irritated.As I left the store I remember thinking if you saw what I just saw an hour or soago you would ...Et was being chased.... anyway Atlanta here I come."]}