{"Log Number":"US-07252013-0008","Summary":"Team driving to Portland Oregon from Denver Colorado, my teammate and I watched a craft come from the SW and pass in front of us and continued on NE","Region":"Idaho","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Tags":"City","Object Shape":"Disc","Source":"MUFON","Case Number":"49177","Date Submitted":"07/25/2013 10:15 UTC","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 69 other sightings in Boise","There were no other sightings in Boise on or around February 10th 2005"],"Latitude":"43.590807","files":["/var/www/straped/mufon/html2text/49177.html.txt","/var/www/straped/mufon/org/49177.html"],"Country":"United States","Date of the Event":"02/10/2005 12:00 UTC","Object Features":"Dome","Longitude":"-116.301631","map":"<A HREF = \"http://maps.google.com/maps?q=43.590807,+-116.301631(49177)&iwloc=A&hl=en\"> mufon case (49177) map </A>","Object Flight Path":"Straight-line path,Path with directional change","divs":["Sighting DetailsI had been a solo driver and the company wanted me to team up so I could train incoming truck driving students. A small world my first trainee was a forman from Circus Vargus, where I had worked in 1984.20 years later we meet,he left the circus for commercial driving. His name is John, nickname was Smerf. He was driving and I was in the sleeper berth. I went up front to check on his awareness and he joked about driving all the way to Portland, Oregon. I waited a couple hours and when I returned to the passenger seat we made plans to change out at the next truck stop, maybe just before Boise, Idaho. There was an object I just glanced at and he brought my attention back to it. As the craft drew closer we both recognized it to be a UFO. The path it took was from SW of I 84 and continued to the NE at 300-400 mph. It made a loud noise as it changed direction slightly NNE from NE, possibly from passing within a hundred yards of us. He stated that 'do not tell anyone of this and said he would deny it all'. The dispatcher contacted us and asked if I had divulged the UFO sighting at Hazleton, PA. I said \"what are you talking about?\" Dispatcher- called me into the terminal and I was questioned about both incidents. I did not disclose any others to protect myself from fear that I would scare new students, costing my employment. The interview went well and the supervisor said \"If that's what he saw, thats what he saw\"."],"City":"Boise","Disposition":"Unresolved"}