{"Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","divs":["Sighting DetailsI had expected the unusual during my travelers and these four objects seemed to want to get the attention of all in the area.I was driving east on I 70 outside of Lawrence Kansas when I noticed some lights doing ovals in the sky. They were not attempting to hide anything except the fact that maybe they would make actual physical contact and maybe they wouldn't. To display an aerial acrobat maneuvers with four participants in front of traffic on I 70 at such high speeds was nothing less than WATCH THIS!!!!!! Three illuminated and one not illuminated crafts started from my SE and maneuvered south while doing ovals about a mile in diameter. Each within a quarter mile of the other and all stopped after their second oval instantly about a mile south from their starting point. The fourth maneuvered west and disappeared and the illuminated three stayed in position for 2-3 minutes and then shrank into the southern horizon, maybe to show off down on I 20 or something.I am going back to truck driving and will report any sightings at my ealiest opportunity. I needed to get these in order before I start my next voyage in August."],"Object Shape":"Disc, Sphere","Country":"United States","Disposition":"Unresolved","Date Submitted":"07/25/2013 10:45 UTC","trends":["There have been 18 other sightings in Lawrence","There were no other sightings in Lawrence on or around September 10th 2004"],"files":["/var/www/straped/mufon/html2text/49178.html.txt","/var/www/straped/mufon/org/49178.html"],"Region":"Kansas","Object Features":"None","Log Number":"US-07252013-0009","Longitude":"-95.249135","Sighting Duration":"Undisclosed","Case Number":"49178","map":"<A HREF = \"http://maps.google.com/maps?q=38.958695,+-95.249135(49178)&iwloc=A&hl=en\"> mufon case (49178) map </A>","Date of the Event":"09/10/2004 12:00 UTC","Summary":"Driving tractor trailer from Denver to Chicago Ill. I watched three bright white, illuminated crafts do ovals across the corn fields.","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","City":"Lawrence","Latitude":"38.958695","Tags":"City"}