{"City":"Hazleton","Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Region":"Pennsylvania","Date Submitted":"07/25/2013 09:43 UTC","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Sighting Duration":"Undisclosed","trends":["There have been 5 other sightings in Hazleton","There were no other sightings in Hazleton on or around October 28th 2004"],"Longitude":"-91.905604","Object Shape":"Cone, Disc","Country":"United States","Summary":"I had picked up in Hazleton PA and headed north to get on I80 west. As I approache I 80 I saw a cone shaped craft hovering just northeast. There were some trees but as I got on I80 it was clear that this was not any regular aircraft.","Latitude":"42.617448","Date of the Event":"10/28/2004 10:30 UTC","Log Number":"US-07252013-0006","Object Features":"Patterned Surface, Louvres","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=42.617448,+-91.905604(49175)&iwloc=A&hl=en\"> mufon case (49175) map </A>","files":["/var/www/straped/mufon/html2text/49175.html.txt","/var/www/straped/mufon/org/49175.html"],"divs":["Sighting DetailsDriving for a national carrier I expected to see the country and enjoyed the experience. My pick ups and deliveries on occassion to Hazleton,Pennsylvania usually went smoothly and this one did as well. Starting to make the connection onto I 80 I noticed an object 30 x 50 feet cone shaped, silver with black lines running down it off to my right, about 300 feet up. Looking through the trees I first thought it was some building or something, but as I cleared the trees, I recognized it to be hovering almost directly over I 80. I proceeded west and noticed a larger craft just above it, a huge disc with a sharp edge that tapered to the center. The lower section of the craft lowered down while hovering and I did not see the smaller craft after so I presume it entered the larger craft. The lower section appeared to be a louvered non rotating level of the craft, maybe to dispatch and accept smaller craft. I looked over I 80 to the eastbound traffic and nobody was looking around up or down. Maybe fear, but a couple were pointing towards the large craft and at first were surprised then kind of fearful. I proceeded on to my destination all the while checking the CB and AM<FM radio for some information. 50 -100 people saw the large craft and I don't know how many saw the small craft."],"Case Number":"49175","Source":"MUFON"}