{"Region":"Phuket","Longitude":"98.363882","City":"Phuket","Case Number":"49188","Log Number":"TH-07252013-0019","Object Shape":"Disc","Date Submitted":"07/25/2013 10:03 UTC","Summary":"Appeared on photos and video after both were taken to capture a halow around the sun.","Sighting Duration":"Undisclosed","Disposition":"Unresolved","divs":["Sighting DetailsMy girlfriend was involved in a Buddhist ceremony at her work in Phuket Thailand. The purpose of the ceremony was to acknowledge and show respect to spirits on the property and her workplace building, which happens to be a former cremation facility for victims of the recent Tsunami. Immediately after the ceremony a perfect halo formed around the sun. She photographed and videoed this halo with her iphone. The video shows a red dot moving quickly across the screen 2 times in different directions very fast with no distinct pattern. The photos show a red object, when enlarged appear to be a flying saucer. She never saw this object until reviewing the pics, hence she only saw the object on film, which will be attached below. The object appears to be very far from Earth and moving at Godspeed. Something else worth noting about the ceremony, which involved Buddhist Monks and a trained ceremony leader was that at least two attendees of the ceremony saw a man walking about the ceremony that others did not see. We know this because they both asked my girlfriend, who had arranged the ceremony, \"who is that Thai man in the fisherman pants?\" My girlfriend replied \"What Thai man in Fisherman pants? I don't see anyone\". Obviously, this Thai man was believed to be a spirit. Please understand that while i gave you a USA phone number, that is a voice-mail only, as i am in Thailand. Please contact me by email if you want and we can arrange a skype call in necessary. Geoff"],"Source":"MUFON","Viewing Distance":"Unknown","Latitude":"7.98105","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=7.98105,+98.363882(49188)&iwloc=A&hl=en\"> mufon case (49188) map </A>","Date of the Event":"05/30/2013 12:02 UTC","Object Features":"Unknown","Country":"Thailand","trends":["There have been no other sightings in Phuket","This sighting has been favorited 1 time."],"Object Flight Path":"Unknown","files":["/var/www/straped/mufon/html2text/49188.html.txt","/var/www/straped/mufon/org/49188.html"],"Weather Factors":"Unknown"}