{"Tags":"City","divs":["Sighting DetailsSaturday night July 20th 2013 my family wanted to have a small bondfire in the yard so I got the wood in the pit and started the fire. A little time later my 10 year old daughter was on our deck with a friend said look dad a light. I looked up towards the north and I seen a white ball heading twords us moving quite fast. It passed over us me my girlfriend my 10 year old daughter and her 8 year old friend all seen it. Afterwards everyone went back into the house to do something and I stood in the lawn looking twords the south where the object was last seen. I waited a couple of minuets and was about to go back into the house my self when I started to see the object again this time moving from the south to the north almost the same exact trajectory except in reverse. I yelled for my girlfriend who was still in the house. She came out and said what? I said look! here it comes again. I was pointing at it and as it got directly above our heads it pulsated or got really bright I would say about three or four times its normal size this lasted only very briefly then it shrunk down to the size when I first seen it. We stood there in amazement and I said to my girlfriend did you see that? and she said yea I seen it. I said I told you I have been seeing things like this now do you believe me and she said yes I believe you now. In July of 2010 my daughter and I seen one just like this one but it flew much closer in the sky than this one I would say right above tree top level. My daughter is more of a star gazer as I am she seems to spot them more often that I do. A month or so earlier of this year we were fishing at sawmill bridge in Okoboji, Iowa and she said look dad a light. There was a small ball flying from the west to the east over East lake Okoboji so I have seen two this year."],"Summary":"A small solid white ball of light.","Weather Factors":"Unknown","Region":"Iowa","Disposition":"Unresolved","Longitude":"-95.094989","City":"Spencer","Object Features":"None","Case Number":"49182","files":["/var/www/straped/mufon/html2text/49182.html.txt","/var/www/straped/mufon/org/49182.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.112355,+-95.094989(49182)&iwloc=A&hl=en\"> mufon case (49182) map </A>","Date Submitted":"07/25/2013 01:58 UTC","Object Shape":"Sphere","Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Latitude":"43.112355","Date of the Event":"07/20/2013 12:00 UTC","Log Number":"US-07252013-0013","Sighting Duration":"Undisclosed","Country":"United States","trends":["There have been 4 other sightings in Spencer","There were no other sightings in Spencer on or around July 20th 2013"]}