{"Log Number":"US-07252013-0012","Disposition":"Unresolved","Country":"United States","Latitude":"35.113412","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Date of the Event":"07/21/2004 11:30 UTC","City":"Memphis","Date Submitted":"07/25/2013 01:07 UTC","Case Number":"49181","Object Shape":"Disc, Oval, Sphere","Tags":"City","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Source":"MUFON","Object Features":"Dome","trends":["There have been 62 other sightings in Memphis","There were no other sightings in Memphis on or around July 21st 2004"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.113412,+-89.947998(49181)&iwloc=A&hl=en\"> mufon case (49181) map </A>","divs":["Sighting DetailsI had seen lights previously in my years as a carpenter and these were similar to the one other in Santa Barbara, Ca. I felt a little uncomfortable and decided to take a break at the truck stop, where I was followed by another driver who assured me that he had seen the exact same thing. The lights on this time of day? They were traveling south in a triangle formation, possibly 300-400 mph. As my angle of view changed slightly I could see a clear dome shape on top and a typical disc shape body. The formation continued south and shrank out of sight not speeding up but did change their altitude and it seemed that they were going to land. Tractor trailer operators transporting cargo are not allowed to leave their contracted route. I really wanted to go see this landing but not having a safe route directly south I wrote it off to maybe someday. I mentioned it to my sister later that year after another sighting but she preferred as most to keep it to yourself. Safe to say as many UFO's that I have been able to describe in detail, the two or three others that I have seen from just out of range will be left to curiousity down the road."],"files":["/var/www/straped/mufon/html2text/49181.html.txt","/var/www/straped/mufon/org/49181.html"],"Summary":"Enroute to Atlanta I watched three lights travel from my SE to the south in blue sky and perfect visibility.","Longitude":"-89.947998","Region":"Tennessee"}