{"City":"Charing Cross","Date of the Event":"07/18/2013 11:40 UTC","Viewing Distance":"Unknown","Region":"Ontario","divs":["Sighting DetailsAt approximately 11:30 pm on July 18, 2013, a friend and I walked back the lane way on my parents' farm to smoke some marijuana and look out at the stars. After we finished smoking and spent some time looking into the sky, we noticed a bright light in the sky to the South East. We are both long time smokers and have become quite immune to most of the mind-altering effects of the drug. We have never experienced visual hallucinations and were very confident that we were not simply \"seeing things.\" We have estimated that we noticed this light at approximately 11:40pm. The object appeared very much like a regular star but it was brighter than all other stars in the sky. We soon noticed that it was moving up and to the South West on a curved flight path. We observed the light either growing dimmer and getting further away from us (or both) as it moving along its flight path. We discussed what it was that we were looking at, concluding that it was likely we were witnessed a jet's afterburners as it flew off into the distance. However, we found it strange that we heard absolutely no noise. After approximately 20-30 seconds of watching the object grow dimmer in the sky, we lost sight of it. Within another few seconds we saw the object again (or another similar object) around the same area of the sky. When we first observed it it was hovering perfectly still in the sky, but within a few seconds it began moving laterally. We took note of its position in relation to a couple nearby stars, and were able to confirm that it was indeed moving in relation to these reference points. Its flight path was erratic and unpredictable. On more than one occasion it instantaneously switched directions, then switched again 2-3 seconds later. It moved mostly horizontally in the sky, but at times it moved up and down as well. The flight path was often curved, rather than straight. It often stopped to hover for a time, then continued moving again. At one point the object hovered in the same position in the sky while two planes flew by on opposite sides along linear flight paths. This made for easy reference and assured us that we were not looking at some ordinary plane. After watching the erratic flight path for approximately 2-3 minutes and losing sight of it, we noticed that the same object or another object had appeared lower in the sky. This object was never seen moving, and appeared to be either larger or closer to us (or both). It had multiple lights on it that flashed different colours (white, yellow and red) in a seemingly random manner. We observed this object for approximately 30 seconds to a minute before observing it instantaneously disappear from sight. This was the end of the sighting(s), although we spent some time scanning for sky for more objects. We were actively trying to determine what we were looking at for most of the sighting. Although we thought it may have been a jet during the first phase of the sighting, once the object began changing directions in the sky we realized it could not have been any conventional aircraft. Both of us have had a long standing interest in the UFO phenomenon, and we eventually concluded that we were looking at a genuine \"UFO,\" whatever that entails. This got us quite excited, since we had both wanted to see a UFO for years now. We both consider the sighting to have been a very significant moment in our lives. My friend considers it to have solidified his belief in UFOs, while I consider it to have been something of a spiritual experience. I've been confident that the UFO phenomenon in real for approximately 3 years now, so it did little to alter my beliefs."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.356376,+-82.126757(49180)&iwloc=A&hl=en\"> mufon case (49180) map </A>","Longitude":"-82.126757","Object Shape":"Star-like","Disposition":"Unresolved","Source":"MUFON","Object Features":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/49180.html.txt","/var/www/straped/mufon/org/49180.html"],"Case Number":"49180","Sighting Duration":"00:05:00","Country":"Canada","trends":["There have been no other sightings in Charing Cross","This sighting has never been favorited."],"Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Log Number":"CA-07252013-0011","Summary":"Star-like object seen moving erratically in the sky and hovering at times. Last seen hovering low in the sky and flashing different coloured lights.","Date Submitted":"07/25/2013 12:26 UTC","Latitude":"42.356376","Weather Factors":"Unknown"}