{"Object Shape":"Star-like, Triangle","Object Flight Path":"Stationary","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/49194.html.txt","/var/www/straped/mufon/org/49194.html"],"Log Number":"US-07262013-0004","Date of the Event":"07/25/2013 09:32 UTC","Object Features":"None","Region":"California","Tags":"City","Sighting Duration":"Undisclosed","Longitude":"-117.145229","map":"<A HREF = \"http://maps.google.com/maps?q=33.706824,+-117.145229(49194)&iwloc=A&hl=en\"> mufon case (49194) map </A>","divs":["Sighting DetailsAs we were on the way out on Simpson road, we can upon what looked like a star (huge--looked as if it was failing from the sky at first) but it didn't move at all. It was a very dark night (always is here, no lights) it just hovered there about 15 stories up in air. There were 3 very bright lights with something dark behind them. No sound, no blinking lights, triangle shaped, very scary, like it knew we were watching it and they were watching us. I slowed the car to 5 mph and one other car came behind me and was watching the same thing and slowed to my speed. No honking horns or flashing lights for me to move from the other car on a 35-45 mph road. Another car put up behind the car behind me and stared too. All of us doing 5 mph, until we were going to turn into the housing tract, it disappeared completely and a second one appear at the far end of the city on a south west path. We turned on a road headed home the second one disappeared. Later, that evening around 10:30 I looked one of the upstairs window and saw it again in the southwest direction, by the time I dressed and gabbed my cell for the camera, and a ran to the front yard it was gone."],"Viewing Distance":"501 Feet - 1 Mile","Summary":"As we were on the way out on Simpson road, we can upon what looked like a star huge (looked as if it was failing from the sky) but it dont move at all. I was a very dark night (always is here, no lights) it just hovered there about 15 stories up in air","Case Number":"49194","Date Submitted":"07/26/2013 01:54 UTC","Latitude":"33.706824","Country":"United States","Source":"MUFON","trends":["There have been 4 other sightings in Menifee","There were no other sightings in Menifee on or around July 25th 2013"],"City":"Menifee","Disposition":"Unresolved"}