{"City":"Westminster","Date of the Event":"07/25/2013 10:10 UTC","files":["/var/www/straped/mufon/html2text/49195.html.txt","/var/www/straped/mufon/org/49195.html"],"Object Shape":"Triangle","Weather Factors":"Unknown","Latitude":"33.759492","trends":["There have been 8 other sightings in Westminster","There was one other sighting in Westminster on or around July 25th 2013"],"Summary":"What appeared to be the full moon rising,had a line of blinking red-orange lights that outlined the top of a triangle shape which hovered and completely evaporated above the city lights","Source":"MUFON","Case Number":"49195","divs":["sighting detailsi was unloading groceries from a late nite shopping trip and paused,as i usually do,to look at the night sky and observe whatever stars i can see beyond the city lights of the l.a.basin. there was the usual landing lights from planes approaching a nearby airport and a couple helicopters on the horizon. i was raised with an aeronautical background so i am familiar with all the air traffic that crowds this sky,especially since i am within a couple mile from a military base to the west of me. a glowing round white yellowish shape hovered in the eastern black sky and i at first thought it was the moon behind some clouds. upon closer observation i noticed a straight line of blinking\\pulsating red-orange lights above the shape. i have been witness to multiple ufo sightings over the span of decades and i stood still and watched it,noticing that there was a darker outline of a triangle. at that point,the lower whitish light disappeared and one by one,without moving,changing altitude, or direction,the red-orange lights in a row disappeared...and the sky reflected once again the city glow and stars where the object was. since it was a distance away, there's nothing else i can add except it was an unusual object in the clear night sky."],"Object Flight Path":"Stationary","Country":"United States","Log Number":"US-07262013-0005","Sighting Duration":"Undisclosed","Tags":"City","Viewing Distance":"Over One Mile","Object Features":"Unknown","Date Submitted":"07/26/2013 02:13 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.759492,+-117.988602(49195)&iwloc=A&hl=en\"> mufon case (49195) map </A>","Disposition":"Unresolved","Region":"California","Longitude":"-117.988602"}