{"Sighting Duration":"Undisclosed","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around July 25th 2013"],"City":"San Antonio","map":"<A HREF = \"http://maps.google.com/maps?q=29.525519,+-98.509933(49191)&iwloc=A&hl=en\"> mufon case (49191) map </A>","Country":"United States","Weather Factors":"Unknown","Date of the Event":"07/25/2013 08:47 UTC","divs":["sighting detailscastle hills, texas: family had just arrived home after dinner and short errand from local drug store at around 8:45. as we exited the car from the driveway i looked into the horizon and i noticed a bright green and red light in the air and informed the family. we live close to an airport and first thought it to be a plane. however it was hovering and then moved to the left and down slowly and then to the right and down much quickly but not in a normal airplane or helicopter pattern. before we could think about recording it on the phone it had moved downward and we lost sight of it behind the trees across the street. all members of the family, two adults and two teens agreed that we saw the same thing and felt that it did not fit the description and\\or movement of a plane or helicopter (which we see daily in our area). the beauty of it was that the lights were so bright. it had red to the left of the object that appeared like a volume meter line and green to the right; something like 2 rectangles in red followed by 5 or 6 rectangles in green. we must have been staring at it for about a minute to a minute and a half before we lost sight of it. whatever it was that we saw it was an experience we felt we should share."],"Source":"MUFON","Latitude":"29.525519","Date Submitted":"07/26/2013 12:26 UTC","Tags":"City","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Log Number":"US-07262013-0001","Region":"Texas","Case Number":"49191","Viewing Distance":"Over One Mile","Object Shape":"Other","Object Features":"Patterned Surface","Summary":"Bright green lights and a bright red light on the far left of what appeared to be a rectangular/oblong object with random flight pattern","files":["/var/www/straped/mufon/html2text/49191.html.txt","/var/www/straped/mufon/org/49191.html"],"Disposition":"Unresolved","Longitude":"-98.509933"}