{"Object Shape":"Star-like","Source":"MUFON","Disposition":"Unresolved","Longitude":"-86.263169","files":["/var/www/straped/mufon/html2text/49208.html.txt","/var/www/straped/mufon/org/49208.html"],"Object Features":"Other","Sighting Duration":"Undisclosed","City":"Bowling Green","trends":["There have been 25 other sightings in Bowling Green","There were no other sightings in Bowling Green on or around July 15th 2013"],"Object Flight Path":"Path with directional change","Log Number":"US-07262013-0017","Summary":"Routinely observe starlike objects very high with varying speeds, varying brightness and direction changes","Weather Factors":"Unknown","Tags":"City","Date Submitted":"07/26/2013 08:54 UTC","Case Number":"49208","Region":"Kentucky","Country":"United States","Viewing Distance":"Unknown","Date of the Event":"07/15/2013 09:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.898353,+-86.263169(49208)&iwloc=A&hl=en\"> mufon case (49208) map </A>","Latitude":"36.898353","divs":["sighting detailsi routinely notice star like objects seemingly at extremely high altitudes moving to and from across the night sky. i live in a rural area with few light sources providing a good view of stars on clear nights. i also routinely have commercial aircraft pass my viewing area (in my back yard) which has made picking out the other objects easier as their characteristics share little in common. my initial purpose for viewing the night sky was just star gazing because i used to live in ft. lauderdale where stars are barely visible, but in just looking up i began noticing what i thought to be a star begin to move. at first i dismissed the moving lights as shooting stars but quickly noticed they did not move as such. at times the lights seem to be on a steady path and then will change direction by approximately 3 to 10 degrees in an apparent short distance. additionally their movement is best described as watching a frog swim. most always moving forward but slowing momentarily (like rotating your arms back for the next swimming stroke) then continuing at its normal pace. as well the lights will vary greatly in their intensity, from some barely visible and hard to track to some going very bright then back to a steady glow as they travel. i lose sight of them sometimes instantly,then others just fade away and then others pass out of sight due to my tree line. my feelings are just one of wonder during and after these sightings, basic curiosity i guess. on occasion i have pointed them out to my wife and\\or visiting friends and they don't really have an explanation either. not looking for any news crew to visit me or anything but some intern or someone with a decent telescope so we can get a closer look to try and determine what these lights may be. either way they make looking up at the night sky that much more interesting. would love to video or photograph these lights but the altitude appears so high and i do not have any sophisticated equipment."]}