{"Longitude":"-122.297903","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=47.841046,+-122.297903(49202)&iwloc=A&hl=en\"> mufon case (49202) map </A>","Latitude":"47.841046","Country":"United States","Disposition":"Unresolved","Object Flight Path":"Stationary","Log Number":"US-07262013-0012","divs":["Sighting DetailsI had just got off work was going out to a bar saw ufo at slight angle on roof top of gulf gas station 3 small blue people like on deck of ufo & one white person like looked like boss they were working on deck I watched them for 15-20 minutes than left to go to tavern just a little ways about 2 miles away. they may have had a helmet on that was 45 years ago also back in 1964 just a little ways from that at a lake ufo'[s would show up almost ever day above that lake cant remember the name but it was just off of hwy.99 I would remember if I herd it again also in that same time period I saw one fly over Mc Calsters motor cycle shop its got another name now but its still a motor cycle shop I think we moved away a few years ago. just off hwy.99 I can take you where its at I still remember that. I am talking like you were sitting next to me I used to have a picture of the one at the lake don't know what ever happened to it just to long ago I went back ther the next day it was not there the ufo people were like 3-4 ft. tall guessing I waved one blue waved back the ufo was disk shaped I went to us air force office they gave me about 4 page of papers to fill out I never did. I was not scard of them at all I thought they were friendly . unlike all tv shows 1. watching ufo 2. light on gas station 3.working on it on deck 4. stationary on gas station roof top about 3 ft. above guessing 5.just watched workers work they may have had a deck panel up to work 6.i watched till I left about 15-20 minutes email me if you want to talk about it for some reason I want to tell people about it"],"Sighting Duration":"00:20:00","Object Features":"Patterned Surface","Date of the Event":"12/22/1968 12:00 UTC","Object Shape":"Disc","Source":"MUFON","trends":["There have been 9 other sightings in Lynnwood","There were no other sightings in Lynnwood on or around December 22nd 1968"],"Tags":"City","Summary":"houvering above gulf gas station roof at slight angle","City":"Lynnwood","Region":"Washington","files":["/var/www/straped/mufon/html2text/49202.html.txt","/var/www/straped/mufon/org/49202.html"],"Weather Factors":"Unknown","Date Submitted":"07/26/2013 06:05 UTC","Case Number":"49202"}