{"Latitude":"41.79626","Date Submitted":"07/26/2013 08:43 UTC","Summary":"It was something that I have never seen before and I always have an eye to the sky!","Sighting Duration":"Undisclosed","trends":["There has been one other sighting in New Buffalo","There were no other sightings in New Buffalo on or around July 24th 2013"],"Disposition":"Unresolved","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/49207.html.txt","/var/www/straped/mufon/org/49207.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.79626,+-86.736165(49207)&iwloc=A&hl=en\"> mufon case (49207) map </A>","Object Features":"Unknown","Country":"United States","divs":["Sighting DetailsWe were on our way to Four Winds Casino in New Buffalo. While driving the sun reflected off of an object in the sky. It shone a very bright silver when the sunlight hit it then quickly became white. Even though it matched the clouds we were still able to keep an eye on the orb. It was moving in a straight line when I realized it had gone back the other way just a bit and was no longer going in a straight path, it had come to a dead stop. I saw a plane not far from the object so I knew that it was not moving. What shocked us the most was watching this orb for minutes, all of the sudden it had just vanished. It was nowhere to be found. We kept an eye to the sky for sometime afterwards thinking that somehow it had gone behind the clouds, however if that were the case it would have come out. but it never returned. We had a wide open view of the sky and waited for it to show itself again. I never saw it reappear. It was AMAZING!! I felt like I had just witnessed something that was once in a lifetime!"],"Object Flight Path":"Hovering then path,Straight-line path","Region":"Michigan","Date of the Event":"07/24/2013 12:00 UTC","Weather Factors":"Unknown","Longitude":"-86.736165","Log Number":"US-07262013-0016","Tags":"City","Case Number":"49207","Source":"MUFON","City":"New Buffalo","Object Shape":"Circle, Sphere"}