{"Sighting Duration":"Undisclosed","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Weather Factors":"Unknown","Object Features":"None","Date of the Event":"07/26/2013 10:15 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/49210.html.txt","/var/www/straped/mufon/org/49210.html"],"Tags":"City","Longitude":"-72.657697","Source":"MUFON","City":"Windsor Locks","map":"<A HREF = \"http://maps.google.com/maps?q=41.913475,+-72.657697(49210)&iwloc=A&hl=en\"> mufon case (49210) map </A>","Date Submitted":"07/26/2013 10:45 UTC","Log Number":"US-07262013-0019","trends":["There have been no other sightings in Windsor Locks","This sighting has never been favorited."],"Summary":"starlike ufo moving all around at first became very bright a few times blinked out then came back then moved north not in one direction fading in and out","Object Shape":"Circle, Flash, Star-like","Latitude":"41.913475","Case Number":"49210","divs":["Sighting DetailsI went out side to smoke a cig at 10 fifteen pm and I had a feeling that I was going to see something. I was staring at the sky, there was lots of stars, I had a feeling I was going to see something and then I did. It was very wierd I couldnt stop staring at it. It was first like a normal star but it was moving back and forth, not the whole sky just a small part but it was making directional changes, then it got really bright, brighter than any star and it was still moving, not a constant speed either I was in awe. It then blinked out and came back like it was when I first saw it. It moved north, getting bright and dim a few times. I know this was not some shooting star, and not anything else because it changed directions a few times. I live a mile from an airport also, I am an airplane mech, and I know planes. This was no plane. I really want someone north of me to be looking in the sky now, maybe in MASS, new hampshire, vermont, or maine. It was moving quick and dead north,I was mesmorized by it. This is not my first sighting either, and for some reason I knew I was going to see something tonight. I really want someone else to see the same thing, so I would have proof.Jon"],"Region":"Connecticut"}