{"files":["/var/www/straped/mufon/html2text/49212.html.txt","/var/www/straped/mufon/org/49212.html"],"Viewing Distance":"20 Feet or Less","Sighting Duration":"Undisclosed","Case Number":"49212","Region":"New York","divs":["Sighting DetailsMy wife and I were in North Syracuse, New York at 9:30 p.m. and I was looking up at the sky and noticed what looked to be a bright star; however, when looking longer it appeared to have a red flashing light and then would flash lights of other colors (blue, green, yellowish). This object was clearly not an airplane as it remained stationary. We drove home an alternate route and could still see this object very well in the sky and stopped our vehicle and got out to see if this was still emitting the same characteristics, which it did. Once we arrived home I got the binoculars and we went outdoors and the object was still there and actually there was another in close proximity with the same blinking lights. The time frame of this was now well over an hour and a half. It is now 10:53 p.m. and the original object seems to remain in the same location; however, the second object has moved in a westerly direction. I am sure this is not a star and would like to know if others have seen or reported the same object(s). This of course has stirred some excitement and I will be looking again tomorrow night to see if this is still there."],"Summary":"Unidentifiable flashing lights stationary in the sky","City":"Kirkville","trends":["There has been one other sighting in Kirkville","There were no other sightings in Kirkville on or around July 26th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.148305,+-75.925334(49212)&iwloc=A&hl=en\"> mufon case (49212) map </A>","Latitude":"43.148305","Date of the Event":"07/26/2013 09:30 UTC","Weather Factors":"Unknown","Country":"United States","Log Number":"US-07262013-0021","Longitude":"-75.925334","Object Flight Path":"Stationary,Path with directional change","Date Submitted":"07/26/2013 11:07 UTC","Tags":"City","Source":"MUFON","Disposition":"Unresolved","Object Features":"None","Object Shape":"Sphere, Star-like"}