{"Date Submitted":"07/26/2013 11:02 UTC","Source":"MUFON","Summary":"I saw a bright orange-red object that I could not identify. Never have seen anything like that in the sky.","Latitude":"39.816747","Date of the Event":"07/26/2013 09:55 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.816747,+-86.248057(49211)&iwloc=A&hl=en\"> mufon case (49211) map </A>","divs":["Sighting DetailsI was coming home from a ballgame in Indianapolis driving due west. I turned south and noticed a bright orange light in the sky to the east that I'd never seen in that spot. I live in Speedway. I first noticed the object because it was so bright. I first thought it might be a helicopter or a firework. I saw a helicopter to the south and could readily see the difference. I had a CD playing and my windows were closed so I didn't hear anything. It had been sprinkling a little too. I thought okay if this is a firework it is going to descend or make a sound or something, but nothing happened. It just stayed there and glowed very bright orange-red. I thought about phoning my sister who was in the house but I didn't want to take my eyes off of the light so I didn't. I walked up the driveway and the light just diminished and finally vanished without a sound from where I was. I couldn't tell if it ascended and disappeared or disappeared where it was hovering. It disappeared into a tiny dot to nothing. The whole thing lasted no more than 3 minutes. I came in the house and told my sister I had just seen a UFO. It was a UFO to me. I've never seen a helicopter shine orange-red and without flashing lights like the helicopter I saw in the sky at the same time to the south, nor have I seen one be silent. From what I could tell it seemed to pulsate some but stayed bright orange-red. Thank you for being here so I could report this! It didn't upset me, but I will remain puzzled by what I saw."],"files":["/var/www/straped/mufon/html2text/49211.html.txt","/var/www/straped/mufon/org/49211.html"],"Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Log Number":"US-07262013-0020","Weather Factors":"Unknown","Longitude":"-86.248057","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","trends":["There have been no other sightings in Speedway","This sighting has never been favorited."],"City":"Speedway","Object Shape":"Circle, Sphere","Region":"Indiana","Country":"United States","Case Number":"49211","Disposition":"Unresolved","Tags":"City"}