{"Object Shape":"Sphere","Date of the Event":"06/19/2004 08:00 UTC","files":["/var/www/straped/mufon/html2text/49222.html.txt","/var/www/straped/mufon/org/49222.html"],"Tags":"City","Log Number":"US-07272013-0010","Latitude":"33.967651","trends":["There have been 5 other sightings in Portales","There were no other sightings in Portales on or around June 19th 2004"],"Country":"United States","Region":"New Mexico","Viewing Distance":"Over One Mile","City":"Portales","Summary":"Driving north, looking to my left I saw 3 yellow orbs that appeared to spin clockwise. If you laid a clock face down flat, the direction the hands turn.","Longitude":"-103.265901","Sighting Duration":"Undisclosed","Object Features":"Unknown","divs":["Sighting DetailsMy father was driving, we were in a 90s ford pickup. We were having a casual conversation, and while I was turned facing him, my attention was caught by turning lights. From my angle, it was visually below my father's jaw line. I have seen a meteor shower and the light and a similar \"natural\" glow, no streaks or beams like I see with artificial lights. The difference was the fact that the lights did not burn out or go any lower in the sky. The 3 lights were rotating as if, for example, if someone was holding a ball in their left hand, they would pass it around front to their right hand and from their right hand pass it around their back to their left hand and repeat. Also, as I explained in the short description, the rotation of clock hands if the clock was laid face down. As my father drove north, I watched the 3 lights rotate at the same height for less than 20 seconds until we turned away from it. There is an air force base north east of that location so I have seen many aircraft lights at night and none appeared that size, light type or stationary. There were residential lights to compare size and how high above the horizon. Lights near the horizon were much smaller and lower in comparison. I was too interested in the movement of the lights to alert my father. Kept it to myself for over a year."],"Date Submitted":"07/27/2013 12:44 UTC","Disposition":"Unresolved","Case Number":"49222","Source":"MUFON","Weather Factors":"Unknown","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=33.967651,+-103.265901(49222)&iwloc=A&hl=en\"> mufon case (49222) map </A>"}