{"Case Number":"49229","divs":["Sighting DetailsMy sister reported noticing what she thought was a satellite moving over head, but as she saw a smaller triangle of three red lights she noticed it was ONE BIG Craft and it was not a little dot up in the stars it was a HUGE Long triangle craft just over the tree tops!!! She could hear it but it was in a cannyan so it could have reflected some sound. She said it was translucent but she could still see a Body connecting the two sets of lights together and blocking the stars out behind it. It was not the typical triangle it was a lot LONGER!! This was witnessed by her and 6 other people!! Later she came home and found a footage on youtube of the SAME Exact event, time date ect omnly the night vision of the camcorder you could see no craft connecting the lights. this puzzled my sister Rebeckah!! Buy the way I am Wayne McIntee Writing this report for my sister who saw this event! the difference from the footage and her sighting is the footage shows the craft over 500 feet up! Where my sister saw the craft just over the tree tops!! Having said that it looked like Glass as she could clearly see a craft which the lights where merely lights on this huge triangle craft but the craft itself was translucent she could see the craft AND she could see the outline of it.."],"Object Flight Path":"Unknown","Date of the Event":"07/25/2013 12:00 UTC","Disposition":"Unresolved","City":"Selma","Region":"Oregon","Longitude":"-123.613015","Weather Factors":"Unknown","Source":"MUFON","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/49229.html.txt","/var/www/straped/mufon/org/49229.html"],"Object Shape":"Cone, Triangle","Sighting Duration":"00:02:00","trends":["There have been 2 other sightings in Selma","There was one other sighting in Selma on or around July 25th 2013"],"Viewing Distance":"21-100 Feet","Summary":"Very LONG Trinagle. Smalll Triangle following One red Light. Connected by a translucent craft!","Tags":"City","Latitude":"42.280871","Log Number":"US-07272013-0016","map":"<A HREF = \"http://maps.google.com/maps?q=42.280871,+-123.613015(49229)&iwloc=A&hl=en\"> mufon case (49229) map </A>","Country":"United States","Date Submitted":"07/27/2013 05:33 UTC"}