{"Region":"California","Tags":"City","Source":"MUFON","trends":["There have been 4 other sightings in Imperial Beach","There were no other sightings in Imperial Beach on or around January 15th 2013"],"Viewing Distance":"20 Feet or Less","Summary":"Photo of short creature with arms legs large head and eyes phased in an image taken of a car","Sighting Duration":"Undisclosed","Date of the Event":"01/15/2013 12:00 UTC","Log Number":"US-07272013-0019","City":"Imperial Beach","Latitude":"32.586344","divs":["Sighting DetailsHello, about 3 months ago a close friend of mine bought a new >car, she took a picture of it in her driveway in Imperial Beach here in >San Diego California, when she put it on her computer, standing there >near the front bumper (actually inside the bumper), is what looks like >an alien phased partially in and out of reality. You can even see its >feet and toes on the ground under the car. Id like to submit the photo >for analysis if possible. Its got a lot of people wondering. The friend >of mine is a nice woman with nothing to gain by faking it (she doesn't >even know how to fake it) and it scared the heck out of her. I believe >its not faked. Its a very striking image of the being. I found the >MUFON group on a mini series show that was on tv recently called Alien >Mysteries, specifically in the episode called Corina. What struck me >was the alien that Corina describes in her encounter that she saw in >her house look very similar to the one in the image of my friends new >car. My friend didn't know what to do, it scared her pretty bad. I can >email the image to you if you like. I lend a lot of credibility to this >as I have myself seen a UFO in the night sky several years ago in Long Beach California. >I believe they have been here a long time. I just cant get over how >much the being in this photo looks like the ones in the episode I mentioned. >Please take a look at it, I'd appreciate it. Please tell me where to >send the image."],"Case Number":"49232","Weather Factors":"Unknown","Disposition":"Unresolved","Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=32.586344,+-117.108635(49232)&iwloc=A&hl=en\"> mufon case (49232) map </A>","Object Features":"Other","Date Submitted":"07/27/2013 06:11 UTC","Object Flight Path":"Other","Longitude":"-117.108635","Country":"United States","files":["/var/www/straped/mufon/html2text/49232.html.txt","/var/www/straped/mufon/org/49232.html"]}