{"Viewing Distance":"Unknown","trends":["There have been no other sightings in Saguache","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Region":"Colorado","Latitude":"38.0875","Date of the Event":"07/21/2013 01:30 UTC","Case Number":"49233","Date Submitted":"07/27/2013 06:59 UTC","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/49233.html.txt","/var/www/straped/mufon/org/49233.html"],"Country":"United States","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.0875,+-106.141967(49233)&iwloc=A&hl=en\"> mufon case (49233) map </A>","Longitude":"-106.141967","Disposition":"Unresolved","City":"Saguache","Object Flight Path":"Unknown","Summary":"Trucker spouse stopped off higway to sleep and heard a pulsating noise then fell asleep and had an uncharacteristic dream, then woke and heard the noise again","divs":["Sighting DetailsMy husband is a trucker who regularly passes through a remote area of Colorado on HWY 285 near the town of Saguache. He had to stop for his required rest break to take a nap. When he went to lay down in the bunk he heard a strange and unfamiliar noise, a pulsating sound - one that he can't duplicate and has never heard before. He got up and looked in the rearview mirrors to see if the sound might be another truck parking behind him in the small pull off area. He observed nothing there, and decided to go lay down to nap. When he laid down and closed his eyes, not yet asleep, he again heard the noise, and felt that it was now coming from inside his head, which very much puzzled him, yet he fell asleep for approximately 15 minutes. He then had a very unusual and uncharacteristic dream: suddenly, he was in a very large white empty room, possibly like a warehouse. He observed his truck sitting in the room next to him. He then was levitated off the ground, turned his head to look and then his truck was no longer in the room with him. Then the room became filled with colors and his truck was again there next to him in the room. He then awoke from the dream feeling strange, but not fearful. He stated that the impression he had afterwards, was that he was just another trucker passing through as thousands of other truckers do in this area, and that he was not a person of interest to whatever it was that was occurring. He also stated that he doesn't understand why he didn't get out of the truck to look around when he heard the unfamiliar pulsating sound. His reaction did not seem to me, to be the normally curious, fearless and high adventure seeking type of reaction that I know him to possess. My husband is the type of person who has no fear of the supernatural, and made little notice of this event, other than to report it to me. He rarely has ever remembered his dreams other than occasional nightmares, which are usually of an apocalyptic nature. He is not afraid or concerned much with this event, all though he has stated that he won't be stopping on that stretch of highway again. I, however am concerned and have had 3 sightings of my own in my lifetime independent from him. I also have had childhood repeated dreams of similar origin to other abductees, of an examination origin. Memories of being in an open mall-type setting with many observers where I was told to lay on a gurney by my mother (or possibly a mother-like figure), and that it will be \"all right\", and that I needed to lay on the gurney for the BB that was inside me to be removed. These dreams trouble me as I have no recollection of having any procedures done in childhood that might trigger this type of fear-filled dream. I also had a repeated and vivid childhood (aged 3-4 years) memory of a dream where a mechanical vehicle of some sort, making a scary booming noise came to my window. The next memory in the dream is of me looking out the window (or porthole-type shape) of a craft down on to the Earth. I recall thinking in my child's mind that the Earth viewed from above looked much like a patchwork quilt. This dream occurred when I was age 3-4 years old, and I had never flown on a plane until I was much older. Around the same time of these dreams, I also had a sighting that I remember vividly. I was outdoors playing in my yard around dinner time, and I looked up into the sky. High above were 4 diamond shaped shiny craft of some sort, not moving but hanging in the sky. I recalled being terrified that \"they\" were coming to get me and ran inside hysterical. I also had a sighting around the age of 14, walking home at night around 9pm. I saw out in my peripheral vision, a white light like a falling star, traveling horizontally through the sky, but at an impossibly fast rate of speed; faster than a plane and not the same trajectory as a falling star. I observed it for less than a minute, until it was obscured by the surrounding landscape. Later in life, in my late 20's I had another sighting, this time with a witness. Vacationing in Durango, CO, myself and my then partner, sat on the deck late at night of a mountain resort. We then saw 5-6 white lights hovering stationary above a cliff peak that was across the highway from the resort. It seemed very close but we heard no sound whatsoever. The lights sat there for a minute or less, then all of them suddenly darted in different directions in a split second, and were gone. We sat there incredulous, wondering what we'd just witnessed. My ex partner was a pilot, and he knew the types of lights used on aircraft, and stated that these were not typical aircraft lights. He reported to me that he had an airborn encounter years earlier while flying his plane near the town of Seabring, FL, where he spotted a cigar-shaped flying object within his path in front of him. It was lit with a green glow and darted around in his path with abnormally jerky and seemingly impossible movements, then darted out of his vision in a split second. Due to these experiences I've encountered in my life, I have had a lifelong fear and obsession with aliens, UFO's and the unknown. I have also had pretty extreme gynecological problems throughout my life. I have had one soccerball-sized ovarian cyst removed in my 30's along with one ovary and a fallopian tube taken during this surgery. 15 years later I developed another ovarian tumor, this one the size of a cantalope or larger, which was diagnosed as a borderline ovarian cancer and lead to a complete and full hysterectomy. I truly wish to understand what all of this means and conquer the fear I have. This is what I work on now, is to combat the fear. If there is something going on that is inexplicable, I feel that having this fear will only leave me more vulnerable to negative psychological influences of some sort; or vulnerable to further unwanted experiences."],"Log Number":"US-07272013-0020","Source":"MUFON","Weather Factors":"Unknown","Tags":"City"}