{"Sighting Duration":"Undisclosed","Disposition":"Unresolved","trends":["There have been 404 other sightings in Los Angeles","There were 6 other sightings in Los Angeles on or around July 27th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.053564,+-118.237885(49243)&iwloc=A&hl=en\"> mufon case (49243) map </A>","Region":"California","divs":["sighting detailsi was outside and glanced at the sky when i saw two red\\orange lights traveling very slowly from the south at approximately 45 degrees from the horizon. i struck me odd how slowly they were traveling and were traveling on a single file path. i thought maybe they were helicopters because there is a lot of air traffic in los angeles. but i couldn't hear any sound from them. i called my wife outside so she could see them. as she came out, one of them flickered and dimmed but i could still see the object, somewhat from the light reflection from the city. it appeared round but faceted. my wife was able to see the other when it started flickering and dimming. at that point the objects were both dark except for the reflection of the city lights changed direction and headed northwest. i watched until my vision was blocked and couldn't see them anymore. their altitude could have been 1000 to 5000 feet. it was difficult to tell, there were other common aircraft in the sky such as planes and helicopters but not near these objects."],"Object Flight Path":"Path with directional change","Tags":"City","Summary":"Two bright orange/red lights traveling north one behind the other then started flickering out one after the other","Country":"United States","Date Submitted":"07/28/2013 01:24 UTC","Log Number":"US-07282013-0004","Longitude":"-118.237885","Source":"MUFON","Object Shape":"Unknown","Case Number":"49243","Date of the Event":"07/27/2013 09:51 UTC","Latitude":"34.053564","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/49243.html.txt","/var/www/straped/mufon/org/49243.html"],"City":"Los Angeles","Weather Factors":"Unknown","Object Features":"Unknown"}