{"Summary":"family outside on patio..3 adults 3 children all saw event","Sighting Duration":"Undisclosed","Log Number":"US-07282013-0017","Date of the Event":"07/27/2013 10:30 UTC","City":"Kansas City","Case Number":"49257","Tags":"City","Viewing Distance":"Over One Mile","Latitude":"39.042699","Region":"Missouri","Source":"MUFON","Weather Factors":"Unknown","Object Features":"Unknown","Object Shape":"Triangle","divs":["Sighting DetailsMy son, daughter-inlaw, myself and 3 grandchildren were outside on the patio sitting around the fireplace, the kids were playing in the yard. I was sitting facing the yard toward the SE... I saw what I at first thought was a helicopter... but it was to big and made no sound at all, I got up out of my chair for a better look and observed this very large triangle shaped object with orange-red lights, I called to my son and daughter inlaw and they then saw it too as well as the kids. At first it was gliding very slowly toward us then just hovered for several minutes, it was partially obscured by the trees so we ran out into the street to get a better view we did continue to see it for a few more seconds and then it just dissapeared. We got in the car to see if we could find it again but we did not see it again.My son estimated it to be about several football fields in size. This is the first time any of us have ever seen a UFO. There is absolutely no doubt as to what we saw!We do not know if anyone else saw this thing, it was so huge I cannot believe we would be the only ones to see it but we did not see anything on the news about it. We were all feeling kind of surreal."],"Object Flight Path":"Stationary,Path then hovering","trends":["There have been 134 other sightings in Kansas City","There were no other sightings in Kansas City on or around July 27th 2013"],"Disposition":"Unresolved","Date Submitted":"07/28/2013 01:59 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.042699,+-94.446843(49257)&iwloc=A&hl=en\"> mufon case (49257) map </A>","Longitude":"-94.446843","Country":"United States","files":["/var/www/straped/mufon/html2text/49257.html.txt","/var/www/straped/mufon/org/49257.html"]}