{"Disposition":"Unresolved","divs":["Sighting Details Had taken a friend up to Pontoosac Lake in Pittsfield to sit at the picnic tables and just hang out. At about 9:50 I observed an orange light with a red halo moving at moderate speed from South to North. I watched it coming over and as an aviation enthusiast it really caught my eye...it was very bright. I thought it might be an F-15 out of Westfield but there were none of the other lights or strobes that you can normally see when they fly over (if you can see them at all...high altitude).I thought it was a little odd but didn't pay much attention and didn't bother pointing it out to my companion. Within about 30 seconds of it passing behind the trees and out of my sight I noticed 2 more flying in formation. It was very hard to tell size, speed, or altitude as it was very dark. I noticed that as they passed overhead the lights dimmed to almost nothing and it was also at this time I realized they weren't making any sound and I pointed this out to my friend. At this point we began speculating on what they could be and the 4th appeared trailing some distance behind 2 and 3. All on pretty much the same flight path. As she started getting a little nervous I observed the 5th coming in from the West on what appeared to be an intercept course but this one dimmed before it crossed the flight path of the others. Seconds later the 6th and final object appeared on the same heading as the first 4. None of them made any sound and the whole incident lasted about 5 or 6 minutes and not a sound could be heard. Also interesting to note that a private single engine aircraft flew over from West to East within moments of the others, but was easily identified by its red, blue lights and white strobe and engine noise. This is my 3rd experience but first reporting."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.488149,+-73.263561(49259)&iwloc=A&hl=en\"> mufon case (49259) map </A>","Tags":"City","Sighting Duration":"Undisclosed","Source":"MUFON","Longitude":"-73.263561","City":"Pittsfield","Object Flight Path":"Straight-line path,Other","Object Features":"None","Viewing Distance":"Unknown","Region":"Massachusetts","Weather Factors":"Unknown","Summary":"5 orange lights w/red halos moving South to North in loose/staggered formation. 6th came from the West to join up.","Date Submitted":"07/28/2013 03:05 UTC","files":["/var/www/straped/mufon/html2text/49259.html.txt","/var/www/straped/mufon/org/49259.html"],"Date of the Event":"07/27/2013 09:50 UTC","Latitude":"42.488149","Log Number":"US-07282013-0019","trends":["There have been 17 other sightings in Pittsfield","There were no other sightings in Pittsfield on or around July 27th 2013"],"Country":"United States","Object Shape":"Sphere","Case Number":"49259"}