{"map":"<A HREF = \"http://maps.google.com/maps?q=34.156712,+-118.444407(49252)&iwloc=A&hl=en\"> mufon case (49252) map </A>","divs":["Sighting DetailsSix orange objects with a black dot in the center suddenly appeared and hovered in the sky at night shaped like the UPENN emblem and dissappeared one by one. Another individual visiting the Sherman Oaks area witnessed the same and wondered what the objects were. Like me, she was taking pictures with her Smart Phone. I was on my balcony when they all just appeared out of no where flying in the sky (North West) long enough for me to grab my Iphone to take two pictures. Tried to take pictures of the remaining two objects in the sky, but for some reason they were not visible in my Iphone like the others were that I took on my Iphone. The other individual who witnessed the same had parked her car on the street and was coming to visit a friend of hers. Her friend came outside and she showed her friend the pictures she took and told her friend I had witnessed the same. Amazing. For some reason, I am unable to upload the pictures from my Iphone but I had a witness to this event. When they first appeared, I saw a strobe light and heard a fireworks sound."],"Sighting Duration":"Undisclosed","Date Submitted":"07/28/2013 09:55 UTC","Log Number":"US-07282013-0012","Viewing Distance":"501 Feet - 1 Mile","Case Number":"49252","Disposition":"Unresolved","Weather Factors":"Unknown","Object Flight Path":"Stationary","Country":"United States","Object Features":"Other","Source":"MUFON","Tags":"City","Date of the Event":"07/27/2013 12:00 UTC","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/49252.html.txt","/var/www/straped/mufon/org/49252.html"],"Longitude":"-118.444407","Summary":"Six orange objects with a black dot in center hovering in sky at night shaped like UPENN emblem and dissappeared one by one.","Region":"California","Latitude":"34.156712","City":"Los Angeles","trends":["There have been 404 other sightings in Los Angeles","There were 6 other sightings in Los Angeles on or around July 27th 2013"]}