{"divs":["Sighting Details22.15 While relaxing in the garden of our house we (3 people) noticed a glowing orange object traversing the sky from east to west in a straight line without any sound. 22.20 We sight a second identical object with the same trajectory. This time I took a video. (See attachment 1) I was standing up therfore the object seems moving strangely, but it kept a straight traiectory all the time. In the video the object seems blinking sometimes because it was behind some trees (wich is not visible because of the dark and poor quality of the camera), but it never flashed or anything. After that an airplane (im almost sure because I heard the classic turbolence of a far airplane) with three flashing lights V shaped went by in perpendicular direction, only 2 light visible in the video. (See attachment 2). 22.30 Another orange object, same trajectory. It was probably more low and the video is clearer. (See attachment 3) After that there were at least 3 airplanes (and turbolence sounds) with the same three flashing lights wandering (they could change direction) at east (the origin of the orange objects). 22.40 A person told me he saw another orange object from south-east that changed quicly trajectory and vanished but I couldn't see it. 22.45 - 00.00 No more airplanes or objects."],"map":"<A HREF = \"http://maps.google.com/maps?q=45.755141,+9.225341(49265)&iwloc=A&hl=en\"> mufon case (49265) map </A>","Object Shape":"Fireball, Sphere","Tags":"City","files":["/var/www/straped/mufon/html2text/49265.html.txt","/var/www/straped/mufon/org/49265.html"],"Viewing Distance":"Unknown","Weather Factors":"Unknown","Date of the Event":"07/28/2013 10:15 UTC","Country":"Italy","trends":["There has been one other sighting in Lurago d'Erba","There were no other sightings in Lurago d'Erba on or around July 28th 2013"],"Log Number":"IT-07282013-0025","Source":"MUFON","Object Flight Path":"Straight-line path","Latitude":"45.755141","Longitude":"9.225341","Region":"Lombardy","Sighting Duration":"Undisclosed","Summary":"at least 3 consecutive flying orange globes","City":"Lurago d'Erba","Date Submitted":"07/28/2013 06:01 UTC","Case Number":"49265","Disposition":"Unresolved","Object Features":"Unknown"}