{"Object Features":"None","Latitude":"44.338343","Sighting Duration":"Undisclosed","Summary":"bright orange ball of light moving slow seemed to stop following highway. saw it out of my porch window ,followed it for some time ,very bright.","Log Number":"CA-07282013-0023","Disposition":"Unresolved","Date Submitted":"07/28/2013 06:02 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=44.338343,+-76.140379(49263)&iwloc=A&hl=en\"> mufon case (49263) map </A>","Longitude":"-76.140379","Weather Factors":"Unknown","divs":["Sighting Detailswatching t.v.about 10 p.m., caught it out of the side of my eye ,a very bright ball of yellow orange light several hundred feet high moving slowly seemed to halt but moving in a straight line moving west. turned off sound on set to hear any sounds, windows wide opened ;not like a plan ,too slow ,no correct lights or a helicopter again not usual lights just hovering . thought it might be the glow of a gas flame of a balloon but too late and too straight.road curves around to town but this object just moved slowly could be seen easily and for along time.no edges just a glowing ball ,can not give actuate dimensions maybe 2 feet. feelings --amazement,mentally looking for explanations no reasonable object, cast no light beam, just keep on watching it for several minutes as it faded from view but that was a long way over the St. Lawrence ,i have a huge view ,can see Wolf Island 18 miles away .the object was a long way off to lose sight of it .if a hoax - why, no reason not alot to see it. next day asked neighbour next day but his t.v. room was in wrong direction.sorry to stunned to look for camera.I live on a peninsula facing Halstead Bay just off the parkway ,Gananoque is 6 klm away west ,Brockville is 40 klms and the international bridge is about 9 klms east a very clear view."],"Date of the Event":"07/26/2013 12:00 UTC","trends":["There have been 2 other sightings in Gananoque","There were no other sightings in Gananoque on or around July 26th 2013"],"Tags":"City","Object Shape":"Fireball, Sphere","Region":"Ontario","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/49263.html.txt","/var/www/straped/mufon/org/49263.html"],"City":"Gananoque","Case Number":"49263","Object Flight Path":"Hovering then path,Straight-line path","Country":"Canada"}