{"Longitude":"-87.801116","Object Shape":"Sphere","Region":"Illinois","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.876621,+-87.801116(49264)&iwloc=A&hl=en\"> mufon case (49264) map </A>","Log Number":"US-07282013-0024","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Path with directional change","Country":"United States","Date of the Event":"07/27/2013 10:55 UTC","trends":["There have been 15 other sightings in Forest Park","There were no other sightings in Forest Park on or around July 27th 2013"],"Object Features":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/49264.html.txt","/var/www/straped/mufon/org/49264.html"],"Date Submitted":"07/28/2013 06:04 UTC","Weather Factors":"Unknown","Case Number":"49264","Tags":"City","Latitude":"41.876621","divs":["Sighting DetailsMy partner was outside on the balcony smoking and called me outside to look at an object. It was at 10:55 PM - I remember looking at my clock. The object was bright and reddish orange in color. It came directly overhead at a 90 degree angle, coming from the west going east in a straight line (the balcony faces east). The object was completely silent and unlike typical traffic departing from O'Hare (no strobes, no sound). The object was moving under the clouds and then ascended into a cloud. It was no longer visible. The sighting lasted about 10 seconds, but it was of note because it was so different from the usual commercial traffic in the area. I would guess that the speed was about the same as a twin engine aircraft, but not slow like a Chinese latern. From our vantage point, it seemed smaller than a commercial jet but bigger than a microwave. It was bigger in appearance than a star but smaller than an aspirin. As it gently ascended, I'd almost swear it had a Saturn-like appearance on the right and left sides (probably just an atmospheric illusion). The object was very bright when visible. I don't know if this is the same object reported in case #49239, but it is similar, though it happened later in the evening."],"City":"Forest Park","Summary":"Red-Orange Orb Similar to Park Ridge Sighting #49239","Disposition":"Unresolved"}