{"Longitude":"-118.238725","Object Flight Path":"Path then hovering","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Latitude":"34.055894","Date of the Event":"07/27/2013 12:00 UTC","Object Features":"Unknown","Log Number":"US-07282013-0021","Case Number":"49261","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","City":"Los Angeles","Date Submitted":"07/28/2013 05:18 UTC","divs":["Sighting Detailstwo star-like orbs moved across the sky while circling each other and continually combining into one super orb, then separating into two orbs, over and over again. while separated they constantly circled one another very closely. i watched them move across the sky while doing this for 15 minutes before they suddenly disappeared. i find it hard to believe that these are satellites because of the fact that it was broad day light at 3pm in LOS ANGELES which is one of the smoggiest cities in the world. smog was bad that day. they were pretty much straight up in the sky... slightly more north though, moving from west to east. i happened to be laying on my roof staring at the sky, and the second i saw them, i knew they were not planes or helicopters, and because of these orb's actions and behavior i definitely felt like they were ufos, i was deeply moved and emotional. i actually started to cry. i tried to film it on my phone but the orbs were too far away to capture."],"trends":["There have been 404 other sightings in Los Angeles","There were 6 other sightings in Los Angeles on or around July 27th 2013"],"Summary":"two orbs circling one another, continually combining into one orb then separating into two while moving across the sky","Object Shape":"Circle","Region":"California","Tags":"City","Source":"MUFON","files":["/var/www/straped/mufon/html2text/49261.html.txt","/var/www/straped/mufon/org/49261.html"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.055894,+-118.238725(49261)&iwloc=A&hl=en\"> mufon case (49261) map </A>"}