{"divs":["sighting detailsthought it was mercury or venus very bright star no clouds visible last night! all sky clear! i,told husband look at that big bright star. i,said its a planet becuz it does not twinkle its stationary!!! then after like 10-15 min.. outside saw this bright star.. shut-off!!!! then turn back on!!! i was startled told husband omg look it turned off!!! he said wow thats strange!!! this happned like 3-4 times after just being stationary for a long while we have seen reports of strange other lights.. around this area.. also saw strange lights last year.. several other witnesses these lights are mathematical immpossible to move or be still this way!!! this was no air-plane or helicopter or jet... i,thought maybe its a satelite however the way the lights look previousley last year they were like stars but moving at fast light speeds,,, almost either a super huge aircraft\\spaceship or dancing stars becuz their have been massive reports of these sighting in our area...my question is was last nights star\\like light a star,planet,ship,or human made satelite plz can anybody explain this.. what could it have been??"],"map":"<A HREF = \"http://maps.google.com/maps?q=31.848372,+-102.364363(49278)&iwloc=A&hl=en\"> mufon case (49278) map </A>","Latitude":"31.848372","Disposition":"Unresolved","Viewing Distance":"Over 1 Mile, Unknown","City":"Odessa","Object Shape":"Fireball, Star-like, Unknown","Date Submitted":"07/29/2013 01:54 UTC","Case Number":"49278","Sighting Duration":"Undisclosed","Log Number":"US-07292013-0005","trends":["There have been 6 other sightings in Odessa","There were no other sightings in Odessa on or around July 27th 2013"],"Summary":"STRANGE! Star,like,bright,did not twinkle suddenly turned off& star stationary for longgg","Object Flight Path":"Stationary,Unknown","Source":"MUFON","Country":"United States","Object Features":"Unknown","Longitude":"-102.364363","Tags":"City","Date of the Event":"07/27/2013 09:05 UTC","Weather Factors":"Unknown","Region":"Texas","files":["/var/www/straped/mufon/html2text/49278.html.txt","/var/www/straped/mufon/org/49278.html"]}