{"Log Number":"US-07292013-0009","Object Features":"None","Viewing Distance":"Unknown","Tags":"City","Case Number":"49282","Region":"Virginia","Source":"MUFON","divs":["Sighting DetailsI have insomnia and could not sleep. My husband and I decided to play our XBox around 2am. I decided around 3am that I wanted to step outside and remember that I needed to take the garbage up. As I took the garabage out I had remember the meteor shower so as I walked back towards my house I began to look up. Nothing out the normal, buy very quiet and very clear. As I walked back toward the door, I noticed the stars twinkling a lot more than normal. So, I figured I would stand for a few minutes and watch the stars thinking I would see a shooting star. I looked back inside to see my husband coming outside and I looked back up. He had asked me while I was staring at the clear sky what I was doing and like normal I told him I was looking for shooting stars. As I had said this, I noticed two faint looking lights out of nowhere appear over my head a little higher than I WAS originally staring, like dim stars, moving in sequence. It was out of the corner of my eyes almost and I thought my eyes where playing tricks as the two hovered for a moment. Like a crooked semi colon but farther apart ( : ). There was a bigger gap, of course, between the stars but they were moving together. And, logically, I thought they were satelittes moving together, in the same course. But, as I looked even harder and thought about it more... Satellites don't just come out of nowhere. I pointed out to my husband that there was a third VERY faint \"star\" or light off to the right of these two dim ones. Flickering as it followed the other two to the left. It formed a triangle in the sky and No structure, just three dim looking stars... Moving across the sky in the shape of a triangle.. I thought maybe a possibility of shooting stars but, they were just moving way too slow... So, looking at the sky and where they were, I ran to my front yard making sure to check a second each step to not lose them out of sight. Clearly I could see them moving across the sky to the North. At this time I looked at my phone to see what time it was 3:15am. Just as I said they have to be satellites... It changed course. It was traveling NW and then just stopped for a brief second, the lights flickered and continued N toward Verona. I WAS and still am in awe. Right after I had witnessed this my husband said it was a UFO. I looked back up to witness two shooting stars to the left of where the object started to appear. Afterwards when I came back outside I felt very \"weird\" as if something was outside watching me. I can't even step back outside tonight. I know for a fact what I saw was an object but, I don't know what of... Unfortunately, the lights where too dim in the sky for my to capture. But, what I saw can be verified by my husband and I. I normally try to think of a logical explaination. But, this one had me stumped."],"Date of the Event":"07/29/2013 03:15 UTC","Sighting Duration":"00:15:00","map":"<A HREF = \"http://maps.google.com/maps?q=38.152266,+-79.063506(49282)&iwloc=A&hl=en\"> mufon case (49282) map </A>","Date Submitted":"07/29/2013 04:19 UTC","files":["/var/www/straped/mufon/html2text/49282.html.txt","/var/www/straped/mufon/org/49282.html"],"Country":"United States","City":"Staunton","Longitude":"-79.063506","Object Flight Path":"Hovering then path","trends":["There have been 2 other sightings in Staunton","There were no other sightings in Staunton on or around July 29th 2013"],"Object Shape":"Triangle","Summary":"2 faint lights appearred in the sky. hovered. then began to move. first thought it was two satellites. then a very faint third light came into view, following in the shape of a triangle.","Latitude":"38.152266","Disposition":"Unresolved","Weather Factors":"Unknown"}