{"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=38.583048,+-77.786202(49294)&iwloc=A&hl=en\"> mufon case (49294) map </A>","Region":"Virginia","Longitude":"-77.786202","files":["/var/www/straped/mufon/html2text/49294.html.txt","/var/www/straped/mufon/org/49294.html"],"Object Flight Path":"Hovering then path,Straight-line path","Latitude":"38.583048","Date of the Event":"07/25/2013 10:20 UTC","Object Shape":"Circle, Fireball","Case Number":"49294","City":"Bealeton","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Date Submitted":"07/29/2013 04:19 UTC","Object Features":"Other","Log Number":"US-07292013-0021","Summary":"fire like balls. 3rd sighting. another sighting of the same thing by my mom.","trends":["There have been no other sightings in Bealeton","This sighting has never been favorited."],"Tags":"City","Country":"United States","Weather Factors":"Unknown","divs":["Sighting DetailsThe first time me and a friend were sitting on the couch in the basement at night time. I noticed some lights out of the back sliding glass door and went outside to see them better. They were moving away from me very slowly towards the tree line. Then they just faded away. The second time i was standing by the door during the day and noticed a huge ball of light over the tree line. It stayed there for about 30 seconds then flashed away to the right with incredible speed. The third time I was sitting on the couch during the night and saw the same two lights as before but this time they were coming towards me. They were moving over my house. One was in front of the other and the other wasn't far behind. There was no sound were there should have been considering how close they were. There was also a plane in the air off in the distance which I could hear. They eventually just faded out of sight. I called my mom right after and she was shocked because apparently she has also seen the same thing and described it to me perfectly as the same thing I saw."],"Source":"MUFON"}