{"Tags":"City","Source":"MUFON","Case Number":"49297","Latitude":"51.214101","Sighting Duration":"Undisclosed","Country":"United Kingdom","Object Flight Path":"Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=51.214101,+-0.63277(49297)&iwloc=A&hl=en\"> mufon case (49297) map </A>","trends":["There have been no other sightings in Compton","This sighting has never been favorited."],"Date Submitted":"07/29/2013 05:42 UTC","Viewing Distance":"20 Feet or Less, Over 1 Mile","Longitude":"-0.63277","Summary":"A bright light in the peripheral vision. At first I thought it was a geosynchronous satellite, but then noticed the light dim then pause in its path and pulsate. then it was joined by a second light on a similar flight path. Both lights hovered.","Object Features":"None","Weather Factors":"Unknown","divs":["Sighting DetailsI noticed a bright light in my peripheral vision. As I looked I notice the light dim and travel south west over the Guildford area. I thought at first it was a geosynchronous satellite, until I noticed a decrease in speed and a pulsating light. The light then hovered in place an appear to moving in a small circle. A few minutes later a second light on the same flight path also bright at first. My Land lady joined me after I called out to her when noticing the odd behavior of the first light and she noticed the second light. 2 plans where flying over head and as a point of reference, they where not the same. The lights where too high to be a plane and the flight path to erratic to be a satellite. The total observation lasted about 3 minutes until both lights dimmed out of view. Last direction seen traveling was in the south east direction."],"Object Shape":"Flash, Sphere","Date of the Event":"07/29/2013 10:13 UTC","Log Number":"GB-07292013-0023","Region":"England","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/49297.html.txt","/var/www/straped/mufon/org/49297.html"],"City":"Compton"}