{"Tags":"City","Object Features":"None","Object Shape":"Cigar, Cylinder, Oval","Case Number":"49291","Object Flight Path":"Path with directional change","Log Number":"US-07292013-0017","Summary":"Silver Elongated Oval Flying East. Would have thought it was an airliner, but no sound.","map":"<A HREF = \"http://maps.google.com/maps?q=38.043874,+-84.495566(49291)&iwloc=A&hl=en\"> mufon case (49291) map </A>","City":"Lexington","divs":["sighting detailssilver elongated oval object flying a few miles west from bluegrass airport heading east\\north east between lexington and versailles. a few thousand feet off the ground, but below any cloud cover. would have thought it was an airliner, but no discernible wings or sound. i live in the flight path of an airport, so i am pretty familiar with planes coming in and landing and flying over head. this was in board daylight around noon. it looked like it would have been a airplane doing a wide circle of the airport for a landing run, except i could not see 'wings' and the object make no sound [ie there was no trailing jet roar, typical with most airplanes]. also the object was in airspace typically not used object was a significant distance off the ground, over 1000ft, but noy high enough to be a normal airliner cruising. it was also in an air space that normally the planes entering or leaving the local airport do not use for circling. it headed east\\north east for a about a minutes or so, then seemed to turn north\\north east and disappeared heading that direction."],"Longitude":"-84.495566","Source":"MUFON","Disposition":"Unresolved","Viewing Distance":"Over One Mile","Date Submitted":"07/29/2013 12:01 UTC","trends":["There have been 43 other sightings in Lexington","There were no other sightings in Lexington on or around July 29th 2013"],"Country":"United States","Sighting Duration":"Undisclosed","Latitude":"38.043874","files":["/var/www/straped/mufon/html2text/49291.html.txt","/var/www/straped/mufon/org/49291.html"],"Date of the Event":"07/29/2013 11:35 UTC","Weather Factors":"Unknown","Region":"Kentucky"}