{"Object Flight Path":"Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=49.440066,+7.749126(49292)&iwloc=A&hl=en\"> mufon case (49292) map </A>","Source":"MUFON","Date Submitted":"07/29/2013 12:46 UTC","Date of the Event":"07/27/2013 10:20 UTC","Viewing Distance":"101-500 Feet","Disposition":"Unresolved","Country":"Germany","Sighting Duration":"Undisclosed","Object Features":"Unknown","Case Number":"49292","City":"Kaiserslautern","Weather Factors":"Unknown","Region":"Rhineland-Palatinate","trends":["There have been no other sightings in Kaiserslautern","This sighting has never been favorited."],"divs":["Sighting DetailsOn 27 July, while sitting on my balcony, I noticed a light (green and orangish-red) rising above the 4 story building across from our courtyard. At first I thought it was an aircraft flying toward my direction but thought it to be too fast for an aircraft or that it was fairly low for an urban area. Then I could tell it appeared to rise straight up and then stop in a hover. After about 30 seconds, it moved to my right about 50 feet and stopped to hover in the new positon. The object then went in a straight line horizontally to the left about to the original hover position. It stayed for about 10 seconds and slowly started to descend. The lighting was very bright, steady and close together. There was no noise coming from it at all. I estimated the distance from me to be about 400 to 500 ft. The maximum height it ascended was about 350 ft. As the object went behind the building again, I was a little stunned at what I was seeing. I had called my wife and daughter to come look but it had gone behind the building before they got downstairs to the balcony. Within about a minute of it going behind the building across the courtyard, we all saw it rise again about 50 feet to the left of it's original positon. It did not rise as high but it did again hover. After about a 20-30 sec hover, it slowly descended again behind the building. My daughter (9) was frightened by it and we all were a little spooked by what we had just seen. I stayed out on the balcony for about another half hour watching to see if it came again, but did not. I have worked in avaition for over 30 years and have never seen a flight object act in that manner without any sound or have the lights so close together."],"Tags":"City","Longitude":"7.749126","Latitude":"49.440066","Log Number":"DE-07292013-0018","Object Shape":"Oval, Teardrop","Summary":"I watched a \"ufo\" rise, hover, change direction, ascend and do the same thing again only not as high.","files":["/var/www/straped/mufon/html2text/49292.html.txt","/var/www/straped/mufon/org/49292.html"]}