{"Summary":"Was photographing thunderstorms and flash of lightning revealed an unknown object in the sky","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.673947,+-74.544896(49309)&iwloc=A&hl=en\"> mufon case (49309) map </A>","Log Number":"US-07302013-0005","Source":"MUFON","trends":["There have been no other sightings in Saint Regis Falls","This sighting has never been favorited."],"Date of the Event":"07/19/2013 09:58 UTC","Tags":"City","Country":"United States","Object Flight Path":"Unknown","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/49309.html.txt","/var/www/straped/mufon/org/49309.html"],"Sighting Duration":"Undisclosed","Object Features":"Wings","Latitude":"44.673947","Date Submitted":"07/30/2013 01:58 UTC","Region":"New York","Case Number":"49309","Longitude":"-74.544896","City":"Saint Regis Falls","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","divs":["Sighting DetailsI was outside one evening on my porch and had set up my digital camera (Nikon D5100) so I could take pictures of the lightning from the thunderstorms coming through the area. I was creating about 10 second time lapse photos of the storm so as to try and capture bolts of lightning. I did not witness the object at the time as it was almost 10:00pm, it was dark, and the lightning was blinding. It wasn't until over a week later when going through my pictures that I noticed the object in the middle of the picture, either with the lightning bolt hitting the object or passing behind it. Because of the darkness, I did not see any sight of the object after the lightning, but that night I heard no sound of engines or anything other than a few rumbles of thunder and the falling rain. I considered it could be multiple things; a plane but there was no sound of an engine which should have been heard from that distance and wouldn't likely be out flying that low in the middle of a thunderstorm that late in this area; a bird or bat, which is also unlikely given the weather and the shape (as few birds have such a straight wingspan and few have body parts that hang so far below their wingspan); or an insect which would not likely have appeared so clear and with such thick lines given the lens I was using and the focus point."],"Object Shape":"Cross, Other"}