{"trends":["There have been 12 other sightings in Milton","There were no other sightings in Milton on or around June 23rd 2013"],"Date of the Event":"06/23/2013 12:00 UTC","Object Flight Path":"Hovering then path","Source":"MUFON","Date Submitted":"07/30/2013 01:49 UTC","Disposition":"Unresolved","City":"Milton","Log Number":"US-07302013-0004","Country":"United States","Object Shape":"Circle, Star-like","files":["/var/www/straped/mufon/html2text/49308.html.txt","/var/www/straped/mufon/org/49308.html"],"Summary":"Spotted Single Orb Light in Sky during SuperMoon","Latitude":"30.630856","map":"<A HREF = \"http://maps.google.com/maps?q=30.630856,+-87.164447(49308)&iwloc=A&hl=en\"> mufon case (49308) map </A>","Viewing Distance":"Unknown","divs":["Sighting Details June 23,2013 @ about 2am: Was out back yard to look at SuperMoon when I saw what appeared to be a light behind clouds. It intrigued me so I continued to look up to see if it would reappear. I was facing Eastward, then a single round orb shape came from behind the clouds, went right in direction and then upwards in a backwards direction like it was shooting away and got smaller then vanished. I stood and watched for a few mins and the same thing happened in same general area. I kept watching to see if it were fireworks but it was not coming from below shooting upwards nor emiting. The clouds lit up before the bright single round orb shape came out from behind the clouds. This happened about 3 times with several mins between. UFO? I've owned my home since 1989 and it's the first time I've ever seen anything like this. We have many airplanes and helicopters fly both day and night, so I know the difference of their lights and shapes. This was not either airplane nor helicopter. I did not take any photo's but now wished I had. I was caught up in the moment. Debbie Pendleton"],"Tags":"City","Longitude":"-87.164447","Region":"Florida","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Features":"None","Case Number":"49308"}