{"Sighting Duration":"00:03:00","map":"<A HREF = \"http://maps.google.com/maps?q=50.776951,+-103.781255(49304)&iwloc=A&hl=en\"> mufon case (49304) map </A>","trends":["There has been one other sighting in Fort Qu'Appelle","There were no other sightings in Fort Qu'Appelle on or around July 16th 2013"],"Country":"Canada","Summary":"round light entered my bedroom","Latitude":"50.776951","Case Number":"49304","Region":"Saskatchewan","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/49304.html.txt","/var/www/straped/mufon/org/49304.html"],"Log Number":"CA-07292013-0031","Longitude":"-103.781255","Tags":"City","Date of the Event":"07/16/2013 03:00 UTC","Viewing Distance":"20 Feet or Less","Source":"MUFON","City":"Fort Qu'Appelle","divs":["Sighting DetailsI woke at 3:00 a.m on July 16, 3013 to what I thought was a round light thing shining through the window in my bedroom. I just woke and realized there was a light in the room, as I sleep in total darkness. I completely black out the window so no light comes in from the sun. But I jumped up onto my feet and stood directly in front of it. I did not put my glasses on so it was blurred. The round orb appeared to either be pulsating or flashing on the sides and spinning. I reached out to touch it but pulled my hand back and reached for the door instead. I ran to the front of the house to look out the front door to see if anything was outside. There was nothing. I returned to the bedroom and it was gone. On the 18th, two days later, I once again woke to a computerized sounding bleeping. It was short, but it woke me. I got up and there was nothing there. I need some kind of help or assurance as I tend to leave home to sleep in my vehicle away from this house. I am here now, but it is very difficult to sleep. I am traumatized. Even my dog goes under the car all the time, although he is quite big, he hides under the very low car. Thank you."],"Object Features":"Other","Disposition":"Unresolved","Date Submitted":"07/29/2013 11:29 UTC","Object Flight Path":"Stationary","Object Shape":"Sphere"}