{"Latitude":"49.269316","Region":"British Columbia","Date of the Event":"07/25/2013 12:30 UTC","Weather Factors":"Unknown","trends":["There have been 33 other sightings in Vancouver","There was one other sighting in Vancouver on or around July 25th 2013","This sighting has never been favorited.",""],"Log Number":"CA-07292013-0027","Object Features":"Unknown","Date Submitted":"07/29/2013 07:19 UTC","Tags":"City","Disposition":"Unresolved","Case Number":"49300","map":"<A HREF = \"http://maps.google.com/maps?q=49.269316,+-123.109847(49300)&iwloc=A&hl=en\"> mufon case (49300) map </A>","Object Shape":"Unknown","Longitude":"-123.109847","Source":"MUFON","divs":["Sighting DetailsI am actually sending you these photos because i did not see any ufo when i actually took the picture(s) (with my naked eye). I realized after i looked back that the light is very bright and does not look like a plane. And was wondering if you could analyse it, to see if they are real. Picture (File)1: Was taken in the car (with the window up) at Vancouver, BC by Brentwood Mall Date: July 24 @ about 12.30pm. I took the picture because i thought the clouds looked so different. Later on as i really looked at the photo, i saw lights, white and even red. Picture (File) 2: Taken the next day July 25, at Vancouver, Yaletown at approx the same time 12.30, Again i did not see the light when i took he photo, i saw it after. I would like to note that after taking picture 2 my friend took a picture of me in the same position only about 10 seconds later but there is no light in my picture. Is it possible to find out if these are real?"],"Viewing Distance":"N/A","files":["/var/www/straped/mufon/html2text/49300.html.txt","/var/www/straped/mufon/more/49300_submitter_file1__image.jpg","/var/www/straped/mufon/more/49300_submitter_file2__image.jpg","/var/www/straped/mufon/org/49300.html"],"City":"Vancouver","Sighting Duration":"Undisclosed","Object Flight Path":"Unknown","Summary":"I did not notice it until after, when i was looking at the photo.","Country":"Canada"}