{"map":"<A HREF = \"http://maps.google.com/maps?q=42.099016,+-71.40083(49301)&iwloc=A&hl=en\"> mufon case (49301) map </A>","trends":["There have been no other sightings in Franklin","This sighting has never been favorited."],"Object Features":"Other","files":["/var/www/straped/mufon/html2text/49301.html.txt","/var/www/straped/mufon/org/49301.html"],"Tags":"City","Region":"Massachusetts","Log Number":"US-07292013-0028","Longitude":"-71.40083","Case Number":"49301","Summary":"It was July 3, 2010 I was at the Playground near my House in the parking lot, I was trying to watch the Fireworks in the distance. I had my New Camera in my hand trying to get some photo's of the fireworks. The Flash kept going off, I was un-sure to to tu","Country":"United States","Disposition":"Unresolved","Viewing Distance":"101-500 Feet","Date of the Event":"07/03/2010 10:20 UTC","Latitude":"42.099016","Sighting Duration":"Undisclosed","Date Submitted":"07/29/2013 07:38 UTC","Source":"MUFON","City":"Franklin","Object Shape":"Circle, Disc","divs":["Sighting DetailsOK, Let's See It was July 3, 2010 I was at the Playground near my House in the parking lot, I was trying to watch the Fireworks in the distance. I had my New Camera in my hand trying to get some photo's of the fireworks. The Flash kept going off, I was un-sure to to turn it off. It was partly cloudy, sky was very bright like a Full moon was out, but I found out later that it was a NEW Moon that night. I was at the playground earlier that evening taking sunset photo's. I tried to take a photo of the bright sky but photo's came out too dark. It was around 10:15 or 10:20 PM I was standing a few feet from some large Trees in the parking lot. Trying to take photo's of the fireworks. I happened to look up over my head around 10:20 PM and saw a large round flying Disk over my head just about Tree top level with me. It was grey in color,total silence, no sound at all. It moved quickly into the clouds above me when it realized I was looking at it. I got the impression it wanted to hide from me,for some reason. Sighting lasted only about 10 or so seconds very fast. I didn't have time to snap any photo's off, I forgot I had a camera in my hand. On the bottom of the disk I seemed to have seen maybe some kind of writing on it. But I saw it too briefly to see anything. I mentioned it on a talk show I listened to everyday and call up. The Guy who did the show was a UFO Investigator himself Joeseph L. Ferriere he use to publish a UFO magazine called \"Probe\" in Rhode Island. Another listener to the show said he saw something strange looking in the direction of my town from \"Woonsockett\". I Live in Franklin, Massachusetts not too far away from Woonsockett, R.I. About 10 Minutes after I saw the UFO about 10:30 PM I saw it again briefly, farther away going into a cloud, to the north-East of where I was standing. The UFO was as Big as an Car in Length I'd say and about twice as wide. So That Is My Story."],"Weather Factors":"Unknown","Object Flight Path":"Stationary"}