{"trends":["There have been no other sightings in Wapello","This sighting has never been favorited."],"Country":"United States","Longitude":"-91.185427","Weather Factors":"Unknown","Viewing Distance":"21-100 Feet","Object Shape":"Circle, Star-like","Summary":"Low Bright star like light that put out another smaller orange-yellow object.","files":["/var/www/straped/mufon/html2text/49305.html.txt","/var/www/straped/mufon/org/49305.html"],"Region":"Iowa","Sighting Duration":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.181419,+-91.185427(49305)&iwloc=A&hl=en\"> mufon case (49305) map </A>","Date Submitted":"07/30/2013 12:03 UTC","Disposition":"Unresolved","divs":["Sighting DetailsI was leaving the house with my cousin to go to the gas station at approximately 9:30 when we observed a bright light just to the west of town. I commented that it looked like a low bright star. As we got closer to the object it appeared to be descending slowly. We followed the bright white object out of town about two miles and it continued to move west at about 60 MPH and appeared to still be slowly descending, and at this point a smaller yellowish orangeish light appeared directly to the left of the original object. As we began to catch up to the two objects and began to think we might actually pass them they quickly picked up speed. We came to the end of the road {which is about 5 miles before you come to a T in the road} and the bright white object sat and hovered at about a 30 degree angle in front of us. We sat at the stop sign and watched them for about 30 seconds when the yellowish orangeish light dissapeared and when it reappeared about 15 seconds later its light began to flash red and white which appeared to be attached underneath the object. It slowly moved around the field besides us approximatly 200 feet above the ground. This object didnt seem to very big maybe half the size of a helicopter. Its movement were slow and it headed Northeast. We then turned North and tried to keep up with it but could not. When we went back to see if the original bright white light was still hovering but it was gone..It was a very weird experience I would not have called myself a skeptic before this I just never gave much thougth to it. After this experience it really leaves me wondering what is out there."],"Latitude":"41.181419","Object Flight Path":"Path with directional change,Path then hovering","Log Number":"US-07302013-0001","Date of the Event":"07/28/2013 09:29 UTC","Object Features":"None","City":"Wapello","Case Number":"49305","Tags":"City"}