{"Tags":"City","Object Shape":"Diamond, Triangle","City":"Gladstone","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/49317.html.txt","/var/www/straped/mufon/org/49317.html"],"Region":"Missouri","Disposition":"Unresolved","Case Number":"49317","Longitude":"-94.552097","Log Number":"US-07302013-0012","Summary":"Huge UFOs flying low over the city, one triangle, one diamond, and single lights following","Object Features":"Unknown","divs":["sighting detailsas called in to asd on 7\\29\\13: the witness said that he saw a v formation of six orange\\yellow lights moving from east to west, and a second diamond formation behind it with four light. the diamond formation sped up and over took the v formation. the witness stated that he thought these objects were traveling at 200-300 mph or more when they both stopped for several seconds, then continued on. these two formations of lights appeared to be part of two single crafts because the lights never changed position, even as one tilted upwards the lights remained in position. it was dark and he could not see the outline of a craft, however. more individual lights, moving at different rates of speed in a straight line followed. the witness counted 30 lights total. then some of the individual lights moved faster and overtook those in front. all of the objects then moved very quickly up and through a single opening in the clouds and disappeared from view behind the clouds. the witness called the police, who referred him to the faa, who said they do not take reports such as this. the witness has seen sky lanterns and said that these did not behave in the same manner. the witness is an aircraft engineer and wishes to remain anonymous."],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.208322,+-94.552097(49317)&iwloc=A&hl=en\"> mufon case (49317) map </A>","Date Submitted":"07/30/2013 11:53 UTC","Latitude":"39.208322","trends":["There have been 8 other sightings in Gladstone","There were no other sightings in Gladstone on or around July 25th 2013"],"Date of the Event":"07/25/2013 09:50 UTC","Object Flight Path":"Path with directional change","Source":"MUFON","Country":"United States"}