{"Summary":"Bright Star in unusual location","Longitude":"-79.992986","divs":["sighting detailswe were sitting on my deck with the family when my youngest daughter said to look at the star. it took my wife and i a moment to find it since it was so low on the horizon from my vantage point. we looked at the star for a moment and i grabbed my binoculars ,and observed it. the star appeared \"normal\" but in a weird location. my oldest daughter said that she was making a wish on her star. i continued to look at the \"star\" for a few minutes when it appeared to collapse in on itself and dissapear. i then turned to my wife , and said that was weird. she looked up and confirmed the object was gone. my oldest daughter said that as soon as she made a wish it dissapeared. i then grabbed my binoculars and searched for the object. i could not find the star, but for a brief moment i observed 3 red lights in a verticle row. i put the binocs down , and told my wife what i saw. i tried to find it again , but it was gone. the red lights were not visible to the naked eye. in the previous nights since no star has been visible in that location. this has left me with a very uneasy feeling especially that night. i am familiar with aircraft since we live on the approach \\departure route for pit . i have pilot experience as well. there were no clouds or other weather issues that night. it was a clear evening with plenty of light ."],"Date Submitted":"07/30/2013 10:02 UTC","Tags":"City","Latitude":"40.444905","Region":"Pennsylvania","Case Number":"49315","Log Number":"US-07302013-0010","City":"Pittsburgh","Object Features":"Unknown","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Disposition":"Unresolved","Object Flight Path":"Stationary","trends":["There have been 122 other sightings in Pittsburgh","There were no other sightings in Pittsburgh on or around July 28th 2013"],"Sighting Duration":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.444905,+-79.992986(49315)&iwloc=A&hl=en\"> mufon case (49315) map </A>","Object Shape":"Sphere, Star-like","Country":"United States","files":["/var/www/straped/mufon/html2text/49315.html.txt","/var/www/straped/mufon/org/49315.html"],"Date of the Event":"07/28/2013 08:15 UTC"}