{"Summary":"Orange light as bright as a star over downtown Indianapolis. The orange color flickered like candle light. It flew over a landing airliner. Overhead it appeared as a soft grey circle. It was huge.","Latitude":"39.709601","City":"Indianapolis","Sighting Duration":"Undisclosed","Object Shape":"Circle, Disc, Sphere, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=39.709601,+-86.060162(49325)&iwloc=A&hl=en\"> mufon case (49325) map </A>","Log Number":"US-07302013-0020","Case Number":"49325","Source":"MUFON","Country":"United States","Object Features":"Unknown","Longitude":"-86.060162","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Disposition":"Unresolved","Date of the Event":"07/29/2013 10:20 UTC","Tags":"City","Object Flight Path":"Straight-line path","Date Submitted":"07/30/2013 10:47 UTC","divs":["Sighting DetailsMy husband and I were leaving the AMC movie theatre on July 29, 2013 at 10:20 on the far Southside of Indianapolis when we noticed a very bright orange light north of us - just over downtown at 45 degrees. At first I thought it was a planet - a very bright star. We both are very familiar with aircraft (my husband works at the airport) and watched to see what it was - it didn't appear to be anything we had seen in the past. The orange light flickered like candle light within a circle. It almost looked like a Chinese lantern, and thought maybe it was, until a commercial jet liner flying into Indianapolis International Airport flew underneath it. We knew then that this thing was bigger than an airliner. It made no noise and had a trajectory and was flying South South-East. We continued to watch it fly directly over us. As it flew overhead, it was a round shape (pie plate bottom) and no longer orange but a light grey in color. The wind was out of the SE that night but this thing was heading into the wind."],"files":["/var/www/straped/mufon/html2text/49325.html.txt","/var/www/straped/mufon/org/49325.html"],"Region":"Indiana","trends":["There have been 126 other sightings in Indianapolis","There was one other sighting in Indianapolis on or around July 29th 2013"],"Weather Factors":"Unknown"}