{"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=51.644058,+-111.92872(49320)&iwloc=A&hl=en\"> mufon case (49320) map </A>","Region":"Alberta","Sighting Duration":"Undisclosed","Object Shape":"Unknown","Longitude":"-111.92872","Object Flight Path":"Straight-line path,Path with directional change,Other","Latitude":"51.644058","divs":["Sighting Details Its about 11:30 p.m. While watching a very active thunderstorm A abnormally bright circular light broke out from the heavey storm clouds It travelled quite quickly in a straightline at a speed I am not familiuar with.. Its was way faster than the jets I have seen but slower than a meteor. No noise no trail well defined bright It was moving in a straight SW direction and quickly disappeared into the blackness . I stood there wondering what I had just seen, I at that point attributed it to some kind of a slow freak lighting event, like ball lightning or something. So I sat back and continued to watch the storm. About two to three minutes later the light returned from the s.w. as best as I could tell along what looked to be the exact same line it had left on. This time it seemed to be travelling faster and disappeared back into the storm clouds. I dont think that lighting goes that way so it kinda squashed my rational explaination. I watched the storm come in and leave but never saw the mystery light again. I Not being a 100% believer in ufo am lost for a rational explaination The next day I explained to my wife and buddy what I had seen and while they were quick with \"answers\" I just agreed and moved on knowing full well none of thier answers were even remotley close to what I saw. I am at this point still looking for answers It feels lke a mission"],"files":["/var/www/straped/mufon/html2text/49320.html.txt","/var/www/straped/mufon/org/49320.html"],"Tags":"City","trends":["There has been one other sighting in Hanna","There were no other sightings in Hanna on or around July 26th 2013"],"Object Features":"Unknown","Date of the Event":"07/26/2013 11:28 UTC","Summary":"Visual encounter extra bright white light moving about a lightening storm","Disposition":"Unresolved","Case Number":"49320","City":"Hanna","Country":"Canada","Log Number":"CA-07302013-0015","Source":"MUFON","Weather Factors":"Unknown","Date Submitted":"07/30/2013 05:13 UTC"}