{"Weather Factors":"Unknown","Log Number":"US-07312013-0002","Case Number":"49328","Tags":"City","Date of the Event":"07/27/2013 11:40 UTC","Country":"United States","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Object Features":"None","divs":["sighting detailsmy son, in from out of town, and i were sightseeing and enjoying driving with the ac off and the windows down. we were cutting across from lamar just south of lake lady bird johnson going east on riverside when my son exclaimed \"what is that?\" i looked straight ahead and saw a luminescent starlike orb that was obviously too large for a star. it was changing colors from yellow-orange to red. there was a police car ahead at the intersection of riverside and lee barton drive. i told my son to pull over asap so we turned right and parked on the curb on the west side of lee barton drive. i jumped out and took a still photo. i continued to video what now appeared to be two lights\\orbs changing colors and pulsating in unison. i ran out of memory on my phone so i frantically began erasing apps and data to get enough room for more video. in the meantime, my son passed 8 persons on an outdoor patio at a bar restaurant. they yelled to him asking what we were doing. my son called their attention to the objects at which point numerous persons began observing the lights as well. i took three segment of video. we then lost them in the cloud cover and as one dropped below the visible horizon behind some trees. we were very nervous and excited which caused me to make errors when trying to video. because of the light pollution, i was unable to see the objects on my phone display while videoing which caused the objects to be out of frame from time to time. we then attempted to move to locations more easterly and at higher elevations in an attempt to regain sight of the anomalous lights\\objects but were unsuccessful."],"Latitude":"30.279422","map":"<A HREF = \"http://maps.google.com/maps?q=30.279422,+-97.736358(49328)&iwloc=A&hl=en\"> mufon case (49328) map </A>","Longitude":"-97.736358","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around July 27th 2013"],"files":["/var/www/straped/mufon/html2text/49328.html.txt","/var/www/straped/mufon/org/49328.html"],"Source":"MUFON","Sighting Duration":"Undisclosed","Object Shape":"Sphere, Star-like","Region":"Texas","Summary":"Orbs observed east of location. Path irregular. Movement in and out of low clouds. One to three observed winking in and out, pulsating and changing colors but predominantly red to red orange. Have phone video of portions of sighting.","Disposition":"Unresolved","Date Submitted":"07/31/2013 01:49 UTC","Viewing Distance":"501 Feet - 1 Mile, Unknown","City":"Austin"}