{"map":"<A HREF = \"http://maps.google.com/maps?q=54.987862,+-1.61087(49330)&iwloc=A&hl=en\"> mufon case (49330) map </A>","Source":"MUFON","Viewing Distance":"Unknown","Region":"England","Tags":"City","trends":["There have been 13 other sightings in Newcastle upon Tyne","There were no other sightings in Newcastle upon Tyne on or around June 15th 2012"],"Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Summary":"Very reflective object sighted above house","City":"Newcastle upon Tyne","Disposition":"Unresolved","Country":"United Kingdom","Object Shape":"Diamond","Latitude":"54.987862","Date Submitted":"07/31/2013 07:13 UTC","Case Number":"49330","Sighting Duration":"00:00:20","Longitude":"-1.61087","Date of the Event":"06/15/2012 06:30 UTC","Log Number":"GB-07312013-0004","divs":["Sighting DetailsI had noticed the sky had turned a very dark grey and wished to take a photograph of this with my iPhone. I took several photographs of the sky all around my home to show my family how dark the sky had become in quite a short period of time. I had initially forgotten about the photographs until several days later when I was deleting some other photographs from my iPhone. I looked at the photographs of the sky and since my family had also observed the sky elsewhere, it was unecessary to show them the images. I deleted a total of 3 but when I saw the 4th and final photograph I saw something odd near the middle-left of the image. I had not noticed this in the sky at the time of taking the photographs. I am unable to explain what happened during the actual time the object was in the sky as I did not see it. After seeing the image on my iPhone I was surprised that something very obvious had escaped my attention and could not understand how I did not see the object when taking the photograph. I lost sight of the image when it passed several houses."],"files":["/var/www/straped/mufon/html2text/49330.html.txt","/var/www/straped/mufon/org/49330.html"],"Object Features":"Dome"}