{"City":"Mahopac","Summary":"This is on behalf of my father, an astronomer who witnessed this. He saw this glowing, golden/orange orb being chased or followed by a helicopter last night.","map":"<A HREF = \"http://maps.google.com/maps?q=41.380436,+-73.727835(49332)&iwloc=A&hl=en\"> mufon case (49332) map </A>","Weather Factors":"Unknown","Longitude":"-73.727835","Country":"United States","Tags":"City","trends":["There have been 3 other sightings in Mahopac","There were no other sightings in Mahopac on or around July 30th 2013"],"Date Submitted":"07/31/2013 09:02 UTC","Sighting Duration":"Undisclosed","Region":"New York","Disposition":"Unresolved","Object Flight Path":"Straight-line path","divs":["Sighting DetailsThis information and sighting is on behalf of my father who witnessed the event while star gazing. I was personally sitting in my home reading when I heard a helicopter pass over my home. As it did, everything in my home vibrated sightly from it passing by. It was unusually low. there have been helicopters passing over our house before but never so low that they made our home slightly tremble as it was happening. My father is what most would consider to be an extremely high level recreational astronomer who has been studying the sky for most of his life. Every night stars are out, he is taking photos or testing equipment. shortly after the helicopter I noticed the helicopter passing, he came inside very perplexed and somewhat excited by what had transpired only moments ago at approximately 10:30pm. He claimed to have seen a large gold tinted glowing orb flying below the cloud line making no noise or leaving any particle trails. Approximately 900-1,000' behind it some sort of helicopter was either following or chasing it. The details on what type of helicopter it was are currently unknown to me at this point but he was certain that either this orb was leading the helicopter somewhere or it was being chased by said helicopter. He noted that the tilt of the fuselage of the helicopter was slightly more than he had seen before and also stated the speed of the helicopter was most likely near its maximum. There was still close to 900' between the two objects as they were headed in a straight line in the northern direction with no change noted. He lost sight of the object as it passed by and accumulated distance and naturally fell out of sight with the helicopter behind it."],"Date of the Event":"07/30/2013 10:30 UTC","Object Features":"None","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-07312013-0006","Case Number":"49332","Latitude":"41.380436","Object Shape":"Sphere","Source":"MUFON","files":["/var/www/straped/mufon/html2text/49332.html.txt","/var/www/straped/mufon/org/49332.html"]}