{"City":"Modesto","trends":["There have been 48 other sightings in Modesto","There was one other sighting in Modesto on or around June 11th 2006"],"Region":"California","Longitude":"-120.988128","Summary":"All White, small, quick moving, and some have dark edges on the ends, moving very errictic, and some moving at a steady pace, some glow brighter then are gone then come back for a few secounds then get brighter again and are gone while still in the screen","Disposition":"Insufficient Data","Viewing Distance":"Unknown","Object Features":"Other","Case Number":"4933","Source":"MUFON","files":["/var/www/straped/mufon/html2text/4933.html.txt","/var/www/straped/mufon/org/4933.html"],"Date Submitted":"06/11/2006 04:00 UTC","Country":"United States","divs":["Sighting DetailsThe first time I set up the Camcord in the morning about 8AM, but didn't get anything in the backyard. Then tried again at 4PM in the backyard.2< While looking at the tape on the T.V screen.3< The same objects I saw on 6-09-06.4<White objects that move very fast and erratic and 1 moved very slow and some had the dark edges on the ends. And small. One object was dark and small I thought it was a bird at first intill it stop and hoverd for 18 secounds. I was watching one of the white objects move up and out the top of the screen and I saw a dark small object moving from east to west it past under the whit object then it just stopped and hovered for about 18 secounds then just started going again and moved out to the east.5<Very glad I have it on tape.6< They would move off the screen."],"Log Number":"US-06122006-0005","Object Shape":"Circle, Star-like","Date of the Event":"06/11/2006 04:00 UTC","Tags":"City","Weather Factors":"Windy","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.647237,+-120.988128(4933)&iwloc=A&hl=en\"> mufon case (4933) map </A>","Latitude":"37.647237","Object Flight Path":"Stationary,Straight-line path,Path with directional change,Path then hovering"}