{"City":"Jemez Springs","files":["/var/www/straped/mufon/html2text/49347.html.txt","/var/www/straped/mufon/org/49347.html"],"Latitude":"35.768636","Date of the Event":"07/26/2003 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.768636,+-106.692258(49347)&iwloc=A&hl=en\"> mufon case (49347) map </A>","trends":["There have been no other sightings in Jemez Springs","This sighting has never been favorited."],"Weather Factors":"Unknown","Log Number":"US-07312013-0021","Longitude":"-106.692258","divs":["Sighting DetailsMy friends and I had gone camping near the end of July in 2003, Jemez falls camp ground in Jemez mountains, New mexico. It was becoming very late and my friends girlfriend had asked me if I would walk her to the restroom that were several yards away and in the dark, away from the camp fire. The sky was extremely clear with no moon if there was a moon it was not visible. When we began to walk back to the camp area and in a meadow both her and I were admiring the milky way galaxy. Living in the city of albuquerque we are unable to see stars, planets and the illuminated sky in such detail. We than noticed what appeared to be a falling star going in a north east direction. The light was very bright and had a small blue trail. My friends girlfriend and I awed at the event and I began to make a wish and stated \" I wish....\" but before I could finish my sentence the light stopped near to end of the visible sky from the tree line in our view which would have been at about 20 degrees from the horizon. The light did not stop for long but immediately changed direction towards the west. We had both watched in disappear into the west horizon. The light was extremely fast, too fast for any air craft I have ever seen. Her and I both agreed the light had covered the visible sky in distance in seconds. The light, we had agreed was very star like but slightly brighter and with a small blue trail. When we returned to the camp area my best friend, her boyfriend and another friend had agreed to have seen a falling star like light going into the west horizon but they did not see the directional change or when the star like light was coming from the south west direction"],"Sighting Duration":"00:00:30","Object Features":"Unknown","Source":"MUFON","Case Number":"49347","Summary":"Falling star like craft seen in Jemez falls camp ground in Jemez mountains","Country":"United States","Object Flight Path":"Path with directional change","Region":"New Mexico","Disposition":"Unresolved","Object Shape":"Star-like","Date Submitted":"07/31/2013 04:21 UTC","Tags":"City","Viewing Distance":"Over One Mile"}