{"Region":"Tennessee","map":"<A HREF = \"http://maps.google.com/maps?q=35.854678,+-86.402701(49340)&iwloc=A&hl=en\"> mufon case (49340) map </A>","Viewing Distance":"101-500 Feet","Date of the Event":"07/28/2013 12:00 UTC","Tags":"City","Disposition":"Unresolved","Object Shape":"Cone, Circle, Fireball, Sphere, Triangle","Log Number":"US-07312013-0014","Latitude":"35.854678","Country":"United States","Date Submitted":"07/31/2013 03:07 UTC","Sighting Duration":"Undisclosed","Case Number":"49340","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","divs":["Sighting DetailsA friend and myself were taking a smoke break during a show. We stepped out back. I looked up over the tree to the North and I noticed this ball or orb-like thing in the air coming at us ( or it seemed to ). It was an orangey-red color. My friend looked up and saw it as well. We stood there watching this object. It flew in a direct path then stopped, blinked, and changed direction. When it changed its path it also changed its shape. It was no longer red and orange, but now it was a glowing off white color. It also was projecting a beam from it as well. The beam is what caught my friend and I so off guard. The reason I say this is because: if you are driving in a vehicle of any sort, the beginning of the beam is typically the narrowest while the farthest edge of the beam tends to be wider and less powerful. That was not the case with the object in the sky. Eminating from the object the beam was widest with more distortion in it. The farther the beam was from the object the more of a fine point that it came to. This last for about 20 minutes. The object began to move behind some trees that were approx. 300-400ft away from us. We began to run to see if we could see it from the other side of the trees. The object simply vanished. We felt in awe as we were watching this. After we felt dumbfounded. As we made our way back up to the venue, we went inside and told everyone what we had seen. Some listened with interest others thought we were nuts. If you would like a drawing or something I can make it. This Image is something that I will not forget."],"trends":["There have been 18 other sightings in Murfreesboro","There were no other sightings in Murfreesboro on or around July 28th 2013"],"Source":"MUFON","Summary":"pulsating orb to triangle shape","Longitude":"-86.402701","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/49340.html.txt","/var/www/straped/mufon/org/49340.html"],"Weather Factors":"Unknown","City":"Murfreesboro"}