{"map":"<A HREF = \"http://maps.google.com/maps?q=36.783991,+-119.415152(49358)&iwloc=A&hl=en\"> mufon case (49358) map </A>","divs":["Sighting DetailsI was on the phone with a friend standing outside in my driveway at about 8:40PM on July 31st when I noticed the multi colored flashing lights in the sky. t first glance, I thought it was a helicopter off in the distance. As I observed it for a minute, I knew it wasn't a helicopter or a plane for a couple reasons. Lights don't flash in the random way these were flashing or use the multi colors I saw. It was also silent and maneuvered in a way no plane or helicopter could. I ran in the house to grab some of my family members to come look at this. As we went back outside it was closer to us than before and it looked like the lights were dancing around each other then they would flatten out and come back together again, randomly flashing and randomly changing colors. During this display we lost sight of the object for the first time after about 5 minutes when it dropped below the trees. After about 2 minutes it rose back up in the sky and appeared to hover until it randomly danced around the sky and dipped below the tree line and didn't come back. The 4 of us were very puzzled as to what we just saw and are searching the web for any other sightings in this area that may have been reported"],"files":["/var/www/straped/mufon/html2text/49358.html.txt","/var/www/straped/mufon/org/49358.html"],"Tags":"City","Object Features":"Unknown","Case Number":"49358","Longitude":"-119.415152","Viewing Distance":"Over One Mile","Region":"California","Log Number":"US-08012013-0002","City":"Undisclosed","Country":"United States","Date of the Event":"07/31/2013 08:40 UTC","Object Shape":"Triangle","Disposition":"Unresolved","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Sighting Duration":"00:20:00","trends":[],"Summary":"several lights randomly flashing and multi colored moved around the east southeast horizon","Latitude":"36.783991","Date Submitted":"08/01/2013 03:03 UTC","Source":"MUFON","Weather Factors":"Unknown"}