{"Disposition":"Unresolved","City":"Henderson","Case Number":"49351","Object Shape":"Chevron, Circle, Diamond, Disc, Fireball, Flash, Sphere, Triangle","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Region":"Nevada","trends":["There have been 36 other sightings in Henderson","There were no other sightings in Henderson on or around September 1st 2008"],"Viewing Distance":"Over 1 Mile, Unknown","Date of the Event":"09/01/2008 07:30 UTC","Country":"United States","divs":["Sighting Detailsnear las Vegas, for several days I noticed what looked like a second sun. Last day that I watched this, there was a different pattern. The big ball of light had a very dark square in the middle, so I took five pictures in sequence. I was shocked on the picture that showed a round shape above it that had a perfect shapes of a diamond pattern that was pink in color with a bright white light in the center and a white light shooting out of that. I could only see the bright ball of light visually with a black square in the middle, but the camera showed so much more. It illuminated the sky, so I thought I would hear something on the news, nothing. No one else seemed to notice. I looked up the two sun appearance online, other areas did notice this, but they didn't get pictures like mine. The lights seemed to be parallel with the sun going down, but the last day I saw it, it was different. I still can't get over what I saw and I haven't seen anything like it since. I tried to attach photos, but The buttons below won't open???"],"Weather Factors":"Unknown","Summary":"bright light with dark square in middle. Picture shows pattern & light shooting from ball of light","Longitude":"-115.115749","files":["/var/www/straped/mufon/html2text/49351.html.txt","/var/www/straped/mufon/org/49351.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.912749,+-115.115749(49351)&iwloc=A&hl=en\"> mufon case (49351) map </A>","Latitude":"35.912749","Date Submitted":"07/31/2013 04:44 UTC","Log Number":"US-07312013-0024","Object Features":"Patterned Surface, Appendage(s), Other","Tags":"City","Source":"MUFON"}