{"Country":"United States","divs":["Sighting DetailsI lived in the woods in a cabin, nearest neighbor 3 miles away. It was night time, I was in the loft and had just gotten my son to sleep, and noticed that the sounds in the woods was oddly silent, too quiet, when I heard what reminded me of a rocket launch ... that lengthy powerful kind of sound and I thought possibly a plane or something large was going to crash, I did not see anything until we got up the next day and our roof was covered with a shifting, glowing kind of hovering substance, that is hard to describe, it was not actually ON the roof, but hovered lightly above it. then the following night I was up in the loft looking out our window when I saw a large glowing orb just above the tree line and thought it was a plane or something so I was just watching it thinking eventually it would come closer or move, turn, something and it did not, so I continued to watch it trying to decide what the heck it was (normally we were not in a flight pattern so even a plane or helicopter or ? would not have been flying over us). when it started changing color, kind of a swirling like what you might see if you were looking at a soap bubble when the sun hits it... and it started making a kind of sound that is hard to describe maybe a whirling but not exactly and it pulsated in size a little larger and then smaller (not greatly but enough that it was noticeable) and all of a sudden it moved like so fast that it was shocking in a angle that I had never seen any thing else do , stopped on a dime as if it had brakes. then went back to the original glowing that was just intense white, sat there for a while in the sky and then again with the color shift etc... and moved another kind of weird angle move and Stop dead again. it did this several times and then when it finally left out of sight it shot off did a couple zig zags and gone out of sight. I watched it the following night and similar activity, but during that day the Military had come in and they had mistakenly driven up our drive way probably not knowing that there was a house there, and did not stop to talk or anything but tried to go on the drive or rural road thinking it went some where but it did not so just turned around and went back down our hill onto the main logging road. Which we thought was really odd. This went on for about a week seeing it at night time, and the Military being in the area, to the point of me being outside when one of those helicopters that has the big doors on both sides dropped down to about roof level of my house and hovered over my yard area with men in it, binoculars, etc... I could hear them talking etc. but they did not really talk to me and gave no kind of excuse as to why they were there or apology for being so rude either... The following day a man showed up at our home and had like a forestry uniform on and offered us a job, we had to go to a place a few miles down the logging road where they had burned off some slag piles and they needed someone to do firewatch during the night, so we needed the cash and did that (they specified they wanted both of us to do it, which meant we left our home without occupants) when the man came in the morning where we were doing the fire watch, he sent us home. I noticed that some of the things in my home were out of their places, like someone had been in there looking around. Now you have to understand we had no electricity or phone, so calling anyone to report a possible break in was not an option. We just kept our eyes open for intruders and it made me nervous when during that couple weeks we had to drive into town, which was 45 minutes to an hour drive. We had a goat that was like a house pet, but when we left we tethered him up so he could eat the undergrowth around out house. When we came home we could not find him and started searching because we knew HE could not have un-chained himself. We had a Wood shed with Vertical boards in it, and spaces between about 2 inches apart where we found his chain pulled (as if it had been tauntly pulled) through into the wood storage area and tried to get around back of the shed to find him, but the under growth was dense so we had to chop it away to get to where our goat was... he was in a small clear area, strangely clear, no vegetation at all, as if there had never been any growth there and was dry dirt, just enough size around him to stand by him ... he had been cut with what had to be a very sharp knife or ? from under his chin to his groin, and laid there open but no blood anywhere, not on the ground, on his fur or in him, it was creepy, like something had just cut him open and sucked out all the fluids. I was so upset that I did not check to see if all his innards were there, and had my husband bury him. That was when we took into conscious realization that on our way into town and back we had noticed all the fence postings about lost or missing animals, ranging from dogs to cattle... and then later on when we went to town we started hearing the talk from others about their missing animals, but no one mentioned finding any of them. During this time I think I had a dream, I am not sure what it was... but just in case it applies to the incident I will add it. I was in the loft when I heard something try to come into our front door and then I just saw three beings standing there. Now I can see them clear as a bell in my head, but the moment I try to describe them in writing or verbally, the image is gone and I can not tell what they looked like no matter how hard I try, it is as if I see it in my head, but when I try to share what I saw, it is blank... all I know is there were three, and I do know that they were not people, nor were they the common alien image of the big head, with those big black eyes. I slept with a 45 under my pillow because I was alone alot, with my son... I tried as I had done all along every time I saw the orb to wake my husband who would not wake up for me, it was like he was knocked out and I never could get him to wake up to watch the orb with me... so I tried the night I think I was dreaming to wake him, because someone was in our home and I was afraid of what may be going to happen... for some reason I had this more than average intense fear of them taking my son who was about 2 years old. I remember taking the gun out from under my pillow, aiming and firing a shot.. hitting one of the three standing there looking up at me, and then being hit with this kind of slam to my brain, like a thought but not aloud, only it was like a slam nearly knocking me off balance and it was the word Archaic. the only other part of the dream then was them grabbing at the one I hit and not really walking out of my house through the door but just kind of being there and then not being there. The following day I had my husband drive me to town and I called family to come move me, I was not going to stay there any longer. I have no idea how long the military stayed in the woods and were there with helicopters, vehicles and soldiers tramping around. We saw them a couple times near our cabin but they never interacted with us and when we would try to go speak to them, they would high tail it out of there. But I had the feeling by the way they acted that we were under some sort of surveillance. I did not tell anyone about this for several years because I thought they would think I was just making a big deal out of a bunch of unrelated things or that the orb I saw was nothing more than an aircraft light or ?? but with a easy explanation that would make me sound like a lunatic for thinking it was something peculiar. When I did tell the story to someone, just telling it would make me draw my legs up under me and kind of take on this kind of fetal type sitting position, because it was still and is still frightening to me, but I can not really tell you why it frightens me yet it is more than just seeing a glowing orb and being curious about what it could have been.. And oddly too, after my husband saw the stuff on the roof, and he went up to touch it... that was all he witnessed because I could not WAKE him up to watch it with me or witness it or give his input on it, it was like he was medicated and could not wake up, no matter how I shook him to get him to wake up. He never saw the orb, he only saw the florescent green shifting stuff on our roof, was aware of the Military in force, that our house had been gone through while we were fire watching and was aware of the goat, as he found him, looked at him with me, buried him and he knew that I was so upset by all that I had seen that I was leaving the cabin with our son as fast as I could from the fear I had of all that I had seen. This incident was a large part of why we split up and divorced. the only other thing I can add is that it was not a one time viewing of the orb, it went on for more than a week. It has been so long ago I can not give a date as to month, but I believe it was fall to very early winter based on my memory of weather conditions on the pass when I moved away and from the age of my son at the time, I estimate it to be about 1976. But it could have been 1977. Nor can I tell you what times I saw it, we had no electricity and clocks were not really part of our lives, the times I saw it were near night fall to late night, it did not come at the same times and I would watch it for a long time, I would say anywhere from 15 minutes to an hour of activity, it did not have a pattern like showing up same time, lasting the same length of time. I remember watching it one time where it seemed like hours, but, I have no way of saying that is a fact because I did not have a clock to check."],"files":["/var/www/straped/mufon/html2text/49353.html.txt","/var/www/straped/mufon/org/49353.html"],"City":"Duvall","Source":"MUFON","Longitude":"-121.980478","Date of the Event":"10/15/1976 10:00 UTC","Object Flight Path":"Stationary,Path with directional change,Path then hovering,Other","Region":"Washington","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Disposition":"Unresolved","Latitude":"47.750492","Log Number":"US-07312013-0026","Viewing Distance":"Unknown","Case Number":"49353","trends":["There has been one other sighting in Duvall","There were no other sightings in Duvall on or around October 15th 1976"],"Date Submitted":"07/31/2013 05:10 UTC","Object Shape":"Sphere","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=47.750492,+-121.980478(49353)&iwloc=A&hl=en\"> mufon case (49353) map </A>","Object Features":"Unknown","Summary":"orb, shifting colors, shape change then instant change of postions"}