{"Object Shape":"Oval","Summary":"400ft, silent, black oval shaped object hovering above 50-60ft pine forest in rural Michigan. The object moved very, very slowly a few feet above the treeline. Absolutely quiet with NO air disturbance to the surrounding trees, etc. Oval blackened the star","Date Submitted":"07/31/2013 05:09 UTC","trends":["There have been 4 other sightings in Ionia","There were no other sightings in Ionia on or around April 1st 1966"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.992555,+-85.067367(49352)&iwloc=A&hl=en\"> mufon case (49352) map </A>","Country":"United States","files":["/var/www/straped/mufon/html2text/49352.html.txt","/var/www/straped/mufon/org/49352.html"],"Disposition":"Unresolved","Log Number":"US-07312013-0025","Longitude":"-85.067367","divs":["Sighting DetailsIt was spring or fall in 1964-1965. I was approximately 11-12 years old. My family was visiting a small farm surrounded by a large(30-40ft) pine forest in a very desolate, rural area of Michigan. A friend and I decided to go for a walk down the straight road which led to the house. It was late at night, pitch dark with a clear sky. We took small flashlights with us in order to see the road. The road was next to a small (500ft across) corn field. The pine tree forest was next to the corn field. We walked about 300 ft from the house and then turned around to head back to it. Being from a large city, I could not stop myself from starring at the billions of stars in the sky. It was like the \"star\" shows at the Observatory. Suddenly, I looked across the corn field, above the pine trees, and saw that a large oval shaped, dark black or deep purple, \"patch\" blocked out all the stars. It was huge (football field in length, width half a football field), especially since we were so close to it. It hovered a few feet above the treeline absolutely SILENT. Then, it started to move across the top of the treeline SILENTLY AND VERY SLOWLY (5-10mph). What was really strange was that there was NO movement to the leaves as the object moved through the top of the forest. It seemed like the object DID NOT create any air movement around itself as it moved. We watched the object for only a few minutes as it continued silently and slowly move across the treetops. We then ran back to the house scared and screaming, trying to get the adults to see the object. They, unfortunately, laughed at us and refused to see what was going on outside."],"Object Features":"None","Weather Factors":"Unknown","City":"Ionia","Source":"MUFON","Object Flight Path":"Hovering then path,Straight-line path","Region":"Michigan","Latitude":"42.992555","Tags":"City","Viewing Distance":"101-500 Feet","Case Number":"49352","Date of the Event":"04/01/1966 09:00 UTC","Sighting Duration":"Undisclosed"}