{"Latitude":"35.058604","Case Number":"49361","Object Flight Path":"Straight-line path","City":"Fayetteville","divs":["sighting detailson the evening of july 29th, 2013 at approximately 9:45p.m. while driving home on a lonely dark country road i saw what appeared to be a set of stadium lights rising above the trees in a wooded area about 1\\4th of a mile off the road. i was briefly perplexed thinking \"i didn't know there was a ball field out here.\" being that i was on a hill i had a fairly good view. as i proceeded down the hill i decided to pull over to get a better look. i turned my truck off (it is a 5-speed and difficult to simply idle)and was struck by the deafening silence that surrounded me. what had happened to the nightly frog and cricket orchestra that graced our country summers? the two lights suddenly appeared to be so much closer (even though up until this point i had not seen them move). they slowly advanced towards the road and within what seemed like a second were directly in front of me just a little above the tree line. i said out loud \"oh my god, oh my god\". it was now evident that the two lights were connected by a long, dark 'body' which donned a row of small airplane-like lights of varying colors (red, blue, green). the shape resembled a barbell with the lights being the weights. it was about the size of a commercial airplane. to be so humongous it was amazing that i heard nothing! and the lights were so bright however my vision was unaffected. the vessel disappeared from my visual field once it's entirety had crossed the road. i pulled away and looking in my rear view mirror saw nothing."],"Tags":"City","Date of the Event":"07/29/2013 09:45 UTC","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=35.058604,+-78.872158(49361)&iwloc=A&hl=en\"> mufon case (49361) map </A>","Date Submitted":"08/01/2013 09:47 UTC","Object Shape":"Other","Log Number":"US-08012013-0005","files":["/var/www/straped/mufon/html2text/49361.html.txt","/var/www/straped/mufon/org/49361.html"],"Object Features":"Other","Longitude":"-78.872158","Region":"North Carolina","Sighting Duration":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","Country":"United States","Summary":"Witnessed a large barbelled shaped craft hovering over the treeline.","trends":["There have been 20 other sightings in Fayetteville","There were no other sightings in Fayetteville on or around July 29th 2013"],"Viewing Distance":"501 Feet - 1 Mile"}