{"divs":["Sighting DetailsClose to midnight, I was heading home from a friend's house I was entering the northbound I-15 freeway towards Corona in Riverside County. About 12:00 I saw a streak in the sky coming down and to the left at a steep angle. I thought, \"Lucky me, I saw a shooting star!\" However, the streak disappeared. After about a half-second to a second at the general location that the streak had disappeared, a star-like light reappeared and was hovering for about 2-3 seconds as if trying to gain momentum and then it began to move to the right in an erratic way. It accelerated and decelerated sporadically, gaining altitude and then coming down until it gradually settled on a constant path. From the time that the second light appeared it was noticeably flashing white, red, and blue at a constant rate. At first I thought the new light source must have been a plane that I didn't notice before that was flying at a different direction. But as far as I could tell, it was a single light source, like a star and not a plane (about 15 minutes later, I made a visual comparison of what I saw with a plane I saw near the Eastbound 91 Freeway). The star-like UFO seemed to be flying over Rancho Cucamonga, CA towards the San Antonio Mountains. At that distance, it was moving extremely fast, from my vantage point at the El Cerrito Road intersection on the Northbount 15 Freeway it was moving about an inch per second in the sky. I tracked its movement as I drove from El Cerrito Road to the 91 Freeway overpass in Corona, CA. It was generally moving north-northeast, heading towards the mountains where it had gradually disappeared. I was excited, confused, and a bit mystified by the experience. I had encountered a similar incident in my elementary school days, and to affirm that the unexplainable experience was real in the sense that it happened twice was gratifying."],"Source":"MUFON","Latitude":"33.8307","Viewing Distance":"Over 1 Mile, Unknown","trends":["There have been 36 other sightings in Corona","There were no other sightings in Corona on or around August 1st 2013"],"Tags":"City","Log Number":"US-08012013-0010","Object Shape":"Star-like","Disposition":"Unresolved","Summary":"fell like a meteorite with a streak, stopped, flew erratically; star-like","Sighting Duration":"Undisclosed","City":"Corona","Object Flight Path":"Hovering then path,Path with directional change","Country":"United States","Weather Factors":"Unknown","Date Submitted":"08/01/2013 03:24 UTC","Case Number":"49366","Object Features":"Unknown","Region":"California","files":["/var/www/straped/mufon/html2text/49366.html.txt","/var/www/straped/mufon/org/49366.html"],"Date of the Event":"08/01/2013 11:59 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.8307,+-117.529144(49366)&iwloc=A&hl=en\"> mufon case (49366) map </A>","Longitude":"-117.529144"}