{"divs":["sighting detailsone friday night shortly after graduating high school, a couple of friends and i went to a \"party\" in one of the nicer neighborhoods in belton, texas. my friend \"mark\" went inside the house to drink, while my friend \"emma\" and i stayed outside to talk, not interested in joining the party (we did not care for the people that were there). emma and i stayed outside to hang out and let down somebody's truck tailgate so we could sit inside the bed of the truck. we spent an hour talking to each other and eventually laid down looking up at the stars, trying to pass the time. when i started to get a little sleepy, i noticed what seemed like a cluster of stars in the sky moving together in unison. i focused in on the moving stars and noticed the cluster was shaped like a boomerang, and was revolving like a boomerang, but flying very slowly in a straight path. soon after i began looking at this object, emma asked if i was seeing the same thing she was. i had not realized that anything was out of the ordinary until she acknowledged that she was seeing the same thing moving across the sky. the object was camouflaged among the stars and one probably would not have seen it unless he\\she was focused in on that specific part of the sky, just as we had been while laying down in the back of the truck looking up at the stars. the object had no visible outline, but it's shape was only distinguishable from the lights it had on it. the lights did not blink, nor were they different colors. it looked exactly like a cluster of stars shaped like a boomerang, revolving very, very slowly across the sky in one direction. i was amazed seeing the object and was not scared at all. i believe emma felt the same way. the object slowly flew across the sky until trees blocked it from our view."],"Date of the Event":"06/10/2006 12:00 UTC","Tags":"City","Object Flight Path":"Straight-line path","Summary":"Boomerang-shaped UFO camouflaged among the stars, flies like a boomerang but in a straight path overhead.","files":["/var/www/straped/mufon/html2text/49362.html.txt","/var/www/straped/mufon/org/49362.html"],"Sighting Duration":"Undisclosed","Case Number":"49362","Source":"MUFON","Disposition":"Unresolved","Object Features":"Patterned Surface","Log Number":"US-08012013-0006","Object Shape":"Boomerang","Country":"United States","City":"Belton","trends":["There have been 2 other sightings in Belton","There were no other sightings in Belton on or around June 10th 2006"],"map":"<A HREF = \"http://maps.google.com/maps?q=31.062243,+-97.456153(49362)&iwloc=A&hl=en\"> mufon case (49362) map </A>","Latitude":"31.062243","Longitude":"-97.456153","Viewing Distance":"Over One Mile","Date Submitted":"08/01/2013 12:00 UTC","Weather Factors":"Unknown","Region":"Texas"}