{"Object Shape":"Sphere","Sighting Duration":"Undisclosed","Date Submitted":"08/01/2013 01:24 UTC","Summary":"Going across Susquehanna river when I saw a saucer hovering above a power line.","Log Number":"US-08012013-0009","Object Features":"Dome","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.038918,+-76.49455(49365)&iwloc=A&hl=en\"> mufon case (49365) map </A>","Country":"United States","City":"Columbia","Latitude":"40.038918","files":["/var/www/straped/mufon/html2text/49365.html.txt","/var/www/straped/mufon/org/49365.html"],"trends":["There have been 3 other sightings in Columbia","There were no other sightings in Columbia on or around July 1st 1970"],"Source":"MUFON","Region":"Pennsylvania","Longitude":"-76.49455","divs":["Sighting DetailsActually I have had 4 different alien experiences. 1. The above experience. 2. At a outdoor Jazz concert east of Atlanta, Ga. when I looked up and saw a cigar shaped object fly slowly towards me. This object had 3 planes with him. 3. Heading north on I95 in Virginia when I saw a light moving around quickly north of where I was. This object would move east and then west. 4. I am a medium and psychic and saw 3 men talking to each other at a shopping center in Myrtle Beach, SC. The were sitting apart from each other which I thought was very unusual. So I sat down with them. Only one of them would talk to me. He told me he was from Winston-Salem, NC which I knew was a lie. Then his wife showed up who only stood around 5 ft. tall. She said very little and carried no pocketbook but what was really bizarre was I received a feeling that they were not human even though they looked like it. So I asked them who they really were and then they stopped talking to me. I talked to them for at least 20 min. and they said very little. I got up and shook their hands and they were cold and sweaty."],"Case Number":"49365","Disposition":"Unresolved","Viewing Distance":"101-500 Feet","Date of the Event":"07/01/1970 12:00 UTC","Tags":"City","Object Flight Path":"Hovering then path"}