{"Sighting Duration":"Undisclosed","trends":["There have been 3 other sightings in Farmington","There were no other sightings in Farmington on or around August 1st 2013"],"divs":["Sighting DetailsI live south of the Twin Cities, MN. Lots of plane travel overhead. I have lived in this area probably 25 out of my 35 years. This light was unusual at the instant I saw it. I was laying on my couch watching the animal planet channel on tv. I have a townhome. All of my windows are covered except for a couple that are up high. When I noticed the light, I jumped up and went on the deck, which is also on the south side. I did not see where this light originated from. I thought it might be a plane on fire and crashing at first. The light did not get brighter or dimmer for probably 3 minutes. It just went from 60* to nearly 90* or directly overhead. The light was much different than an airplane. It was orange. It also looked to be flashing. It was obvious to me that it was either really small or very far away. It looked like the light was coming out of 270* of the circumference of the object. There was a quarter of the object that didn't seem to be emitting light. After it got near 90*, it went very dim. I stood staring up where it went dim for a couple of minutes before I saw a very dim orange light moving in almost the opposite tragectory. It was moving slowly. It was not a plane, was too dim, and was the wrong color. I thought what I was watching might have been a satellite. As it went from near 90* to the horizon almost due south, it seemed to get larger. It was much less illuminated than it was when it was traveling in the opposite direction. When it got to about a 45* angle, it abruptly changed directions. It went straight west and started descending. It did not look like it was a physical object as it descended. It looked as if it was 3 translucent globes of faint light that were moving together. I have experienced other things that I cannot explain. To me, looking for a plausible explanation, this might have been a home made rocket. There was no trail, but the rocket might have been launched in Iowa. The intertwining globes that I saw could have been parachutes. What was weird is that it was orange on the way down as well as the way up. Even the parachutes were illuminated in an orange color. I have two other experiences that I will report now."],"Tags":"City","Weather Factors":"Unknown","Object Features":"None","Summary":"Very Bright Large Orange Flickering Light rising, and dissipating, changing directions twice and landing","Latitude":"44.636685","Date of the Event":"08/01/2013 10:15 UTC","Object Flight Path":"Path with directional change","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=44.636685,+-93.152366(49379)&iwloc=A&hl=en\"> mufon case (49379) map </A>","Date Submitted":"08/02/2013 02:45 UTC","Case Number":"49379","Log Number":"US-08022013-0006","Longitude":"-93.152366","files":["/var/www/straped/mufon/html2text/49379.html.txt","/var/www/straped/mufon/org/49379.html"],"City":"Farmington","Disposition":"Unresolved","Source":"MUFON","Viewing Distance":"Unknown","Region":"Minnesota","Object Shape":"Circle, Flash, Sphere, Other, Unknown"}