{"Log Number":"US-08012013-0016","Summary":"UFO activily brightened while stationary then descended south then ascended","map":"<A HREF = \"http://maps.google.com/maps?q=35.416851,+-118.945864(49372)&iwloc=A&hl=en\"> mufon case (49372) map </A>","City":"Bakersfield","divs":["sighting detailsat exactly 5:11 9\\12\\11 while talking to my girlfriend dallas on the phone, i was talking about how i enjoy looking up at the sky and stars to watch for extra phenomenal activity. right as i said it, what blended in as a star in the northern sky i watched suddenly brighten right when i was saying \"i like to look up for extra phenom...\" then was distracted by its sudden illumination. it hovered for a moment then suddenly made movement south seeming like it was coming towards me and dropping, it then suddenly ascended upwards at a 50-60 then 75-85 degree angle \"with a hue and extracting stream of light behind its path like a tail as it sped up\" heading slightly ne it then disappeared out of the atmosphere. the entire event lasted about 30 seconds at most. i have not reported this until now in fear of scrutiny or some form of retaliation. this happened in 2011, while i expected something eventually; it only tied into my theory. but when it happened again, only not quite as brilliant just last week. my girlfriend and i decided to report, provide theories if wanted and investigate. to sum it up, it really happened and i truly believe its our-future and\\or from out of this world. in addition i have included a photo of a ufo my nephew witnessed and got pretty shook up by it, i personally interviewed him."],"Disposition":"Unresolved","Case Number":"49372","files":["/var/www/straped/mufon/html2text/49372.html.txt","/var/www/straped/mufon/org/49372.html"],"Country":"United States","Weather Factors":"Unknown","Viewing Distance":"Over 1 Mile, Unknown","Longitude":"-118.945864","Region":"California","Object Flight Path":"Hovering then path","Date Submitted":"08/01/2013 11:12 UTC","Tags":"City","Object Features":"Unknown","trends":["There have been 32 other sightings in Bakersfield","There were no other sightings in Bakersfield on or around September 12th 2011"],"Date of the Event":"09/12/2011 05:11 UTC","Source":"MUFON","Latitude":"35.416851","Sighting Duration":"Undisclosed","Object Shape":"Sphere, Unknown"}