{"City":"Columbus","Longitude":"-82.995244","Date Submitted":"08/02/2013 12:27 UTC","Object Flight Path":"Hovering then path,Path then hovering","files":["/var/www/straped/mufon/html2text/49374.html.txt","/var/www/straped/mufon/org/49374.html"],"Tags":"City","Viewing Distance":"Over One Mile","Log Number":"US-08022013-0001","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Latitude":"39.970346","trends":["There have been 70 other sightings in Columbus","There were no other sightings in Columbus on or around July 29th 2013"],"Source":"MUFON","Date of the Event":"07/29/2013 09:40 UTC","Summary":"i have photos- i spotted ufo the night before and lost it. on th 29th i never took my eyes off it when it cloaked into a dim star. at the same time i watched 90degrees above me one blink out,and thats when the one at 35degrees cloaked itself.","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.970346,+-82.995244(49374)&iwloc=A&hl=en\"> mufon case (49374) map </A>","Country":"United States","Object Shape":"Star-like","Object Features":"Other","Region":"Ohio","divs":["Sighting DetailsDriving to store and noticed the UFO in the same place as the night before. I noticed it because of the bright flickering of white,blue,red lights. I watched it slowly move north and then northwest before becoming stationary.as I am waiting for additional activity, I noticed a bright star-like object almost 90degrees above me heading dew north. After 6-8 seconds it flickered and disappeared.as I brought my attention back to the original UFO (10 seconds tops) it flickered like the other one but it cloaked into a dim star and stayed that way till I left 10 mins later. I took photos during the sightings- none of the one above me. I did capture green exhaust and red exhaust on two separate photos. There's shots that I zoomed in on the computer (transferred from camera) gave more detail then I could imagine. The ship looked like it had 3-4 giant lights around the ship and maybe 3-4 smaller lights lights in different areas. Some pictures were blurred- i think I was shaking a little. But 2 photos look good and the best one will send chills down your back. Irrefutable evidence,yes for me. You can make your conclusion when you see them. I don't need convinced on what is out there. I just want to provide evidence to others who want to see but never had the chance (opposed to the extremism religious type who are scared or closed minded). Checking with OSU to see what they think of the photos, and then I will release them to the public. When release the photos, I will label it as UFO cloaking near OSU."],"Case Number":"49374"}