{"Source":"MUFON","Longitude":"-93.534226","files":["/var/www/straped/mufon/html2text/49382.html.txt","/var/www/straped/mufon/org/49382.html"],"Object Features":"Patterned Surface","Object Shape":"Triangle","Weather Factors":"Unknown","Log Number":"US-08022013-0009","City":"Haughton","Date Submitted":"08/02/2013 05:45 UTC","Date of the Event":"01/02/2013 10:40 UTC","Case Number":"49382","Latitude":"32.672947","Viewing Distance":"101-500 Feet","Summary":"Unknown soundless Triangle Aircraft with three white lights on each corner and one bright red in the middle, two yellow side lights as if outer cockpit runner lights.","map":"<A HREF = \"http://maps.google.com/maps?q=32.672947,+-93.534226(49382)&iwloc=A&hl=en\"> mufon case (49382) map </A>","Country":"United States","Disposition":"Unresolved","divs":["sighting detailsi was outside to smoke a cig and was looking at the air traffic and meteors, i saw what looks like a stealth fighter coming out of the afb still with it's landing lights still on and to my right this craft came out of the tree line across the road so low that if i was in a tree i could spit on it. it hovered like a harrier, about the size of a f16 because i could see the outline due to the stars and city light pollution. black in color, no light reflection on it at all like it diffused light, it had three white led lights on each corner not on the tips that did not blink, one bright large red light in the middle like a car tail light but round in shape that did not blink and it turned on what looked like yellow\\orange cockpit runner lights, small like flashlights on the upper top side as if it was trying to miss or make sure not to hit the power lines. it was solid and shaped like a arrow head or a long triangle it was thin with no wings or tail and no exhaust to be seen, felt or heard. i could hear the other plane in the background as it was higher up but this thing was right above me and no wind and no sound at all. it traveled at about 20-25 mph and slowed down to about 5 mph above my lawn as if he saw me and i saw him. i didn't know what to do looking up at it, thinking what is this guy doing? i felt like a deer in head lights, it started following the plane or going the same way but was at a really low altitude i'd say below radar scope. i walked to the other side of my deck to see where is was going, as i did i seen it bank left and tilt into a left turn before it was gone due to the trees. i really wish i recorded it, it'll never happen again. my wife and father were outside with me."],"trends":["There have been 5 other sightings in Haughton","There were no other sightings in Haughton on or around January 2nd 2013"],"Sighting Duration":"00:04:40","Object Flight Path":"Path with directional change","Tags":"City","Region":"Louisiana"}