{"trends":["There have been 3 other sightings in Gray","There was one other sighting in Gray on or around July 3rd 2013"],"Source":"MUFON","City":"Gray","Date Submitted":"08/02/2013 02:41 UTC","Log Number":"US-08022013-0016","Country":"United States","Viewing Distance":"20 Feet or Less","Tags":"City","Case Number":"49389","files":["/var/www/straped/mufon/html2text/49389.html.txt","/var/www/straped/mufon/org/49389.html"],"Region":"Maine","Date of the Event":"07/03/2013 10:30 UTC","divs":["Sighting DetailsI was babysitting for my neighbor - two 9-year-olds and a 13-year-old (I'm 18). We were playing Wii, and we heard someone shout, \"Hey!\" from outside - it sounded exactly like my neighbor. At the same time, the computer in the room shut itself off and the TV flickered. We figured that the adults had arrived home, but when we went to the window, there was nothing outside except for this strange shadow. It looked like it might be a person, but it didn't move. We waved at it, and it started emitting this red-orange sort of linear light - almost like a sparkler, but the light pulsated. We started to panic, and I called the person whose voice we thought we heard and told him what was going on. When I went back to the window, the light was gone, but the shadow was still there. The adults arrived 15 minutes later, and we told them what had happened. When I went outside to go home, I noticed a dark spot on the driveway, like what happens if you splash water on a spot, but it was too dark to really make anything out. We all really think it was some kind of strange alien that copied the voice of the person we thought we heard somehow, and we were all scared for our lives. I know at least one of the other witnesses had a nightmare from it - it was really unnerving. Even the two pet dogs at the house with us were acting very strange, jumping up on the couch and panting heavily even though it wasn't hot outside. I had taken several photos of the light, but they've disappeared, despite other pictures I took that night being unneffected."],"Disposition":"Unresolved","Weather Factors":"Unknown","Summary":"Confusing - may not have been UFO, but no real explanation.","Object Flight Path":"Stationary","Longitude":"-70.328958","map":"<A HREF = \"http://maps.google.com/maps?q=43.879624,+-70.328958(49389)&iwloc=A&hl=en\"> mufon case (49389) map </A>","Object Shape":"Other","Object Features":"Other","Latitude":"43.879624","Sighting Duration":"00:00:05"}