{"Country":"United States","Tags":"City","trends":["There have been 5 other sightings in Okmulgee","There was one other sighting in Okmulgee on or around August 2nd 2013"],"Region":"Oklahoma","Viewing Distance":"Unknown","Date Submitted":"08/02/2013 11:00 UTC","files":["/var/www/straped/mufon/html2text/49384.html.txt","/var/www/straped/mufon/org/49384.html"],"Weather Factors":"Unknown","City":"Okmulgee","Log Number":"US-08022013-0011","Latitude":"35.668805","Disposition":"Unresolved","Sighting Duration":"00:05:00","Source":"MUFON","Longitude":"-96.074718","Object Flight Path":"Hovering then path","Object Shape":"Cigar","Object Features":"Other","divs":["Sighting DetailsOutside at my sister in law home smoking. I noticed the object while looking for an usual commercial airplane altitude. When I turned my head toward the east, I saw this enormous objects. When I first saw it I was astonished cause of the size. It was hovering horizontally in the sky. I told my sister to come check it out and the object was vertical at that point. When I saw it I had no doubt in my mind that it was a UFO. It was hovering, it was as big as a skyscraper, had 3 bright light that allowed me to make out the color,metallic silver. It was approximately between 4 -5 am As soon as I noticed it was sitting horizontally on the eastern sky of Oklahoma, I called my sister in law cause I wanted her to see it. I looked and the object was vertical at that point. Before she could get a good look of it, this \" mountain\" flew up at a speed none of our aircraft could even come close to attempt, due to the monumental size of this object, I still can't believe what I saw last night. I never ever seen anything that can even come close to it. It was enormous ! It was cigar shaped but rounded on one side, and I don't understand how something so big could disappear in matter of seconds!!!"],"Date of the Event":"08/02/2013 04:30 UTC","Case Number":"49384","map":"<A HREF = \"http://maps.google.com/maps?q=35.668805,+-96.074718(49384)&iwloc=A&hl=en\"> mufon case (49384) map </A>","Summary":"Cigar shape, as big as one of the twin towers, first the object was horizontal then vertical with 3 huge lights. When the light were pulsating I could see a distinct metallic grey color. This thing was humongous!"}