{"trends":["There have been 8 other sightings in Rancho Cucamonga","There were no other sightings in Rancho Cucamonga on or around September 5th 2012"],"Latitude":"34.111799","Tags":"City","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=34.111799,+-117.586478(49395)&iwloc=A&hl=en\"> mufon case (49395) map </A>","Object Features":"Dome","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/49395.html.txt","/var/www/straped/mufon/org/49395.html"],"Longitude":"-117.586478","divs":["Sighting DetailsI fell asleep in my room. I didn't write down the exact date later. My window was open, no screen. All the sudden, I woke slightly, only remembering being pulled out of my window, and down the pacific-electric trail. I felt something holding me my under my arms, but nothing was there. I was immobilized. I was positioned upright. I kept falling in and out of consciousness. I was being pulled down the trail slowly, then gained incredible speed. No one was on the path, but apparently someone was coming towards us because I then was swept up quickly. I don't remember anything after that until I woke on a metal table. My arms, feet and head were all held against the table with some type of nerve device. It's hard to describe, but my outer wrists were pressed against a small plate which would not allow me to move. It was something that tapped into my nerves and sent signals to my brain, which wouldn't allow me to move. I remember squirming a lot, with my head and my temples were getting sore. I kept waking and falling back asleep. They tried to keep me out, but I'm stubborn. I kept waking up. I saw a couple of your typical looking aliens off to the side of me, about 15 feet away. They were looking at each other, then back at me. I couldn't tell if they were Doctors or Nurses. They were short, around 5', with large, dark eyes. I fell asleep again. Next thing, I'm sitting in a chair and there's an alien sitting across from me. She was talking to me, but not verbally. She was tapped into my thoughts, and therefore I was tapped into hers. She kept thinking, \"you're ok. We're not going to hurt you. We're all done now. Your'e fine.\" I felt like she was very compassionate and kind. As she was thinking this, I could see into her mind and I knew they could hear her thoughts in the mother ship, above us so she had to be careful what she said to me. She seemed intimidated. I got the feeling I had been in one of their ships before...that this was like a \"follow-up\". I felt as though something was put in or taken out of my stomach. I could see the mother ship (above us) and the medical ship (We were in, but much smaller) in her head. We were hovering, all lights out on the outside, slightly above the tree line. She was considered a peon worker, even though she was a nurse. She had bug-like features, with fillers to the right and left of her head. Her skin was the texture of a snake, but all grey. She didn't have abnormally large eyes, just medium, but larger than mine. She was part human, from what I could see in her mind. I got a great look at the exterior of the ships and they were shaped like scarab Beatles (Oval, with a oval section on the top of each). So, maybe the Egyptians didn't love the actual Scarab Beatle. Maybe they had seen ships shaped like the ones I saw. Next, I passed out and woke up and was instructed, in my head-no one was there to go inside this large, bright room. There were other humans in there, all between 45-55, which I thought was odd. I was told to go to an area that had two liquids (one blue and the other orange), which I was to mix together and drink. I had scarring from struggling on the table...It was really bad on both sides of my temples. I drank the liquid and could not stop. I was craving it. The liquid was to wipe out our memory and heal our wounds. The combination worked quickly. I said to the people around me, \"I was abducted. Were you also?\" They looked at me like I was crazy and said, \"No, they hadn't been.\" I could tell they had already forgotten. Next thing, I woke up in my bed. My arms were crossed over my chest, like a mummy, and I had pillows on either side my head. I never sleep like that. I woke up and it was all so real. The next day, I searched the computer to see if there had been any UFO sightings in my area and there had been. I told my kids about it, but was embarrassed to talk to anyone else. It felt so real, but maybe it wasn't. I must sound nuts. I wanted to see if I can be hypnotized and find out if it really happened to me. I'm not a crazy person. I'm pretty boring and normal. I could have someone sketch what she looked like, but if you hypnotize me it may have more detail than what I can recall at this time."],"Country":"United States","Date Submitted":"08/02/2013 06:30 UTC","Weather Factors":"Unknown","City":"Rancho Cucamonga","Object Shape":"Oval","Summary":"Larger (mother craft) above the craft I was in, which was below.","Object Flight Path":"Stationary","Region":"California","Log Number":"US-08022013-0022","Case Number":"49395","Viewing Distance":"N/A","Source":"MUFON","Date of the Event":"09/05/2012 12:00 UTC"}