{"map":"<A HREF = \"http://maps.google.com/maps?q=43.101644,+-79.029499(49391)&iwloc=A&hl=en\"> mufon case (49391) map </A>","trends":["There have been 19 other sightings in Niagara Falls","There were no other sightings in Niagara Falls on or around June 25th 2007"],"files":["/var/www/straped/mufon/html2text/49391.html.txt","/var/www/straped/mufon/org/49391.html"],"Region":"New York","Tags":"City","Source":"MUFON","Longitude":"-79.029499","Object Flight Path":"Other","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsRecently, while I was reviewing photos of my family's trip to Niagara Falls several years ago, I noticed a UFO-like light. It says very close to the Skylon Tower on the Canadian side of Niagara Falls for a duration of 32 minutes and 22 seconds (at least, that's the time between our first photo of it and our last - it very well could have been there longer). It seems to vary in its distance from the tower, but never strays very far from its original spot. It's clearly visible even during the fireworks display as a different entity. Neither myself nor my parents recall seeing the anomaly in person, but it can't have just been caused by the camera due to the changes in both its and our position. It changes from pure white to a light yellow color. Sometimes appears to be just a small, round ball and other times like a check mark. In one image, it even seems to have a blue \"aura\" around it. Please note that the first 4 images are very large samples - the fifth image is a compilation of those, plus numerous others. The tower is included as a reference for distance. Also note that the timestamps are NOT accurate, but have been included on the compilation for duration measuring purposes (the duration should be correct, it is only the time that's not because my parents forgot to set it). Also note that before the images where the sky is dark, we were approaching the area."],"Case Number":"49391","Date Submitted":"08/02/2013 03:39 UTC","Date of the Event":"06/25/2007 05:30 UTC","Latitude":"43.101644","Weather Factors":"Unknown","City":"Niagara Falls","Summary":"On vacation. Bright, hovering object in same general area for about 32 minutes.","Disposition":"Unresolved","Log Number":"US-08022013-0018","Sighting Duration":"00:32:22","Object Shape":"Bullet, Missile, Circle, Other","Country":"United States","Object Features":"Unknown"}