{"Disposition":"Unresolved","Viewing Distance":"Over One Mile","Date Submitted":"08/02/2013 11:46 UTC","Source":"MUFON","Latitude":"40.50006","Summary":"bright orange ufo with pulsating red light","Longitude":"-80.012812","Weather Factors":"Unknown","Case Number":"49403","files":["/var/www/straped/mufon/html2text/49403.html.txt","/var/www/straped/mufon/org/49403.html"],"Log Number":"US-08022013-0030","Date of the Event":"08/02/2013 10:20 UTC","Object Flight Path":"Path with directional change","Object Shape":"Fireball, Sphere, Triangle","Region":"Pennsylvania","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.50006,+-80.012812(49403)&iwloc=A&hl=en\"> mufon case (49403) map </A>","Tags":"City","Object Features":"None","divs":["Sighting DetailsMy fiance and our 2 year old were sitting in our back yard having a fire this evening. It was about 10 20 or so when our baby started pointing at the sky and saying pretty. We both turned and had the same reaction as we witnessed to bright orange objects passing over the tree line in the sky. We kept watching and then there was another bright orange object that joined them. They were in a triangle formation and headed east past the tree line where we could not see them. This continued over the next 20 min as more of these strange crafts appeared in groups of threes. We watched two of them hover for a few minuets. One of them stopped dead in its tracks and then went straight up in the sky and we watched as a third craft joined them, they made the triangular formation and continued on. We counted 18 total crafts tonight and it has been about 40 min since we saw the last three crafts. This was the wildest experience we have ever witnessed. I have seen many strange lights in the sky and am a true believer in extra terestrials. However I have never seen anything like what I saw tonight . One thing that I cant get out of my mind was the overwhelming calming sensation I felt as I watched these crafts in the sky. It was like I wanted to be afraid or nervous but something in my mind kept me extremely calm during this event. I wish I could have watched them longer or seen where they were going but they flew below the tree line as though all 18 craft were headed to the same destination."],"Sighting Duration":"Undisclosed","City":"Pittsburgh","trends":["There have been 122 other sightings in Pittsburgh","There were no other sightings in Pittsburgh on or around August 2nd 2013"]}