{"trends":["There have been 2 other sightings in Brunswick","There were no other sightings in Brunswick on or around August 3rd 2013"],"Tags":"City","Longitude":"-69.971855","Object Features":"Unknown","Date Submitted":"08/03/2013 07:21 UTC","Weather Factors":"Unknown","Log Number":"US-08032013-0006","Summary":"Triangle with a white light at each corner rotating counter clockwise along a straight path.","files":["/var/www/straped/mufon/html2text/49409.html.txt","/var/www/straped/mufon/org/49409.html"],"Region":"Maine","Latitude":"43.926603","divs":["Sighting DetailsIt was early morning and clear. No clouds were visible. I was up because I couldn't sleep and went out on my deck to get some air. As always I looked up to see the stars. I saw a white light moving high in the sky from the NW and thought it was an aircraft. As it got closer I noticed no flashing beacons, no running lights and no noise. The shape was a triangle and there was a bright white light on each corner. It few from NW to SE along a straight line and rotated counter clockwise as it flew. The entire sighting lasted approximately 10 seconds. I could not determine the altitude or speed but will guess at approximately 500ft. After the sighting my first thought was of my camera on the counter but if I had gone in to get it I would have missed it. The object went behind the trees in my yard and that is when I lost sight of it. This is not my first sighting but it is the first I have reported. (previous sighting I will discuss but only in person, not on line or over the phone). As a side note I am retired from the US Navy having spent 22 years in Naval Aviation and this was not an aircraft or anything in our inventory."],"Date of the Event":"08/03/2013 03:35 UTC","Object Flight Path":"Straight-line path","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Shape":"Triangle","City":"Brunswick","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=43.926603,+-69.971855(49409)&iwloc=A&hl=en\"> mufon case (49409) map </A>","Case Number":"49409"}