{"trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around July 28th 2013"],"Object Flight Path":"Stationary","divs":["Sighting DetailsBasically i was riding my bike and was in Clarendon Hills and it was about 8:20pm and i had my MP3 player with my headphones on with music playing and i was about to go under the route 83 street when i glanced up and saw a light and something moving and wondered if it was a helicopter which i realize now i would of heard a helicopter even with headphones on. But after i got out from under route 83 now in the Clarendon Hills swimming pool parking lot i looked up and saw this thing hovering not far away. Since i didn't have my iphone to record it i just kept moving along on my bike never getting off while glancing up at it at the same time. I totally was not afraid at all. It could of been 8 or 10 stories high the size of one of those recycle bins. It was a darkish greyish color but as i was studying it i could see a hint of red. I think the light was at the bottom of the thing but now i don't remember the light as bright or obvious like when i first saw it and looked up. I think it was a red light i saw for sure when i first looked up before going under the route 83 street. It was hovering and bouncing around but totally staying in the same spot and i think it could sometimes move a little to the left or right or wiggle around. But what i totally remember for sure is that it was really moving around a lot bouncing around. It would do a bounce. It looked too low to be a Chineese lantern and too high to be a remote control toy. And who in the world would put something almost directly above Route 83. It was basically by route 83 close to the Clarendon Hills swimming pool and BSNF railroad tracks and again i was riding my bike through the parking lot as i kept glancing up at it. I dont know why i didn't get off my bike maybe cause i was upset i didn't have my iphone. When i got over a block away from it i glanced back and could see it bouncing around in the same spot. I wasn't afraid at all. I felt normal like it was just the oddest thing. Actually i felt excited too because i thought about UFO write away. I really think though that if i would of stopped and watched it i would of felt more afraid. But if i would of had my iphone on me i would of recorded it. If i was to see it again i know i would be able to rule in or rule out Chineese sky lantern."],"files":["/var/www/straped/mufon/html2text/49401.html.txt","/var/www/straped/mufon/org/49401.html"],"Sighting Duration":"Undisclosed","Summary":"round, dark circle hovering and bouncing about 8 stories high and had a light","Object Features":"Dome","Object Shape":"Circle","Log Number":"US-08022013-0028","map":"<A HREF = \"http://maps.google.com/maps?q=41.882364,+-87.625118(49401)&iwloc=A&hl=en\"> mufon case (49401) map </A>","Tags":"City","Weather Factors":"Unknown","Date of the Event":"07/28/2013 08:20 UTC","Region":"Illinois","Viewing Distance":"101-500 Feet","Date Submitted":"08/02/2013 10:49 UTC","Source":"MUFON","Longitude":"-87.625118","Case Number":"49401","Disposition":"Unresolved","Latitude":"41.882364","City":"Chicago","Country":"United States"}