{"Latitude":"45.00562","Object Shape":"Fireball, Sphere","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=45.00562,+-92.870957(49407)&iwloc=A&hl=en\"> mufon case (49407) map </A>","Object Features":"Unknown","Disposition":"Unresolved","Source":"MUFON","Date of the Event":"08/01/2013 12:00 UTC","Log Number":"US-08032013-0004","Case Number":"49407","Tags":"City","City":"Lake Elmo","Country":"United States","Sighting Duration":"Undisclosed","trends":["There have been 4 other sightings in Lake Elmo","There were no other sightings in Lake Elmo on or around August 1st 2013"],"Date Submitted":"08/03/2013 03:34 UTC","divs":["Sighting DetailsAround 9:30 pm a lot of air traffic was sent in our direction from the MSP airport. This was unusual, so I was watching the planes fly across the sky. One plane caught my attention when it appeared to not move across the sky, or not move much rather. I didn't notice it coming or going, it just happened to be present when I looked to the NW. For how large it appeared, I must assume that it was only about a mile away, so I felt compelled to watch it until it made some sense to me. It had three white blinking lights evenly spaced in a row across the back. It took about a minute before I realized that it was moving, just incredibly slow. From what I could gather, it appeared to be flying at a speed less than thirty miles per hour. And so I gave my dad a call who happens to live about two miles in that direction. He answered but was at the County Fair watching the truck pulling contest. Somehow the story about the lazy airplane didn't come up. About five minutes later, I was now on my deck and still talking with him when I saw the orange light apparently pop up out of nowhere. This was now directly south and about fifteen degrees above the horizon. I was watching it for about ten seconds, it appeared to kind of bounce around before the light started to move east. I said, dad there's an orange light sort of bouncing around... now it's moving across the sky, look to your west. Can you see it? As soon as I finished my sentence the light simply shut off. It just vanished like somebody just shut it off. Then I hear him say, 'Okay, looking west, I can't see it'. Now I'm explaining why he can't see it because the light just shut off, then light simply turned back on but stationary, and very dim. Wait, it's back on now, are you looking? West? he said. Yeah west... wait or south now, it's getting dimmer, it's moving south now... and... it's... gone. All I see is the parking lot, he said. Lol, anyhow, how's the fair?"],"Longitude":"-92.870957","files":["/var/www/straped/mufon/html2text/49407.html.txt","/var/www/straped/mufon/org/49407.html"],"Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Summary":"Orange orb Southern Lake Elmo ... possibly North Woodbury","Region":"Minnesota"}