{"Date of the Event":"07/30/2013 12:00 UTC","Source":"MUFON","Log Number":"US-08032013-0009","Longitude":"-81.868029","trends":["There have been 3 other sightings in Polk City","There were no other sightings in Polk City on or around July 30th 2013"],"Tags":"City","Sighting Duration":"Undisclosed","City":"Polk City","Weather Factors":"Unknown","Country":"United States","Object Features":"None","Object Flight Path":"Path then hovering","Date Submitted":"08/03/2013 10:07 UTC","Object Shape":"Flash, Star-like","Case Number":"49412","Summary":"star like object moved in all directions and hovered over tree tops then a fast moving flash came closer","Latitude":"28.172507","Disposition":"Unresolved","Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=28.172507,+-81.868029(49412)&iwloc=A&hl=en\"> mufon case (49412) map </A>","files":["/var/www/straped/mufon/html2text/49412.html.txt","/var/www/straped/mufon/org/49412.html"],"divs":["Sighting DetailsMe and my boyfriend were having a late night cigarette a d I noticed a star that appeared to be moving I asked my nd to come over to my side of the truck were I was sitting at to get a better look and he said do you see this? I looked over at this star like object which he was talking about and saw it shoot straight up then back down then left and right realizing this was NOT a plane nor a satellite. This lasted over a half hour. Then about 20 minutes into watching a second light which flashed quickly like an airplane dropped in our of nowhere right above the trendline much closer than the first one moving rapidly up and down the tree line to the top n bottom of the trees but never appearing to touch ground. Last night August 2nd again we were having a cigarette by my truck when another flash came first the trees the first flash was red And caught my attention. But then it flashed black-and-white like the last time and I thought to myself oh it's a plane . My boyfriend saw one flash n heard me say it's just a plane n looked away however when it flashed again white but all the way to the end of the tree line I realized it was too fast for a plane and in that moment it now flashed back to the middle of the trees it had changed directions super fast so I knew it was the same thing from last week.I got back in my truck and my bc came to my window as we discussed what I saw. All of a sudden I heard a loud knocking on my passenger window and it was completely black out . I was completely freaked out n did not turn to see what it was but my be could not see it anyways. I asked him should I lock it but I think he was freaked out to. Just lasted about 30 seconds then stopped. It did have a hum noise as if my window lock was being pushed. We finally looked n saw nothing. We decided it was a good idea to go in for the night."],"Viewing Distance":"101-500 Feet"}