{"Longitude":"-118.494196","Object Flight Path":"Straight-line path","City":"North Hills","Weather Factors":"Unknown","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=34.232726,+-118.494196(49411)&iwloc=A&hl=en\"> mufon case (49411) map </A>","Country":"United States","Case Number":"49411","Date Submitted":"08/03/2013 09:18 UTC","Source":"MUFON","Log Number":"US-08032013-0008","Viewing Distance":"Over One Mile","trends":["There have been no other sightings in North Hills","This sighting has never been favorited."],"Tags":"City","files":["/var/www/straped/mufon/html2text/49411.html.txt","/var/www/straped/mufon/org/49411.html"],"Object Features":"Other","Object Shape":"Star-like","divs":["Sighting DetailsAround 5 years ago, myself and about 5 other people were at the Mann 9 shopping center in Granada Hills, California. It was early in the morning, around 2 AM and we were all just hanging out, laughing, having a good time. All of a sudden in the distance, a bright pulsating star like object shoots up from the ground and into the sky at an astounding speed. It went in a diagonal line, with no change in direction. As it shot to the sky, we watched it as it went farther and farther and eventually faded from view. We were astonished at the time but we quickly dismissed it as a satellite or some sort of man made thing. The next morning I looked for any satellite launches that occurred and could find nothing. Years passed and I dismissed the event, going on with my life. However, some friends and I were discussing the UFO phenomenon and sharing our sightings when I started to think about this again. The fact there was no thrust or trail or sound made me want to share this with you. As I am an Economics and Political Science major I have no aeronautical engineering knowledge and I'd like to submit this sighting with you for you guys to confirm my belief that it was a satellite, as that is what I thought it was. Even though this was a long time ago, I remember it clearly, wasn't inebriated at the time, and there were other witnesses. Feel free to contact me for more information. I want to believe!!"],"Sighting Duration":"Undisclosed","Latitude":"34.232726","Date of the Event":"09/01/2008 12:00 UTC","Summary":"Bright pulsating star like object shot from the ground into space at astounding speed, with no noise or thrust trail.","Disposition":"Unresolved"}