{"Log Number":"US-08032013-0019","trends":["There has been one other sighting in Croydon","There were no other sightings in Croydon on or around August 2nd 2013"],"Region":"Pennsylvania","Latitude":"40.087333","Longitude":"-74.9035","Date Submitted":"08/03/2013 08:44 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.087333,+-74.9035(49423)&iwloc=A&hl=en\"> mufon case (49423) map </A>","Weather Factors":"Unknown","Object Shape":"Oval","City":"Croydon","Tags":"City","Object Features":"Window(s), Patterned Surface","Case Number":"49423","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","divs":["sighting detailsmy husband had just come home from work and was in the back yard with our dog kicking the ball around. something in the sky caught his eye and he first thought it was just a plane with the sun reflecting off it since it was a sunny day. but he realized it seemed really bright so he took another look and realized quickly that the object wasn't moving at all. he could see some high clouds moving behind it but the object itself was not moving. we have two very tall trees in the backyard and the object was viewed in the space between. he couldn't give much of an estimate on the altitude of the object but it appeared to be where a small local aircraft might be seen. he had trouble believing what he was seeing and he kind of closed his eyes and shook his head for a second and when he looked again it was gone. he moved about the yard to look past the two trees but it was nowhere to be found in the sky. he felt silly describing it because it sounded so cliche, but my husband is a huge skeptic so i believed him when he drew it out showing an oval\\disc like shape either with windows or some kind of markings on the side. he said it was very bright, brighter than any reflection of sun should have been. when i came home from work he showed me where he had seen it. i'm a lover of planes and flight patterns so i understand that planes may appear stationary for a few moments if they're flying directly towards or away from you but eventually you will see the movement. the area of sky where he had seen the object would not have obstructed him from seeing a plane continue it's path if that were the case...there was a ton of sky. the object simply disappeared. my husband gets chills over his entire body when he talks about it. he felt blessed to witness this event (on his birthday no less, lol) and he feels perfectly confident in what he had seen. he doesn't feel the need to broadcast it, although he's not embarrassed to discuss it, he's simply taking it as an amazing chance encounter that he was happy to witness."],"Date of the Event":"08/02/2013 12:00 UTC","Country":"United States","Disposition":"Unresolved","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/49423.html.txt","/var/www/straped/mufon/org/49423.html"],"Summary":"Hovering oval shaped object over treeline in Croydon, PA"}