{"Sighting Duration":"Undisclosed","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.20166,+-84.995389(49422)&iwloc=A&hl=en\"> mufon case (49422) map </A>","Source":"MUFON","Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","City":"Yorkville","Region":"Indiana","trends":["There have been no other sightings in Yorkville","This sighting has never been favorited."],"Summary":"Reflective silver object at high altitude travelling to the northeast at high rate of speed with no sound.","Date Submitted":"08/03/2013 08:17 UTC","Object Shape":"Cylinder","Disposition":"Unresolved","divs":["Sighting DetailsWe were walking from our house to our barn when we looked above the treeline and saw a light-colored reflective cylindrical craft flying from east to northeast. The sky was clear with no clouds, the temperature was right at 80 degrees, the humidity at 52%, and the wind was at NW 8 miles per hours. The motion of the object caught our attention above the trees along our ridge . At first we assumed it was a plane, but as we kept watching it we both agreed we could not see any wings, tail, or insignia on the object. It made no noise and left no trail. It flew at a high rate of speed silently in a direct line with no abrupt changes of direction. It disappeared above and behind the trees within approximately 30 seconds. We could not locate it again when we went up our driveway on the ridge to try to see it again. Our reaction was wonderment of what we had just observed. It was unlike any flying object we have seen before including jets, prop planes, helicopters, hot air balloon, ultralights, or blimps. We absolutely could not identify this flying object."],"Longitude":"-84.995389","Object Features":"Other","Country":"United States","Log Number":"US-08032013-0018","files":["/var/www/straped/mufon/html2text/49422.html.txt","/var/www/straped/mufon/org/49422.html"],"Case Number":"49422","Weather Factors":"Unknown","Latitude":"39.20166","Date of the Event":"08/03/2013 12:00 UTC"}