{"Region":"Michigan","Latitude":"42.83875","files":["/var/www/straped/mufon/html2text/49424.html.txt","/var/www/straped/mufon/org/49424.html"],"Country":"United States","Date Submitted":"08/03/2013 11:22 UTC","Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Shape":"Circle, Sphere, Star-like","Disposition":"Unresolved","Source":"MUFON","City":"Lansing","divs":["Sighting DetailsI was coming home from a poker game with a blind friend, driving southbound on I-69 between Dewitt and Lansing MI. I noticed numerous lights south of me, heading in a Northwest direction. My best estimate would be that there were about 60 lights slowly moving in formation. It wasn't really an organized formation but everything seemed to be drifting in the same direction. When I first glanced upwards I figured they were a bunch of bright stars but had to do a double take .... they were way too low, like below the cloudline low and they were packed together in something like a swarm. I slowed down and described everything to my friend .... missing my exit in the process. I had never seen anything like this and was a little shaken. Eventually we drove out of range and lost sight of them. I dropped my friend off and told him to keep an eye on the news and listen to a police scanner to see if he hears anything odd. I got home and told my wife about everything and she's making me fill this out."],"Sighting Duration":"00:03:30","Summary":"Driving southbound I-69 in Clinton County MI ...... numerous starlike lights slowly traveling just below the clouds.","map":"<A HREF = \"http://maps.google.com/maps?q=42.83875,+-84.542954(49424)&iwloc=A&hl=en\"> mufon case (49424) map </A>","Weather Factors":"Unknown","Tags":"City","Case Number":"49424","Longitude":"-84.542954","Date of the Event":"08/03/2013 12:00 UTC","Object Features":"Unknown","Log Number":"US-08032013-0020","trends":["There have been 54 other sightings in Lansing","There were no other sightings in Lansing on or around August 3rd 2013"]}