{"Object Shape":"Triangle","Longitude":"-99.895173","Viewing Distance":"Unknown","Date of the Event":"08/02/2013 09:40 UTC","Log Number":"US-08042013-0006","files":["/var/www/straped/mufon/html2text/49432.html.txt","/var/www/straped/mufon/org/49432.html"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=31.972169,+-99.895173(49432)&iwloc=A&hl=en\"> mufon case (49432) map </A>","Latitude":"31.972169","Object Flight Path":"Straight-line path","Summary":"Triangle in sky with three white lights. Two lights in back pulsating.","Tags":"City","Sighting Duration":"Undisclosed","Country":"United States","Disposition":"Unresolved","Object Features":"Unknown","divs":["Sighting DetailsWe were on our way to Dallas, TX. I was in the backseat of the car, while my grandparents were in the front. We were about 20-30 minutes away from Dallas, and were away from the city. Sort of in a woods area on the highway, nothing but mainly trees. No stores or anything. I was looking outside the window, just looking at the stars. The sky was a very dark navy blue color. Then I saw the UFO. It seemed to be going slower than what a plane would go in the sky. It was a triangle shape, with 3 bright white lights on each tip. The two lights in the back pulsated. I knew it was triangular shaped, because the 3 lights were at the tips of the triangle, and I could see the pitch-black triangle shape, against the dark navy-blueish sky. I'm not sure how big the object could've been, but from what I can remember, it seemed far away. Kind of like if you were holding a penny up, that's how big it could be in the sky. I was really stunned. I'm still wondering what it could be.. I finally lost sight if the object after a couple minutes, because the car was driving forward, and the UFO was going the opposite direction we were moving in.. Has anyone seen a UFO like that? I'm really curious and really do want answers.. Thanks."],"trends":[],"Case Number":"49432","Date Submitted":"08/04/2013 01:11 UTC","Source":"MUFON","City":"Undisclosed","Region":"Texas"}