{"Longitude":"-105.772907","Date Submitted":"08/04/2013 04:04 UTC","City":"Undisclosed","Date of the Event":"08/03/2013 10:30 UTC","files":["/var/www/straped/mufon/html2text/49437.html.txt","/var/www/straped/mufon/org/49437.html"],"Source":"MUFON","Case Number":"49437","Summary":"Either a Fleet of Craft, or Family of Flying Electric Jellyfish, or ???","Country":"United States","divs":["Sighting DetailsI left the house to follow the sound of live music coming from either the Boulder County Fair; or more likely, the Left Hand Brewery. There were boisterous teenagers with skateboards in the vicinity. As I began to head southbound on Sunset Ave, I immediately saw above the South horizon a cluster of white orbs, the three most prominent (brightest, largest) were central to the group and held the ubiquitous TRIANGLE FORMATION! I asked the pack of teens as I rolled past on my bicycle: \"You see funny lights in the sky?\" one said \"well, yeah\". Ok, so I roll down the hill passing Roger Rd, the county fair in the distance to my right(west) and the brewery to my left(east)... as I approach Nelson Rd it becomes harder to track the Orb Cluster, I am leveling out, & trees block much of the action. @10:37 I get to Sunset & Pratt and call a friend to tell him \"if he really wants to see these things, 'now' would be the time\". He declines, -already gone to bed. I Continue on Sunset, southbound and climbing the crest, pull behind a school, not much visibility there, return to the road, and as I reach the high point, can see the last of the objects dispersing over the suburbs of Denver. They just floated on down over the city lights like they were 'on sortie' or something... La la la la la... I went back to the schoolgrounds and tried to capture footage over the darkened field as the objects that broke Easterly lingered by the treeline horizon. At some point there was a formation that resembled the letter \"L\" to the south, possibly they were the ones from the Triangle Form. I think that some of the group wheeled around back North, but by that point they seemed to blend in with commercial air traffic. My impression is that mimicry is a part of their behavior. when one began to come my way, I felt perhaps like someone who likes to go swimming with the sharks. As I head back North, I continued filming 'planes' around the area, to see if any exhibit unusual behavior; my phone camera will simply not suffice for this purpose though. - From St Vrain Greenway I saw a fat bright falling star in the east promptly followed by another. By midnight, I had re-traced the first part of my path in a genuine sense of wonderment. I am the author of case # 48506: Three Amber Lights, and this is turning out to be an interesting season for Orb Spotting!."],"Disposition":"Unresolved","Region":"Colorado","Log Number":"US-08042013-0011","Object Features":"Unknown","Latitude":"39.554001","map":"<A HREF = \"http://maps.google.com/maps?q=39.554001,+-105.772907(49437)&iwloc=A&hl=en\"> mufon case (49437) map </A>","Object Flight Path":"Path with directional change","trends":[],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Shape":"Circle, Fireball, Sphere","Tags":"City","Viewing Distance":"Over 1 Mile, Unknown"}