{"Region":"New York","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Viewing Distance":"Over One Mile","City":"North Pitcher","Date Submitted":"08/04/2013 10:47 UTC","files":["/var/www/straped/mufon/html2text/49442.html.txt","/var/www/straped/mufon/org/49442.html"],"Case Number":"49442","Object Features":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.59936,+-75.838817(49442)&iwloc=A&hl=en\"> mufon case (49442) map </A>","Log Number":"US-08042013-0016","divs":["Sighting DetailsI was sitting on my friends porch talking about college, we had been watching the sky for shooting stars, planes, etc...I had been facing the west with my feet on the railings leaning back in the chair staring at the sky. We saw several shooting stars pass by, planes, then I saw what looked like a star get brighter than the other ones around it. This immediately caught both our attention, I stood up so I wasn't on a chair that wobbles to see it's direction and movement. It wasn't moving more than a few hundred miles an hour, based on planes that had been passing by. The object became extremely bright, then dimmed out to approximately the light a plane would give off, then repeated this three more times over approximately a minute and a half to two minutes. I couldn't tell whether the it changed it's direction by the distance from us, but we both counted four separate extremely bright pulsating moments. Only one light was observed. I didn't have my phone or a camera on me to record the event, but there were two observer's. My other is a friend and business partner of mine who is 58, and has owned a highly reputable business here in town for 30 years. I am going to college for Biotechnology, and have a great passion for astrophysics. Hope this helps. I can absolutely draws a sketch for you since I am a artist."],"Date of the Event":"08/03/2013 10:37 UTC","Tags":"City","Source":"MUFON","Longitude":"-75.838817","Object Shape":"Circle","trends":["There have been no other sightings in North Pitcher","This sighting has never been favorited."],"Weather Factors":"Unknown","Country":"United States","Latitude":"42.59936","Summary":"Got very bright dimmed out, four separate times"}