{"Viewing Distance":"501 Feet - 1 Mile","Region":"Florida","trends":["There have been 11 other sightings in Key West","There were no other sightings in Key West on or around July 29th 2013"],"divs":["sighting details three of us having a chat on the 2cnd floor porch of a condo looking out over the atlantic in key west (stock island to be exact). we had a 180 degree view of the ocean. at around 11pm a bright orange object just appeared in the middle of our view in the sky about 20 degrees above the horizon. it moved parallel to the horizon for 90 degrees of sky. the best description is it was comet-like...but was only about 1\\2 mile away from us, we could discern a large dark (no lights) craft at the head, it appeared to float, but in a straight slow, horizontal path (parallel to the horizon). it left a trail of fire and spark...sort of like a welders torch. the trail was bright and long..left no smoke...just sparks. even though the trail implies a sort of propulsion system the craft seemed to float. there also was another small dot of light above the craft in the front, which looked like a smaller craft. we watched it for about 2-3 minutes then the trail just went out, we could still make out a dark outline of a craft and it continued on the same flight path then went out of our visual range. no sound at all. it you could imagine a rocket moving sideways parallel and above the horizon it might be something like that except again it left no smoke...no sound and also shot sparks."],"files":["/var/www/straped/mufon/html2text/49445.html.txt","/var/www/straped/mufon/org/49445.html"],"Object Features":"Unknown","Latitude":"24.555059","City":"Key West","Sighting Duration":"Undisclosed","Summary":"Fiery Sparks Comet-Like trail UFO - No sound apeared to have large dark craft at the head.","Country":"United States","Tags":"City","Object Flight Path":"Straight-line path","Longitude":"-81.779987","Disposition":"Unresolved","Weather Factors":"Unknown","Source":"MUFON","Log Number":"US-08042013-0019","map":"<A HREF = \"http://maps.google.com/maps?q=24.555059,+-81.779987(49445)&iwloc=A&hl=en\"> mufon case (49445) map </A>","Date of the Event":"07/29/2013 11:07 UTC","Case Number":"49445","Date Submitted":"08/04/2013 11:48 UTC","Object Shape":"Other"}