{"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/49446.html.txt","/var/www/straped/mufon/org/49446.html"],"Tags":"City","Source":"MUFON","Date of the Event":"08/03/2012 12:00 UTC","Case Number":"49446","trends":["There have been 45 other sightings in Long Beach","There were no other sightings in Long Beach on or around August 3rd 2012"],"Latitude":"33.776011","map":"<A HREF = \"http://maps.google.com/maps?q=33.776011,+-118.191197(49446)&iwloc=A&hl=en\"> mufon case (49446) map </A>","Object Flight Path":"Hovering then path,Path then hovering","Disposition":"Unresolved","Longitude":"-118.191197","Object Features":"None","Region":"California","Log Number":"US-08042013-0020","Country":"United States","Sighting Duration":"Undisclosed","divs":["Sighting DetailsSon and I saw the lights to the east from our backyard in Torrance. The lights were in the direction of the Long Beach airport. I am a pilot so often watch aircraft in the sky. The color of the lights caught my attention. There were two red lights slightly higher in the sky than the third. The third was much brighter. They were stationary at first with steady lights (no flashing position lights). I was looking carefully for any indication they could be a helicopter or airplane. The brightest light abruptly started moving down and to the North about one to two extended palm widths, then abruptly stopped and hovered. The two above also moved slightly but independently. All three hovered for a bit with the luminosity starting to fade in the upper lights and strengthen in the lower light. Next the ascended slowly a bit. The top two disappeared, faded out. My son got our binoculars and we observed the brightest light of a while longer. Through the binoculars, the light appeared square with only one steady orange-red light. Where we live we are on the edge of where the nightly marine layer breaks up as it dissipates moving in an easterly direction. There was some thin misty cloud cover that may explain why the upper two lights disappeared at first and the third light a bit later. After they disappeared we continued to search the area with binoculars as the marine layer was clearing. I do not believe they moved off in the distance and faded out of sight because when they all disappeared, they were not changing position. I am confident there were not conventional aircraft because when they did move it was abrupt and deliberate and then when hovering they did not move at all. Even a helicopter would not move as abruptly as these did."],"Date Submitted":"08/04/2013 12:10 UTC","Object Shape":"Star-like","Summary":"Three red orange lights, two starlike above, third very bright. Hovering then moved position rapidly then hovering with slow assent. Then slowly disappeared.","Viewing Distance":"Over 1 Mile, Unknown","City":"Long Beach"}