{"trends":["There have been 2 other sightings in Warrior","There were no other sightings in Warrior on or around June 15th 1977"],"Object Flight Path":"Hovering then path","divs":["Sighting DetailsIn the late '70's (the exact date I do not recall), I was walking along a roadway at my grandmother's home with my two brothers and several cousins. It was just past dark and a time when kids could walk about without fear in contrast to modern hysteria. While we were walking, a brilliant white beam was cast upon all of us from above. The beam was so white and so bright that everyone seemed as if they were glowing. The light was so radiant that nothing could be seen beyond the beam. The craft was apparently directly above us. I remember trying to look up, but the light was so bright that I could not see anything but the light. We were all terrified of the craft and no one knew what was going on. No one heard any type of noise that would indicate a helicopter engine and it was much too low to be a blimp. I would estimate the height of the craft to be perhaps twice as high as the tree tops. I remember us running to our grandmother's home and trying to hide on her covered porch. After a short duration, the craft extinguished the beam and headed off in a northeasterly direction. I remember the craft seemed to move at an incredible speed after the beam was disengaged. Even though this craft was incredibly close, I did not get a clear look at it due to the bright beam cast upon us. I did seem to get an indication that the craft was very large when it jetted off in less than a second. But I did not get a clear look at the craft. I have no idea why this craft shinned a light upon us. Were they looking for something or were they just curious? We were all just children at the time, but I have a vivid memory of what it was like to be in that beam. It was scary. We haven't talked about that event much since then, but maybe it's time for others to know what happened to us. For me, it's not a question whether or not to believe if aliens exist. I know they do."],"map":"<A HREF = \"http://maps.google.com/maps?q=32.323601,+-86.901178(49455)&iwloc=A&hl=en\"> mufon case (49455) map </A>","files":["/var/www/straped/mufon/html2text/49455.html.txt","/var/www/straped/mufon/org/49455.html"],"Viewing Distance":"101-500 Feet","Object Shape":"Unknown","Country":"United States","Longitude":"-86.901178","Date Submitted":"08/04/2013 06:32 UTC","Disposition":"Unresolved","Summary":"UFO cast brilliant white beam upon me and several other family members for a duration of maybe 5 minutes. Then zipped off out of sight.","City":"Warrior","Tags":"City","Log Number":"US-08042013-0029","Object Features":"Unknown","Source":"MUFON","Date of the Event":"06/15/1977 09:05 UTC","Latitude":"32.323601","Sighting Duration":"00:05:00","Weather Factors":"Unknown","Region":"Alabama","Case Number":"49455"}