{"Latitude":"35.663761","Log Number":"US-08042013-0031","Date Submitted":"08/04/2013 06:46 UTC","Disposition":"Unresolved","divs":["sighting details1- i was recording two airplane with an iphone 5 while my husband worked on his car. reason 2-3- i didn't notice it while recording,later on when i checked the video i saw it. i had a friend of mine that is employed by the military, to take a look at it an examine it. he told me that the video was incredible ( i didn't think so) . he stopped it frame by frame, used all the tools at his disposal to find out what it could be. his. conclusions were: not military, not a big or dust on the camera etc. , he said it was an oval dark flying ship. i wish i could disclose his name, but he can't cause of his job. 4- it was going almost straight across the sky, but to even being able to see it on the video i had to considerably slow it down, and even than is incredibly fast! 5- since i didn't see it at the time of the recording, i'm gonna say n\\a 6- since it was a \"lucky catch\", i would have never seen it at all if it wasn't for those 2 airplanes i was recording. i included different speeds of the the same video. the last video is the original. toward the end there is another dark object but its just a big black bird. thank you."],"trends":["There have been 5 other sightings in Okmulgee","There were no other sightings in Okmulgee on or around June 2nd 2012"],"Date of the Event":"06/02/2012 10:00 UTC","Tags":"City","Summary":"It looked like a bullet, impossibly fast. You can see the comparison with the other 2 airplanes.","Object Features":"Unknown","Weather Factors":"Unknown","Viewing Distance":"Unknown","Case Number":"49457","Source":"MUFON","files":["/var/www/straped/mufon/html2text/49457.html.txt","/var/www/straped/mufon/org/49457.html"],"Region":"Oklahoma","Object Flight Path":"Straight-line path","Longitude":"-96.06621","Country":"United States","City":"Okmulgee","Sighting Duration":"00:03:00","Object Shape":"Oval","map":"<A HREF = \"http://maps.google.com/maps?q=35.663761,+-96.06621(49457)&iwloc=A&hl=en\"> mufon case (49457) map </A>"}