{"Tags":"City","Date of the Event":"07/01/1967 02:00 UTC","Object Features":"None","Case Number":"49451","map":"<A HREF = \"http://maps.google.com/maps?q=42.450721,+-76.496391(49451)&iwloc=A&hl=en\"> mufon case (49451) map </A>","Date Submitted":"08/04/2013 04:38 UTC","City":"Ithaca","Summary":"Summer day over field observed by several people","divs":["Sighting DetailsI was a child (~10 years old) and lived in the small town of Slaterville Springs, NY, near Ithaca, NY. There was a large field on the edge of town. People began gathering on the edge of the filed and watched a UFO. The authorities were notified, apparently by those in the surrounding communities as well. We were told it was a weather balloon. May have been covered by the Ithaca Journal newspaper. I had a second experience in the fall of 1976. It was approx. 10:00 pm and I was driving in a VW Beetle with my baby toward Ithaca from Candor, NY. I was just coming into Danby, NY and noticed a truck broken down on the opposite side of the road. A moment later I saw a white, glowing orb that seemed to be skimming the tops of the trees on the hill before me. From a distance it looked like car headlights, but it was just above the trees, and there are no roads up there. The next thing I knew it was next to my car, traveling right next to me on the passenger side, going the same speed as the car, and had not changed in size even though it was very close. It was maybe 10-15 feet from the car. Then it just disappeared. Both of these thing happened in close proximilty to Ithaca, NY where Cornell University is located. Although permission has been denied to build nuclear power plants there, there is a nuclear reactor at Cornell most people don't know about. I don't know if this may be the attraction for UFOs. If you have ANY questions at all, please contact me. I've wanted to tell someone about these events for a long time."],"Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Latitude":"42.450721","Sighting Duration":"00:20:00","files":["/var/www/straped/mufon/html2text/49451.html.txt","/var/www/straped/mufon/org/49451.html"],"Object Flight Path":"Path then hovering","Region":"New York","Country":"United States","Disposition":"Unresolved","trends":["There have been 7 other sightings in Ithaca","There were no other sightings in Ithaca on or around July 1st 1967"],"Weather Factors":"Unknown","Log Number":"US-08042013-0025","Longitude":"-76.496391","Object Shape":"Disc, Oval"}