{"Country":"United States","Longitude":"-96.064411","map":"<A HREF = \"http://maps.google.com/maps?q=35.704613,+-96.064411(49452)&iwloc=A&hl=en\"> mufon case (49452) map </A>","Object Features":"Other","Viewing Distance":"20 Feet or Less","Date Submitted":"08/04/2013 05:22 UTC","Region":"Oklahoma","files":["/var/www/straped/mufon/html2text/49452.html.txt","/var/www/straped/mufon/org/49452.html"],"City":"Okmulgee","Summary":"Very bizarre sighting. At first impression looked like an orb but the closer it got the more we realized it was some sort of ship. It seamed tad if it was scouting for something. And as it appeared it disappeared extremely fast .","Log Number":"US-08042013-0026","Case Number":"49452","Source":"MUFON","Object Shape":"Circle, Fireball, Flash","Weather Factors":"Unknown","trends":["There have been 5 other sightings in Okmulgee","There were no other sightings in Okmulgee on or around August 12th 2007"],"Disposition":"Unresolved","divs":["Sighting Details1- I was walking toward my sister in law house. 2- I herd my sister in law shouting out loud, asking me what it could be 3- at first impression when it was farther I thought it was some sort of red orb, but as it got closer and closer we both knew it was an object, bigger than what it looked like and extremely fast. 4- when it was farther away I didn't think much of it, but in just a few seconds it was right on top of us, zigzagging so fast that I had a hard time keeping the cellphone camera on the object. It seam as if it was looking for something or looking at us. It wouldn't stay still for long periods and It flew away so fast that I barely noticed it was gone. 5- I was at a loss of words, couldn't belive my eyes and somehow both of us got a strong feeling that it wasn't the first time we seen it and vice versa. 6- I was trying as hard as I could to keep it on focus, and before I could even blink it was gone."],"Sighting Duration":"00:04:00","Date of the Event":"08/12/2007 11:00 UTC","Object Flight Path":"Hovering then path,Path with directional change,Other","Tags":"City","Latitude":"35.704613"}