{"Weather Factors":"None","Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=43.176977,+-84.846394(4945)&iwloc=A&hl=en\"> mufon case (4945) map </A>","Date Submitted":"11/30/1965 12:00 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","Longitude":"-84.846394","Disposition":"Unknown","Case Number":"4945","files":["/var/www/straped/mufon/html2text/4945.html.txt","/var/www/straped/mufon/org/4945.html"],"Country":"United States","divs":["Sighting DetailsMy cousin (same age within a month,we were abt 8) and I were in the field behind my grammas ( think its Elm st) in the south west corner of Carson City by the Fish creek. We saw a silver shimmery object and thought it was a piece of metal of some kind so we ran toward it. About 50 feet away I stopped and could see it was a disc then but wasn't afraid. It suddenly \"jumped\" from the ground to the sky and was the apparent size of a coaster, then jumped again and was the size of a dime then again and was a speck then gone. It went up in a zig zag real fast like zip zip zip gone. My mother found a burned circle in the grass. I found out may years later that a family south of town had a UFO come down over their house at night and make the shingles slap up and down. The children saw it but the mother wouldn't look. I can't give you the name ( I know it) because I never talked to them about it. The odd thing is that everything about it is clear except running back. It was summer when we saw it but when I try to remember running home I see my cousin cutting his lip and blood on the snow. Sounds nuts but that's what I remember. My mother says we came back all excited and scared. That's why se looked and found the burned spot."],"Object Features":"Unknown","Region":"Michigan","Object Flight Path":"Stationary,Path with directional change","Object Shape":"Disc","City":"Carson City","Date of the Event":"11/30/1965 12:00 UTC","Latitude":"43.176977","trends":["There have been no other sightings in Carson City","This sighting has never been favorited."],"Tags":"City","Log Number":"US-06152006-0002","Summary":"silver disc about 30 ft wide 15 ft high shimmered like heat waves"}