{"Case Number":"49450","files":["/var/www/straped/mufon/html2text/49450.html.txt","/var/www/straped/mufon/org/49450.html"],"trends":[],"Summary":"Man went into a building and encountered two beings that did not seem human.","City":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.786921,+-119.410812(49450)&iwloc=A&hl=en\"> mufon case (49450) map </A>","Tags":"City","Viewing Distance":"Unknown","Object Shape":"Other","Object Features":"Unknown","Country":"United States","divs":["Sighting DetailsThis was described to me by someone I do not know well, but we go to the same health club. Interestingly this may be traceable in that it occurred in what should be a traceable address. Please note, the witness described this with limited English, but he did seem genuinely unnerved and was hoping that I would tell him that what had happened was common in America. Witness (name Eduardo) and I both belong to the 24 Hour Fitness health club and mainly use the hot tub in order to treat long standing injuries to leg and back. Recently, the hot tub at the Santa Barbara location was closed due to renovations. Eduardo initially began telling me, as we both soaked, that he needed the tub badly enough that he had gone to several other locations for 24hr Fitness in order to use their hot tubs. However, while in San Francisco, which is where his parents live, he had a very strange experience. Apparently he looked up and went to what he thought was the location of a 24hr Fitness in San Francisco. When he got there, without noticing anything out of the ordinary he simply opened the door of the location and walked inside. However, after entering he was struck by the fact that building seemed completely empty and only a few lights were on. Believing he'd made a mistake he turned around and attempted to open the door he had just come through only to find it locked. A bit disconcerted he walked towards a light that was on across the room and called out several times. Suddenly out of nowhere there were two beings standing near him. He described them as tall, extremely thin, bone white and with inhumanly large eyes. He even held up circled thumb and forefinger to indicate how much larger than normal eyes they were. He described them as looking like dead people. They both wore institutional green coveralls with a breast patch that read \"engineering\". He remarked that the coveralls seemed extremely old. They were not terribly polite and told him he was not supposed to be in the building. They led him to another door in the building, not the one he had entered through, and unceremoniously saw him through it. He emerged into an alley that seemed to have an unusually high number of homeless people in it. He described himself as quite frightened by the whole experience, and to this observer seemed sincerely upset by the experience. This strikes me as worthy of a follow up as the address for 24 Hour Fitness in San Francisco should be readily found and a visit to the facility seems warranted. This person has no desire for publicity and neither do I."],"Log Number":"US-08042013-0024","Source":"MUFON","Sighting Duration":"Undisclosed","Longitude":"-119.410812","Weather Factors":"Unknown","Latitude":"36.786921","Date of the Event":"07/30/2013 12:00 UTC","Disposition":"Unresolved","Object Flight Path":"N/A","Date Submitted":"08/04/2013 04:26 UTC","Region":"California"}