{"Object Flight Path":"Path then hovering","Date Submitted":"07/06/1964 12:00 UTC","Tags":"City","City":"Portland","files":["/var/www/straped/mufon/html2text/4946.html.txt","/var/www/straped/mufon/org/4946.html"],"Date of the Event":"07/06/1964 12:00 UTC","Weather Factors":"Unknown","Viewing Distance":"Unknown","divs":["sighting detailsjust outside of portland oregon, july 5th, circa 1964. it was a rainy morning, as is typical in that region, so i and two of my siblings were playing upstairs in our two-story home. the entire second floor was being remodeled, so there were no curtains on any windows and there was a lot of construction debris. i know that the date of july 5th is correct, because we had assembled chunks of drywall construction debris into makeshift fireworks stands \"selling\" our used products -- that were lit off the night before -- to one another. my older sister had noticed the object first. she summoned my brother and i to the window. the three of us peered through the south-facing window near the top of the stairs and watched the object for several minutes before attempting to tell our parents. the dark-gray orb was flat in color; no lights or sound were discernible. it would come out from behind a cloud and freeze in midair ... then it would zig-zag in various directions and freeze again for a few seconds -- only to shoot behind a cloud out of sight and pop back into view after a short wait -- then repeat the zig-zag\\freeze pattern. somewhere from 10-15 minutes had passed before my sister decided to tell our stepfather of what we had observed. he arrived at the top of the stairs just as the sphere was making an exit behind a cloud. the parent did see the object make, what then proved to be, it's last visual contact with us. from his perspective, it was a weather balloon (that explanation sounds familiar!). to date, i have never seen nor heard of a weather balloon that dances in the sky and freezes in one spot for any length of time. i do not know what it was we saw that overcast morning, but it was no weather balloon! i've another, earlier dated, story including the sighting of a being and a possible abduction which occurred in so. california. this one is pending contact from a mufon investigator ... according to my taking of the test."],"Longitude":"-122.666327","Country":"United States","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around July 6th 1964"],"Object Shape":"Circle, Disc, Sphere","Log Number":"US-06152006-0003","map":"<A HREF = \"http://maps.google.com/maps?q=45.531022,+-122.666327(4946)&iwloc=A&hl=en\"> mufon case (4946) map </A>","Disposition":"Insufficient Data","Object Features":"None","Latitude":"45.531022","Case Number":"4946","Source":"MUFON","Sighting Duration":"Undisclosed","Region":"Oregon","Summary":"The gray orb erratically darted in and out of view from behind low clouds in an overcast Oregon sky."}