{"Source":"MUFON","Log Number":"US-08042013-0034","Summary":"Orange\\red glowing light started at horizon over ocean. It moved up and then diagonally up over the ocean from south to north.","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Latitude":"38.437242","files":["/var/www/straped/mufon/html2text/49460.html.txt","/var/www/straped/mufon/org/49460.html"],"Date of the Event":"08/01/2013 09:47 UTC","Object Features":"Unknown","City":"Ocean City","Object Flight Path":"Straight-line path","Case Number":"49460","Disposition":"Unresolved","Date Submitted":"08/04/2013 07:17 UTC","Region":"Maryland","trends":["There have been 16 other sightings in Ocean City","There was one other sighting in Ocean City on or around August 1st 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.437242,+-75.04714(49460)&iwloc=A&hl=en\"> mufon case (49460) map </A>","Sighting Duration":"Undisclosed","Object Shape":"Fireball","Country":"United States","Longitude":"-75.04714","Weather Factors":"Unknown","divs":["Sighting DetailsIt was August 1st 2013, 9:47p.m., and I was sitting out on my balcony at night with my friend when we noticed a bright orange light over the ocean. At first it didn't seem out of the ordinary because there are always lights from buoys, boats, planes, beach patrol, etc. This light was much larger than anything we have seen over the ocean before and it wasn't blinking like other lights I normally see out there. It could not have been an airplane or helicopter because it moved to slow and we could not hear an engine or anything. It was silent . There was a lighting storm coming from the northwest at the time. This looked nothing like what a storm produces. It started out large and nearly along the horizon (I'm not sure whether or not it actually when into the water at all or if it came out of the water)It went diagonally up into the sky at a steady pace for about a minute and got smaller as it made it's way up there, and hung there for another minute or two before it moved farther away and faded behind clouds. The entire time it changed from dark red, to orange and yellow. Almost like fire. My friend and I were stunned, we both knew it was something completely out of the ordinary. We ran inside to tell our moms right as it faded the first time. They came out soon after and saw it right before it went out of the balcony's view, when it was small enough to look like a star that was slowly moving. This is when I made a short and unsteady video. We wonder if anyone else had seen this strange event. With hundreds of condos on the beach someone else must have seen this."]}