{"Log Number":"US-08042013-0039","Source":"MUFON","Longitude":"-70.490782","Case Number":"49465","Date of the Event":"08/03/2013 08:45 UTC","Tags":"City","Viewing Distance":"Over One Mile","Date Submitted":"08/04/2013 09:48 UTC","Summary":"posting to see if others on Cape Cod saw bright orange lights","Latitude":"41.783634","divs":["sighting detailsit's back. between 8:30-9pm 8\\3 saw same route as other sandwich sighting month ago . about 15 mins later a smaller white light very high in atmosphere traveled approx se nw close to being e to w. about 15 mins later saw another white light even higher that other traveling in opposite direction as bright orange light. i thought was plane or helicopter at 1st. i know local & boston aerial objects. these were not. . i live in sandwich village & have bed under skylight. i often wake up at 3-4 am & like clockwork i see a white light streaking across skys very high. satellites?? have never posted any sightings before & doing so to see if others see same & white lights streaking across sky's in early am. is there a satellite path over the cape going from approx west to east at 3-4 am due to air base? like other sighting i know helicopters as they fly right over my house. the orange ball was not one, or local air field. never seen anything like it in my 15 years area. by time i raced to get ipad to record, 30 secs , it had disappeared in east. ironically 2 white lights 15 min apart similar to early am ones had never seen before & i stargaze a lot with ipad app."],"Country":"United States","Disposition":"Unresolved","Object Shape":"Fireball","Object Features":"Unknown","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=41.783634,+-70.490782(49465)&iwloc=A&hl=en\"> mufon case (49465) map </A>","trends":["There have been 2 other sightings in Sandwich","There were no other sightings in Sandwich on or around August 3rd 2013"],"Region":"Massachusetts","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","City":"Sandwich","files":["/var/www/straped/mufon/html2text/49465.html.txt","/var/www/straped/mufon/org/49465.html"]}