{"City":"Lakeland","Object Shape":"Disc","Object Flight Path":"Path then hovering","divs":["sighting detailsnotes on elevation to distance from questionnaire are answered here. from bedroom window - distance: line of sight approx. 180', approx. 70 ' above ground, filled approx. 1\\2 viewing area of window, 30\" w x 40 \" h. shape: smooth curves & symmetrical, saucer form w\\dome. appeared to have no openings, external features, windows, (except when e's observed),etc. color: silvery dark gray on entire object. stationary\\no sound\\no smoke\\no trail. entities seen clearly in dome section. familiar: craft i've been aboard since childhood. familiar: waking hours. written report available & drawings. original report went to researcher to share. since then, memory of other parts of encounter have returned & i continue to add those into report. condensed: * winter of '92. time: 5:30 pm. duration: 2 1\\2 hours. 2nd floor of home. n bedrm. w window. awake. alone in home. finished chores\\practice downstairs. taking up laundry. held in a triangular force field. room electric feel. compelled to window. held at feet. looked sw. 1st thought of as star. a tel\\comm asked (male): \"would you like us to come closer?\" said, \"no\" but it came anyway. bright light. familiar, round, silver, gray saucer in front of me through the window. open section in dome. could see: 5 entities. 1 tall in center and 4 small - 2 on either side of tall.(description in report)was not scared because this was a familiar craft and i figured that this encounter would be o.k. but i did not like being held in place in my room. * inside of craft: noticed small e's had robes. appeared mechanical.(description\\ht. bld. \" in report) uncertain how to describe this even now: center of craft had some kind of hardened gel substance. believe military male was in center and that was the 'voice' of tel\\comm at first communication. tall e was a 'see through' and believe it was designed to pilot the craft. 4 digits. 3 of which were on a round, black ball with a type of gel on a 'flight panel.' * back in room: conversation of a 'faith' nature.(in report) chronological order of next events are unsure to me. 1. aboard the craft. handled by mechanicals. taken to the gel center wall.(measures & # in report) 2. conversation with military but no recall. conversation with pilot 'see through' entity. after approx. 10 min. it began to sweat and i could no longer be near. noticed importance of that protocol\\distance...as well as remarking on it's physical make up which opened up the door for conversation. 3. listened to a conversation between tall e and military but no recall. 4. encounter with 'see through' e & some kind of circular energy beam which was stopped due to a voice spoken to the entity. 5. walking perimeter of craft after being taken to the 'engine room. seeing a smaller, square version of the larger energy room\\propulsion. reminded me of how we run our electrical units throughout a house. outside perimeter was a beautiful hallway. soft light emanated from sections. cool. rounded center section. different from other crafts. walking above the floor was similar. electric\\mag force of some kind, but again familiar since childhood...that is how you walk...as if on a 4-6\" carpet. pushed back from surgical room by tall golden. observed a conversation between military & e in a separate room. (believe now that the military male was not to have sent comm to me. was allowed on craft and knew the species, tall e's. however, i believe they were there to pick up a young child who now works in a major area of work as do the other children. and, the us military male was in training) 6. viewing of the underbelly. 3 rings. blue. 2 rings close & clockwise outer rim. inner counter. pulse: tempo of qtr. at 52. largo. pitch:g below mid. c. freq. of 196.00. lights mix\\pulse together & random. calm. * asked if i was interested in a ride or to see how it worked. \"yes.\" placed in 'engine room' or propulsion area. in front of large, glass wall. energy components. intelligence. comm came in to area the the craft had to leave due to tracking. energy components reacted with intelligence within the gel. (drawing & distinction between energy components in report) * a gel used later in '97 encounter for prep. which i was placed in for travel. believe now: gel aboard this craft used in conjunction with the 'control panel' as seen with the 'see trough' entity as it placed digits on the black ball on the panel on other level. in direct conjunction with telepathic ability between pilot & energy components. * craft took off in silence after placing me back in room. remained held in place in triangular force field at the window area as if weights were on the feet until the craft was gone. * checked the time. it was now 8:00. 2 1\\2 hours had passed. * went outside. no craft. silence. no sound whatever. not even crickets or cars. returned to house. *several years later, i began to write and research looking for similar encounters of waking hour contact since childhood from other people. contact still remains to this day. finally taking the time to send in a report, even though i have been writing them and sharing and speaking when asked. i am a member of mufon and working towards becoming a field investigator. it was important to sit down and review the cms report, finally fill one out, and become acquainted with this form. * your question of #5 - describe your feelings, etc. they vary. emotions, reactions vary even though i've had contact and been aboard these crafts since childhood. i don't understand it all and certainly don't know all the answers. what changed my life and moved me forward after '92 was the call and encouragement that came from the researcher i contacted and sent this origianl report into. education\\protocols of contact\\propulsion observations\\amazement\\wonder\\joy\\excitement of travel...those are my feelings, reactions, and actions and will remain so with every encounter."],"Date of the Event":"11/17/1992 12:00 UTC","trends":["There have been 26 other sightings in Lakeland","There were no other sightings in Lakeland on or around November 17th 1992"],"Summary":"5:00-8:30. Held in Triangle force. Aboard. Entities: See Trough (Pilot ),Mechanicals or Robotics,Tall Goldens, US Military. Believe they were there for a pick up & train for Military. Conversations. Shown 'Engine Room.'Tracked.Tone & Lights of Underbelly.","Region":"Florida","Latitude":"27.995319","Weather Factors":"Unknown","Disposition":"Unresolved","Viewing Distance":"Unknown","Case Number":"49463","Object Features":"Dome, Window(s)","Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/49463.html.txt","/var/www/straped/mufon/org/49463.html"],"Sighting Duration":"Undisclosed","Log Number":"US-08042013-0037","Date Submitted":"08/04/2013 08:27 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=27.995319,+-81.978509(49463)&iwloc=A&hl=en\"> mufon case (49463) map </A>","Longitude":"-81.978509","Tags":"City"}