{"Source":"MUFON","Sighting Duration":"00:10:00","Log Number":"US-08042013-0044","Tags":"City","files":["/var/www/straped/mufon/html2text/49470.html.txt","/var/www/straped/mufon/org/49470.html"],"Disposition":"Unresolved","Case Number":"49470","Latitude":"38.767721","Viewing Distance":"Unknown","Object Flight Path":"Hovering then path","Summary":"Two objects in the sky, one red, one blue, disc shaped, hovering","trends":["There have been no other sightings in Tunnelton","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=38.767721,+-86.34352(49470)&iwloc=A&hl=en\"> mufon case (49470) map </A>","Object Features":"Dome","Weather Factors":"Unknown","Object Shape":"Disc","divs":["Sighting DetailsMy friend and I are from Jackson County. One summer day in the year 2000 we went cruising out in the country. We started driving around 11 P.M approximate. We eventually got lost and didn't know where we were. My friend was driving and he eventually said something like I think I know where we are. We are by Tunnelton which is in Lawrence County. He said there were some tunnels close by that you drive through and that is was kinda spooky. So I said ok lets do it. We started driving looking for these tunnels. I remember it was around 2 A.M. because I looked at the radio clock and said something like its getting late. Are we going to stay out all night? My friend said we will start back home when we find a tunnel. I don't remember exactly how I saw the two objects that I saw, but I do remember the sky being clear and rounding a corner. I am not sure how far away the two objects were, but they appeared to be as big as a softball or basketball from my angle. One of the objects was blue. I am not sure if the whole thing was blue, but it was glowing blue. The other object was red and it was growing red. They were disc shaped and appeared to hovering. They eventually started moving and it seemed like they were circling each other. Both objects started flashing lights. I do not think they were in a pattern, but I honestly do not know. I was in shock. I knew these objects were not normal. The red object eventually spun like a top and disappeared. The blue object soon followed. It looked like they spun and flew off, but they flew off so fast that I couldn't tell if they really did or just disappeared. I looked at my friend after all of this because we were in complete silence while we watched. He said he tried talking to me during the ordeal, but it was like he couldn't talk. I don't remember feeling this way, but he said he did. I do remember feeling like a numb feeling and feeling like my thought process had slowed down. I have only told my wife and my parents about this night. Of course, no one believes me, but I know that I saw something special this night. This night has stayed with me all of these years."],"Date Submitted":"08/04/2013 10:22 UTC","Longitude":"-86.34352","City":"Tunnelton","Date of the Event":"07/15/2000 12:00 UTC","Country":"United States","Region":"Indiana"}