{"Longitude":"-73.998733","files":["/var/www/straped/mufon/html2text/49472.html.txt","/var/www/straped/mufon/more/49472_submitter_file1__IMG0290.jpg","/var/www/straped/mufon/more/49472_submitter_file2__IMG0286.jpg","/var/www/straped/mufon/more/49472_submitter_file3__IMG0296.JPG","/var/www/straped/mufon/more/49472_submitter_file4__IMG0292.jpg","/var/www/straped/mufon/more/49472_submitter_file5__IMG0304.JPG","/var/www/straped/mufon/org/49472.html"],"Weather Factors":"Unknown","Latitude":"40.717383","Region":"New York","Date Submitted":"08/04/2013 11:56 UTC","Viewing Distance":"Over One Mile","divs":["Sighting DetailsHome and went to close windows for the night. Just looked into the night sky and saw a light in the west. Thought it was a plane at first but as I watched the light didn't seem to move. It appeared to be an orange sphere. I grabbed an old pair of binoculars and didn't get a great deal of detail so I grabbed a camera with 50X zoom and zoomed in on the light. Through the camera lens it was, at first, a perfect sphere but with geometric texture. I took 22 shots but because of the zoom and not having the camera on a tripod, most shots show camera movement. As I took shots I just kept saying to no one, \"What IS this?\" While attempting to capture shots the shape changed. I'd stop and look out the window to see if the light looked differently and then go back to the camera lens. I kept trying to determine if this was a plane or blimp or what. For the first few minutes it just looked like a sphere. Then it seemed to change shape or size so I just kept taking pictures. At one point I almost laughed at myself figuring I would hear that it was just some special display. As it seemed to change shape it just suddenly was gone. When I looked at the shots I got I decided that it was not a plane or blimp or any flying object that I could identify. I went back on my patio and noted that it was a clear night with stars visible but the stars visible were much smaller and not orange in color."],"trends":["There have been 579 other sightings in New York","There were 3 other sightings in New York on or around August 4th 2013","This sighting has never been favorited.",""],"City":"New York","Object Shape":"Circle, Sphere","Disposition":"Unresolved","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.717383,+-73.998733(49472)&iwloc=A&hl=en\"> mufon case (49472) map </A>","Log Number":"US-08042013-0045","Object Flight Path":"Hovering then path","Object Features":"Patterned Surface","Summary":"Watched and photographed object in night sky","Tags":"City","Source":"MUFON","Date of the Event":"08/04/2013 12:00 UTC","Case Number":"49472","Country":"United States"}