{"Weather Factors":"Unknown","Disposition":"Unresolved","divs":["Sighting DetailsThis is the second sighting my friend and I have had within two weeks in the same spot. See July 22, 2013, in the same area for the other sighting. This recent sighting was at night, 10:38 pm. A bright light moving North-east across the St. Mary's River from Michigan to Ontario. The object was much larger than a star and bright. It became larger and brighter as it approached. I am unable to say how high up it was. There was no cloud cover. The object glowed steady white and turned dull orange in the distance. There was no blinking tail light and no sound. The object glowed white on all sides, as it approached, from underneath, and from the \"rear\" as it retreated. There was no deviation in is course. It was much larger than a star or planet. The light it gave off resembled a planet, but brighter and moving. I have checked the Space Station schedule and the light we saw was not the ISS. The strangest part is that my friend and I saw a grey, beehive-shaped object just a few weeks ago while walking in the same area. I have a photograph of the light, but it's just a solid white light in the black sky."],"Object Features":"Unknown","Object Flight Path":"Straight-line path","Latitude":"51.257115","Tags":"City","files":["/var/www/straped/mufon/html2text/49474.html.txt","/var/www/straped/mufon/more/49474_submitter_file1__2013080422.37.54.jpg","/var/www/straped/mufon/org/49474.html"],"Viewing Distance":"Unknown","Object Shape":"Star-like","Case Number":"49474","Region":"Ontario","Longitude":"-85.317584","map":"<A HREF = \"http://maps.google.com/maps?q=51.257115,+-85.317584(49474)&iwloc=A&hl=en\"> mufon case (49474) map </A>","trends":[""],"Summary":"A bright white light moving quickly across the night sky; no blinking light, solid white on both sides, but turned dull orange after a time.","Date of the Event":"08/04/2013 10:38 UTC","Log Number":"CA-08052013-0002","Sighting Duration":"Undisclosed","Source":"MUFON","City":"Undisclosed","Date Submitted":"08/05/2013 12:12 UTC","Country":"Canada"}