{"Case Number":"49479","Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=43.608889,+-71.460556(49479)&iwloc=A&hl=en\"> mufon case (49479) map </A>","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Date Submitted":"08/05/2013 01:30 UTC","files":["/var/www/straped/mufon/html2text/49479.html.txt","/var/www/straped/mufon/org/49479.html"],"Object Features":"None","Region":"New Hampshire","Country":"United States","Latitude":"43.608889","Object Shape":"Sphere, Star-like","trends":["There have been 4 other sightings in Laconia","There were no other sightings in Laconia on or around August 5th 2013"],"Source":"MUFON","City":"Laconia","Summary":"Watching Screen 1 at Weirs Beach Drive In Theatre. Firts orb was white and crossed from west to east. An hour later a yellow/orange orb same directional path was taken. Both orbs were traveling slow and steady. White orb exits orange orb vanish in vision.","Disposition":"Unresolved","divs":["Sighting DetailsSaw commercial airlines crossing above the screen, while watching Smurfs 2 with my mother and my son, on screen 1 at Weirs Beach Drive In Theater. AT 9:30 pm or so, all three car occupants witness large white orb crossing above the screen, going west and leaving field of vision in the east. I first spot the white orb to my right in the corner of my peripheral vision. It is slow moving, has steady brightness, and a halo effect, as I wear prescription lenses without anti-glare. The white orb is silent, showing no exhaust, and does not appear as stationary like a star. The feelings of the car after the sighting was pleasant and curious. After awhile, during the second movie of Grown Ups 2 on the same screen, all three car occupants witness commercial flights crossing above screen 1 with flashing red, green, and white lights. Then at around 11:14, I then see the second orb in my peripheral vision on my right. Then all the occupants witness a slow moving orange orb going west to east, following similar flight path as white orb, and disappears after crossing above the screen. It is slow moving, in a steady flight path, has no exhaust trail, has a star effect instead of a halo,is very bright, not at all like a star, and its size is as large as a penny. The feelings after the sighting were ominous and tense. Both orbs cross the screen at a high altitude and not in front of the screen in either sighting. We continue to see commercial airline flights Cris-crossing above the screen till, we leave our spot next to the concession area, near the ladies restroom entrance, which we had occupied since our arrival, and did not move from."],"Tags":"City","Longitude":"-71.460556","Date of the Event":"08/05/2013 09:30 UTC","Log Number":"US-08052013-0007"}