{"Weather Factors":"Unknown","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=33.987299,+-118.466314(49480)&iwloc=A&hl=en\"> mufon case (49480) map </A>","Source":"MUFON","Summary":"Two sets of 3 glowing amber lights (yellow orange) that moved silently on horizon then vanished over my house.","Log Number":"US-08052013-0008","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Features":"Unknown","Latitude":"33.987299","Tags":"City","Case Number":"49480","Longitude":"-118.466314","divs":["Sighting DetailsAt about 11:15 on Friday, August 7, I noticed a bright light outside my second floor bedroom window. A plane was in the distance, and this clearly was NOT a plane. A helicopter perhaps? I stepped out on my balcony to observe this light and as it moved directly overhead and then hovered. 2 more lights appeared on the horizon, seeming to follow this first one. They moved quickly and silently. Now the fist orb seemed to ascend above the cloud cover and vanish. It was directly overhead by now, so I could clearly see that it was above the clouds and still glowing - and finally it faded. The other two moved in a similar fashion, following the first light and similarly ascended to the same spot as the fist and disappeared in the cloud cover. By now, I had called my husband who also saw them. We discussed the possibilities, thinking they must have been balloons or lanterns with lights or something like that. We dismissed it, but as my husband left and I looked back out at the horizon, 3 more lights came into view above the neighbors house. They moved a s similar speed to the first 3, following their path, and they also ascended the same as the others, disappearing in a similar vicinity as the first three."],"trends":["There have been 404 other sightings in Los Angeles","There was one other sighting in Los Angeles on or around August 2nd 2013"],"files":["/var/www/straped/mufon/html2text/49480.html.txt","/var/www/straped/mufon/org/49480.html"],"Date Submitted":"08/05/2013 01:39 UTC","Object Shape":"Unknown","Country":"United States","Date of the Event":"08/02/2013 11:15 UTC","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Path with directional change,Path then hovering","City":"Los Angeles"}