{"Longitude":"-84.538207","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.801173,+-84.538207(49484)&iwloc=A&hl=en\"> mufon case (49484) map </A>","Object Shape":"Sphere, Star-like","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-08052013-0012","Region":"Michigan","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Date Submitted":"08/05/2013 05:21 UTC","Tags":"City","Country":"United States","City":"DeWitt","divs":["Sighting Details My boyfriend and I were coming home from the fair. It was about 9:30pm Sat Aug 3 2013. We were on I 96 going west. We had just passed the Grand River exit to my right I seen several small lights in the sky below the clouds. I told my boyfriend to look and ask him what they were. He looked up and seen them too. There were small lights a lot of them. They were like side by side kind of in a row. There were 2 groups of them. In the first group I would say there was about 30 of them. Then there was a space between them and in the 2nd group was a lot more about 50 or 60. They seemed to be moving but slow. Then there was a small curve and there were behind us. I kept looking back to watch them. They looked like they were coming from Dewitt and they were going south. I was going to get off on M 100 take pics but when I looked back I didn't see them any more. We didn't no what it was really. Then my boyfriend said that it probably was Military helicopters flying to the Armey National Guard base on M100. I told him I didn't think so but if they were helicopters, I didn't think they would all fit on that field. I didn't no what it was so I just went along with what he said."],"trends":["There have been 3 other sightings in DeWitt","There were no other sightings in DeWitt on or around August 3rd 2013"],"Summary":"Two groups of lights in the sky side by side about 100 of them going south then outr of sight.","Date of the Event":"08/03/2013 09:30 UTC","Case Number":"49484","Latitude":"42.801173","Disposition":"Unresolved","Source":"MUFON","files":["/var/www/straped/mufon/html2text/49484.html.txt","/var/www/straped/mufon/org/49484.html"]}