{"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Country":"Israel","map":"<A HREF = \"http://maps.google.com/maps?q=32.699635,+35.303546(49488)&iwloc=A&hl=en\"> mufon case (49488) map </A>","Disposition":"Unresolved","Longitude":"35.303546","City":"Nazareth","Source":"MUFON","Date Submitted":"08/05/2013 08:23 UTC","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Case Number":"49488","Tags":"City","Region":"","trends":["There has been one other sighting in Nazareth","There were no other sightings in Nazareth on or around August 1st 2013"],"Log Number":"IL-08052013-0016","Object Flight Path":"Straight-line path","Object Shape":"Circle, Unknown","divs":["Sighting DetailsI was on the roof of a hotel relaxing and talking with two lady friends, facing NW. They sat across the table from me. Suddenly I spotted a bright orange light about 45 deg above the horizon and moving toward us. It moved slowly, so at first I thought it was a helicopter, but there was no noise at all. Generally the only aircraft we see in the sky over Nazareth are either military jets or helicopters, but they bear conventional lights, which this object did not. I got the impression that it had some kind of structure, as the light was not round or symmetric. It grew brighter, even quite bright, as it passed overhead maybe 500 ft up. It then passed through 90 degrees or straight over us to the SE. Before it was occluded by the higher structure of the hotel roof behind me it faded out. I was quite calm at first until I realized it had no green or red light and therefore was not a jet or helicopter. Then I was suddenly excited (but tried to remain subdued) and called my friends attention to the light. They both turned around and looked up and saw it and asked, \"What is it?\" They suggested \"airplane\" or \"helicopter\", but I pointed out that nothing that flies at night over Israel is orange. Also nothing in the sky simply fades out. I was disturbed when it faded out, for nothing that I know does that. I had no good explanation for what we saw. I never thought of taking a photo with my Israeli cell phone, which can do that, but in low quality. I still have no explanation for the light or for my own inability to think of photographing it."],"Date of the Event":"08/01/2013 12:00 UTC","Latitude":"32.699635","files":["/var/www/straped/mufon/html2text/49488.html.txt","/var/www/straped/mufon/org/49488.html"],"Object Features":"Other","Summary":"A bright orange light appeared at about 45 deg above horizon and moved SE silently then faded away&#8805;"}