{"Country":"Mexico","Summary":"entity at foot of bed scaning the room with some kind of light","Source":"MUFON","City":"Nuevo Laredo","Latitude":"27.470423","Log Number":"MX-08052013-0010","Date Submitted":"08/05/2013 02:10 UTC","Weather Factors":"Unknown","Longitude":"-99.534246","trends":["There has been one other sighting in Nuevo Laredo","There were no other sightings in Nuevo Laredo on or around August 3rd 2013"],"Case Number":"49482","map":"<A HREF = \"http://maps.google.com/maps?q=27.470423,+-99.534246(49482)&iwloc=A&hl=en\"> mufon case (49482) map </A>","Object Shape":"Unknown","Region":"Tamaulipas","divs":["Sighting DetailsOn early saturday morning, I would say around 1 or 2am, I found myself awaken by a loud noise and the sound of my mothers dogs barking. I was in the room asleep with my son, cousin, aunt and uncle. I payed no attention to the noise since it's not unusual to hear them when you have pets in the house. What really made me wake up was the fact that I saw a light appear in the room. A very bright light. I opened my eyes thinking at first it was a family member looking for something, but what I saw really scared me. At the foot of the bed where I was standing there was a black entity scanning the room with what I think was a flashlight, at first i thought it was an intruder (human) but then I saw it's head, and it was not a human head. It had a long round jaw and a big round black eye (seen in side view)It was scanning the room as if it was looking for something or someone, but it wasn't moving it was just standing there, when it notice i opened my eyes it flashed the light towards me and blinded me, I couldn't open my eyes at all no matter how hard I tried. I was obviously scared and attempted to wake up my aunt who was sleeping next to me but had no luck in doing so. This lasted for what ?I think was about 30seconds to a minute. The light then disappeared and once I was able to see again I noticed there was no one there. I was extremely scared and my first reaction was to check if my son was still next to me, which he was. I held him tighter got under the covers and went back to bed. The following day I mentioned the experience to my family, but no one heard or saw anything. I want to believe it was just a dream, but this is the second time an experience like this has happened to me."],"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/49482.html.txt","/var/www/straped/mufon/org/49482.html"],"Tags":"City","Object Features":"Appendage(s)","Date of the Event":"08/03/2013 12:00 UTC","Object Flight Path":"N/A","Sighting Duration":"Undisclosed","Viewing Distance":"20 Feet or Less"}