{"divs":["Sighting DetailsI was driving thru country and needed gas. I stopped at a country store and began pumping fuel. Suddenly, I see what I initially think is a firework descend in the horizon. It was an object traveling in a westward direction and descending rapidly. It started off with kind of a pink glow that changed to green then at the end it had turned to a white globe then it dissiipated with a white flash. I knew at once that it was too close and too large to be a falling star or comet, that's why I initially thought it was a firework. I just stood there dumb founded for about five minutes, looked around too see if anyone else saw it it but to no avail. It reminded me of another UFO I saw several years before but that one had an immense green flash that covered the horizon. I had a very eerie feeling and actually felt a heat flash with nausea. I got in the car and continued toward town on the darkening highway. They're we're very strange cloud formations in the sky or maybe it was just enhanced because of what I saw. At any rate, I found this anomaly serious enough to report it."],"Weather Factors":"Unknown","Date Submitted":"08/05/2013 11:54 UTC","files":["/var/www/straped/mufon/html2text/49494.html.txt","/var/www/straped/mufon/org/49494.html"],"Latitude":"35.817011","Object Shape":"Circle, Sphere","Log Number":"US-08052013-0020","Sighting Duration":"Undisclosed","Longitude":"-88.59561","Source":"MUFON","Country":"United States","trends":["There have been no other sightings in Cedar Grove","This sighting has never been favorited."],"Disposition":"Unresolved","Case Number":"49494","Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=35.817011,+-88.59561(49494)&iwloc=A&hl=en\"> mufon case (49494) map </A>","Date of the Event":"08/04/2013 08:02 UTC","City":"Cedar Grove","Region":"Tennessee","Summary":"Light, too close for falling star, descends in west. Projecting color trail that changes and ends in a flash.","Object Features":"Unknown","Tags":"City"}