{"Object Shape":"Sphere","Region":"Michigan","Disposition":"Unresolved","Longitude":"-83.287832","Summary":"Two glowing red orbs flying in trail approached from west climbing and then turned south 90 degrees and climbesd into clouds","files":["/var/www/straped/mufon/html2text/49493.html.txt","/var/www/straped/mufon/org/49493.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.186555,+-83.287832(49493)&iwloc=A&hl=en\"> mufon case (49493) map </A>","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"08/05/2013 10:59 UTC","Country":"United States","Object Features":"None","Case Number":"49493","Date of the Event":"08/03/2013 12:00 UTC","Tags":"City","Weather Factors":"Unknown","trends":["There have been 11 other sightings in Taylor","There were no other sightings in Taylor on or around August 3rd 2013"],"Source":"MUFON","Sighting Duration":"Undisclosed","City":"Taylor","Latitude":"42.186555","Log Number":"US-08052013-0019","Object Flight Path":"Path with directional change,Path then hovering","divs":["Sighting DetailsEvening dinner in backyard. We live south and east of metro airport and are familiar with aircraft and flight paths.......can hear jets when wind is right. Noticed Bright red orb traveling from west to east (toward us)It was south of the airport boundry and was not following any flight path seen in many years of living near and around this airport. Both my wife and I noticed right away it was unusual... It appeared to be climbing and there were No navigation light or strobes. A second orb appeared in trail of the first one and appeared to follow about one half mile behind. Neither orb made any sound. The lead object turned smoothly 90 degrees to the south and climbed into the clouds, the second object followed the same path but not as smoothly and appeared to hover brifly and then climbed away as the other. Bright red glow of orb shaped light with a yellow tinge to the edges. No visible shape, no sound at all....I have never been this close to a flying object that made no sound. I have been around aviation all my life and never saw anything like this. For all I know it was a drone or man made object. But for both my wife and I this qualifies as an unidentified flying object(s)."]}