{"Disposition":"Unresolved","Case Number":"49492","Sighting Duration":"Undisclosed","trends":["There have been 39 other sightings in Erie","There were no other sightings in Erie on or around June 14th 2013"],"files":["/var/www/straped/mufon/html2text/49492.html.txt","/var/www/straped/mufon/org/49492.html"],"Log Number":"US-08052013-0018","Date of the Event":"06/14/2013 12:00 UTC","Summary":"Curved FLT. Path 2objs same path 2min. Apart Brite orange circle(donut) multi orange/yellow","map":"<A HREF = \"http://maps.google.com/maps?q=42.135924,+-80.083469(49492)&iwloc=A&hl=en\"> mufon case (49492) map </A>","Object Features":"Other","Country":"United States","Date Submitted":"08/05/2013 10:38 UTC","Region":"Pennsylvania","Source":"MUFON","divs":["sighting detailson my back deck, noticed a bright something thru the tree leaves to my left(se) i then went n. to the front yard for better look and saw a ball? donut? bright orange and yellow object with 3 distinct color bands ...center pale orange...surounded by a more intense ring of brighter orange that seem to flowing w\\ what looked like a river of varying orange ripples like disturbed water would look like. the outer ring was a yellow radiant spoke-like appearance w\\ the spokes close together. it was coming towards slowly(heading due north) and i could see it very clearly. at this point i darted into the house and grabbed my binocs (7x30) and continued to observe the object thru them. at this point the o made a gradual turn to the e. not changing speed. i watched it for appr. 1 min. as it continued e. til the tree line obscured my veiw. i then looked to where first saw it from the front yard and saw a second identical object following the same path as the first. the second one however did not disappear in the same manner as the first but as it came to the tree line it grew smaller and rose steadily til it went out of sight. (i guess-timate a45deg. angle). accurate sketch available if needed. incidenndly i was able to contact my son by cphone at the time and he was on his way home on the road the objects seemed to to be traveling above but he reported he could not see them. for a size comparison they looked to be the size of a bb gun bb held at arms length."],"Latitude":"42.135924","Object Flight Path":"Path with directional change","City":"Erie","Object Shape":"Circle","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","Longitude":"-80.083469","Tags":"City"}