{"Weather Factors":"Unknown","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile, Unknown","trends":["There have been 82 other sightings in Washington","There were no other sightings in Washington on or around August 5th 2013"],"Case Number":"49505","divs":["Sighting DetailsMy family and I are driving to Deception Pass here in Washington state. We the decide to pull over at a campsite to get eat lunch. A half hour passes and almost time to get back on the road again, until suddenly I notice an orb like structure in the sky. I had then quickly announced what I see and from there we all gazed up at the sky to try and see what I had been describing. We keep our eyes up and notice that something was different. This craft we spotted was something we all have never seen something to this extent. We all saw and it continued to fly around up and down side to side. Military planes were present as well with the obvious crackle of speed. We kept seeing this craft flying all over acting as if it were interacting with us all... We then decided to leave and think of this experice as unusual and something out of the ordinary. But we felt that it was definitely something that wasn't military or civilian, it was a UFO and I am a believer as long with the other members of my family. I wish I could express more but my phone is dying... Thank you Dr. Greer for all your great work along with you're great team. I shall keep doing what I can to contact ET beings and helping the people of this world realize that we are not alone... Thank you for the terrific site of pure truth."],"Object Features":"Dome","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","City":"Washington","Date Submitted":"08/05/2013 06:08 UTC","Summary":"Star like object, moved in rapid speeds, and no apparent direction. Pulsated and flew with other craft aware","Longitude":"-77.033754","Latitude":"38.909881","Sighting Duration":"00:25:00","Object Shape":"Circle, Disc, Fireball, Flash, Oval, Star-like","Disposition":"Unresolved","Country":"United States","Date of the Event":"08/05/2013 01:00 UTC","Region":"Washington","Source":"MUFON","Log Number":"US-08052013-0029","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.909881,+-77.033754(49505)&iwloc=A&hl=en\"> mufon case (49505) map </A>","files":["/var/www/straped/mufon/html2text/49505.html.txt","/var/www/straped/mufon/org/49505.html"]}