{"Date of the Event":"08/05/2013 08:50 UTC","Country":"United States","Object Features":"Unknown","Case Number":"49512","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Summary":"Solid Lightsource with no sound flying in a straight line.","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","City":"Austin","map":"<A HREF = \"http://maps.google.com/maps?q=30.164399,+-97.765089(49512)&iwloc=A&hl=en\"> mufon case (49512) map </A>","Weather Factors":"Unknown","Source":"MUFON","Tags":"City","Log Number":"US-08052013-0038","Sighting Duration":"Undisclosed","Object Shape":"Star-like","Longitude":"-97.765089","trends":["There have been 188 other sightings in Austin","There was one other sighting in Austin on or around August 5th 2013"],"Date Submitted":"08/05/2013 10:12 UTC","divs":["Sighting Details1. Where were you and what were you doing at the time? On my back porch smoking a cigarette 2. What made you first notice the object? Its bright and stands out, this isn't the first time ive seen it, ive noticed it a handful of times over time usually after the sun goes down until the sun goes up, appears to be random times but always the same direction and object type. 3. What did you think the object was when you first noticed it? Honestly I have no idea im ex-us army medic im used to seeing planes and helicopters but this dosent blink or make noise or have any discernible features. 4. Describe the object and its actions and motions in detail. Solid Light making no sound traveling from west to east at approx. 500 ft - 700ft up never changed direction or appearance. 5. Describe your feelings, reactions and actions, during and after sighting the object. Not the first time ive seen this, its interesting and would like to figure out what it is. I lack the equipment to better observe this object and filter out the light its emmiting. 6. How did you lose sight of the object? It just continued east at the same speed and went beyond my sight eventually event lasted around 7 minutes. Same as all the other times."],"files":["/var/www/straped/mufon/html2text/49512.html.txt","/var/www/straped/mufon/org/49512.html"],"Latitude":"30.164399","Region":"Texas"}