{"Longitude":"-95.185755","Object Shape":"Unknown","Date Submitted":"08/05/2013 09:34 UTC","trends":["There have been 10 other sightings in Pasadena","There were no other sightings in Pasadena on or around February 18th 2011"],"Latitude":"29.653027","Object Features":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Unknown","files":["/var/www/straped/mufon/html2text/49510.html.txt","/var/www/straped/mufon/org/49510.html"],"Tags":"City","Region":"Texas","Viewing Distance":"Unknown","Source":"MUFON","Disposition":"Unresolved","Date of the Event":"02/18/2011 05:00 UTC","City":"Pasadena","Country":"United States","divs":["Sighting DetailsI was sleeping I don't know if this happen at night are morning. Anyway all of a sudden I awoke. I was in outer space I did not have a body are I did not see a body. But there I was. I done know what was holding me up but felt like I was being held up by something. In my head I was being told not to look to my left. It felt like a being are something was beside me but kept telling me not to look. Anyway straight ahead there was earth I was being shown South America for some reason. Beyond earth there was the moon. I looked up there were a billion stars as far as I could see. I have seen stars in the sky but not like this. I remember a slight breeze blowing my bangs I dont know where the wind was coming from but it was a slight breeze. When I woke up I was back in my bed and remembered all of the above. Everybody I have told has laughed at me. Every thing I saw was in color. I dont think you dream in color. If it was a dream it was so vivid that was a year ago. I remembered it as if it was yesterday. I know I felt happy and in awh of the heavens and the earth and moon. Beautiful is an understatement. I bet there was more to this but what ever enity wipe out some of my memory and only let me remember this. Please dont laugh this is a true story. I will take a polygraph test or be hypnotized. I want to know more myself. Judy"],"Case Number":"49510","Log Number":"US-08052013-0036","map":"<A HREF = \"http://maps.google.com/maps?q=29.653027,+-95.185755(49510)&iwloc=A&hl=en\"> mufon case (49510) map </A>","Weather Factors":"Unknown","Summary":"I was asleep then woke up in space."}