{"divs":["Sighting DetailsI was driving home from work around 9:20pm in Boulder heading east. I pulled into my driveway and looked up to see the stars. I was about to look away when I noticed a bright star moving fast. The star-like object was coming from the west. I thought I was seeing a falling star but realized the light seemed to be on a flight path. The light continued to the north east. It was covered by some cloud cover towards the end of the observable flight path. It didn't punch through the clouds it seemed to be higher than the clouds which were thunderheads. I observed this light for about 20 minutes. At times the object seemed to wobble as it flew away. I felt curious and a little nervous but then wondered if this was the space station or a rocket. I was a little scared because whatever it was it seemed to be in space and probably very large. I lost sight of the object as it disappeared into the north-east and beyond the horizon. The object was silent. No blinking lights, no other changing lights, just a solid white star. I had enough time to call out to my partner to come and see the light in the sky to verify what I was seeing. She agreed it was a light in the sky and didn't see any visible signs of blinking running lights of an airplane."],"Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Latitude":"40.017486","Viewing Distance":"Over One Mile","Country":"United States","Date of the Event":"08/05/2013 09:20 UTC","Region":"Colorado","map":"<A HREF = \"http://maps.google.com/maps?q=40.017486,+-105.267146(49524)&iwloc=A&hl=en\"> mufon case (49524) map </A>","City":"Boulder","Sighting Duration":"Undisclosed","Object Shape":"Star-like","Summary":"I observed a bright star-like object travel across the sky from the west and ended going into the north-east into horizon, there was no sound no running or blinking lights. Just a bright white light. it seemed to be in space.","Case Number":"49524","trends":["There have been 30 other sightings in Boulder","There were no other sightings in Boulder on or around August 5th 2013"],"files":["/var/www/straped/mufon/html2text/49524.html.txt","/var/www/straped/mufon/org/49524.html"],"Source":"MUFON","Log Number":"US-08062013-0007","Longitude":"-105.267146","Date Submitted":"08/06/2013 02:11 UTC","Object Features":"Unknown","Tags":"City","Disposition":"Unresolved"}