{"Summary":"Star like sun color object that grew bigger and brighter.","Region":"Ontario","map":"<A HREF = \"http://maps.google.com/maps?q=42.905386,+-78.963224(49527)&iwloc=A&hl=en\"> mufon case (49527) map </A>","Case Number":"49527","Latitude":"42.905386","Date Submitted":"08/06/2013 04:47 UTC","Weather Factors":"Unknown","Object Features":"Other","Tags":"City","files":["/var/www/straped/mufon/html2text/49527.html.txt","/var/www/straped/mufon/org/49527.html"],"Object Flight Path":"Hovering then path","Object Shape":"Disc, Star-like","Sighting Duration":"Undisclosed","Log Number":"CA-08062013-0010","Disposition":"Unresolved","City":"Fort Erie","trends":["There have been 5 other sightings in Fort Erie","There was one other sighting in Fort Erie on or around August 5th 2013"],"Date of the Event":"08/05/2013 08:50 UTC","divs":["Sighting DetailsI was driving west to a friends house in town it was clear outside and nice and cool just started becoming dusk outside. In a hurry to drop keys off that a friend needed I seen this object that looked like a mini sun at first I said to my self \"wow thats a really bright star but why is it so low\" As I rounded my friends street i just went about my business to get him the keys. I sat outside for 5 or so minutes talking to him actually forgetting already on what i had seen. When I left his house I came back into the open road where once again I could see this Bright sun like object. This time it had moved more to the south and it was twice as low as before. I knew right then it was no star curious i began to follow the object on a west route it was picking up speed and i found myself going way over the speed limit when all of a sudden it came to a dead stop and descended behind the tree tops to the west, I pulled my truck over and thought i would wait to see what would happen, 2 min later it popped back up and started going west and up into the sky Once again I started following it for 6 miles or so when all of a sudden it just started going so fast then in a blink it vanished right in front of my eyes. I stopped the truck once again on the side of the road in disbelief, I thought well that was crazy and turned the truck around and started heading home, When I got close to my house i made a right and was heading south when all of a sudden the object appeared over a field on bowen rd. It's at this point i noticed a transport truck and a car pulled over watching this object as well. Once again it hovered then started moving west once again 2 min later it shot up way into the sky and was just gone. The video that was taken aug 4th on this site in the united kingdom is no doubt in my mind the same type of object as what I had seen tonight."],"Viewing Distance":"501 Feet - 1 Mile","Country":"Canada","Longitude":"-78.963224","Source":"MUFON"}