{"Date of the Event":"08/05/2013 10:01 UTC","Date Submitted":"08/06/2013 01:26 UTC","trends":["There has been one other sighting in Port Hadlock-Irondale","There were no other sightings in Port Hadlock-Irondale on or around August 5th 2013"],"files":["/var/www/straped/mufon/html2text/49522.html.txt","/var/www/straped/mufon/org/49522.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=48.032589,+-122.764848(49522)&iwloc=A&hl=en\"> mufon case (49522) map </A>","Disposition":"Unresolved","Country":"United States","Object Features":"Unknown","Case Number":"49522","Weather Factors":"Unknown","Source":"MUFON","City":"Port Hadlock-Irondale","Summary":"Watched star-like object silently move across night sky for 5+minutes.","Object Shape":"Star-like","Tags":"City","Region":"Washington","Object Flight Path":"Straight-line path","Log Number":"US-08062013-0005","Sighting Duration":"00:05:00","Latitude":"48.032589","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-122.764848","divs":["Sighting DetailsI was inside watching Canoe Journey 2013 via webstream on the internet. My 9 year old son came running into my room yelling, \"Mommy, Mommy, there's a UFO outside! Come and see!\". So I jumped up as quickly as possible to se what he was so excited about. I witnessed looking North West towards the foothills of the Olympic Mountains, a starlike object traveling East directly above me. It was completely silent. It traveled in a straight line. It appeared to get quite a bit brighter at about 3 minutes into my observation. My husband, son, and myself all said, \"WOW, WHOAH, WEIRD!\" when the star-like object brightened. It traveled EAST towards EDMONDS and we watched it for as long as we could see it. Aprox 5-6 minutes. As I watched, I thought for sure it would start to flicker or waiver, and tell me it was a chinese lantern or similar object. It did not. It was not a lantern. It was not a plane. It was not a helicopter. It was not a home-made UFO either, made from straws, garbage bags and birthday candles either. It was an unexplainable event with a UFO, plain and simple. I saw an object very similar to this one 2 blocks up the street from me a few weeks ago. I was not alone during that event either and had witnessed the same star-like object, silently moving from the North to the East. It was way below the cloud line when first observed as was this one tonight. I think I am pretty sure that what I saw was a rarity."]}