{"Case Number":"49520","Country":"United States","City":"Arvada","Weather Factors":"Unknown","Date of the Event":"08/05/2013 09:30 UTC","trends":["There have been 28 other sightings in Arvada","There were no other sightings in Arvada on or around August 5th 2013"],"Longitude":"-105.068042","Object Flight Path":"Path with directional change","Region":"Colorado","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.795612,+-105.068042(49520)&iwloc=A&hl=en\"> mufon case (49520) map </A>","Disposition":"Unresolved","divs":["Sighting DetailsJust leaving work with a friend, heading to our cars in the lot, chit chatting. I always glance at the sky because we have beautiful skies here in CO and I love to look at the stars. A plane flew overhead and we both noticed the object at the same time. It was almost directly overhead, and heading north. It was extremely bright and no flashing lights. My friend said \"is that a satellite??\" I said maybe, but after only a second it was clear to both of us it was NOT a satellite. It was moving slower than an airplane, but was way too bright to be a satellite and seemed to be pulsating and zigzagging very slightly. As we watched it we both distinctly noticed it change direction from north to northeast, making a wide but very noticeable curve. It occurred to me to pull out my phone and record it. In the video you can see that it is much brighter than the stars, but that there are no flashing lights like a plane. I zoomed in on it and it is then that we saw it was a round sphere or orb that was pulsating in different metallic colors. You can here my friend faintly point out in the background that it is zigzagging, though in the video it is hard to tell the craft's movement from my own hands shaking the camera. Near the end of the video I get the nearby building's roof and light, and though dimmed by the light on the building, you can see then how big and bright the object is. I didn't realize the camera stopped recording as we ran around the side of the building to continue watching it. It moved into a patch of clouds that was in the northeast sky, and was clearly above them, though I still couldn't guess the altitude. We watched it until it was too far away to see and too much clouds in that area of sky. My friend and I are convinced we saw something really strange tonight."],"Latitude":"39.795612","files":["/var/www/straped/mufon/html2text/49520.html.txt","/var/www/straped/mufon/org/49520.html"],"Viewing Distance":"Unknown","Summary":"Bright large pulsating orb","Source":"MUFON","Tags":"City","Log Number":"US-08062013-0003","Object Features":"Unknown","Object Shape":"Flash, Sphere, Star-like","Date Submitted":"08/06/2013 12:13 UTC"}