{"Tags":"City","Region":"Pennsylvania","Source":"MUFON","Object Shape":"Sphere","Weather Factors":"Unknown","City":"York","trends":["There have been 16 other sightings in York","There were no other sightings in York on or around July 20th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.966388,+-76.720075(49534)&iwloc=A&hl=en\"> mufon case (49534) map </A>","Log Number":"US-08062013-0017","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/49534.html.txt","/var/www/straped/mufon/org/49534.html"],"Case Number":"49534","Longitude":"-76.720075","divs":["sighting details1.i was in the susquhanna river @ the peachbottom nuculer power plant fishing in my boat with my cousin.i put the boat in @ the peachbottom mariena on the lancaster side.i 2.i always look @ the sky for light\\ufos when i have a chance to be outside @ night,and it was far off and came closer. 3.possibly a plane until it was close and i clearly seen it was not\\and watched its flight pattern\\movements,up down zig zaging.also the glowing light white\\blue in center and amber red around it glowing(4 red 1 white) 4.it traveled north east to south west fast at first as it got closer to the boat it slowed almost to a complete hoover.completly silent\\also descended in elevation from where i fist saw it.watched it till it disapeard then about 20-30 min... later a seen it higher in the sky going back the way it came but it was to high to see the amberish lights just the whiteishblue. 5.happness excitement,watched it in awll. the second time it gave me s sence of uneasiness, fear.it was the reason we left we both had a odd feeling to get away . 6.it flew so fast away it disappeared,thats when the fear thing hit us and we left 7.their is some more to the story,not very good at typing fast\\also have had many more experiances in my life. sighting ufos and beings. feel free to contact me if interested.i prefer the phone not email."],"Date of the Event":"07/20/2013 10:30 UTC","Date Submitted":"08/06/2013 11:53 UTC","Object Features":"Other","Summary":"5 lights 4 red/amber 1white/blue glowing///after it elivated could only see the white glowing light","Latitude":"39.966388","Disposition":"Unresolved","Country":"United States","Object Flight Path":"Stationary,Straight-line path,Path with directional change,Path then hovering","Sighting Duration":"Undisclosed"}