{"files":["/var/www/straped/mufon/html2text/49539.html.txt","/var/www/straped/mufon/org/49539.html"],"Summary":"Sphere of light that flew parallel to the ground, had no trail, seemed to slow down jut before it just shut off.","Object Shape":"Sphere","Disposition":"Unresolved","Longitude":"-111.729268","City":"Fountain Hills","Weather Factors":"Unknown","Sighting Duration":"00:00:02","Log Number":"US-08062013-0022","Source":"MUFON","Date Submitted":"08/06/2013 03:35 UTC","Date of the Event":"07/30/2013 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=33.623682,+-111.729268(49539)&iwloc=A&hl=en\"> mufon case (49539) map </A>","trends":["There have been 8 other sightings in Fountain Hills","There were no other sightings in Fountain Hills on or around July 30th 2013"],"Tags":"City","Case Number":"49539","Object Flight Path":"Straight-line path","Object Features":"Unknown","Country":"United States","divs":["sighting detailsi was using dr. greers et contact tool. i was seeing a shooting star every night within one minute of playing the crop circle recording. i did it between 2am - 3am every night for 12 days in my backyard. this was different from the shooting stars i saw every night. it flew less than 1\\2 the speed. it had no tail. it was a perfectly round ball of light. even though it was a sphere of light, it also did not have any glow to it (like a star or a comet). so, it was a very round light. it came out of a more northerly area of the northwest sky. my chimney blocked its most distant origin. so, i saw it as soon as it came past my chimnney. it flew exactly parallel to ground. it was flying in southerly direction. it seemed to be about 500 feet above all the houses it flew over. it also seemed about a 1\\4 mile away. when it was directly west, it stopped and its light immediately shut off. the exact place it stopped was the most wide open spot to observe me from. the whole thing lasted 2-3 seconds. a normal shooting star occurred on ne side of sky about 2 minutes later. it was not very bright. it was nothing like what i am reporting. i did not play crop circle recording again and i did not see any other shooting stars over next hour."],"Region":"Arizona","Latitude":"33.623682"}