{"Longitude":"-78.962831","trends":["There has been one other sighting in Grand Island","There were no other sightings in Grand Island on or around July 5th 2013"],"Weather Factors":"Unknown","Object Shape":"Unknown","Latitude":"43.01004","Summary":"Brighter then Venus but at daytime, grabbed binocs, rectangular with super bright white lights and red glowing dome, hovering then moved at great speed to infinity","Source":"MUFON","Log Number":"US-08062013-0014","Disposition":"Unresolved","Date Submitted":"08/06/2013 09:03 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=43.01004,+-78.962831(49531)&iwloc=A&hl=en\"> mufon case (49531) map </A>","divs":["Sighting DetailsI was relaxing in my backyard with my family at 6:30 pm when my wife observed a incredibly bright light to the northeast appear. I took a quick glance and wrote it off as the waning sunlight bouncing off of a civilian aircraft which I have seen many times. Within 20 seconds I knew this was not that as the light remained stationary. I told my wife to grab my binocs so I could keep the object in sight. The object was roughly above the Niagara River by Niagara Falls but at an elevation of 10-15k ft. When she came back I could clearly make out a greyish rectangular, sideways domino shape that had a incredibly bright white bank of light on its side. The power of these lights was nothing I have ever seen in my life. The object moved down a few hundred feet then west a few hundred feet and then shot up a few hundred feet and then just hovered for a couple minutes. It then dipped downwards and I could see on the top was a upside down saucer shaped glowing red circle. At this point my adrenaline kicked in and I dashed into the house to try and get my 12\" dobsonian dragged outside to get a closer look. As I swiveled the dob to the target my wife who had the binocs said its leaving. I witnessed the object turn towards the north and take off at incredible speed to infinity. Within 3 seconds it was gone. I am a seasoned amateur astronomer with 30 years of experience and I know the location of Venus and am familiar with most civilian and military aircraft. This was none of those."],"Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Viewing Distance":"Over One Mile","Object Features":"Dome, Unknown","Sighting Duration":"Undisclosed","City":"Grand Island","Region":"New York","Case Number":"49531","Date of the Event":"07/05/2013 06:31 UTC","files":["/var/www/straped/mufon/html2text/49531.html.txt","/var/www/straped/mufon/org/49531.html"],"Country":"United States"}