{"City":"Quitman","Case Number":"49537","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.348765,+-92.721541(49537)&iwloc=A&hl=en\"> mufon case (49537) map </A>","files":["/var/www/straped/mufon/html2text/49537.html.txt","/var/www/straped/mufon/org/49537.html"],"Disposition":"Unresolved","Summary":"Going into Jackson-Bienville game reserver for a deer hunt. Stopped and got out of truck with brother and stood there watching this object go up and down and then from side to side in movement like it was observing something on the ground.","Log Number":"US-08062013-0020","Source":"MUFON","Country":"United States","Object Features":"Patterned Surface","Object Flight Path":"Stationary","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","trends":["There have been no other sightings in Quitman","This sighting has never been favorited."],"Region":"Louisiana","Date of the Event":"11/21/2012 05:00 UTC","Longitude":"-92.721541","divs":["Sighting DetailsMe and my brother had just turned off the main highway to go into the Jackson-Bienville Game reserve about 5am. We drove about a half mile down the dirt road. All of a sudden my brother says stop the truck. He said lets get out of the truck. There's something in the sky behind us. So we got out and low and behold there was this bright white light with changing colors object in the sky. It was moving in a zig zag way. It would move up. then down. Then it would stop at the original altitude when it was still. Then it would zig zag to the left then to the right. It looked as if it was observing something on the ground. Where it was hovering there was like a pasture and more game reserve. We watched it for about thirty mins. We had to get back into the truck and go get to our deerstand spots before sunrise. It was still there when we left. When I got to this pipeline to walk down to my spot. I had clear view of where this object might have been in the sky. As I was walking. The object was not there anymore. I could have kicked myself in the butt for not getting my cell camera out or even taking my rifle out and looking at it with my scope. We were just caught in amazement for so long.... We will never forget what we saw. One more thing. When the obect would teeter just abit while hovering. We could make out redish-orange lights that were in parallel form on each side of the craft and the lights came to a point inwhich we had come to the conclusion that this craft was of a triangular shape....I have never seen a ufo and always wanted to. That morning I did. There are beings beside us humans living amongst us!"],"Latitude":"32.348765","Date Submitted":"08/06/2013 02:26 UTC","Weather Factors":"Unknown","Object Shape":"Star-like, Triangle","Sighting Duration":"Undisclosed"}