{"Country":"United States","Disposition":"Unresolved","Latitude":"42.363001","Object Features":"Unknown","trends":["There have been 54 other sightings in Boston","There were no other sightings in Boston on or around August 1st 2013"],"Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Longitude":"-71.056823","files":["/var/www/straped/mufon/html2text/49533.html.txt","/var/www/straped/mufon/org/49533.html"],"Case Number":"49533","Source":"MUFON","Date Submitted":"08/06/2013 11:03 UTC","Sighting Duration":"Undisclosed","City":"Boston","map":"<A HREF = \"http://maps.google.com/maps?q=42.363001,+-71.056823(49533)&iwloc=A&hl=en\"> mufon case (49533) map </A>","Date of the Event":"08/01/2013 12:00 UTC","Log Number":"US-08062013-0016","Object Shape":"Cigar","Summary":"object shoots out of cloud relects light from sun off it surface that really catches my eye then continues in straight path over power plant.","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsIt was approximately ten am or somewhere around that time, Sun was still low and to my right rear from the building that I just walked out from. I decided to have a cigarette,while smoking said cigarette I was looking around the work site.while doing so I also looked to the sky no particular area just around. when I looked to my left observing a large low puffy cloud at that moment an object came from its cover.just to make note I probably would have missed said object if it had not reflected the sun off its surface. after leaving the cloud cover. object was unobstructed from my sight sky was blue with visilable clouds in the far distance. The object was long tube like,more like a cigarette,clouds were low This day so mistaking it for a jetliner was impossible.as it moved away from me in a westerly direction I noticed it made no noise what so ever it's surface seemed opaque slightly white,as i stood there in awe watching it move over the site I did not blink for fear of losing contact with it.as It moved further away at a very high speed. it appeared to blend in with sky I hazard to say if not for it reflecting the sun It would've went unnoticed. it's speed was not that swoosh movement we all see on the big and small screen it was a steady deliberate speed. It was low enough to know it wasn't a conventional craft I've observed lots air craft around the plant and this did not fit the bill. it took all of about three seconds to leave my sight as it faded away over the the hills in the distance then the ocean beyond. I feel blessed to have seen it and hope to see more in the future."],"Region":"Massachusetts","Tags":"City"}