{"Object Features":"None","divs":["Sighting DetailsI was saying farewell to two associates on a driveway off of Kappler Road in St Helens, OR when we all noticed out of the corner of our vision a strange cloud or presence to our NE. A translucent object, generally oval in shape, was moving down towards the Earth a few miles above us and to the NE. It was wavering like thermal waves above hot piece of asphalt in the summer. The 'ship' was transparent or translucent (could see the blue sky behind it). As we watched it halted and immediately released steam jets, or venting, at regular positions along its bottom edge. Instantly the 'steam' moved off to the North, carried by the wind. Seconds later the 'ship' completely disappeared and all was left to be seen was the steam moving far off and dissipating. All of this took maybe 15-20 seconds. About 1 minute or less later 2 fighter jets flew directly over us at a very high altitude. I could see their trails when they turned, but not when they flew straight ahead. The jets left only slight arcs of vapor to mark their turns. Several times the jets turned in a serpentine motion which was quite rare for the skies above northwest Oregon. Typically they are just heading out of the area in a straight line. We all looked at each other and my friend, said, 'That was like something out of Men in Black', and we all laughed and said our goodbyes. That is all I have to report."],"Weather Factors":"Unknown","trends":["There has been one other sighting in St. Helens","There were no other sightings in St. Helens on or around August 6th 2013"],"Object Flight Path":"Hovering then path","Longitude":"-122.815818","City":"St. Helens","files":["/var/www/straped/mufon/html2text/49541.html.txt","/var/www/straped/mufon/org/49541.html"],"Latitude":"45.859011","map":"<A HREF = \"http://maps.google.com/maps?q=45.859011,+-122.815818(49541)&iwloc=A&hl=en\"> mufon case (49541) map </A>","Case Number":"49541","Date of the Event":"08/06/2013 10:15 UTC","Object Shape":"Oval, Unknown","Viewing Distance":"Over One Mile","Summary":"Huge 'ship' that was transparent/translucent (could see the blue sky behind it) halted and released steam before completely disappearing. Then fighter jets flew over very high.","Disposition":"Unresolved","Country":"United States","Sighting Duration":"Undisclosed","Log Number":"US-08062013-0023","Tags":"City","Source":"MUFON","Region":"Oregon","Date Submitted":"08/06/2013 05:01 UTC"}