{"Object Shape":"Diamond, Star-like","Tags":"City","Object Features":"Appendage(s)","trends":[],"Latitude":"36.784861","Disposition":"Unresolved","Date of the Event":"08/02/2013 12:00 UTC","Sighting Duration":"Undisclosed","Date Submitted":"08/06/2013 06:55 UTC","divs":["Sighting DetailsI went out into my front yard, couldn't sleep, about 3:00 a.m. Looked at the crescent moon to the east. Then saw an object that looked like a moving star just below and north of the moon. At first I thought it might be a plane. It moved steadily in a horizontal path. Then it stopped in mid-air and hovered. It was quite a distance up in the sky, mid-horizon. I watched because of the hovering, this could not be a plane. The object must have been very large, looked like a major star. Light was always white, looked like a diamond. Then the lights diminished and the object disappeared completely. Then it came back again. It did this four times. I became very tired and could not keep watching it. It remained there and I went back into my house. I believe this was a ufo. I have never believed in ufos, but I know what I saw, I have never seen a flying object do these things before. I knew I had seen a ufo, but didn't know what to do about it. Also, I had a sighting about seven days before this one, same type of object but in the western horizon. Will detail that in another report."],"Region":"California","Weather Factors":"Unknown","Case Number":"49544","Country":"United States","Longitude":"-119.414832","Source":"MUFON","City":"Undisclosed","Viewing Distance":"Unknown","Summary":"Saw star-like object at mid horizon flying in straight horizontal path, then hovered, then disappered and came back 4 times at hovering position","Log Number":"US-08062013-0026","files":["/var/www/straped/mufon/html2text/49544.html.txt","/var/www/straped/mufon/org/49544.html"],"Object Flight Path":"Straight-line path,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=36.784861,+-119.414832(49544)&iwloc=A&hl=en\"> mufon case (49544) map </A>"}