{"Disposition":"Unresolved","Object Shape":"Circle, Oval, Sphere, Star-like","City":"Douglas","Date of the Event":"07/15/2008 12:00 UTC","Summary":"a bright pulsating ball of light that teleported through the sky","files":["/var/www/straped/mufon/html2text/49546.html.txt","/var/www/straped/mufon/org/49546.html"],"Date Submitted":"08/06/2013 07:48 UTC","Tags":"City","Longitude":"-71.680069","Case Number":"49546","Region":"Massachusetts","Country":"United States","Weather Factors":"Unknown","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.042711,+-71.680069(49546)&iwloc=A&hl=en\"> mufon case (49546) map </A>","Object Features":"Unknown","Latitude":"42.042711","Sighting Duration":"Undisclosed","trends":["There have been 2 other sightings in Douglas","There were no other sightings in Douglas on or around July 15th 2008"],"Source":"MUFON","divs":["Sighting Detailssince i was a kid i was always interested in space and what was in it so i would often go outside at night and watch the stars. i have seen hundreds of sattelites and shooting stars and occasionally a few UFO's but one night i was outside in my front yard looking at the sky, i saw what looked like a sattelite moving across the sky. but i knew it wasnt a sattelite because while it was moving it just disappeared, then it reappeared further along its path, which was a straight line, but as it reappeared a trail of light started to appear bewtween where it reappeared and where it disappeared. it looked to me like it was teleporting, disappear from one place then appear in another place and leave a trail in between the two spots, it did this a few times but then one time it disappeared it didnt appear again, i walked around my yard to see if i could find it but i never saw it. when i first saw it i was excited and surprised at what i had seen. when it disappeared and didnt come back i wondered where it went and what it was. this wasnt the first UFO ive seen or the last one,UFO sightings and other paranormal things run in the family, basically all members from both my mothers and fathers side of the family have experienced UFO's and other things like ghosts."],"Log Number":"US-08062013-0028","Object Flight Path":"Straight-line path,Other"}