{"Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","City":"Douglas","Summary":"large light moving slowly no sound very bright oval like","Region":"Massachusetts","Date of the Event":"08/04/2013 10:45 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/49543.html.txt","/var/www/straped/mufon/org/49543.html"],"divs":["Sighting DetailsWe were outside watching stars and satellites and all of a sudden I saw this large bright light come from behind the trees. I joking said look at the UFO and then we just all stood there,waiting to hear a sound of an airplane or helicopter because it was low and very large and super bright. No sound came, we heard other airplanes before and after and saw plenty of satellites and shooting stars. We were waiting to see the blinking lights but none came. We watched it move very slowly across the sky and followed it as long as we could. We do not have a very large unobstructed view of the sky. 4 adults and one child saw this. We always watch the sky at night in the summer and never saw something like this without sound or blinking lights so we were all pretty amazed. Everyone just stood and watched and then when it was leaving my sight I ran around to the other side of the house to continue to see it and watched it till it went behind the trees again. I did not run to get camera because I figured it would not look like anything much on film and that it would be gone before I could get it."],"Date Submitted":"08/06/2013 06:48 UTC","Case Number":"49543","Object Shape":"Oval","Log Number":"US-08062013-0025","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.041021,+-71.679929(49543)&iwloc=A&hl=en\"> mufon case (49543) map </A>","Source":"MUFON","Country":"United States","trends":["There have been 2 other sightings in Douglas","There was one other sighting in Douglas on or around August 4th 2013"],"Longitude":"-71.679929","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Latitude":"42.041021","Object Features":"None"}