{"Tags":"City","files":["/var/www/straped/mufon/html2text/49550.html.txt","/var/www/straped/mufon/org/49550.html"],"Object Flight Path":"Stationary,Hovering then path","Disposition":"Unresolved","Summary":"one very bright white narrow ovular object hovered over harbour, moved slowly east, faded, then disappeared.","Longitude":"-63.13107","Log Number":"CA-08062013-0032","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Region":"Prince Edward Island","City":"Charlottetown","Case Number":"49550","Latitude":"46.23824","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=46.23824,+-63.13107(49550)&iwloc=A&hl=en\"> mufon case (49550) map </A>","Date Submitted":"08/06/2013 09:30 UTC","divs":["Sighting DetailsI was walking along the harbourside promenade heading west with the harbour on my left (south) and looking over the water at several boats when I noticed a very bright white narrow ovular shaped object in the sky over the harbour. It was difficult to determine if it was moving so I stopped walking and watched it. I thought it was reflecting the light as do airplanes high in the sky. It did not have wings or a tail. There was no sound what-so-ever, but I kept listening intently. There was no emission stream behind it, but there seemed to be feathery dark grey mists around it but not near it. Otherwise the sky was clear, but for the darker area around it. It seemed to be either hovering or moving very slowly toward the east. The object seemed to be at a 45 degree angle upward from where I stood, and perhaps several thousand feet up, but very difficult to determine. After about a minute, I could hear a plane approaching from the west toward the east basically along the same path as the object but moving much more quickly. I saw the plane's wings, jet-stream, and how it reflected the evening light as a bright white, but not as brightly as the object I was watching. I wondered if the object was a metallic helium balloon, but it wasn't the usual circular or teardrop shape of one. I wondered if it was a helicopter very distant, but they are usually red, orange or black and I've never seen one reflect light like this object. The object started to dim in brightness and outline, and I noticed a dark area around it's middle. It didn't change altitude and was still moving slowly. I glanced briefly at another plane approaching and looked back to where the object had been and it was completely gone and the sky was a clean blue where it had been. I was completely surprised and gasped aloud. I watched the sky for another minute and then started walking again...looking toward the area where it had been and in other directions. It didn't reappear."],"Country":"Canada","Object Shape":"Oval","trends":["There have been 6 other sightings in Charlottetown","There were no other sightings in Charlottetown on or around August 6th 2013"],"Date of the Event":"08/06/2013 08:45 UTC","Object Features":"Unknown","Weather Factors":"Unknown"}