{"Sighting Duration":"Undisclosed","Source":"MUFON","trends":["There have been no other sightings in Maxwell","This sighting has never been favorited."],"Disposition":"Unresolved","Viewing Distance":"21-100 Feet","Object Shape":"Triangle","divs":["Sighting DetailsSaw something crazy and amazing last night. Never thought I would ever see anything like that in my lifetime. So about 12-12:30 last night I was driving back to maxwell and when I got about 5 miles out I was watching an airplane. As I get closer I notice that the airplane is barely moving, but of course all I see is the lights from that distance and because of how dark it was. I get over the overpass and start driving into Maxwell and pull over to look at this odd-flying airplane, I notice that it is just 60 yards away and only about the size of a Crown Vic (for those of you that dont know what a Crown Vic is it is a large car that will seat 5-6 people....or just think of something your grandmother would drive lol). Anyway this airplane is hovering over the trees right on the other side of the train tracks, not moving at all other than maybe a little swaying back and forth. It sits there for a minute and then slowly starts moving to the west (toward north platte) I was amazed when I realized that this wasn't something from this world, I saw a UFO.My heart was pounding and hair standing on end from excitement. I followed it, speeding back to the west side of the overpass to catch up with it I just wanted one more glimps to confirm what I had already realized. I watch it in the distance as I am driving on the overpass. I lose sight of it behind a tree grove and when I come out the other side I can see all the way to North Platte but it has vanished. So why was it hovering so low over the trees in the very small village of Maxwell, NE? Why did it not seem to mind that we were watching it even when I made it very obvious that we did see it? And why was it moving so slow and seem to be sticking to the south side of the highway the entire time? Looking for something, damaged aircraft from the storm we had maybe? I don't know but it left my mind pondering, searching for answers."],"Date Submitted":"08/06/2013 09:35 UTC","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/49552.html.txt","/var/www/straped/mufon/org/49552.html"],"Object Flight Path":"Hovering then path","Longitude":"-100.518991","map":"<A HREF = \"http://maps.google.com/maps?q=41.07785,+-100.518991(49552)&iwloc=A&hl=en\"> mufon case (49552) map </A>","City":"Maxwell","Region":"Nebraska","Weather Factors":"Unknown","Tags":"City","Country":"United States","Case Number":"49552","Date of the Event":"08/05/2013 12:00 UTC","Latitude":"41.07785","Log Number":"US-08062013-0034","Summary":"Amazing, like they didn't care that we were watching them. Seemed as though they were looking for something."}