{"map":"<A HREF = \"http://maps.google.com/maps?q=-28.01726,+153.425699(49562)&iwloc=A&hl=en\"> mufon case (49562) map </A>","Log Number":"AU-08072013-0003","Date of the Event":"08/07/2013 12:00 UTC","trends":["There have been 2 other sightings in Gold Coast","There were no other sightings in Gold Coast on or around August 7th 2013"],"Object Flight Path":"Straight-line path","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/49562.html.txt","/var/www/straped/mufon/org/49562.html"],"Summary":"observed 3 lights, equidistant, approximately 1 min apart in clear daylight. appeared LED-like, moving in a straight trajectory, fading into the distance.","Country":"Australia","divs":["Sighting DetailsI was waiting for the bus at Varsity Lakes station when I noticed a muted LED type light flying at cruise speed in a northerly direction. At first I assumed it was a light airplane, with the sun reflecting off it, as it was a beautiful, clear winter afternoon. I've observed that phenomena before, but usually when the plane passes it will change shading according to its relation to the sun. This was a constant glow. A minute later, a second identical object passed over, following the exact same trajectory. I then saw a third and got a better look as it was closer to my position. It seemed to either be rotating its light or there may have been a couple flicking in sequence, on the same object. I also noticed a kind of blur or heat effect around it. All three light travelled until I lost visibility. No sound. Hardly any breeze, as I mentioned a clear and warm afternoon, especially for winter. I would love to know if anyone else saw these."],"Source":"MUFON","Weather Factors":"Unknown","Latitude":"-28.01726","Sighting Duration":"Undisclosed","Object Features":"Unknown","Object Shape":"Unknown","Tags":"City","Case Number":"49562","Disposition":"Unresolved","Date Submitted":"08/07/2013 04:36 UTC","Region":"Queensland","Longitude":"153.425699","City":"Gold Coast"}