{"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=47.61561,+-122.329601(49563)&iwloc=A&hl=en\"> mufon case (49563) map </A>","Log Number":"US-08072013-0004","Object Shape":"Circle","Sighting Duration":"Undisclosed","City":"Seattle","trends":["There have been 110 other sightings in Seattle","There were no other sightings in Seattle on or around August 6th 2013"],"Source":"MUFON","Longitude":"-122.329601","Latitude":"47.61561","Date Submitted":"08/07/2013 05:28 UTC","Viewing Distance":"Over One Mile","Summary":"Glowing orb observed heading NE then abroptly changed to east before disappearing over tree line","Case Number":"49563","Disposition":"Unresolved","divs":["Sighting DetailsWe were meeting with a friend at the park standing aroun talking and watching the sky smoking a cigarette when one of us noticed something strange moving almost like a satellite. It was noticed because it was the brightest object in the sky. At first we thought it to be a satellite, before notching it was to low ad moving to fast. The object was round in shape with a blueish-white glow, it was roughly twice the size of any star in the sky. It made no sound and its light did not pulsate or twinkle. It was traveling about three times that of a satellite and was going in a straight line before changing course. It was observed coming from the SW heading NE before heading due East. When we first realized we were seeing something we were shocked we had never seen anything like this before and couldn't believe we were seeig something we could not explain. I attempted to film the object but with only my iPhone I was not able to capture the light. We lost sight of the object after it changed course and headed east over the tree line."],"files":["/var/www/straped/mufon/html2text/49563.html.txt","/var/www/straped/mufon/org/49563.html"],"Date of the Event":"08/06/2013 10:40 UTC","Region":"Washington","Object Features":"Unknown","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Tags":"City"}