{"Disposition":"Unresolved","Country":"United States","Latitude":"37.567985","Object Shape":"Unknown","Date Submitted":"08/07/2013 06:10 UTC","Longitude":"-85.671036","Object Flight Path":"Path with directional change,Path then hovering","Log Number":"US-08072013-0006","Tags":"City","files":["/var/www/straped/mufon/html2text/49565.html.txt","/var/www/straped/mufon/org/49565.html"],"trends":["There have been no other sightings in Hodgenville","This sighting has been favorited 2 times."],"Source":"MUFON","Region":"Kentucky","divs":["Sighting DetailsI was on my uncle's back porch smoking a cigarette, looking at the sky because it is pitch black on his property. I was looking for UFO's because in FL there is too much light pollution. I noticed several planes in the area because it is near Fort Knox. I kept noticing what appeared to be stars darting around the sky. I focused on a particularly bright one and it began to move. I couldn't tell exactly how far from Earth it was, whether it was in our atmosphere or just above it, but I could make out the object very clearly regardless. The object would come to a complete stop in the sky before darting either forwards, backwards, or sideways, and then returning to a complete stop. It seemed to be pulsating, with every color in the spectrum being emitted from the craft. I don't know exactly how large the craft was, but it appeared to be roughly the size of a small plane. After it would move, a faint trail could be seen behind it briefly before it dissipated. I have been waiting to see a UFO for about a decade now, and I was freaking out. I ran inside and told my mom, \"Hurry, come outside right now, I have to show you something.\" I came back outside with her and the object was still near the same spot where I had seen it before. I told my Mom to look at the light and follow it closely. She observed the same thing that I did. She said it looked like, \"minnows in a stream\". I noticed several other objects in the surrounding sky imitating the same behavior. My mother also saw them. I am 27 years old with excellent eyesight, and she is 59 with pretty bad eyesight, and she could still clearly see this craft moving in the sky. It was most certainly NOT a plane or jet or helicopter or any craft known to the people of this world. After observing the craft for several minutes, we went inside. I came back outside about a half hour later, and the original craft I had been watching was gone, but I noticed several others. I was overwhelmed with excitement and did not sleep at all that night."],"Weather Factors":"Unknown","Summary":"Objects darting quickly in sky then coming to complete stop, then darting in other directions, stopping, repeating.","map":"<A HREF = \"http://maps.google.com/maps?q=37.567985,+-85.671036(49565)&iwloc=A&hl=en\"> mufon case (49565) map </A>","Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Date of the Event":"08/06/2013 11:00 UTC","City":"Hodgenville","Case Number":"49565"}