{"Sighting Duration":"01:00:00","City":"Hagerstown","Longitude":"-77.731615","Viewing Distance":"20 Feet or Less","Date Submitted":"08/07/2013 07:00 UTC","divs":["Sighting DetailsNow I know this is gonna sound crazy but this is what happened to me and my cousin about 1990. I lived in a Housing Project in Maryland at he time. There was a playground that consisted of a swing set and a tube slide. It was situated behind my cousin's house below a hill. Included was asphalt basketball court about 15 directly in front of it. Behind the playground was a railroad yard that had a fence blocking it off from the housing project. The time was about a little after 8pm you could see the sun was in the process of setting. Me and my female cousin who was about 9 or 10 at the time . I was walking over to my aunts house when I seen my cousin on the swing-set. I proceeded to walk over and get on the other swing. On the basketball court about 75 feet from where we were swinging there was 3 guys who had set up a ramp with a piece of ply-board and a cinder block. They had A old dirt-bike and jumping the ramp. As we were swinging I leaned way back on the swing and that was when I noticed the object. Behind us and about a couple hundred feet above the railroad yard was a glowing ball of light. I stopped swinging and turned while still sitting on the swing to see the object and that is when it came toward us at a high rate of speed. The ball descended as it approached us till it was directly in front of us about five feet.The ball was a little bit bigger than a basketball. I don't understand this till this day but me and my cousin didn't react at all. We didn't even say anything we just stared at this ball of light that was rapidly changing colors. I turned every color in the the color spectrum We continued to stare at the object and it began to come toward us then go between us then circle around us then stop back in front of us. There was a sudden flash of white light and it was gone. When the object was going around us the guys riding the dirt-bike didn't seem to notice this happening. But I could see them because as the ball went around us we continued to stare straight ahead. After the flash the guys were gone and it was almost dark. I didn't understand what happened and just sat on the swing. I know it doesn't make sense but me and my cousin didn't even say one word to each other. We just got off the swings and started to walk to our homes. For some reason I never said one word about this to anyone till 1998 when I seen my cousin at her brother's house. For some reason it just didn't seem like a big deal. Over the years I convinced myself it was a dream. I asked my cousin just straight out Do you remember when we were kids and before I could finish my words she finished them for me. She said when we seen that ball of light. We both just stared at each other for about about a couple of seconds and both repeated I thought that was a dream. She asked me what it was and I said I have no idea. We continued to compare memories and they we ex-actually the same. Sadly she was killed in 1999 in a car accident. I never got another chance to speak to her about it. I never got to see her that much as we grew older we grew apart. I have never told anyone about this but my wife. I had some other weird things happen to me when I was a kid before this incident but it would take me to long to write about it. I have a 6 year old daughter and she had recently told me of a dream she had of blue aliens in blue jump suits like on cartoons coming to her and taking her and me with them. She said they were nice to us. I don't remember this but I know my daughter she may only be 6 buy she doesn't lie or make up stories. Well that's my story belive it or not but I know it happened. I think me and my cousin may have lost about 45 minutes between when we first seen the object and then the white flash. But I asked her and we both don't remember anything."],"Source":"MUFON","Object Features":"None","Country":"United States","trends":["There have been 10 other sightings in Hagerstown","There were no other sightings in Hagerstown on or around July 10th 1990"],"Region":"Maryland","Log Number":"US-08072013-0020","files":["/var/www/straped/mufon/html2text/49579.html.txt","/var/www/straped/mufon/org/49579.html"],"Disposition":"Unresolved","Tags":"City","Case Number":"49579","Weather Factors":"Unknown","Summary":"Multiple Colored ball of Light","map":"<A HREF = \"http://maps.google.com/maps?q=39.645667,+-77.731615(49579)&iwloc=A&hl=en\"> mufon case (49579) map </A>","Object Shape":"Circle","Latitude":"39.645667","Date of the Event":"07/10/1990 08:00 UTC","Object Flight Path":"Path with directional change,Path then hovering"}