{"Viewing Distance":"21-100 Feet, 501 Feet - 1 Mile, Over 1 Mile","Longitude":"-122.623666","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/49575.html.txt","/var/www/straped/mufon/org/49575.html"],"Date of the Event":"08/06/2013 12:00 UTC","Latitude":"47.5735","Source":"MUFON","Summary":"Daylight object observed near my apartment. Whitish/grey with blurred \"field\" surrounding it. Went forward and backwards, hovering and then disappearing behind trees. Heavy UFO activity later on at night, accompanied by jets and lots of helicopters.","Disposition":"Unresolved","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering,Other","divs":["Sighting DetailsEarlier in the day as I stepped outside my apartment, I observed what I at first thought was a seagull flying through the skies in front of me until it caught my attention by stopping and going backwards and hovering then going forward then stopping and going backwards again before taking off behind the trees out of sight. Nothing else unusual was seen until approximately 10:45 p.m. that night when my son, Justin, and I went for our nighttime jog at the bremerton highschool track nearby. We walked a lap before jogging and during the second lap we noticed a very bright, star-like object appear out of nowhere in the sky directly ahead of us, moving slowly east and changing directions coming right towards where we were at almost as though it knew we were there. It slowly approached and hovered right above us, glowing intensely for approximately 3 minutes before slowly moving northwesterly. Justin videotaped the object as it approached us and hovered above us, until it could no longer be seen. About a couple minutes soon afterwards, a helicopter came from the direction the object appeared initially and a second helicopter approached from the direction where the object was last seen. Two more helicopters were seen in the distance nearby. About 5 minutes later as we continued with our jog around the lap, we saw what I can only describe as an electrical arc \"smudge\" flashed in the sky to the right of us a short distance away. Then an object appeared from where the flash was seen from the \"smudge\" and it slowly moved northeasterly and disappeared. Sporadic flashes were seen and we observed 2 jets approaching quickly towards the area where the helicopters were at, which there were now at least 6-8 of them. As we were leaving, we observed another object moving in the skies while we were sitting in the car, so we decided to drive to an area without lights so we can pull over and watch the activity going on. We stood near the Warren Ave. bridge in a residential area by the waterside where we had a great view of the whole city. I am not exaggerating when I say that the scene now was like as though we were under attack. It looked like something huge was happening and the helicopters were the news crew filming. It was crazy. We then noticed a formation of 5 objects in a sloping pattern, equally distanced apart from each other. The slope was like the curve if you were to connect the dots to 3 o'clock, 4 o'clock, all the way up to 7 o.clock on a clock face. It spanned about maybe 3-4 miles in length up in the sky. It was hard to tell exactly how long it was. And flashes of light were coming from the space between each object in the formation. It was not a huge craft. It appeared to just be a formation. Flashes and sporadic fireballs in reds and blues appeared randomly and 1 stationary pulsating greenish white object hovering to the north very low, maybe treetops height, maybe only 2 miles away. The helicopters were hovering, seemingly observing these objects. There were about 4 jets in total that came to the area. Objects appeared out of nowhere, disappeared and reappeared and some glowed intensely before rapidly ascending into the sky. We counted more than 20 objects in the area not including the formation. We left after observing the action for a good hour. Unfortunately our cell phones died. Not sure if it had anything to do with phenomena. My phone had power but was not turning on. I was going to listen to music while jogging. I also have to mention a weird occurrence when we first got to the track, prior to our experiences. Not sure if it is anything but it was kind of scary. When we stepped down into the field track from the entrance stairs, we saw a husky-build male walking slowly with his head down, looking at the ground. With the lights overhead we can only see his silhouette. We stood there as he approached near us, still walking in the lap looking down. I said, \"Hello,\" to the man. He looked up but didn't say anything and he had an angry, almost menacing look on his face. He scowled at us and looked away, I told Justin that maybe he had headphones on or something and just didn't hear us, though I could see that he didn't. My son asked me if we should just come back another night because he was somewhat nervous about being around that creepy man. I said we'd be fine. And when the guy was a short distance in front of us, we proceeded to walk around the lap to warm up. We spotted another hefty-looking silouhette of another possible male, sitting in the dark just ahead on the grass next to the track. We never saw this guy in detail. What was strange was the fact that as the first man neared where that guy sat, they seemed to have both just vanish. We were not too far behind them and I don't recall seeing the two men together at all. There was enough lighting to see but it is still dim there at night. Nevertheless, we still would have been able to see them. We were keeping an eye on them just to be safe. We were hesitant to even be there after that creepy encounter when we first got there. I asked Justin if he saw where they went to and he didn't. We don't know how they disappeared or where they went. It was unnerving. I'm thinking we're going to get jumped, attacked, or whatever. That first guy seemed like a mean person. Not friendly at all. He wore regular jeans and a t-shirt. He didn't look like the typical person one would encounter doing laps around a track. And now we were thinking he's got an accomplice and they're both somewhere in the dark, watching us. But I'm telling you! I never took my eyes off of them. But they just seemed to have just vanished into thin air. I am a woman, in a dark place at night. I wasn't alone, but still, I was being very aware of my surroundings. My son and I were really tripping the whole time we were there. We were constantly looking all around us, expecting them to pop out at us at any given moment. And the other weird thing that night, was the fact that I was in the middle of telling Justin a story about 2 UFOs that swooped down fast and came right to me, and I was pointing to where they were at the time in the sky, and coincidentally, it was the same exact spot where the star-like object appeared and hovered over me and Justin that night! The night's activity remained active even after my son dropped me off at my apartment. From the front patio, an object appeared and ascended slowly right behind the trees down the street, along with another helicopter. My neighbor came out to smoke a cigarette, and asked how my jog went with my son. I told her the crazy story and even pointed out the object just in front of us. She went to get her boyfriend, and they both witnessed the flashes, and objects appearing and disappearing, and moving in the skies and even the pulsating object that appeared from behind the trees. I told them about the 5 object formation and took them to the street to see if we can see it, and sure enough, there it was. They witnessed a few flashes and several objects, in the way I had described them happening. We observed the hovering object through my binoculars. It was pulsating green and white. And only through the binoculars, we also was able to see objects moving through the skies that we couldn't see with our naked eyes. As I write this report which is the 7th on the following day in the afternoon, there is a helicopter hovering above the highschool which is where Justin and I went jogging. Also observed a strange drone-like plane with a green nose, white body, flying directly overhead."],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=47.5735,+-122.623666(49575)&iwloc=A&hl=en\"> mufon case (49575) map </A>","Case Number":"49575","Country":"United States","City":"Bremerton","Log Number":"US-08072013-0016","Date Submitted":"08/07/2013 04:12 UTC","Weather Factors":"Unknown","trends":["There have been 19 other sightings in Bremerton","There were no other sightings in Bremerton on or around August 6th 2013"],"Object Features":"Unknown","Object Shape":"Circle, Diamond, Fireball, Flash, Sphere, Star-like, Other","Region":"Washington"}