{"Source":"MUFON","trends":["There have been 7 other sightings in Fowler","There were no other sightings in Fowler on or around August 6th 2013"],"Object Shape":"Star-like","Tags":"City","Object Flight Path":"Straight-line path,Path with directional change","divs":["sighting details august 6 2013 i saw another star like object by my home. i live in the country in fowler,ca. before this i was able to see three more just like it. they usually come around the same time after 9:00 pm. sometimes you just never know when they will come. so, i wait looking up at the night sky. it usually happens when i notice a gold star that shows up then slowly it descends down towards me\\house. it then looks bigger and a little brighter. then, it veers off a little heading over the grape vineyards heading ne keeping the same slow speed. it's not an orb with colors. it's not a white solid dot in the sky that zig zags around or hovers. it does not flash and is not a drone. it just looks like a star with those points of light extending out like a star would look in the night sky. i happened to see my first one a few months back it was even lower i would say not over two telephone poles high. but, that first star like object was all white not gold like these others and these are not shooting stars. i cannot find anything similar on the web. i did witness the same object earlier during this week that was so large and descending down again towards my home that i thought it was going to hit the house. i think i am seeing something different and amazing. is this a natural phenomenon or something else? i do not own a video camera or i would show a video. i hope i will be able to borrow one soon. this is truly an amazing sight to see. i see other things in the sky but, i will save for another time. thank you."],"Date Submitted":"08/07/2013 07:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.631946,+-119.67472(49578)&iwloc=A&hl=en\"> mufon case (49578) map </A>","Disposition":"Unresolved","Log Number":"US-08072013-0019","Case Number":"49578","Sighting Duration":"Undisclosed","Object Features":"None","Region":"California","Weather Factors":"Unknown","Viewing Distance":"21-100 Feet","Date of the Event":"08/06/2013 09:12 UTC","Latitude":"36.631946","Summary":"Looked like a gold star with those points of light. No sound. kept same speed slow, gliding gracefully over the grape vineyards. Object looked very lightweight. Maybe the size of a small car or so. No colored lights. Was glowing like a star.","Longitude":"-119.67472","City":"Fowler","files":["/var/www/straped/mufon/html2text/49578.html.txt","/var/www/straped/mufon/org/49578.html"],"Country":"United States"}