{"Weather Factors":"Unknown","Object Shape":"Circle, Sphere","Latitude":"43.022799","files":["/var/www/straped/mufon/html2text/49572.html.txt","/var/www/straped/mufon/org/49572.html"],"Longitude":"-70.732932","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Country":"United States","Object Features":"Unknown","Source":"MUFON","Region":"New Hampshire","divs":["Sighting DetailsOn the night of August 6th, 2013 approximately around 10:10PM I was sitting outside on the cordless phone. The night skies were clear and all that can be seen were stars, an occasional airplane and a satellite far off in the distance. I had first viewed this very bright and bold orange light that was just above the sea grass that borders the marsh. This grass is about 12ft tall and from my sitting position I would guess it was maybe 35 degrees or more from the horizon. Just a guess not exactly sure the exact position. At first I thought I could have been a plane but the color was too bright and big to be that of a plane. The object moved from east to west and at times sped up and also stopped and hovered. Then it would move again and eventually the light would dim and vanish. After the first light came several others. One at a time and some in groups of three or four. All totaling about maybe a dozen. Some of these lights seemed to chase after one another. Always moved in same direction from east to west. Some of these lights again would move at a great rate of speed....then stop and be motionless and then move again. One point was two of these lights hovering one above the other after the trailing light has chased and caught up to the one in front of it. This all occurred for approx. 20-30 minutes and came in intervals. They all were in the same flight path or trajectory of their movement in the sky. All were not at the same altitude. I had no idea of what I was looking at and amazed at what I had seen. I remember seeing such a bright orange light such as this when I was just a small child perhaps 6-8 years old. All of these objects had either left at such a rate of speed that the lights dimmed and vanished or the bright light just disappeared completely like a light switch."],"City":"Rye","Case Number":"49572","Tags":"City","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=43.022799,+-70.732932(49572)&iwloc=A&hl=en\"> mufon case (49572) map </A>","Date Submitted":"08/07/2013 02:01 UTC","Log Number":"US-08072013-0013","Summary":"Bright orange lights viewed in northern position traveling east to west. Seem to chase/follow/hover then dim and disappear in similar patterns","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","trends":["There has been one other sighting in Rye","There were no other sightings in Rye on or around August 6th 2013"],"Date of the Event":"08/06/2013 10:10 UTC"}