{"Object Flight Path":"Hovering then path,Straight-line path","Date Submitted":"08/07/2013 01:27 UTC","files":["/var/www/straped/mufon/html2text/49571.html.txt","/var/www/straped/mufon/org/49571.html"],"Case Number":"49571","trends":["There has been one other sighting in Braggs","There were no other sightings in Braggs on or around August 6th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.670541,+-95.195687(49571)&iwloc=A&hl=en\"> mufon case (49571) map </A>","Tags":"City","Source":"MUFON","Country":"United States","divs":["Sighting DetailsI went into another room around 10 pm and glanced out the northern window and noticed the stars were really bright outside. I thought about the brightness and decided to get my binoculars out and see what I could see. I saw around 10 objects in the sky and particularly 3 objects, perhaps slightly triangle in shape and the size of an aspirin with the binoculars They appeared to look stationary in the sky. So, what I saw was 3 objects that were round balls of bright white light that would dim and blink off, but not at the same time and it appeared to have a rhythm. The other 7 were separate and away from the rest which did the same but were not grouped together in any way. At first I thought the 3 were stationary, but they were not they were moving north and east ultra slowly. I live near Camp Gruber which is the training center for the National Guard and wondered if perhaps they had something to do with this? This did not bother me at all, after watching for around 1 hour I went to bed. My digital camera's battery was needing a recharge so I did not get any pictures of this. I decided to report this anyway. During the night I got up and went to get a drink and there was nothing in the sky but stars at 3 am. I do believe I will watch the sky a whole lot more than I am doing.. for it is becoming very interesting."],"Sighting Duration":"01:00:00","Date of the Event":"08/06/2013 10:10 UTC","Object Shape":"Sphere","Log Number":"US-08072013-0012","Disposition":"Unresolved","Summary":"I saw around 10 white orbs in the sky, I think that is what they are called.","Object Features":"None, Unknown","Longitude":"-95.195687","City":"Braggs","Region":"Oklahoma","Weather Factors":"Unknown","Viewing Distance":"Unknown","Latitude":"35.670541"}