{"divs":["Sighting Details1. Where were you and what were you doing at the time?At that time we were preparing to travel 2. What made you first notice the object? we were warned that approaching lights were coming from the north 3. What did you think the object was when you first noticed it?It was impressive to see many rose I see achieved for 20 seconds before it was lost 4. Describe the object and its actions and motions in detail I saw a very large light yellow oval 2400 feet long by 600 feet high moving from the north to the northeast without noise and the light were coming behind seven smaller lights of blue and red without noise the red up and blue flying very neatly down I was about 8-10 kilometers away latitude -18.053844 longitude coordinates -69.201639 at 4,400 meters above sea level 5. Describe your feelings, reactions and actions, during and after sighting the objectI was impressed and thoughtful also proposed to send a vehicle to the area to investigate but it was not possible because there are no roads in that part of the world 6. How did you lose sight of the object? The objects followed a straight path and got lost in the mountains to the East"],"Disposition":"Unresolved","Viewing Distance":"Over One Mile","Date Submitted":"08/07/2013 03:01 UTC","Summary":"Big yellow light followed by 7 Lights blue and red colors","Country":"Chile","Region":"Arica and Parinacota Region","Tags":"City","City":"Putre","Log Number":"CL-08072013-0015","Case Number":"49574","Latitude":"-18.055347","Longitude":"-69.203518","files":["/var/www/straped/mufon/html2text/49574.html.txt","/var/www/straped/mufon/org/49574.html"],"Sighting Duration":"Undisclosed","Object Features":"None","Date of the Event":"08/10/1979 02:30 UTC","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","trends":["There have been no other sightings in Putre","This sighting has never been favorited."],"Object Shape":"Oval","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=-18.055347,+-69.203518(49574)&iwloc=A&hl=en\"> mufon case (49574) map </A>"}