{"Object Flight Path":"Path with directional change,Path then hovering","Viewing Distance":"Over One Mile","Disposition":"Unresolved","trends":["There have been 21 other sightings in Homestead","There were no other sightings in Homestead on or around August 7th 2013","This sighting has never been favorited.",""],"Log Number":"US-08072013-0024","divs":["sighting detailsi am a united states air force dual qualified weather observer\\forecaster and was on duty at homestead air reserve base when i decided to go outside to have a cigarette by the flightline; i noticed a glowing light to my ne, initially thinking it was either a satellite or a meteor. it was moving to slow to be a meteor, so i thought it to be a satellite glowing due to the sun angle and aparent height of the object (i often watch satellites at night). the object created a bow wave *) in front of it then broke into 3 distinct parts, 1 large and 2 small with the large in the front. the large object remained illuminated whitish while the 2 small objects appeared to blink off and on in a red\\orange-ish color, opposite of each other yet with a regular pattern. continuing in a north to south route the objects created another bow wave *) as it appeared to slow. by this point the 3 objects were due east of my location, the bow wave *) subsided as the objects reached a se direction from where i was observing and appeared to stop momentarily before proceeding e and out of sight. a glowing noctilucent cloud remained where the object initially appeared to enter the atmosphere and create the first bow wave *), i stayed for 15 minutes as the noctilucent cloud slowly dissipated. i have never observed anything like this before."],"Source":"MUFON","Case Number":"49584","Region":"Florida","Summary":"Initially thought it was a satellite or meteor moving N to S, broke into 3 pieces slowed and turned E","files":["/var/www/straped/mufon/html2text/49584.html.txt","/var/www/straped/mufon/org/49584.html"],"Object Features":"Unknown","Sighting Duration":"00:10:00","map":"<A HREF = \"http://maps.google.com/maps?q=25.495475,+-80.396005(49584)&iwloc=A&hl=en\"> mufon case (49584) map </A>","Country":"United States","City":"Homestead","Tags":"City","Date of the Event":"08/07/2013 08:45 UTC","Longitude":"-80.396005","Object Shape":"Circle, Sphere, Star-like","Date Submitted":"08/07/2013 09:37 UTC","Weather Factors":"Unknown","Latitude":"25.495475"}