{"map":"<A HREF = \"http://maps.google.com/maps?q=28.99746,+-82.003415(49583)&iwloc=A&hl=en\"> mufon case (49583) map </A>","divs":["Sighting DetailsAs an amatuer astronomer, I am aware of planetary positions and moon phases, without even looking; On wednesday, August 7, 2013, I lay prostrate on my driveway at dusk at 8:25 PM EASTERN and my 9 yr old son came outside to lay down next to me a few minutes later. About 8:30 PM, he looked east toward where we have watched shuttle launches, at about the same angle, and he saw a bright orange sphere that I would guess was 100 miles over the Atlantic. I first thought it could not be an airplane and was confused that it surely was not a planet, being slightly larger and much brighter. I am familiar with the landing patterns and paths the airlines take toward Orlando on a daily basis, over me. There has NEVER been an airline or object other than the shuttle travel out that direction. I wondered if it was planetary but it began to descend slowly. My son stood up to follow it descend and suddenly two more dimmer and smaller spheres appeared very close to the original object and moved very close to the original object. Then another appeared closely above, more dim; I ran in to get the video camera. My duaghter, wife and son all observed the phenomenon. The smaller ones moved very close to the original shpere. They started to dim and descend. They were not chinese lanterns. These were distant objects. I HAVE VIDEO of the latter. It just happend about 30 minutews ago. I will post on YOUTUBE with UFO over ATLANTIC EAST OF Daytona Beach. I will own the rights to the video and it cannot be used without permission."],"Object Shape":"Sphere","Region":"Florida","Date of the Event":"08/07/2013 08:30 UTC","Object Features":"Unknown","trends":["There have been no other sightings in Summerfield","This sighting has never been favorited."],"Date Submitted":"08/07/2013 09:15 UTC","Viewing Distance":"Over One Mile","Sighting Duration":"00:07:01","Summary":"As an amatuer astronomer, I KNOW my planets, sky etc. Poss.over Atlantic; Large orange sphere; 3-4 others appeared and moverd randomly; awesome!","Source":"MUFON","Object Flight Path":"Hovering then path","Case Number":"49583","City":"Summerfield","Weather Factors":"Unknown","Longitude":"-82.003415","Country":"United States","Tags":"City","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/49583.html.txt","/var/www/straped/mufon/org/49583.html"],"Log Number":"US-08072013-0023","Latitude":"28.99746"}