{"files":["/var/www/straped/mufon/html2text/49588.html.txt","/var/www/straped/mufon/org/49588.html"],"Object Flight Path":"Straight-line path","Object Shape":"Oval","Date of the Event":"08/07/2013 08:46 UTC","City":"Ashland","Case Number":"49588","map":"<A HREF = \"http://maps.google.com/maps?q=43.697516,+-71.633393(49588)&iwloc=A&hl=en\"> mufon case (49588) map </A>","Date Submitted":"08/07/2013 10:32 UTC","Country":"United States","Tags":"City","divs":["Sighting DetailsSitting outside in chair chatting with my neice when I noticed what I originally thought was a meteorite but this object had a prolonged existence, no tail or vapor and was traveling horizontally northerly. Asked my neice if she sees the shooting star but we both realized simultaneously it wasn't a shooting star- Large white sun like object but more oval shaped size of my thumb in horizon., I ran down driveway and object continued in its northerly horizontal flight but actually sped up( blipped across horizon and then out of site). I realized at that time that this was not ordinary man made object..Also curious that there wasn't a hint of sound nor vapor trail and the speed in which this object traveled was un-earthlike. Entire event was over within 15 seconds but we are not sure if our time was affected as when I asked my niece what current time was she said it was 09:05 PM but the event happened just as dusk was happening and that was actually around 08:36 PM or so.. Whether we lost time in the event and excitement bewilderment of what we had seen or just from that we had just witnessed but it didn't seem like 20 minutes or more went by.."],"Source":"MUFON","Latitude":"43.697516","Region":"New Hampshire","trends":["There has been one other sighting in Ashland","There were no other sightings in Ashland on or around August 7th 2013"],"Object Features":"Dome","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Longitude":"-71.633393","Weather Factors":"Unknown","Summary":"Just before dusk saw large light object that was traveling across the horizon at enormous speed","Log Number":"US-08072013-0028"}