{"Summary":"A super fast light raced towards us in at my mother's property in N.AZ. It reached us and decended. Mother and I walked toward it. It ascended forming a large cloud in front of light. We could see light through cloud. It slowly ascended and vanished.","Region":"Arizona","Source":"MUFON","trends":["There has been one other sighting in Snowflake","There were no other sightings in Snowflake on or around August 28th 1992"],"divs":["Sighting DetailsMother and I were sitting in front of the barn on her property in Northern AZ It was about 9pm and it was the end of Aug. We saw a bright light quickly racing towards us from the SW horizon. I thought it was an airplane coming in towards the barn to clip it's wheels on the roof to help it slow down to crash land. I was so scared and I screamed at mother to RUN behind the barn, that it was an airplane going to crash. Mother didn't think it was an airplane. She wasn't scared. She was fascinated! Just as I thought we were going to die, it came to an abrupt stop very close to us. It wasn't very high now that it reached us. It stopped in mid air about 20ft away. It was hovering low. I thought I was going to have cardiac arrest until it had stopped. I said to mother, \"That's not an airplane\" then together we said, \"It's a UFO!\" Mother began walking towards it ahead of me. We were astonished! This huge illuminating light pulsated directly in front of us as it hover there. Though the light was huge in the sky it didn't light the ground. As it descended towards the ground mother and I tried to run to it but we had to be careful of the brush on the raw prairie land. I was no longer frightened and we wanted to get close to it, to see what it was, what it looked like, but just as we got close it began to slowly ascend forming a cloud in front of it. It continued to slowly ascent upward but we could still see the light through the cloud only it wasn't as bright,it had dulled through the cloudy cigar shaped vapor. Right before our eyes we watched this glowing light through the cloud as it ascended. As it slowly ascended the light got smaller and the cloud got smaller and it kept getting smaller and smaller until poof....it was gone. We were so disappointed that it had ascended upwards before we could get close enough to get a real good look at it. Mother and I were amazed that we had a close encounter and we still are amazed. One thing troubles us though, we remember the light coming and then leaving but we don't remember what we did after it left. I don't know why we didn't call the sheriff to report such an incredible experience. Before this UFO sighting, I didn't believe in UFO's, but I'm a true believer now! Mother and I were two women alone out beneath the sparkling stars in the open wilderness where mother's home is. Still to this day I can look up in the sky outside mother's home and see strange lights moving around. I want to know what this UFO is. I have since seen the movie 'FIRE in the SKY' about a young man living in Snowflake AZ who claims to have been abducted. What Travis Walton describes he and his buddies saw, is a lot like what mother and I witnessed and they were both in close proximity. Delaine Snyder"],"City":"Snowflake","Country":"United States","Log Number":"US-08072013-0022","Object Shape":"Blimp, Cigar, Sphere","Object Flight Path":"Straight-line path","Latitude":"34.588655","Disposition":"Unresolved","Date of the Event":"08/28/1992 09:00 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/49581.html.txt","/var/www/straped/mufon/org/49581.html"],"Object Features":"None","Tags":"City","Longitude":"-109.99768","Viewing Distance":"20 Feet or Less","Case Number":"49581","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.588655,+-109.99768(49581)&iwloc=A&hl=en\"> mufon case (49581) map </A>","Date Submitted":"08/07/2013 07:25 UTC"}