{"files":["/var/www/straped/mufon/html2text/49597.html.txt","/var/www/straped/mufon/org/49597.html"],"Source":"MUFON","Case Number":"49597","Sighting Duration":"Undisclosed","Log Number":"US-08082013-0004","map":"<A HREF = \"http://maps.google.com/maps?q=33.643825,+-117.593864(49597)&iwloc=A&hl=en\"> mufon case (49597) map </A>","City":"Rancho Santa Margarita","Region":"California","Object Shape":"Circle, Unknown","divs":["sighting detailsmy wife and i just went out for a walk tonight around our lake in rancho santa margarita, like we normally do. we noticed the night was beautiful and full of stars. just as we started our walk, i looked up in south-east direction and instantly saw a slow-moving red-orange light that moved slowly in north-west direction, so i thought it was a chopper. i kept looking though, cause it was not looking like a typical chopper with a spotlight at night, and had absolutely no sound. it appeared to be way up higher than choppers would normally fly, probably higher than typical plane path too. most noticeable thing about it was that the bright red-orange light was flickering\\wavering a lot, again, nothing like what you'd see from a chopper. almost like an optical distortion, not a deliberate pulsating. so it moved slowly for a few seconds, then slowed down to an almost stop, then dimmed, turned into a light much smaller and dark blue\\violet color. the disappeared. literally just a few steps down the lake we saw a family of women with bunch of girls looking up in wonder discussing the same thing. i know for a fact i was not the only one that saw it last night."],"trends":["There have been 2 other sightings in Rancho Santa Margarita","There were no other sightings in Rancho Santa Margarita on or around August 7th 2013"],"Viewing Distance":"Unknown","Date of the Event":"08/07/2013 08:40 UTC","Object Features":"Unknown","Object Flight Path":"Path with directional change,Path then hovering,Other","Summary":"Bright wavering red-orange light moving slowly and silently around 8:40pm PT","Disposition":"Unresolved","Tags":"City","Country":"United States","Longitude":"-117.593864","Latitude":"33.643825","Date Submitted":"08/08/2013 02:37 UTC","Weather Factors":"Unknown"}