{"Date of the Event":"07/17/2013 01:50 UTC","Object Shape":"Egg, Oval, Teardrop, Triangle","Country":"United States","Sighting Duration":"Undisclosed","Object Features":"Window(s), Patterned Surface","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering,Other","Summary":"took dog out at150 am spotted triange turned to get wife (2nd Witness) saw amazing 2nd craft lights were eminating from within glass lue Gold purple b re","Case Number":"49596","Region":"Tennessee","Source":"MUFON","files":["/var/www/straped/mufon/html2text/49596.html.txt","/var/www/straped/mufon/org/49596.html"],"trends":["There have been 2 other sightings in Roan Mountain","There were no other sightings in Roan Mountain on or around July 17th 2013"],"Weather Factors":"Unknown","City":"Roan Mountain","map":"<A HREF = \"http://maps.google.com/maps?q=36.150053,+-82.117009(49596)&iwloc=A&hl=en\"> mufon case (49596) map </A>","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Latitude":"36.150053","Longitude":"-82.117009","divs":["Sighting Details My interest in ufology began in 1973 my friends saw a ufo fly directly over the 1955 chevy as we returned from a jv football game.We stopped,as did two other cars I stepped out of the car as my friends were screaming for me toreturn,but I just had to seeI pulled a full on Walton! I could have hit it with a rock and Ray Charles could've seen it wasn't from here. I have seen them since then but I never acknowledge unless I have a second witness with a solid reputation. On the 17th of july took my dog out for a 1:00am pee since 1973 I've made a habit of looking up (more sightings would see them if they would only look up.I looked up on the 17th saw 3 stars in a triangle ,they began to rotates slowly Instantly I cried out for my wife who always believed me but had never seen a ufo of her own afraid she didn't hear me I bolted for the back door and was nearly shocked senseless all the time I was looking at the high altitude triangle there was a pink floyd lightshow going on behind my back to the west! I froze and starred for a good two minutes then ,Oh yeah!! Wife!! I Ran full speed to our bedroom and said Come quick outside!!! UFsaucers!!FLYIN'os HURRY I turned the lights off so I could get the clearest view .My wife joined me also DUMBFOUNDED and amazed. The three Min.B4 my wife joined me this Glass covered luminous peacock ascended straight up 1500 ft. in less than 2 seconds then right angle acrobatics that were truly looked impossible did a little dance in the skyI screamed Get the binoculars and my eyes were seeing a most unusual sight it was now hovering just above the trees close enough to illuminate the tops of the trees a mile or less away above the Appalachian trail, on the N.C-Tn.border. The field glasses revealed a glass house silently hovering shaped more like an oblong melon but with glass panels that resembled a diamond cut style with brilliant constant light no strobe lights at all the lights that were emanating from under the transparent skin all the lights were represented."],"Log Number":"US-08082013-0003","Date Submitted":"08/08/2013 02:37 UTC","Disposition":"Unresolved"}