{"Latitude":"-41.294778","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=-41.294778,+174.823368(49598)&iwloc=A&hl=en\"> mufon case (49598) map </A>","Source":"MUFON","trends":["There have been 2 other sightings in Wellington","There were no other sightings in Wellington on or around August 7th 2013"],"Summary":"White orb pulsed and then took off","Viewing Distance":"Over One Mile","Object Flight Path":"Hovering then path,Path with directional change","Longitude":"174.823368","Country":"New Zealand","Case Number":"49598","Tags":"City","Date Submitted":"08/08/2013 02:49 UTC","Object Features":"Unknown","divs":["sighting detailswhite\\orange orb took off from top of maupuia at extreme speed after hovering and pulsing for several minutes appeared to come from behind the wellington prison. the entity was observed by myself and several others from our position on mt victoria, friends at other locations also sighted it through binocular lenses in greater detail and were amazed at it's speed in takeoff. the light source seemed to fly straight for several hundred metres on takeoff and then jet off in a complete opposite direction. it is interesting to note that a light next to the light source pulsated regularly as if energy was being drawn from it and street lights in my area died as i observed it. i was looking to capture the aurora australis on film at the time and this was the only reason that i noted the light pulsing, i called several friends to see if they could see it from their location, (better vantage point) and they certainly could. the object seemed to disappear after gaining extreme speed. it is also important to note that against the cloud in the sky many instances of dark grey looking things seemed to be almost constantly shooting upward sporadically."],"files":["/var/www/straped/mufon/html2text/49598.html.txt","/var/www/straped/mufon/org/49598.html"],"City":"Wellington","Object Shape":"Sphere","Region":"Wellington","Date of the Event":"08/07/2013 01:30 UTC","Log Number":"NZ-08082013-0005","Disposition":"Unresolved","Sighting Duration":"00:02:00"}