{"City":"Coral Springs","Source":"MUFON","Summary":"one bright light followed by two seperate lights (no blinking present) first light got brighter second lights remained same. helecopter appeared,first light grew brighter, lights vanished","Weather Factors":"Unknown","Object Flight Path":"Path then hovering","Latitude":"26.277272","Sighting Duration":"00:04:00","files":["/var/www/straped/mufon/html2text/49590.html.txt","/var/www/straped/mufon/org/49590.html"],"Tags":"City","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=26.277272,+-80.268804(49590)&iwloc=A&hl=en\"> mufon case (49590) map </A>","Viewing Distance":"Over One Mile","Object Shape":"Other","Date Submitted":"08/07/2013 11:09 UTC","divs":["Sighting DetailsI was washing my car, I figured it was a better idea than to do it during the day in the Florida heat. Something (don't know what) prompted me to look into the sky to the east. When I looked I saw a single bright light and then two lights following behing it. I know that planes are supposed to have atleast three miles between them and found it odd that these three were so close together. I called my husband over to look with me and he too said (\"what the @!#$ is that.\") We stared into the sky at the object(s) for about three minutes observing that it had no blinking lights, about two minutes into our observation, the first light stopped and appeared to hover in mid air. My husband pointed out that the clouds were swirling around the first single light very quickly while the two lights behind were stationary. A helecopter flew over the horizon (below the three lights in question) with red and blue flashing lights. The first light in question grew brighter and seconds later all three were gone. They literally were just gone, no traveling through the sky was noticed by my husband and myself. During the sighting we did not hear any engine sounds. Only that of the helecopter."],"Country":"United States","Longitude":"-80.268804","Date of the Event":"08/07/2013 09:02 UTC","Case Number":"49590","Log Number":"US-08072013-0031","Disposition":"Unresolved","trends":["There have been 18 other sightings in Coral Springs","There were no other sightings in Coral Springs on or around August 7th 2013"],"Region":"Florida"}