{"map":"<A HREF = \"http://maps.google.com/maps?q=45.609082,+-61.350582(49601)&iwloc=A&hl=en\"> mufon case (49601) map </A>","Date Submitted":"08/08/2013 10:00 UTC","Summary":"9 Consecutive objects flying overhead in different directions.","Sighting Duration":"01:00:00","Country":"Canada","Weather Factors":"Unknown","divs":["Sighting DetailsI was outside observing the night sky as I will usually do on warm nights as I have seen ufo activity in the past. Starting from around 8:45pm (local) I was outside watching as the usual planes would pass by I was observing the stars and watching for anything unusual when an glowing orb passed overhead headed from SW and headed NE in straight line, I attributed this to possibly a satellite as it was moving at a steady pace in a straight line pattern. It took approx 5 minutes for the first one to pass from one side of the horizon to the other. No other activity was observed until 9:05pm (local) when the first of what I believe to be UFOs passed by. This one started off on a path from SW to NE but while flying overhead the light from the object intensified greatly making it seem 7-10 times larger than first perceived and it course changed and headed towards the East and over the Atlantic then dimmed and continued out of site fairly quickly (In comparison to a plane looked like it was moving at least 4-5 times faster at a higher altitude.) Once it was out of sight more were spotted periodically headed in different directions observing the same behavior although some did not change course and 3 were observed at the same time at approximately 9:35pm (local) crossing paths in the sky right after each intensified in light and when they did two of the objects changed course as the other stayed on its straight path over the horizon. When the objects were crossing it almost seemed like they were going to collide but they crossed without incident. All the objects observed left sight fairly rapidly over the horizon or what could be gaining altitude and ascending into space. There were 10 objects witnessed between 8:45pm and 9:45pm, 9 of which I believe to be UFOs as they did not exhibit behavior matching that of a plane, satellite or helicopter that I have ever seen."],"Source":"MUFON","Viewing Distance":"Over One Mile","trends":["There have been no other sightings in Port Hawkesbury","This sighting has never been favorited."],"Object Shape":"Circle, Oval","files":["/var/www/straped/mufon/html2text/49601.html.txt","/var/www/straped/mufon/org/49601.html"],"Date of the Event":"08/07/2013 09:05 UTC","Case Number":"49601","Region":"Nova Scotia","City":"Port Hawkesbury","Object Flight Path":"Straight-line path,Path with directional change","Log Number":"CA-08082013-0007","Longitude":"-61.350582","Tags":"City","Object Features":"Unknown","Disposition":"Unresolved","Latitude":"45.609082"}