{"Sighting Duration":"Undisclosed","Log Number":"US-08082013-0009","trends":[],"Summary":"Large, slow-moving bright gols object at high altitude","Region":"South Carolina","Latitude":"33.837581","Object Flight Path":"Path with directional change","Date Submitted":"08/08/2013 10:10 UTC","Longitude":"-81.160874","Object Features":"Unknown","Source":"MUFON","Object Shape":"Star-like","City":"Undisclosed","Case Number":"49603","map":"<A HREF = \"http://maps.google.com/maps?q=33.837581,+-81.160874(49603)&iwloc=A&hl=en\"> mufon case (49603) map </A>","Date of the Event":"08/07/2013 08:45 UTC","divs":["Sighting Details My wife and I were going for a walk around our town as we do frequently in the evenings. It was just turning dusk about 8:45 pm and the sun had already set below the tree line. The sky was very clear with only a thin clouds to the west. I looked up and saw a large bright object in the distance. I didn't think much of it at first since we live near Shaw AFB and see planes all the time. I looked again a few seconds later and noticed it was moving fairly slowly and slowly dimmed and brightened again. Then behind the object appeared two or three small objects - like glitter - blinking faster than the main object but much smaller and dimmer. They appeared red and orange and trailed the main object for two or three minutes. By that point we'd all stopped and were watching trying to figure out what it was. Then we noticed what looked like a cloud started forming around it and a cone-shaped trail appeared. I started thinking maybe it's a meteor and it was just hitting the atmosphere but it never got brighter or turned into a fireball. Then the tail faded (it was only there for maybe 5 seconds) and it continued as it had been. That's when I really thought something was odd because meteors don't just stop falling. We were near a line of trees and the object moved behind them so we hurried over to a nearby baseball field where we could get a better look. It was still visible for a couple of minutes when we got to the field and took a sudden turn away from us (to it's right) and basically continued out of sight. The whole event was at least 15 minutes. When we got home I looked for any footage or pictures of anything similar but didn't find anything. I went to a site that list the dates and times of various launches and did find one in Cape Canaveral, Fl for the same time and date so I'm not sure if that's what we saw. As far as I know those launches don't move horizontally and change directions. If anyone can give me an explanation, I would appreciate it very much."],"Viewing Distance":"Unknown","Tags":"City","Country":"United States","Disposition":"Unresolved","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/49603.html.txt","/var/www/straped/mufon/org/49603.html"]}