{"Object Flight Path":"Stationary,Path with directional change,Path then hovering","Longitude":"-80.076078","Tags":"City","Region":"Florida","Date Submitted":"08/08/2013 01:12 UTC","Date of the Event":"08/07/2013 08:45 UTC","files":["/var/www/straped/mufon/html2text/49610.html.txt","/var/www/straped/mufon/org/49610.html"],"City":"Boca Raton","Case Number":"49610","Summary":"White light, BRIGHT barrier light surrounding the object. Two blinking glowing lights trailing this light, then a large white mist was released from the back of the main glowing light. It then changed direction and gained distance from the other two light","Latitude":"26.361738","Object Shape":"Circle, Sphere, Star-like","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=26.361738,+-80.076078(49610)&iwloc=A&hl=en\"> mufon case (49610) map </A>","Viewing Distance":"Over One Mile","Country":"United States","Object Features":"Unknown","Source":"MUFON","trends":["There have been 24 other sightings in Boca Raton","There was one other sighting in Boca Raton on or around August 7th 2013","This sighting has never been favorited.",""],"Disposition":"Unresolved","divs":["Sighting DetailsAt approx. 8:45 pm EST in Boca Raton, Florida. I walked out of my office (about 2 miles from the beach) turned east to walk to my Jeep and noticed the object. Immediately, the object stood out due to the bright glow around the object in the sky. The glow was so bright and the shape of this bright glow was so large and odd that it would make anyone stop. Now, I am not talking about the object itself there, I am talking about the glow in front of the object and to the sides. It looked as if it were almost breaking a sound barrier the was the shape of this glow was around the object. It was like nothing I have ever witnessed. Also, there were two blinking lights trailing behind this main light with the glow, almost as if it were behind escorted. When I noticed this the first thought that came to mind was as if it were almost like a blimp with a huge spot light around itself that was being escorted by helicopter or planes (only a blimp came to mind cause of how slow it was moving, not the shape, and the light was just unexplainable and so bright). I called over my friend who was leaving work as well and he was as taken back as I was by this. For the first few second we were trying to figure out how this could be a plane of anything else that we could explain we could not. Once we realized the object was something different than what we have ever seen, the glowing aura started to fade (which is where my video picks up). The two lights trailing became very very close to this front object and at that point, the main object released this white mist, fog, gas? Something! It was very bright, as if it released a firework or something that made us flip out. At this point, there was no doubt in my mind that this was something different. My heart sank, started beating very rapidly and the feeling of watching this is difficult to portray. After this object released what ever it released, it started to gain distance from the other two blinking lights. Though, the two lights still followed behind the main object. At that point, the object seemed to have changed its course from South to South East and seemed to have been flying out over the ocean, the two lights follow. It then becomes stationary over the horizon still in plain view, the other two lights are now about 40 degrees below to the left and a little distance between the main object. They were all still for about 30 seconds. As I am on the phone trying to explain to my girlfriend about the light that was released, the main object, which is stationary, starts to release the light again. It looks like it had a red tint this time but not as much was released. It could have been the growing distance which made it look dimmer, but it was still noticeable. The object then vanished from view. It did not fly out of sight, it just went away. I have a video of this. Of the white light being released is the clearest point of the video. It had my heart beating for hours. I have seen many and many rockets launch, this was not that. I do not know what it was, but it was worth spending 20 minutes of my time doing this. If you want the video, email me."],"Log Number":"US-08082013-0017"}