{"Summary":"Bright white orbs","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=43.076221,+-85.47538(49618)&iwloc=A&hl=en\"> mufon case (49618) map </A>","Weather Factors":"Unknown","Disposition":"Unresolved","Longitude":"-85.47538","trends":["There have been 6 other sightings in Rockford","There were no other sightings in Rockford on or around August 5th 2013"],"Date of the Event":"08/05/2013 12:00 UTC","Case Number":"49618","Viewing Distance":"101-500 Feet","City":"Rockford","Object Features":"Unknown","divs":["Sighting DetailsMy girlfriend witnessed the first light in the south west called me out to the back deck where I climbed onto the railing to get a better view... not the wisest, but I was able to see a bright white light descend the hover in place. The light stayed in place for only a few moments then vanished so I climbed down. My girlfriend ran to get her telescope, and she looked around at stars for a few minutes. I started to get weird feelings in my chest. Like butterflies. I spoke out loud, and said 'show yourself!' my girlfriend laughed thats when things got strange she heard in my voice answer 'is that what you want?' I don't remember saying this. She just asked me 'what?' which I responded with 'What?' right back. she told me what she heard me say, and thats when I saw what looked like a bright planet in the south east. It came down I took out my cell phone and tried to get it, but it was too shaky. My girlfriend reminded me about my canon DSLR so I ran in and grabbed it. Unfortunately by that time it was right over the house, and I didnt have time to change the video setting to night white balance, and I didnt have a tripod... So its not the best video, but it shows it was there. It was big, and it was bright."],"Object Shape":"Sphere","Object Flight Path":"Stationary,Straight-line path,Other","Region":"Michigan","Country":"United States","Log Number":"US-08082013-0024","files":["/var/www/straped/mufon/html2text/49618.html.txt","/var/www/straped/mufon/org/49618.html"],"Sighting Duration":"Undisclosed","Date Submitted":"08/08/2013 08:30 UTC","Latitude":"43.076221"}