{"Date of the Event":"03/15/2013 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.8268,+-117.115631(49615)&iwloc=A&hl=en\"> mufon case (49615) map </A>","Region":"California","files":["/var/www/straped/mufon/html2text/49615.html.txt","/var/www/straped/mufon/org/49615.html"],"Viewing Distance":"21-100 Feet","Sighting Duration":"Undisclosed","Tags":"City","Weather Factors":"Unknown","Log Number":"US-08082013-0021","City":"San Diego","Longitude":"-117.115631","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering,Other","Country":"United States","Date Submitted":"08/08/2013 04:44 UTC","divs":["sighting detailsi noticed a star blinking in the night sky many colors. i thought this was unusual so i went inside to grab the camera and see if i could capture what it was doing. it moved suddenly and was blinking elsewhere. i then snapped a picture toward the location and the camera flashed. i was trying to record not take a picture. the camera turned off and would not turn back on. i took the batteries out and put them back in and i try again. when i looked up the blinking star was gone and a glowing solid white color orb was coming down. i then hit the record\\picture button and it snapped a photo again and again i was trying to record and again it turned off on me. the batteries i know are good because i had taken them out of the package not to long ago in the week. after this happened i just watched this solid object that looked like your typical saucer shape object grow a dome from the top of it and turned into what looked like a cloud of television fuzz.a quick burst of white light seemed to light up everything and trails of cloud like tv fuzz was flowing off of it to the lamp post and to the trees. i ran inside to tell the others to come out and it was gone. it left a fuzzy trail in a tornado type up swirl that lasted for about a minute. one thing i am happy about is it is on camera and very unexpected. the main reason i am reporting this now is because today i seen a video that shows something very similar to what i witnessed. \"shocking ufo caught on surveillance camera in naples florida\"... so much of what i see in this video is what i was seeing. they have the video and i have the pic. it might be important. i really wish i did not have to use my name. please do not use my info as i fear being ridiculed. i have long been interested in the world and its a shame that i feel this way."],"Object Features":"Dome, Unknown","Latitude":"32.8268","Disposition":"Unresolved","Object Shape":"Circle, Disc, Flash, Sphere, Star-like, Unknown","Source":"MUFON","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around March 15th 2013"],"Summary":"Star seemed to be blinking many colors then suddenly and swiftly spiraled down above trees.","Case Number":"49615"}