{"Latitude":"42.728868","Weather Factors":"Unknown","Date Submitted":"08/08/2013 02:51 UTC","Region":"Michigan","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/49611.html.txt","/var/www/straped/mufon/more/49611_submitter_file1__1002522.JPG","/var/www/straped/mufon/more/49611_submitter_file2__1002523.JPG","/var/www/straped/mufon/org/49611.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.728868,+-84.604186(49611)&iwloc=A&hl=en\"> mufon case (49611) map </A>","Object Features":"None","Longitude":"-84.604186","Log Number":"US-08082013-0018","Sighting Duration":"Undisclosed","trends":["There have been 54 other sightings in Lansing","There were no other sightings in Lansing on or around August 7th 2013","This sighting has never been favorited.",""],"Object Shape":"Circle, Unknown","Source":"MUFON","City":"Lansing","Tags":"City","Summary":"Red, star-like object observed with flickering colors","Date of the Event":"08/07/2013 11:30 UTC","Country":"United States","Viewing Distance":"N/A","Object Flight Path":"Stationary","Case Number":"49611","divs":["sighting detailswas outdoors facing the west about 11:30 p.m. looked up into the sky and saw a red object that seemed star-like and hovering. i got my binoculars out to see if i could zoom in and it appeared the object was flickering various colors. upon watching this object it appeared to move in a north-western direction. i watched the object from inside my home and began feeling sick, dizzy, scared and nervous. locked all my doors, shut the blinds and tried to sleep, but started having sleep panic attacks (panic while falling asleep). i felt like something was watching me and possibly in my house. i have a history of sleep panic, but have not experienced them in over a year until last night. i also have a long history of seeing ufos, which i have documented almost all of them on mufon. my adult daughter witnessed the light as well. none of us in the house slept well last night. i took two pictures and thought i was capturing one object, but upon review of the pictures there are two objects; both appear to be the same type of object and color. you need to download the photos and zoom in to at least 50% or more to see them. they are in the left\\center bottom of the pictures on both shots."]}