{"City":"Fort Erie","Log Number":"CA-08092013-0006","Date of the Event":"08/06/2013 01:47 UTC","Source":"MUFON","Case Number":"49629","trends":["There have been 5 other sightings in Fort Erie","There was one other sighting in Fort Erie on or around August 6th 2013"],"Object Features":"Unknown","Region":"Ontario","Date Submitted":"08/09/2013 03:41 UTC","Longitude":"-78.964954","Object Shape":"Sphere, Star-like","files":["/var/www/straped/mufon/html2text/49629.html.txt","/var/www/straped/mufon/org/49629.html"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.910956,+-78.964954(49629)&iwloc=A&hl=en\"> mufon case (49629) map </A>","Country":"Canada","Disposition":"Unresolved","Tags":"City","Summary":"3 Orbs forming a triangle","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Latitude":"42.910956","divs":["Sighting DetailsWell a day later and here I am again with another sighting! Needing smokes for the morning I thought i would run out and get them before bed so i did not have to in the morning before work. My truck was parked out on the road , When i got into my truck I went to start the truck it was facing in the west direction before I put in the keys I looked straight ahead and seen 2 very,very,very low bright lights. I thought here we go again, I got out of my truck and then realized there was a 3rd bright light on the top forming a triangle. I had my cell phone on me so i decided to film it, I was only able to film about a min as my cell phone is not the best and can only hold so much Video and most of it is taken up of videos of my little boy! In the video in the top right corner of your screen you will see a orange light .This is the street light..You will see 2 white lights to the left a bit and oddly enough the way it looks because of how low it was it almost looks like the lights are below the street light. Then in between and up on the 2 bottom lights you will see the 3rd light forming a triangle. After my video ends about 30 seconds later they disappear."],"Object Flight Path":"Stationary"}