{"Latitude":"43.028071","Longitude":"-71.48587","City":"Manchester","Source":"MUFON","Log Number":"US-08082013-0029","Region":"New Hampshire","Date Submitted":"08/08/2013 10:26 UTC","Viewing Distance":"Unknown","divs":["Sighting DetailsMy boyfriend and I were outside our apartment complex for our nightly cigarette break. While sitting on the park bench in the yard we were looking at the night sky as we always do when there is no cloud cover. I happened to look over to the left of our building (to the North) and noticed a bright white light that would dim down to almost invisible and then brighten back up to a brightness that was beyond a typical aircraft. I pointed it out to my boyfriend as it had no apparent pattern when zooming in and out of brightness, which I thought was odd. My grandfather flew helicopters for a living so my father expressed interest in every plane or helicopter that flew over and regularly took me to airshows when I was young. We live near an airport, and growing up we had planes flying low over our house all the time as they were coming in for a landing but I had never seen lights like that on a plane, jet or helicopter before. It started rising upward over the tree line, and as it did so I noticed another light just like it diagonally underneath it. It continued to rise just a little bit more, then headed in a northwest direction. As it lifted fully over the tree line I noticed there was a third light, but unlike the first two white lights this one was bright red. The three lights formed a perfect triangle in the sky and we noticed as it flew it never lost its perfect formation, unlike when multiple planes are in the sky and one will catch up to another or go in a different direction. The three lights were also all the same size, which led us to believe they were all in the same general area. The lights continued to zoom in and out of brightness with no apparent pattern. It seemed as though the three lights were attached to a large aircraft. If so, the aircraft itself was not visible, but there is no way that the lights would have held that perfect form unless they were all stationary and attached to something much larger. The size of the triangle itself was comparable to that of the Big Dipper constellation's two bottom stars forming a triangle with one of the top stars. We watched it cross the sky at a fairly quick speed before disappearing behind the building to the northwest of us. There was a plane that flew over our building to land before we saw the lights and there were also two or three that landed while we tried to see if the lights would show up anywhere else in the sky, however it did not reappear. It was far too low and going in the wrong direction for it to be a plane or jet coming in for a landing. We did not notice if any other aircraft were in the area while we were observing it due to the fact that our eyes were glued to it."],"Tags":"City","Sighting Duration":"00:01:30","Case Number":"49623","Disposition":"Unresolved","Summary":"3 lights forming a triangle over treeline horizon","Object Features":"Unknown","Date of the Event":"08/07/2013 09:30 UTC","files":["/var/www/straped/mufon/html2text/49623.html.txt","/var/www/straped/mufon/org/49623.html"],"Object Flight Path":"Straight-line path,Path with directional change","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.028071,+-71.48587(49623)&iwloc=A&hl=en\"> mufon case (49623) map </A>","Object Shape":"Triangle","trends":["There have been 19 other sightings in Manchester","There were no other sightings in Manchester on or around August 7th 2013"],"Country":"United States"}