{"City":"Wellsburg","Case Number":"4962","Sighting Duration":"00:02:30","Source":"MUFON","Object Features":"Undisclosed","Tags":"City","Date of the Event":"06/16/2006 09:12 UTC","Country":"United States","Summary":"Initially, bright negative magnitude object to naked eye, few degrees east of Jupiter...Through telescope, satellite-like, dish, antenna, flashing lights (red and white)","Disposition":"Insufficient Data","Longitude":"-80.609519","files":["/var/www/straped/mufon/html2text/4962.html.txt","/var/www/straped/mufon/more/4962_submitter_file1__FirstLook.JPG","/var/www/straped/mufon/more/4962_submitter_file2__Exploding.JPG","/var/www/straped/mufon/org/4962.html"],"Latitude":"40.272015","Region":"West Virginia","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.272015,+-80.609519(4962)&iwloc=A&hl=en\"> mufon case (4962) map </A>","Date Submitted":"06/16/2006 09:12 UTC","trends":["There have been no other sightings in Wellsburg","This sighting has never been favorited."],"Object Shape":"Circle, Fireball, Flash","Weather Factors":"Unknown","divs":["Sighting DetailsDuring a scheduled \"starwatch\" at Brooke Hills Park, near Wellsburg, WV, several experienced amateur observers were unable to identify what appeared to be a bright, unblinking, object, a few degrees to the east of Jupiter in the sky. It moved very little as viewed by the naked eye and appeared to get brighter. Upon viewing with a 12.5\" reflector telescope, (approx. 136 power) it appeared as near the size of jupiter in field of view. Details were visible... round, radar-like dish that was light blue in color, antenna, blinking red and whitish lights... \"it looked like a radar dish aimed at the viewer\". While being viewed through the telescope, it exploded with debris expanding outward, tumbling chunks and trailing... The general feeling was that a satellite-like object had entered and burned in the atmosphere, likely a communications satellite. Since there was nothing in the news, or online about a \"missing satellite\", it seemed a good idea to report."],"Object Flight Path":"Undisclosed","Log Number":"US-06192006-0003"}