{"files":["/var/www/straped/mufon/html2text/49626.html.txt","/var/www/straped/mufon/org/49626.html"],"Summary":"My wife and I first sighted object overhead. Appeared to be a star but larger and brightest in the sky. Was not moving. Object began to move to the east. It never showed any blinking lights like an aircraft. Glowed brightly until out of view.","Date Submitted":"08/09/2013 01:27 UTC","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=46.719048,+-116.982829(49626)&iwloc=A&hl=en\"> mufon case (49626) map </A>","Region":"Idaho","Source":"MUFON","Date of the Event":"08/08/2013 09:15 UTC","Object Features":"None","Object Flight Path":"Straight-line path","trends":["There have been 3 other sightings in Moscow","There were no other sightings in Moscow on or around August 8th 2013"],"Latitude":"46.719048","Tags":"City","divs":["Sighting DetailsOn the night of Tuesday, August 6, 2013, while my wife and I were watching television, my cocker spaniel, Parker, wanted to go out to our back yard. It was at 9:15 p.m. Pacific Standard Time. I let him out and looked up at the sky and told my wife that the sky was clear and many stars could be seen. I noticed a particular \"star\" that was overhead that was really bright and seemed larger than the rest. My dog wandered around the yard and I continued observing the night sky. I called my wife to come look at the stars which she did. We both saw the bright star overhead as it remained in place. Then it began to move to the east and it surprised me and I mentioned it to my wife. I then indicated that it had no blinking red, green, or white lights like an aircraft. She noticed that also and commented on it that that was strange. We followed the light as it moved to the east and at no time did it diminish in brightness. No blinking strobe likes like on an airplane were ever seen. My wife and I remarked that we had viewed our first UFO, perhaps. At this point we entered our hose with our dog. I looked at the clock on our tv recorder and it showed 9:18 so the whole incident took about 3 minutes."],"Weather Factors":"Unknown","Log Number":"US-08092013-0003","Case Number":"49626","Disposition":"Unresolved","City":"Moscow","Object Shape":"Disc","Sighting Duration":"00:03:00","Country":"United States","Longitude":"-116.982829"}