{"Object Shape":"Circle, Fireball, Sphere, Star-like","Date Submitted":"08/09/2013 12:07 UTC","Longitude":"-90.369034","Summary":"Pulsating Orb","Latitude":"38.487638","map":"<A HREF = \"http://maps.google.com/maps?q=38.487638,+-90.369034(49624)&iwloc=A&hl=en\"> mufon case (49624) map </A>","Source":"MUFON","Region":"Missouri","Weather Factors":"Unknown","Log Number":"US-08092013-0001","City":"St. Louis","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/49624.html.txt","/var/www/straped/mufon/org/49624.html"],"Country":"United States","Tags":"City","trends":["There have been 5 other sightings in St. Louis","There were no other sightings in St. Louis on or around August 7th 2013"],"Case Number":"49624","Date of the Event":"08/07/2013 09:01 UTC","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsWent outside to take a quick walk. At first I noticed there were lightning like flashes going on in various parts of the sky. Took a look at a weather map on my phone, and there is no precipitation. When I looked up again, I noticed a white orb that appeared stationary at first, but I quickly noticed that it was moving. The object was a white star like orb that was not making any noise, and was slightly pulsating. The object appeared to be moving through the sky as an insect would in small s-like patterns. The flight path was straight, but there were definitely directional changes. Object then appeared to stop, but this may have been an illusion from the object moving away from me. All the while the lightning like flashes were occurring in different parts of the sky, and again, there is NO STORMS IN THE AREA! I felt very strange as I watched this object, but this may be due to the fact that this is my first sighting :) Very VERY strange indeed. I put two as the witnesses for this entry since I text my aunt to tell her, and she said that she saw THE SAME THING!"],"Sighting Duration":"00:05:00","Object Features":"None"}