{"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Weather Factors":"Unknown","Object Flight Path":"Straight-line path,Path with directional change","Object Shape":"Unknown","Object Features":"Unknown","Region":"","trends":["There have been no other sightings in Abu Ghosh","This sighting has never been favorited."],"Longitude":"35.109193","Date Submitted":"08/09/2013 01:36 UTC","Source":"MUFON","Case Number":"49627","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/49627.html.txt","/var/www/straped/mufon/org/49627.html"],"Tags":"City","Latitude":"31.806293","City":"Abu Ghosh","Summary":"Two different objects observed by my wife and myself plus other witnesses","Date of the Event":"07/02/2013 08:38 UTC","Sighting Duration":"Undisclosed","Log Number":"IL-08092013-0004","map":"<A HREF = \"http://maps.google.com/maps?q=31.806293,+35.109193(49627)&iwloc=A&hl=en\"> mufon case (49627) map </A>","Country":"Israel","divs":["Sighting DetailsMy wife saw the first object with other witnesses. She said that the object was bright white or like a bright light. It traveled from the direction of Tel Aviv toward Jerusalem. It stopped in flight and descended into a grove of trees and then flew straight up and out of sight. About five minutes later my son in-law called me out to the porch adjacent to the porch where my wife witnessed the first light. We were recording my radio show, Opposing The Matrix. The light I saw was red and pulsated or blinked twice then stopped blinking. It too traveled the direction as if from Tel Aviv toward Jerusalem. About half way across the sky (almost directly in front of our field of view) the object blinked out, then reappeared for a brief second and then blinked out completely. I am familiar with aircraft and know their lighting patterns. I looked for other lights that might have been with the red light but there were none. It was going too slow to be a meteor and it was not a satellite. I have been a star gazer my entire life and I know satellites when I see them. Also, I am a former MUFON investigator and I know what to look for and how to discern what I see."]}