{"Object Shape":"Oval, Other","Longitude":"-115.117501","Latitude":"36.198859","trends":["There have been 18 other sightings in North Las Vegas","There were no other sightings in North Las Vegas on or around June 19th 2006","This sighting has never been favorited.",""],"Summary":"tiny cloud formed from clear blue sky, silver/white object shot out and vanished","Source":"MUFON","files":["/var/www/straped/mufon/html2text/4963.html.txt","/var/www/straped/mufon/org/4963.html"],"Object Features":"Other","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=36.198859,+-115.117501(4963)&iwloc=A&hl=en\"> mufon case (4963) map </A>","divs":["sighting detailsi was in my yard, skimming the pool. i looked to the northwest, and the sky was cloudless, clear blue. my attention was drawn to a spot about 30 degrees above the horizon, where in an instant, almost like a puff of smoke from a fired gunbarrel, a tiny cloud began to form. a white \"spot\", then a small cloud formation. this was repeated with a second formation, adjacent to the first, and the two clouds merged (against prevailing wind, which at that time was 15-20 mph on the ground). it was interesting; i stopped my task and just watched the sky. i was afraid that if i went in to get a camera and\\or binoculars, it would disappear. i watched for approximately 5 minutes; the cloud remained stationary from my vantage point, as judged by distance from landmarks on the ground. then suddenly two seemingly spherical white\\silver objects shot out of the cloud, one heading northwest, the other southwest, at a rate of speed approximately triple that of commercial aircraft in the area, and probably 50% faster than the nellis jets that fly over the house routinely. they accelerated, elevated, as they went separate directions, and i chose to track the one going northwest; could not keep both in line of sight. the one i watched stopped dead, at about 40 degrees above the horizon, remained motionless for 3 minutes. i looked back at the cloud, in time to see it disappear as if sucked up by a vacuum cleaner... and when i looked back to the point at which the silver object had been last seen (triangulated by tree\\roofline in line of sight) it was gone. i looked for the other, that had moved southwest, in vain. interesting experience. the craft moved slowly at first, like a floating balloon, then accelerated at what seemed a tremendous rate, then stopped, as described above."],"Date of the Event":"06/19/2006 02:30 UTC","Sighting Duration":"Undisclosed","City":"North Las Vegas","Date Submitted":"06/19/2006 02:30 UTC","Case Number":"4963","Tags":"City","Region":"Nevada","Viewing Distance":"Over One Mile","Country":"United States","Log Number":"US-06192006-0004","Object Flight Path":"Path with directional change,Path then hovering","Disposition":"Unknown"}