{"Object Features":"Unknown","Summary":"2 star-like objects (a llittle bigger) moving together mosthly in straight line N-NM at time they would vary speed and come closer to each other. Disappeared after about 15 minutes.","Disposition":"Unresolved","Country":"United States","Region":"Arizona","divs":["Sighting DetailsI was at my condo's pool laying down soaking the sun about 10 am facing west. I noticed bright lights up in the sky and thought they were airplanes at first. There were 2 bright star-like objects against a dark blue sky ( I was wearing Polaroid glasses that darkened the sky). Objects were bigger than normal stars, almost like a bright morning star. The apparent distance between the 2 of them, was similar to the distance between Castor and Pollux (the 2 bright stars in the twin (Gemini) constellation). They were steadily moving in a NW path and would seem to vary speed slightly slow down or speed up) and come closer and then move apart from each other. I kept taking my glasses off to see if I was seeing things but they were still there. I watched them for about 15 minutes and then they disappeared in the distance. I don't know what it was.....but remember seeing something similar in the Gila Wilderness about 20 years ago. That time was 3 objects and were moving erratically then they disappeared....4 days later we heard a vibrating sound overhead, my wife was 5 months pregnant, after that, she started miscarrying and had to take her to the hospital. She almost died, doctor never found fetus....she thinks \"they took it\"."],"Source":"MUFON","City":"Tucson","Log Number":"US-08092013-0018","Object Shape":"Sphere, Star-like","Object Flight Path":"Straight-line path,Path with directional change","Latitude":"32.242321","Tags":"City","Viewing Distance":"Unknown","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around August 9th 2013"],"Case Number":"49642","files":["/var/www/straped/mufon/html2text/49642.html.txt","/var/www/straped/mufon/org/49642.html"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=32.242321,+-110.865905(49642)&iwloc=A&hl=en\"> mufon case (49642) map </A>","Weather Factors":"Unknown","Longitude":"-110.865905","Date Submitted":"08/09/2013 03:30 UTC","Date of the Event":"08/09/2013 12:00 UTC"}