{"Region":"California","Longitude":"-121.473037","City":"Sacramento","Tags":"City","files":["/var/www/straped/mufon/html2text/49650.html.txt","/var/www/straped/mufon/more/49650_submitter_file1__ResizedImage13760834707031.jpg","/var/www/straped/mufon/org/49650.html"],"trends":["There have been 83 other sightings in Sacramento","There were no other sightings in Sacramento on or around August 9th 2013","This sighting has never been favorited.",""],"Source":"MUFON","Case Number":"49650","Country":"United States","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Date Submitted":"08/09/2013 06:30 UTC","Object Shape":"Circle","Log Number":"US-08092013-0027","divs":["Sighting DetailsI was at the Applegate Zoo with my Daughter and Grandson. It is my grandsons 5th birthday today and he wanted to go there and see the animals. While admiring the caged animals, I looked up to see some birds in the shade trees above and that's when the round shiny object caught my eye. I observed it for a minute to see if it was an airplane in motion but it didn't move and it had no lights that I could see. When I decided that it was not an airplane, I called it to my daughters attention. She, too, agreed with me that we were looking at something that is not man-made. She got the chills at that moment. I then called several Zoo employees over to see this object. They were also amazed and could not come up with an explanation as to what we were looking at. The object remained within view for several hours, from at least 11 am when I first noticed it until around 2:30 pm when the the sky became overcast when it could no longer be seen. I called my husband who works at Merced College to tell him to take a look at it. He even got the Science Instructors involved and they viewed it with a telescope. They could not come up with an explanation as to what we were observing. I feel as if we are being observed by something other than mankind. This is not a common sighting for me but I notice that it seems to be a common sighting in general. I will go out later today if the cloud-cover clears and try to find this UFO again."],"Weather Factors":"Unknown","Latitude":"38.565085","Object Flight Path":"Stationary","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=38.565085,+-121.473037(49650)&iwloc=A&hl=en\"> mufon case (49650) map </A>","Summary":"Round white object was motionless, straight up in sky, was not as high as jetplanes that were also in area.","Object Features":"Unknown","Date of the Event":"08/09/2013 11:00 UTC"}