{"trends":["There have been 5 other sightings in Thomasville","There were no other sightings in Thomasville on or around October 21st 2012"],"Country":"United States","Object Features":"Appendage(s), Wings","Weather Factors":"Unknown","Summary":"Bright light, incredible speed, blinking and changing colors","Tags":"City","Disposition":"Unresolved","Date Submitted":"08/09/2013 09:55 UTC","files":["/var/www/straped/mufon/html2text/49657.html.txt","/var/www/straped/mufon/org/49657.html"],"Case Number":"49657","Viewing Distance":"Over One Mile","Source":"MUFON","City":"Thomasville","Region":"North Carolina","divs":["Sighting DetailsI was coming back from a city thats a few miles down the road from were im from about 10 minutes from my house. It was about 4am not many cars were on the road and it was me and my best friend coming from another friends house. I was in the passenger seat while my friend was driving and i was barely staying up because i was really tired ready to get home. What first made me notice the object was the speed and the brightness of it. At first i dint mention it to my friend while she was driving but i kept my eye on it and it was follwing us down the road , it was right beside us in the sky but it was moving fast too fast , not a airplanes speed thats what caught my attention. I thought it might be a plane or a shooting star all because of the brightness and its speed. I finally sat up and told my friend because i dint want to be the only one looking at so we were both amazed how it was keeping up with us as we went down the road. It was flcikering like a light bulb and getting bigger and smaller. We finally stopped the car on the road i live on and jumped out the car and it stopped directly on top of us, we were obsessed by the lights and the fact that it stopped when we did. We literally starred at the lights for 30 mintues. It started to get bright and then dim and get small then it would change its shape and it look transparent with many bright beautiful colors almost like it had wings , more like a butterfly. we thought we were seeing stuff so we decided to get back in the car to see if it would follow us so we drive downtown about 2 mins down the road and it folowed us all the way downtown. we stopped at the stoplight and made a u turn and it literally follwed us and then switched sides thats how i knew it was something odd. the speed was crazy it cant even explain it but i know it was no plane.The entire time we were so anxious to see what it was we dint even realize how how late it was, we were so interested in seeing what it was , something was drawing us to because it gave us a peaceful, relaxed , curious feeling. We reach my street again and then it slowed down, we played pick- a- boo with it, driving the car up slow a lil bit past the house to the right once u reach my street, and we seen the light at the peak of the house and then we moved pushed on the gas all the way down the road and it just shot off at the same time with us . we parked in front of my house and it just sat there for 3 hours and we watched it and took pictures. I dint want to go in the house i wanted to watch it all night, it was so beautiful, the lights and the way it would jump around.! Apparently there were two lights in the sky that night, i kept a eye on it once my friend pulled off and went home and she called seconds later that the light was following her but i told her i was looking right at, once she got home she clamied her radio in her car never has static but when she reached home her radio completley started to make that noise and the light just disappeared. I was so obsessed with the light i could not get it off my mind. After that night i started to see it often outside my house around 2am in the night, i was always alone when i seen it and many nights i seenn it change its colors , jump around dim its light, move up and down, it almost looked as if it had wings comming out the side but you could see the colors flashing. Sitting in my car one night i happen to see it again and me and my friend the same girl was just sitting in the car with the car off and we seen the light, we decided to record but u could not see the light on the camera off the cellphone so i choose not to record. But on picture mode u could see it clearly and it was jumping around on the camera like crazy we dint understand. We freaked out when my radio turned on without my keys in the ignition and we both cried from fear of not knowing what caused that to happen but it did it right after our phones died. I continued to see it contstantly after that just me im not sure of my friend.The picture i have is from the night i seen it change colors and change its shape it was breath taken nothing like i have ever seen in my life. It made me feel so concerned to know what it could be or how could i help. For several weeks i became obsessed with researching staying up late hours online about what i was seeing, and having weird dreams. I have not seen this since year ago. But i have seen things like these for several years just never spoke about it."],"Object Shape":"Boomerang, Flash, Sphere, Star-like, Teardrop, Unknown","Latitude":"35.862047","Longitude":"-80.10051","map":"<A HREF = \"http://maps.google.com/maps?q=35.862047,+-80.10051(49657)&iwloc=A&hl=en\"> mufon case (49657) map </A>","Object Flight Path":"Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","Date of the Event":"10/21/2012 12:00 UTC","Log Number":"US-08092013-0034"}