{"Log Number":"US-08092013-0036","Source":"MUFON","City":"Undisclosed","Object Flight Path":"Path with directional change","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Longitude":"-82.904643","Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=40.425487,+-82.904643(49659)&iwloc=A&hl=en\"> mufon case (49659) map </A>","trends":[],"Summary":"Bright orange light with no sound; abruptly changed direction.","divs":["Sighting DetailsI was out walking from 8:55pm to 10pm (I always check my time to make sure I get an hour in) and at 9:40 PM I saw a bright orange light flying out of any flight path (I see planes all the time and know the paths they fly). The object made no sound and had no blinking lights. There were lots of clouds so I know it was pretty low. The object made a sharp turn and got behind some trees. When I ran out into an opening it was gone. I looked around for any neighbors to point it out to them, but no one was outside. I did notice a car slow down near me, but I don't know if they did that to view the object. I live well north of the nearest large city (Columbus, Ohio) and I know where the airport is and I see aircraft all the time and am familiar with the flight paths. There is a small aircraft airfield (Don Scott Field) well south of me, but this object appeared from the north and turned northeast. I lost it when it got behind some trees and was gone by the time I was able to get to a clearing. I attached two pictures...the original from my phone and one where I added some text to describe it. I don't have a smart phone so there was no zoom, otherwise the picture would have been much bigger. The object seemed quite low, but I heard nothing."],"Case Number":"49659","files":["/var/www/straped/mufon/html2text/49659.html.txt","/var/www/straped/mufon/org/49659.html"],"Region":"Ohio","Object Features":"None","Weather Factors":"Unknown","Country":"United States","Sighting Duration":"00:10:00","Date of the Event":"08/09/2013 09:40 UTC","Date Submitted":"08/09/2013 10:40 UTC","Disposition":"Unresolved","Latitude":"40.425487"}