{"Log Number":"US-08102013-0002","Object Shape":"Triangle","City":"Lakewood","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Tags":"City","divs":["Sighting Details My family was at a local park watching an outdoor movie. I happened to be observing the stars because many of the street lights were shut off or lacking in that particular area. Facing North I noticed what I first thought was an airplane. A second later I realized there were no regulation lights of any kind, only 3 dull white lights in triangle formation. To be precise, one light was closely followed by two lights. They were equally spaced. There must have been a solid object holding them in place, but it was only a sillhouette if anything, leaving the only the lights visible. Pointing at the object I asked my wife, \"What is that?\" She replied, \"I'm not sure. Maybe birds?\" The object continued it's flight path North and vanished from site. (My wife believes it vanished quicker than it should have as it couldn't have traveled out of our field of vision in that time.) \"There is no way those are birds\" I said. \"Have you ever known a bird formation to have only 3 birds?\" We both agreed that if it had been birds, they would have been low enough that we would have seen SOME semblance of flapping or some waivering motion to indicate biological flight. This object was perfectly geometric and traveled a mechanically precise straight line. There is no doubt whatsoever that this was mechanical in nature. The lights were dull and rather unspectacular compared to what one might believe a UFO to look like. Although, I believe this to be the point. The only error the object made to garner notice was that it was flying very low. So low in fact, that we should have been able to hear it or feel the vibration. Also, the lights were not even as bright as the dullest stars above them, but each light was at least 3 times as big as the largest star in the sky. Although many folks' eyes were fixed to the projection screen at this outdoor movie, there were over 100 people in attendance at this event. There are potentially many more witnesses. I sincerely hope others witnessed this and report as well."],"Object Features":"Unknown","Date Submitted":"08/10/2013 12:35 UTC","Region":"Ohio","map":"<A HREF = \"http://maps.google.com/maps?q=41.476969,+-81.781929(49663)&iwloc=A&hl=en\"> mufon case (49663) map </A>","Country":"United States","Date of the Event":"08/09/2013 09:30 UTC","Object Flight Path":"Straight-line path","trends":["There have been 8 other sightings in Lakewood","There were no other sightings in Lakewood on or around August 9th 2013"],"Summary":"Triangular craft with 3 dull white lights spaced evenly. Object flew straight path heading due North 1-200 feet above treeline at a public event.","Case Number":"49663","files":["/var/www/straped/mufon/html2text/49663.html.txt","/var/www/straped/mufon/org/49663.html"],"Weather Factors":"Unknown","Source":"MUFON","Longitude":"-81.781929","Latitude":"41.476969"}