{"Date of the Event":"07/06/2013 12:00 UTC","Weather Factors":"Unknown","Country":"United States","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=46.496338,+-122.934268(49667)&iwloc=A&hl=en\"> mufon case (49667) map </A>","Object Features":"None","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Region":"Washington","Disposition":"Unresolved","Date Submitted":"08/10/2013 01:12 UTC","Log Number":"US-08102013-0006","Summary":"look like satellite, moved MUCH slower than one, brightened MORE than any star then faded to original light, moved on then bright again, repeated pattern till gone. Saw 3 separate ufo, 1 from N to S.","Case Number":"49667","divs":["Sighting Detailswe were in the back yard having a campfire at my uncles place outside of Winlock when we looked up straight above us and thought we saw a satellite. it was moving very slowly for a satellite much too slow then it got really bright brighter than any star. it moved on for a few seconds and then dimned down to its original light. it moved on for a few more seconds then it got extremely bright again. it repeated this pattern until it was out of sight. yeah and the course of maybe 20 30 minutes we saw three of these objects doing the same thing. they were heading what look like to be from the south going to the north. what really made this significant was how slow it moved and how bright it became and how it dimned and then became bright again. about an hour later we saw another one coming from the north heading south. this one was further away from us not directly overhead. once again it did the same pattern. the first time we saw this was somewhere between 10 o'clock or 11 and then the 4th one the very last one was at midnight. I have never seen satellites behave like that before. I have never seen satellites move that slowly before!"],"trends":["There have been 2 other sightings in Winlock","There were no other sightings in Winlock on or around July 6th 2013"],"Longitude":"-122.934268","City":"Winlock","Latitude":"46.496338","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/49667.html.txt","/var/www/straped/mufon/org/49667.html"],"Viewing Distance":"Unknown","Tags":"City"}