{"files":["/var/www/straped/mufon/html2text/49665.html.txt","/var/www/straped/mufon/more/49665_submitter_file1__IMG3967.JPG","/var/www/straped/mufon/more/49665_submitter_file2__IMG3969.JPG","/var/www/straped/mufon/more/49665_submitter_file3__IMG3970.JPG","/var/www/straped/mufon/org/49665.html"],"divs":["Sighting DetailsI was at my apartment at around 8:25, when I saw a beautiful sunset, I went out but then I remembered that I have seen many things that I regret not having the camera with me. You will see I am a nature fun and taking pictures is my hobby. I went upstairs to the 7th floor to have a better view, and it was an amazing sunset, I took the first picture and it was just what I saw, then I took a second one and immediately I saw the object I could not believe it, I was shocked,the first thought that came to my mind was an UFO and instinctively I took another picture, nothing came up. I saw the picture again and could not believe what is on the picture, I have been trying to find out but there is no logical explanation to what is on the picture. I took another picture yesterday of a clear light that was not moving and what is very very odd is that the object I took the picture was quite visible and could have been an airplane or something bigger, what is wierd is that comparing the object of the picture taken the 8th of August, the light on the picture seems smaller than the object which means it might be a very big object. My cam is just a common one, not a funcy one, so I can not take special pictures. The object is completely round and on the picture appears like a golf ball, with white and sort of grey texture whith like three holes or I don't know how to describe, may be lights, I can not tell. I cannot say aif it was moving or how it was as when I took the picture it was not a visible object. Describing the feelings I had is quite difficult, I was shocked by what I saw on the picture and still am, I know deep within myself that is not an illusion is something that to our eyes we do not see, yet exists. I believe there is a reason for things to happen and I just wanted to contact an organization or group that could help to find out what is on the picture. I will send you the sequence of the 3 pictures taken, the cam time is one hour behind because I do not know how to fix it. the first one was taken at 20:46 although it shows 19:46, the second one with the object was taken a minute later, and the last one was taken immediately after I saw the object on the 2nd pic. If you see deeply into the first pic there is a light but it could be a simple light."],"Source":"MUFON","Log Number":"US-08102013-0004","Latitude":"27.925815","Disposition":"Unresolved","Summary":"sunset picture and no object when taken, then it appears an unidentified object on the picture perfectly round. took other pic and nothing came up.","Object Features":"Unknown","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","City":"Clearwater","Country":"United States","Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=27.925815,+-82.73844(49665)&iwloc=A&hl=en\"> mufon case (49665) map </A>","Object Shape":"Circle","trends":["There have been 31 other sightings in Clearwater","There was one other sighting in Clearwater on or around August 8th 2013","This sighting has never been favorited.",""],"Object Flight Path":"Unknown,N/A","Longitude":"-82.73844","Case Number":"49665","Viewing Distance":"Unknown","Tags":"City","Date of the Event":"08/08/2013 08:47 UTC","Date Submitted":"08/10/2013 01:03 UTC"}