{"Object Features":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.729948,+-84.597546(49674)&iwloc=A&hl=en\"> mufon case (49674) map </A>","Country":"United States","divs":["sighting detailson 8\\7\\13 i reported on here an object\\lights i was observing in the western sky and uploaded two still photos. on 1\\4\\13, i observed similar objects in the eastern sky which i also took photos of and a short video. i never uploaded these. i am uploading them now. if i am seeing planets or some other explainable objects can someone please let me know. what is funny is that when i took the pictures on january 4, 2013, they objects are in almost the same spot as the photos in august 7,2013 and when you zoom in to view the pictures, they are the same shape, but have noticeable differences. each time i thought i was only taking a picture of one object, but two different objects were seen in the photos on all shots. again, on these photos you must download the pictures if possible and zoom in to see the shape and the coloration of each object. i think the video shows a lot of coloration of the main object i was observing."],"Source":"MUFON","Latitude":"42.729948","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"01/04/2013 12:00 UTC","Date Submitted":"08/10/2013 08:55 UTC","Weather Factors":"Unknown","Object Flight Path":"Unknown","Log Number":"US-08102013-0013","Case Number":"49674","Summary":"Red, star-like light in Eastern Sky January 4, 2013","Object Shape":"Star-like","Longitude":"-84.597546","Region":"Michigan","Disposition":"Unresolved","trends":["There have been 54 other sightings in Lansing","There were no other sightings in Lansing on or around January 4th 2013","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/49674.html.txt","/var/www/straped/mufon/more/49674_submitter_file2__1002525.JPG","/var/www/straped/mufon/more/49674_submitter_file3__1002524.JPG","/var/www/straped/mufon/org/49674.html"],"City":"Lansing"}