{"Weather Factors":"Unknown","Object Flight Path":"Stationary","Source":"MUFON","Longitude":"-123.12459","Tags":"City","Sighting Duration":"Undisclosed","Latitude":"49.297126","Log Number":"CA-08102013-0010","Date of the Event":"08/09/2013 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=49.297126,+-123.12459(49671)&iwloc=A&hl=en\"> mufon case (49671) map </A>","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/49671.html.txt","/var/www/straped/mufon/org/49671.html"],"Case Number":"49671","City":"Vancouver","Date Submitted":"08/10/2013 04:34 UTC","Object Shape":"Sphere","Disposition":"Unresolved","Object Features":"None","trends":["There have been 33 other sightings in Vancouver","There was one other sighting in Vancouver on or around August 9th 2013"],"Region":"British Columbia","Country":"Canada","divs":["sighting detailsi was in front of my computer facing the window. (i like to watch the sundown while i am writing my film reviews\\checking facebook and rest my sight looking through the window and the horizon. i was the beginning of the sundown and all the sky is pink and blue. i usually can't see any star in the sky\\horizon (my window point of view) but this time i saw it. i mean, this is vancouver so its always either raining or grey sky. but this is the first year we have so much sun\\clear sky. suddenly i see in the sky this bright light like a planet or a star. looked like venus or mars but i've never seen it before, all these nights.. nothing. so i think it's because it's the first time we have so many clear nights and might be a planet. but it was bigger than the planets we use to see like mars or venus. probably double or triple the size. so i begin to doubt about it. specially because of the orange\\red color... looked like it was reflecting the sun in the horizon. so i tried to get my cell phone that i was charging right besides me. and boom! it was gone! just 10 minutes. i mean even a star doesn't do that! the reason i wanted to take the photo was because i wasn't sure if it was a planet and i wanted to compare the colors of the star or planet later on when the sun was down... also i thought it would make me find out if it was a star o not. but it was gone! just like that. no movements, no hovering no nothing. just a big red\\orange\\white sphere seemed like it was reflecting the sundown. not sure. the sky is dark now and no sign of that light. i really would like to know if this is a star or someone has seen something like that."],"Summary":"big red/orange and white sphere.. looked bigger than a planet we usually see. No movements."}