{"Date of the Event":"11/09/1987 06:50 UTC","Longitude":"-75.806169","Tags":"City","Summary":"4 white spheres approached vehicle, surrounded us. elevated, descended back as a car approached. circled each other! Travelled up the road, stopped when I did, Started again when I did, spiralled into atmosphere. 3rd witness on ground. Newspaper 500 miles","Source":"MUFON","divs":["Sighting DetailsI was headed downtown with my friend in my truck. I saw four white lights in formation coming down the river, in formation. I rolled down my window and told my friend to look at these helicopters. Within a minute they came directly at my truck. They went up in the air as a vehicle approached from behind us. I looked over at the man and woman in that vehicle who did not so much as acknowledge me. I almost knew that they wouldn't see it... The Vehicle passed, and the lights came down around us, two on our left, one directly above us, and one on the right. I had my head out of the driver's window looking up at this now white rectangle of light (as an observation or instrument utility mode?) I could see what seemed like light trailing up the sides of the rectangle, outlining the shape of a dark sphere, though I am not sure, I really strained to see some ship and can not be certain. This rectangular light was perhaps ten feet above us. The two white spheres remained on our left, one on the right. The rectangle then moved to the lights on the left and (simultaneously?) became a sphere like the other three. It revolved around the two lights on the left one at a time. I believe three clockwise revolutions. The three objects crossed the road in front of us, and the fourth object was then circled. The lights then moved down the street as I approached a red light (top of Brittania hill now). I stopped, and the four lights stopped close to a heritage building in the middle of Carling avenue where it splits into Robertson Road. I told my friend I would \"floor it\", and catch up the the objects when the light changed. Instead, as I left the stop-line at high speed, and accelerated, they matched my motion perfectly. They stayed this distance adhead of us until I approached Lincoln Fields. The objects then picked up speed and elevation. I saw three of these objects spin off into space, this time, clockwise, and in three revolutions disappeared high in the atmosphere. My friend saw all four do this, I missed one since I was driving. The last one to leave was so high that he was more to the South, almost beside us and perhaps 85 degrees to the horizon. The others seemed lower and more to the East as they left. There were perhaps ten seconds between each light doing this, The entire high altitude depart spiral of the four lights taking perhaps fourty seconds. I found out that there was a third person who saw the lights doing something \"strange\" in the area of Lincoln Fields. My friend and I heard this the next day at our school. I found out many years later that it was in the news perhaps a few minutes before our event, several hundred miles away, across the Great Lakes. I saw white lights in that general area on another occasion floating over the river -- they seemed to be in no rush to leave, and a group of three orange lights in 1992 with my girlfriend. We saw these three orange lights (one sphere, and two triangle with rounded bases (pointing outwards from the sphere). We saw these objects very high in the sky, and it only lasted a second or two. Three sightings within 1.5 km, and all within five years, and never again, though I've moved away. I'm reporting this almost thirty years later. I've reported it to Mufon previously, to NUFOR, to the NRC in Canada -- directly to Dr. McNamara. I've also written Stanton Friedman about it, when I discovered there was a newspaper report online that same day, with a very similar description. He pointed out that nobody is correlating sightings. I think this sight does a great job of that. I'm not reporting the other two events since they are rather insignificant in comparison to what I would call my Close Encounter of the fourth kind, though I did not see an alien, they were definitely taking a close look at us. I can supply the full names of all witnesses."],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Viewing Distance":"20 Feet or Less","map":"<A HREF = \"http://maps.google.com/maps?q=45.350342,+-75.806169(49678)&iwloc=A&hl=en\"> mufon case (49678) map </A>","files":["/var/www/straped/mufon/html2text/49678.html.txt","/var/www/straped/mufon/org/49678.html"],"Object Features":"Window(s)","Object Shape":"Sphere","Log Number":"CA-08102013-0017","trends":["There have been 55 other sightings in Ottawa","There were no other sightings in Ottawa on or around November 9th 1987"],"Date Submitted":"08/10/2013 02:10 UTC","Sighting Duration":"Undisclosed","City":"Ottawa","Case Number":"49678","Weather Factors":"Unknown","Disposition":"Unresolved","Region":"Ontario","Latitude":"45.350342","Country":"Canada"}