{"Log Number":"US-08102013-0012","City":"Marquette","Tags":"City","trends":["There have been 12 other sightings in Marquette","There were no other sightings in Marquette on or around October 14th 1973"],"Case Number":"49673","Latitude":"46.554336","Weather Factors":"Unknown","Date Submitted":"08/10/2013 08:15 UTC","files":["/var/www/straped/mufon/html2text/49673.html.txt","/var/www/straped/mufon/org/49673.html"],"Disposition":"Unresolved","Longitude":"-87.44524","Viewing Distance":"101-500 Feet","Sighting Duration":"00:15:15","map":"<A HREF = \"http://maps.google.com/maps?q=46.554336,+-87.44524(49673)&iwloc=A&hl=en\"> mufon case (49673) map </A>","Summary":"father witnessed event...best friend described witnessing same sighting 20 yrs. later; independent of each other. Father, highly credible!","Date of the Event":"10/14/1973 07:04 UTC","Source":"MUFON","Region":"Michigan","Country":"United States","divs":["Sighting DetailsHi, nearly everyone in my family has seen a ufo. I was skeptical myself until I saw one. The one I saw was similar to one I've seen videos of on tv... moving in an up down, left, right, irrattic; yet, apparently a deliberate motion. (too fast for a harrier jet, or, a weather balloon). It was opening day of deer season, while I sat in the woods with my rifle Nov.15th, 1990. However, what has compelled me to write this is not my own personal experience, but, my fathers story, confirmed independantly 20 yrs. later by my best friend. My father, the best, and most honorable man I've ever known told me this story.......\"I was delivering fuel oil to an elderly couples home when I noticed an object hovering, and shining down a beam of light. It didn't make a sound. I didn't want to alert and scare the elderly couple...and watched as it flew away toward the air base without a sound in the blink on an eye.\" My father told no one about this, yet, trusted me with the story. In the 70's \"people would talk and think you were crazy\". Here's the kicker-Talking with my best friend 20 yrs. later, he reinterated the story to me with the exact description verbatum . later. My friend had two witnesses with him, my father thought he had none. I ask you, what are the odds two people you trust the most, tell the same story independant of each other, 20 yrs. apart? BELIEVE-"],"Object Shape":"Circle","Object Flight Path":"Straight-line path","Object Features":"Unknown"}