{"Object Flight Path":"Straight-line path","Summary":"Two separate objects the first with on light te second with two lights moving west to east","Latitude":"40.586696","Viewing Distance":"Over One Mile","Log Number":"US-08102013-0028","Object Features":"None","City":"Long Beach","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Long Beach","This sighting has never been favorited."],"Object Shape":"Star-like","Date of the Event":"08/09/2013 12:00 UTC","files":["/var/www/straped/mufon/html2text/49689.html.txt","/var/www/straped/mufon/org/49689.html"],"Disposition":"Unresolved","Country":"United States","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.586696,+-73.638147(49689)&iwloc=A&hl=en\"> mufon case (49689) map </A>","Date Submitted":"08/10/2013 07:41 UTC","Longitude":"-73.638147","Tags":"City","Case Number":"49689","divs":["Sighting DetailsMy wife and I where out walking our dog after dinner when she said wouldn't it be crazy if we saw a UFO... First thing is we live within the landing approach of JFK airport and in the distance we can see the takeoff of laguadia airport plains so usually the sky is full of plains. With that being said, we both notice a fairly bright light moving east to west. So I said..like that one boo, she said yea lol. So we both watched it as it went but it was passing other plains in the sky with great speed as it passed behind cloud cover and our neighbors house so i said said come on lets see if we can see it around the corner. we lost it for maybe 10 seconds. When we saw it again it was below the clouds and moving away from us but still a bright light. So I said no way can we see landing lights if its moveing away from us and it had no flashers as most aircraft do at night. Then we noticed another this time it had the traditional two light pattern of a plain on approach but what made me look again was the speed and its silence as it passed over a lower air plain on its way to jfk and this was not going towards JFK airport so we both watched the lights travel as far as our eyes can see them once again usually we can see flashers or the landing light even at high altitude you can still make out the flashers both of these did not. Then we walked back home. And talked about what we saw ."],"Weather Factors":"Unknown","Region":"New York"}