{"Weather Factors":"Unknown","Source":"MUFON","Country":"United States","Case Number":"49681","Latitude":"41.839339","Object Flight Path":"Path with directional change","Date Submitted":"08/10/2013 04:50 UTC","City":"Dixon","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.839339,+-89.495686(49681)&iwloc=A&hl=en\"> mufon case (49681) map </A>","Disposition":"Unresolved","Log Number":"US-08102013-0021","files":["/var/www/straped/mufon/html2text/49681.html.txt","/var/www/straped/mufon/org/49681.html"],"Sighting Duration":"Undisclosed","Object Features":"None","Object Shape":"Other","Region":"Illinois","Date of the Event":"08/15/1990 12:00 UTC","Viewing Distance":"Over One Mile","Longitude":"-89.495686","Summary":"warm green neon color tubular object appeared to arc slightly towards the ground then it appeared the tail caught up to the front and it disappeared.","trends":["There have been 5 other sightings in Dixon","There were no other sightings in Dixon on or around August 15th 1990"],"divs":["Sighting DetailsVery clear and still nearly moonless August night just after dark where many stars were visible. Standing on my deck I was looking skyward and a bright movement caught my eye. It appeared in the southwest sky off in the distance. It was the most beautiful hue of green I've ever seen with a bright neon like glow. Its shape was like that of a long tubular balloon, with someone slightly bending both ends although it's movement was quite swift and appeared as though the tail of it caught up to the front and it disappeared. It seemed as though it was headed towards ground with at a slight angle before it disappeared. The sighting lasted 3 seconds, it was fast. I knew it was something I wasn't familiar with, no weather phenomenon I was aware of ever looked like that. Being a US Army infantry veteran I can identify aircraft related to my experience and it didn't resemble any. I was taken aback for a bit because I had no idea what it could've been and still have no idea other than to me it was a highly unexplainable event that has stuck with me and likely will the rest of my life."]}