{"Disposition":"Unresolved","Object Features":"Unknown","Date Submitted":"08/10/2013 07:16 UTC","Case Number":"49688","Viewing Distance":"Unknown","Sighting Duration":"05:00:00","map":"<A HREF = \"http://maps.google.com/maps?q=44.988568,+-93.272418(49688)&iwloc=A&hl=en\"> mufon case (49688) map </A>","divs":["Sighting DetailsI was walking to downtown, from my place in uptown, via Loring Park. I spotted two objects hovering in the NE sky. At first I didnt pay much attention to them as I thought it was just helicopters perhaps. But then, one looked like it was sort of checking out the Basillica. I'm not sure how far away they were, so it may have just been a quirk of viewpoint and unrelated to the Basillica. That struck me as interesting so I decided to record them with my Galaxy Note 2 phone. I also tried to get enough reference points in some of the shots to triangulate size if someone is interested in doing so. I'm not sure what the objects were. I'm inclined to think they were manmade. They werent helicopters though, at least not normal sized ones.. nor did they have the correct lights for that sort of vehicle. (Perhaps I'm mistaken?) The objects themselves were dual colors. They looked like two square lights of some sort attached to one another, which you cant tell from the video due to the low quality. If I remember correctly the colors were a solid blue and green, but dont quote me on that... I cant recall for sure. In the video each object appears a different color versus each being a dual color. Before I started to record, the second object had been hovering back and forth. It's the object you see hover up from the lower left in the video. My feelings and reactions: Curiosity more than anything. Like I said, I think it was probably something of terrestrial origin and someone either testing out some kind of say.. drone, or something, or putting on a show of some sort with rc craft. They kind of reminded me of those small automated drones from some of the universities you see videos of doing synchronized flying. That or perhaps small RC craft (but silent). At first I thought there might be some sort of propeller sound, but it was just downtown noise.. As I made my way downtown no one else seemed to have noticed anything. (it was busy downtown) How did I lose sight of the objects? See the video. They did their thing and then flew off. The second one looked like it had been landing or taking off before I started recording. Its hard to tell for sure though without a better idea of distance though."],"files":["/var/www/straped/mufon/html2text/49688.html.txt","/var/www/straped/mufon/org/49688.html"],"City":"Minneapolis","Tags":"City","Region":"Minnesota","Source":"MUFON","Date of the Event":"08/09/2013 09:00 UTC","Longitude":"-93.272418","Object Flight Path":"Other","Summary":"Two multicolored objects, hovering and changing directions, NE of Basilica. See video.","Log Number":"US-08102013-0027","Latitude":"44.988568","Weather Factors":"Unknown","Country":"United States","Object Shape":"Unknown","trends":["There have been 52 other sightings in Minneapolis","There were no other sightings in Minneapolis on or around August 9th 2013","This sighting has been favorited 1 time.",""]}