{"Weather Factors":"Unknown","Disposition":"Unresolved","divs":["Sighting DetailsI just got home and took my dog out to potty in the backyard, I was throwing the ball for her when I noticed a black orb approaching from the West, it was circular in shape, but slowly pitching itself to become more of a slit shape. I looked down to see if I had my cellphone to take a picture but I did not. When I looked back up I saw 5-6 of these objects in the same vicinity, all of the same shape and size, they were pitch black in color against the cloud cover. I stood stupified trying to figure out what they were, called my roommate out to see them. He said \"maybe there's something burning and it's airborne debris flying over.\" They were not fluttering or changing direction so I dismissed that immediately. It was not a balloon, blimp, or aircraft as there were no lights visible. 4-5 of the objects began to change light path (which was slow and deliberate) to the South, which would have taken their flight path directly over PDX airport. One of the objects began to descend, maybe 500-1000 ft. as I saw it get bigger. I would estimate the altitude somewhere between 2000'-5000' It was hard to tell with no reference point. My dog was whining uncontrollably, and I got a very eerie, unsettled feeling. It almost seemed as if it descended for me to see it better. I ran inside to get my phone to take a video, maybe 15 seconds before I got back outside and the 4-5 objects that had changed direction disappeared, only the first one that I saw remained. By this time it was almost directly over my house, at which time it changed direction to the Southern sky, following the same path as the others. I was able to get a short blurry video, which I will try and figure out how to upload. I followed the object for maybe another 5-8 minutes as it finally got far enough away to lose sight, there was bright, white cloud cover so it was hard to keep focus on it for too long. I would consider myself a skeptic at best, as I have never in my life experienced something like this, but it had a very profound effect on me. I remain unsettled as to what I saw. Hopefully someone else saw the same thing so I know I'm not crazy."],"City":"Vancouver","Date Submitted":"08/10/2013 05:45 UTC","trends":["There have been 54 other sightings in Vancouver","There were no other sightings in Vancouver on or around August 9th 2013"],"Object Features":"None","Object Flight Path":"Path with directional change","Source":"MUFON","Country":"United States","Date of the Event":"08/09/2013 01:00 UTC","Viewing Distance":"501 Feet - 1 Mile","Case Number":"49683","Summary":"5-6 Black orbs appeared from the Western sky, together, then took separate paths S/SE direction","Object Shape":"Sphere","Region":"Washington","Longitude":"-122.597103","Latitude":"45.647901","Sighting Duration":"00:10:00","Tags":"City","files":["/var/www/straped/mufon/html2text/49683.html.txt","/var/www/straped/mufon/org/49683.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=45.647901,+-122.597103(49683)&iwloc=A&hl=en\"> mufon case (49683) map </A>","Log Number":"US-08102013-0022"}