{"Date Submitted":"08/10/2013 09:46 UTC","Weather Factors":"Unknown","divs":["Sighting DetailsIt happens when I'm asleep. Don't know when it was but I remember falling asleep and my husband was in the front room watching tv. I remember I was lying on my left side when I fell asleep I had this sharp pain on my back and it felt like someone was drilling on my right lower part something was telling me not to move but talking to me telepathically. It kept saying overand over ddon't move cause the light will go out the pain was so bad I remember moving my shoulder to see what they were doing and as soon as I woke up after that the power went out in my house I culdnt get up cause I couldn't believe it was happening. I waited for about 5 secs I got up to open my down and see if my husband was ok and he asked what just happened. I didn't think anything of it so I went back to bed. I keep have these out of body experiences and seeing this tall hooded figure standing by my bed looking at me. Then I stared to right down all the dreams I would have and some of my dreams would be having intercourse with man I can never see it happened a couple of times. And recently on july 6th when my husband was getting ready for work at 4 in the morning I got ip made him his lunch he left when I went back to bed a had a dream that I was giving birth and there was 3 tall figures standing in front of me the one that was right in front of me delivering my baby was wearing a white coat. I gave birth to the baby and I remember them cutting the umbilical cord and it almost looked like on the avitar movie when he put his hair in the horse and those tentacles was wrapping around his hair. After I woke up my stomach was hurting I went to the bathroom and I was gushing out blood. That morning I went outside and there was a large burnt mark on my grass in my back yard. Since that day I haven't experienced anything else but I do have pains on my right abdomen area. I took a photo like 1 week later but grass was stating to grow back by then. I also have strange markings on my upper thigh."],"map":"<A HREF = \"http://maps.google.com/maps?q=32.78185,+-96.793751(49694)&iwloc=A&hl=en\"> mufon case (49694) map </A>","files":["/var/www/straped/mufon/html2text/49694.html.txt","/var/www/straped/mufon/org/49694.html"],"Source":"MUFON","Object Flight Path":"Unknown","Region":"Texas","Case Number":"49694","Longitude":"-96.793751","Country":"United States","Date of the Event":"07/06/2013 05:00 UTC","City":"Dallas","Tags":"City","Object Shape":"Diamond","Sighting Duration":"Undisclosed","Disposition":"Unresolved","trends":["There have been 116 other sightings in Dallas","There were no other sightings in Dallas on or around July 6th 2013"],"Log Number":"US-08102013-0033","Viewing Distance":"20 Feet or Less","Summary":"didn't see one","Latitude":"32.78185","Object Features":"Unknown"}