{"Log Number":"US-08102013-0030","Object Shape":"Unknown","Weather Factors":"Unknown","Case Number":"49691","Viewing Distance":"Unknown","City":"West Fargo","Latitude":"46.835547","Date Submitted":"08/10/2013 08:19 UTC","files":["/var/www/straped/mufon/html2text/49691.html.txt","/var/www/straped/mufon/more/49691_submitter_file1__IMG0085.JPG","/var/www/straped/mufon/org/49691.html"],"Region":"North Dakota","Object Flight Path":"Stationary","Source":"MUFON","Country":"United States","Longitude":"-96.912987","map":"<A HREF = \"http://maps.google.com/maps?q=46.835547,+-96.912987(49691)&iwloc=A&hl=en\"> mufon case (49691) map </A>","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Tags":"City","trends":["There has been one other sighting in West Fargo","There were no other sightings in West Fargo on or around August 7th 2013","This sighting has never been favorited.",""],"Object Features":"Unknown","Summary":"Two stationary lights blinking at each other, hovered long time","Date of the Event":"08/07/2013 10:30 UTC","divs":["Sighting DetailsWhen I stepped onto my patio for a cigarette I looked starward as usual and immediately noticed two unusual white lights. They were star-sized, and it was impossible to tell how far away or how far up they might have been. They were just inches apart by my view. The one on the right one would flash a round white light, then the left one would flash a round white light, the right one would flash, the left one would flash, over and over, but they never moved, they just hovered. I finished my cigarette and tried to take a video (unsuccessful), then watched for several more minutes before going inside. It was then about 10:40 p.m. About an hour later I went back outside to check on the lights and found that the one on the right was still hovering in the same place and still blinking as if in response to the one that had been on the left, except the light on the left had vanished. Man I wish I'd been there to see it take off! There's nothing tall around; the only thing behind my apartment complex is a cornfield, but I went out the next day to make sure there aren't any tall structures around that might have blinking lights on top. Just as I'd thought, there aren't. There's just one more row of apartments and then farmland for a ways."]}