{"Sighting Duration":"Undisclosed","Country":"United States","Date of the Event":"08/10/2013 10:00 UTC","Weather Factors":"Unknown","Date Submitted":"08/10/2013 10:33 UTC","Source":"MUFON","Region":"Michigan","trends":["There have been 13 other sightings in Traverse City","There were no other sightings in Traverse City on or around August 10th 2013"],"Tags":"City","Longitude":"-85.68654","files":["/var/www/straped/mufon/html2text/49697.html.txt","/var/www/straped/mufon/org/49697.html"],"City":"Traverse City","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=44.873644,+-85.68654(49697)&iwloc=A&hl=en\"> mufon case (49697) map </A>","divs":["Sighting DetailsI was out in front of my house watching for the meteor shower that was supposed to be on tonight. I noticed a plane - lights blinking, and I could hear the sound of the engine. I then noticed that there was another light following it, and I thought it odd that 2 airplanes would be in that close proximity together, especially since the airport was quite a bit away and both crafts were high in altitude. I tried listening for the other engine of what I thought was the other plane. That light, pure white, then started to descend from the sky, and got bigger and bigger as it approached. It was like when someone throws a rock, you see it coming, and the closer it gets, the bigger it is. The only weird thing is, it wasn't perfectly round. It was almost as if it were a teardrop as it came down. As I realized it was headed right for me (or so it seemed) I started to freak out and added a few choice words to the situation. I really felt like I was in mortal danger. The minute I started freaking out, it started ascending back up into the higher altitudes and once again became a pinpoint light and then disappeared. I came back in the house and pulled the shade shut. My daughter came in 10 minutes later to tell me it was still out there, cruising around. There were 5 witnesses to this event. The young adults were out in the back yard \"camping\" and had a fire going when this event happened."],"Case Number":"49697","Viewing Distance":"Over One Mile","Object Features":"None","Object Shape":"Circle, Sphere, Star-like","Object Flight Path":"Path with directional change","Latitude":"44.873644","Summary":"Moving light descended from sky, then ascended","Log Number":"US-08102013-0034"}