{"Tags":"City","Sighting Duration":"00:02:15","Country":"United States","Region":"California","Summary":"A balloon not from this world","Date of the Event":"08/05/2013 06:45 UTC","Date Submitted":"08/10/2013 10:47 UTC","Object Features":"Other","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=33.795691,+-117.963258(49699)&iwloc=A&hl=en\"> mufon case (49699) map </A>","files":["/var/www/straped/mufon/html2text/49699.html.txt","/var/www/straped/mufon/org/49699.html"],"Object Shape":"Other","Weather Factors":"Unknown","City":"Garden Grove","Case Number":"49699","Source":"MUFON","divs":["Sighting DetailsMy mother was driving me to the Filipino Store nearby which is around the corner from where I live. We were stopped at a red light at Lampson Ave. and Brookhurst St. when I saw a 2 to 3 foot in diameter balloon crossing the intersection. It was blue or blue green with rounded sections. Other drivers did not seem to care about it. It flew to my right just over my doctor's clinic building. It flew like an ordinary balloon, but it had a phony looking turned up mouth piece like where you blow air. When it was about 50 feet from me it brightly reflected the sun. Before it hovered at about 100 feet from me it brightly reflected the sun about 7 times. Soon after it hovered it started fading then the light turned green, and I vividly remember my mother turning right on Brookhurst St. hand-over-hand. Then I was viewing my doctor's building, the object and stores nearby facing E where before I was facing N. The object continued slowly fading, until it vanished into thin air. Then all of a sudden I was on Lampson Ave. I was excitedly narrating to my mother everything the UFO was doing. At first we saw it through the windshield then I saw it from my partially open door window. My mother does not remember turning right on Brookhurst St. She was out of view of the object, except when it crossed the intersection. She said nothing about it. Two days later I found red scratch marks on my left arm. And 3 days later I found a 3\" long red scratch mark on my left leg. In my experience photographing and filming UFOs in my area I found sometimes they resemble planes with plane like blinking lights. So to dismiss a UFO for a blimp, birds or balloons cannot be accurate."],"Longitude":"-117.963258","Object Flight Path":"Straight-line path,Path then hovering","trends":["There have been 27 other sightings in Garden Grove","There were no other sightings in Garden Grove on or around August 5th 2013"],"Log Number":"US-08102013-0036","Viewing Distance":"21-100 Feet","Latitude":"33.795691"}