{"Country":"United States","Disposition":"Unresolved","Latitude":"33.402011","Log Number":"US-08112013-0004","trends":["There have been 16 other sightings in Apache Junction","There were no other sightings in Apache Junction on or around August 10th 2013"],"Longitude":"-111.547855","Viewing Distance":"Over 1 Mile, Unknown","Date Submitted":"08/11/2013 12:38 UTC","Object Shape":"Star-like","City":"Apache Junction","Case Number":"49705","Sighting Duration":"Undisclosed","Region":"Arizona","Tags":"City","Object Features":"Unknown","Date of the Event":"08/10/2013 08:30 UTC","files":["/var/www/straped/mufon/html2text/49705.html.txt","/var/www/straped/mufon/org/49705.html"],"divs":["Sighting DetailsI go outside to smoke every night and these strange lights are always over the superstition mountains. There out there all night every night I know there not air plains because there are obviously plains all around them this is the first night I have seen more than one they do not have the flashing safety lights that aircraft have they get brighter and darker. They seem to get darker when other aircraft is around. They just fly around the mountain. There is one that is brighter than the rest that seems to not move too much there are smaller ones that seem to come out of it that fly around some times they are in some kind of formation. I'm not going to say that they are deffanently not from earth because I don't know which is why I'm reporting it I don't know they don't appear to be plains because they don't have the flashing lights that plains. I have not lost sight of it yet. The only feeling I have is curiosity I would like to talk to a ufo hunter about this."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.402011,+-111.547855(49705)&iwloc=A&hl=en\"> mufon case (49705) map </A>","Source":"MUFON","Summary":"been seeing strange lights over superstition mts. for the past week","Weather Factors":"Unknown","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering"}