{"Latitude":"24.725417","Viewing Distance":"Unknown","trends":["There have been 13 other sightings in Marathon","There was one other sighting in Marathon on or around August 11th 2013"],"Sighting Duration":"Undisclosed","City":"Marathon","Date Submitted":"08/11/2013 02:16 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/49709.html.txt","/var/www/straped/mufon/org/49709.html"],"Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=24.725417,+-81.047577(49709)&iwloc=A&hl=en\"> mufon case (49709) map </A>","Date of the Event":"08/11/2013 12:00 UTC","Log Number":"US-08112013-0008","Disposition":"Unresolved","Summary":"Stationary non blinking lights, one grew bright and both began to move in parallel","Source":"MUFON","Case Number":"49709","divs":["Sighting DetailsMy partner and I went to Veterans Memorial Park next to 7 mile bridge to watch meteor shower, when we saw across and above road in the North sky a what appeared to be a star grow very bright as if casting its own light south wards towards the direction we were facing (north) and then grew dimmer back to star-like brightness whilst remaining stationary, before it began to slowly move east. As it began to move, we observed another object of same dim star-like brightness approx. 2 inches above and diagonal from it move eastward with the first object at a slow rate of speed. Object resembled pyramid-triangle formation, but missing (or we could not see) the lower right point of the triangle. Objects appeared to move slowly to the East over & parallel to the ocean while surrounding stars remained stationary, however it covered the distance of what appeared to be 10 miles(?) before fading completely from visibility without ascending or descending . Lights from object or objects did not blink or have any indication that they were known aircraft and no sound was heard. Lights appeared to be too far apart from each other to be plane , unless actual close-up wingspan would be 10 miles apart from tip to tip (speculation based on distance apart from each other and other constellations (eye-view) in sky. Presumably, if lights made up one single object, it would be an extremely large object!!!! (Size of a small state)"],"Object Features":"None","Longitude":"-81.047577","Object Flight Path":"Hovering then path","Country":"United States","Object Shape":"Star-like","Tags":"City"}