{"trends":["There have been 122 other sightings in Pittsburgh","There was one other sighting in Pittsburgh on or around August 10th 2013","This sighting has been favorited 2 times.",""],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.395706,+-80.032692(49707)&iwloc=A&hl=en\"> mufon case (49707) map </A>","Disposition":"Unresolved","Region":"Pennsylvania","City":"Pittsburgh","Object Shape":"Triangle","Log Number":"US-08112013-0006","Object Flight Path":"Path with directional change,Path then hovering","Date Submitted":"08/11/2013 01:29 UTC","files":["/var/www/straped/mufon/html2text/49707.html.txt","/var/www/straped/mufon/org/49707.html"],"Tags":"City","divs":["sighting detailswe took our new jeep wrangler out tonight for a night time drive without the top, in hopes of viewing the meteor shower that was supposed to take place. i was already looking up to the sky in anticipation. we were sitting at the stop light at pioneer ave, waiting to turn left on w liberty ave, when i noticed a big orange flickering light rising above the treetops, it shot quickly to the left. the light reminded me of a floating lantern, but much bigger. my fiancee was driving & got a good look about the time i noticed the light shoot past 3 other red\\orange pulsating lights. i then noticed the objects seemed to follow & form an obtuse scalene triangle. slowly the 4th light disappeared & the other red orange lights moved in to make a tighter triangle. it took more than a minute or so for the shape to form. it was at that time i spent approx 20-30 seconds searching the back seat for my camera. when i started recording we were still at the stop light & the mysterious lights remained relatively stationary for about 30 more seconds. as the light changed i kept shooting through the open roof of our jeep. as we moved past the buildings & street lights, it stayed in focus, all the while pulsating red & orange. we drove down the street for another minute or two, filming the objects flicker in the sky, still in triangle formation. at about the same time, 2 lights disappeared, & left one red\\orange light, which seemed to get brighter before i eventually lost sight of it. the entire sighting lasted less than 5 minutes but left us feeling certain we had seen something out of the ordinary. i have no clue of the origin of the lights or if they actually created a bigger object, but it seemed as so, did not look like anything i had ever seen before in the sky. it left us feeling certain we had just witnessed a ufo."],"Summary":"Through the open roof of our Jeep, we witnessed 4 mysterious red/orange pulsating lights that came together to form a triangle.","Weather Factors":"Unknown","Date of the Event":"08/10/2013 08:55 UTC","Sighting Duration":"Undisclosed","Longitude":"-80.032692","Case Number":"49707","Viewing Distance":"Unknown","Object Features":"Unknown","Country":"United States","Latitude":"40.395706"}