{"Date Submitted":"08/11/2013 01:27 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.453881,+-76.499801(49706)&iwloc=A&hl=en\"> mufon case (49706) map </A>","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/49706.html.txt","/var/www/straped/mufon/org/49706.html"],"Latitude":"42.453881","Country":"United States","Object Shape":"Chevron, Triangle","trends":["There have been 7 other sightings in Ithaca","There were no other sightings in Ithaca on or around August 10th 2013"],"City":"Ithaca","Object Features":"Louvres","Sighting Duration":"00:00:05","Disposition":"Unresolved","Region":"New York","Log Number":"US-08112013-0005","Viewing Distance":"Unknown","Source":"MUFON","Tags":"City","Object Flight Path":"Straight-line path","Longitude":"-76.499801","Summary":"Arrow shaped cluster","divs":["Sighting DetailsWhile watching the perseid meteor shower in Ithaca, NY on Saturday night August 10th 2013 we saw a nice shooting star and a few seconds later a UFO and then another shooting star. What we saw was set of 6-8 chevron shaped lights that made up shape up an arrow. The chevron shaped lights were slotted much like the lights shining through a partially opened blind. The color of the light was a dull bluish white light except at the ends of the chevron's where it appeared more of a greenish glow. The lights looked more reflective than glowing in the other areas almost as if it had a searchlight shining up at it and a reflective tape shining back. There were no searchlights or anything else shining at it though. The intensity of the lights were just slightly more than the stars. Now take that description and add a slight grayish fog to it in the unlit areas. It blocked out stars behind its shape at it glided over and you could kinda tell it was one complete object. We first spotted it almost straight overhead moving quickly from east to west. We only saw it for a few seconds and it disappeared well before it should have been out of sight since we were still looking up at it. It made no noise whatsoever. It was an incredible experience for the both of us who saw it. It left us stunned for a while. We really wanted to see it again."],"Date of the Event":"08/10/2013 09:30 UTC","Case Number":"49706"}