{"Date of the Event":"08/10/2013 10:30 UTC","Object Shape":"Circle","files":["/var/www/straped/mufon/html2text/49719.html.txt","/var/www/straped/mufon/org/49719.html"],"Disposition":"Unresolved","Sighting Duration":"Undisclosed","Region":"Iowa","trends":["There have been 7 other sightings in Iowa City","There were no other sightings in Iowa City on or around August 10th 2013"],"Object Flight Path":"Path then hovering","Weather Factors":"Unknown","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"08/11/2013 10:36 UTC","Tags":"City","Case Number":"49719","map":"<A HREF = \"http://maps.google.com/maps?q=41.66512,+-91.481259(49719)&iwloc=A&hl=en\"> mufon case (49719) map </A>","Latitude":"41.66512","divs":["Sighting DetailsMy wife and I were in our hot tub on August 10, 2013 @ 10:30 PM. The night was very clear and no breeze. I was looking to the south right above the tree line. All of sudden this bright orange ball of light flew over this grove of trees headed in a N.W. direction. I turned the hot tub off, my wife and I couldn't hear a sound from this object. All of a sudden the dogs started howling in the distance. This object appeared to be no higher than a small plane getting ready to land on a airstrip, it was very low, it moved effortlessly and fast. It slowed and hovered, still no sound from it. If you didn't know it was there you wouldn't have heard it. Then it quickly headed West at a steep incline and disappeared in the starry night. When it was gone my wife just sat there in the tub in awe. We both said \"what did we just see\", we were speechless. Then all of a sudden a SECOND one came along and did the same thing. The sky was so clear we would have seen it circle around if it were the same one we just saw. No, this was an entirely different one but looked and did exactly what the first one did. This event occurred in Iowa City Iowa."],"City":"Iowa City","Source":"MUFON","Log Number":"US-08112013-0019","Object Features":"None","Summary":"Bright orange balls of light","Longitude":"-91.481259"}