{"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/49717.html.txt","/var/www/straped/mufon/org/49717.html"],"Object Flight Path":"Straight-line path","Case Number":"49717","Viewing Distance":"Unknown","Summary":"Intense pulsating light traveling directly overhead","Weather Factors":"Unknown","Tags":"City","Date of the Event":"08/10/2013 10:00 UTC","Object Shape":"Flash, Unknown","Date Submitted":"08/11/2013 10:24 UTC","Longitude":"-76.301752","Object Features":"None","divs":["Sighting DetailsI was outside on our back deck hoping to see Perseid meteors about 10:00 in the evening. As it turned out I only saw one meteor and was about ready to go back in the house when I noticed a moving light traveling from SE to NW. The light gave the appearance of a satellite, you know, no flashing lights (initially), appearing about 20 degrees above horizon, very faint brightness, steady straight line progress with no turns, very high altitude, etc. However the light quickly grew in size until it was brighter than any star and then it flashed like a flashbulb would. After the flash you could see the light moving in a straight line but faint. The light did this 3 times until it moved out of my field of view and over the house. The flash was not quick like aircraft lights, but perhaps every 5 seconds and the light increased in intensity. Usually if you see and aircraft by the time it is directly overhead you can hear the sound, but that was not the case here. I did not see any aircraft at the same time as this sighting. I wish I could convey to you the dramatic increase in size of the light. It went from an \"LED tree light\" to a \"floodlight\" and went from a faint yellow to an intense white. In my experience this stands out as unique."],"Source":"MUFON","Region":"New York","City":"Baldwinsville","trends":["There has been one other sighting in Baldwinsville","There were no other sightings in Baldwinsville on or around August 10th 2013"],"Log Number":"US-08112013-0016","map":"<A HREF = \"http://maps.google.com/maps?q=43.133656,+-76.301752(49717)&iwloc=A&hl=en\"> mufon case (49717) map </A>","Latitude":"43.133656","Sighting Duration":"00:01:00","Country":"United States"}