{"Disposition":"Unresolved","Object Flight Path":"Straight-line path","trends":["There have been 10 other sightings in Woonsocket","There were no other sightings in Woonsocket on or around August 10th 2013"],"Object Features":"Unknown","Date of the Event":"08/10/2013 09:17 UTC","files":["/var/www/straped/mufon/html2text/49718.html.txt","/var/www/straped/mufon/org/49718.html"],"Object Shape":"Circle, Sphere, Star-like","Region":"Rhode Island","City":"Woonsocket","divs":["Sighting DetailsI had just gotten home and found the power in the neighborhood was out. I don't know why. There were no storms, it was a crystal clear night. I took my tablet and went sat in my back yard to do some reading. I sat for about 5 or so minutes, then I spotted a glow in my screen, when I looked up I spotted this orange glow slowly moving across the sky. I immediately thought of my camera capabilities on the tablet, and moved to a position I could better observe this. I tried to take a picture but it was either too small or the capability of my tablet cam wasn't good enough, but as I turned, I spotted another one coming in, quickly raised my tablet and was able to see the image on my screen, so I snapped it a couple of times, then quickly spotted another following almost in perfect line with the previous 2. I snapped a total of 4 pictures of these. These were perfectly silent, but moved rather quickly, and then seemed to disappear into a pinpoint of light just beyond my location. This is the second time in 3 weeks I spotted these, almost in the exact same location. What was different about this time is the lack of electric power. Lastly, as the final one passed, the power in our neighborhood came back on. I know that may be coincidence, but it certainly made the hair on the back of my neck stand up."],"Country":"United States","Longitude":"-71.472155","Sighting Duration":"Undisclosed","Latitude":"42.005327","Tags":"City","Date Submitted":"08/11/2013 10:34 UTC","Viewing Distance":"Unknown","Source":"MUFON","Summary":"Orange Orbs sighted","Case Number":"49718","map":"<A HREF = \"http://maps.google.com/maps?q=42.005327,+-71.472155(49718)&iwloc=A&hl=en\"> mufon case (49718) map </A>","Weather Factors":"Unknown","Log Number":"US-08112013-0017"}