{"Object Flight Path":"Straight-line path","Object Features":"Unknown","Region":"England","map":"<A HREF = \"http://maps.google.com/maps?q=53.773306,+-1.55933(49729)&iwloc=A&hl=en\"> mufon case (49729) map </A>","Country":"United Kingdom","Date Submitted":"08/11/2013 05:19 UTC","Date of the Event":"06/28/2013 02:10 UTC","files":["/var/www/straped/mufon/html2text/49729.html.txt","/var/www/straped/mufon/org/49729.html"],"Latitude":"53.773306","Case Number":"49729","City":"Leeds","Sighting Duration":"00:02:00","Log Number":"GB-08112013-0028","trends":["There have been 9 other sightings in Leeds","There were no other sightings in Leeds on or around June 28th 2013"],"Viewing Distance":"N/A","Weather Factors":"Unknown","divs":["Sighting DetailsI had been having trouble sleeping of late,I was sat on the door step in the garden smoking a cig it was roughly 2am.Out of the corner of my eye i saw a bright blue object.I saw it for only a matter of minutes as it traveled sw to ne across my street i lost sight as it passed over roof tops of the houses oposite. It was very bright much brighter than any star in the sky it didn't make any sound.It was a clear night with no wind i'm guessing if it were a plain or helicopter i would have heared it before even seeing it. I see many planes flying over head on the way into Leeds and bradford airport the landing light change shape as they pass.once they have passed i can't see the landing lights from my position.From first seeing the object and seeing it over head up to it disapearing from view it's shape never changed,to me this suggests the whole object was lit.The direction it was heading took it directly through the flight path which planes heading to Leeds and Bradford take."],"Longitude":"-1.55933","Tags":"City","Source":"MUFON","Disposition":"Unresolved","Summary":"I saw the object traveling sw to ne and disapeared from my view over the roof tops of the houses oposite.The root it was on took it through the flight path of plains hading towards Leeds and Bradford airport h it h","Object Shape":"Sphere, Star-like"}