{"Object Flight Path":"Straight-line path","Longitude":"-113.494402","Tags":"City","Object Shape":"Unknown","Sighting Duration":"Undisclosed","Disposition":"Unresolved","City":"Edmonton","Latitude":"53.626835","Date Submitted":"08/11/2013 04:19 UTC","trends":["There have been 70 other sightings in Edmonton","There were no other sightings in Edmonton on or around August 10th 2013"],"Log Number":"CA-08112013-0025","Source":"MUFON","Date of the Event":"08/10/2013 11:20 UTC","Region":"Alberta","files":["/var/www/straped/mufon/html2text/49726.html.txt","/var/www/straped/mufon/org/49726.html"],"Object Features":"Patterned Surface","map":"<A HREF = \"http://maps.google.com/maps?q=53.626835,+-113.494402(49726)&iwloc=A&hl=en\"> mufon case (49726) map </A>","Summary":"large object shaped like eagle wings gliding...broish,green in color at low altitude on clear sky. object seperated once in half then those pieces seperated. white pulsing color with brown colored lights","Viewing Distance":"501 Feet - 1 Mile","Country":"Canada","Case Number":"49726","Weather Factors":"Unknown","divs":["Sighting DetailsI walked out my back door to go into hot tub. My wife in hot tub pointed up and said, babe what is that? I look up where she was pointing and seen a very large object that looked like eagle wings without any head or tail. The object was massive probably the width of 3 or 4 jumbo jets and you could see it was a brown and dark green color with ridges all over the bottom. I'm thinking the object was 600 to 800 feet across. I doubt it was above 8000 feet and made no noise or trail. The sky was absolutely clear. The object moved east like it was gliding at a good rate of speed as it went east you could see pulsing whitish light . The object then separated and as it separated it gave off a whitish and brownish light. I yelled to my wife I'm grabbing the camera and raced inside. When I returned my wife indicated the parts that split then separated themselves and she witnessed more white light with a brownish light and all the pieces then flew off in all directions at high speed and disappeared. My observation lasted maybe 30 seconds and my wife had maybe 40 seconds of observation."]}