{"Date of the Event":"08/11/2013 03:19 UTC","files":["/var/www/straped/mufon/html2text/49728.html.txt","/var/www/straped/mufon/org/49728.html"],"Tags":"City","Longitude":"-111.087671","Source":"MUFON","Viewing Distance":"Unknown","Object Shape":"Sphere","Latitude":"34.057228","Date Submitted":"08/11/2013 04:57 UTC","Weather Factors":"Unknown","Case Number":"49728","map":"<A HREF = \"http://maps.google.com/maps?q=34.057228,+-111.087671(49728)&iwloc=A&hl=en\"> mufon case (49728) map </A>","Sighting Duration":"Undisclosed","Object Features":"None","Country":"United States","Object Flight Path":"Path with directional change","Summary":"Was watching the Perseids meteor shower on Nasa Live Stream so this should all be recorded.","Disposition":"Unresolved","Region":"Arizona","divs":["Sighting DetailsI was watching Nasa Live Stream video of the Perseids meteor shower,I had been chatting with a few people on the live feed, and was google translating to talk to a women from Rio de Janeiro. At approximately 3:19am (mountain time) I saw a glowing white object going straight up the screen, very slowly, and in the center of the screen it slowed and started going Northwest to the upper left of the screen. Several different people commented at the same time about the object. ( I have screenshots of the conversation) Seconds after that there was some transmission disturbance from the Nasa Live Feed. And I had to even refresh my page, I saw light flashes and several people commented if there was a storm starting. Because this was a Nasa Live Feed it should all be recorded by Nasa. I lost sight of the object because of the transmission problems. I definitely had the feeling this was not a meteor, and I've seen satellites during meteor shower's and this seemed to move differently. 6000 thousand people were said to be viewing this video, I know that the handful who were chatting at the time all saw it. The exact location of the sighting is the location where Nasa records their live feeds for the Perseids meteor shower. The date and time would vary depending on where their live feed comes from."],"trends":[],"City":"Undisclosed","Log Number":"US-08112013-0027"}