{"City":"Garden Grove","Viewing Distance":"Unknown","Log Number":"US-08112013-0032","Date Submitted":"08/11/2013 06:33 UTC","Latitude":"33.796001","Longitude":"-117.958618","files":["/var/www/straped/mufon/html2text/49733.html.txt","/var/www/straped/mufon/org/49733.html"],"Disposition":"Unresolved","Region":"California","Object Flight Path":"Unknown","Country":"United States","Object Features":"Unknown","Source":"MUFON","trends":["There have been 27 other sightings in Garden Grove","There were no other sightings in Garden Grove on or around June 10th 2013"],"Summary":"2 unusual impressions in my mother's backyard","Date of the Event":"06/10/2013 12:00 UTC","Weather Factors":"Unknown","Case Number":"49733","Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=33.796001,+-117.958618(49733)&iwloc=A&hl=en\"> mufon case (49733) map </A>","Tags":"City","Sighting Duration":"00:00:00","divs":["Sighting DetailsLast year I saw a 2' impression of dead grass in my mother's backyard. My mother and I did not know what it was. I saw 2' from the impression a 3\" to 4\" dead grass impression near her walkway that made me think of landing gear. The bricks under her avocado tree were moved and discolored with an off yellow spray paint. Again my mother did not know who did it. The bricks were about 2' from the impression. As months went by the impression grew back normal grass to the most part. Recently I found another dead grass area exactly where the other one was. It is a little bigger than the other one, as like the other one it looks as though something heavy landed there. And like the other one the dead grass looks broken and pressed down. Both impressions share in being round with irregular edges, and the recent one also shows the same type landing gear impression(s), as the other one. On the first one I found 2 landing gear impressions, and the recent one was not investigated by me thoroughly, as I found only one. Both showed landin gear impressions in the exact same distance near the walkway."]}