{"divs":["sighting detailsaugust 10th 2013 (in the backyard) mainly red lights outlining the hovering object in sky, about 6-10 lights (dots) looks to be a triangular\\arrow shape. the lights were blinking\\pulsating in a variety of patterns (reminds me of christmas lights)in what looked like red, white, blue colors (mainly red). i saw it for about 10 minutes hovering in the same spot before it slowly went north. during that duration, there were about 4-5 planes flying by (what looks to be flying under the object from where i was standing). the size of the object in comparison looked to be bigger in the sky than the commercial airplanes that were flying by it. the triangle shape did not rotate or turn at all. it just looked still in the sky and once it floated away, i lost site of it because it when behind the trees (i was on the ground floor) the other people that were over said it was there for about an hour, hovering in the sky in the same spot. i have a photo and video taken on my phone's camera, so the quality is not great. it just looks like a blinking red star in the sky. so far there is no other reports online. hopefully someone else has seen this event and will share their sighting."],"Tags":"City","City":"Vancouver","Date of the Event":"08/10/2013 09:30 UTC","Date Submitted":"08/11/2013 07:20 UTC","Latitude":"49.269516","Object Features":"Unknown","Country":"Canada","Case Number":"49734","Sighting Duration":"01:00:00","Summary":"triangle hovering in sky flashing colorful, mainly red lights in variety of patterns","Viewing Distance":"501 Feet - 1 Mile, Unknown","files":["/var/www/straped/mufon/html2text/49734.html.txt","/var/www/straped/mufon/org/49734.html"],"Source":"MUFON","Weather Factors":"Unknown","trends":["There have been 33 other sightings in Vancouver","There was one other sighting in Vancouver on or around August 10th 2013"],"Longitude":"-123.107777","map":"<A HREF = \"http://maps.google.com/maps?q=49.269516,+-123.107777(49734)&iwloc=A&hl=en\"> mufon case (49734) map </A>","Region":"British Columbia","Log Number":"CA-08112013-0033","Object Shape":"Boomerang, Triangle","Disposition":"Unresolved","Object Flight Path":"Stationary,Hovering then path"}