{"Country":"United States","Summary":"A black triangle with two fluorescent lights on one side and 3-4 red blinking lights.","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/49749.html.txt","/var/www/straped/mufon/org/49749.html"],"divs":["Sighting DetailsI was driving to a friend's house. As I rounded the bend towards UDF on 49, I noticed what seemed to be one extremely pure white light sitting stationary in the air. I sat at the red light watching to see if there would be any movement, but there was none. The proceeded to turn green and I drove towards the neighborhood. I slowed down after crossing the intersection to observe the object. As I drew closer, I realized that it was two white lights instead of one. The two lights sat fairly close to each other. The lights were attached to one side of a dark colored triangle with rounded corners sitting perfectly still, not even 300 feet above the driving range. There were 3-4 red blinking lights that were closer to the inside of the triangle, rather than on the points as most UFO sightings. I wondered to myself what kind of aircraft would be sitting so close to ground at 9 o'clock at night? It was so close, I could see some texture on the bottom of it (i.e. indentations and protrusions). I had a CD playing, but not loudly, so if it was as loud as an airplane, I would have heard it. I heard nothing. I tried to watch it still as I turned into the neighborhood, only to look away for literally one second to look into my rearview mirror and it was gone. For some reason, I did not think to pull out my phone and record it or take a picture. I would not have anyway because it was frightening seeing something that you do not recognize. I told myself that it was probably just an airplane and I would tell my parents about it when I got back home. I mentioned it to my friend once I reached his house and he jokingly but not jokingly said it was probably a UFO. Honestly, while I looked at it, I was more or less in awe, curious and confused. But afterwards, I began to get nervous as I did not want to believe that it was anything besides an airplane as I described it to my family and they decidedly told me that it indeed was not an airplane."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.732466,+-84.394325(49749)&iwloc=A&hl=en\"> mufon case (49749) map </A>","City":"New Lebanon","Object Features":"None, Unknown","Tags":"City","Longitude":"-84.394325","Date of the Event":"08/11/2013 09:15 UTC","Region":"Ohio","Disposition":"Unresolved","Case Number":"49749","Log Number":"US-08122013-0001","Sighting Duration":"Undisclosed","Latitude":"39.732466","trends":["There has been one other sighting in New Lebanon","There were no other sightings in New Lebanon on or around August 11th 2013"],"Source":"MUFON","Date Submitted":"08/12/2013 01:00 UTC","Weather Factors":"Unknown","Object Flight Path":"Stationary","Object Shape":"Triangle"}