{"divs":["Sighting Details I was in the house when my husband told me to hurry outside. He pointed up and said look. I saw the triangle lights and ran to get my camera. I tried to take pictures of it but a street light was in the way. I waited until the lights moved farther way from the glare of the street lights and took 3 pictures. Unfortunately my camera wasn't set properly but when I downloaded the to the computer I could barely make out the lights. They were very faint. On one of the pictures I made out the 3 lights and there was a grayish round area between the two lights at the back of this shape. When I first saw the object my first thought was UFO get the camera. I saw the object coming from a northern direction and the it slowly turned southwest heading toward Indianapolis. After it turned in that direction the front light pulsated slowly then faded out the left rear light did the same and finally the right rear light followed. I have seen pictures on you tube of this same thing. I always believed that we are not the only ones in the universe but I never thought I'd really see anything like this. It seems we were the only ones out on the street that noticed it. I happened at 10:40 pm"],"Weather Factors":"Unknown","Tags":"City","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Country":"United States","Date of the Event":"08/11/2013 10:40 UTC","trends":["There have been 12 other sightings in Anderson","There were no other sightings in Anderson on or around August 11th 2013"],"Viewing Distance":"N/A","Date Submitted":"08/11/2013 11:47 UTC","Log Number":"US-08112013-0047","files":["/var/www/straped/mufon/html2text/49748.html.txt","/var/www/straped/mufon/org/49748.html"],"Case Number":"49748","map":"<A HREF = \"http://maps.google.com/maps?q=40.078778,+-85.672123(49748)&iwloc=A&hl=en\"> mufon case (49748) map </A>","Object Shape":"Triangle","Latitude":"40.078778","Object Features":"None","Longitude":"-85.672123","City":"Anderson","Source":"MUFON","Region":"Indiana","Object Flight Path":"Path with directional change","Summary":"saw three yellow orange lights coming from north, no sound, turned toward southwest direction toward indianapolis. Lights were in formation after turning to the SW position front light went out then light at back on left side faded out the light on right"}