{"City":"Tulsa","Region":"Oklahoma","Object Flight Path":"Path with directional change","Object Features":"Dome","divs":["Sighting DetailsIt was a sunny afternoon with some cumulus clouds in the sky. I was at a park with kids and as I watched them playing, movement in the sky caught my attention. I looked over the treetops and saw a black object flying N, but occasionally it made a jerky movement. There was no noise, although in the last hour I'd seen three jets heading N and had clearly heard them, but they were flying at a higher altitude than the black and metallic object. From the side and bottom the object was black, but when it turned it shone like silver metal. Unfortunately, I spent so much time watching it and trying to decide if it was a plane or not, that I didn't think to take a photo until it turned to head E. It flew for about 10 or 20 more seconds, and I had just about decided it must be a small plane, when it abruptly turned S, accelerated, and shot in a straight line heading S. As I stood there thinking about it, it reappeared and repeated the same movements, and once again sped off after making several abrupt movements and directional changes. I didn't see it again after that. The whole episode lasted several minutes. On its second pass, I took two photos of the sky while watching it fly, but there is nothing in the frames. Is this possible? I know I saw a black object flying irratically. I don 't know if anyone else noticed it or not. The other parents and kids at the park were involved in a birthday party and were playing in the water park."],"Longitude":"-95.977901","Summary":"Black and metallic object flying N then E then S, then repeating quickly, then gone.","Date of the Event":"08/11/2013 03:30 UTC","Latitude":"36.191482","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-08122013-0005","map":"<A HREF = \"http://maps.google.com/maps?q=36.191482,+-95.977901(49753)&iwloc=A&hl=en\"> mufon case (49753) map </A>","Country":"United States","Tags":"City","Object Shape":"Disc","trends":["There have been 59 other sightings in Tulsa","There were no other sightings in Tulsa on or around August 11th 2013"],"Disposition":"Unresolved","Source":"MUFON","files":["/var/www/straped/mufon/html2text/49753.html.txt","/var/www/straped/mufon/org/49753.html"],"Sighting Duration":"Undisclosed","Case Number":"49753","Date Submitted":"08/12/2013 02:44 UTC"}