{"files":["/var/www/straped/mufon/html2text/49758.html.txt","/var/www/straped/mufon/org/49758.html"],"Longitude":"-107.599218","Disposition":"Unresolved","divs":["Sighting DetailsMy son and I were on our way back from shopping in the small town of Grants, NM around 9pm. As we drove east on I-40 we observed the night time sky. Expecting to see the meteor showers, we keep our eyes open. I notice what I believed was a planet in the Western horizon. It strobed in a way that didnt look familiar. The objects brilliance grew then if faded out. I thought it had gone behind a cloud but with the moon out I did not observe any clouds in the general area of the object. Then again the light intensity of the object grew again..It got very bright again, brighter than any stars in the area. When we got home, I alerted the family and we all went out and looked. Saw nothing then all of a sudden again the orb appeared. Lower in the horizon and this time We saw jets flying toward the object. It would fade out and grow in intensity as it descended into the horizon. We observed it for at least 30 mins. It was no weather balloon. We looked through binoculars and it looked to have a diamond shape. I have always looked up and observed objects in the sky just never have seen anything like this. Any Ideas as to what I saw... Military? Ufo?"],"Summary":"Pulsating orb in desert southwest skys.","Country":"United States","Weather Factors":"Unknown","Latitude":"35.082263","Sighting Duration":"Undisclosed","Date Submitted":"08/12/2013 08:28 UTC","Case Number":"49758","Tags":"City","trends":["There have been no other sightings in San Fidel","This sighting has never been favorited."],"City":"San Fidel","Date of the Event":"08/11/2013 09:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.082263,+-107.599218(49758)&iwloc=A&hl=en\"> mufon case (49758) map </A>","Source":"MUFON","Object Flight Path":"Path then hovering","Region":"New Mexico","Object Features":"None","Viewing Distance":"Unknown","Log Number":"US-08122013-0010","Object Shape":"Diamond, Star-like"}