{"Object Shape":"Bullet, Missile","files":["/var/www/straped/mufon/html2text/49755.html.txt","/var/www/straped/mufon/org/49755.html"],"City":"Rewari","Case Number":"49755","Viewing Distance":"Over One Mile","Latitude":"28.18811","Longitude":"76.611542","Summary":"A very bright and missile shaped object was sighted, travelling from northern horizon to the southern horizon.","divs":["Sighting DetailsI am 29 years old, I was doing my graduation 2004 and it was my first year in the college. I used to live in the college hostel. It was a clear night, at around 10 o'clock me and 3 other friends went to the roof top of our hostel after having dinner. I was talking on the cellphone, suddenly something very bright caught my eye, I thought it might be a shooting star but then I again looked at it and it was still there, at that moment I knew it was not a shooting star because a shooting star would have disappeared in a flash but this object was very bright, you could see its shape, it was pointed as a missile and it had a very bright tail like a rocket and the tail was as long as the object itself. It was traveling at a very high speed and at a very high altitude. I am a pilot and I would say it was traveling approximately 20,000-25,000 feet high at around 7-8 Mach. It's size was enormous, somewhere around 400-500 feet long (with the tail). It kept traveling towards south without even making any kind of noise. It started from North on the horizon and it was visible till it reached the opposite end on the horizon in the South. There was no other building anywhere near our hostel as it was in the middle of a countryside so on a clear day (or night) you had an infinite visibility. It was possible to see from horizon to horizon from a roof top. The color of the object was bright silver and the flame was the same color as well. I asked my friends to look at it and even they didn't knew what that thing was. I was talking on the cellphone when this event started happening, the battery was about to die but as soon as that object reached right on top of us, I noticed that the battery of my cell phone was FULL. It was really strange for a cell phone to get charged up with in a matter of seconds. It was visible for about 5 to 6 minutes and we all had a very good look at it. I can tell you from my experience as a pilot that it was not something from this world. I have a very keen interest in aviation and I keep myself updated with the latest technologies and developments in the field and I could that it was not something I ever heard of. We don't have that kind of technology to develop anything like this which can travel around 7 or 8 Mach and not make any sound at all. We were not able to capture any picture or video of that object to prove the story but the events of that night are imprinted in my memory. At that time camera phones were not very popular in India and I just had a basic model (Nokia 3300) and none of us was expecting something like this so we didn't had any camera as well. I was watching TV the other day and there was a program on Discovery Science about the UFOs, and the story they were running was about the events of January 08, 2008 in Stephen ville, Texas. And it occurred to me that I should too report what I witnessed in 2004. I wanted to bring this story to the light, so that you could do some research on it and might be able to provide me with some answers about that object. I know that I cannot prove the events of that night as I don't have any proof of it, but then again how many people plan on seeing something like this? All I have is the memory of that night and whether anybody believe me or not I know that what I saw that night was something that not a lot of people can witness in their lifetime, so I consider myself very lucky."],"Tags":"City","Weather Factors":"Unknown","Source":"MUFON","Country":"India","Disposition":"Unresolved","Date of the Event":"02/17/2004 10:30 UTC","Date Submitted":"08/12/2013 04:36 UTC","Object Flight Path":"Straight-line path","Sighting Duration":"00:05:00","trends":["There have been no other sightings in Rewari","This sighting has never been favorited."],"Object Features":"Unknown","Region":"Haryana","map":"<A HREF = \"http://maps.google.com/maps?q=28.18811,+76.611542(49755)&iwloc=A&hl=en\"> mufon case (49755) map </A>","Log Number":"IN-08122013-0007"}