{"Tags":"City","City":"New York","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around August 7th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.721893,+-73.996803(49751)&iwloc=A&hl=en\"> mufon case (49751) map </A>","Object Features":"Unknown","Country":"United States","Object Shape":"Cigar","Latitude":"40.721893","Log Number":"US-08122013-0003","Longitude":"-73.996803","Summary":"Taking photos of storm moving North East, took several photos seconds apart and object appeared suddenly.","Object Flight Path":"Other","Region":"New York","Date of the Event":"08/07/2013 04:30 UTC","divs":["Sighting DetailsI was west of the airport (I don't believe it was an airplane), no wings and since I live on a runway approach lane I see them several times daily and this was much different in appearance. There was a storm south of location traveling North East, I took some photos with cell phone camera a few seconds apart and the object suddenly appears. I didn't notice it until I was showing the pics to my wife that evening, at 4:29:58 there is no trace of object, at 4:30:06 it is clearly visible but appears to be behind clouds because the object looks fuzzy. At first I didn't think anything of it, just found it odd that it appears out of nowhere like that when 8 seconds earlier it wasn't visible. The object is brownish in color and cigar or rectangle shaped. I don't know if it moved or not because at the time I was looking lower in the sky at the storm in the distance. I don't really have any feelings on the matter, I was familiar with your organization from television and figured I would report it to people who take an interest and study things like this. I didn't lose site of the object since I never actually saw it until I reviewed the pics several hours later."],"Disposition":"Unresolved","Sighting Duration":"Undisclosed","Source":"MUFON","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/49751.html.txt","/var/www/straped/mufon/org/49751.html"],"Weather Factors":"Unknown","Case Number":"49751","Date Submitted":"08/12/2013 02:37 UTC"}