{"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Features":"None","City":"Chilhowie","Country":"United States","Object Shape":"Star-like","Disposition":"Unresolved","Tags":"City","Latitude":"36.798448","Log Number":"US-08122013-0002","files":["/var/www/straped/mufon/html2text/49750.html.txt","/var/www/straped/mufon/org/49750.html"],"divs":["Sighting DetailsI saw a bright light from the window, as I was watching tv late into the night tonight. I'm pretty sure the light was unrelated to the object I have been observing, however the light was very bright, and gave me weird feeling, like I should look outside. After a few minutes it finally got to me and I looked outside for a minute, then suddenly in the distance this object caught my eye, In this area there is basically nothing, my home is placed on a hill where I can see pretty much the whole town, and the interstate from my bedroom window. This object is below the clouds, because its cloudy tonight and you can see no stars or even the moon. This object is an orange red, sort of like a street light (at least in my area) except really far away, I've watched it for a long time now, It starts to dim then gets bright again, and has not moved at all during the time I have been observing it. Even as I write this I still glance out the window which I have since moved my chair to and opened, so I can observe, and its still there. Still pulsating and remaining stationary. There are no objects or points of light even remotely close to this object (rural area, 1.8k town population). I'm not sure that witnessing this object has given me any special feelings, other than blatant curiosity."],"Date Submitted":"08/12/2013 02:36 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.798448,+-81.682341(49750)&iwloc=A&hl=en\"> mufon case (49750) map </A>","Region":"Virginia","Viewing Distance":"Over One Mile","Longitude":"-81.682341","Date of the Event":"08/12/2013 02:25 UTC","trends":["There have been no other sightings in Chilhowie","This sighting has never been favorited."],"Object Flight Path":"Stationary","Case Number":"49750","Summary":"Light in the sky, pulsating stationary. Cloudy night, under the clouds","Source":"MUFON"}