{"Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Region":"Michigan","Tags":"City","Country":"United States","Case Number":"49764","Date Submitted":"08/12/2013 02:59 UTC","City":"Port Huron","Longitude":"-82.418174","Object Shape":"Sphere, Star-like","Source":"MUFON","Log Number":"US-08122013-0016","divs":["sighting detailsi was on the back porch of my cottage on lake huron watching early persied meteor shower at about 11:40 pm, on 8\\10\\13. i saw a few satellites pass by also. then noticed what appeared to be a satellite except much brighter (like a star is bright)heading from north, to south, toward my location for about 8 seconds. i started watching it at about 65 degrees above me. at about 87 degrees above me, it hooked (close turn)an immediate left turn, and headed east over lake huron toward canada. about three seconds after it made the turn the brightness totally disappeared. it blinked right out. i have five telescopes, and am an amateur astronomer. i sky watch all the time. it had a brightness almost of venus, that's what caught my attention. so i knew it couldn't be a satellite. then came the abrupt left turn to head east. unless their was a collision up there, it could not have changed direction, and proceeded as though it was an intended maneuver. after it headed east, about four seconds later the light blinked right out. i might add it was moving faster than a satellite's steady pace."],"Disposition":"Unresolved","Latitude":"42.975433","map":"<A HREF = \"http://maps.google.com/maps?q=42.975433,+-82.418174(49764)&iwloc=A&hl=en\"> mufon case (49764) map </A>","Summary":"Bright glowing white object, changed direction","trends":["There have been 11 other sightings in Port Huron","There were no other sightings in Port Huron on or around August 10th 2013"],"files":["/var/www/straped/mufon/html2text/49764.html.txt","/var/www/straped/mufon/org/49764.html"],"Object Features":"None","Weather Factors":"Unknown","Viewing Distance":"Unknown","Date of the Event":"08/10/2013 11:40 UTC"}