{"files":["/var/www/straped/mufon/html2text/49767.html.txt","/var/www/straped/mufon/org/49767.html"],"Case Number":"49767","Date Submitted":"08/12/2013 03:57 UTC","Tags":"City","Viewing Distance":"101-500 Feet","Longitude":"-117.957958","trends":["There have been 27 other sightings in Garden Grove","There were no other sightings in Garden Grove on or around January 28th 2004"],"Date of the Event":"01/28/2004 01:19 UTC","Source":"MUFON","Object Shape":"Blimp, Cone, Cylinder, Fireball, Flash, Sphere, Other","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Latitude":"33.788801","divs":["Sighting DetailsFirstly may express that I believe I am talking to people who understand with belief about this message. I do not believe I will be taken for a hoaxer, liar or thought to be crazy. Everything in this message, including attachments are real and true to the best of my knowledge. Attached is a short document describing my very close UFO encounters and abduction experiences, as I firmly believe I was abducted 3 times up until now. I believe I was abducted the third time just 7 days ago where my mother was involved as an eyewitness. I already reported this to MUFON using the report form. Also, I had a number of alien encounters totaling 14 so far up until now. Every one of my alien encounters were a different type of alien, including different species of grey. I have no idea why I had so many encounter experiences, as they were all very real where some cannot be explained not being real. Of all this all I got to show for it as proof is 7 small spots on my arm that form 5 perfect triangles, and my photos and film. I do not know how I got the spots, as I discovered them one day in 2005 while sitting in my bed. 4 of the spots form a perfect cross. My doctor said he never saw anything like it. I would photograph my arm, but I have not had access to a camera over the years. I photographed and filmed UFOs in my area within a half mile from my home. I already sent you my \"REAL UFOs\" DVD that is an hour and 3 minutes long. I filmed mostly from a cul-de-sac that is down my street. I have not heard from you about it. I filmed from 2004 to 2006, but not every night. Yesterday I saw a cable program describing things about space that was not UFO related, but I learned in relating my photos, film and personal experience that Quantum Mechanics and use of dimensions probably have something to do with UFOs and how they travel. This is probably nothing new to you being I understand that the government has loads of stuff like crashed UFOs and bodies. My abduction when I was 26 is unusual in relating it to most other abductions. I do not know of any purpose for any of my abductions. I hope I have been help, and I hope you enjoy reading my document. Thank you, and I hope to hear from you soon. Best, Thomas P.S. I will research for a way to put my DVD in my computer. If I can I will promptly send it to you. The photos attached were derived from my DVD. \");"],"Weather Factors":"Unknown","Log Number":"US-08122013-0019","Summary":"A lifetime of paranormal experience","map":"<A HREF = \"http://maps.google.com/maps?q=33.788801,+-117.957958(49767)&iwloc=A&hl=en\"> mufon case (49767) map </A>","City":"Garden Grove","Disposition":"Unresolved","Object Features":"Dome, Wings, Other","Country":"United States","Region":"California","Sighting Duration":"00:03:30"}