{"Sighting Duration":"00:02:10","Viewing Distance":"101-500 Feet","Longitude":"-7.331347","Case Number":"49778","files":["/var/www/straped/mufon/html2text/49778.html.txt","/var/www/straped/mufon/org/49778.html"],"Latitude":"52.359767","Object Features":"Unknown","Date Submitted":"08/12/2013 09:15 UTC","Tags":"City","Region":"Kilkenny","Country":"Ireland","trends":["There have been no other sightings in Piltown","This sighting has never been favorited."],"divs":["Sighting Detailson the 12 of august at 11:25 pm me and my family waited out the back of the house scanning the skies for the meteor shower happening that night, and as i looked to the south east i looked at the horizon and saw what looked like a star but after a few seconds i could see it was getting closer. It flew in a direct flight path, and was golden in appearance and was pulsating brighter and brighter . This object was moving slowly enough that it lasted over 2 minutes . It was totally silent moving from SE to SW. I could see also that as it passed over my house apart from the pulsating orb itself all around it the sky glowed to a certain extent . And as a UFO believer i couldn't take my eyes off it, it was as if I was glued to the ground i stood, the fact that we don't see a lot of UFO's or rarely here about them here in Ireland it left me more bewildered gazing at it. It was quite a weird feeling after seeing it as it would have been very large if it wasn't as high up. I lost sight of the object then when i passed the horizon again. as it was my first sighting I now know to run and get a camera as it would of been able to be picked up on film . All I can say is I hope I get to see more."],"Log Number":"IE-08122013-0029","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=52.359767,+-7.331347(49778)&iwloc=A&hl=en\"> mufon case (49778) map </A>","Weather Factors":"Unknown","Summary":"while waiting for the meteor shower i watched the skies with my family , on the horizon i saw a pulsating golden orb and it travelled slowely SE to SW over my house and it moved to the horizon","City":"Piltown","Date of the Event":"08/12/2013 11:25 UTC","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Object Shape":"Sphere"}