{"Sighting Duration":"00:15:00","Date of the Event":"03/31/2013 08:45 UTC","Latitude":"38.659786","Longitude":"-121.257401","map":"<A HREF = \"http://maps.google.com/maps?q=38.659786,+-121.257401(49773)&iwloc=A&hl=en\"> mufon case (49773) map </A>","Source":"MUFON","files":["/var/www/straped/mufon/html2text/49773.html.txt","/var/www/straped/mufon/org/49773.html"],"divs":["Sighting Details1. I was on my driveway loading my friends equipment into his car. 2. They were moving across the sky toward our direction and were an unusual color and size and flickering. 3. A plane. 4. They came in from the West. The first one coming in slower and more Northerly in origin. They came in silently and then seemed to slow and then ascend into the clouds above. Each time coming in from a more Southern origin and going up a bit further north. The last ones came in quickly as if to \"catch-up\". They appeared to flicker and were an orange like glow. they had a dome or disk on top of the glowing sphere and the sphere appeared to be translucent. There appeared to be a static light emitting on to the surrounding clouds which I first thought was \"bugs or a bat\" on my video screen. They appear to have a camera like structure or an eye like thing moving about inside. 5. I was excited and nervous afterward I was scared and actually spent the night at my partners home. 6. They all eventually disappeared into the clouds"],"trends":["There have been no other sightings in Fair Oaks","This sighting has never been favorited."],"Object Features":"Unknown","City":"Fair Oaks","Object Shape":"Circle, Disc, Sphere","Disposition":"Unresolved","Log Number":"US-08122013-0024","Viewing Distance":"501 Feet - 1 Mile","Summary":"Yellow/orange glowing globes under a disk like hood silent traveling across sky and then ascending into clouds.","Country":"United States","Tags":"City","Object Flight Path":"Straight-line path,Path with directional change","Date Submitted":"08/12/2013 07:32 UTC","Case Number":"49773","Region":"California","Weather Factors":"Unknown"}