{"Log Number":"US-08122013-0023","divs":["Sighting DetailsIt was on the night of August 1, 2013. Approximately 10:15 pm. I was accompanying my brother while he was taking his girlfriend home along with my friend, and cousin (walking). It was very dark out. I was starring into the night sky just like anybody else would. Of course, at this time airplanes and helicopters were still flying around. Then, out of no where I saw this 3 red-orange dots that to me looked like the size of a star because they were about 4.5-5 miles away at the most. I saw those three dots making the shape of a triangle. I could not see a craft because of how dark it was, but the dots were bright enough for me to know that it was a (triangle shape) UFO. I am sure that it was not a plane or a helicopter. It was flying at a pretty fast speed, then it made a full on \"U\" turn and went the other way. Unfortunately for us, there was a tall tree nearby which prevented us from seeing where it went. I may not have the greatest sight, but I SAW A UFO. But then again, if you don't believe me, ask my brother, he was also a witness. His girlfriend, nor my friend or cousin saw it. Only my brother and I. I was shocked. We were shocked. For year and years I heard many people say they weren't real. That it was all fake. And I refused to believe. And now that I have witnessed it with my own eyes. It has inspired me to become a Ufologist!"],"Latitude":"34.432299","map":"<A HREF = \"http://maps.google.com/maps?q=34.432299,+-117.293848(49772)&iwloc=A&hl=en\"> mufon case (49772) map </A>","Object Features":"Unknown","Case Number":"49772","Country":"United States","files":["/var/www/straped/mufon/html2text/49772.html.txt","/var/www/straped/mufon/org/49772.html"],"Tags":"City","trends":["There have been 8 other sightings in Hesperia","There were no other sightings in Hesperia on or around August 1st 2013"],"Disposition":"Unresolved","Sighting Duration":"00:00:10","City":"Hesperia","Region":"California","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Viewing Distance":"Over One Mile","Object Shape":"Triangle","Longitude":"-117.293848","Summary":"They're here. And they're watching.","Date Submitted":"08/12/2013 07:39 UTC","Date of the Event":"08/01/2013 10:15 UTC","Source":"MUFON"}