{"files":["/var/www/straped/mufon/html2text/49789.html.txt","/var/www/straped/mufon/org/49789.html"],"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.342942,+-88.268637(49789)&iwloc=A&hl=en\"> mufon case (49789) map </A>","Weather Factors":"Unknown","Date Submitted":"08/13/2013 04:34 UTC","Source":"MUFON","Country":"United States","Object Shape":"Unknown","Longitude":"-88.268637","divs":["Sighting DetailsLight: As I was looking toward Perseus from the front yard of my home for some comet debris action, I noticed a pulse of light near Capella. I thought it was just a flicker from atmospheric disturbance, but when I focused on it, I saw nothing. Then I saw another pulse not far from the first. The pulses of white light continued steadily, occuring every 10 seconds. They weren't quick, like the flashes of light on any aircraft I've before seen. They gradually gained luminance and dissipated at the same rate, spanning about one second. After 6 pulses, I saw no more flashes. The last two were not as bright as the first four. Movement: The object moved in (presumably, because I could see nothing besides the light pulses) a straight path due East. It started at about level with Capella, just a few degrees to the left of it. Its path went a few degrees under the star, and 5-10 degrees to the right and 3-5 degrees below it, the pulses faded. I heard no sound. I've felt completely normal all day and still do. It seemed very far away...but I'll leave the speculation up to you. Apologies for approximations in measurements. I only have my hands to measure for the time being."],"Date of the Event":"08/13/2013 02:30 UTC","Tags":"City","City":"McHenry","Latitude":"42.342942","trends":["There has been one other sighting in McHenry","There were no other sightings in McHenry on or around August 13th 2013"],"Case Number":"49789","Summary":"White light pulses 10 seconds apart","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Object Features":"Unknown","Region":"Illinois","Sighting Duration":"Undisclosed","Log Number":"US-08132013-0005"}