{"trends":["There have been no other sightings in Miskolc","This sighting has been favorited 1 time."],"Disposition":"Unresolved","Log Number":"HU-08132013-0009","Object Shape":"Cigar","Viewing Distance":"Unknown","Tags":"City","Latitude":"48.062112","Object Features":"Other","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=48.062112,+20.825292(49793)&iwloc=A&hl=en\"> mufon case (49793) map </A>","divs":["Sighting DetailsAugust 13, 2013: Me and my friends decided to have a normal grill party at a house in the outskits of a bigger city. Once it got dark we were amazed by the stars and one of us came up with an idea to get some chairs and organize a so to say mini \"comethunt\". By this time it was around midnight and 7-8 of us were gazing directly up at the sky. I have a personal addiction to watch the stars almost every night, an because of this I'm quite confidant to say that I can distinguish stars from satellites and other commercial airplanes that usually cross our part of the sky. After sharing some of my knowledge with the others on what to look for, and what they can actually see, a good hour or so has gone by and we've seen about a dozen of comets (I apologise if i'm using the wrong term). One of us made a comment on how breath-taking the view is, and I responded by saying: \" Yea, times like these that keep me believing that we are not alone out there. \" I have to admit that the mere idea of life existing anywhere else has always kept me secretly wanting to find out the \"truth\", I did my own researches based upon collecting every possible bit of data on topics concerning all the branches that lead out of the main idea of ET life. My goal is to know about everything, even if its a lie, hoax, fake or maybe real, I wanna have my own personal database and by time trim of the unnecessary parts, and say \" Yea guys, i knew this way back.\" Nevermind I just think this information was needed to properly make a judgement. 1-2 minutes later it suddenly happened, on a clear part of the sky, this huge black object appeared, everybody yelled suddenly to score a new comet for themselves, but then we realised that its something different, it was definitely cigar shaped and quite large. Had two lights , one on the very front and one on the back, they were red and quite bright. Without any sound it made its way from W to E and while we were looking at it, it made a what happened to be like a small correction to its flightpath. This was the point when everybody was really excited, some of us were asking, what is that thing?, others were trying to help the rest spot it. In a short time period it started to speed up a little and fade out, this is the closest i can describe it, the interesting thing was that the lights came closer to each other, and at that moment I questioned myself, is that really one object ( maybe it was two separate just had an optical illusion of seeing it as one , or vice versa) . After fading, my first reaction and thought was simply : \" Reptilians\" . I don't know why this came to my head, but it just simply did, after the sighting we summarized with the others what it might have been, and checked if any of us had missing time."],"Case Number":"49793","Date of the Event":"08/13/2013 01:00 UTC","Summary":"Sudden appearance of a cigar-shaped UFO","files":["/var/www/straped/mufon/html2text/49793.html.txt","/var/www/straped/mufon/org/49793.html"],"Date Submitted":"08/13/2013 10:18 UTC","Region":"Borsod-Abauj-Zemplen","Weather Factors":"Unknown","Longitude":"20.825292","Source":"MUFON","City":"Miskolc","Country":"Hungary"}