{"Country":"United States","Latitude":"37.346906","Source":"MUFON","Object Features":"Unknown","divs":["Sighting DetailsThat night I had trouble sleeping, I moved from one place to another and felt heat. Time passed, hours I think, when I feel something watching me from my feet. (I would like to clarify that since childhood paranormal things happen to me, then I could manage quite well the fear) I sat up to see who had this once at my feet, then I see what I never imagined seeing in my home. An alien, one which many describe, gray, approximately five feet, big eyes, long and black. My intention was to talk to him, but then he approached me and held my thumb. That made me fall back and faint. I woke up, I was in a stone building with no glass windows, I went through one of those windows, I was alone, but then, through a window in front of me, a person came with a gun in his hand, shooting, someone else appeared behind me, shooting well, the first person I saw ran away, but one of his bullets went into my stomach, and had blood touched me, I fell back, as he watched the two men leave, shooting. Something came behind me, grabbed my shirt and pulled me back. I fainted. When I awoke, I was in a operating room with two people, one to my left I could not see, only hear. And a doctor in front of me. Full of contempt, threw dust on my gunshot wound, now my wound had tubes coming out of it, the dust also fell on my face, my soul began to leave my body, I thought I would die, I listened to the person who had to my left, the person asking the doctor to save me, suddenly everything changed, I began to remember that people who had been shooting were not human, they were aliens, my soul back to the body, and I saw the doctor that was actually a alien, the other person on my left, still could not see. My attention went to the doctor, he was doing something to my injury, I tried to move, but could not, the doctor looked angry, I was worried it would not make things right, then the injection brought a very large, I do not know how, but I managed to free my right hand and took the doctor's hand, held the large injection and wrestled with the doctor, his skin was cold, dry, bony, but it was stronger than me. I argued with one hand and with the other he injected me. Again, my soul began to leave the body, I thought I probably had died. But then, I woke up in my bed, the blankets on the floor, my body took a while to feel fully awake. I looked at my husband slept on my right. I picked up the blankets and went back to sleep. I thought it was a dream. The next morning I told my husband everything. The day went normal, but the unthinkable happened. The next morning, about 8 am, it was Sunday, my husband woke up first, he felt that something was at our feet, then he saw an alien standing, looking at us when my husband reacted, the alien took a step back and disappeared. I should add: Since I was twelve, I used to write my dreams every day, if I try to remember this experience, without reading it, I can not remember exactly. But there are images that I do not forget, as the image of the alien doctor. My husband is not afraid of the unknown. he was calm when he saw the being."],"Sighting Duration":"Undisclosed","trends":["There have been 106 other sightings in San Jose","There were no other sightings in San Jose on or around August 27th 2011"],"Viewing Distance":"20 Feet or Less","Summary":"Entity came to my bed","Tags":"City","Region":"California","City":"San Jose","Log Number":"CR-08132013-0016","Object Shape":"Unknown","Object Flight Path":"Unknown","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.346906,+-121.890206(49801)&iwloc=A&hl=en\"> mufon case (49801) map </A>","files":["/var/www/straped/mufon/html2text/49801.html.txt","/var/www/straped/mufon/org/49801.html"],"Date of the Event":"08/27/2011 02:00 UTC","Case Number":"49801","Date Submitted":"08/13/2013 03:15 UTC","Longitude":"-121.890206","Disposition":"Unresolved"}