{"Viewing Distance":"501 Feet - 1 Mile","Region":"California","Country":"United States","City":"Madera","Date of the Event":"08/11/2013 08:45 UTC","trends":["There have been 2 other sightings in Madera","There were no other sightings in Madera on or around August 11th 2013"],"Log Number":"US-08132013-0016","Date Submitted":"08/13/2013 03:05 UTC","Latitude":"36.965706","Weather Factors":"Unknown","Longitude":"-120.054438","files":["/var/www/straped/mufon/html2text/49800.html.txt","/var/www/straped/mufon/org/49800.html"],"Summary":"Red orangish pulsating orb ascended from behind the treeline North, then continued to fly southeast and dimly vanished.","Source":"MUFON","divs":["Sighting DetailsIn my Fathers backyard watching for meteor showers I noticed a red light emerging from behind the treeline along the fence to the North side of the yard, at first I thought it was just a regular plane but then it got to be more above us but still the distance of a regular plane would be but you could easily tell it was spherical shaped and it had a red orange flame-like pulse that was lighting it up, there were no sounds no trails or emissions, it moved very smoothly across the sky, there were four of us in the backyard that saw it clearly and all of us agreed it was something we have never seen before I was in awe by what it may be or what it is doing, the object kept traveling Southeast and eventually started to dim and vanished so we could no longer see it. As we were gathering our thoughts after this experience we were all shocked and nobody knew what to think about it other than a UFO, about ten minutes pass and a second one rises from the treeline in the same spot and travels the same exact path as the first looked the same exact way."],"Sighting Duration":"00:10:00","Object Flight Path":"Straight-line path","Tags":"City","Case Number":"49800","Disposition":"Unresolved","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.965706,+-120.054438(49800)&iwloc=A&hl=en\"> mufon case (49800) map </A>","Object Shape":"Fireball, Sphere"}