{"Tags":"City","Object Shape":"Boomerang, Triangle","Object Flight Path":"Path then hovering","trends":["There have been 48 other sightings in Modesto","There were no other sightings in Modesto on or around July 1st 1996"],"Log Number":"US-08132013-0024","divs":["Sighting Details4:Description of the object(s): All black boomerang shape. Or like the stealth bomber that can stop in mid flight. First object from left to right, moving in a normal straight line like a passenger jet. Then about a head turn, corner of the eye, in the peripheral field of view to the right, we noticed a second identical craft on the same normal straight path but right to left as to head exactly towards the 1st craft. At this point we focused on the 2 as they were about the same size and same altitude as to be on a head on collision but moving casually as high up passenger jets apear to be moving from a ground perspective. Then that's when it got weird. A 3rd craft appeared from the left and a 4th from the right and 5th from the left and so on until there was about 4 on each side heading in a head on collision path but moving very casual. For example extend both of your arms straight up above you as to give a double high5 to the sky not like diving in a pool but more like a hand stand now focus on your finger tips and slowly bring your hands together as to touch finger tips to finger tips, and stop, leaving about 1 inch of space so your hands don't touch. That's exactly what the objects did. Once they met in the sky, both groups stopped at the same exact time not in any organized fashion just 4 on the left and 4 on the right all 4 next to each other on the left all 4 next to each other on the right and a gap between both groups. They did not move for what seemed to be minutes but was most likely 30-45 seconds. Then they did a \"jump\". Meaning we could see the quick movements of their path but more like a flash as if to continue their path in either direction but vanishing. We saw them all \"jump\" at the same time. They disappeared no smoke no noise no flash no lights. Nothing just gone. 1. Friends front yard looking skyward. 2 saw a second object. 3 airplane. 5: confused scared and afraid. I was 10 at the time and never had an interest in UFO's. I was so scared that I had my friends dad walk me home during they day not night time but broad day light, about 5 houses down from where we were, my friend ran inside his house and we didn't go outside all day after that..I remember telling my parents but as usual who believes anything a 10 year old has to say? 6. They were facing each other and they did a \"jump\" very fast movements and vanished, turned invisible, teleported who knows? Kinda like watching ants on the ground but do a freeze frame, then push play but right as they take the first step they disappear."],"Region":"California","City":"Modesto","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/49809.html.txt","/var/www/straped/mufon/org/49809.html"],"Summary":"6-10 boomerang like aircraft. 6 moving towards 6 other similar like craft","Date of the Event":"07/01/1996 05:00 UTC","Source":"MUFON","Disposition":"Unresolved","Sighting Duration":"00:05:00","Case Number":"49809","map":"<A HREF = \"http://maps.google.com/maps?q=37.682545,+-120.987367(49809)&iwloc=A&hl=en\"> mufon case (49809) map </A>","Latitude":"37.682545","Object Features":"Wings","Longitude":"-120.987367","Viewing Distance":"Over 1 Mile, Unknown","Date Submitted":"08/13/2013 07:02 UTC","Country":"United States"}