{"Region":"Minnesota","Summary":"Hang-Glider Boomerang shaped V craft hovering my head in Duluth Skyline District","Object Shape":"Boomerang","Viewing Distance":"Unknown","Country":"United States","Longitude":"-92.095895","Latitude":"46.796202","Case Number":"4980","Disposition":"IFO","trends":["There have been 16 other sightings in Duluth","There was one other sighting in Duluth on or around August 15th 1970"],"Object Flight Path":"Undisclosed","Tags":"City","Date Submitted":"08/15/1970 12:00 UTC","Log Number":"US-06242006-0001","divs":["sighting detailsi was on duluth's skyline and was overlooking the harbor when i heard a slight \"swoosh\" noise and looked up and saw this v shaped craft slowly going over my head and i watched it for approximately 5 minutes til i saw it going in the general direction of superior, wi. i was on the phone at the time leaving a voice mail on a friend's phone. i saw something in my peripheral vision as i looked over the duluth harbor as i enjoy looking up at the sky from time to time to see the satellites that our circling our skies. at first, when i noticed it i thought it was a new plane of some kind but, i didn't hear any engine noise whatsoever it seemed as if it was floating about 100 feet above me and i saw that it did in fact blocked out the stars as it was passing over my head at a slow rate of about 20 miles an hour from what i could tell. it had a total of 8 lights; 4 on each wing that were yellowish\\orangish in color and they were not pulsating but, dimmed in color. i just stood there and watched it til i couldn't see it anymore and then contacted my sister and my mother and told them what i had saw. i felt that was a once in a lifetime experience and my neck hurt because i was looking up in the sky anticipating that it would come back; at least that was my general feeling. my heart was racing and felt like i was planted and couldn't take my eyes off it and it was something that i know was not of this world as i do plenty of research and reading and watching documentaries that this was not something of our military or earthly. i know now that i'm a firm believer and i know what i saw and it's something that i will never forget this night. sincerely, believer"],"map":"<A HREF = \"http://maps.google.com/maps?q=46.796202,+-92.095895(4980)&iwloc=A&hl=en\"> mufon case (4980) map </A>","Source":"MUFON","Weather Factors":"Unknown","City":"Duluth","Sighting Duration":"Undisclosed","Date of the Event":"08/15/1970 12:00 UTC","files":["/var/www/straped/mufon/html2text/4980.html.txt","/var/www/straped/mufon/org/4980.html"],"Object Features":"Undisclosed"}