{"Object Flight Path":"Straight-line path","Region":"Tennessee","divs":["Sighting DetailsI was outside on balcony taking pictures of sunrise. I have done this many times but never videoed. All at once, I thought \"I have never filmed the sunrise\". I turned my camera to \"record\" and videoed a short segment of sunrise. I did not see it as I was filming..it was too fast. Upon viewing the video enlarged, I saw a small craft going incredibly fast over the city. It takes a jet 65-73 seconds to take off from the airport and go over the city and be above my building. This craft crossed the city in 2.5 secs. (about a 20 mile section). After filming this, I went back over pictures taken from my balcony. I see strange lights in some. Two weeks ago, while in the mountains, I took a picture from my car and caught a strange light anomaly. My son, husband and I saw 3 green orbs from our apartment last year. They hovered, flowed into one and disappeared. They were a glowing, phosphorous green color. My husband has no memory of it but my son and I do. I have had this video viewed by one other person who took it, enlarged it, and viewed it frame by frame. He says it is either saucer or cigar shaped, at an incredible speed and on an upward trajectory. It seems to come from nowhere."],"Latitude":"36.15085","Viewing Distance":"501 Feet - 1 Mile","Case Number":"49813","Date Submitted":"08/13/2013 11:34 UTC","Longitude":"-86.783913","Country":"United States","City":"Nashville","Summary":"Video from balcony","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.15085,+-86.783913(49813)&iwloc=A&hl=en\"> mufon case (49813) map </A>","files":["/var/www/straped/mufon/html2text/49813.html.txt","/var/www/straped/mufon/org/49813.html"],"Log Number":"US-08132013-0027","Object Shape":"Bullet, Missile","Sighting Duration":"00:00:03","Tags":"City","Date of the Event":"07/24/2013 05:58 UTC","Object Features":"Unknown","Source":"MUFON","Disposition":"Unresolved","trends":["There have been 72 other sightings in Nashville","There were no other sightings in Nashville on or around July 24th 2013"]}