{"map":"<A HREF = \"http://maps.google.com/maps?q=42.288216,+-83.738988(49819)&iwloc=A&hl=en\"> mufon case (49819) map </A>","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/49819.html.txt","/var/www/straped/mufon/org/49819.html"],"Summary":"Observed reddish glowing object pass from north to south nearly over my parked police car. Silent. Ten mile visability - clear skies. Out of view in 2.5min... then saw diagnal flash/streak of light - 45 degrees - between horizen to sky/space.","Object Shape":"Circle, Sphere","Longitude":"-83.738988","divs":["sighting detailsi am a veteran police officer and i was sitting in my patrol car in a parking lot (parked facing east) on the eastside of ann arbor, mi when this incident occurred just after midnight. weather conditions were at the time (i checked as soon as this event was over with weather.gov for ann arbor municipal airport) - 56', clear skies, n wind 7mph, visability 10miles. skies were dark with minimal surface lights at the location i was sitting. i could see planes and stars in the distance from my location. detroit metro aiport is about 25 miles east of this location i noticed a reddish glowing object (with a bright white center) approaching from the north relatively low in the horizon sky. the object was extremely bright and emitted a constant glow which stood out against the black clearness behind it. there were no blinking\\flashing lights associated with the object that a plane or helicopter would have so i was not sure what it was. it was moving at what appeared to be a relatively quick,constant pace. as it got closer, i could tell it was high off the ground (but nowhere near as high as planes in the background). i could not make out the actual size as there was nothing behind it to visually compare with and the glow masked or covered any actual shape. it passed in front of my patrol car at about 75 degrees off the horizon as i had to tilt my head up and lean forward towards the windshield when it passed overhead in front of my location. the object made no noise whatsoever. there was no vehicular traffic or other background noise occuring at the time... there was no police chatter on my radio. it was complete silence when it passed over my location. i tried to light the object up with my spotlight but it did not reflect any light. the glow was much brighter than my spotlight beam. as it started to get overhead, i began to film it with my in-car video system (moving the mounted camera with my hand). i followed the object with my video and was able to zoom in on it before it had gotten too far south (out of camera view). the object was recorded on my video from 00:06:27hrs to 00:07:07hrs (40 seconds) once it was past my video viewing range, i stepped out of my patrol car and tried to spotlight it again but it was out of the spotlight's range. i continued to watch the light as it continued south and eventually it was out of sight. as it moved away, the glow remained constant but the size of the object got much smaller until it disappeared. the speed of the object appeared to remain constant as did the path. moments after losing sight of the object (which was well above any trees or structures), i observed a split-second flash\\streak of light at a 45 degree angle left towards the east (between the distant horizon and sky\\space). the whole sighting event (from first observation north to when i lost sight of the object south) was about 2 min 30 sec. the distance the object covered (moving north to south) from when i first noticed it i would estimate to be about 15-20 miles."],"City":"Ann Arbor","Case Number":"49819","Weather Factors":"Unknown","Region":"Michigan","Date Submitted":"08/14/2013 02:30 UTC","trends":["There have been 18 other sightings in Ann Arbor","There were no other sightings in Ann Arbor on or around August 14th 2013"],"Object Flight Path":"Straight-line path","Date of the Event":"08/14/2013 12:00 UTC","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Latitude":"42.288216","Sighting Duration":"00:02:30","Source":"MUFON","Country":"United States","Log Number":"US-08142013-0005"}