{"Object Flight Path":"N/A","Date of the Event":"08/14/2013 11:03 UTC","Object Features":"None","City":"Clermont","files":["/var/www/straped/mufon/html2text/49818.html.txt","/var/www/straped/mufon/org/49818.html"],"Tags":"City","Log Number":"US-08142013-0004","Weather Factors":"Unknown","divs":["sighting detailsthe first time that i saw the thing was when i was playing basketball outside at night. i was just dribbling the ball when something caught my attention out of the corner of my eye. i looked at the top of the wooden gate\\fence that was behind the hoop and i saw something with big eyes looking at me. as soon as we made eye contacted it dropped behind the fence. i ran to the fence and looked behind it and the thing was gone. the whole siting lasted for about 3-4 seconds. i thought that i was just seeing this so i just went inside and kept the whole ordeal to myself. the next time is the one that made me realize that i was actually seeing something real. i had just dropped off my friends at their house and was now coming up to my house. i started to pull down into the driveway whe i looked down the small hill to the base of the drive way and saw this 2-3ft tall, grey-ish green-ish, blue-ish skinny thing with a abnormally large head and big eyes run across the driveway, around the fence, and towards the back off my house. i was so scared the i swerved away from my driveway and drove around my neighborhood until i felt it was okay to go home. when i got home no one was awake. i immediately turned on all the lights in my house and then went to bed. while in bed, i heard a strange whistling noise coming from outside my window (which is behind the fence). my phone then turned off for no reason. i took a long time for it to go back on. both of the \"sightings\" happens at about 11:45pm and were right after thunderstorms."],"Country":"United States","Source":"MUFON","Latitude":"28.555415","Sighting Duration":"Undisclosed","Object Shape":"Other","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=28.555415,+-81.771604(49818)&iwloc=A&hl=en\"> mufon case (49818) map </A>","Date Submitted":"08/14/2013 01:29 UTC","trends":["There have been 7 other sightings in Clermont","There were no other sightings in Clermont on or around August 14th 2013"],"Region":"Florida","Summary":"I've seen this thing twice. I was very scared the second time","Viewing Distance":"21-100 Feet","Longitude":"-81.771604","Case Number":"49818"}