{"Latitude":"25.649806","City":"Miami","Longitude":"-80.382514","Sighting Duration":"00:30:00","Country":"United States","Disposition":"Unresolved","Region":"Florida","Source":"MUFON","Case Number":"49829","Date Submitted":"08/14/2013 09:41 UTC","divs":["Sighting Details This object have been observed from this location multiple times, and have been reported to MUFON several time too. Object first spotted with a security camera that was scanning the sky at 7:45pm, it was visible to the naked eye but very hard to see if you did not know where to look at, this object stayed in the general area of the sky until 8:15pm until it was fading slowly away. A speeding view of the footage from this camera shows that this objects made a LOOP in its movements. That footage is attcjed with this report. After the object was first spotted by this security camera, two additional cameras were setup and I was able to record extensively from a Samsung camera with zoom lens and a Sony HD camcorder. Again this is a point-like, very bright point of light. Since its trajectory does not follow a straight line we can infer that it is not an astronomical object or man made satellite. The size of the video files will make uploading all of them here almost impossible, but I will attaching the speed-up footage showing the LOOP and the fooatge from the Samsung camera with zoom."],"files":["/var/www/straped/mufon/html2text/49829.html.txt","/var/www/straped/mufon/org/49829.html"],"trends":["There have been 97 other sightings in Miami","There was one other sighting in Miami on or around August 13th 2013"],"Object Shape":"Star-like","Weather Factors":"Unknown","Viewing Distance":"Over 1 Mile, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=25.649806,+-80.382514(49829)&iwloc=A&hl=en\"> mufon case (49829) map </A>","Date of the Event":"08/13/2013 07:15 UTC","Summary":"Star-like object first spooted on the north-east direction, about 45 degrees over the horizon","Object Flight Path":"Path with directional change,Other","Tags":"City","Object Features":"None","Log Number":"US-08142013-0015"}