{"files":["/var/www/straped/mufon/html2text/49821.html.txt","/var/www/straped/mufon/org/49821.html"],"Object Features":"None","Tags":"City","trends":["There have been 2 other sightings in Spokane Valley","There were no other sightings in Spokane Valley on or around August 13th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=47.675628,+-117.234265(49821)&iwloc=A&hl=en\"> mufon case (49821) map </A>","Summary":"two lights flying almost overhead","Weather Factors":"Unknown","Latitude":"47.675628","Longitude":"-117.234265","Log Number":"US-08142013-0007","Region":"Washington","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","divs":["Sighting DetailsMy wife and I stepped outside around 1120 pm to have a smoke. I was looking up towards the south-south east sky when I noticed two lights, about the size of a star, moving in a straight line towards the north east, one following the other, with the trailing light seeming to be \"towed\". I thought my eyes were playing tricks on me but my wife noticed them about the same time I did. They did not appear to be any plane or satellite that I have ever observed. As I said before, the trailing light seemed like it was being towed by the leading light. They did not change direction and kept a constant speed and distance between them. The \"towed\" object looked like a car being towed by another car with a rope...it looked like the \"rope\" was slacking and then the leading light would pull it tight causing the towed object to jerk or wobble. As the lights got dimmer as they traveled, starting at about the brightness of a medium brightness star to almost no light. The entire sighting lasted about 1-2 minutes. Please contact me if more info will help. Thankw for doing what you do and someday the truth will be revealed!"],"City":"Spokane Valley","Case Number":"49821","Source":"MUFON","Object Flight Path":"Straight-line path","Country":"United States","Disposition":"Unresolved","Date of the Event":"08/13/2013 12:00 UTC","Date Submitted":"08/14/2013 02:51 UTC"}