{"Case Number":"49826","Source":"MUFON","Weather Factors":"Unknown","City":"Owensboro","Object Flight Path":"Hovering then path,Path then hovering","Summary":"me and my brother saw a cicular silver object that changed into a cigar shape and hovered and changed shape and it was daYtime 4 in the afternoon it was very large and very close to the owensboro airport we see planes everyday this was NOT A PLANE","Country":"United States","divs":["Sighting Detailsme and my brother witnessed this strange occurance we live less than a quarter mile from the owensboro airport so we see a variety of airplanes daily but this sighting was cicular at times then it would slowly change to a cigar shape and it was so super huge compared to a airplane estimated size would be around 600 yards in circumferance it was silver in color it would hover for a minuete then it would appear in a lower or higher altitude in very fast movements .then hover again. the size was so large a airplane went over the object and the plane looked so tiny in comparison immediantly me and my brother called a freind of ours at the airport and he said several of them seen the same thing we did but would not report it in fear of losing their jobs .. but he said when he saw it it was exactly what me and my brother seen. according to our freind at the owensboro airport. so toatal people veiwed this was 6 people me and my brother and 4 people at the airport. our freind at the airport said they estimated the size of this ufo at 600 yards in diamater the largest thing i ever seen in the sky especially in late afternoon brioght hot daytime"],"Longitude":"-87.149606","map":"<A HREF = \"http://maps.google.com/maps?q=37.745467,+-87.149606(49826)&iwloc=A&hl=en\"> mufon case (49826) map </A>","Date of the Event":"07/20/2000 04:28 UTC","Sighting Duration":"01:10:16","Latitude":"37.745467","Date Submitted":"08/14/2013 07:40 UTC","Object Shape":"Cigar, Circle","Log Number":"US-08142013-0011","trends":["There have been 9 other sightings in Owensboro","There were no other sightings in Owensboro on or around July 20th 2000"],"Tags":"City","Object Features":"None","Region":"Kentucky","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/49826.html.txt","/var/www/straped/mufon/org/49826.html"],"Viewing Distance":"101-500 Feet, Unknown"}