{"City":"Moose Jaw","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change,Path then hovering","Longitude":"-105.534856","Summary":"on my rooftop noticed a swoop like movement like a hawk coming towards me then leaving in one second","Source":"MUFON","Date of the Event":"08/14/2013 12:00 UTC","Log Number":"CA-08142013-0017","Region":"Saskatchewan","Object Features":"None","Object Shape":"Circle","Tags":"City","divs":["Sighting Detailsi was having a great time on my rooftop when everything went wrong.`I was on my rooftop watching shooting stars when i noticed a shadow on the pine tree reflected from my streetlamp that would last for a second i was thinking it was just a bug or a bird so i wasnt concerned. but a bug or a bird make noises, flutter and wont leave you alone and you definitely dont ... have a weird different feeling afterwards. this thing did not make a single noise, was to me then gone in a few seconds like a hawk swooping in at 1000 km per hour and i know exactly how fast that is because i see jets all the time because i live near an air force base and i was seriously freaked out.but even though it was swooping, there was no noise in fact it was like there was a controlled absence of noise if that makes any sense. so i started paying more attention and noticed how the stars would get blocked out as a moving circular shape moved towards me then leaving like a boomerang.then i noticed this because i was hyperventilating but thinking \"oh maybe youre seeing things, so i kept my eyes wide open it kept on coming and each time i would see a bit more. after the 5th in around two hours (thats what it felt like) time i was so bloody freaked out.i never kept track of the time even though after a while i thought i should because in the beginning i thought \"oh youre just tired and getting a bit crazy\" and at the end i didnt keep track of the time because i was so freaked out and just wanted to leave. it felt like ten minute intervals (i was so sure it was nothing but at the end i wanted to GET THE HELL OUTA THERE but this was some freaky s**t. i nearly fell as i tried to get off my roof because i was shaking so bad and it was around 8 minutes since i saw the last one so i thought its COMING so i went down the stair railing grabbed the door knob jumped inside my heart racing and i though oh f**k its gonna come inside for me so i went downstairs to where my grandma was sleeping because she snores and thought maybe just maybe that would mask my heavy scared breathing and curled up in a little ball tried not to move a muscle for an hour and even tried not to think about it because thought maybe they could pick up on that on their radar or tracking technology(since i was so so so scared i didnt want to take any chances or risks couldnt sleep all night was so scared i didnt want to wake anyone up in case they started yelling and that might grab Their attention and more people would be affected. i told my brother as soon as i thought it was possible and safe and what really freaked me out is he believed me because he saw a ufo (different one though)exact same area around the same time of night just a few days ago all i can say is that im not going to be able to sleep for a couple of nights unless i take a heavy sleep drug or something and i dont think i want to in case i have nightmares and im NEVER going up on my roof or anywhere in the night time alone again. im just so happy im alive and have all my body parts and my mind works properly however maybe just maybe if i got that hypnosis thing like in the movie 4th kind maybe just maybe after my mind was probed something nasty would show up. sorry for all the rambling i am freakedout of my mind."],"map":"<A HREF = \"http://maps.google.com/maps?q=50.391581,+-105.534856(49831)&iwloc=A&hl=en\"> mufon case (49831) map </A>","Viewing Distance":"20 Feet or Less","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/49831.html.txt","/var/www/straped/mufon/org/49831.html"],"Country":"Canada","Case Number":"49831","Date Submitted":"08/14/2013 10:30 UTC","Latitude":"50.391581","trends":["There have been 15 other sightings in Moose Jaw","There were no other sightings in Moose Jaw on or around August 14th 2013"]}