{"divs":["Sighting DetailsA friend and myself were sat in the park waiting for night to come to watch the Perseids meteor shower when out of the corner of my eye I caught a light blink on approx 80o above us. My friend was facing myself so would have noticed the light behind me, so I can make a good assumption it did appear from nowhere! At that time it was far too light to see any other stars, this object was self emitting its own brilliant pulsing white light; I could also make out it was shaped like an upside down teardrop. To add I was using my smart phone to check for any satellites and the I.S.S, none were in the area, anyhow it was far too bright to be an object outside our atmosphere the sun was not long set and as said stars were barely visible. We continued to watch for about 5 to 10 min`s as it disappeared to the south and into the haze and cloud bank. As for its altitude, it was above the scattered clouds and easily shone through any clouds it passed over. It must have been huge in relation to its height. I tried to film it with my phone but unfortunately I don`t have a zoom function. A commercial jet A380 passed to its right just before it appeared. Despite its mundane trajectory my friend and I both agreed it was very strange. I have seen similar objects in the area before."],"Sighting Duration":"00:10:00","trends":["There has been one other sighting in Cheltenham","There were no other sightings in Cheltenham on or around August 12th 2013"],"Source":"MUFON","Object Features":"None","Viewing Distance":"Unknown","Longitude":"-2.097465","Disposition":"Unresolved","Region":"","files":["/var/www/straped/mufon/html2text/49833.html.txt","/var/www/straped/mufon/org/49833.html"],"Date Submitted":"08/14/2013 11:26 UTC","Date of the Event":"08/12/2013 08:30 UTC","Log Number":"GB-08142013-0019","Country":"United Kingdom","Case Number":"49833","map":"<A HREF = \"http://maps.google.com/maps?q=51.900142,+-2.097465(49833)&iwloc=A&hl=en\"> mufon case (49833) map </A>","Object Flight Path":"Path with directional change","Latitude":"51.900142","Tags":"City","Summary":"Very bright star blinked on from nowhere above us then moved south.","Weather Factors":"Unknown","City":"Cheltenham","Object Shape":"Star-like, Teardrop"}