{"files":["/var/www/straped/mufon/html2text/49843.html.txt","/var/www/straped/mufon/org/49843.html"],"Latitude":"33.577897","Sighting Duration":"00:03:30","Region":"Georgia","Log Number":"US-08142013-0026","Disposition":"Unresolved","Tags":"City","Longitude":"-82.127994","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=33.577897,+-82.127994(49843)&iwloc=A&hl=en\"> mufon case (49843) map </A>","Object Features":"Unknown","Summary":"15-30 ramndom pulsation multicolored star-like objects randomly moving in all directions sometimes stopping then about 10 finally formed a rotating circle then shooting off in all different directions (while circle was formed the other leftovers randomly","Date Submitted":"08/14/2013 06:06 UTC","Viewing Distance":"Unknown","Country":"United States","Weather Factors":"Unknown","Date of the Event":"07/27/2011 09:09 UTC","City":"Evans","divs":["Sighting DetailsA friend and I were pulling out of my neighborhood a little after 9 P.M to go to another friends house while turning onto North Belair Rd. We noticed between 15 to 30 randomly pulsation, multicolored, star-like objects were randomly moving in all directions. Some of the objects would occasionally pause in the air. Soon after, about 10 of the objects formed in a rotating circle, while the other objects were randomly positioned in the sky around the other circling objects. This proceeded for about 30 seconds while all of the sudden ALL of the unidentified objects shot in multiple directions in an odd zigzag type pattern. About a year and a half later another friend and I saw nearly the same exact experience in the same exact location. they were in the sky forming the same way but with but less objects. I was shocked when these events happened. I had never seen anything like it before and I figured it was some sort of military experiment or night flight show. I have multiple witnesses that can confirm the experience. I have researched any sort of explanation for these experiences from night parachuting to every other facility in the area. This is currently unexplainable."],"Object Shape":"Circle, Fireball, Flash, Oval, Sphere, Star-like","Source":"MUFON","trends":["There have been 15 other sightings in Evans","There were no other sightings in Evans on or around July 27th 2011"],"Case Number":"49843"}