{"Source":"MUFON","Sighting Duration":"Undisclosed","Object Shape":"Diamond","City":"Buffalo","trends":["There have been 56 other sightings in Buffalo","There were 2 other sightings in Buffalo on or around August 10th 2009"],"Region":"New York","Summary":"ufo hovered over building","Latitude":"42.892537","Case Number":"49840","Log Number":"US-08142013-0027","Country":"United States","Date of the Event":"08/10/2009 07:30 UTC","divs":["Sighting DetailsMe and my friend was driving over a bridge near where we had stayed at the moment, when we came almost over the bridge, I saw a ufo or something hovering over a building. I noticed no one was out on this street. Then I noticed a variety of lights scanning. It looked like it was observing the building. My reacations was like \"wow\" no one else is seeing this? Since it was so close over the building I decided to investigate. I remebered saying to myself, if this was a ufo why would this be so close to the building Where everyone can see? So I pulled my vehicle in the back of building right near the craft. I got out the car and the shape of it was like a spinning top and the bottom as well. I look up and noticed the color was a blackish grey and flashing lights. The lights were lined from the top to the bottom. The top colors was green, white and red. The lights under that was blue, white and red. Next thing you know I was driving. When I'm a few minutes away from home and it was like my memory was wiped away. My friend that was with me on that occasion had no memory of this happening. In front of my house I said to myself dang I was supposed to look at the craft. In due time little by little I started to remember what I really saw that night."],"files":["/var/www/straped/mufon/html2text/49840.html.txt","/var/www/straped/mufon/org/49840.html"],"Disposition":"Unresolved","Object Flight Path":"Unknown","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.892537,+-78.871339(49840)&iwloc=A&hl=en\"> mufon case (49840) map </A>","Viewing Distance":"21-100 Feet","Weather Factors":"Unknown","Tags":"City","Longitude":"-78.871339","Date Submitted":"08/14/2013 04:57 UTC"}