{"Summary":"old style rocket and cone with side appendages with lights","Disposition":"Unresolved","Region":"Florida","Longitude":"-80.062284","Case Number":"49845","City":"Juno Beach","Source":"MUFON","Object Features":"Appendage(s), Other","Country":"United States","Date Submitted":"08/14/2013 08:10 UTC","Object Shape":"Bullet, Missile, Cone, Cylinder","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","map":"<A HREF = \"http://maps.google.com/maps?q=26.858194,+-80.062284(49845)&iwloc=A&hl=en\"> mufon case (49845) map </A>","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","divs":["sighting detailsi was outside having a cigarette and drinking tea around 10 pm. i noticed the object as it cleared the trees across the street. it was the largest thing in the sky closest to me. when i first noticed it i thought it was an airplane. as i stared at it to see if it was an airplane i couldnt figure out why it was travelling so low.and i realized it was not an airplane or a helicopter. as there was no noise of either an airplane or helicopter. it was heading east at a constant slow speed. it was heading east and was hidden behind a third story building. as i was waiting for it to appear on the east side of the building i noticed it was going straight up, it reappeared from behind the 3rd story building and was stationary for approximately 3-4 seconds, at which time it started heading west at a constant slow speed. my feelings were of i could not understand what i was seeing, along with a scary\\eerie feeling. as the object started heading west past me, i felt a feeling of sudden alertness and calmness. no longer afraid. the object started heading west, past me, and i suddenly heard a car slam on its breaks at which time i ran back inside."],"Latitude":"26.858194","Log Number":"US-08142013-0028","Weather Factors":"Unknown","Sighting Duration":"00:06:00","files":["/var/www/straped/mufon/html2text/49845.html.txt","/var/www/straped/mufon/org/49845.html"],"trends":["There have been 3 other sightings in Juno Beach","There were no other sightings in Juno Beach on or around August 13th 2013"],"Date of the Event":"08/13/2013 10:00 UTC"}