{"Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Unknown","Sighting Duration":"Undisclosed","Country":"United States","trends":["There has been one other sighting in Gatlinburg","There were no other sightings in Gatlinburg on or around August 10th 2013"],"files":["/var/www/straped/mufon/html2text/49854.html.txt","/var/www/straped/mufon/org/49854.html"],"Source":"MUFON","Longitude":"-83.549657","Tags":"City","Date Submitted":"08/15/2013 09:36 UTC","Log Number":"US-08152013-0006","Date of the Event":"08/10/2013 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.611931,+-83.549657(49854)&iwloc=A&hl=en\"> mufon case (49854) map </A>","City":"Gatlinburg","Object Shape":"Egg","Disposition":"Unresolved","Case Number":"49854","Latitude":"35.611931","Weather Factors":"Unknown","Summary":"I was driving home thru park after working in Gatlinburg....saw truck going really slow in front of me and I was wondering why? then I saw UFO out of corner of my eye...egg shaped with \"sparkler\" type lights around bottom...it disappeared behind trees","Region":"Tennessee","Object Features":"Unknown","divs":["sighting detailsgreat smoky mtns. nat. park 8\\10\\13 approx. 10:30 pm i was driving home from work through park and noticed a truck in front of me going really slow, as i get up behind them i see object out of corner of my eye (it's what truck was looking at) i just saw it for a couple of seconds...it was eggish shaped with pink\\white lights 3\\4 of the way down on object...at first i thought it might be fireworks but there are suppose to not be any in park? it reminded me of a \"sparkler\" misty around it and the sky was lite up around it...then it disappeared behind trees. i've seen stuff before but not like this...it seemed to be very close...i could see shape, lights and craft it's self... i came to your site to see if people in truck reported it, when i saw they had not i thought i would :-) i had chill bumps come up over my entire body and i started crying ???? probably strangest thing i have ever seen and no i wasn't smoking anything lol thanks !!"]}