{"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/49856.html.txt","/var/www/straped/mufon/org/49856.html"],"City":"Forest City","Date Submitted":"08/15/2013 12:32 UTC","Case Number":"49856","trends":["There has been one other sighting in Forest City","There were no other sightings in Forest City on or around August 14th 2013"],"Viewing Distance":"Unknown","divs":["sighting details08\\14\\2013 i was standing outside in the driveway on the phone with a friend. it was approximately around 10p.m.ish. i noticed a beam of light coming from behind the house up in the sky. it was moving somewhat slowly then was out of sight. it was a bright white\\yellowish light beaming across the sky the it just remained still in a straight line. didn't move or anything. i thought it was the strangest thing i had ever seen. i told my friend on the phone go outside check it out. so, she did and didn't see it. i said it's directly above my head in a straight line up in the sky. i kept saying what is that and where is coming from? she couldn't see it and then she got off the phone with me. i kept staring at the light trying to figure out what it was and where it was coming from. i thought for a second maybe its a meteror shower still but then again they said it was on the 12th and 13th. i tried to take a picture from my cell phone and it was just blurred light. so, i deleted it and tried take it again. still wouldn't turn out. so, i gave up. then i went inside when i came back outside about 5mins later it was gone. like it disappeared."],"map":"<A HREF = \"http://maps.google.com/maps?q=43.287829,+-93.557014(49856)&iwloc=A&hl=en\"> mufon case (49856) map </A>","Tags":"City","Object Shape":"Bullet, Missile, Fireball, Flash","Log Number":"US-08152013-0008","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Date of the Event":"08/14/2013 10:05 UTC","Longitude":"-93.557014","Summary":"I was standing outside in the driveway talking on the phone with a friend when I noticed a beam of light moving somewhat slowly across the sky. It was big thick line going straight across. Then just stayed there in the sky for about 10mins","Country":"United States","Object Features":"Unknown","Weather Factors":"Unknown","Source":"MUFON","Latitude":"43.287829","Region":"Iowa"}