{"Log Number":"CA-08152013-0005","Tags":"City","Source":"MUFON","trends":["There have been 11 other sightings in Cambridge","There were no other sightings in Cambridge on or around June 12th 2013","This sighting has never been favorited.",""],"Object Features":"Appendage(s)","Viewing Distance":"501 Feet - 1 Mile","City":"Cambridge","Latitude":"43.353416","Longitude":"-80.292435","Date Submitted":"08/15/2013 08:21 UTC","Sighting Duration":"Undisclosed","Region":"Ontario","divs":["Sighting DetailsMy wife and I were sitting out on out backyard deck in Cambridge Ontario Canada June 12 2013 at 4:46 in the afternoon looking towards the NNW direction when I spotted what I thought was a Hot Air Balloon floating in the sky about 1 (guessing) mile away.There were no clouds in a bright blue sky so the objects were highly visible. I took a picture thinking nothing of it until later when I noticed that it did not look like a balloon at all and then I notice the cylindrical object to the left of it,just out of focus. It was hovering as described and moving very slowly left to right then went behind the tree you can see in the picture. I said to my Wife I'll wait until it comes out the other side of the tree but it never did. If you zoom in, you can see ( the left object) it's cylindrical and appears to have extensions protruding out the end. This is an unedited photo taken with my Canon G10 at 5megapixels. I kick myself now because I dialed the file size down to 5 to fit more pictures on the card and lost much detail doing that . Everyone I've shown this to admits it's a UFO and does not look like anything else as far as I'm concerned. As for the object to the left, I've seen TV coverage on some (UFO Hunters) programs that shows similar objects in some episodes. I have never seen 2 separate objects in any UFO pictures ever and think this is quite unique as though the round object came from the cylindrical object."],"Object Shape":"Cylinder, Disc","Object Flight Path":"Straight-line path","Case Number":"49853","Date of the Event":"06/12/2013 04:46 UTC","Disposition":"Unresolved","Summary":"double sighting of cylinder and disc crafts in broad daylight june 2013","Country":"Canada","files":["/var/www/straped/mufon/html2text/49853.html.txt","/var/www/straped/mufon/more/49853_submitter_file1__IMG2155.JPG","/var/www/straped/mufon/org/49853.html"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.353416,+-80.292435(49853)&iwloc=A&hl=en\"> mufon case (49853) map </A>"}