{"Source":"MUFON","trends":["There have been 2 other sightings in Basildon","There were no other sightings in Basildon on or around October 20th 1992"],"files":["/var/www/straped/mufon/html2text/49852.html.txt","/var/www/straped/mufon/org/49852.html"],"Summary":"Large Black Triangle above a former property.","Latitude":"51.573542","Log Number":"GB-08152013-0004","Object Shape":"Triangle","Case Number":"49852","divs":["Sighting DetailsOne winters evening, with clear sky and nice bright stars. I had just finished watching TV and went to my Garden, to take out the Rubbish for the following day. I have no idea what made me look in that direction, but I noticed a large black Triangular Craft, making hardly any noise. It was blacker than the night sky and had defined edges. I observed the craft for about a minute as it was only at a high of a few hundred feet and was moving very slowly. When it was right above me, the strangest thought went through my mind \"it's only birds\" which only long after the event makes no sense at all. It wasn't a giant, silent, triangular bird and that's for sure. It was a solid object and was real! Another strange thing was, I didn't get a camera or go to the front of the house, or get anyone else to come and have a further look. I am not saying it was from Space, but Man we really don't know what's going on, even in our own backyards. I have never seen anything else like this in all these years and really hope I never will again. I am not going to remain anonymous about this sighting, I know what I saw and it is only long after the event, it became clear."],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=51.573542,+0.503353(49852)&iwloc=A&hl=en\"> mufon case (49852) map </A>","Object Flight Path":"Path with directional change","Longitude":"0.503353","Date Submitted":"08/15/2013 06:07 UTC","Country":"United Kingdom","Disposition":"Unresolved","Sighting Duration":"00:01:00","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","City":"Basildon","Date of the Event":"10/20/1992 10:30 UTC","Region":"","Object Features":"None"}