{"files":["/var/www/straped/mufon/html2text/4986.html.txt","/var/www/straped/mufon/more/4986_submitter_file1__BlackTriangleUFO-a.jpg","/var/www/straped/mufon/more/4986_submitter_file2__LargeBlackTrangleSide.jpg","/var/www/straped/mufon/more/4986_submitter_file3__LargeBlackTrangleDrawing.jpg","/var/www/straped/mufon/org/4986.html"],"Disposition":"Unknown","City":"Missouri City","Date of the Event":"08/15/2001 08:31 UTC","Summary":"Large Black Triangle below roof top level, silent, emited strong UV purple blue color","Case Number":"4986","Region":"Texas","trends":["There has been one other sighting in Missouri City","There were no other sightings in Missouri City on or around August 15th 2001","This sighting has never been favorited.",""],"divs":["sighting detailsdriving home from work in houston tx with wife. all commercial heavy aircraft in holding pattern 3 miles from normal hobby airport approach control and glide path. about 5-6 large aircraft including southwest airlines in holding pattern. this was very abnormal. then a fully armed f-16 at about 800 ft alt headed south passed over oyster creek at sub sonic speeds. as we approched our neighborhood near oyster creek in missouri city a very bright red light was spotted along river bed below roof tops. this appeared to be a very large slow moving dark aircraft about 165 ft wide about to crash and it was assumed to be on fire. as a private pilot i could assume nothing else this large and illuminated bright red color over the water that could be seen 1\\4 mile away. as we parked our vehicle we ran to our back yard for a closer look and were preparing to call 911. then my son arrived home and also witnessed the triangle as it passed close to the rear of our home. we were able to get within 120 ft of the black triangle and noticed the bright red glow under the craft. the side and upper portion was producing strong uv rays in a dark blue purple color and hurt our eyes. the triangle vehicle profile was thin only about 12-14 ft in total height. it was about 165 ft wide fitting snug between the trees along the creek with 15-20 ft clearance on each side. there was no engine sounds, or prop noise, or hum, zero, and we were very close within 100 ft. at the closest point. the triangle craft was moving very slow perhaps 40-50 mph just above the water in the creek bed and below the roof tops on the homes on both sides of the creek. from our viewing point we could see the front briefly, the side excellent, and rear of the craft clearly for several minutes. there were no faa required running lights or landing lights. as the vehicle passed us it came to a bridge and without any change in pitch rose up just over the top and passed over the vehicle bridge on cartright street and then descended to just above the water level again. the rear of the craft had a wide rectangular outlet near the top of the rear of the wing, about 70% of the total wide of the craft. i assumed this to be an exhaust port and the color was a dull grey with a small amount of dull white or grey light being emitted, again, no smoke, flame, or noise. there were no visible flight controls seen, no vertical stabilizer fins."],"map":"<A HREF = \"http://maps.google.com/maps?q=29.618567,+-95.537722(4986)&iwloc=A&hl=en\"> mufon case (4986) map </A>","Country":"United States","Longitude":"-95.537722","Tags":"City","Sighting Duration":"Undisclosed","Viewing Distance":"21-100 Feet","Source":"MUFON","Object Flight Path":"Path with directional change","Object Shape":"Triangle","Weather Factors":"None","Object Features":"Wings","Latitude":"29.618567","Date Submitted":"08/15/2001 08:31 UTC","Log Number":"US-06252006-0002"}