{"Object Shape":"Fireball, Unknown","Summary":"Four pulsating red orbs headed northeast, one after another.","divs":["Sighting Details This incident occurred on Saturday August 10th at 10:05PM. I was walking my dog down the road I live on checking out the big dipper, when I noticed a light in the southwest sky moving. I stepped off the road so I could watch it approach. It seems a lot of aircraft fly with their landing lights on. I noticed no lights were blinking, which was unusual. As it approached I could see it was pulsating red, and seemed to be changing shape. It flew directly over my head to the northeast. I cant estimate its height, except to say it was not a real high like the aircraft that leave trails behind them. After flying overhead it went below the tree line to the northeast. After this I looked around the sky and noticed a distant aircraft in the far west with its usual lights blinking. Looking to the southwest I spotted another light like before and it took the exact same flight. That was number two pulsating red orb. This happened two more times. Thats a total of four orbs in less than ten minutes. I really dont know what to think of all this."],"Object Features":"None","Latitude":"42.867145","City":"Alden","Region":"New York","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.867145,+-78.522597(49863)&iwloc=A&hl=en\"> mufon case (49863) map </A>","Longitude":"-78.522597","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile, Unknown","Log Number":"US-08152013-0015","Date of the Event":"08/10/2013 10:05 UTC","Case Number":"49863","Date Submitted":"08/15/2013 04:03 UTC","Disposition":"Unresolved","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/49863.html.txt","/var/www/straped/mufon/org/49863.html"],"Sighting Duration":"Undisclosed","trends":["There has been one other sighting in Alden","There were no other sightings in Alden on or around August 10th 2013"],"Source":"MUFON","Country":"United States"}