{"divs":["sighting detailsi was in the parking lot outside my apt. looking for meteors. i was looking directly up at zenith when i noticed a small light grom much brighter (blue-wht) quickly (2 seconds). it then dimmed by 1\\2 immediately changel location (about an inch of sky to the nw). it then came to a stop again and then quickly started moving again (1-2secs) to the n. as it did it became dimmer and dimmer and had disappeared after moving about 3 inches of dky to the norther. keep in mind it had to be high, i thought it was a satellite at first until after the sighting when i said to my girlfriend...duh satellites to stop. when it dimmed and disappeared it seemed to me that it dimmed b\\c it was getting higher and higher in alt, not that the light source dimmed or that it had headed far enough n at a constant alt. i was not really excited by it i came inside a reported it too my girlfriend. oddly enough this is the 2nd sighting i have had this year..reported one 7\\4\\13 in about the same location. it was the motion of this object going from still to moving in a blink and finally seemed to ascend as it headed n disappearing after only covering about 3 inches of sky (although it was at an apparent high altitude)"],"Weather Factors":"Unknown","Log Number":"US-08152013-0021","Date Submitted":"08/15/2013 06:42 UTC","trends":["There has been one other sighting in Chesterbrook","There were no other sightings in Chesterbrook on or around August 15th 2013"],"Object Features":"None","Source":"MUFON","Object Shape":"Sphere","Region":"Pennsylvania","Summary":"The UFO appeared was high, thought it was a satellite but it was still. Immediately becae very bright, then dimmed as it quickly changed positio then headed north","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.079297,+-75.443806(49869)&iwloc=A&hl=en\"> mufon case (49869) map </A>","files":["/var/www/straped/mufon/html2text/49869.html.txt","/var/www/straped/mufon/org/49869.html"],"Sighting Duration":"00:03:00","Latitude":"40.079297","Longitude":"-75.443806","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Tags":"City","Case Number":"49869","Date of the Event":"08/15/2013 12:00 UTC","City":"Chesterbrook","Object Flight Path":"Hovering then path"}