{"Date of the Event":"08/15/2013 05:11 UTC","divs":["Sighting DetailsI was on my way to work, driving on Interstate 40, traveling west into the city of Winston-Salem. I was about 3-5 miles from the outskirts of the city when I noticed the craft. It was early morning (right after 5am) and the sky was dark, the sun had not yet come up. I notice a hovering black triangle near one of those towers that have blinking lights (could have been a cell tower or an electrical tower, I'm not sure). It was locate to the north of my position. It slowly started traveling to the south, the path took it nearly over my location but not quite. As it passed in front of my location (over Interstate 40) I saw that it was indeed a black triangle object with steady white lights underneath and red lights that blinked. I also noticed that it was very huge - about the size of a large house. It was very low to the ground and traveled slowly. I lost sight of it as I continued driving and it became lost to sight beyond the tree-line to the south of my location. It made no noise at all."],"Case Number":"49878","Region":"North Carolina","Log Number":"US-08152013-0029","Latitude":"35.434219","Tags":"City","trends":["There have been 31 other sightings in Winston-Salem","There were no other sightings in Winston-Salem on or around August 15th 2013"],"Object Shape":"Triangle","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Country":"United States","City":"Winston-Salem","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=35.434219,+-97.407823(49878)&iwloc=A&hl=en\"> mufon case (49878) map </A>","Summary":"As it approached me I became aware of how huge it actually was. It was a triangle, black in color with solid white lights and a few red lights that blinked.","files":["/var/www/straped/mufon/html2text/49878.html.txt","/var/www/straped/mufon/org/49878.html"],"Date Submitted":"08/15/2013 09:08 UTC","Source":"MUFON","Object Flight Path":"Hovering then path","Longitude":"-97.407823","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile"}