{"Object Features":"Patterned Surface","Latitude":"35.382572","Date Submitted":"08/15/2013 06:56 UTC","Object Flight Path":"Other","trends":["There have been 78 other sightings in Oklahoma City","There were no other sightings in Oklahoma City on or around May 15th 2009"],"Viewing Distance":"501 Feet - 1 Mile","Longitude":"-97.400026","City":"Oklahoma City","Source":"MUFON","Case Number":"49870","divs":["Sighting DetailsI was on the back patio, looking up at the stars. Saw what I thought might be an egret but as I watched it, it descended from a very high altitude coming almost straight down. It kept getting larger and larger and as I watched, it started leveling off and made a slow sweeping pullup and leveled off at about 300 to 500 feet, possibly lower, and flew straight away from me towards the southeast without a sound. The object appeared to be a 3D boomerang, and 100 to 200 feet across. As it flew away, no sound and it did not have an apparent cockpit. Offwhite in color and lumps throughout the expanse that reminded me very much of the \"Michelin Man\". I didn't feel anything unusual except that I could not imagine what I had just seen. No anxiety, fear, dread, nothing out of the usual. Lost sight when the object got out a little and was below the horizon. This location is on the sw corner of Tinker AFB, do thought it might be a B-2 landing but no way, they make noise. Had I had a number to call the tower at Tinker, I would have just to verify if they had seen anything or not."],"Country":"United States","Sighting Duration":"00:03:00","Summary":"Straight overhead, descended to about 300 to 500 ft,. leveled and flew off to the SE","Region":"Oklahoma","Weather Factors":"Unknown","Date of the Event":"05/15/2009 03:30 UTC","files":["/var/www/straped/mufon/html2text/49870.html.txt","/var/www/straped/mufon/org/49870.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.382572,+-97.400026(49870)&iwloc=A&hl=en\"> mufon case (49870) map </A>","Tags":"City","Log Number":"US-08152013-0022","Disposition":"Unresolved","Object Shape":"Boomerang"}