{"files":["/var/www/straped/mufon/html2text/49875.html.txt","/var/www/straped/mufon/org/49875.html"],"Disposition":"Unresolved","Log Number":"US-08152013-0026","City":"Kernersville","Sighting Duration":"Undisclosed","Latitude":"36.124849","Date Submitted":"08/15/2013 08:29 UTC","divs":["Sighting DetailsI was sitting on my back porch in Kernersville, NC at appox. 7:45pm on the 14th of August 2013. I noticed 2 very bright, glowing solid object traveling rather fast from the southwest. I observed them moving roughly together in the same direction (roughly towards the east-northeast). My attention was drawn to them because of the bright, somewhat glowing yellow color that stood out against the blue sky. I thought that maybe they were airplanes at first but the airplanes that I noticed earlier and later (after the event) did not 'glow' from the sun like you notice that they sometimes do. Also this 'glow' was very different than an airplane catching the light of the sun - it was constant and steady and there were no 'wings' that you would notice on an airplane. I lost sight of the objects as they passed behind my home then the tree-line. They were 'bullet or missile' shaped and I could not tell how high in the sky they were or how big they actually would be."],"map":"<A HREF = \"http://maps.google.com/maps?q=36.124849,+-80.068803(49875)&iwloc=A&hl=en\"> mufon case (49875) map </A>","Object Flight Path":"Straight-line path","Date of the Event":"08/14/2013 07:45 UTC","trends":["There have been 4 other sightings in Kernersville","There were no other sightings in Kernersville on or around August 14th 2013"],"Viewing Distance":"Unknown","Weather Factors":"Unknown","Object Features":"None","Region":"North Carolina","Object Shape":"Bullet, Missile","Longitude":"-80.068803","Case Number":"49875","Source":"MUFON","Country":"United States","Tags":"City","Summary":"There were 2, roughly going in the same direction. They both glowed a shiny bright yellow, were 'missile' shaped, quiet and high in the sky. Traveling rather fast."}