{"Object Features":"None","Sighting Duration":"Undisclosed","Viewing Distance":"21-100 Feet, 101-500 Feet","trends":["There have been no other sightings in Shabbona","This sighting has never been favorited."],"Log Number":"US-08152013-0023","Latitude":"41.768085","Date of the Event":"08/28/2012 12:00 UTC","Object Shape":"Triangle","Tags":"City","Weather Factors":"Unknown","Country":"United States","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Region":"Illinois","Source":"MUFON","City":"Shabbona","Longitude":"-88.877031","divs":["Sighting Detailscame outside motorhome for smoke and i noticed a chinesse lantern type flame about500ft away, about over the boatramp of lake. no boats are allowed on lake after dark and it was a clear night, i watched it hover for several minutes about ten feet above lake, it started to rise slowly and as it got to about 25ft above water the flame started to look fuzzy, as it rose to about 50ft, it started to change shape, and it began to turn and as it did, i noticed a red strobe on oneside and green on other.it very slowly made a turn and then i noticed it was a triangle shaped craft, dull black in color.. it began to move towards me and just floated away, prolly 50ft over me and 50ft away from me and dissapeared. NOT A SOUND from it.. i called 911 to report it and the officer they sent, took a report but thought i was nuts, im sure. i took two photos of it with a throw away camera, one was nothing but the negitive of other shows it perfectly!!! didnt show up on photo though.. i still have negitive but im afraid to try to develop it.. i saw a u.f.o and im not crazy!!! im a retired firefighter and an x public safety officer, and it was a life changing event for me. i could have hit it with a rock, it was so close.."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.768085,+-88.877031(49872)&iwloc=A&hl=en\"> mufon case (49872) map </A>","Date Submitted":"08/15/2013 07:35 UTC","Case Number":"49872","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/49872.html.txt","/var/www/straped/mufon/org/49872.html"],"Summary":"i was on camping trip"}