{"Object Shape":"Blimp, Oval","Object Features":"Unknown","Weather Factors":"None","Log Number":"US-06252006-0003","Country":"United States","Date Submitted":"03/31/1985 12:00 UTC","Summary":"Looked like the Goodyear Blimp turned upside down and flew off at high speed","City":"Marietta","Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","Longitude":"-84.545493","files":["/var/www/straped/mufon/html2text/4987.html.txt","/var/www/straped/mufon/org/4987.html"],"Latitude":"33.954382","Source":"MUFON","Tags":"City","divs":["Sighting DetailsWe lived in Marietta, Ga on the downwind leg of the landing pattern for Dobbins AFB. My parents were pilots and I flew out of McCollum airport in Kennesaw for several years. We owned a Cessna 150 and part of a Piper 180. My friend Ricky and I were sitting on a green transformer talking when we noticed a large object floating quietly from the East. The object was approximately 500 feet above the ground (roughly 1568 feet above sea level). We thought it was the Goodyear Blimp because there were lights on the top and bottom. We noticed we didn't see a gondola hanging from the bottom nor did we hear the fan engines running. It was totally quiet. We also expected to see the famous advertisements flashing on the side. We watched for a few minutes while it floated closer to us. It suddenly raised up about 100 feet and flipped upside down, then took off toward the East at an very high rate of speed. We looked at each other and both stated that we've never seen the Goodyear blimp turn upside down before. Moments later we saw several fighter jets take off from Dobbins flying toward the direction the object went. Later several helicopters took off and did the same. We ran home and asked my dad to call the tower at Dobbins to see what was going on. He could not get through. We watched the news and saw nothing."],"Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=33.954382,+-84.545493(4987)&iwloc=A&hl=en\"> mufon case (4987) map </A>","trends":["There have been 21 other sightings in Marietta","There were no other sightings in Marietta on or around March 31st 1985"],"Disposition":"Unknown","Region":"Georgia","Date of the Event":"03/31/1985 12:00 UTC","Case Number":"4987"}