{"Viewing Distance":"Unknown","Latitude":"35.49189","files":["/var/www/straped/mufon/html2text/49887.html.txt","/var/www/straped/mufon/org/49887.html"],"Sighting Duration":"00:10:00","Region":"North Carolina","Longitude":"-83.026043","Date Submitted":"08/16/2013 04:36 UTC","Object Features":"None","trends":["There have been no other sightings in Waynesville","This sighting has never been favorited."],"Country":"United States","divs":["Sighting DetailsWhile going to get my oldest daughter at school, my youngest daughter was in the back seat. She was only a little over two years old, and we had been working on teaching her shapes. All of a sudden, she said, \"Look Mom, triangle.\" I said, \"Where at baby?\" Then she pointed up in the sky. I looked and saw a metallic triangle just hanging in midair over a grocery store. We watched it as I drove for over a mile and it never moved. During the second mile, we had turned away from it and then there were trees and buildings in the way of our view. When I drove back home about 20 minutes later, it was gone. Over the next couple of months we saw a couple of cylinder shaped crafts in the sky in daylight while the kids were playing in the backyard. And then one night during that same summer, my husband was working and the kids were in bed. I laid down and had a strange feeling something was over my house. As quick as I thought it, the bedroom filled with a strange orange light. I closed my eyes absolutely scared to death to open them, afraid of what I might see. Then symbols went across my eyelids, like hieroglyphics. I just prayed that it would stop and go away. After a few minutes, it did. I know this sounds crazy and that's why I have waited so long to report it, but I would be happy to take a lie detector test. I know what happened, and my daughter still remembers seeing it."],"map":"<A HREF = \"http://maps.google.com/maps?q=35.49189,+-83.026043(49887)&iwloc=A&hl=en\"> mufon case (49887) map </A>","City":"Waynesville","Date of the Event":"05/13/1992 03:02 UTC","Object Flight Path":"Unknown","Object Shape":"Triangle","Disposition":"Unresolved","Case Number":"49887","Summary":"hovering triangle","Log Number":"US-08162013-0002","Source":"MUFON","Weather Factors":"Unknown","Tags":"City"}