{"Date of the Event":"08/14/2013 08:30 UTC","files":["/var/www/straped/mufon/html2text/49889.html.txt","/var/www/straped/mufon/more/49889_submitter_file1__20130814203330.jpg","/var/www/straped/mufon/more/49889_submitter_file2__20130814203328.jpg","/var/www/straped/mufon/org/49889.html"],"Source":"MUFON","Sighting Duration":"Undisclosed","Case Number":"49889","Region":"New Jersey","Log Number":"US-08162013-0004","trends":["There have been no other sightings in Lawrence Township","This sighting has never been favorited."],"Tags":"City","Date Submitted":"08/16/2013 10:22 UTC","Summary":"{kt}bright white pulsating star like disc shape object, very bright.","Longitude":"-74.729631","Object Flight Path":"Stationary,Path with directional change","Disposition":"Unresolved","Latitude":"40.306438","Object Features":"Unknown","Object Shape":"Disc, Star-like","Viewing Distance":"Unknown","City":"Lawrence Township","divs":["Sighting DetailsMe and my girlfriend were heading out of Lawrence square village, and I spotted a extremely bright disc star like object pulsating in the sky. I knew it was not a star because it was very bright and way closer to be a star. It was pulsating super bright, then it would flicker. . Ive seen stars my whole life so I can tell the difference. My girlfriend seen it to.. it was hovering in the sky for over an hour or so. Then as it started to get dark out, It would get dimmer. And it started traveling slowly towards the right of the power lines that we were near. As I looked through my binoculars I could see a smaller object towards the right of the bigger disc object. The smaller one was only visible through the binoculars. Unfortunately I was only able to get a picture with my cell phone camera zoomed in. Not the best quality but its better then nothing. When I was younger I thought ufos were fake. Until you see one with your own eyes, your an instant believer, I have been seeing them through out my life since I was 11 years old. When you see a disc shaped object traveling at an incredible rate of speed with no sound. You know its nothing from this earth."],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.306438,+-74.729631(49889)&iwloc=A&hl=en\"> mufon case (49889) map </A>","Weather Factors":"Unknown"}