{"divs":["sighting detailsi was traveling south bound on ca57 freeway at approx. 8:50 pm. off to my left (east) i noticed a bright light, and thought it was an airplane. as i looked up at it again a few seconds later, i noticed that it was 3 bright white lights. the lights were very bright, and a very pure white. still thinking it was an airplane i looked for normal port and starboard flashing red and\\or green lights. the only flashing light was a dimmer white flashing strobe. as i continued to watch, (and tried to also to pay attention to traffic), it flew directly over my car. as it flew over, i noticed that there were 4 lights in a square shape, flying with a point forward. the flashing strobe was not as bright, but placed perfectly in the center of the 4 lights. i could not see the shape of any structure, just the lights, which seamed odd as the lights were so bright. the object was relatively low. i would estimate 3-5,000 feet off the ground. it was quite large, about the size of a jumbo jet (747). the windows were up on my car, so i have no idea if there was any sound. it continued to fly in a straight line, traveling towards the west. it was too far south to be landing at lax, and too far north to be landing at long beach. could have been on a landing path to los alamitos air station (but i am not familiar with their runways). i lost sight of it as buildings were in my way. there was normal air traffic in the air before and after the sighting, and nothing unusual. i still think it was probably some sort of aircraft (military or civilian) - maybe with landing gear down?? i was just so surprised by the apparent size and the lack of red and green strobes."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.877692,+-117.924178(49891)&iwloc=A&hl=en\"> mufon case (49891) map </A>","Date of the Event":"08/15/2013 08:50 UTC","Longitude":"-117.924178","Object Features":"Unknown","Country":"United States","Region":"California","Weather Factors":"Unknown","Latitude":"33.877692","Summary":"4 Very bright lights in a square or diamond pattern flying over Fullerton.","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/49891.html.txt","/var/www/straped/mufon/org/49891.html"],"trends":["There have been 14 other sightings in Fullerton","There were no other sightings in Fullerton on or around August 15th 2013"],"Date Submitted":"08/16/2013 11:46 UTC","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Log Number":"US-08162013-0006","Object Shape":"Unknown","Tags":"City","Case Number":"49891","City":"Fullerton","Sighting Duration":"Undisclosed"}