{"Latitude":"32.226273","Disposition":"Unresolved","Tags":"City","City":"Tucson","Longitude":"-110.920509","Log Number":"US-08162013-0010","Summary":"Lights in the Sky turning on and off followed by a small UFO flying overhead","Object Features":"Unknown","Source":"MUFON","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","divs":["sighting detailsmy wife and i were leaving her parents house outside red rock arizona (between tucson and phoenix) at 8:45pm on august 12th 2013 when we saw 3 large glowing lights a few miles away from us towards the silver bell mountains. we pulled over and watched the lights light up from the bottom to the top, fading out, then sequentially lighting up in order again. after this they lit up to the right doing the same. they were perfectly still. the event lasted around 4 minutes, then we sat waiting for more and saw helicopters with search lights begin to fly in and search the surrounding areas. after waiting a bit we didnt see anymore strange lights. we began driving down the frontage road (parallel to the 10 freeway) towards phoenix, then saw 2 more glowing lights in the same area again. as we watched the 2 lights fade out, we spotted weird lights that we assumed were a helicopter flying towards us from phoenix. as the flying object approached us approximately 500ft above us, traveling at a slow pace, we could only make out 2 bright white lights on the bottom, and a small pulsating blue\\white light in the back. it was impossible to determine the shape due to the bright lights. we then compared the light pattern to the helicopters also flying in the area at the time and they didnt match. the helicopters had a typical red blinking light, with a search light."],"files":["/var/www/straped/mufon/html2text/49895.html.txt","/var/www/straped/mufon/org/49895.html"],"Country":"United States","Region":"Arizona","Case Number":"49895","map":"<A HREF = \"http://maps.google.com/maps?q=32.226273,+-110.920509(49895)&iwloc=A&hl=en\"> mufon case (49895) map </A>","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around August 12th 2013"],"Object Flight Path":"Stationary,Straight-line path,Other","Weather Factors":"Unknown","Object Shape":"Fireball, Unknown","Date of the Event":"08/12/2013 08:45 UTC","Date Submitted":"08/16/2013 01:48 UTC"}