{"divs":["Sighting DetailsON THE NIGHT IN QUESTION, MY NIECE AND MYSELF DECIDED TO TAKE THE BINOCULARS AND GO OUTSIDE TO LOOK FOR POSSIBLE UFO'S. STANDING IN THE FRONT OF THE HOUSE ON THE CONCRETE WALKWAY, WE WERE TALKING QUIETLY, AND SEARCHING THE SKY. WE WEREN'T OUT THERE LONG WHEN I WAS LOOKING TOWARD THE SOUTH IN THE SKY. ABOUT THEN SHE HAD SAID TO ME THAT SHE REALLY WOULD LIKE TO SEE ONE. AS I WAS TURNING MY HEAD LEFT TO RIGHT, MY EYES STOPPED ON THE UFO HOOVERING ABOVE THE BACK OF THE HOUSE WHERE I LIVED. IT WAS AS IF IT APPEARED THERE OUT OF THIN AIR. JUST AS CALMLY AS IF I SAW THEM ALL THE TIME, I TAPPED HER ON THE RIGHT SIDE AND JUST AS I STARTED TO SAY, YEAH JEA, I, I STOPPED BECAUSE I SAW IT, AND I SAID 'LOOK'. WE WERE BOTH IN AWE AT WHAT WE WERE SEEING, LOOKING AT EACH OTHER WITH OUR MOUTHS WIDE OPEN, IN A FROZEN STATE. IT ONLY LASTED WHAT WE THINK WAS SECONDS. SHE THEN WENT TO THE RIGHT SIDE OF THE HOUSE, AS I WENT FURTHER INTO THE YARD, STILL LOOKING UP. I COULD SEE THAT THE SURFACE OF THE CRAFT WAS A PATTERNED SURFACE, THROUGH THE BINOCULARS. WHICH I KNEW RIGHT AWAY THAT I DIDN'T NEED TO USE. AND THAT I COULD ACTUALLY SEE IT BETTER. MOVING SLIGHTLY TO THE RIGHT, AND TURNED VERY SLOWLY TO THE LEFT IN A SNAILS PACE, AS TO LINE ITSELF UP TO THE DIRECTION IN WHICH IT WAS GOING. IT THEN WENT OVER THE TOP OF THE NEIGHBORS TREES,(TO THE RIGHT OF ME) AT THIS TIME I HAD WENT OUT INTO OUR STREET, STILL WATCHING IT MOVING SLOWLY IN THE DIRECTION OF THE END OF THE STREET. OVER TOP OF THE HOUSE THAT SET THERE AND THE TREES. I WATCHED IT UNTIL I COULD ONLY SEE THE LIGHTS. I THEN WENT OVER TO MY NIECE JEANNIE, AS SHE WAS COMING TO ME. I SAID JEAN, DON'T SAY ANYTHING ABOUT WHAT YOU JUST SAW, LETS GO IN THE HOUSE, YOU GET IN ONE AREA AWAY FROM ME AND I'LL GET IN THE OTHER AND WE'LL BOTH DRAW & WRITE WHAT WE HAD SEEN. AFTER WE DID THIS, WE THEN COMPARED WHAT WE HAD WRITTEN AND DRAWN. IT WAS NO REAL SURPRISE TO US THAT WHAT WE HAD DRAWN WAS EXACTLY THE SAME. OF COURSE WHEN WE TOLD THE OTHERS WE KNOW, THEY LAUGHED AND THOUGHT WE WERE CRAZY. WE DIDN'T CARE THOUGH BECAUSE, WE KNEW WHAT WE HAD SEEN, AND NOTHING OR NO ONE COULD CHANGE OUR MINDS. LATER ON, NOT FOR SURE WHEN IT WAS, THE TREES IN THE NEIGHBORS YARD STARTED DYING AND THEY HAD THEM CUT DOWN, THEY WERE HUGH TREES. NOW, I'M NOT SAYING THIS IS WHAT CAUSED THEM TO DYE, BUT, YOU CAN USE YOUR OWN JUDGEMENT. MAYBE IT WAS, AND MAYBE IT WASN'T. I DO KNOW ONE THING FOR SURE, WE BOTH SAW A U.F.O."],"Latitude":"38.130467","Case Number":"49904","map":"<A HREF = \"http://maps.google.com/maps?q=38.130467,+-85.680365(49904)&iwloc=A&hl=en\"> mufon case (49904) map </A>","Disposition":"Unresolved","Date of the Event":"06/12/2009 12:00 UTC","Tags":"City","Log Number":"US-08162013-0019","Summary":"HOOVERED OVER HOUSE, THEN MOVING SNAIL PACE UNTIL OUT OF SIGHT","Sighting Duration":"Undisclosed","City":"Louisville","Viewing Distance":"101-500 Feet","Region":"Kentucky","trends":["There have been 67 other sightings in Louisville","There were no other sightings in Louisville on or around June 12th 2009"],"Object Flight Path":"Other","Source":"MUFON","Object Shape":"Triangle","Country":"United States","Longitude":"-85.680365","files":["/var/www/straped/mufon/html2text/49904.html.txt","/var/www/straped/mufon/org/49904.html"],"Weather Factors":"Unknown","Date Submitted":"08/16/2013 07:08 UTC","Object Features":"Patterned Surface"}