{"Case Number":"49901","Object Flight Path":"Stationary","Disposition":"Unresolved","City":"Puyallup","trends":["There have been 13 other sightings in Puyallup","There were no other sightings in Puyallup on or around July 27th 1972"],"Latitude":"47.16828","Object Shape":"Cigar, Sphere","Summary":"came from no where, hovering close, we were scared and left, object very close. we have different accounts what happened","Date of the Event":"07/27/1972 09:50 UTC","Viewing Distance":"21-100 Feet","divs":["Sighting Detailsit was late July in 1972, I had about six friends over. I had a ten-acre farm with a small house and an old chicken coop we fixed up. I left the chicken coop with my friends inside and went up the little hill to the house to get a record. When I came out of the house there was a dark saucer hovering in the pasture by the chicken coop. This was so big I could only see part of it. it was just getting dark. It was slient, and did not notice it as I was going up to the house. coming out of the house I saw it and ran down to the chicken coop and told my friends, \"You have to check this out\". They came out the door and saw the saucer and ran up the hill and jumped in their cars and left me alone. My wife was pregnaugt and sleeping in the bedroom. I crawled in bed with her scared as hell, and was under the covers when I saw bright lights coming through the window and moving around the room. the saucer was dark and it had a cargo door on it. this was a few years before star wars, and it seemed to have tubing on the outside. not being able to see the whole craft I do remember seeing something like that. the cargo door was angled a little and looked like a rectangle that was at a slant. One of my friends that was there, the only one I am really in contact with anymore, I talked to him about this after years after it occurred. He got really quite and left. A few weeks later he came over and told me what he remembered since I jogged his memory. What I remember and what he remembers are two different stories. After the sighting he believes his memory was tampered with and didn't really think about what happened until I brought it up in 2003. Since then he has memories that the both of us were abducted and he said he communicated with the aliens and I was too scared and didn't want them to put this tracking device up my nose. He talked them into putting it in my hand. He remembers way more then I do. For several years I have been trying to find someone that can put us under hypnosis separately to find out who has the real truth about this. I have contacted people like Bill Birns from ufo mag and several others, and no one ever gets back to me. I can remember being very young like four or five years old and seeing strange things out of the bathroom window late at night before dawn. I have always been fascinated with ufo's since I was around ten years old. When I was younger I thought it would be really cool to meet an alien, when this sighting occurred I wasn't scared until everyone ran up to their cars and drove away. Then I was really scared. I would really like to skype with an investigator or talk to someone about how we can look deeper into this with hypnosis to see if this actually happened. I know what I remember like it was yesterday. My friend has to speak for himself, he seems to know a lot more then I remember and has no problem talking to anyone about it. He is interested in finding out the truth as well. if you cannot help me, do you know someone that can? Really appreciate your time and any thing you can do to help us with this."],"Source":"MUFON","Country":"United States","Object Features":"Other","Longitude":"-122.350331","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/49901.html.txt","/var/www/straped/mufon/org/49901.html"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=47.16828,+-122.350331(49901)&iwloc=A&hl=en\"> mufon case (49901) map </A>","Log Number":"US-08162013-0016","Date Submitted":"08/16/2013 05:20 UTC","Region":"Washington","Weather Factors":"Unknown"}