{"Object Features":"Unknown","Date Submitted":"08/16/2013 06:32 UTC","Latitude":"37.975877","Object Shape":"Circle","Object Flight Path":"Other","Weather Factors":"Unknown","City":"Concord","Longitude":"-122.007587","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=37.975877,+-122.007587(49902)&iwloc=A&hl=en\"> mufon case (49902) map </A>","Source":"MUFON","Sighting Duration":"03:00:00","Viewing Distance":"21-100 Feet","Case Number":"49902","Log Number":"US-08162013-0017","files":["/var/www/straped/mufon/html2text/49902.html.txt","/var/www/straped/mufon/org/49902.html"],"Summary":"I Have many videos of these lights landing in the trees","Disposition":"Unresolved","Region":"California","divs":["Sighting DetailsAlmost nightly these lights land in the trees I have many videos please come to my house and look this is my 3rd report someone come I don't have the program to cut them all up over 100 videos on phones,, cameras, video camera, surveillance system. I even have a video of these 3 things beaming down a little silver gray looking alien with pointy ears a black cube Like a rubics cube, but all black with something on it about the same size as them the last one comes they all floated down together like on a fireman's pole. Please someone come look at them. I'm not joking, An all black FBI car was parked in front of my house for 2 weeks after my first two attempts to notify your organization about these sightings. We almost crashed into each other in front of my wife's job because I was going a different way (while my wife was in the car). He was in front of my house 24 house a day for 2 weeks after we almost crashed, I stopped seeing him parked there. Plus the air force chases them for hours with helicopters' that have special colored lights under them green, gold, red. Planes with 2 headlights in front like a car, and 2 jets."],"Country":"United States","trends":["There have been 20 other sightings in Concord","There was one other sighting in Concord on or around June 1st 2012"],"Date of the Event":"06/01/2012 12:00 UTC"}