{"Region":"Illinois","Weather Factors":"Unknown","Disposition":"Unresolved","Object Flight Path":"Unknown","Tags":"City","Longitude":"-88.010086","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.726578,+-88.010086(49905)&iwloc=A&hl=en\"> mufon case (49905) map </A>","Country":"United States","City":"Downers Grove","Object Shape":"Disc","Log Number":"US-08162013-0020","trends":["There have been 3 other sightings in Downers Grove","There were no other sightings in Downers Grove on or around September 13th 1988"],"files":["/var/www/straped/mufon/html2text/49905.html.txt","/var/www/straped/mufon/org/49905.html"],"Object Features":"Dome","Latitude":"41.726578","Sighting Duration":"Undisclosed","Case Number":"49905","Date of the Event":"09/13/1988 06:45 UTC","Date Submitted":"08/16/2013 08:36 UTC","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsI am writing this for my wife, who experienced this event. She was driving home from work westbound along the Stevenson Expressway, Route I-55, near Downers Grove. As she approached the Cass Avenue exit she noticed an object hovering what seemed like 6-8 feet off of the ground near the next exit - Lemont Road - on the right side of the road approximately 25 feet from the highway and somewhat close to the exit area. It was raining at the time, but the object was very visible as a disc shape, about 15 feet wide, about 12 feet tall, with a dome, silver in color, just hovering close to the ground. She watched it was she passed Cass Avenue. About halfway between Cass Avenue and Lemont Road, she noticed the object shoot straight up in the air at a very rapid speed. Just prior to it moving away, she looked around the highway at the other cars and noticed other drivers also seemed to be staring at the object. She did not notice any sound because the wipers were on and and car radio was on at the time and the windows were up. She is unsure of the exact date, but seems to remember it was a Tuesday, definitely in September 1988, and approximately 6:45 p.m."],"Summary":"Silver-colord, Disc-shaped object hovered near ground and shot straight up"}