{"Disposition":"Unresolved","Tags":"City","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Summary":"Looking due East, observed pu;sating, raspberry red oval object flying very slowly 30 degrees above horizon, going north to south","Date of the Event":"08/17/2013 03:05 UTC","Object Shape":"Oval","Country":"United States","Region":"Florida","divs":["sighting detailsat approximately 3:05 am, saturday, august 17, 2013, i went outside to get something out of our car. as i got to the end of the driveway and looked across the street, due east, in the direction of the space coast, i saw an oval object at about 30 degrees above the horizon. it was traveling in what appeared to be a southerly direction along the coastal region. thinking that i should get some kind of point of reference regarding size and such, i held out my hand at arm's length. the ufo was gliding along very slowly, in a straight path, taking about 2 minutes to travel what measured at arm's length to be between 10 and 12 inches. the size of the craft, using my thumbnail at arm's length, was about 1\\2 an inch. and it was a medium to medium dark raspberry red...not the tone of red like on emergency vehicle lights, or on traditional aviation lights...and it pulsated slowly. the lighting of the craft seemed to come from within the object, and not from an external light source. it continued along its flight path at what appeared to be the same altitude and direction for the entire 2 minutes that i was able to see it. when it was no longer visible, i came inside, marked this event on my calendar, told my husband that i just saw a ufo and that i had to report it to nuforc and mufon. i called the nuforc hot line, as well,and have now made this written report. please feel free to contact me, if needed."],"Date Submitted":"08/17/2013 04:04 UTC","Longitude":"-81.174788","Log Number":"US-08172013-0005","City":"Orlando","map":"<A HREF = \"http://maps.google.com/maps?q=28.579203,+-81.174788(49919)&iwloc=A&hl=en\"> mufon case (49919) map </A>","Case Number":"49919","Source":"MUFON","Weather Factors":"Unknown","trends":["There have been 112 other sightings in Orlando","There was one other sighting in Orlando on or around August 17th 2013"],"files":["/var/www/straped/mufon/html2text/49919.html.txt","/var/www/straped/mufon/org/49919.html"],"Object Features":"Unknown","Viewing Distance":"Over 1 Mile, Unknown","Latitude":"28.579203"}