{"City":"Barberton","Sighting Duration":"Undisclosed","Tags":"City","Log Number":"US-08162013-0026","Object Flight Path":"Straight-line path","Region":"Ohio","Case Number":"49911","Date of the Event":"08/16/2013 09:03 UTC","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/49911.html.txt","/var/www/straped/mufon/org/49911.html"],"Country":"United States","Source":"MUFON","Summary":"Glowing orb moving NE to SW, soundless and tailess. Followed by a 2nd one 1 to 2 minutes later","divs":["Sighting DetailsI was sitting in our hot tub and suddenly I noticed a floating fireball moving from the NE to the SW directly above my sight of vision. Our house faces the south. The object came over our back yard from my left and slowly traveling to the right which is SW. I jumped out and called for my husband who was in awe! He served in the Air Force in the 80's. We watched it move in a straight but wobbly line for about 1 minute then it appeared to stop directly SW and descend gradually up until it disappeared. So I said Im gonna sit out here for a bit and just keep my eyes up at the sky~ he went back inside. Almost seconds later another one with the same characteristics but travel at a much lower altitude appeared and went slower but in the same flight pattern and disappeared in the same direction and manors as the first. I called him out as soon as the second one appeared, so we both saw this one too. In February on the 18th we witnessed the same thing this year at the same approximate time. We discussed meteors, weather balloons, hoaxes, you name it! But with my husband being a USA Air Force vet, we are both in awe and wonder. He said that was amazing and not of this earth. I agree"],"Weather Factors":"Unknown","Object Features":"Unknown","Disposition":"Unresolved","Latitude":"41.032826","Date Submitted":"08/16/2013 10:40 UTC","trends":["There has been one other sighting in Barberton","There were no other sightings in Barberton on or around August 16th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.032826,+-81.57055(49911)&iwloc=A&hl=en\"> mufon case (49911) map </A>","Object Shape":"Circle, Fireball, Sphere","Longitude":"-81.57055"}