{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.022602,+-79.582623(49917)&iwloc=A&hl=en\"> mufon case (49917) map </A>","Log Number":"US-08172013-0003","Country":"United States","Region":"Pennsylvania","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/49917.html.txt","/var/www/straped/mufon/org/49917.html"],"Case Number":"49917","Object Shape":"Sphere","Date Submitted":"08/17/2013 01:31 UTC","City":"Connellsville","Latitude":"40.022602","Summary":"moving then hovering object that changed direction and color from red to orange then disappeared.","Object Features":"Unknown","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Path with directional change","Date of the Event":"08/16/2013 09:30 UTC","divs":["Sighting DetailsI went into my backyard on 8-16-2013 around 9.25 pm to sky watch due to some other things I've been seeing really high in the sky since 8-10-2013. As I sat down in my chair that is against my chainlink fence facing east I noticed a strange bright light coming from the southeast torward me. I was amazed with it cause it changed from orange to red then back to orange then red again. The object seemed to come out of nowhere. This was now 9:30pm.That's when I ran up on my porch opened my door and yelled for my wife to come outside and look. As she got outside the object seemed to get smaller as it started moving west like it was heading for the moon for cover. Then as it moved it got dimmer and dimmer then finally vanished into thin air. On a side note the area where I first saw this there was nothing in the sky I know this cause that's the first area I looked at when I walked out my back door into my yard. We got a couple pic and a small video on our cell phones but they didn't come out very good. When I first noticed this object I had mixed emotions I had no idea what it was I've never seen anything like it. I felt a little fear but at the same time my adrenalin was pumping."],"trends":["There have been 2 other sightings in Connellsville","There were no other sightings in Connellsville on or around August 16th 2013"],"Weather Factors":"Unknown","Longitude":"-79.582623","Sighting Duration":"Undisclosed"}