{"Longitude":"-83.008533","divs":["sighting detailsthe ambassador bridge is an international bridge between windsor, canada and detroit, michigan, there have been reports of 5 orange orbs hovering on top of it in the beginning of month of august 2013, so while in peace fountain park next to detroit river, i was looking in that direction, strangely i noticed a very bright star above the west sky, in the direction of bridge, as i was sitting with a few people around i brought to their attention the very bright star, mind you the sky was clear and no other star were showing except this unusually big and glowing star, after more than 30 minutes a jet fighter passed close to it and my companion noted that there were 2 stars very close to each other, jet plane flew close to the orbs, since i think air-force noted the star-orb on international water\\river , jet plane quickly circled and left, orb still stayed there for another 10 minutes and disappeared suddenly. i took many pictures of the orb or 2 close orbs with my cellphone probably 20 miles away. many people noticed them, assuming it is a helicopter , but it was too high and stayed stationary for a very long time. i focused on it because of previous orange orbs report earlier. i`m sure governments on both sides know about it, since they sent the jet plane to investigate it or them. it must be something really interesting for orbs to visit that area regularly, may be an underground base ??? i`m pretty sure police and military know about them, since they were right on top of both sides downtowns, so i assume it is a secret or something for now. i prefer to be anonymous. tonight date is : august 16, 2013, and it happened 3 hours ago."],"Object Features":"Unknown","Country":"Canada","Region":"Ontario","Viewing Distance":"Over One Mile","Date of the Event":"08/16/2013 09:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.279609,+-83.008533(49916)&iwloc=A&hl=en\"> mufon case (49916) map </A>","Source":"MUFON","Latitude":"42.279609","Summary":"hovering brightly in clear sky in evening, on Detroit river area for 40 minutes, appear to be visiting or monitoring an underground sructures","files":["/var/www/straped/mufon/html2text/49916.html.txt","/var/www/straped/mufon/org/49916.html"],"trends":["There have been 18 other sightings in Windsor","There were no other sightings in Windsor on or around August 16th 2013"],"Date Submitted":"08/17/2013 01:08 UTC","Object Flight Path":"Stationary","Log Number":"CA-08172013-0002","Sighting Duration":"01:00:00","City":"Windsor","Weather Factors":"Unknown","Disposition":"Unresolved","Object Shape":"Sphere, Star-like","Case Number":"49916","Tags":"City"}