{"Viewing Distance":"Unknown","Log Number":"DE-08172013-0006","Summary":"Constant white glow, drifted side-to-side.","Disposition":"Unresolved","Case Number":"49920","Weather Factors":"Unknown","divs":["Sighting DetailsMy husband and I were on our balcony short before 9:40pm having a cigarette. The balcony faces the east. Clear skies and stars were clearly visible. We tend to stargaze while we're smoking, so it was pretty easy to spot this object. Our eyes had time to adjust with the night sky. At first glance you could assume it was an aircraft but we shortly realized it wasn't a commercial craft or anything we'd seen before. The unknown object came from the west and moved towards the east, it had a pulsating white light and drifted side to side. Absolutely no sound and the speed of the object was very slow. The object didn't move in a stable pattern. We watched it change direction to the SE. The feeling was strange and we didn't know how to feel about it.. almost like a joke had been played on us. We are constantly looking at the night sky when we're outside, we know the difference between a commercial craft, helicopter..etc. Kinda dumbfounded. The object after about 5 minutes of clear view disappeared behind a building towards the SE. We haven't found any sightings of this particular object."],"Tags":"City","Region":"Saxony","Source":"MUFON","Latitude":"50.832128","files":["/var/www/straped/mufon/html2text/49920.html.txt","/var/www/straped/mufon/org/49920.html"],"Object Shape":"Circle, Disc","City":"Chemnitz","Object Flight Path":"Path with directional change","trends":["There have been no other sightings in Chemnitz","This sighting has never been favorited."],"Longitude":"12.901703","Country":"Germany","Date Submitted":"08/17/2013 05:37 UTC","Date of the Event":"08/12/2013 09:40 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=50.832128,+12.901703(49920)&iwloc=A&hl=en\"> mufon case (49920) map </A>","Object Features":"Unknown","Sighting Duration":"Undisclosed"}