{"Weather Factors":"Unknown","Summary":"It was triangular in shape. It hovered and to the naked eye it looked like a star that was flashing red, green and white, with my binoculars you could see a triangle ship with green and white around the triangle and red on the top flashing","City":"Coos Bay","Country":"United States","Source":"MUFON","Case Number":"49921","Sighting Duration":"Undisclosed","Latitude":"43.373721","divs":["Sighting DetailsI was at the Empire Docks in Coos Bay Oregon stargazing. I had my six year old nephew and we were just watching the stars. I looked at several stars and watched one flashing repeatedly flash. As I reached over to grab my binoculars it disappeared! I turned and looked to the northwest and saw another star that was flashing brilliantly over the North Bend Airport. I grabbed my binoculars and looked and to my surprise it was a triangle UFO! You could see the outline of the craft. The outside triangular lines were green and white, and the top of it was red! It would tilt back up so that all you saw were the colors. A few minutes later it would tip back down showing you the shape of the craft again. As soon as I saw it I was amazed as I always am when I see one. I am always in awe at their sight. It was still in the same spot when I left as I had my six year old nephew and he fell asleep in the back seat. So I took him home."],"Log Number":"US-08172013-0007","trends":["There have been 10 other sightings in Coos Bay","There were no other sightings in Coos Bay on or around August 16th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.373721,+-124.20894(49921)&iwloc=A&hl=en\"> mufon case (49921) map </A>","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/49921.html.txt","/var/www/straped/mufon/org/49921.html"],"Object Features":"Other","Date of the Event":"08/16/2013 12:00 UTC","Date Submitted":"08/17/2013 05:47 UTC","Viewing Distance":"Over One Mile","Region":"Oregon","Longitude":"-124.20894","Disposition":"Unresolved","Tags":"City","Object Flight Path":"Other"}