{"divs":["Sighting DetailsI was standing outside my home around 3:00am looking up into sky and first noticed a white, star like object (object #1) gliding through the sky coming from the east. Soon afterwards, another object that was triangular (object #2) came gliding from the opposite direction and caught my eye even more so due to it`s brightness and solid yellow color. I then realized that both objects were heading directly for each other and I thought to myself that I was going to see them crash. The objects eventually met up, stopped in the sky, and object #2 began to revolve 360 degrees around object #1 with the upper point of its triangular shape facing object #1 the entire duration of this. After the revolution, object #2 began to glide away until out of sight behind the trees. Object #1 glided away for a moment, suddenly shot higher into the sky at a much faster speed, and stopped suddenly in place. I rushed inside to grab a camera to at least try and get a photo of object #1 while it was still in the sky but once I came back outside, the object had completely dissapeared. I believe that there`s no objects that can perform what these had done, whether man-made or cosmic phenomenon."],"Date of the Event":"07/15/2008 12:00 UTC","Latitude":"41.720927","Region":"New York","Object Flight Path":"Other","trends":["There have been no other sightings in Highland","This sighting has never been favorited."],"Case Number":"49922","City":"Highland","Object Shape":"Triangle","Date Submitted":"08/17/2013 08:49 UTC","Sighting Duration":"00:05:00","Object Features":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.720927,+-73.960138(49922)&iwloc=A&hl=en\"> mufon case (49922) map </A>","files":["/var/www/straped/mufon/html2text/49922.html.txt","/var/www/straped/mufon/org/49922.html"],"Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Source":"MUFON","Weather Factors":"Unknown","Log Number":"US-08172013-0008","Disposition":"Unresolved","Summary":"Two objects gliding towards each other in sky come together and one revolves around the other.","Longitude":"-73.960138"}