{"trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around August 11th 2013"],"City":"New York","Weather Factors":"Unknown","Source":"MUFON","Object Flight Path":"Unknown","Longitude":"-73.996093","Region":"New York","divs":["Sighting DetailsI was flying to LaGuardia from Manchester, NH on Delta flight 6035. The flight was from 6-7 pm that evening. It was a clear evening and I was sitting on the left side of the jet in a seat by itself. The aircraft was in sight of the airport at all times since we were in the approach pattern. Since I had never seen NYC from above, I was constantly looking out the window and was observing the awesome view of NYC, LGA, \"Statue of liberty\", \"911 memorial\" and so forth. I observed this spherical object out the left side of the aircraft as we were in our approach pattern. It was 200-500 ft. below us and 25-50 degrees away from the bottom of the aircraft. The speed of the aircraft was unknown or if the object was stationary since we were traveling at approach speed. Upon observing the object, I was unsure of it's nature. My guess it was an observation device over NYC or an approach marker for the aircraft. It just caught my eye and my attention. It appeared to have the ability to blend into the surroundings. This, by any means, does not need to involve the pilots of the aircraft since they were involved in the approach sequence. I did state \"Holy !@#$ what was that\". I just thought it was cool to observe something like that for such a short period of time. This will not bother me if nothing comes about from this experience."],"Date Submitted":"08/17/2013 02:19 UTC","files":["/var/www/straped/mufon/html2text/49939.html.txt","/var/www/straped/mufon/org/49939.html"],"Object Features":"None","Latitude":"40.722833","map":"<A HREF = \"http://maps.google.com/maps?q=40.722833,+-73.996093(49939)&iwloc=A&hl=en\"> mufon case (49939) map </A>","Viewing Distance":"101-500 Feet","Tags":"City","Date of the Event":"08/11/2013 06:45 UTC","Summary":"Traveling from Manchester to Laguardia saw object while flying over NYC","Country":"United States","Disposition":"Unresolved","Case Number":"49939","Sighting Duration":"Undisclosed","Object Shape":"Sphere","Log Number":"US-08172013-0025"}