{"Date of the Event":"12/10/2010 12:00 UTC","Object Features":"Window(s)","trends":["There have been 3 other sightings in Louisville","There were no other sightings in Louisville on or around December 10th 2010"],"Latitude":"38.255715","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.255715,+-85.752516(49936)&iwloc=A&hl=en\"> mufon case (49936) map </A>","Viewing Distance":"21-100 Feet, 101-500 Feet","Log Number":"US-08172013-0022","Date Submitted":"08/17/2013 01:04 UTC","Country":"United States","Region":"Indiana","Object Shape":"Diamond","Sighting Duration":"Undisclosed","Summary":"A black colored UFO with no shine on the South side of the freeway about 200ft. in the air at about the 10 O'clock position and it was just hovering while slightly wobbling and rotating with a small red light going around it. It was around 30 ft. in dia","files":["/var/www/straped/mufon/html2text/49936.html.txt","/var/www/straped/mufon/org/49936.html"],"Longitude":"-85.752516","City":"Louisville","Disposition":"Unresolved","Tags":"City","divs":["Sighting DetailsAbout three years ago (2010) my wife and I were driving West on I-64 in Southern Indiana just across the river from Louisville, Kentucky. There had been a very strong thunderstorm with a lot of rain but the rain had just about stopped and on the Indiana side the sky was curiously clear. We had just entered a section of the Interstate that was under construction and there was only one narrow lane to drive in with not enough room to pull over. Suddenly I saw a black colored UFO with no shine on the South side of the freeway about 200ft. in the air at about the 10 O'clock position and it was just hovering while slightly wobbling and rotating with a small red light going around it. It was around 30 ft. in diameter. I don't think there was any sound - just a swishing sound but that could have been my tires on the wet road. The bottom of the craft had something like diamond shaped window panels on the bottom and a very bright halogen blue light shining from the panels. Just before it went over the car I saw a tapered black pole that curves over the top of the craft and possibly one coming up from other side that I couldn't see. They didn't connect though but there was a gap about 2 feet or so between them. I asked my wife \"What IS that?\" She had to reposition herself slightly because I was driving and she was in the passenger seat. After a few seconds it traveled slowly to the North side of I-64 and even though it was still sprinkling rain she stuck her head out the window to get a better view of it. At that point I could not see it because it was about 2 O'clock high. It was there just a few seconds and then it went back to the South side and I could see it better now. It slowly enveloped itself with water vapor (?) It disappeared and then reappeared in the direction we were traveling and seemed also clone itself with 6 other craft evenly spaced following us down the Interstate. They or it followed us for around 20 minutes. When we got to the Illinois state line we were both totally exhausted and slept (or tried to) in the car at the rest stop for a few hours. We also had a cell phone but no camera and the phone didn't have a camera in it (darn-it). We have mentioned this only to a very few friends and I have been back there but no other sightings. MUFON sightings in Indiana exist but none like ours. I tried to report this to MUFON three years ago but for some reason when I did it would not forward and the report disappeared. This is a strange story but true. Both of us saw it!"],"Weather Factors":"Unknown","Case Number":"49936","Object Flight Path":"Hovering then path,Straight-line path"}