{"Date Submitted":"08/17/2013 12:07 UTC","Latitude":"36.522566","Object Flight Path":"Path then hovering","Object Shape":"Other","divs":["Sighting DetailsI lived on Carmel Valley Ranch Golf Course in Carmel, CA. I was the end house backed up to a pond and the 3rd hole at Carmel Valley Ranch golf course. A large appx 100ft hillside banked the pond and golf hole. This is a very dark area at night with only a few homes providing light...no city lights. I could see satellites pass overhead clearly from my lawn during the night. This is a very active UFO area but the incident that follows proved to me beyond a shadow of a doubt extraterrestrials exist. I was about to head to bed at appx 11pm when I took my dog out for a final potty stop. Holt road was my street and the place of the sighting which runs appx North to South. I first saw the blue Phoenix Bird like UFO while looking North with the hillside behind me to the south. The object was darker blue in the middle with lighter blue semi solid outlining lines. The lighter blue outer edges had some white in them as well or maybe it was just the light itself emanating that made it appear as white. I first saw the object at about tree top hight appx 100 ft away coming directly down Holt ave from North to South. The speed was relatively constant at appx 5 mph. Absolutely no sound whatsoever. It was slowly descending and heading directly toward me. I was completely frozen in my place. I did not feel any physical constraints but mentally I was very confused as to what I was looking at. I don't remember being fearful but I was not happy to see it coming my way. I feel like the object was intelligent enough to know I was there and stop appx 20-30 ft away and hover about 5-10 ft off the ground. I would guess up to this point we are about 20-40 sec into the experience. My dog was standing right besides me just as transfixed as I was. Zero barking or any noise coming from her at all. We both stood their motionless. I am somewhat confused as to what happened next as the Phoenix bird (think Nazi symbol of the phoenix shown in all WW2 propaganda videos) simply moved back ever so slightly and vanished. I say that I am slightly confused about the end bcd I can't really remember it going it was just gone if that makes any sense. I went inside and laid down tossing and turing for a few hours wrestling with what I had witnessed. I know what I saw but have no idea how to make any sense of it other than another intelligent life form. I witness quite a few other strange anomalies during my 2 years at the above location but nothing anywhere near as unexplainable. I have quite a bit of psychological questions which pester my brain in regards to this incident. I was exhilarated to have seen the Phoenix but I later had to question why I did not try and interact as I always thought I would do if something like this ever happened. I do believe the object was intelligent, aware of presence, and able to read my fear. I now unequivocally believe"],"City":"Carmel","Region":"California","Object Features":"Appendage(s), Wings","map":"<A HREF = \"http://maps.google.com/maps?q=36.522566,+-121.799982(49935)&iwloc=A&hl=en\"> mufon case (49935) map </A>","Weather Factors":"Unknown","Tags":"City","trends":["There have been 3 other sightings in Carmel","There were no other sightings in Carmel on or around June 1st 2011"],"Date of the Event":"06/01/2011 12:00 UTC","Country":"United States","Summary":"Blue aura Phoenix like Bird straight path towards me with descent & hovering no sound","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Case Number":"49935","files":["/var/www/straped/mufon/html2text/49935.html.txt","/var/www/straped/mufon/org/49935.html"],"Log Number":"US-08172013-0021","Viewing Distance":"21-100 Feet","Longitude":"-121.799982","Source":"MUFON"}