{"Region":"Arizona","Date Submitted":"08/17/2013 08:27 UTC","trends":["There have been 5 other sightings in Payson","There were no other sightings in Payson on or around August 10th 2013"],"Longitude":"-111.319466","Latitude":"34.234618","Tags":"City","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/49948.html.txt","/var/www/straped/mufon/org/49948.html"],"Disposition":"Unresolved","divs":["Sighting DetailsMy husband and I were camping above Payson, AZ at a campground on August 10, 2013. We were sitting around our campfire talking when a woman and her two kids walked by. She was talking about the sky and pointing to the stars. So we naturally looked up. The sky was full of stars and absolutely crystal clear...no clouds! My husband pointed to one of our satellites flying quickly across the night sky from the West to the East. I saw the satellite and commented about how fast it was moving. Then 30 seconds later, my husband pointed at another satellite moving in the same trajectory. \"Impossible\" I said. \"That's too close together, they could crash into each other\". As we were watching the second object flying across the sky, suddenly it appeared to be \"falling\" to earth in mid flight, then it stops its decent and emits a HUGE white pulsating light for about 10 seconds, then soars straight up into the sky directly above us and disappears...no longer flying on the same trajectory path as the first satellite. My husband and myself looked at each other in disbelief. We both said at exactly the same time, \"It looked like it was falling!!\" I knew it was a true physical observation, because when you experience something that could be life threatening, your heart skips a beat...mine skipped several beats that night when I saw it fall. It looked like it was falling directly down on top of us in the campsite. This UFO was approximately the same size and appearance as the previous satellite and had a glow (like the satellite) until it dropped out of that orbit and flashed a HUGE white light that night that dwarfed the other stars in the sky. Both my husband and I truly thought it was going to crash onto our campsite until it turned off the light and immediately soared up into space. Why did that happen so just my husband and I observed the object? No one else seemed concerned or was talking about it in camp. It was all very strange, but we both agreed, that was no satellite!!"],"Source":"MUFON","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Case Number":"49948","Object Shape":"Star-like","City":"Payson","Country":"United States","Object Flight Path":"Path with directional change","Date of the Event":"08/10/2013 09:10 UTC","Log Number":"US-08172013-0034","map":"<A HREF = \"http://maps.google.com/maps?q=34.234618,+-111.319466(49948)&iwloc=A&hl=en\"> mufon case (49948) map </A>","Object Features":"Unknown","Summary":"A satellite flew over & in 30 secs this UFO flew in same trajectory, suddenly dropped towards earth then soared straight up into the sky."}