{"Latitude":"28.529911","map":"<A HREF = \"http://maps.google.com/maps?q=28.529911,+-81.173082(49949)&iwloc=A&hl=en\"> mufon case (49949) map </A>","City":"Orlando","Case Number":"49949","Viewing Distance":"501 Feet - 1 Mile","Summary":"Red/Raspberry Pulsating Orb Travelling in Straight Line from E to W","Object Features":"Unknown","trends":["There have been 112 other sightings in Orlando","There was one other sighting in Orlando on or around August 17th 2013"],"Region":"Florida","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Source":"MUFON","Longitude":"-81.173082","Object Shape":"Sphere","Sighting Duration":"00:03:00","files":["/var/www/straped/mufon/html2text/49949.html.txt","/var/www/straped/mufon/org/49949.html"],"divs":["sighting detailsevent time: appoximately 8:55pm est on 8\\17\\2013 1.) location: i was sitting on my patio cooking burgers on our grill 2.) observation: i noticed the peculiar colored and flashing object as it was passing over me. 3.) first thoughts: i looked for the tell-tale signs of airplane lights, but there were no wing lights, gear lights or any typical airplane lights whatsoever. being a trained pilot, i knew this was not a blimp or airplane. i knew within seconds that this was something different, and ran outside my patio to take some pictures. 4.) description: the ufo was a spherical\\elliptal shape of flashing pulsating reddish\\raspberry light. there was no pattern to the flashing, and seemed random. it was moving slowly from east to west, perhaps se to nw, or thereabouts. an airliner passed above it coming from mco... typically airliners at this point are probably 8000-10000 feet up, and seemed to cross its path, so it was lower than that, and would estimate it was around 3000-5000'. 5.) feelings: excitement. i have only seen 1 other ufo several years ago, and was excited to see another one. i immediately ran outside my screen to take some zoomed in pictures on my cellphone before it disappeared... i was able to get 3 in, as it traveled to the e\\ne. i tried to get my family out after taking these pictures, but in the time it took for them to get out, the object had already disappeared completely into the distance. 6.) lost sight: i lost sight of the object as i was trying to get my family to join me in seeing this object."],"Date Submitted":"08/17/2013 09:36 UTC","Date of the Event":"08/17/2013 08:55 UTC","Tags":"City","Country":"United States","Log Number":"US-08172013-0035"}