{"Weather Factors":"Unknown","Longitude":"-92.841312","Case Number":"49946","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI found myself asleep on my deck,(winter). When I woke up I saw the back end of a ufo that had black and neon red spheres attached to it, ascending away from me. I felt dazed. I went inside to my bedroom and slept for about an hour. The UFO appeared to be long and skinny. It was about 20 feet long and 6 feet wide. It was predominately black. There were no leaves on the trees at the time. So I had an unobstructed view of the UFO. The object was approximately 300 feet away when I first saw it. It was daytime at about 4:45pm. The sky was overcast. Because we live out in the country we tend to see ufo's off in the distance often. We use night vision goggles. We also have many different colors of Orbs. The dog gets aggressive and barks at the orbs. The orbs are both inside the house and outside. We also have paranormal events such as knocking,bed shaking, vibrations in my body and shadows. Due to all the anomalous activity, I went to the doctor and had a cat scan of my brain done. It was normal. On July 4, 2012 I took photos of orbs that were in my yard. The leaves on the tree were actually scourched. Around August 1, 2013 I had another sighting of 10-12 ufos twinkeling very high in the sky."],"map":"<A HREF = \"http://maps.google.com/maps?q=46.318279,+-92.841312(49946)&iwloc=A&hl=en\"> mufon case (49946) map </A>","Source":"MUFON","Latitude":"46.318279","files":["/var/www/straped/mufon/html2text/49946.html.txt","/var/www/straped/mufon/org/49946.html"],"Region":"Minnesota","Object Features":"Unknown","Viewing Distance":"101-500 Feet","City":"Willow River","Tags":"City","Country":"United States","trends":["There has been one other sighting in Willow River","There were no other sightings in Willow River on or around March 20th 2012"],"Log Number":"US-08172013-0032","Object Shape":"Cigar","Summary":"The UFO was long and skinny, back end was black and neon red lights","Disposition":"Unresolved","Date Submitted":"08/17/2013 05:25 UTC","Date of the Event":"03/20/2012 04:45 UTC"}