{"Country":"United States","Log Number":"US-08172013-0038","Tags":"City","Region":"New Jersey","Case Number":"49952","map":"<A HREF = \"http://maps.google.com/maps?q=40.064738,+-74.84092(49952)&iwloc=A&hl=en\"> mufon case (49952) map </A>","files":["/var/www/straped/mufon/html2text/49952.html.txt","/var/www/straped/mufon/org/49952.html"],"Longitude":"-74.84092","Source":"MUFON","Sighting Duration":"Undisclosed","City":"Burlington Township","trends":["There have been no other sightings in Burlington Township","This sighting has never been favorited."],"Object Flight Path":"Path then hovering","Disposition":"Unresolved","Latitude":"40.064738","Date Submitted":"08/17/2013 10:45 UTC","Object Shape":"Fireball, Sphere","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Date of the Event":"08/17/2013 08:45 UTC","divs":["Sighting DetailsIt was almost 9pm and I was taking out the trash when I looked up and saw a bright red glowing object ascending at a decent rate of speed from the south west and moving up into the sky toward the north east. It moved from clear skies to a very thinly clouded sky. I observed as it slowed down and appeared to almost stop and hover for a while as it waited for a second similar object to catch up with it. then they both entered the thin cloud layer one after the other and disappeared. I looked but they never did emerge from out of the cloud even though it was surrounded by clear skies. I called to my wife to come out and look. My neighbor heard my calls and she came out as well. After a minute or two, we all noticed as two more objects appeared, traveling toward the same path but from a slightly different direction. These two were traveling very close to each other,Far too close for normal planes to travel. The were also very bright and red. No other color was seen. They did not pulse like a strobe but rather had the texture of balled fire, similar to a red flare except that they were ascending and not descending. These two entered the same cloud and disappeared as well. Finally, another minute or two and two more brightly glowing red fireballs, one behind the other and off to one side climbed into the sky as they disappeared as well into the small patch of thin clouds. I am convinced they were under their own power and moving at will. I have never seen anything else like them before. They should have emerged from the thin cloud cover as it opened back up to clear sky but they were all gone, all six of them. No sound was heard at all. The way they flew, it seemed as though they could almost stop but then move very quickly. They flew like they had somewhere to go. I believe they shot straight up but I can not say for sure. If they were some kind of jet, you would think six of them would have made some sort of sound but they moved very quietly. I don't know what they were but they were very odd and unusual and unusually bright. My neighbor tried to take a video with her cell, I don't know if it came out or not."],"Summary":"total of 6 bright glowing firey red balls of light moving in same direction shot into very thin cloud layer and vanished.","Object Features":"None"}