{"files":["/var/www/straped/mufon/html2text/49950.html.txt","/var/www/straped/mufon/org/49950.html"],"Date of the Event":"08/17/2013 09:06 UTC","divs":["Sighting DetailsI was driving west on a hilly road north of Ionia heading toward M66. At the top of a hill I saw a silver, reflective object sitting in the road maybe 1,000 ft ahead. I thought it looked like it was sitting off the north side of the road. It appeared to have a red light flashing on the top, however the reflecting light was very bright and made it difficult to tell. I thought it was a police car. I lost sight going down hill and saw it again maybe 30 secs later when I crested the next hill. This time I saw it for a longer period of time and it appeared to be sitting stationary in the middle of the road. I was closer but having a harder time telling if it had a flashing red light. I still thought it was a police car and wondering if it was blocking the road. It was between me and 66. There was no road to turn off on between me and 66. I went down the hill again and when I came up it was gone. Then I came up the next hill and I was where it had been sitting. I'd guess it was roughly a minute between where I lost sight of it and when I reached where it was sitting. I saw nothing a police car would be blocking the road for and I had a straight, clear view down the rest of the road (about 2,000-2,500 ft), all the way to 66 and saw no cars. If it turned off, it would have to be in someone's driveway and I didn't see it in anyone's driveway. I suppose it is possible it could have reached the end of the road and turned by then. I was still trying to figure out where the police car went when I saw a big metal pole barn on the south side of the road with all it's doors open. In it was a big black truck with red tail lights (I thought they were glowing) sitting in the barn. I thought \"Oh, I must have seen that truck\". Within a few seconds a tree blocked my view and when I saw the barn again, it was full of green farm machinery and a man was standing out front who I didn't see before. No black truck, nothing that looked like a black truck, or even looked like red tail lights. At this point, I was a little freaked and started thinking about the 'police car'. The state police vehicles are dark blue and I was not close enough to any city that it was likely to be their car. Also the light I saw only flashed red and not blue. I would hate to report a police car sighting but this seemed odd to me. I can give a more accurate location, but I don't want to submit it publicly."],"trends":["There has been one other sighting in Clarksville","There were no other sightings in Clarksville on or around August 17th 2013"],"Tags":"City","Object Flight Path":"Stationary","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Summary":"Silver, reflective object with a red light sitting in the road. Thought it was a police car but disappeared.","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=42.84215,+-85.24746(49950)&iwloc=A&hl=en\"> mufon case (49950) map </A>","Object Shape":"Unknown","Date Submitted":"08/17/2013 10:03 UTC","Longitude":"-85.24746","Sighting Duration":"Undisclosed","Source":"MUFON","Region":"Michigan","Weather Factors":"Unknown","Log Number":"US-08172013-0036","Case Number":"49950","Country":"United States","Latitude":"42.84215","City":"Clarksville"}