{"City":"Palmview","Date of the Event":"08/18/2013 02:01 UTC","Object Shape":"Star-like","Disposition":"Unresolved","Viewing Distance":"Unknown","Weather Factors":"Unknown","Case Number":"49964","divs":["Sighting DetailsI was sitting outside on the balcony when I heard my neighbors talking about something in the sky. I finally noticed something about a minute later coming from behind the trees. It was four glowing lights in a trapezoidal formation traveling in a north westerly direction. As I was viewing them a fifth light appeared behind the original four. It was centered in back of the original four. They were all a bright reddish-orange color and did not blink. The light came from a bright center, gradually dimming outwards and appeared spherical. They appeared like a flash like from a camera but it was constant. It was not a satellite as I have seen those before. I did not notice any type of indicator lights like you would normally see on an airplane. The lights then dimmed to practically nothing. All I could see was a very small pinpoint of light. I noticed them as I was facing east at about a 45 degree angle up from due east. They traveled without changing formation until I was facing due north still at about 45 degrees up from north. I took around ten minutes for them to travel from first sighting to last light out. A few minutes later I noticed an airplane flying in the same direction at a higher rate of speed than the object was travelling."],"trends":["There have been no other sightings in Palmview","This sighting has never been favorited."],"Region":"Texas","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=26.233406,+-98.37085(49964)&iwloc=A&hl=en\"> mufon case (49964) map </A>","Latitude":"26.233406","Sighting Duration":"00:10:00","files":["/var/www/straped/mufon/html2text/49964.html.txt","/var/www/straped/mufon/more/49964_submitter_file1__sightingdrawing.jpg","/var/www/straped/mufon/org/49964.html"],"Summary":"4 in a trapezoidal pattern, one other following. lights gradually dimmed to nothing","Object Features":"Unknown","Tags":"City","Source":"MUFON","Longitude":"-98.37085","Log Number":"US-08182013-0009","Country":"United States","Date Submitted":"08/18/2013 04:19 UTC"}