{"Weather Factors":"Unknown","Log Number":"CA-08182013-0013","Longitude":"-80.203278","Tags":"City","Latitude":"42.786522","Object Flight Path":"Hovering then path","Viewing Distance":"21-100 Feet","Sighting Duration":"Undisclosed","Summary":"right above car then moved off to hover for several minutes while i watched","City":"Port Dover","Object Features":"Dome","Case Number":"49968","Source":"MUFON","Date Submitted":"08/18/2013 09:58 UTC","Object Shape":"Disc","files":["/var/www/straped/mufon/html2text/49968.html.txt","/var/www/straped/mufon/org/49968.html"],"trends":["There have been 2 other sightings in Port Dover","There were no other sightings in Port Dover on or around July 12th 1988"],"Region":"Ontario","divs":["Sighting Detailsafter working a afternoon shift at the lake erie steel plant i proceeded home via the regional road. the time was after 12:30 am. a short distance past highway #6 which runs into Port Dover Ontario, i saw a cluster of bright white lights through my front window. these lights were much brighter than normal lights. as i drove i watched the lights descending and i was trying to figure out how far away they were and what they were. then they appeared to move into a straight line formation and start moving off to my left. at that time i was slowing down to a stop on the side of the road to try and get a better look at what they were. when i rolled down my window i then saw that it was a single craft and it had been right over my vehicle for a while as i drove. i got out of the car and stood beside it at the side of the road and watched as this motionless craft hovered less than 50 ft above the field beside the road. it made no noise. it didn't beam me up. and i wasn't afraid. the lights at this time were not visible. after several minutes it started to move south west and disappeared in about 5 seconds. i have never seen anything move that fast. the night was clear and i had a great view of something i probably will never see again. not too many people believe me but my friend when i told him said his son came home after work at the same plant that night, had seen the same object but from down the road behind me. he was very frightened. i had reported this to other groups but i have never been asked about my encounter. obviously my dates are going to be approximates since this happened years earlier."],"Date of the Event":"07/12/1988 12:00 UTC","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=42.786522,+-80.203278(49968)&iwloc=A&hl=en\"> mufon case (49968) map </A>","Country":"Canada"}