{"Disposition":"Unresolved","Tags":"City","Object Flight Path":"Stationary","Country":"United States","Viewing Distance":"20 Feet or Less","Case Number":"49966","Longitude":"-80.000578","map":"<A HREF = \"http://maps.google.com/maps?q=35.960282,+-80.000578(49966)&iwloc=A&hl=en\"> mufon case (49966) map </A>","Weather Factors":"Unknown","trends":["There have been 5 other sightings in High Point","There were no other sightings in High Point on or around August 17th 2013"],"Source":"MUFON","Date Submitted":"08/18/2013 09:07 UTC","Object Shape":"Flash","Date of the Event":"08/17/2013 11:13 UTC","divs":["Sighting DetailsLast night we drove home from Western NC. It rained the entire trip. I say this to point out that we drove in the rain for two and a half hours and never saw one flash of lightning nor did we hear a single thunderclap. As we were driving on Skeet Club road we saw a round or ball shaped object flash very brightly over the roadway three times. It was a very soft light blue color and it was right over the roadway about tree top level or, a little less. It appeared to be about fifteen feet across with fuzzy edges, not clearly defined. It flashed very brightly, like the flash from a camera. It flashed two times rapidly, then a second or two went by and it flashed again. The first two times it flashed it was right in front of the car and the last time it flashed it was right over the car. When it flashed the first two times I saw it's shape as being round. But, the edges were not clearly defined. It was just a light blue, very bright flashing object. I didn't see anything unusual before the first flash. What I saw was two very bright flashes and then a blue object that rapidly faded out. Then the third flash that was right over us so, we didn't see anything but the flash due to the roof of the car blocking our possible view of anything that might have been there. If I had time I would have tried to stop the car rather than drive under it but, it all happened very rapidly and I never had time to react. I suppose it could have been lightning and I started not to report it except that as far as I know there was no lightning associated with last night's rain. It was cool all day with a light to moderate rain all day. There is no missing time or any other details to report. Also, it was perfectly silent. We heard no sounds whatsoever."],"files":["/var/www/straped/mufon/html2text/49966.html.txt","/var/www/straped/mufon/org/49966.html"],"Summary":"Light blue ball of light that flashed like a strobe","Sighting Duration":"00:00:05","Log Number":"US-08182013-0011","City":"High Point","Latitude":"35.960282","Object Features":"Unknown","Region":"North Carolina"}