{"Region":"New York","Case Number":"49975","Weather Factors":"Unknown","trends":["There has been one other sighting in Churchville","There were no other sightings in Churchville on or around August 16th 2013"],"Longitude":"-77.884568","Source":"MUFON","Tags":"City","Object Flight Path":"Path then hovering","divs":["sighting detailshere's my footage [link moved to fi section\\cms\\tg] first off i want you guys to know i didn't fully believe in this stuff until last night. i went outside my house around 9pm to take the trash out and saw 2 very odd looking objects in the air. at first i thought it was 2 planes flying very close but then realized they weren't moving. then the split apart and the light emanating from them was unlike any plane i had ever seen. there was no sound that i could hear and they moved very little. they looked flat or disc shaped, maybe even like a boomerang. then i watched in pure shock as they shot up vertically into space at a ridiculous speed and vanished. i thought it was over but then my family and i saw a third one appear out of nowhere, this is when i grabbed my cell phone and tried to record it. my only regret is not filming long enough to show how insanely fast it ascended into space after hovering for over 2 minutes. here is my video, if you asked me if this stuff was real 2 days ago i would have laughed, now i feel like i got smacked with reality. appearance was bright orange with a tinge of white that encircled the ufo. the video doesn't properly show what it looked like to the naked eye. here is my video from last night. [link moved to fi section\\cms\\tg]"],"Sighting Duration":"Undisclosed","Object Shape":"Boomerang, Circle, Sphere","Date Submitted":"08/18/2013 01:45 UTC","Latitude":"43.08344","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/49975.html.txt","/var/www/straped/mufon/org/49975.html"],"Log Number":"US-08182013-0019","Date of the Event":"08/16/2013 09:20 UTC","Object Features":"Wings","Country":"United States","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.08344,+-77.884568(49975)&iwloc=A&hl=en\"> mufon case (49975) map </A>","City":"Churchville","Summary":"Saw a total of three UFO's over Churchville NY."}