{"Date Submitted":"08/18/2013 01:27 UTC","Summary":"Multiple lights following same path. Appeared to hover and change direction, Two of the objects very close proximity. No strobes.","trends":["There have been no other sightings in West Mifflin","This sighting has never been favorited."],"Date of the Event":"08/17/2013 11:35 UTC","Disposition":"Unresolved","Case Number":"49973","City":"West Mifflin","Longitude":"-79.866438","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.363403,+-79.866438(49973)&iwloc=A&hl=en\"> mufon case (49973) map </A>","Source":"MUFON","Object Features":"Unknown","Log Number":"US-08182013-0017","Region":"Pennsylvania","Viewing Distance":"Unknown","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Sighting Duration":"Undisclosed","Latitude":"40.363403","divs":["sighting detailsat 11:35pm 8\\17\\13 while on a cigarette break at work i noticed a star like object. my position was at the bottom of a valley looking upward through a tree line. at first the object appeared stationary, then i noticed slight motion like it was hovering. it made sight movements to my left and seemed to brighten when it moved. it made a definite path what i believe to be westward. it then slowly ascended and went away from me what i believe to be north. just before it faded away another object appeared where the first began. it followed the same basic path as the first. again just before it faded away a third object appeared and did the same. this time two more objects appeared, they were vey very close to one another at first and slowly drifted apart following the same path. i could still see the object prior to the two together and they made a triangular formation before they faded away from me still ascending. allegheny county airport is in very close proximity to where i viewed these objects. i wanted to dismiss this as mere helicopters but from my distance i should have seen strobe lights. the flight characteristics of the objects were also abnormal almost like the way a bumblebee flies. also it looked like the lights would brighten when making a move as if building up energy to do so. i'm not saying these were aliens but it was very unusual to me and i thought i should report it."],"files":["/var/www/straped/mufon/html2text/49973.html.txt","/var/www/straped/mufon/org/49973.html"],"Country":"United States","Object Shape":"Sphere"}