{"Object Features":"None","Region":"Washington","Disposition":"Unresolved","Date Submitted":"08/18/2013 04:49 UTC","divs":["Sighting Details At 10:53 PM I looked out my window to the east and saw a large group of lights low in the night sky. I am a dedicated sky watcher and have seen many odd things but this was like nothing I have ever witnessed. I am also very familiar with aircraft. I called my wife and daughter to look and I ran outside onto the deck to witness the amazing spectacle of a huge mass of white lights in the ESE direction, toward the Snoqualmie Pass area of the Cascade mountains. There were dozens of lights all in close proximity to each other. Ordinarily I would assume I was looking at aircraft lights but if these were airplanes there would have to have been 30 to 50 of them all in the same small sector of sky. They seemed to be moving in a southwesterly direction. They seemed to be a great distance from my location as they were not as bright as the airline planes that usually fly over my house on their way to Seattle. They were not flashing NAV lights like airplanes, they were solid white. Also they moved slowly indicating that they were very far away, maybe 15-20 miles distant. The highest ones seemed almost to be in a line, tilting upward at the south end. I have to say that what they reminded me most of was the pictures of the AAA fire over Baghdad during the Iraq war. There were just dozens of lights (craft) in a small area. It gave the appearance of a mass dogfight in slow motion. After a couple of minutes they began fading out until only a few bright ones remained and then they faded out also. Then there was nothing. The lights seemed to make no sound but they were far away. I am familiar with the Chinese lantern type floating lights that people send up and have seen them many times. These did not match that description. There were too many and were too far away. They also moved too much for lanterns as the air was calm and no wind. Also, Chinese lantern don't fade out all at once. If they were aircraft, there had to be dozens of them. Only the military has that many aircraft. I thought, maybe the army at Ft. Lewis was holding some maneuvers or maybe all their helicopters were making a late night return to base from the Yakima Firing Range, but how could they just fade out in a minute? Were they military flares? It seems unlikely since the forests are dry and it would be crazy for them to be dropping flares over the trees. Maybe the oddest part of this sighting is that I can find NO other report of this incident anywhere. We can't possibly be the only people who saw this. This spectacular event was in plain sight of a city of well over a million people and no one else saw it? I thought for sure it would be on the news or at least in the UFO reports from MUFON but I don't see anything. Anyone who was looking in the East could not have missed this incident."],"Summary":"A large grouping of lights (dozens) in SE sky. Seemed to be moving to the SW. Gave the appearance of a very large group of aircraft. Then they faded out one by one untill all were gone.","City":"Snohomish","Object Shape":"Sphere","Tags":"City","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/49978.html.txt","/var/www/straped/mufon/org/49978.html"],"Latitude":"47.839341","Log Number":"US-08182013-0023","Viewing Distance":"Unknown","trends":["There have been 9 other sightings in Snohomish","There were no other sightings in Snohomish on or around August 17th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=47.839341,+-122.120272(49978)&iwloc=A&hl=en\"> mufon case (49978) map </A>","Date of the Event":"08/17/2013 10:53 UTC","Sighting Duration":"Undisclosed","Source":"MUFON","Longitude":"-122.120272","Country":"United States","Case Number":"49978","Weather Factors":"Unknown"}