{"City":"Monroe","Log Number":"US-08182013-0016","Tags":"City","Object Shape":"Circle","Sighting Duration":"00:10:00","Date Submitted":"08/18/2013 10:44 UTC","Country":"United States","Summary":"observed a line of ascending orange lights in south east sky...seemed to come up from horizon...increased from 2 about 17 lights","Viewing Distance":"Over One Mile","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=41.922944,+-83.39601(49971)&iwloc=A&hl=en\"> mufon case (49971) map </A>","Case Number":"49971","Object Features":"Unknown","Source":"MUFON","Longitude":"-83.39601","Latitude":"41.922944","Date of the Event":"08/16/2013 10:15 UTC","trends":["There have been 9 other sightings in Monroe","There were no other sightings in Monroe on or around August 16th 2013"],"divs":["Sighting DetailsMy husband, 21-year-old son (the driver), and I were traveling north on Telegraph Road about 10:15 PM on Friday, August 16, 2013 in Monroe County, Michigan. We were between Albain & Dunbar Roads when my husband looked out his east-facing passenger side window and said, \"What are those orange lights in the sky?\" My husband and I both saw 2 glowing orange-red lights which were larger than stars or planets. They were stacked one above the other, and both appeared to be rising in the sky over the fields to the east of Telegraph Road. My husband commented that these could not be planes because they did not have any flashing navigation lights and because they appeared to be rising in altitude rather than flying straight across the sky as a plane or a helicopter would do. We both found the lights to be fascinating to watch, so we kept looking at them while our son drove. Not more than a few seconds passed before the original 2 lights became what appeared to be a string of about 6 or 7 reddish-orange lights rising upward. We commented to each other that the lights may have been over Lake Erie, which would be a couple of miles to the east of Telegraph Road. The lower altitude lights appeared to be farther away from us and the higher altitude lights appeared larger & closer to us. Very quickly after we observed the line of lights, there appeared a cluster of the same type of lights near the bottom of the line of lights. Altogether, my husband counted 17 lights total, the topmost lights being in the formation of a line with a cluster of lights at the bottom. After this, buildings began to obstruct our view, so we could only see the topmost couple of lights. We drove to Veterans Park on the River Raisin in Monroe (just west of Telegraph Road) and parked to watch the uppermost lights, which were still glowing orange in the sky. As soon as we parked, these 2 lights that we could still view over the treetops seemed to fade and grow dim and then they disappeared. They did not fly away. They disappeared."],"Object Flight Path":"Path with directional change","Region":"Michigan","files":["/var/www/straped/mufon/html2text/49971.html.txt","/var/www/straped/mufon/org/49971.html"],"Weather Factors":"Unknown"}