{"Tags":"City","Region":"California","Date of the Event":"03/01/2011 12:00 UTC","divs":["Sighting Details I had awakened, used the bathroom, and returned to my room. I have a habit of going to the window (west facing) and looking at the night sky before getting back in bed. At that time of year the moon and Orion constellation are up to the left, looking out. The night was crystal clear, calm, and the moonlight exceptionally bright. Wanting to locate Orion, my gaze was initially to the left. Immediately I sensed movement in the sky to my right. I turned and saw a structure moving slowly overhead, brightly lit, and unlike anything I have seen or heard described. It could not have been more than 300 feet away. It was shaped like a brick and was, by volume, the largest thing I have ever seen in flight. It had four sides, each rectangular, and ends that were about one third the area of the sides, also rectangular. The sides were approximately 90 to 100 feet long, with the ends 40 feet wide and 30 feet tall. It was moving toward and parallel to the rear of my house. At a point directly behind my house it would have been about 25 feet (horizontally) from the building. It moved very slow, maybe 10 miles per hour, and was alarmingly low, less than 200 feet. The color was dull black, solid, seamless, with no windows or doors. The two sides and end that I could see were perfectly flat and non reflective. The perimeter of the lower face (bottom) of the object was encircled with large red and green lights the size and shape of footballs. The colors alternated with every other one being red or green. The lights switched on and off in sequence running clockwise around the perimeter with at least four equally spaced points off simultaneously, giving the impression of rotation (as a theater marquee). These lights easily numbered more than one hundred. There was no sound. The movement of this thing was straight ahead, with no deviation in altitude nor laterally. Its flight was completely independent. There was nothing above or below the object and nothing pulling or pushing it through the sky. I watched, never looking away, until it disappeared behind my house (about 15 seconds). There is much more to describe but no space left to write."],"Log Number":"US-08192013-0003","Viewing Distance":"101-500 Feet","Object Flight Path":"Straight-line path","Object Shape":"Other","Country":"United States","Latitude":"33.74272","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=33.74272,+-118.124829(49989)&iwloc=A&hl=en\"> mufon case (49989) map </A>","Sighting Duration":"Undisclosed","Longitude":"-118.124829","City":"Seal Beach","Date Submitted":"08/19/2013 01:21 UTC","Case Number":"49989","Source":"MUFON","Object Features":"None","trends":["There have been 5 other sightings in Seal Beach","There was one other sighting in Seal Beach on or around March 1st 2011"],"Weather Factors":"Unknown","Summary":"brick shape craft @ 10mph, 200 feet altitude, level flight.physically disabled me.","files":["/var/www/straped/mufon/html2text/49989.html.txt","/var/www/straped/mufon/org/49989.html"]}