{"Object Features":"None","Tags":"City","Object Shape":"Unknown","Sighting Duration":"Undisclosed","Latitude":"40.980695","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/49986.html.txt","/var/www/straped/mufon/org/49986.html"],"Weather Factors":"Unknown","Date of the Event":"08/18/2013 09:40 UTC","Source":"MUFON","Log Number":"US-08182013-0031","divs":["Sighting DetailsI was leaving a friend's house a little after 9:30pm, and saw the light as I approached my car. I asked another friend leaving at the same time, \"What is that?\" and pointed. She was oblivious to it, and continued talking, I repeated it and pointed again. She saw it, but was unimpressed. She said it was an airplane. I knew it was not. It was larger than any star or planet I have ever seen, about half the size of the moon, but not round. It was flashing or pulsating for about one second on, one second off, very regularly. When it was on, it looked vaguely round, but not perfectly round. The right side seemed to have a defined edge with an angle to it, while the left side appeared more fuzzy. It was not moving, but stayed about 45 degrees up, or halfway to zenith, just slightly east of north. When it was off, it could not be seen. The waxing moon at this time was a day or two past half-full, and was behind me. My friend went getting into her car by now, so I raised my flashlight and flashed it several times toward the object, but felt it was not going to react to my meaningless signal, so I didn't continue. I got in my car and headed home, only a little more than a mile away. I tried to keep it in sight, but was not able to, and by the time a got home less than 5 minutes later, I could no longer find it in the sky. While I was scanning the sky for it, I saw an airplane's flashing lights to the east, travelling south. at a lower altitude than the object I saw. I was disappointed to lose sight of it. I was excited to see a UFO and wanted to see more. I was not frightened."],"City":"Fairfield","Disposition":"Unresolved","Country":"United States","Date Submitted":"08/18/2013 11:48 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.980695,+-91.966097(49986)&iwloc=A&hl=en\"> mufon case (49986) map </A>","trends":["There have been 8 other sightings in Fairfield","There were no other sightings in Fairfield on or around August 18th 2013"],"Region":"Iowa","Summary":"Large stationary pulsating white light","Case Number":"49986","Longitude":"-91.966097","Object Flight Path":"Stationary"}