{"Object Flight Path":"Stationary","Log Number":"US-08192013-0001","Date Submitted":"08/19/2013 12:19 UTC","Disposition":"Unresolved","Summary":"Pulsing flashing object in sky, stationary, large.","Case Number":"49987","Sighting Duration":"Undisclosed","Longitude":"-75.171592","Region":"Delaware","City":"Millsboro","map":"<A HREF = \"http://maps.google.com/maps?q=38.631824,+-75.171592(49987)&iwloc=A&hl=en\"> mufon case (49987) map </A>","Object Shape":"Egg","trends":["There has been one other sighting in Millsboro","There were no other sightings in Millsboro on or around August 19th 2013"],"Source":"MUFON","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/49987.html.txt","/var/www/straped/mufon/org/49987.html"],"Object Features":"Unknown","Date of the Event":"08/19/2013 11:42 UTC","Viewing Distance":"Over One Mile","Tags":"City","divs":["Sighting Details Cloudy night. No stars or planes visible. I was walking dogs. Noticed a large, pulsing and flashing object in the sky to the NW. I am familiar with the sky and area, there is no cell tower or anything there. This was also much higher and at an altitude as that of a low flying plane. Object was stationary. I watched for a few minutes and it did not move. I took out my phone and nearest star on Google Star map was Arcturus, this was not a star. (I was sure this was the case based on its appearance but I was grasping at any explanation) The object was \"tall\" It was more vertical than horizontal, up and down cylinder or egg shaped. I would have to guess it's size by estimating distance: I'd guess it was probably 5 miles away and 100-150 feet high. The lights appeared white. They seemed to flash or pulse. The object seemed to be rotating or spinning in place in some way based on the way the light moved. I watched the object for approximately 10 minutes. I turned to take care of my dogs and when I looked back it was gone completely. I don't know if it took off or disappeared, unfortunately. I also don't know how long it was there before I saw it. I did try to take a photo with my camera but nothing came out. You can't see it at all, it was too far away to pick up."],"Country":"United States","Latitude":"38.631824"}