{"files":["/var/www/straped/mufon/html2text/49988.html.txt","/var/www/straped/mufon/org/49988.html"],"divs":["Sighting DetailsWe were in my apartment watching tv when my Mom got up to go to the kitchen, she passed our balcony door and looked out and noticed four red-orange orbs flying in a wide group in the western sky heading north-north westward. She called to me to come and look to see what I thought they might be. I quickly grabbed my cell phone to record the strange lights. Once the 4 reddish orbs stopped and hovered in the north west sky before they faded into the night sky. Then there were 3 more orbs coming from the same direction but they came in single file heading towards the north west sky like the other 4 had been before they disappeared. Once each orb reached where the previous 4 orbs had gathered they disappeared as well.. It was strange that they were close but made no sound and there were that many within a short amount of time, my brother had seen one like what we saw on Friday Aug. 16th but he only saw one it was in the same area moving exactly like what we saw then disappearing just as fast, around the same time as well 9pm.."],"Source":"MUFON","Object Shape":"Sphere","Weather Factors":"Unknown","City":"Greenfield","Date of the Event":"08/18/2013 09:20 UTC","Disposition":"Unresolved","trends":["There has been one other sighting in Greenfield","There were no other sightings in Greenfield on or around August 18th 2013"],"Case Number":"49988","Object Features":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-88.023325","Object Flight Path":"Straight-line path,Path then hovering","Date Submitted":"08/19/2013 12:27 UTC","Tags":"City","Log Number":"US-08192013-0002","map":"<A HREF = \"http://maps.google.com/maps?q=42.972704,+-88.023325(49988)&iwloc=A&hl=en\"> mufon case (49988) map </A>","Viewing Distance":"101-500 Feet","Summary":"4 redish orbs then followed by 3 reddish orbs","Region":"Wisconsin","Latitude":"42.972704","Country":"United States"}