{"Tags":"City","Log Number":"US-08182013-0029","Viewing Distance":"Over One Mile","Disposition":"Unresolved","Object Shape":"Unknown","Source":"MUFON","City":"Highland Park","Object Features":"Unknown","trends":["There have been 2 other sightings in Highland Park","There were no other sightings in Highland Park on or around August 18th 2013"],"files":["/var/www/straped/mufon/html2text/49984.html.txt","/var/www/straped/mufon/org/49984.html"],"Case Number":"49984","map":"<A HREF = \"http://maps.google.com/maps?q=42.188392,+-87.798504(49984)&iwloc=A&hl=en\"> mufon case (49984) map </A>","Sighting Duration":"Undisclosed","Date Submitted":"08/18/2013 10:03 UTC","Longitude":"-87.798504","Region":"Illinois","divs":["Sighting DetailsWas in Stevensville, Michigan at my vacation home and I opened the curtains an hour or so after sunset; it's a large bay window that face Lake Michigan. Very little light pollution in this area because it's so rural. Saw a bright light across the lake that didn't look like a star or commercial aircraft. Through binoculars, I saw two bright, star-like objects hovering on the opposite side of the lake (i.e., over Illinois, not Michigan). One of the objects was brighter than the other and slightly above and to our left of it. The objects were too far away to discern details (even through binoculars) but they did not have blinking lights like commercial aircraft and were hovering instead of moving on a linear flight path. The smaller object began to ascend slowly, moving in a few different locations to the left of the larger object. Suddenly, it zoomed off at an incredible speed and disappeared. No idea what they were...there was an air and water show in Chicago this weekend so could be related to that. However, I did see a UFO from my vacation home - also hovering over Lake Michigan - a few years ago. This one had multi-color lights and it changed shapes so quite disimilar from this sighting."],"Latitude":"42.188392","Weather Factors":"Unknown","Summary":"Two bright, star-like objects seen across Lake Michigan. Both hovered for a few minutes, then one took off extraordinarily quickly.","Date of the Event":"08/18/2013 08:40 UTC","Object Flight Path":"Hovering then path","Country":"United States"}