{"Date of the Event":"06/15/1973 02:30 UTC","Object Features":"None","Source":"MUFON","Object Flight Path":"Path with directional change","Date Submitted":"08/19/2013 07:08 UTC","Log Number":"US-08192013-0011","Country":"United States","files":["/var/www/straped/mufon/html2text/49997.html.txt","/var/www/straped/mufon/org/49997.html"],"Disposition":"Unresolved","Longitude":"-83.112738","Case Number":"49997","divs":["sighting detailswhile shopping, at what was then farmer jacks supermarket, i,along with at least 8-12 people in parking lot, observed a metallic disc shaped object move in a triangular pattern. craft was not of earthly origin, as i have studied ufos pretty exstensively. disc shaped craft was about 5000 ft.{i was an airborne ranger in the army } day was cloudless, craft covered distances of 100+ miles in the blink of an eye. three times it did this, before it disappeared without any of us on the ground actually seeing it leave.....but i know that it did not disappear,it accelerated away at an unbelievable speed.of which was, and is unatianable by mankind. as this would exzert g forces inconcieveable to science.....area 51 you say,mmmmmmmmm !make no mistake about it, out government is by far, the leader in techniclogical innovation,in any given area....of science fiction & science fact. remember harrison fords role as indiana jones; at the entrance of a government werehouse, filled with crates far as the eye could see??????????you can,t handle the truth. p\\s i was in the store checking out and noticed people looking up skyward while in the check out lane.my date&year might be off,but i know what i saw,i cannot be told different, that whati observed, was a man made object. if it were man made,our pilots would not blackout during hi-g manuvers...you better ask somebody.....me!"],"Weather Factors":"Unknown","Sighting Duration":"00:00:59","Region":"Michigan","Latitude":"42.374249","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.374249,+-83.112738(49997)&iwloc=A&hl=en\"> mufon case (49997) map </A>","Summary":"astounding and incredible, to say the least............................................","Viewing Distance":"Unknown","trends":["There have been 56 other sightings in Detroit","There were no other sightings in Detroit on or around June 15th 1973"],"Object Shape":"Disc","City":"Detroit"}