{"Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Date Submitted":"08/19/2013 06:01 UTC","Date of the Event":"03/15/1986 12:00 UTC","Region":"Utah","Summary":"Observed a bright searchlight source about 100 feet up which shot upwards and out of sight in about 2 sec","Log Number":"US-08192013-0007","Object Flight Path":"Hovering then path","City":"Veyo","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/49993.html.txt","/var/www/straped/mufon/org/49993.html"],"divs":["Sighting DetailsI was driving home late at night about 1:00 a.m. From Enterprise, Utah to Saint George, Utah (37 miles) and was about half way home, within two miles of Veyo, Utah, a small town of about two hundred people, traveling south. I had a good sized hill on my right and as i passed the end of this hill off to my right and slightly ahead (southwest) I observed a very bright searchlight that appeared to have about a fifty - one hundred foot diameter on the ground originating from, I would guess, one hundred feet up. I was within one half of a mile of this light and it was in an area where it is very sparsely wooded, mostly sagebrush. I at first thought it was a law enforcement helicopter searching for someone or perhaps the wildlife division counting deer or after a poacher. As I drew nearer my radio developed a large amount of static, which was odd as I was listening to a cassette tape, and my headlights flickered off and on a couple of times. I got really scared at this point and then with the quickness of thought the light seemed to gather in but didn't go out, and then it shot straight up and out of sight into the sky, the only reason it disappeared, I believe, is that I couldn't see that far. The whole event lasting between 30-40 seconds, with the ascension lasting less than 2 seconds, i remember telling myself that there was no man made craft on this planet that could travel that fast, this appeared to be moving faster than a bullet. This was around 1986 and although I don't remember the exact date, I remember the event as if it happened an hour ago."],"map":"<A HREF = \"http://maps.google.com/maps?q=37.383836,+-113.651278(49993)&iwloc=A&hl=en\"> mufon case (49993) map </A>","Latitude":"37.383836","Longitude":"-113.651278","Country":"United States","Weather Factors":"Unknown","Object Features":"Unknown","Object Shape":"Other","Case Number":"49993","Source":"MUFON","Disposition":"Unresolved","trends":["There have been no other sightings in Veyo","This sighting has never been favorited."]}