{"Log Number":"US-06282006-0003","files":["/var/www/straped/mufon/html2text/4999.html.txt","/var/www/straped/mufon/org/4999.html"],"Latitude":"34.148972","divs":["sighting detailsi was driving in my car heading west on ventura blvd in sherman oaks. the object was directly ahead, low on the horizon, right around sunset time, sky was still bright. the object was shooting upwards very fast, leaving a large yellowish\\orange streak (colored b\\c of the sunset i believe)in its trail, the object was a glow and light a fireball so it was very unusual to see so i kept my eyes on it, very obviously in awe of what i was seeing. i immediately wondered if other people were noticing, but i didn't want to take my eyes of of the event, and i was driving so i couldn't communicate with anyone else around me in other cars. shortly, the object burned out, and i thought that was the full event, but then kept looking at the sky and noticed another object was still traveling where the other had burned out, this time not as bright, but still leaving a trail (less obvious behind it) i turned onto a smaller street and noticed two people on foot pointing towards the object also, so i pulled over and they asked me if i thought it was a plane and i said no. this object got bigger and brighter and was glowing an orange and appeared quite close to us in the sky, as i kept watching, it all of a sudden burst out what looked like a cloud of rain, sort of like fireworks made of cloud. then the object grew less bright, but continued moving away from us on the horizon. eventually disappearing over the horizon behind some clouds in a southward direction. i was in awe and rushed home to see if anyone else that i knew had witnessed it, leaving the other witnesses i had bumped into behind."],"Summary":"bright light/object shooting upwards disappears, other object takes place","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around June 27th 2006"],"Sighting Duration":"Undisclosed","Date of the Event":"06/27/2006 08:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.148972,+-118.451357(4999)&iwloc=A&hl=en\"> mufon case (4999) map </A>","Longitude":"-118.451357","Region":"California","Case Number":"4999","Source":"MUFON","Country":"United States","City":"Los Angeles","Object Features":"Undisclosed","Viewing Distance":"Unknown","Date Submitted":"06/27/2006 08:30 UTC","Disposition":"IFO","Object Shape":"Sphere","Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Undisclosed"}