{"Date Submitted":"08/19/2013 02:19 UTC","Latitude":"42.040169","trends":["There have been 9 other sightings in Elgin","There were no other sightings in Elgin on or around June 10th 2012"],"City":"Elgin","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Sighting Duration":"Undisclosed","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.040169,+-88.27506(50007)&iwloc=A&hl=en\"> mufon case (50007) map </A>","Weather Factors":"Unknown","Object Shape":"Cylinder, Disc","Object Features":"Unknown","Region":"Illinois","Date of the Event":"06/10/2012 12:00 UTC","Disposition":"Unresolved","Log Number":"US-08192013-0013","Object Flight Path":"Hovering then path","Case Number":"50007","divs":["Sighting DetailsI was at a golf corse called the highlands of Elgin, it was mid morning, close to 11:00 am. I was ready to tie up my ball, when a disc metallic object caught my eye, it was easy to spot as there where no clouds, there was clear skies all round us. I stayed looking at it and decided to take a picture. It stayed standing at an altitude of about 200 ft and after 40 seconds it ascended rapidly until no longer visible. The object was clearly metallic, when I got home and I was able to zoom in the picture you can see that it looks more cylinder like but still have disc shape. I initially thought it was either a ballon or a remote controlled craft, I knew it wasn't a plane. It was to small, to close and flighting to low to be one. Plus I'm use to see airplanes in the area all the time as Elgin is an approaching direction to O'hare international airport. At this point, I can't say exactly what it could be, just that it went up extremely fast and disappear. After that happened my heart was beating really fast."],"Tags":"City","Summary":"I was playing golf with a friend and notice the disc like object and observe it for a while. It was stationary and it was reflecting light. after 40 seconds it ascended rapidly and disappear.","files":["/var/www/straped/mufon/html2text/50007.html.txt","/var/www/straped/mufon/org/50007.html"],"Longitude":"-88.27506"}