{"Weather Factors":"Unknown","Summary":"Very bright white disk/circular object traveling at a snails pace through the night sky while we sat on the Chehalis River...","Region":"British Columbia","trends":["There have been 9 other sightings in Chilliwack","There were no other sightings in Chilliwack on or around August 13th 2013"],"Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"08/13/2013 10:03 UTC","Country":"Canada","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Longitude":"-121.943907","City":"Chilliwack","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=49.1665,+-121.943907(50015)&iwloc=A&hl=en\"> mufon case (50015) map </A>","Date Submitted":"08/19/2013 10:39 UTC","Tags":"City","Latitude":"49.1665","Log Number":"CA-08192013-0020","divs":["sighting detailsvery bright white disk\\circular object traveling at a snails pace through the night sky... the evening sky was clear and there was no obvious light pollution. i was sitting with my youngest grandson (9 yrs old) on the chehalis river when i noticed movement in sky. i had my binoculars with me as we were waiting to view the perseid meteor shower. i grabbed my binoculars immediately as i knew it wasn't a conventional aircraft..i live in maple ridge bc and live on a major flight path so i'm super familiar with aircraft, i'm a star gazer and have been for the last 4 years, so i've grown accustomed to seeing satellites, aircraft and meteor's... something about the way it was moving, its like it was observing, right away i noticed there was no beacon lights on the top or bottom, no blinking of any kind!! also the object was moving very slowly, i had time to look at it, pass the binoculars to my grandson and let him view it!! its movement was unlike anything i've ever seen in the night sky...smooth, slow and no sound....i continued to watch it until it flew in a straight line until it went out of sight behind a row of trees and out of view...."],"Case Number":"50015","files":["/var/www/straped/mufon/html2text/50015.html.txt","/var/www/straped/mufon/org/50015.html"],"Object Shape":"Circle, Disc","Source":"MUFON"}