{"City":"Columbus","Object Features":"None","Longitude":"-82.950376","Case Number":"50011","Disposition":"Unresolved","Source":"MUFON","Latitude":"40.076668","Log Number":"US-08192013-0016","trends":["There have been 70 other sightings in Columbus","There were no other sightings in Columbus on or around August 17th 2013"],"Region":"Ohio","Date of the Event":"08/17/2013 09:30 UTC","divs":["sighting detailsmy wife and i live in north east columbus, ohio. on the night of august 17 2013, we were sitting on our patio at the back of the house which faces north. as we observed the moon we saw an aircraft light and heard the noise of the engines dissipate as it traveled away from us further north. suddenly my wife exclaimed that she could see 'another fireball' over the trees in the same general location. (apparently she had seen one a month prior.) as i followed her gaze i could see a bright orange\\red sphere slowly moving above the trees and towards my right (west). as we watched this sphere pass, two additional spheres appeared of the same color. they formed something of a triangular formation and continued along the ne to sw path. no noise could be heard. they were moving slowly and did not change course nor change size\\color. it seemed that the front of the spheres were more red and the rear more orange - almost as if they were on fire. we made our way to the front of the house to track the lights and then saw an additional set of three spheres emerge above the trees following the same course as the first set. there were six spheres total. we continued to watch as they traveled slowly out of sight behind the neighbor's trees. we live close to the airport and are used to seeing aircraft lights and the police\\medical helicopters that frequently pass overhead, as well as the noises they create. however, we heard no noises from these lights. i offered to my wife that perhaps these were military flares used for exercises but we didn't see or hear any planes or helicopters chasing these lights and flares (as far as we know) don't fly. very strange sight to behold. unfortunately, we did not have the presence of mind to try to record this event. it only lasted about five minutes."],"Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","Tags":"City","Sighting Duration":"00:05:00","Date Submitted":"08/19/2013 05:53 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.076668,+-82.950376(50011)&iwloc=A&hl=en\"> mufon case (50011) map </A>","Object Shape":"Fireball","Country":"United States","files":["/var/www/straped/mufon/html2text/50011.html.txt","/var/www/straped/mufon/org/50011.html"],"Summary":"Fireball like spheres moving NE to SW over Columbus, OH","Weather Factors":"Unknown"}