{"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/50018.html.txt","/var/www/straped/mufon/org/50018.html"],"Log Number":"CA-08202013-0002","Weather Factors":"Unknown","Date Submitted":"08/20/2013 02:28 UTC","Viewing Distance":"Unknown","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Summary":"Comes into view around 1:30am, at 4:30am closer and more prominent. It moves in all directions and blinks.","trends":["There have been 136 other sightings in Toronto","There were no other sightings in Toronto on or around August 19th 2013"],"Country":"Canada","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Longitude":"-79.411515","City":"Toronto","Object Features":"Unknown","Latitude":"43.766053","Date of the Event":"08/19/2013 04:30 UTC","Source":"MUFON","Region":"Ontario","Case Number":"50018","divs":["Sighting DetailsI live in a rural area about 40 km north of Toronto. I always sit on my deck and love watching the sky.I first viewed this object 3 summer's ago. At that time I was looking east and seen this object move from behind a very tall pine tree, but it is very far away. As I watched it went out of view behind the pine tree, and then re-appeared. The white and red lights it emitted seemed to be turning, and blinking. I actually was quite amazed and thought that this can not be a satellite. It would take a dip, move left then right, and seemed like it was hovering in between movements. It would rest for about 10 seconds and repeat it's movements. It also moved in a diagonally path. It stayed in the east and travelled southward, I would lose view of it shortly before dawn. I felt very excited, and also shocked. My heart rate increased only because I could not believe what I was seeing. I have shown relatives this event, and they also were quiet amazed. I would try to convince them to try to stay awake until 4am so they could witness how much larger it seemed, and how you could see the lights flashing more prominently also it's movements that were more visual at that time. The exact date is what I am referring to as my last sighting. I have been watching this for quiet some time, actually the last three summer's."],"map":"<A HREF = \"http://maps.google.com/maps?q=43.766053,+-79.411515(50018)&iwloc=A&hl=en\"> mufon case (50018) map </A>","Tags":"City"}