{"Latitude":"40.807265","Viewing Distance":"20 Feet or Less","City":"New York","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around July 26th 2013"],"Tags":"City","Object Flight Path":"Hovering then path","Log Number":"US-08192013-0016","map":"<A HREF = \"http://maps.google.com/maps?q=40.807265,+-73.930668(50010)&iwloc=A&hl=en\"> mufon case (50010) map </A>","Summary":"saw 6 ligths hovering changing colors then only 3 dissapeared started to wobble than move slowly east","Country":"United States","Weather Factors":"Unknown","Date of the Event":"07/26/2013 12:00 UTC","files":["/var/www/straped/mufon/html2text/50010.html.txt","/var/www/straped/mufon/org/50010.html"],"Disposition":"Unresolved","Source":"MUFON","Longitude":"-73.930668","Date Submitted":"08/19/2013 03:22 UTC","Region":"New York","Object Features":"None","Sighting Duration":"Undisclosed","Case Number":"50010","divs":["Sighting Detailssitting on my stoop with a friend on the upper eastside of manhattan on lexington Ave looking north about 11pm notice 6 bright lights then 3 dissapeared and 3 remained in a wish bone posion i notice bottom orb was moving up and down in short distance the other on right was pulsading and changing colors white on the outside blue green on the inside and started moving slowly east and then would stop i ask my friend if those were helicopters no he said no noise what so ever than i asked him are they flares Iknew that they were neither or but i just wanted to be corrected i did video tape a little of it on my phone for the next 2-3 days it was baffeling me and driving me crazy I can tell you whatI didn't see I contacted 2 news channels no reports of lights in the sky I remebered their was a boating accident up at the tappan Zee bridge I was wandering if the police had used flares that night. that boating accident was all over the news no Flares were used just spot lights confirmed. I had to do my own investigating these lights left me puzzeled and nothing was mentioned on TV or media. however a friend told me to check out MUFON on web I'm glad I did! I did some research on the event database and that on that night many other witnesses saw the same thing with good video footage from Connectict New Jersey long Island and Upstate new york I'm satisfy to an extend but more needs to be investigated about those Lights NOT! from this planet I don't think now."],"Object Shape":"Sphere"}