{"map":"<A HREF = \"http://maps.google.com/maps?q=41.9891,+-87.871474(50016)&iwloc=A&hl=en\"> mufon case (50016) map </A>","Object Features":"None","Object Flight Path":"Path then hovering","Case Number":"50016","Object Shape":"Disc","divs":["Sighting DetailsI was on a flight from Chicago O'Hare Intl to Mc Carran Las Vegas,aisle 12 just in front of the planes wing, about 10 minutes after take off and as the plane continued to gain altitude (seat belt light still on) I and a few passengers aisles 11,12,13 left side of the plane saw what appeared at first another plane that was so close it was going to hit us. It startled us, the object hovered, it spun in a circle motion and wobbled then quickly ascended above us. There were rain delays for departing planes and there were about 20 planes ahead of us waiting to take off, and several behind us lined up on the runways that we could see,so naturally I thought OMG another plane. I was extremely frightened as I thought we were going to collide, as I continued to stare in horror I realized that this object was not an airplane. At first there appeared to be a mist or fog around this object, the sky at this time was sunny and was becoming cloudless. It was startling, but since we could not use our cell phones, none of us was able to obtain a photo. The object did not shine in the sunlight, it appeared to be metallic and grey and it had several circular \"lights\" around its edges in a line horizontal line formation, it paused at it approached and seem to just hover or be totally still, then zoomed upward. UFO or drone? i am convinced and my initial reaction was that I had just seen a UFO in broad daylight."],"Longitude":"-87.871474","Latitude":"41.9891","Date of the Event":"08/12/2013 04:45 UTC","files":["/var/www/straped/mufon/html2text/50016.html.txt","/var/www/straped/mufon/org/50016.html"],"Date Submitted":"08/19/2013 11:47 UTC","trends":["There have been no other sightings in Rosemont","This sighting has never been favorited."],"Summary":"object witnessed in daylight by several passengers shortly after takeoff.","City":"Rosemont","Disposition":"Unresolved","Country":"United States","Log Number":"US-08192013-0021","Weather Factors":"Unknown","Region":"Illinois","Source":"MUFON","Tags":"City","Viewing Distance":"21-100 Feet, Unknown","Sighting Duration":"00:02:00"}