{"Object Shape":"Sphere, Star-like","Region":"Michigan","Country":"United States","Log Number":"US-08192013-0019","Longitude":"-83.604754","Disposition":"Unresolved","divs":["sighting detailsi was outside enjoying the night air, smoking a cigar. i live near willow run airport and also detroit metro is a few miles down the road. i'm used to seeing planes in the sky at varying altitudes. it's hard to judge how high up the light was, but based on previous experiences with planes, i should have been able to hear it, but i didn't. at night, even when planes are at their highest, i am still able to see con-trails and blinking lights. i first noticed the light coming from a north\\northeastern direction heading south\\southwest. i figured it was another airplane. however, as stated above, as it got closer overhead, i noticed the lack of noise and faa lights. it didn't occur to me to grab my camera, i was just in awe that i was actually witnessing this. if i had went to get my camera, it would have been gone by the time i got back. the \"object\" appeared to be solid light, with no distinguishable features. as it was traveling the light started to flutter, then suddenly dimmed out to a dull red color, and after after a few seconds, it vanished completely. i was searching and searching but could not find the light, it was gone. however, something else happened... as i was searching the skies, i saw another light in the sky. it was not as bright, but it did the exact same thing. it was moving north to south, the light dimmed, then vanished. this all seemed to happen right above where i live. after the initial shock wore off, i began to feel a bit uneasy, almost as if i felt a change in that atmosphere. i didn't even finish my cigar, i put it out and went back inside."],"Case Number":"50014","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.24676,+-83.604754(50014)&iwloc=A&hl=en\"> mufon case (50014) map </A>","Weather Factors":"Unknown","Object Features":"Unknown","trends":["There have been 12 other sightings in Ypsilanti","There were no other sightings in Ypsilanti on or around August 18th 2013"],"Date Submitted":"08/19/2013 10:14 UTC","Latitude":"42.24676","files":["/var/www/straped/mufon/html2text/50014.html.txt","/var/www/straped/mufon/org/50014.html"],"Viewing Distance":"Unknown","City":"Ypsilanti","Source":"MUFON","Tags":"City","Date of the Event":"08/18/2013 12:00 UTC","Summary":"First appeared to be a plane. However, no FAA lights, completely silent, and it changed from bright white to a dim red color before dissappearing.","Object Flight Path":"Straight-line path,Other"}