{"Summary":"2 series of randomly flashing lights that appeared, traveled in a straight line, then disapeared","Latitude":"50.864443","City":"Fareham","trends":["There have been no other sightings in Fareham","This sighting has been favorited 1 time."],"Sighting Duration":"Undisclosed","Log Number":"GB-08202013-0006","Source":"MUFON","files":["/var/www/straped/mufon/html2text/50022.html.txt","/var/www/straped/mufon/org/50022.html"],"Date Submitted":"08/20/2013 09:16 UTC","Longitude":"-1.229784","Viewing Distance":"Over One Mile","Tags":"City","Region":"England","Object Features":"Unknown","Country":"United Kingdom","Disposition":"Unresolved","Weather Factors":"Unknown","divs":["Sighting DetailsThis is my first ever UFO experience. I considered UFO's to be plausible, but did not yet believe in them. I was in bed, awake. I was meditating, and trying to force my emotions into a state of bliss. I had been contemplating whether generating such strong emotions within myself could affect the physical world, such as causing healing. I got up to use the toilet, and afterwards, went to the back door and looked out. I had done this on a number of occasions on other nights, but had never seen anything. I must admit, I had hoped to. A few moments later, I saw a group of lights that were flashing randomly. They were all part of something - definitely grouped together, not separate entities, so I consider them to be a single UFO. They looked as though they could have been on a disc shaped object, but it was difficult to tell. The UFO travelled in a straight line in an easterly direction. It went behind the treeline to the north. After about 30 seconds, it vanished. Then another appeared, this one travelled north, then it vanished as well. I waited a few minutes to see if they were any more, but none appeared so I went back to bed. These UFO's did not display the characteristic flashing lights as seen on any conventional aircraft. It was difficult to tell what size or how high these were. I would say they were neither at very high altitude or at very low altitude. The distance travelled across the sky and the amount of time it took suggested they were travelling very fast. I wasn't shocked or frightened when they appeared. I had a sense something inevitable had simply been confirmed. It struck me that this occurred at precisely the time I was stood looking out my back door, that both UFO's appeared perfectly in my field of vision and that it followed a period of meditation."],"map":"<A HREF = \"http://maps.google.com/maps?q=50.864443,+-1.229784(50022)&iwloc=A&hl=en\"> mufon case (50022) map </A>","Date of the Event":"08/20/2013 04:28 UTC","Object Flight Path":"Straight-line path","Object Shape":"Disc, Unknown","Case Number":"50022"}