{"Region":"Indiana","map":"<A HREF = \"http://maps.google.com/maps?q=41.542632,+-86.421984(50028)&iwloc=A&hl=en\"> mufon case (50028) map </A>","Date Submitted":"08/20/2013 07:37 UTC","Disposition":"Unresolved","Longitude":"-86.421984","divs":["sighting detailsi was on the poarch having a cigarette when i noticed a very bright light about 45 degrees above the horizon quite some distant away (more than 10 miles). it seemed to be pulsating or shimmering then faded\\disappeared for a few seconds, then re appeared for a few more seconds before disappearing completely. the sighting lasted between 10-15 seconds. i live under a main aircraft approach path into chicago and i am a private pilot. the object was in the area where jets heading into chicago usually are visible. i have watched hundreds of planes and this was not like any lights i have seen before. it was very bright, too bright to me to have been an aircrft landing light, especially since it was a bright sunny day around noon. i have seen many of such lights, but none have shown the chactoristics this light displayed. i have a pair of binoculars on the poarch and while i didn't think to grab them when the object was visible, after it disappeared i search the area with binoculars, as well flight path that it would have taken had it been an aircraft going to chicago and did not see anything."],"files":["/var/www/straped/mufon/html2text/50028.html.txt","/var/www/straped/mufon/org/50028.html"],"Tags":"City","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Object Flight Path":"Stationary","Summary":"Pulsating or shimmering light. Very bright.","City":"North Liberty","Object Features":"None","Country":"United States","Log Number":"US-08202013-0012","Latitude":"41.542632","Weather Factors":"Unknown","Object Shape":"Star-like","Source":"MUFON","Date of the Event":"08/19/2013 12:00 UTC","Case Number":"50028","trends":["There has been one other sighting in North Liberty","There were no other sightings in North Liberty on or around August 19th 2013"]}