{"Source":"MUFON","Sighting Duration":"01:00:00","divs":["Sighting Details8-19-2013 Approximately 11:00 pm MST I was sitting on my sofa watching television. Centennial Airport is approximately three miles NNE from my home. We see and hear planes landing and departing from our home daily and can distinguish planes from stars or other objects in the sky. From my sofa I noticed a bright object appear and remain stationary. At first I ignored the object however the object remained stationary and from my maked eye I could see pulsating light and suddenly a light or beam shot flashed down from the object. I then went outside looking west and viewed the object. The object appeared more birlliantly than from inside my home. I went inside and asked my wife for binoculars and shared what I saw. My wife then followed me outside so we could see the object together sharing the use of the bincoulars. I then went inside and found my sons telescope and returned outside and used that while my wife used the binoculars. We viewed the object simultaneously. Each providing almost similar descriptions. I then retrieved an old digital camera and took photos of the object. I watched the object for nearly 40 minutes. The object did appear to move further west. To determine if it had moved at all I returned to my sofa and sat at the same postion where I first observed the object. The object did move WNW and slighly lower to 25 degrees above the horizon from my vantage point. As I write this description I uploaded the photos and they are very poor in quality. I don't know if I missed the object or not but the photos do not provide detail of the object. Now that I think about it I did use the flash. Not the brightest photographer."],"City":"Parker","Object Features":"Unknown","Region":"Colorado","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Date Submitted":"08/20/2013 10:34 UTC","Weather Factors":"Unknown","Latitude":"39.550709","map":"<A HREF = \"http://maps.google.com/maps?q=39.550709,+-104.823199(50023)&iwloc=A&hl=en\"> mufon case (50023) map </A>","Log Number":"US-08202013-0007","trends":["There have been 7 other sightings in Parker","There were no other sightings in Parker on or around August 19th 2013","This sighting has never been favorited.",""],"Object Flight Path":"Stationary,Hovering then path","Summary":"Stationary red green-blue white pulsating obnject","Longitude":"-104.823199","Case Number":"50023","files":["/var/www/straped/mufon/html2text/50023.html.txt","/var/www/straped/mufon/more/50023_submitter_file1__002.JPG","/var/www/straped/mufon/more/50023_submitter_file2__003.JPG","/var/www/straped/mufon/more/50023_submitter_file3__004.JPG","/var/www/straped/mufon/org/50023.html"],"Date of the Event":"08/19/2013 12:00 UTC","Country":"United States","Object Shape":"Sphere","Tags":"City"}