{"Longitude":"-112.15706","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around January 12th 2013"],"Country":"United States","Date Submitted":"08/21/2013 12:20 UTC","Log Number":"US-08212013-0002","Tags":"City","Object Features":"Unknown","Case Number":"50035","Weather Factors":"Unknown","Object Shape":"Blimp","Source":"MUFON","files":["/var/www/straped/mufon/html2text/50035.html.txt","/var/www/straped/mufon/org/50035.html"],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=33.385652,+-112.15706(50035)&iwloc=A&hl=en\"> mufon case (50035) map </A>","Date of the Event":"01/12/2013 06:32 UTC","Sighting Duration":"00:20:00","Summary":"Multiple sightings within a 20 minute period. Initially 25 to 40 stationary red light and them 16 drifting amber lights.","City":"Phoenix","Latitude":"33.385652","Object Flight Path":"Stationary,Straight-line path","divs":["Sighting DetailsIt was early evening. The NFL playoffs where on and it was the Broncos against the Ravens. I am not a fan and left a friends house in Tempe when the game broadcast began. I came home to Laveen and at about 6:30 PM decided to go to the end of the block to check my mail. I am only 4 houses from the end of the block where the mail boxes are and as usual I grabs my bike to ride down there. I came out of the garage and rolled to the end of the drive way and into the street. I looked North and what I saw made me drop the bike. There is a street lamp above the mail boxes and behind and above it is a tall eucalyptus tree. What I saw above and beyond the tree was a cluster of anywhere from 25 to 40 bright red lights off in the distance. My first though was Christmas lights, but these where at about 40 degrees up above everything. My reaction was to pull my cell phone out and video record the lights. The street lamp below prevented that. I looked around and there was not a soul in sight. I went directly across to the neighbors house. I felt I needed a second set of eyes on this odd sight. I rang the door bell and waited about a minute. I kept wanting to go back out to the street where I could see the lights and finally did when no one came to the door. Back out in the street I looked North and the lights where gone. I though \"great, \"D\" is going to come to the door and I am going to sound like a nut job\" so I got on my bike and rode to the mail box. Just to the left of the mail box is a walkway that enters the green zone. I walked out onto the sidewalk looking Northwest and the sky was full of amber lights. I counted 16 of them and they appeared to be drifting Eastward in no particular formation at less than 500 ft high and no more than a few miles distant, maybe 4 at the most. I could make out what appeared to be a large swept wing aircraft maneuvering around these drifting lights. I stood and watched them drift by and as they drifted behind the eucalyptus tree and emerged on the East side of the tree they where greatly dimmed. They could still be seen drifting but you really had to focus to follow them. I believe these where military flares and if so, why over residential housing? I think maybe they where intended to distract attention from whatever else was in the sky that night. I came home and immediately went on the internet to see if any such think was reported. I Googled \"UFOs over Phoenix\" and landed on a webpage with exactly that title. I clicked the news link and to the left was a phone number so that a person could report sighting 24 hours a day. I called a number and a man answered. I said \"I found the number on the web page and would like to report a sighting.\" I said \" I was standing in the street and saw red lights to the North\" and the phone wnet dead. I called back and only got a message telling me that I didn't have the authority to call that number. This happened repeatedly. This creaped me out so I went to bed. I later found out the the number I called was a pre-paid phone and his minutes ran out. That's my story."],"Region":"Arizona","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile"}