{"Object Flight Path":"Hovering then path,Path with directional change","Latitude":"-26.200173","Source":"MUFON","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=-26.200173,+28.053525(5003)&iwloc=A&hl=en\"> mufon case (5003) map </A>","Object Shape":"Disc, Oval","files":["/var/www/straped/mufon/html2text/5003.html.txt","/var/www/straped/mufon/org/5003.html"],"Longitude":"28.053525","Object Features":"None","Log Number":"ZA-06302006-0001","Disposition":"Unresolved","Summary":"Unknown Lights - JHB","trends":["There have been 3 other sightings in Johannesburg","There were no other sightings in Johannesburg on or around May 15th 1999"],"Weather Factors":"Unknown","Country":"South Africa","Date Submitted":"05/15/1999 07:22 UTC","City":"Johannesburg","Viewing Distance":"Unknown","Case Number":"5003","Tags":"City","Date of the Event":"05/15/1999 07:22 UTC","divs":["sighting detailsmy parents had just returned from a meeting with my lecturers, and told me that they saw two (2) lights over the low mountain-chain against which our house was situated on the way home. we went outside, and the two unknowns were seen hovering, one on top of the other, in a north-westernly direction. they proceeded to slowly move away, over the mountain. we collected our binoculars, and telescope, and proceeded to follow them for approximately one (1) hour, during which time we contacted via cellular phone the johannesburg international airport requesting information on aircraft in the area of krugersdorp, a small suburb of johannesburg, over which the objects were travelling. the reply was that no radar contacts were in that area. during this time the lights merged into one. before this event, visual contact was made and the objects' shapes were determined to be disc-shaped. we also contacted the police station in said suburb, and were told that an ovoid object had been sighted very close to the police station, which promptly disappeared, corresponding with our own sighting of the light abruptly fading out.the object\\s were in visual sight during most of the 1h15min duration, excepting the drive up the side of the mountain-chain. the entire incident was slightly unsettling, and i stil get nervous talking about it."],"Region":"Gauteng"}