{"divs":["sighting detailsi went outside to smoke a cigarette late at night,and walked over to the west side of the property to look at the stars,only to see a gigantic thing that i thought at first looked like a galaxy. it was stationary and was in the shape of a domed craft(the dome part was very tall). inside the the outline was what looked like a million stars. there was also wide bands of color around the thing like transparent-washy looking(red,blue and green). also a mist enveloped it(partially) and the mist was rotating slowly like around a planet. the countless lights that looked like twinkling stars didn't untwinkle. in the background you could make out a structure-city-like construct. i watched it for 5 minutes or so, went to get my camera, and the battery was dead(never happened before). the next night i had a friend over and we both went outside to smoke (we're both nightowls). i thought to myself-it's about the same time(after 1:00 am),i wonder if that thing is back. sure enough, there it was. i called him over to the same spot in between the cedars, and asked him-\"what do you think of that?!!!\" his reply was-\"they're here!\" we watched it for 5 or so minutes just floating there. couldn't tell how large it was(because it was so huge and not knowing how far away it was.)went to get the camera and remembered-the battery's dead. didn't charge it because i had no way of predicting it would return a second night. someone else had to see this. noone's talking or they never look up.or just plain afraid. after processing this in my head a while, the only conclusion i came up with is-floating city (of sorts). the airport had to have a nervous breakdown. i wish i watched it for a longer period of time, but it was late and i\\we were getting cold, and regretting having no camera."],"Date Submitted":"08/20/2013 10:37 UTC","Latitude":"42.104577","Region":"New York","Object Shape":"Other","Longitude":"-75.913544","Source":"MUFON","City":"Binghamton","Disposition":"Unresolved","Summary":"Object looked initially like a new gigantic galaxy with twinkling lights, color bands, and a mist that moved around it. Shape of a domed giant floating city.","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=42.104577,+-75.913544(50032)&iwloc=A&hl=en\"> mufon case (50032) map </A>","Sighting Duration":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/50032.html.txt","/var/www/straped/mufon/org/50032.html"],"Weather Factors":"Unknown","Log Number":"US-08202013-0016","trends":["There have been 14 other sightings in Binghamton","There were no other sightings in Binghamton on or around March 7th 2009"],"Date of the Event":"03/07/2009 01:15 UTC","Object Features":"Other","Country":"United States","Viewing Distance":"Unknown","Case Number":"50032"}