{"Region":"Michigan","Country":"United States","Latitude":"42.319832","Tags":"City","files":["/var/www/straped/mufon/html2text/50039.html.txt","/var/www/straped/mufon/org/50039.html"],"Viewing Distance":"21-100 Feet","Date of the Event":"11/15/2008 03:15 UTC","Summary":"A craft flew up to me and flashed a light sequence at me, then hovered out of my line of sight.","Case Number":"50039","Longitude":"-83.076151","Object Shape":"Other","City":"Detroit","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Source":"MUFON","Log Number":"US-08212013-0006","Weather Factors":"Unknown","trends":["There have been 56 other sightings in Detroit","There were no other sightings in Detroit on or around November 15th 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.319832,+-83.076151(50039)&iwloc=A&hl=en\"> mufon case (50039) map </A>","Object Features":"Dome, Other","Date Submitted":"08/21/2013 10:48 UTC","Disposition":"Unresolved","divs":["Sighting Details I was cleaning a vacant apartment on the 13th floor, ( I'm a maintenance guy for an apartment building in downtown Detroit) on a sunny fall day. Something kept reflecting sunlight into my eyes from out side, I ignored it the first few times, figuring it was a traffic helicopter or passenger jet. After about the 5th of 6th time I was annoyed and went to the window to see what was bouncing this sunlight at me. Right away I could see this shiny object off in the distance, maybe a couple miles away, maybe further. At first it seemed to be stationary, so I figured it was a helicopter. As i'm looking at it starts to head in my direction, and as it gets closer it looks less and less like a helicopter. It takes just a few seconds (maybe 8 seconds?) to close on my position, until finally it's only maybe 20 or 30ft outside the window I'm at on the 13th floor. It's at my altitude, basically eye level with me, as it starts to rotate up on its side. I'm in awe as this is happening, not frightened, or nervous, just amazed. The first thing that caught my eye as it rotated on to its side was a small pulsing red light in the center of the underside of the craft. It's hard for me to explain the shape of the craft so I've included three drawings. Part of the reason it's taken me so long to make this report is because I've had a hard time getting the sketches just right. I've tried to draw this thing a few dozen times and I've never been happy with the results until now. I can say with absolute certainty that the drawings I've included are exactly what I saw. I've also included a photo I took out of the window I was standing at, I took this photo at a much later date, just as a reference to the area. Basically the craft is in the shape of three saucers connected together in the center, only one dome on the top, but three \"pods\" for lack of a better word make up the body of the craft. It seems to be a polished metal, not a mirror finish like chrome, but a reflective metal surface. So as it's tilting towards me I see the pulsing red light, and I see that each of the three pods has a round circular light in its center. Once the bottom of the craft is facing me the three white lights start blinking in a sequence, and the craft starts to rotate clockwise. The blinking pattern gradually speeds up, and the rotation remains steady. Then another set of light around the outer edge of the three white lights start flashing, only these are multi colors. There are very vibrant blues and greens and orange and yellow and purples. The sequence speeds up more and more until the whole thing is just a blur of lights, all the while rotating at the same steady pace. Then the lights just stopped suddenly, the craft rotated back down to it's upright position, and it hovered off to the North East around the side of my building and out of my line of sight. I never saw it shoot off at tremendous speeds or anything, it just hovered away. I ran down to the street level and searched the sky to find it again, but I never saw it again. I felt like the craft was trying to hypnotize me, but I don't think it worked, at least I never felt any different. Although I must say that since this event I've done a lot of research on UFOs and the subject of abductions, and it seems most folks don't think anything other than a sighting happened to them either. So I suppose there could be more to my story, but I remember looking at the clock after it left and I hadn't lost any time, so I'm assuming I wasn't a good candidate for abduction. This is by far the strangest, most amazing thing that has ever happened to me. Even though it's been almost five years since it happened, I remember it like it was yesterday, and I'll never forget it. It has changed my outlook on life for the better. I've made allot of positive changes in my life since my sighting and I feel blessed to have been witness to such an amazing thing."],"Sighting Duration":"00:03:00"}