{"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Case Number":"50038","City":"Cambridge","Log Number":"GB-08212013-0005","Summary":"Too far out to go in to detail","Tags":"City","files":["/var/www/straped/mufon/html2text/50038.html.txt","/var/www/straped/mufon/org/50038.html"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.377216,+-71.107244(50038)&iwloc=A&hl=en\"> mufon case (50038) map </A>","trends":["There have been 17 other sightings in Cambridge","There were no other sightings in Cambridge on or around July 29th 2013"],"Viewing Distance":"20 Feet or Less, 21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile, Unknown","Weather Factors":"Unknown","Source":"MUFON","Latitude":"42.377216","Country":"United States","divs":["sighting details29th july 2013 cambridgeshire, uk 4am - 6am gmt multiple sightings of various ufos at close range, altitude and high altitude, taking place over two hours. at high altitudes on clear sky morning at sunrise there were four blurred, hazy green lights in a line formation with a fourth red light at a 90 degree angle to the lower green light. this object moved vertically up and down from position to position disturbing high altitude clouds. closer to the ground, no more than a mile up three smaller single green lights moved around in different directions, covering miles in seconds and returning to hover. much closer to the ground, hovering silently 20 - 30 feet up from the observers, two medicine ball size, dull metallic 'orbs'. both with one small green light towards the top were seen in multiple locations. from the direction of one of these two small round objects came a silver metallic 'l' shaped object (not attached but disconnected moving independently) slowly hover\\move down 10 feet closer to the ground. from this l shaped object came a translucent but with red light within, eel shaped but robotic object about one foot long and 10 inches wide. it came to within feet or inches of one observer. in the distance, hovering no more than 20 feet above the horizon, estimated to be about 1 - 2 miles away. a large silver metallic disk with a black band running horizontally along the middle seemed to hide behind a tree line. given away by the sun reflecting on its top. the rest of the experience is a personal subject but i think the governments of this world really have to acknowledge and do something about this level of interference from other, more advanced and perhaps megalomaniac species."],"Date of the Event":"07/29/2013 04:00 UTC","Longitude":"-71.107244","Object Shape":"Chevron, Circle, Disc, Oval, Sphere, Unknown","Region":"Massachusetts","Disposition":"Unresolved","Date Submitted":"08/21/2013 06:45 UTC","Object Features":"Other"}