{"Object Shape":"Star-like","Weather Factors":"Unknown","Viewing Distance":"Unknown","Date Submitted":"08/21/2013 11:14 UTC","trends":["There have been 14 other sightings in Cumming","There were no other sightings in Cumming on or around August 21st 2013"],"Sighting Duration":"Undisclosed","Country":"United States","Longitude":"-84.220263","Source":"MUFON","Latitude":"34.198419","map":"<A HREF = \"http://maps.google.com/maps?q=34.198419,+-84.220263(50049)&iwloc=A&hl=en\"> mufon case (50049) map </A>","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Log Number":"US-08212013-0016","files":["/var/www/straped/mufon/html2text/50049.html.txt","/var/www/straped/mufon/org/50049.html"],"Region":"Georgia","Disposition":"Unresolved","Date of the Event":"08/21/2013 09:15 UTC","Object Features":"Other","Case Number":"50049","City":"Cumming","Tags":"City","Summary":"2 bright lights in the sky, change for red to green and white..drops like a rock","divs":["Sighting DetailsSitting on the front porch and noticed 2 bright lights in the sky to the south. They hovered and changed directions going back and forth. Then they would change from green to red and drop like a rock behind the treeline. This was about 2 weeks before I made this report. I was told they may have been Helios helicopters. I didn't notice them again until last night, they were in the same location and doing the same thing as before, changing color and dropping out of sight and back up again. Tonight they appeared at the same time around 9:15pm. I drove to a better location to observe them and a couple of more people were watching them. A lady said that it flew right over them just before I arrived and was in the shape of an asterisk with a spinning motion in the center, she said it made a slight humming noise like an air conditioning unit. We watched the lights hover, float around make hairpin turns and come to a complete stop. One of the objects changed colors from a green and white light to a brilliant red and dropped like a rock behind the treeline. The other one remained in the air and floated around then stop and hover. A few minutes passed and the object that dropped behind the treeline reappeared rising back up in a brilliant red light..then the object went from red to a blinding white light. We watched the objects and we had a really freaky feeling watching them. then both objects turned red and dropped behind the treeline and we didn't see them again. The other couple said they came to the same location last night and watched the same thing, they appear at the same time at night and the event last a good 45 minutes. They said that when they both dropped behind the trees you don't see them again. Not sure if they are landing but the one goes down while the other stays up and hovers and floats nearby. Both objects dropped below the tree line. we stayed around but didn't see the objects again. If a Mufon investigator can contact me I will send him directions..i have a feeling they will be back again tomorrow evening."]}