{"Case Number":"50048","trends":["There have been no other sightings in New Tazewell","This sighting has never been favorited."],"Region":"Tennessee","Latitude":"36.428639","Country":"United States","Log Number":"US-08212013-0015","Sighting Duration":"Undisclosed","City":"New Tazewell","Viewing Distance":"Unknown","Date Submitted":"08/21/2013 10:32 UTC","Source":"MUFON","Object Features":"Unknown","Date of the Event":"08/21/2013 09:15 UTC","Disposition":"Unresolved","Summary":"Very bright light with colored beams hovering","map":"<A HREF = \"http://maps.google.com/maps?q=36.428639,+-83.586838(50048)&iwloc=A&hl=en\"> mufon case (50048) map </A>","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/50048.html.txt","/var/www/straped/mufon/org/50048.html"],"divs":["Sighting DetailsI was emptying out a cooler on the back deck, when I raised up, I saw the light in the sky above a nearby hill. The sky was grey with some stars visible, but this was super bright. At first I thought it was a helicopter hovering, so I went back inside and came back out about five minutes later. It was still there. I called my daughter in Cleveland, Ohio to tell her I was pretty sure I was seeing a UFO. While talking to her a few minutes and watching the object, it very gradually moved a little to my right, so that I had to re-position myself to look through the tree on the hill. I then went back in the house to put on my shoes and go out the door at the end of the house so I could see the object better. The object was still hovering in the same general area but again started to very gradually moved away from me and back over the \"horizon\" of the hill. I could see intermittent changes of color that appeared to be revolving around the bright light. These were red and blue or green and created very thin light streaks from the object. Though skeptical of the stories I have read and heard of many \"UFO\" sightings, I do believe we are not alone in this world. The prospect of seeing a real UFO and aliens was exciting and scary at the same time. My fiance is in Bristol, TN tonight on business, so I was alone. That's part of the reason I called my daughter - it was a bit freaky being alone. I also wanted corroboration after the fact that I had seen this object, and I know she would love to see one too."],"Object Flight Path":"Stationary","Tags":"City","Longitude":"-83.586838","Object Shape":"Star-like, Unknown"}