{"Longitude":"-122.317485","Case Number":"50043","Object Shape":"Star-like, Triangle","divs":["sighting detailsapx 9:45pm 8\\20\\13 puyallup wa. went outside at 9:30 to photograph the moon, looked up at clear sky towards north\\east of moon position and noticed a triangle of what appeared to be three bright stars. one of the points began moving in very erratic ways, up,down, circular movements, zig-zagging then returning to original position with the other two points of light. this continued for apx 20 mins total. we did try to video this, and are currently working on it to see if we were able to catch anything on film. we were floored! not only did the object continue to move on and off for over 20 mins, but the last time it \"reconnected\" to the other two, the entire group of three began to move south directly over us and then actually tilted and continued to move. when that occurred you could make out a \"center\" which looked like heat waves between the three lights as if they were attached to a craft that was someone mostly invisible. i know how ridiculous this sounds, and i'm praying that something shows on that video. it was huge. although i'm a believer, i have never witnessed anything like this, and was absolutely shaking after this completely went south over our house and then disappeared. i do not know what it was, and cannot make any claims other than an honest description of what my husband and i saw. we will send anything we find on our video. i'm hoping someone else saw this, so perhaps we aren't the only witnesses."],"Source":"MUFON","Object Features":"Other","Tags":"City","Viewing Distance":"Over 1 Mile, Unknown","Region":"Washington","Weather Factors":"Unknown","Summary":"Apx 9:45pm 8/20/13 Puyallup Wa. Went outside at 9:30 to photograph the moon","Date of the Event":"08/20/2013 09:45 UTC","City":"Puyallup","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","trends":["There have been 13 other sightings in Puyallup","There were no other sightings in Puyallup on or around August 20th 2013"],"Latitude":"47.150768","Log Number":"US-08212013-0010","files":["/var/www/straped/mufon/html2text/50043.html.txt","/var/www/straped/mufon/org/50043.html"],"Disposition":"Unresolved","Sighting Duration":"Undisclosed","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=47.150768,+-122.317485(50043)&iwloc=A&hl=en\"> mufon case (50043) map </A>","Date Submitted":"08/21/2013 04:19 UTC"}