{"Date of the Event":"04/16/2012 09:06 UTC","Date Submitted":"08/21/2013 04:40 UTC","Log Number":"US-08212013-0011","Latitude":"30.279381","Region":"Louisiana","Sighting Duration":"Undisclosed","City":"Westlake","Disposition":"Unresolved","Viewing Distance":"Over 1 Mile, Unknown","divs":["Sighting DetailsOn April 16, 2012 at 21:06 (9:06 PM), I stepped out my front door to take out the trash.It had been raining to some degree for the past day or two, and the rain had finally let up, with very low thick rain clouds covering the entire area. As I stepped on my front porch, I observed what I thought was a very low commercial jet with its landing lights on about a mile away directly to the West. On the way back into the house, I observed the object still due West, and very slowly moving South, well below the very low thick rain clouds. I stopped and observed the object for about 20 seconds and noted that it appeared to be pulsating and moving too slow to be a plane, plus there was no noise coming from that direction. I immediately ran into the house and grabbed my binoculars and Sony Handicam. I first looked through my binoculars and observed the most beautiful object that I have ever seen which consisted of a perfectly round white ball of light (or energy)that was closely shrouded by a blue colored field that appeared to be electrical in nature. In addition, the white ball center was being orbited systematically by what appeared to be smaller red balls of energy that appeared to be some type of plasma. The systemactic movement of the red orbs around the main white center neuculus reminded me of the rapid timed movements of a engines pistons firing in secquence. Surrounding the large white center neuculus, orbiting red orbs, and blue electical field; were a perfect ring of rose colored neon like lights blinking around the far outer perfect circle surrounding all the inter workings of the object. This gave me the impression that this was an outer ring of the same very large object, although no structure or lights could be seen between the center orb and the rose colored ring of lights circling around the center a great distance to the outside. After observing this with my binoculars, and catching my breath, I began videotaping the object as it slowly moved between two trees in the distance. Object was believed to be about 500 feet off the ground and over a mile away to the West. Object was HUGE! The video showed the object go behind a tree in the distance, then the object appeared to shoot straight up into space with a flash from behind the tree. (A blast of static was recorded on my video when the object blasted up into space in a flash, even though the volume was turned off on the camcorder). I watched the video about 50 times and my neighbor about a dozen times, before the video was loss likely from a defective DVD Disc. (Still have the disc if someone knows how to retreive the video off of it?).I did save still shots of the video to my cellphone, but can not attach them here, but I can email them if needed. I drove to the area where the object was seen without seeing it further. I did note that high voltage power lines were in the area that the object was observed."],"Weather Factors":"Unknown","Object Features":"Other, Unknown","Source":"MUFON","Summary":"Object appeared to be made of energy like a giant atom.","Tags":"City","Object Shape":"Sphere, Other","map":"<A HREF = \"http://maps.google.com/maps?q=30.279381,+-93.273172(50044)&iwloc=A&hl=en\"> mufon case (50044) map </A>","Case Number":"50044","Object Flight Path":"Path with directional change","Country":"United States","trends":["There have been 12 other sightings in Westlake","There was one other sighting in Westlake on or around April 16th 2012"],"files":["/var/www/straped/mufon/html2text/50044.html.txt","/var/www/straped/mufon/org/50044.html"],"Longitude":"-93.273172"}