{"Date of the Event":"07/22/2013 10:06 UTC","City":"Williamsburg","Region":"Virginia","Sighting Duration":"Undisclosed","Viewing Distance":"20 Feet or Less","Log Number":"US-08222013-0014","Source":"MUFON","Latitude":"37.233506","Country":"United States","trends":["There have been 3 other sightings in Williamsburg","There were no other sightings in Williamsburg on or around July 22nd 2013"],"Summary":"I video taped this at Busch Gardens while watching the fireworks","files":["/var/www/straped/mufon/html2text/50066.html.txt","/var/www/straped/mufon/org/50066.html"],"Object Flight Path":"Other","Case Number":"50066","Date Submitted":"08/22/2013 09:21 UTC","Object Features":"Other","divs":["Sighting DetailsI was at Busch Gardens in Williamsburg Va. taping the fireworks. Just as I turned on my camera phone I noticed a beam of light in the sky, but thought nothing of it. I did not know what I had videotaped until a couple of days later. What you see is exactly what I filmed. What it looks like is an unidentified craft that seems to be watching the fireworks. It moves at incredible speeds in all directions. It has what looks like a light beam coming from the craft. I have frozen the video at various points and the shape of the craft looks like a space capsule or shuttlecock. At various times it is moving so fast it is just a blur of lights. On two of the places I froze the video it takes a different shape like it is warped. Thats the best I can describe it. Like I said at the time I taped it I did not know what I was filming. Only after seeing it later I was in awe by what was on the video. I have tried to think of every other possibility other than a UFO that this could be. A ride at the park no someone pulling a prank I dont think so. I have no doubts this is a real UFO. There were other people there that were filming this also. I can't be the only one to have this on video. Aliens from outerspace can't be all that bad, evidently they like fireworks too! If I had known I was filming this I would have left my camera phone on longer. Let me know what you think and if you have ever seen anything like this before."],"Longitude":"-76.643833","Weather Factors":"Unknown","Object Shape":"Other","Disposition":"Unresolved","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=37.233506,+-76.643833(50066)&iwloc=A&hl=en\"> mufon case (50066) map </A>"}