{"Summary":"Long black tube UFO flew parallel to plane I was in for 2 minutes then changed direction","Country":"United States","Date of the Event":"03/14/2012 12:00 UTC","Disposition":"Unresolved","Date Submitted":"08/22/2013 02:44 UTC","Tags":"City","Source":"MUFON","City":"Undisclosed","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was on the first leg of a flight from Denver, CO to Charleston, SC before it made a stop in Nashville, TN (I was on the DEN to BNA leg). The flight took off at 9:25am MST. The pictures I took on my phone had time stamps from 3:07pm to 3:08pm. I do not believe these times to be correct because the flight was scheduled to land in Charleston, SC at 3:45pm EST. I was staring out the window, as I do on long boring flights and I noticed a long black cylinder like object directly off the left side of the 737 aircraft I was in. I fly often and know what other aircraft looks like outside of a plane window. This object was odd because it had no trail and it kept up with the plane I was in, before changing directions completely and speeding up to go in the opposite direction. At first the object was almost vertical and then it moved to become more level (see attached images). I pointed the object out to my friend who was traveling with me and he could not explain it either. I felt like the object was observing the plane I was in and then lost interest and went on its way. I lost sight of it when it changed directions and sped away from our plane. I have attached images of the object that I captured with my iPhone 4."],"Viewing Distance":"501 Feet - 1 Mile","Latitude":"35.520161","Region":"Tennessee","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=35.520161,+-86.572287(50060)&iwloc=A&hl=en\"> mufon case (50060) map </A>","Case Number":"50060","Weather Factors":"Unknown","trends":[],"Object Features":"Unknown","Object Shape":"Cylinder","Longitude":"-86.572287","Log Number":"US-08222013-0008","files":["/var/www/straped/mufon/html2text/50060.html.txt","/var/www/straped/mufon/org/50060.html"]}