{"divs":["sighting detailsaround 8 pm, i was laying in my pool and looking strait up and saw an object very high in the sky that was simular to venus, except bigger and brighter than venus. venus was just barely visable at this time about 45 degrees above the horizon to the west (as it has been for about the past month at sunset). quickly checked the object out with binoculars, and it did not look like a planet or star. then looked at the object with a x78 power telescope, and the object looked like a mostly clear reflective soap bubble with a swinging line attached at the bottom with some sort of reflective object swinging wildly at the end of the line. tried to get pictures\\video with my x40 power sony videocam, but it could not pick up the swinging line with the dangling object attached due to its extreme high altitude(which was likely in the 100,000 feet range). my guess was that it was a weather balloon with instruments attached (at first). however, i kept watching it for about 20 minutes, until it just vanished against the clear blue sky. i had a good visual on it, and it just disappeared. i had attempted to record the object from a tripod, but was unable to adjust the tripod to a nearly straight up angle. this makes about 12 sightings at this location in the past five years of high altitude stationary objects that just vanish into the clear blue sky!"],"Object Shape":"Sphere, Star-like","Object Features":"Other","Object Flight Path":"Stationary","trends":["There have been 12 other sightings in Westlake","There was one other sighting in Westlake on or around August 21st 2013"],"Log Number":"US-08222013-0010","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Region":"Louisiana","Date Submitted":"08/22/2013 05:48 UTC","Disposition":"Unresolved","Country":"United States","Date of the Event":"08/21/2013 12:00 UTC","Source":"MUFON","Case Number":"50063","Tags":"City","City":"Westlake","map":"<A HREF = \"http://maps.google.com/maps?q=30.27275,+-93.279773(50063)&iwloc=A&hl=en\"> mufon case (50063) map </A>","Longitude":"-93.279773","files":["/var/www/straped/mufon/html2text/50063.html.txt","/var/www/straped/mufon/org/50063.html"],"Viewing Distance":"Unknown","Summary":"It may have been a weather balloon, BUT...","Latitude":"30.27275"}