{"Longitude":"-121.399951","Source":"MUFON","Date Submitted":"08/23/2013 04:47 UTC","City":"North Highlands","Tags":"City","Case Number":"50076","Date of the Event":"08/23/2013 10:20 UTC","Disposition":"Unresolved","Region":"California","Viewing Distance":"101-500 Feet","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=38.670442,+-121.399951(50076)&iwloc=A&hl=en\"> mufon case (50076) map </A>","Object Features":"Unknown","Object Flight Path":"Straight-line path,Other","Weather Factors":"Unknown","Object Shape":"Circle, Star-like, Other","Log Number":"US-08232013-0004","Latitude":"38.670442","files":["/var/www/straped/mufon/html2text/50076.html.txt","/var/www/straped/mufon/org/50076.html"],"Sighting Duration":"Undisclosed","Summary":"bright white lighted orb at night seen north east going in straight line then disappearing","trends":["There have been 6 other sightings in North Highlands","There were no other sightings in North Highlands on or around August 23rd 2013"],"divs":["Sighting DetailsI live in North Highlands , CA. ( a sub-division of Sacramento County). I was sitting out in my backyard at night just doing some star gazing. Something I like to do on clear nights. I live near an air force base so I am used to the choppers and jets and cargo planes and private jets and all that...... I know what they look like in the day or the night. I know what they sound like even more. I see and hear 'em all the time. Well, on the night of August 23, 2013 around 10pm I was star-gazing and noticed a bright white round object(which I thought was a star at first)moving. It was going rather slow in a straight line. This object was about 500-600 ft. high up but it was large enough where I could see it in good detail. At first I thought it just might be a chopper with it's searchlight on. But I know how those things are at night. They swivle and sway and so do their lights as a result; not to mention all the other lights they possess. No, this object was solid white and had a faint fuzzy white glow to it. At first, I was in an observation mode trying to deduct all of the possibilities of what it could be. I thought it couldn't be a plane, they have wing lights on during flight. A chopper.... same thing. This object had absolutely no sound to it whatsoever. I now knew I was looking at a U.F.O. when the said object's light started to dim out more and more until it just disappeared. I looked for tail or wing lights after that.... but nothing was seen. There were no horizons or buildings or mountains or anything to cause an obstruction to my view. It just disappeared. I was amazed asto what I just witnessed. I am wondering if anyone else in Northern CA. or more specically in Sacramento has seen anything like this recently? Or am I just nuts ;-)....No videos or pics ....sorry !..! U"]}