{"Disposition":"Unresolved","Object Features":"None, Unknown","divs":["sighting detailsi was parked on a street in long island city which is located in queens new york. the street i was parked on at the time is between the mid-town tunnel(which leads into manhattan)and the long island expressway. i adjusted my seat to lean back giving me a clear view of the sky which was overcast at the time. no soon as i looked at the sky a dark\\black triangle ufo flew overhead and was out of sight in seconds. i knew right away that it was one of the triangle ufo's that have been reported in the mid-west and western states. it wasn't the large 'mother ship' reported, this was the smaller version. like i mention it was triangle in shape and seemed to glide effortlessly through the air. the had a dull dark\\black color to it, hand not lights emitting from it, it seemed to be smooth. it was so low that if it were a conventional plane i would have seen the passengers in the windows; the ufo flew towards the direction of manhattan. when i notice the ufo fly over the car, i immediately got out to get a view of it but was no were to be seen. when i got back into my car i thought \"well, you saw a 'triangle'\"."],"City":"Long Island City","Country":"United States","Sighting Duration":"00:00:03","Object Shape":"Triangle","Source":"MUFON","Longitude":"-73.12648","Log Number":"US-08232013-0005","files":["/var/www/straped/mufon/html2text/50077.html.txt","/var/www/straped/mufon/org/50077.html"],"Tags":"City","Viewing Distance":"101-500 Feet","Region":"New York","trends":["There have been no other sightings in Long Island City","This sighting has never been favorited."],"Object Flight Path":"Straight-line path","Date Submitted":"08/23/2013 05:13 UTC","Weather Factors":"Unknown","Latitude":"40.790762","Summary":"Just happen to look up at the sky, which was overcasted, and witnessed a triangle shaped dark/black ufo overhead","Case Number":"50077","map":"<A HREF = \"http://maps.google.com/maps?q=40.790762,+-73.12648(50077)&iwloc=A&hl=en\"> mufon case (50077) map </A>","Date of the Event":"07/24/2009 01:00 UTC"}