{"Viewing Distance":"Unknown","Region":"Arizona","map":"<A HREF = \"http://maps.google.com/maps?q=33.68424,+-112.408511(50073)&iwloc=A&hl=en\"> mufon case (50073) map </A>","Disposition":"Unresolved","Tags":"City","divs":["sighting details8\\14\\2013 5:19am i was driving to work from surprise az, to central phoenix. i stopped at a stop sign on the access road to grand ave. and saw there was a nice cloud formation backed by a colorful sunrise. i often takes pictures of scenes like this, when i can, and since there were no cars behind me this early, i decided to snap one of this view. grand ave runs diagonal (s\\e - n\\w).i held my phone\\camera out of the drivers side window and took the shot facing east at the sunrise. i took two shots and never even reviewed them until a few days later (monday august 19th 2013). i was at home using my phone to view my pics on my tv and that's when i noticed the glowing lights in the sky above the clouds. the tv doesn't have the function to zoom in so i had to look back at my phones screen to zoom in and was in aw at what i was looking at. 6 orbs of light in a circular or oval shape. i'm not sure if they were separate objects or all a part of one object. i live near luke airforce base and see fighter jets all the time but this was definitely not one of them."],"Log Number":"US-08232013-0001","Sighting Duration":"Undisclosed","Case Number":"50073","Date Submitted":"08/23/2013 12:03 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/50073.html.txt","/var/www/straped/mufon/more/50073_submitter_file1__20130814051937.jpg","/var/www/straped/mufon/more/50073_submitter_file2__2013081911.56.31.png","/var/www/straped/mufon/org/50073.html"],"Object Shape":"Circle, Oval","Longitude":"-112.408511","Summary":"On my way to work, I took a picture of the sunrise. Later discovered the orb formation in my photo.","Object Features":"Unknown","Object Flight Path":"Unknown","Date of the Event":"08/14/2013 05:19 UTC","trends":["There have been 11 other sightings in Surprise","There were no other sightings in Surprise on or around August 14th 2013","This sighting has been favorited 1 time.",""],"Weather Factors":"Unknown","Latitude":"33.68424","Source":"MUFON","City":"Surprise"}