{"Date of the Event":"08/18/2013 08:43 UTC","Object Flight Path":"Stationary,Straight-line path,Path with directional change","Case Number":"50071","map":"<A HREF = \"http://maps.google.com/maps?q=42.565694,+-87.812494(50071)&iwloc=A&hl=en\"> mufon case (50071) map </A>","files":["/var/www/straped/mufon/html2text/50071.html.txt","/var/www/straped/mufon/org/50071.html"],"Object Features":"Unknown","Source":"MUFON","Disposition":"Unresolved","Object Shape":"Circle, Sphere","divs":["sighting detailsmy wife and i were traveling south along the lakeshore (lake michigan) just out for a nice romantic ride by this lake. as we were approaching 75th street, i noticed an orange light in the sky to the south west. it is important to note that the light was stationary (appeared to be hovering like a helicopter)and was not blinking at all. i know that all air craft have red blinking lights for safety reasons, this did not, that and the orange color is what got my attention originally. i alerted my wife to the object and she actually stopped the car. i quickly exited the vehicle and noted that the object made no noise and had now began to move in a semi-circular trajectory. i grabbed my cell phone and flipped on my video recorder, unfortunately i was unable to get any footage do to my excitement i forgot to press record, that said after approximately 10 seconds i realized that my video recorder was useless anyway showing only a speck of light here and there, i was able to follow were it was going but that's about it. so i lowered the camera and notice the object had moved to a position directly west of where i was. so up to this point it had did the semi-circle and after that headed due north to end up directly west of my position. at this point the light then began to ascend (but not at a very drastic angle) in a north west to north-north west bearing. the speed was incredible within 3-5 seconds it was out of sight! during the sighting i was very excited, and awe struck. after the sighting i am left with questions. i would like mufon to look into our local airports radar (if possible) to see if they had anything \"unidentified\" that night. i mentioned my wife was very skeptical about ufo's but she could not deny that what we seen was not any conventional aircraft and therefore is\\was a ufo. i believe it is important to note that roughly 1 minute after the sighting a commercial aircraft flew overhead at a low altitude with 3-4 red blinking lights and several white lights under the wings. this is drastically different from what we had witnessed only moments before. if necessary i would undergo a polygraph examination to what i witnessed. antonio m. jacob"],"Latitude":"42.565694","Region":"Wisconsin","City":"Kenosha","trends":["There have been 15 other sightings in Kenosha","There were no other sightings in Kenosha on or around August 18th 2013"],"Longitude":"-87.812494","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"08/22/2013 10:26 UTC","Weather Factors":"Unknown","Summary":"My wife and I seen an orange light in the sky. My wife was a strong skeptic in UFO's, now her witnessing this event has wavered her skepticism.","Log Number":"US-08222013-0018","Country":"United States","Sighting Duration":"Undisclosed","Tags":"City"}