{"City":"New York","Tags":"City","Disposition":"Unresolved","divs":["sighting detailsi was driving home when i came to a stop sign, i notice someone taking a picture\\filming with his cellphone pointed towards the sky. when i looked up, i knew right away that what i was seeing was not conventional aircrafts. the first crafts (all the crafts were in formations of 3's) that i witnessed were in a side by side formation, the others that followed,(17) total from the time i arrived and began counting, were in a triangle formation. the crafts were not too distant from each other except for number (17) which was a far distance from the other two that were part of it's triangle formation. the lights emitting from the ufo's where not of standard aircrafts. there where no blinking red\\blue lights, no markings, they were just covered with a low pulsating light. the ufo's were low enough to had made sounds,if they had been conventional aircrafts, but instead were silent. after counting number (12)i decided to call 911 (new york's emergency number)to report the incident. as i descripted what i witnessed to the operator more crafts appeared. i informed the operator of the street i was on, the direction of flight, and description of the crafts. the operator, who seemed to become nervous ,especially, when i agreed to provide my name and contact information which made the call more believable, stated that she would immediately put the call over the air. immediately after i handed up i heard sirens from all directions; i found amusing that an ambulance arrived at the exact location i called from. i was just getting into my car when they arrived. they looked around saw people looking up to the sky and left the area. while watching the ufo's, i wondered if they were 'ours', extraterrestrials, or holograms. i lost sight of them as they past overhead seemed to ascend. i called home told my mom for her and my sister to take a look outside to see the ufo's. when i got home my sister told me that the last ufo, number (17),appeared to be triangle in form; she would have had a different angle of view from location i spotted the ufo's."],"Weather Factors":"Unknown","Longitude":"-73.94607","Latitude":"40.65746","Country":"United States","Source":"MUFON","Case Number":"50075","Summary":"Total of 17 UFO's in formation of 3's. The first that I observe where side by side the one's that followed where in triangle formation.","map":"<A HREF = \"http://maps.google.com/maps?q=40.65746,+-73.94607(50075)&iwloc=A&hl=en\"> mufon case (50075) map </A>","Object Shape":"Oval","files":["/var/www/straped/mufon/html2text/50075.html.txt","/var/www/straped/mufon/org/50075.html"],"Object Features":"None, Unknown","Log Number":"US-08232013-0003","Date of the Event":"08/23/2013 12:00 UTC","Date Submitted":"08/23/2013 04:29 UTC","Region":"New York","Object Flight Path":"Other","trends":["There have been 579 other sightings in New York","There were 3 other sightings in New York on or around August 23rd 2013"],"Sighting Duration":"00:10:00","Viewing Distance":"501 Feet - 1 Mile"}