{"Case Number":"50088","Log Number":"US-08232013-0016","Summary":"Thought to be weather balloons, then one exploded and another seperated into 5 disc-like objects?","map":"<A HREF = \"http://maps.google.com/maps?q=30.261419,+-93.282355(50088)&iwloc=A&hl=en\"> mufon case (50088) map </A>","Country":"United States","Sighting Duration":"Undisclosed","Region":"Louisiana","Latitude":"30.261419","divs":["Sighting DetailsBeen seeing odd things in the sky the last two evenings. Probably weather balloons, but still odd. Around 8:00 pm Wednesday (8-21-2013)evening saw a round glowing object way up there against the clear blue sky, almost directly over head. It looked like Venus, but much bigger and brighter. Venus could barely be seen at this time to the West, as the sun was still bright on the horizon. Checked the object with binoculars and could tell it was not a star or planet. Looked at it with a telescope, and it looked like a shiney almost transparent bubble with a line hanging off the bottom with a shiny object dangling wildly on the other end of the line. Tried to record it with a 40X zoom videocam, but could not pick up the small line and dangling object. Tried to set the camera up on a tripod in case the object vanished, but was too late. After 20 minutes of observation, the object vanished against a clear blue sky while perfectly visable. Thursday evening at 7:22pm saw an identical object as the night before. This time to the West. Kept it in view with a telescope. After a few minutes, the object appeared to explode like a 4th of July fireworks mortar with a very bright yellow display hanging in the bright blue daylight sky. Slowly, it appeared the debris was falling after it exploded. About two minutes later, another like object was observed to the South. Watched this second object for a few minutes with a telescope, then put my videocam on a tripod and started recording. About 10 minutes later, this second object also appeared to explode against the clear blue sky! I analized the video of the object, and it appears that the second object seperated into 5 seperate disc when it broke appart. It looked just like a stack of poker chips falling one by one! Like I said, this might be weather balloons, but how in the world can a balloon seperate into five flat disc-like objects?? I have video, but no way to attach the DVD video file."],"Date Submitted":"08/23/2013 04:11 UTC","Tags":"City","Weather Factors":"Unknown","Object Shape":"Disc, Sphere","files":["/var/www/straped/mufon/html2text/50088.html.txt","/var/www/straped/mufon/org/50088.html"],"Date of the Event":"08/22/2013 07:22 UTC","Viewing Distance":"Over 1 Mile, Unknown","City":"Westlake","Object Features":"Unknown","Disposition":"Unresolved","Source":"MUFON","trends":["There have been 12 other sightings in Westlake","There was one other sighting in Westlake on or around August 22nd 2013"],"Longitude":"-93.282355","Object Flight Path":"Stationary,Unknown"}