{"Object Features":"None, Dome","Weather Factors":"Unknown","Date Submitted":"08/23/2013 03:46 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=47.3939,+-122.314361(50087)&iwloc=A&hl=en\"> mufon case (50087) map </A>","files":["/var/www/straped/mufon/html2text/50087.html.txt","/var/www/straped/mufon/org/50087.html"],"Longitude":"-122.314361","Date of the Event":"07/07/2007 01:00 UTC","Viewing Distance":"Unknown","Summary":"observed first out front window. went outside, took a picture than camera would not take any more. while trying to get camera to work, suddenly saw a bright yellow object in next door neighbors' just above his roof line. almost hit house & trees.","Region":"Washington","Object Shape":"Circle, Disc, Sphere","trends":["There have been 2 other sightings in Des Moines","There were no other sightings in Des Moines on or around July 7th 2007"],"Tags":"City","Log Number":"US-08232013-0016","Case Number":"50087","City":"Des Moines","Source":"MUFON","divs":["Sighting DetailsI was watching tv, looked up to see \"my\" star as I call it than just above the star I see almost each night from s.w. to west in front of my home. But this night I saw a lg round object just up to the right of the star that was almost as big as an aspirin none glowing, more metallic looking kind of like a ring only something in the middle. I woke up my sister who was asleep by the window and said\"what is that?\" I went into my bedroom and got my camera, went outside on the front porch and took a picture, than tried to get my camera to zoom in but camera won't work. All of a sudden I looked up and say a bright yellow cigar shaped object comming across, through wires across the street that looked as it would hit the top of my neighbors house and also some tall trees, which are not there any longer, but cell tower still is. I was sure the object would hit one or all of those things so put my body in a crouching postion and closed my eyes. By than object was gone. I was scared, upset seeing this object while looking at it, afraid they would see me taking a picture and later afraid to report it. Afraid other people would think me a nutcase. But it has been 6 yrs. Now and I don't care. I think of the incounter a lot and just want to forget about it. It was so much bigger than my star but not as big as an aircraft. No aircraft has ever crossed from weat to southeast ever in the almost 20 yrs. I' ve lived here!"],"Latitude":"47.3939","Sighting Duration":"00:10:00","Disposition":"Unresolved","Object Flight Path":"Stationary,Hovering then path","Country":"United States"}