{"divs":["sighting detailsi was driving north on 71 highway near belton, missouri on my way back home from visiting family when i noticed vehicles driving off of the road. there was a small glowing spherical object that was a bright white\\yellow color coming towards me from north to south, and diving at vehicles. i heard no sound, but there was a trail of light behind the object. the size of it was a lot smaller than a car, but it was moving very quickly so i can't be certain as to the exact size. many cars and trucks ran off the road in an effort to avoid a collision with the object, some cars crashed, and some vehicles stopped to assist other cars, which drove off into the ditch. the object flew right over my car, as i headed north, but did not affect my vehicle. it seemed to be running more cars off the road that were headed southbound. i was too afraid to stop, and kept moving my car forward slowly to avoid colliding with other cars or trucks. there were at least two 18-wheelers involved and many cars, at least 15 vehicles or more were involved. i last saw the object as it moved into some brush to the west of the highway, but i don't know if it landed. if i hadn't of seen this with my own two eyes i would never have believed it. the story was on the news about the crashes, however, not one word about the object that caused the crashes was mentioned. i find it very odd that no one involved in the wrecks mentioned this glowing object diving at cars, and if they did it was kept out of the media. the whole thing scared me so much that i did not talk about it with anyone until recently, and at the request of a friend i am filing this report with mufon."],"Log Number":"US-08232013-0013","Summary":"Observed a UFO diving at 15 or more vehicles and causing them to wreck","trends":["There have been 8 other sightings in Belton","There were no other sightings in Belton on or around May 6th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.344994,+-94.852176(50085)&iwloc=A&hl=en\"> mufon case (50085) map </A>","files":["/var/www/straped/mufon/html2text/50085.html.txt","/var/www/straped/mufon/org/50085.html"],"Longitude":"-94.852176","Country":"United States","Case Number":"50085","Object Shape":"Sphere","Date of the Event":"05/06/2010 12:00 UTC","Date Submitted":"08/23/2013 02:52 UTC","Sighting Duration":"Undisclosed","Tags":"City","Weather Factors":"Unknown","Viewing Distance":"20 Feet or Less","Disposition":"Unresolved","Object Features":"Unknown","Object Flight Path":"Path with directional change","City":"Belton","Source":"MUFON","Latitude":"40.344994","Region":"Missouri"}