{"Viewing Distance":"Over One Mile","Tags":"City","Region":"Wisconsin","City":"Custer","Object Shape":"Unknown","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=44.510526,+-89.426227(50083)&iwloc=A&hl=en\"> mufon case (50083) map </A>","Sighting Duration":"00:05:00","Case Number":"50083","Date Submitted":"08/23/2013 01:11 UTC","Date of the Event":"08/04/2013 09:28 UTC","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/50083.html.txt","/var/www/straped/mufon/org/50083.html"],"Weather Factors":"Unknown","Log Number":"US-08232013-0011","Longitude":"-89.426227","Disposition":"Unresolved","Summary":"Dark object with two solid, white lights sighted SE of HWY 10 in Custeer, WI","trends":["There has been one other sighting in Custer","There were no other sightings in Custer on or around August 4th 2013"],"Source":"MUFON","Latitude":"44.510526","divs":["Sighting DetailsI came home to visit my family and friends for a long overdue vacation in Wisconsin. I live in Texas, but Wisconsin is my home. My cousin and her husband scheduled a golf outing at Glacier Wood Golf Course in Iola, WI. Iola is a small town about 18 miles due east of Stevens Point, WI. Our golf outing was rather long as we arrived shortly after 4PM CST and played 18 holes. Our group consisted of 6, with 4 of us actually golfing. We decided to have some drinks on the course and played at our own pace. By the time we reached the 16th hole it had become very dark so we scrambled the final 3 holes in the darkness. We were met by two attendents who were waiting for us to finish up. We finished our round shortly after 9PM. On our way back, we were travelling west on HWY 161 toward Stevens Point to end our evening and head back home to Wausau. About two miles before reaching the intersection of HWY 161 and HWY 10 (about 9 miles due East of Stevens Point) I noticed from the back seat of our car two large, non-pulsating, white lights in the SE sky while gazing at the stars. I consider myself to be an amateur astronomer so I love tracking celestial bodies. The lights were both on what I would call the NW-side of the object, or \"rear\". I call it the \"rear\" of the craft because it moving very slowly in SE vector that is perpendicular to the arrangement of the two lights. The two lights were essentially arranged in a line with one light in the NE corner and one in the SW corner of the object. I could not see a third light in the front of the object, but the space between the two lights and slightly in front of it (in the SE direction) was solid black. I know that it was a solid object because of the few stars it passed, it would leave a void of darkness until passing through. It completely blacked out these stars while it tracked slowly across the sky, heading SE. I immediately turned the attention of the craft to my girlfriend, sister, and brother-in-law, but they didn't really seem to care. I don't even know if anyone else looked at it. I got the best look at it as we stopped at the intersection of HWY 10 and HWY 161 and paused for our right-turn onto HWY 10. From this point on we continued to head west in the vehicle as the object continued to slowly head SE, away from us as a slow pace. After about 3 miles of travelling west on HWY 10, I lost sight of the object due to our heading and the distance put between my line of sight. During the entire time of my sighting, I made sure to remember the details so I could report it. This was my first UFO sighting. I have seen plenty of satellites, meteors, etc. tracking the skies, but never anything like this. I have heard the stories of the triangle shaped craft, and this is the most apparent thing I can think of that compares to it. The only difference being that the front of the craft didn't have a light that I could see on it. However, the back two corners did. I also know that this object was solid inbetween the lights and that solid space extended out toward the direction it was moving. It is impossible to determine the height of the object, however. I also made sure that I accurately estimated the zenith in the sky as well as the time and the apparent speed (speed is easy to track if you can see how far apart the lights are from one another). In this case, the lights remained attached by darkness (a void or the solid part of the object) that swallowed the starlight as it passed. As a result, I would say that the distance between the lights would shrink by half every 30 seconds or so. Keep in mind that this also includes us travelling ca. 70mph away from it. However, when we were stopped, I estimate that the distance between the two rear lights shrank by half every minute. This is only an estimate, however. During the entire experience I made sure to stay calm and remember as many details as possible, knowing that I had to report it. My only regret is waiting this long to actually do so, but the images are fresh in my mind. I am highly educated (I hold a Masters degree in geography), I watch the skies frequently, and I know a lot about aircraft. As a kid I wanted to be a piolot. I know about most aircraft out there as the Janes Aircraft Dictionary series is one of my favorites. Be assured - this was NOT an airplane. It was too large, too low (I estimate about 3000 feet above if the distance between the lights is 300 feet). Also, none of the lights were blinking and they were too big to be navigation lights. They also were not green or red. It was more like two large landing lights in both corners that never waned or moved. I cannot speculate on sound, but it was very smooth and was in no hurry to traverse the skies. There were other people on the road that night, including some that were travelling in the SE direction of the craft on HWY 10. Maybe somone else saw it too. I hope this description helps. I can make a map and even attempt to sketch what I saw if you like. Dan Berens"],"Country":"United States"}