{"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.878067,+-87.680481(50082)&iwloc=A&hl=en\"> mufon case (50082) map </A>","Source":"MUFON","Summary":"sitting on friends porch I noticed 3bright lights hovering in sky. I then notified 3 friends to look we watch descend then ascend,bright glow then weakend at times I observed objects for abouts 25-30 min. I then watch object move south.","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around August 4th 2004"],"City":"Chicago","Date Submitted":"08/23/2013 12:38 UTC","Disposition":"Unresolved","Tags":"City","divs":["Sighting DetailsIn May 2004 I lost my mom I had moved in with friends in the ABLA homes in the city of Chicago loop district. Around 9:45-10:30pm I was sitting on porch at 916 S. Ada I looked up into sky and noticed 3 bright glowing lights in a single file line, I first thought someone shooting flares or fire works because the area I was in is not to far from us celluar field and the lake front but noticed the lights were to close to be coming from either. After watching for about 5min alone I thought if they were flares they should have burned out then out of the blue the bottom light descended slowly then ascended rapidly back in place now at this time I thought ok chris you just lost your mom and still grieving maybe mind playing tricks. I then went into friends house got 3 people and ask them to look in the direction I was pointing they looked in amaze as the 3 objects then started descending slowly pulsating then ascend rapidly hovering in place. I called 911. After watching for about 10min friends went back in side to finish drinking I don't drink I stayed alone watching objects descend and ascend 1 by 1 glow bright then dim at times when objects started moving south they formed a triangle formation and moved away slowly I walked in the direction they moved lost sight of around 18th and blue island. I was afraid but more curious"],"Log Number":"US-08232013-0010","Object Flight Path":"Stationary,Hovering then path","files":["/var/www/straped/mufon/html2text/50082.html.txt","/var/www/straped/mufon/org/50082.html"],"Sighting Duration":"Undisclosed","Country":"United States","Longitude":"-87.680481","Date of the Event":"08/04/2004 09:45 UTC","Region":"Illinois","Case Number":"50082","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","Latitude":"41.878067","Object Shape":"Sphere"}