{"Case Number":"50090","City":"Colusa","Summary":"Noticed a bright light, turned on street to see better.","Source":"MUFON","trends":["There have been 3 other sightings in Colusa","There were no other sightings in Colusa on or around April 10th 1999"],"divs":["Sighting DetailsWe had just come from gambling at Colousa Casino driving back home to Sacramento. When nwe came into the town of Colousa when I noticed a bright light off to our right. I told the driver to turn down the street where the light was coming from. As soon as we turned, there was a saucer shaped object hovering in the sky about rooftop height. We sat and watched for an unknown amount of time. It was light out when we stopped but dark when we left. I wanted to get out of the car but could not say so. I tried to move to get out of the car but was also unable to move. I knew it was a UFO up close and personal. I didn't think about the sighting for many years and then I remembered it. I asked the driver if she remembered it and she said oh yeah. We were both certain that it was a UFO. We discussed it and remembered that we didn't realize at the time how long we stayed watching it. We knew that several hours must have passed due to the change of daylight when we finally left. The UFO was still there when we left. Neither of us remember anything but sitting there unable to move. I have had other sightings but those were at a distance and just lights that changed direction too fast and too imposswible for a plane."],"Region":"California","Viewing Distance":"20 Feet or Less","Country":"United States","Object Features":"Dome, Window(s)","Weather Factors":"Unknown","Latitude":"39.216354","Tags":"City","Date Submitted":"08/23/2013 04:35 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.216354,+-122.008218(50090)&iwloc=A&hl=en\"> mufon case (50090) map </A>","Date of the Event":"04/10/1999 04:15 UTC","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/50090.html.txt","/var/www/straped/mufon/org/50090.html"],"Object Flight Path":"Stationary","Longitude":"-122.008218","Sighting Duration":"Undisclosed","Log Number":"US-08232013-0018","Object Shape":"Disc"}