{"Object Features":"None","Region":"California","files":["/var/www/straped/mufon/html2text/50096.html.txt","/var/www/straped/mufon/org/50096.html"],"Object Shape":"Triangle","Longitude":"-117.905104","Country":"United States","Source":"MUFON","Date of the Event":"08/21/2013 12:00 UTC","Log Number":"US-08232013-0024","Tags":"City","Date Submitted":"08/23/2013 07:32 UTC","divs":["Sighting DetailsHi there. I've never had an occurrence of actually witnessing a UFO before. Usually I find a logical explanation for things flying around in the night sky however, this I could not explain. In the vicinity of imperial hwy and Kellogg Dr in the Anaheim Hills area of southern California I saw quite an interesting sight tonight. The craft was clearly a triangle shape and had 3 lights that looked immensely similar to a stealth fighter however, these lights were LED in appearance. The front of the craft had a red non-blinking light. The center of the craft had a surging light that evenly distributed itself to the 3 LED lights. The aircraft circled and hovered doing figure 8s and coasting the tree line for about 5-10mins. No sound. Height im not sure of but possibly the same of a plane at a low, safe flying elevation. My first guest was a drone but the surging light is what was the interesting part and the LED which I'm not aware of any craft having. I am wondering if u have any records or pictures for me to look at to see if u have any similar cases? Unfortunately I did not have my camera with me. I'm curious to know what I saw tonight. Kind regards, Andrew"],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","City":"Anaheim","Summary":"Looked like a stealth fighter or tr-3b","map":"<A HREF = \"http://maps.google.com/maps?q=33.837413,+-117.905104(50096)&iwloc=A&hl=en\"> mufon case (50096) map </A>","Latitude":"33.837413","Viewing Distance":"Unknown","trends":["There have been 55 other sightings in Anaheim","There were no other sightings in Anaheim on or around August 21st 2013"],"Object Flight Path":"Hovering then path,Path with directional change","Disposition":"Unresolved","Case Number":"50096"}