{"Region":"Provence-Alpes-Côte d'Azur","Object Flight Path":"Stationary,Hovering then path","Date Submitted":"08/23/2013 05:49 UTC","Sighting Duration":"00:15:00","Country":"France","Date of the Event":"06/13/2013 04:00 UTC","trends":["There has been one other sighting in Cap-d'Ail","There were no other sightings in Cap-d'Ail on or around June 13th 2013"],"City":"Cap-d'Ail","Log Number":"FR-08232013-0021","divs":["Sighting DetailsI'm living in south of France. I would like to report a UFOs sighting that i have captured using my cellphone (iphone5) camera. What amazed me after 3 shots that i took, is that I didn't notice the object at that time. It was a terrible weather that day of June 13, 2013. We are expecting a powerful thunderstorm that day so i took a photo of the clouds forming just above the yacht. Powerful lightning was experienced that day cutting electricity 4-5 times all over \"-5 villages. It was not a plane nor a helicopter, it was totally different. I tried to zoom the image and did some color changing just to figure out exactly the shape of the object using an enhancement application in the iphone and i keep on having a dark shade beneath the object itself like a source of heat or something. Some could argue that it's a clouds forming shapes which i thought it was but clouds cannot do a triangular shapes. i do have a photo of clouds making a circular shapes but triangular shapes with almost perfect straight line that is a bit \"impossible\". I am sharing this genuine photo just to hope that someone out there may enlighten us to what exactly this objects And also kindly take a look also at the far right side of the photo. There is another object that is floating above and that shape is very similar to a UfO sigted around the world... Many thanks"],"Latitude":"43.72208","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Shape":"Disc, Oval, Triangle","Disposition":"Unresolved","Longitude":"7.405839","Case Number":"50094","Summary":"Surprised, Amazed, Grateful on that day. Because now i can really accept that they do really exist.","Source":"MUFON","Tags":"City","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/50094.html.txt","/var/www/straped/mufon/org/50094.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.72208,+7.405839(50094)&iwloc=A&hl=en\"> mufon case (50094) map </A>","Weather Factors":"Unknown"}