{"Sighting Duration":"00:01:00","Tags":"City","trends":["There have been 19 other sightings in Elk Grove","There were no other sightings in Elk Grove on or around July 4th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.441865,+-121.377738(50092)&iwloc=A&hl=en\"> mufon case (50092) map </A>","Country":"United States","Log Number":"US-08232013-0020","Case Number":"50092","Source":"MUFON","Longitude":"-121.377738","files":["/var/www/straped/mufon/html2text/50092.html.txt","/var/www/straped/mufon/org/50092.html"],"Latitude":"38.441865","Date of the Event":"07/04/2013 10:45 UTC","divs":["Sighting DetailsPreface: there are plenty of commercial planes, private planes, military planes and helicopters and I have see enough to recognize this as none of the above. There were planes in the sky at this time. They always show flashing, colored lights at some point in their flight. I was intentionally sitting out back by the pool watching the sky, with the hope of seeing a UFO on the 4th of July.... again. I saw a similar one (not quite the same... 4 lights under one vehicle) 2 years ago, but did not look for one last 4th of July. This consisted of a bright light coming out of the south, directly at me, in the far distance. After a few seconds I could see that it wasn't one light, but two. When I could see the clear separation between the lights, I watched as the vehicle slowly turned 90 degrees to the east (as the two lights merged with the turn), proceeded a short distance, stopped for a few seconds (as to watch some fireworks below?), slowly backed back up onto the original flight path (as one light again became two), then continue almost directly over me at a fairly low altitude (lower than any passing commercial jet and somewhere close to single engine private plane low to medium altitude). It was flying faster than any plane, jet or prop, but not super fast. It continued to the northwest and disappeared toward the big dipper at a constant rate of speed. I estimate the total time I saw it from horizon to horizon was about a minute. No plane that we have would clear that distance in that time at that low altitude and not make a sound."],"Object Flight Path":"Stationary,Hovering then path,Path then hovering","Disposition":"Unresolved","Region":"California","Summary":"Pair of low lights came directly at me, made turn, stopped, reversed, resumed path.","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","Weather Factors":"Unknown","City":"Elk Grove","Object Shape":"Unknown","Date Submitted":"08/23/2013 05:38 UTC"}