{"files":["/var/www/straped/mufon/html2text/50104.html.txt","/var/www/straped/mufon/org/50104.html"],"Object Features":"Unknown","trends":["There has been one other sighting in Menasha","There were no other sightings in Menasha on or around August 23rd 2013"],"Latitude":"44.216154","Country":"United States","Region":"Wisconsin","Summary":"Son called, observed 5 swarming bright objects in sky overhead, 12miles west of Appleton on hwy 10. We went out side and could see them until they sped West and disappeared. Followed by other unusual sightings soon after. Interesting","Weather Factors":"Unknown","Case Number":"50104","Sighting Duration":"Undisclosed","Longitude":"-88.365912","Disposition":"Unresolved","Viewing Distance":"Over One Mile","City":"Menasha","Log Number":"US-08242013-0001","divs":["Sighting DetailsWe recieved a call at our home in Menasha from our son as he was driving home heading East on Hwy 10 from their camper in the Waupaca area. He asked us to go outside and see if we could see the swarm of bright lights in the sky West of us. We went outside and observed 5 distinct lights that were as bright as Venus is in the sky right now, but not nearly as large, just as bright. They were more of a pinpoint from the distance we were at from the objects and almost looked like you were looking at a very bright LED flashlight from a distance. They moved up and down and left to right with no apparent or distinguishable pattern of movement, the lights would flash on for about 2 seconds per flash, but did not flash in any regular pattern or time interval. While we observed them they seemed to be initially moving, Darting, West, then came back East toward our direction, then went West again until they just went out of sight. We observed vapor trails occasionally while they darted about. There was no sound initially, but about a minute after they disappeared we heard what sounded like thunder coming from the West. Our son had a better observation. As he was driving home from the Waupaca area heading East on Hwy 10 he spotted these bright objects in the sky. He stopped and pulled over to observe them along with his wife and 2 children. He called quite a few people that also observed the lights as we did. He said they were swarming around each other like nothing he'd seen before because they were so fast. He has observed fighter planes dog fight training when in the Army, but these object appeared much closer to one another and were moving much faster. He said there was no sound, which seemed odd to him because he would have expected to hear sound at his proximity to the objects. They then dispersed, flew West, then back to the East, then West again at great speed and disappeared. Following our observation of the bright lights, we observed 3 more objects moving from South to North. These appeared more satelite like, very much like the ISS as it passes by. Very bright, then fade out. First one was about 2 minutes following the dissappearance of the 5 bright objects. It came out a SSW direction heading North and was only lit a few seconds until it was about 40 degrees above SSW. The next one came from due South went directly over the zenith and disappeared at about 70 degrees above North. The third was Just about 30 degrees more to the East, appeared from overhead heading North and disappeared at about 45 degrees above North. Very odd. After that we observed fast moving aircraft. 2 came from the Southeast, one fron Northwest all moving fast. Two of them crossed paths very near the area we observed the 5 objects, the other from the Southeast went in a more Westerly direction. We have never seen anything like this chain of events before. Very odd."],"Object Flight Path":"Path with directional change","Date Submitted":"08/24/2013 12:53 UTC","Source":"MUFON","Date of the Event":"08/23/2013 09:09 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.216154,+-88.365912(50104)&iwloc=A&hl=en\"> mufon case (50104) map </A>","Tags":"City","Object Shape":"Star-like"}