{"Object Shape":"Triangle","trends":["There have been no other sightings in St. Pete Beach","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Tags":"City","Latitude":"27.726942","Object Flight Path":"Path with directional change","Case Number":"50108","files":["/var/www/straped/mufon/html2text/50108.html.txt","/var/www/straped/mufon/org/50108.html"],"Summary":"Triangle shape aerial path in zig zag pattern","Date Submitted":"08/24/2013 04:02 UTC","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=27.726942,+-82.733024(50108)&iwloc=A&hl=en\"> mufon case (50108) map </A>","Log Number":"US-08242013-0005","divs":["Sighting DetailsMy GF and I were laying in the hammock star gazing one night. There was no moon and no cloud cover and the humidity was low so the sky was crystal clear. Lots of stars. We both saw the object originate on the northern horizon as it moved in a southerly direction. The object was approximately 1000 feet off the ground, made absolutely no sound and moved in an irregular zig zag pattern. It was triangular in shape and at the edge of each angle there was a half orb. Three half orbs were visible which gave the appearance of a triangle shaped craft. The half orbs were the color of a very faint deep reddish orange. The object took less than 4 seconds to move across the entire sky from north to south. As it moved it would disappear and then reappear. However, when it reappeared it was in a different horizontal location in the sky. This is what gave the appearance of a zig zag pattern. Since it moved north to south the zig zag pattern was west to east. It appeared and disappeared 4 times in less than 4 seconds. The moment I saw the object I knew immediately I was witnessing a UFO. I served for many years in the Army and had ample exposure to friendly and enemy aircraft from all across the globe. I was trained in height and speed estimation of aircraft as it was important for us to be able to identify aircraft as friendly or enemy. Nothing I have ever witnessed moved in the manner of the object I witnessed that evening. The speed was unmeasurable. There was absolutely no sound and the fact that it seemed to teleport is what was most amazing. I didn't so much feel that it actually flew but more like it would teleport from point to point. My GF witnessed the object as well and as soon as it was out of sight she looked at me wide eyed and asked me what it was. I told her we just witnessed a legitimate UFO."],"Date of the Event":"03/13/2005 12:00 UTC","Longitude":"-82.733024","Disposition":"Unresolved","City":"St. Pete Beach","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Weather Factors":"Unknown","Source":"MUFON","Region":"Florida"}