{"divs":["Sighting Details8-18-2013 at 6:51 AM, I was taking pictures of the sunrise and the clouds of a thunderstorm which was traveling down the San Joaquin valley's east side along the foothills towards our area Clovis Ca earlier in the morning that was dissipating. When I downloaded the pictures to the computer I noticed I had caught 3 objects in the sky. My first thought was I had caught something that I couldn't explain but looked to me that I had captured 3 UFO'S but of what? Since it's a still picture you have to look at it to see what I am talking about. Then after looking at the second picture which I took like 5-10 seconds later, just to the right of the objects in the first photo, I noticed 4 faint black dots in the second picture. When I was taking the pictures I didn't see or hear any birds,jets, airplanes, helicopters, nothing. After I had seen the photo's I contacted and showed the picture to a Sanger California paranormal radio talk show host Jeffery Gonzales, showed him the pictures and he didn't know what they were? I was really excited that I might have captured real UFO'S but without the proper photo enhancing equipment I can't sit here honestly and say what they are. All I know is that I would like to know what I had captured in these 2 pictures and if they are explained to be something else then what I feel, that's fine with me. That's why I am contacting Mufon. If Mufon has there doubts then I assume I will hear from you. I feel that before you come to a conclusion you make sure what you say has to be supported and proved before saying anything. The camera I used is a Olympus fe-230 7.1 digital camera and I did not use the zoom when taking these shots. My daughter tried to enhance the first picture so there will be 2 pictures of the first shot I took. The second picture I only have the picture without enhancement. The second photo if you look above the 3rd tree on the right side of the picture, right above it you can faintly see 4 black dots? I assume then these objects were moving North to South from where I was standing. I have no idea what I caught but do I believe in UFO's? Yes I do and love to investigate all stories, photo's and video people show."],"Log Number":"US-08242013-0003","Date Submitted":"08/24/2013 03:13 UTC","Region":"California","Object Features":"None","Source":"MUFON","Object Shape":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/50106.html.txt","/var/www/straped/mufon/more/50106_submitter_file1__P8182292.JPG","/var/www/straped/mufon/more/50106_submitter_file2__108287046855361565241689869366n1.jpg","/var/www/straped/mufon/more/50106_submitter_file3__P8182293.JPG","/var/www/straped/mufon/org/50106.html"],"Disposition":"Unresolved","Viewing Distance":"Unknown","Object Flight Path":"Unknown","Sighting Duration":"00:00:00","map":"<A HREF = \"http://maps.google.com/maps?q=36.825542,+-119.68947(50106)&iwloc=A&hl=en\"> mufon case (50106) map </A>","City":"Clovis","Country":"United States","Latitude":"36.825542","Weather Factors":"Unknown","Summary":"Taking a picture of clouds in the morning as a thunderstorm had fizzled out.","Date of the Event":"08/18/2013 06:51 UTC","Case Number":"50106","Longitude":"-119.68947","trends":["There have been 20 other sightings in Clovis","There were no other sightings in Clovis on or around August 18th 2013","This sighting has never been favorited.",""]}