{"divs":["sighting detailsrefer to photos . while navigating around my daughters house\\neighborhood ( 7 miles from my own home)using google earth i noticed what appears to be a ufo over her house and took many freeze frames of it using my ipad . i left the photos alone for over a year until a friend saw them and suggested i share them. when i first saw it i immediately knew that it must more than likely be a ufo based on the shape & similar images that i've seen & heard about in the past & cannot explain it away by anything else such as another light source. i suppose that my proof would be this. the images were not taken by me. these are actual satellite images taken from google earth that i just happened to capture while doing some neighborhood research. i was able to freeze that frame by capturing it using an ipad feature. perhaps you can go back and find the same images i'm not sure.im not exactly sure about the date but took a guess based on my recollection but i'm sure if i research some more i may find it . ithe google image has probably changed since . i don't know much about google earth but i am pretty sure that their images are updated from time to time. i think i'll check it out more often from now on. let me know what your experts say. i have many more photos than i was able to submit because i uploaded individually rather than file. (not sure how and didn't want to risk losing all of this data.) they are of course available upon request. i'd appreciate it. thanks,"],"Date Submitted":"08/24/2013 06:44 UTC","Sighting Duration":"Undisclosed","Object Shape":"Disc, Saturn-like","Date of the Event":"06/01/2012 02:00 UTC","Country":"United States","Disposition":"Unresolved","Object Features":"Dome, Patterned Surface","Latitude":"32.951192","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=32.951192,+-117.200162(50119)&iwloc=A&hl=en\"> mufon case (50119) map </A>","Case Number":"50119","Longitude":"-117.200162","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around June 1st 2012"],"City":"San Diego","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/50119.html.txt","/var/www/straped/mufon/org/50119.html"],"Object Flight Path":"Stationary,Hovering then path","Tags":"City","Summary":"While navigating around my daughters house/neighborhood using google earth I noticed what appears to be the UFO over her house and took many freeze frames of it","Log Number":"US-08242013-0016","Region":"California","Source":"MUFON"}