{"Object Features":"Unknown","Longitude":"-73.547922","Summary":"thought it was a plane behind trees. did not move like all other planes I see in the area. Slowed down twice and changed direction before emerging above the tree. Kept moving up until it stopped, turn on its axis 90 degrees or so, on moved up again.","Latitude":"45.51327","City":"Montreal","Country":"Canada","Log Number":"CA-08242013-0010","Object Shape":"Bullet, Missile, Disc, Other","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Region":"Quebec","Case Number":"50113","divs":["Sighting DetailsI was just looking at the stars as I usually do when its clear. I live in Montreal near the airport, so I know the flight paths the planes use. One light which i thought was a plane didn't follow the usual plane movements. this plane behind trees. did not move like all other planes I see in the area. Slowed down twice and changed direction before emerging above the tree instead of the other side (the planes move on the horizon from west to east, this object went west to north.) Kept moving up until it stopped, turn on its axis 90 degrees or so, moved up again. Now almost 75 degrees above the horizon, it stopped again and \"turned on\" some side light. It looked bell shaped, but a bulky Bell, white shinny surface. These light, 3-4 of them on the \"sides\" and 2-3 on the top bubble of this object. light changed from white to blue, red yellow, slowly turning another 90 degrees towards the east. Then it slowly started to dip back down the tree line, still blinking and spining a bit faster now. It moved with an arc to the west below the trees and lost it. Never saw it again, I stayed out for another 2 hours. No emotions while I was observing the object. Just happiness on my end, I finally saw a UFO!"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=45.51327,+-73.547922(50113)&iwloc=A&hl=en\"> mufon case (50113) map </A>","Date of the Event":"08/23/2013 09:51 UTC","Weather Factors":"Unknown","trends":["There have been 47 other sightings in Montreal","There were no other sightings in Montreal on or around August 23rd 2013"],"files":["/var/www/straped/mufon/html2text/50113.html.txt","/var/www/straped/mufon/org/50113.html"],"Date Submitted":"08/24/2013 09:52 UTC","Source":"MUFON","Tags":"City","Disposition":"Unresolved","Viewing Distance":"21-100 Feet, 501 Feet - 1 Mile"}