{"map":"<A HREF = \"http://maps.google.com/maps?q=44.595499,+-64.63913(50114)&iwloc=A&hl=en\"> mufon case (50114) map </A>","Object Features":"Unknown","Source":"MUFON","Disposition":"Unresolved","Date of the Event":"08/20/2013 09:20 UTC","divs":["Sighting DetailsSaw something unusual near New Germany, Nova Scotia on the 20th of August, 2013. 3 of us were sitting and chatting outside in a garden on a clear, quiet night, shortly after dusk. The area is very rural, lots of empty wilderness. I looked up and saw a very visible light pass overhead and joked \"anybody believe in ufos? there's one\". It struck me as being a bit strange, due to its fiery colour and its full shape. We all watched it. The light was bright , warm like fire and round, although slightly pointed on the front and back like a short olive pit. Moving slow like a satellite, but lower, similar to the height of a 2 person plane. Suddenly the craft took off, straight up but a bit irregular and faded like a spark into the stars. I think we were in line with the trajectory that it bolted upwards in, so it bounced around slightly as it went up (would have likely looked like a straight line from the side)- reminds me of what sparks look like as they bounce around and dissappear if you look above a campfire (note we weren't having a fire). It wasn't until after it took off that we realized it was in fact some kind of ufo. My friend who is in his mid 40's said he was a skeptic until now. There is no denying what we saw was out of this world!"],"Sighting Duration":"Undisclosed","Latitude":"44.595499","files":["/var/www/straped/mufon/html2text/50114.html.txt","/var/www/straped/mufon/org/50114.html"],"Country":"Canada","Region":"Nova Scotia","City":"Lunenburg County","Object Flight Path":"Straight-line path","Tags":"City","Weather Factors":"Unknown","Log Number":"CA-08242013-0011","Case Number":"50114","trends":["There have been no other sightings in Lunenburg County","This sighting has never been favorited."],"Object Shape":"Sphere","Date Submitted":"08/24/2013 10:34 UTC","Summary":"light moved in one direction for a bit and then shot upwards towards the stars","Longitude":"-64.63913","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile"}