{"Object Shape":"Sphere","Object Flight Path":"Stationary,Path with directional change","Source":"MUFON","Object Features":"Unknown","Tags":"City","Case Number":"50115","Region":"Minnesota","City":"Virginia","Summary":"Several orange lights in sky, dozen white light craft stationary to moving.","Date Submitted":"08/24/2013 10:53 UTC","Weather Factors":"Unknown","Latitude":"47.52326","Longitude":"-92.536571","Log Number":"US-08242013-0012","files":["/var/www/straped/mufon/html2text/50115.html.txt","/var/www/straped/mufon/org/50115.html"],"Country":"United States","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Date of the Event":"08/23/2013 09:25 UTC","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=47.52326,+-92.536571(50115)&iwloc=A&hl=en\"> mufon case (50115) map </A>","trends":["There have been no other sightings in Virginia","This sighting has never been favorited."],"divs":["Sighting DetailsI was driving at work at approx. 2125 when I happened to notice several bright orange lights ( like street lights) in a line in the sky. I stopped the vehicle got out and looked at the sky to see what the lights were, that's when I noticed approximately 12 blinking lights amongst the stars. They were not blinking like stars or like aircraft, more of a almost random blinking. They were bright white light similar to a star. I instantly realized these objects were something very unusual, I look at the stars a lot and have never seen anything like what I saw. The objects were spread around the sky ( no formation). Within about a minute I noticed the objects were moving, some in line in pairs some by themselves. They seemed to be moving much faster than aircraft or satellites, the objects were all heading to the southeast, concentrating in one section of the sky in the south east until no longer visible. There were additional craft coming in from the north and north east also heading south east. Shortly after most of the craft were no longer visible I saw an airplane flying overhead. This whole event took no more than a couple minutes. I was completely shocked I had goosebumps, I have never seen anything like it in my life. I could instantly rule out meteors , satellites, planes all which I have seen plenty of times. These objects flew in a controlled way and flew in the same direction after being stationary."]}