{"map":"<A HREF = \"http://maps.google.com/maps?q=41.903299,+-84.079337(50127)&iwloc=A&hl=en\"> mufon case (50127) map </A>","Object Shape":"Fireball","City":"Adrian","Date of the Event":"08/24/2013 09:30 UTC","Object Features":"Unknown","Country":"United States","Summary":"fireball flying above emiting intermitant sparks from below object","trends":["There have been 6 other sightings in Adrian","There were no other sightings in Adrian on or around August 24th 2013"],"Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/50127.html.txt","/var/www/straped/mufon/org/50127.html"],"Longitude":"-84.079337","Source":"MUFON","Date Submitted":"08/24/2013 10:30 UTC","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Latitude":"41.903299","Case Number":"50127","Log Number":"US-08242013-0024","Region":"Michigan","Tags":"City","Sighting Duration":"00:04:00","divs":["sighting detailswe was walking down our park drive towards our apt bldg., i looked up towards the east and saw what i thought at 1st might have been a star, but it was not white, it was orange\\yellow. we stopped and i asked my friend \"is that moving\". we observed and it was indeed moving,slowly. we then noticed some kind of sparks (like small fireballs) being emitted from below the object. the object was decreasing and increasing in size. it followed at straight path towards the northwest. changing diameter and emitting the sparks. there was no noise heard.. when it was a little farther toward the n\\west it started to fade in and out, then it faded completely. after about 20 seconds it came back on glowing real bright (sunlike) for about 10 seconds then blinked out. my feelings were excited, after witnessing a similar object in the same area about 3 weeks prior. also when i was about 17, my family and i witnessed a hovering craft in the field next to our house, and we also had a loss of time. so this is interesting to me. i don't know what this was, but it was amazing to see."]}