{"Case Number":"50124","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Date of the Event":"08/24/2013 08:15 UTC","Latitude":"44.103537","files":["/var/www/straped/mufon/html2text/50124.html.txt","/var/www/straped/mufon/org/50124.html"],"Object Shape":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=44.103537,+-70.174578(50124)&iwloc=A&hl=en\"> mufon case (50124) map </A>","Tags":"City","Region":"Maine","Log Number":"US-08242013-0021","City":"Lewiston","Summary":"Three very bright lights observed. Equidistant from each other. No sound. Suddenly, two lights extinquished. One light remained stationary.","Date Submitted":"08/24/2013 08:57 UTC","Viewing Distance":"Over 1 Mile, Unknown","Object Features":"Unknown","Longitude":"-70.174578","trends":["There have been 4 other sightings in Lewiston","There were no other sightings in Lewiston on or around August 24th 2013"],"Source":"MUFON","divs":["Sighting DetailsSitting in my backyard at precisely 8:15 PM. I saw a light, brighter than a bright star, moving faster than an airplane would move, in the SSW sky. Then two more lights appeared, moving at the same speed as the first light. They were precisely (It appeared to me) in a straight line. There was no sound. I watched for about 1 minute. Then the first and third lights went out, leaving only the middle light to observe. It stopped moving in the path it was on suddenly, and stayed in place--again in the SSW sky. It dimmed and looked then like an ordinary star, but was slightly moving in a random, somewhat angled manner, little jerky movements. I watched it for about 5 minutes and decided to come in a write this report. No sound, too far away to see any shape. Going back out to see if it still there. I figured out quickly they were not aircraft (no sound, moving too fast), and then decided that they were not air balloons, (again too fast, none of the WHISH sound that balloons make when they fire up the burner to elevate them). They certainly weren't flares because they were not dropping to the ground. Many years ago, while living in Syracuse I once saw three UFO's in the sky, but they were not as bright as these were, and formed a much tighter formation than these did tonight. My general feeling was interest, curiosity. I quickly eliminated what it \"wasn't\", and then realized it might well be a UFO. Thanks, Gary Guimond Major,USAF Ret."],"Disposition":"Unresolved"}