{"Date Submitted":"08/24/2013 08:24 UTC","trends":["There have been no other sightings in Owendale","This sighting has never been favorited."],"divs":["Sighting DetailsI must mention I reported this sighting to a website called (Mystical Universe) It was posted in 2001 and I was contacted by someone representing themselves as Mufon investigator in that year. I was asked to tell my story somewhere down in Detroit. I had to decline because I was working at the time. I'm now retired and have pondered my experience over the years, so much, I've investigated other reported sightings taking place in the same month and year to compare to my sighting. I was looking on a website listing sightings taken place in Michigan, during March of 2000, finding to my surprise no listing by you or anyone else of my sighing. Why I'm submitting again. I think(Mystical Universe website) still carries a archive of sightings reported to them over the years, at least it did when I looked up my sighting a couple of years ago. So rather go in depth here again. I'll report the basics you ask for, leaving you to check out the other websites archives or contact me for any additional info. 1) Michigan, Huron county, heading south on Bayport Rd alias (Colwood Rd), working (driving) on the way home from a weekly delivery route. Approx. 3:00 to 4:00 PM. 2) The sun reflecting off it, as it flew over a small patch of woods embedded between to farm fields. 3) Maybe, large ice or nickel meteorite, run away weather balloon or a low flying ,man made, satellite. 4) Mostly sphere in shape, made up of varied (in sizes) octagon shaped, flat like faucets in a unevenly cut diamond, making up it's entire round shape, and the only things to be definitely identified, all reflecting in the sun light a nickel shiny color to the whole of the object. Best compared to as a unperfectly round soccer ball, with what maybe a tiny tail with a very little white exhaust, noticed has object passed in front of me.. It flew fast, like a low flying jet, flying above the trees as much as the trees were in height. Figure 200ft. No sound as it passed in front of me as in a straight line west to east, me heading north to south. I estimate the size 25ft to 50ft. 5) Thought a ice meteorite if there's such a thing or low flying satellite. Slowed and stopped the truck approx. a half a block away to observe as it passed in front of me and disappearing in seconds, blending into the farm fields, I thought it was going to crash, if not into Lake Huron, Canada for sure. Never heard a word of a impact. The sighting has made a skeptic into a believer, baffling me all these years later. 6) It's speed allowed only 2 seconds of view once it passed in front of me, however the object coming from the west allowed much more time to observe because of angle to approach, north to south for me and west to east for it. Can sketch the object if need be."],"Latitude":"43.729183","Date of the Event":"03/08/2000 04:00 UTC","City":"Owendale","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=43.729183,+-83.268008(50123)&iwloc=A&hl=en\"> mufon case (50123) map </A>","Source":"MUFON","Tags":"City","Region":"Michigan","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Sphere","Log Number":"US-08242013-0020","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Longitude":"-83.268008","Object Features":"Patterned Surface","Sighting Duration":"Undisclosed","Case Number":"50123","Summary":"Roundish object seen close on return trip of delivery truck driver, during daylight hours.","files":["/var/www/straped/mufon/html2text/50123.html.txt","/var/www/straped/mufon/org/50123.html"]}