{"Longitude":"-99.141115","Object Features":"None","Log Number":"MX-08242013-0019","Date of the Event":"08/02/2013 08:50 UTC","Latitude":"23.736916","map":"<A HREF = \"http://maps.google.com/maps?q=23.736916,+-99.141115(50122)&iwloc=A&hl=en\"> mufon case (50122) map </A>","files":["/var/www/straped/mufon/html2text/50122.html.txt","/var/www/straped/mufon/org/50122.html"],"Summary":"Several orbs, extreme speed, stop instantly, move into mountain canyon. 40 - 50 orbs, 6 hours, 8 leave to NE","Source":"MUFON","City":"Ciudad Victoria","Date Submitted":"08/24/2013 07:48 UTC","Case Number":"50122","Object Flight Path":"Straight-line path,Path then hovering","divs":["Sighting DetailsUFO incident Sierra del Cautivo section Sierra Madre Oriental at the point of the border of the States of Tamsulipas and Nuevo Leon, approximately 30 miles north-northwest of Ciudad Victoria, Tamaulipas, Mexico The hours between 20:50, 2 August 2013 and 03:00 3 August 2013: At that time it is usually possible to find me on the west-facing corridor of our little adobe home in a rural area about 25 miles northwest of Ciudad Victoria, Tamaulipas. The west-facing view gives a good point of observation of the complex of the Sierra del Cautivo, which is a cordillera of the general ranges of the Sierra Madre Oriental. The elevations change sharply from our place....at about 1,000 feet....to parallel ridges of increasingly high mountains that rise to over 5,000 feet within 5 miles of our little place and then on up to nearly 13,000 feet within 30 miles as one moves further to the west. These mountains are essentially impenetrable, very rugged. Go to our Quinta Tesoro de la Sierra Madre website and use our Google Earth feature to check out the area to the west. This area has continuing mentions of UFO activity, as do many places in Mexico. It is not at all uncommon for the rural people to immediately extol tales of sightings, in the most matter-of-fact tones, once the subject is brought up. I have seen peculiar, very high elevation (satellite level) activity on various occasions during the fifty years or so of my being present in the zone, generally known as the Santa Engracia area, named for the original Spanish colonial hacienda whose original structure is still a useable facility, in the form of a very nice guest lodge. Guests at that lodge, as well as our little place, have commented to us about their sightings, almost always the extremely high \"night-orbs\" that change directions suddenly and that travel radically much faster than either the common night-time satellites or jetliners. A distinct minority of reports by any respondent pertain to lower elevation manifestation, but the tales, reports, and serious mention by reasonable people are not that uncommon. So, in a way, I was prepared for, and unprepared for the occurrences of that episode that straddled the hours that accompany the change from the 2nd to the 3rd of August, 2013. Just before heavy rains that would fall three and four days later, my view through the gardens and foliage of our grounds was excellent to the west and the first three or four ridges of the Sierra del Cautivo. It began suddenly during the last remaining light from the previous day. The lingering Summer sunset behind those mountains allowed for a bit of discernment of detail of the topography, especially it being the case that it is something that has long been programmed into this observer's brain's \"hard-drive\". Towards the base of the mountains to the direct, due west, an orb of pale yellowish light, flashed in right to left....arriving from general direction of the famous site of the El Chorrito religious sanctuary...about 40 miles straight line distance to the north. My first notion was that I must have seen a lightning bug and dirty glasses or humidity or something played a trick on my perception. A cleaning with the tail of my T-shirt, a further check for any particularly chubby or high-speed lightning bugs revealed neither impediment to normal perception. Then, as I rose up from my rocking chair, a number of the orbs came in on the same route in fairly quick succession. All of them went to the openning in the otherwise solid wall of the Sierra del Cautivo...an openning caused by the Canyon of El Tigre, and the site of the famous springs by the same name. The Canyon itself stretches back a couple of score, very tortuous kilometres, much of which is presenced by springs that normally flow continuously. The mountains here are also famous for semi-precious stones, gold, copper, some silver, and lead production, dating back to the Colonial Period ending around the beginning of the Revolution of 1910. There are also massive stands of pine and tropical oak that have gradually and steadily recovered during the past couple of generations. In any regard, these orbs....all identical in my determination...continued to move rapidly to that point that marks where the Canyon of El Tigre opens the Sierra del Cautivo. The orbs would stop incredibly quickly...essentially instantaneously. There seemed to be...perhaps....a bit of vacillation, and then the orbs would disappear into the Canyon. A few orbs continued down five miles further to the south and do their hovering at the Canyon of the San Pedros....another spring-fed rivulet and canyon complex. I went and stood on the iron cover of our pozo de barbacoa, which affords an even better view to the west. We then went to the neighbour's gate...(very nearby...40 yards) where one could take in nearly the full length of the scene. During all this time, orbs would come in on their mad dash to the canyon opennings, intermittently. While the vast majority came in from the due north, there were a few that seemed to come in from the east-northeast, as though from the Gulf of Mexico. Foolishly, I did not immediately start a count, and it was known that any attempt at taking pictures would be pointless. During this time, I made a generous peanut butter and jelly sandwich and poured myself a large glass of milk, then returned to our corridor to consume it all. My dog and the three cats had even begun to pick up on the rapid travellers and they joined me, gazing out to the west. The intermittent, but sustained arrival of orbs continued. At an early morning hour I did call my wife in Texas to tell her what was being witnessed. The few orbs that came from the east-northeast came closer to passing more or less \"overhead\", and they seemed to be about 2000 feet above ground level. There was no sound associated with the flights, and the luminousness of the orbs did not seem to pass their light beyond the orbs themselves. While at the earliest points of the observation, it was my thought that they were more numerous, but after counting the minutes and seconds between later appearances, my best estimate is that there were perhaps as many as 45 to 50 different orbs. After eight seemed to come out of the Sierra del Cautivo and went back on a northeast trajectory....at extreme speed...incomprehensible....things went \"dead\" after 03:00 on the morning of the 3rd of August. It was a sleepless night, but there was no tiredness or sleepiness. We normally awaken around 03:30 anyway to prepare coffee and feed the animals. Then I will listen to a particular radio program from Houston (KILT - 610 AM) that deals with hunting and fishing issues. I went out on several occasions, but saw no more orbs nor any other inexplicable manifestations. I swear upon my Faith that the above account is a fair and accurate representation of the events of the times and dates and locations cited Thanks for your time and interest. Any questions or comments will be received and responded to with interest and sincerity."],"Country":"Mexico","Weather Factors":"Unknown","Object Shape":"Egg, Oval","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Ciudad Victoria","This sighting has never been favorited."],"Tags":"City","Disposition":"Unresolved","Region":"Tamaulipas"}