{"Case Number":"50125","Country":"United States","Tags":"City","Object Features":"Unknown","trends":["There has been one other sighting in Rye","There were no other sightings in Rye on or around August 24th 2013"],"Object Flight Path":"Straight-line path","Summary":"Metallic disc object sighted over ocean while sitting on beach. Saw it for about 20 seconds, then it disappeared.","map":"<A HREF = \"http://maps.google.com/maps?q=43.009843,+-70.742616(50125)&iwloc=A&hl=en\"> mufon case (50125) map </A>","City":"Rye","Date of the Event":"08/24/2013 03:30 UTC","Longitude":"-70.742616","Viewing Distance":"Unknown","Log Number":"US-08242013-0022","Sighting Duration":"00:00:20","Disposition":"Unresolved","Object Shape":"Disc","Date Submitted":"08/24/2013 09:08 UTC","Latitude":"43.009843","Source":"MUFON","divs":["Sighting DetailsWe were sitting on the beach at Wallis Sands State Park in Rye NH, around 3:30 PM, facing the ocean. The 4 of us all sighted a metallic looking silver object in the sky, toward the southeast over the ocean. The weather was clear (cloudless), sunny (sun toward the southwest), no clouds or haze to obscure the sighting. At first it was quite bright, as if the sun was glinting off a shiny silver metallic surface, and it appeared to be either disc or cigar shaped. It appeared to be moving slowly from south to north, like a distant airplane. At first we thought it was a plane, but it looked unusual to us, and one of us even mentioned \"maybe it's a UFO!\" At that point the object had darkened, as if it was no longer reflecting the sun toward us. I turned around to grab my camera to try and get a picture of it, and when I turned back, it was gone. It disappeared completely, and mundane objects like airplanes and birds don't just vanish. I searched the sky to see if there was a plane but there wasn't. My friends who kept watching it while I got the camera said it just disappeared suddenly without a trace. It was visible for about 20-30 seconds as we were talking about it since it was so bright at first. The object was in a clear blue sky, some distance away and fairly high up, like an airplane would be, and I would have to guess it was about the size of a small plane, though we had no frame of reference; it could have been a larger object farther away or a smaller one closer up. No sound was heard from the object, and we didn't notice any unusual movements other than its sudden disappearance. I would have just shrugged it off as an airplane if a friend didn't mention \"UFO\" and then it disappeared."],"files":["/var/www/straped/mufon/html2text/50125.html.txt","/var/www/straped/mufon/org/50125.html"],"Weather Factors":"Unknown","Region":"New Hampshire"}