{"Summary":"light emanating from hoving craft, then extremely rapid vanishing to outer space distance","map":"<A HREF = \"http://maps.google.com/maps?q=43.781366,+-89.572623(5013)&iwloc=A&hl=en\"> mufon case (5013) map </A>","Log Number":"US-07032006-0004","files":["/var/www/straped/mufon/html2text/5013.html.txt","/var/www/straped/mufon/org/5013.html"],"trends":["There has been one other sighting in Oxford","There were no other sightings in Oxford on or around February 29th 1972"],"Weather Factors":"Unknown","City":"Oxford","Longitude":"-89.572623","Country":"United States","Case Number":"5013","Tags":"City","Date Submitted":"02/29/1972 08:55 UTC","divs":["Sighting DetailsI was a prisoner at the U.S. Correctional Institution in Oxford, Wisconsin. I was returning from the gym, approximately 8:55 P.M. - 9:00 P.M. A group of prisoners were standing in the sidewalk looking up into the night sky. I joined the prisoners. I saw a UFO. I started chanting \"Take me, take me, etc.\" As there was a strictly enforced \"5 minutes maximum\" time to complete a movement between buildings, all the prisoners moved on after the UFO vanished in an unbelievably fast and quiet ascent into the night sky. The UFO was directly overhead and it hovered, then moved erratically (though obviously by intelligent manipulation) up, down, sideways, etc. The following evening's television \"News Report\" advised viewers that those people who had telephoned and reported sighting an unidentified flying object had \"actually seen a weather baloon over South Dakota\". As I doubt that myself or anyone else could see across half the State of Wisconsin and across all the State of Minnesota to somewhere in South Dakota, I felt that the television news station was insulting my intelligence."],"Object Features":"Unknown","Disposition":"Insufficient Data","Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","Source":"MUFON","Latitude":"43.781366","Viewing Distance":"501 Feet - 1 Mile","Region":"Wisconsin","Object Shape":"Unknown","Date of the Event":"02/29/1972 08:55 UTC"}