{"Object Shape":"Circle","Summary":"Red pulsating orb, appeared to launch. Faded with rise, with increased speed","Object Flight Path":"Path with directional change","Longitude":"-82.733185","Date Submitted":"08/25/2013 02:13 UTC","Sighting Duration":"Undisclosed","Tags":"City","Date of the Event":"08/24/2013 11:48 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/50143.html.txt","/var/www/straped/mufon/org/50143.html"],"Source":"MUFON","divs":["Sighting DetailsWhile at a campfire just north of Willard OH, on North Main St about 1200' south of Townline Road 12 , a bright red pulsating was noted by one of us rising from the horizon to the E-SE. Six adults were present and witnessed the event, which was initially not used because of the bright red-to-orange pulsating light. . As the object rose, it appeared to be rising to the west, pulsating from red to orange in color. While rising, it appeared to be unsteady, but continuous in speed. Once the object reached approx 25 degrees above the horizon, it began to slowly fade away as if moving away from us. The pulsating continued until it was no longer visible, approx 90 degrees. As it rose, the direction of travel appeared to shift to the north west. Approximately 2 minutes later, another object did almost exactly the same thing as the first. Same colors pulsating, same direction of travel, same origin on the horizon. Approx 2 minutes after the second orb, the third appeared. This one seemed to originate a little bit fillet her to the south, but was the same appearance as the first two. This object passed in front of the moon, remaining very visible, which eliminated us thinking these were reflections of some kind. The intensity and direction of travel were the same as the previous two. I was able to focus in on this one better by blocking out ambient lighting with my hand, and was able to follow it across the sky for about 130+ degrees. As the object passed over head, though barely visible,, the speed suddenly increased to an extremely high rate toward the north west. Another person also witnessed the same. The sky was clear with stars visible. All of us agreed that we just witnessed an event that was not normal, and was something that none of us has ever seen happen before. A friend located in Mansfield OH stated to me that she saw something similar north of Mansfield, approx 25 minutes later. It was first thought it was a low flying plane of some type, but the object actions disproved that pretty quickly. No flashing lights were seen, only the described pulsating."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.06367,+-82.733185(50143)&iwloc=A&hl=en\"> mufon case (50143) map </A>","City":"Willard","Object Features":"None","Log Number":"US-08252013-0008","Disposition":"Unresolved","Case Number":"50143","Viewing Distance":"Unknown","trends":["There has been one other sighting in Willard","There were no other sightings in Willard on or around August 24th 2013"],"Country":"United States","Latitude":"41.06367","Region":"Ohio"}