{"Date Submitted":"07/03/2006 04:06 UTC","Log Number":"US-07032006-0005","Viewing Distance":"Unknown","Country":"United States","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=34.398586,+-118.559939(5014)&iwloc=A&hl=en\"> mufon case (5014) map </A>","Object Flight Path":"Stationary,Hovering then path","Summary":"i almost cried ,triangle like shape light green light nothing corny like in the movies","Weather Factors":"Unknown","divs":["Sighting Detailsi was walking home from wall mart near a dirt road. it was like there was nothing ther at first then right above me just at eye level i saw the lights and then the craft itself .i wish i could give you a better description of the craft but for some reason i cant remember. i was completely speechless i almost cried becuase i was scared but at the same time i got to wittness what others have seen and i have dissmissed and, and it was so big.like i said ther was nothing there then the light green lights then the craft itself . it just kinda stood there then disapered then reapered, and then a blure like when something moves realy fast on video camera.but right after i saw it maybe i minute later i saw a black helicopter fly over head wich was also very silent but not completely silent. this is no joke, its not my mind playing tricks on me and im not some freak looking for attention, if i had a camera this would be some of the coolest and best evidence on tape.this was real.This is the wierdest part, a day latter a man in all black with a black hat came and threatend me saying that realesing this information would only would result in death or abduction but when he said abduction i dont think he meant aliens. he was somewhat pale he kinda had chinese eyes and strange cheek bones thats all i can remember about his face if you guys know anything about what im telling you please email me. thank you"],"Date of the Event":"07/03/2006 04:06 UTC","trends":["There have been 33 other sightings in Santa Clarita","There were no other sightings in Santa Clarita on or around July 3rd 2006"],"Disposition":"Insufficient Data","Latitude":"34.398586","files":["/var/www/straped/mufon/html2text/5014.html.txt","/var/www/straped/mufon/org/5014.html"],"Tags":"City","Longitude":"-118.559939","City":"Santa Clarita","Case Number":"5014","Object Features":"Patterned Surface","Object Shape":"Triangle","Source":"MUFON","Sighting Duration":"Undisclosed"}