{"divs":["Sighting DetailsI had just got off work and was on the way home from a Mariners game with my two friends. After we drop my friend off we take a turn down 240th and start going west down this hill towards the water and I notice 4 red pulsing lights. Three are collected one above the other moving south slowly and at different speeds. One red light is by its self farther to the left. At the bottom of the hill we take a left on 16th and I notice that the red lights are starting to disperse. I begin thinking that by the time I get home I may not be able to see these lights because they're moving so quickly. Before I know it two lights are tree level to the north and the lonely light is still to the west. We take a right and continue down the street for a while. When I look up to find the lights over our evergreen trees I see one flying above me (70 degree angle maybe). It was pretty shocking because I didn't think these lights were close enough to go from what seemed over the Sound to above me head in seconds. We took a left and went down Marine View Drive and I saw one more red light behind us in the northern sky. The light wasn't as bright which made me think it was getting father. It's annoying because my camera wouldn't pick up the light but it was such a exhilarating moment. I've always wanted to say (I think) I've seen UFO's. It was so cool and interesting."],"Date Submitted":"08/25/2013 03:26 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=47.386723,+-122.313186(50144)&iwloc=A&hl=en\"> mufon case (50144) map </A>","Case Number":"50144","trends":["There have been 2 other sightings in Des Moines","There was one other sighting in Des Moines on or around August 24th 2013"],"Object Flight Path":"Stationary,Straight-line path,Path with directional change","Date of the Event":"08/24/2013 11:45 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Weather Factors":"Unknown","Log Number":"US-08252013-0009","Latitude":"47.386723","files":["/var/www/straped/mufon/html2text/50144.html.txt","/var/www/straped/mufon/org/50144.html"],"Object Shape":"Sphere, Star-like","Longitude":"-122.313186","Object Features":"Unknown","Region":"Washington","Country":"United States","Tags":"City","City":"Des Moines","Disposition":"Unresolved","Summary":"Red Lights over the Puget Sound"}