{"Object Flight Path":"Stationary,Hovering then path,Path with directional change","Region":"Washington","files":["/var/www/straped/mufon/html2text/50150.html.txt","/var/www/straped/mufon/org/50150.html"],"Disposition":"Unresolved","Object Shape":"Circle, Disc, Sphere, Triangle","Object Features":"Other","Sighting Duration":"Undisclosed","Log Number":"US-08252013-0015","divs":["Sighting DetailsWe were coming home late last night around 11.pm - husband saw a glow in the sky - it looked odd to him. Since we were travelling in a vehicle - he immediately pulled off to the side of the road. We both looked up through the front windscreen and saw an object - orange - pinky glowing orb - disc shape hovering motionless - then it started to move towards the north - quickly - we both got out of the vehicle and observed the object - we could see a black like outline around the glow which looked like the center - as it suddenly move upward really quickly it appeared to change its shape from disc orb round to what appeared to be a triangle. At that point the black outline became more defined. We saw it under the cloud ceiling and as it came overhead it went straight up and the shape seemed to appear more defined. It had gone from a stationary object to a moving object then it went straight up and disappeared. We didn't feel anything other than trying to understand what it was we had seen."],"City":"Blaine","Case Number":"50150","Country":"United States","Weather Factors":"Unknown","Tags":"City","Date of the Event":"08/24/2013 11:08 UTC","Date Submitted":"08/25/2013 11:32 UTC","Latitude":"49.002233","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 7 other sightings in Blaine","There were no other sightings in Blaine on or around August 24th 2013"],"Longitude":"-122.742099","map":"<A HREF = \"http://maps.google.com/maps?q=49.002233,+-122.742099(50150)&iwloc=A&hl=en\"> mufon case (50150) map </A>","Summary":"Massive large glowing pinky orange bright orb type - with a black solid outline against the clouds was stationary hovering then followed a path and went straight up into the sky"}