{"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Country":"Canada","trends":["There has been one other sighting in Markham","There were no other sightings in Markham on or around August 25th 2013"],"Summary":"At first looked like a star, but the little colourful lights shooting and circling around the moving light told me otherwise.","Date Submitted":"08/25/2013 04:43 UTC","Weather Factors":"Unknown","Date of the Event":"08/25/2013 03:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.882452,+-79.29105(50159)&iwloc=A&hl=en\"> mufon case (50159) map </A>","Object Features":"Unknown","Disposition":"Unresolved","Tags":"City","files":["/var/www/straped/mufon/html2text/50159.html.txt","/var/www/straped/mufon/org/50159.html"],"Latitude":"43.882452","Region":"Ontario","Source":"MUFON","Case Number":"50159","Object Shape":"Circle, Star-like","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI went to look out the window of my house near Toronto. I was just about to go to bed; it was really late, about 3 or so in the morning. I don't often look at stars at night (don't get a good view here and I prefer sunsets) but I like to look up at them sometimes, and make a wish. At first I only saw a couple starts, and I put on my glasses to see if they were really stars or not, and found a lot more. One of the stars, though, as I looked closer, had little red, green, and such lights surrounding this one star, circling and shooting around this one star as it moved very slowly from east to west. The lights didn't just slowly circle this star, they were rapidly shooting in various circles, back and forth, fading and brightening again, in every direction yet staying close to this star. I started to think this wasn't a star, maybe a comet or such, and being the superstitious person, I made a wish on it. But then I thought maybe it wasn't a comet. Maybe it was still stars, just moving rapidly in such galaxy far away. I started to think maybe I was just tired, and my eyes were seeing things, but I tested looking at other stars to see if they had strange lights circling them too, but they didn't. I even tested looking at the strange group of lights with one eye, then the other, and the lights were still moving around that one star-like moving light. I kept staring for a while longer, but I had to go to bed. I decided I would google \"several different-coloured starlights surrounding circling & shooting around 1 moving starlight\" in the morning, so I wrote it on my hand and went to sleep. I woke up with pen marks on my face (of course) and went to show my mom. She asked what I wrote on my hand and when I started telling her about looking at the stars my sister made a joke about me seeing a ufo with aliens and they're coming for us. I then said I actually saw all these lights circling around this star and my mom was the one that said maybe my sister is right, and that I should search up ufo sightings. My little sighting seems so small compared to a lot of the sightings I've read about but I thought maybe as small as it is I could still get some answers."],"Longitude":"-79.29105","Viewing Distance":"Over 1 Mile, Unknown, N/A","Log Number":"CA-08252013-0024","City":"Markham"}