{"Object Features":"Unknown","trends":["There have been 126 other sightings in Indianapolis","There were no other sightings in Indianapolis on or around August 24th 2013"],"Log Number":"US-08252013-0030","Case Number":"50167","Disposition":"Unresolved","Source":"MUFON","Object Flight Path":"Other","Tags":"City","Object Shape":"Star-like","Weather Factors":"Unknown","Date Submitted":"08/25/2013 09:08 UTC","Latitude":"39.775103","Longitude":"-86.150418","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","City":"Indianapolis","map":"<A HREF = \"http://maps.google.com/maps?q=39.775103,+-86.150418(50167)&iwloc=A&hl=en\"> mufon case (50167) map </A>","files":["/var/www/straped/mufon/html2text/50167.html.txt","/var/www/straped/mufon/org/50167.html"],"divs":["Sighting DetailsMy family was at a cub scout family night here in Indianapolis watching a projected movie outside. There were several dozen families and approximately 100 total people, although I couldn't say just how many people observed it. We frequently see very strange crafts and lights in our area, but this is the first that I have reported. We were laying on a blanket on the ground, looking at the stars which is a regular activity, especially for my wife and I. There was one star-like object, very much brighter than anything else in the sky which appeared to come closer for a period of time before changing directions and moving farther away. It continued on a relatively straight heading becoming a little smaller in size, then appeared to stop, then start again. Then suddenly moved faster, and just vanished. One minute it was there, then just gone. We were all in amazement at what we were seeing, the whole family witnessing one of these at the same time was a first. As I said, we have seen dozens of objects, unexplained lights, strange moving lights, and such things over the years we have lived in this area. This was a unique sighting, unlike any of the previous ones, and the fact that the object simply vanished was amazing.There were several other strange lights in the area during the night, after this one, none quite as wonderful. I will continue to watch the skies, each opportunity I get. I have known my whole life that we are not the only beings in the vastness of space, and I hope sometime in my lifetime it will be undeniable and proven."],"Summary":"Brilliant, star-like object. Very bright, moving slowly then slowly smaller till disappearing","Region":"Indiana","Date of the Event":"08/24/2013 09:30 UTC","Country":"United States"}