{"Date of the Event":"08/25/2013 09:20 UTC","Object Features":"Unknown","Tags":"City","Region":"Alberta","Viewing Distance":"Over One Mile","Case Number":"50160","Longitude":"-113.489247","trends":["There have been 70 other sightings in Edmonton","There were no other sightings in Edmonton on or around August 25th 2013"],"Disposition":"Unresolved","Summary":"Out walking and saw a dark diamond shaped object far away, below cloud cover accelerating and rising. Glare from the sun made it difficult to see.","Log Number":"CA-08252013-0025","Latitude":"53.551029","City":"Edmonton","Source":"MUFON","divs":["Sighting DetailsI was taking the dog for a morning walk as I often do. We were on our way back home, about one block from my house. The sky was cloudy and overcast to the south and southeast, with the sun being behind the clouds. I am always observing my surroundings (including the sky) and just happened to catch sight if this object. Upon spotting it, I thought right away it was a UFO as it was not operating in the normal fashion of a plane or helicopter, nor did it resemble either of those. When I first saw it, it was hovering motionless in one spot in the sky. Then it slowly started to ascend in a straight pattern and go towards the southeast further from my location. It did not have any obvious lights and there was no sound. The flight was very smooth, no directional changes at all. It was difficult to make out any colour due to the sun being behind it among the clouds and causing it to look dark. There was no reflection from the sun. I felt surprised and excited. I stood there for a few minutes observing it and noticed another person doing the same - we did not speak. My dog did not have any reaction to it or behave unusually. I hurried home and told my wife to hurry outside of the house and we looked to the southeast but the object had already left at that time and she did not get to see it. I absolutely believe it was not a weather balloon or a kite as it travelled against the wind in a straight pattern."],"Date Submitted":"08/25/2013 04:47 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=53.551029,+-113.489247(50160)&iwloc=A&hl=en\"> mufon case (50160) map </A>","Country":"Canada","files":["/var/www/straped/mufon/html2text/50160.html.txt","/var/www/straped/mufon/org/50160.html"],"Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Object Shape":"Diamond, Other","Weather Factors":"Unknown"}