{"Region":"Texas","Weather Factors":"Unknown","Date of the Event":"08/25/2013 12:00 UTC","Disposition":"Unresolved","Country":"United States","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=29.637851,+-95.542945(50171)&iwloc=A&hl=en\"> mufon case (50171) map </A>","Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile","Latitude":"29.637851","City":"Stafford","Log Number":"US-08252013-0033","files":["/var/www/straped/mufon/html2text/50171.html.txt","/var/www/straped/mufon/org/50171.html"],"Case Number":"50171","Sighting Duration":"Undisclosed","divs":["Sighting DetailsWas sitting on my porch which faces east. Was looking at the rain clouds coming in. I noticed a group of white objects moving from east to west. At first I wondered if it might be a group of white birds avoiding the storm but they traveled behind a low storm cloud and I could see them glowing through the cloud. There were about 15-20 white glowing orbs traveling together and holding altitude. I tried to get my camera out to video the objects but before I could they had traveled to far west and I could no longer see them because our building was now blocking my view. So I ran inside and straight through my apt. while yelling at my son Ethan to follow. As we approached a good observation area on the south side of the bldg I was telling my son the height and flight path of the objects when he spotted them at about 2 miles out as they came out from behind a cloud. He saw the same group of what he describes as \"a dozen to a dozen and a half white orbs\" traveling west away from us. The objects were then lost in the cloud cover. These were definitely glowing objects that were not \" usual\" or \" normal\". My son also noticed slight changes is elevation of a few of the orbs as they traveled."],"Date Submitted":"08/25/2013 10:14 UTC","Tags":"City","trends":["There have been 9 other sightings in Stafford","There were no other sightings in Stafford on or around August 25th 2013"],"Summary":"Saw a group of lights to the south just before a rain storm","Object Shape":"Sphere","Longitude":"-95.542945","Source":"MUFON"}