{"Date Submitted":"08/25/2013 11:01 UTC","Country":"United States","Object Flight Path":"Hovering then path,Path with directional change","Weather Factors":"Unknown","Object Shape":"Boomerang, Chevron, Triangle","Longitude":"-81.150765","Sighting Duration":"Undisclosed","Tags":"City","Date of the Event":"08/20/2013 01:30 UTC","files":["/var/www/straped/mufon/html2text/50173.html.txt","/var/www/straped/mufon/org/50173.html"],"Summary":"Large luminous light looked like a large cake, glowed, changed attitude, speed and direction.","trends":["There have been no other sightings in Claremont","This sighting has never been favorited."],"Region":"North Carolina","Viewing Distance":"Unknown","City":"Claremont","divs":["Sighting DetailsReturning home after leaving my job, around 1230 a.m., I noticed a very bright odd shaped light in the sky some distance from me. I thought it was a plane at first, but then realized the large luminous lighting was going away from me instead of toward me...the light was very bright, bluish white...and a tint of red around the edges. It was higher in the sky at one point and seemed closest to me at that point. I lost sight of it as I drove and was afraid when I came to a stop sign on the top of the hill, I'd not be able to see it. But there it was lower and was going more north east than the original direction I noticed when I first saw it. The intensity of the lighting never varied...it glowed around the edges. I had my cell phone but I couldn't get a picture of it from where I was. When I went southeast toward my house maybe 150 yards, it was on my left going Northeast....I stopped my car and took the photo. You can see the line of trees and the sky was clear that evening..so there were few clouds. When I looked at the photo, it definitely had a triangular, boomerang shape. My headlights can be seen throwing some light out around the front of the car which had nothing to do with the object in the air. It was strange to be alone in the middle of the night, nobody on the road but me and seeing this. But I was glad I had a camera of sorts to verify what I saw. From where I was and where the object was....it was bigger than I thought when I first saw it. The object simply moved quickly over the tree line and disappeared like some one had flipped a switch. There was no noise, and no planes in the area. I thought this was rather curious as I see a lot of approaching jets going into the Charlotte area airport...but I didn't see or heard any of them."],"Object Features":"Unknown","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=35.670691,+-81.150765(50173)&iwloc=A&hl=en\"> mufon case (50173) map </A>","Case Number":"50173","Latitude":"35.670691","Source":"MUFON","Log Number":"US-08252013-0035"}