{"Region":"Ontario","trends":["There have been 2 other sightings in Massey","There was one other sighting in Massey on or around August 22nd 2013"],"Country":"Canada","Object Shape":"Diamond, Oval, Teardrop","Case Number":"50185","Object Features":"Unknown","Date Submitted":"08/26/2013 12:23 UTC","Longitude":"-82.076466","map":"<A HREF = \"http://maps.google.com/maps?q=46.221795,+-82.076466(50185)&iwloc=A&hl=en\"> mufon case (50185) map </A>","Tags":"City","Disposition":"Unresolved","Date of the Event":"08/22/2013 11:30 UTC","Log Number":"CA-08262013-0011","divs":["Sighting DetailsOn August 20, 2013, my partner and I had travelled to Sagamok First Nation territory to scout out some film locations for a current project. During the evening of August 22nd, 2013, we camped at Toulouse Bay at my partner's mom's cabins which are located on the shores of the Toulouse Bay. Approximately at 11:30 pm that evening, we were both sitting enjoying a campfire and discussing the days activities. When I looked up into the clear night sky, I made the comment on how beautiful it is to get out of the city and how bright the stars are. There before both of us was a bright penny sized white glowing object that was moving at a faster rate than most aircraft that I have seen. It was directly above us moving from the west to the east. The object did not make any sound whatsoever. It was totally silent as it passed over us. I first thought it was probably just a satellite but the object was to large to be that. I rushed and started my Sony HDR-HC3 camera. I managed to capture 2 minutes of footage of this object flying away from us. The trees are visiable in the last part of the footage which gives you a perspective of how fast and the size of the object was when compared with the stationary trees. The object just faded out of sight as it moved away from us. I have never experienced anything like this before which was not explainable. After showing the footage taken to various members of the community of Sagamok First Nation, many stories of similar experiences started to emerge."],"Source":"MUFON","City":"Massey","Summary":"UNKNOWN BRIGHT LIGHT IN SKY SEEN AND RECORDED","Viewing Distance":"Over One Mile","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/50185.html.txt","/var/www/straped/mufon/org/50185.html"],"Weather Factors":"Unknown","Latitude":"46.221795","Sighting Duration":"00:02:00"}