{"Date of the Event":"08/22/2013 09:30 UTC","Tags":"City","Weather Factors":"Unknown","trends":["There have been 129 other sightings in Albuquerque","There was one other sighting in Albuquerque on or around August 22nd 2013"],"files":["/var/www/straped/mufon/html2text/50194.html.txt","/var/www/straped/mufon/org/50194.html"],"Source":"MUFON","Latitude":"35.116482","Log Number":"US-08262013-0019","Longitude":"-106.594799","Country":"United States","Viewing Distance":"101-500 Feet","Case Number":"50194","divs":["Sighting DetailsNow that I know these high-tech craft are real, I asked for one to show up. This was not the first time I asked, but it was earnest, and I asked for friendly ones only. About 15 minutes later I was looking at the sky from a chair in my front yard (head tilted back skyward), hoping to see a light zipping around the size of a star. The sky was clear and a large moon was rising, but not yet over the neighbor's tree level to the east, allowing for some darkness.Then pretty much right overhead I saw a form drifting east at about 200ft high and maybe 30mph. Those numbers are only estimates. At first I thought, \"what the heck it that\" and then figured this could be a surprising cigar-form-ufo we so often hear about. Since the sky was clear, with a little bit of city-light haze (but no clouds), I was at total loss to what this could be. I blinked my eyes and did a double check on the situation. Since this object was mostly invisible, I questioned whether my eyes were playing tricks on the brain. But now I was alert and all I could do was keep tabs. It moved from overhead (with a darkish form) going east towards the moon (but off to my right or south ever so slightly). As it moved the only visible form seemed to be the moon's reflection on the front rim of this huge (100ft dia.) round silent object, that was otherwise absolutely invisible. This reflection looked like a wisp of cloud floating through the night sky. But since the shape never changed and the direction and speed was constant, it was easy to look away and then find it again. Then as it veered to the right (or south), the leading edge reflection started to fade as the moon light would be visible to some other observer (south of me) and no longer to me. Being as how this thing was in invisible-mode, I soon lost sight of it. The total visible flight time was about 30 to 45 seconds. I doubt others would have seen this. I was quite lucky it passed directly overhead and that the moon was aligned for a perfect reflection. Obviously, I asked them (the space people)to come back over again (in the form of a prayer), but alas, this was probably just a coincidence. If anyone saw this, please confirm. It made me wonder if it was a military craft in silent-invisible-mode. I think space-people they could have done a better job, unless they came specifically to show me their \"reality\" as a confirmation of my request. The next step is to go outside of the city and make the same request. Who knows, but those were my thoughts.Cheers"],"Object Features":"None","Summary":"Round silent slow moving transparent craft overhead with lunar-reflection on leading edge.","Date Submitted":"08/26/2013 05:39 UTC","Disposition":"Unresolved","Object Flight Path":"Straight-line path,Path with directional change","City":"Albuquerque","Region":"New Mexico","Object Shape":"Circle","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.116482,+-106.594799(50194)&iwloc=A&hl=en\"> mufon case (50194) map </A>"}