{"City":"Pinon Hills","Object Shape":"Oval","Disposition":"Unresolved","trends":["There have been 3 other sightings in Pinon Hills","There were no other sightings in Pinon Hills on or around August 4th 2013"],"Log Number":"US-08262013-0029","Weather Factors":"Unknown","Longitude":"-117.645672","divs":["sighting detailsi went outside to sit on my porch around 8:30 p.m. and saw a large oval object in the distance with lights that flashed hovering. it was up in the sky perhaps a little above the trees across town perhaps a mile away. it did not move like a helicopter or plane. it caught my attention. it didn't move for about 15 min and then started northwest slowly,closer to my house. it stopped and went again always with the bright lights. i knew they were lights because i went and retrieved my binoculars and saw it was an oval type body with the perimeter flashing lights. that was the 3rd. it was there for about 11\\2hr. the next evening my two acquaintances saw lights as described above hovering as they drove up the freeway and down the hwy turnoff to my house. they called and asked me to go outside and look and tell them if it was the same thing i saw on the 3rd. it was. my neighbor also saw it that night at the same time. at one point after about 3 hours. it just zipped out of sight up and away. i used to not believe in ufo's but now i do because i realized it was unlike anything i have ever seen. the others agree that there is no explanation other than ufo. dictated and contact person neighbor per request of observer."],"Latitude":"34.440687","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/50204.html.txt","/var/www/straped/mufon/org/50204.html"],"Country":"United States","Date of the Event":"08/04/2013 08:30 UTC","Source":"MUFON","Region":"California","Date Submitted":"08/26/2013 11:03 UTC","Case Number":"50204","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.440687,+-117.645672(50204)&iwloc=A&hl=en\"> mufon case (50204) map </A>","Summary":"A large object with flashing lights around perimeter hovered and moved along. It appeared btwo nights in a row. Two in neighborhood observed","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Tags":"City"}