{"Longitude":"-122.326326","Country":"United States","Latitude":"47.408364","Object Shape":"Cylinder","Disposition":"Unresolved","Summary":"Watching SW flight WN476 depart Seatac I witnessed a silver cigar shaped object hovering almost half mile above the departing commercial flight. Then a cloud parted and the craft moved through it leaving a single contral behind the fuselage of the object","Date Submitted":"08/26/2013 10:15 UTC","Source":"MUFON","divs":["sighting detailsi had departed work at 3:35pm friday august 23 while waiting at a red light i observed southwest flight wn476 departing seatac intl. the blue and red colors were very recognizable as the commercial plane started to ascend i noticed a silver cigar shaped object in line of sight from my stopped vehicle past the sw flt and an additional 1\\2 to 1 mile away at 70 degrees from the horizon. the craft was not moving. it look similar to the fuselage of a 737 american airliner, but i could not see any wings or tail structure. a told my passenger do you see that object that's just hovering there. he tried to look through the front windshield but due to the angle he was unable to see it. suddenly a light cloud opened a track through it the vehicle disappeared but i could see a contrail coming from where the end of the cigar shape was. it was moving at a relatively slow speed. i could no longer see the vehicle but i could follow its movement by the contrail. the light changed i looked forward then quickly back and the cloud had a slice through it and the contrail was gone. i am an aerospace worker that works close to seatac airport."],"Region":"Washington","Date of the Event":"08/23/2013 03:45 UTC","Weather Factors":"Unknown","Case Number":"50201","Tags":"City","trends":["There have been 2 other sightings in Des Moines","There was one other sighting in Des Moines on or around August 23rd 2013"],"City":"Des Moines","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-08262013-0026","Object Features":"None","files":["/var/www/straped/mufon/html2text/50201.html.txt","/var/www/straped/mufon/org/50201.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=47.408364,+-122.326326(50201)&iwloc=A&hl=en\"> mufon case (50201) map </A>","Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed"}