{"Tags":"City","Log Number":"US-08262013-0025","City":"Hollister","Object Shape":"Flash, Star-like, Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/50200.html.txt","/var/www/straped/mufon/org/50200.html"],"Summary":"Huge pulsing light floating over entire city, baffled","Disposition":"Unresolved","Date of the Event":"08/25/2013 09:00 UTC","divs":["Sighting DetailsI was sitting out in front of my girlfriends parents house just BSing with her when behind her beyond the treeline I saw what at first I thought was a shooting star, I see them a lot here, and was about to tell her I saw one, when it suddenly stopped and emitted a tremendously bright red colored light, much larger than any aircraft light I've ever seen before, it hovered for a sec and then slowly started moving northward. We kept talking back and forth considering what it could be, we have two small airports and a large one, plus a few helicopter pads, so seeing them is completely normal, neither of us could decide, joked about it being aliens then it started a swaying motion like it was zigzagging in the sky. It continued along the tree line, we think it was following the highway, just continuously pulsing, I walked along the side walk as I was moving, to see if I could get a better angle, and it started moving a little faster, from maybe 300 mph to 600 approximately, then I said to her, if this thing shoots up in the air I'm going to flip, I no sooner than said that, when it seemed to have either dimmed the light permanently, flew faster than anything I've ever seen or shot straight up in the air. While war hint it we were too stunned to even move much, we were almost hypnotized by it, I didn't take any pictures, cheap prepaid phone, and no video devices were around, but I found out the next day, today, that a friend of mine who lives around 30 miles north from me had seen about the same thing at almost exactly the same time while out walking his dog. After witnessing this event I called my mother to know if she had heard of anything like it she kind of laughed told me it was whatever I was smokin makin me see things (we weren't smoking anything of course) then she joked about UFOs which I wasn't even sure if I wanted to call it, then I did a we search on my cellphone, which brought up all kinds of UFO reports from people describing almost to a T exactly the same thing we had witnessed. August 26,2013"],"Object Features":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=36.633289,+-93.209977(50200)&iwloc=A&hl=en\"> mufon case (50200) map </A>","Case Number":"50200","Date Submitted":"08/26/2013 09:39 UTC","trends":["There have been no other sightings in Hollister","This sighting has never been favorited."],"Weather Factors":"Unknown","Source":"MUFON","Latitude":"36.633289","Longitude":"-93.209977","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, N/A","Region":"Missouri"}