{"Case Number":"50216","Sighting Duration":"Undisclosed","City":"Edmond","Date of the Event":"08/24/2013 12:00 UTC","divs":["Sighting Details This past saturday night I was at Lake Arcadia around 12:30-1:00 in the morning fishing for catfish. I was fishing out of this old Juan boat and there was absolutely no one else on the water. The only other people that I saw out there that evening was a group of 12 to 15 people around a fire on a campsite on opposite side of the like. Believe me, you could tell and hear that they were there. However there was no one at that site for a while before the sighting. I was getting ready to leave when about 60 to 75 yards behind me. A giant bright and glowing light appeared under the lakes surface. It was fairly large and had a light green green color to it with a rhythmic flashing of red and blue lights. Then the light began moving from western side of the lakes shore to the eastern side and back to the other side a couple of times then it stopped almost near the center of the lake. At that moments it grew brighter and slightly larger than shot straight up in the air and into the sky and seemingly disappeared for a couple of seconds and reappered hovering right over the campsite that I mentioned earlier and disappeared again. Then reappeared again maybe a minute later and shot up into the sky and went out of sight and I never saw it again. I drove my boat over to the site where the craft was hovering over as fast as I could get there. However, I did not recognize anything out of the ordinary. Just a white ford truck with several bags of trash in the bed and a couple other sitting beside it. I did not see any one by the truck or in the immediate area."],"Region":"Oklahoma","Object Features":"Unknown","Date Submitted":"08/27/2013 09:39 UTC","Object Shape":"Unknown","Source":"MUFON","Country":"United States","Viewing Distance":"Unknown","trends":["There have been 16 other sightings in Edmond","There was one other sighting in Edmond on or around August 24th 2013"],"Disposition":"Unresolved","Summary":"Light appeared under lakes surfaced and shot out and hovered over campsite","Longitude":"-97.474435","Log Number":"US-08272013-0011","Object Flight Path":"Other","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/50216.html.txt","/var/www/straped/mufon/org/50216.html"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=35.660222,+-97.474435(50216)&iwloc=A&hl=en\"> mufon case (50216) map </A>","Latitude":"35.660222"}