{"Date of the Event":"08/25/2013 10:15 UTC","Sighting Duration":"Undisclosed","trends":["There have been 3 other sightings in Evesham Township","There were no other sightings in Evesham Township on or around August 25th 2013"],"Object Flight Path":"Path then hovering","Summary":"One UFO waiting to be reunited with 2 others before forming a triangle and leaving","Region":"New Jersey","Country":"United States","divs":["Sighting DetailsMy kids and their mother were driving down route 70 east when they saw a UFO hovering over farm land. It began to move slowly, but not going any where in much distance. It was as high as a 10 story building. They immediately knew it was an UFO and not a helicopter, blimp or weather balloon. It had 3 white lights shine below the craft that only descended 20 feet. The lights were a continuous bright light for the full 20 feet. After several minutes, a second UFO with red outside lights appeared and hovered next to the first UFO. They were very frightened and went to the nearest store. There were some observers there but they said they did not know what it was and then it went behind trees. After 15 minutes, they left the store and once again saw the 2 UFO\"s. As the drove down rt 70 a third UFO joined the other two and formed a triangle and slowly climbed upwards. They lost the UFO's behind trees and were too scared to try and follow them. I have attached a picture taken from a cell phone. It is a picture of a green light. However, my son said the light was not green when he took the picture, it was white. I am not sure why it came out green. If you enlarge the picture on a computer and not a cell phone and look to the right and a little below the green light, you can see the shape of the UFO."],"Case Number":"50217","Object Features":"Dome","Object Shape":"Disc, Oval","Latitude":"39.900045","Date Submitted":"08/27/2013 09:50 UTC","Tags":"City","Viewing Distance":"101-500 Feet","Longitude":"-74.920322","Disposition":"Unresolved","City":"Evesham Township","Log Number":"US-08272013-0012","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.900045,+-74.920322(50217)&iwloc=A&hl=en\"> mufon case (50217) map </A>","files":["/var/www/straped/mufon/html2text/50217.html.txt","/var/www/straped/mufon/org/50217.html"],"Weather Factors":"Unknown"}