{"Source":"MUFON","divs":["Sighting DetailsOn June 4th, at 11:50 I was driving West just on the outskirt of Kamsack, Sk,when I noticed a bright object in the sky, to my left, through the driver-side window. I then noticed another object behind it. It looked similar to what I saw a few weeks ago, which appeared to be three satellites travelling in a row. I had mentioned this previous event to my passengers, so we stopped and got out to look thinking this could be the same phenomenon. We then noticed there were more than three of these objects. We counted at least 12 of them. We were on a hill with the lights of the town visible to our East. For all intents and purposes they behaved exactly as satellites, except there was a \"convey\" of them. I have never seen anything like this, and I'm always looking at the sky. The objects did not form a straight line, they were randomly spaced, not unlike notes on a musical staff, but they all moved in sync. The objects took up the entire southern hemisphere. They did not vary their altitudes or speeds. I had an incredibly strange sensation, mostly psychological, not physical. I mentioned to the other two observers how strange this was and that it reminded me of recurring dreams I had as a child. In these dreams the entire night sky would come alive with fantastical lights of varying shapes. The two other witnesses also commented that they could not believe what we were seeing. The entire incident lasted approximately 5 minutes. We did have video cameras, but the footage is difficult to discern since we couldn't see the objects in the viewfinder while filming. I would need to have the camera on a tripod to properly document the objects' trajectory. The objects disappeared into the distance in a southwest direction."],"Object Flight Path":"Straight-line path","Tags":"City","Log Number":"CA-08272013-0006","trends":["There have been no other sightings in Kamsack","This sighting has never been favorited."],"Region":"Saskatchewan","Object Shape":"Sphere","Summary":"A dozen satellite-like objects, in formation, moved across the sky at the same speed following the same path.","map":"<A HREF = \"http://maps.google.com/maps?q=51.562481,+-101.899376(50211)&iwloc=A&hl=en\"> mufon case (50211) map </A>","Weather Factors":"Unknown","City":"Kamsack","Disposition":"Unresolved","Longitude":"-101.899376","Sighting Duration":"00:05:00","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"06/04/2013 10:50 UTC","Date Submitted":"08/27/2013 03:56 UTC","Object Features":"None","Case Number":"50211","Latitude":"51.562481","files":["/var/www/straped/mufon/html2text/50211.html.txt","/var/www/straped/mufon/org/50211.html"],"Country":"Canada"}