{"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Case Number":"50212","Log Number":"US-08272013-0007","Latitude":"36.038158","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=36.038158,+-86.643981(50212)&iwloc=A&hl=en\"> mufon case (50212) map </A>","Region":"Tennessee","Source":"MUFON","Summary":"Hundreds of orange floating lights on same path","Weather Factors":"Unknown","divs":["Sighting DetailsI was headed to the store on Friday night, August 23, 2013, when I noticed an odd floating orange light. When leaning to look closer, I realized there were hundreds of these things floating on the same path. I immediately pulled over into a parking lot where many others were gathered to watch this strange event. It lasted roughly 20 minutes. The \"lights\" were at a floating pace, none zipping or streaking through the sky, and no sound seemed to come from them. After travelling about 100 yards passed us, they would gently flicker and then were gone. I inquired with my local news channel but got no response, and no one seemed to be airing any news of this. I took several photos, some on my Canon, others on my cell, but no one seems to know what this was. I googled it and found that at roughly the same time, the same thing occurred in New York State as well...also New Zealand, London, Illinois, and Texas that same weekend. Wtf? I am including the 3 pics I took from my cell, but the poor quality causes the lights to look streaked, which they were not. I have a few that I took with my Canon as well that I would be glad to share if needed. (Don't have it with me here at work)."],"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/50212.html.txt","/var/www/straped/mufon/org/50212.html"],"Tags":"City","Object Features":"None","Longitude":"-86.643981","Date of the Event":"08/23/2013 08:30 UTC","Object Flight Path":"Straight-line path","trends":["There have been 72 other sightings in Nashville","There were no other sightings in Nashville on or around August 23rd 2013"],"Sighting Duration":"Undisclosed","Date Submitted":"08/27/2013 04:45 UTC","City":"Nashville","Object Shape":"Circle, Cross, Star-like"}