{"Sighting Duration":"00:00:30","Object Features":"Unknown","Weather Factors":"Unknown","City":"Santa Clarita","divs":["sighting detailsgood morning. it's been about a month now that i've been observing this strange light that seems to strobe (picture 100_1289) that is visible to the eye if one is looking hard. picture 100_1287 top left side you could see light. picture 100_1289 sunset after 7:00 p.m., monologue antena straight up very bright light. now picture 100_1287 i've been observing this strange light for the last two days after 5:00 a.m. when i took picture i notice these weird rainbow lights in the picture that i didn't see with naked eye i thought the picture was smuged but i looked at other stars around and they don't look blurry or smuged. today, 8\\27\\13' i saw that light again strobe like crazy, dimmed, disapperead & got very bright again & it did this twice, by the time i took out my camera it disappeared. after viewing 100_1289 pictures in computer i notice two more objects one almost below & the other one jus towards the left where sky is a little more blue. on pictures you would have to zoom in to observe. p.s. picture 100_1286 taken 08\\26\\13 @ 5:33 am & 100_1287 taken 08\\26\\13 @ 5:34 am i did this so you could see the before & after picture 100_1289 taken 08\\26\\13 @ 7:33 pm bright light. zoom in monologue antenna & look straight up & you will not only see one but two more lights. first with naked eye only saw one bright light that flashes off & on but later saw in picture that there is two more. you would have to zoom in & search. picture 100_1290 taken 08\\27\\13 @ 5:34 am i was trying to take a picture of strobing crazy light that would dimm & then dissapear twice. as i was taking picture it disappeared."],"Date Submitted":"08/27/2013 01:48 UTC","Log Number":"US-08272013-0005","trends":["There have been 33 other sightings in Santa Clarita","There were no other sightings in Santa Clarita on or around August 26th 2013"],"Object Flight Path":"Stationary,Path with directional change","Country":"United States","Viewing Distance":"21-100 Feet","Source":"MUFON","files":["/var/www/straped/mufon/html2text/50210.html.txt","/var/www/straped/mufon/org/50210.html"],"Tags":"City","Region":"California","Disposition":"Unresolved","Case Number":"50210","Date of the Event":"08/26/2013 05:34 UTC","Summary":"strobe like crazy, dimmed, got very bright twice & disappeared.","Longitude":"-118.533686","map":"<A HREF = \"http://maps.google.com/maps?q=34.413385,+-118.533686(50210)&iwloc=A&hl=en\"> mufon case (50210) map </A>","Object Shape":"Fireball","Latitude":"34.413385"}