{"Viewing Distance":"Unknown","Summary":"Bright star-like object like Venus moving, followed by smaller object that brightened","Disposition":"Unresolved","Object Shape":"Star-like","divs":["Sighting DetailsI am located north of Dallas in the flight path of both DFW airport and Love Field. I went out front to check my sprinkler system and looked up to see a very bright Venus. At that time I heard a commercial jet overhead and looked up to see a bright light similar in size to Venus moving east to west at a steady speed. The commercial jet I heard was also visible moving south to north and readily identifiable as an airliner. The object was a constant, very bright white in color with no strobe lights. Commercial airliners and smaller planes were visible at the same time for comparison and contrast. (The airspace over Frisco, Texas is always busy with various aircraft.) I went inside to get my son to come out and see the object with me. When we came back out, it was still visible and was now veering towards the southwest in a very wide arc (not abrupt). It continued southwest at a constant speed out of sight. The direction and estimated altitude of the object was opposite to the typical air traffic for DFW and Love Field normally observed in this area. Strobes are easily observed on aircraft up to as high as visible with the naked eye, but this object was a constant very bright white light. Immediately following the passing of this object, another object was observed also moving from east to west. This object was either much higher or much smaller than the first object as it appeared more the size of star in the night sky. Again, all manner of civilian aircraft were visible in the area at the same time. There were no strobe lights visible. It was a constant star-like light moving at a constant velocity that was not especially fast. As my son and I were watching, the object brightened for a split-second and returned to it's previous brightness. A tree across the street blocked our view. We moved on foot 70 feet or so eastward down the street to clear the tree and could no longer observe the object."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.128463,+-96.796543(50218)&iwloc=A&hl=en\"> mufon case (50218) map </A>","Date Submitted":"08/27/2013 10:28 UTC","Sighting Duration":"00:10:00","Object Flight Path":"Straight-line path,Path with directional change","Source":"MUFON","Object Features":"Unknown","Longitude":"-96.796543","trends":["There have been 17 other sightings in Frisco","There were no other sightings in Frisco on or around August 27th 2013"],"Weather Factors":"Unknown","Latitude":"33.128463","Tags":"City","Country":"United States","Case Number":"50218","files":["/var/www/straped/mufon/html2text/50218.html.txt","/var/www/straped/mufon/org/50218.html"],"Date of the Event":"08/27/2013 08:50 UTC","Log Number":"US-08272013-0013","City":"Frisco","Region":"Texas"}