{"Case Number":"50223","map":"<A HREF = \"http://maps.google.com/maps?q=42.66181,+-77.057256(50223)&iwloc=A&hl=en\"> mufon case (50223) map </A>","City":"Penn Yan","Longitude":"-77.057256","Viewing Distance":"Over One Mile","Log Number":"US-08282013-0002","Date Submitted":"08/28/2013 01:18 UTC","Summary":"Unexplainable.. I have never, ever seen anything like it.","Country":"United States","Region":"New York","Sighting Duration":"00:03:45","files":["/var/www/straped/mufon/html2text/50223.html.txt","/var/www/straped/mufon/org/50223.html"],"Disposition":"Unresolved","Object Shape":"Unknown","trends":["There have been 2 other sightings in Penn Yan","There were no other sightings in Penn Yan on or around August 28th 2013"],"Object Flight Path":"Hovering then path","Latitude":"42.66181","Tags":"City","divs":["Sighting DetailsMy niece Lily had told me of a strange object she had seen and I was explaining to her that I had also seen one, right around her age (9). And took it as nothing more than her imagination. I was standing outside..I believe it was alittle after midnight and I was texting my friend and happened to look up, for satellites or anything really, and happened to catch a form, but not at first..now my eyes were adjusting to the darkness after my cellphone but as I looked up after I rubbed my eyes a few times I realized I was looking at something...that I have never,ever seen. We live close to an airport so helicopters and planes are a regular sight and experience for me, but this object... I know.. Was not of this world or anything we've known. It was 5 lights, slowly pacing and crossing eachother, so immediately I thought meteorite crossing a shooting star, or a satellite or vice versa, so I was excited! Then realized nothing burned out..or faded away. I tried to record it on my phone and have the original recording but there wasn't enough to actually dissect to make me feel better. I'm not religious nor am I a believer of the after life, But I can tell you right now that I am now a believer of beings not of our soil, and I feel pig headed for not evaluating or knowing it sooner... this made me take a step back and really think.. whole heartedly on what is really out there.. and how I perceive it.. I don't want to feel like I'm crazy.. at all. But I know what I saw... I can't deny that.. I saw it."],"Weather Factors":"Unknown","Date of the Event":"08/28/2013 12:00 UTC","Source":"MUFON","Object Features":"Unknown"}