{"Viewing Distance":"Unknown","divs":["Sighting DetailsIT WAS 3AM I WAS ASLEEP IN MY BED.I SUDDENLY AWOKE.THERE WAS AN EXTREMELY BRIGHT LIGHT EMANATING THROUGH MY BEDROOM WINDOW BLINDS.I GOT OUT OF BED AND WENT TOWARDS THE BLINDS WITH THE INTENTION OF FINDING OUT WHAT WAS CAUSING THE LIGHT AND THE INCREDIBLY LOUD NOISE WHICH SOUNDED LIKE A GIANT GENERATOR.I FOUND I WAS TOO SCARED TO OPEN THE BLIND WHICH IS UNUSUAL FOR ME,BEING A NATURALLY INQUISTIVE PERSON.THE LAST THING I REMEMBER IS STANDING TO THE SIDE OF THE WINDOW.WHATS REALLY STRANGE IS THAT I THEN FORGOT ALL ABOUT IT.MONTHS LATER IT POPPED BACK INTO MY MIND AND I REALIZED THAT I DONT REMEMBER GOING BACK TO BED THAT NIGHT AND I NEVER RESOLVED THE SITUATION.I ALSO HAD A STRANGE DREAM.IN IT I AM LAID ON A RAISED TABLE.SOMEONE OR SOMETHING IS BESIDE ME BY MY HIP AREA.I AM PARALIZED BUT CONSCIOUS.I AM ABSOLUTELY TERRIFIED AS WHATEVER PROCEDURE ISGOING TO BE DONE IS ABOUT TO START.THEN I HEAR A VOICE THAT SAYS stop shes terrified.OUT OF MY PERIPHERAL VISION I CAN SEE A WOMAN.SHE LOOKS VERY HUMAN EXCEPT FOR HER HIGH FOREHEAD AND BLUISH TINGE TO HER SKIN.SHE COMMUNICATED PSYCHICLY.I ASKED WHY ME? AND WAS TOLD IT IS BECAUSE IM SPECIAL.IM SURE A PSYCHOLOGIST WOULD HAVE SOMETHING TO SAY ABOUT THAT AND IVE AGONISED ABOUT WHETHER I SHOULD JUST KEEP QUIET FOR FEAR OF RIDICULE. WHAT IS ALSO STRANGE IS THE FACT THAT THERE WERE CHINOOK HELICOPTERS HOVERING OVER OUR ESTATE BEFORE AND AFTER THIS EVENT WHICH WERE SEEN BY MANY LOCALS.THROUGH MY LIFE AGED 4,15,32,AND 45 I HAVE HAD DREAMS OF A SIMILAR TYPE.NOW IM WONDERING IF THEY WERE MORE THAN THAT."],"Region":"","map":"<A HREF = \"http://maps.google.com/maps?q=52.063283,+-1.390452(50228)&iwloc=A&hl=en\"> mufon case (50228) map </A>","Summary":"EXTREMELY BRIGHT LIGHT,EXTREMELY LOUD NOISE LIKE A GENERATOR STREAMING THROUGH BEDROOM WINDOW,CHINOOKS IN AREA B4 & AFTER","Object Flight Path":"Unknown","Date of the Event":"10/12/2011 03:03 UTC","Case Number":"50228","Tags":"City","Object Shape":"Unknown","Disposition":"Unresolved","Source":"MUFON","Latitude":"52.063283","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/50228.html.txt","/var/www/straped/mufon/org/50228.html"],"Date Submitted":"08/28/2013 10:07 UTC","Sighting Duration":"Undisclosed","trends":["There has been one other sighting in Banbury","There were no other sightings in Banbury on or around October 12th 2011"],"City":"Banbury","Country":"United Kingdom","Object Features":"Unknown","Longitude":"-1.390452","Log Number":"GB-08282013-0007"}