{"Date Submitted":"08/27/2013 10:49 UTC","trends":[],"files":["/var/www/straped/mufon/html2text/50220.html.txt","/var/www/straped/mufon/org/50220.html"],"Disposition":"Unresolved","Date of the Event":"07/05/2013 12:00 UTC","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=31.251253,+-92.142114(50220)&iwloc=A&hl=en\"> mufon case (50220) map </A>","Case Number":"50220","Object Shape":"Oval","Log Number":"US-08272013-0015","Sighting Duration":"Undisclosed","City":"Undisclosed","Source":"MUFON","divs":["Sighting DetailsI will start by saying that I am still in a state of shock and was not a real believer in UFO's until now. I had awaken from my short nap on the sofa and called my husband out of the bedroom to come outside to help put the cars in the garage. When we came out of the house, I looked up in the sky and immediately said to him, \"What is that in the sky?\" It was twirling with white lights and appeared to be very bright and oval to round shape. It has appeared in this area from July 5th until the present. It appears just as the sun goes down and remains in that spot for approximately 2-3 hours every night. I have taken pictures and videos. My husband thought that it was a star but now he knows that it can't be. I thought maybe it could be something that the authorities put up there to watch everybody. The third day that I came outside to observe this object is what changed my life forever. I video recorded the evening and stated that I would come back out later to check the object at a later time. When I came back outside at about 9pm, I looked up to the sky where it was hovering and it wasn't there. I turned slightly to my right to find it silently moving, invisible with small lights surrounding the huge oval to round shape object. It was moving very slowly and quietly with a slight sputter just at tree length. It also had a haze or a slight fog around the object. I noticed that while I was outside watching it, there were no crickets, frogs or dogs in the area making any sounds. It was very still in the surrounding area. I quickly video recorded what I could and then ran in the house. I really just want it to leave."],"Summary":"I discovered this bright object in the sky beginning on July 5,2013 and it remains in the sky once the sun starts to go down. It appears to be very bright and round with colors sometimes of red, yellow and orange.","Region":"Louisiana","Object Flight Path":"Stationary","Tags":"City","Weather Factors":"Unknown","Latitude":"31.251253","Longitude":"-92.142114","Object Features":"Unknown","Country":"United States"}