{"Log Number":"US-08282013-0001","Viewing Distance":"Unknown","Object Shape":"Circle","Object Flight Path":"Stationary","divs":["Sighting DetailsOur kids filmed some strange objects in the sky near Urbandale, IA on August 12th and have seen them every night since then. They have not filmed them more than two or three times. They were out watching a meteor shower on the 12th (or the 11th?) and noticed an object that seemed to defy physicsanger hat changed colors. When they slowed down their video footage, you could see all colors of the rainbow. This was a mind altering event for them but they have been looking for the objects every night and have been seeing them and it seems that every night they are seeing more. Tonight, the 27th, they came inside sometime after eleven and got my husband and me. I went outside right away. Before my husband joined us, there were four teenagers with me in the driveway. We could see one object across the street above a neighbor's house that looked like it was far away but within the atmosphere and it was somewhat stationary but changing colors and moving back and forth and up and down. Sometimes in small circles. North of that one, there were two more that appeared closer. One was faint but the other grew very bright as it was changing colors and then just disappeared. The second one also disappeared. The very first one remained there for about 10-15 more minutes and it gradually descended out of our sight line. The kids had seen some to the east and they all disappeard when I came outside. My husband only witnessed the one to the west that stayed there the longest. They all appeared round and to be changing colors and maybe shape. They also appeard to be far away yet still in our atmosphere. We saw planes flying overhead as this was happening. I had seen the footage and heard plenty of stories of the sightings of these objects over these past weeks from our kids and our friends but this was the first time I saw any of it. It is hard to wrap my brain around it. Especially the one that became brighter and then disappeared. When my son asked me to come out to look he said they had counted 12 and when I first went outside I felt overwhelmed because it was so hard to differentiate between a star and these strange objects but once I figured out how to spot them I felt like we were surrounded and strangely, like we were being watched. But they looked so far away. So strange. By the time we went inside, there were just normal things like stars and airplanes in the sky as far as we could tell."],"Latitude":"41.634665","Source":"MUFON","Object Features":"Unknown","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Region":"Iowa","Longitude":"-93.72347","Case Number":"50222","City":"Urbandale","map":"<A HREF = \"http://maps.google.com/maps?q=41.634665,+-93.72347(50222)&iwloc=A&hl=en\"> mufon case (50222) map </A>","Tags":"City","Weather Factors":"Unknown","Country":"United States","Date of the Event":"08/27/2013 11:20 UTC","trends":["There have been 5 other sightings in Urbandale","There were no other sightings in Urbandale on or around August 27th 2013"],"Date Submitted":"08/28/2013 01:18 UTC","files":["/var/www/straped/mufon/html2text/50222.html.txt","/var/www/straped/mufon/org/50222.html"],"Summary":"Our kids have been seeing these objects since August 12th & could see them from our driveway tonight.first time I've seen them."}