{"Log Number":"US-08282013-0008","Date Submitted":"08/28/2013 10:21 UTC","Source":"MUFON","Object Shape":"Star-like","Summary":"Multiple atmospheric anomalies","Viewing Distance":"Over One Mile","Case Number":"50229","divs":["Sighting DetailsWhile camping in northern Michigan, I was viewing the stars with my night vision scope. Between the hours of midnight and 1:00 am, every time I looked up I saw a light about as bright as a dim star maneuvering outside of normal parameters. When I looked up, it took at most about 1 minute for something out of the ordinary to appear. Here are a few of the accounts: I saw a steady light enter from the south and exit to the north. Its intensity was approximately as bright as an average background star. The speed was slightly slower than a typical meteorite, but didn't get bright as a meteor would burning up in our atmosphere. It took less than 3 seconds to traverse the visible sky. It's path was perfectly straight and did not appear to have any internal motion indicative of a low flying bird. It did not have strobe lights like an airplane would, pulsate like a tumbling satellite, or change intensity like a meteor would. I saw this similar scenario 3 times over the next hour. Given its speed, it would be reasonable to assume the other events were the of same object - as I didn't note the direction of the other two instances. A light resembling a star entered my field of view from the north with a constant speed on a direct southerly heading. The speed was approximately 3 times faster than a satellite. The elevation at which I first observed it was approximately 60 degrees. When it was still about 80 degrees to the north, its speed dropped in half and the path then became erratic for a few seconds, while still maintaining a southerly heading. Then, without slowing down at all, it took an immediate left turn to the east while maintaining a constant speed and resumed a steady, non erratic path out of my view to the east. A light that looked like a star was covering around large portions of the sky very quickly. It did not travel in a straight line, but was turning left and right, curving around the visible sky for over a minute. Its speed appeared to be somewhere around 10 times faster than a satellite. It was a steady light, did not pulsate, strobe or change in intensity. I watched it for at least a minute until it took a straight path to the west out of view. A light that looked like a star was maneuvering quickly at about 80 degrees above me to the south-west. I had a green laser that I was using to determine if it was close enough to be illuminated if it was a bug. The object seemed to actively avoid my light as I tried to light it up. After about 30 seconds, it faded out of sight. I then turned off the laser and adjusted the gain on my scope to see if I could find it again. I then saw a bright flash from where it disappeared and it then faded back into view. After its intensity returned to what it was before, it then exited the area on a perfectly straight path to the west. Given that these objects danced around then left the area, it is possible that several of the instances were the same object coming back in to my field of view. Also, since I was camping, I did observe some ashes ascending from time to time when the wind pushed them over my position. These ashes were visibly blurry as they were within a few hundred feet of me and all acted similar as they drifted upward."],"Latitude":"44.510933","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.510933,+-85.509367(50229)&iwloc=A&hl=en\"> mufon case (50229) map </A>","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/50229.html.txt","/var/www/straped/mufon/org/50229.html"],"Region":"Michigan","Weather Factors":"Unknown","Tags":"City","Sighting Duration":"01:00:00","Object Flight Path":"Path with directional change","trends":["There has been one other sighting in Fife Lake","There were no other sightings in Fife Lake on or around August 10th 2013"],"Country":"United States","City":"Fife Lake","Date of the Event":"08/10/2013 12:00 UTC","Longitude":"-85.509367"}