{"Country":"United States","trends":["There have been no other sightings in Spicewood","This sighting has been favorited 1 time."],"Summary":"Saw one flying, and many others stationary. Later saw same objects in trees, right across the river from my house.","Object Shape":"Sphere","Viewing Distance":"501 Feet - 1 Mile","Case Number":"50235","files":["/var/www/straped/mufon/html2text/50235.html.txt","/var/www/straped/mufon/org/50235.html"],"Weather Factors":"Unknown","City":"Spicewood","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=30.410801,+-98.041594(50235)&iwloc=A&hl=en\"> mufon case (50235) map </A>","Object Features":"Patterned Surface","Date of the Event":"08/27/2013 11:07 UTC","divs":["Sighting DetailsI was outside on my deck. The house is situated on the edge of a cliff, atop a drying river bed. I saw a pulsing, multicolored light in the sky across the river. I see these same lights every night, and recently bought binoculars because of it. Anytime I try to get a closer look, they are always too far away to really see what they are. Last night when I looked through the binoculars, they were close enough to make out the detail. I saw the first one, and through the binoculars, you could see that it was stationary. It was perfectly round. It had black specs all over it, and was pulsing with light from the inside. The color would change every time it pulsed. I took the binoculars away from my eyes, and scanned the rest of the sky. I noticed another one on the far left side of the sky, and it was moving. I looked through the binoculars, to make sure it wasn't a plane. It was the exact same thing as the other one, only brighter and moving. It moved fast enough to cross the entire sky in about 10-15 seconds, but slow enough for me to follow it looking through the binoculars. It flew right by the stationary one, very close. As I was watching that, I noticed about 8 others in the background. They were solid white, much dimmer, stationary and not pulsing. I continued to observe them, then stepped inside for a moment. When I walked back outside, they were not in the sky at all. I saw a very bright, white light across the river. I thought maybe it was a car driving through the gated, yet very country community across the river. I watched it for a moment and it didn't move and it was so bright. So I looked through the binoculars, and to my amazement and horror, it was one of those things I had just seen in the sky. It was very large and very bright. It had black specs all over it and was lighting up the trees with its glowing. It looked like a star, radiating light like the sun. It looked like a giant ball of white, glowing energy with black specs all over it. I woke my husband up to be a witness to it. We could see groups of trees around it lighting up with, what appeared to be smaller glowing orbs beneath the treeline (much smaller ones). Once my husband got a good look at the big one through the binoculars, it's light shut off. We could no longer see it, but the other groups of trees continued to stay lit up for a while. They gradually dimmed out as well. The experience was exhilerating, but actually terrifying as well. I was texting the whole time to my friend in Houston, and that's why I know the exact time of everything. Even though I was using my phone, I didn't think to take a picture. Although, my phone isn't a very good one and I don't know that anyone would have been able to see anything in a picture from it. I was simply terrified. I was shaking and didn't think about anything except what I was looking at, along with telling someone. I do see these lights at some distance, every night. So, I plan to set myself up with a telescope and good camera for future evidence. I felt a sense of duty to let someone know what I saw. It did not look like it was of this world. I'm hoping for answers or validation. They had no sound that I could hear, but while inside, my dog sensed their presence."],"Longitude":"-98.041594","Tags":"City","Log Number":"US-08282013-0013","Date Submitted":"08/28/2013 04:25 UTC","Object Flight Path":"Stationary,Straight-line path,Other","Source":"MUFON","Sighting Duration":"Undisclosed","Region":"Texas","Latitude":"30.410801"}