{"Sighting Duration":"Undisclosed","Latitude":"36.451693","Object Features":"None","Longitude":"-103.184104","Source":"MUFON","Country":"United States","Summary":"in flight visual out of plane window","trends":["There have been no other sightings in Clayton","This sighting has been favorited 1 time."],"Disposition":"Unresolved","Tags":"City","Case Number":"50238","Object Shape":"Cigar, Cylinder","files":["/var/www/straped/mufon/html2text/50238.html.txt","/var/www/straped/mufon/org/50238.html"],"Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile","City":"Clayton","Log Number":"US-08282013-0016","divs":["Sighting DetailsI was flying from Houston to Seattle. My mother randomly said what's that son? (In reality she used my name) I looked out of the window and saw a cigar shaped object less than a mile away flying the opposite direction. I was only able to see it for about 8 seconds but got a very good look at it because it was very close. I calculated the speed based on a cloud that we were passing (my plane was traveling at 430 mph at 34000 ft.) The object was just on my side of that cloud The speed I estimated to Be around 1600 mph. It was traveling south by south east. There were no wings, no rotors, no extremities what so ever. It was grey, flying straight, was definitely not a conventional air craft. It was about 1.5 hours into the flight which puts the sighting around the north east corner of new mexico. It was about 10 degrees looking down from my window. Probably less than that. The viewable distance was unlimited with few clouds beneath. Quite a beautiful day until we got closer to Seattle. I lost sight of the object due to the viewing angle of the window. I was excited to see this as I know what I saw."],"Date of the Event":"07/26/2013 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.451693,+-103.184104(50238)&iwloc=A&hl=en\"> mufon case (50238) map </A>","Date Submitted":"08/28/2013 06:31 UTC","Region":"New Mexico","Weather Factors":"Unknown"}