{"Longitude":"-75.336017","Region":"Pennsylvania","Object Features":"Unknown","Latitude":"41.01898","Date of the Event":"08/27/2013 08:54 UTC","Log Number":"US-08282013-0010","Weather Factors":"Unknown","Disposition":"Unresolved","Country":"United States","files":["/var/www/straped/mufon/html2text/50232.html.txt","/var/www/straped/mufon/org/50232.html"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.01898,+-75.336017(50232)&iwloc=A&hl=en\"> mufon case (50232) map </A>","Date Submitted":"08/28/2013 01:44 UTC","Object Shape":"Circle, Sphere","Tags":"City","Viewing Distance":"21-100 Feet","Sighting Duration":"Undisclosed","City":"Reeders","Case Number":"50232","Object Flight Path":"Path with directional change","Summary":"Firey orb morphes into 3 little orbs and form a little triangle and go around","trends":["There has been one other sighting in Reeders","There were no other sightings in Reeders on or around August 27th 2013"],"divs":["Sighting DetailsI was out on my porch talking on the phone and then when i hung up, i look ed up at my sky at which time i saw nothing, i always look at my sky weather its day or not i love to look at my sky considering i moved here to Pennsylvania two years ago from NYC where you can NEVER see any stars at night or anything due to the pollution and lights. So that was one thing that i appreciated about my new Clear night sky and the abundance of stars are amazing. Some nights between the moon and stars i don`t even need a light to see outside even though its rural where i live and there are no streetlights which leaves it pitch black only to be lit by house lights car lights and planes, helicopters or lightning.i love it...So last night August 27 2013 after my call, i was looking at the sky from my front step through the top of the trees about 100 foot or so maybe more or less as i did not measure it, but as i was looking up through the top of the trees directly in front of me and at the distance i already approximated to the best of my ability,out of nowhere a small tiny red light appeared through the trees so i noticed it and said 2 things to my self lets wait for this tiny red light to start blinking and the second think was i don`t see any whites or greens flashing either indicating a plain or helicopter or even a single engine plain, i see these all the time during the day and at night and i know the difference between them all, also i have Pocono Mountains Municipal Airport which is 14 miles from my house and Tobyhanna Army depot which is one of the largest in the country. so i see things all day and night so back to last night at about 8:52, so now is where it became odd first it was seen through the trees which would be awfully low to see a plain and second no noise was made as it started coming closer then it started to ascend above the trees and as it moved up it little not yet in full view still being blocked by the treetops and remaining branches and leaves. It then as if it wanted me to see it it moved left in full view just as the moon away from a cloud. It never blinked, its was a a red orb to say the least but it looked maybe like the size of a my truck tire, again my best estimation. But it was not just the orb being red it had a glow almost a burn, maybe plasma and around this orb there was an orange hue like an Aura. Then the object in my full view it split apart forming three perfect little orbs with the same awe shocking colors. So as soon as the split they formed a little triangle and then it started to spin around and then while still triangular it started to spin in the opposite direction, then they started to go vertical and it looked like the did some sort of a waltz or gymnastics almost playing with each other, at this time i was STUNNED at what i was witnessing they became the little triangle orbs and started moving right and in less than a nanosecond it morphed back into its original form and moved to the right, at which time clearly nervous i took out my cell phone to rec it so i had to look away look down at my phone i pressed the camera button and it was on camera so i had to switch it to video so i held it up and all i could see was complete darkness nothing at all, so i put my phone away the orb there floating away now i go in my house grab my cannon i got it ran out of my house the orb still moving further away and as soon as i pushed the power button it i looked at the orb and as i looked at the orb it just vanished, gone, right into thin air. i got not no photo of the orb but the photo i did get was black with a little light of my floor or walk way lights meaning as soon as it vanished. I must have been starting to lift my right arm going to take the pic and instinctively snapped the shot as soon as my eyes saw it vanish grrr. so no i have no evidence but it does show that i was out side at the specified time and was trying to take a photo. Never saw on before but always believed in them. I hope some one from MUFON can contact me concerning things about certain events never being covered, lies, evidence and statements and footage and articles that are not being covered.Articles suppressed in the media, scientists stating that life has been found outside this atmosphere, i guess the found nothing on mars since those rovers being up there since 2006 i think a scientist said they were ready to make a historic statement, then the next day Nasa played it down saying it wasnt they found life but i dont really remember what she said but that was killed, we are actually receiveing thought to be radio signals from billions of miles away notes Nasa, Alien voices also confirmed by Nasa from saturns rings but you can hear it it clearly sound like an alien voice not noise explosions space junk colliding, you can actually listen to the voice anywhere Youtube online. And the best is if a guy predicts an ex air force and Norad guy that on oct 13 2010 aliens will show them selves over major cities, then it actually happens impossible, look at NYC on That date on youtube oct 13 2010 ufo or google it. i lived and worked in Manhattan at that time and i never saw any of the news footage on the news that was on youtube i was shocked i almost felt robbed, cbs 2 news had a camera on these ufos for 8 mins and the were also there at night on a night cam over manhattan you can see that too. All this never covered by major news outlets is sickening. And no they were not ballons. What also was not covered was the airports shut down the airports and air space, besides NY airspace is watched so closely that how can this even take place over this city for so long and saw by so many people....the Russian FAA said that umm the new york airports and air space has been closed because of a flap of ufos..that was never reported. our reason wht was somke in the terminals...Russia told the flight number of the plane wich left moscow and had to be diverted from its destination of new because of ufos. the more i look the more i see and it seems they are all over this year India China Taiwan remote regions crazy and there are so much evidence of the orbs that seem to NOT to be able to be photographed which im sure is their purpose...Thats all but can someone contact me to talk all about the stated above thank you."]}