{"Latitude":"41.311367","Date of the Event":"06/30/2006 10:28 UTC","trends":["There have been 5 other sightings in Laramie","There were no other sightings in Laramie on or around June 30th 2006"],"Case Number":"5023","Tags":"City","Summary":"Dull (in color) yellow light sighted in southeastern sky","Disposition":"Insufficient Data","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"00:05:00","files":["/var/www/straped/mufon/html2text/5023.html.txt","/var/www/straped/mufon/org/5023.html"],"divs":["Sighting DetailsI was smoking outside on my porch, looking at the stars in the southeastern sky with my hubsand. I noticed a dull (in color) yellowish light about 30 degrees above the horizon.It was a duller yellow than a streetlight, and was about three times brighter than jupiter. It was stationary and did not look like a planet or plane lights, as the lights of a plane are more of crisp white light. I went inside and got a pair of binoculars and returned outside. The light had moved a bit towards the west and was still in the south-south eastern sky. it had also gotten lower on the horizon by this time. I got sight of it in the binoculars and saw a disc shaped object with several circular shaped windows, which the yellow light was emanating out of. On top of the craft was a small blinking white light. I ran inside and grabbed the phone to call a nearby friend who lived in town. I returned outside as i dialed and saw the object moving lower on the horizon and headed south going quickly headed towards highway 287. By the time she got on the phone, the object had disappeared low on the horizon in the southern sky."],"Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=41.311367,+-105.591101(5023)&iwloc=A&hl=en\"> mufon case (5023) map </A>","Object Shape":"Disc","Longitude":"-105.591101","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Object Features":"Dome, Window(s)","Date Submitted":"06/30/2006 10:28 UTC","Region":"Wyoming","Source":"MUFON","City":"Laramie","Log Number":"US-07042006-0008"}