{"Object Features":"Undisclosed","Object Shape":"Other","Source":"MUFON","Sighting Duration":"Undisclosed","Latitude":"26.465772","trends":["There have been 35 other sightings in Delray Beach","There were no other sightings in Delray Beach on or around June 29th 2006","This sighting has never been favorited.",""],"Case Number":"5024","City":"Delray Beach","Disposition":"IFO","Region":"Florida","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Date Submitted":"06/29/2006 09:35 UTC","Log Number":"US-07042006-0009","Date of the Event":"06/29/2006 09:35 UTC","Longitude":"-80.06302","Tags":"City","Weather Factors":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/5024.html.txt","/var/www/straped/mufon/org/5024.html"],"Summary":"Nighttime Rods or New Entity Video","map":"<A HREF = \"http://maps.google.com/maps?q=26.465772,+-80.06302(5024)&iwloc=A&hl=en\"> mufon case (5024) map </A>","divs":["Sighting DetailsI shoot some Video on June 29th at 9:30PM of 2 Flying Rods and with the movement of the second on the footage I may be the first to have filmed them. There are 2 Rods in the Video the first comes up from the ground and bends around the phone line above. The second is the best it comes in from a horiziontal pattern then in front of the camera stops and the backside of it swings into a different position then takes the lead in that other direction, amazing! I was filming trying to capture lightning from a storm to the west of my home and this is what I caught. The camera was a Sony Handycam HCR-DVD105 using manual focus and Super Nightshot Plus mounted on a tripod. I just bought the camera that day (not kidding)and This was my first Video and I was lucky enough to capture this footage. The Video has to be slowed down to see the backend swing into that next position. Hopefully I have discovered maybe a new entity or a Real Rod and this clearly shows its not an insect. I saved the original Mini DVD in case someone wants to examine it."]}