{"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Object Shape":"Sphere","Source":"MUFON","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Summary":"Round Ball Orange and Red with Yellow Like Current all over it","Object Features":"Wings","Date of the Event":"07/01/1980 12:00 UTC","Viewing Distance":"21-100 Feet","Region":"Kentucky","Tags":"City","Longitude":"-84.268478","files":["/var/www/straped/mufon/html2text/50244.html.txt","/var/www/straped/mufon/org/50244.html"],"Log Number":"US-08282013-0023","map":"<A HREF = \"http://maps.google.com/maps?q=37.846043,+-84.268478(50244)&iwloc=A&hl=en\"> mufon case (50244) map </A>","City":"Undisclosed","Country":"United States","trends":[],"Case Number":"50244","Disposition":"Unresolved","Date Submitted":"08/28/2013 08:58 UTC","Latitude":"37.846043","divs":["Sighting DetailsI was standing with my Cousin by the road in our neighborhood. To tell you the truth i dont remember how we got there or why we were standing there. then i heard a sound. like current static pulsating sound. i think we both looked up at the same time. it was almost directly on top of us above us at least 50 feet. just above the power lines. it was moving slow and the sound of current i not only saw but i could see the current flowing thru it. it appeared to be flat from where we were standing but as it moved away i could tell it was ball shaped. as it slowly moved over us it continued a path toward the mountain. when it reached the top of the mountain. it seemed to turn and it appeared to change shape. i observed wing like shapes on it as it turned as soon as it turned it took off like a rocket and dissappeared. there were other people besides me and my cousin. i remember seeing and hearing a few people standing on thier porch on the mountain side behind my house. It has been many years since i seen this but it is just like yesterday in my mind. i will never forget what i saw and never believed in UFO until that evening. Whatever that was it was not from this earth. I will never for it. I was stunned felt overwhlmed but also so curious and could not take my eyes off that object. it was so close to us"]}