{"Object Shape":"Fireball, Star-like","Object Features":"None, Unknown","Latitude":"33.76455","City":"North Tustin","Date Submitted":"08/28/2013 08:37 UTC","Viewing Distance":"Over One Mile","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.76455,+-117.793022(50242)&iwloc=A&hl=en\"> mufon case (50242) map </A>","Tags":"City","Summary":"orange glowing orbs hovering north east with a flare-like object dropping out of the orb.","files":["/var/www/straped/mufon/html2text/50242.html.txt","/var/www/straped/mufon/org/50242.html"],"Log Number":"US-08282013-0021","Region":"California","Disposition":"Unresolved","Date of the Event":"08/28/2013 01:15 UTC","Source":"MUFON","trends":["There has been one other sighting in North Tustin","There was one other sighting in North Tustin on or around August 28th 2013"],"Sighting Duration":"00:15:00","Case Number":"50242","divs":["Sighting DetailsIt was approximately 1:00 a.m. on Tuesday, August 28, 2013 in North Tustin, Orange County, California. I was sitting on my second floor outside balcony facing North. I looked to the North East and noticed three hovering orange glowing orbs. I thought that the orbs were either a ufo or chinese lanterns. I went inside to get my husband to have another witness and when we went back outside the three orange orbs slowly decended in a Southern direction. We went back in the house to get our son and his two friends, who are 19 and 20 years old. We all went outside and stood in the front yard and watched the orbs hover, while getting dimmer and brighter sporadically for approximately five minutes. At one point, one of the orbs ejected what looked like a flare-like object. My husband doesn't know if it flew away in a hortizontal direction or if it just disintegrated. The 3 orbs all slowly disappeared. The whole episode lasted about 15 minutes. I felt calm and scientific. I wanted more witnesses so I went and got my family. The boys were nervous, excited and a little scared. They thought it was cool. My husband stated that it was the first time that he actually felt like he saw a ufo. He was astonished and curious."],"Object Flight Path":"Hovering then path,Path then hovering","Longitude":"-117.793022","Weather Factors":"Unknown"}