{"Region":"Ohio","divs":["Sighting DetailsOutside my windows, I noticed a rather tight triangle formation of 3 red lights in the east. I have been to, at least, 2 dozen airshows so it was quite unusual for me to see a tight triangle formation of aircraft. So, I went outside to see what type of airplane was flying, but I did not hear a sound. The clouds were low and with a wind blowing in a NE direction about 10 mph ( gusts up to 22 according to my cell phone. I sat and watched the triangle formation of lights become a string when all of a sudden the first light faded out. Now, it could have been the low clouds. At least that is what my mind told me. However, the next two lights also faded out at different spots in the sky. So I thought \"that was weird!\" when I looked back to the east, I saw more of these red dots in the sky. 3... 4... 5... The numbers were growing. They all were traveling East to Northwest. On average, it would take about a 2 minutes for this lights to go from the horizon to over head to out of sight. I was actually, able to go into the house, grab my camera, tri-pod and my binoculars. However, the pictures that I took are still blurry. When I viewed the objects thru my binoculars, they appeared to be red rings. All in all, counted at least 24 objects in the sky. All of which were dead quite. In all, this viewing lasted about 20 minutes."],"Object Shape":"Circle, Fireball, Sphere","Date Submitted":"08/28/2013 10:11 UTC","Disposition":"Unresolved","Log Number":"US-08282013-0025","Summary":"a line of 24 flying objects heading from East to West","Country":"United States","files":["/var/www/straped/mufon/html2text/50247.html.txt","/var/www/straped/mufon/more/50247_submitter_file1__P1080680.JPG","/var/www/straped/mufon/more/50247_submitter_file2__P1080682.JPG","/var/www/straped/mufon/more/50247_submitter_file3__IMG20130828212819714.jpg","/var/www/straped/mufon/more/50247_submitter_file4__IMG20130828212823829.jpg","/var/www/straped/mufon/org/50247.html"],"Object Flight Path":"Path with directional change","Case Number":"50247","City":"Sidney","Date of the Event":"08/28/2013 09:30 UTC","Longitude":"-84.177996","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=40.293803,+-84.177996(50247)&iwloc=A&hl=en\"> mufon case (50247) map </A>","trends":["There have been 3 other sightings in Sidney","There were no other sightings in Sidney on or around August 28th 2013","This sighting has never been favorited.",""],"Object Features":"Unknown","Latitude":"40.293803","Tags":"City","Source":"MUFON"}