{"Disposition":"Unresolved","trends":["There have been 5 other sightings in St. Louis","There were no other sightings in St. Louis on or around August 28th 2013"],"Case Number":"50258","Object Flight Path":"Stationary","Date Submitted":"08/29/2013 02:23 UTC","Viewing Distance":"Over One Mile","divs":["Sighting DetailsI picked up my friend at St. Louis's Lambert airport last night, 28.Aug.2013. She arrived on Southwest 636 from Detroit at 8:00pm. I let her drive and right as we were leaving the airport heading towards I-70 west, under a dark-blue sky that wasn't showing any stars yet, I noticed a bright white star-like light southwest of my field of vision. I asked my friend \"Hey, does that light look like a star to you?\", as I pointed towrds the light. She said \"no, it's rather large -- what the heck kind of plane is that taking off?!\" I looked to the right of the light I was looking at attentively, and I saw under the darkening sky a fighter plane taking off from the airport's tarmac, racing up and towards the left, heading soutwest towards the bright light in the sky, followed by another fighter plane. It was dark, I'm guessing these were two F-15s. No flood lights in either fighter, just red flashing lights under their bellies, both F-15s heading towards the light in the sky fast. I tried hard not to lose track of the fighter planes or their flashing lights as they disappeared in the distance, always heading towards the light in the sky, but I couldn't follow them for more than a few seconds. First I stopped hearing their roaring engines, then I stopped seeing their bodies, and lastly their flashing red lights. Gone, just like that. My friend takes I-70 west towards Lake Saint Louis, past the bridge over the Missouri river. For about ten minutes after the fighter planes I kept my eyes trained on the bright light in the sky until it was no longer southwest of my field of vision but rather to the south, and lastly southeast of our moving car's vantage point. The light never moved from the original position where it was as we were leaving the airport and saw the scrambling F-15s. I lost track of the light in the sky when my friend exited I-70 to look for the address where she was going to pick up her dog."],"Object Shape":"Sphere, Star-like","Log Number":"US-08292013-0005","Summary":"Large white bright star-like light.","Object Features":"Unknown","Date of the Event":"08/28/2013 08:10 UTC","Country":"United States","Sighting Duration":"00:15:00","Source":"MUFON","Tags":"City","Latitude":"38.741822","Longitude":"-90.368586","map":"<A HREF = \"http://maps.google.com/maps?q=38.741822,+-90.368586(50258)&iwloc=A&hl=en\"> mufon case (50258) map </A>","files":["/var/www/straped/mufon/html2text/50258.html.txt","/var/www/straped/mufon/org/50258.html"],"Weather Factors":"Unknown","Region":"Missouri","City":"St. Louis"}