{"trends":["There have been 13 other sightings in Billings","There were no other sightings in Billings on or around August 28th 2013"],"Longitude":"-108.547639","Tags":"City","Viewing Distance":"Over One Mile","City":"Billings","Log Number":"US-08292013-0001","Object Features":"None","Weather Factors":"Unknown","Object Flight Path":"Path with directional change,Path then hovering","Case Number":"50254","divs":["sighting detailsi came back from the airport at 9:17 pm mst. i glanced up and saw an object the color of a campfire. circular in size and bright, i initially thought it was an aircraft at altitude on fire. however the object stopped, hovered, and changed direction several times illustrating a very erratic flight profile. the object was initially traveling southeast and eventually changed its direction to due east disappearing into a cloud. at the time of the sighting visibility was 10 miles, wind 310 at 3, few clouds at 7,500, scattered at 12,500, temp. 23 c, dew point 12 c, density altitude 5400, and altimeter 3002. consequently, based on this aviation weather report of 0339 zulu for billings, mt, i would say the object upon initial sighting was at roughly 5000 agl and climbing eventually disappearing into scattered cumulus at 12,000 agl. the object was the size of my thumbnail at first sighting and had traveled high enough\\far enough away, that at last sighting, it was approximately twice as big as a star. total sighting time was approximately 60 seconds. one photo was taken with my iphone which i put on the computer, enlarged, and then took another photo of the enlargement which i submitted."],"Sighting Duration":"00:01:00","files":["/var/www/straped/mufon/html2text/50254.html.txt","/var/www/straped/mufon/org/50254.html"],"Region":"Montana","map":"<A HREF = \"http://maps.google.com/maps?q=45.783671,+-108.547639(50254)&iwloc=A&hl=en\"> mufon case (50254) map </A>","Date Submitted":"08/29/2013 12:19 UTC","Object Shape":"Fireball","Source":"MUFON","Disposition":"Unresolved","Latitude":"45.783671","Country":"United States","Summary":"Bright, glowing object-appeared to be on fire.","Date of the Event":"08/28/2013 09:17 UTC"}