{"Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Circle","Longitude":"-70.684859","Tags":"City","files":["/var/www/straped/mufon/html2text/50250.html.txt","/var/www/straped/mufon/org/50250.html"],"divs":["Sighting DetailsOn Friday August 23 I was called to attention of two objects hovering low in the sky. It resembled two black balloons, hovering 200 feet up. It was clear with some clouds and sunset was still somewhat off with not any breeze at ground level.i felt sure I could give it a positive ID but had trouble with the way it maintained a perfect fixed point in hover. That fact became more puzzling as time went on. Ten, twenty, thirty then forty minutes elapsed without the slightest waver not only in respect to the ground but relative to the two objects being observed. It's stubborn motionlessness frustrated me. I called several people to confirm the sighting which they did from different points of view that many others witnessed at my location. One contact managed to observe it for about five minutes before it went on a very slow move. He was successful in chasing it until he got within 300 to 400 feet of ground zero. Zero being the spot that the main object would be directly above. He gave a guess of 200 feet off the ground and moving a running mans pace horizontally. Descending to 100 feet before losing line of sight due to tree tops. It was black to the absolute degree. Perfectly circular, with no surface feature. It felt hesitant to describe it to me this way but a gave an analogy. He said it was if their was a sharp and perfectly circular black hole was punched into the blue sky that made no sound. The second circle was the same description but smaller trailing behind the first by 30-50 feet and bobbling. A small black plane was spotted at 7:30 at 500 feet approx and traveling in the direction of the sighting. And again circling which was confirmed by another witness from different location but maintaing near time cell phone contact.in addition , I observed two helicopters hovering over the location where object was last seen before moving out of my line of sight. This was five hours later at 1:00 am. Three reasons that could explain away an over active imagination is follows1). Local coast guard conducting business however you rarely observe a CG chopper unless in transit to harbor to or from harbor station \"which is not at the Babson resevoir and I never saw two coastlines hovering together. No search lights and maintaing approx separation of 200 feet. 2). Medical evac from omelet fields for Boston hospital. Not uncommon at all to hear and see civil medivac over this neighborhood especially because of close proximity to pickup point. Being a resident of this neighborhood for 40 years, this nights helicopter activity was startling out of place. Medivac a always come in low loud and do not circle or hover with complacency due to the obvious nature of life or death urgency .3). It could be a camera crew flight for footage of the Gloucester based tv series \"wicked tuna\"."],"Source":"MUFON","City":"Gloucester","Date of the Event":"08/23/2013 06:30 UTC","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Log Number":"US-08282013-0029","Latitude":"42.623481","map":"<A HREF = \"http://maps.google.com/maps?q=42.623481,+-70.684859(50250)&iwloc=A&hl=en\"> mufon case (50250) map </A>","Object Features":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"08/28/2013 10:47 UTC","Country":"United States","trends":["There have been 5 other sightings in Gloucester","There were no other sightings in Gloucester on or around August 23rd 2013"],"Region":"Massachusetts","Disposition":"Unresolved","Case Number":"50250","Weather Factors":"Unknown","Summary":"Witnessed during 50 minutes in daylight by approximately 40 people from several view points. From a distance it appeared to be two black circular objects at perfect hover then moved and descended. At close up it was described as a perfect circle, bLack"}