{"Object Flight Path":"Stationary","Source":"MUFON","divs":["sighting detailsaround 10:20 p.m. i happened to be on the roof of a local college for an observational astronomy class and we were observing the sky through our telescopes. all of a sudden, one of my classmates sees something unusual in the south\\southwestern part of the sky and we decided to take a closer look at it. when we got the object in the field of view and focused on it, we saw quite an amazing and unusual object. this was no star! i looked at it for a few minutes through the eyepiece and i could see a sharp array of colorful lights flashing and some that were stationary in this disk-like object. it appeared as a circle or disk of green, red, yellow, and orange lights which flashed like a disco ball that didn't rotate. from a naked eye perspective this object appears just like any other star in the sky, the only reason we looked at was the color was redder than most stars and it was about as bright as the brightest stars. in the eyepiece this object was a little larger than a normal star, it had to be an enormous distance out in the sky maybe even above the atmosphere of the earth. we had to leave around 10:45 p.m. but the object was still there in the same part of the sky and didn't move much. i asked my astronomy professor to look at it and he said it was not a star and dismissed it as a blimp or helicopter. i don't think he would actually believe it was something otherwise but we knew better. again half of the object was giving off very sharp rays of lights in sequence and the other half were fuzzy and stationary. it must have been giving off a lot of energy at that great distance possibly out over the pacific ocean."],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Shape":"Flash, Saturn-like, Star-like","Country":"United States","Summary":"Astronomy Class Sees Colorful Disco Light Object In Sky - Not A Star!!!","City":"Mission Viejo","map":"<A HREF = \"http://maps.google.com/maps?q=33.601523,+-117.670585(50260)&iwloc=A&hl=en\"> mufon case (50260) map </A>","Case Number":"50260","files":["/var/www/straped/mufon/html2text/50260.html.txt","/var/www/straped/mufon/org/50260.html"],"Viewing Distance":"Over One Mile","Date Submitted":"08/29/2013 03:25 UTC","Latitude":"33.601523","Object Features":"Unknown","Longitude":"-117.670585","Disposition":"Unresolved","Region":"California","Tags":"City","Log Number":"US-08292013-0007","trends":["There have been 10 other sightings in Mission Viejo","There were no other sightings in Mission Viejo on or around August 28th 2013"],"Date of the Event":"08/28/2013 10:20 UTC"}