{"City":"Setauket- East Setauket","Object Flight Path":"Straight-line path","Log Number":"US-08292013-0010","Country":"United States","files":["/var/www/straped/mufon/html2text/50263.html.txt","/var/www/straped/mufon/org/50263.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.929376,+-73.10255(50263)&iwloc=A&hl=en\"> mufon case (50263) map </A>","Object Shape":"Circle","Region":"New York","Date Submitted":"08/29/2013 07:47 UTC","Case Number":"50263","Tags":"City","Longitude":"-73.10255","Sighting Duration":"Undisclosed","Summary":"I observed a red orb of unknown origin pass across the sky from my right to left.","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsI was attending a wedding reception in East Seatauket, NY on Sunday August 25, 2013. The time was approximately 9 pm Eastern. At the time of the sighting I was outside, it was very dark with little lighting beyond the deck area. There is a small airport to the east of the sighting location. The flight path runs from north to south and one can observe the planes on part of their approach approximately a mile or so away. They were clearly not the source of the light that I observed. I observed a red ball of light approaching from the east, the direction of the airport. I and some of the other people there expressed the thought that it was a plane. While the others turned away I continued to watch as the object, about the size of a dime from my vantage point, as it approached and passed by. It was about 500 or so feet in the air, no sound (if it was a plane I was close enough that I would have heard it), no pulsating or strobe like effect. The flight path was a straight line. There was not trail or debris coming from the object. It was, all in all, a rather non-nonchalant sighting. Just another red object of unknown origin passing by in the night sky. I continued to watch it as it disappeared in the distance. I seemed to be the only one interested in what it was and where it came from. I was not intoxicated at the time."],"Weather Factors":"Unknown","trends":["There have been no other sightings in Setauket- East Setauket","This sighting has never been favorited."],"Date of the Event":"08/25/2013 12:00 UTC","Source":"MUFON","Latitude":"40.929376","Object Features":"None","Disposition":"Unresolved"}