{"Source":"MUFON","City":"Portslade","divs":["Sighting Details1.Watering the garden. 2.it caught my eye. 3. It was a UFO due to its maneuvering across the sky. 4. The bright white circle (orb)of light (no haze or distortion)appeared in the SE sky At incredible speed moved to another location in the sky. Color changes took place, then at great speed moved to another position paused for a few seconds, shot off to another location, paused (1 second).Then shot off to another position in the sky (to change colors). Moved again (possibly in 30 degree angle to its original path).It then paused for a few more seconds in the sky, moved very fast to another position, pausing for a few seconds,again at 30 degrees approx. It then shot across the sky, NW direction and disappeared in a split second. I have flying experience, I was in Gulf War 1. This was not a helicopter or an aircraft. Its movements and speed were not of this world. 5. I'm watching a UFO again. The zig zag actions of its flight path made me move about looking up (with a stiff neck). I felt it was trying to be noticed. 6. It shot off across the sky in a NW direction so to be out of sight. I will be informing our local UFO group(12 in number), at the next meeting in September. Keep up the good work guys, I am on your mailing list. Best Regards Alan"],"Log Number":"GB-08292013-0012","files":["/var/www/straped/mufon/html2text/50265.html.txt","/var/www/straped/mufon/org/50265.html"],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","trends":["There have been no other sightings in Portslade","This sighting has never been favorited."],"Weather Factors":"Unknown","Date of the Event":"08/22/2013 10:00 UTC","Longitude":"-0.211289","Region":"","Case Number":"50265","Tags":"City","Object Features":"Other","Summary":"Larger than stars,a bright disc of changing coloured light, stationary then flying to another position to remain stationary. Pausing a few seconds.","Latitude":"50.8366","Object Shape":"Circle, Disc, Sphere","Viewing Distance":"Unknown","Date Submitted":"08/29/2013 08:50 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=50.8366,+-0.211289(50265)&iwloc=A&hl=en\"> mufon case (50265) map </A>","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Country":"United Kingdom"}