{"Viewing Distance":"Over One Mile","Date of the Event":"08/28/2013 12:00 UTC","Disposition":"Unresolved","Source":"MUFON","Tags":"City","Longitude":"-80.246666","Case Number":"50264","Summary":"Bright light (star like) object hovering for the past month, and then disappears*","map":"<A HREF = \"http://maps.google.com/maps?q=25.756743,+-80.246666(50264)&iwloc=A&hl=en\"> mufon case (50264) map </A>","trends":["There have been 97 other sightings in Miami","There were no other sightings in Miami on or around August 28th 2013"],"Region":"Florida","Weather Factors":"Unknown","divs":["sighting detailsfor the past month i been observing for the past month a star like (bright object) that at first i was not sure if it was a ufo or a star. i live in a condo and usually go out briefly for some air, the first time i saw this light it was hovering in the sky (above 500 ft) by the miami airport (i have a good sense of direction and i could tell it was by the miami intl airport)at a high altitude. i thought it was a plane descending in the distance but after 10 minutes the light remain there, the sky was clear and it was about 8:30pm at aprox 8:50pm i noticed that the light had changed direction so i knew it was not a star. this event has then repeated for the past month, i am going to say since early august of 2013, and now the light has been in a sw position in what it seems the same direction. the event is always the same, a bright object in the distance (at first it looks like a plane, since we have heavy traffic in the miami metropolitan area) but it isn't. last night 8\\29 at about 9:00pm i saw something that i have never witness,,,,i saw the light again or object, i went back in to my apartment again and came out. i kept looking at this object and it looked as if the light disappear for a few seconds, then the light reappeared again only to disappear a few moments later. the best example i could describe is as if you were watching a bright object at a distance and in an instance you see it disappear before your eyes, like if something was sipping it. this event made me realize and gave provided me evidence that what i been watching for the past weeks is not a star. i will try taking a picture of it this time."],"Object Features":"Unknown","Sighting Duration":"Undisclosed","Object Shape":"Other","Country":"United States","Object Flight Path":"Stationary","Date Submitted":"08/29/2013 08:02 UTC","files":["/var/www/straped/mufon/html2text/50264.html.txt","/var/www/straped/mufon/org/50264.html"],"City":"Miami","Latitude":"25.756743","Log Number":"US-08292013-0011"}