{"Object Flight Path":"Straight-line path","Viewing Distance":"Over 1 Mile, Unknown","Latitude":"38.817568","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/50269.html.txt","/var/www/straped/mufon/org/50269.html"],"Date of the Event":"08/28/2013 12:00 UTC","Tags":"City","divs":["sighting detailsi was outside around 9 pm taking care of dog duties. i looked up in the western sky and was noticing the big dipper and arcturus when movement in the sky just left of arcturus caught my attention. it was a small, dim, white, semi-transparent, trapezoid shaped object that moved quickly across the sky from the west to the southeast in about 5 seconds. the object faded off into the distance as i lost sight of it. the shape of the object was a trapezoid. the long sides were oriented vertical, with the longest side being the leading edge of the object. the leading edge appeared brighter than the rest of the object. the object was dimly lit, about as bright as an average star. the color was mottled white, whereby the surface of the object appeared to faintly sparkle or twinkle (similar to the twinkling of stars)randomly across the object, giving it a mottled or semi-transparent appearance. it had no other colors or fixed exterior lights and made no sound (as aircraft would). it was about 60 degrees above the horizon. whatever it was, it was way out there and moved fast. it took about 5 seconds to go from a west to southeast direction. it made a straight line path and maintained the same elevation across the sky. it left\\had no trail. there were no aircraft in the sky at that time. it was a clear night."],"Region":"Missouri","Object Shape":"Other","Object Features":"None","Case Number":"50269","map":"<A HREF = \"http://maps.google.com/maps?q=38.817568,+-90.695978(50269)&iwloc=A&hl=en\"> mufon case (50269) map </A>","Log Number":"US-08292013-0016","City":"O'Fallon","Weather Factors":"Unknown","trends":["There have been 15 other sightings in O'Fallon","There were no other sightings in O'Fallon on or around August 28th 2013"],"Summary":"small dim white/semi-transparent trapezoid shaped object moved quickly across sky from west to southeast then faded off into distance","Country":"United States","Longitude":"-90.695978","Date Submitted":"08/29/2013 01:46 UTC","Sighting Duration":"Undisclosed","Source":"MUFON"}