{"Date Submitted":"08/29/2013 05:18 UTC","Object Flight Path":"Path with directional change","Region":"Texas","Date of the Event":"08/28/2013 08:15 UTC","Sighting Duration":"04:00:00","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/50276.html.txt","/var/www/straped/mufon/org/50276.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.878686,+-97.215504(50276)&iwloc=A&hl=en\"> mufon case (50276) map </A>","Tags":"City","trends":["There have been 128 other sightings in Fort Worth","There were no other sightings in Fort Worth on or around August 28th 2013"],"Weather Factors":"Unknown","Case Number":"50276","Log Number":"US-08292013-0022","Latitude":"32.878686","Disposition":"Unresolved","Country":"United States","City":"Fort Worth","Viewing Distance":"Over One Mile","divs":["Sighting DetailsI am a sky watcher and somewhat familiar with most objects in our skies. This object first started appearing in the north about 6 months ago or more. When it appears{after dark}usually around 7-8pm CST. It shows up first as a bright white Orb. Then proceeds to start cycling thru different colors. I thought this was a strange star for a very long time because it reliably remains in the same place sometimes night after night. August 29th 2013 for the first time I observed it move location and also appear to release a smaller orb then reabsorb it. It did not move far just went behind some trees. I went out and checked the new location and it was still same object doing the same light show. It makes no sounds but it very noticeable in the sky. I lost sight only because I had to go to sleep. It was still in the sky when I went to sleep around 11:00pm. Since it shows up a lot my next sighting I will try a video camera with a zoom lens and document this. When I get that I will send this along, so it can be analyzed. Thanks for your help with this. I really would like to know what this could be, man made?, a weird star that moves?, Planet, or a genuine UFO (unknown)."],"Longitude":"-97.215504","Source":"MUFON","Object Features":"None","Summary":"A reliable appearing Glowing ORB - Changes from Red, Blue, Green, Yellow, White"}