{"Latitude":"39.953243","Summary":"Driving, headed west. Light appears above, very bright. Continues west at an incredible speed until light dims to black.","Disposition":"Unresolved","Object Features":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/50279.html.txt","/var/www/straped/mufon/org/50279.html"],"Log Number":"US-08292013-0025","divs":["Sighting DetailsI was headed home from my brothers apartment. I decided to take back roads, because I thought it be would be a little faster than main roads, less cops. On my way I hit a traffic light that wouldn't turn green for me. After 3 light cycles I turned right and then a U-turn and another right to continue straight. I was blaring my music because I had recently upgraded. About 5 minutes after the traffic light, I was on Kissel Road. I couldn't remember if there was a stop sign at Hunt-club and Kissel. When I approached the intersection I slowed expecting a stop sign. After I didn't see one I started accelerating again and then a light appeared above. **Very bright light that seemed to hover for a split second. It was already dark with little cloud coverage. The light appeared, like it spawned, then took off heading west with a slight curve in its trajectory (south). It was out of sight just as fast as it appeared. I have friends that have seen UFO's but I have never seen one until now. Right when I saw it I thought, \"that's it.\" I finally have seen one. I was flustered and got a little teary eyed. Not sure why but I know I didn't say anything. It went off into the sky and foliage surrounded my car once again. But I started to second guess myself, trying to pin other things, but NOTHING moves that fast. I felt like it was almost destiny for me to have seen it. There was a little window in the tree coverage to have seen it, and i did. The street light and me taking the back roads would have all changed my location."],"Tags":"City","Source":"MUFON","City":"Zionsville","Country":"United States","Case Number":"50279","Object Flight Path":"Path with directional change","Longitude":"-86.257317","trends":["There have been 4 other sightings in Zionsville","There were no other sightings in Zionsville on or around August 28th 2013"],"Date Submitted":"08/29/2013 06:08 UTC","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","Date of the Event":"08/28/2013 09:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.953243,+-86.257317(50279)&iwloc=A&hl=en\"> mufon case (50279) map </A>","Object Shape":"Sphere","Region":"Indiana"}