{"Viewing Distance":"Over One Mile","Case Number":"50303","City":"Cascadia","Disposition":"Unresolved","Region":"Oregon","Latitude":"44.412541","Weather Factors":"Unknown","Object Flight Path":"Path then hovering","Country":"United States","Tags":"City","trends":["There have been no other sightings in Cascadia","This sighting has never been favorited."],"Log Number":"US-08312013-0002","divs":["Sighting DetailsOn clear nights I like to go out and star gaze as we are about the 2000 foot level and we are above much of the haze that plagues the valley. This event has occurred over many nights, it was the pulsating effect that caught my attention, it would at roughly 11:00pm be initially spotted to the west or the north west (close to where I can see the big dipper) and between 3 and 4 am end up to the north east just above the horizon. At first I assumed it to be an aircraft as it was varied as to location when initially viewed and many nights wouldn't appear at all. but when viewed thru a scope or telescope it appeared to pulsate with blue,green and red. it was difficult to determine its shape due to this pulsating effect and it seemed to have a halo around it as well. on the nights it appeared it would be at about 30 degrees off of horizon and over 4-5 hours move till it was to the northeast, just above the horizon and that's where it would end up each time. Just to make sure I was not seeing things I had the Wife come out and view this oddity and she agreed it was no aircraft. Just before the break of dawn it would disappear"],"Object Features":"Unknown","Summary":"A pulsating object that started to the west and would end up to the north east just above horizon","Object Shape":"Unknown","Date of the Event":"07/12/2013 11:22 UTC","files":["/var/www/straped/mufon/html2text/50303.html.txt","/var/www/straped/mufon/org/50303.html"],"Date Submitted":"08/31/2013 01:06 UTC","Longitude":"-122.510728","map":"<A HREF = \"http://maps.google.com/maps?q=44.412541,+-122.510728(50303)&iwloc=A&hl=en\"> mufon case (50303) map </A>","Sighting Duration":"Undisclosed","Source":"MUFON"}