{"Object Flight Path":"Stationary","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Case Number":"50313","Latitude":"50.171311","trends":["There have been no other sightings in Selb","This sighting has been favorited 1 time."],"Region":"Bavaria","Disposition":"Unresolved","Date Submitted":"08/31/2013 01:51 UTC","Tags":"City","divs":["Sighting DetailsI was having a sleepover with some of my friends and myself and one of my friends looked out of the window towards the back fields all the way out to the power station. Thats when I first noticed it. When I first saw the object I thought it was some hunters or farmers searching their field and shining their lights up into the sky. There were at least 7 objects or beams which seemed to come up from the ground flashing. There was no proper object to be seen just lights. They seemed to flash in a random order only using the colours White, Green and Red. I was really scared when I knew it couldn't be farmers or hunters because they would need an enormous amount of power to cast the beams up into the sky like that especially because the radius of the light beams was more than 20ft. I felt really cold and worried that something wrong was happening in front of me. This was the same situation from my friend as well. The lights just suddenly stopped after 10 seconds of viewing them and the light dissipated into the sky. My personal opinion: The lights were no more than 500yards from Eggbrough power station so I think that they were using power from the power station to send a message or beam into the sky to alert or notify some other being."],"Sighting Duration":"Undisclosed","City":"Selb","Summary":"Beams coming up from the ground flashing upwards.","Source":"MUFON","Longitude":"12.133932","Object Shape":"Circle, Flash","Log Number":"GB-08312013-0011","map":"<A HREF = \"http://maps.google.com/maps?q=50.171311,+12.133932(50313)&iwloc=A&hl=en\"> mufon case (50313) map </A>","files":["/var/www/straped/mufon/html2text/50313.html.txt","/var/www/straped/mufon/org/50313.html"],"Object Features":"None","Country":"Germany","Date of the Event":"05/27/2011 01:25 UTC"}