{"files":["/var/www/straped/mufon/html2text/50316.html.txt","/var/www/straped/mufon/org/50316.html"],"Country":"United States","City":"Denton","Latitude":"38.884558","Date Submitted":"08/31/2013 06:36 UTC","Log Number":"US-08312013-0013","Object Shape":"Circle, Oval, Sphere","Object Features":"None","Sighting Duration":"00:00:30","Tags":"City","Object Flight Path":"Straight-line path","Source":"MUFON","Date of the Event":"08/07/2013 11:20 UTC","Longitude":"-75.827156","Weather Factors":"Unknown","Disposition":"Unresolved","Case Number":"50316","Region":"Maryland","divs":["Sighting Details I was driving home from work on 328 and I noticed a large blue light over the field to the right of me. The light was blinking uniformly and very hard to miss. I noticed it was getting larger and deduced that it was moving towards me pretty fast. I stopped my car on the side of the road out of curiosity. Within seconds, the light was passing to the right of me, still blinking. I got a pretty good look at what seemed to by just a blue light. I know it was dark, but I couldn't see anything holding it there or any other physical object around it or attached to it. It seemed to be about the size of a tire, and less than 500 feet in the air. It was dark though, so I could be incorrect. It was definitely pretty low regardless. The strangest part was that there was no sound. All of my windows were down, and I felt a breeze come through my car as it passed, but it was dead silent throughout the whole encounter. I looked in my rear view mirrors after it passed, but couldn't see anything. In hindsight, I should have gotten out of the car. I would have taken a picture, but I was more focused on figuring out what was happening at the time. I just thought it was strange, but after hearing about other strange events on the very same night in Florida, I figured there was a smaller chance that it was a coincidence. This was in Caroline County, Maryland on August 7, 2013, at around 11:20 pm."],"Summary":"A large blinking light sped by me without making a sound.","Viewing Distance":"101-500 Feet","trends":["There have been no other sightings in Denton","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=38.884558,+-75.827156(50316)&iwloc=A&hl=en\"> mufon case (50316) map </A>"}