{"Object Flight Path":"Path with directional change","Object Features":"Other","Object Shape":"Other","Date Submitted":"08/31/2013 08:30 UTC","divs":["Sighting DetailsI witnessed and photographed some of these while driving and one at night while doing star photography. the first ones I photographed march 8 consisted of 8 different objects in 4 different areas but all were in the same vicinity the first two consists of what looks like exhaust rings except one looks stationary and the other ring white in color shows a trail behind and in front of it.the next objects were sited to my northwest and they were heading east southeast with a corkscrew vapor trail behind them I enlarged the photos to maxim and cold not see any solid structure except that they were extremely bright.the third object was the largest and it was at high altitude and I photographed it with a canon eos t3 digital camera with a 55 mm lens which makes it all the more amazing to see the size of the object at that altitude. lastly from that day I have what are the most perplexing photos because these are at ground or near ground photos and they consist of yellow orange orbs that appear in 3 different photos in trees and in front of a mountain and lastly we have what can be described as gaseous clouds all near the ground or just a few feet above. the second sighting took place app. two weeks later when I photographed the same two brightly lit square objects below a storm front that covered the valley only this time the light that came off of them was bent downward which I thought you couldn`t do.i then photographed these objects towards the end of june at approximately 11 pm coming again from the northwest.lastly the large craft that I photographed on march 8 2013 I photographed in july this time with a 300mm lens and it looks the same as the first one but a lot higher in elevation as I was pointing the camera almost straight up."],"Date of the Event":"03/08/2013 12:45 UTC","Country":"Canada","map":"<A HREF = \"http://maps.google.com/maps?q=49.16675,+-121.947757(50318)&iwloc=A&hl=en\"> mufon case (50318) map </A>","Longitude":"-121.947757","Sighting Duration":"Undisclosed","Summary":"i have photographs taken between march 8 and july 8","Source":"MUFON","Log Number":"CA-08312013-0014","files":["/var/www/straped/mufon/html2text/50318.html.txt","/var/www/straped/mufon/org/50318.html"],"Tags":"City","Region":"British Columbia","Latitude":"49.16675","City":"Chilliwack","trends":["There have been 9 other sightings in Chilliwack","There was one other sighting in Chilliwack on or around March 8th 2013"],"Disposition":"Unresolved","Viewing Distance":"Unknown","Case Number":"50318","Weather Factors":"Unknown"}