{"map":"<A HREF = \"http://maps.google.com/maps?q=27.252231,+-80.424445(50310)&iwloc=A&hl=en\"> mufon case (50310) map </A>","files":["/var/www/straped/mufon/html2text/50310.html.txt","/var/www/straped/mufon/org/50310.html"],"Weather Factors":"Unknown","Latitude":"27.252231","trends":["There have been 10 other sightings in Port St. Lucie","There were 3 other sightings in Port St. Lucie on or around August 30th 2013"],"Viewing Distance":"Over One Mile","Date Submitted":"08/31/2013 08:21 UTC","Log Number":"US-08312013-0008","Sighting Duration":"Undisclosed","Date of the Event":"08/30/2013 09:10 UTC","divs":["Sighting DetailsOn August 29th, we witnessed a UFO in our area at 9:15 at night. (See previous report.) At 9:10, last night, we (Husband, myself and 2 Children) went out to the back patio and in the same area, at the same altitude, there was the same kind of UFO as we saw the night before. It began moving up, down, left right, in one general area. Going up and below the tree line. We found this really hard to believe because of the previous night's experience. Same object golden, orangish colored ball of light. Zigzagging flight pattern. Moving almost effortlessly. After observing it for about 10 minutes, it lowered down and traveled S-SW until we could no longer see it. About 20 minutes later, we saw it again, in the SW sky, but very high up in the air. We watched it travel a vast length of the sky before disappearing after a minute or less. About 20 minutes after that, we saw a slow moving aircraft approaching our house from the North. As it traveled over our heads, it had a low rumbling engine sound and we saw that it had 3 bright white circular lights on the underneath, forming a triangle with a red bright light in the center. The lights were signaling in a beaconish sort of pattern. White would blink and then the red. We have never seen anything like that either, but suspected that it was a man-made craft of sorts. Certainly nothing like the fiery ball of light we had witnessed two nights in a row. But the odds of seeing this recon-like craft about 40 minutes after our 2nd night in a row of a UFO sighting in the same spot, at the same time, was pretty strange, we must admit. We will be looking in the same area in the low sky tonight at 9:00 to see if this ball of light appears again. Honestly, the strangest thing we have ever seen."],"Region":"Florida","Case Number":"50310","Object Features":"None","Tags":"City","Summary":"FIery Colored Ball Agile Light","Longitude":"-80.424445","Object Flight Path":"Stationary,Hovering then path","Object Shape":"Fireball, Sphere, Star-like","Country":"United States","Disposition":"Unresolved","Source":"MUFON","City":"Port St. Lucie"}