{"Latitude":"51.238742","Object Shape":"Unknown","trends":["There has been one other sighting in Dorking","There were no other sightings in Dorking on or around August 29th 2013"],"Region":"England","divs":["Sighting DetailsIt was around 10:15pm August 29th 2013, In Dorking Surrey looking in night sky towards Boxhill, Brockham, Redhill. i was walking across a playing field where there was very little street lighting. when i noticed up ahead of me in the night sky 3 dull orange lights in a straight line. it immediately caught my eye as i walk the route everynight and always look at the stars. each light was bigger than anything else in the sky at the time and they was bigger than any planet i have seen with the naked eye. As i stopped to view the object i was trying to work out if the lights was part of the same object. it appeared that it was and i could make out a blurred outline (translucent) of something around the outside lights. I focused on the object more and could make out red pulsating lights between the orange lights.(No Sound from the obect) There was a few planes in the sky at the start of the sighting but they was far away from the object up and lights on them was the size of stars. one of the planes was flying across the sky of my perspective of the object which made it clear that these lights were stationary. i had stopped walking and was stood in the middle of the playing field focused on the object and i was calling my girlfriend to come out of her house and to look at it to confirm what i was seeing but the was too much light pollution for her to see it. then a fighter jet flew over my head quite low and was heading the direction of the lights. As it flew to wards them the lights didnt move in a direction. it was although the lights disappeared gradually together or the object flew straight ahead away from me. As i continued my journey after 5 minutes i could hear a helicopter as i looked up i could see 2 army helicopters heading the same direction."],"Summary":"SAW STATIONARY ORANGE LIGHTS IN SKY LOTS BIGGER THAT ANY OTHER SKY TRAFFIC THAT IT CAUGHT MY EYE","files":["/var/www/straped/mufon/html2text/50315.html.txt","/var/www/straped/mufon/org/50315.html"],"Longitude":"-0.326748","Sighting Duration":"00:05:00","Log Number":"GB-08312013-0012","Object Flight Path":"Stationary","Source":"MUFON","Tags":"City","Date Submitted":"08/31/2013 05:36 UTC","Case Number":"50315","Country":"United Kingdom","Disposition":"Unresolved","Weather Factors":"Unknown","Object Features":"Unknown","Viewing Distance":"Unknown","City":"Dorking","Date of the Event":"08/29/2013 10:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=51.238742,+-0.326748(50315)&iwloc=A&hl=en\"> mufon case (50315) map </A>"}