{"Country":"United States","Date of the Event":"08/31/2013 09:00 UTC","Sighting Duration":"Undisclosed","Object Features":"Unknown","Longitude":"-84.132673","City":"Cumming","Weather Factors":"Unknown","divs":["Sighting DetailsI went outside to see my neighbor and looked up at the sky. I saw 5-6 reddish orange lights ascending from West to North in a diagonal line. I thought at first maybe there were a lot of air planes but then I saw an actual air plane flying beside them and it was completely different. The air planes were blinking red and white lights while the unidentified objects were a solid orange color. I asked my neighbor to come outside and see if she could identify them. When she came outside to look up at the sky there were only 2 orange lights. After pointing them out another appeared and we watched them get closer together and farther apart. One by one they disappeared and then after a few minutes they reappeared . There were now three and another neighbor came outside to witness as well.I ran inside to get my video camera but could not find it and my neighbor got a few pictures during this time but the pictures only show a white light instead of orange. An airplane flew by the lights and they almost collided in the same path then the orange light disappeared and the airplane continued to fly by . After a few more moments all of the lights disappeared and we haven't seen them since around 9:30 pm."],"Latitude":"34.21467","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Shape":"Circle, Fireball, Sphere, Star-like","Date Submitted":"08/31/2013 10:23 UTC","trends":["There have been 14 other sightings in Cumming","There were no other sightings in Cumming on or around August 31st 2013"],"Summary":"Red orange yellow lights in the sky.","Region":"Georgia","files":["/var/www/straped/mufon/html2text/50322.html.txt","/var/www/straped/mufon/org/50322.html"],"Case Number":"50322","map":"<A HREF = \"http://maps.google.com/maps?q=34.21467,+-84.132673(50322)&iwloc=A&hl=en\"> mufon case (50322) map </A>","Disposition":"Unresolved","Tags":"City","Source":"MUFON","Log Number":"US-08312013-0018","Object Flight Path":"Path with directional change,Path then hovering"}