{"files":["/var/www/straped/mufon/html2text/50323.html.txt","/var/www/straped/mufon/more/50323_submitter_file2__lights.JPG","/var/www/straped/mufon/org/50323.html"],"Viewing Distance":"Over One Mile","City":"Indio","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=33.729117,+-116.208482(50323)&iwloc=A&hl=en\"> mufon case (50323) map </A>","Latitude":"33.729117","Object Features":"Unknown","Longitude":"-116.208482","Object Flight Path":"Stationary","Case Number":"50323","trends":["There have been 9 other sightings in Indio","There were no other sightings in Indio on or around August 28th 2013","This sighting has never been favorited.",""],"Country":"United States","Object Shape":"Triangle","Date Submitted":"08/31/2013 10:27 UTC","Log Number":"US-08312013-0019","Summary":"3 Light triangle hovering in sky. A second unit appeared near it, shortly after the first unit disappeared","Source":"MUFON","Tags":"City","Weather Factors":"Unknown","Date of the Event":"08/28/2013 11:00 UTC","Sighting Duration":"01:00:00","divs":["sighting detailsduring my drive from los angeles to phoenix, i spotted lights in the sky that i couldn't explain. at first there was 3 bright lights (of a orange\\yellow color), appeared to be in the formation of a triangle. they didn't move, but hovered in the air. they were a good distance away, but still very bright. they were low enough to seem close, but high enough not to be a tower or connected to the ground. after about 5 mins of watching these, another set of 3 lights appeared nearby the first set. for a few minutes you could see both units hovering nearby each other. then the first set disappeared quickly. this same thing reoccured multiple times for the next 30 minutes. the lights would appear and disappear quickly, but always in different positions than the last. when appearing or disappearing, there was no flashing or moving. they did not shoot from the ground or from the sky, they just appeared. as i continued to drive, the lights didn't change but became hidden by the mountain range. after driving for another 15 minutes, i could see them again on the other side of the mountain range. now i was closer than ever, and the lights were super bright! they were so bright that i'm sure they could be visible from miles away. i estimate they were 20 miles south of where i pulled off to look. i spotted this event in between indio, ca and the arizona border on highway 10. they were south of highway 10. the lights continued to appear for 5-10 minutes, then disappear after another unit arrived. this event lasted for as long as i could see them in my rear view mirror. i do have both photos and videos of this event when it occurred."],"Region":"California"}