{"divs":["Sighting DetailsI was out side on the balcony of my grandmas apartment listening to music on my phone and I was looking up at the sky and that's when I spotted the 5 balls of light close together just moving in a half u and would stop in about a minute. and so I thought it was lightning in the clouds but I stopped to think they were lightning when they stopped without moving for a minute and repeatedly moved in a half u. I called my friend and mom to tell her what was happening but I ran out of battery so I went inside to charge my phone and by the time I went back out the lights were spread out in a half circle and they went in different directions so fast I then was really sure that that was not an aircraft of any kind because I don't think we have anything that can move out that fast in a blink of an eye. I was kinda really freaked out by it when they suddenly took off that I scraped my elbow against the wall. And I don't have any recording of the phenomenon I saw because it was really dark outside and the 5 balls of light wasn't that bright either. Right after I witnessed that I for sure believe that there is something else out there."],"Source":"MUFON","City":"Santa Ana","Date Submitted":"09/01/2013 02:42 UTC","Longitude":"-117.8611","Log Number":"US-09012013-0005","trends":["There have been 17 other sightings in Santa Ana","There were no other sightings in Santa Ana on or around August 31st 2013"],"Summary":"at night covered by the clouds but can see the light through it and there were 5 balls of light moving in a u","Tags":"City","Viewing Distance":"Unknown","Object Flight Path":"Hovering then path","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.758836,+-117.8611(50329)&iwloc=A&hl=en\"> mufon case (50329) map </A>","Object Shape":"Circle","Weather Factors":"Unknown","Region":"California","Disposition":"Unresolved","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/50329.html.txt","/var/www/straped/mufon/org/50329.html"],"Case Number":"50329","Latitude":"33.758836","Date of the Event":"08/31/2013 09:43 UTC","Sighting Duration":"Undisclosed"}