{"Date Submitted":"07/07/2006 02:00 UTC","files":["/var/www/straped/mufon/html2text/5032.html.txt","/var/www/straped/mufon/org/5032.html"],"Disposition":"IFO","Country":"United States","Sighting Duration":"Undisclosed","Tags":"City","Object Shape":"Other","Log Number":"US-07072006-0002","map":"<A HREF = \"http://maps.google.com/maps?q=26.131308,+-80.136569(5032)&iwloc=A&hl=en\"> mufon case (5032) map </A>","Summary":"A brilliantly, reflective, flat looking, craft that was apparent and then suddenly disappeared.","Case Number":"5032","Region":"Florida","divs":["Sighting Details I admit the possibility that I viewed an airliner, at low altitude, as it disappeared into a cloud bank. This said, I am a high time pilot. I am familair with illusions of flight and I found everything about this viewing experience as odd! I was turning onto a heavily trafficked road heading west. As I turned right, at a four way intersection, a bright reflection caught my attention off to my left. The object was likely 1 mile distant, to the south, at an altitude of around 4,000 feet. I think it was heading west. I thought the object was unusually bright, even compared to an airliner with a completely unpainted surface; the light was sparkling. I also had difficulty focusing on the craft as I tried to determine what was so peculiar about what I was seeing. I kept an eye on the craft for about 10 seconds. I was so momentarily distracted, because of the traffic, that when I looked back within seconds the craft disappeared. It didn't appear to be traveling at a speed that would have hidden it in a cloud bank at the moment that I was distracted. It was as if it blinked out of view! Another oddity was that its relationship to the local airport was not consistent with normal arriving and departing flights. It was too large to be an overflight. It was the size of the craft that made me think airliner, but all other indications seemed other than an airliner. I continued looking back in the direction of the craft for a considerable amount of time without a recurring sighting."],"Weather Factors":"Rain, Medium","Source":"MUFON","Object Flight Path":"Straight-line path","Object Features":"None","trends":["There have been 37 other sightings in Fort Lauderdale","There were no other sightings in Fort Lauderdale on or around July 7th 2006"],"Date of the Event":"07/07/2006 02:00 UTC","Latitude":"26.131308","City":"Fort Lauderdale","Longitude":"-80.136569","Viewing Distance":"Over One Mile"}