{"Tags":"City","Date Submitted":"09/01/2013 05:03 UTC","divs":["Sighting DetailsI couldn't sleep, so I suggested to my boyfriend that we go out and look at the sky. I live in a heavily light-polluted area, so getting a good look at the stars is a rare occurrence. With few clouds and the moon out of view, for once, there were a fair amount of visible stars. We grabbed a blanket, set it up on my front lawn, and fixed our eyes on a stationary star above us in attempt to see some shooting stars. After about 20 minutes of laying and staring we both witnessed an extremely bright circular object appear right before our eyes. It looked kind of like a star, in that it was white-blue in color and the same spherical shape, however it seemed much closer and was brighter than anything I have ever witnessed in the night sky. I immediately felt emotional, sitting up and beginning to cry for unknown reasons. It only lasted for a second or two before fading out and disappearing completely, without moving from it's original location. After seeing this, we were both confused and shocked. We began to rule out what it couldn't be, and were left with no explanation as to what it was. After a few minutes (5-10) of frenzied ideas, while still staring at the sky, the light returned -- this time slightly above our heads and behind us, but bright enough so as soon as it appeared we were both fixated on it. It behaved exactly as it did the first time, eliciting the same emotional reaction, and faded out just as quickly. I have been interested in the possibilities that the night sky holds for some time, and have spent plenty of time staring up -- in my area and other more secluded regions where the stars are plentiful and easily seen, but I have never seen anything like this before. This was brighter any star, plane, or satellite I have ever seen and too perfectly circular to be just an iridium flare."],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=39.827159,+-75.020837(50332)&iwloc=A&hl=en\"> mufon case (50332) map </A>","Date of the Event":"09/01/2013 04:15 UTC","Region":"New Jersey","Country":"United States","Weather Factors":"Unknown","Latitude":"39.827159","City":"Somerdale","Case Number":"50332","Log Number":"US-09012013-0008","Object Flight Path":"Stationary,Other","Source":"MUFON","files":["/var/www/straped/mufon/html2text/50332.html.txt","/var/www/straped/mufon/org/50332.html"],"Object Features":"Unknown","Object Shape":"Circle, Flash, Sphere","trends":["There have been no other sightings in Somerdale","This sighting has been favorited 3 times."],"Summary":"Sudden bright white-blue light appeared in the night sky, remained stationary, then faded away -- only to reappear minutes later in a different location.","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-75.020837"}