{"trends":["There has been one other sighting in Racine","There were no other sightings in Racine on or around August 31st 2013"],"Object Features":"None","Source":"MUFON","Date Submitted":"09/01/2013 10:43 UTC","Case Number":"50336","Region":"Wisconsin","Latitude":"42.779657","City":"Racine","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Log Number":"US-09012013-0012","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=42.779657,+-87.817651(50336)&iwloc=A&hl=en\"> mufon case (50336) map </A>","Date of the Event":"08/31/2013 11:45 UTC","divs":["sighting details1. i was letting out one of our dogs for a midnight potty. i stepped out with the dog to look at the sky. 2. notice it? it was huge\\brightly lit. in the western sky above the trees moving se. 3. i thought it was a ufo. as a pilot i have seen many aircraft and aerial phenomenon. this was not an aircraft\\helicopter\\uav. i have witnessed other ufo's and this was not like anything that fits a definable visual pattern. 4. briightly lit object in western sky. approximately between 35-40 degree elevation from horizon. moving in a west to southeastern direction. altitude, based on penny to dime sized, i would guess 3000-2000 agl (above ground level) hard to tell because the object was super brightly illuminated. like a huge landing light, but.. it was internally lit. not gasseous. but it was like spectral light. no trail. if it had been a landing light, it would have had a projection beam. no sound whatsoever. distance traveled, i am guessing but probably 5 miles or less..because it appeared west of the line of trees in our neighborhood and moved in a line to be over our house in the distance of probably a mile or two. i would say a mile or 2 horizontally from me slant range, because when the spectral light faded, i could see a round orb, that faded into nothingness. that took probably 10-15 seconds. the overall time i observed this object was probably 90 seconds. i did not have a watch or my cell phone on me at the time. i checked the clock in the house and it read 11:48pm. so i am estimating he time to be 11:45 when i first noticed it. could have been :47 past i don't know. my dog was acting kind of weird. she came outside and just stood there. she needed to go out, but then i put her on her chain and she just stood there, and then wanted to go back in the house. 5. after i observed the object. i couldn't sleep. i texted a couple of my friends and asked if they had seen anything. right now all over se wisconsin there is the 110th harley motorcycle reunion thing going on, so figured some of my friends might be out late at that, and wondered if they had seen anything. nobody saw anything. 6. i personally saw the bright object fade from brilliant white\\yellow and extinguish except for a sphere with a faded white light in the center. then the object completely vanished."],"Longitude":"-87.817651","Country":"United States","Viewing Distance":"Over One Mile","Sighting Duration":"00:03:00","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/50336.html.txt","/var/www/straped/mufon/org/50336.html"],"Object Shape":"Sphere","Tags":"City","Summary":"Super White/Yellow almost Gold Starlike Glowing object. West to Southeast track. Stopped. Moved same direction then faded to an unlit orb."}