{"Disposition":"Unresolved","Viewing Distance":"Unknown","Object Flight Path":"Path with directional change,Other","Object Shape":"Boomerang, Chevron, Circle, Oval, Sphere, Triangle, Other, Unknown","Case Number":"50330","Source":"MUFON","Summary":"Various objects with various shapes, unknown number","Latitude":"36.886608","Object Features":"Unknown","Tags":"City","Region":"New Mexico","Log Number":"US-09012013-0006","Country":"United States","Date of the Event":"08/31/2013 09:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.886608,+-104.436268(50330)&iwloc=A&hl=en\"> mufon case (50330) map </A>","Sighting Duration":"Undisclosed","City":"Raton","divs":["Sighting DetailsIn Raton NM elevation 6600 feet , i went outside at 945PM mountain time, my buddy looked at the sky and said did you see that, and at first I couldn't then I thought I saw some light for a fraction of a second but wasn't sure. Then what appeared to be a boomerang shape object in the western sky moving north, it had no lights on it but could be seen reflecting the lights from the town. The object moved all around in and out of the clouds, then another boomerang object appeared and was flying south. when the objects entered the clouds or came close to the clouds they became brighter. The clouds were maybe 10000 feet high. the objects became to change shape into rectangles, circles, blob looking things, then they would form a triangle then brake apart in 50 pieces then join together in a perfect triangle, square, or circle, they would change direction at perfect 90 degree angles without stopping, they would get bigger then smaller, and fly out of sight up high or in the distance then come back into view a second later but in a different location. For about 25 minutes this happen, I saw it with my friend my sister and two neighbors. And the whole time not a sound was made. At first the objects appeared white, then become a yellow color. One of them became almost a see through circle and then like a blob sort of circle. Also one went below the clouds and became a huge rectangle yellow shape for about 5 seconds then shrunk back down. Most of the time they were white but changed to yellow at times. Sometimes they appeared to move slowly then other times very rapidly, easily out running a plane. There was a plane about 30000 feet about half way though the event but was no where near the flying objects, and we could hear the plane, and it flow west in a straight line. When i first noticed the objects i thought it was a hang glider and wondered why someone would be doing this at night, and where they would've jumped off of to be that high in the sky, but it quickly gained speed and flew in all directions, that was ruled out. I thought it was awesome, never seen anything like that, not sure what it was, but was excited the whole time....still am. Lost sight of the objects all at once, they just disappeared. When i grabbed my camcorder the objects disappeared."],"files":["/var/www/straped/mufon/html2text/50330.html.txt","/var/www/straped/mufon/org/50330.html"],"Date Submitted":"09/01/2013 02:52 UTC","Weather Factors":"Unknown","Longitude":"-104.436268","trends":["There have been 2 other sightings in Raton","There were no other sightings in Raton on or around August 31st 2013"]}