{"Tags":"City","Log Number":"US-09012013-0023","Object Features":"Unknown","Date of the Event":"08/31/2013 12:00 UTC","Longitude":"-80.255288","Disposition":"Unresolved","trends":["There have been 31 other sightings in Winston-Salem","There were no other sightings in Winston-Salem on or around August 31st 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.093362,+-80.255288(50347)&iwloc=A&hl=en\"> mufon case (50347) map </A>","City":"Winston-Salem","Date Submitted":"09/01/2013 06:26 UTC","Object Shape":"Triangle","Summary":"Triangular object ejecting balls of light that appeared to have sparkling trails red and blues","Region":"North Carolina","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/50347.html.txt","/var/www/straped/mufon/org/50347.html"],"Case Number":"50347","Country":"United States","Latitude":"36.093362","Source":"MUFON","Sighting Duration":"00:02:00","divs":["Sighting DetailsWas traveling with my daughter going south on peters creek pkwy in Winston Salem. I noticed a triangular light formation pass overhead and become visible thru the windshield. It was heading same direction as we were. Had three lights, non of which were blinking which is what caught my attention. Object began to increase speed significantly as I watched it. It was ejecting what appeared to be red and blue balls of light that shot off in random directions. There was a sparkling trail behind them and they basically flew off and dissapeared. I could hear no sound emitted. Picked up great speed and went out of sight. We could still see balls of light ejecting in the distance before losing sight all together. We both were shocked and basically clueless as to what we had seen. I have been around aviation my whole life and ice never seen anything like it. I have seen military jets drop flares and this was not like any I have seen. I called my dad, who has been in aviation 50 years and he too was clueless."],"Object Flight Path":"Straight-line path"}