{"divs":["Sighting DetailsMy friends (3) and I were driving from Hamilton towards Middleton, OH. We saw them plain as day in the night sky. There were 6 or 7 of them in the shape of the big dipper, but bigger and brighter than stars. They were shaped like ovals placed horizontally with a sort of dome on top. They had some light coming through the bottom, not like a beam, but like they were going to descend and needed to see their way. Initially, they were just hanging there, then they were descending right to left, in doing so slightly changing their formation, and finally began descended left to right, blinking out as they did. The last one to do seemed to be on fire. My friends tried to get their cellphone cameras working, but one phone wouldn't turn on, and one phone's video wouldn't show them there. I felt that they were still there though. I felt uneasy and wanted to go home. We got into the car and left, as we were heading towards the city lights of Middleton, we saw a plane flying to that exact same area in the sky that it had happened."],"Longitude":"-80.563526","Sighting Duration":"00:06:00","City":"Middleton","Disposition":"Unresolved","Case Number":"50342","Date Submitted":"09/01/2013 02:37 UTC","Region":"Ohio","Date of the Event":"08/31/2013 09:30 UTC","trends":["There has been one other sighting in Middleton","There was one other sighting in Middleton on or around August 31st 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.756706,+-80.563526(50342)&iwloc=A&hl=en\"> mufon case (50342) map </A>","files":["/var/www/straped/mufon/html2text/50342.html.txt","/var/www/straped/mufon/org/50342.html"],"Country":"United States","Object Features":"Dome","Log Number":"US-09012013-0019","Weather Factors":"Unknown","Source":"MUFON","Object Shape":"Oval","Object Flight Path":"Hovering then path,Path with directional change","Summary":"UFO hovered, then changed direction, blinked out as descending","Tags":"City","Latitude":"40.756706","Viewing Distance":"501 Feet - 1 Mile, Unknown"}