{"Object Shape":"Sphere","Sighting Duration":"Undisclosed","Region":"Florida","Summary":"Third Night In A Row Golden-Orange Glowing Orb In Our Area","Longitude":"-80.391334","Case Number":"50340","trends":["There have been 10 other sightings in Port St. Lucie","There were 3 other sightings in Port St. Lucie on or around August 31st 2013"],"divs":["sighting detailsafter watching a glowing orb in our near, low sky the previous two nights (august 29th & august 30th between 9 and 9:30 pm - read previous reports,) my husband and i were prepared on this night (august 31st) to be outside well before the time of the prior sightings. we had our tripods and cameras. it was a cloudy night, so we were uncertain. the children were waiting with us, as they had seen it the previous night. at 9:05 from our back patio, which faces west, coming in from the southwest was a star-like point of yellowish light. as it was moving north east, we realized it was not a star. after about 5 minutes of moving in our direction, it stopped in the same spot that it had the past 2 nights, west from us, about 3 miles away. there it sat for 10 minutes, hovering and moving slightly. it seemed to get bright and dim, but this may be because of clouds or its distance. about ten minutes of hovering above the tree line, it seemed to dim and descended below the tree line. i managed to get photographs with a long camera lens and a tripod. (most of the photos i got captured motion and light trails, so i have omitted those, but saved them.) my husband had his video recorder on a tripod and captured video, as well....which gives a good indication of our vantage point. (we are unable to successfully upload the video but if mufon would like to see it, please contact us via email.) it was not doing it's obvious ascending\\descending, zig-zagging as the previous nights but was agile and moving in a pattern on approach (5 minutes) and once hovering it stayed in place low on the horizon (10 minutes.) silence, again. there is no way this could be a helicopter, airplane, model aircraft, chinese lantern, hot air balloon, star, missile, flare, et al. it's movements, agility, changes in flight pattern and general color combined with no blinking lights on it, really leaves us feeling that this is something we have never seen. and this happened three nights in a row. the first two nights, we came outside around the same time and it was already positioned, hovering in the west, above the tree line at a distance of estimated 3 miles. (read previous reports.) last night, we watched it approach from the south west to the western point of the previous nights. we will be outside and ready at 8:45 tonight (september 1, 2013) to see if it comes back. we hope it does, but what could it mean? *one other odd thing. there were no stars out because it had been raining and was cloudy, but clearing up. in many of the photos during the period of time it was hovering, tiny points of light (like stars) in the thousands were all around in the sky around this thing, not visible to the naked eye. zoom in on the photos, to see what i mean. i do not attribute them to artifacts in the camera or pixelation as they do not appear in any of the earlier photographs. they are of less concern than the glowing orb visiting our area three nights in a row, but interesting, just the same."],"Latitude":"27.229469","files":["/var/www/straped/mufon/html2text/50340.html.txt","/var/www/straped/mufon/org/50340.html"],"Country":"United States","Viewing Distance":"Over One Mile","City":"Port St. Lucie","Date Submitted":"09/01/2013 01:54 UTC","Weather Factors":"Unknown","Disposition":"Unresolved","Object Features":"Unknown","Source":"MUFON","Tags":"City","Object Flight Path":"Path then hovering","Date of the Event":"08/31/2013 09:05 UTC","Log Number":"US-09012013-0016","map":"<A HREF = \"http://maps.google.com/maps?q=27.229469,+-80.391334(50340)&iwloc=A&hl=en\"> mufon case (50340) map </A>"}