{"Sighting Duration":"00:04:00","Source":"MUFON","Summary":"Object Acends Around sun down Visible from North Of Venice Beach, South of the Santa Monica Peer","map":"<A HREF = \"http://maps.google.com/maps?q=34.025184,+-118.485811(50345)&iwloc=A&hl=en\"> mufon case (50345) map </A>","divs":["Sighting DetailsOn August 31st 2013 just after the sunset Behind the Santa Monica Mountains a white contrail could be seen Ascending under high velocity at an extremely steep angle. Over 10 minutes or so Friends and i watched as the object continued to ascend under power and be came more and more over our points of view until the object leaving the contrail became a visible spec about a pencil leads width from the distance in which we were viewing the object. Then as the object reached the Terminator of Night and day in the sky, the object was no longer visible to the naked eye in the night sky, though I could still see the contrail visibly for a few more seconds. The object the disappeared. The Los Angeles Area has huge amounts of Air Traffic and so seeing air craft is as common as seeing a bird in most instances, what struck me as being odd about the object is that unlike every other aircraft in the field of view, both fixed wing and helicopters, this object had no Navigational lights or any other kind of standard aircraft outboard lighting. The objects appeared to me as if it had hit exit velocity and escape the Earths gravity, I did not here any tell tail sonic booms to indicate that this was the case, i may have been just to far away to here. The is a naval air station north OF LOS ANGELES county where it is possible the craft was lAUNCHED. If it is one of Uncle Sam's rides then hats off cause that thing was BADASS!"],"Longitude":"-118.485811","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/50345.html.txt","/var/www/straped/mufon/org/50345.html"],"Date Submitted":"09/01/2013 05:09 UTC","Region":"California","Object Flight Path":"Straight-line path","Latitude":"34.025184","Log Number":"US-09012013-0021","trends":["There have been 20 other sightings in Santa Monica","There were no other sightings in Santa Monica on or around August 31st 2013"],"Case Number":"50345","Date of the Event":"08/31/2013 07:30 UTC","Disposition":"Unresolved","Weather Factors":"Unknown","Country":"United States","Tags":"City","Object Features":"Unknown","Viewing Distance":"Over One Mile","City":"Santa Monica"}