{"Viewing Distance":"Over One Mile","Country":"United States","Log Number":"US-09012013-0019","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Date Submitted":"09/01/2013 04:25 UTC","Sighting Duration":"Undisclosed","Date of the Event":"08/31/2013 08:45 UTC","divs":["sighting detailsmy brother was out on the patio alone around 8 45 pm 8\\31\\2013. he said he looked into the sky and saw an object appear, moving in a straight line over the saddleback mountains from the cleveland national forest. it was moving north east. we live in temescal valley south of corona. the object was a bright orange color and appeared to be very low altitude. he said the object slowed down, came to a complete stop and then was hovering. he yelled to me to hurry and come outside and then pointed to this amazing hugh orange light just sitting in the sky. as i stood outside my brother ran to get his night vision goggles. the object still had not moved during the time it took him to come back. looking at it through the night vision goggles my brother observed the object spinning with no tail, no sound, was not a helicopter or aircraft as a commercial plane was seen passing by later. we witnessed the object hovering for a few minutes. my brother ran back inside to get a stronger scope and it then moved to the left (north east) very quickly. it began to ascend slowy and the light seemed to suddenly have been turned off. we could see it was still there in the clouds and continued to track it with the night vision goggles. this went on for about 15 to 20 minutes. for a moment i didnt want to admit i was overcome with fear. i told my brother, if we can see them, they surely can see us. i ran inside and sent a message to a friend. she then sent me a photo from her friend who witnessed the same ufo to a fault and the same bright orange color. needless to say i was in awe and somewhat in shock. even though et's are no longer fiction, once you are a personal witness, its a life changing experience."],"Disposition":"Unresolved","City":"TEMESCAL VALLEY","Weather Factors":"Unknown","Summary":"BRIGHT ORANGE LIGHT HOVERING OVER TEMESCAL VALLEY, CA","map":"<A HREF = \"http://maps.google.com/maps?q=33.790851,+-117.503935(50343)&iwloc=A&hl=en\"> mufon case (50343) map </A>","Object Features":"Unknown","Source":"MUFON","Object Shape":"Circle, Disc","Longitude":"-117.503935","trends":["There have been no other sightings in TEMESCAL VALLEY","This sighting has been favorited 1 time."],"files":["/var/www/straped/mufon/html2text/50343.html.txt","/var/www/straped/mufon/org/50343.html"],"Region":"California","Tags":"City","Case Number":"50343","Latitude":"33.790851"}