{"City":"Fullerton","Tags":"City","Region":"California","Case Number":"50346","Object Shape":"Unknown","trends":["There have been 14 other sightings in Fullerton","There were no other sightings in Fullerton on or around August 31st 2013"],"Weather Factors":"Unknown","Country":"United States","Disposition":"Unresolved","Summary":"5-6 glowing lights above light clouds lighting up clouds and moving randomly apart and back together as if playing a game","map":"<A HREF = \"http://maps.google.com/maps?q=33.872692,+-117.919698(50346)&iwloc=A&hl=en\"> mufon case (50346) map </A>","divs":["Sighting DetailsAfter a hot humid day I was in my backyard on a lounge chair looking up at the sky about 9:45pm. I noticed lights moving randomly in the sky. My first thought was a search light from a car dealer. After watching a few minutes I realized the light was coming from above the clouds not from the ground. I continued to watch 5-6 glowing lights move randomly separating and then joining back together. It was as if they were playing tag. The clouds would glow but when they went between clouds I could not see any light. After 5-10 minutes I went in the house and got my wife to come out to see. At first they stayed huddled together and were not moving around. Finally they began to move again and my wife could definitely see them too. We watched together for another 5-10 minutes as they moved randomly. Then they seemed to form the shape of a comma and stopped moving. Then suddenly they each took off in a different direction but evenly spaced at an extremely high speed. Just like warp speed each one in its own symmetrical direction like fingers on a open hand. When they took off there was a small white light as each one streaked away. They moved faster than any aircraft can move. I live near Fullerton airport and see jets from LAX all the time. These were not airplanes. I am not a UFO hunter by any means but both me and my wife are convinced we saw something last night."],"Object Flight Path":"Path then hovering","Sighting Duration":"Undisclosed","Object Features":"None","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/50346.html.txt","/var/www/straped/mufon/org/50346.html"],"Date Submitted":"09/01/2013 06:17 UTC","Longitude":"-117.919698","Log Number":"US-09012013-0022","Source":"MUFON","Date of the Event":"08/31/2013 09:45 UTC","Latitude":"33.872692"}