{"Region":"Indiana","Country":"United States","Log Number":"US-09012013-0027","City":"Indianapolis","Object Features":"Dome","Date Submitted":"09/01/2013 11:44 UTC","Tags":"City","Disposition":"Unresolved","Object Flight Path":"Straight-line path","trends":["There have been 126 other sightings in Indianapolis","There was one other sighting in Indianapolis on or around July 29th 2013"],"Date of the Event":"07/29/2013 10:20 UTC","Weather Factors":"Unknown","Object Shape":"Circle, Disc, Fireball, Sphere","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Source":"MUFON","Sighting Duration":"00:08:00","files":["/var/www/straped/mufon/html2text/50352.html.txt","/var/www/straped/mufon/org/50352.html"],"Latitude":"39.695585","Summary":"Orange Colored Sphere with Flames that when flying overhead appeared as a grey circle/disc","map":"<A HREF = \"http://maps.google.com/maps?q=39.695585,+-86.13137(50352)&iwloc=A&hl=en\"> mufon case (50352) map </A>","Longitude":"-86.13137","divs":["Sighting DetailsMy husband Mike and I were leaving AMC Showplace 17 movie theater at 10:20. We went to climb in the car (which was facing North in the parking lot) when we noticed a very, very bright orange light that flickered. Initially we thought it was a helicopter flying toward us but the light flickered so we ruled that out. We thought it could be a Chinese lantern but ruled that out when an airliner, landing at the Indianapolis International Airport, flew beneath it. This thing was bigger than the airliner. My husband is an Operations Manager for Federal Express at the airport and he could not identify it as an airplane or helicopter. The closer the object came toward us the brighter the light and we could see a large flame that would be orange but then quickly change from blue to white. The flame had force behind it- like a hot air balloon (which we also ruled out). We initially saw this object at 45 degree to our North (right over downtown Indianapolis) and continued to watch it until it was 90 degrees overhead. We were in a very well lit parking lot but when the thing flew overhead, it was no longer orange, it was a grey circular shape - the color of fog. It made no noise and continued to fly in a straight line (it had trajectory)to the SE. We lost sight of the object only after it flew overhead and we both climbed in the car wondering what the hell we just saw."],"Case Number":"50352"}