{"Log Number":"US-09022013-0013","Summary":"observed what appeared to be a bright yellow light that was in the shape of an eye or disk. It appeared grey to my wife. appeared stationary then slowly disappeared. Took photo but appears diamond shape dark spot. only came out on one photo.","Case Number":"50369","files":["/var/www/straped/mufon/html2text/50369.html.txt","/var/www/straped/mufon/more/50369_submitter_file1__ufolol.jpg","/var/www/straped/mufon/more/50369_submitter_file2__noufo.jpg","/var/www/straped/mufon/org/50369.html"],"Disposition":"Unresolved","Date of the Event":"09/01/2013 12:00 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=43.972075,+-99.895753(50369)&iwloc=A&hl=en\"> mufon case (50369) map </A>","Object Features":"Other","Weather Factors":"Unknown","Object Shape":"Disc","Tags":"City","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy wife and I were leaving Fairburn Agate bed driving in a westerly direction when I noticed a bright yellow glowing object the shape of a disk or eye. I pointed it out to my wife and she thought it was a plane. Later after talking my wife said it appeared silver or grey and was the exhaust from a jet. When I first noticed it I thought perhaps it may be a comet but had not heard of any potential comet in the sky and the position it was in, approximately 35 degrees above the horizon, others should have seen it for days. It appeared to remain the same size for about 15 minutes then it slowly diminished in size before we lost sight of it from the Black Hills. I was excited, I often allow my emotions get carried away, because I am always hoping to see a UFO (I had another experience a few weeks earlier while in Pine Ridge but this object entirely different. I will send another report). My wife appeared only curious (perhaps it was because she saw it in a different color). After it disappeared we did not see it again. I took several photos with a phone camera and only one picture shows an object in the sky, the diamond shape dark spot. I tried to zoom in but it became even more distorted. I have attached two photos taken within minutes of each other. The object appears on the right side of the photo above the flat hill next to the clump of trees. My spouse still says it looks like the exhaust from a jet illuminated by the sun, however she also says the object never changed shape or size until it disappeared. We considered whether it was headed due west in a straight line but the disk shape did not change size or position or reflectiveness until it began to disappear. Although with the naked eye the object remained still and hovering, the second photo taken within minutes or even seconds of each other, it does not appear in the photo."],"Viewing Distance":"Unknown","Object Flight Path":"Stationary,Straight-line path","Date Submitted":"09/02/2013 01:09 UTC","Longitude":"-99.895753","Region":"South Dakota","Latitude":"43.972075","trends":[""],"Source":"MUFON","City":"Undisclosed"}