{"Object Shape":"Unknown","Tags":"City","Country":"Canada","trends":["There have been 43 other sightings in Winnipeg","There was one other sighting in Winnipeg on or around September 1st 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=49.810102,+-97.106652(50368)&iwloc=A&hl=en\"> mufon case (50368) map </A>","Log Number":"CA-09022013-0012","Longitude":"-97.106652","Case Number":"50368","Source":"MUFON","Latitude":"49.810102","Viewing Distance":"501 Feet - 1 Mile","Region":"Manitoba","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Date Submitted":"09/02/2013 12:30 UTC","Object Features":"Unknown","City":"Winnipeg","files":["/var/www/straped/mufon/html2text/50368.html.txt","/var/www/straped/mufon/org/50368.html"],"Disposition":"Unresolved","Date of the Event":"09/01/2013 10:30 UTC","divs":["Sighting DetailsI was in Winnipeg, Manitoba at approximately 10-10:30 walking my dog, around the paddington area. I noticed the object flying too low to the ground to be an airplane or a helicopter. As I looked around there was an airplane not too far from the crafts that I noticed; as airplanes blink red and blue this craft did not; as well as not make any noise what so ever. The objects were beaming red with a dash of orange; and the lighting was a constant red and light orange. I noticed one object, then not far behind another object. Not too long after that i noticed there was at least 5 object all going in the same direction in a straight line. I then noticed a formation of the 3 objects in a line facing upwards in the sky, they stayed there for at least 30sec to a 1 minute in length then took off again in a straight line heading towards hwy 59. south of the city. I lost sight of them due to the fact of me being a little freaked out and because I couldn't catch up to them by foot. It seems as though they were headed towards the south end of the city towards HWY. 59 and south perimeter."],"Summary":"Beaming low falshing red lights hovering above city!","Sighting Duration":"Undisclosed"}