{"Viewing Distance":"501 Feet - 1 Mile","Object Features":"Patterned Surface","Latitude":"40.558056","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=40.558056,+-85.600804(5037)&iwloc=A&hl=en\"> mufon case (5037) map </A>","divs":["Sighting DetailsWe were living 4 miles west of downtown Kokomo at the time. Around 7PM we saw a large object out our library window. We went outside and saw a large object moving due south but slightly southeast of our subdivision. It was moving very slowly and had a tremendous roar of a jet engine, but it did not look like any conventional military aircraft. (I grew up an Air Force brat.) My wife and I both used the term \"Battlestar Galactica\" to describe the undersurface of this huge triagular object. It seemed to be no highter than 500 feet. My wife thought it was hovering and then took off at the speed of light but I think it was just slow moving and got lost because of the low altitude. We called the local authorities thinking it was something new from Grissom Air Force Base, but were told if it was flying less than 1000 feet, someone was in big trouble. I know it wasn't the Stealth Bomber because I had seen this and it wasn't the Stealth. I know classic UFOs do not make jet engine roars but this thing did. It has always been an enigma to me because I have never seen anything like it before or since. I am reporting now because of other people reporting low-flying triangular shaped objects. Oh, my reaction was not one of fear but \"What in the h*** is that?\" I guess I was not afraid because of the jet engine sound which was deafening."],"trends":[],"Object Shape":"Triangle","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/5037.html.txt","/var/www/straped/mufon/org/5037.html"],"Source":"MUFON","Date Submitted":"04/19/1992 12:00 UTC","City":"Undisclosed","Sighting Duration":"Undisclosed","Tags":"City","Longitude":"-85.600804","Weather Factors":"Does Not Apply","Case Number":"5037","Date of the Event":"04/19/1992 12:00 UTC","Country":"United States","Log Number":"US-07082006-0005","Summary":"slow moving Battlestar Galactica","Region":"Indiana"}