{"Case Number":"50384","City":"Chandler","Object Shape":"Sphere, Star-like","Summary":"Bright Light Changed Colors and Moved","Tags":"City","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Region":"Arizona","Source":"MUFON","trends":["There have been 52 other sightings in Chandler","There were no other sightings in Chandler on or around September 2nd 2013","This sighting has been favorited 1 time.",""],"Sighting Duration":"00:30:00","Disposition":"Unresolved","Date Submitted":"09/03/2013 01:51 UTC","Log Number":"US-09032013-0004","files":["/var/www/straped/mufon/html2text/50384.html.txt","/var/www/straped/mufon/more/50384_submitter_file1__IMG20130902185641.jpg","/var/www/straped/mufon/more/50384_submitter_file2__IMG20130902185851.jpg","/var/www/straped/mufon/more/50384_submitter_file3__IMG20130902185646.jpg","/var/www/straped/mufon/org/50384.html"],"Date of the Event":"09/02/2013 07:30 UTC","Latitude":"33.270192","Weather Factors":"Unknown","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.270192,+-111.789041(50384)&iwloc=A&hl=en\"> mufon case (50384) map </A>","Longitude":"-111.789041","Country":"United States","Object Flight Path":"Hovering then path,Path with directional change","divs":["sighting detailsmy husband and i were backing out of our driveway on our way to the park to walk our dog. i happened to look up and observed a bright light hovering over chandler, az over our neigborhood. the light was so bright it looked like i was looking at the light from a welding torch. it first looked like the planet venus, then it got brighter and bigger. i noticed it started to move along a path. i ended up at tumble weed park in chandler and got out of my car. i looked up due north and saw that it had moved and it was now closer to tumble weed park but the elevation was higher. it then hovered for about 5 minutes. then it started to turn orange then in a minute it turned bright red. then, it turned back to the original bright white light and started to ascend up so high that it finaly looked like a very distant star. it vanished right after. i tried to call the chandler municipal airport tower control but i got the recorder stating that they were closed as today is labor day. i called phoenix sky harbor and reported my findings while it was turning orange\\red. i saw the same type of sphere\\light on sept. 11, 2009 around the same time 7:00-7:40 pm in apache junction. i felt frustrated that i could not videotape the object especially when it changed colors and ascended vanished so quickly."]}