{"Country":"United States","trends":["There have been 3 other sightings in Washington, D.C.","There was one other sighting in Washington, D.C. on or around September 2nd 2013"],"Object Flight Path":"Other","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/50381.html.txt","/var/www/straped/mufon/org/50381.html"],"Log Number":"US-09032013-0001","divs":["Sighting DetailsGorilla camped just west of Mt. Adams at ~5K. Clear, open area with fire pit facing the mountain. No moon--many stars; milky way, et al. My two friends and the two children all went to bed. I was alone in the Element. Woke just after midnight, and without my glasses could see a bright light in the sky. Grabbed my glasses and looked west. A very bright rectangular shaped object was ~8-10k hovering, moving left, then right, but with curved angles, nothing sharp. This was not an airplane or satellite. Moved eastward almost out of range then moved back to its original position. Was stationary for a while then started up again. Felt frightened but did not want to call the others--did not want to move. Afraid I would be spotted. The light then became stationary and I waited for about 45 minutes but it did not move again. Later in the night the dog woke my friend's daughter. Dog was trembling and defecated in the tent. My friend George said this was really strange behavior for the 10-year-old Beagle. Went back to sleep. Thought I slept until morning but the stars were still out. Woke up several times. Urinated 4 times during the night though I was not drinking anything after 7 pm. I did not have any drugs or alcohol in my system. Then my left ear started making strange noises, clicking, and sounds like Morse code. This went on for a while. To make a long story short, in the morning all three adults had highly disturbed sleep. All three of us had felt frightened, though the two adults did not know what I saw until after I heard their stories then I told them what I had observed between 12 and 2 am. It was a strange site where we camped--we heard several strange noises in the forest, none that we could recognize and the two adults are from here and have been climbing these mountains all their lives. We all felt like the night was much longer than usual and all three of us felt like morning was never going to come. We packed the camp up and left by 9:30 am. All of us feel strange and exhausted. I especially feel uneasy as I am not afraid of too many things but this experience did frighten me and my senses seemed out of whack."],"Sighting Duration":"Undisclosed","Tags":"City","Region":"Washington","Longitude":"-77.035364","Object Features":"None","Source":"MUFON","Case Number":"50381","map":"<A HREF = \"http://maps.google.com/maps?q=38.913531,+-77.035364(50381)&iwloc=A&hl=en\"> mufon case (50381) map </A>","Object Shape":"Unknown","Date of the Event":"09/02/2013 12:00 UTC","Disposition":"Unresolved","Date Submitted":"09/03/2013 01:05 UTC","Latitude":"38.913531","Weather Factors":"Unknown","Summary":"~~","City":"Washington, D.C."}