{"Viewing Distance":"Unknown","Object Flight Path":"Path with directional change","divs":["Sighting DetailsLast week my dad texted me while on his walk to pick him up from a place he doesn't normally go. I answered it too late after he told me he was chasing a UFO. It sounded like one I had seen a while back and my friend had seen in the same area. Last night it came back. He went on his walk and hurried back and told me and my mom it was outside again. We grabbed some binoculars and went tot he street corner and watched it. It was a long way off, but it was a red orb that pulsed white once and again. It kept going below then above the tree line in the same place but not moving much. This time my dad and I went after it. My mom stayed home. I drove us out to a field in a more rural part of the area with few lights. He didn't expect to see much, but we both got more than we thought we would. We spotted it once on the main road, still far off but in the same spot. We observed it for about 5 minutes then things got strange. It was a perfectly clear night with no cloud cover. We could see multiple planes in the sky too. All of a sudden, 8 white orbs appeared below the red one. They pulsated brightly, always white. Much brighter than the stars. They proceeded to form a straight line in the sky for about 3 minutes. Next they moved to form a triangular pattern. They seemed to be getting closer and closer to us. At this point we high tailed it out of there. This seems to be a recurring theme in this area. My dad was a skeptic until last night. There was also no noise at all from the lights. They moved under intelligent control. Having lived the last 4 years near a major air force base I know they were totally unlike anything I have seen down there. I plan to have some of my friends bring nice cameras and we are going to try to hunt them down tomorrow night. By far the strangest thing that has ever happened to me."],"Summary":"Solitary red orb at first then fleet of white orbs that moved in patterns","Source":"MUFON","Object Features":"Patterned Surface","Log Number":"US-09032013-0017","Date Submitted":"09/03/2013 05:50 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.64848,+-77.62378(50397)&iwloc=A&hl=en\"> mufon case (50397) map </A>","Region":"Virginia","Object Shape":"Sphere","Disposition":"Unresolved","Latitude":"37.64848","Date of the Event":"09/02/2013 09:02 UTC","City":"Glen Allen","Sighting Duration":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/50397.html.txt","/var/www/straped/mufon/org/50397.html"],"Weather Factors":"Unknown","Longitude":"-77.62378","Country":"United States","trends":["There have been 4 other sightings in Glen Allen","There were no other sightings in Glen Allen on or around September 2nd 2013"],"Case Number":"50397"}