{"divs":["sighting detailsone warm evening two nurses and i were getting off the evening shift about 2300 to 2330 and going out the rear doors into the parking lot. i looked up and saw a disc like object cruising towards us in the sky. there was a band of either pulsating or flashing lights around the middle. the object made no noise but continued steadily right over our heads, right over the top of the hospital and out of sight. i said to my companions \"what is that?\" they answered \"an airplane\". i replied \"thats not like ant airplane i ever saw\". the next day newspaper had a front page article about \"an object over hampton roads. this was seen in cheasapeake, suffolk, virginia beach, norfolk and other neighboring areas. i brought the paper to work the next evening, plunked it down in front of the two co- workers and said \"now what do you think that was?\" the reply? \"an airplane\", i have tried to search the papers and have found nothing perusing to this incident. it took place in the mod to late 80s. if you find the article in the paper, please send me a copy. i will pay expenses. [name removed\\cms\\tg]"],"trends":["There have been 24 other sightings in Norfolk","There were no other sightings in Norfolk on or around June 18th 1988"],"Viewing Distance":"501 Feet - 1 Mile, Unknown","Object Flight Path":"Straight-line path","Summary":"Circular disc with a band of lights around the middle","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.861278,+-76.303128(50409)&iwloc=A&hl=en\"> mufon case (50409) map </A>","Log Number":"US-09032013-0029","Latitude":"36.861278","Disposition":"Unresolved","Longitude":"-76.303128","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/50409.html.txt","/var/www/straped/mufon/org/50409.html"],"Tags":"City","Case Number":"50409","Country":"United States","Date Submitted":"09/03/2013 10:32 UTC","City":"Norfolk","Weather Factors":"Unknown","Date of the Event":"06/18/1988 11:09 UTC","Object Shape":"Sphere","Region":"Virginia","Object Features":"Other"}