{"Latitude":"46.166306","trends":["There has been one other sighting in Maniago","There were no other sightings in Maniago on or around August 31st 2013","This sighting has been favorited 1 time.",""],"divs":["Sighting Details My wife and I were sitting on our porch in late afternoon. The weather was clear and the sky was blue. I noticed in front of me to my right(Southerly) what looked like 4 parachutes moving slowly in a North easterly direction. Looking closer I saw that they were not parachutes but round white orbs. I took 2 photos (852 & 853). The dark area on top is the roof of our porch. My wife then told me to look left and there were a bunch more of them (pic 854). That's when I went down to the driveway to get a clearer view of the sky. I took several more pics from here. This took place at 5:52pm local time. The camera timestamp is 6 hours behind as I did not adjust it for local time. Img858 shows what looks like a dark cylinder amongst the orbs. It also appears in Img860. The orbs were not moving much, not intermingling or anything like that. In fact they seemed to keep a relative position from each other. When the 4 that were in front of me and initially got my attention, caught up to the others(roughly North east of me), that's when most movement stopped. At that point I counted 18 of them, there might have been more. They then started to slowly dim as though they were gaining altitude and eventually I could no longer see them. The whole event lasted about 8-10 minutes. In this area of the pre Alps I have seen many para gliders and parachuters. This was definatley neither of those. AS they gathered and started to dim I viewed them with an 8x binocular. They appeared brighter as though lighted. I've seen many strange things in this area but this one was right up there. When I initially saw the first 4(pics 852 and 853) it was hard to estimate their altitude. I first thought they were paragliders which I have seen numerous times in this area. That would place them at about 500 - 2000 feet altitude. But not knowing the size of the objects, I can not say at what altitude they were."],"map":"<A HREF = \"http://maps.google.com/maps?q=46.166306,+12.713747(50401)&iwloc=A&hl=en\"> mufon case (50401) map </A>","Disposition":"Unresolved","Viewing Distance":"Unknown","Country":"Italy","Sighting Duration":"Undisclosed","Log Number":"IT-09032013-0021","files":["/var/www/straped/mufon/html2text/50401.html.txt","/var/www/straped/mufon/more/50401_submitter_file10__IMG0861.JPG","/var/www/straped/mufon/more/50401_submitter_file1__IMG0852.JPG","/var/www/straped/mufon/more/50401_submitter_file2__IMG0853.JPG","/var/www/straped/mufon/more/50401_submitter_file3__IMG0854.JPG","/var/www/straped/mufon/more/50401_submitter_file4__IMG0855.JPG","/var/www/straped/mufon/more/50401_submitter_file5__IMG0856.JPG","/var/www/straped/mufon/more/50401_submitter_file6__IMG0857.JPG","/var/www/straped/mufon/more/50401_submitter_file7__IMG0858.JPG","/var/www/straped/mufon/more/50401_submitter_file8__IMG0859.JPG","/var/www/straped/mufon/more/50401_submitter_file9__IMG0860.JPG","/var/www/straped/mufon/org/50401.html"],"Source":"MUFON","Longitude":"12.713747","Region":"Friuli-Venezia Giulia","Object Flight Path":"Unknown","Date Submitted":"09/03/2013 07:49 UTC","Object Features":"None","Tags":"City","Summary":"Multiple bright orbs during afternoon in clear sky","Weather Factors":"Unknown","Object Shape":"Circle, Cylinder","Date of the Event":"08/31/2013 05:52 UTC","City":"Maniago","Case Number":"50401"}