{"Region":"Maine","Weather Factors":"Unknown","Viewing Distance":"Unknown","Latitude":"44.645457","Country":"United States","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Longitude":"-68.479544","Source":"MUFON","divs":["Sighting DetailsMy son and I were sitting in front of our fire pit in front of our lake house around 10 PM when I happened to look up and saw an orange glowing orb about the size of a bright star or planet moving across the sky. I could not tell how high it was .I thought it might be a plane but there was no sound and no flashing lights you customarily see with them. I went down on my dock on the lake and lost sight of it. It had been moving fairly slowly in a southeast to northwest direction. About 5 to 10 minutes later an identical (or the same one) orb went across my camp heading in the exact same direction. My son saw it this time and we both went out on the dock. The weather was partly overcast with visible stars. The second orb went across the sky and changed direction. At this time we also observed a third orb again coming in the same direction as the first two and we could view them both at the same time. They appeared to change direction and disappear into the clouds. The entire event from first sighting to last was about 15 minutes I would estimate. I have never seen a plane do that or have multiple lights go across the sky following one another with no sound. It was definitely not a meteor or satellite with the slow movement. My son and I were quite mystified and wondered if others in the area had seen the lights. I read on line about similar sightings of similar object traveling in groups in the same direction from around the world at various times."],"Object Shape":"Circle, Star-like","Object Flight Path":"Path with directional change","City":"Ellsworth","Object Features":"Unknown","Summary":"My son and I observed three orange silent orbs traveling slowly one after another from se to nw d","Date Submitted":"09/03/2013 09:59 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.645457,+-68.479544(50406)&iwloc=A&hl=en\"> mufon case (50406) map </A>","files":["/var/www/straped/mufon/html2text/50406.html.txt","/var/www/straped/mufon/org/50406.html"],"Tags":"City","Date of the Event":"09/01/2013 10:15 UTC","trends":["There have been 3 other sightings in Ellsworth","There were no other sightings in Ellsworth on or around September 1st 2013"],"Case Number":"50406","Log Number":"US-09032013-0026"}