{"Source":"MUFON","Viewing Distance":"Unknown","Country":"United States","City":"Undisclosed","Date of the Event":"08/30/2013 10:00 UTC","divs":["Sighting DetailsMy friends and I saw what looked like a faint light circling almost directly above us in the clouds on August 30th. I stayed on the same path for at least an hour and a half before we went inside for the evening. It was about 9:30 at night hen we first noticed the light which was long and thin but dull. About twenty minutes later, I noticed four lights just south of the one circling light converge in the center then separate about 20 feet each in four different direction and then converge at a center then spread out again. This also repeated over and over while the single cylindrical light kept circling on its path. They all were still visible until we went inside at about 11:00 that night. August 31st the lights were there again, but there was less cloud coverage. The lights still in the same locations, the one still circled while the other four converged then spread out, however, anytime the lights moved from the clouds, they could not be seen again until they were either over or under (I'm not sure which) the clouds. The light appeared to only visible through the clouds. Again they remained in the sky throughout the duration my friends and I were outside. On both nights helicopters flew near or close by the lights. These lights were seen in the Los Angeles sky. My friends and I thought it was a UFO and I thought it could also be a military object or something. We tried to locate the source for where the lights might have originated, but we couldn't determine any origination."],"map":"<A HREF = \"http://maps.google.com/maps?q=36.781451,+-119.410732(50414)&iwloc=A&hl=en\"> mufon case (50414) map </A>","Sighting Duration":"Undisclosed","Latitude":"36.781451","Object Shape":"Circle, Cylinder","Tags":"City","Weather Factors":"Unknown","trends":[],"Region":"California","Object Features":"Unknown","Case Number":"50414","Disposition":"Unresolved","Object Flight Path":"Path with directional change","Date Submitted":"09/04/2013 03:33 UTC","Log Number":"US-09042013-0004","files":["/var/www/straped/mufon/html2text/50414.html.txt","/var/www/straped/mufon/org/50414.html"],"Summary":"Faint light circling, converging then separating in the sky.","Longitude":"-119.410732"}