{"Source":"MUFON","Object Flight Path":"Hovering then path,Straight-line path,Other","Case Number":"50416","Sighting Duration":"00:00:25","Log Number":"US-09042013-0006","map":"<A HREF = \"http://maps.google.com/maps?q=35.994199,+-115.135465(50416)&iwloc=A&hl=en\"> mufon case (50416) map </A>","Object Shape":"Sphere","Latitude":"35.994199","files":["/var/www/straped/mufon/html2text/50416.html.txt","/var/www/straped/mufon/org/50416.html"],"Country":"United States","Tags":"City","Longitude":"-115.135465","Viewing Distance":"Over 1 Mile, Unknown","Object Features":"Unknown","Summary":"White Steady Light (Starlike in Size) Appeared & Moved West 25 Seconds Then Faded Out","trends":["There have been 36 other sightings in Henderson","There were no other sightings in Henderson on or around August 28th 2013"],"Date Submitted":"09/04/2013 09:59 UTC","Region":"Nevada","City":"Henderson","Weather Factors":"Unknown","divs":["sighting detailsi was out on my patio photographing the stars and constellations with my dslr and telephoto lens (with it zoomed out completely - this is a canon eos m camera using a ef 75-300mm f\\4-5.6 iii usm lens). at the time i was zoomed out as far as the lens allows, so for example, i could only fit two of the major stars in a constellation within the frame at a time. therefore this is a pretty small area of the sky (in twenty to thirty seconds the object traveled about the distance in the sky of half the length of a dollar bill if held up in front of your face). i verified through skywatch that this was not a satellite. i know that the two weather balloon launches that happen in vegas daily are in a completely different direction and besides, this traveled from side to side. it was also not a meteor as it had no tail and clearly had its own power, in addition it faded both into sight and out of sight. i noticed the object as it faded into visibility close to the area i was currently photographing. it started a pale blue green and quickly became bright white as it moved from east to west. its speed varied somewhat, it seemed to speed up as it became bright. i've seen a number of these objects before so i knew right away that it wasn't anything normal. as the object moved across the small area when it was visible, it began to fade back out of visibility from white to a pale orange and then was gone. i was unable to capture when it became visible as i was rushing to get the camera adjusted to the proper position. once i had it in the frame, i began shooting. within twenty seconds it was gone. the object had no blinking lights like a plane. the night was clear without any cloud cover. it was 4:44 am on thursday, august 28th, 2013. i verified via archived climate data that there was no wind at the time of my sighting. the images i have attached have been modified as such: - adjusted brightness and contrast slightly so that the stars and ufo are more easily visible against the background - added a yellow circle around the object to help show where it is located - decreased quality of the image to 95% when saving to lower the image size below 10 mb each"],"Disposition":"Unresolved","Date of the Event":"08/28/2013 04:44 UTC"}