{"City":"Centennial","map":"<A HREF = \"http://maps.google.com/maps?q=39.595173,+-104.960162(50411)&iwloc=A&hl=en\"> mufon case (50411) map </A>","Source":"MUFON","trends":["There have been 16 other sightings in Centennial","There were no other sightings in Centennial on or around September 2nd 2013"],"Log Number":"US-09042013-0001","Date Submitted":"09/04/2013 12:31 UTC","Sighting Duration":"Undisclosed","Object Features":"None","Case Number":"50411","Longitude":"-104.960162","Summary":"Flying Seven light chevron, slow Eastbound flight, sudden altitude gain over Centennial. Fractal chalk markings discovered outlining spacetime replication event.","Disposition":"Unresolved","Date of the Event":"09/02/2013 09:00 UTC","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Tags":"City","Weather Factors":"Unknown","Latitude":"39.595173","divs":["Sighting DetailsA friend and I were walking home through a park. We discovered an elaborate fractal chalk pattern in the parking lot behind South Suburban Ice Rink in Centennial Colorado. The chalk markings were spiral fractal, about fifteen feet in diameter. Another chalk picture ten feet away showed the infinity sign with two X in the center of the loops. I received an image of the fractal structure of spacetime and a conceptual understanding of where the spacetime transcription events occur. A few seconds later I looked up and pointed at the sky, having seen a seven light chevron shape, like a goose migrational pattern flying slowly and lowly overhead. There was no associated aircraft noise, totally silent. The craft was headed east along Arapahoe road, then very suddenly accelerated upwards, I could see the shape of the lights in tight formation warp to suggest the craft was flying parallel to the ground, then angled up nearly 80 degrees and ascended. My friend also saw it. We did not discuss what we had seen right away, however his description matched exactly whay I had seen when I asked him"],"files":["/var/www/straped/mufon/html2text/50411.html.txt","/var/www/straped/mufon/org/50411.html"],"Region":"Colorado","Object Flight Path":"Straight-line path","Country":"United States","Object Shape":"Chevron, Triangle"}