{"Tags":"City","Case Number":"50410","Weather Factors":"Unknown","Object Shape":"Star-like","Country":"Canada","trends":["There have been 32 other sightings in London","There were no other sightings in London on or around September 3rd 2013"],"Object Flight Path":"Path with directional change","Viewing Distance":"Unknown","divs":["sighting detailswhile we were walking west in south london, my husband stood behind me and put his hands on my shoulders. i thought he was trying to stop me from running into a skunk which have been plentiful in the city this summer. instead he pointed to the s\\w area of the sky about 25 degrees or so up from the horizon. there was an unusual light in the sky. my husband said it caught his attention because it was so bright and the colour was such a bright shade of red- both characteristics together seemed strange to him. it was moving horizontally from right to left, sw to w, across the southern sky. at first i thought it was a jet plane with its red landing lights flickering as they sometimes do. but the light was flickering and pulsating not just flickering\\blinking. the light seemed to be under intelligent control. it was a very controlled movement, not like one that was natural, i.e. movement due to wind. it seemed to be moving at the same rate of speed as a jet plane at some distance. have no idea how big the light source was or how fast it was going. the light changed colour from red to orange. i don't think plane lights change colour. it also faded in intensity plus it was flickering and pulsating. then the light brightened up again and then changed colour, again, this time to bright blood red. then the light changed colour from bright blood red to bright purple or violet. at that point, i said no, that's not right. planes are never a bright, reddish-purple-violet, flickering, pulsating light... then the light changed colour again back to orange red and was flickering in and out of view. then it did a slow u turn to travel back in the same direction it had come. at this point we lost sight of it as it went behind some trees. in all the sighting lasted only about 30 to 40 seconds. i don't know what to think. it didn't look like a plane. i've really only seen flares on video. i don't know if flares can travel across the sky and change direction. unfortunately we did not have our cell phone with us but i don't know what would have been captured on camera even if we'd tried. we were too busy watching this light intently as it kept changing colours and the length of the duration of the sighting was pretty short. i don't know what to think. strangest thing i think i've ever witnessed as an mysterious light in the sky."],"Latitude":"42.99213","Disposition":"Unresolved","City":"London","Object Features":"Unknown","Sighting Duration":"00:00:30","files":["/var/www/straped/mufon/html2text/50410.html.txt","/var/www/straped/mufon/org/50410.html"],"Date Submitted":"09/03/2013 10:52 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.99213,+-81.235577(50410)&iwloc=A&hl=en\"> mufon case (50410) map </A>","Source":"MUFON","Longitude":"-81.235577","Summary":"Mysterious light in SW sky travelling from right to left","Log Number":"CA-09032013-0030","Date of the Event":"09/03/2013 09:05 UTC","Region":"Ontario"}