{"Longitude":"-83.240525","Sighting Duration":"00:05:00","Object Flight Path":"Hovering then path","Date of the Event":"09/03/2013 09:15 UTC","Source":"MUFON","Latitude":"42.300149","Country":"United States","Summary":"4 ufos hovering and then ascended out of sight, 1 ufo bright pulsating white light every 1-2 seconds - seemed really far (maybe satellite distance)","Viewing Distance":"Over One Mile","Disposition":"Unresolved","Object Features":"Unknown","divs":["sighting details4 of us witnessed 4 ufos hovering\\flying over dearborn mi at around 9 pm on sept. 3 2013. one after another they seem to ascend out of this earth..their lights seemed to become smaller and smaller until their lights faded away( this happened pretty quickly- within seconds) the ufos looked like a red orange-ish color (like the fireball description). after a minute, we start seeing this pulsating bright white light(every second or two) (seemed to be about satellite distance) but it seemed to be moving because it was not stationery. after a minute or two we start seeing 2 crafts (probably stealth planes) with green and red flashing lights on each craft flying at a really high altitude around the same area were the 4 ufo and 1 bright pulsating lights were. i captured this with a photo and video. video is too large to submit.+"],"Case Number":"50421","Weather Factors":"Unknown","Tags":"City","Region":"Michigan","trends":["There have been 7 other sightings in Dearborn","There were no other sightings in Dearborn on or around September 3rd 2013","This sighting has never been favorited.",""],"Log Number":"US-09042013-0011","files":["/var/www/straped/mufon/html2text/50421.html.txt","/var/www/straped/mufon/more/50421_submitter_file1__20130903T2238370.jpg","/var/www/straped/mufon/org/50421.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.300149,+-83.240525(50421)&iwloc=A&hl=en\"> mufon case (50421) map </A>","Object Shape":"Fireball, Star-like","City":"Dearborn","Date Submitted":"09/04/2013 11:37 UTC"}