{"Date Submitted":"09/04/2013 04:40 UTC","divs":["sighting detailsi went salmon fishing on lake michigan at the michigan city light house at 5 a.m on 9\\3. i noticed at 5;15 as i was casting north and looking north west at downtown chicago when i noticed a bright star take off and fly from west to east over the lake,flying real fast then slow down then rael fast then flew east to west then headed up the chicago coast north then headed back out to the lake east and up untill it dissapeared.a few minites later there it was again,this bright star stationary,then it flew from west to east at a 40% angle till it hit the water and it was gone again. a few minites went by and there it was again.this time i saw two of then flying in the same direction. one, i could see well,the other was a mile or so from the other and you could barly see the second one.this went on for 24 minites. the next morning 9\\4,i got out there to fish,instead i sat at the pinic tables and looked over the water and saw the same thing but this time they were further out in the middle of the lake and you could barly see them.i will try tonite and see what happens.i go fishing a lot in the dark and, am quite familar with all the nite skys lights, and this is the second sighting i have had over lake michigan in 45 years.these on 9\\3 and 9\\4 were orbs."],"Case Number":"50428","Latitude":"41.713009","Log Number":"US-09042013-0018","Object Features":"Unknown","trends":["There have been 15 other sightings in Michigan City","There were no other sightings in Michigan City on or around September 3rd 2013"],"Object Shape":"Star-like","Weather Factors":"Unknown","Region":"Indiana","Object Flight Path":"Stationary,Straight-line path,Path with directional change,Path then hovering,Other","Sighting Duration":"Undisclosed","City":"Michigan City","files":["/var/www/straped/mufon/html2text/50428.html.txt","/var/www/straped/mufon/org/50428.html"],"Longitude":"-86.89359","Viewing Distance":"Over One Mile","Tags":"City","Disposition":"Unresolved","Date of the Event":"09/03/2013 05:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.713009,+-86.89359(50428)&iwloc=A&hl=en\"> mufon case (50428) map </A>","Summary":"the past two mornings two balls of light were flying over lake michigan like a dragon fly would fly between 5;15am till 5;45","Source":"MUFON","Country":"United States"}