{"Weather Factors":"Unknown","Summary":"The UFO moved in a wierd way, travelling from left to right and right to left while gradually ascending.","Source":"MUFON","Sighting Duration":"Undisclosed","City":"London","map":"<A HREF = \"http://maps.google.com/maps?q=51.61403,+-0.140604(50423)&iwloc=A&hl=en\"> mufon case (50423) map </A>","Case Number":"50423","Region":"","Log Number":"GB-09042013-0013","trends":["There have been 154 other sightings in London","There were no other sightings in London on or around January 1st 2013"],"Object Features":"Other, Unknown","Date of the Event":"01/01/2013 04:30 UTC","Tags":"City","Country":"United Kingdom","Object Shape":"Unknown","Longitude":"-0.140604","Date Submitted":"09/04/2013 12:26 UTC","divs":["sighting detailsit was about 4:30am on january 1st (new years) i had just got back to my mates house standing on his door-step smoking a cigerette when i had noticed what looked like an airplane 'towing' another airplane in the sky and quickly realised its not possible. the object was coming directly towards me and my mate, it turned right going across the sky from left to right and i noticed what it actually was, it was a rectangular shape with a bright white light on either of the bottom 2 corners and red lights flickering from left to right across it. it moved in a wierd way, while travelling from left to right it was ascending above the tree line\\houses, in one quick move it changed from left-right to right-left whithout rotating or any other sign of movement still ascending but very slowly. at this time i went running down the street with my phone camera out but the street lamps were too bright for my camera to see it, after changing direction from left-right to right-left 3 times the ufo was out of my sight behind the houses. since that morning no one has believed our story saying we were hallucinating, i know to this day what i saw that morning was a ufo and i will until the day i die. it still blows my mind."],"files":["/var/www/straped/mufon/html2text/50423.html.txt","/var/www/straped/mufon/org/50423.html"],"Object Flight Path":"Path with directional change,Unknown","Latitude":"51.61403","Disposition":"Unresolved","Viewing Distance":"101-500 Feet, Unknown"}