{"City":"Carlsbad","Latitude":"32.423684","trends":["There have been 12 other sightings in Carlsbad","There were no other sightings in Carlsbad on or around April 1st 2008"],"Summary":"The 3 objects appear in Google Maps street-level photograph","Date Submitted":"09/04/2013 12:06 UTC","Country":"United States","Tags":"City","Longitude":"-104.224618","files":["/var/www/straped/mufon/html2text/50422.html.txt","/var/www/straped/mufon/org/50422.html"],"Object Flight Path":"Unknown","Region":"New Mexico","Weather Factors":"Unknown","Source":"MUFON","Object Features":"Unknown","Date of the Event":"04/01/2008 12:00 UTC","Disposition":"Unresolved","Case Number":"50422","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.423684,+-104.224618(50422)&iwloc=A&hl=en\"> mufon case (50422) map </A>","Object Shape":"Sphere","divs":["Sighting DetailsI'm frequently exploring the planet via the GOOGLE SATELLITE MAPS, and there are tons of strange (unexplained) items showing up in their photographs. I seem to have a gift for finding these things. This is my first time reporting any of my findings. Attached is one of my latest discoveries (I don't know if anyone else in the world has noticed or reported this specific item yet). I'm attaching a PDF file containing a 6-page, step-by-step presentation of images furnished in the GOOGLE MAPS, documenting what I've found. NICAP-REQUIRED INFORMATION: 1. Where were you and what were you doing at the time? Exploring photos of planet earth via Google Maps 2. What made you first notice the object? Objects in photo appear to be unusual phenomena 3. What did you think the object was when you first noticed it? Something unusual and unexplained 4. Describe the object and its actions and motions in detail. Seems spherical and emanating something that perturbs the surrounding air 5. Describe your feelings, reactions and actions, during and after sighting the object. Wanted to report to an agency for follow-up investigation 6. How did you lose sight of the object? Object is only seen in a single Google Maps street-level photo"],"Log Number":"US-09042013-0012","Sighting Duration":"Undisclosed"}