{"Summary":"Pulsating/flashing multiple lights on an object in the Northern Sky","Case Number":"50430","Longitude":"-94.32042","Log Number":"US-09042013-0020","City":"Lee's Summit","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.006378,+-94.32042(50430)&iwloc=A&hl=en\"> mufon case (50430) map </A>","Disposition":"Unresolved","Object Shape":"Disc","Viewing Distance":"Unknown","Source":"MUFON","Object Features":"Unknown","Date of the Event":"09/04/2013 04:00 UTC","Country":"United States","Latitude":"39.006378","Weather Factors":"Unknown","Region":"Missouri","trends":["There have been 52 other sightings in Lee's Summit","There were no other sightings in Lee's Summit on or around September 4th 2013","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/50430.html.txt","/var/www/straped/mufon/more/50430_submitter_file1__IMG2650.JPG","/var/www/straped/mufon/more/50430_submitter_file2__IMG2651.JPG","/var/www/straped/mufon/more/50430_submitter_file3__IMG2652.JPG","/var/www/straped/mufon/org/50430.html"],"Date Submitted":"09/04/2013 05:11 UTC","divs":["sighting detailsi awoke from sleep at 4am and went to the sofa. while i was checking email i noticed a vibrant sparkling\\pulsating\\flashing light in the window above my front door - facing north. as i walked towards the door\\window i didn't see it and thought it was gone but as i backed up it came into view again so it was fairly high. i went to a different window in the house and saw it still, pulsating and every so often it would appear to have a ring. next i got the binoculars and couldn't believe what i saw. it was very far, i could see red, white, blue and green flashing lights and at times i could see a small disc shaped object. i say small because i needed the binoculars to be sure. in addition, it seemed to have a couple small - tiny small - lights come out of it. at this time i awoke my husband to have proof. he observed the same details as me and returned to bed. during this time the object started in the center of the window above my front door, moved slightly to the left and ended up to the right which told me i was not seeing a planet or star. in addition, it was a beautiful star filled sky. the stars were very bright, none were pulsating but this and it was very near the big dipper. i tried to take pictures with my iphone but they look like a white dot. so i attempted to take them with my canon 40d with a high aperture and no flash but they aren't good because the object was so far away it appears solid white. i was not able to capture the flashing\\twinkling\\sparkly lights. i can however see a red, green, and white, dot of light around the perimeter of the main object. notice in the 3 pictures the location of the red, blue and white lights in perspective to the main object are different in each image. the main object remained unmoved until around first light when you could still see the stars but it was gone. i didn't see it leave. my daughter woke up and we didn't want her to be afraid."],"Tags":"City","Object Flight Path":"Stationary,Hovering then path"}