{"Latitude":"40.772114","Sighting Duration":"Undisclosed","Source":"MUFON","Viewing Distance":"Unknown","Date of the Event":"09/04/2013 12:00 UTC","divs":["sighting detailsworking notes: facebook, 6:05 am 9\\4\\13, (name withheld), a facebook friend alerted me: \"scott..around 5:30 this morning klkn reported a strange light changing colors near the tv station..their trying to explain it away...its a triangle shape and they say it looks like teathers hanging off of it...theyve mentioned it all morning..its above the klkn tower...something to check out...\" (end of quote). i called the klkn newsroom, bumped to two people who knew nothing about what i was seeking info about, and then referred me to sean, meteorologist, 9\\4\\13, 12:22 pm, gone home, left voice mail for him to return my call. left voice mail for mark hager, news director. 3:30 pm, sent e-mails asking for additional info to klkn weather and klkn news departments. contact: channel 8 klkn-tv main telephone number-402-434-8000 address: klkn-tv, 3240 south 10th street, lincoln ne 68502 called lpd (lincoln police department) dispatch, 402-442-6000, asked if any reports had come in, phone operator said no, then i asked to have someone within the department call back, and she said a sargeant would call me back. sent a friend (name withheld) a facebook message (works at klkn) for info. sargent towle, lpd, 12:37 pm via return phone call, said he came to work at 6 am and no one has called in, and no officer has talked about it. (name withheld), manager at u-stop convenience store, at 12:50 pm via phone, 1421 centerpark rd, said she can see the broadcast tower from her vantage point, and no one has mentioned anything. super c convenience store, 3202 s. 10th st, (name withheld), called him 1:10 pm, he came to work at 5:30 am, didn't see anything, no one has mentioned it. klkn has posted two pictures on their facebook page. facebook page name: channel 8 eyewitness news. i have captured both images on my computer. left message at nebraska national guard public relations department, 402-471-3241, 3:10 pm, to inquire if the guard had any helicopters or aircraft over or around lincoln, ne, between 5 - 6 pm. left message with the lancaster county sheriff's department, 3:15 pm. called back by officer lang at 3:30 pm, no one has contacted the sheriff's department, and, no officers have reported anything. posted on (name withheld) facebook page, posting klkn tv picture and asking him for his input. he is a meteorologist for unl. end of working notes as of this time and date."],"trends":["There have been 42 other sightings in Lincoln","There were no other sightings in Lincoln on or around September 4th 2013","This sighting has never been favorited.",""],"Disposition":"Unresolved","Date Submitted":"09/04/2013 05:14 UTC","Object Flight Path":"Stationary","Country":"United States","Case Number":"50431","Object Shape":"Triangle","Log Number":"US-09042013-0021","Summary":"KLKN TV Lincoln, NE, broadcast pictures from their tower cam the early morning of 9/4/13","Region":"Nebraska","map":"<A HREF = \"http://maps.google.com/maps?q=40.772114,+-96.717169(50431)&iwloc=A&hl=en\"> mufon case (50431) map </A>","files":["/var/www/straped/mufon/html2text/50431.html.txt","/var/www/straped/mufon/more/50431_submitter_file1__KLKNearlierimageSeptember42013.png","/var/www/straped/mufon/more/50431_submitter_file2__KLKNTVSeptember42013.png","/var/www/straped/mufon/org/50431.html"],"Weather Factors":"Unknown","Object Features":"Patterned Surface","Longitude":"-96.717169","City":"Lincoln","Tags":"City"}