{"Case Number":"50437","map":"<A HREF = \"http://maps.google.com/maps?q=41.692327,+-88.289232(50437)&iwloc=A&hl=en\"> mufon case (50437) map </A>","Disposition":"Unresolved","Latitude":"41.692327","Object Flight Path":"Straight-line path","Log Number":"US-09042013-0027","Date Submitted":"09/04/2013 10:48 UTC","Sighting Duration":"00:00:02","Country":"United States","divs":["Sighting DetailsI was at the front door of my house watching my girlfriend get to her car safely because she was leaving to go home. At the same time my dog was sitting on my porch watching my girlfriend leave as well. After she left, I attempted to let my dog back into my house but he refused so I let him stay outside a little longer knowing he was not going to want to be there out much longer. I waited at my door and decided to look at the sky to search for stars and enjoy the night sky. I looked straight ahead towards the East and saw a commercial airplane that was miles away coming my way towards the West! Not less than a second later to the Southeast of my position I saw a greenish-white orb zoom past over my neighborhood coming from the West and heading to the East at an astonishing speed! It lasted no more than two seconds and disappeared before my eyes! I did not blink at all and nothing got in my way. The UFO was silent and did not leave any trails what so ever. It did not blink but instead maintained the glowing light it gave off. Right after I saw the UFO I looked back at the airplane and it was still coming in the same direction and same location it was before I saw the UFO. Then I let my dog in and called my girlfriend to tell her the exciting and bizarre news! I also yelled for my family to tell them what I saw as well even though I knew most of them were going to be skeptical. Then I continued to look at the sky to see if I could see anything like it again! I know this was not a commercial airplane because for thirteen years I lived near O'Hare International Airport and I am familiar with their speed, size, lights, and sound. I know it was not a small airplane because they fly around where I live now and I know how fast they travel and how they look, sound, and how their lights blink on and off. None of the aircraft I have seen before, have a non-blinking light. It amazes me at how fast this thing traveled and how it did not make any sound at all and disappeared before my eyes. I must admit while I was excited to see it, I felt a little scared because I did not know what it's intentions were and I still don't. This is a mystery and I hope one day I can solve it and figure out what was going on in the night sky above me!"],"Object Shape":"Circle, Sphere","Weather Factors":"Unknown","Date of the Event":"08/28/2013 09:44 UTC","Region":"Illinois","Longitude":"-88.289232","Source":"MUFON","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Tags":"City","Object Features":"Unknown","City":"Oswego","Summary":"Greenish-white orb UFO seen, then disappear out of nowhere!","files":["/var/www/straped/mufon/html2text/50437.html.txt","/var/www/straped/mufon/org/50437.html"],"trends":["There have been 6 other sightings in Oswego","There were no other sightings in Oswego on or around August 28th 2013"]}