{"Object Features":"Unknown","City":"Pacific Grove","Viewing Distance":"Unknown","Tags":"City","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=36.620677,+-121.912452(50446)&iwloc=A&hl=en\"> mufon case (50446) map </A>","Case Number":"50446","Object Shape":"Cone, Disc, Sphere, Star-like, Triangle","Longitude":"-121.912452","Sighting Duration":"Undisclosed","Country":"United States","divs":["sighting detailsthis morning i was awoken by a neighbor's visitor leaving around 5:30 a.m. i got up to make coffee and looked out to the sky, usually over the monterey bay from our kitchen window. i then looked out the living room window and saw a very bright light in the sky. i thought at first it was a planet or bright star. it seemed to be pulsating. i grabbed the binoculars to see it more clearly. it pulsated and rotated, had multi-colored lights outlining its shape and seemed to be multi-dimensional. it hovered about in approximately the same position for about 1\\2 hr. of course i was excited, so woke up my husband and asked him to grab the camera to record video of it. he reluctantly got up and retrieved the camera which i then attempted to capture what i saw with the binoculars. other stars were in the sky, but not nearly as bright as this light. planes also were observed to fly below this area, in a straight flight pattern with one red flashing light. when i looked back up to the sky around 6:30 a.m., this light anomoly was gone. the sun was coming up, and it was no longer visible. i've witnessed 2 other similar sitings during the past month over monterey bay."],"Latitude":"36.620677","Weather Factors":"Unknown","trends":["There have been 6 other sightings in Pacific Grove","There were no other sightings in Pacific Grove on or around September 5th 2013"],"Date Submitted":"09/05/2013 10:56 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/50446.html.txt","/var/www/straped/mufon/org/50446.html"],"Disposition":"Unresolved","Log Number":"US-09052013-0008","Summary":"bright object in SE direction of sky observed","Date of the Event":"09/05/2013 12:00 UTC","Object Flight Path":"Hovering then path"}