{"Summary":"A White Object was in front of a plane flying at approximately 15,000 feet. The object was very close to the plane and then it just disappeared in a blink of an eye. The aircraft was a commercial airliner and had a contrail but the object did not.","Latitude":"38.920295","trends":["There has been one other sighting in Chantilly","There were no other sightings in Chantilly on or around September 5th 2013"],"Object Features":"None","Object Flight Path":"Straight-line path","Date of the Event":"09/05/2013 12:00 UTC","Source":"MUFON","Date Submitted":"09/05/2013 10:46 UTC","Region":"Virginia","Disposition":"Unresolved","Tags":"City","Country":"United States","Longitude":"-77.49795","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/50444.html.txt","/var/www/straped/mufon/org/50444.html"],"Object Shape":"Unknown","divs":["sighting detailsi was sitting in my front porch having my morning coffee and was on a conference call. i happened to glance at the sky and saw an airplane flying at approximately 15,000 - 18,000 ft altitude. there was an object (white) flying in front of the plane. this object seemed rectangular (difficult to ascertain the shape at that altitude) and was white in color. the object was at the same altitude as the commercial airliner. what caught my eye was that the plane had a contrail but the object did not. the second thing that caught my eye was that the object was very close to the airplane (less than an inch from my vantage point). the object stayed in-front of the plane for approximately 2 minutes and then simply disappeared (vanished). i thought it may be the reflection from the plane since the plane was flying north\\west and the sun was in the east but then i saw additional planes flying at the same altitude in approximately the same flight path and they did not have any reflections or objects around them. the pilots of this plane must have seen the object since the size of the object and the altitude was similar to the plane. the plane seemed like a commercial airliner (airbus\\boeing) and the object was of similar size if not bigger. the object was simply leading the airplane and did not perform any unusual motions but to me it seemed like it was hovering in front of the plane. the airplane did not take any evasive actions but simply continued in a straight line. only after the object disappeared did the plane bank five degrees to the right and continued in its path. it was very strange. i live near dulles airport, so see airplanes quite frequently and this plane given it altitude, could not have taken off from dulles but rather points south or south\\east."],"Log Number":"US-09052013-0006","map":"<A HREF = \"http://maps.google.com/maps?q=38.920295,+-77.49795(50444)&iwloc=A&hl=en\"> mufon case (50444) map </A>","City":"Chantilly","Case Number":"50444","Viewing Distance":"Over One Mile"}