{"divs":["Sighting DetailsFor over a month on a near nightly basis, I , myself and friends have witnessed a strange, large object in the western sky Sometimes it is accompanied by other lights. On this particular night.The large object ( much bigger than a star ), appeared . This object was bright yellow, white, green . It pulsated. I looked through my binoculars the object seemed to change shape from a sphere to an ellipse . It emitted energy appendages . The object hovered for 10 minutes and then slowly moved. It then moved to one spot and stayed for about 5 minutes. It grew brighter and dimmed. This object is in the flight path of the airport. Two planes approached from different directions and when the planes got close it immediately disappeared . I have 100 photos .I have 3 nights of video on my sony night-vision camera . I felt a direct connection to this object. I did not feel fear but I really believe it knew I was watching . I would love to find people with similar sightings in this area to compare notes I have tried to talk to the media, the FAA, Kennecott Copper, the Salt Lake INternational Airport anybody I can think of. The most helpful people have been astronomers in our area and they said this is not conventional ."],"Object Shape":"Sphere, Star-like","Weather Factors":"Unknown","Case Number":"50443","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.770069,+-111.886167(50443)&iwloc=A&hl=en\"> mufon case (50443) map </A>","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/50443.html.txt","/var/www/straped/mufon/org/50443.html"],"Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Summary":"Salt Lake strange happenings","Tags":"City","Longitude":"-111.886167","Object Flight Path":"Hovering then path","Latitude":"40.770069","Region":"Utah","Country":"United States","City":"Salt Lake City","Log Number":"US-09052013-0005","Date Submitted":"09/05/2013 08:47 UTC","Disposition":"Unresolved","trends":["There have been 73 other sightings in Salt Lake City","There was one other sighting in Salt Lake City on or around September 3rd 2013"],"Date of the Event":"09/03/2013 09:15 UTC"}