{"Sighting Duration":"00:04:22","Weather Factors":"Unknown","Latitude":"40.731028","Summary":"I witnessed two bright orange lights hovering down town Bayonne.","City":"Jersey City","Date Submitted":"09/05/2013 10:56 UTC","Region":"New Jersey","Source":"MUFON","files":["/var/www/straped/mufon/html2text/50445.html.txt","/var/www/straped/mufon/org/50445.html"],"Case Number":"50445","Object Features":"Unknown","Viewing Distance":"21-100 Feet","trends":["There have been 7 other sightings in Jersey City","There were no other sightings in Jersey City on or around September 4th 2013"],"Country":"United States","Log Number":"US-09052013-0007","Longitude":"-74.075852","map":"<A HREF = \"http://maps.google.com/maps?q=40.731028,+-74.075852(50445)&iwloc=A&hl=en\"> mufon case (50445) map </A>","Date of the Event":"09/04/2013 09:48 UTC","Tags":"City","Disposition":"Unresolved","Object Flight Path":"Stationary","divs":["Sighting DetailsIt was about 9:40 on Wednesday night, I was driving home from work . I work at Newark Liberty Airport. I was heading down Broadway, in Bayonne to pick up my wife and month old son. While driving past the old blockbuster store on 23rd street , I saw an orange light appear to my left. I found this strange because I can usually tell the difference between an airplane and helicopter by the lights that flash. This orange light did not flash nor move. For some reason I just couldn't stop looking at the light. A few seconds later, about 100 yards away, a second orange light appeared. This is when I knew I was watching something different.When I reached 9th street the lights just disappeared.I told my wife,mom and sisters but no one believed me.So we all squeezed into car to see if I could see them again. After about 15 minutes my sisters and I saw two orange lights just appear over the down town diner, but these lights were just about 20 yards apart. With in 2 seconds these lights just faded and disappeared. I couldn't believe I saw what I saw. I know what a plane and helicopter look like, this was something different. The lights didn't make a sound, and when I got home with my wife and son 10 minutes later, my wife asked me if I was alright? I said yeah why? She said I looked really pale and I was sweating a lot. I had trouble sleeping as well. I know what I saw,now its all I think about some hours later."],"Object Shape":"Star-like"}