{"trends":["There have been 73 other sightings in Salt Lake City","There was one other sighting in Salt Lake City on or around September 4th 2013"],"Country":"United States","files":["/var/www/straped/mufon/html2text/50442.html.txt","/var/www/straped/mufon/org/50442.html"],"Summary":"2 red and green lights rose from behind Ensign peak changed directions several times, then slowly descended behind the mountain","Log Number":"US-09052013-0004","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.799922,+-111.884852(50442)&iwloc=A&hl=en\"> mufon case (50442) map </A>","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was sitting at the corner of 300s and Northbound West Temple in my bosses car waiting to pick him up at sometime between 10:55 and 11:00 PM. I was looking out the windshield of the car when I saw a pair of red and green lights to the North shoot up 15 degrees approximately 2.5 miles away, from behind Ensign peak. The velocity of the object made me think it might have been a firework of some sort but it abruptly halted and hovered for a few seconds. It began moving towards the east but changed directions almost instantly and then rapidly traveled West until it reached about 5 degrees west of West Temple and then slowly descended slightly eastbound, like a feather that has been dropped. It hovered about 2 degrees West of Ensign peak for about 5 seconds before disappearing behind the mountain again. At the beginning of the event, both lights were approximately the same amount of brightness but as the object began traveling west the green light clearly dominated over the red. I must note that this object accelerated and decelerated at a much quicker rate than any aircraft I have ever seen. The entire event lasted approximately 30 seconds. At first I was filled with disbelief, trying to come up with an explanation. The only plausible one I could think of was that the object was some sort of recreational civilian drone, but it seems implausible that somebody would be flying it at night and that it would be large enough for me to see, the back side of Ensign peak, where the object originated and eventually disappeared, being approximately 2.5 miles away."],"Date Submitted":"09/05/2013 03:38 UTC","Date of the Event":"09/04/2013 10:58 UTC","Tags":"City","Disposition":"Unresolved","Viewing Distance":"Over One Mile","Object Shape":"Sphere","Region":"Utah","Longitude":"-111.884852","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Case Number":"50442","City":"Salt Lake City","Weather Factors":"Unknown","Latitude":"40.799922","Source":"MUFON"}