{"Longitude":"-68.817673","City":"Bangor","divs":["sighting detailsnorthern\\central maine,usa, august,approx 9:30pm. i went out to my yard with a camera to record the night sky, the moon & stars ect. i looked up(s)and saw a close,low flying intense bright lighted object & notice there was no sound. it was moving from s to n-nw. i called to my gf to come out and see, she was witness to the event. i began recording with the camera and was eventually able to stabilize it on a tripod and record it moving low across the sky. when i lost sight of it behind the trees, i ran to an open area and continued filming until it disappeared. it flew low and hovered silently and steadily in the sky at approx 30 degrees, just over the power line, trees and eventually the hovered over the river for approx 2 minutes. there are several points of reference in the video, trees, buildings & the horizon. it did not appear to be a plane, helicopter,balloon or shooting star ect. i feel as thou it is something anomalous or supernatural. some of the erratic movement in the video is caused by the camera being set on the tripod. then it disappeared. (note) i have attached a video of the event."],"files":["/var/www/straped/mufon/html2text/50447.html.txt","/var/www/straped/mufon/org/50447.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=44.854767,+-68.817673(50447)&iwloc=A&hl=en\"> mufon case (50447) map </A>","Region":"Maine","Latitude":"44.854767","Object Flight Path":"Path then hovering","Sighting Duration":"Undisclosed","Summary":"I went out to my yard to record the stars, moon & sky. When I looked up I saw a ball of light, moving silently, low in the sky.","Date Submitted":"09/05/2013 11:14 UTC","Date of the Event":"08/25/2013 09:30 UTC","Weather Factors":"Unknown","Source":"MUFON","Country":"United States","Case Number":"50447","trends":["There have been 18 other sightings in Bangor","There were no other sightings in Bangor on or around August 25th 2013","This sighting has never been favorited.",""],"Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-09052013-0009","Object Shape":"Sphere","Disposition":"Unresolved","Object Features":"Unknown"}