{"Longitude":"-79.699031","Disposition":"Unresolved","Source":"MUFON","Region":"Pennsylvania","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.439968,+-79.699031(50448)&iwloc=A&hl=en\"> mufon case (50448) map </A>","Summary":"Slow, silent, low flying black, triangular object directly above us.","Date Submitted":"09/05/2013 01:02 UTC","Object Features":"None","Tags":"City","trends":["There have been 2 other sightings in Oil City","There were no other sightings in Oil City on or around September 4th 2013"],"Object Shape":"Triangle","Log Number":"US-09052013-0010","Latitude":"41.439968","City":"Oil City","Case Number":"50448","Date of the Event":"09/04/2013 09:15 UTC","divs":["Sighting DetailsIt was a clear, chilly evening on Sept. 4, 2013 approx. 9:15p.m. my fiance and I had just got home from a dinner with my parents, my dad was dropping our dog off at our house and as he was leaving I saw a bright light off in the distance approx. 3-5 miles away, in an easterly direction. As my father is a pilot, I tried to get him to see it, but the object had disappeared beyond the treeline. I left it at that, as he invited us to his house to show us his latest work on his fireplace. So as my girlfriend and I were going to our car and I happened to look up as it was a star filled sky and the bright light was still in my mind, the time that had passed since seeing the light was about ten minutes. What I saw when I looked up absolutely shocked me. It was a totally silent, black triangular shaped craft, it's shape was perfectly outlined against the night sky. It must have been over 100 feet wide and only 500-1500 feet max above the trees, with a bright white light on each point, and a red beacon in the center. I immediately thought B-2 bomber, but then thought we don't usually have those flying over PA, and why would it be flying so low...and then it really hit me as to how slow it was going. It could of only been doing 50mph at most! Now coming from a background in aviation, I really was bothered because something that big should stall at that slow of speed. We jumped in our car as we did not have a camera and drove to my parents house just up the road to get them to see it and possibly get a camera. It took almost 5 minutes for it to travel out of our line of sight! They got to see just the tail end of it off in the distance. It just slowly flew off into the horizon in a north easterly direction. I personally believe it was a military craft of some sort...Regardless it was an unknown craft that was very bizarre in size, speed, and altitude."],"Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Country":"United States","files":["/var/www/straped/mufon/html2text/50448.html.txt","/var/www/straped/mufon/org/50448.html"]}