{"Summary":"Bright pulsating light Southern Indiana","Case Number":"50454","Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","Date of the Event":"09/02/2013 12:00 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.324884,+-86.029181(50454)&iwloc=A&hl=en\"> mufon case (50454) map </A>","Log Number":"US-09052013-0016","divs":["sighting detailsi went outside about 12:20 on 9\\2 2013. i noticed a light to the northeast about 4 or 5 times the size of a star. it was moving slightly and pulsating what looked like white and yellow or orange light. i thought it might be a drone since i knew it wasn't a plane or helicopter. my wife saw it too and went to get her tablet to record video of the object. i also called my daughter to see it she also could not explain what we were seeing. it looked unlike anything we had ever seen in the sky. as i was recording the object my wife noticed another one to the east and at some point a third came into view between the other two but further off in the distance. when i zoomed in on the first object it looked like a diamond shape that changed to a square as well as changed colors and intensity. during the recordings a second light appeared which made me wonder if the light was the object or just a light on a bigger object. when both lights were visible it looked like it could have been a horse shoe shape with light on each end. it was hard to tell all i know is i never saw anything like it before. i watched for over two hours and they were still there when i went to bed at 2:45"],"Viewing Distance":"501 Feet - 1 Mile","trends":["There has been one other sighting in Georgetown","There were no other sightings in Georgetown on or around September 2nd 2013"],"Disposition":"Unresolved","Country":"United States","Weather Factors":"Unknown","Region":"Indiana","Latitude":"38.324884","Object Shape":"Diamond","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/50454.html.txt","/var/www/straped/mufon/org/50454.html"],"Longitude":"-86.029181","Date Submitted":"09/05/2013 09:14 UTC","City":"Georgetown","Source":"MUFON"}