{"Source":"MUFON","Date Submitted":"09/05/2013 09:46 UTC","Object Features":"Unknown","divs":["Sighting DetailsI was coming back from the movies with my mom and friend heading into downtown bakersfield and i noticed a light in the sky through the car windshield.At first i thought it was a plane or helicopter cause you see them all the time around there but it was too high to be a helicopter so then i moved on to it being a plane and the lights on it shined so bright not like a planes lights would shine it was moving really slow but the lights on it shocked me they blinked so bright but it started moving towards my neighborhood and then it disapeared. Later when i was outside my house waited for my friend i saw it again.It was the same object cause it had those bright lights and was moving slow i've seen helicopters and planes in my neighborhood i know what they look like i see them all the time flying by this object didn't look like either one.It was moving over the park i could see it over my friends house.It kept moving back and forth in the same spot my friend finally came and he saw it again too it was very strange how it kept on moving back and forth in the same spot like it was observing. As it was moving back and forth i listend for sound and i didn't hear any sound coming from it.Me and my friend went back inside because we didn't know what it was gonna do. I don't know what it was we saw that night but it was very strange."],"Object Shape":"Oval","Case Number":"50455","City":"Bakersfield","Region":"California","Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=35.379088,+-119.008541(50455)&iwloc=A&hl=en\"> mufon case (50455) map </A>","Log Number":"US-09052013-0017","trends":["There have been 32 other sightings in Bakersfield","There were no other sightings in Bakersfield on or around August 31st 2013"],"Tags":"City","Date of the Event":"08/31/2013 09:45 UTC","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/50455.html.txt","/var/www/straped/mufon/org/50455.html"],"Disposition":"Unresolved","Sighting Duration":"01:45:15","Latitude":"35.379088","Longitude":"-119.008541","Summary":"I was driving with my mom and friend and saw a bright light in the sky","Country":"United States","Weather Factors":"Unknown"}