{"Weather Factors":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=26.161959,+-97.986987(50451)&iwloc=A&hl=en\"> mufon case (50451) map </A>","trends":["There has been one other sighting in Weslaco","There were no other sightings in Weslaco on or around September 5th 2013"],"Viewing Distance":"101-500 Feet","Object Flight Path":"Stationary,Path then hovering","Disposition":"Unresolved","Longitude":"-97.986987","files":["/var/www/straped/mufon/html2text/50451.html.txt","/var/www/straped/mufon/org/50451.html"],"Summary":"Saw a strange black circle flying in the sky with 3 orange glowing lights under it. It would fly in one direction, then stop and just hover.","Object Shape":"Sphere","Country":"United States","Latitude":"26.161959","divs":["Sighting DetailsI was sitting outside in a chair, just relaxing, trying to get my mind off things. I first noticed the object when came up in the distance then just started hovering stationary right in front of me. I didn't know what the object was because I had never seen any earthly vehicles do what it did. It was a black circle with 3 orange-red glowing lights that would pulsate and in the middle of it was an extremely bright little blinking white light that would blink at random. It would fly around really slowly, then just stop for about two minutes, then hover to another direction and do the same thing. I felt fascinated, yet kind of scared but not in danger in a way, making me just sit there and watch it. After about 3 minutes of it just hovering in front of me as if it was observing me, it took off slowly to the north, directly over my neighborhood. I live in an area between where it's rural, but kind of close to the city. I see weird things every once in awhile."],"Date of the Event":"09/05/2013 06:00 UTC","Source":"MUFON","City":"Weslaco","Region":"Texas","Case Number":"50451","Object Features":"Dome","Log Number":"US-09052013-0013","Date Submitted":"09/05/2013 07:32 UTC","Sighting Duration":"Undisclosed"}