{"Longitude":"-97.401543","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.438339,+-97.401543(50452)&iwloc=A&hl=en\"> mufon case (50452) map </A>","Latitude":"35.438339","divs":["Sighting DetailsI had just left my Girlfriends house outside of winston salem off of I-40 heading east toward. I-52 , when I noticed and odd shapes object in the sky not very high above the city of winston, at 3:30 am. The object was visibly projecting light! To be clear NOT reflecting, but projecting a beam of light toward the ground. I kept an eye on it to see if I could notice and red or green lights like a plane or helicopter would have and after a few minutes I was able to determine indeed it did not have any. I continued onto hwy 52 heading south when I noticed it had moved drastically south and had somewhat changed what the shape was. I pulled over after a few minutes to get a better look and shut my car off to see if I could hear anything. With no traffic in sight it was dead silence, I could not her a sound coming from this. I took my phone out and continued to take about 15 pictures and as I zoomed in that's when it became extremely obvious this was not any aircraft I have eer seen before. It continued to change shapes, from a half sphere to almost a boomerang of multiple lights. A few pictures you can actually see that it had multiple individual lights on the perimeter of it. It seem to come a little closer after a bit and I was by myself and nervous , so proceeded down 52 south with the craft staying constantly to my left side, after about 25 minutes I made it to interstate 85 and headed south west, that when the craft continued a south bound path and I eventually lost site of it."],"Log Number":"US-09052013-0014","Disposition":"Unresolved","Region":"North Carolina","Country":"United States","Source":"MUFON","Case Number":"50452","trends":["There has been one other sighting in Winston salem","There were no other sightings in Winston salem on or around September 5th 2013"],"Object Shape":"Boomerang, Disc, Oval, Other","Object Flight Path":"Path with directional change","Date of the Event":"09/05/2013 03:45 UTC","Date Submitted":"09/05/2013 07:47 UTC","Tags":"City","Summary":"Half sphere/boomerang shaped formation of lights","City":"Winston salem","files":["/var/www/straped/mufon/html2text/50452.html.txt","/var/www/straped/mufon/org/50452.html"]}