{"files":["/var/www/straped/mufon/html2text/50453.html.txt","/var/www/straped/mufon/org/50453.html"],"divs":["Sighting DetailsMy husband and I went for our evening walk around the apartment complex towards night fall (dusk). The evening sky was clear and the stars were just starting to shine. Every now and then I would look up to see the stars and about the third time around the apartment complex I looked up and seen two what looked to be airplanes in different areas of the sky because of the blinking lights. Around the fourth turn of our walk I looked up again in approximately the same area to look at the stars and noticed a wave shaped cloud in the form of a \"S\" shape but wasn't shaped exactly like an \"S\"; any way it was moving kind of fast and being that it was a clear knight I knew it was odd that that cloud was the only one in the sky. I pointed up and asked my husband what is that and he said he didn't know, so we both were watching it intently, it seemed to disappear or dissipate then we saw what I believe was a UFO. It was V shaped and it seemed it was moving in that dissipating cloud. I seen the belly and shape of the object. It looked almost white but this could be because to flew over a near by gas station and other businesses where it was well lit. It also had grey round looking fixtures on the belly. The object wasn't lit up and it had no sound at all to it. The object seemed to disappear as it flew out of sight, but we kept watching as we walked to see if maybe we could still see it. I don't have anything to show but I can draw a sketch of it."],"Case Number":"50453","Country":"United States","Disposition":"Unresolved","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=27.696231,+-97.350555(50453)&iwloc=A&hl=en\"> mufon case (50453) map </A>","Viewing Distance":"101-500 Feet","Object Flight Path":"Path with directional change","Summary":"I looked up and seen an wave like thin colud and asked my husband what it was; he didn't know","Object Features":"Other","Latitude":"27.696231","Longitude":"-97.350555","Sighting Duration":"00:02:00","Date of the Event":"09/04/2013 09:30 UTC","Tags":"City","trends":["There have been 26 other sightings in Corpus Christi","There were no other sightings in Corpus Christi on or around September 4th 2013"],"Log Number":"US-09052013-0015","City":"Corpus Christi","Weather Factors":"Unknown","Date Submitted":"09/05/2013 08:44 UTC","Region":"Texas","Object Shape":"Boomerang, Triangle"}