{"Date Submitted":"09/06/2013 02:08 UTC","Object Flight Path":"Hovering then path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=39.765617,+-74.972195(50460)&iwloc=A&hl=en\"> mufon case (50460) map </A>","Summary":"Saw a formation of 8 objects, set in pairs, then another from the right","divs":["sighting detailssaw a formation of 8 objects, set in pairs, then another from the right. my friend was leaving at 1:20 am and called me seconds after he had left telling me to get out here now, i went out looked n\\nw and saw a glittering glowing orange\\red series of lights slowly seperating but staying in pairs, 8 total making a formation. they all spread out and then literally dissapaited and vanished, then all the sudden from our right comes from over the houses a bright larger version of what we saw came over th where these 8 onjects had vanished and hovered there, it moved strange very jerky movements but maintained a bee line for the area where the others disappeared. no noise at all and it was dead quiet in my neighborhood. it was soo eerie looking in the black sky. now at 2:5 am the are where the objects were is all cloud covered now. ive researched this site and there appears to be an actual ufo flap going on in our area, look at the recent sightings in south jersey, all the same i was suprised to also read people saying that it has been happeneing nightly."],"Object Shape":"Sphere","Country":"United States","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Source":"MUFON","Region":"New Jersey","Date of the Event":"09/06/2013 01:20 UTC","Tags":"City","Case Number":"50460","Latitude":"39.765617","Weather Factors":"Unknown","trends":["There have been no other sightings in Winslow Township","This sighting has been favorited 1 time."],"Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/50460.html.txt","/var/www/straped/mufon/org/50460.html"],"City":"Winslow Township","Longitude":"-74.972195","Object Features":"None","Log Number":"US-09062013-0002"}