{"files":["/var/www/straped/mufon/html2text/50469.html.txt","/var/www/straped/mufon/org/50469.html"],"Object Shape":"Diamond, Triangle","Date of the Event":"04/04/2002 12:00 UTC","Tags":"City","Longitude":"-122.586741","Object Features":"Other","Log Number":"US-09062013-0009","Summary":"Black triangle hovered over my position. Whistling from breaking wind. Lasted 5 mninutes.","map":"<A HREF = \"http://maps.google.com/maps?q=47.10042,+-122.586741(50469)&iwloc=A&hl=en\"> mufon case (50469) map </A>","City":"Fort Lewis","Latitude":"47.10042","Disposition":"Unresolved","Viewing Distance":"101-500 Feet","Case Number":"50469","Country":"United States","Source":"MUFON","divs":["Sighting DetailsI reported this 10 years ago, a year after the event happened, either on this site or another. I figured I send it again. If it was this site then you can compare the noted and see the integrity of the statement. Like I said, it was a decade ago so the time and date are extremely approximate. The year, however, was 2002. I'm pretty certain about that. I was in the Army at the time. In the middle of a big war game at Fort Lewis, WA. It was late at night and I was pulling security. I was watching for a distance simulated tank battle out over the horizon with my night vision goggles on. It was a very quiet night despite the circumstances. That's when I heard a strange subtle whistling sound behind me. I turned around and that's when I saw this gigantic black triangle hovering towards my platoons position. My whole platoon was sleeping other than myself and my counterpart who was at the other side of the patrol base. Right when I saw this black object, at first I thought it was a boomerang. It was idling. Moving extremely slow. And it made no sound. The whistling was the wind hitting the object. The direction of movement was coming right towards me. It was still a couple hundred meters away and way less than that in elevation. I thought about throwing a rock at it, which I could have, but I thought I'd better not. I was mesmerized by the event. I had spent the previous years in 2nd Ranger Bat. jumping out of airplanes and helicopters as an airborne infantryman. I knew this object was moving too slow to be a plane and too quiet to be a helicopter. I instantly knew what it was not. The event lasted quite awhile. As the object moved closer to my position and eventually overtop of it, I pulled my night vision goggles down and then up repeatedly. I wanted to get a grasp of what I was looking at. I eventually discerned that the boomerang was a triangle. The object was black. The size was proportional to that of a major league baseball diamond. The side points were wider than that of 1st and 3rd base. This object was gigantic. As time went on, I noticed a couple times where the object emitted light on the sides. First it was the 2 sides just posterior to the front point. It did this a couple times and I don't recall seeing them other than when the NVG's were on. As the object continued on, as it passed over my head and idled away, I realized that it was actually diamond shaped moving in the direction of one of it's points. I saw rear lights near but not on the rear point. That's how I differentiated it into a diamond and not a triangle. As it continued to hover away, I ran and woke up a friend so he would see it. He was groggy and by the time I got to him he couldn't tell what it was. I later went and talked to my counterpart that was pulling security at that particular time. He said he didn't see anything, which means he was sleeping on guard duty. Over the first couple years I told a few people about it and then decided not to. I figured that I would have to see it to believe it and since I can replicate the experience, what's the point of talking? But over the years, I've heard others talk about low hovering black triangles. There's even a Wikipedia page! Well, that's my story. Someday I'm going to get a black triangle UFO. It was a profound experience. Thanks for letting me share. Sorry if this is convoluted. It's been awhile."],"Date Submitted":"09/06/2013 12:50 UTC","Region":"Washington","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","trends":["There have been no other sightings in Fort Lewis","This sighting has never been favorited."]}