{"Disposition":"Unresolved","trends":["There have been 5 other sightings in St. Louis","There were no other sightings in St. Louis on or around August 10th 2013"],"divs":["Sighting DetailsAs reported to ASD by phone today: I was near the Art Palace Museum at Forest Park in St. Louis in front near the statue of a king - this is at the top of Art Hill. I turned and saw orange lights in the sky - a lot of them - waves of them flying in loose V shapes with 10-15 lights in each V shape and moving very fast. There was no sound and they were high in the sky - perhaps at 2,000 feet. I could see the lights start at the horizon in the distance and move across the sky towards downtown St. Louis. I watched them for about for 30 minutes. Someone else was nearby - I could hear them talking but did not see them or talk to them. The objects came from the direction opposite of downtown St. Louis (west?), and they flew in a straight line. I saw jets flying over the area earlier that where very loud. These were much faster than jets. It would take a hand held at arm's length to block out one of the lights. I would say there were 10-15 lights in each V pattern, and many V patterns flew over. I did not have a camera with me at the time. I saw another similar report so someone else must have seen this as well."],"Date of the Event":"08/10/2013 12:00 UTC","files":["/var/www/straped/mufon/html2text/50472.html.txt","/var/www/straped/mufon/org/50472.html"],"Longitude":"-90.238026","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.636438,+-90.238026(50472)&iwloc=A&hl=en\"> mufon case (50472) map </A>","Date Submitted":"09/06/2013 01:31 UTC","Viewing Distance":"Unknown","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Summary":"Large fleet of orange orbs over St. Louis","Region":"Missouri","Case Number":"50472","Sighting Duration":"Undisclosed","Object Features":"None","Country":"United States","Log Number":"US-09062013-0011","Object Shape":"Sphere","Tags":"City","City":"St. Louis","Latitude":"38.636438"}