{"Viewing Distance":"Unknown","divs":["sighting detailsmy son was laying on the deck sun at 2:30am smoking and looking at the stars casually when he saw a shadowy figure with 5 lites(he thought) and he could see it because it blocked the stars as it passed overhead. he said it veered to the west as if to avoid some storm clouds to the east. and he lost site of it. he said it moved quick but not super fast. he thought it was a flock of birds but no wing flapping or honking....just silence, and didn't know how they were lit, so he can't figure it out. then! sunday 9-1-13 at 11:15pm there was another sighting by 5 family members...all men. this time it went s to n and they described it as boomerang shape shadow in the sky with lites of various sizes that were yellow\\orange. moving quick and not sure of height in sky, but guessed it to be 20' wide. no sound. they said it was like the lites were meant to camoflage with the stars, except that it was noticed due to the movement and that it blocked the stars as it passed over. one guy tried to get it on his phone but missed it. they all were be fuddled and said they've never seen anything like it. we think it's a military drone or secret military stuff."],"Sighting Duration":"Undisclosed","Log Number":"US-09062013-0017","map":"<A HREF = \"http://maps.google.com/maps?q=40.790481,+-99.754781(50477)&iwloc=A&hl=en\"> mufon case (50477) map </A>","Object Shape":"Boomerang","Disposition":"Unresolved","Object Features":"None","files":["/var/www/straped/mufon/html2text/50477.html.txt","/var/www/straped/mufon/org/50477.html"],"Object Flight Path":"Path with directional change","Latitude":"40.790481","Weather Factors":"Unknown","Summary":"appeared as a shadow with lites that went N to S","trends":["There has been one other sighting in Lexington","There were no other sightings in Lexington on or around September 1st 2013"],"City":"Lexington","Date of the Event":"09/01/2013 02:30 UTC","Tags":"City","Date Submitted":"09/06/2013 03:51 UTC","Source":"MUFON","Longitude":"-99.754781","Country":"United States","Case Number":"50477","Region":"Nebraska"}