{"Latitude":"41.355706","Region":"Connecticut","Sighting Duration":"00:00:20","Summary":"Rectangular disc, very bright and vibrant white or yellow lights quickly rotating on surface of flying object.","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Disc","Longitude":"-71.959212","Date Submitted":"09/06/2013 02:09 UTC","Date of the Event":"03/30/1974 06:30 UTC","trends":["There have been no other sightings in Stonington","This sighting has never been favorited."],"Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=41.355706,+-71.959212(50474)&iwloc=A&hl=en\"> mufon case (50474) map </A>","Source":"MUFON","files":["/var/www/straped/mufon/html2text/50474.html.txt","/var/www/straped/mufon/org/50474.html"],"Tags":"City","City":"Stonington","Disposition":"Unresolved","Case Number":"50474","Object Flight Path":"Unknown","Weather Factors":"Unknown","Log Number":"US-09062013-0014","divs":["Sighting Details My memory may not serve all that correctly as I was only 11 (I think) at the time. I could be off considerably in regard to date and time. I grew up on Hinckley Street in Mystic, CT. Along with typical interests of young people such as sports and collecting cards, I also had an interest in the natural world (e.g. Ornithology, Herpetology, etc.,etc) and also Astronomy. As a young person I did volunteer work at the nearby planetarium which is part of the local maritime museum. I'm always reluctant to mention what I was doing at the time of the sighting as it adds to the sense of a young person with an overactive imagination, thus probably not credible; however, I'll answer the question here with the emphasis that my activity at the time and the sighting were in no way related. I was looking at something (don't remember which celestial body and it was to the south, not east) through a refracting telescope. I was at the end of my parents' driveway. I remember raising my head for a moment and my left side peripheral vision caught something unnaturally bright to the east. I turned to face whatever it was (maybe 085 degrees from my position). I think my best description of what I remember seeing that night after, almost 40 years of thinking about it often, was a flying rectangular disc with extremely vibrant rotating white-yellow lights. I cannot recall whether the rotation of the lights was clockwise or counterclockwise, maybe the former but I'm not sure at all. From my perspective the left side of the object was dipped a little lower than the right. As mentioned , the object was to the relative east of my position and was flying in a SWW direction, sort of towards my position but the ground path would have been a bit to my south. It wasn't flying all that fast at the time. My best guess on distance from my position would be anywhere from 1,500 feet to maybe as much as a mile, again, I wish this were more recent. I doubt the altitude would have been more than 300'. Looking at MapQuest I would say it's position would have placed it anywhere between the woods behind my neighborhood and the Mystic reservoir. It may have been over the Pequotsepos Nature Center. I'd be surprised if it hadn't been observed by some motorists traveling northbound on Interstate 95 after passing exit 90. Unfortunately my curious nature was unable to override my sense of survival as the ol' \"fight or flight\" instinct kicked in and I ran into the garage and into the house after having watched this thing for no longer than half a minute. Around that age I would always look up to try and identify aircraft types, I collected small pre-fabricated models, and was always up for the challenge of identifying aircraft. I would always get excited at the sight of a meteor and knew perfectly well what they were having volunteered at the planetarium. Later in life I would obtain a private pilots license. Believe me, I, as an 11 year old with an abundance of interests and with a strong desire to know as much as I could, wanted no part of whatever this thing was. I could always recall, as could my parents, how shook up I was that evening by seeing whatever this thing was. It had given me a feeling of great unease. I should mention that prior to that evening I was aware of the UFO phenomena. I didn't think much about it. My parents had told me before that sometimes people would see things that defied explanation. They didn't claim to know what they were and I don't think they gave it much thought. Later that evening I called a friend to tell him what I saw. Before I could get the words out of my mouth he told me what he had seen earlier that night.... the same thing. His perspective would have been from the southern half of Hewitt Road in Mystic, maybe about a mile away from my position by air and to the south. Clearly I've never forgotten the experience of seeing this thing. I've often wondered what I would do if I had seen it as an adult. Maybe just try to remain inconspicuous and study it from a safe place. I don't know. I know this report isn't of much help given the elapsed time, and even I'll admit that it's being told by someone who was around 11 years of age at the time of the sighting and that might raise some questions of accuracy. But I did my best to explain the sighting and it feels good to be able to share this account and offer it for the historical files."],"Country":"United States"}