{"Longitude":"-82.911321","Weather Factors":"Unknown","trends":["There have been 7 other sightings in Charter Township of Clinton","There were no other sightings in Charter Township of Clinton on or around September 6th 2013"],"Source":"MUFON","Object Flight Path":"Path with directional change,Path then hovering","Region":"Michigan","Country":"United States","divs":["sighting detailsi stepped out for a break around 9:40am (est) from work and was watching a commercial jet cruising around 30k feet above me. from the area southwest of the jet, a bright reflection from the sun caught my eye. as i watched it, the reflection disappeared and i could actually see something (with an outline of a small craft) moving east . it was approximately 1\\4-1\\3 the size of the jet. it was shiny and very silvery just before the sun reflected a bright white color from it. it appeared as a disc\\sphere in shape. when the sun didn't reflect off it, it would be a darker gray or even at times have a red\\orange cast to it. mostly, it stayed gray or very shiny silver. it made no sound and didn't leave any trail. at times it would seem to stop or hoover, then continue east. it never sped up to any extreme speed. just \"cruising\" would be a good way to describe it. just as the jet flew off to the west, the object continued on it's way east. sometimes heading north, sometimes heading south, but then continuing due east. the craft was not moving as fast as the plane and even though they seemed to be heading towards each other at one point, there was a large distance between them. the craft was much closer to earth then the plane. i could visibly see both plane and object. it traveled higher than a helicopter would fly, but lower then any of the commercial jets would fly. there was no other airplanes (commercial or non commercial) or helicopters in the area. the only \"clouds\" were entrails that the commercial jets made against a brilliant, clear blue sky. the duration was for more than 15 minutes, but less than 20 minutes. the emotions i felt were amazement, excitement, happiness. i wasn't fearful or worried. this was the first time i have witnessed an object that i couldn't identify during the daylight hours. in the past, i have seen a few crafts, but only at night. as my break time was overextended, i had to leave the view of the object, which was still heading east. last i saw was the old entrails the commercial jet left and the craft was then blocked from my view. i did return to another area to view where this object might have been (approximately 5 mins later) but i never saw it again. i do have pictures of the reflections this object gave off by the sun hitting the sides of it. some pictures don't require \"zooming\", but some do. also, i have a video that shows how the object moved and how the sun reflected off of it. the video may need to be zoomed in and\\or watched from the middle section and down at the bottom of the video, as i was able to capture part of the object (mainly in the beginning of the video) moving. the sun was intense, i couldn't see the viewing screen and i wasn't able to center the object for very long. i accidentally moved it out of the camera's view. but you can see the object reflecting many times during this short period of time."],"Disposition":"Unresolved","Date of the Event":"09/06/2013 09:40 UTC","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=42.591598,+-82.911321(50480)&iwloc=A&hl=en\"> mufon case (50480) map </A>","Sighting Duration":"Undisclosed","City":"Charter Township of Clinton","Case Number":"50480","files":["/var/www/straped/mufon/html2text/50480.html.txt","/var/www/straped/mufon/org/50480.html"],"Summary":"Shiny silver sphere/disc like object cruising a clear, blue sky in Clinton Twp, MI","Tags":"City","Date Submitted":"09/06/2013 06:43 UTC","Object Shape":"Disc, Sphere","Log Number":"US-09062013-0020","Latitude":"42.591598","Object Features":"Unknown"}