{"Disposition":"Unresolved","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=45.551996,+-73.759217(50483)&iwloc=A&hl=en\"> mufon case (50483) map </A>","trends":["There have been 7 other sightings in Laval","There were no other sightings in Laval on or around January 1st 1991"],"files":["/var/www/straped/mufon/html2text/50483.html.txt","/var/www/straped/mufon/org/50483.html"],"Date of the Event":"01/01/1991 04:00 UTC","Tags":"City","City":"Laval","Country":"Canada","Log Number":"CA-09062013-0023","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Object Features":"Window(s)","Date Submitted":"09/06/2013 10:24 UTC","Latitude":"45.551996","Sighting Duration":"Undisclosed","Region":"Quebec","Case Number":"50483","Longitude":"-73.759217","Object Shape":"Cylinder","Summary":"100-150 feet cylinder type with square windows.","divs":["Sighting DetailsI had three different experiences in my life. first time at around 9 years old, I woke up when I hear my dog outside barking (wouf wouf) I go to the Windows I saw a man levitating outside the Windows and talking to me by spirit, I was afraid and hide myself under the curtains of my bed and he was still talking to me hovering inside the room over me.... Another time at 15, we saw a weird flying object and we were four to see it. At 21-22 years-old I choose to describe this because that was close to abduction. So I weak up suddenly because I heard noise coming from the bathroom and the bedroom closet. So I ran out of my bed and ready to fight. Then suddenly coming out of the closet I saw two ape shape wearing a white mask and floating from the floor and having an illuminated Tools on their hands. Then suddenly I was surrounded by four or five little live forms about 2-3 feet height and I was sensing that they were taking my fear against me to freeze me. I wanted to escape but these little man were getting closer and freeze me more each time they getting closer. The apes wanted to put the illuminated Tools close to my brain. SO I turn around to find a solution, and I saw my body still in the bed.... I jumped from the floor to regain my body and weak up again..... I do not know what to think.... Can somebody live something similar!"]}