{"files":["/var/www/straped/mufon/html2text/50481.html.txt","/var/www/straped/mufon/org/50481.html"],"Summary":"In a weekend i n june we saw and recorded sometype of entity on the ground. For two nights in a row we saw something. For the next two weeks lights pulsated all in the trees. The limbs glow. now where I saw all of this the limbs are broken all in arow","Country":"United States","Object Features":"Unknown","Object Flight Path":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=32.324531,+-86.900828(50481)&iwloc=A&hl=en\"> mufon case (50481) map </A>","Date Submitted":"09/06/2013 07:10 UTC","Weather Factors":"Unknown","Region":"Alabama","Date of the Event":"06/05/2013 01:00 UTC","divs":["Sighting DetailsOn Early Saturday Morning. My husband and I saw a green light morphing and changing positions. We kept looking and we saw different shaped shadows. When the sun came up we went out side and recorded what we could see. It was almost like we saw another dimension. My phone camera picked up these entities better than the naked eye. We saw these colorful figures dancing around and seemed to go up a tree. Next we saw what looked like to be a metal object going up the road. It was small and round with blue lights on the side. After we kept looking we saw a green thing behind a tree 20 feet away. It could see us. It would distort my video camera's view. I was not scared. I was intrigued. Early Sunday Morning, I saw what looked to be like a 3 foot tall creature with big eyes walking up to my window. I had my video camera on night vision. I could not move. Finally my husband grabbed me and I showed him what I recorded. He could not believe it. Sunday afternoon, my husband was gone and I was recording from my kitchen outside to see what I could see. I saw two men watching me behind my son's swing set. I called the police and told him about the men and they made me seem crazy. Now as far as those videos go. two weeks later, I was scared and deleted the video off my camera. I was not able to upload this footage onto my computer, youtube, or facebook. I could not do anything with the footage. I was scared so I deleted the good video. It still may be in verizon wireless land. Also, the night vision one off of my camera got deleted in the commotion with the police. I let everything go. Then I saw about bucks county and Denise's story seemed similar. I started looking through the footage I took after that weekend. You can see pulsating lights and what looked to be an entity in my woods. I gave my chip from my video camera to someone who said she was affiliated with you all. I would like to show you my footage. I would also like to know if I am in danger. Some of the leaves on my trees have died. My back yard is covered with these dead leaves. Can you help me? I am going to call this lady to get my footage back. I just feel scared, I don't know what these things are capable of. I don't know hat the government is capable of. So far I have not heard of any story like ours. I also showed the video from my phone to about ten people. They said it was crazy and almost looked like some one was projecting these things...but why would they do that?"],"Sighting Duration":"Undisclosed","Tags":"City","Longitude":"-86.900828","Viewing Distance":"21-100 Feet","Object Shape":"Unknown","Disposition":"Unresolved","Log Number":"US-09062013-0021","Case Number":"50481","City":"Undisclosed","trends":[],"Latitude":"32.324531","Source":"MUFON"}