{"Tags":"City","Source":"MUFON","City":"Las Vegas","Log Number":"US-07102006-0006","Latitude":"36.121496","divs":["sighting detailsi really have no recollection of anything which occured...all i know is i have a photogragh. there is a massive time loss, i ahve these dreams, nightmares. i have taken several objects from mmy body, coughed something up...kept it, its not a natural shape, fells like wood\\metal. the man from shadow research does not return any of my calls, i think he disbelieves me. i need someone to talk to about this, as soon as possible. they come every now and again, do things. i sometimes remember, but want to forget. i need someone to contact me. ----------------------------------------------- the photo looks as though it was taken over at nellis or groom lake. an abondoned road, or air strip. there is a night construction light on, next to an old abandoned building on the far right of the photogragh. to the far left is a four orbed object with a tail, translucent, ever since then i ahve these dreams. i have done things to riun relationships that is not me. i have waken up with bruises, marks, red inhection holes on my forehead, side of head, and other parts of my body. i have enclosed my photograph."],"Viewing Distance":"Unknown","Object Features":"Unknown","Region":"Nevada","Case Number":"5048","Object Flight Path":"Unknown","Weather Factors":"Unknown","Date of the Event":"09/15/2005 12:00 UTC","Longitude":"-115.165626","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around September 15th 2005","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Date Submitted":"09/15/2005 12:00 UTC","Object Shape":"Other, Unknown","Country":"United States","Summary":"memory loss...i have a photogragh.","map":"<A HREF = \"http://maps.google.com/maps?q=36.121496,+-115.165626(5048)&iwloc=A&hl=en\"> mufon case (5048) map </A>","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/5048.html.txt","/var/www/straped/mufon/more/5048_submitter_file1__scan.jpg","/var/www/straped/mufon/org/5048.html"]}