{"Date of the Event":"11/30/1956 12:00 UTC","Object Flight Path":"Undisclosed","Region":"California","Source":"MUFON","Latitude":"38.10742","Country":"United States","Object Features":"Undisclosed","Date Submitted":"11/30/1956 12:00 UTC","Case Number":"5064","Tags":"City","Summary":"While playing with friends on a hillside in the trees my friends and I found a UFO","Log Number":"US-07122006-0006","divs":["Sighting Details As a kid I lived near Hamilton AFB in Calif. On a summer day I and my friends larry and dennis Heifner and Steven Laycock were playing on the tree covered hillside in front of my home. coming into a small clearing in a gully we found a landed UFO which greatly excited us It was the same color of the dry summer grass and was circular shaped on a tripod landing gear it was about 50 ft in diamter we carefully checked it out and no one was around we had bb guns which made us feel invincible we captured a UFO. A stair came down fron the center of thing with a spindly railingclimbing up i looked inside but all I could see was a greenish gray shinny wall dividing the thing in half the inside of the machine was dark and stick my head into the craft was not a real good idea at the time. a ring of vents went around the thing and were set at a45 degree angle to the edge. viewed from the to the vents would rotate counter clock wise Looking into the vents I saw a hollow tube with a wieght on the end in the back of the vent. the inside of the vent was dark like soot but it did nto rub off on my hand. the band of vents was about 30 inches in width. A tail on the top of the thing ran from the top out to the edge then stopped it was on the half blocked off by the wall the hole thing was very strongly build and lookedvery heavy. As we exsamined the thing we got worried that the owners would come back for it and then the war would be on. It was a classical shaped UFO with a tail. I had tiemto examine it and to touch and feel the stars literally. we finally silently slipped back into the trees like indians leaving the craft to its owners we noticed the thing immediately on entering the clearing and it was very obvious that it was a UFO I was excited about it and I tried to learn as much as I could about it but none of us wanted to stick our head into the hatch where it was dark inc contrast to the bright sun out side. It was shut off and did nothing as we examined it. we last saw it as we left through the trees. I touched the stars we accepted it as normal in that we always saw wierd stuff and wierder critters. it was part of life as a kid living next to an air base that you saw UFOs and strange stuff. that was because the bugs as i called them lived in an underground base in the hill which is a whole another thing to talk about. Why was the UN founded in San Francisco?"],"Object Shape":"Saturn-like","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Disposition":"Insufficient Data","trends":["There have been 18 other sightings in Novato","There were no other sightings in Novato on or around November 30th 1956"],"City":"Novato","files":["/var/www/straped/mufon/html2text/5064.html.txt","/var/www/straped/mufon/org/5064.html"],"Weather Factors":"Unknown","Longitude":"-122.569703","map":"<A HREF = \"http://maps.google.com/maps?q=38.10742,+-122.569703(5064)&iwloc=A&hl=en\"> mufon case (5064) map </A>"}