{"Object Features":"None","Sighting Duration":"Undisclosed","Summary":"looked up, bright unwavering light moved at incredible speed from 2 oclock to horizon. followed by 3 manmade vehicles patrolling.","Latitude":"36.233479","Weather Factors":"Unknown","Date Submitted":"09/07/2013 12:27 UTC","Viewing Distance":"Unknown","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=36.233479,+-86.651661(50654)&iwloc=A&hl=en\"> mufon case (50654) map </A>","trends":["There have been 72 other sightings in Nashville","There were no other sightings in Nashville on or around September 4th 2013"],"Object Flight Path":"Straight-line path","divs":["Sighting Detailsat approximately 10 pm on September 4th 2013 I walked outside to smoke a cigarette. I walked out to the driveway and looked at the sky. there was a bright white object, by far the brightest in the sky, at appr. two oclock if 12 is directly above my head. it outshown everything in the sky by far and appeared to be about the size of a dime. I have no idea how big that makes it since it was in the sky, ya know? with a speed that is hard to describe it moved across the sky beyond my horizon view. very very fast. it made no sound. it left no trail and the light did not waiver in any way at all. I have seen shooting stars before. this was.not. a shooting star. I didn't have time to think when I saw it, the entire episode, while it was in view, was too fast. but I know what I saw! as soon as it was gone I walked down the street in the direction it went, searching the sky. my skin was covered in goosebumps, the hairs on my body standing up. I was completely filled with curiosity and fear. I have never experienced emotions like these together. I stayed outside for approximately 30 minutes. as soon as the object left the sky three manmade objects began patrolling the area. the were not large, had one white light and one red. one of the two was blinking, I think the white but honestly don't recall for certain. I assumed they were drones, for they were not very large either. they patrolled the area of the sky where I viewed the object and were still patrolling when I went inside. about an hour or less later I came back out. the three objects were still patrolling. at this time I witnessed a meteor burn up in the atmosphere. it was short lived and no where near as bright as what I saw earlier. the next day I saw that nasa has captured the meteor on film. though I did see the meteor, it IS NOT what I saw first and am reporting. also, why did nasa have our sky monitored to catch this meteor, if not because it was searching for the object I saw. I have gone outside on the nights since looking for the manmade objects, and of course the ufo, and have not seen any of them since."],"Source":"MUFON","Log Number":"US-09072013-0020","Country":"United States","Tags":"City","files":["/var/www/straped/mufon/html2text/50654.html.txt","/var/www/straped/mufon/org/50654.html"],"Region":"Tennessee","City":"Nashville","Date of the Event":"09/04/2013 10:00 UTC","Longitude":"-86.651661","Case Number":"50654","Object Shape":"Sphere"}