{"Date Submitted":"09/07/2013 12:29 UTC","Date of the Event":"09/06/2013 11:30 UTC","Country":"United States","Object Shape":"Bullet, Missile, Circle, Fireball, Flash, Sphere","divs":["Sighting DetailsWas over at my close friends house, relaxing outside, when our night turned to our inevitable scanning the skies for unusual objects. For awhile nothing but planes, but the skies were extremely clear. Before I went home we talked in the front of the house for a few minutes. While we were outside, I first noticed a very small (starsize) blue object blinking and moving across the sky to the left, after only a few seconds it just vanished. Less than 5 seconds later something burst in the same spot, with a fire like explosion, as if something was entering our atmosphere. After this bright orange yellow and glowing object burst into the sky out of nowhere, it began to move left across the sky leaving a large trail of smoke with a convex curve. The object hovered slowly and then began to make an S like trail with very abrupt accelerations and turns over the trees and out of our sight. I have seen many UFOs down the jersey shore, but this doesn't even compare. With all this Syria war talk going on, I was worried it could be a missile, or something of that nature since it left a fiery trail as it first entered and moved left across the sky. Maybe it was a comet? But the fact that it hovered, was glowing orange, and made obvious conscious movements in the sky, it had to be controlled by something, and was definately not a natural occurrence."],"Object Features":"Unknown","City":"Newtown","Weather Factors":"Unknown","Tags":"City","Latitude":"40.241666","Region":"Pennsylvania","trends":["There have been 13 other sightings in Newtown","There were no other sightings in Newtown on or around September 6th 2013"],"Longitude":"-74.918182","Viewing Distance":"21-100 Feet, 101-500 Feet","Sighting Duration":"Undisclosed","Summary":"UFO entered atmosphere with a burst of flame and trail","map":"<A HREF = \"http://maps.google.com/maps?q=40.241666,+-74.918182(50655)&iwloc=A&hl=en\"> mufon case (50655) map </A>","Source":"MUFON","Log Number":"US-09072013-0021","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/50655.html.txt","/var/www/straped/mufon/org/50655.html"],"Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Case Number":"50655"}