{"Viewing Distance":"20 Feet or Less","divs":["Sighting Detailswhile going to college of Marin In the morning rush hour traffic heading south on hwy 101 coming over the hill to where I could see the marin county civic center I felt that the hwy next to it looked oddly wrong. As I continued to drive in heavy traffic the hwy was replace by a prussian blue light which then changed to silver as I approached it. this was wider than the whole hwy and about 10 ft above it a huge traffic jam was piled up under the light as traffic slowed to a crawl. As I got close I saw that it was a huge silver colored UFO directly over the hwy. IN front of the UFO was a screen on arms that probably came out from unde rhte ufo as the bottem was rough on it not smooth. the screen reflected the scene behind the ufo hiding it. but as I approached it the screen failed to hide it. I drove under it expecting to get zapped to mars or something and was greatly occupied avoiding other cars whose drivers were in shock. the thing was a vivid impression of contemptuous power It was silent. only the screen showed any light. I didnot notice and ring of vents on it. thousands of people saw the thing going to work nothing at all was in the media about it. about ten yearw later my sister and her children saw a similar object in the same spot while driving on 101 a huge UFO came over the hill from san rafael and hovered over the HWY at the civic center my sister pull off on a side road to watch it and she aher children were so close that as she said she could bounce a ball off it it made a low hummin noise. No onw on the hwy seemed to see the UFO and she felt atht the people were dammend idiots as they buzzed under it four military helicopeter come over the ill and chased the UFO around the area at low altitude while my sister watched. Finally the ufo took off towards the north with the helicopters after it. My sister felt that she was the only one who noticed the event. later my nephew had a girl friend who lived in that area and she said that at night goblins used to come and take her out of the window and that she had to dance with them in the driveway. She insisted that she was telling the truth and that the goblins were very scarey I had nodoubts that the thing I saw was a UFO and my sister had no doubts about waht she saw. I felt that is was clear indication of alin power but I was used to seeing thing slike that as a kid. I lost sight of it driving over the hill trying to avoid other drivers in a panic state. Now a question was the UFO I saw there to pick up or deliver some one since it was at the civic center? the screen was an attempt to hide the UFo from iew. How many Silver colored UFOs were screens viewed at a wrong angle to hide thing. The original scene went trhough a color change as I approached it which would seem to indicate that the screen is limited in its ability to hide things depending on the angle of the viewer why was my UFO seen by thousands not in the media"],"trends":["There have been 6 other sightings in San Rafael","There were no other sightings in San Rafael on or around November 30th 1961"],"Summary":"While driving to college in morning on hwy 101 by Marin co. civic center a huge UFO was above the hwy at 10 feet altitude and was driven under by thousdands of commuters going into san francisco","files":["/var/www/straped/mufon/html2text/5066.html.txt","/var/www/straped/mufon/org/5066.html"],"Latitude":"37.977105","Weather Factors":"Unknown","Object Features":"Dome, Appendage(s), Other","Date of the Event":"11/30/1961 12:00 UTC","Log Number":"US-07132006-0001","City":"San Rafael","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","Object Shape":"Oval","map":"<A HREF = \"http://maps.google.com/maps?q=37.977105,+-122.525007(5066)&iwloc=A&hl=en\"> mufon case (5066) map </A>","Longitude":"-122.525007","Source":"MUFON","Object Flight Path":"Stationary","Tags":"City","Date Submitted":"11/30/1961 12:00 UTC","Case Number":"5066","Region":"California","Country":"United States"}