{"Tags":"City","Disposition":"Unresolved","Longitude":"-122.323391","Log Number":"US-09082013-0006","divs":["sighting detailsat approximately 9 p.m. on saturday, september 7, 2013 i opened my basement door to toss a bag into the trash can that sits just outside. this door opens to the east. normally i would open the door, lean out, toss and then close the door. tonight, as i leaned out, i clearly heard a voice in my head say, \"you need to look up right now.\" a large, bright orange light was stationary in the sky to the south and slightly east. at this time, the light was the apparent size of a golf ball, however i did not have my glasses on. i am very slightly nearsighted (uncorrected vision approx. 40-60\\20). as i watched, the orange light slowly drifted down, slightly to the left, then rose again. it did this a couple times over about a minute. i felt glued in that spot, and i didn't want to take my eyes off it. i kept waiting for it to vanish, but it just sort of lazily drifted up and down, side to side. there was no wind or breeze where i was, and it was unusually silent outside. i knew right away that this was not a conventional aircraft. i live near seatac airport, and have never seen a light of this type in the sky. neither was this light traveling in the usual pattern of air traffic. as soon as i saw it, i knew it was not of this earth. i felt and heard the presence of intelligence, and had the sense that this light was aware of me and wanted to be seen. i wanted to get a better look, and sensed i would be able to get my glasses and camera. so i closed the basement door, ran upstairs and grabbed my glasses and phone, then went out my front door, which faces directly south. it took less than 30 seconds to get from one door to the other. the light was still in the sky, still in the south and slightly east (only 10? - 15? degrees east). with my glasses on, the light was still large and bright orange, but now was somewhere between aspirin and dime sized. it grew and shrank in size, and moved in a lazy way to the direct south. it floated up and down as it traveled south. then it stopped and split into three distinct, smaller orange lights. these three lights floated up and down in unison, then merged back together into one larger light. this one light shrank and dimmed then faded. my sense was that it was turning and traveling away from me. the entire time i watched, i noted how very silent it was outside, and i live near two intersecting arterial streets. it is difficult to describe how this sighting made me feel. i was never scared, instead i felt calm, happy. it seemed that the light projected this, and made me feel safe. it seemed to project the information that it was here to \"help.\" i had my phone\\camera in my hand, but again heard in my head not to bother, it wouldn't show up. immediately after the light faded, i texted my husband to mark the date and time. to my perception, the duration of the sighting was less than five minutes. the time mark on the text i sent my husband is 9:04 p.m."],"Summary":"A large, bright orange light visible for less than 5 minutes to the SE. Slow, erratic path to S, split into 3 lights then merged back into one. Slowly faded from sight.","Object Features":"None","trends":["There have been 110 other sightings in Seattle","There was one other sighting in Seattle on or around September 7th 2013"],"Object Shape":"Sphere, Star-like","Source":"MUFON","Region":"Washington","Weather Factors":"Unknown","Latitude":"47.61303","Sighting Duration":"Undisclosed","Country":"United States","Viewing Distance":"Unknown","Date of the Event":"09/07/2013 09:00 UTC","files":["/var/www/straped/mufon/html2text/50678.html.txt","/var/www/straped/mufon/org/50678.html"],"City":"Seattle","Date Submitted":"09/08/2013 03:04 UTC","Object Flight Path":"Stationary,Path with directional change","Case Number":"50678","map":"<A HREF = \"http://maps.google.com/maps?q=47.61303,+-122.323391(50678)&iwloc=A&hl=en\"> mufon case (50678) map </A>"}