{"Latitude":"47.572187","Viewing Distance":"Unknown","Date of the Event":"09/07/2013 11:03 UTC","Object Shape":"Other, Unknown","Object Features":"Unknown","Log Number":"US-09082013-0004","trends":["There have been 110 other sightings in Seattle","There was one other sighting in Seattle on or around September 7th 2013"],"Case Number":"50675","Region":"Washington","files":["/var/www/straped/mufon/html2text/50675.html.txt","/var/www/straped/mufon/org/50675.html"],"divs":["Sighting DetailsThis object may just be a satellite, however I have never seen a pulsating satellite. The object travelled south to north with apparent speed and distance of a satellite, but pulsed. I noticed it first as a sudden bright light that slowly faded turned orange then red and faded black. Then further along its path it repeated the sequence, a sudden bright white light fading and turing orange then red finally black. From my view I observed this sequence 3 times, because of my limited field of view, my house to the south, and tree line to the north. My field of view is about directly over head (my house obscuring view to south) and about 10 degrees to the north before trees obscure. I can see the Big Dipper perfectly and the object passed through the handle, and next to the lowest star on the bottom of basin near the handle of the Big Dipper. This object gave the appearence of possibly a satellite tumbling and changing reflection as it tumbled and reflected the sun from below the horizon, but I have never seen a satellite act that way with repeated pulsating and color change of light."],"Source":"MUFON","Date Submitted":"09/08/2013 02:24 UTC","Disposition":"Unresolved","Country":"United States","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Longitude":"-122.412768","City":"Seattle","Tags":"City","Summary":"from south to north like a pulsating satellite","map":"<A HREF = \"http://maps.google.com/maps?q=47.572187,+-122.412768(50675)&iwloc=A&hl=en\"> mufon case (50675) map </A>"}