{"Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Region":"Alabama","Log Number":"US-09082013-0001","files":["/var/www/straped/mufon/html2text/50672.html.txt","/var/www/straped/mufon/org/50672.html"],"Summary":"Orange yellow round light","Object Features":"None","Date of the Event":"09/07/2013 11:00 UTC","Longitude":"-86.785955","Tags":"City","Disposition":"Unresolved","Date Submitted":"09/08/2013 01:00 UTC","Viewing Distance":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.177327,+-86.785955(50672)&iwloc=A&hl=en\"> mufon case (50672) map </A>","Country":"United States","divs":["Sighting DetailsSeptember 7,2013 11:00pm I was sitting on the back patio and noticed a light off to the right side. It was a orange yellow color light that came from the SE that pulsed and moved then stopped and hovered then took a path up and moving to the west. At two points while hovering the light went very dim and then came back to a bright color. Then continued to move away. The event lasted about 3 minutes and my wife also witnessed about half of the event. I stayed on the back patio and my wife was going to the front yard when the light went out. There was no sound or air movement during this event. I did notice as the light moved closer to me dogs around me in the neighborhood started barking and then went back to quite after the light was gone. My wife tried to video the light with a cellphone with no success. My first thought was that it is an airplane, but the more I watched it thought maybe a meteor but it was moving to slow. I was very confused by what myself and wife witnessed. We both agree that it was not like anything that we have ever seen. I lost sight of the light when it abruptly went out. I stayed outside several minutes after to see if it reappeared. It never did."],"City":"Calera","Latitude":"33.177327","Object Shape":"Circle, Star-like","Case Number":"50672","Weather Factors":"Unknown","Sighting Duration":"00:03:00","trends":["There have been 3 other sightings in Calera","There were no other sightings in Calera on or around September 7th 2013"]}