{"Viewing Distance":"21-100 Feet","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Object Features":"Unknown","Country":"United States","City":"Pleasant Hill","trends":["There have been 2 other sightings in Pleasant Hill","There were no other sightings in Pleasant Hill on or around September 7th 2013"],"Date Submitted":"09/08/2013 02:39 UTC","Object Flight Path":"Path with directional change","Source":"MUFON","Date of the Event":"09/07/2013 08:20 UTC","Log Number":"US-09082013-0005","Object Shape":"Other","Tags":"City","Longitude":"-122.052875","files":["/var/www/straped/mufon/html2text/50677.html.txt","/var/www/straped/mufon/org/50677.html"],"divs":["Sighting DetailsWas on my upper apt balcony looking at parking between 8 and 815 pm. Happened to look upat sky and notice small plane flying as I could hear it..then to the left of plane I saw a bright orange light. Looked a little more to the left and saw three other bright orange lights. The two further to the left moved away but then diappeared. The other two kept coming same directionas the small airplane that usually lands in concord airport. I live in Pleasant Hill calif. Next to concord in Contra Costa County. The third orange light disappeared..fourth light kept next to small plane meaning like a Cessna..the small plane moved further to right and orange light moved straight up disappearing. There was only the light sound of small cessna type of plane..no other noises from bright orange lights. I was so excited..was so disappointed I didn't have my camera or phone..but never in my life expected this wonderful site..the orange lights don't show up in our sky like that..was V shaped from what I could see on the last orange light that went up and disappeared. It looked dark in color body wise but just saw a V Shape type body..could have been more to it I don't know..shape wise..I saw it all over parking lot area but above in sky..lasted approximately five minutes or so..was dark outside..but were lights not orbs or fire balls.I looked around the front of my balcony when orange lights all disappeared thinking I would see them over trees in sky but didn't..the orange lights got bright..no other color..none had noise..just the small plane..the were fast but just stayed woth small plane..I thought maybe there were clouds in the sky but the stars were out..clear sky..was in 90s today..maybe I will be lucky and see them later again this weekend or during the week..will keep my phone with me..feel so lucky to have seen this.."],"map":"<A HREF = \"http://maps.google.com/maps?q=37.934679,+-122.052875(50677)&iwloc=A&hl=en\"> mufon case (50677) map </A>","Case Number":"50677","Weather Factors":"Unknown","Region":"California","Latitude":"37.934679","Summary":"bright orange lights..left side of small plane in sky.two moved futher left then disappeared..other just disappeared..fouth followed plane then when plane moved further to right fourth orange light diappeared"}