{"trends":["There have been no other sightings in Hagersville","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Log Number":"CA-09082013-0017","Weather Factors":"Unknown","Date Submitted":"09/08/2013 01:28 UTC","Source":"MUFON","Object Shape":"Circle, Sphere, Star-like","Date of the Event":"09/07/2013 09:00 UTC","Tags":"City","divs":["Sighting DetailsMy girlfriend and I were driving on our way home from her parents house just as it was nightfall. There was a good view of Venus and Saturn so I was keeping an eye out the window. About 500M from our driveway I took one last look at noticed 4 orange lights. I could figure out what they were. I first thought there were maybe fireworks, then maybe lights on an antenna tower. they were in a vertical line to our North west just above the horizon. The second light to the bottom looked to be more west than the other three. They disappeared behind a building and when we passed it they were now more in a square formation. I told my girlfriend to pull over so I could show her, we pulled into our driveway and got out. There were 3 now, I wasn't watching for maybe 10-15 seconds. The three now were in a triangle formation slowly heading east right over the hi way. My girlfriend went back to get her camera and as she grabbed it from the car they disappeared behind a cloud. We have both worked at the airport for 10 years and know what planes look like at night. It was not a plane. It was too low and too slow to be a satellite. I have no idea what it was."],"Object Flight Path":"Hovering then path","Summary":"3 orange lights in a triangle formation crossed us then disappeared behind a cloud","City":"Hagersville","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=42.95989,+-80.052286(50688)&iwloc=A&hl=en\"> mufon case (50688) map </A>","Longitude":"-80.052286","files":["/var/www/straped/mufon/html2text/50688.html.txt","/var/www/straped/mufon/org/50688.html"],"Latitude":"42.95989","Region":"Ontario","Viewing Distance":"101-500 Feet","Country":"Canada","Disposition":"Unresolved","Case Number":"50688"}