{"Object Flight Path":"Other","Date of the Event":"09/08/2013 09:30 UTC","Case Number":"50696","Region":"Massachusetts","Weather Factors":"Unknown","Country":"United States","Viewing Distance":"Unknown","Longitude":"-70.934835","Log Number":"US-09082013-0025","Date Submitted":"09/08/2013 11:39 UTC","City":"New Bedford","map":"<A HREF = \"http://maps.google.com/maps?q=41.642669,+-70.934835(50696)&iwloc=A&hl=en\"> mufon case (50696) map </A>","divs":["Sighting DetailsI saw a UFO in the same spot a few days ago also. I was on my porch smoking a cigarette, like I normally do, and I noticed this bright star that I saw the other day and then it disappeared the other day too. So because I knew that it wasn't a star because I noticed it the other day and then it was gone, I looked at it very carefully. It just looked like the brightest star in the sky but I noticed that it was bouncing around, so to speak. It was moving up and down and left and right and maybe forwards and backwards but I couldn't tell. It was mostly a white light but I noticed a little bit of color in there too. I actually went inside of my house and got my mother to show the UFO to her. She came out on to the porch and noticed it was moving around in place too. She didn't watch it as long as I did but at first she said \"I see it moving up, it must be an airplane\". Then I called her out maybe 20 minutes later to show her that it was still in the same spot, but not exactly. Airplanes don't hover and bounce around in place like this UFO did. And then later I called her out on the front porch to look at it one last time because the UFO was moving behind a big tree in the neighbors yard. (The UFO was pretty far away and pretty high up but not that far away because I saw it.) So the last time she went on the porch she had to go way to the left side of the porch to see the UFO that was slowly moving behind the tree. I watched the UFO for maybe 1 hour or so, give or take. The coolest thing about it was that it was basically hovering in place but it was bouncing around from left to right and up and down. I definitely noticed that it was moving because I sat on a seat on my porch and put a power line in between me and the UFO. I then kept my head very still and I noticed that the UFO was going up and down relative to that power line wire that WAS blocking the UFO. At first the UFO was above that same power line wire and by the time it moved behind the tree it was below that power line wire, and by quite a bit too. So from my perspective it descended. So at first I thought it was a star but I knew the other day that there was a \"star\" that just disappeared from the sky so I thought it might be a similar UFO and that's why I watched for so long or otherwise I would have passed it off for a bright star. My feelings were that I think the aliens are coming to visit. I was a little amazed that I noticed the UFO bouncing in place and then move so much, but very, very slowly. I lost sight of the UFO because it went behind a big tree in my neighbors yard. Thanks!"],"Disposition":"Unresolved","Summary":"It looked like a bright star was bouncing around and moving until I couldnt see it any more.","files":["/var/www/straped/mufon/html2text/50696.html.txt","/var/www/straped/mufon/org/50696.html"],"Latitude":"41.642669","trends":["There have been 7 other sightings in New Bedford","There was one other sighting in New Bedford on or around September 8th 2013"],"Source":"MUFON","Object Features":"Unknown","Sighting Duration":"Undisclosed","Object Shape":"Star-like","Tags":"City"}