{"Case Number":"50692","Date Submitted":"09/08/2013 05:26 UTC","Date of the Event":"09/07/2013 10:25 UTC","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/50692.html.txt","/var/www/straped/mufon/org/50692.html"],"Log Number":"US-09082013-0021","Sighting Duration":"Undisclosed","Tags":"City","Latitude":"39.911639","map":"<A HREF = \"http://maps.google.com/maps?q=39.911639,+-75.073049(50692)&iwloc=A&hl=en\"> mufon case (50692) map </A>","Region":"New Jersey","Longitude":"-75.073049","divs":["Sighting DetailsI was driving down marlton pike and saw several objects in the sky that were just hovering. They caught my attention because the empty dark sky is prominent on that part of Route 70. At first I thought it was lanterns or flares, because there was no immediate movement. Then they started to move, one more than the others. At the same time three of them vanished and one remaining one changed direction and began to head NE. They had what looked like intentional directional movement, and were not flares or lanterns. All I know is that they were moving fast in the sky. Philadelphia International Airport has flight paths that cross over here, I have seen hundreds if not thousands of planes over my time living here; these objects were unlike anything I have seen in the sky. I was able to take photos and video, but now I understand why all UFO photos are terrible, I used my iPhone and to me they were shoddy. Take a look for yourselves. Thanks."],"trends":["There have been 7 other sightings in Cherry Hill","There were no other sightings in Cherry Hill on or around September 7th 2013"],"Weather Factors":"Unknown","Object Features":"Unknown","Viewing Distance":"Over One Mile","City":"Cherry Hill","Source":"MUFON","Country":"United States","Summary":"4-5 lights in the sky, appeared suddenly, majority took off NW one remained heading NE.","Object Shape":"Circle, Fireball, Sphere"}