{"divs":["Sighting DetailsOk, so there was a veld fire burning that has been burning for a few days and I was worried about the smoke and my parrots in the outside aviaries. I went for a walk to check how far the flames were and how immanent a threat. So I looked up the mountain on our property to see if I could see flames and not just smoke. So I noticed a 'plane' fly over. We get a lot of small planes around here, but then when I looked at it. It had no wings. I looked at it again, like a butterfly without wings, how does it fly? that couldn't possibly work is what I thought. If I had to describe it, from my view point in 2D. It was a long cream coloured rectangle with almost like a attachment on the back end. Like the hilt of a sword. It was not going fast, same speed as a little plane would fly, but NO WINGS. Not fast enough for a missle and there were no line behind it. It was just weird. Honestly it didn't have a lot of relevance at the moment the fire and the possibility of losing my home was a much bigger concern on my mind, I kept on my walk and checked on the flames and the wind speed. Also if anyone ever shows up here asking about UFOs I'll send you packing."],"Country":"South Africa","Weather Factors":"Unknown","Latitude":"-28.9","Longitude":"27.566667","Object Features":"Appendage(s), Other","Object Shape":"Cylinder, Other","Date of the Event":"08/08/2013 05:03 UTC","Date Submitted":"09/08/2013 04:44 UTC","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/50690.html.txt","/var/www/straped/mufon/org/50690.html"],"Case Number":"50690","Disposition":"Unresolved","City":"Clocolan","Source":"MUFON","Region":"Free State","map":"<A HREF = \"http://maps.google.com/maps?q=-28.9,+27.566667(50690)&iwloc=A&hl=en\"> mufon case (50690) map </A>","Tags":"City","Sighting Duration":"Undisclosed","Summary":"It was a warm dry Sunday and the veld fire was getting close to my farm-home, I went for a walk to check on the progress of the fire and this 'plane' flew overhead and it had no wings and I thought to myself, what the hell, how does that work?","Viewing Distance":"Unknown","trends":["There have been no other sightings in Clocolan","This sighting has never been favorited."],"Log Number":"ZA-09082013-0019"}