{"Object Flight Path":"Straight-line path","Summary":"Unexplained lights in sky above Port Saint Lucie, FL","Tags":"City","Source":"MUFON","Object Features":"Unknown","Viewing Distance":"Unknown","Object Shape":"Fireball, Other","Case Number":"50703","Weather Factors":"Unknown","Disposition":"Unresolved","Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=27.239972,+-80.378614(50703)&iwloc=A&hl=en\"> mufon case (50703) map </A>","divs":["Sighting DetailsAt 20:35 EST my Girlfriend called me in a panic stating that while walking her dog she witnessed approximately 15 yellowish orange lights traveling from the Northeastern sky very slowly without making a sound in a Southwesterly direction. She also stated that the lights were emanating heat and she could see a haze in the sky surrounding them. There were cars that had stopped to witness the event as well. After speaking with me she called 911 and was informed by the Operator that they were receiving calls related to the event from both Saint Lucie and Martin County. I conducted a cursory search on the Internet to see if Cape Canaveral had any disclosed launches and if any fires had been reported in the vicinity. I found no information on either. I did find that in August of this year another report was made pertaining to the exact same lights in the sky and in the same city. There has also been no reporting in the local media. My only guess would be flares dispersed from a military aircraft though unlikely over a heavily populated area due to the threat of potential fires."],"City":"Port St. Lucie","Longitude":"-80.378614","Log Number":"US-09092013-0007","trends":["There have been 10 other sightings in Port St. Lucie","There were no other sightings in Port St. Lucie on or around September 8th 2013"],"Latitude":"27.239972","Country":"United States","Date of the Event":"09/08/2013 08:35 UTC","files":["/var/www/straped/mufon/html2text/50703.html.txt","/var/www/straped/mufon/org/50703.html"],"Date Submitted":"09/09/2013 02:48 UTC","Sighting Duration":"Undisclosed"}