{"Summary":"strange lights moving in a very unusual pattern.","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/50706.html.txt","/var/www/straped/mufon/org/50706.html"],"divs":["Sighting DetailsI'm a musician now living in Maine,my band just finished our set at the local coliseum. We were loaded up and getting ready to leave when our bass player noticed something in the sky. We all (5-6-people) looked up and saw several lights in the sky. It took a few moments to comprehend what we were seeing.It's kinda hard to explain,mostly because I have no normal frame of reference to give you a mental picture. The closest i can come is to say it looked like the lights were attached to an huge,invisible perpetual motion machine. the first thing I saw was 3 white lights in a triangular pattern, the 2 white lights at roughly the same level on top with a third light seeming to hang below. The lower light seemed to be slowly swinging left to right. As we watched, a fourth light(red) came on above the two upper lights,slightly to the left. Next,two green lights appeared to the right and left of the red light. here's where it gets really weird, the two green lights rotated first left 180 degrees,then right 180 around the red light as all three swung slowly to the left and right. it almost appeared as if they were waving to us like they knew we had noticed them. Then the colored lights went out but the white lights stayed on.Initially the whole formation seemed to be moving left to right,then stopped when the color sequence happened, them slowly moved directly away from us and faded into the distance. It was around the height where a helicopter would normally fly,made no noise whatsoever. I'm still trying to comprehend what I saw,but the motion of the lights was so bizzare that I can't... I have seen a lot of photo's and video of strange phenomina,and I can tell you this was absolutely unique."],"Object Features":"Unknown","Tags":"City","trends":["There have been 4 other sightings in Lewiston","There were no other sightings in Lewiston on or around September 7th 2013"],"Object Shape":"Unknown","Country":"United States","Disposition":"Unresolved","Longitude":"-70.212346","Source":"MUFON","Date of the Event":"09/07/2013 09:30 UTC","Latitude":"44.109851","Case Number":"50706","Region":"Maine","Sighting Duration":"00:01:00","City":"Lewiston","map":"<A HREF = \"http://maps.google.com/maps?q=44.109851,+-70.212346(50706)&iwloc=A&hl=en\"> mufon case (50706) map </A>","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Log Number":"US-09092013-0010","Date Submitted":"09/09/2013 09:15 UTC"}