{"Object Flight Path":"Straight-line path","Date of the Event":"09/02/2013 09:15 UTC","files":["/var/www/straped/mufon/html2text/50705.html.txt","/var/www/straped/mufon/org/50705.html"],"Log Number":"US-09092013-0009","Viewing Distance":"Unknown","Summary":"Firey orange bright object appeared overhead moving slowly towards the ocean. Noiseless.","Region":"Hawaii","Object Shape":"Fireball, Oval","Disposition":"Unresolved","Latitude":"21.88702","divs":["sighting detailsmy partner and i had just left a restaurant in poipu and got in our car to drive home. we both suddenly decided to take a walk down a quiet street where there was a small beach to watch the stars. there were two men fishing in the darkness at the beach and they moved off down the beach when we sat down. we stayed for about 15 minutes and were about to leave when i looked straight up at the stars and slightly behind us overhead a 'fireball' was moving slowly towards the ocean from the direction of the hills. we were sitting in front of a high wall so could not see very far behind so do not know where it came from. only that it was big about the size of a 3\\4 moon, and moving in a straight line right over the restaurant we had come from or so it seemed. we wondered what it was. i first thought it was a ufo but tried to reason that it could be a meteor but it had no tail, no sound and was too slow to be a meteor. as we were on the beach it went over quickly from when we first saw it and went straight out over the water and disappeared. it seemed to speed up significantly over the water as it was gone in a few seconds. we did not see it go into the water. and the direction was ssw. there is nothing out there such as another island for quite a ways. i think the entire event was less than a minute. maybe 30 seconds. i have looked for other observations that night but have not found any. but have seen others photos of the firey orange crafts very much like what we saw."],"trends":["There has been one other sighting in Koloa","There were no other sightings in Koloa on or around September 2nd 2013"],"City":"Koloa","Case Number":"50705","map":"<A HREF = \"http://maps.google.com/maps?q=21.88702,+-159.456632(50705)&iwloc=A&hl=en\"> mufon case (50705) map </A>","Tags":"City","Sighting Duration":"Undisclosed","Country":"United States","Date Submitted":"09/09/2013 04:31 UTC","Longitude":"-159.456632","Object Features":"None","Source":"MUFON","Weather Factors":"Unknown"}