{"Object Shape":"Triangle","divs":["Sighting DetailsMe and my girlfriend were going to the store and saw a object floating in the sky. I told my girlfriend to look at that floating. She looked and said it was a satellite. I said no its not look at the light and the movement. This thing was MOVING fast. After getting to the store and heading back home. We saw it again in a totally different area of the sky. The lights were 1 constant rapidly blinking white light. The last lights were blinking sequential to each other. The maine light constantly blinking. As we got out on the back road to my house we saw it again so we stopped and watched. The object looked as if it were moving away. Then all of a sudden it went from far away to getting bigger and bigger very rapidly. So i told my girlfriend lets go we sped off toward. After we started heading to the house i watched it it followed us the whole way flying at lightning speed to a different portion of the sky. When we got to my house we got out of the car and it was just hovering in the sky. I watched it the whole way to the house. As i went to take the last step to the house the object dissapeared. I was kind of starled and scared by what happened same as my girlfriend."],"files":["/var/www/straped/mufon/html2text/50717.html.txt","/var/www/straped/mufon/org/50717.html"],"Weather Factors":"Unknown","Date of the Event":"09/09/2013 08:50 UTC","City":"Anson","Source":"MUFON","Longitude":"-69.881461","Sighting Duration":"Undisclosed","Summary":"Object hovering in sky started to follow me","Viewing Distance":"501 Feet - 1 Mile","Case Number":"50717","Object Flight Path":"Path then hovering","Log Number":"US-09092013-0021","map":"<A HREF = \"http://maps.google.com/maps?q=44.800732,+-69.881461(50717)&iwloc=A&hl=en\"> mufon case (50717) map </A>","Date Submitted":"09/09/2013 09:21 UTC","Disposition":"Unresolved","Tags":"City","Object Features":"Unknown","Latitude":"44.800732","Region":"Maine","Country":"United States","trends":["There have been 2 other sightings in Anson","There were no other sightings in Anson on or around September 9th 2013"]}