{"Object Features":"Unknown","City":"Lake Wales","Region":"Florida","Longitude":"-81.564775","Object Flight Path":"Straight-line path","Log Number":"US-09092013-0014","Viewing Distance":"101-500 Feet","Sighting Duration":"00:02:01","trends":["There have been 9 other sightings in Lake Wales","There were no other sightings in Lake Wales on or around September 7th 2013"],"divs":["Sighting DetailsThis is an account of the most recent of four or five sightings of similar phenomena. On the evening of Saturday the 6th of September, 2013 my wife and I walked out onto our open back porch to stargaze and have a smoke. Our porch is covered like a pavilion but isn't screened or enclosed. I looked to the southeast & noticed a bright orange orb floating slowly in an easterly direction. I called for my wife and she and I watched the bright object as it moved below heavy cloud cover. The orange light moved slowly until it eventually disappeared into the clouds. This was our 4th or 5th sighting of this type of object. I see them as all being the exact same type of object however my wife feels that one of the objects was different. It sounds funny but she felt that one of the sightings we had was more spiritual in nature. That encounter was followed by the sighting of a white canine that we'd never seen before on our property. I am familiar with chinese lanterns however I have never seen one close up. I find it strange that we've seen these months apart at different times of the evening. Sometimes they pulsate randomly. Sometimes the brightness is consistent. There is never any type of trail but at times it has seemed to either ascend or descend. When we saw our first object I thought it was meteoric material that had most of it's mass burned away causing it to almost float. Like volcanic rock? During all of these events we were in awe of what we saw. Speaking for myself, I was covered in gooseflesh. I felt like I needed a camera and I was frustrated that the sighting was so short. During our last sighting my wife ran to get her smart phone to try and photograph the bright object however it had moved too far by the time she returned with the phone. Each time we've seen this type of object we watched it until it either went into clouds or over some trees on our horizon. I feel we'll see it again in two or three weeks which seems to be the pattern."],"Date of the Event":"09/07/2013 09:26 UTC","Weather Factors":"Unknown","Summary":"Another Orange Orb/Fireball Witnessed gliding over Lake House","Date Submitted":"09/09/2013 11:40 UTC","Tags":"City","Latitude":"27.888906","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/50710.html.txt","/var/www/straped/mufon/org/50710.html"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=27.888906,+-81.564775(50710)&iwloc=A&hl=en\"> mufon case (50710) map </A>","Case Number":"50710","Source":"MUFON","Disposition":"Unresolved"}