{"Country":"Canada","trends":["There have been 9 other sightings in Brantford","There were no other sightings in Brantford on or around September 8th 2013"],"Latitude":"43.186321","divs":["Sighting DetailsThis is the most recent of sightings a friend and i have seen. The first time we seen the object it was just a hovering, star-like, multi-coloured light off my back deck. It moved slowly but stayed in the same area of the sky. The second time was a bit different, a plane flew by what looked like the same object. The plane kept moving and slowly got bigger and bigger till it passed overhead. However the glowing object (same as the prior night) stayed in the same area. After a few seconds the object started to drop rapidly then just stopped. The object was in the same location as the prior night, the object looked the exact same and did the exact same movements. The object was seen the second night for hours. I would continuously go outside and still see it, sometimes it would be in a slightly different location or have a different coloured glow but it would be in the same general area. The last time was the most unbelievable. Yesterday the same friend of mine and myself were driving home around 12am. We spotted the object as we turned the corner by dairyqueen on king george road. We stopped, got out of the car, and the object looked like an oversized helicopter or something. It had 2 lights on the front and back, 2 on each side (or each wing?), and one in the center above all the other lights. The object flew in the same manner, erratic. We couldn't believe it. The object then flew right over king george road, we hopped in the car to chase it. Chased it towards kensington where it flew low and started gaining speed. It then disappeared for about 5 minutes as we drove around and couldn't find it anywhere. As were driving towards memorial and powerline we see the same object hovering over the fields towards powerline and governors road. The object had turned off all flashing red,blue,pink lights and was staying almost perfectly still with only its white bright light one (which had a weird pulse to it). The object started to rise a bit and we realized there was no way we could catch it. We drove back to my house (where we seen the first 2 sightings) and seen the same object over in the same area as it was the first 2 times hovering by powerline and memorial. It started pulsing again like usual and moved to the left, to the right, and up and down. then just sat there like it had the other nights. we watched it for another hour or so then went inside. A few hours later i went outside and it was gone."],"Longitude":"-80.27104","Object Features":"Unknown","Case Number":"50712","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","Source":"MUFON","Date Submitted":"09/09/2013 03:11 UTC","Sighting Duration":"Undisclosed","Log Number":"CA-09092013-0016","Object Flight Path":"Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/50712.html.txt","/var/www/straped/mufon/org/50712.html"],"Date of the Event":"09/08/2013 12:00 UTC","Summary":"UFO witnessed near north-east end of brantford, 3 sightings of the same object","Object Shape":"Other","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=43.186321,+-80.27104(50712)&iwloc=A&hl=en\"> mufon case (50712) map </A>","Disposition":"Unresolved","City":"Brantford","Region":"Ontario"}