{"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/50713.html.txt","/var/www/straped/mufon/org/50713.html"],"Summary":"Hovering near airline headed towards LAX","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.053774,+-118.242545(50713)&iwloc=A&hl=en\"> mufon case (50713) map </A>","Date Submitted":"09/09/2013 04:49 UTC","Latitude":"34.053774","Disposition":"Unresolved","Object Shape":"Circle, Sphere","Object Flight Path":"Unknown","Case Number":"50713","Date of the Event":"09/08/2013 04:15 UTC","Country":"United States","divs":["Sighting DetailsI was driving north-bound on the 605 freeway. There is a flightpath followed by all incomming flights preparing to land at LAX. As I was driving I noticed a bright silver object hovering near an incomming passenger jet flying towards LAX, The object wasn't blocking that flight path, it was hovering a little higher than the incomming flights. Then I took a second to put my eyes back on the road where I was driving, then when I looked back at where the object was,it was gone. So I don't know what to think about it. When I first noticed it, I was thinking that it might possibly be another airline comming in for a landing, But a couple things seemed odd to me. 1. The shapes of other planes comming in where easily distinguishable, but this object looked like just a very bright light in the sky. There was plenty of sun out as it was only approx 4:15pm. It seemed smaller than other airlines and circular. 2. It wasn't moving at all. It seemed to just be hovering or frozen in place. Just beneath it was a large airline comming in towards LAX. 3. I looked away for just a second because I was driving and didn't want to cause a crash, then when I looked at it again, it was gone, and all I could see was that airline."],"Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-118.242545","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around September 8th 2013"],"City":"Los Angeles","Region":"California","Object Features":"Unknown","Tags":"City","Log Number":"US-09092013-0017"}