{"Object Features":"None","Longitude":"-119.416002","Region":"California","divs":["Sighting DetailsLeaving Los Angeles to ride down to Carlsbad on the motorcycle, friday night around 8pm. Heading east on the 101 fwy, around the Echo Park area, i just had the urge to look up to my right. I often look up at the sky while riding at night watching the lights from helicopters, plans, blimps, stars etc, and there are many helicopters over the LA sky at night. But what i saw was definitely none of the above. Three bright white lights in a triangle formation, or V shape with a red light in the center rear. I couldn't see the shape of the craft, just the lights forming the shape. It looked stationary as i stared at it for about 4 seconds which is a long time while on a bike. Immediately i knew it was not normal. I had to face the freeway, so took my eyes of the lights. I thought quickly, what the hell? that's definitely not a blimp which would be the only thing similar, but not really. I looked up again. A few trees blocked my view as they whizzed by. Then clear sky and no lights. I looked all around in the area. It was facing east direction, but to me looked stationary, i checked the fwy again, straight road, traffice moving steady and safely so i literally turned about face eastward with a clear view of the sky and still nothing. just gone. no where in sight. After determining it had gone i focused back on the ride knowing i had definitely seen what i had seen and it was, in my best judgment, an extra terrestrial craft in a V or triangle shape. Please feel free to contact me. Much thanks for your hard work. Paul."],"Log Number":"US-09102013-0002","trends":[],"Source":"MUFON","Object Flight Path":"Stationary","Viewing Distance":"101-500 Feet","City":"Undisclosed","Tags":"City","Disposition":"Unresolved","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=36.785861,+-119.416002(50724)&iwloc=A&hl=en\"> mufon case (50724) map </A>","Summary":"looked up while riding motorcyle on 101fwy. saw three white lights triangle formation one red light at center rear. looked at fwy then up again. lights gone. looked all around. they just vanished???","Latitude":"36.785861","Date Submitted":"09/10/2013 12:37 UTC","Date of the Event":"09/06/2013 08:10 UTC","Object Shape":"Triangle","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/50724.html.txt","/var/www/straped/mufon/org/50724.html"],"Case Number":"50724"}