{"map":"<A HREF = \"http://maps.google.com/maps?q=41.795864,+-87.975618(50728)&iwloc=A&hl=en\"> mufon case (50728) map </A>","Tags":"City","trends":["There have been no other sightings in Westmont","This sighting has never been favorited."],"Latitude":"41.795864","Viewing Distance":"21-100 Feet","Sighting Duration":"Undisclosed","Country":"United States","Longitude":"-87.975618","Object Flight Path":"Path with directional change,Path then hovering","Disposition":"Unresolved","Source":"MUFON","Object Shape":"Unknown","Region":"Illinois","Log Number":"US-09102013-0005","Object Features":"Unknown","Date Submitted":"09/10/2013 01:53 UTC","divs":["Sighting DetailsI was on my bike on my way home entering the town of Clarendon Hills when I saw way off in the distance a small looking plane that looked like it was moving and staying stationary at the same time and for sure it didn't look like it was leaving the area quick enough like a normal plane. So I kept my eyes on the sky as I continued home. Sometimes I would get a break in the trees and see a plane and wonder if that was it. I was alongside the tracks at one point when I was looking more and saw a plane not moving fast enough wondering if that was still it and so I got off my bike and pulled out my iphone and started to record but I couldn't see anything as I was recording because it was gone. But as I got into my driveway I was looking up some more and that's when I saw a object moving too slow so I ran into the house and grabbed my camera and ran into the backyard and the thing was there off in a distance and I started video taping it. It was pitch dark outside exactly 8:15pm when I first started recording and I had to stick my camera on zoom to help see it. I video taped it! Only the lights show in the videos. I stood there watching this thing slowly fly around for about 35 minutes. Basically it looked like it was staying in about a square mile since I was able to watch it so long. A few times it drifted off out of sight for a minute or so but came write back to the area. I couldn't see the color or size or shape in the darkness but I could tell it was small and didn't appear to have wings. I pictured it being rectangle shape or a little rounded since I could hardly see it. At one point it got pretty close like two houses down from me. I felt like it saw me. It was a little lower than a helicopter. I think it made a really low sound that reminded me of a hot air balloon sound or plane sound but was much more quiet. It had 4 lights on it and 3 were white and one was red. All the lights were in the front lined up and the red light was a above the white lights. The lights were blinking like planes do. I was sure it saw me with how close it got. I was thinking it was a drone. I got tired of watching it after a while and went back inside while it was still out there. I didn't feel scared. I am the same person from case #49609. This is the 2nd UFO I have ever witnessed in my life."],"City":"Westmont","Summary":"small thing with 4 lights slowly flying around","Case Number":"50728","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/50728.html.txt","/var/www/straped/mufon/org/50728.html"],"Date of the Event":"08/28/2013 08:15 UTC"}