{"Log Number":"US-09102013-0004","Weather Factors":"Unknown","Region":"Alaska","Viewing Distance":"Over One Mile","Summary":"Saw 3 glowing disks follow each other, the first followed by two close together about 30 seconds behind the first which followed approximately the path of local jet traffic would use for a SE approach to the airport","Object Shape":"Disc, Fireball","trends":["There have been 5 other sightings in Ketchikan","There were no other sightings in Ketchikan on or around September 7th 2013"],"Country":"United States","Object Flight Path":"Path with directional change","Date Submitted":"09/10/2013 01:57 UTC","Case Number":"50726","Object Features":"None","City":"Ketchikan","Source":"MUFON","Tags":"City","divs":["Sighting DetailsWe have an expansive view over Nichols Passage in SE Alaska. My wife, and I were sitting at home watching TV on September 7th, 2013, 9:25 PM when I noticed a bright light, like a fireball to the SE dropping through the cloud layer at 4,000 feet approx, a nightly vigil watching the Alaska Airlines jet on final approach to Ketchikan International Airport. Only this light was the wrong color, brighter and traveling too fast. I said to my wife, Cheri, get my cell phone and take a picture of this thing, as I went outside to get a better look with binoculars. This object which looked to me to be traveling at around 500-600 mph at 4000 feet and 3-4 miles distant from my location, it made a slow left turn at Blank Point and flew West down the Tongass Narrows over the airport and disappeared. My wife was going back in the house when I said wait, there's another one coming! I watched the second one with binoculars following the same flight path that all aircraft using IFF use, (Bushnell 10x 50's). It appeared to be a glowing disk of plasma- or like churning molten metal with 6 white lights rotating around this \"molten\" disk in a rapid pulse pattern, extremely bright. I did not see the third UFO that my wife saw following the second UFO because I was looking through binoculars limiting my field of vision watching the second UFO up close for approx 10 seconds. They made no sound. Our location gets every sound bounced off the mountains by aircraft and boats and these UFO's made no sound at all. They all disappeared as the first, into thin air or into the cloud cover. I'm a professional artist and registered guide, a trained observer. I have no reference in my experience of 56 years to compare this to."],"Latitude":"55.344002","Date of the Event":"09/07/2013 09:25 UTC","Longitude":"-131.641111","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=55.344002,+-131.641111(50726)&iwloc=A&hl=en\"> mufon case (50726) map </A>","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/50726.html.txt","/var/www/straped/mufon/org/50726.html"]}