{"Object Flight Path":"Stationary,Straight-line path","Log Number":"US-09102013-0001","Viewing Distance":"Over 1 Mile, Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.894841,+-94.5254(50723)&iwloc=A&hl=en\"> mufon case (50723) map </A>","Region":"Missouri","Country":"United States","files":["/var/www/straped/mufon/html2text/50723.html.txt","/var/www/straped/mufon/org/50723.html"],"Weather Factors":"Unknown","Case Number":"50723","Disposition":"Unresolved","Tags":"City","divs":["sighting detailsthis is the 4th night the moving\\sparkly stars are here! again same area behind my back door. i looked tonight at 8 pm just to see if they were out! it was kind of cloudy, gloomy - saw them faintly but few red lights .. after dark i was out and found them to east and west. seem so many! same thing as last night just wanted to report it again. this triangle is still above my house! why are they staying long like this? you all list short time and they seem to just be staying at night! since i first saw it i look every night!!! really feeling like i\"m in a movie! (not a good one) i went out - sparkling stars - triangles. i noted something tho - twice is was kind of greyish sky - no moon. then this cloud came in that look like they do in the day time. not the ones that reflect behind the stars. the open sky - just looking like you would in the day. i don't remember seeing clouds like this at night! but i'm so confused because i know i am seeing this. others in my area are. this is the 4th night and going on 3 hours. why do they like this area so much! how long did it go on before i noticed? wish someone could tell me what is going on. i have an idea - idk i just want to know something. i feel very just freaked out kind of. 4 nights and i am not just checking once! i do go out and in - so i can give my eyes a break! so - again tonight and still here now!"],"Date of the Event":"09/09/2013 08:10 UTC","Summary":"4th night in a row! Stars that flash red and white. Saw at least 2-3 triangles! Saw some that look like shooting stars. Can see behind clouds!!! No moon!","Date Submitted":"09/10/2013 12:15 UTC","City":"Grandview","Sighting Duration":"Undisclosed","Latitude":"38.894841","trends":["There have been 4 other sightings in Grandview","There were no other sightings in Grandview on or around September 9th 2013"],"Object Features":"None, Unknown","Object Shape":"Flash, Star-like, Triangle","Longitude":"-94.5254"}