{"Object Flight Path":"Other","Latitude":"43.630463","Case Number":"50721","Object Shape":"Sphere, Star-like","Sighting Duration":"00:00:05","files":["/var/www/straped/mufon/html2text/50721.html.txt","/var/www/straped/mufon/org/50721.html"],"Weather Factors":"Unknown","Source":"MUFON","Longitude":"-88.695235","Viewing Distance":"Unknown","Date Submitted":"09/09/2013 10:28 UTC","Disposition":"Unresolved","Region":"Wisconsin","Tags":"City","Log Number":"US-09092013-0025","map":"<A HREF = \"http://maps.google.com/maps?q=43.630463,+-88.695235(50721)&iwloc=A&hl=en\"> mufon case (50721) map </A>","Summary":"Large baseball-sized vibrant green object with \"spikes\" zigzagged through the sky","Object Features":"Unknown","trends":["There have been 6 other sightings in Waupun","There were no other sightings in Waupun on or around September 9th 2013"],"Country":"United States","divs":["Sighting DetailsAgain, my daughter has seen a very strange, bright green object about the size of a baseball (as seen from her bedroom window) zigzag across the sky above, basically over our street. She wasn't sure how high up it was but described it as the size of a baseball. The green orb-like light had \"spikes\" on it in random lengths. The event caused her to become very scared, since she's seen these things before and feels she has been abducted. She is 11. I went outside to look with her. There was minimal cloud cover over our house, with some wisps of clouds higher up. We could clearly see stars and planes and satellites flying overhead. She became fearful after a few minutes and went inside. I sat outside to watch if the light came back. What I saw in about 20 minutes of sitting outside was a flash of light overhead that I wasn't sure was a shooting star. It seemed rather close. I didn't get a good look at it so I just decided it must have been a shooting star. I also saw what appeared to be dark orbs swooshing past, but I figured these were just my imagination as well. Then, sitting on my porch, in the streetlight, I saw something below treetop level move down the street, like a vapor trail. There was no light, other than the streetlight, and if I hadn't been watching it, I wouldn't have seen this dark vapor move from east to west. I wasn't scared, but I was on the phone with my mother and I said, \"Oh my gosh, I just saw something!\" This vapor trail was seen in the streetlight. There were no fires nearby or woodstove heaters on being as the temperature outside is 82 degrees F which might explain a vapor trail, nor were there any cars driving past. This was a distinguishable swoosh of a vapor trail directly in front of my house. I would estimate it was about 4-5 feet long and dissipated almost immediately. This was not a shadow; I saw something really odd. As it was dark out, I know this was not a bird and I saw no bats this evening either. There was no sound other than crickets chirping. This is the third time one or two of my children have seen these strange glowing orb-like things with spikes on them. I don't know what they are and I have not seen them, but my kids are freaked out by them! I honestly believe they are seeing something strange because their reactions are always fearful and upset. I might even have chalked it up to imagination tonight had I not seen that weird vapor trail in the streetlight, about 20 feet up."],"City":"Waupun","Date of the Event":"09/09/2013 08:30 UTC"}