{"Weather Factors":"Unknown","Object Flight Path":"Other","Latitude":"41.641429","files":["/var/www/straped/mufon/html2text/50722.html.txt","/var/www/straped/mufon/org/50722.html"],"Date Submitted":"09/09/2013 10:36 UTC","Object Features":"Unknown","Source":"MUFON","Object Shape":"Unknown","Tags":"City","Date of the Event":"09/09/2013 08:30 UTC","Country":"United States","Case Number":"50722","map":"<A HREF = \"http://maps.google.com/maps?q=41.641429,+-70.937265(50722)&iwloc=A&hl=en\"> mufon case (50722) map </A>","Region":"Massachusetts","Summary":"It looked like the brightest star in the sky but it was \"dancing\" around in place.","Longitude":"-70.937265","divs":["Sighting DetailsI saw a UFO, that I reported, last night near the same spot too. I went out to my front porch around 8:30PM to smoke a butt and last night I saw a UFO that seemed like it was very similar if not the same UFO. Last night I saw a UFO that was doing the same thing so I was looking for a UFO tonight. It wasn't in the same spot tonight, it was a little higher and up to the left but I knew to look tonight too and there it was. It was like the brightest \"star\" in the sky except it was moving like doing a little dance. You really had to look at it to see it moving but it was moving up and down and to the left and to the right, it was doing little circles and spirals too. It wasn't a star because the other real stars were not moving at all and the real stars were not as bright. It wasn't an airplane because airplanes don't dance around and it didn't look anything like the airplanes that I saw later after the UFO went out of sight because of clouds I think. So last night I showed my mother that UFO that I reported to you guys yesterday and she noticed that it was moving around too. So tonight my mother was home again and I showed her the UFO that I saw tonight and again she noticed that it too was moving or dancing around in the sky. I remember yesterday that it was flashing too but not anything like an airplane. I don't know how to describe it because it was a little subtle so I won't, but stars don't blink like the UFO I saw did. The reason why I stopped watching it was because it got really dim and then I couldn't see it at all maybe because of clouds, but at first I could see it really good. This definitely looked like the same UFO that I saw yesterday but I can't prove it. It wasn't at the same spot as the one I saw yesterday but pretty close because both times I watched it from my front porch and it was close but not exactly the same spot, but they were both moving around slowly anyways. I was thinking about calling the police but I didn't. I just wanted someone to get it on video. Maybe the UFO will be in my city tomorrow too but I wont hold my breath but I'm going to look for it again. But it was definitely dancing or bouncing around in place. Thanks."],"Disposition":"Unresolved","Sighting Duration":"Undisclosed","Log Number":"US-09092013-0026","City":"New Bedford","Viewing Distance":"Unknown","trends":["There have been 7 other sightings in New Bedford","There was one other sighting in New Bedford on or around September 9th 2013"]}