{"Log Number":"US-09112013-0006","map":"<A HREF = \"http://maps.google.com/maps?q=40.503715,+-74.639924(50745)&iwloc=A&hl=en\"> mufon case (50745) map </A>","Date of the Event":"09/08/2013 12:00 UTC","Object Features":"None","Viewing Distance":"Over One Mile","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Object Shape":"Disc, Oval","Region":"New Jersey","Country":"United States","Latitude":"40.503715","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Date Submitted":"09/11/2013 10:30 UTC","Source":"MUFON","Tags":"City","divs":["Sighting DetailsI was laying in my backyard hammock looking at the stars, satellites and aircraft approaching Newark Airport with my binoculars. Aircraft were approaching from rhe west and southwest going east and then banking north and lowering to the airport. Between I would say 8 and 9 pm a small probably a commercial or private jet about 2000 ft up past over my house from the north and flew south. I put the binoculars on it for a few seconds and as I lowered them I saw a object with just my eyes behind, above and to the left of the jet. I immediately put the binocs on it and I see it is a disc shaped object with what looked small lights all around it's edge. It looked about the size of a small two engine jet liner. It made no sound and just kept going in a straight line until it was out of sight. I was shocked, I thought damn it is a flying saucer. I felt excited, I knew we are not alone here. It seemed so natural all of a sudden, I did not feel fear at all. I thought ok what do I do now, who do I tell? I went in told my wife and called my son. I decided to contact you and make this report. I am one of millions that report things like this I know. Won't do much good, but I know what I saw. They are here and I know it for sure now."],"files":["/var/www/straped/mufon/html2text/50745.html.txt","/var/www/straped/mufon/org/50745.html"],"trends":["There have been no other sightings in Hillsborough Township","This sighting has never been favorited."],"Longitude":"-74.639924","Case Number":"50745","City":"Hillsborough Township","Summary":"Observed disc following jet aircraft"}