{"Object Shape":"Circle","Source":"MUFON","Date of the Event":"07/14/2006 10:25 UTC","divs":["Sighting DetailsMy husband and I were standing outside at about ten twenty-five PM, letting our dog out for the last time before we went to bed. We were standing in our driveway, looking north towards springfield, and I noticed a very large bright light in the sky. I have no idea how far away it was, because it seemed so large that it was hard to judge how far away it was. It was lower than you would expect an aircraft, but the cell phone tower in the distance was at least three inches below it, relatively speaking. I pointed it out to my husband and he said, \"that has to be a tower or something, it's too bright for a plane.\" However, the object slowly moved straight drown, and then seemed to 'float' back up again. It did this for about three or four mintues, and we started to really get weirded out. It had no defining shape because it was so bright, that the only thing we could see was the light it was emitting. If I was holding and object in my hand, and trying to cover the entire thing up, it would have had to be pretty large...at least the size of a softball. We stood there watching this thing, and my eyes actually started to hurt looking at it. I would liken this to standing beneath a street light and staring straight into it. My husband suddenly pointed to the west, and we saw a helicopter start circling this thing. It completed two very wide circles around it, and then swung around again and started heading straight for it. As it got closer, the bright object ascended slowly, and we suddenly heard a very deep loud rumble, similiar to the sound of a large plane. As the helicopter approached, the object began heading west, seemingly straight for the helicopter. My husband said, \"Oh my god, they are going to hit eachother.\" because that's how close they were. However, the helicopter passed underneath it, and when they were right next to eachother, the helicopter looked dwarfed. The helicopter's light looked like a tiny pinpoint of light next to this object...so either, the helicopter was abnormally small, or this onject was HUGE and much farther away than we had orginally thought. When the object passed the helicopter it sped up and just raced away to the northwest. It was weird because before it had looked like a giant ball of light hovering, and suddenly all we could see were lights flashing in a very fast strobe like matter all along the bottom of it, which appeared to be completely flat and straight. This was no steady delayed light flashing, it was continously flashing one after another in the line so that it looked like the bottom of the obejct was actually rotating. The helicopter swung back around and followed after it, and then we lost track of both of them. I do not pretend to know what this thing was, but it was not something I have ever seen before. I have never seen two aircraft pass by eachother in such a haphazard way, and I have never seen something so bright and large hover in such a manner. I would like to call the radio station and ask if anyone else has reported seeing this, but I am a little afraid to do so. I don't mind talking to an investigator, but I don't want my name to be used as a 'witnesss' in any public forum. I just don't want people to think I'm crazy. Thanks, Emily Weaver"],"Object Flight Path":"Stationary,Hovering then path,Path with directional change","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/5074.html.txt","/var/www/straped/mufon/org/5074.html"],"Disposition":"Unknown","Case Number":"5074","Tags":"City","Latitude":"37.215567","map":"<A HREF = \"http://maps.google.com/maps?q=37.215567,+-93.288069(5074)&iwloc=A&hl=en\"> mufon case (5074) map </A>","trends":["There have been 31 other sightings in Springfield","There were no other sightings in Springfield on or around July 14th 2006"],"Date Submitted":"07/14/2006 10:25 UTC","Summary":"We saw a large hovering object, VERY bright, then a helicopter circled it twice, and the object took off and they crossed VERY closely in the air, we thought they were going to collide.","Sighting Duration":"Undisclosed","Log Number":"US-07152006-0003","Longitude":"-93.288069","Country":"United States","Object Features":"Unknown","Region":"Missouri","Viewing Distance":"Over One Mile","City":"Springfield"}