{"Disposition":"Unresolved","Longitude":"-118.782296","Source":"MUFON","Case Number":"50747","trends":["There have been 20 other sightings in Malibu","There were no other sightings in Malibu on or around March 18th 2013"],"Object Features":"None","Object Shape":"Sphere","divs":["Sighting DetailsWhile driving home about 9:15 pm on March 18th 2013, I was heading South on PCH. I stopped in turn Lane at Latigo Canyon to make left and had to wait for oncoming traffic. While I was waiting something caught my eye by beach. I thought I saw a boat on fire. I then was able to turn. I pulled over as soon as possible and grabbed my cell, shut off car. I was going to call 9-11 to report fire but then realized it wasn't a boat. I then proceeded to witness these bright round orbs coming up out of water, the first two went apx 100 feet in air then turned and came directly over me and continued into mountains. The remaining seven once arriving at same altitude, heading north straight up coastline. I was in such shock it didn't occur to me to start taking pictures until the first two were gone. ( I was quite scared) I then began trying to video tape them but my camera kept shutting off. I have many one minute and less videos and a few still pictures. It seemed they changed or morphed into a bigger brighter orbs while changing color. As I was parked I started witnessing other cars pulling over and jumping out to record this event on their cell phones. The two that went over my head seemed to be round orbs with a liquid looking plasma substance that was turning within it? It's hard to explain since I have never seen anything quite like it. I admit I started to panic when I realized they were coming straight towards me. The second I realized they were not \" Spaceships\" I felt calmer. I have no clue what these are and would love your experts to look at film. I witnessed something that I can not explain, and it's driving me crazy. Thank you for having a place to report these sightings it took a while to find you, but I'm happy I told somebody finally."],"map":"<A HREF = \"http://maps.google.com/maps?q=34.064145,+-118.782296(50747)&iwloc=A&hl=en\"> mufon case (50747) map </A>","Latitude":"34.064145","Weather Factors":"Unknown","Country":"United States","Summary":"Watched orbs come out of Pacific Ocean one by one, then watched as two went east, seven went north along beach","files":["/var/www/straped/mufon/html2text/50747.html.txt","/var/www/straped/mufon/org/50747.html"],"Date of the Event":"03/18/2013 09:15 UTC","Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"09/11/2013 12:50 UTC","Tags":"City","City":"Malibu","Region":"California","Log Number":"US-09112013-0008","Sighting Duration":"Undisclosed"}