{"Case Number":"50741","Object Features":"Other","Tags":"City","Date Submitted":"09/11/2013 12:36 UTC","Latitude":"32.550832","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/50741.html.txt","/var/www/straped/mufon/org/50741.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.550832,+-97.311179(50741)&iwloc=A&hl=en\"> mufon case (50741) map </A>","trends":["There have been 8 other sightings in Burleson","There were no other sightings in Burleson on or around September 10th 2013"],"Sighting Duration":"00:02:00","Object Shape":"Circle","Source":"MUFON","Region":"Texas","Log Number":"US-09112013-0002","Date of the Event":"09/10/2013 09:43 UTC","Longitude":"-97.311179","divs":["Sighting DetailsFor 2 nights this week, including tonight, my wife and I were sitting outside on our back porch looking at the sky when my wife noticed an object about the size of a large star moving north in a straight line across the sky. We looked at it each night with my binoculars and noted initially that it looked blurry. However, nothing else we observed was blurry. It was therefore not the binoculars; it was the object. It appeared to have a strange aura. Tonight I thought it looked like the top of a jellyfish--round, transparent--or perhaps the top of a parachute. It was not an aircraft or a bird or insect. It was not a balloon or plastic bag. It held a steady course, moving faster than such wind-blown objects. We could come up with no reasonable, logical, natural explanation for what we witnessed. It flew across the sky in a straight line with no sound or deviation of movement--just a strange fuzzy aura around it. It eventually flew out of view. I told my wife I would go online tonight and see if I could find anyone else who may have seen such an object. Sure enough, I did see a few online descriptions of \"flying jellyfish.\" However, this object had no tentacles or appendages hanging beneath its basic round structure. With the binoculars, I got the impression that it may have had several seams radiating from its center toward the perimeter, like an umbrella. In fact, the round edge may have been more like an umbrella than a perfect circle. Strange to see this thing twice in one week. We were both left baffled and bewildered."],"Country":"United States","Weather Factors":"Unknown","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Summary":"A round whitish transparent object moved across the sky 2 nights this week..","City":"Burleson"}