{"Latitude":"37.704486","files":["/var/www/straped/mufon/html2text/5075.html.txt","/var/www/straped/mufon/org/5075.html"],"City":"Edgar Springs","Object Features":"None","Summary":"Bright light moving west to northeast, no sound, no vapor trail, no marker lights","Case Number":"5075","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=37.704486,+-91.866545(5075)&iwloc=A&hl=en\"> mufon case (5075) map </A>","Tags":"City","Region":"Missouri","Disposition":"Unknown","Date Submitted":"07/14/2006 11:50 UTC","Weather Factors":"None","trends":["There have been no other sightings in Edgar Springs","This sighting has never been favorited."],"Date of the Event":"07/14/2006 11:50 UTC","Object Shape":"Fireball, Star-like","Longitude":"-91.866545","Sighting Duration":"00:04:00","Log Number":"US-07152006-0004","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsThis is the third time I have seen this same thing at this location. The last time I saw it, it was being persued by several fighter jets. No kidding! I reported it to you guys but have heard nothing back. This time it was alone. Same as first time. My wife also saw it the first time. Tonight it moved from the western horizon toward the northeast at probably a couple hundred miles per hour. It only took it a few minutes to pass completely out of sight. It made NO SOUND. It left NO VAPOR TRAIL. The sky was crystal clear, with NO WIND. It had NO MARKER LIGHTS. The atmosphere was heavy with moisture so there should have been a vapor trail. It was at less than 10,ooo feet so there should have been some kind of sound. I live way out in the country, and it is very quiet here. I should have been able to here something. I am a former paratrooper, so I am somewhat familiar with aircraft and such. I went outside to take a leak, and look for satilites, when I saw this bright light emerge from the western horizon. I watched it in silence, as it moved in a straight line, and passed out of sight into the northeastern sky. I did not know what to think. I don't know what the hell is going on, but I am really spooked! I sure wish I knew what this is! Could someone write me back? Thanks, T."],"Source":"MUFON"}