{"Sighting Duration":"Undisclosed","Longitude":"-82.513453","Source":"MUFON","trends":["There have been 28 other sightings in Asheville","There were no other sightings in Asheville on or around September 10th 2013"],"divs":["Sighting DetailsMe and my husband were heading back home after a date. We live way up a mountain next to the Parkway in NC near Asheville. We stopped at a lookout near our cabin to kiss, and in the middle of it I saw the objects. The sky was clear, and the moon must have been small because I don't recall seeing it and the stars were really out. The objects were a soft glowing orange color and stayed stationary. One was cigar shaped and the other was slightly smaller and round. The rou d one was above the cigar shaped one. I was very excited to see them because I knew they were not stars or airplanes. I immediately knew they were ukta dimensional or craft from space. The round one disappeared and then re appeared then the cigar shaped one disappeared and re appeared. They never moved around, and eventually they were both gone. It was late probably around 11 or 12 but im not sure. My husband was drunk and kept getting me to kiss him so as not to be rude I would, and I did not see how they left, but im assuming they just disappeared like they had been doing. It is cloudy tonight or I would be out there looking for more. I haven't quit thinking of them."],"Date Submitted":"09/11/2013 09:57 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.659856,+-82.513453(50758)&iwloc=A&hl=en\"> mufon case (50758) map </A>","Log Number":"US-09112013-0019","Region":"North Carolina","Object Features":"Unknown","Disposition":"Unresolved","Tags":"City","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/50758.html.txt","/var/www/straped/mufon/org/50758.html"],"Date of the Event":"09/10/2013 12:00 UTC","Latitude":"35.659856","Object Flight Path":"Stationary","Viewing Distance":"Over One Mile","Country":"United States","Summary":"Two orange glowing objects, one cigar shaped and one round were stationary in the sky they would alternate disappearing then reappearing.","Case Number":"50758","Object Shape":"Cigar, Sphere","City":"Asheville"}