{"Disposition":"Unresolved","Object Flight Path":"Other","Region":"New York","trends":["There have been 5 other sightings in Jamestown","There were no other sightings in Jamestown on or around August 20th 1971"],"Object Shape":"Cigar, Other, Unknown","Tags":"City","divs":["Sighting DetailsI recently recalled a \"missing time\" episode that my mother and I experienced when I was around 7 years old! I'm now 49 years old. When I began to think carefully about that memory, suddenly,the whole episode came back to me in absolutely shocking detail! the memory of how we were stopped while driving home,one night,by two \"policemen\". one of them was really tall,the other looked perfectly normal but was shorter than I was at age 7! we got out of the car... and then- ...I remember all these crazy things! things that now scare the hell out of me! I remember it all in order! from sitting in front of the car while they checked my mom for \"contamination\", to seeing several different types of creatures pass by a window, to seeing amazing visions of a place populated with tall \"Praying Mantis People\"! ...and the tiny big-headed \"nurses\"! I saw and played around with control panels and this weird little \"simulation\" thing of a guy running towards you on a path with some other guys farther back chasing him. all the while these \"nurses\" are right there doing something to my mom! she was just sitting there in some kind of wide-eyed trance staring at this big screen that seemed like it was feeding her false memories. and somehow I,like my mother,was in some kind of trance that just suspends your short-term memory so that you immediately forget what just happened two seconds ago! the fact is that I remember all this and more in great detail! (though some stuff is a bit hazy) I need a better method of communicating my experience besides this \"web form\" as the recollections are complex and extensive!"],"files":["/var/www/straped/mufon/html2text/50755.html.txt","/var/www/straped/mufon/org/50755.html"],"Sighting Duration":"Undisclosed","Summary":"stopped while driving at night by \"policemen\". road completely blocked by \"craft\"!","Weather Factors":"Unknown","Object Features":"Window(s), Other","Source":"MUFON","Date of the Event":"08/20/1971 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.151702,+-79.269291(50755)&iwloc=A&hl=en\"> mufon case (50755) map </A>","Log Number":"US-09112013-0016","Date Submitted":"09/11/2013 09:01 UTC","Country":"United States","Viewing Distance":"20 Feet or Less","City":"Jamestown","Case Number":"50755","Latitude":"42.151702","Longitude":"-79.269291"}