{"Tags":"City","Disposition":"Unresolved","Country":"United States","Date of the Event":"09/11/2013 11:00 UTC","Latitude":"43.810863","Region":"Oregon","Log Number":"US-09122013-0006","Object Features":"None","Longitude":"-120.546681","trends":[],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/50766.html.txt","/var/www/straped/mufon/org/50766.html"],"Summary":"solid black triangle flew silently overhead","Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Triangle","divs":["Sighting DetailsWhile sitting on the back porch of a friends house i saw a large, dull-black triangular object move very quickly overhead from the southern horizon to the north. It caught my attention because of the odd shape with 4 lights and how quickly it moved. I observed it for a total of maybe 15 seconds. The first few seconds i was trying to determine if it was a plane; after i realized it was triangular with no wings i tried to determine if it was maybe a cluster of shooting stars or some other explanation, but it became very obvious just as it was moving directly above me that it was at a low elevation and a solid object. As it flew directly over the top of me i was amazed to hear no sound at all. My friend was unable to see it as well as i was because of trees blocking his view, but he agrees that he has never seen anything (satellite or plane) move that fast from horizon to horizon without making any sound at all. Since he was only able to see 1 of the 4 redish lights he though it was a satellite, however he quickly realized it was moving far too fast for that to be the case. I probably would have convinced myself that i was seeing things if i hadn't actually watched it from horizon to horizon without taking my eyes off of it once."],"Date Submitted":"09/12/2013 09:52 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=43.810863,+-120.546681(50766)&iwloc=A&hl=en\"> mufon case (50766) map </A>","City":"Undisclosed","Weather Factors":"Unknown","Case Number":"50766"}