{"Weather Factors":"Unknown","Object Features":"Unknown","City":"Benicia","Summary":"Light descended and approached before disappearing behind trees","Case Number":"50764","Date of the Event":"09/10/2013 01:45 UTC","Source":"MUFON","Country":"United States","Sighting Duration":"Undisclosed","Tags":"City","trends":["There has been one other sighting in Benicia","There were no other sightings in Benicia on or around September 10th 2013","This sighting has never been favorited.",""],"Date Submitted":"09/12/2013 07:47 UTC","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/50764.html.txt","/var/www/straped/mufon/more/50764_submitter_file1__Beniciasightingmap.jpg","/var/www/straped/mufon/org/50764.html"],"Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=38.087067,+-122.111291(50764)&iwloc=A&hl=en\"> mufon case (50764) map </A>","Longitude":"-122.111291","Log Number":"US-09122013-0004","Object Shape":"Unknown","Latitude":"38.087067","Disposition":"Unresolved","divs":["Sighting DetailsDriving on northbound I-680 near Benicia, I noticed a light low to the ground, near Lake Herman Road (about a mile away) and descending even further to what appeared to be just above treetop level as I crossed the causeway over the refinery which is just northeast of the city. It was heading roughly west when I first saw it and then turned to its left towards me and paralleling the freeway, now heading southwest. As it turned, the light, which had been really bright white, like an aircraft headlight, dimmed and appeared to have something in front of it, blocking a direct view more than actual dimming. When it straightened out, the original intensity returned. At this point, I reached the other end of the causeway and the light became obscured by roadside trees. When I reached the Lake Herman Road exit, I could no longer see it. Thinking it actually might have been a crashing aircraft, I took the exit and went to the vista point on the other side of the freeway to get an elevated view of the area. I did not see anything in the sky nor a fire on the ground so, because there are a lot of warehouses back on the other side of the freeway, I drove through them looking for a crash. I saw a parked Benicia PD cruiser but nothing else so I got back on the freeway and drove to the next exit, Parish Rd, got out and looked. Still not seeing anything, I turned around and drove all the way to the E. 5th St exit in Benicia so I could turn around and drive across the causeway again, in case I saw a reflection. It didn't look like a reflection and I did not see it again so I decided to go home. When I got to the Marshview Rd. exit, I saw a CHP vehicle along the marsh with his lights going, looking like maybe he had seen the light too and was looking for a crash. About the time I was approaching Cordelia, he went by me at a high rate of speed but without the lights. There was no plane crash in the area that morning so I don't know what it was. The image shows the object flight path as it appeared to me in red (heading SW)and where I first saw it and lost sight of it in green (NE)."],"Region":"California"}