{"Longitude":"-95.562543","City":"Millerville","Region":"Minnesota","Case Number":"50760","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=46.067461,+-95.562543(50760)&iwloc=A&hl=en\"> mufon case (50760) map </A>","Date of the Event":"09/11/2013 09:05 UTC","Tags":"City","Latitude":"46.067461","Log Number":"US-09112013-0021","Object Flight Path":"Stationary","Object Features":"Unknown","Summary":"Extremely star like large bright light. Dipped and side to side. I turned my head and it disappeared.","Date Submitted":"09/11/2013 11:06 UTC","Source":"MUFON","trends":["There have been no other sightings in Millerville","This sighting has never been favorited."],"Disposition":"Unresolved","Sighting Duration":"00:05:10","Country":"United States","files":["/var/www/straped/mufon/html2text/50760.html.txt","/var/www/straped/mufon/org/50760.html"],"Weather Factors":"Unknown","divs":["Sighting DetailsI had gone out to burn garbage and as usual I scan the sky for anything out of the ordinary. Straight to the west of here there was a bright star like object hanging low just above tops of trees in the distance. At first I questioned myself as to whether or not it was Venus at first. But it was too low. Then it rose up a little and dropped down below the tree line. Nope, not a star. It continued to dip, raise up and move slightly side to side. I turned my head to go get the video camera and it disappeared. It's almost like it knew. I searched straight up for the object and spotted what could possibly been it. It was a tiny bright light way up in the sky. This area seems to have a lot of these sightings. I myself have seen these several times. One was extremely large and very low. My oldest son (now 21) has also been witness twice. There has got to be some reason why this area has so many visits. I have lived around here for pretty much most of my life. The duration was set at five minutes as I don't know how long it had be there."],"Viewing Distance":"Over One Mile"}