{"Disposition":"Unresolved","trends":["There have been 4 other sightings in Mena","There were no other sightings in Mena on or around August 26th 2013","This sighting has never been favorited.",""],"City":"Mena","Weather Factors":"Unknown","Object Features":"Unknown","Region":"Arkansas","Object Shape":"Other","Log Number":"US-09122013-0012","Tags":"City","Viewing Distance":"N/A","Date Submitted":"09/12/2013 02:03 UTC","Sighting Duration":"Undisclosed","Case Number":"50772","files":["/var/www/straped/mufon/html2text/50772.html.txt","/var/www/straped/mufon/org/50772.html"],"Summary":"Strange lights on game camera with animals, not sure if possible camera malfunction but lights move.","Country":"United States","Object Flight Path":"Unknown","Date of the Event":"08/26/2013 12:00 UTC","Longitude":"-94.407699","Latitude":"34.603353","divs":["Sighting DetailsDid not complete the above questionaire due to I'm not sure what is in the pics. Also have the still shots from the Moultrie game camera. When I first viewed the still shots I thought that a bug had zoomed by the lens as the cam triggered or some type of lens or LED artifact. But when I played the videos I was stumped. I would think that an LED malfunction would be stationary but these lights move, especially when the cam is stationary. The videos with the cats were 2 nights in a row and the bunny was last week. I did a google search and found several game cam pics similar but couldn't find any videos. My husband has witnessed on several occasions an \"orange light\" in the sky and prior to getting these videos we lost 4 cats. The timing with the cats and the lights are disturbing. HAVE NEVER visually seen these lights only on the videos. In the last video the lights are almost stationary in the road. Lights had basically only appeared with the animals other than the last pic. Would appreciate any info if anyone else has submitted anything similar."],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.603353,+-94.407699(50772)&iwloc=A&hl=en\"> mufon case (50772) map </A>"}