{"City":"Sandy Hook","Longitude":"-83.116018","map":"<A HREF = \"http://maps.google.com/maps?q=38.155079,+-83.116018(50771)&iwloc=A&hl=en\"> mufon case (50771) map </A>","Object Flight Path":"Path with directional change,Path then hovering","Weather Factors":"Unknown","divs":["sighting detailson labor day, 09\\02\\13, i, my wife, my sister and husband were visiting our mother in rural elliott co., ky. probably short of 5:00 pm, a strong dark thunderstorm was approaching from the west-nw direction. my sister loves taking pictures of storms and alerted me of an \"eye\" forming in the clouds in the southern portion of the storm. me being an optometrist, was fascinated by this eye with iris, pupil, lids, and orbital area. we both were using our iphones to photograph the cloud formation. later that evening, when i returned home, i sat down to review the photos. to the northern portion of the storm, i noticed a tiny black speck in one photo. as i enlarged the photo, there were three objects. the nearest object was disc shaped, domed top with possible appendage on superior aspect. the bottom was smaller bowl shaped versus top dome. i called my sister to bring her attention to the objects. she had a picture with one object closer and larger and more circular in shape with dark gray coloration, possibly the bottom of object. after reviewing multiple enlarged photos, there appeared to be several objects within the clouds. the storm was moving straight line, not swirling. the objects seemed to move independently of the wind. there were five of us viewing the storm and not one noticed the objects, just the eye cloud formation. those objects had to be someone's technology, not birds, etc. i relayed this information to your representative, allen eppling; however, he cannot receive our photos by email."],"Latitude":"38.155079","trends":["There have been no other sightings in Sandy Hook","This sighting has never been favorited."],"Object Features":"Appendage(s)","Object Shape":"Circle, Disc, Oval","Log Number":"US-09122013-0011","Source":"MUFON","files":["/var/www/straped/mufon/html2text/50771.html.txt","/var/www/straped/mufon/org/50771.html"],"Country":"United States","Region":"Kentucky","Case Number":"50771","Date of the Event":"09/02/2013 12:00 UTC","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","Summary":"Cellphone photographing on coming thunderstom WNW. Eye in clouds with multiple objects in storm.","Sighting Duration":"Undisclosed","Date Submitted":"09/12/2013 12:20 UTC","Tags":"City"}