{"map":"<A HREF = \"http://maps.google.com/maps?q=33.45889,+-82.22621(50775)&iwloc=A&hl=en\"> mufon case (50775) map </A>","Date of the Event":"09/10/2013 08:32 UTC","Object Flight Path":"Other","Disposition":"Unresolved","Weather Factors":"Unknown","Country":"United States","Date Submitted":"09/12/2013 05:14 UTC","files":["/var/www/straped/mufon/html2text/50775.html.txt","/var/www/straped/mufon/org/50775.html"],"Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsI was sitting on the patio watching for meteorites. I like to count how many I see in a given night. I seen the red-orange light appear just above the horizon (maybe one finger width). I have never seen any object of that color before at night. I don't make conclusions until I can see it more clearly. But after the 3rd time it appeared I knew it was no normal aircraft. I have 30 years in the military and know aircraft and helicopters and their motions in the day or night. About 8:30 Pm-A bright Red-Orange light appeared Directly South of where I was sitting. I watched it for about 4 Seconds. It went out. I continued to watch south and about 5 minutes later it reappeared a little farther east and closer. I could see lights around the edge of the UFO. The lights were spaced between what looked like openings or windows. I held up my fingers and it fit the width of two fingers. The Red-Orange craft hovered for about 3 seconds and went out. I continued to watch the south and in about 8 minutes it reappeared much close further East of when I seen it the first time. I held up my fingers and it spanned 3 fingers. I could clearly see distinct framing between the lights (maybe windows). The craft disappeared about 3 seconds after appearing. I continues to watch south and after 15 minutes I seen it for the last time south west of first time I seen it. It was much smaller and I held up my fingers and it was a little smaller than one finger width. 12 years ago I seen one in South Texas which was bright white and it too did the same thing this one did. Appear and disappear only it moved much faster and stayed visible longer. The craft spanned half the sky in less than 3 seconds before reappearing. It also changed direction each time I seen it. My conclusion on both of these is they are UFO."],"Object Features":"Dome, Window(s)","Log Number":"US-09122013-0015","trends":["There have been no other sightings in Grovetown","This sighting has never been favorited."],"Sighting Duration":"00:30:00","Object Shape":"Disc","City":"Grovetown","Latitude":"33.45889","Case Number":"50775","Summary":"A Bright Red-Orange structure disc shape disappearing and appearing with lights moving in various directions and altitude.","Tags":"City","Region":"Georgia","Source":"MUFON","Longitude":"-82.22621"}