{"Disposition":"Unresolved","divs":["Sighting DetailsMy family and I were headed eastbound on N.Green-ville rd on a summer night as always I would try to avoid the freeway because of so much traffic. As we came around the corner looking out my window North I saw a vertical flying object, and it stayed with us as I kept on driving but also very distracted. I pulled the car to the side of the road and hovering right above the trees and shrubs was this very colorful vertical flying object and my wife said maybe its a helicopter and I agreed, so I rolled the window down and was shocked to find there was no noise none at all not a peep!! I remember saying to my wife we need to draw a picture and document the time of this event (cannot locate drawing) but I will continue to try and find it. As I started to drive away from object because my wife was scarred and the object stayed with us until we reached the open road, and it was flying away from us over the freeway going south east, I stopped the car got out and watched with great excitement on my part, as this object within a matter of 1 or 2 seconds took off and just dis-apeard into the night I don't care if anyone believes this or not it was a incredible event of a lifetime!! Speaking for myself I was truly amazed and in disbelief of what I was witnessing, and very very excited. I think of this from time to time and try to realize what happened was real! My wife passed away in 2010 to this day I do wonder if her getting lung cancer had anything to do with what we encounterd. its the truth-on my wife's honor."],"Latitude":"37.746111","Date of the Event":"06/21/1995 12:00 UTC","Case Number":"50779","Object Features":"Other","Summary":"my wife myself and my 5 yr old son witnessed this event, it hovered vertical it reminded me of the starting lights at a drag race the vertical lights when I rolled my window down I turned to my wife and said do you here anything and we both said no","Weather Factors":"Unknown","Longitude":"-121.420823","Date Submitted":"09/12/2013 07:05 UTC","Country":"United States","Tags":"City","Region":"California","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","City":"Tracy","Viewing Distance":"20 Feet or Less","Log Number":"US-09122013-0019","files":["/var/www/straped/mufon/html2text/50779.html.txt","/var/www/straped/mufon/org/50779.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.746111,+-121.420823(50779)&iwloc=A&hl=en\"> mufon case (50779) map </A>","trends":["There have been 8 other sightings in Tracy","There were no other sightings in Tracy on or around June 21st 1995"],"Source":"MUFON","Object Shape":"Other"}