{"Date of the Event":"09/10/2013 11:00 UTC","Viewing Distance":"Unknown","Weather Factors":"Unknown","City":"Indianapolis","Summary":"2-3; NE and SE, not in formation; planes seemed to arc their pattern to avoid NE object","trends":["There have been 126 other sightings in Indianapolis","There were no other sightings in Indianapolis on or around September 10th 2013"],"Region":"Indiana","Object Features":"Unknown","Disposition":"Unresolved","Case Number":"50786","Date Submitted":"09/12/2013 11:25 UTC","Source":"MUFON","Log Number":"US-09122013-0025","map":"<A HREF = \"http://maps.google.com/maps?q=39.773103,+-86.151848(50786)&iwloc=A&hl=en\"> mufon case (50786) map </A>","Sighting Duration":"Undisclosed","Longitude":"-86.151848","files":["/var/www/straped/mufon/html2text/50786.html.txt","/var/www/straped/mufon/org/50786.html"],"Object Flight Path":"Stationary","Country":"United States","Latitude":"39.773103","divs":["Sighting DetailsI have seen these things intermittently all year. This evening I was letting my dog out via our backdoor for a potty. I always look up to see the stars. When I first started seeing this, I had no idea what it was. I felt a little scared. Over time, though, I just want to know exactly what it is. I have seen the same object at the same time for the past 3 nights. There is another object in the sky in a southeasterly direction this evening. Last night the planes changed their flight patterns to seemingly avoid this object I saw in the sky. Originally they were flying in a diagonal pattern over our house from the NE. Then I noticed that they started arcing around to the north to continue their flight to Indianapolis International seemingly trying to avoid this object. All the times that I have seen it, and most recently with binoculars that pick up ambient light, I still cannot make out a definite shape. I don't hear any sound. I don't smell anything odd. There is one thing that I noticed this evening. There was a distinct white flash that I saw through my binoculars. If it turns out to be nothing, that's fine. I just want the satisfaction of knowing what it is. I don't have a camera that is good enough to take pictures of the object. I wish I did."],"Tags":"City","Object Shape":"Diamond, Flash, Star-like"}