{"trends":["There have been 2 other sightings in Columbia","There were no other sightings in Columbia on or around August 25th 1998"],"Tags":"City","Disposition":"Unresolved","Viewing Distance":"20 Feet or Less","Source":"MUFON","Log Number":"US-09122013-0023","Summary":"I was taken aboard this ship, the room was very white. then 4 did test on me.","City":"Columbia","Latitude":"35.618262","Object Shape":"Disc","Longitude":"-87.032513","Date Submitted":"09/12/2013 10:28 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.618262,+-87.032513(50784)&iwloc=A&hl=en\"> mufon case (50784) map </A>","Date of the Event":"08/25/1998 12:00 UTC","divs":["Sighting DetailsI was in bed asleep and awoke to floating out my bedroom window. The wind was blowing my gown. I saw myself at the tree tops and reached to a limb to grab some leaves. They fell from my hand. I then realized a light was towards where I was floating. I looked to the path I was floating and saw a disc shaped object just above the trees. I was floating closer to the beam of light that was emitting from the bottom of the disc, the next thing I knew I was on a table in a round room. It was very white in the room and the light was of better quality than I have ever seen. I then saw 3 human like creatures. One was below my feet, the second at my right near my legs, the third was at my left and up closer to me. I looked around at them, then the one on my left took my hand, I was not afraid. I had an over whelming feeling of love and compassion from this entity. We looked each other in the eyes and I felt totally relaxed and at ease. Suddenly, a fourth entity came in that was taller than the rest. He came to my right side, just as a surgeon would do. The one at the right of me that was at my legs placed a thing on the fourth ones head. It looked like one of those things children look into to see pictures, the push the handle down and the picture changes. Well, anyway the taller one that had the gadget on his head pulled it down over his eyes the bent down over my chest and a small red beam emerged from the gadget and hit my chest, I felt pain and I could not breath, I felt like I was passing out. The next thing I know, I awake in my bed sweating and feeling panic. I have not shared this story to but a few people. Some of which looked at me like I was crazy. I know MUFON are believers, so I thought I'd share this story with you. Some people have told me it was just a dream, but I feel it was real. I looked so closely into the eyes of the one that was the tallest, which I will call the surgeon, and so closely into the eyes of the one on the left of me that held my hand, which I will call the anesthesiologist. I know they did not look like eyes, they looked like lens of some sort. Maybe it was a dream, but I will always believe it was real, I will never forget it, I know that for sure. I wonder how many times this has happened to me and I don't remember. What else have they done?"],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Country":"United States","Object Features":"Dome, Window(s)","Region":"Tennessee","Case Number":"50784","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/50784.html.txt","/var/www/straped/mufon/org/50784.html"]}