{"Object Flight Path":"Hovering then path","Disposition":"Unresolved","Viewing Distance":"21-100 Feet","Source":"MUFON","Longitude":"-123.034774","Object Features":"Unknown","Tags":"City","Region":"California","Weather Factors":"Unknown","trends":["There has been one other sighting in Cloverdale","There were no other sightings in Cloverdale on or around September 10th 2013"],"Object Shape":"Triangle","divs":["sighting detailson tuesday evening, coming home, my children and i saw three lights (one red, one blue and one white) hovering in the air above the river and vineyards. what made us notice it was the color of the lights and where they were located. i first thought it was a police helicopter so we slowed down and rolled down the windows because i didn't hear a helicopter sound, i also didn't see the trees or vines moving like they would if it was a helicopter. i asked my kids if they could hear anything and they both made a humming\\ whining sound that i was also hearing. i had stopped in the road by then looking up at it and could see the blue light reflected off the telephone pole. we were a little ways ahead of the object so i decided to turn around so we could see better. while turning around my children kept watching it. after i was able to turn my car around and drive back towards the object, the three of us saw it in the same spot and then it disappeared for a second and then we saw it blink back on about a quarter mile straight ahead and then shoot straight up in the air and disappear. the whole event lasted between 5 to 10 minutes but between first spotting it and getting home, there is another 5- 10 minutes that is unaccounted for but was not noticed until i received a phone call asking what was taking so long to get home. the entire visual event was 5-10 minutes, the entire time from first spotting it and getting home is 15-20 minutes, please note that from the area we spotted the object and our home is less then 5 minutes away, that leaves around 10 minutes of unaccounted time. after getting home my son said that behind eyes and his head hurt. during the event we all had the feeling of being watched, although we could not see any people (in the object or out on the road. we were the only people on the road at that time). now it has been 2 days and i'm am now hearing that other people in town saw it as well, although my children and i saw it extremely close and not at a distance like the other witnesses."],"City":"Cloverdale","files":["/var/www/straped/mufon/html2text/50782.html.txt","/var/www/straped/mufon/org/50782.html"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=38.817935,+-123.034774(50782)&iwloc=A&hl=en\"> mufon case (50782) map </A>","Sighting Duration":"Undisclosed","Date of the Event":"09/10/2013 08:05 UTC","Date Submitted":"09/12/2013 08:26 UTC","Log Number":"US-09122013-0021","Case Number":"50782","Summary":"On My way home on Tuesday evening, my children and I observed what we thought was a police helicopter hovering over the river and vineyards near our house.","Latitude":"38.817935"}