{"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.905639,+-118.214671(50799)&iwloc=A&hl=en\"> mufon case (50799) map </A>","Case Number":"50799","Object Features":"Unknown","Weather Factors":"Unknown","Object Flight Path":"Hovering then path,Path with directional change","Viewing Distance":"101-500 Feet","Tags":"City","City":"Compton","Object Shape":"Circle","Longitude":"-118.214671","trends":["There have been 4 other sightings in Compton","There were no other sightings in Compton on or around August 30th 2013"],"Summary":"Beam of white light in the sky traveling at a speed so fast in a circle it appears to distort sky","divs":["Sighting DetailsMy boyfriend witnessed a UFO flying first hand and took a video on his phone and pics of it and I witnessed the event from watching his video and looking at his pics. He says that he was standing outside in the daytime (early afternoon) when suddenly he noticed a beam of light in the sky moving at high rates of speed. He became suspicious when the craft began to make quick loops and it appeared to be doing tricks in the sky. It would move abruptly from side to side and up and down and then in a circular pattern again. Suddenly on the video the craft disappears into thin air. He says that the beam resurfaced approximately 400-500 feet in the sky and began to turn in circles so fast that it appeared to distort the part of the sky that was within the circle it made. He described it to have the same effect of heat rising from the grown and seeing how it slightly distorts the image of the ground. After that the craft disappeared. The second sighting was a row of three ufos that had different color lights moving in formation across the sky at night around 8:30pm. When he took a picture of the ufo it came out to look like a string of different color lights painted across the sky. Shortly after the ufo's disappeared. My boyfriend has pictures and video so please contact me as soon as possible!"],"files":["/var/www/straped/mufon/html2text/50799.html.txt","/var/www/straped/mufon/org/50799.html"],"Log Number":"US-09132013-0011","Source":"MUFON","Date Submitted":"09/13/2013 02:18 UTC","Region":"California","Disposition":"Unresolved","Latitude":"33.905639","Country":"United States","Date of the Event":"08/30/2013 11:00 UTC"}