{"Country":"United States","Date Submitted":"09/13/2013 06:20 UTC","Date of the Event":"09/10/2013 09:58 UTC","Object Flight Path":"Path with directional change","Case Number":"50795","divs":["Sighting DetailsI had just gone to bed and i had left the curtains open, and the sky had started to darken with the night but was completely clear without clouds. I looked out of the window as i lay in bed and saw a very bright pulsating object approaching my view, at first i thought it was an aeroplane as it had red and white lights, but as it got nearer i realised this was something very different. As the object approached me, quite slowly and silently, from experience i recall looking out of a aeroplane window into clouds where lightening is flashing below you, this transparent object seemed to contain this actual lightening event within itself, really beautiful and bright but as it passed above me there was a cluster of very deep red lights in a circle below it which did not flash.I could see that it almost looked transparent but could see their was a so called skin to it, all smooth,but like hexagonal sections,which all seemed to contain the wonderful light show. I was amazed and stunned, like the saying goes,like a rabbit caught in the headlights of a car.The object turned slightly in its path before disappearing behind other buildings in the distance. Consequently on the day before, the sameday and day after we had groups of military helicopters flying over our area, these were military as they carried missiles on the side,which is unusual around here and on the 12th september 2013 a large jet aeroplane flew across very low in the evening with a large radar dish on the roof of the jet, another peculiar site for this area."],"Disposition":"Unresolved","Object Features":"Patterned Surface","Sighting Duration":"Undisclosed","Summary":"Transparent pulsating red/white egg","Region":"Louisiana","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/50795.html.txt","/var/www/straped/mufon/org/50795.html"],"trends":["There have been no other sightings in Eastwood","This sighting has been favorited 1 time."],"City":"Eastwood","Tags":"City","Latitude":"32.556262","Longitude":"-93.56712","map":"<A HREF = \"http://maps.google.com/maps?q=32.556262,+-93.56712(50795)&iwloc=A&hl=en\"> mufon case (50795) map </A>","Log Number":"GB-09132013-0007","Object Shape":"Egg","Viewing Distance":"101-500 Feet","Source":"MUFON"}