{"Region":"Ohio","Weather Factors":"Unknown","Summary":"Copper rectangular coffin shape body with octagon shaped front. Yellow glowing orb protruding from front octagon section.Moved silent at low level.","Sighting Duration":"Undisclosed","Date Submitted":"09/13/2013 03:23 UTC","Object Shape":"Unknown","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=41.355073,+-82.727322(50793)&iwloc=A&hl=en\"> mufon case (50793) map </A>","divs":["Sighting DetailsI was traveling south on Patten Tract road in Sandusky Ohio Erie County, about 7:28pm. This road is next to NASA's Plum Brook Station. I first saw what I thought was a hot air balloon or a high flying kite. Then I realized it was moving towards me to fast to be either one of them. I was driving alone in my van with my eye glasses on. I could see very well as there were no clouds in the sky and the sun had not yet set. I followed the object with my eyes as it came closer to me. My mind went from what am I seeing to WOW. Thats not a normal flying object. It was following the road I was on going north. I was going south. The road was straight for miles. My viewing of this object from begining to end was about 20 seconds long. As the object came close enough for me to make out details of it I could see it was about 300 to 500 feet in the air, It was moving swiftly with no sound noted. It was rectangular in shape but the front of the object was octangular with a round yellow ball of light protruding from beneath the octangular section. The overall color of the flying object was copper with gold lines in the shape of a X on the rectangular section of the object. Gold lines made a octagon shape around the yellow plasma like ball. As it passed over me, I looked in my rear view mirror to see it. But did not see it. I continued to drive south for about 20 seconds looking back out my rear window. thinking I would see it. But did not. So I turned around and drove about 2 or 3 mile back to see if I could find it again. but did not. I then relized I was the only car on this road at this time. I then sent a friend a text of my event and drove home wondering if I had just saw a space ship or something not of this earth. I was not a believer of UFO's before this. Now I am 100% sure of them now."],"Tags":"City","Latitude":"41.355073","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/50793.html.txt","/var/www/straped/mufon/org/50793.html"],"Case Number":"50793","Longitude":"-82.727322","Source":"MUFON","Viewing Distance":"101-500 Feet","Object Features":"Patterned Surface","Country":"United States","City":"Sandusky","Log Number":"US-09132013-0005","trends":["There have been 3 other sightings in Sandusky","There were no other sightings in Sandusky on or around August 31st 2013"],"Date of the Event":"08/31/2013 07:27 UTC"}