{"map":"<A HREF = \"http://maps.google.com/maps?q=42.538118,+-89.007456(50791)&iwloc=A&hl=en\"> mufon case (50791) map </A>","Viewing Distance":"Unknown","Object Features":"Wings","Region":"Wisconsin","trends":["There have been 4 other sightings in Beloit","There were no other sightings in Beloit on or around September 12th 2013"],"City":"Beloit","Date Submitted":"09/13/2013 01:15 UTC","Sighting Duration":"00:00:04","Country":"United States","Weather Factors":"Unknown","Disposition":"Unresolved","divs":["sighting details i was on my deck with my telescope to observe the andromeda galaxy. i also had my binoculars to help with a quick location. after briefly scanning the ene skies near cassiopeia and finding andromeda i proceeded to pick a lens for my scope. looking up briefly before looking though the viewfinder, i saw a chevron shaped object flying very, very fast to the east. the object was perhaps 1-1.5 inches wide at arms length. when i first saw it the object was at approximately 25-30 degrees. it flew in a straight line with no altitude change. the object was light pink\\red with an almost transparent, watery aura appearance. i observed it for 3-5 seconds, then it faded from view. the object was below the clouds which were fairly light and wispy at the time of my observation. the color of the object remained unchanged throughout the observation. the color and faint light and strange appearance of the object seemed to emote from the object. it was not a reflection from anything as far as i can tell. when i first noticed the object i thought it could be a bird, however that notion was quickly dispelled by the appearance and incredible speed. this all took place at approximately 10:00 pm cdt. my initial reaction was puzzlement, then slight exhilaration. i don't know what i saw but i have never seen anything like it before."],"Latitude":"42.538118","Date of the Event":"09/12/2013 10:00 UTC","Case Number":"50791","Summary":"Chevron shaped object traveling at extremely high rate of speed was observed for approx. 5 seconds heading due east.","Object Shape":"Chevron","files":["/var/www/straped/mufon/html2text/50791.html.txt","/var/www/straped/mufon/org/50791.html"],"Object Flight Path":"Straight-line path","Tags":"City","Longitude":"-89.007456","Source":"MUFON","Log Number":"US-09132013-0003"}