{"Region":"California","Tags":"City","Log Number":"US-09132013-0006","Disposition":"Unresolved","Latitude":"38.910455","Object Features":"Appendage(s), Other","Summary":"I wish it was just a strange dream..","Sighting Duration":"Undisclosed","Date of the Event":"08/14/2011 04:00 UTC","Viewing Distance":"20 Feet or Less, Unknown","Object Shape":"Flash, Other, Unknown","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/50794.html.txt","/var/www/straped/mufon/org/50794.html"],"City":"Lower Lake","divs":["Sighting DetailsMy name is nick rosenberg, I'm 23 years old, and this is somethig that i need to get off of my chest.. It still haunts me and i just need people to know about it. A few years ago I was living at my grandpas house in the hills of clearlake california. He worked out of town and was only at the house a few times a month, so I was fairly secluded. Lake county is, for the most part, a very rural area. My house was on the top of a hill near the highway, but still very quiet.. Now, i've always had trouble sleeping and i had actually gotten to bed at a reasonable hour that night, but i woke up around 4am feeling restless. I wasnt surprised at this behavior, it happened often around the time, so i stepped outside to get some fresh air. I had been hearing strange things outside around my house that week so decided to grab my flashlight. I mean hearing strange things i mean like footsteps and almost guttural noises, growls and low grunts.. I thought it was maybe a deer? A bobcat? A cougar? Whatever. I wanted to scare it away, or at least just see what it was.. But to my surprise that night when I shined my light out at where the noise was coming from, i saw glowing eyes and something stood up. Tall, at least it seemed to me. It was about 3ft taller than the grass around it, which was probably about 4ft tall itself.. It seemed mad and i was so scared that i couldnt even scream. I wanted to and tried because i had family that lived nearby, i thought maybe they could see what i was seeing, or maybe i could scare this.. Thing, away from me. But i couldnt get myself to make a noise, like something was blocking me. I tried hard to yell as loud as i could, nothing came out. And then i remember getting a very good look at this thing.. Its skin was brownish, light brown splotched with dark brown with kind of a grey shade to it. It seemed to have holes in its body on its shoulder, arms, neck, chest... It had a humanoid frame ridges on its arms legs chest and head.. Its head was larger than normal, and so were its eyes, almost almond shaped, but still kind of rounded. The skin seemed like sharks skin, texture wise, or like what elephant skin without all the wrinkles would look.. After i had tried to scream i found myself stuck staring at its eyes, frozen in fear, standing on my deck in my boxers(thats actually an important detail) and its eyes went from pitch black to having kind of human eyes. A round pupil and cornea, except it turned amber, vibrant amber and spurred up like a flame.. Then i blacked out. I remember feeling myself being moved like i weighed nothing, as if i was a child. I rememer some dialogue even, but thats a different story. I woke up the next morning with no Immediate recollection of what happened, found it strange that i was on the top of my covers, fully clothed, and facing the wrong way on my bed.. I told myself this was only a dream until i started thinking about it more.. Things don't add up. They still don't. Someone please help me make sense of this.."],"Date Submitted":"09/13/2013 06:07 UTC","Case Number":"50794","Object Flight Path":"N/A","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=38.910455,+-122.610261(50794)&iwloc=A&hl=en\"> mufon case (50794) map </A>","Source":"MUFON","trends":["There have been no other sightings in Lower Lake","This sighting has never been favorited."],"Longitude":"-122.610261"}