{"Date of the Event":"09/13/2013 01:03 UTC","divs":["sighting detailswent outside to smoke a cigarette and noticed a bright red light to the west. it looked to be a few blocks away and a few hundred feet in the air. looked like a 'flying' road flare, same type glow. it started to gain altitude as it moved to the west. as it was moving away from me a second one appeared about a minute later in approximately the same place that i had noticed the first one. it also slowly ascended and moved westward. there was a good deal of separation\\distance between the two. both slowly 'floated' away and then faded from sight after about five minutes. first one vanished from sight about two minutes ahead of the second. first thought this may be a prank of some kind, possibly someone tying road flares onto helium balloons. years ago some friends and i filled up a garbage bag with helium and watched it slowly float up and away until we lost sight of it. this would have been bad timing for a prank though. it was just after midnight on a week night and the flight path took the 'lights' over about a mile of residential housing and then open country. chances slim and none that anyone would see them. checked the wind speed on the weather underground after coming back in. it said '0'."],"Region":"Oklahoma","Object Shape":"Fireball","Date Submitted":"09/13/2013 03:14 UTC","Log Number":"US-09132013-0004","Weather Factors":"Unknown","Object Features":"None","Country":"United States","trends":["There have been 22 other sightings in Norman","There were no other sightings in Norman on or around September 13th 2013"],"Tags":"City","City":"Norman","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=35.194845,+-97.491933(50792)&iwloc=A&hl=en\"> mufon case (50792) map </A>","Viewing Distance":"501 Feet - 1 Mile","Summary":"looked like road flares tied to helium balloons","Sighting Duration":"00:10:00","Object Flight Path":"Hovering then path","Source":"MUFON","files":["/var/www/straped/mufon/html2text/50792.html.txt","/var/www/straped/mufon/org/50792.html"],"Case Number":"50792","Longitude":"-97.491933","Latitude":"35.194845"}