{"Object Flight Path":"Stationary","Country":"United States","Object Features":"Other","Latitude":"38.958548","map":"<A HREF = \"http://maps.google.com/maps?q=38.958548,+-105.228047(50805)&iwloc=A&hl=en\"> mufon case (50805) map </A>","Source":"MUFON","Sighting Duration":"00:00:10","divs":["Sighting DetailsI went onto my deck to view a helicopter passing overhead. I was hoping for an Apache out of Fort Carson, but it was just another Blackhawk. As it passed overhead, noticed something to my SSE that was reflecting sunlight. I assume it was a reflection because of the color. The sun was to the SW at about the same degree above the horizon as the object. Focusing on the object at the portion that was not obscured by the reflection, it appeared to be boxy. Looking closer the box appeared to be a large rectangular structure on the northern end of the object. Object was dull aluminum in color. I heard ho sound or could detect no motion. I fairness the Blackhawk was still audible. I made a snap decision to go for my binoculars. I was back in less than 15 seconds and the sky was empty. I was extremely frustrated!! I ran around hoping that perhaps it had moved to some location still visible to me. No luck! I'm at 9,200 feet. If it was a mile away, then perhaps it was the size of a C130. I have no clue what this thing was. I saw nothing resembling propulsion. Someday perhaps I'll see something and I can say 'Oh that's what that was'. Total mystery."],"Summary":"Daylight reflected sunlight, rectangular structure with depth visible on 1 end","Log Number":"US-09132013-0017","Object Shape":"Unknown","City":"Divide","Case Number":"50805","Weather Factors":"Unknown","Viewing Distance":"Unknown","Date Submitted":"09/13/2013 05:51 UTC","trends":["There has been one other sighting in Divide","There were no other sightings in Divide on or around January 16th 2013"],"Region":"Colorado","files":["/var/www/straped/mufon/html2text/50805.html.txt","/var/www/straped/mufon/org/50805.html"],"Longitude":"-105.228047","Tags":"City","Date of the Event":"01/16/2013 03:15 UTC","Disposition":"Unresolved"}