{"trends":["There have been 5 other sightings in Pearland","There were no other sightings in Pearland on or around September 8th 2013"],"Country":"United States","Object Shape":"Unknown","Source":"MUFON","Tags":"City","Sighting Duration":"Undisclosed","Latitude":"29.493328","Longitude":"-95.293713","Summary":"Large Orange Rectangle stationary in the sky that flittered like fire stayed for about 30 minutes then faded away. As well as an orange glow about a mile or so long above the tree line in the same direction as the orange rectangle.","Object Features":"Unknown","Object Flight Path":"Stationary","Log Number":"US-09132013-0015","files":["/var/www/straped/mufon/html2text/50803.html.txt","/var/www/straped/mufon/org/50803.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=29.493328,+-95.293713(50803)&iwloc=A&hl=en\"> mufon case (50803) map </A>","Weather Factors":"Unknown","divs":["Sighting DetailsAbout 10pm Sunday evening September 8th my husband walked outside for some fresh air, looked up into the sky and I heard him say \"Am I seeing things?\" I went outside as well and looked up and saw a perfect orange rectangle in the South sky. It was positioned as a door would be with the two long sides vertical and two shorter sides horizontal and never changed shape. It looked to be pretty high up in the sky and very large. The orange color was bright and would flicker slightly like a fire would. My husband and myself walked down the street Southward toward an empty field across from our property along the horizon, directly above the tree line, was this bright orange glow that ran the length of the tree line which had to be at least a mile or two long. At first we thought that maybe it was a fire and a cloud was reflecting the fire but we saw no smoke, smelled no smoke, nor did we hear fire trucks. We live in the County and it's fairly quiet especially at 10pm at night. The orange rectangle stayed in the sky in the same place for about 20-30 minutes before fading until all we saw was one vertical black line. I have looked online trying to find a reasonable explanation for this, was it a fire, explosion, something, anything, but have come up with nothing. We also drove into the direction of where we saw this bright orange glow that appeared to be fire and have come up short there as well. No sign of fire anywhere nor was there a fire reported. While we were standing outside trying to figure out what this was our neighbor came home and we showed her what we were looking at and her 5 year old son said \"Oh that? I saw it all the way home.\" I tried to take a picture of it but it didn't show up on my camera."],"Date of the Event":"09/08/2013 12:00 UTC","City":"Pearland","Disposition":"Unresolved","Viewing Distance":"Over One Mile","Case Number":"50803","Region":"Texas","Date Submitted":"09/13/2013 04:28 UTC"}