{"Region":"Alberta","Viewing Distance":"Unknown","Log Number":"CA-09142013-0003","Latitude":"53.534097","Weather Factors":"Unknown","Object Shape":"Circle, Sphere, Star-like","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=53.534097,+-113.460714(50813)&iwloc=A&hl=en\"> mufon case (50813) map </A>","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path,Path with directional change","trends":["There have been 70 other sightings in Edmonton","There were no other sightings in Edmonton on or around May 7th 2013"],"Longitude":"-113.460714","Case Number":"50813","Country":"Canada","Source":"MUFON","Summary":"Hovering bright white light joined by identical light which appeared from no where","Date of the Event":"05/07/2013 12:00 UTC","Disposition":"Unresolved","Object Features":"Unknown","Date Submitted":"09/14/2013 01:25 UTC","divs":["Sighting DetailsI was in my room studying for an upcoming exam. Out of the window, I spotted a very bright white light, fairly close to the horizon. At first I dismissed it as some conventional aircraft (most likely a plane) but after a few separate glances I thought it wasn't moving at all. Just hovering, but far too bright to be a star (especially since I live in the middle of a city). Due to recent sightings I'd had from my bedroom window before, i decided to film the light for a while to see if I could capture any abnormalities, thinking to myself if there was nothing I would delete the video and never tell anyone I was silly enough to record it. As I started recording, the object began to move ever so slowly to the east. It maintained a fairly constant speed and barely even seemed to be moving. I started to think I was just seeing a plane at an odd angle and it was nothing. Just before I shut off the recording function on my phone, a second light appeared right next to the first. It was identical in shape, size and color. The first continued to move to the east, and as I review the tape I realize it did slowly gain speed. The second object moved at a slower pace, but headed in the same general direction as the first. I followed their continual movement as it moved south-east of the starting position. Eventually I could no longer see them from the window with the camera or my naked eye. I was shocked and somewhat frightened by the experience, and immediately went to show my mother the video. I was also very excited to catch something so odd on video, and have since been unable to explain the sudden appearance of the second object from no where."],"files":["/var/www/straped/mufon/html2text/50813.html.txt","/var/www/straped/mufon/org/50813.html"],"City":"Edmonton"}