{"Tags":"City","Date of the Event":"08/28/2013 10:18 UTC","City":"Whitefield","Latitude":"44.168854","Summary":"This has been happening for a while since august 28 strange,entity and observers looking in windows.","Disposition":"Unresolved","Longitude":"-69.632812","divs":["Sighting DetailsWell It all started on the morning of the 27th i awoke with a headache and felt like my eardrums were ringing.Then i went on to my back porch and noticed silver balls appearing out of the darkness.I noticed how they were rising out of the ground and covered by reflective surface.Within minutes the fog cleared and it became visible a large metallic shape.Id guess it was miles across.I thought i was loseing it. The next night i noticed the lights were ,moveing around in the back yard.I know every star and these did not make since these were not of ground but at a height of 50 feet away.I became aware of them and have been documenting everything since then.Know they are comeing right up to me and allowing me to capture them clearly.I have amazing proof of how they work.They hide in front of a lightsource and project there image threw that source.Much like a hologram does.They are watching every neighbour and scanning us.They are talking to me but I wont report that here.This is not one sighting its been every day since and I have taken a thousand images and want it all to be released.Also I wont say everything here."],"Source":"MUFON","trends":["There have been no other sightings in Whitefield","This sighting has been favorited 1 time."],"Region":"Maine","Object Flight Path":"Hovering then path,Path then hovering","Viewing Distance":"20 Feet or Less","Sighting Duration":"12:18:00","Log Number":"US-09142013-0009","files":["/var/www/straped/mufon/html2text/50819.html.txt","/var/www/straped/mufon/org/50819.html"],"Object Features":"Patterned Surface, Other","map":"<A HREF = \"http://maps.google.com/maps?q=44.168854,+-69.632812(50819)&iwloc=A&hl=en\"> mufon case (50819) map </A>","Weather Factors":"Unknown","Object Shape":"Circle, Cylinder, Diamond, Fireball, Sphere, Triangle","Date Submitted":"09/14/2013 03:54 UTC","Country":"United States","Case Number":"50819"}