{"Object Flight Path":"Straight-line path","Case Number":"50823","map":"<A HREF = \"http://maps.google.com/maps?q=41.286294,+-81.221891(50823)&iwloc=A&hl=en\"> mufon case (50823) map </A>","Date Submitted":"09/14/2013 06:36 UTC","Tags":"City","Viewing Distance":"Over One Mile","Latitude":"41.286294","files":["/var/www/straped/mufon/html2text/50823.html.txt","/var/www/straped/mufon/org/50823.html"],"Disposition":"Unresolved","Longitude":"-81.221891","Log Number":"US-09142013-0013","Object Features":"Unknown","Weather Factors":"Unknown","divs":["Sighting DetailsI was returning home from playing adult hockey driving south on Route 44 (Mantua) in Portage County ( I had nothing to drink)and was getting ready to make a left hand turn to head down my road when I looked up to see the moon and immediately noticed 4 orange lights just below the moon. The light in front was lower than the second, the third was in same position as the first and the last light in same position as second. A kind low, high, low ,high deal if that makes any sense. I had no idea what I was looking at so I made the turn onto my road and immediately pulled over and grabbed my cell phone in hopes of taking a photo. The view in My camera was so poor I ended up not taking a photo because it didn't show anything I was actually seeing. I was standing outside of my vehicle for 2 -3 minutes just watching these lights move in a straight line to the southeast. I watched until some cloud cover moved in and began to cover up the lights. I then jumped back into my truck and headed down my road ...which was the direction the lights were generally moving. I drove down my road which is down hill and has the Cuyahoga River running in the back yard. It is a heavily wooded area and the canopy of trees and clouds did not allow me to relocate the lights I saw at the top of the road."],"Source":"MUFON","City":"Mantua","Date of the Event":"09/14/2013 10:50 UTC","Summary":"Noticed 4 orange lights in sky","Object Shape":"Circle","Sighting Duration":"Undisclosed","Country":"United States","Region":"Ohio","trends":["There has been one other sighting in Mantua","There were no other sightings in Mantua on or around September 14th 2013"]}