{"divs":["Sighting Details I left Tomy's Restaurant at 10:50 PM being they were closing. As I walked down a main street on my way home I saw a big light flying low in my direction a little to my left. When I cut through apartment alleys as my short-cut I noticed the light was coming towards me near my street. When I was in the preschool parking lot near my street the light stopped and hovered about 35 feet from me over the preschool playground near a big tree. The big light was actually 2 car high beam lights in the front of a white painted 16' in diameter round object. It hovered in complete silence. The center of it had bubble glass panels that went all around. Each panel was about 6 feet long, and they all measured about 3' in diameter. It was very dark inside the panels. The high beam car headlights were about 6\" apart. When I thought it was a junky looking UFO probably belonging to teen aliens that it probably cannot fly very fast, it quickly budged then disappeared in a fraction of a second northward. The only way I knew of its direction of departure was from a 10' long tracer from the high beam car lights. The tracer was open at the end nearest me, and closed on the other end. It was angled a little northward. Thank you, Thomas"],"files":["/var/www/straped/mufon/html2text/50822.html.txt","/var/www/straped/mufon/org/50822.html"],"Sighting Duration":"00:03:30","Country":"United States","Region":"California","trends":["There have been 27 other sightings in Garden Grove","There were no other sightings in Garden Grove on or around October 14th 1993"],"Summary":"UFO over neighboring pre-school","Case Number":"50822","Date Submitted":"09/14/2013 06:22 UTC","Viewing Distance":"21-100 Feet","Tags":"City","Longitude":"-117.958948","City":"Garden Grove","Object Features":"Window(s), Other","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.795611,+-117.958948(50822)&iwloc=A&hl=en\"> mufon case (50822) map </A>","Source":"MUFON","Disposition":"Unresolved","Latitude":"33.795611","Log Number":"US-09142013-0012","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Object Shape":"Circle, Disc, Other","Date of the Event":"10/14/1993 10:54 UTC"}