{"Object Shape":"Cylinder, Unknown","Tags":"City","Viewing Distance":"20 Feet or Less","trends":["There have been no other sightings in Ft.Drum","This sighting has been favorited 1 time."],"Latitude":"27.672127","City":"Ft.Drum","Summary":"Two brothers 18 and 16 years of age are running down the road near their house and encounter a humalike being and a blue beam of light.","Sighting Duration":"Undisclosed","divs":["Sighting DetailsSometime during the late 90's a crop circle appeared in a small inland Florida town. The field was immediately cut down to avoid any publicity. Since then according to numerous witnesses unidentified lights have appeared in the sky in the area. These reports of seeing lights have even been shared and corroborated on facebook right after they occurred. Just this past early August two brothers were running in the area not far from their home and came across something in the middle of the road. According to their account of what happened it was a humanlike being that fled from them in a very fast stealthy manner. They described it being much larger than them taking up half of the road and crawling at first. They also claimed at one point it covered about ten feet in a single bound and jumped a fence. They felt like it did not want to be seen and described it as acting like a fugitive running from the law. They could hear it moving and heard it rattle a fence. Then the one brother shines his flashlight in the area where it sounded like it was. He then saw the being slowly move it's head up to his light. He described it as humanlike but with no hair and a larger forehead. The eyes that he saw lit up were described as human but catlike. As soon as the eyes looked back at him he was overcome with fear. Then a blue beam of light appeared from the ground to the sky and disappeared. They ran from the area as fast as they could."],"Region":"Florida","Date of the Event":"08/07/2013 12:00 UTC","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Case Number":"50829","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=27.672127,+-81.509994(50829)&iwloc=A&hl=en\"> mufon case (50829) map </A>","files":["/var/www/straped/mufon/html2text/50829.html.txt","/var/www/straped/mufon/org/50829.html"],"Source":"MUFON","Disposition":"Unresolved","Object Features":"Unknown","Longitude":"-81.509994","Log Number":"US-09142013-0019","Date Submitted":"09/14/2013 11:53 UTC"}