{"Summary":"Saw bright orb approaching at a good clip, stopped dimmed ascended about 500 feet then brightened and took off South East direction","Log Number":"US-09152013-0002","trends":["There have been 3 other sightings in Marshfield","There were no other sightings in Marshfield on or around September 15th 2013"],"Date of the Event":"09/15/2013 03:13 UTC","Object Shape":"Sphere","Disposition":"Unresolved","Date Submitted":"09/15/2013 11:09 UTC","divs":["Sighting DetailsSaw bright orb approaching at a good clip from North east over Rexham beach, stopped for 30 seconds dimmed ascended about 500 feet then brightened and took off East South East direction. When I observed this I was positioned around Telegraph hill 150 feet above sea level looking out my bedroom window, I was awake and alert. Object was above the ocean not on the surface. definitely seemed as if under intelligent control. Questions from side of text box. 1. Where were you and what were you doing at the time? \" I was in bed looking out my bedroom window.\" 2. What made you first notice the object? \" Object came into view as a fast moving orb.\" 3. What did you think the object was when you first noticed it? my thoughts were \"No way it couldn't be a UFO\" but I can't say it wasn't. 4. Describe the object and its actions and motions in detail. \" see above\" 5. Describe your feelings, reactions and actions, during and after sighting the object. \" my feelings were shocked, my reaction was, excited and then the hair stood up on my back. I wanted to get the camera but I didn't want to loose site of the object. 6. How did you lose sight of the object? I watched it speed up in the direction of East South East out to sea. I am going to position a camera on a tripod ready to shoot."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.095345,+-70.703967(50831)&iwloc=A&hl=en\"> mufon case (50831) map </A>","City":"Marshfield","Region":"Massachusetts","Object Features":"None","Country":"United States","Tags":"City","Latitude":"42.095345","Viewing Distance":"Over One Mile","Source":"MUFON","Longitude":"-70.703967","Case Number":"50831","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/50831.html.txt","/var/www/straped/mufon/org/50831.html"],"Sighting Duration":"Undisclosed"}