{"Tags":"City","Case Number":"50838","City":"Webster","Date of the Event":"06/11/2013 08:00 UTC","Summary":"ORANGE SPHERE GLOWING WITH F16 TRAILING AT LOW ALTITUDE","Sighting Duration":"Undisclosed","Longitude":"-95.110404","Log Number":"US-09152013-0009","Source":"MUFON","Object Features":"Other","Viewing Distance":"101-500 Feet","trends":["There have been 3 other sightings in Webster","There were no other sightings in Webster on or around June 11th 2013"],"files":["/var/www/straped/mufon/html2text/50838.html.txt","/var/www/straped/mufon/org/50838.html"],"Object Flight Path":"Path with directional change","Date Submitted":"09/15/2013 04:51 UTC","Region":"Texas","Latitude":"29.541892","Country":"United States","Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=29.541892,+-95.110404(50838)&iwloc=A&hl=en\"> mufon case (50838) map </A>","divs":["Sighting DetailsI was in my backyard, when I see an bright orange sphere fly overhead from southeast to northwest...I just observed a solid sphere, first in open air then towards my tree top level...above my tree line, then I observed UFO slow down almost to a stop and turn around as if to observe me...I initially panicked..but seconds later an F16 flew above me in almost a stall, following this UFO. I figured the sphere turn around to see approaching F16, not me. At that point...UFO started to turn left as it increasingly accelerated and ascended...and F16 almost in a stall turned to the right to gain altitude...with increased after burners...which I felt was in a stall or loss of power. F16 turning right was gaining altitude while UFO turned left and accelerated until it disappeared. I observed a couple of Helicopters 15 minutes prior 3 miles away as I arrive home that day, then after the siting...I saw Helicopters were flying with search lights on the ground and more plane surveilliance for 40 minutes. The sky was clear and visually perfect to see this event."],"Weather Factors":"Unknown","Disposition":"Unresolved"}