{"Tags":"City","Date of the Event":"09/14/2013 05:00 UTC","Longitude":"-72.530664","Date Submitted":"09/15/2013 01:55 UTC","Weather Factors":"Unknown","Summary":"UFO spotted while observing Airliner fly by","Latitude":"41.763946","Country":"United States","divs":["sighting detailsufo spotted while observing airliner fly by: time: ~ 4:45 pm. sept. 14 2013 i was watching an airliner fly over head while at the pool side (grilling up a steak). i particularly liked the bright white color of the underbelly and wings. and took time to notice the fairly bright red painted tail. ('military plane'? i wondered.) the jet was roughly 80 degrees incline from horizon when i first looked up. it moved smoothly along a north \\ north easterly direction at around , oh, maybe 6000 feet. then a white disc object at around 70 degrees caught my eye. it was just suspended there...hovering, floating about a wings' width away from the passing jet. i thought for a moment 'is it jupiter'? so bright like that??. nah! no way! to big. compared to the jet, i'd say it was at least the size of the nose section. and roughly 2000\\3000 feet above it. i instantly forgot about the plane and said to my daughter \" what is that\"???. i moved toward the fence that surrounded the pool to use it as a land mark \\ cross hair to position the object for her. while doing that i noticed it had abruptly lost its bright moon \\ planet - like glow which i had been observing for approximately 30 seconds: turning to lead-grey color for about 1-3 seconds before it seemingly blinked out. ( and yes, it seemed to blink out a few times.) i looked hard for it but couldn't find it. it was gone! i was like 'wtf was that?????'"],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/50835.html.txt","/var/www/straped/mufon/org/50835.html"],"Sighting Duration":"00:00:50","trends":["There have been 14 other sightings in Manchester","There were no other sightings in Manchester on or around September 14th 2013"],"Viewing Distance":"Over One Mile","Log Number":"US-09152013-0006","City":"Manchester","Case Number":"50835","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=41.763946,+-72.530664(50835)&iwloc=A&hl=en\"> mufon case (50835) map </A>","Region":"Connecticut","Object Shape":"Disc, Sphere, Star-like","Object Flight Path":"Stationary","Object Features":"None"}