{"Log Number":"US-09152013-0011","files":["/var/www/straped/mufon/html2text/50840.html.txt","/var/www/straped/mufon/org/50840.html"],"Object Features":"Unknown","Date of the Event":"09/14/2013 10:52 UTC","Sighting Duration":"Undisclosed","Latitude":"44.047266","divs":["Sighting DetailsIn Springfield oregon 10:53 september 4th.we were coming back from a campsite when we were pulling into our drive way. my dad said he saw a blue light shooting things out the back of it. My mom didn't belive him so she looked and saw it to then .we started following it we followed it all the way to a parking lot. We sat in are car and watched it it was going really fast So we knew it wasnt a star. It stoped then started agian.it moved up and down very rapedly and then it turned toward us and started moving towards us. It kept disappearing and coming back. My mom got a little chilled and thought it was weird because she was talking about how Weird the sky looked that night it was a gray and black with a white tinted bottem.i knew it wasent a meteor because the way it moved and how it disapered. It also wasent disappearing behind clouds because it was completely clear that night and the last time it disappear ed it dissapeared like it was going through a portal.it was also weird because I got sick right after it Happend. It scared us so much"],"Disposition":"Unresolved","Case Number":"50840","trends":["There have been 14 other sightings in Springfield","There were no other sightings in Springfield on or around September 14th 2013"],"Longitude":"-123.012329","map":"<A HREF = \"http://maps.google.com/maps?q=44.047266,+-123.012329(50840)&iwloc=A&hl=en\"> mufon case (50840) map </A>","Object Flight Path":"Unknown","Weather Factors":"Unknown","Region":"Oregon","Tags":"City","Source":"MUFON","Date Submitted":"09/15/2013 05:02 UTC","Country":"United States","Object Shape":"Cigar","Viewing Distance":"Over One Mile","Summary":"my dad saw it shoot lights from it then we saw it going realy fast so we followed it and it disappeared","City":"Springfield"}