{"Log Number":"US-09162013-0004","Date of the Event":"09/14/2013 08:45 UTC","Sighting Duration":"Undisclosed","Tags":"City","City":"Chicago","Object Shape":"Circle","Region":"Illinois","Object Features":"Unknown","Case Number":"50849","Date Submitted":"09/16/2013 08:51 UTC","Disposition":"Unresolved","Viewing Distance":"Over One Mile","Longitude":"-87.566797","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.773442,+-87.566797(50849)&iwloc=A&hl=en\"> mufon case (50849) map </A>","Country":"United States","files":["/var/www/straped/mufon/html2text/50849.html.txt","/var/www/straped/mufon/org/50849.html"],"Latitude":"41.773442","Object Flight Path":"Straight-line path","Summary":"About a dozen red lights flying over chicago followed by two airplanes that crossed paths","Weather Factors":"Unknown","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around September 14th 2013"],"divs":["Sighting DetailsOn Sept 14, 2013 I was behind the museum of Science and Industry about 8:45 pm. Looking south I saw red lights at a distance between the trees rising as if it were fireworks. Looking up towards the moon I noticed they were traveling from the south to the north going directly above my head. They were at a very high altitude. Going in a straight line at a constant speed i counted about a dozen red lights. This line, not a perfect formation lasted about 2 minutes, Directly after this I noticed two airplanes, coming from the southeast. They were at a low enough altitude for me to see the whole shape of the plane. These two planes crossed paths. This is unusual because I would consider this a near crash. Would you please investigate this situation. I was in my proper fram of mind and this is NOT a hoax. At least check about the near miss with the two planes. One plane was on an intercept course towards the redlights. The lights dissappeared before downtown . there was no trail of light. The red lights were a perfect circle as they were approaching me, while overhead and as the past me. This in itself is unusual. I did not take pictures but I was not the only one who saw this. The sky was clear that night. The objects were very high and about half inch in diameter."]}