{"Region":"Maine","Object Features":"Unknown","City":"Oxford","Summary":"Large, bright light streaked above my head at a high rate of speed, It vanished almost immediately once I saw it. My girlfriend then saw a similar one but smaller.","Tags":"City","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/50844.html.txt","/var/www/straped/mufon/org/50844.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=44.093715,+-70.490055(50844)&iwloc=A&hl=en\"> mufon case (50844) map </A>","Viewing Distance":"101-500 Feet","Object Flight Path":"Straight-line path","Date Submitted":"09/15/2013 09:36 UTC","Weather Factors":"Unknown","trends":["There have been 3 other sightings in Oxford","There were no other sightings in Oxford on or around September 14th 2013"],"Longitude":"-70.490055","Country":"United States","Sighting Duration":"Undisclosed","Object Shape":"Flash, Star-like","divs":["Sighting DetailsI was standing on my front porch, looking at the sky. My neck began to hurt, so I looked down for a moment to give my neck a rest from looking upwards. As I looked up, directly over my head was a glowing object streaking above. Almost just as soon as I spotted it, it disappeared, directly over my head. It was a large object, very bright. From my vantage point, the object was almost the size of a dime in the sky. It was mostly white but had hints of yellow around the side. It was moving very fast. I saw the object for maybe a second. It was moving directly in my direction and as I noticed it, it completely disappeared; directly above my head. It was pretty low, hard to tell but maybe 500 ft or less above. In my backyard there are 12 acres of woods, it came from that direction - east to west. From the Thompson Lake area to Whitney Pond. The fact that the object disappeared directly above me, made me a bit nervous. I had my girlfriend come out to the deck. We continued to view the sky. I was looking east and her west. About 10 minutes after I saw the object, she saw a light, \"much brighter than a star,\" appear from nowhere. The object moved at a very high rate of speed, then disappeared. She viewed the object for approximately one second."],"Case Number":"50844","Date of the Event":"09/14/2013 09:54 UTC","Log Number":"US-09152013-0014","Latitude":"44.093715","Source":"MUFON"}