{"files":["/var/www/straped/mufon/html2text/50854.html.txt","/var/www/straped/mufon/org/50854.html"],"Date Submitted":"09/16/2013 12:47 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.124236,+-115.166296(50854)&iwloc=A&hl=en\"> mufon case (50854) map </A>","Country":"United States","Object Features":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","divs":["Sighting DetailsSo I am used to waking up early for work even on days off and I often go to grab a breakfast item from the near by fast food spot. The first morning as I was pulling into my block I saw two objects..white lights appearing to be a star or satellite or a plane at the time.....so I drove out behind my house into the dark desert as I am located on the very edge of town...parked and got out to watch these objects. One stayed on a steady path moving as a satellite or plane would. \"I am sure it was not a plane as there were no flashing lights and I am accustomed to seeing air planes in las vegas\" and the second object appeared to fade away as if it was rapidly moving up into space. The first object that was identical was still moving on the original path moving southwest to north or northwest toward Creech AFB of possibly A51. After thinking that sighing was not an airplane since it had no flashing lights and since the sun was not up I was doubtful on a satellite theory I decided to venture out to see if I saw anything this morning at the same time... to my surprise there it was again..at the same time. 5:30 am or so... moving over what seems to be the mountain range between Pahrump and Las Vegas. This object was the same in description..only one this time and it stayed on a steady path moving SW to NW I believe. I will continue to watch for this daily as I believe it is either a Military UFO or the Tall Whites out at Indian Springs \"Creech AFB\" doing their nightly running around. Funny I never see any planes along this flight path..only these objects."],"Region":"Nevada","Longitude":"-115.166296","Log Number":"US-09162013-0009","Summary":"second day in a week that I saw what looked to be a star in a clear sky moving.","Latitude":"36.124236","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around September 16th 2013"],"Disposition":"Unresolved","Object Shape":"Fireball, Star-like","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Date of the Event":"09/16/2013 05:35 UTC","Case Number":"50854","City":"Las Vegas","Object Flight Path":"Straight-line path","Tags":"City"}