{"map":"<A HREF = \"http://maps.google.com/maps?q=35.406203,+-94.598831(50853)&iwloc=A&hl=en\"> mufon case (50853) map </A>","Date Submitted":"09/16/2013 11:45 UTC","Longitude":"-94.598831","Region":"Oklahoma","Sighting Duration":"Undisclosed","Latitude":"35.406203","Source":"MUFON","Disposition":"Unresolved","Summary":"3 huge flashes of light (yellow) with a hum like a diesel with each flash. 3 witnesses. Recorded 5 minutes with ipod","Object Shape":"Circle","Tags":"City","City":"Muldrow","Object Flight Path":"Stationary","Case Number":"50853","Object Features":"None","trends":["There have been no other sightings in Muldrow","This sighting has never been favorited."],"Country":"United States","files":["/var/www/straped/mufon/html2text/50853.html.txt","/var/www/straped/mufon/org/50853.html"],"Viewing Distance":"101-500 Feet","Log Number":"US-09162013-0008","Date of the Event":"07/13/2013 11:13 UTC","Weather Factors":"Unknown","divs":["Sighting DetailsMy son and I were outside on a bench. 3 flashes appeared with loud hum like a diesel would sound. After I got my ipod to take photo. A Bright white object was hovering where the flashes appeared. It stayed for 10 minutes. It would appear and then come on extreemely bright and then go totally out for a few minutes and then appear with a flash or sometimes just very bright. My ipod will not pick up in a far distance. So this was very close. Myself and 2 boys have have visitations. Myself since I was young. The Oklahoma State Bureau of UFO investigators came and detected I had missing time(hypnosis on tape) and also detected 4 implants in me. I have yet to have help. Marilyn Carlson and a military man named Ken Storch were the ones here to talk to us. They have called off and on but have not helped with the issue of the implants. I have all the side effects of abduction as well as my brother. I have had 2 miscarriages, one rare pregnancy that was called a molar pregnancy. A dnc was done and the doctor said they sent it off to pathology to be tested and never let me know anything else. I have had major nosebleeds and migrains along with \"so called\" fibromyalgia. I have a place behind my neck that if touched sends a painful electrical shock through my body and it is in my neck on the surface by my spinal cord. My Dr. refuses to do a MRI saying it is only due to fibromyalgia. My son was born with a \"V\" red mark on his forhead and has seen entities since he was 3. He is now 14 and will not sleep alone. We still have visitations. Most while awake. Desperate! Please help"]}