{"Date of the Event":"09/13/2013 09:30 UTC","Latitude":"42.469077","map":"<A HREF = \"http://maps.google.com/maps?q=42.469077,+-83.249245(50863)&iwloc=A&hl=en\"> mufon case (50863) map </A>","divs":["Sighting Detailswe were bring groceries in from the car while the disc's crossed the night sky in a northern direction, I ran in and grabbed my camera, photographed the discs giving of a type sparks from each that does not show on the video however when a plane entered the area I could still the discs but I was unable to capture them again once the plane was in the area. They were very bright and extremely noticeable. They hovered and than went in a northerly direction again. There several and more came from the east and joined them they eventually diapered. The event lasted a good 8 minutes and was seen by 3 of use. I was trying to get them to notice us, at which time they did hover for a period of time. The movement was smooth, rather slow. I was trying to contact them with thought. Sounds unbelievable but true. I was calm and filled with wonder. I was having difficulty holding the camera still as I took the video, I was filmed free hand, no tri pod or brace of any kind the movement of the disc in the video look shaky but the movement of the discs was very smooth."],"City":"Southfield","Country":"United States","trends":["There have been 5 other sightings in Southfield","There were no other sightings in Southfield on or around September 13th 2013"],"Sighting Duration":"00:08:00","Region":"Michigan","Log Number":"US-09162013-0018","Weather Factors":"Unknown","Object Shape":"Circle, Disc","files":["/var/www/straped/mufon/html2text/50863.html.txt","/var/www/straped/mufon/org/50863.html"],"Source":"MUFON","Tags":"City","Disposition":"Unresolved","Date Submitted":"09/16/2013 08:59 UTC","Viewing Distance":"Unknown","Object Features":"Other","Object Flight Path":"Path then hovering","Longitude":"-83.249245","Case Number":"50863","Summary":"disc's traveled north east giving of spark the video does not show. Disc's pulsated, several were in area. When plane came could not pick picture up any longer"}