{"Case Number":"50867","Source":"MUFON","Tags":"City","Longitude":"-97.39027","map":"<A HREF = \"http://maps.google.com/maps?q=27.821137,+-97.39027(50867)&iwloc=A&hl=en\"> mufon case (50867) map </A>","divs":["sighting detailsmy husband and i moved to north beach in corpus christi around four weeks ago. i am retired and am outside 70% or more of a 24 hour day. we live right on the water front, and i must say, this place has some seriously odd things going on\\around. first sighting witnesses in the air around the 4th. or 5th. of this month blew my mind, but this one is disturbing. a very bright green orb came out of the water on to the sand, then flattened itself. (i'm insane, right?) yes, it flattened. this highly odd sight then ventured at speeds i can hardly explain, raced down the shoreline, around the sand, over a public beach restroom, back to it original spot, then disappeared back in the water. did it again after about 3 minutes. never witnessed it again after that, and i stayed on my waterfront patio quite some time after that, looking, as you can imagine. two sightings in two weeks. the aerial was an unknown shape; quite distant, although noticeable purple, red, green, yellow, let's just say \"rainbow\" lights running around the shape of it. my husband actually witnessed that one. i know i am not going mad. i'm beginning to feel this is a highly active area here by the bay. i just wish someone could explain the 'water orb\" to me. i know what i witnessed. i just cannot wrap my head around it. and my feelings on this? wish someone else could have witnessed this. highly anxious to see it again."],"trends":["There have been 26 other sightings in Corpus Christi","There were no other sightings in Corpus Christi on or around September 16th 2013"],"Region":"Texas","Viewing Distance":"21-100 Feet","Object Shape":"Circle, Flash","Object Flight Path":"Straight-line path,Other","Latitude":"27.821137","City":"Corpus Christi","Weather Factors":"Unknown","Disposition":"Unresolved","Country":"United States","Date of the Event":"09/16/2013 09:27 UTC","Summary":"Green blurred orb comming out of bay onto sand/ erratic movement","Sighting Duration":"00:00:25","files":["/var/www/straped/mufon/html2text/50867.html.txt","/var/www/straped/mufon/org/50867.html"],"Date Submitted":"09/16/2013 11:24 UTC","Log Number":"US-09162013-0021","Object Features":"None"}