{"divs":["sighting detailsi was on the beach about 9:30 at night when myself and a friend noticed 2 sets of red lights over the beach approx 300-400 ft away and 50+\\-ft above the water. they appeared to be leaving a marsh area behind the beach. they appeared red with a orange\\white center that sort of glowed in fiery kind of way when they were close, and appeared completely red as they got further away. my initial thought was they looked like mini suns. they were steady in intensity and did not flicker or change color. the video shows them as being white at times but to the naked eye they were always red. aprox 2 minutes later a second set of lights appeared from the same location and followed the same trajectory out over the water. neither sets of lights made any sound, moved slowly and smoothly over the water. i dont know how big they really were but at my distance of 300-400 feet away they initially appeared to be about the size of a softball. there were six other witness to the sighting including a couple on the porch of the beach house behind us and 4 teenagers a little ways down the beach. the video was taken with my samsung galaxy iii"],"Date of the Event":"08/14/2013 09:38 UTC","Source":"MUFON","Log Number":"US-09162013-0016","Case Number":"50861","Tags":"City","files":["/var/www/straped/mufon/html2text/50861.html.txt","/var/www/straped/mufon/org/50861.html"],"Weather Factors":"Unknown","City":"Wareham","Object Shape":"Circle, Fireball, Sphere, Star-like","Region":"Massachusetts","trends":["There have been 5 other sightings in Wareham","There were no other sightings in Wareham on or around August 14th 2013"],"Sighting Duration":"00:04:20","Object Flight Path":"Path with directional change","Date Submitted":"09/16/2013 07:56 UTC","Country":"United States","Viewing Distance":"101-500 Feet","Latitude":"41.738691","map":"<A HREF = \"http://maps.google.com/maps?q=41.738691,+-70.716289(50861)&iwloc=A&hl=en\"> mufon case (50861) map </A>","Summary":"2 seperate pairs of objects flew from the beach over the bay slowly and very low with no sound","Object Features":"None","Disposition":"Unresolved","Longitude":"-70.716289"}