{"Disposition":"Unresolved","Tags":"City","Date Submitted":"09/17/2013 07:00 UTC","Object Flight Path":"Path with directional change","trends":["There have been 19 other sightings in Oxnard","There were no other sightings in Oxnard on or around October 20th 2010"],"Latitude":"34.191487","Sighting Duration":"Undisclosed","Object Shape":"Sphere","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.191487,+-119.23966(50878)&iwloc=A&hl=en\"> mufon case (50878) map </A>","files":["/var/www/straped/mufon/html2text/50878.html.txt","/var/www/straped/mufon/org/50878.html"],"Log Number":"US-09172013-0008","City":"Oxnard","divs":["Sighting DetailsSometime in late October in Oxnard, Ca. (Channel Islands) between 8 and 9 p.m. I went out to take a walk along the harbor that ran parallel to Harbor Blvd. in a northern direction. It was a very quiet night and no one else was around. I believe but not sure that it was a Friday. I glanced towards the west (toward the open ocean) where a line of homes were. At that exact time I noticed a light above a home (but I knew it was further out over water) rising straight up...slowly. As It rose, it was getting brighter and bigger (almost the size of a quarter at arms length at the largest). As it rose, (no sounds could be heard due to distance I believe) I notice the bottom part of the object looked like a welders flame, triangular (wide at the top and pointed at the bottom). Then, it stopped ascending, the ball of light collapsed and became a small starlike point of light and began to fly in a straight line towards the south (L.A.) as if it were a plane. It actually behaved like a typical plane en route into L.A.X. with blinking aviation lights. I kept track of it until I couldn't see it anymore. By the time I realized I should take a picture or video, it was already a small light going south and nothing came out in the picture but darkness. This whole incident lasted no more than 5 minutes between the time I noticed it acsending and losing it flying towards L.A. Interesting sighting to say the least. Thank You, Art"],"Date of the Event":"10/20/2010 12:00 UTC","Viewing Distance":"Over One Mile","Object Features":"Unknown","Region":"California","Summary":"light rising, glowing brighter and bigger behind houses over ocean then flying south toward L.A.","Weather Factors":"Unknown","Case Number":"50878","Longitude":"-119.23966","Source":"MUFON"}