{"Date of the Event":"05/08/2012 07:00 UTC","Summary":"saw a light decending through cloud cover thought was green light from airplane came down and shot 90 degrees like a shooting star","Log Number":"US-09182013-0002","Viewing Distance":"Unknown","City":"San Diego","Date Submitted":"09/18/2013 06:46 UTC","Longitude":"-117.08383","files":["/var/www/straped/mufon/html2text/50886.html.txt","/var/www/straped/mufon/org/50886.html"],"Case Number":"50886","Country":"United States","Disposition":"Unresolved","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around May 8th 2012"],"Sighting Duration":"00:00:02","map":"<A HREF = \"http://maps.google.com/maps?q=32.793335,+-117.08383(50886)&iwloc=A&hl=en\"> mufon case (50886) map </A>","Object Flight Path":"Straight-line path,Path with directional change","Weather Factors":"Unknown","Object Shape":"Oval","Region":"California","Tags":"City","divs":["Sighting Detailsi was driving down montezuma rd in san diego from college ave towards el cajon blvd when i noticed out of the upper portion of my front windshield that there was a green light coming through the low cloud cover so i smiled and glanced up to see the airplane as the only green light i assumed would come through was tht of a plane wing when i caught something which apparently came from space so fast that coming through the clouds so quickly made it seem as if a plane was just decending but then it stopped under the clouds and my eyes widened and then it shot 90 degrees from the outer space to earth direction to east from my position like a shooting star. the object was clearly two colors of green and blue and appeared oval in my memory though moving like thst may have made a circular ufo appear oval. my initial response was \"finally and wow, that just happened, but despite my prefrontal cortex saying \"cool, everything is okay and that was awesome\" my body was freaking out. my organs seemed to be in shock. it was hard to deal with and began effecting my mind because if my brain and body are acting this way even though i prefer to act another then this must be more serious then i imagined. i recalled a study where distilled water was effected by an object or label and decided to go to the park up the street midnight and get palm fruit to mix with distilled water so i could bathe in it and hope the vibration did something for my organs and mind. it seemed to help and ever since ive been watching the sky, trying to meditate and communicate, searching for more answers than ever before. i have always been higher consciousness, since a very young age, but this was the first time i saw something by myself with such a low environmental influence or prank potential to take the credit. i tried finding a site to connect and report the sighting and see if anyone else was talking bout it but never found anything. after seeing serius with dr steven greer, i found this site and reported it asap, with about an hour digging up details to recall the time and date, though ill never forget the situation. Thank you for your time, Alexandros Angelos Tsakopoulos"],"Latitude":"32.793335","Source":"MUFON","Object Features":"None"}