{"City":"Undisclosed","Summary":"Lights movng in the sky without noise","files":["/var/www/straped/mufon/html2text/50896.html.txt","/var/www/straped/mufon/org/50896.html"],"Source":"MUFON","Sighting Duration":"00:05:00","Longitude":"-77.187695","Object Flight Path":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=41.206742,+-77.187695(50896)&iwloc=A&hl=en\"> mufon case (50896) map </A>","Log Number":"US-09182013-0012","Date of the Event":"09/18/2013 08:05 UTC","Object Features":"None","Case Number":"50896","Object Shape":"Unknown","Region":"Pennsylvania","Disposition":"Unresolved","divs":["Sighting DetailsI was sitting in my living room working on my computer when I received a phone call from my girlfriend who was out with our kids taking a walk. She stated that she was one street over from our house and that she was watching a \"weird light in the sky\" and when I asked what it was doing she stated that it was bouncing up and down in the sky and moving in an odd way that she had never seen before and that it wasn't making any noise at all. I could here my son in the back ground talking about the light and how he thought it wasn't right. I proceeded to put my shoes on and I asked her where the lights where and I determined that I could walk a very short distance to the top of a nearby hill and see it. I hung the phone up and ran from my house to the top of the hill where I witnessed 2 lights which appeared to be on a single object moving in the sky, the lights were red and green orbs which were very bright and steady and not pulsating. They moved from right to left very quickly and then quickly decended down behind a row of trees (there was a cell phone tower in the approx. area of the object and the object was higher than the tower in the air, the trees the object went behind were right behind the tower. After the event I drove to the tower and there was no working lights on the tower) I watched the object move behind the trees and then it acended back in to the sky. At that point I ran to my neighbors house which was very close to where I was and asked him to come see the object, but by the time we got back to my original viewing point the object had disappeared. We waited for a time but there was no sign of the object again. After returning home and speaking to my girlfriend she stated that she had the object in sight along with both of my children for approx. 15 minutes and she watched the object move in the air in a way that she has never seen an aircraft move before. She stated that the object was \"bouncing\" in the air and then it moved at an extreme rate of speed from side to side, this all occurred prior to me seeing the object. After I lost sight with the object my girlfriend stated that the object decended back below the trees and appeared to land in an unoccupied wooded area not far from residences. After I arrived home we got in to my truck and drove to the approx. area where I thought the object was and we drove down a state highway approx. 4 miles to the local airport, upon arriving at the airport we didn't see any air craft activity and the field and main hangar was dark. We then drove down along the local river and did not see anything out of normal, we then drove up to the area where she thought she saw it land, after driving around the perimeter of the area there were no signs of any activity and there were no lights in the woods. After I asked my girlfriend stated that after the object disappeared that it never reappeared again and I also never saw it again. During the event there was other air traffic in the area, but they were easy to identify as air planes where as this object defied anything I have ever seen."],"trends":[],"Latitude":"41.206742","Weather Factors":"Unknown","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Date Submitted":"09/18/2013 09:48 UTC"}