{"City":"Gerber-Las Flores","map":"<A HREF = \"http://maps.google.com/maps?q=40.056268,+-122.150269(50898)&iwloc=A&hl=en\"> mufon case (50898) map </A>","Object Shape":"Disc, Saturn-like, Star-like","Tags":"City","divs":["Sighting Details1. My father was driving home from the store while i was in the passenger seat. 2. At first i looked at it and thought it was the north star even though we weren't facing that direction. After around five minutes it got very bright and it slowly moved. 3. I thought it was a really bright star when then my father said \"Why is it so bright?\" 4. After the first one hovered and flew in a curve i lost sight of it because it got dimmer and dimmer. When i looked back at the same direction it started another one appeared in the same spot and was blinked red on one side and three white lights on the other side of it. After around a hour we followed one that changed it's path and sounded like a jet and was going very slow above us, i had a camera with me because i ran back to my house to make sure it was a u.f.o. I snapped one really good photo of it and when i tried to take a picture of the others they failed or looked just like stars, at one point i took a photo of a orange orb looking u.f.o but when i saw it in person it looked like a distant star. 5. The 1st photo was taken later on when i grabbed my camera. the second photo was taken when i tried to focus on one of the moving ships or orbs. The third photo was taken when i tried to take a picture of one of the ships moving fairly fast and was it was probably around 10 miles away. The fourth photo was taken when i tried to take a picture of one of the ships when it hovered in the air and changed from blinking to a white star. The fifth photo was taken when one of the ships that left the path flew over me and sounded like a jet, i was very impressed with this photo because the ship was not that far but i thought it might have been a plane or jet but it went to slow and this photo makes it proof that it wasn't a plane. 6. After around two hours of the same path of that the ships went by in we went home because it was getting late and i had school the next day."],"Weather Factors":"Unknown","Object Flight Path":"Hovering then path,Path with directional change","Date Submitted":"09/19/2013 03:52 UTC","Object Features":"Unknown","trends":["There have been no other sightings in Gerber-Las Flores","This sighting has never been favorited."],"Log Number":"US-09192013-0002","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/50898.html.txt","/var/www/straped/mufon/org/50898.html"],"Latitude":"40.056268","Longitude":"-122.150269","Region":"California","Sighting Duration":"02:00:00","Source":"MUFON","Case Number":"50898","Summary":"Lot's of red and white lights as well as star like stationary u.f.o's","Country":"United States","Date of the Event":"09/17/2013 09:30 UTC","Viewing Distance":"101-500 Feet, Over 1 Mile"}