{"Weather Factors":"Unknown","Date Submitted":"09/18/2013 08:55 UTC","Viewing Distance":"101-500 Feet","trends":["There have been 18 other sightings in Worcester","There were no other sightings in Worcester on or around September 17th 2013"],"Case Number":"50895","Date of the Event":"09/17/2013 06:41 UTC","Longitude":"-71.856764","Region":"Massachusetts","Log Number":"US-09182013-0011","Country":"United States","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.246219,+-71.856764(50895)&iwloc=A&hl=en\"> mufon case (50895) map </A>","Disposition":"Unresolved","Object Shape":"Disc, Fireball","Tags":"City","Object Features":"Unknown","Summary":"My daughter and i stepped out onto the deck, we noticed what look like comets, i didnt think they were jets because they didnt leave a longlasting trail,the trail seemed to move with the object","divs":["Sighting DetailsHi, my daughters and I stepped out on the deck to smoke. It was in the evening around 6:30pm ,I looked up like I always do and I noticed what looked like comets , and I said to my daughter, HEY LOOK, COMETS! We watched two of them acending northward, my daughter said she thought they were jets.. I said no because the trail that the objects left behind seem to move with the object, a jet stream leaves a lasting trail, I told my daughter to get the binoculars to get a better look . She ran up the hill which is our backyard to get a view but as she was doing that i told her DID YOU SEE THAT! It was a round shape thing that appeared as the comet looking objects were acending , I ran to get the camera , when I retured within a minute it was gone, then the comet shaped objects stopped acsending and stopped in midair and it formed into a disk shape at an angle and stayed stationary for at least a minte and half, I tried to take pics of the staionary objects, but the they blended with the setting sun and it was like they've disenigrated and nothing showed up on the camera, but I was able to capture a picture of the comet shaped object. I felt more exicited than scared, but I did feel that I needed to report it. Thank you"],"City":"Worcester","Object Flight Path":"Stationary,Path then hovering","Source":"MUFON","Latitude":"42.246219","files":["/var/www/straped/mufon/html2text/50895.html.txt","/var/www/straped/mufon/org/50895.html"]}