{"Longitude":"-73.796562","files":["/var/www/straped/mufon/html2text/50903.html.txt","/var/www/straped/mufon/org/50903.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.771959,+-73.796562(50903)&iwloc=A&hl=en\"> mufon case (50903) map </A>","Object Features":"None","Case Number":"50903","trends":["There have been 4 other sightings in Flushing","There were no other sightings in Flushing on or around September 19th 2013"],"Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-09192013-0007","Disposition":"Unresolved","Tags":"City","Source":"MUFON","City":"Flushing","Latitude":"40.771959","Object Shape":"Cylinder, Disc, Oval, Sphere","Country":"United States","Date of the Event":"09/19/2013 02:17 UTC","Object Flight Path":"Stationary,Path with directional change","Region":"New York","Summary":"High-Speed UFO Making Impossible Turns","Date Submitted":"09/19/2013 04:51 UTC","Weather Factors":"Unknown","Sighting Duration":"00:20:00","divs":["Sighting DetailsI was walking along 45th Ave and 168th in Flushing with my son when I first saw the object. It just zoomed over above me and headed towards east at speeds faster than a plane or helicopter, then when I least expected it, it veered right. We're talking an impossible aerodynamic maneuver, unless air force pilots can make, which this wasn't the case. This object made no sound and was roundish and white in color. As I walked towards Northern blvd, I kept seeing it (twice) as it zoomed past above, just circling around the area it seemed. Finally upon reaching Northern Blvd. I looked up and it was really high just hovering, kind of wobbling since I could see the sun reflecting off different parts of the surface of the object, only then for it to be completely blinked out and seen flying fast by again, then returning to the exact location in the sky to hover. Someone else must have seen this today. This isn't the first sighting in this exact same area I have seen with the naked eye. There must be a portal where they are coming in and out of, or it must be a preferred location or secret base in the area. All I know is, these objects are here and there's no indication they're going anywhere anytime soon."]}