{"Object Shape":"Boomerang","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was on my way to work, to meet up with my van pool,. I left my house about 4:02am and it's a 4 mile drive to the vanpool stop. So it must have been about 4:05am to 4:008am. I noticed a bright orangeish light above the treetops...about the height you'd expect a helicopter to be...that appeared to be hovering in the distance, directly in front, and above me. I thought at first that it was a helicopter scanning the highway, but it was too far east of the highway for that. As I continued toward it, it appeared to be a slender ovoid shape with three large white blinking likes in front, and several red blinking lights on the right side, and several blue blinking lights on the left side. The colored lights were at the extreme ends on either side of the shape. When I saw the colors of the lights I thought it must be a jetliner, flying very low. Sometimes, when they are seen head on their movement is imperceptible. But it was so low! Then I could see that it was moving very slowly and silently, straight north, and slightly, along the east side of the road that I was driving on. As I got nearer, and almost even with it, I was looking at it from the driver's seat, up through the windshield and to the left. I slowed almost to a stop and continued to stare at it as it passed me. There was a very bright, and very full moon, which silhouetted it against the dark, cloudless sky. As I came even with it, I discerned it to be shaped like a boomerang, or a wing, but with no fuselage, and no tail. There was absolutely no sound. I thought I could see windows between the sets of lights, but they were dark. It appeared to be a dull gray color. I wanted to stop and get out to snap a picture with my cell phone, but I was worried I'd miss my vanpool to work. It continued on slowly northward, maybe 100 or more feet, or so above the treetops. It appeared to be very large. At first sight I thought it must be a 747, because it appeared that large, but on reflection, I think it was even bigger than that. And it appeared flat. I continued down the road, with the object above and behind me, until it was obscured by trees. I kept thinking that I couldn't be seeing what I was seeing, and it must be some sort of military craft or jet. But it was so silent, and slow, I don't see how it could be. I didn't tell anyone about it until I got home, and decided that I would report it, to see if there were any other reported sightings from others on the road at that early hour. My reaction was one of puzzlement...trying to figure out what I saw. It just didn't look like anything I've seen before."],"Disposition":"Unresolved","Source":"MUFON","Weather Factors":"Unknown","City":"Port Orchard","Viewing Distance":"101-500 Feet","Region":"Washington","Case Number":"50908","Object Features":"Window(s)","Date of the Event":"09/19/2013 04:05 UTC","Date Submitted":"09/19/2013 08:59 UTC","trends":["There have been 6 other sightings in Port Orchard","There were no other sightings in Port Orchard on or around September 19th 2013"],"files":["/var/www/straped/mufon/html2text/50908.html.txt","/var/www/straped/mufon/org/50908.html"],"Log Number":"US-09192013-0012","Summary":"Spotted a large boomerang shaped object hovering and moving slowly above the treetops from my car.","map":"<A HREF = \"http://maps.google.com/maps?q=47.517293,+-122.596427(50908)&iwloc=A&hl=en\"> mufon case (50908) map </A>","Latitude":"47.517293","Longitude":"-122.596427","Country":"United States","Tags":"City"}