{"map":"<A HREF = \"http://maps.google.com/maps?q=39.960007,+-75.165291(50901)&iwloc=A&hl=en\"> mufon case (50901) map </A>","Disposition":"Unresolved","Summary":"Myslef and a co-worker observed the object in the sky on our way back from lunch. Object appeared to be very high in altitude, higher than local planes fly. Object moved very fast and resembled what we both said to be jelly fish like.","Source":"MUFON","Object Flight Path":"Straight-line path,Path with directional change","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/50901.html.txt","/var/www/straped/mufon/org/50901.html"],"Sighting Duration":"Undisclosed","Date Submitted":"09/19/2013 02:45 UTC","Latitude":"39.960007","Case Number":"50901","Longitude":"-75.165291","City":"Philadelphia","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around September 17th 2013"],"divs":["Sighting DetailsMyslef and a co-worker observed the object in the sky on our way back from lunch. It clearly stood out as something odd. We are used to seeing planes, helicopters or blimps on a daily basis, but this was clearly neither.Object appeared to be very high in altitude, higher than local planes fly. There were no clouds in the sky, clear sunny day so the object stood out but appeared faint. The Object moved very fast and resembled what we both said to be jelly fish like. It almost looked transparent and appeared to us like it was swimming in the sky, but moved very fast. It almost looked transparent or apparation like. Headed in what I think was a North West direction. We observed it for almost five minutes until we lost sight of it as it moved away, our view became blocked by buildings. We both are skeptical, especially me but it was so out of the ordinary and strange I had to report it. I am NOT a Roswell believer, etc, etc.. I've explored what it could have been, balloons, satellite or drone, but this was clearly much different in it's patterns and motions. Not to mention it looked partially invisible, just faint enough to observe. Should have taken video with my iPhone, but not sure it would of came out to well for the object was very high up."],"Object Features":"Unknown","Weather Factors":"Unknown","Tags":"City","Viewing Distance":"Unknown","Log Number":"US-09192013-0005","Region":"Pennsylvania","Date of the Event":"09/17/2013 12:00 UTC","Country":"United States"}