{"Disposition":"Unresolved","trends":["There have been no other sightings in Leo-Cedarville","This sighting has never been favorited."],"Country":"United States","Source":"MUFON","Case Number":"50900","map":"<A HREF = \"http://maps.google.com/maps?q=41.212549,+-85.016635(50900)&iwloc=A&hl=en\"> mufon case (50900) map </A>","Object Flight Path":"Unknown","Object Features":"None","Latitude":"41.212549","Date Submitted":"09/19/2013 11:55 UTC","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Summary":"the shape was boomerang, it hovered with no sound and very bright. fear devoured me and i almost passed out","divs":["Sighting Details My cousin I would sneak out of my house in the summer time in Leo, Indiana. I was approx. 10 years and my cousin was 14 years. we would stay out all night and make our way home when the sun started to rise to make sure my mom did not catch us. Making our way home from my cousins boyfriends home, we walked south on Amstutz Road. We were approaching the top of a hill on the side of the road when a boomerang shaped object got our attention. I remember the shape and it being very bright lights, and we heard NO sound. It hovered over the tree line. I do not recall any colors except maybe metallic. The fear was so overwhelming I became weak in my knees. I begged for my cousin to take me to the door of the house we were in front of. She refused because she didn't want to get in trouble from my mother. I was terrified of my mom and getting caught but the fear this object gave me was overwhelming and I was willing to take an ass beating from my mother. After she refused to go to the house we ran home. I totally forgot about this event until a recent program recalled this memory. I think the fear I had caused me to push it out of my mind. when I recalled this event I immediately called my cousin and she instantly confirmed what happened. I read a story on your website and what the witness saw was exactly what I thought I saw. They also had the extreme fear. Below is the story I read. 1989 Cory, Indiana Time 10:00 PM Duration: 5 minutes maximum Received from WUOFD 11 December, 2002"],"City":"Leo-Cedarville","Log Number":"US-09192013-0004","Object Shape":"Boomerang","Viewing Distance":"101-500 Feet","Date of the Event":"06/14/1986 05:15 UTC","Region":"Indiana","Tags":"City","files":["/var/www/straped/mufon/html2text/50900.html.txt","/var/www/straped/mufon/org/50900.html"],"Longitude":"-85.016635"}