{"Object Shape":"Flash, Star-like","Object Flight Path":"Stationary,Path then hovering","Region":"North Carolina","Latitude":"35.964852","Longitude":"-80.003178","Disposition":"Unresolved","Weather Factors":"Unknown","Tags":"City","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/50915.html.txt","/var/www/straped/mufon/org/50915.html"],"Case Number":"50915","Summary":"Pulsating light disappeared then reappeared over to the right, pulsated much brighter, then disappeared, then reappeared to the right, moved left until straight ahead, hovered, became very bright, descended and then disappeared again.","Log Number":"US-09202013-0003","Date Submitted":"09/20/2013 12:58 UTC","Source":"MUFON","Country":"United States","Viewing Distance":"501 Feet - 1 Mile, Unknown","Date of the Event":"09/19/2013 08:25 UTC","divs":["Sighting DetailsMy boyfriend and I were on the highway headed southbound on the way home from work. He first saw a flash in the sky which we immediately dismissed as a shooting star. I noticed he kept looking up in the sky and finally he pointed out to me something that looked star-like only it was fading and reappearing over and over, we kept our eye on it and for a moment it didn't reappear in the same spot, we began searching the sky for it once we ruled out that it was not a star, I spotted it over to the right of the highway only this time it was much brighter as it continued to do as it was before, fading and reappearing about the same speed as a lighthouse would. Once again it disappeared during one of the times it faded so we searched the sky and it was back to where we originally spotted it only this time it was not pulsating it was hovering for a few moments until it moved steadily left, until it was directly over the highway in front of us, it became brighter than anything else in the sky, descending briskly a significant distance and vanished. During this time my boyfriend and I tried our best to find a reasonable explanation for what we were seeing it was until we saw it move left and then descend that we were absolutely certain and got rid of our denial that what we were truly seeing was a UFO. At the time this was happening and I knew undoubtedly what I was seeing I got a chill that ran from my head to my toes, my eyes began watering and a storm of shock swam over me, I looked at my boyfriend who was also in shock and told him we have seen a ufo and who on earth is going to believe us. We arrived home and sat outside for about an hour staring into the sky hoping to see it again but had no luck."],"City":"High Point","trends":["There have been 5 other sightings in High Point","There were no other sightings in High Point on or around September 19th 2013"],"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.964852,+-80.003178(50915)&iwloc=A&hl=en\"> mufon case (50915) map </A>"}