{"Log Number":"US-09202013-0002","files":["/var/www/straped/mufon/html2text/50914.html.txt","/var/www/straped/mufon/org/50914.html"],"divs":["Sighting DetailsI was walking on the beach. I saw a bright light in the sky that I thought was a small plane next thing, i thought it crashed into the ocean near the surf. As I got closer I realized it was not a plane and did not crash. I was relieved it was not a crashed plane but i was anxious. I saw a bright light just over the water. Next I saw a round, metallic object ascend from beneath the ocean and hover over it. The water swirled around it when it rose out above the water. There was a bright light beam underneath what looked like a craft. i had my iphone and took pictures. I don't even recall the craft leaving. I remember it was completely silent I didn't look at the pictures until months later I don't know why I waited so long. I don't really remember taking pictures which is why I haven't reported this until now. I figure an expert can explain the pictures because I cannot. This has bothered me since. I've had several nightmares of a UFO hovering over me and sending a beam of light after me. I wake up frightened. I feel scared writing this now."],"Object Shape":"Fireball, Other","Region":"Massachusetts","City":"Barnstable","Case Number":"50914","trends":["There have been 9 other sightings in Barnstable","There was one other sighting in Barnstable on or around October 15th 2010"],"Weather Factors":"Unknown","Object Features":"Unknown","Date of the Event":"10/15/2010 10:15 UTC","Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=41.641471,+-70.280801(50914)&iwloc=A&hl=en\"> mufon case (50914) map </A>","Country":"United States","Longitude":"-70.280801","Disposition":"Unresolved","Object Flight Path":"Path then hovering","Source":"MUFON","Summary":"I thought I saw a small plane crashing into ocean just off the beach","Tags":"City","Date Submitted":"09/20/2013 12:40 UTC","Sighting Duration":"Undisclosed","Latitude":"41.641471"}