{"City":"Wilmington","Sighting Duration":"01:30:00","Log Number":"US-09202013-0007","Object Shape":"Cylinder, Sphere, Star-like","files":["/var/www/straped/mufon/html2text/50919.html.txt","/var/www/straped/mufon/org/50919.html"],"Tags":"City","Object Features":"None","Case Number":"50919","Summary":"Two starlike lights in sky equidistant from 3 in-line vertical stars and flashing blue green and red lights ffrom a white center","Latitude":"34.090352","Date Submitted":"09/20/2013 03:49 UTC","Source":"MUFON","divs":["Sighting DetailsAs I often do, I went out to observe the night sky. Tonight was the Harvest Moon. I faced the southeast and saw a bright star like object that appeared to be flashing different colored lights. I went in and got my binoculars and observed the object. It appeared to have a bright white center, with bright red, blue and greenish-blue lights flashing around the white center. The flashing appeared mostly random but sometimes sequential. This object was perpendicular to a 3-star formation at the same altitude (from my perspective). I continued to look and then came in house and told my wife about the object but she did not want to get up from her sleep. I went back out with my binoculars and this time I spotted a second star-like object, equidistant from the 3-star group as the first unusual light I saw. This light also had lights flashing around a white center; also red, blue and a greenish color. If anything, these lights were even brighter. I roused my wife who grudgingly came out to observe what I told her I saw. She described what she saw and it matched my description of what I saw. After observing the lights a few minutes more, I came in the house and looked up the MUFON-NC website and joined. Then I saw the clips from CNN at your website about UFO's and in particular the sightings in Missouri of orbs that pulsated light which the local MUFON person at first thought was the star Vega, but later regarded as UFO's when more than one appeared. The description of the lights and their colors were the same as what I observed. At this point I decided to report what I had seen earlier. A little while ago I went out (after 3 A.M.) and observed that the object were still there in the sky and still equidistant from the 3-star formation, but they did not appear to be flashing lights like before. I don't know if what I saw was merely atmospheric refraction and perhaps refraction through my binocular lenses or not. I will say that the night sky was cloudless and there was no moisture in the air--the air was dry for a change. I felt puzzled when I looked at the objects. They didn't move at all so I know they weren't airplanes or helicopters. They were too high to be cell tower beacons, and were over water in any case. Maybe they were just stars but I have never seen stars that flashed multi-colored lights. I would really like to know if others observed what I saw, and whether what I saw were merely stars blinking or something else altogether. I won't be terribly surprised either way but would really like some kind of feedback if possible."],"trends":["There have been 96 other sightings in Wilmington","There were no other sightings in Wilmington on or around September 20th 2013"],"Object Flight Path":"Stationary","Viewing Distance":"Over One Mile","Region":"North Carolina","Country":"United States","Longitude":"-77.916424","map":"<A HREF = \"http://maps.google.com/maps?q=34.090352,+-77.916424(50919)&iwloc=A&hl=en\"> mufon case (50919) map </A>","Disposition":"Unresolved","Weather Factors":"Unknown","Date of the Event":"09/20/2013 01:30 UTC"}