{"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.932049,+-70.566143(50920)&iwloc=A&hl=en\"> mufon case (50920) map </A>","files":["/var/www/straped/mufon/html2text/50920.html.txt","/var/www/straped/mufon/org/50920.html"],"Weather Factors":"Unknown","Date of the Event":"07/27/2013 03:15 UTC","Object Flight Path":"Straight-line path,Other","Object Features":"Unknown","Source":"MUFON","Region":"Massachusetts","divs":["Sighting DetailsMy cousin and I were on the beach late at night talking endlessly, catching up because we don't get to see each other very often. The night was beautiful and clear with a line of clouds hanging low over the ocean past Cape Cod and we saw many shooting stars and planes as the night wore on. Around 3:15am, we noticed a solid orange light moving across the sky from the west. We were facing the water so it passed over us from west to east. It seemed to be moving slightly slower than a plane and was in our view for roughly five minutes until we lost sight of it in the clouds on the horizon. My cousin was afraid. She thought it was an asteroid because it seemed like its flight path was descending slightly as if it were going to land out on Provincetown or further out in the Atlantic. I never thought it was a meteor or asteroid because it wasn't moving that fast and it didn't have any kind of a tail and it was orange but did not look to be on fire. As it passed above us, I saw four or five random flashes of light in the proximity of the object. My first thought was camera flashes. It was as if someone was up in the sky taking flash photos down towards the earth but the flashes never came from the same spot. They were about an inch of sky view away from the orb and in different directions. They were randomly timed also. The first flash happened then maybe five seconds later another one happened in a different spot and then maybe two seconds later another one happened in another spot, etc. The flashes are the hardest part for me to come up with an explanation for."],"Case Number":"50920","Tags":"City","City":"Plymouth","Date Submitted":"09/20/2013 04:14 UTC","Log Number":"US-09202013-0008","trends":["There have been 15 other sightings in Plymouth","There were no other sightings in Plymouth on or around July 27th 2013"],"Disposition":"Unresolved","Sighting Duration":"Undisclosed","Object Shape":"Flash, Unknown","Summary":"Orange orb with linear path and separate random flashing white lights in its vicinity","Country":"United States","Longitude":"-70.566143","Latitude":"41.932049"}