{"Disposition":"Unresolved","Source":"MUFON","Date of the Event":"09/20/2013 02:00 UTC","Case Number":"50921","Date Submitted":"09/20/2013 07:34 UTC","trends":["There have been 5 other sightings in Corvallis","There were no other sightings in Corvallis on or around September 20th 2013"],"Object Features":"None","divs":["Sighting DetailsAt approximately 1:45 myself and my cousin were having a final cigarette before bed. he was facing east toward his front door i followed a minute or so behind him when i noticed the steady white to red pulsing light. since the light lookedlike an aircraft signal like the one amile or so from my position, i nearly missed the initial shock of what i was about to see. my cousin was facing away from the light as i was facing towards the light, and my cousin. Gesturing to to him for a lighter panamime i noticed that the light had a steady two tempo pulse; white.red.white.redx2 BRIGHT.. WHITE..BRIGHT WHITE.. like morse code. No Sound, very close, there should have heard some kind of sound, especially considering the fact that a helicoptern past by louder and was vastly further that the light was. this whole time it seemed to be shaking almost vibrating, i also thought that i had observed it moving toward us, at which point it engorged itself directly at us with a steady to painfully brilliant light. then a second time it close succession. all the while it changes course and begins to circle us roughly 3- miles away in a semi circle path headed south southwest.and decending and pulling away in hasty fasion like it spotted that we spotted it and the intense flair of light was like a hard cold aknowledgment that we had been made. 3 times it flared during decent and all three times its brightness made me squint. finally running out of view i made the first email to Aleta, an investigator i had shared with before. this all takes place within about 5 minutes and followed soon after by a thick low rolling fog system. i couldnt get to my phone fast enough, and 3 videos were the result over a 2 hour time frame I the end i am still unable to digest what we saw, and finally before i was done investegating i see it. i cant even begin to put a description into text. A stopsign height, humanoid torso shaped Grey mass gliding from the street to the field roughly 100 yds from me. but no legs or decernable features other than a blobby mass resemling a dome on shoulders and arms in a slow motion jogging pattern gliding over curb,bush. did not getfootage"],"Region":"Oregon","files":["/var/www/straped/mufon/html2text/50921.html.txt","/var/www/straped/mufon/org/50921.html"],"Longitude":"-123.256684","Summary":"outside smoking, observed pulsing brilliant white to red fiery orb","Tags":"City","Latitude":"44.574366","Country":"United States","City":"Corvallis","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Log Number":"US-09202013-0008","Object Shape":"Circle, Fireball, Flash, Sphere, Star-like, Other","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.574366,+-123.256684(50921)&iwloc=A&hl=en\"> mufon case (50921) map </A>"}