{"Case Number":"50939","Object Flight Path":"Straight-line path","Viewing Distance":"Over One Mile","City":"Soddy-Daisy","trends":["There has been one other sighting in Soddy-Daisy","There were no other sightings in Soddy-Daisy on or around September 20th 2013"],"Object Shape":"Triangle","Summary":"A set of brilliant lights rose in the eastern sky progressed toward west had one trailing orb. Appeared enormous in size.","divs":["Sighting DetailsAfter finishing a soccer game I was standing in a well lit parking lot with other witnesses when I observed three bright redish orange light rise above the eastern horizon. These horizon is a ridge of mountains. The lights once able the hoizon formed a distinct triangle pattern. The pattern did not shift and continued on an path toward the west approzimately 30 - 45 degrees max above the horizon. A fourth light of the same color and brilliance followed behind the triangle. What appeared to be aircraft appeared to be flying well above and behind the objects. The object made no sound. After approximately three to four minuted each of the triangle lights and the trailing light began to extinguish seperately until there was nothing detectable. Both myself and another observer asked if the other new what this might be. We both responded no. The area taken up by the objects and their coordinated movement seemed to give us the feeling it was quite large. For me the size and perceived distance from me were shocking. When I first saw the object my fiirst thought was that I had aligned my observation position in lign with cell tower aircraft lights located on the ridge. As the lights continued to rise above the horizon I relaized that I had no historical reference for what I was seeing."],"Log Number":"US-09202013-0025","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/50939.html.txt","/var/www/straped/mufon/org/50939.html"],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.209055,+-85.185421(50939)&iwloc=A&hl=en\"> mufon case (50939) map </A>","Region":"Tennessee","Date of the Event":"09/20/2013 08:25 UTC","Longitude":"-85.185421","Country":"United States","Tags":"City","Date Submitted":"09/20/2013 09:54 UTC","Source":"MUFON","Latitude":"35.209055","Disposition":"Unresolved"}