{"Date Submitted":"09/20/2013 04:32 UTC","Weather Factors":"Unknown","Summary":"A star-like point of light doubled in brightness three times, about four second interval, then disappeared.","Disposition":"Unresolved","Latitude":"51.178363","Tags":"City","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","trends":["There has been one other sighting in Banff","There were no other sightings in Banff on or around September 11th 2013"],"Date of the Event":"09/11/2013 12:00 UTC","files":["/var/www/straped/mufon/html2text/50930.html.txt","/var/www/straped/mufon/org/50930.html"],"Log Number":"CA-09202013-0016","City":"Banff","Region":"Alberta","Source":"MUFON","divs":["Sighting DetailsWe were on the shore of Two Jack Lake in Banff National Park on a perfectly clear night, looking at the stars. One 'star' then suddenly doubled in brightness. My husband saw it right away, and I saw it peripherally. But I immediately looked at the spot. We thought it might be the lights on a jet airliner, but almost immediately discounted that idea as we watched what it did next. It dimmed immediately, then about four seconds later, it brighted again, then dimmed, then repeated one last time. Then it vanished, not even the star-like point of light remaining. It was about 50 degrees off the horizon, far above the mountains in we think the north east. It was definitely not a radio tower, as it was too far up in the sky. A jet airliner flew by a few minutes later, and we could compare the blinking of its lights to what we just saw, and it was definetly not a plane. As the light was stationary in the middle of the sky, and there was no further blinking at any other point, we were certain it wasn't a helicopter. We are just curious if there is some explanation."],"Case Number":"50930","Object Features":"None","Longitude":"-115.570769","Country":"Canada","map":"<A HREF = \"http://maps.google.com/maps?q=51.178363,+-115.570769(50930)&iwloc=A&hl=en\"> mufon case (50930) map </A>","Object Flight Path":"Stationary"}