{"Longitude":"-78.647065","Source":"MUFON","Disposition":"Unresolved","Tags":"City","Log Number":"US-09202013-0029","files":["/var/www/straped/mufon/html2text/50943.html.txt","/var/www/straped/mufon/org/50943.html"],"Weather Factors":"Unknown","Viewing Distance":"21-100 Feet, Unknown","Date of the Event":"09/21/2012 12:00 UTC","Date Submitted":"09/20/2013 11:11 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.793736,+-78.647065(50943)&iwloc=A&hl=en\"> mufon case (50943) map </A>","Country":"United States","Summary":"It was a quick glance and it was gone.","Object Flight Path":"Other","Sighting Duration":"Undisclosed","Object Shape":"Sphere","trends":["There have been 31 other sightings in Raleigh","There were no other sightings in Raleigh on or around September 21st 2012"],"divs":["Sighting DetailsIt happened about a year ago. I'm not sure of the exact date but I do remember the sky was completely overcast and the clouds were hanging extremely low that evening. The time had to be in between 12am and 3am. I was outside smoking a cig and looking up into the sky which I do often. I was close to finishing the cig and I turned to my right heading back to the house while glancing up and there up in the clouds I saw a sphere glowing in the clouds. It was as if it was spying on me and once I caught it in my vision it was a split second of a pause and then it was gone just like that. The overcast clouds were not disturb whatsoever when it disappeared so what ever it was there was no propulsion. It looked as if it was radiating energy because when I saw it you could see the solid core and the glow that was coming off of it which the clouds magnified the glow that was coming off it. The best way to describe the color would be Orange but I would also add that it looked like the color from the movie pulp fiction when they opened the briefcase. The size of it looked to be the size of basketball but it was definitely bigger than a basketball. It happened so fast that I was siting there asking myself did that just really happen did I really just see that but I know what I saw even if it was just a split second. I now find myself looking up in the sky hoping to see it again but no such luck."],"Object Features":"Unknown","City":"Raleigh","Region":"North Carolina","Case Number":"50943","Latitude":"35.793736"}