{"Weather Factors":"Unknown","Object Shape":"Oval","Sighting Duration":"Undisclosed","Longitude":"-74.000373","map":"<A HREF = \"http://maps.google.com/maps?q=40.718223,+-74.000373(50945)&iwloc=A&hl=en\"> mufon case (50945) map </A>","Disposition":"Unresolved","City":"New York","Case Number":"50945","Date Submitted":"09/20/2013 11:34 UTC","Object Features":"None","Date of the Event":"09/20/2013 10:41 UTC","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around September 20th 2013"],"Object Flight Path":"Hovering then path,Path with directional change","Region":"New York","Source":"MUFON","divs":["Sighting Details1. 2.& 4.) While waiting for a bus, I looked up into the clear blue sky with very minimal clouds and I noticed a small, oval cloud-like object at first still, then started heading south, but moving slowly. It made a 90 degree turn to its left and then continued southward again, then made a 90 degree turn to its right, and continued on its original southward path. It did not drift, simply made a short adjustment at a clear 90 degree angle, twice. There were no contrails with this cloud-like object, and there were no planes around (heard or seen). This object made no noise. 3.) At first, I thought it was an oval-shaped cloud. The oval object had feathering edges that seemed like a natural cloud, yet as it moved, it appeared to look more clearly oval, yet remained in the white color of a cloud but more clearly defined without feathered edges. 5. & 6.) This is the first time I have experienced a possible UFO. I was very excited. Sorry I did not have a camera. During this brief approximate half-minute, my bus pulled up, blocking my view. Sadly, I got on the bus. It was approximately 10:41am Eastern Time on September 20, 2013 in New York City, in the borough of Staten Island."],"Country":"United States","Viewing Distance":"Over One Mile","Summary":"Cloud-like UFO observed approximately 2 miles east and 5+ miles altitude.","files":["/var/www/straped/mufon/html2text/50945.html.txt","/var/www/straped/mufon/org/50945.html"],"Latitude":"40.718223","Tags":"City","Log Number":"US-09202013-0031"}