{"Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/50954.html.txt","/var/www/straped/mufon/org/50954.html"],"trends":["There have been 11 other sightings in Florence","There were no other sightings in Florence on or around September 20th 2013"],"Log Number":"US-09212013-0007","Source":"MUFON","Tags":"City","Date Submitted":"09/21/2013 11:41 UTC","divs":["Sighting DetailsMy wife and I had returned home from dinner out, when we were ready to close the garage door and lock up the house. She noticed two lights in the sky and called for me to come and see them. We observed two 'orb' type lights circling above us, at approximately 2-3000 ft altitude, describing a circular path, estimated to be 500 - 1,000 ft diameter. The lights were a teal green in color, or a blue - green hue. The lights themselves were not defined by any shape or hard surface, simply 'lights'. The sky was clear, with low hanging cumulus clouds, drifting at around 5 knots from south to north. The stars were visible, and there was no weather threatening, or nearby storms. The circling lights looked like undefined shapes, not delineated. I first thought they could have been projected, like maybe some kids playing with laser pointers. After observing these light continuously for over an hour, I became convinced they were not projected. They were highly visible, and could be seen behind the clouds, between the clouds, and against the clouds. The circular flight pattern did not vary, but the two lights would sometimes be very close together, and then separate until they were opposite each other, still moving in a circular pattern. Round and round, not varying, just round and round. It was fascinating to watch, and we both observed the lights for over an hour. As the clouds moved across the sky, the lights were still there. As the clouds disapated, the lights were still visible, but not as much as when the clouds were present. I know about clouds, winds, elevation and altitude from being a navigator in my early days in the Navy. I was taught to observe weather, etc as part of my duties. I am certain there were others who saw these lights, and hope my observation will be confirmed. I will be glad to discuss this with anyone from Mufon, and you are welcome to contact me. This was an interesting observation, and I will be looking again tonight to see if it is repeated. I have other sightings, including a USO sighting that I have never reported. I have never seen a similar sight like the circling orbs I report here. Thanks to Mufon for being here, giving me an opportunity to relate this sighting to someone. Best regards, Steve Mason"],"Object Flight Path":"Other","Summary":"Witnessed two blue green lights circling in sky continuously. Sometimes, the lights would almost join, then spread apart circling in a tight pattern. At times, the lights would be opposite each other in the circular pattern, then they would be closer .","Sighting Duration":"Undisclosed","Latitude":"34.189173","Region":"South Carolina","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.189173,+-79.760762(50954)&iwloc=A&hl=en\"> mufon case (50954) map </A>","Disposition":"Unresolved","City":"Florence","Longitude":"-79.760762","Case Number":"50954","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Date of the Event":"09/20/2013 10:15 UTC","Object Features":"None"}