{"files":["/var/www/straped/mufon/html2text/50958.html.txt","/var/www/straped/mufon/org/50958.html"],"Log Number":"US-09212013-0010","Weather Factors":"Unknown","Latitude":"40.419387","Sighting Duration":"Undisclosed","City":"Undisclosed","Date Submitted":"09/21/2013 02:48 UTC","Object Features":"Unknown","trends":[],"Country":"United States","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Date of the Event":"05/28/2013 12:00 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.419387,+-82.898153(50958)&iwloc=A&hl=en\"> mufon case (50958) map </A>","Longitude":"-82.898153","Region":"Ohio","divs":["Sighting DetailsIt started in May 2013 i was looking at Orion when what appeared to be a star flew a straight path or my home. I was in the back and ran threw the house to follow it, but when i got to the front it was gone. A few days later why i was watching the star same event occur. I repeated the same events as above with the same results. So i started to actively looking for these lights. I seen so many that i lost count. i thought that maybe they were man made like ISS. I found out that yu can only view things like the ISS up to 45 minutes after sunset. So see them so close to 10 pm ruled them out. They were flying straight and mostly from the south to north. Then in early august one was like watching a drunk driver weaving back and forth. I was at a lost to explain that. Then a few minutes later two were flying right at each other one from the north and the other from the south. The look like they were going to hit. Then the one from the north stopped and the one from the south did a 90 degree turn to the east then another 90 to put it heading back north. If its a clear night you can see happening. I willing to show anyone who like to come out and see between 8:40 to 10:00 pm. I tried filming then put my video cam has only pick it up once and it like a second. If you have a stronger cam then please come film."],"Summary":"When ever its clear multi light looking like stars fly over my home nightly.","Case Number":"50958","Disposition":"Unresolved","Viewing Distance":"Over One Mile","Object Shape":"Star-like","Tags":"City"}