{"City":"Bangor","Viewing Distance":"Unknown","Weather Factors":"Unknown","Source":"MUFON","Object Shape":"Circle, Oval","Case Number":"50955","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/50955.html.txt","/var/www/straped/mufon/org/50955.html"],"Sighting Duration":"Undisclosed","Log Number":"US-09212013-0008","Summary":"Three glowing orbs witnessed while camping on top of mountain near Poconos.","Latitude":"40.869722","Country":"United States","Longitude":"-75.205298","Object Features":"Unknown","Tags":"City","Date Submitted":"09/21/2013 12:16 UTC","Date of the Event":"09/20/2013 09:30 UTC","divs":["Sighting DetailsMy husband and I were camping out last night in a clearing at the top of the mountain on our property. Clear skies. Bright moon. Many planes in usual flight paths. Suddenly, looking N we both noticed a brightly lit white object that just floated across the sky over us. Lower than planes. As we're watching it, all of the sudden the light went out. Not five minutes later the same scene repeated itself. Exactly. Definitely too low to be satellites. No blinking lights, no sound, no emmisions. Did notice that it got windy then, when it had been very still. Maybe 15 minutes later we were looking toward the SE and saw a new one moving E to W. Same as the other two, although this one was amber in color. This one stayed lit and disappeared behind the tree line. After it left I turned my attention back to the N and just like that a shooting star flew overhead! This all took place with about 20 minutes. We were not surprised as we have seen these for about the last 3 years on this mountain. Not afraid either. We went to sleep in the tent about an hour later. Nothing out of the ordinary occurred while we were asleep. Oh, and the first 2 orbs were traveling S to N."],"Region":"Pennsylvania","map":"<A HREF = \"http://maps.google.com/maps?q=40.869722,+-75.205298(50955)&iwloc=A&hl=en\"> mufon case (50955) map </A>","trends":["There have been 13 other sightings in Bangor","There was one other sighting in Bangor on or around September 20th 2013"],"Disposition":"Unresolved"}