{"Tags":"City","Weather Factors":"Unknown","Case Number":"50952","Object Shape":"Star-like","Source":"MUFON","files":["/var/www/straped/mufon/html2text/50952.html.txt","/var/www/straped/mufon/org/50952.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.854976,+-75.968385(50952)&iwloc=A&hl=en\"> mufon case (50952) map </A>","Longitude":"-75.968385","Country":"United States","Log Number":"US-09212013-0006","Latitude":"36.854976","Viewing Distance":"Unknown","Disposition":"Unresolved","City":"Virginia Beach","Region":"Virginia","Object Features":"Unknown","Sighting Duration":"00:05:00","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","trends":["There have been 47 other sightings in Virginia Beach","There was one other sighting in Virginia Beach on or around September 20th 2013"],"Date of the Event":"09/20/2013 08:30 UTC","divs":["sighting detailsmy girlfriend and i had just left her house in her vehicle, and going down a suburban rode i noticed some lights in the sky. at first i wrote them off as jets or something but the number and arrangement of them confused me so i tried to continue observing (as i was driving.) they moved irregularly, unlike any aircraft that i have knowledge of. at first, they were arranged like this - * * * * * and they would move some, to the left and\\or right a bit (each one moved independently of the others) and would stop and hover before moving any more. i passed some trees and then when i saw them again they were all arranged in a perfectly vertical line, hardly moving at all. they had a dull orange glow (like a jet engine) but the intensity of the light never changed, indicating to me that they were neither moving closer nor further from my location. at this point i stopped the car so that my girlfriend could try and get a picture (i was pretty sure this was something noteworthy at this point) but her iphone could not get any kind of picture (probably due to the street lights and their light pollution.) we continued observing for a minute even though we were running late for a gig we were already supposed to be at, but the lights disappeared, one after the other. they didn't leave in sequential order, either - the highest one, then the third highest one, then the fourth, then the second, then the lowest one. when each departed, it quickly went from completely static to just a faint light, seemingly traveling very quickly from a dead stop. i have never before seen anything like this, and at first i tried to rationalize it (virginia beach\\norfolk area is a military area, so aircraft are a common sight) but it legitimately looked like so many other ufo sighting videos i have seen. the erratic movement, the vertical formation, the ability to stop and go again effortlessly - i'm not saying it was an \"alien spacecraft\" but it certainly was an unidentified flying object. the biggest emotion i felt after seeing them was regret at my inability to document them visually. i haven't heard of anyone else that witnessed them last night and i have been looking all morning for confirmation. i have also been looking for any knowledge of aircraft that can seemingly stop and start on a dime but i have found nothing. i'm very interested to find out if anyone saw these as well and if anyone has any insight as to what they were!"],"Date Submitted":"09/21/2013 10:38 UTC","Summary":"Strange lights arranged themselves in a vertical column. Abrupt stopping and irregular movement patterns."}