{"Viewing Distance":"Unknown","divs":["Sighting DetailsI was flying west on an Airbus 320, probably over New Mexico. We were probably at least 25,000 feet up. I had a window seat on the starboard side and was enjoying watching electrical storms dance across the northern sky. The Big Dipper was hanging low in the northern sky and was visible most of the time with the lightning activity below. Intermittent patches of clouds sometimes obscured my view of the stars, but most of the time I had a spectacular view of the sky above a long line of storms to the north which stretched approximately from the mid-western states to western New Mexico. It was after a short period of cloud obstruction when the strange lights appeared. If you were to mark a spot midway between a line joining the two stars at the end of the handle of the Big Dipper and draw a line perpendicular to and up from that line, the lights appeared on that line at a point about a third longer than the line joining the two stars. They were slightly brighter than those two stars and appeared white. At arm's length they were about a pinky finger's width apart. I'm familiar with that area of the sky and knew immediately that they couldn't have been stars, planets, or any other celestial body. My first thought was that they were satellites, so I watched them for any movement. They remained perfectly motionless like stars for about a full minute. Then briefly for several seconds, my eyes were drawn to a few flashes of lighting below. Then when I looked back up, the two lights had disappeared. I continued watching that area of the sky for at least 15 minutes afterwards but they never reappeared."],"Country":"United States","Summary":"Two motionless star-like objects appear for at least a minute then disappear","Case Number":"50960","Log Number":"US-09212013-0012","map":"<A HREF = \"http://maps.google.com/maps?q=34.529,+-105.86846(50960)&iwloc=A&hl=en\"> mufon case (50960) map </A>","City":"unknown","Source":"MUFON","Date of the Event":"09/19/2013 01:00 UTC","Weather Factors":"Unknown","Sighting Duration":"00:01:00","Object Shape":"Star-like","Longitude":"-105.86846","Object Features":"Unknown","Date Submitted":"09/21/2013 04:39 UTC","Disposition":"Unresolved","Object Flight Path":"Stationary","Tags":"City","Latitude":"34.529","trends":["There have been no other sightings in unknown","This sighting has never been favorited."],"Region":"New Mexico","files":["/var/www/straped/mufon/html2text/50960.html.txt","/var/www/straped/mufon/org/50960.html"]}