{"files":["/var/www/straped/mufon/html2text/50961.html.txt","/var/www/straped/mufon/org/50961.html"],"Latitude":"41.9615","Country":"United States","Viewing Distance":"Over One Mile","Object Flight Path":"Hovering then path","Summary":"saw a very large reflective disk above the clouds hovering then took off at a speed i have never seen in the sky before.","Log Number":"US-09212013-0013","Region":"Connecticut","Case Number":"50961","Date Submitted":"09/21/2013 05:21 UTC","City":"Enfield","Date of the Event":"09/21/2013 03:00 UTC","Longitude":"-72.524021","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Shape":"Disc","divs":["Sighting Detailsi was driving at the time when i noticed what looked like a 2 dimensional oval very large. i could tell that this object was very large, because it was above the clouds (cloudy windy day). very reflective and bright right above the tree line the reflection of the object showed through the gray cloudy sky. At first i thought it may have been a blimp or something of that nature. It was moving at a constant speed at first, then took off at speeds that i have never seen before in the sky. I chased it with my car as the i lost sight of it behind the tree line. I spent 30 minutes looking for the object in the sky around the area but no luck. The vast size and speed of this UFO is what truly astonished me. I can understand now how people could miss such a vast UFO, It came in and out of my sight within 30-50 seconds, too short for me to even capture a picture of it from my phone. one of the most unexplained things i have never seen in my life. No trail, no sounds, moving at speeds that i have never witnessed. Me: college graduate 23 years old not under any influence"],"Object Features":"None","Tags":"City","Source":"MUFON","Disposition":"Unresolved","trends":["There have been 3 other sightings in Enfield","There were no other sightings in Enfield on or around September 21st 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.9615,+-72.524021(50961)&iwloc=A&hl=en\"> mufon case (50961) map </A>"}