{"Longitude":"-75.52167","Source":"MUFON","Tags":"City","Date Submitted":"09/21/2013 10:13 UTC","Country":"United States","Log Number":"US-09212013-0018","Object Shape":"Egg, Fireball, Sphere, Star-like","Weather Factors":"Unknown","Date of the Event":"09/21/2013 12:00 UTC","Disposition":"Unresolved","Latitude":"38.915362","Viewing Distance":"Unknown","trends":[],"Summary":"15 Orange orbs spinning in circles in cloud formation with extreme altitude changes up and down.","files":["/var/www/straped/mufon/html2text/50967.html.txt","/var/www/straped/mufon/org/50967.html"],"City":"Undisclosed","Object Flight Path":"Path with directional change,Other","divs":["Sighting DetailsI was outside working on my car then went for a short test drive down my court. Upon turning around and facing north I saw 15 glowing red orange orbs in the clear night sky. All of the orbs were spinning in spherical orbits independently of one another. The entire formation was moving N to NE with all orbs changing position within the cloud in no observed pattern. After a period of 5 min est., slowly the lights vanished in a blink or accelerated away and vanished like shutting off a light switch. I thought it could be bags with candles for lifts or ballons but the objects spun in spherical orbits at constant speed with many altitude changes up and down. From my perspective the altitude changes were 100's of feet in the sky. Also the objects were seen flying double the height of aircraft nearby in the same line of sight. The lights also disappeared individually at different times at different heights meaning that if it was a flame the lack of O2 at height would burn out the highest theoretical ballons or candles. However there was o pattern to the light going out and several made accelerated course corrections before going out."],"Case Number":"50967","Region":"Delaware","Sighting Duration":"Undisclosed","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=38.915362,+-75.52167(50967)&iwloc=A&hl=en\"> mufon case (50967) map </A>"}