{"Region":"Manitoba","Longitude":"-97.219651","Object Shape":"Circle","files":["/var/www/straped/mufon/html2text/50964.html.txt","/var/www/straped/mufon/org/50964.html"],"Log Number":"CA-09212013-0016","Date Submitted":"09/21/2013 08:33 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=50.087562,+-97.219651(50964)&iwloc=A&hl=en\"> mufon case (50964) map </A>","divs":["Sighting DetailsI was driving south from Teulon,MB to Winnipeg, MB on highway 7. I glanced up in the sky and had seen a triangle shape of 3 un connected lights flying west. It was sunny and clear conditions. The airport is close to there and south from where I was driving. Normally lots of air traffic in that area. Considering the conditions I would of been able to see something connecting the lights if it was an airplane or something else. It was 3 separate objects and an airplane was in view heading to the southern direction. The objects were much higher than the airplane. The objects then turned to the south aswell and appeared to be in a perfectly straight line. I could see the lights go further away and all of a sudden they just vanished. The airplane that was flying south towards the airport I could still see plainly. When I first saw the object I figured it was an airplane going to the airport but I quickly noticed nothing was connecting the lights. I felt very intrigued to find out more so I kept my eyes on the object. I lost sight of the object because it went out of sight. It just vanished as if it went into a cloud slowly. However there was no clouds. It kept getting fainter and fainter very quickly until it was gone."],"City":"Stony Mountain","Latitude":"50.087562","Sighting Duration":"00:00:45","trends":["There have been no other sightings in Stony Mountain","This sighting has never been favorited."],"Object Features":"Unknown","Date of the Event":"09/21/2013 05:50 UTC","Object Flight Path":"Path with directional change","Viewing Distance":"Over One Mile","Case Number":"50964","Source":"MUFON","Weather Factors":"Unknown","Summary":"3 lights in triangle formation, change direction and appear in straight line, disappear after.","Country":"Canada","Tags":"City","Disposition":"Unresolved"}