{"Latitude":"53.553384","Country":"Canada","Object Features":"Undisclosed","Source":"MUFON","divs":["Sighting DetailsAt approx 12:45 am, I stepped outside in my back yard for a cigarette. A fluttering light in the sky caused me to look up, and I watched the object until it was too far away to see anymore. At first I thought it might be the police helicopter that flies around the skies in our neighbourhood often, but it was too high up, and moved in strange motions at times. It fluttered in a white flash, and was ALOT faster then the usual commercial jets that fly over our house everyday. The object at times \"swerved\" at incredible speeds, unlike anything I've ever seen in the sky before. I'd estimate that it traveled about 10 times faster than the normal aircraft we usually see. I did not hear any noise as I watched the object. It almost seemed to fly in strange flight paths at times, almost like a drunk driver might do..ie all over the road. It seemed pretty high up, and I could not decipher a shape. After seeing it, I was amazed, I wouldn't say it's a life changing experience, but I don't get excited too easily lol. I've always wondered if people just make up the stories about ufo's, but know I now..."],"Summary":"Fluttering sporatic flight, high rate of speed","Disposition":"Unresolved","City":"Edmonton","Weather Factors":"Unknown","Date of the Event":"07/17/2006 12:45 UTC","Log Number":"CA-07172006-0002","Date Submitted":"07/17/2006 12:45 UTC","Longitude":"-113.485032","files":["/var/www/straped/mufon/html2text/5097.html.txt","/var/www/straped/mufon/org/5097.html"],"trends":["There have been 70 other sightings in Edmonton","There were no other sightings in Edmonton on or around July 17th 2006"],"Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Object Shape":"Unknown","Case Number":"5097","map":"<A HREF = \"http://maps.google.com/maps?q=53.553384,+-113.485032(5097)&iwloc=A&hl=en\"> mufon case (5097) map </A>","Region":"Alberta","Viewing Distance":"Unknown","Tags":"City"}