{"Latitude":"41.105265","Weather Factors":"Unknown","Case Number":"50973","Sighting Duration":"Undisclosed","City":"Austintown","divs":["Sighting DetailsEvery single night at 10:30pm there is a tiny orange light in the sky above Austintown, OH. Sometimes it sits still in the sky and sometimes it will move as if it is flying. The light does not blink at all but it will fade in and out randomly as if it is moving closer and farther away. It usually only last a few minutes. It usually appears in eastern part of the sky. On July 4, 2013 we saw the orange light as we usually do while setting off fireworks, however that night it was different than usual because we also saw another orange light and a red light in the opposite side of the sky and they were obviously not fireworks. After we saw the usual light, a helicopter appeared in the opposite side of the sky oddly close, we assumed it was a state highway patrol helicopter as we were in close proximity to the highway. While we were looking at the chopper, a new orange light and a red light appeared in the same side of the sky. They both looked and acted just like the orange light we see every night in the eastern side of the sky. They sat still sometimes, flew around sometimes, and faded in and out of view randomly. These 3 lights appeared and disappeared over and over for about 35 mins that night which was definitely unusual. 1. In Austintown, OH near Rt 11. We were setting off fireworks and listening to the radio which was unaffected by the lights. 2. We were already watching the sky because we were lighting fireworks. 3. We immediately were convinced they were UFOs because we see one every night at 10:30pm. 4. One orange light on one side of the sky (the usual light), one orange and one red (separate) light in the opposite side of the sky. They sat still for a minute then moved left or right randomly as if they were flying around. They would fade out completely and grow brighter randomly. They didnt leave trails when they moved. No noise. Didnt have any affect on the fm radio that was playing or any affect on cell phones that we noticed. I dont remember the dogs acting weird either. 5. We all felt amazed and extremely intrigued, but normal. We all just stared until we didnt see them anymore and checked the radio stations to see if they were talking about it at all. My small children were scared and paranoid. 6. Eventually all 3 lights faded out of view at different times."],"Date Submitted":"09/22/2013 01:13 UTC","Object Shape":"Fireball, Sphere","Viewing Distance":"Over One Mile","trends":["There have been 6 other sightings in Austintown","There were no other sightings in Austintown on or around July 4th 2013"],"Source":"MUFON","Disposition":"Unresolved","Country":"United States","Log Number":"US-09222013-0004","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/50973.html.txt","/var/www/straped/mufon/org/50973.html"],"Longitude":"-80.761964","Region":"Ohio","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.105265,+-80.761964(50973)&iwloc=A&hl=en\"> mufon case (50973) map </A>","Date of the Event":"07/04/2013 12:00 UTC","Object Features":"Unknown","Summary":"Saw 3 seperate lights in sky"}