{"Weather Factors":"Unknown","Latitude":"42.597492","Object Flight Path":"Other","Object Features":"Unknown","Region":"Michigan","Source":"MUFON","Disposition":"Unresolved","Date of the Event":"09/21/2013 10:20 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.597492,+-82.816648(50970)&iwloc=A&hl=en\"> mufon case (50970) map </A>","Log Number":"US-09222013-0001","Tags":"City","Longitude":"-82.816648","files":["/var/www/straped/mufon/html2text/50970.html.txt","/var/www/straped/mufon/org/50970.html"],"City":"Harrison Township","divs":["Sighting Details10:15 pm -12.02am Lake Saint Clair At a location approximately 2 miles due East of Selfridge Air National Guard Base out over the middle of Anchor Bay on Lake St. Clair. I had just let the dog out in back yard on Anchor Bay when I noticed white lights in rotating patterns. There were two sets of approximately four lights each that were rotating as if chasing each other. The motion of the lights was in a counter clockwise pattern and generally the objects circled continuously some times moving faster or slower. They mostly maintained an equal distance between each other but occasionally seemed to clump up a little closer together. There were a total of 8 round lights with four lights each in two rotating paths adjacent to each other. The lights appeared to vary some what in brightness but this may simply be due to the variation in the thickness of the cloud cover over head. The lights appeared to be slightly above the cloud ceiling which is reported to be at 5,500 to 5,900 ft according to the weather channel. Currently it is approximately 56 degrees F with winds NW 10 but gusting much higher. Humidity 65% visibility 10 miles. Pressure 29.85 in I have lived on the lake since 1973 and spent a lot of time boating on the lake at night. Until tonight, I have never seen anything like this before. What ever this is--it is a very unusual phenomena. While the lights were sighted near a military base; I did not observed any fixed wing or rotor aircraft in the area at the time of the sighting. 12:02am The lights were still moving in circle patterns but I am tired and going to bed."],"Sighting Duration":"Undisclosed","Country":"United States","Case Number":"50970","trends":["There have been 2 other sightings in Harrison Township","There were no other sightings in Harrison Township on or around September 21st 2013"],"Object Shape":"Circle, Sphere","Date Submitted":"09/22/2013 12:15 UTC","Viewing Distance":"501 Feet - 1 Mile","Summary":"Two rotating sets of white orb like lights. Four orbs in each set."}