{"Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","City":"San Francisco Bay Area","divs":["Sighting DetailsI was preparing to unload equipment for work and I looked up at the sky as I often do. I saw a light that seemed too diffuse to be an airplane. It appeared to be traveling west and was far north of my position and had a regular pattern of dimming and britening with a period of 15 seconds or so. Having eliminated airplanes and stars I thought it might be a satalite. A cloud obscured my view for a moment. When it came back in to view it had deviated from its prior course in an unexpected manor. I noted that it was very fuzzy but appeared spherical. Then the object took off to the north at an apparent speed about 10 times faster than jets just under mach1 at an airshow and yet i heard nothing. It could have been approaching the oregon border in less than 5 seconds when I lost sight of it due to the great distance. It's trajectory looked like it curved down leading me to believe it maintained its altitude. I starred at the sky for a few minutes after and saw nothing. I was happy and a bit excited as I've never witnessed any UFO phenomena before, yet I regularly observe the night sky for pleasure."],"Longitude":"-122.25","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=37.714145,+-122.25(50978)&iwloc=A&hl=en\"> mufon case (50978) map </A>","Viewing Distance":"Over One Mile","Region":"California","Weather Factors":"Unknown","Country":"United States","Log Number":"US-09222013-0009","Object Features":"None","Source":"MUFON","trends":["There have been no other sightings in San Francisco Bay Area","This sighting has never been favorited."],"Date of the Event":"09/21/2013 08:18 UTC","Object Shape":"Sphere","Disposition":"Unresolved","Date Submitted":"09/22/2013 03:30 UTC","files":["/var/www/straped/mufon/html2text/50978.html.txt","/var/www/straped/mufon/org/50978.html"],"Summary":"Orb moving \"slowly\" then accelerated north at incredible speed","Case Number":"50978","Latitude":"37.714145"}