{"Longitude":"-76.894289","Region":"Maryland","files":["/var/www/straped/mufon/html2text/50989.html.txt","/var/www/straped/mufon/org/50989.html"],"Tags":"City","Viewing Distance":"101-500 Feet","Country":"United States","Case Number":"50989","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Object Features":"Patterned Surface","Summary":"I witnessed two low flying, triangular shaped craft moving in complete silence along baltimore washington parkway. There were also cars on the side of the road with hazards on apparently also witnessing the event","Latitude":"38.994287","map":"<A HREF = \"http://maps.google.com/maps?q=38.994287,+-76.894289(50989)&iwloc=A&hl=en\"> mufon case (50989) map </A>","trends":["There has been one other sighting in Greenbelt","There were no other sightings in Greenbelt on or around September 2nd 2013"],"divs":["sighting detailson my way to work i witnessed two low flying, triangular shaped craft moving in complete silence along baltimore washington parkway i deliver the washington post newspaper every morning. on monday, 09\\02\\2013 between 2:30 and 2:45 am as i took an exit off greenbelt, rd to merge onto baltimore washington parkway traveling south towards washington dc., i noticed two cars pulled on the shoulder with their hazard lights on. then as soon as i fully merged onto the parkway, myself and passengers in five or so other vehicles witnessed two very low flying, triangular shaped craft move somewhat slowly along the parkway and in complete silence. both craft looked exactly alike, triangular in shape with three white lights, one on each angle, one red light in the middle and two small green lights towards the back. the craft was coming toward me as i traveled south on baltimore washington parkway, then turned right running parallel to interstate 495. it was foggy that night and we eventually lost sight of the two craft. i was only able to see the two green lights once they turned revealing the back, underside of the craft. right before the event, i noticed many police vehicles on greenbelt road with cars pulled over as well as two cars pulled on the shoulder of baltimore washington parkway with their hazard lights on apparently also witnessing the two craft. i have never seen anything like what i saw that night and will never forget it. i am 100% positive whatever i saw was not constructed by man. i found this sight trying to see if anyone else posted anything from that night as i am sure other people witnessed the aircraft as well."],"Source":"MUFON","Sighting Duration":"Undisclosed","City":"Greenbelt","Date Submitted":"09/22/2013 10:13 UTC","Object Shape":"Triangle","Log Number":"US-09222013-0020","Disposition":"Unresolved","Date of the Event":"09/02/2013 02:30 UTC"}