{"Date of the Event":"09/22/2013 06:31 UTC","Disposition":"Unresolved","Sighting Duration":"00:00:06","Weather Factors":"Unknown","Case Number":"50995","map":"<A HREF = \"http://maps.google.com/maps?q=34.539507,+-82.033361(50995)&iwloc=A&hl=en\"> mufon case (50995) map </A>","Summary":"My wife was talking to me as I was leaving for work. When I asked where our kitten was as I turned around I saw a solid green orb","Region":"South Carolina","Date Submitted":"09/22/2013 11:41 UTC","files":["/var/www/straped/mufon/html2text/50995.html.txt","/var/www/straped/mufon/org/50995.html"],"Longitude":"-82.033361","Object Features":"None","Tags":"City","Viewing Distance":"Unknown","divs":["Sighting DetailsI was leaving for work this morning at 6:25. My wife walked with me to our back door to help catch any of our six kittens that try to get in the house every morning. I had my face towards the back door talking to my wife. I was on the third step and she leaned down to pick up one of our kittens. I asked her did she see Hercules, as I turned around to look towards my car to hunt the cat, I noticed a bright green glow. I saw a solid, perfectly round orb shooting across the sky. The orbs light lite up the shy and highlighted the cloud around it. I know it was under the clouds because it outlined the clouds with it's light. There was no sound and I had a clear view of the object. From my viewpoint it was about the size of a baseball. It moved for about 6 seconds and completely disappeared. I was stunned and when I turned to my wife, she said that she only saw a flash kind of like a falling star. She was petting our cat and I was in front of her, so she did not see the object like I did. I was excited and freaking out a little because I believe in UFO's but have never seen anything remotely close to a UFO. I do not know what this was, but it was not flickering like a burning object falling to the earth. It was a solid green orb. It's shape remained the same size and it's glow was consistent. It just disappeared and was gone."],"City":"Laurens","Log Number":"US-09222013-0026","Object Shape":"Circle","Country":"United States","trends":["There has been one other sighting in Laurens","There were no other sightings in Laurens on or around September 22nd 2013"],"Object Flight Path":"Straight-line path","Latitude":"34.539507","Source":"MUFON"}