{"Sighting Duration":"Undisclosed","trends":["There have been 2 other sightings in Middle River","There was one other sighting in Middle River on or around October 20th 2010"],"Object Flight Path":"Straight-line path","Case Number":"50999","City":"Middle River","Latitude":"39.352828","Longitude":"-76.431345","Date Submitted":"09/23/2013 02:48 UTC","Region":"Maryland","Country":"United States","Tags":"City","Log Number":"US-09232013-0004","Date of the Event":"10/20/2010 06:00 UTC","Object Features":"Other","divs":["Sighting DetailsIn mid October 2010 at zpprox 6pm I had just dropped off a customer and was on my way to pick up another in my taxi. I heard a very low rumble sound. I glance up to my 10'oclock through the window. I see part of a gray object moving very slowly . I think to myself \"wow a harrier jet!\" because of it's slow movement. The National Guard Air base is near by, so low flying planes are common so I put my thoughts back to driving. I continue to drive for a few more seconds and the woman in front of me pulls over to the right. I pulled over behind her so I could check the sight out(because by then I realized the plane must almost be stationary because we should have passed each other by now.) I exited my car and looked up. I couldnt comprehend what i was seeing. Descrip-Large 250-500 ft.-approx. 500 ft. in the air-moving approx. 5 mph s.e. direction -dark dull metallic gray hexagon- poles on top of different lengths-no lights at all(think hexagon millenium falcon with poles on top) the bottom was un-uniform and blocky. I was looking at it for about 5 seconds and then I looked over to the woman who had parked and gotten out of her car also. We actually looked at each other with \"what the hell?\" faces at the same time. Then I looked back up.(here's where it gets messed up) I continued to look at it for a couple more seconds. The next thing I remember is the woman and I getting back into our vehicles without talking to each other or glancing back up to see the craft. I just continued on my previous rout knowing what I had just seen but it wasn't a priority thought in my mind.(which is odd because I'm a very curious person by nature). I picked up a few more customers then went home. After the incident I had questions: -I wondered where it came from? Because something that large and low i should have seen coming for miles. -How did the woman and I chose to get back in our cars at the same time? -I take that it was gone when I was getting back in my car, but not sure. -I had a cell phone camera too. But I guess taking a pic takes a backseat to awe. If I would have taken a pic no one would have believed it anyway."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.352828,+-76.431345(50999)&iwloc=A&hl=en\"> mufon case (50999) map </A>","files":["/var/www/straped/mufon/html2text/50999.html.txt","/var/www/straped/mufon/org/50999.html"],"Summary":"250-500ft Dark gray hexagon- lumpy like millenium falcon-large poles on top","Object Shape":"Other","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","Disposition":"Unresolved","Source":"MUFON"}