{"Tags":"City","Disposition":"Unresolved","Source":"MUFON","Date of the Event":"09/22/2013 07:45 UTC","Latitude":"36.784161","City":"Undisclosed","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Features":"None","Case Number":"50992","Log Number":"US-09222013-0023","Object Shape":"Fireball, Sphere","divs":["Sighting DetailsI was in my room when I looked out the window (window faces east) when I noticed a bright red-ish light moving pretty fast (speed of a helcopter is closest I can describe it as). I ran outside and watch it pass behind trees that were blocking it from my view. It was coming from the east and moving west. It was hard to see distinguish distance but it was too bright and big to be a airplane. It was as bright as a plane with its lending lights on heading straight at me but it moving across the sky not facing me. When it cleared one more tree it stopped moving, hovered and after a minute it disappeared. It shrank until the light extinguished. It probably took like 3 secs to vanish. I didn't feel any fear the entire event. Before I ran outside I almost forgot to take my camera. I grabbed my iPhone but during the event all I could think about was about my DSLR camera in the house. I wanted to get that but while I was filming with my iPhone I didn't want to turn away I'm case I missed something. I also kind of figured that if I couldn't make out any details with my eyes then my camera wouldn't do much better. When I started filing it, it seemed to know what I was doing and stopped moving. That's when I thought to myself \"holly crap, what if it comes my direction!\" I stopped filming and a few seconds later it disappeared. As I submit the video I saw I took two pics. I don't remember taking pics during the event."],"Longitude":"-119.411352","trends":[],"Date Submitted":"09/22/2013 11:24 UTC","Object Flight Path":"Path then hovering","Country":"United States","Summary":"Bright fire ball coming from NE heading W, stopped, hovered, filmed it hovering, then disappeared (shrank until disappeared)","Viewing Distance":"Over One Mile","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=36.784161,+-119.411352(50992)&iwloc=A&hl=en\"> mufon case (50992) map </A>","files":["/var/www/straped/mufon/html2text/50992.html.txt","/var/www/straped/mufon/org/50992.html"]}