{"Object Features":"Unknown","Log Number":"US-09232013-0010","Summary":"At appx. 720pm over the vegetable garden of the farm in Canterbury, NH an object heading west began to glow bright blue-green while moving at the speed slightly slower then a descending meteor.","Source":"MUFON","Date of the Event":"09/22/2013 07:20 UTC","Country":"United States","City":"Canterbury","Tags":"City","Longitude":"-71.55784","Weather Factors":"Unknown","Latitude":"43.338804","Date Submitted":"09/23/2013 10:34 UTC","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=43.338804,+-71.55784(51005)&iwloc=A&hl=en\"> mufon case (51005) map </A>","trends":["There have been 2 other sightings in Canterbury","There were no other sightings in Canterbury on or around September 22nd 2013"],"Sighting Duration":"Undisclosed","divs":["Sighting DetailsI just saw an Unidentified Flying Object in the truest sense of the word. At appx. 720pm over the vegetable garden of the farm in Canterbury, NH an object heading west began to glow bright blue-green while moving at the speed slightly slower then a descending meteor. It might have been a few thousand feet high, but was certainly not as high as when planes fly at higher altitudes of 20,000 - 30,000 feet. While I have int mind it was a metallic object crashing, there is one peculiarity. I spend a lot of time outside and see a lot of meteors. I have yet to see one which brightens, dims and brightens again during decsent. Likewise I have never seen one glow blue-green during descent. Within the appx. 3 seconds I saw this object it glowed blue-green then dimmed then brightened up again. It appeared to slow down each time while glowing which makes sense do to speed and atmospheric resistance. The trees west blocked the rest of the view but I could see through the lower portion and was looking for a crash because the object was quite large and fast. I dis not see the object go lower."],"Object Shape":"Unknown","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/51005.html.txt","/var/www/straped/mufon/org/51005.html"],"Disposition":"Unresolved","Case Number":"51005","Region":"New Hampshire"}