{"Case Number":"5100","Summary":"UFOs over and around Pittsburgh","Longitude":"-79.986806","map":"<A HREF = \"http://maps.google.com/maps?q=40.444525,+-79.986806(5100)&iwloc=A&hl=en\"> mufon case (5100) map </A>","Object Flight Path":"Path with directional change","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/5100.html.txt","/var/www/straped/mufon/org/5100.html"],"Country":"United States","Source":"MUFON","Object Features":"Unknown","Disposition":"Insufficient Data","Tags":"City","Latitude":"40.444525","trends":["There have been 122 other sightings in Pittsburgh","There were no other sightings in Pittsburgh on or around July 16th 2006"],"Sighting Duration":"00:30:00","City":"Pittsburgh","Date Submitted":"07/16/2006 10:30 UTC","Date of the Event":"07/16/2006 10:30 UTC","divs":["Sighting DetailsLast night, my friend and I decided to sit outside and watch the stars. At approximately 10:30 pm I saw a light low in the sky. I showed my friend and we watched it as it travelled East, and then turned South. I could not make out a shape. But, living this close to Pittsburgh International, I can tell you that if it were an airplane, how low and close it was to us. We should have been able to hear something. But, it was silent. It only appeared to be an orangish colored light. And, it would brighten up and dim out at times. This sighting went on for about a minute. Until we lost it behind some houses. I would also like to point out that it was headed North. If it had been going to the airport on a normal flight pattern, it would have been heading West. If it had been a jet just taking off, it would have been gaining altitude. It was headed in the general direction towards downtown. After seeing this. My friend and I walked out to the road to see if this object was visable again. It was not. We were both scanning the skies, seeing if there was anything going on. I turned around, and saw my friend looking at something. I looked up and saw a white flashing strobe. It was pretty high up, travelling North. Nothing appeared out of the ordinary. It was completely consistant with what a jet would be doing. Just as I was thinking that, the strobes stopped. My friend turned around, and was freaked out a little. I told him I had seen it. And kept looking. About 5 seconds later, they reappeared. Still travelling along the same path, same apparent speed, etc. Another 5 seconds went by, and they stopped again. They did not start back up. I am sure this could have been an airplane of some sort. But, I have never seen, or heard of one flying blacked out like that. The strobes were the only lights on it. I never saw any marker lights. After a few more minutes, we decided to go back up to the porch, as our necks were hurting from standing out in the road staring straight up at the sky. We were laying out on some lawn chairs just discussing what we had seen. Trying to come up with reasonable explainations. At this time, I saw what appeared to be a satellite travelling North. I pointed it out to my friend and we watched it traverse the sky. After about 30 seconds of watching it, I told him the one I had seen the night before (in another state) was a lot brighter. Just after I said that, this object got much brighter. It stayed that way for a second, and then dimmed back out. My friend was a little freaked out. But, I didn't find it alarming. I know they have satellites (Iridium) which can appear to flare up, and dim out like that. I continued to watch it though. Then about 10 seconds later, it flared up big time. Like nothing I have ever seen. It was just a bright flash, a VERY bright flash. It made me jump a little. After the flash, the object was no longer visable. I've seen satellites plenty of times. It was clear last night. I should have been able to see a satellite for quite a bit more time. It was just simply gone. I am a fairly experienced observer. I keep up on what we have up there, and how it's supposed to behave. I can't explain what the orangish colored light was. I do no know why that \"plane\" blacked out like that. And if that was a satellite, it flared up much brighter than I have ever seen an Iridium satellite flare."],"Log Number":"US-07172006-0005","Region":"Pennsylvania","Weather Factors":"None","Viewing Distance":"501 Feet - 1 Mile"}