{"Date Submitted":"09/23/2013 12:52 UTC","Object Features":"Unknown","trends":["There have been no other sightings in Mabank","This sighting has never been favorited."],"Latitude":"32.301899","Longitude":"-96.106851","Summary":"Quite amazing! A little frightening, made me change how I discern info on the subject!","divs":["Sighting DetailsIt was a pretty spring day like any other. My partner and I stepped out into the back yard 6pm-ish to walk the dogs (to get the dogs out of the house while their kibble dinner is being made) like we regularly do every day. Sooo... My partner and I are standing at the end of our dock (on cedar creek lake) facing west when it came into our vision out of the south moving very slowly. At first we thought Japanese balloon lantern, then it appeared to move north like 20-25 miles in a couple seconds and slowed again. It was so amazing it was hard for me to tear myself away to get a camera. I still ran to get a camera. i ran back out side and it was still slowing moving (positioned north west from us), i start to fire up the camera and by the Time the camera booted up it turned away from us and departed very quickly. It was burnt orange with a orange \"aura\" . As far as our feelings. I was AMAZED when I realized what it was seeing, then afterwords I had a range of emotions at the same time like a manopausal anxiety attack. (Not from the UFO) more so my brain having to totally re-wire it's self to even process it and accept it. My partner doesn't like to discuss it, but I think had similar emotions. He thinks a fleet of black suburbans filled with guys in white lab coats and butterfly nets is going to show up and pick us up."],"Case Number":"51009","Region":"Texas","City":"Mabank","Object Flight Path":"Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=32.301899,+-96.106851(51009)&iwloc=A&hl=en\"> mufon case (51009) map </A>","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/51009.html.txt","/var/www/straped/mufon/org/51009.html"],"Date of the Event":"04/05/2013 06:20 UTC","Object Shape":"Star-like","Log Number":"US-09232013-0013","Tags":"City","Viewing Distance":"Over One Mile","Source":"MUFON"}