{"Longitude":"-93.860467","Latitude":"35.319389","Object Flight Path":"Hovering then path","Weather Factors":"Unknown","divs":["sighting detailswell i went out to enjoy the sunrise. it was around 7 am because the sun hadn't reached over the top of short mountain yet. at first when i saw the object i thought it was a jet that was far, far off with chemicals or smoke trailing behind it. but then as i watched it i realized that it looked rather odd. it wasn't acting like smoke. and it wasn't moving like a cloud either. the sky was totally clear so it couldn't have been a cloud. it was too small and didn't move like a lenticular cloud either. it looked as if it was shimmering. i don't know if it was because the sunlight was reflecting off of it or it was spinning and had flashing white lights on it. it started over to the right, above the mountain, and started moving left\\north bound over the top of the mountain. i am not exactly sure how fast it was moving, but it took it about 7 to 8 minutes to move from there over to the tree line and out of my sight. in the video it's pretty hard to make out it's best viewed full screen and in high quality. i am sorry for the poor video, but it was a spur of the moment filming and my camera isn't the best and i have no tripod to sit it on. i see star-like ufo's rather often at night here since i live out in the country where it's easy to see the stars. but this is the first time i have ever seen anything like this. from what i can tell it was big."],"Disposition":"Unresolved","Object Shape":"Disc","Case Number":"51006","Country":"United States","Region":"Arkansas","files":["/var/www/straped/mufon/html2text/51006.html.txt","/var/www/straped/mufon/org/51006.html"],"trends":["There have been no other sightings in Branch","This sighting has been favorited 2 times."],"Log Number":"US-09232013-0011","Sighting Duration":"00:08:00","Viewing Distance":"Over 1 Mile, Unknown","Summary":"Observed object hovering and moving north over Short Mountain by my house.","Date of the Event":"09/23/2013 07:01 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=35.319389,+-93.860467(51006)&iwloc=A&hl=en\"> mufon case (51006) map </A>","City":"Branch","Object Features":"Other","Date Submitted":"09/23/2013 09:57 UTC","Source":"MUFON"}