{"Region":"Massachusetts","Longitude":"-71.220163","Date of the Event":"09/22/2013 06:28 UTC","Disposition":"Unresolved","Object Shape":"Disc","Object Features":"None","Source":"MUFON","Country":"United States","Object Flight Path":"Path with directional change","trends":["There have been 5 other sightings in Methuen","There were no other sightings in Methuen on or around September 22nd 2013","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.73557,+-71.220163(51018)&iwloc=A&hl=en\"> mufon case (51018) map </A>","Latitude":"42.73557","Case Number":"51018","Sighting Duration":"00:02:00","City":"Methuen","Date Submitted":"09/23/2013 08:17 UTC","Tags":"City","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/51018.html.txt","/var/www/straped/mufon/more/51018_submitter_file1__DSC9905.JPG","/var/www/straped/mufon/more/51018_submitter_file2__DSC9908.JPG","/var/www/straped/mufon/org/51018.html"],"Log Number":"US-09232013-0020","Summary":"Saw 2 glowing orange lights, went up, down, left, then west.","divs":["Sighting DetailsI was at my friends house on his deck smoking cigars like we have been doing for many years. We always look up at the sky at planes, hot air balloons, flocks of birds, normal everyday stuff. Then my friend noticed 2 objects in the sky coming from the north part of the sky moving south on a straight line. We have seen planes of all sizes, hot air balloons from the neighboring towns, and other aircraft. They all have a color even at a far distance. I said that they look weird, they were glowing orange and they were both moving together. We expected them to just continue moving south as they were but all of a sudden the both went straight up very quickly, descending to the left just as quick, and then moved around a little bit then they both went back on their original path. My friend ran and got his camera, he has a long distance lens on it and snapped a couple of really clear pics. The continued moving south and we lost them in the trees. We were so excited to witness this but to get some pics was the best part!"]}