{"trends":["There have been 2 other sightings in Bernardsville","There were no other sightings in Bernardsville on or around July 17th 2006"],"Object Shape":"Star-like","Summary":"two yellow/amber color lights","Disposition":"IFO","Case Number":"5101","map":"<A HREF = \"http://maps.google.com/maps?q=40.718712,+-74.569324(5101)&iwloc=A&hl=en\"> mufon case (5101) map </A>","divs":["Sighting DetailsI was walking toward my house and happened to look up towards the east at what I initially thought was a yellowish color star. And almost parallel to that was another yellowish color star. So, I waited and watched to see if they were in fact stars or if they were moving using a telephone wire to determine any movement. They both moved slowly at which point I thought that they may have be airplanes. They looked like they were approximately 5 - 10 miles away. I thought it strange that two planes would be flying so close together going in the same direction. Also I didn't see the typical green and red lights on either side -- just these big amber color lights. All of a sudden they just disappeared. I thought perhaps they had flown behind clouds. When I looked straight up I saw stars and other planes that seemed to be flying at higher altitudes than what I had just seen. Just for the record, I have never in my life seen anything that strange. I think I'm more curious to know if anyone else in New Jersey saw these strange amber color lights at that time. I didn't think to take photos... I thought I was just looking a star."],"Object Flight Path":"Hovering then path","Object Features":"Unknown","Country":"United States","Viewing Distance":"Unknown","City":"Bernardsville","Date of the Event":"07/17/2006 09:15 UTC","Weather Factors":"Unknown","Longitude":"-74.569324","Region":"New Jersey","Tags":"City","Source":"MUFON","Date Submitted":"07/17/2006 09:15 UTC","files":["/var/www/straped/mufon/html2text/5101.html.txt","/var/www/straped/mufon/org/5101.html"],"Log Number":"US-07172006-0006","Latitude":"40.718712","Sighting Duration":"Undisclosed"}