{"Region":"New York","files":["/var/www/straped/mufon/html2text/51020.html.txt","/var/www/straped/mufon/org/51020.html"],"Case Number":"51020","trends":["There have been 4 other sightings in Brewster","There were no other sightings in Brewster on or around September 22nd 2013"],"Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Object Features":"None","Disposition":"Unresolved","Date Submitted":"09/23/2013 09:50 UTC","Date of the Event":"09/22/2013 07:20 UTC","Longitude":"-73.557356","Country":"United States","Object Shape":"Sphere","Summary":"we were driving and spotted a green acorn shaped object in the sky","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.445421,+-73.557356(51020)&iwloc=A&hl=en\"> mufon case (51020) map </A>","Log Number":"US-09232013-0023","Latitude":"41.445421","Tags":"City","City":"Brewster","divs":["sighting detailswe were driving along doansburg rd.in brewster,ny heading towards putnam lake(which is on the border of brewster and patterson) and i noticed a neon green acorn or sphere shaped object going over green chimneys farm\\complex. it was very bright but not blinding. it did not leave a trail. i have never seen anything like that in my life and neither had my husband. i was startled and looked at my husband and said what the hell is that. he looked up and we were both stunned. it seemed to be traveling kind of fast and we watched as it descended towards the other side of the road until it was out of sight. we then pulled the car over and really didn't know what to make of it. i wrote on my facebook page and asked if anyone in that area had seen anything (highly populated area) and nobody else had seen it. after we went to the store we decided to head in the direction that we saw it heading. we saw nothing that indicated any landing or crash. it would be great to know if this was some type of ufo or some kind of meteor or shooting star. i have seen meteors and shooting stars and none have ever looked the way this looked. this thing spooked us quite a bit and we haven't stopped thinking about it. we actually called the police department to see if anyone else reported anything and they said no. hoping for some answers from you. thanks!"],"Sighting Duration":"Undisclosed"}