{"Date Submitted":"09/24/2013 12:43 UTC","Log Number":"US-09242013-0003","Tags":"City","Weather Factors":"Unknown","Disposition":"Unresolved","Date of the Event":"03/08/2011 05:15 UTC","Country":"United States","Summary":"Rounding curve on hwy, saw a burnt orange colored object over N tree line","City":"Nikiski","Longitude":"-151.218524","Object Shape":"Oval","Object Flight Path":"Stationary","divs":["Sighting DetailsOn way to work driving 55mph, icy road conditions, very dark, no moon, no street lights. Approaching a left hand curve on Kenai Spur hwy just before fire station #2. With my car about 1500 ft from hwy curve ahead I saw a large dull burnt orange colored object out my front windshield (driver side) stationary above a treeline on north side of hwy; a few houses are scattered below the treeline. I initially thought it was an old microwave tower with its drum shaped domes (3 side by side) illiminated from below by flood lights. I thought the dull orange color was odd, and the \"3 drums\" I assumed was the top of a microwave tower looked too tight together with the middle one being the largest. I would estimate what I saw to be about 80 ft across and about 40 feet high at center. The trees below it where not illuminated by the object, it had a clear edge to it with black sky beyond, it had 3 rectangular black marks on the right side and a black vertical line going from right to left down the center. As I entered the road curve and come to about 500 ft from the object I could see it was certainly not an old microwave tower with their classic fabric covered drums. I took my eyes off it to watch the road ahead when it was just above my rear view mirror on windshield, it was about twice the size of the rear view mirror from my position looking out at it. I have driven this hwy for many years and realised no tower is at this location. I could not stop quickly due to the icy road conditions, I had to continue on thru the curve until the road straightenned out. About a minute elapsed with the object behind me and out of my sight before I could stop, turn around and drive back to site by side of hwy. While turning around on hwy to go back I could not see anything in the area it had been down the road, just dark sky and a few dull porch lights on the scattering of houses below the treeline. It was gone, I had not seen it move away. Later in the daylight I drove back and confirmed what I thought, that no tower of any kind is at the location in question; just a 100 ft wide treeline on north side of hwy with a few houses below and a small lake beyond this. I have not seen anything like this since, on my many drives to the Kenai peninsula each year. I had a camera at the time on the car seat(iPhone), but in the brief time I could have taken a shot I did not think \"UFO\" I really thought I was seeing a old microwave tower that was illuminated, very frustrating to have missed such an opportunity to say the least."],"trends":["There has been one other sighting in Nikiski","There were no other sightings in Nikiski on or around March 8th 2011"],"Viewing Distance":"101-500 Feet","Sighting Duration":"00:00:08","Source":"MUFON","Case Number":"51027","map":"<A HREF = \"http://maps.google.com/maps?q=60.742386,+-151.218524(51027)&iwloc=A&hl=en\"> mufon case (51027) map </A>","files":["/var/www/straped/mufon/html2text/51027.html.txt","/var/www/straped/mufon/org/51027.html"],"Latitude":"60.742386","Region":"Alaska","Object Features":"Window(s)"}