{"Latitude":"39.518631","trends":["There have been no other sightings in Matamoras","This sighting has never been favorited."],"Object Features":"None","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/51030.html.txt","/var/www/straped/mufon/org/51030.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.518631,+-81.070467(51030)&iwloc=A&hl=en\"> mufon case (51030) map </A>","Date of the Event":"09/22/2013 09:30 UTC","Weather Factors":"Unknown","Case Number":"51030","Sighting Duration":"Undisclosed","Object Shape":"Cigar","divs":["sighting detailsi was driving home from parkersburg, wv on rt 7 north in ohio. i happened to look up and to the left and noticed to lights space appros a thumbs width apart proceeding in a northeasterly direction at approx 55 mph. initially i thought it could be lifeflight going to wetzel co. hospital, but it was moving too slow for lifeflight and from the wrong direction. the lights proceeded ne along the ohio river, never changing direction but moving at a steady speed. i thought if it were lifeflight it would begin descending once it got close to the hospital, but it didn't. the only feeling i have are just curiosity. i know what it wasn't, but have no idea what it was\\is. eventually the object appeared to hover over the hills ne of town and i noticed that between the two bright lights on either side there were three lights of less intensity of brightness. after watching for approx 5 minutes longer i came inside and at that time the lights were still stationary. i checked again after doing some chores ( about 5 mn) and the lights were still there."],"Object Flight Path":"Stationary","Date Submitted":"09/24/2013 12:57 UTC","Summary":"I observed lights moving in NE direction an a relatively low x speed for approx 30 mn. Object eventually became stationary NE or New Martinsville WV","Disposition":"Unresolved","Country":"United States","Log Number":"US-09242013-0006","Tags":"City","Longitude":"-81.070467","Region":"Ohio","City":"Matamoras","Source":"MUFON"}