{"Object Shape":"Boomerang","trends":["There have been 7 other sightings in Grand Prairie","There were no other sightings in Grand Prairie on or around September 21st 2013"],"Object Flight Path":"Hovering then path","Latitude":"32.665638","Date Submitted":"09/24/2013 04:32 UTC","Object Features":"None","Disposition":"Unresolved","Country":"United States","Region":"Texas","Longitude":"-97.04818","Viewing Distance":"101-500 Feet","Summary":"boomerrang shape - large-beige or light metal that reflected moonlight- no sound or lights","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","City":"Grand Prairie","Source":"MUFON","files":["/var/www/straped/mufon/html2text/51046.html.txt","/var/www/straped/mufon/org/51046.html"],"Log Number":"US-09242013-0022","Tags":"City","divs":["Sighting Details(6am) Sat. Sept. 21,2013 I was putting my dog in backyard and was so surprised by the beautiful bright light that lit up my yard and roof top of my neighbors house. As I went out and closed my door I reached in and turned the patio light off as it interfered with the beauty of the moon light. My first thought was wow God is shinning down upon us His beauty and creation. I stood outside upon my open patio looking up at the stars- the dippers and the moon which really was not completely full. It was a clear night no clouds. After about 4 min, I glanced over towards the east and my neighbors roof and I saw the Boomerang shaped craft. It was large and seemed to appear out of nowhere. I just froze and watched it. My dog did not seem affected or did not see it. It moved very slowly to the South out over my roof and trees and line of vision. I was surprised by its size and how close it was and low. The boomerang shape was smooth beige or reflective, it had no lights or sound. I walked back into my yard to try and follow it visually but could see over my roof and house. I just stood in shock. Within 15sec in the South sky at a great distance I saw a flash of light which I thought was a shooting star. I went in my house and did not wake anyone. I felt disbelief and confusion but not fear. I have now told my family and they are not completely sure of what I have seen. I live close to DFW and a Navel Base. I have questioned if it could of been a flock of birds at (6am) or a weather balloon or some type of military craft. I have never believed in UFO's but now I have to consider it."],"Case Number":"51046","Date of the Event":"09/21/2013 06:05 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.665638,+-97.04818(51046)&iwloc=A&hl=en\"> mufon case (51046) map </A>"}