{"map":"<A HREF = \"http://maps.google.com/maps?q=42.220317,+-83.483824(51048)&iwloc=A&hl=en\"> mufon case (51048) map </A>","Source":"MUFON","Object Flight Path":"Stationary,Hovering then path","Summary":"Hovering at 300' then quickly decsended 35 mph while wobbling SE very dark 1/3 size of hot air ballon 100' when i lost it","Object Features":"Unknown","Disposition":"Unresolved","Latitude":"42.220317","Region":"Michigan","Date Submitted":"09/24/2013 05:46 UTC","Sighting Duration":"Undisclosed","Log Number":"US-09242013-0024","divs":["sighting detailsi was driving north on 275 when i saw a dark circular object about 300' in the air it was hovering for about 3 seconds then it slowly descended se traveling around 35 mph and it was wobbling kind of like a deflated balloon it was 1\\3 size of a hot air balloon. it was about 100' above ground when i lost it. i witnessed it for about 10 seconds. all the way home i was thinking of what it could be and i still have not come up with a conclusion. i live near an airport and it was not a hot air balloon was not a airplane was not a helicopter that is for sure . i thought maybe a drone or quad rotor but it was too big. when i saw it it was about 1\\4 mile away from me getting closer as i went north on 275. the sun had almost gone down and it was getting dark but not dark enough to turn my head lights on almost like a bad storm was coming kind of darkness so i could see it very good. no lights no metallic shiny finish just flat black. when it was moving and decsending it looked like a wobbling penut and it looked oval at one point. if any one saw this i want to know what it is or was."],"Longitude":"-83.483824","Date of the Event":"09/20/2013 07:45 UTC","files":["/var/www/straped/mufon/html2text/51048.html.txt","/var/www/straped/mufon/org/51048.html"],"Tags":"City","Country":"United States","Object Shape":"Blimp, Circle, Oval, Sphere","City":"Van Buren Charter Township","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been no other sightings in Van Buren Charter Township","This sighting has never been favorited."],"Case Number":"51048","Weather Factors":"Unknown"}