{"Disposition":"Unresolved","divs":["sighting detailsdriving down 104 westbound, i noticed that it appeared that there was a diagonal line of bright planet-like lights in the west sky. initially, i thought it was venus, but looking towards the southwest, i could see venus shining bright white, while these orbs seemed reddish-orange. i thought then that it was possibly mars, but thought that was visible in the east and only later in the evening so i wanted to check. i grabbed my phone to open the skymap app that i have and as i did, i noticed that the center \"planet\" had started to rise in the sky and the one on the right began to move as well. they moved towards me in a direction from the west\\northwest to east\\northeast. they were moving much faster than a plane and the light emitted grew brighter and did not pulsate or flash. both orbs moved at similar speeds and stayed equidistant from each other on their path and they disappeared over my car towards the east. the objects weren't as high as plane high up but they were higher than a plane coming in to land at the local airport. i couldn't see any distinct shape other than the circular light and i did have my glasses on."],"Tags":"City","files":["/var/www/straped/mufon/html2text/51042.html.txt","/var/www/straped/mufon/org/51042.html"],"Object Shape":"Sphere","Date of the Event":"09/23/2013 08:43 UTC","Viewing Distance":"501 Feet - 1 Mile","Region":"New York","Source":"MUFON","Log Number":"US-09242013-0018","trends":["There have been 3 other sightings in Webster","There were no other sightings in Webster on or around September 23rd 2013"],"Sighting Duration":"00:03:00","Latitude":"43.223024","Case Number":"51042","Object Flight Path":"Hovering then path","City":"Webster","Object Features":"None","Summary":"2 dusty red orbs hovering above horizon then flew towards east keeping to similar paths","map":"<A HREF = \"http://maps.google.com/maps?q=43.223024,+-77.461325(51042)&iwloc=A&hl=en\"> mufon case (51042) map </A>","Weather Factors":"Unknown","Date Submitted":"09/24/2013 12:09 UTC","Longitude":"-77.461325","Country":"United States"}