{"Source":"MUFON","Case Number":"51041","Viewing Distance":"Over One Mile","Object Shape":"Triangle","City":"Modesto","trends":["There have been 48 other sightings in Modesto","There were no other sightings in Modesto on or around September 21st 2013"],"Country":"United States","Log Number":"US-09242013-0017","Disposition":"Unresolved","Latitude":"37.642927","divs":["sighting detailsi was sneaking into a music festival called symbiosis outside of modesto on that evening and looked up at the full moon that was illuminating a light fog over the area. the music festival had several stages with lots of electronic music and lazers...it was at a local resevoir\\state park. when i looked up i saw a triangular craft which looked very large. it was difficult to judge the size and the light fog made it appear duller than it might have been- the lights might have actually been a lot brighter on the underside of the craft. it moved quietly (the music was loud, so i cant tell if it was silent, though based on how gracefully it moved and quickly, it seemed like it was silent. it moved from the northeast to the northwest across the entire sky in under 5-10 seconds. it reminded me of a ufo seen on nightvision, a triangular one that moved with steady lights across the sky. i saw this clip on youtube, but this craft was much larger. i saw it in perspective, seeing a perspective view of it from the underside as it moved across the sky...i just had a really awesome feeling after watching it- it was awe-inspiring, and beautiful. for a moment i thought maybe the lights from the show caught its attention. but it appeared to come from the sierras (mountain range) and went across the entire sky. i came here to see if anyone saw it, please contact me if others did... and i was not on any drugs or alcohol."],"Object Flight Path":"Straight-line path","Object Features":"Unknown","Date Submitted":"09/24/2013 11:50 UTC","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=37.642927,+-120.991108(51041)&iwloc=A&hl=en\"> mufon case (51041) map </A>","Longitude":"-120.991108","Weather Factors":"Unknown","Tags":"City","Summary":"Appeared to be very large, maybe several football fields, triangular by the light pattern, maybe 7-9 lights on underside","files":["/var/www/straped/mufon/html2text/51041.html.txt","/var/www/straped/mufon/org/51041.html"],"Date of the Event":"09/21/2013 11:30 UTC","Sighting Duration":"00:00:10"}