{"trends":["There have been 39 other sightings in Richmond","There were no other sightings in Richmond on or around September 24th 2013"],"Case Number":"51052","Longitude":"-77.598416","Tags":"City","Sighting Duration":"00:20:00","Source":"MUFON","divs":["Sighting DetailsMy son was walking the dog and came into the house to tell me he saw UFOs. We went out in the backyard and for a twenty minute period we witnessed approximately 50 triangular objects with blinking lights flying overhead in a northeasterly direction. There were two to five visible at any given time over this period. They were not directly over our heads, but as we looked NE, some were to our left, and some were to our right. We could turn to the SE and pick out new ones, and follow them as they flew out of sight to the NE. We think they were triangular because they generally had three lights. The lights allowed us to see the solidity of the objects. The objects were moving in the direction of a side of the triangle; a point of the triangle was in the rear. The rearmost light was blinking while the front two were steady. There seemed to be more than just the three lights that defined the triangle. Their flight was straight and steady. A single object would take about four minutes or so from initial sighting in the SE to going out of sight in the NE."],"Weather Factors":"Unknown","Latitude":"37.608883","map":"<A HREF = \"http://maps.google.com/maps?q=37.608883,+-77.598416(51052)&iwloc=A&hl=en\"> mufon case (51052) map </A>","Country":"United States","Summary":"Multiple triangular craft flying slowly in NE direction","Object Flight Path":"Straight-line path","Region":"Virginia","Log Number":"US-09242013-0028","City":"Richmond","files":["/var/www/straped/mufon/html2text/51052.html.txt","/var/www/straped/mufon/org/51052.html"],"Object Shape":"Triangle","Disposition":"Unresolved","Object Features":"None","Viewing Distance":"Unknown","Date of the Event":"09/24/2013 08:30 UTC","Date Submitted":"09/24/2013 09:19 UTC"}