{"Region":"Pennsylvania","Weather Factors":"Unknown","Summary":"thought it could be a blimp but it was way to long & skinnyThe entire cigar shape lit up amber/pink/orange,no other lights or colors very random blinking it blinked on for only a second , 3-4 times in the 4 minutes i watched.Saw outline while not lit","Object Shape":"Cigar","Longitude":"-74.849084","Sighting Duration":"Undisclosed","Date Submitted":"09/25/2013 12:19 UTC","Log Number":"US-09252013-0001","Disposition":"Unresolved","Country":"United States","Object Features":"None","Source":"MUFON","trends":["There have been 12 other sightings in Fairless Hills","There were no other sightings in Fairless Hills on or around September 24th 2013"],"divs":["sighting detailsi was facing south west, the object was moving nw to se. i was in fairless hills shopping center parking lot coming out of gamestop and saw it directly over wells fargo bank moving slowly. i noticed it when it lit up. it flashed on for a second. i could still see it when it wasn't lit up but only the outline of it. it had no lights like a plane, helicopter or blimp would. no red, green or white lights at all. just a dark outline. i watched to see if it would light up again. it flashed on two more times but not as bright or as long as the first time. the 4th and last time i saw it flash on seemed like the brightest longest flash.i was watching for 3-4 minutes total. i should have watched longer but i was in a rush. the amber,pinkish,orangeish color lit up the entire cigar shape and the light was vibrating or pulsating a little. it was far away from me because it was only the size of a pill in the sky. it only moved half the length of the bank the whole time i watched so it was very slow. i saw the despicable me blimp a couple days ago and this was nothing like that. like i said before it was way to skinny and long shaped to be a blimp plus no running lights. i watch the sky all the time. my dad and grandfather are both pilots. ive been flying in and around airplanes my hole life. i had my contacts in and have 20\\20 with the in. this was definitely out of the ordinary."],"Latitude":"40.188454","Case Number":"51056","map":"<A HREF = \"http://maps.google.com/maps?q=40.188454,+-74.849084(51056)&iwloc=A&hl=en\"> mufon case (51056) map </A>","Object Flight Path":"Straight-line path","Tags":"City","Date of the Event":"09/24/2013 08:50 UTC","City":"Fairless Hills","files":["/var/www/straped/mufon/html2text/51056.html.txt","/var/www/straped/mufon/org/51056.html"],"Viewing Distance":"Over One Mile"}