{"Object Features":"None","Case Number":"51054","files":["/var/www/straped/mufon/html2text/51054.html.txt","/var/www/straped/mufon/org/51054.html"],"City":"Sunnyside","Tags":"City","Log Number":"US-09242013-0031","Viewing Distance":"101-500 Feet","Sighting Duration":"00:03:00","Longitude":"-120.019461","Summary":"it was a large round silver ball hovering over a large cow farm.","map":"<A HREF = \"http://maps.google.com/maps?q=46.33031,+-120.019461(51054)&iwloc=A&hl=en\"> mufon case (51054) map </A>","Latitude":"46.33031","Region":"Washington","Object Flight Path":"Hovering then path","trends":["There have been 5 other sightings in Sunnyside","There was one other sighting in Sunnyside on or around July 15th 1996"],"Object Shape":"Sphere","Country":"United States","Date of the Event":"07/15/1996 02:30 UTC","Weather Factors":"Unknown","Date Submitted":"09/24/2013 09:53 UTC","Source":"MUFON","Disposition":"Unresolved","divs":["Sighting Detailsit was june 1996. i was driving home with 3 friends from sunnyside washington to granger washington. it was around 3pm . it was a very hot, clear sky day.we were driving east on yakima valley highway ride outside of the paul- mason dairy in sunnyside washington. nobody was really talking to each other , as the heat was miserable . i light up a cigarette, blew out the smoke and looked out the window.there hovering above the dairy was a large silver ball. i looked at it hard for a second, then asked my friends if the saw too? my friends looked at what i was looking at and one of my friends said \" dude its a ufo!\". it was hovering about 100-150 feet off the ground, making a slow vibrating sound. we watched it for about 1-2 mintues before the sound stoped ,and the object disapeared in the blink of an eye.as we arrived to granger,the object reappeared for about 30 seconds be it disapeared again.we got home and told our parents and afew other friends but the thought we had made it up. i had heard about cattle mutilations happening in the night before , but never during the day . i did not see any mutilations that day because we were just driving the dairy . but i have always found it weird that a ufo would be hovering above a large cattle dairy in the bight daytime."]}