{"Object Shape":"Boomerang","City":"Denver","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/51062.html.txt","/var/www/straped/mufon/org/51062.html"],"Source":"MUFON","Object Flight Path":"Straight-line path","Latitude":"39.657117","Sighting Duration":"Undisclosed","Region":"Colorado","Log Number":"US-09252013-0005","Summary":"Vary large boomarang shaped with maybe 10 lights on leading edge","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around September 25th 2013"],"divs":["Sighting DetailsI was on the back porch having a smoke sitting in a chair. It was almost 3 am.I'm also an amateur astronomer and was watching the stars. Then I noticed, straight up, a huge boomerang shaped craft. It had rows of light on or near the leading edge. There had to be 10 or so lights all in a row on the leading edge, that make 5 or 6 lights on each side forming a boomerang shape. It was moving extremely fast moving due south coming from the north right over Denver. From the time I seen it until it faded to the south was only 3 or 4 seconds. It's size was huge. It had to have some altitude because the lights were not vary bright. If I held my fist up at arm's length it would be nearly two fist's wide and no sound at all. That wide and that high up it had to be over 500 feet across or better. The speed of the craft must have been over 1000 mph by how fast it moved to the south. It was an amazing sight. I called Denver PD to see if any one reported it and no had at that time. I stayed out to see if I seen it again. At 4:10 a small craft with two lights came from the North West heading SSE. It had only two lights but was moving vary fast. Atleast three times the speed of any airplane. I seen many airplanes go by the hole time I was out there. This one seemed to be heading twords the one that went by earlier. The speed of the small one was what stood about it. It was a moving along. This one faded as it moved south ward. This one lasted around 5 or 6 seconds."],"Object Features":"Unknown","Date Submitted":"09/25/2013 07:20 UTC","Date of the Event":"09/25/2013 02:40 UTC","Disposition":"Unresolved","Tags":"City","Longitude":"-104.898706","Case Number":"51062","Country":"United States","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.657117,+-104.898706(51062)&iwloc=A&hl=en\"> mufon case (51062) map </A>"}