{"Source":"MUFON","Object Features":"None","Object Shape":"Sphere, Star-like","Country":"United States","Date of the Event":"09/25/2013 02:30 UTC","files":["/var/www/straped/mufon/html2text/51061.html.txt","/var/www/straped/mufon/org/51061.html"],"Region":"Illinois","trends":["There have been no other sightings in Mahomet","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Summary":"ball of light","Longitude":"-88.404223","Case Number":"51061","Disposition":"Unresolved","divs":["Sighting Details1. i was letting my dog out to \"go\". 2-3. it stood out from the stars it was very bright and then i saw it move a little 4. it appeared to kinda hover but wobble about slowly. it was moving far to slowly to be a plane and was far to high up, I have seen many planes pass by we do have a small airport near champagne. it was one color a white light looks just like other stars but as time lapsed it grew dimmer could have been moving more to the southeast and i just couldn't tell at the time but it did start to go more north not sure on the direction it was to my right facing southeast going toward the moon. The thing that made me feel it was not a satellite was that i observed other very much smaller bits of light approach and leave from the larger ball of light i ran to get my telescope to focus on it but its very old and cheap a kids model and all i could see though it was a ball of light that looked like a white version of a traffic light. so it was very far up and my telescope is no help at all. it was there for about half an hour or more i kept going back outside to see what other changes to its movement i could determine until it just wasn't there. Ill admit my eye sights not the best so i have to determine what things are from behavior and speed and im sure it was no plane, still a possibility to have been a satellite but that doesn't explain the other smaller balls of light that went to and from I know this i probably not very helpful information but i felt strongly enough about it that something needed to be said."],"Latitude":"40.195311","City":"Mahomet","map":"<A HREF = \"http://maps.google.com/maps?q=40.195311,+-88.404223(51061)&iwloc=A&hl=en\"> mufon case (51061) map </A>","Tags":"City","Weather Factors":"Unknown","Viewing Distance":"Unknown","Object Flight Path":"Hovering then path","Log Number":"US-09252013-0004","Date Submitted":"09/25/2013 04:44 UTC"}