{"Sighting Duration":"01:20:00","City":"Colorado Springs","Country":"United States","files":["/var/www/straped/mufon/html2text/51065.html.txt","/var/www/straped/mufon/org/51065.html"],"Object Flight Path":"Path with directional change","Date of the Event":"09/24/2013 10:10 UTC","trends":["There have been 106 other sightings in Colorado Springs","There was one other sighting in Colorado Springs on or around September 24th 2013"],"Region":"Colorado","Object Features":"None","Log Number":"US-09252013-0007","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=38.799975,+-104.743201(51065)&iwloc=A&hl=en\"> mufon case (51065) map </A>","Longitude":"-104.743201","Disposition":"Unresolved","Date Submitted":"09/25/2013 09:01 UTC","Object Shape":"Sphere","divs":["Sighting Detailslooking into the night sky I looked at the stars and notices a couple jetliners an normal altitude flying easterly, at the same time I noticed something much higher and brighter moving and continued to watch it for over and hour invited friends to witness , no clue , not like anything we had ever recognized in the night sky, I continued to watch it circle in a counter clockwise direction at the same altitude and same flight path for over and hour and a half and then it seemed to just dissipate. Ever once in a while it would project bright white flashes on what appeared to be the the north to south turn coming back towards Colorado Springs. It would make movements like a snake sometimes and then stop. And then take off like instantly at full cruising speed then sometimes really speed up unlike anything I have ever seen . Not sure if Military was testing something can someone talk to the air traffic control and see what they had on radar at that time as it was something abnormal. Normally you can always hear a jet as it flies at normal cruising altitude as I did hear several during and after the event, but this object had no sound whatsoever in the night sky and it is normally quiet enough to hear all jetliners flying over. I believe it to be either top secret or unknown to mankind as an avid observer of all aircraft being brought up with an Air Force Family."],"Source":"MUFON","Summary":"noticed object circling an area along the front range over 30,000 ft , looking like a flashing star in the night maybe a 100 mile diameter same circling for over an hour, friends witnessed also and it would stop and change directions unlike conventiona","Latitude":"38.799975","Tags":"City","Case Number":"51065","Weather Factors":"Unknown"}