{"Date of the Event":"08/25/2013 08:30 UTC","divs":["Sighting DetailsI was walking my dog on our evening walk. A star like orb caught my left eyes attention. It was planet like in brightness. It seemed to be on a bending flight path(almost like a narrow S) but it still moved across the sky quite fast. I had seen another white orb like this six years prior waiting to go into the movies, however the characteristics of that sighting were pretty different. That one appeared out of nowhere,hovered for a second, increased in brightness then jetted off a couple centimeters across the sky to disappear leaving behind a motion blur bar that disappeared very oddly. This one was flying when I saw it. I described it to my neighbor as like it was standing still and space was moving around it. But anyways it flew into a cloud the same time the treeline cut my vision of it off. I also saw seemingly the same orb a couple nights after that again on my walk. This time it just shot straight across the sky, again getting cut off by trees. However all three sightings might of been 7, 8 seconds all together but nonetheless I saw what I saw and I do not believe humans were in control of any of them."],"Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Sphere","Case Number":"51079","Log Number":"US-09252013-0019","Disposition":"Unresolved","Latitude":"40.447725","map":"<A HREF = \"http://maps.google.com/maps?q=40.447725,+-79.988006(51079)&iwloc=A&hl=en\"> mufon case (51079) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/51079.html.txt","/var/www/straped/mufon/org/51079.html"],"Country":"United States","Object Features":"Unknown","Region":"Pennsylvania","Sighting Duration":"Undisclosed","Source":"MUFON","trends":["There have been 122 other sightings in Pittsburgh","There was one other sighting in Pittsburgh on or around August 25th 2013"],"Date Submitted":"09/25/2013 06:15 UTC","Weather Factors":"Unknown","City":"Pittsburgh","Longitude":"-79.988006","Object Flight Path":"Path with directional change","Summary":"walking my dog, starlike orb caught my eye."}