{"Source":"MUFON","Latitude":"40.720563","Object Flight Path":"Straight-line path,Path then hovering","Date of the Event":"01/25/2013 05:56 UTC","Region":"New York","Weather Factors":"Unknown","Tags":"City","Object Features":"Other","Longitude":"-73.998123","Country":"United States","Object Shape":"Flash","trends":["There have been 579 other sightings in New York","There were 3 other sightings in New York on or around January 25th 2013"],"Viewing Distance":"20 Feet or Less","Sighting Duration":"Undisclosed","Case Number":"51078","files":["/var/www/straped/mufon/html2text/51078.html.txt","/var/www/straped/mufon/org/51078.html"],"Summary":"Firework ember, green, huge sonic flash, no boom, sudden multiple flashes, fast falling craft above me, stopped-hovered.","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=40.720563,+-73.998123(51078)&iwloc=A&hl=en\"> mufon case (51078) map </A>","Date Submitted":"09/25/2013 06:01 UTC","Log Number":"US-09252013-0018","divs":["Sighting DetailsI was in my car driving to work on the Friday morning of January 25, 2013. It was 5:56 am as I took the final turn leading to my work-site. It was dark at this hour of the morning. As I drove up the heavily treed road, I suddenly noticed what looked like a greenish firework ember falling slowly down into the tree line above me. All of a sudden, a huge, yet silent flash went off which trained my eyes away from the \"Ember', glancing all around me.It was very much like a lightening flash, except greenish. I remember gripping my steering wheel tightly while expecting to hear a boom as it made me think \"Bomb\". No sooner did I think \"Bomb\" there were multiple flashes of green illuminations darting all around me and my vehicle.I've equated this in current times to feeling as though I were in a microwave oven.These flashes were so bright that I could see right through the trees and hillside terrain. I thought \"What the heck, is someone welding?\" No sooner did this thought cross my mind, I glanced up to see a light very high above me just dropping downward at an incredible rate of speed. Here, I thought \"Meteor\" but I just closed my eyes tightly even though it was heading right for me and my vehicle. But then nothing. When I'd opened my eyes, the interior of my car was filled with a yellowish glow. As I looked up this time, I'll never forget what I saw for as long as I live. A ufo was the only category that my mind could fit this thing into. It hovered in mid air directly above the power lines, and directly above me. I took in the object for approximately 3-4 seconds. It was metallic in appearance with a grooved bottom, rectangular in shape and had lights coming off it's corners. As it was right over me, I only had this view of it. It had to be three to four times the size of my car at least. The entire event was absolutely silent. After three to four seconds, I floored it right under this thing as fast as I could. Once I made it up the road, I glanced back, but to my surprise, it was gone. I went into my job but I believe that I was in a state of shock. I told no one and seemed to be on auto pilot through my day. However, by the time I came home that evening, I became highly troubled and disturbed by the event. I felt sick all weekend, called out sick that Monday. I was literally afraid to return to my job and drive the scenic route. It was quite the experience. Upon calling out sick that Monday, I did report my experience to the ufo reporting center, but my report was incomplete. I felt desperate to find some answers myself but just could not tell my whole truth due to the fact that it was so outrageous. In hindsight, it's good as I had to grapple with it myself first. This is why I'm reporting it now-in full. You question your sanity with such an event, question if you hallucinated everything, and you're afraid to tell anyone because they might think you're completely nuts. I knew that I had to pull myself together, and as hard as it was, I went and got myself evaluated as a result of the event. This was a really difficult risk for me to take, but once I was able to prove to them and myself that I was of sound mind, it gave me the courage to move forward in my life. The good news..I'm not crazy, and I do have to live with the fact that I will not ever know if I hallucinated it, or not. I simply have to accept it and move on, which I've done."],"City":"New York"}