{"Disposition":"Unresolved","Latitude":"33.043561","Object Features":"Unknown","trends":["There have been 8 other sightings in Lewisville","There were no other sightings in Lewisville on or around August 25th 2013"],"files":["/var/www/straped/mufon/html2text/51077.html.txt","/var/www/straped/mufon/org/51077.html"],"divs":["sighting detailsi saw a bright star-like object in the sky while looking west. while the object looks like a star it appears too bright to be one. it also looks like it is too low in the sky to be a star. i have seen the object many many times but i just dismissed it at first. i then became interested in the alien\\ufo phenomenon, so i began to study it more and more. most of time i never saw it move with the naked eye but there was an exception. one night i was talking to my father about 8:40 at night. i was outside and leaning up against my pickup truck. my father tends to be long winded when he speaks so i knew that if i went outside that i would have plenty of time to observe the object. it shows up almost every night, but on this particular night i saw it slowly move from right to left. i also decided to film it on another night around the same time using a sony video camera with night shot and night shot plus technology. when i used the night shot plus technology the object appears to draw letters or shapes in the sky. i filmed it doing this for about 20-30 minutes. there were two other witnesses that saw it move around on my screen in this fashion. i am running short on time so this is all i can submit for now. i will be glad to provide you with the video footage later."],"Sighting Duration":"Undisclosed","Case Number":"51077","Summary":"I saw a bright star-like object in the sky while looking west. While the object looks like a star it appears too bright to be one.","Weather Factors":"Unknown","Tags":"City","Longitude":"-97.025833","Object Flight Path":"Hovering then path","City":"Lewisville","Date Submitted":"09/25/2013 05:04 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.043561,+-97.025833(51077)&iwloc=A&hl=en\"> mufon case (51077) map </A>","Region":"Texas","Object Shape":"Star-like","Viewing Distance":"Unknown","Source":"MUFON","Log Number":"US-09252013-0017","Date of the Event":"08/25/2013 08:40 UTC"}