{"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Unknown","trends":["There have been 4 other sightings in Sandy Springs","There were no other sightings in Sandy Springs on or around September 16th 2013"],"Summary":"Four spheres about 500 feet or more above our courtyard: ran for camera, gone 15 seconds later.","Date of the Event":"09/16/2013 08:01 UTC","City":"Sandy Springs","divs":["sighting detailsi am writing to report a sighting of four ball shape objects this morning (9\\16) at 8:01 am. i was finishing my walk with our dog, walking through our courtyard, when i saw four round spheres in a line. they were several hundred feet in the air, i would estimate 500 feet. they were in two sets of two and basically stationary while slowly rotating. one was reddish in color, the other three, gray. i tried taking a photo with my cellphone but could not focus, it wanted to focus on the contrails, much higher and behind. i ran the few steps inside my house to get my camera and tripod, but on my return 15 seconds later they were gone, disappearing from nearly directly overhead. i believe this would exclude the possibility of balloons. skies were clear with a few contrails at much higher altitude, i noticed little or no wind. no witnesses besides myself were around. i swear to the truthfulness of this sighting. in the attached photo, i have used photoshop to approximate the size, shape and location of the objects. the base photo was taken 5 minutes after the sighting. (on the attached form i stated \"10 times that of a star\" in apparent size, and also, \"1\\4 the size of a full moon,\" rather than \"aspirin\" as i chose here. i also indicated the actual size was larger than a basketball.)"],"Object Features":"None","Sighting Duration":"00:00:30","Object Flight Path":"Stationary","Region":"Georgia","Log Number":"US-09252013-0020","files":["/var/www/straped/mufon/html2text/51080.html.txt","/var/www/straped/mufon/org/51080.html"],"Source":"MUFON","Date Submitted":"09/25/2013 06:19 UTC","Case Number":"51080","Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=33.929399,+-84.38572(51080)&iwloc=A&hl=en\"> mufon case (51080) map </A>","Longitude":"-84.38572","Tags":"City","Disposition":"Unresolved","Latitude":"33.929399","Country":"United States","Weather Factors":"Unknown"}