{"Region":"Ontario","Tags":"City","Latitude":"43.183857","Object Features":"Unknown","Date Submitted":"09/25/2013 10:16 UTC","Date of the Event":"09/25/2013 08:20 UTC","files":["/var/www/straped/mufon/html2text/51088.html.txt","/var/www/straped/mufon/org/51088.html"],"Source":"MUFON","Longitude":"-79.7872","divs":["Sighting DetailsI was walking dog walking up the street facing south direction when noticed an unusual bright object in the sky at 60 degree angle. Suddenly noticed 4-5 more orange glowing spheres of similar size and speed on what appeared to be same direction of travel. Observed objects for 5 minutes. Saw other people on the street and was surprised they seemed unaware of objects in the sky. Objects were not moving at high rate of speed too slow for usual aircraft. Airplane came into this airspace at same time seemed to be following then turned and flew in opposite direction. Appeared and sounded like single engine aircraft. I felt surprised as this was highly unusual considering fairly populated area. Objects turned southeast then seemed to \"blink \" out one by one until I could no longer observe them. I usually would have cell phone with me and could have taken a video however I accidentally left it on counter at home."],"Sighting Duration":"Undisclosed","Case Number":"51088","Disposition":"Unresolved","Weather Factors":"Unknown","City":"Hamilton","Object Shape":"Sphere","Viewing Distance":"Over One Mile","Summary":"Out walking dog at 8:20 PM. Saw large glowing objet approx 5 miles away in sky. Then observed 4-5 more similar glowing objects following on same flight east to west. Objects observed for 5 minutes then turned southeast and bliked out one at a time.","Log Number":"CA-09252013-0028","map":"<A HREF = \"http://maps.google.com/maps?q=43.183857,+-79.7872(51088)&iwloc=A&hl=en\"> mufon case (51088) map </A>","Object Flight Path":"Path with directional change","Country":"Canada","trends":["There have been 15 other sightings in Hamilton","There was one other sighting in Hamilton on or around September 25th 2013"]}