{"Log Number":"US-09252013-0025","Object Shape":"Triangle","Case Number":"51085","Tags":"City","Date Submitted":"09/25/2013 09:03 UTC","Region":"Texas","Weather Factors":"Unknown","divs":["sighting detailslast sunday 9\\22\\2013, i saw, for the second time in my life, a ufo. this one was from my 2nd floor (well lit) balcony at my apt here in austin. it was roughly 9:45 p.m. here goes... i was facing due south. the object was moving in a s\\se direction. from my view it was moving about 20-25 degrees above the horizon in a downward path to the s\\se. there was no sound. i saw it for about 7 seconds. it looked far enough away that it might be over downtown. (12 miles) it stood out from the background because there were 10 lights moving in the same direction on a clear night. these lights were arranged around the perimeter of a reuleaux triangle. the area in the picture shaded orange is the shape i'm describing. for reference, i will use the apex as the bottom left corner of the image i posted. this is the direction in which all 10 lights were traveling. the lights were arranged as follows: 1 at the apex, 1 dead center, 2 close together left leading curved edge, 2 close together right leading edge, and 4 equidistant along the rear facing edge. there were \"wisps\" coming from both leading edges as though is was disturbing the atmosphere enough to make contrails that followed the same curvature as the leading edges. no, i did not have my phone on me to get a picture or video. not enough time before it was out of my field of view."],"Sighting Duration":"Undisclosed","Date of the Event":"09/22/2013 09:35 UTC","Viewing Distance":"Over 1 Mile, Unknown","Longitude":"-97.737931","Disposition":"Unresolved","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around September 22nd 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=30.268673,+-97.737931(51085)&iwloc=A&hl=en\"> mufon case (51085) map </A>","Latitude":"30.268673","Summary":"Reuleaux Triangle with 9 perimeter lights and one in the center. 10 Total. Left wispy contrails from both leading edges.","files":["/var/www/straped/mufon/html2text/51085.html.txt","/var/www/straped/mufon/org/51085.html"],"City":"Austin","Country":"United States","Source":"MUFON","Object Features":"Unknown","Object Flight Path":"Stationary,Straight-line path,Other"}