{"Disposition":"Unresolved","Source":"MUFON","trends":["There have been 15 other sightings in Hamilton","There were no other sightings in Hamilton on or around September 23rd 2013"],"Latitude":"43.133701","Object Shape":"Circle, Disc","Region":"Ontario","City":"Hamilton","Weather Factors":"Unknown","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=43.133701,+-79.872043(51081)&iwloc=A&hl=en\"> mufon case (51081) map </A>","files":["/var/www/straped/mufon/html2text/51081.html.txt","/var/www/straped/mufon/org/51081.html"],"Date Submitted":"09/25/2013 06:59 UTC","Sighting Duration":"Undisclosed","Tags":"City","Case Number":"51081","Object Flight Path":"Straight-line path,Path then hovering","Viewing Distance":"Over 1 Mile, Unknown","Summary":"Different than anything I have ever seen in the past.","Country":"Canada","divs":["Sighting DetailsI was taking my dog for a walk on an unlit pathway. I generally always look in the sky for satellites or falling stars. As I was glancing directly above I saw a light dot start streaking across the sky from nw to se. It was different than any other light I ever saw moving across the sky. It was ot unusual for me to see satellites or falling stars. Next thing I know another light dot in the same area follow across in the same path. Both dots disappeared in same direction. They were nothing I have ever witnessed About 10 seconds later as I was looking to the se I saw the same type of dots come out of different directions and meet up in the se sky. When they came together and paused for a couple of seconds then all disappeared in the se sky. These objects were well organized and the speed at which they came together was something that I have never seen before. They appeared to be well organized. I am now a true believer that something we do not understand or may never understand is out there. The organization of the dots indicates to me that they are not a natural occurrence and unless proven wrong there is more out there than what we could possibly understand. It is something that will stay with me for the rest of my life."],"Longitude":"-79.872043","Log Number":"CA-09252013-0021","Date of the Event":"09/23/2013 08:40 UTC"}