{"Disposition":"Unresolved","Weather Factors":"None","Date Submitted":"08/15/1976 11:20 UTC","Viewing Distance":"21-100 Feet, 101-500 Feet","Latitude":"29.959118","Country":"United States","divs":["Sighting DetailsMy story is true, I was not alone, two people on earth know for a fact that we are not alone. A friend and I were coming home in his 1967 camaro convertible on a clear summer night. Coming from High Springs Fl to our homes in nearby Branford we decided to stop at a river clear as spring water (Ichnetucnee ?), this was in 1976 when you could drive on either side of bridge down to waters edge to pee out of sight next to road. He drove down and turned car around so when we were done we could take right off (had to be home by 12:00). The car was 100 feet from river and each of us stood by car and when I finished I left the passenger side of car and ran down to river to get a drink, while I cupped up the water in my hands I noticed the red reflection of brake lights on the water, then realized he was still busy, that's when I turned thinking maybe another car stopped and Bam my life forever changed. Hwy 27 is a small two lane road and right in the middle of it was a red or more so of an orange craft encased in a perfect sphere of what I can only describe as energy, no sound, none just drifting over the road heading the way we were at maybe 10 miles an hour. This thing was about the size of a dumptruck 25 feet above the road. I remember this as if it just happened, I walked to the car never taking my eyes off of this craft until my friend yelled for me to get in (he was scared and in shock, I just wanted to meet who was in it). We sat there and I say HEY, lets go I want to see what this really is and he slowly pulled up the incline back to the road and now we are right behind it. The top of the car was down and I'm standing in the floorboard hanging over the windshield trying to see details through this glow, I can see structure but can make out no details (other than something is in the orange sphere),I notice the wind making tears so I duck under the windshield, then decide to see how fast we are going, trust me when I say this poor inline 6 cyl on its best day could not go 110 but thats what the speedo said and it was pegged. He's asking what is it whats inside and I say I'm not sure but it's fixing to wipe out a caution light hanging across the road and we better back off in case the cable's fly through this car, and just before it hits them it turns up and to the left so fast missing the caution light, left from where we were to making an arc folling the planet curve into nothing in 3 to 5 seconds. I'm 45 now but that night I was 16 and right then I knew this was not from here, and while I wanted to believe in ufo's, I always said if I ever see one, then maybe I would. The maybe was always because in my mind, if I ever did see anything, it would be too far away for me to be sure if it were from earth or not. That would not be the case as I learned, we followed this craft for three miles at low speed, kept the same distance from that to over 100 mph for maybe 3 mins. I said to my friend because we were both going ape over this that maybe we should not say anything more until we can write down what we each saw, and draw it also when we got home, our notes matched and then we began to talk more of it. I have only heard of a few people who descibe what I saw that night, and I believe them- now."],"map":"<A HREF = \"http://maps.google.com/maps?q=29.959118,+-82.928183(5109)&iwloc=A&hl=en\"> mufon case (5109) map </A>","trends":["There have been 2 other sightings in Branford","There were no other sightings in Branford on or around August 15th 1976","This sighting has never been favorited.",""],"Object Features":"Other","Summary":"glowing orange sphere","Case Number":"5109","Tags":"City","Object Shape":"Circle, Sphere","Sighting Duration":"Undisclosed","Longitude":"-82.928183","Source":"MUFON","City":"Branford","Object Flight Path":"Straight-line path,Path with directional change","Log Number":"US-07192006-0003","Date of the Event":"08/15/1976 11:20 UTC","files":["/var/www/straped/mufon/html2text/5109.html.txt","/var/www/straped/mufon/org/5109.html"],"Region":"Florida"}