{"Object Shape":"Cigar","map":"<A HREF = \"http://maps.google.com/maps?q=38.925168,+-84.74172(51098)&iwloc=A&hl=en\"> mufon case (51098) map </A>","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Longitude":"-84.74172","Summary":"Observed bright light and cigar shape through tree tops","Date Submitted":"09/26/2013 08:41 UTC","Object Flight Path":"Other","Case Number":"51098","Log Number":"US-09262013-0008","Latitude":"38.925168","files":["/var/www/straped/mufon/html2text/51098.html.txt","/var/www/straped/mufon/org/51098.html"],"Object Features":"Unknown","trends":["There have been 2 other sightings in Union","There were no other sightings in Union on or around September 26th 2013"],"City":"Union","Region":"Kentucky","Disposition":"Unresolved","Source":"MUFON","Country":"United States","Tags":"City","Date of the Event":"09/26/2013 07:05 UTC","Sighting Duration":"00:00:05","divs":["Sighting DetailsI took my pets outside for their restroom break. When I got outside and was standing on my porch I noticed an unusual bright blue light passing to my left (northeast) out of my peripheral vision. When I turned to look directly at the light I noticed the shape was more cigar shaped having rounded ends and a white surface color and a bright blue light circular in shape on what would be the front of the shape from my perspective. As the shape passed behind the tree tops I expected to see it come out on the other side of the trees what I saw was not the object but what I can only describe as a small point of light moving at high speed. Similar to a meteor with no tail, My initial thought was that this was something explainable and when it cleared the trees I would be able to make an identification. When the object seemed to shoot off it did make me feel a little uncomfortable and wondering if what I saw was something I could not explain. I honestly expected to see jets in pursuit and I waited for several minutes in the hopes that something would happen to make me understand what I had seen was natural. Nothing happened to make me think this was abnormal phenomena."]}