{"trends":["There have been 2 other sightings in Lexington","There were no other sightings in Lexington on or around September 26th 2013"],"Region":"South Carolina","Object Features":"Wings","divs":["Sighting DetailsI was driving home from work on rt. 378 it was 5:35 a.m. i saw the craft on the left hand side of the road hovering over the trees if i had to guess probably 400 meters away maybe more it was dark so its hard to judge. The craft was enormous compared to any i've ever seen. been on commercial jets and did some time in the military and saw a lot of ac-130s and chinooks it was much bigger than either one. if you ever go to the super walmart it was about the size of the store front looking at it where it was head on. it hovered for a good 15 minutes i could see it because the lights on it were huge as well. it was dark colored couldnt make out any markings or anything but just a general shape which was only what i could describe as a incredibly huge plane. The lights were circular yellow orange color and had something wierd to them almost like when you shine a spotlight in the rain but different maybe more like when you see dust particles in the beam of a lazer but as close as it was it was defenentily to far for me to see rain in lights (and it wasnt raining at the time either). it kept hovering after i passed it and i was so amazed but so curious i found the first road i could and turned around and sped back to where it was which wasnt far down the street i was trying to find a way to get closer to it but as soon as i got to where the trees didnt obstruct my view it shut its lights off and took off at a extremely fast pace."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.986347,+-81.229311(51097)&iwloc=A&hl=en\"> mufon case (51097) map </A>","Object Flight Path":"Hovering then path","City":"Lexington","files":["/var/www/straped/mufon/html2text/51097.html.txt","/var/www/straped/mufon/org/51097.html"],"Weather Factors":"Unknown","Date of the Event":"09/26/2013 05:35 UTC","Disposition":"Unresolved","Longitude":"-81.229311","Sighting Duration":"Undisclosed","Latitude":"33.986347","Tags":"City","Summary":"Huge hovering craft size of a medium-large building huge wings huge yellow orange lights hovered then turned lights off and left fast when i tried to get closer to it.","Case Number":"51097","Log Number":"US-09262013-0007","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Date Submitted":"09/26/2013 08:08 UTC","Object Shape":"Other","Source":"MUFON"}