{"map":"<A HREF = \"http://maps.google.com/maps?q=33.41486,+-111.967433(51099)&iwloc=A&hl=en\"> mufon case (51099) map </A>","Object Flight Path":"Path with directional change","Viewing Distance":"Over One Mile","Summary":"4 satelite type units moving in many differant directions","Region":"Arizona","Log Number":"US-09262013-0009","Object Shape":"Star-like","divs":["Sighting DetailsI started looking around the skies at 4:45 a.m. with my Bushnell 10x50 As I was looking up at exactly 5:00 a.m. a bright, small light blue object came into view directly overhead. watched it move at the normal speed of a satellite going from the south to the north where I lost it over the top of my house. Still looking around at 5:06 a.m. another object came into view. It was slightly overhead and moving from the north to the south. It was a brighter object than the one before moving much faster. It was a brighter color of bluish-white. The object flew overhead heading south where I lost it over my neighbors roof. At 5:26 a.m. I changed positions in my yard now looking mostly to the south where a larger yellowish object was moving from the south-east to the northwest but moving very very slowly. Imagine if you will just holding your binoculars steady and having the object come into view and let in go all the way through your site. It took 15 seconds for the object just to move that far which by any standards is quite slow. I picked this object up at around 45 degrees above the south-eastern horizon and watched as it went behind my tree where it never popped out the other side. I got up and looked around but could not distinguish it from all the stars. At 5:31 a.m. as I was searching for that last object, an extremely bright yellowish and much larger object came into view from behind the same tree moving quite fast from the south-west towards the north-east. It moved out of site with in 30 seconds where I lost it over the horizon. These last 2 objects could be the same only if the first one stopped for a few minutes which is possible but I can not prove this. Although where I first noticed this object would have been very close to where I lost the other object behind my tree except it was now moving to the north-east rather than the object before which was moving towards the north-west. There were no airplanes or any other flying objects in the skies at this time."],"Source":"MUFON","Disposition":"Unresolved","Date Submitted":"09/26/2013 12:00 UTC","trends":["There have been 417 other sightings in Phoenix","There was one other sighting in Phoenix on or around September 26th 2013"],"files":["/var/www/straped/mufon/html2text/51099.html.txt","/var/www/straped/mufon/org/51099.html"],"Longitude":"-111.967433","Date of the Event":"09/26/2013 05:00 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","City":"Phoenix","Latitude":"33.41486","Tags":"City","Object Features":"Unknown","Country":"United States","Case Number":"51099"}