{"trends":["There have been 3 other sightings in Canandaigua","There were no other sightings in Canandaigua on or around October 15th 1970"],"Viewing Distance":"21-100 Feet","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/51109.html.txt","/var/www/straped/mufon/org/51109.html"],"Date of the Event":"10/15/1970 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.887535,+-77.281698(51109)&iwloc=A&hl=en\"> mufon case (51109) map </A>","Tags":"City","Object Shape":"Boomerang","City":"Canandaigua","Case Number":"51109","Sighting Duration":"Undisclosed","Longitude":"-77.281698","Object Features":"Patterned Surface","Latitude":"42.887535","Weather Factors":"Unknown","Region":"New York","Object Flight Path":"Straight-line path","Country":"United States","Date Submitted":"09/26/2013 11:25 UTC","divs":["sighting detailswhile traveling eb on a rural road in upstate ny in the fall of 1970 i observed something coming at me ( wb) just above the power lines ( about 60 ft) my wife and my 2 1\\2 y\\o son were with me. as i slowed down and pulled of to the shoulder, the ufo was in front of me but going only about 15 mph in the opposite direction (wb) i stepped out of the car and observed a rust colored, flying wing shape ( or boomerang) craft just above the power lines ( about 50 ft ) it had lights but i do not recall what color or how many. my wife was now yelling at me to get back in the car. i did not. i watched as it passed over emitting no sound. as i turned to look at it going wb, it disappeard in about 1 second emitting no sound whatsoever and was gone in \" blink of an eye' . i should have reported in in 1970 but back then it would have been ridiculed. i am much wiser now and truly believe in ufo's. there is just too much evidence to just look the other way. thank you for your time. rr butler"],"Source":"MUFON","Log Number":"US-09262013-0019","Summary":"appeared slightly over the power lines. rust colored,boomerang shaped,ribs apparent,disappeared w/b with no sound. about 40 ft wingspan."}