{"map":"<A HREF = \"http://maps.google.com/maps?q=34.809164,+-111.781516(51101)&iwloc=A&hl=en\"> mufon case (51101) map </A>","Country":"United States","files":["/var/www/straped/mufon/html2text/51101.html.txt","/var/www/straped/mufon/org/51101.html"],"Longitude":"-111.781516","divs":["sighting detailson september 21, 2013 @ approximately 1815 hours mountain time, in the village of oak creek, sedona az, on a clear warm evening in a no cloud sky, a large, white glowing barbell type object hovered in the south western section of the sky (approximately 10 or 15 degrees west of the large, flat southern mesa behind the big park grade school). though the object was only at a +\\- 1000 foot altitude it hovered in the same spot for a period of about 20 to 30 minutes and made no noticeable noise. i was able to take three photos of the object and as soon as i can figure out how to download the jpegs from my droid to my pc i will forward the pictures to anyone who might express an interest in seeing them. unfortunately, at the time i was unable to continue watching the object or see it arrive or depart so my estimation of 20 to 30 minutes was the amount of time i was able to view and photograph it. though i am now retired from the military i have flown and parachuted from a great number of aircraft as well as having worked in the gemini program as part of a crew in retrieving the bell shaped capsules in in the south china sea; therefore, from this and other past sightings and photos and videos i have taken i believe i know what flies and is not ours as well as what we are still not capable of. going out on a limb i don't believe this is one of ours unless it was designed and came from a future earth date and site!"],"Log Number":"US-09262013-0011","Weather Factors":"Unknown","Object Flight Path":"Stationary","Case Number":"51101","Latitude":"34.809164","Object Shape":"Sphere","Sighting Duration":"00:30:00","trends":["There have been 47 other sightings in Sedona","There were no other sightings in Sedona on or around September 21st 2013"],"City":"Sedona","Date Submitted":"09/26/2013 02:14 UTC","Tags":"City","Object Features":"None","Summary":"I viewed a barbell or two round bright white lit balls in the VOC of Sedona AZ","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Date of the Event":"09/21/2013 06:15 UTC","Region":"Arizona"}