{"Region":"Michigan","Object Flight Path":"Path with directional change","Longitude":"-83.75568","Source":"MUFON","Tags":"City","Viewing Distance":"21-100 Feet","Summary":"White, round and changed size","Date Submitted":"09/26/2013 01:05 UTC","Disposition":"Unresolved","Object Shape":"Circle, Other","trends":["There have been 40 other sightings in Flint","There were no other sightings in Flint on or around September 26th 2013"],"Latitude":"43.046897","Country":"United States","Log Number":"US-09262013-0010","Sighting Duration":"Undisclosed","Date of the Event":"09/26/2013 07:43 UTC","files":["/var/www/straped/mufon/html2text/51100.html.txt","/var/www/straped/mufon/org/51100.html"],"Object Features":"None","divs":["Sighting DetailsI was driving down the road and it was foggy I was 50 feet from the red light when I noticed another driver stopped in the road 45 feet before the light. I looked straight ahead and saw what I would describe as a white circle shape, like the moon and I thought to myself \"oh the sun is coming up\". But the sun was two feet above the ground, right in front of my car. I picked up my phone to take a picture and the light shot to the left, and my smart phone started going through the different apps. I pulled over into a parking lot and the light stopped, so I took a picture. As I was watching the light I had a sense that it was watching me. I was able to take a quick right turn and what ever it was turned and flew directly over my car. There are tree's and buildings on the road so the object had to be low to the ground to fly directly over my car. At that point it looked to be orange in color and I started to see spots like being blinded by a light. I drove to two more different locations,and still saw the object. The sun started to shine and it just flew off. I never would have thought anything about the experience had it not been two feet from the ground, flew over my car, and changed directions as I did. And changed from what appeared to be four feet to get larger as it flew higher in the sky. When it was in front of my car it looked like a solid white mass.The person in the other vehicle turned left on a red light to get out of the area."],"map":"<A HREF = \"http://maps.google.com/maps?q=43.046897,+-83.75568(51100)&iwloc=A&hl=en\"> mufon case (51100) map </A>","Weather Factors":"Unknown","City":"Flint","Case Number":"51100"}