{"Object Features":"Undisclosed","trends":["There have been 47 other sightings in Montreal","There were no other sightings in Montreal on or around July 19th 2006","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=45.51826,+-73.551312(5110)&iwloc=A&hl=en\"> mufon case (5110) map </A>","Weather Factors":"Unknown","Date Submitted":"07/19/2006 12:10 UTC","Longitude":"-73.551312","Country":"Canada","Case Number":"5110","Tags":"City","City":"Montreal","Log Number":"CA-07192006-0004","Sighting Duration":"Undisclosed","Date of the Event":"07/19/2006 12:10 UTC","Source":"MUFON","Viewing Distance":"Unknown","Region":"Quebec","files":["/var/www/straped/mufon/html2text/5110.html.txt","/var/www/straped/mufon/more/5110_submitter_file1__3.jpg","/var/www/straped/mufon/more/5110_submitter_file2__11.jpg","/var/www/straped/mufon/more/5110_submitter_file3__1.jpg","/var/www/straped/mufon/org/5110.html"],"Object Shape":"Unknown","Latitude":"45.51826","divs":["Sighting DetailsI cannot say for certain what \"shape\" this object or obtects were as it was quite high in the night sky, though it did appear to move from left to right like a moderate game of pong. I was initially sitting on my front deck having a cigarette (my girlfriend forbids me to smoke inside) and I was trying to count the number of stars I could see - for the record, I counted less than a dozen, as here in Montreal the city lights prevent us from seeing many stars at all. Above a large building directly across the street from our condo, I noticed a larger and significantly brighter light to the left of where I was looking (about a 10 O'clock from my perch and above the large building). I assumed for about 10 minutes that it was a plane as there are several planes seen flying in that direction daily. It ttkes about 7 minutes for me to smoke one cigarette and in that time the light remained in that general area in the sky though it had moved left and right and visibly so. I thought perhaps it were a star \"flickering\" as stars are known to do but this particular light seemed to \"dance\" - up, down and around, then left and right again. I honestly can't tell you even an estimate of altitude, sorry, I'm not a good judge of distance. I finished my cigarette and stepped back into the house to ask my girlfriend to come look at the \"funky light\". Her immediate assumption was \"It's a star\". I told her to look at it - watch it closely and she then noticed as well that it appeared to be dancing about. My girlfriend ran into the house to grab a camera (Kodak Z740, Digital) and began clicking photos. I have all of those photos if you'd like to see them. I attempted to video the light but my camera did not function. I really can't describe any \"feelings\". I see lights in the sky often but nothing ever looked like this. As I write this now however, I'm wondering only if anyone else has or will report similar sighting(s) from this area. I'm no photo expert, nor am I a camera expert. THe 3 images I've included here are what my girlfriend took with her camera. From what she's told me, she's lightended or enhanced them somewhat. We still have the originals, and full sizes and there are many others if you need them. Thanks, Todd Langseth"],"Summary":"unable to determine the shape of this object. Moving left to right, up/down and pulsating slightly.","Object Flight Path":"Undisclosed","Disposition":"Unresolved"}