{"Summary":"Orange Reddish Sphere moves in single direction and blinked out","divs":["sighting detailsorange reddish ball was seen gliding from southeast to northwest. smooth motion without any strange movement. stayed in single path. moving in one direction in fairly slow to moderate pace but bit faster than the satellite would be. display strong glare yet continue to shine brilliantly. toward to ending of its trajectory, it dimmed and appears to blinks out before completely disappears without any sign or trace of its existence or flight path. i can confirm it is not asteroid or satellite or plane or even meteorite breaking into our atmosphere. it was static object moving in what seem to be predetermined flight path. i couldn't see when it appears first as the tree was blocking my view, however, i was able to recognize it as unusual object before moving into clearing and had direct view of the glowing orange reddish sphere\\ball. the sky condition was extreme clear and crisp, this occurred at my backyard where i was able to observe the night sky pretty regular and i am familiar with frequent flight paths, although, this object had caught me off guard with bizzare light and traveling in a path where the planes and satellite never comes across. i've also witnessed an asteroid breaking up in an entry and saw it breaks into smaller pieces and what i observed tonight was nothing like it. before this sighting, when i first came outside during 2340-2345h on 26th, to enjoy the nice stargazing weather, i immediately recognized orange reddish streak escaped my view before i was able to identify it. i believe it was the same object which i observed later in the hour."],"Country":"United States","Latitude":"38.968477","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.968477,+-76.797815(51112)&iwloc=A&hl=en\"> mufon case (51112) map </A>","Log Number":"US-09272013-0003","Viewing Distance":"501 Feet - 1 Mile","Case Number":"51112","Object Shape":"Sphere","trends":["There has been one other sighting in Bowie","There were no other sightings in Bowie on or around September 27th 2013"],"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/51112.html.txt","/var/www/straped/mufon/org/51112.html"],"Longitude":"-76.797815","Source":"MUFON","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Region":"Maryland","Date of the Event":"09/27/2013 12:00 UTC","Object Features":"None","Date Submitted":"09/27/2013 12:48 UTC","City":"Bowie","Weather Factors":"Unknown"}