{"Source":"MUFON","divs":["Sighting DetailsI was on the back porch watching the sky because 48 hours earlier I seen a huge boomerang shaped UFO fly over from the north to the south at incredible speed. I reported it to MUFON and filled out a report. After that sighting I was informed that there has been a rash of sighting around Denver and Colorado. So I planned on staying up this night to see if I could see this object again, to confirm to my self I wasn't nuts I guess. My back porch faces the west and can see straight up 90 degrees, north and south vary well. So I set down in a chair that was facing north, my head laid back looking straight up, so I could see up, westernly and north vary well. I was a good coverage of view. I was clear and star's were shining. I was vary nice out. I seen a few meteor's go by, that passed the time well. At 1:05 am I was staring straight up and there is was again, the same craft from 48 hours earlier, and this time I was ready. Huge, boomerang shaped, looked like around eight lights on the leading edge, but faint like the other one. All white, no marker light like a airplane has, red and green. Only white but faint. Holding my fist out it was as wide as my fist and arms length and moving extremely fast from south to north heading right over Denver. Because I was out to see if it came again like before, I could make out more of it. I could see a black shape this time kinda like the B-2 stealth bomber but over 10 times the size. And not a sound. And it was nearly straight over head. I can hear commercial jets fly over at 30,000 feet and hear them but not a sound from this craft. By judging the altitude by the lights and outline she was up quite a few thousand feet, over 5000 it would seem. But moving that fast and out of sight with in probably 4 seconds, It should have been over the sound barrier, and again, no sound. I lost site as it moved towards downtown. Well I know i'm not nuts now. Twice in 48 hours I seen the same craft.. After all these years I finally know, we are not alone. I know this and would swear by this fact now."],"Weather Factors":"Unknown","Object Shape":"Boomerang","Case Number":"51115","files":["/var/www/straped/mufon/html2text/51115.html.txt","/var/www/straped/mufon/org/51115.html"],"Region":"Colorado","trends":["There have been 185 other sightings in Denver","There was one other sighting in Denver on or around September 27th 2013"],"Date of the Event":"09/27/2013 01:05 UTC","Tags":"City","Log Number":"US-09272013-0006","Viewing Distance":"Unknown","Longitude":"-104.891806","Object Features":"Unknown","Date Submitted":"09/27/2013 06:39 UTC","City":"Denver","map":"<A HREF = \"http://maps.google.com/maps?q=39.666347,+-104.891806(51115)&iwloc=A&hl=en\"> mufon case (51115) map </A>","Summary":"Boomerang shaped craft moving from south to north over Denver","Object Flight Path":"Straight-line path","Latitude":"39.666347","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Country":"United States"}