{"Date Submitted":"09/27/2013 11:49 UTC","Date of the Event":"09/26/2013 08:40 UTC","Disposition":"Unresolved","Log Number":"CA-09272013-0012","Viewing Distance":"Unknown","Object Features":"Other","Summary":"Bright light in sky.","Case Number":"51121","Tags":"City","trends":[],"Object Shape":"Star-like","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/51121.html.txt","/var/www/straped/mufon/org/51121.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=64.825544,+-124.845733(51121)&iwloc=A&hl=en\"> mufon case (51121) map </A>","Region":"Northwest Territorie","Longitude":"-124.845733","Weather Factors":"Unknown","Source":"MUFON","Latitude":"64.825544","City":"Undisclosed","divs":["Sighting DetailsI was leaving work, and looked int to the dusk night sky and observed what looked like a shooting star, it was very brief. It was at this point I noticed a very bright light in the sky. It looked almost like an airplane with it's landing lights on except there were no coloured flashing indicator lights, just this very bright light. It was moving very slowly from the eastern sky and moving in a NWN direction. My next thought was it is a satellite, but it was far to bright, large and moving in the wrong direction. I watch this object for App. 5 min. the light never changed in intensity, but it did speed up and then just faded away. A couple of points. 1 This all took place in the in the eastern sky, had this been a satellite in low orbit. I would have been able to follow it across the to the northern sky. this did not happen. it faded away while still in the eastern sky. 2 traveling in a NWN direction, this object should have been dim and gained in intensity as it traveled closer to the setting sun, but it did just the opposite. 3. I have not observed ( could be wrong about this) or know of a satellite that travels in a NWN direct. either way a very cool experience, I'll be looking in the night sky again tonight, if I see the same thing at the a=same time, then it is most likely just a satellite."],"Country":"Canada"}