{"Object Shape":"Unknown","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Features":"None","files":["/var/www/straped/mufon/html2text/51138.html.txt","/var/www/straped/mufon/org/51138.html"],"Date of the Event":"09/27/2013 09:20 UTC","Country":"United States","Viewing Distance":"Unknown","Log Number":"US-09282013-0005","Longitude":"-121.6285","Disposition":"Unresolved","Region":"California","Tags":"City","Summary":"I was looking up and the white light appeared just like and the same intensity of the surrounding stars. At first I was like, \"what a strange plane because there were no red or green light. I waited and watched it going across the sky to see if it would b","Date Submitted":"09/28/2013 02:23 UTC","City":"Yuba City","divs":["Sighting DetailsI was looking up and the white lights appeared just like and at the same intensity of the surrounding stars.I noticed them because they were moving slowly across my field of vision rather slowly and I wondered how a plane could move that slow and still be in flight. At first I was like, \"what a strange plane because there were no red or green light. What I noticed was a darker field between two star-like lights that was moving slowly across the sky. Much slower than a commercial aircraft or satellite. I waited and watched it going across the sky to see if it would blank out some of the stars so I could get a better idea of how big it was. Well it was just about to cross over a star field when the darn thing just disappeared into the black. The object moved with a steady rate and did not seem to turn. It was moving gradually across from north to the northeast from my point of view. It was amazing to watch the craft disappear as it appeared as if the white lights of low intensity progressively became smaller, as if they were moving straight up and away from my view. Then they either where turned off, or where too far away for me to see them."],"trends":["There have been 10 other sightings in Yuba City","There were no other sightings in Yuba City on or around September 27th 2013"],"Latitude":"39.176307","map":"<A HREF = \"http://maps.google.com/maps?q=39.176307,+-121.6285(51138)&iwloc=A&hl=en\"> mufon case (51138) map </A>","Object Flight Path":"Straight-line path,Other","Source":"MUFON","Case Number":"51138"}