{"Latitude":"42.056739","Longitude":"-70.178319","Case Number":"51133","Object Features":"Wings, Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.056739,+-70.178319(51133)&iwloc=A&hl=en\"> mufon case (51133) map </A>","Weather Factors":"Unknown","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Summary":"Standing near Commercial St. In Provincetown waiting for bus to Truro. Looked up toward Pilgrim Tower in town and noted BRIGHT blue light hovering with little lateral movement visually close to tower, but clearly a sig. Distance out over the ocean .","Log Number":"US-09272013-0022","Date of the Event":"09/14/2013 08:25 UTC","Date Submitted":"09/27/2013 11:18 UTC","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/51133.html.txt","/var/www/straped/mufon/org/51133.html"],"Object Shape":"Triangle","Sighting Duration":"Undisclosed","trends":["There have been 3 other sightings in Provincetown","There were no other sightings in Provincetown on or around September 14th 2013"],"Object Flight Path":"Hovering then path","divs":["sighting detailswaiting for 8:30 bus to truro (back to our condo at a place called sand castle) along with roughly 30 tourists, primarily. had movie camera in hand. little boy asked his father what it was he was looking at in the sky, toward p-town's historic pilgrim tower, perhaps 500 yards away, and appearing to be floating next to the tower, an extremely bright, light blue light. though the illusion was that the object was close to the tower, i believe it was probably 1\\4 of a mile out over race point and the ocean (near the absolute tip of the cape. everyone in sight was visually locked onto the object....guessing what it was...copter, blimp, kite, drone, etc....where it was or seemed to be, it was none of those things. that was quite clear to every adult i spoke with over the few minute we watched. i took a still of the event, one linute or two long video, and a couple of other seconds long clips. the bus driver stated that we should all get on the bus because he was leaving. i tried to film one more time out the window, but the object moved quickly off toward the wsw and was gone. we went back to the condos and the adults stood in the parking lot scanning the sky for one more look (no dice) and anylizing our collective experience. one party suggested we were all fooled by someone. a couple of others thought we had seen a copter....the silent kind. the majority thought that we had all seen a ufo, and i agreed. we have come to provincetown to our timeshare for many years, as have many of the other observers. most had never seen anything like it before, though i had...in vermont years ago. i checked the paper each day, but heard nothing. nobody reported it, i believe because we were all \"tourists\" for lack of a better reference. i too at first thought i was seeing a copter, but i know how far away you can hear them, how they move , where they might and might not be. i pretty quickly, along with many others, thought i was looking at a ufo. i have shown many other coworkers and friends the brief film and, given the way the thing moves, most agree that it is not identifiable. i will e the clip separately as i know no other way to do it."],"Source":"MUFON","City":"Provincetown","Region":"Massachusetts"}