{"map":"<A HREF = \"http://maps.google.com/maps?q=40.968019,+-76.88153(51131)&iwloc=A&hl=en\"> mufon case (51131) map </A>","Log Number":"US-09272013-0020","trends":["There have been 2 other sightings in Lewisburg","There were no other sightings in Lewisburg on or around September 27th 2013"],"Region":"Pennsylvania","City":"Lewisburg","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Source":"MUFON","Summary":"Observed 3 ufos in triangular formation followed a few minutes later by two more. All had only bright orange front light strobing side-to-side. All were somewhat slow-moving and silent.","Country":"United States","files":["/var/www/straped/mufon/html2text/51131.html.txt","/var/www/straped/mufon/org/51131.html"],"Date of the Event":"09/27/2013 09:16 UTC","Viewing Distance":"Over One Mile","Object Shape":"Unknown","Tags":"City","Latitude":"40.968019","Date Submitted":"09/27/2013 10:14 UTC","Object Flight Path":"Straight-line path","Case Number":"51131","Longitude":"-76.88153","divs":["Sighting DetailsRiding in an SUV, going west on Rte 45 between Rte 15 and Bull Run crossing in Lewisburg, PA, I noticed three large, bright, orange lights in a triangular formation moving across the sky. They seemed kind of low in the sky to my initial view. I had heard of the large, delta-shaped craft that has been reported by many people, and wondered if this could be it. Never having seen anything like it, I asked the driver to pull over quickly so we could see what it was. We pulled over and parked in a lot, and got out to observe. It became clear that there were three separate craft (since we could see the sky and stars between them). Each craft had a bright orange (not amber - clearly orange) light at its front. The light on each was sweeping side to side (not downward) as the craft moved forward. We could not see the size of each craft, since only the orange light was visible on each - no other colors, lights, or reflections. The craft made no sounds. The craft did not stay in the same exact triangular formation (but did stay in triangular relationship to one another) as they moved over us, from NE to SW. A minute or two later, two more craft of the exact same description were seen; same characteristics, same sweeping light, same directions. I tried to observe through small binoculars, but they provided no further detail. One of us had a camera and took a few photos - not sure yet how they came out. One of us is ex-military (Navy Seal, Vietnam era). We were all excited and very curious about what we were seeing. I wondered why the craft had no other lights besides the one described above; I wondered if they could be searching the sky for some other craft; I wondered, since they were silent, if they could be some kind of stealth military craft. We lost sight of the objects as they moved SW, out of our field of vision."],"Object Features":"Unknown","Weather Factors":"Unknown"}