{"Weather Factors":"Unknown","Object Features":"Unknown","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/51146.html.txt","/var/www/straped/mufon/org/51146.html"],"Region":"North Carolina","map":"<A HREF = \"http://maps.google.com/maps?q=36.128111,+-80.323899(51146)&iwloc=A&hl=en\"> mufon case (51146) map </A>","Date of the Event":"09/27/2013 07:54 UTC","Tags":"City","Log Number":"US-09282013-0012","Object Shape":"Sphere, Star-like","Date Submitted":"09/28/2013 11:40 UTC","Country":"United States","City":"Winston-Salem","Viewing Distance":"101-500 Feet","Longitude":"-80.323899","Object Flight Path":"Hovering then path","Summary":"Six starlike objects observed grouped together, then started moving","Latitude":"36.128111","Sighting Duration":"Undisclosed","trends":["There have been 31 other sightings in Winston-Salem","There were no other sightings in Winston-Salem on or around September 27th 2013"],"Case Number":"51146","divs":["Sighting DetailsLast night, September 27, 2013, I left my home with a friend, to go get some wine at the grocery store. As we were leaving the parking lot I noticed up in the sky, directly in front of us, just above the treetops and in the distance over the downtown area, a group of six bright orange starlike objects. They were grouped close together and appeared to be hovering. My friend saw them also and I stopped the car while still in the parking lot to watch the lights. They did not appear to be planes and had no blinking lights on them. They started moving slowly and heading in our direction. Three of them moved to form a line and the other three stayed grouped together as they started moving closer. My house was very near so I told my friend I would hurry and get my camera as soon as we got to the house. I looked at the clock in the car and it was 7:54pm and we were looking southeast towards the objects. I kept an eye on the lights as best as I could while making the less than two minute drive to my house. I stopped again at one point as one of the lights was going over us. It was ahead of the others. It had no navigation lights; was just a steady orange light moving across the sky in a straight line. I knew I would not have time to get my camera at this point so I pulled into my garage and ran back outside. I was just in time to see another one of the lights coming. There was also a small airplane in the distance heading in the opposite direction of the light. Whoever was in that plane had to have seen the orange lights. Then, as it got closer the light started dimming slightly and just as it got directly over my house, it disappeared entirely. I kept looking, thinking I might see navigation lights, but there was nothing; it was gone. I waited also for the other lights to come over because I knew there were more, but they never came. It was a clear night and the stars were out. I could see no clouds in this part of the sky. I see a lot of planes where I live and I have never seen anything like this in particular, especially the way they were grouped together and the orange color. The lack of navigation lights, sound, and the way it just disappeared, was also unlike any plane I have ever seen since I have lived here. The only thing I felt was that the lights were unusual."],"Source":"MUFON"}