{"divs":["sighting detailson september, 26th i was out for a walk around 00h30 because i couldn't sleep. i was at the top of a hill in the park by my house and i noticed a bright white\\red light in the sky that was in the direction of my house. at first i thought nothing of it because i often seen planes and satellites around my area. but when i realized the speed that it was travelling i started to wonder if it could be a ufo. i sat down on some bleachers and just watched the object. it continued in a straight path with an eastward direction; it continued in this path for about a minute. after about a minute it stopped abruptly and started to ascend. it was ascending for about a minute then it vanished. this is not the first time i have seen an object with similar characteristics. two weeks prior to this i saw an object that was similar. it was hovering for a moment, started to ascend and then it vanished. there is one other occasion where i can remember seeing an object like this, i was much younger (around 10 or 11) and i was sitting in my families hottub. in between two trees i saw a light travelling in my direction the it stopped i looked away for just a second and when i redirected my attention back to the area that i saw it, it had vanished."],"map":"<A HREF = \"http://maps.google.com/maps?q=44.347598,+-79.662266(51148)&iwloc=A&hl=en\"> mufon case (51148) map </A>","Tags":"City","City":"Barrie","Date Submitted":"09/28/2013 03:46 UTC","Case Number":"51148","Object Flight Path":"Path with directional change","Summary":"I was walking in the park by my house when I saw a bright red/white light.","Latitude":"44.347598","Source":"MUFON","Country":"Canada","Log Number":"CA-09282013-0015","Sighting Duration":"Undisclosed","Date of the Event":"09/26/2013 12:00 UTC","Viewing Distance":"Unknown","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/51148.html.txt","/var/www/straped/mufon/org/51148.html"],"Region":"Ontario","Disposition":"Unresolved","Longitude":"-79.662266","Object Shape":"Circle, Sphere","Object Features":"None","trends":["There have been 9 other sightings in Barrie","There were no other sightings in Barrie on or around September 26th 2013"]}