{"Disposition":"Unresolved","Longitude":"-92.967816","divs":["Sighting DetailsAt our rural home in our field. My son ran in and said come now there are strange lights outside. There were 3 lights to our left across sky kind of NW triangle blinking in a pattern. Directly north (in front of us) another set of 3 lights triangle blinking in a pattern also. We looked over to right which would be somewhat east and there was just 1 light. Can't remember if it blinked or not. None of the lights seemed to move, they were just in same spot. They blinked on and off kind of in a stair step pattern. Appeared to be either white or maybe kind of amber in color. There were 3 of us that watched them for about 30 mins. I got scared so we went in house. The lights were still there when we went in. The one to the north in front of us I thought was drifting towards us but I really don't think it was. I was more scared than anything and probably appeared to be doing that. That is when I said take me to the house now. My same son has seen these lights before one time in the Climax Springs Missouri (not far from Macks Creek area). We called Whiteman Air Force base and asked if any planes were out and they told us no. They could have not been flares. The lights never moved the whole time we watched them. They stayed in the same spot. I probably wrong on the date seen, I just can't remember."],"Summary":"3 amber lights triangle blinking in pattern north, 3 lights same to left alittle ways, to right 1 light by itself","Source":"MUFON","Object Features":"None","Object Flight Path":"Stationary","Date Submitted":"09/28/2013 04:06 UTC","Object Shape":"Triangle","trends":["There have been 2 other sightings in Macks Creek","There were no other sightings in Macks Creek on or around September 21st 2011"],"Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","City":"Macks Creek","Region":"Missouri","Log Number":"US-09282013-0016","Date of the Event":"09/21/2011 09:00 UTC","Tags":"City","Latitude":"37.972613","Case Number":"51149","Country":"United States","Sighting Duration":"00:30:00","map":"<A HREF = \"http://maps.google.com/maps?q=37.972613,+-92.967816(51149)&iwloc=A&hl=en\"> mufon case (51149) map </A>","files":["/var/www/straped/mufon/html2text/51149.html.txt","/var/www/straped/mufon/org/51149.html"]}