{"Date of the Event":"09/28/2013 04:30 UTC","Disposition":"Unresolved","Source":"MUFON","Tags":"City","Object Shape":"Boomerang","Weather Factors":"Unknown","City":"Lexington","Date Submitted":"09/28/2013 01:59 UTC","Object Flight Path":"Stationary","Country":"United States","divs":["Sighting DetailsI went out on my carport to smoke, and noticed what I thought was a very bright twinkling star, so I watched it for several minutes, and then I saw blue, green, red and sometimes orange lights. I told myself, I've never seen a star do that. I watched it and it seemed its movement was like wobbling..it never streaked across the sky, it seemed to move very slowly up and down, and side to side...very small movements, nothing drastic. I pinpointed my position with a landmark so I could look again the next night to see if I was observing a star, so I called my friend, and she also observed this object and felt like it was something unexplained..I stood on my landmark to see if it had moved, and I noticed it was not located in the same place in the night sky...it had moved further north. This object was in the sky for at least 2 hours. I tried to video it, but I could not pick it up on my camera. I also woke my husband up, and he observed this strange thing in the sky also....I don't know what it was, but its very exciting to think I may have witnessed something not from our world. I can't wait to check the night sky tonight."],"Summary":"It was very bright, twinkled, had blue, red, green, and white lights..it hoovered,","Viewing Distance":"Unknown","Log Number":"US-09282013-0014","Case Number":"51147","trends":["There have been 3 other sightings in Lexington","There were no other sightings in Lexington on or around September 28th 2013"],"Object Features":"Unknown","Longitude":"-80.214781","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.910049,+-80.214781(51147)&iwloc=A&hl=en\"> mufon case (51147) map </A>","Region":"North Carolina","files":["/var/www/straped/mufon/html2text/51147.html.txt","/var/www/straped/mufon/org/51147.html"],"Latitude":"35.910049"}