{"Date of the Event":"09/28/2013 10:02 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.979096,+-122.270823(51159)&iwloc=A&hl=en\"> mufon case (51159) map </A>","trends":["There have been 7 other sightings in Richmond","There were no other sightings in Richmond on or around September 28th 2013"],"Source":"MUFON","Summary":"Two flashing lights; one light disappeared with a drop, reappeared suddenly from below, disappeared with drop again, reappeared from below again.","Object Features":"Unknown","Log Number":"US-09292013-0002","Viewing Distance":"Over One Mile","Country":"United States","City":"Richmond","Weather Factors":"Unknown","Longitude":"-122.270823","Date Submitted":"09/29/2013 01:39 UTC","Region":"California","Case Number":"51159","Latitude":"37.979096","files":["/var/www/straped/mufon/html2text/51159.html.txt","/var/www/straped/mufon/org/51159.html"],"Object Flight Path":"Stationary,Path with directional change","Disposition":"Unresolved","Sighting Duration":"Undisclosed","divs":["sighting detailsi stepped out of my back door and noticed 2 reddish lights in eastern sky beyond hills. possibly over orinda or san pablo reservoir. maybe 15 degrees above horizon from our vantage point. one directly above the other. they were stationary then the light on the bottom dropped and disappeared. about 30 seconds later it suddenly reappeared, looking like it suddenly shot upwards. the bottom light then started to move towards the se while the top light remained stationary. the bottom light again reappeared as if it was shot upwards. it continued moving se. at this time the top light began to move se as well. both lights dimmed and disappeared. there were some low clouds in the sky. too distant and too much light interference to capture with our camera. we typically see plane lights in the horizon but these didn't have the blue\\red blinking lights we are used to. my 8 year old son also partially witnessed the event. the way the light dropped out of the sky and then reappeared is what makes this seem odd."],"Object Shape":"Star-like","Tags":"City"}