{"Object Features":"Unknown","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=43.96528,+-78.293027(51154)&iwloc=A&hl=en\"> mufon case (51154) map </A>","Summary":"A very slow moving disk shaped something seeded to be on fire","City":"Port Hope","files":["/var/www/straped/mufon/html2text/51154.html.txt","/var/www/straped/mufon/org/51154.html"],"Sighting Duration":"Undisclosed","trends":["There have been 2 other sightings in Port Hope","There were no other sightings in Port Hope on or around September 28th 2013"],"Longitude":"-78.293027","Source":"MUFON","Disposition":"Unresolved","Viewing Distance":"Unknown","Country":"Canada","Object Shape":"Disc, Fireball, Unknown","divs":["Sighting DetailsOn September 28th 2013 at approximately 7:40pm, I was standing in my backyard having a bonfire with my two children, my husband went inside our house to change his clothes after spending the day working on building a deck with a friend. Our friend had left but came back when he realized he forgot something, as he walked back into the yard he yelled to me \"SARAH! LOOK AT THE SKY! DO YOU SEE THAT? WHAT IS IT? As I looked up the \"UFO\" was right above me, I saw a very round, disk like, object that was moving very slowly,it appeared as though there was fire coming out of the bottom. I called to my husband to come out and see, then the three of us watched for approximately two minutes as it slowly moved across the sky. As we attempted to understand what we were witnessing at that moment, the best we could come up with was that an airplane one fire, that idea quickly faded when we noticed how slow it was going, the disk like shape, the redness of it, what appeared to be fire and the ominous glow projecting from it as well as the fact that we went inside checked the internet, TV and radio for the next hour to see if we heard anything about it. The object continued on a straight path North West, moving away from all major military bases and airports in the area,very slowly until we lost sight of it. Both my husband and I well as our friend were in disbelief at first as we tried to make sense of what we had just witnessed, our first thoughts were to go inside and see if we could find out any information, after doing some research and finding out nothing we have become convinced beyond a doubt that we witnessed a U.F.O. Thank-you."],"Case Number":"51154","Date of the Event":"09/28/2013 07:40 UTC","Date Submitted":"09/28/2013 10:06 UTC","Latitude":"43.96528","Region":"Ontario","Log Number":"CA-09282013-0021","Tags":"City"}