{"Object Flight Path":"Hovering then path","Case Number":"51155","files":["/var/www/straped/mufon/html2text/51155.html.txt","/var/www/straped/mufon/org/51155.html"],"Region":"New Jersey","Log Number":"US-09282013-0022","Weather Factors":"Unknown","divs":["Sighting DetailsMyself and three others were driving home from a family members house and when entering Rt 130 south in Bridgeport, NJ I noticed something odd in the sky. There were about 8 solid lights in the sky. There was no apparent shape but they did move very slowly and simultaneously through the sky. There were some trees that we had to look through so I asked the driver to drive down the road some and pull over. We saw the lights in the sky with no obstruction and I tried to video tape it with her cell phone but I couldn't focus on them. We were all in shock of what we were seeing. There was no way that these were planes or helicopters. They were silent and too close together. Then they disappeared. I call my other sister-in-law and told her we just saw a UFO and she laughed at us. She then looked up on her phone if anyone else has ever reported this before and she found so many sights describing this same event and some had videos. When I got home I went to the sights she sent us and instantly got the chills when I watched the video from AZ. These were the lights we just saw. I have no doubts about what we just witnessed. Oh and she stopped laughing at me and has been sending me more and more sights about these mysterious lights. Crazy!"],"Sighting Duration":"00:06:00","Latitude":"39.805546","Date Submitted":"09/28/2013 10:33 UTC","Source":"MUFON","Viewing Distance":"Over One Mile","Longitude":"-75.338662","Tags":"City","Object Shape":"Sphere","Date of the Event":"09/28/2013 09:11 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.805546,+-75.338662(51155)&iwloc=A&hl=en\"> mufon case (51155) map </A>","Object Features":"None","Country":"United States","trends":["There have been no other sightings in Logan Township","This sighting has never been favorited."],"Summary":"About 8 round orange lights hoovered in the sky moving slowly and simultaneously for at least 5 minutes the disappeared","City":"Logan Township","Disposition":"Unresolved"}