{"Date Submitted":"07/15/2006 10:14 UTC","divs":["Sighting DetailsAs a part of a gathering at Benson's Hideaway for, ironically, UFO DAZE, an annual event. I was standing in the area between the restaurant and the north bay of Long Lake. Pulsating lights two per object, green in color, having length and shape similar to a pair of fluorescent ceiling lights, (parallel to each other) running longitudinally in direction of travel. Object appeared solid when viewed through a pair of 10x50 binoculars during lapses between light pulsations. Shape could not be recognized. Because the theme of the event was sky-watching, I happened to have ready a pair of binoculars. A single object with pulsating green lights (as described above) was visible traveling approximately 025 degrees true, (compared against the position of Polaris with the chair of Cassiopeia in the North-east sky), followed in less than a minute by two more identical objects in rough trailing formation. The last two objects were visible for three minutes through binoculars over a hill with an estimated topographic crest of 200 feet above base terrain. Estimated speed of 24,000 feet per minute when the course was measured against a satellite image of the area. In the next hour and a half solid green intense single points of lights were visible, having the color and intensity of an emerald laser or targeting laser of Russian design moving in an approximate arc from Southeast to Northeast, but these did not appear attached to a solid object as the first three objects and on occasion emitted an aura or laser-like luminescence that rotated or changed relative position to the point of light intensity. The speed of these lights appeared slower than the first three objects, but altitude, distance and speed were difficult to estimate. All appeared height above the high terrain by approximately 5-6 inches when measured at arms length. All solid lights appeared to fly remarkably through the same airspace (course and altitude) over the duration of their individual observations. None of the objects or lights produced audible sound, were devoid of conventional aircraft running lights, and were radically different in appearance from aircraft, satellites, meteors and other normal night sky occurrences visible that evening. Air Temperature: Approximately 75 F. Cieling and Visibility Unlimited. Lightning visible in the distant northern sky near midnight. I am a former military aviator, and the only reaction I recall having was not being able to classify what I was seeing. It was more like experiencing science fiction virtual reality."],"map":"<A HREF = \"http://maps.google.com/maps?q=43.65528,+-88.16444(5116)&iwloc=A&hl=en\"> mufon case (5116) map </A>","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Insufficient Data","Case Number":"5116","Object Flight Path":"Straight-line path","trends":["There have been no other sightings in Dundee","This sighting has never been favorited."],"Log Number":"US-07192006-0010","Region":"Wisconsin","Source":"MUFON","City":"Dundee","Latitude":"43.65528","Summary":"Fluorescent-green parallel ceiling lights in line formation flying north of Dundee Wisconsin","Sighting Duration":"00:03:45","Country":"United States","Date of the Event":"07/15/2006 10:14 UTC","Object Shape":"Flash","Tags":"City","files":["/var/www/straped/mufon/html2text/5116.html.txt","/var/www/straped/mufon/org/5116.html"],"Longitude":"-88.16444","Weather Factors":"Does Not Apply","Object Features":"Other"}