{"files":["/var/www/straped/mufon/html2text/51167.html.txt","/var/www/straped/mufon/org/51167.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.709482,+-75.307909(51167)&iwloc=A&hl=en\"> mufon case (51167) map </A>","Summary":"bright orange-red fireball sphere hovered almost directly overhead almost 1\\2min, then slowly ascended out of sight disapearing like satelites do","Longitude":"-75.307909","Date of the Event":"09/28/2013 09:19 UTC","Weather Factors":"Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","City":"Easton","divs":["Sighting DetailsI went outside to put my sons toys away for the night, and noticed there was a lot of local airport traffic circling the area as the planes always do on busy weekend as they wait for clearance to land. The planes were due east from my location. I started to turn to the southwest to see if Saturn was still above the horizon(saturn was stunning to view with the naked eye a couple hours earlier). I looked up and almost directly overhead appr. 80deg from directly overhead I noticed a bright redish orange-yellow sphere stationary , hovering a little lower than the local air traffic observed in the sky simultaneously. I yelled to my dad through an open window, the orange fireball UFOs are back.(we observed the same exact type of UFO, hovering in the same exact spot about the same distance from the ground. )He immediately ran outside. As we were both fumbling with our devices to get a picture or video the sphere silently ascended towards the southern skys above the commercial jets flying west. At this point the sphere began pulsating as it continued to ascend out of our atmosphere, until it slowly dimmed out like a satellite in the night sky. Neptune was present in the approximate area of the sky where this object flew off to. June,7 of this year I experienced this same type of object displaying the same behaviors, the same hovering distance overhead, same spot in the sky, even ascended in the same exact part of the sky as previously. The only difference is the first sighting there were 5 spheres hovering overhead, then they slowly ascended the same direction one by one. About a minute later, one by one 4 more vertically ascended from the treeline on the other side of the corn field in front of my house. Once the first 3 were above the trees they went one by one horizontally right above the trees to about the same spot the first 5 were hovering. A final 4th one rose from the treeline as the 3 went horizontal to the \"hovering spot\". This last one started to come towards us unlike the others until it was about 150ft from us. It hovered overhead as the 3 ascended into the night sky one after the other, then this last one followed the others. I was able to get pictures of the 3flying horizontally above treeline. No luck with pictures for this second sighting. I am feeling a lot of frustration at this point because nobody can tell me what it is I keep seeing in my yard, why I keep seeing them, and where \"off\" earth are they going?"],"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile, Unknown","Case Number":"51167","Tags":"City","Latitude":"40.709482","Disposition":"Unresolved","Region":"Pennsylvania","Sighting Duration":"Undisclosed","Object Features":"Unknown","Source":"MUFON","trends":["There have been 16 other sightings in Easton","There was one other sighting in Easton on or around September 28th 2013"],"Object Shape":"Circle, Fireball, Saturn-like, Sphere, Star-like","Log Number":"US-09292013-0010","Country":"United States","Date Submitted":"09/29/2013 11:43 UTC"}