{"Latitude":"37.408149","Date of the Event":"09/28/2013 10:15 UTC","Tags":"City","Disposition":"Unresolved","Country":"United States","files":["/var/www/straped/mufon/html2text/51163.html.txt","/var/www/straped/mufon/org/51163.html"],"Source":"MUFON","Object Shape":"Sphere","Log Number":"US-09292013-0006","Object Features":"None","Weather Factors":"Unknown","Date Submitted":"09/29/2013 04:26 UTC","trends":["There have been no other sightings in Midlothian","This sighting has never been favorited."],"divs":["Sighting DetailsI was heading down buck rub from spring run rd. to deer run dr with my wife. While driving through the neighborhood, a bright orange and red object appeared over the trees in front of us at first I thought to myself, It's just airplane. That's when I realized it was quite a bit bigger and brighter than any airplane I've ever seen. Also the fact that airplane headlights don't encompass the entire craft and the distinct absence of the hallmark blinking airplane light lead me to believe that it was something neither I or my wife could explain. I mean the thing made no sound and it most certainly didn't look like any plane ive seen, experimental or otherwise. We kinda followed it as it moved horizontal across the sky but lost it behind more trees. It seemed to pulsate a kind of redish color in the middle of the orange glow. It also mover relatively fast, a little faster and lower than a commercial airplane but slower than a jet. My wife said she saw it dip down in quick increments, but I couldn't tell as I was trying not to hit people's mail boxes."],"Region":"Virginia","Case Number":"51163","Summary":"Bright redish orange craft flew overhead while driving through the neighborhood.","map":"<A HREF = \"http://maps.google.com/maps?q=37.408149,+-77.666016(51163)&iwloc=A&hl=en\"> mufon case (51163) map </A>","Longitude":"-77.666016","Object Flight Path":"Path with directional change","City":"Midlothian","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet"}