{"Country":"United States","files":["/var/www/straped/mufon/html2text/51166.html.txt","/var/www/straped/mufon/org/51166.html"],"City":"Defiance","Latitude":"41.276226","Date Submitted":"09/29/2013 11:16 UTC","Source":"MUFON","Viewing Distance":"Unknown","Longitude":"-84.400299","trends":["There have been 5 other sightings in Defiance","There were no other sightings in Defiance on or around September 28th 2013"],"Disposition":"Unresolved","Log Number":"US-09292013-0009","Object Features":"None","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Tags":"City","Object Shape":"Fireball","Case Number":"51166","Sighting Duration":"Undisclosed","Date of the Event":"09/28/2013 12:00 UTC","Summary":"Fireball like object falls from the sky the breaks into 4 fireballs","map":"<A HREF = \"http://maps.google.com/maps?q=41.276226,+-84.400299(51166)&iwloc=A&hl=en\"> mufon case (51166) map </A>","Region":"Ohio","divs":["sighting detailsi was sitting out at a bonfire in middletown watching the starts and talking to my family, this would make the second day we saw a weird object in the sky. we were just sitting there talking then suddenly a orange fireball appeared to be falling to earth it was quite big and bright then as the object proceeded to fall it turned into 4 objects right before our eyes. it did not seem to be a meteor because the rate at which these \"things\" were falling\\traveling. i ran down the alley to get a better view of these things falling. it took me a while to get down there yet these things were still in the sky. my boyfirend ran ahead of me and said the object traveled to the west and finally fell out of eyesight. like i stated earlier this is the second night we have seen strange things in sky. after this experience we left to go how about 2 hours later. on our way home i seen 2 orange lights similar to the ones we saw fall only these 2 were traveling toward each other then got smaller and smaller out of view as to travel away."]}