{"Object Features":"Window(s)","Tags":"City","Source":"MUFON","Date of the Event":"08/17/1964 12:00 UTC","files":["/var/www/straped/mufon/html2text/5117.html.txt","/var/www/straped/mufon/org/5117.html"],"divs":["Sighting DetailsMyself and 4 other friends were out at the quarry {in Ohio} around 11:00pm on a hot August night. We were sitting there talking -when we suddenly heard a loud humming sound and heard dogs barking in the distance. We had no idea what was going on. Out of no where there was a big beautiful bright light in the sky. We were not scared as we watched it do a light show for us. We would say--go up and it did Go down and it did. Go to the right or left and it did as we asked. The humming had stopped and the dogs too. We watched this object for about 15 min.and then it vanished! We went into town and told the sheriff and he siad we were all drunk. Not true--none of us had been drinking or doing any drugs. We all had good eyesight and were all somewhat normal. 3 nights later -at 1:00AM--I started to go out my front door as my friend was leaving and that same object was above my house! It was shaped like a cigar -it was silver and it had windows and lights all around it . We froze--thinking we were crazy. The object just hoovered there and --poof it was gone! We ran back into the house -somewhat scared this time. WE kept looking out the window--but it never came back. The next morning we went to the local newspaper and told them our story. They told us they had received over 35 calls about the same object! OK --we were all 16 & 17 at the time but WE KNOW WHAT WE SAW. 10 days after this incident 3 men from Wright Patterson Air base paid me a visit! They wanted the names of everyone who was with me that night and then asked what we saw. I told them and they wrote everything down. The older and bigger man-turned as they were leaving and stared at me and said--your mind can play some pretty weird tricks on you. They insisted it was a weather balloon-but we knew different. weeks after the sighting I had a terrible headache and earache for 3 days. I later found out that 3 of the other people there that night --had the same thing. Now here is the spooky part. We went out to the quarry around 9:45 PM--We saw the ufo around 11:00 PM--The next thing we all knew--it was 3:00 Am and we are in town getting the sheriff! So where did 4 hours go thet we can't account for? That was 42 years ago and in that time there are only 2 of us alive from the group that night. The other girl --who is still alive--is the one who was at my house the night it was OVER my house! In those 42 years I have seen 2 other strange objects. One in 1993 the Everglades Fl.--and the other in 1987 in Tarpon Springs FL. Both looked like the one I saw in 1965! My friend -since 1965 has seen 1 strange object-and it caused her to have a major car accident in 1993! The 3 other people who were with me that night in Ohio--never really believed we saw a UFO-but they never talked about it either. One committed suicide--one was killed in a boating accident and the other died from cancer. In the 42 years after the sighting--I have been in 5 car accidents--2 boating accidents---and a domestic violence scene. My father died--my fiance was killed in a car accident-I lost twin girls at birth--I was robbed at knifepoint--I was raped--my house was burned down and another one was blown down in a hurricane. I got a divorce--I worked 2 jobs-raising 3 kids alone and now my grandbaby has epilepsy--I fell at a friends pool and hurt my back but let me tell you what---- I love life and I appreciate everyday. I have 3 wonderful kids--and 3 beautiful grandchildren. They all live near by and I see them everyday! I have great friends--a beautiful home--a new car-and life is good. Some say--my goodness you must have bad luck or be cursed. Say what? I have great luck and there are no curses. But I always catch myself staring up at the sky at night still wondering!"],"Disposition":"Insufficient Data","Date Submitted":"08/17/1964 12:00 UTC","Object Shape":"Cigar","Country":"United States","Sighting Duration":"Undisclosed","Case Number":"5117","Summary":"5 OF US SAW A UFOAND WE WERE NOT SCARED-IT WAS BEAUTIFUL!","City":"Marietta","Latitude":"39.415352","Region":"Ohio","Viewing Distance":"20 Feet or Less","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Log Number":"US-07192006-0011","trends":["There have been 5 other sightings in Marietta","There were no other sightings in Marietta on or around August 17th 1964"],"Weather Factors":"Does Not Apply","Longitude":"-81.454844","map":"<A HREF = \"http://maps.google.com/maps?q=39.415352,+-81.454844(5117)&iwloc=A&hl=en\"> mufon case (5117) map </A>"}