{"Source":"MUFON","Weather Factors":"Unknown","Log Number":"US-09292013-0021","divs":["sighting detailsafter ship passed over a jumbo jet that was about 20,000 feet high, i'm assuming this ship was at least 30,000 feet because airline stayed on same course. the ship was probably moving at least 5 to 10 times as fast. at that height it looked to be as long fore-finger to first knuckle and about 1\\3 in width. as soon as it was out of my view to the ne i saw to ,either orbs or some other shapes, they were very bright either because it was very sunny and no clouds anywhere. the sun was to my left about the height of my head. as these two streaked across the sky from ne to sw it first looked like they were one in front of another. then the one in back went around the first looking like they were \"playing\" with each other. they did this a few times at very fast speeds. it only took them around 8 to 12 seconds until they were out of view. then approximately every 2 to 5 minutes i would see one on the same course from ne to sw totaling either 8 or 9 vehicles. i then got a severe headache from looking into a sunny, bright sky even with sunglasses. it was extremely strange but exciting."],"Date of the Event":"09/29/2013 04:45 UTC","Object Features":"Appendage(s), Other, Unknown","Object Shape":"Bullet, Missile, Sphere","Date Submitted":"09/29/2013 07:03 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.932462,+-91.746293(51179)&iwloc=A&hl=en\"> mufon case (51179) map </A>","trends":["There have been 3 other sightings in Rolla","There were no other sightings in Rolla on or around September 29th 2013"],"Object Flight Path":"Straight-line path,Other","City":"Rolla","Viewing Distance":"Unknown","Latitude":"37.932462","files":["/var/www/straped/mufon/html2text/51179.html.txt","/var/www/straped/mufon/org/51179.html"],"Tags":"City","Longitude":"-91.746293","Disposition":"Unresolved","Country":"United States","Case Number":"51179","Region":"Missouri","Summary":"very large rectangle shape, no noise fully lighted or extremely reflecting sun going NE.","Sighting Duration":"Undisclosed"}