{"Longitude":"-86.295589","Log Number":"US-07202006-0001","trends":["There have been 659 other sightings in Montgomery","There were no other sightings in Montgomery on or around July 19th 2006"],"Sighting Duration":"02:00:00","Case Number":"5118","map":"<A HREF = \"http://maps.google.com/maps?q=32.369645,+-86.295589(5118)&iwloc=A&hl=en\"> mufon case (5118) map </A>","divs":["Sighting DetailsI am a huge astronomy buff and view the sky every evening, weather permitting. I make it a habit to turn all of the outdoor lighting off for better viewing with my telescope. The event began at 3:30 am in Montgomery, Alabama with a single, low altitude object arriving from the northwest and becoming stationary. I immediately realized the craft was not a plane, helicopter or anything I recognized because of it's coloration and behavior. Minutes later, other objects began to eminate from the first object in all directions at different intervals. All of the other objects were similar in shape and light features to the first object, just smaller. Then the show began. The objects in total were too numerous to count and performed spectacular aerial manuevers for two solid hours. My wife, who also witnessed the event, and I were exhilerated beyond description. Neither of us have ever witnessed such a massive UFO event before and I can assure you that we were completely mesmerized. We simply sat down on the ground and watched in total awe the magnificent display that was occuring right in our own backyard! We did not lose sight of the objects until the sun rose, and only then because they just seemed to \"fade away\"!"],"files":["/var/www/straped/mufon/html2text/5118.html.txt","/var/www/straped/mufon/org/5118.html"],"Latitude":"32.369645","Country":"United States","Summary":"Disc shaped objects which alternated between red and white","Object Flight Path":"Hovering then path,Path with directional change","Viewing Distance":"Over One Mile","Object Shape":"Disc","Tags":"City","Object Features":"None","Weather Factors":"None","City":"Montgomery","Source":"MUFON","Region":"Alabama","Date Submitted":"07/19/2006 03:30 UTC","Date of the Event":"07/19/2006 03:30 UTC","Disposition":"Unknown"}