{"Case Number":"51189","Date Submitted":"09/29/2013 10:26 UTC","Object Shape":"Flash, Sphere, Triangle, Other, Unknown","City":"Keithsburg","Sighting Duration":"00:40:00","Weather Factors":"Unknown","Date of the Event":"08/01/2013 03:00 UTC","Summary":"Pulsating UFO w/ Impossible maneuvers, directinal change, materializing & flying over Port Luisa, Keithsburg, Illinois","Latitude":"41.099479","files":["/var/www/straped/mufon/html2text/51189.html.txt","/var/www/straped/mufon/org/51189.html"],"Longitude":"-90.942643","Object Features":"Other, Unknown","Tags":"City","Disposition":"Unresolved","Viewing Distance":"Over One Mile","Source":"MUFON","divs":["Sighting Details While visiting our families vacation cabins in Keithsburg, Il, a small town some 50 miles away from Davenport, Iowa, my brother, cousin, and their 2 friends witnessed a \"UFO sighting\" over the Port Luisa Wildlife Refuge. We had witnessed the Unidentifiable object early in the morning while standing on our deck that overlooks the lake and a large part of the refuge. It appeared quite obviously to us, looking similarly to a ball of light changing shape and size, direction, color, and appearing and disappearing in wildly frequent scattered patterns. It sounded like helicopter blades chopping at the air but gave no visual or even slight other hint that it behaved as a helicopter would let alone anything else commonly seen in today's skies. As you will notice in the video, the object does not move or act as any object, flying or not, would in today's world. It seems to move erratically through the sky and mostly materialize from one spot in the sky to another in an instant. If you slow the video down, you can even see the apparent light from the UFO changing shapes and moving in a spiral motion often changing the direction of the spiral as it appears from one spot to another. While watching, it was very apparent from the start that this was something that was out of the ordinary which was what first lead our attention to it. We all just kept trying to explain to ourselves what it was. It was very exciting and yet mysterious. We knew we were seeing and experiencing something truly rare and out of the ordinary. Eventually, (not included in the video), we stopped filming and just gazed in wonder as it didn't appear to be catching anything on the phones we were recording on. The object appeared much greater in size, shape, detail, and various colors than it appears on the video taken from a cell phone (the only way we could document at the given moment). It kept getting closer and closer and it worried us all a bit. We chose to go inside but once we started walking to go back inside it seemed to get closer and closer. We were all shaken up by this and chose to stay inside and not document or view this object any further due to it's mysterious nature and our questions of its intent was and if it had known that it was being observed by us."],"Object Flight Path":"Path with directional change,Path then hovering,Other","Region":"Illinois","Country":"United States","trends":["There have been no other sightings in Keithsburg","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.099479,+-90.942643(51189)&iwloc=A&hl=en\"> mufon case (51189) map </A>","Log Number":"US-09292013-0030"}