{"Date of the Event":"09/28/2013 09:00 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/51188.html.txt","/var/www/straped/mufon/org/51188.html"],"Source":"MUFON","trends":["There has been one other sighting in Wading River","There were no other sightings in Wading River on or around September 28th 2013"],"Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Longitude":"-72.841592","Sighting Duration":"00:00:45","Country":"United States","City":"Wading River","Log Number":"US-09292013-0029","Summary":"Object approached slowly of the Li Sound - stoppedn after 15 seconds - became smaller , less illuminated, turned direct North and vanished in 5 seconds","Date Submitted":"09/29/2013 10:23 UTC","Object Flight Path":"Path with directional change,Path then hovering","Object Features":"Unknown","Region":"New York","map":"<A HREF = \"http://maps.google.com/maps?q=40.971873,+-72.841592(51188)&iwloc=A&hl=en\"> mufon case (51188) map </A>","divs":["Sighting DetailsI walked out to smoke a cigarette and immediately was drawn to (what resembled a fireball) a brightly lit object approaching from the NE. At first glance, I assumed it was a helicopter shuffling the folks back to Manhattan from the Hamptons, which is common on the North Coast of Long island. There were several aircraft in the sky at different altitudes, but my attention remained on the object because of the glow and the fact it was not making noise. It did not have flashes, blinking or anything and I assumed I was catching a glimpse of the first meteor I had ever seen, and than it stopped for several seconds... I couldn't believe it stopped, and was even more amazed when it either reduced in size or simply had turned to what appeared to be due north. It took a trajectory of what appeared to be directly at an airplane flying south. When the paths of the plane and the object crossed - it was the first time I realized that the object was already at a much higher altitude and that the object was moving at a speed that left me stunned. I mean...literally stunned! It was a crystal clear night, I have excellent vision, and in my 45 years I have never seen anything I could not explain. Originally, I thought the object flew out of site to the north, but after seeing it cross visual path with the airplane I realized it was ascending and it continued in that straight direction until I could no longer see it by eye. I went inside to tell my wife and even reported it to the local news station (seemed silly, but I had to know if others saw this. I am a rationale guy, and I am not sure what it was that I saw - but I know it was there and I know I saw that fireball change direction. I never felt afraid, just bewildered and a lot of second-guessing. If anyone else saw it, or anybody can check if one of the planes saw it - please let me know. I smoked a cigarette tonight a 9pm, no object to go along with a bad habit tonight."],"Latitude":"40.971873","Object Shape":"Bullet, Missile, Fireball","Disposition":"Unresolved","Case Number":"51188"}