{"Log Number":"US-07202006-0002","Object Shape":"Disc, Oval, Sphere","Date Submitted":"06/07/2004 10:45 UTC","Weather Factors":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/5119.html.txt","/var/www/straped/mufon/org/5119.html"],"Date of the Event":"06/07/2004 10:45 UTC","divs":["Sighting DetailsI belong to a group of artists called \"Monday Morning Painters\" who meet every Monday morning for breakfast,usually from 8:00 to 9:00 am, at various area restaurants before choosing a site to paint that day. On this particular day, June 7, 2004, we decided to paint at Toledo's \"International Park\" which is opposite downtown on the east side of the Maumee River. I take my digital camera with me and take many photos of the area before I decide which scene to paint. I took many photos of area restaurants and the Toledo skyline before joining the rest of the group in the park. After talking to several of the painters for a short time I decided not to paint that day and headed back to my car. As I approached the parking lot I decided the rear of the various restaurants was more more interesting than the fronts, so I took out my camera and starting again. I downloaded the photos into my computer that evening however I had no reason to enlarge and inspect them at that time so they sat in their folder until July 16, 2004. When I enlarged the photo of the rear of one of the restaurants I thought I had captured a plane or seagull in flight.The spot on the thumbnail was so small that I hadn't even seen it.I enlarged it several times to be sure I was seeing a real, without a doubt, UFO. I'm sorryto this day that I deleted the photo from the camera, but I didn't know what I had at the time. I was a UFO \"Wantabeliever\" since the mid-fifties...now I Believe! There is an attachment (which I hope You receive). Please acknowledge."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.669468,+-83.554062(5119)&iwloc=A&hl=en\"> mufon case (5119) map </A>","Country":"United States","Latitude":"41.669468","Case Number":"5119","Disposition":"Insufficient Data","Object Features":"Unknown","Region":"Ohio","trends":["There have been 35 other sightings in Toledo","There was one other sighting in Toledo on or around June 7th 2004"],"Source":"MUFON","Viewing Distance":"Over One Mile","Longitude":"-83.554062","City":"Toledo","Sighting Duration":"00:00:01","Object Flight Path":"Unknown","Summary":"Not seen by eye...by camera only !"}