{"City":"El Cajon","Object Features":"None","files":["/var/www/straped/mufon/html2text/51194.html.txt","/var/www/straped/mufon/org/51194.html"],"divs":["Sighting DetailsWe live on a hill that is higher than street level, Outside our house at 6:00 pm, and noticed bright light in the southwest sky. It caught my attention because of its brightness. At first I thought it was an airplane, as we live in flight paths of navy jets, and in and out going planes from San Diego International Airport, but it was too bright. Upon further observing it, I noticed that it wasn't moving in any direction, but was stationary. I went to get binoculars, phone, and my son. Object was still in same place. We bot h observed it through the binoculars, and agreed there was an oval shape that was slightly wider on one end, with a gap, between object, and the tail, or larger end. See pics and vid. My wife observed it at this point with binoculars, and agreed it was brighter than any star, was not moving, and was definitely not an airplane. We decided to drive down our hill to the bottom at street level, and could see the object in the sky, stationary , brighter than anything in the sky, and observed it with binoculars for 40 min. It began to get dark, and the object was aspirin size in the sky, brighter than any star that began to appear. Not being able to see any defined shape, we figured it was very large and very far away, as the shape was not definite as an airplane would be through the same binoculars. I had to field a phone call and when I came out the object was gone. I took a HD video which somewhat shows a shape, a a couple vids to show it was stationary. It was definitely unidentified."],"map":"<A HREF = \"http://maps.google.com/maps?q=32.799473,+-116.959357(51194)&iwloc=A&hl=en\"> mufon case (51194) map </A>","Latitude":"32.799473","Source":"MUFON","Object Flight Path":"Stationary","Country":"United States","Tags":"City","Log Number":"US-09302013-0002","Date of the Event":"09/29/2013 06:05 UTC","trends":["There have been 41 other sightings in El Cajon","There were no other sightings in El Cajon on or around September 29th 2013"],"Weather Factors":"Unknown","Disposition":"Unresolved","Case Number":"51194","Summary":"Stationary bright light observed in one spot for 45 minutes","Longitude":"-116.959357","Region":"California","Sighting Duration":"Undisclosed","Date Submitted":"09/30/2013 01:17 UTC","Object Shape":"Oval, Sphere","Viewing Distance":"Over One Mile"}