{"Date Submitted":"09/30/2013 12:52 UTC","Viewing Distance":"Unknown","Tags":"City","Object Flight Path":"Path with directional change,Path then hovering","City":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.635265,+-89.390378(51209)&iwloc=A&hl=en\"> mufon case (51209) map </A>","files":["/var/www/straped/mufon/html2text/51209.html.txt","/var/www/straped/mufon/org/51209.html"],"Source":"MUFON","Case Number":"51209","divs":["Sighting DetailsGetting in my car around 8:30 PM, I noticed two bright lights of approximately the same size hovering low below a mostly cloudy sky. This was in town, and the clouds were low enough to be highly illuminated by the city lights. The two objects moved independent of each other - one slightly faster than the other first west to east, then southeast. One of the objects (the one that seemed slightly larger or closer) moved slowly at a consistent altitude, the other object (slightly smaller) ascended and descended and moved about in a wandering fashion - also smooth and slow in flight, but meandering around the other object, circling it entirely at one point. Both object grew more faint in brightness as they appeared to travel toward the SE and winked out, one then the other as they entered the low cloud bank. I tried to video them with my camera phone, but upon review the light must have been too poor because the entire video was just black. My first impression of these objects was that they were not supposed to be there - they didn't resemble anything I've seen in the night sky before, and they were not far off. They were the brightest thing visible in the sky and they were below the clouds. The feeling I got was that I was viewing something that I was not supposed to be seeing. I've been thinking about it almost constantly since then. After the objects faded into the clouds, I stood there for several minutes to see if they would appear again but they didn't. I gave up and went to a convenience store to get something to drink, and I felt a strong urge to tell someone or ask around to see if anyone else had seen it, but I didn't."],"Latitude":"40.635265","trends":[],"Longitude":"-89.390378","Log Number":"US-09302013-0016","Weather Factors":"Unknown","Object Features":"None","Sighting Duration":"Undisclosed","Date of the Event":"09/28/2013 08:30 UTC","Country":"United States","Region":"Illinois","Summary":"Two glowing objects traveling SE in a wandering fashion, disappeared in very low hanging clouds at night.","Disposition":"Unresolved","Object Shape":"Circle, Sphere"}