{"Latitude":"33.99482","Source":"MUFON","Region":"Georgia","Longitude":"-83.715381","Case Number":"51203","Sighting Duration":"Undisclosed","divs":["Sighting Detailsfirst of all i would like to say i am not usually a blogger or post to internet about things but this seemed to weird not to report and share to see if anyone else saw the same thing i did... approx 12:15am sept. 28th 2013 i was laying in my bed looking out my bedroom window that faces sw i always look out this window at night to help me fall asleep so i know the skyline and what stars are where. but that night i had this star that was so bright it made a shadow of my lamp on my wall and it was keeping me up because it was right in my eyes. i kept watching it and it was right over the canopy of my pines which are about 35 feet tall. all of a sudden it shifted and moved over. i seriously got chills and just sort of went numb. i waited about 2 minutes and kept an eye on it and then it went up i quickly woke my wife and she thought i was crazy but did admit it was the brightest star she had ever seen her and i sat up for about 5 minutes on the side of the bed watching it and then it did it again it went down and then shifted right. she lost it she was very scared and didnt understand what was going on. and then we watched it sort of fade out back to almost a normal sized star we watched for about 10 minutes and it didnt move and then the light got brighter than it was when i first observed it and it moved downward and then sort of uneasily hovered around. and then this is when i got scared there was a very smallred light that appeared of to the right of the star it wasnt bright but it was visible and then the red dot just dropped and i lost sight of it because it went behind the canopy shadow of my pines. then the bright star just seemed to fade out... this was a very strange night for us and i didnt feel that it was a normal event thats why i had to share to see if anyone else experienced anything like this near north GA..."],"Weather Factors":"Unknown","Date of the Event":"09/28/2013 12:00 UTC","Tags":"City","Object Shape":"Star-like","Viewing Distance":"Unknown","Date Submitted":"09/30/2013 10:05 UTC","Disposition":"Unresolved","Object Flight Path":"Unknown","Object Features":"Unknown","Summary":"odd star like sighting","files":["/var/www/straped/mufon/html2text/51203.html.txt","/var/www/straped/mufon/org/51203.html"],"trends":["There have been 2 other sightings in Winder","There were no other sightings in Winder on or around September 28th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.99482,+-83.715381(51203)&iwloc=A&hl=en\"> mufon case (51203) map </A>","Country":"United States","Log Number":"US-09302013-0010","City":"Winder"}