{"Tags":"City","Sighting Duration":"00:20:00","map":"<A HREF = \"http://maps.google.com/maps?q=-28.222669,+28.34257(51200)&iwloc=A&hl=en\"> mufon case (51200) map </A>","Weather Factors":"Unknown","Case Number":"51200","Viewing Distance":"Unknown","Object Shape":"Circle","Region":"Free State","Longitude":"28.34257","Object Features":"None","City":"Bethlehem","Country":"South Africa","Date Submitted":"09/30/2013 04:20 UTC","Object Flight Path":"Straight-line path","Source":"MUFON","Summary":"Bright light moving from south to north dropping in altitude, developed purfect cloud circle around it which grew in size.","files":["/var/www/straped/mufon/html2text/51200.html.txt","/var/www/straped/mufon/org/51200.html"],"Latitude":"-28.222669","Disposition":"Unresolved","trends":["There have been no other sightings in Bethlehem","This sighting has been favorited 1 time."],"divs":["Sighting DetailsLast night 28 September 2013 between 19h00 and 19h20 I saw a strange light south east from me at about 40 degrees above the horizon. The light appeared to be about three lights bunched together of which one was extremely bright, altogether much larger than any star. At first I thought that it was an aircraft turning from a northerly to a westerly direction with its landing light on. The Bethlehem airport is located to the south of us. I soon realised that it was not turning but slowly moving northwards but also dropping at the same time. At around this time I also noticed the flashing light of an aircraft mush higher in the sky about 85 degrees above the horizon more to the south. I failed to notice in which direction the aircraft was moving (South to Durban or north to Johannesburg). The bright light then suddenly developed a cloud around it, at first small but gradually grew in size. The cloud was a perfect circle but appeared out of focus, the centre of which contained the light, now not so large but still focused and fairly bright. I went into the house fetched my reading glasses and my wife. We watched a while before I fetched my cell phone and took some photo's in which the round cloud is visible but nothing defined can be seen. The cloud around the light appeared to flatten out at the bottom when it reached about 10 degrees above the horizon, at this point east from us. The cloud and light disappeared as it became obstructed by the tree top and houses."],"Log Number":"ZA-09302013-0007","Date of the Event":"09/29/2013 07:10 UTC"}