{"Summary":"Multiple Flashing lights stationary then slow SW transit","Date Submitted":"09/30/2013 11:24 UTC","Case Number":"51208","Tags":"City","Latitude":"40.717343","Country":"United States","Source":"MUFON","Log Number":"US-09302013-0015","Weather Factors":"Unknown","City":"New York","files":["/var/www/straped/mufon/html2text/51208.html.txt","/var/www/straped/mufon/org/51208.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.717343,+-73.996883(51208)&iwloc=A&hl=en\"> mufon case (51208) map </A>","Object Flight Path":"Hovering then path","Date of the Event":"09/30/2013 03:30 UTC","Longitude":"-73.996883","Object Features":"Unknown","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around September 30th 2013"],"Region":"New York","Disposition":"Unresolved","Sighting Duration":"Undisclosed","divs":["sighting detailsat approximately 3:30 a.m. observed what was initially thought to be a helicopter to the south about two hands with's above the horizon until i noticed that one of the flashing lights was blue. it was the brightest non-moon object in the sky. the sky was clear with no clouds at any altitude. observed with binoculars but was unable to tell shape of object. i asked my fiance what colors she was observing and confirmed red, yellow, green, white and blue. object remained stationary for 45 minutes cycling colors randomly. the lights at times seemed directional at times sphere-like at times rectangular\\cigar-shaped or a cross as its aspect changed. it was too distant to see a superstructure with any clarity even with 8 power binoculars. observed two aircraft (red\\white navigation lights at much less intensity than the object). one traveled south at a relatively high rate of speed towards the object and then banked right and traveled quickly out of view to the west. another traveled north along the horizon at relatively high rate of speed to the east of the object about ten minutes later. total time of observing the aircraft was approximately one minute per observation. given time of night and nature of flight patterns i speculate that they were air national guard from burlington, vt. i attempted to take a video but the camera-phone was less than ideal, it is shaky and i upset a sleeping bird. stopped viewing for about ten-15 minutes at the 45 minute mark approximately. returned to the window and saw that the original light had moved west and was partially obscured by a tree limb. the observed several lights, originally thought to be stars but noticed they flickered. binoculars showed the same light emission patterns. there were 5 additional lights arranged roughly north to south with varying intensity due to distance with two advanced farther to the west forming a roughly l shape, though i believe there was a salient in the formation as the dimmest and closest to the horizon object was not the tip of the l.. the lights maintained this formation and drifted slowly west until they were obscured by a tree. total time observed was approximately 1 hour with a break. i have observed aircraft in this area for thirty years and have seen all manner of usaf and commercial aircraft at night as there was a air force base here formerly. i have observed helicopters and i believe a drone in the area as well at night. these lights were unlike anything i have seen in the night sky. i can't explain what i saw, i do not believe in extra terrestrials and i can see no rational reason for any craft to use lights in this fashion. nevertheless, we saw what we saw even if it defies explanation."],"Object Shape":"Cigar, Cross, Unknown","Viewing Distance":"Unknown"}