{"Date Submitted":"09/30/2013 07:54 UTC","Viewing Distance":"Unknown","Disposition":"Unresolved","Summary":"Red glowing object in night sky","divs":["sighting detailsi was walking the dogs outside my house at 8:02pm when i saw a bright red light glowing in the s-se direction from my home. i pointed it out to my 20 yr old son. it seemed to be glowing cherry red and then slowing changed to a bright orange color. we took the dogs back inside and we both came out with my nikon binoculars (10x50). when we came back outside, we had momentary lost the object, but after a few second, noticed that it had went below the tree-line and is now raising back to the initial altitude above the tree\\house line. i noticed that a fast corporate jet had just flown over my house (probably taken off from st.pete airport and there was another commerical jet south bound at a higher altitude. i was able to focus in on both of those jets and see the individual lights onboard clearly. but, when i focused on the bright red object, it just showed up as a bright sphere. it was so bright that it seemed to have a 'aura or halo\" around it. it seemed to slowly change from a bright red to a bright orange and then a bright yellow in color. we both watched it change from a westerly upward direction to a southern directtion, it seemed to be a dull yellowish color as it flew southward and out of site within 15-20 seconds."],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/51201.html.txt","/var/www/straped/mufon/org/51201.html"],"Weather Factors":"Unknown","Tags":"City","Object Flight Path":"Path with directional change","Region":"Florida","Log Number":"US-09302013-0008","map":"<A HREF = \"http://maps.google.com/maps?q=28.077877,+-82.668812(51201)&iwloc=A&hl=en\"> mufon case (51201) map </A>","trends":["There have been 5 other sightings in Oldsmar","There were no other sightings in Oldsmar on or around September 29th 2013"],"Object Shape":"Sphere","Case Number":"51201","Latitude":"28.077877","Date of the Event":"09/29/2013 08:02 UTC","City":"Oldsmar","Country":"United States","Longitude":"-82.668812","Source":"MUFON","Object Features":"None"}