{"trends":["There have been no other sightings in Mandurah","This sighting has never been favorited."],"City":"Mandurah","Region":"Western Australia","files":["/var/www/straped/mufon/html2text/51202.html.txt","/var/www/straped/mufon/org/51202.html"],"Case Number":"51202","Object Shape":"Cigar, Disc","Disposition":"Unresolved","Object Flight Path":"Unknown","Latitude":"-32.59633","Source":"MUFON","Tags":"City","Log Number":"AU-09302013-0009","map":"<A HREF = \"http://maps.google.com/maps?q=-32.59633,+115.73385(51202)&iwloc=A&hl=en\"> mufon case (51202) map </A>","Date of the Event":"04/17/2013 08:53 UTC","divs":["Sighting DetailsI will start by saying these are pictures from my friends phone, that is why i've answered the questions unknown. We have our opinions on the photo's and would really like a professional's opinion. We were going through his pictures on this laptop when he came to these photos and clicked through them quickly as they were not really what we were interested in looking at, as he did this i noticed this weird green thing in each picture and told him to go back. We went through them and were astonished at what we had just seen. I began to ask him questions as i was amazed at what i had seen. He told me he was taking pictures of a weird massive lightning storm which was taking place at the time and that he didn't see or even know the green object was there. These pictures were taken over about a 20 minute period, Some being only seconds after each other. In picture 323 you can zoom into the object which looks like it has windows? And there is also a blue spotlight looking thing that follows the object.A few people i've shown say its reflections from the light pole which it could be and the pictures are not that great zoomed in but in picture 323 that to me just looks like a UFO. I know these picture's are not fake because my mate that took the pictures has no chance at making something like this on the pc and he was more amazed then me as this was the 1st time anyone had ever pointed it out."],"Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"09/30/2013 09:36 UTC","Weather Factors":"Unknown","Object Features":"Window(s)","Country":"Australia","Summary":"Green Glowing UFO","Longitude":"115.73385"}