{"Tags":"City","Summary":"rapidly blinking rainbow at regular rate of multi-color brilliant disnct lights totally stationary in sky position","Longitude":"-71.373837","City":"Undisclosed","Disposition":"Unresolved","Case Number":"51226","Object Flight Path":"Stationary","Object Shape":"Disc","Sighting Duration":"Undisclosed","Date Submitted":"09/30/2013 10:37 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/51226.html.txt","/var/www/straped/mufon/org/51226.html"],"Latitude":"42.416711","Object Features":"Other","Region":"Massachusetts","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.416711,+-71.373837(51226)&iwloc=A&hl=en\"> mufon case (51226) map </A>","Weather Factors":"Unknown","divs":["Sighting DetailsStanding on my deck looking at stars on an extremely clear night tonight: The lights were completely still in a single position to the NE of my home. The rate of blinking was extremely rapid and unchanged through a distinct specific array of individual colors. There appeared a smaller set of identically colored lights perhaps 5 degrees left of the larger original set , which also exhibited rapidly cycling lights, like the first lights that I sighted. During a 15-20 minute observation I asked my wife to also look at these objects, both of us using our 2 sets of binoculars. She confirmed and also said she saw the curved disc shape of the larger object showing the intense rapid lights extending rays of color as they blinked extremely rapidly, which lights appeared radiating from an apparent point on the bottom of the object. A radius of some edge appeared illuminated, then discontinued as the night sky behind the \"object\" profiled an apparent darker edge. The larger object was many many times more brilliant than the surrounding clear stars. And an aircrft with lights crossed directly through my binocular line of sight during obsevation. The subject brilliant object was much much brighter than the aircraft lights , perhaps a turboprop sounding) which carried its own conventional aircraft light array. The original lights in rapid firing sequence appeared to my wife to become a ball of honeycomb array of all clors, and she further described it as \"disco ball\" of rainbow colors."],"Viewing Distance":"Unknown","trends":[],"Date of the Event":"09/30/2013 09:45 UTC","Log Number":"US-09302013-0032"}