{"Object Shape":"Star-like, Triangle","Source":"MUFON","files":["/var/www/straped/mufon/html2text/51228.html.txt","/var/www/straped/mufon/org/51228.html"],"Tags":"City","Date of the Event":"09/29/2013 12:00 UTC","Latitude":"38.955705","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Country":"United States","Case Number":"51228","divs":["sighting detailslet me start off by saying i'm an intelligent, logical person and after seeing this for the third time in 5 years, i'm left with zero explanation which really bothers me. background i have seen this occur 3 times. i will describe the last experience. the last time i saw these lights was this weekend, 9\\29\\2013 at 12:45am in missouri. description after coming home from a movie with my gf after midnight, i closed the door to the car and for some reason glanced up into the sky. almost directly overhead i noticed a cluster of lights move very fast across the sky. they were in a loose triangle formation, but almost hard to see because the lights were faint. my best description would be imagining 8-12 satellites moving across the sky about 5x normal speed. whatever this object is could cover the distance of the entire sky in about 6 or 7 seconds. what bewilders me is that this appears to be in space, or at least an altitude of 60k feet or higher. (imagine seeing the pleides only twice the size, then zipping across the sky in 3 or 4 seconds on a flat trajectory. that is exactly what it looks like) my initial reaction was probably a jaw drop and then i pointed and said, \"look!\". it was almost gone by then but my gf got scared and wanted to go inside. i did notice that when it fades away that it doesn't get closer to the horizon. it just stays on a flat trajectory and then fades from view. my initial thought was it was a cluster of stealth bombers (yes, that was my initial thought) because that was the only thing that could have been low enough to move across the sky that fast and not have flashing lights or be heard. but, after research and asking friends, it seems stealth bombers are very loud and there was perfectly silent. after going over the experience in my head many times, it seems the lights were much too high for it to have been that. and although it's hard to explain, there was just something too eerie and 'inhuman' about it. too fast, too quiet, no blinking lights, no hard shape. my gf is also very intelligent, rational person and was really frightened after seeing it. after going inside, i wanted to confirm what we both saw, so i asked her to logically explain what it was and she had no answer. \"was is a satellite?\" -no. \"was it a jet?\" -no. \"was it a meteorite?\" -no. summary the other 2 experiences were nearly identical. each time has been between 10pm-1am in the summer. same light formation, same silence but extreme speed across the sky. very unworldly. i hope to see it again if only with some more friends."],"City":"Columbia","trends":["There have been 38 other sightings in Columbia","There were no other sightings in Columbia on or around September 29th 2013"],"Disposition":"Unresolved","Date Submitted":"10/01/2013 12:12 UTC","Region":"Missouri","Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","Log Number":"US-10012013-0002","Summary":"Cluster of lights move FAST across the sky","map":"<A HREF = \"http://maps.google.com/maps?q=38.955705,+-92.326532(51228)&iwloc=A&hl=en\"> mufon case (51228) map </A>","Longitude":"-92.326532","Object Features":"Unknown"}