{"Sighting Duration":"01:17:16","Object Features":"Patterned Surface, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.346795,+-75.020721(51232)&iwloc=A&hl=en\"> mufon case (51232) map </A>","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Longitude":"-75.020721","City":"Millville","trends":["There have been 5 other sightings in Millville","There were no other sightings in Millville on or around September 10th 2013"],"Tags":"City","Country":"United States","Region":"New Jersey","Object Shape":"Circle, Disc, Flash, Sphere, Star-like, Other, Unknown","Date of the Event":"09/10/2013 12:00 UTC","Case Number":"51232","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Disposition":"Unresolved","Summary":"Many lights, some in formation others throughout the atmosphere over a period of almost 4 weeks","files":["/var/www/straped/mufon/html2text/51232.html.txt","/var/www/straped/mufon/org/51232.html"],"Source":"MUFON","Log Number":"US-10012013-0006","divs":["Sighting DetailsMy first siting was in Wildwood NJ, during bike week. it was around 11:00 pm we took a walk on the beach. I wanted to walk in the water one last time before fall. I love to watch the stars it is something i do on a regular basis. I did not have direct contact with this ship. I only watch it and have watched more since. I watched this craft for about 25 mins. I didnt want to take my eyes off of it. I thought i would never witness something so incredible. I watched this ship light up the sky as if if were showing a search light. i watch a planes go straight across the sky while this thing hovered afer the plane passed it it took off with a speed like i havent seen and caught up with the plane went with it for a few seconds then like a stone on water skipped back to it original position. About 5 days later i noticed the same bright light but a few hours earlier in the day. In my mind i thought myself am I crazy, however with mine own eyes I saw just what I saw and im not the only one. these last few weeks there have been many lights many formations in my night sky. I have seen orange balls of light starlike lights, bright lights , lights that move together I want answers!I waited two weeks before I even mentioned this to my closest of friends, I didnt think I would ever witness such a thing. i thought it happepened and that is just that, it happened. these things have been in my night sky for weeks not nights not one two nights but weeks! I urge you to please come video something i cannot. I do not have the equipment to tape to measure only my memory which this has imprinted. I cannot dismiss what i see with my two eyes cannot explain and i am told I am crazy for thinking outside our capabilities. please contact me 1(856) 462- 4090 OR 1(856) 765-7685"],"Date Submitted":"10/01/2013 05:09 UTC","Latitude":"39.346795"}