{"Latitude":"39.743289","Object Shape":"Boomerang","Case Number":"51230","Country":"United States","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"09/30/2013 08:17 UTC","City":"Golden","Source":"MUFON","Longitude":"-105.172461","Region":"Colorado","Tags":"City","Object Flight Path":"Straight-line path","Object Features":"None","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsMyself and a friend were watching Monday night football during a a dark commercial break we went outside for a smoke and we were looking up at the sky like we always do when a boome rang shaped object flew into my line of sight. It did not make a sound and it did not deviate from its flight path from south to north. I don't know what I was seeing because it was dark and very dimly lit almost transparent so you couldn't see any detail of the object. You could see how as it was crossing the sky how it was bending the light to barely make it visible to the eye. As this was happening I turned to my friend to ask him if he could see it too but I could see from his reaction he was seeing it to and we watched it until it flew out of our line of sight. After rewards I felt that I needed to validate what I saw with what I had witnessed to compare the two so I didn't tell him what I saw to see if he would discribe the same thing and sure enough his discription of the object was exactly what I saw. At that point I couldn't believe what I just witnessed I know what I saw was real."],"files":["/var/www/straped/mufon/html2text/51230.html.txt","/var/www/straped/mufon/org/51230.html"],"Summary":"As I was looking up at the night sky , I observered what apeared to be a boomerang shaped shadow flying from south to north","Disposition":"Unresolved","Date Submitted":"10/01/2013 12:40 UTC","trends":["There have been 28 other sightings in Golden","There were 2 other sightings in Golden on or around September 30th 2013"],"Log Number":"US-10012013-0005","map":"<A HREF = \"http://maps.google.com/maps?q=39.743289,+-105.172461(51230)&iwloc=A&hl=en\"> mufon case (51230) map </A>"}