{"Viewing Distance":"Unknown","Object Shape":"Triangle","Tags":"City","Latitude":"39.371056","Log Number":"US-10012013-0017","files":["/var/www/straped/mufon/html2text/51244.html.txt","/var/www/straped/mufon/org/51244.html"],"City":"Castle Rock","Region":"Colorado","Object Features":"Wings","trends":["There have been 11 other sightings in Castle Rock","There were no other sightings in Castle Rock on or around September 30th 2013"],"Date of the Event":"09/30/2013 11:00 UTC","Source":"MUFON","Case Number":"51244","Weather Factors":"Unknown","divs":["Sighting DetailsGirlfriend and I were observing the night sky. Very Clear night. We both are very interested in stellar observation and thinking and discussing the sun and planets and galaxies. As we lay on the top of my Jeep very comfortably we both watched and talked about the sky. We pondered if a certain star was Venus. We pondered how our Sun looks from other planets. We pondered how Earth looked in our Galaky. We talked about the speed of light and how amazing it is, how it humurously sparkles at us. We witnessed shooting stars that were blurry....quite a few...so we made it a mission to lay there for about an hour or so as we viewed the night sky hoping to see more shooting stars. I joked that the shooting stars we wwere seeing were unusual, faded..so i wondered maybe it was due to the clear night and they were very far away. I joked were they meteorites...or aliens???Haha...because who knows what form an alien might present itself. We saw a few planes fly by....then awed at a helicopter. None too close together. As we lay there I remember her directing my attention to this misty movement asking What Is that? Almost directly 75 degrees in front of us...in a very regular vision field. I could not answer. It was moth like shape....triangular bust seemed to have more points. with appx 5 dull lights at its points. Maybe they seemed to pulsate,. but they were faint. I wondered if it might be a stealth bomber with its lights off as it resembled having some sort of star like camoflauge...knowingt that was unlikey.. It seemed very high in altitude...and moved so quickly I could compare it to moving 5-10 times faster than any the other two planes or any other plane ive ever seen. It did not make a single noise. As it continued in a straight path across the sky and our eyes both followed and heads turned watching and wondering, it slowly began to fade out of view (which I am not sure most people could see, we both have exquisite vision, and she was surprised I could see what she was describing, she thought she was imagining , and I reassured no she hadnt been imagining) We were both sober, and clear headed. Just observers. I couldnt help but think it might be some military item, and I joked that If the military had craft like that, then we are really amazing. I witnessed it a few moments longer than she, as it faded out of sight. I begged for it to return in my mind, but to no avail. I remember discussing past strange sightings in my life prior to seeing this happen, but none were this intriguing....or defined. Or shared. I Can remember laughing at a certain constellation of stars in the distance saying look how they sparkle unlike the rest...their must be life there!"],"Sighting Duration":"00:00:15","Disposition":"Unresolved","Date Submitted":"10/01/2013 06:54 UTC","Object Flight Path":"Straight-line path","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.371056,+-104.855014(51244)&iwloc=A&hl=en\"> mufon case (51244) map </A>","Longitude":"-104.855014","Summary":"Laying on Jeep observing clear night sky with girl. Originally to \"watch planes fly by\" saw Venus. Milky Way. 4-5 metorites. 2 Airplanes. Helicopter.Then All I heard isWhat is That?Barely visible. star like camoflauge.Very fast. we have great vision."}