{"City":"Noblesville","map":"<A HREF = \"http://maps.google.com/maps?q=40.053612,+-86.005566(51247)&iwloc=A&hl=en\"> mufon case (51247) map </A>","Region":"Indiana","trends":["There have been 9 other sightings in Noblesville","There were no other sightings in Noblesville on or around September 27th 2013","This sighting has been favorited 1 time.",""],"Log Number":"US-10012013-0020","Weather Factors":"Unknown","Date Submitted":"10/01/2013 08:53 UTC","Summary":"Multiple flashing light/orb types changing shape and silently moving over neighborhood","Case Number":"51247","files":["/var/www/straped/mufon/html2text/51247.html.txt","/var/www/straped/mufon/org/51247.html"],"Sighting Duration":"Undisclosed","Longitude":"-86.005566","Tags":"City","Country":"United States","Object Shape":"Fireball, Flash, Unknown","Object Features":"Unknown","Date of the Event":"09/27/2013 01:00 UTC","divs":["sighting detailsaround 1:30 am on the morning of 9\\27\\13 while stargazing on the back deck, i witnessed and recorded on video the sightings of 4-5 unidentified lights that ascended from the lake east of my location and moved silently over the neighborhood. the objects appeared one at the time 15 minutes or so apart and ascend from the lake area over the trees, i cannot say if they came from the lake itself but, i did see them ascend from the trees in that direction and travel silently in a south easterly direction. one of the first objects traveled west and i lost sight of it. i witnessed one other object last night ascending from the same area and traveling in the same south easterly direction. some of the objects appeared first as a single light changing color and then additional lights were flashing like it was a small helicopter however none of the objects made any noise that i could detect. the dogs in the area were not barking. please see the videos. i will post more of these sightings if they continue to occur. note: i also witnessed an orange\\red fireball ascending towards my home from the south the morning of july 5'th of this year."],"Disposition":"Unresolved","Source":"MUFON","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Viewing Distance":"501 Feet - 1 Mile","Latitude":"40.053612"}