{"Disposition":"Unresolved","Summary":"I have seen this bright light 3 nights this week. It is much brighter and larger than any other star and slowly moves eventually so far down below the treeline I can no longer see it","Source":"MUFON","City":"Glens Falls","Date Submitted":"10/01/2013 08:13 UTC","Object Shape":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-73.656242","Region":"New York","Viewing Distance":"Unknown","Object Flight Path":"Stationary,Hovering then path","Country":"United States","Date of the Event":"10/01/2013 07:18 UTC","Log Number":"US-10012013-0018","Tags":"City","files":["/var/www/straped/mufon/html2text/51245.html.txt","/var/www/straped/mufon/org/51245.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.30783,+-73.656242(51245)&iwloc=A&hl=en\"> mufon case (51245) map </A>","Case Number":"51245","divs":["Sighting DetailsThis first time I saw this bright light I was sitting on my front porch. It was dusk and this light (which I thought was a star)was very bright and shining off to the west. I watched it for a while and noticed it was almost pulsing. I live appx. 45 miles from a major airport and 5 miles from a small private airport, on a daily basis we see all types of aircrafts. This however did not move. Not even a little bit?? So I started to record on my phone. The video is not wonderful, and it looks more like a pulsing ball on the recording. I decided I would try to see it better from my attic, but there was a larger tree blocking my view. I went back to the front porch and it was gone? The following night I saw the same thing in almost the exact same spot. I showed my husband and he told me it was just a star. I didn't think much about it until tonight when I saw it again. This time my husband was with me and saw it as well. We decided to video it and look at it through binoculars. The same pulsing ball as before on the video but it looked like it could be multiple lights through the binoculars. We went to our second floor to get a better look and that's where we saw it move slowly up and down and back and forth. It would dip below the tree line and come back up. Eventually it went down so far that we could no longer see it. I am not sure what we saw, and being that I've seen it a few times it could be nothing...but I figured it was strange enough maybe someone else saw it."],"Weather Factors":"Unknown","Object Features":"None","trends":["There have been 4 other sightings in Glens Falls","There were no other sightings in Glens Falls on or around October 1st 2013"],"Latitude":"43.30783"}