{"Country":"United States","Summary":"Meteor like moving from west to east then stopped before assending to nothing","Tags":"City","Weather Factors":"Unknown","Log Number":"US-10022013-0002","Sighting Duration":"Undisclosed","trends":["There have been 4 other sightings in Albany","There were no other sightings in Albany on or around August 16th 2013"],"Latitude":"44.613339","divs":["Sighting DetailsI had stepped outside and was standing in front of my garage enjoying the evening the night of August 16th about 8:40 PM when I saw what appeared to be a meteor traveling from west to east. It caught my eye because it was big glowing and heading my way. It took a moment before I realized that meteors typically go from east to west. It stopped and hovered for nearly two minutes and a second almost pin sized (tiny) dark object merged with the glowing object arriving from the east and then the objects just kept going up until it disappeared. I was able to snap two decent pictures with my cell phone one prior to it stopping and the second after it had been stopped for a few moments. Regretfully there was not time to enter my home and get a more suitable camera. I have the photos still on my cell and do not intend to delete them. With in minutes two military jets flew over the area. They seemed to be looking for something because they made several passes but that could have been coincidence. (I assume military only because of the sonic booms.)"],"Object Flight Path":"Straight-line path,Path then hovering","Longitude":"-123.10139","Object Shape":"Disc, Sphere","Region":"Oregon","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/51257.html.txt","/var/www/straped/mufon/org/51257.html"],"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.613339,+-123.10139(51257)&iwloc=A&hl=en\"> mufon case (51257) map </A>","Date of the Event":"08/16/2013 08:40 UTC","Viewing Distance":"Unknown","Date Submitted":"10/02/2013 01:04 UTC","Source":"MUFON","City":"Albany","Case Number":"51257"}