{"Longitude":"-91.139198","Date of the Event":"09/29/2013 09:30 UTC","Viewing Distance":"Over One Mile","Latitude":"38.821184","map":"<A HREF = \"http://maps.google.com/maps?q=38.821184,+-91.139198(51260)&iwloc=A&hl=en\"> mufon case (51260) map </A>","Disposition":"Unresolved","Weather Factors":"Unknown","Log Number":"US-10022013-0005","Summary":"Large UFO hovered over the city of Warrenton,Mo.","divs":["Sighting DetailsFirst of all, I have seen a lot of crafts around my home for over a year now. So to see these is no shocker any longer. On Sept 29th at 9:30 pm I looked to the east and seen the craft above our small town of 7500 residents. I am at a higher elevation, and 3 miles from town. Looking over I can see the lights of the town at night and there was a craft which hovered there for at least 2 hrs that I watched it. I called a friend from town who walked out and looked to the sky and seen it instantly. He than had a neighbor who he had witnessed this event with him. The following day, I asked a few people if they saw it? and they looked at me like I was crazy. On the 30th of September, I looked up, but it was too cloudy to really see anything happening, but last night, October 1st I looked up at around 11.00 pm and seen a craft move around our town in the sky, but they were further into the sky than the first time I seen them. I would say at least, 2 miles up. I pondered the idea and decided to call 911. I said this is no emergency, but has anyone reported UFO's above Warrenton...? He laughed and said no, you are the first. Well he wanted to know if I have had anything to drink? Which I replied, I do not drink or do drugs. So he sent me 2 patrol cars out to investigate if I was a deranged person. Upon the arrival of the 2 patrolman we did not talk much for they were in ah over the sight of the UFO's. We picked out 5 that we could see around our small town and also around my farm home. No one could explain what we witnessed but the officers did agree, they were UFO's. The time now was about 1 am when they left and I went to bed. But, if those officers were non-believer before they talked with me. They definitely believed when they left. I told them that the activity starts around 9-10 pm when they are the closest to the town. We will be looking up again tonight and into the following night to see this wonderest event."],"trends":["There has been one other sighting in Warrenton","There were no other sightings in Warrenton on or around September 29th 2013"],"Source":"MUFON","Sighting Duration":"03:00:00","Date Submitted":"10/02/2013 09:07 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/51260.html.txt","/var/www/straped/mufon/org/51260.html"],"Object Features":"Unknown","Region":"Missouri","City":"Warrenton","Object Shape":"Disc","Case Number":"51260","Tags":"City","Object Flight Path":"N/A"}