{"Case Number":"51263","Object Flight Path":"Straight-line path","Log Number":"US-10022013-0008","Sighting Duration":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.679327,+-75.404752(51263)&iwloc=A&hl=en\"> mufon case (51263) map </A>","Latitude":"38.679327","Region":"Delaware","Object Features":"Unknown","Date Submitted":"10/02/2013 11:22 UTC","files":["/var/www/straped/mufon/html2text/51263.html.txt","/var/www/straped/mufon/org/51263.html"],"Weather Factors":"Unknown","trends":["There have been no other sightings in Georgetown","This sighting has never been favorited."],"Viewing Distance":"Unknown","Longitude":"-75.404752","Object Shape":"Unknown","Summary":"Bright light moving fast above clouds","Country":"United States","divs":["Sighting DetailsThis sighting occured the same night as the Indiana fireball, but hours earlier than that reported events and 1000 miles East. Driving home from a local diner after a local show, I was driving East thru town to my house, 3 minutes from the dinner. I was heading straight towards a park adjacent to a Catholic church. There were low clouds in the sky in the direcftion I was driving. When I got the the T-stop at the park, what looked like a spotlight shot across the sky from the West to the East. I first thought it was maybe a relection from a car across the aprk, but I heard no engines noises that matched the light's rate of speed. It moved too fast to be a plane or helicopter, plus there was no engine noise indicative of aircraft. There were no events that night in town that warrented a spotlight, nor did the light return or seem to be coming from the ground. The light, which was bluish-white, appeared to be above the clouds, illuminating an area of clouds directly where it was passing over. It went from far-right to far-left of my field of vision in 2-3 seconds, moving in a direct, straight line, producing no noise or cloud disturbance. I lost sight of the object after it went beyond the tops of trees and homes on the east side of town. Although I could not see the object directly, the size of the light on the clouds indicated it was low, as the cloud cover was quite low. I searched the sky the rest of the drive home, but did not see it again. Posting about my sighting on Facebook, a friend in the next town over, to the east, claimed she saw the same light at nearly the same time. It may have been a fireball, given their prevalance lately, AND due to the fact that a bluish-white fireball was directly seen the same night in Indiana, but it did not appear to \"flame in\" or out as fireballs do, but held the same colour and luminosity for the duration of my sighting."],"City":"Georgetown","Date of the Event":"09/28/2013 11:30 UTC","Tags":"City","Disposition":"Unresolved"}