{"Case Number":"5126","Disposition":"Unknown","Summary":"Small black triangle fly over headed west. Very low about 300 ft AGL","Weather Factors":"Does Not Apply","map":"<A HREF = \"http://maps.google.com/maps?q=29.68272,+-95.593239(5126)&iwloc=A&hl=en\"> mufon case (5126) map </A>","City":"Houston","Date Submitted":"08/31/1993 07:00 UTC","Region":"Texas","Sighting Duration":"Undisclosed","divs":["Sighting DetailsThese fly these out of the airport near NASA just before dark and fly over Alief TX. I think these are military test aircraft. They are about the same size as an F-14 and very quiet at low speeds. You cannot hear it until it is almost above your head. My best viewing of one in flight was at about 300 ft AGL (close enough to see the Piot tube for the air speed indicator) and it was banking left over 30 degrees for a turn moving very slow, about 150 to 170 MPH with no flaps and the gear retracted. It came from the SE headed due West. All black, smooth finish with 2 inboard vertical stabilizers slanted inward, not at all like the F-117, it was a perfect triangle flying wing about twice as long as wide, there was no separate tail assembly. It appeared to be a single seater stealth sub-sonic aircraft. Each slanted inward vertical stabilizer was only about 30 to 36 inches in height and 72 inches long. They moved without any separate rudder assembly. An interesting note is the location of the exhaust, mounted on top of the wing about 36\" in front of the trailing edge of the wing. Much like a WW-II German Horten HO. Inside the rectangular exhaust port you could see at least 4 to 6 moving paddles that I assume are part of a thrust vectoring system. This small triangle is jet powered and you can hear it when close. The small black triangle I viewed was manned, and I could view the pilot inside it as it flew over. This is very different vehicle from the large black triangles that emit the strong UV that I have also seen."],"Viewing Distance":"101-500 Feet","Country":"United States","Object Features":"Window(s), Wings","files":["/var/www/straped/mufon/html2text/5126.html.txt","/var/www/straped/mufon/more/5126_submitter_file1__BLACKTRIANGLESMALL.JPG","/var/www/straped/mufon/org/5126.html"],"Log Number":"US-07212006-0004","Tags":"City","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around August 31st 1993","This sighting has never been favorited.",""],"Object Flight Path":"Path with directional change","Date of the Event":"08/31/1993 07:00 UTC","Object Shape":"Triangle","Latitude":"29.68272","Source":"MUFON","Longitude":"-95.593239"}