{"Weather Factors":"Unknown","Source":"MUFON","Disposition":"Unresolved","divs":["Sighting DetailsWas standing on my step at work, 2501 Wharton st Philadelphia pa 19145, having a smoke and a glint caught my attention. It looked like a bunch of silver mylar balloons, but way high in the eastern sky. turned around looked up the street finished my cigarette, about a min or so and it was still there, but now was rotating? because the sun was shining off the silver. I come in get my employees they look at it and it's starts to reflect again and more, but still the same height and direction, about twice as high as the news copters fly if not more, got my tellephoto on my camera to see if I could see it better but still looked blurry, came in, tried to call my wife and as I'm calling and looking at it and blip it was gone, no streak no movement like a LIGHT SWITCH GONE. Basic facts, it was silver and reflective, and kept stationary for 7 or 8 mins and disappeared, it was too high and far to give accurate info on shape or extrapolate size. I hope someone else saw it. I am firm believer in aliens, but being prior military I am skeptical. Either way it was an object that I couldn't identify acting strangely for our area."],"Object Shape":"Other","City":"Philadelphia","map":"<A HREF = \"http://maps.google.com/maps?q=39.960355,+-75.162739(51266)&iwloc=A&hl=en\"> mufon case (51266) map </A>","Tags":"City","Region":"Pennsylvania","Longitude":"-75.162739","Case Number":"51266","files":["/var/www/straped/mufon/html2text/51266.html.txt","/var/www/straped/mufon/org/51266.html"],"Sighting Duration":"Undisclosed","Date Submitted":"10/02/2013 02:39 UTC","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Stationary,Other","Object Features":"None","Country":"United States","Date of the Event":"10/02/2013 01:50 UTC","Summary":"virticle, with round facets? like rain drops, reflective silver, exactly like a large bunch of balloons but perfectly stationary in the sky","Log Number":"US-10022013-0011","Latitude":"39.960355","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around October 2nd 2013"]}