{"Source":"MUFON","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Tags":"City","Log Number":"US-10022013-0015","Case Number":"51271","map":"<A HREF = \"http://maps.google.com/maps?q=40.067458,+-86.030723(51271)&iwloc=A&hl=en\"> mufon case (51271) map </A>","Date of the Event":"10/02/2013 12:00 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Longitude":"-86.030723","Latitude":"40.067458","Weather Factors":"Unknown","Summary":"Filmed objects at multiple locations, chased moving objects in car, filmed up close, grey hull","Sighting Duration":"01:30:00","City":"Noblesville","Date Submitted":"10/02/2013 07:17 UTC","files":["/var/www/straped/mufon/html2text/51271.html.txt","/var/www/straped/mufon/org/51271.html"],"Object Features":"Wings, Other","trends":["There have been 9 other sightings in Noblesville","There were no other sightings in Noblesville on or around October 2nd 2013","This sighting has been favorited 1 time.",""],"divs":["Sighting DetailsEarly this morning I noticed another ball of red pulsating light ascending over the lake area to the east. I drove my car to the closest point and filmed the object hovering stationary. Driving further I saw several of the objects at different locations in the night sky in a one mile area approximately. I gave chase to one of the fast moving objects and after a few miles saw several more over a certain area. I want out onto the golf course where the were hovering, gliding and began filming the objects, there were a handful of them. Their was no sound from the objects except when one flew close to directly over head I heard a faint jet like noise however the objects seemed to be moving to slowly to be planes and they would also appear stationary and then began moving and adding blinking lights of different colors. In one video I think I can see a grey hull, the shape of the object can be described as, for lake of a better word, a Klingon bird of prey. Please see the videos and I do have full High Definition quality videos of all my posted videos as well as more shorter clips should you be interested in a better quality video source for examination. These objects are appearing almost every night. The longest video was taken in the presence of 2 other witnesses."],"Country":"United States","Disposition":"Unresolved","Object Shape":"Fireball, Triangle, Other","Region":"Indiana"}