{"trends":["There have been 7 other sightings in Fowler","There were 3 other sightings in Fowler on or around October 2nd 2013"],"Latitude":"36.634876","Sighting Duration":"Undisclosed","Date Submitted":"10/02/2013 08:22 UTC","Viewing Distance":"Over One Mile","Summary":"I took photos from my front yard. A bright white object showed up on my photos. Also, a dark dull object showed up. They looked round. The sky was very clear & not planes around and was very quiet out.","Date of the Event":"10/02/2013 12:00 UTC","Disposition":"Unresolved","Object Features":"Unknown","Object Flight Path":"Stationary,Hovering then path,Unknown","divs":["Sighting DetailsThe objects that appeared on my photos came out pretty clear and somewhat close over my house. I did not notice these objects when taking the photos. I happened to notice them while importing them onto my iPhoto on my Mac Laptop. I was shocked when I saw them. The two solid bright white objects I am guessing they were the same object, since they looked the same. The black darker object I have no idea. They were all below cloud level and there were no planes or any aircrafts in the sky. The sky was super clear and blue no clouds. This is my first daytime capture of something like this. I mostly see objects at night that I have captured on my video camcorder with three cassette tapes complete. I still have to upload on my computer. The time I took these daytime photos was approx. around or after 4:00pm Pacific Time. The darker object was shot over my house facing West. One of the white objects was facing South. Then the last second shot of the white object was shot looking up over my chimney. I took my photos with a Nikon Digital. I have three photos. Camera D 50. Thank you."],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/51274.html.txt","/var/www/straped/mufon/org/51274.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.634876,+-119.66918(51274)&iwloc=A&hl=en\"> mufon case (51274) map </A>","Longitude":"-119.66918","Region":"California","Country":"United States","Tags":"City","Object Shape":"Circle, Sphere","Log Number":"US-10022013-0018","Case Number":"51274","City":"Fowler","Source":"MUFON"}