{"divs":["Sighting Detailsi was laying on the trampoline just chilling with my friend patrick trujeque, yes were friends,he also put in a report. so anyway there we were just chilling and im just looking around because im really bored and i see this little red dottish thing just flying like crazy in patterns like a figure 8 but it was like if you put two 8s together one on top of the other and all the sudden my little brother looks at it and says woogieboogie or something and i look at him, look back and its gone i told him about it and he said i was stupid so we started fighting.1. i was laying around ona trampoline listening to ICP, ICP is a band i like.2. i first noticed the object when i saw a little red dottish thing flying in a wierd pattern.3. when i first saw it i thought one of those planes with the smoke stuff with the messages for loved ones or some thing but when i looked it didnt make a message, it just kept getting faster.4. the object went in a wierd formation like two 8s piled on top of eachother and it kept getting faster and faster.5. after the sighting i went inside and watched tv after drinking a glass of water. during the sighting i was just staring at it and it was like just wierd the way it flew and i liked it for somereason.6. i lost sight because of my little brother, he sucks and ruins all fun activities in my opinion and in patrick trujeques, he said woogieboogie or something and called me stupid afterward."],"Tags":"City","Object Shape":"Egg, Saturn-like, Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=40.450286,+-105.006588(5128)&iwloc=A&hl=en\"> mufon case (5128) map </A>","trends":["There have been 18 other sightings in Loveland","There were no other sightings in Loveland on or around December 31st 2004"],"Case Number":"5128","Log Number":"US-07222006-0002","Date Submitted":"12/31/2004 06:30 UTC","Summary":"a thing was flying around in wierd patterns","Date of the Event":"12/31/2004 06:30 UTC","Sighting Duration":"Undisclosed","Weather Factors":"None","Region":"Colorado","files":["/var/www/straped/mufon/html2text/5128.html.txt","/var/www/straped/mufon/org/5128.html"],"Object Flight Path":"Other","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","City":"Loveland","Source":"MUFON","Country":"United States","Disposition":"Hoax","Longitude":"-105.006588","Latitude":"40.450286"}