{"Log Number":"US-10032013-0008","Disposition":"Unresolved","Date Submitted":"10/03/2013 05:03 UTC","Tags":"City","Weather Factors":"Unknown","Date of the Event":"10/20/2008 12:15 UTC","divs":["Sighting Detailsthis was in san Pedro while on a break from work. a cigar shaped aircraft observed crossing thru clouds translucent but with outline the same color as the clouds. hiding in the clouds, peeked out from the clouds. sliced thru the clouds very quickly, pulsating pulling back and forth as if u were riding a horse that wants to move forward as u pull it back. assumed that who ever was driving didn't know how to use it was trying to keep it hidden? it was the size of three Goodyear blimps. shaped like a joint. observed object trying to hide in a smaller cloud two other friends observed the object as well, took off straight line path towards the Hollywood hills, within like a second. Approximate time that it lasted five to 8 min. called 911 to report a \"ufo\" sighting was told to call the air force. she connected him with the air force the phone starts ringing while its ringing a voice comes on the line and yelled \"what is your name? what is your location\" freaked out he hung up. Right after that about 15min later many little helicopters flooded the air space where the object had been seen. like many wasp, many people witnessed this. One witness died a month later. date is inconclusive."],"Object Shape":"Cigar","Sighting Duration":"00:05:00","Object Flight Path":"Path with directional change","Region":"California","Case Number":"51287","Source":"MUFON","Summary":"cigar shaped object spotted over terminal island in long beach","map":"<A HREF = \"http://maps.google.com/maps?q=33.740592,+-118.285726(51287)&iwloc=A&hl=en\"> mufon case (51287) map </A>","Country":"United States","trends":["There have been 404 other sightings in Los Angeles","There were 2 other sightings in Los Angeles on or around October 20th 2008"],"Latitude":"33.740592","Longitude":"-118.285726","City":"Los Angeles","Object Features":"None","files":["/var/www/straped/mufon/html2text/51287.html.txt","/var/www/straped/mufon/org/51287.html"],"Viewing Distance":"N/A"}