{"Country":"United States","Latitude":"39.798514","trends":["There has been one other sighting in Clementon","There were no other sightings in Clementon on or around October 2nd 2013"],"Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Log Number":"US-10032013-0001","files":["/var/www/straped/mufon/html2text/51280.html.txt","/var/www/straped/mufon/org/51280.html"],"Summary":"A cluster of ships hovering and blinking in the cloudless night sky for 15 minutes","Object Features":"Unknown","Object Shape":"Disc, Other","Date Submitted":"10/03/2013 01:09 UTC","Longitude":"-75.039485","Case Number":"51280","Tags":"City","Region":"New Jersey","Disposition":"Unresolved","Date of the Event":"10/02/2013 10:30 UTC","divs":["Sighting DetailsMy friend and I took a walk around my apartment complex to stretch our legs and catch up on the latest news in our personal lives. I've often taken a stroll like this around my complex, and have done so for the past six years, and although I have looked for UFO's many times, I've never seen anything in the sky but planes en route to or from the Philadelphia Airport. Not so tonight! As we approached the back hillside overlooking the neighboring town, I noticed what I thought were airplanes on the horizon, but they didn't act like planes since they weren't moving in a normal flight pattern but instead were hovering in one spot. There were roughly 10-20 of them in a cluster formation, hovering and flashing with blinking red or white lights. I couldn't believe it! I've been wanting to see a UFO for quite sometime and had given up really. I grabbed my friend and said, \"Pinch me, but I think there are UFO's in the sky tonight.\" I pointed due east. We agreed that they definitely weren't planes. I guesstimated that they were a hundred or more miles away, probably flying over the Jersey Shore somewhere, but I'm not a good judge of distance. They faded out of view after ten minutes or so. I'm still in awe of this sighting."],"Object Flight Path":"Stationary,Hovering then path","Weather Factors":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.798514,+-75.039485(51280)&iwloc=A&hl=en\"> mufon case (51280) map </A>","City":"Clementon"}