{"Log Number":"US-10032013-0015","Country":"United States","trends":["There have been 41 other sightings in Fort Myers","There were no other sightings in Fort Myers on or around September 28th 2013"],"Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/51295.html.txt","/var/www/straped/mufon/org/51295.html"],"Region":"Florida","Source":"MUFON","divs":["sighting detailsmy brother and i were having coffee on the patio at 6 am. we do that daily and look at the stars\\sky and chat before he leaves for work. i was sitting facing away from the house, and noticed the triangle gliding by above his head and yelled......\"look at that, look at that\". he immediately looked up and saw it. i knew that it wasn't anything i'd ever seen before, ergo my yelling for my brother to look at it. the object was approximately 300 feet out from the side of the house and approximately 100 feet above the treetop. it glided by quickly and soundlessly from west to east. the shape was a perfect triangle with approximately 6-7 evenly spaced lights on all three sides aiming down (not on the sides of the craft). they were perfectly round and glowed hazy white. the craft was approximately 90-100 feet long. at first we were trying to think of anything else it could be, but we both knew what we had seen. there are only about four people i shared this with because they know me well and wouldn't question what i saw. believe it or not, we were both calm and mesmerized and i had an incredibly peaceful feeling afterward. unfortunately the craft was in sight 4-5 long seconds.....it was low over the treetops and we lost sight of it. there was no sense trying to run out to the street for a better look because it was moving too fast. we both know what we saw. i've not been able to find pictures on any site that matches this. please ......it was not birds or a plane. planes absolutely wouldn't fly that low...and they would have been heard a long way. my eyesight is 20\\20 and i can hear well. to be honest......we're happy with the knowledge that we've observed this object. most people aren't that fortunate. of course i didn't have a camera at 6am having coffee on the patio....and even if i did, turning it on and finding the object within a second would have been impossible. that is my only regret."],"Disposition":"Unresolved","City":"Fort Myers","Object Features":"None","Case Number":"51295","Date of the Event":"09/28/2013 12:00 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Latitude":"26.645148","Longitude":"-81.863668","map":"<A HREF = \"http://maps.google.com/maps?q=26.645148,+-81.863668(51295)&iwloc=A&hl=en\"> mufon case (51295) map </A>","Viewing Distance":"101-500 Feet","Object Flight Path":"Straight-line path","Tags":"City","Summary":"perfect triangle w/evenly spaced hazy white lights on all sides (approx. 6-7 per side)","Date Submitted":"10/03/2013 10:15 UTC"}