{"City":"Dallas","Object Flight Path":"Hovering then path,Path with directional change","files":["/var/www/straped/mufon/html2text/51309.html.txt","/var/www/straped/mufon/org/51309.html"],"Tags":"City","divs":["sighting detailsi am a new member for three weeks now...and i wanted to make a report. dallas,tx 10\\4\\13 @ 7:15pm..... i was outside with the neighborhood kids, sky conditions were clear blue skies with a very small amount of clouds. now what i noticed is a few chemtrail clouds then what caught my eyes was a bright orb like movement. what i thought to be a plane with a bright sun reflection turned out to not be. as i watched it disperse a few trails a small bit at a time in the straight down direction. then started moving in a straight away direction right before it faded away from sight. right out of the first bit of dispersment came out another brightly lit orb headed straight down. this one did not disperse anything. then once again right before i lost view of it behind a tree a third started moving upward then crossing right over the sky. at the same time as this happening ...the kids pointed out an actual plane like object coming sideways clearly dispersing chems all the way across. now to clarify what i was seeing wasnt a eye trick...other actual airplanes were starting to cross the areas. which the kids were able to clearly see the difference between the objects. to make it even weirder we saw one object that clearly had no wings but maneuvered just like a plane come across last. now to get more evidence i tried recording it with my camera phone which records in hd 1080p but the objects did not appear on camera but the planes did. this all happened between 7:15-7:21pm in north dallas. i would love to discuss more if u like. 214-283-7113."],"Summary":"i am a new member for three weeks now...and i wanted to make a report. DALLAS,TX 10/4/13 @ 7:15PM..... I WAS OUTSIDE WITH THE NEIGHBORHOOD KIDS, SKY CONDITIONS WERE CLEAR BLUE SKIES WITH A VERY SMALL AMOUNT OF CLOUDS. NOW WHAT I NOTICED IS A FEW CHEMTRAI","Latitude":"32.893624","Date of the Event":"10/04/2013 07:15 UTC","Region":"Texas","Object Features":"None","Country":"United States","Disposition":"Unresolved","trends":["There have been 116 other sightings in Dallas","There were no other sightings in Dallas on or around October 4th 2013"],"Case Number":"51309","Longitude":"-96.729998","Date Submitted":"10/04/2013 08:49 UTC","Weather Factors":"Unknown","Sighting Duration":"00:06:00","Viewing Distance":"Unknown","Object Shape":"Bullet, Missile, Diamond, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=32.893624,+-96.729998(51309)&iwloc=A&hl=en\"> mufon case (51309) map </A>","Log Number":"US-10042013-0012","Source":"MUFON"}