{"trends":["There have been 97 other sightings in Miami","There were no other sightings in Miami on or around October 4th 2013"],"Region":"Florida","Log Number":"US-10042013-0007","Object Flight Path":"Path with directional change","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"10/04/2013 07:15 UTC","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=25.798379,+-80.224789(51304)&iwloc=A&hl=en\"> mufon case (51304) map </A>","Date Submitted":"10/04/2013 04:10 UTC","Object Features":"None","Country":"United States","Summary":"Object broke cloud ceiling, change direction in to clouds and again broke cloud ceiling and in to clouds.","divs":["Sighting DetailsI was seating looking up into the clouds from my balcony. The thick grey outer bands clouds associated with tropical storm Karen cover the whole sky. I was looking at a small airplane flying under cloud ceiling and with small blinking red and white light in what appeared to be an approach course from the South toward the Miami International Airport. I notice this very bright sphere of light just bigger that an aspirin but smaller that a penny as it broke the cloud ceiling to the left of the airplane but not close to it. Right away I felt it was a UFO, I have previous military training to identified aircrafts. The object broke the cloud ceiling in a 20 degree angle, corrected to 45 for lest than a second and change to 20 again to go into the clouds. Reappear again doing a similar maneuver to go back in to the clouds. I got up right away and looked to see if I could see it further down in the direction that was heading but it did not appear again. Only the small airplane that I observe before could be seen. The speed was fast, faster that the airplane but not blinding fast. I felt that either the object broke cloud cover by mistake or in purpose since it did the same maneuver twice. My wife got home just minutes after, I told her what I just saw. She described my face as surprise and awe. I lost sight as the object went into cloud cover the second time."],"Latitude":"25.798379","City":"Miami","Tags":"City","Longitude":"-80.224789","Sighting Duration":"Undisclosed","Case Number":"51304","Object Shape":"Sphere","Weather Factors":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/51304.html.txt","/var/www/straped/mufon/org/51304.html"]}