{"Object Flight Path":"Path with directional change","Case Number":"51306","Log Number":"US-10042013-0009","Object Features":"None","Sighting Duration":"Undisclosed","Tags":"City","Country":"United States","trends":["There have been 42 other sightings in Lincoln","There were no other sightings in Lincoln on or around September 29th 2013"],"Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=40.764057,+-96.656927(51306)&iwloc=A&hl=en\"> mufon case (51306) map </A>","Disposition":"Unresolved","Weather Factors":"Unknown","Date Submitted":"10/04/2013 04:31 UTC","Viewing Distance":"Unknown","Latitude":"40.764057","City":"Lincoln","Summary":"UFO moved directly toward me from horizon and quickly veered to my left and disappeared behind trees","Region":"Nebraska","files":["/var/www/straped/mufon/html2text/51306.html.txt","/var/www/straped/mufon/org/51306.html"],"Source":"MUFON","Date of the Event":"09/29/2013 07:45 UTC","Longitude":"-96.656927","divs":["sighting detailssunday evening, october 29, 2013 at about 7:40 pm i came up to the third floor bedroom where i sleep. this bedroom has a five foot wide window that offers an excellent view of the lower land and the night sky. most nights i sleep with the curtains opened so i can see the sky. i planned to read before i slept. a minute or two later while arranging my pillows so i could read, i saw a light just above the horizon. the sky was solid dark gray clouds. beneath, the trees in back of my house formed a corridor to the visible horizon. i thought the light was a star. i remembered i hadn't made a wish on a star for many years so i quoted the childhood twinkle, twinkle little star, etc. and made a wish. after a few moments of observing the tiny light i realized it was moving toward me. at first, i thought it was a small airplane then as the light grew larger i thought it was a helicopter. as it got closer i realized it was not an aircraft. it was a ufo and unlike anything i had seen before. i was mesmerized and delighted to see it. it continued in a straight line until it was halfway between me and the horizon. before me was a yellow and gold glowing sphere around whose edges was what appeared to be a shifting transparent energy field of red and blue. there was a gentle, comfortable energy that i could feel and i was at peace and happy. it was like meeting a friend one hadn't seen in a long time. the path of the ufo was upward from a horizon considerably lower than the top of the hill where i live. it came straight toward my house. it got more brilliant in light\\energy. it began to ascend and came nearer and nearer. i had a feeling that its path was intentional and not willy nilly nor unplanned. at one point i felt that i was somehow part of it. it was getting so close i couldn't believe it. i thought happily to myself, \"it's going to go right over the house!\" wrong. no sooner did i think that than it veered sharply to its right - my left - and behind treetops disappearing entirely at the edge of my window. i felt sadness temporarily and then gratitude that i had see the ufo. the event lasted about ten minutes."]}