{"Summary":"Looking at the photos I had just taken in my yard in the day and evening I noticed solid white glowing roundish objects. Most were white.","Viewing Distance":"Unknown","divs":["sighting detailsi am adding more photos to this same case i had reported on october 3, 2013 when i go outside and take pictures i make sure am looking around to see if i see anything in the sky. most of the time i don't see anything .then they show up on my camera after uploading to my iphoto on my mac computer. the sky has been super clear and blue with no planes around. lately, i have been going outside after 8:00 am then going back out around 10:00am i then go back out for the last time after 7:00pm just as the sun is setting. i mostly see objects late at night and have captured hours of video footage of unexplained objects that cannot be explained and that i have not yet found on the internet of what i have been seeing. when i first noticed i had captured daytime footage i was so surprised. i never caught anything on my photos of the daytime. i was a little scared but, very curious to keep going back out and taking more pictures. but, now i have noticed they appear in the same general areas and i am thinking they could be the same ones one of the objects look either as a triangle\\heart shape. when another one would be just a solid oval\\round shape but, could be dull or very bright. most are all solid white. mostly they all have been a solid white. this is a first to see such objects on my photos. usually, i capture them on video. these objects i have been seeing have no sound. it's kind of unnerving to know maybe something could be watching me. thank you."],"Object Flight Path":"Stationary,Hovering then path,Path with directional change,Unknown","Object Features":"None","Longitude":"-119.67619","Country":"United States","Date Submitted":"10/04/2013 04:44 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.634786,+-119.67619(51307)&iwloc=A&hl=en\"> mufon case (51307) map </A>","City":"Fowler","Object Shape":"Boomerang, Circle, Oval, Sphere, Teardrop, Triangle","Disposition":"Unresolved","Weather Factors":"Unknown","trends":["There have been 7 other sightings in Fowler","There were 3 other sightings in Fowler on or around October 3rd 2013"],"Date of the Event":"10/03/2013 12:00 UTC","Sighting Duration":"Undisclosed","Tags":"City","Log Number":"US-10042013-0010","Case Number":"51307","Region":"California","Latitude":"36.634786","files":["/var/www/straped/mufon/html2text/51307.html.txt","/var/www/straped/mufon/org/51307.html"]}