{"divs":["Sighting DetailsI was at a cottage at Lake Erie in Selkirk ON and taking pictures of the lake because the setting sun turned the water a pretty pink and blue and it was very calm and peaceful. There was a couple in a rowboat adding to the serenity and picturesque view. It was either Sept 18th or 19th and most cottages were empty as normal for this time of year. I did not see anything until I downloaded the photos onto my laptop to have some printed for my friend whos cottage I stayed at and because some were so beautiful put them on my desktop background. The bright white orb always caught my eye but at first I thought it was the moon and ignored it until 2 or 3 days later remembered there was a harvest moon that week and it was not at this spot in the sky until around midnight. In fact at this time in the evening I don't think the moon was visible to the SE over the lake yet. Then I thought it must be a star but it seemed to close and too large. I had put 3-4 photos on my computer background but then decided to eliminate all but 1 which ended up being this photo. That is when I had a good look and zoomed in. Then it was clear this thing was behind the tree as leaves and branches are clearly in front of the orb. I have no idea what this object is and the closets thing it could be is a paper plate but there was no wind as you can see from the calmness of the lake. For sure it is not the moon and seems too large to be a star. A lot of planes are seen in this area over Lake Erie but this is not a plane, as it seems close er than a plane would come. When taking the pictures I did not see or hear anything unusual perhaps because I was so focused on the beauty of the lake and taking the pictures. It is bothering me not knowing what this object is and a couple of friends say it could only be the moon which of course it is not. If I had just printed the photo this thing would have been missed for sure. When I zoom in too much it distorts the object. I have 2 other photos taken at the same time and one shows a flock of geese with a shadow that appears to be a plane coming towards the camera but in the next shot the geese are further west and there is a bright light just above the lake to the west that was not in the other 2 photos. The photo with the orb also has a shadowy disklike shape to the left side half way up and in a bit. It is on an angle that to me a plane would not make and would like to know your opinion on that as well. It seems too large to be a loon diving into the water, but the loons are coming back to the area. This bright white orb behind the tree is very strange though. I hope that you can contact me about what this object may be as I completed the form as best I could but not having only seen it in the photo makes it no so accurate. Thank you."],"Region":"Ontario","Log Number":"CA-10052013-0005","Country":"Canada","Case Number":"51317","Summary":"I did not see this object until after downloading photos I put 3 or 4 onto my desktop background","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.819414,+-79.910781(51317)&iwloc=A&hl=en\"> mufon case (51317) map </A>","trends":["There has been one other sighting in Haldimand","There were no other sightings in Haldimand on or around September 18th 2013"],"Date Submitted":"10/05/2013 10:10 UTC","Latitude":"42.819414","Object Features":"None","Longitude":"-79.910781","files":["/var/www/straped/mufon/html2text/51317.html.txt","/var/www/straped/mufon/org/51317.html"],"Object Shape":"Sphere","Disposition":"Unresolved","Date of the Event":"09/18/2013 06:00 UTC","City":"Haldimand","Source":"MUFON","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Tags":"City"}