{"Region":"Alabama","divs":["Sighting DetailsMy son and I were coming from Columbus Ga back into Phenix City,Al around 7:30 when all of the sudden I see what I thought was a star...I thought this was strange considering it wasn't dark yet and this object was so bright and glowed like a pinkish color..suddenly it shot across the sky and stopped above what had to be a giant black boomerang object...I say that because I could clearly see the shape of it and see how dull the black was on it...by this time my 6 year old sees it as well and is freaking out along with me in total disbelief as to what we are witnessing....I watch it until I can get stopped in a grocery store parking lot...I call my husband and tell him to come where I am..by this time the entire parking lot is watching this object..my husband snaps a photo,but unfortunately it was too far away by that time.I have the picture but you can just barely make it out...after that we watched it until it went out of view ascending up out of view.My son was so scared he didn't want to sleep alone that night..It still freaks me out to think of what we all witnessed."],"files":["/var/www/straped/mufon/html2text/51318.html.txt","/var/www/straped/mufon/org/51318.html"],"Tags":"City","City":"Columbus","Disposition":"Unresolved","Source":"MUFON","trends":["There have been no other sightings in Columbus","This sighting has never been favorited."],"Case Number":"51318","Object Flight Path":"Stationary","Country":"United States","Log Number":"US-10052013-0006","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"09/20/2013 07:40 UTC","Weather Factors":"Unknown","Latitude":"32.462186","map":"<A HREF = \"http://maps.google.com/maps?q=32.462186,+-84.982199(51318)&iwloc=A&hl=en\"> mufon case (51318) map </A>","Summary":"Black Boomerang shaped object spotted hovering in sky over town.I also saw a bright object that looked like a star before spotting this object..it flew toward the black object.","Longitude":"-84.982199","Object Shape":"Boomerang, Star-like","Sighting Duration":"01:00:00","Date Submitted":"10/05/2013 11:30 UTC","Object Features":"Unknown"}