{"Source":"MUFON","Date Submitted":"10/04/2013 10:35 UTC","Log Number":"US-10042013-0014","divs":["Sighting DetailsMy fiancee and I were out on our deck at our residence, having a smoke, talking about our work days, and out of the corner of my fiancee's eye, over the roof, a round, glowing orange object, making no sound whatsoever, moving slowly, appeared and she yelled for me to turn around. I saw the object as it was descending and we both ran to the railing astonished, as this was the EXACT same object we had seen in the area two years before (we filed a report then too in the same area and we had 2 other witnesses to that sighting... ) I had my phone with me and hit the zoom and snapped a picture of the object as it was descending behind the tree line over our neighbor's house. The picture sucks, showing only a pinprick of orange light, but that's not what it looked like to the naked eye, but while I was intent on focusing the camera, my fiancee saw a small white round glowing object drop out of the bottom of the orange sphere and then it descended low enough to be obscured by the trees. It was 9:00 pm EST when we first saw it, the camera phone shot will have the time and date stamped on it and we will upload it for what it's worth. At exactly 9:20 pm EST, the object reappeared above the same tree and and it was smaller, and looked much farther away then during our first sighting. We ran out into the front yard, hoping for a less obscured viewing but the trees that line our street prevented us from even seeing it amidst the branches. We both tried to guestimate how large it was, using the plane that was passing by, higher and over the object by about 4 inches in the sky (we live by Lunken Airport and are familiar with planes landing and taking off) and since we aren't experts or pilots, have no frame of reference to judge exactly how high it was in the sky. The plane was a few millimeters long, with the usual flashing beacon light and it was probably on it's way away, and the plane had taken off from Lunken as it was ascending and silent and this object was a golf ball size in comparison... and the plane was silent, and the object was too and it dwarfed the size of the plane so we're not sure how high either one was since there was no sound. We had a sighting like this, exactly like this unidentified glowing orange sphere, but that object we saw and reported, split into two smaller orange spheres but this one did not... so we are basically speechless that we are seeing the same exact thing once again, without the splitting, at about the same time of year from 2 years ago. Since we saw the first one two years ago, we were careful to at least get the exact time and we are hoping that anyone else in the area who saw the same thing will report. I called my fiancee's mom who lives only a few miles away so she could run out and look up in the sky to see if she saw it, but she did not see it (her neighborhood is hilly and older with lots of trees as well) We have run through all the possibilities of what conventional or explainable object could appear and hover, then keep moving but we still, like the first sighting, cannot think of what it could be. It was not flares, it was not a hot air balloon, it is not a night-time blimp, and we don't think it was a remote-controlled device due to it's size and the way it moved. It was too slow to be any of those we are guessing and obviously we ruled out meteorite, because we have seen videos of those etc. If it's possible to file a FOA request at Lunken Airport for the radar tower ASAP, we would highly recommend you do so if at all possible, since we know your office is there and that would be awesome! I stopped in to chat one day and I remember how you told me that you have to be quick in doing the FOA filing, so that is why I am reporting it directly after the event. I am dying to know what this is and if there is a logical explanation I would love to know! If you would call me, and tell me how to file for the FOA file from the radar tower, I will do the leg work just to satisfy my curiosity!!! Please don't hold the photo against this report, it's truly terrible, we know that!! We scoff at similar photos but it's all we have! Thanks for all you do MUFON!"],"City":"Cincinnati","Longitude":"-84.387831","Object Features":"None","Case Number":"51311","Summary":"Glowing orange perfectly round slow moving, hovered, moved again","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=39.110941,+-84.387831(51311)&iwloc=A&hl=en\"> mufon case (51311) map </A>","Sighting Duration":"Undisclosed","Latitude":"39.110941","Region":"Ohio","files":["/var/www/straped/mufon/html2text/51311.html.txt","/var/www/straped/mufon/more/51311_submitter_file1__Photo.jpg","/var/www/straped/mufon/org/51311.html"],"Country":"United States","Object Shape":"Fireball","trends":["There have been 82 other sightings in Cincinnati","There were no other sightings in Cincinnati on or around October 4th 2013","This sighting has never been favorited.",""],"Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Stationary,Hovering then path,Path then hovering","Date of the Event":"10/04/2013 09:20 UTC","Viewing Distance":"Unknown"}