{"Region":"England","Viewing Distance":"21-100 Feet","trends":["There have been no other sightings in Broxbourne","This sighting has been favorited 1 time."],"Weather Factors":"Unknown","Log Number":"GB-10052013-0004","divs":["Sighting DetailsI was walking my dog at 10pm , stopped to cross road, looked to my right to see if any traffic was coming then noticed it in the sky coming over a building very big and low. I just stood and watched as it came towards me, it stopped above my head it was completely silent. As was everything else around me, I was stunned it was like an egg shape on its side, I did notice what looked like 3 very dim lights in centre underneath, I remember red yellow but can't b sure of 3 rd colour . I did notice 2 loofed panels flush with body of ship. It began moving again very slow away from me in front of me. At this time I remember looking down at my dog as she hadn't pulled on her lead at all and she was looking up at it too. I looked quickly around for anyone just to shout look but no one was around at all. I walked across the rd as far as I could as train lines and marshes prevented me going further, I watched to it was completely out of sight. Then ran home and phoned everyone ."],"Source":"MUFON","Disposition":"Unresolved","Object Shape":"Egg, Oval, Other","City":"Broxbourne","Date Submitted":"10/05/2013 06:58 UTC","Case Number":"51316","Country":"United Kingdom","map":"<A HREF = \"http://maps.google.com/maps?q=51.726764,+-0.021628(51316)&iwloc=A&hl=en\"> mufon case (51316) map </A>","Date of the Event":"08/11/1998 10:10 UTC","Longitude":"-0.021628","files":["/var/www/straped/mufon/html2text/51316.html.txt","/var/www/straped/mufon/org/51316.html"],"Latitude":"51.726764","Summary":"Came from righ side behind me, slowly, stopped above my head for some time, continued in front of me slowly away","Sighting Duration":"Undisclosed","Object Features":"Louvres","Tags":"City","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering"}