{"Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Cylinder","divs":["Sighting DetailsI was standing in the yard looking west to ascertain if storms were headed our way. I observed a white cylinder shaped object approaching from the west. The object was smaller in the front and larger in the back sort of like a spy glass. It had a narrow black band in the middle and seemed to be spinning as it flew past. Object wasn't that high up, maybe 6 or 7 hundred feet. There were no wings or tail on craft and it seemed to be pulled along as if on a string. The object just sort of appeared out of nowhere and disappeared in the same way while heading east. It made no sound and had no contrail. This is my fourth sighting of same said craft over our area. I get frustrated because I want to know what these things are. On two occasions I observed two of these craft, one right behind the other. Three other people have told me that they have seen the same objects and I have urged them to report it. I'd like to add that these things seem to come out of nowhere and then disappear as if the sky swallows them up. I am 58 yrs old and have no reason to report something bogus to you folks. There are definitely some strange things flying over our state."],"Date of the Event":"10/05/2013 03:40 UTC","Tags":"City","Region":"Mississippi","map":"<A HREF = \"http://maps.google.com/maps?q=31.548866,+-91.219389(51322)&iwloc=A&hl=en\"> mufon case (51322) map </A>","Log Number":"US-10052013-0010","Date Submitted":"10/05/2013 05:52 UTC","Sighting Duration":"00:05:00","Case Number":"51322","Weather Factors":"Unknown","Longitude":"-91.219389","Source":"MUFON","files":["/var/www/straped/mufon/html2text/51322.html.txt","/var/www/straped/mufon/org/51322.html"],"Disposition":"Unresolved","Summary":"White rotating cylinder craft passed over house","Latitude":"31.548866","trends":["There have been no other sightings in Roxie","This sighting has never been favorited."],"Object Features":"Other","Object Flight Path":"Straight-line path","City":"Roxie","Country":"United States"}