{"Longitude":"-96.389854","Log Number":"US-10052013-0012","Summary":"I witnessed 2 orbs , got 3 pics of 1 of them.","Weather Factors":"Unknown","City":"Brenham","Date of the Event":"10/02/2013 10:30 UTC","divs":["Sighting DetailsThis is my 4th sighting in the same area in the last 3 yrs. I was coming home from a hunting trip eastbound on 290 at 36 (brenham tx) I was looking for them. I had seen hovering pulsating orbs in pairs n 3s several times coming and goin to my ranch, comin from houston so ive been keeping an eye out. I saw 2 orbs, 1 close n bright, just south of the walmart, the other was lower, n further away, the 2nd was lower than the cl I se 1. I pulled into the lft turn lane and got my phone . I was too slow, by the time I got my camera up, the 1st orb pulsated n went superbright, then out. Where the orb was, now howvered a black triangle w a light on each point. It moved effortlessly east to west, dirwxtly over me n gone. I was able to catch 3 images of the 2nd stationary one. I got my pics n traffic behind me made me move on. This was the 4th or 5th time I have seen them. Oct 12 I saw 3 orbs , 1 flashed out n a triangle flew directly over my farmhouse, helicopter altitude but totally silent. I have seen them over the walmart in brenham 3 times b4.the 1st time I was in wonder, the 2nd 3rd n on I felt extereme curiosity and a drive to know what I was lookin at, no fear or negative feelings."],"Latitude":"30.174293","Case Number":"51324","Source":"MUFON","trends":["There have been 2 other sightings in Brenham","There were no other sightings in Brenham on or around October 2nd 2013"],"Object Shape":"Cigar, Triangle","Tags":"City","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/51324.html.txt","/var/www/straped/mufon/org/51324.html"],"Region":"Texas","Object Features":"Other","Sighting Duration":"Undisclosed","Date Submitted":"10/05/2013 09:06 UTC","Country":"United States","Object Flight Path":"Hovering then path","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=30.174293,+-96.389854(51324)&iwloc=A&hl=en\"> mufon case (51324) map </A>"}