{"Country":"United States","Latitude":"26.175966","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Viewing Distance":"Unknown","Source":"MUFON","Object Shape":"Disc, Flash, Star-like","City":"Oakland Park","Weather Factors":"Unknown","Tags":"City","Log Number":"US-10052013-0015","trends":["There have been 4 other sightings in Oakland Park","There were no other sightings in Oakland Park on or around October 5th 2013"],"Date Submitted":"10/05/2013 11:37 UTC","Summary":"Saw flat yellow/light white disc overhead moving SW over Oakland Park FL","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=26.175966,+-80.126749(51327)&iwloc=A&hl=en\"> mufon case (51327) map </A>","Sighting Duration":"00:03:00","Case Number":"51327","files":["/var/www/straped/mufon/html2text/51327.html.txt","/var/www/straped/mufon/org/51327.html"],"Region":"Florida","Date of the Event":"10/05/2013 09:32 UTC","Longitude":"-80.126749","divs":["sighting detailsjust stepped outside my home which faces nearly due north. looked almost straight up and saw what might at first glance be a party balloon. the time was 9:32 pm so the night sky was quite dark with few clouds, almost none. the object appeared to be flat disc shaped, faintly yellow\\light white, possibly transparent. the object was at least at cloud level or above and moved silently south-west. i could not guess the size or speed but we have many planes in the area and this object did not have the telltale blinking lights of an aircraft. if i could speak to perspective i would say holding my arm straight out with pink extended the object would have been at most the circumference of my pinky finger, flat disc shaped, like a round punch out using a 3 hole punch from a piece of paper. i quickly ran to my front door and called my wife out. she arrived seconds later to see the object recede into the distance until it was out of sight. as it moved away the object stayed bright in the sky like a star but eventually was too far away to track. the time from first observance to no longer visible was perhaps one to one and a half minutes. this time-frame would make it nearly impossible to be an aircraft for the speed it moved out of sight. a moment later my wife observed another object which i noted to be same in shape and coloration to the first, possibly higher, and moving more south than south-west. we observed it for perhaps 30 seconds to one minute until it was too far away to track. another moment or so in the same area where the first faded out of sight a single bright star like flash occurred which we both saw. we waited to see if this was a mere \"twinkle\" of a true star but there was not a star in the sky at that position. this light flash to me was blue\\white. i kept looking nearly straight up hoping to see another disc object but while doing so my wife said she saw a second flash in the same area of the first, this second flash very blue and not white. there was sparse light clouds during the event with very little or no air traffic until after the event."]}