{"Weather Factors":"Unknown","Date Submitted":"10/05/2013 11:47 UTC","Viewing Distance":"101-500 Feet","Latitude":"33.846108","trends":["There have been 4 other sightings in Athens","There were no other sightings in Athens on or around October 3rd 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.846108,+-83.310553(51328)&iwloc=A&hl=en\"> mufon case (51328) map </A>","Country":"United States","Sighting Duration":"Undisclosed","Longitude":"-83.310553","Object Shape":"Triangle","Tags":"City","Disposition":"Unresolved","Object Flight Path":"Hovering then path","divs":["Sighting DetailsMy husband and I were driving back from working late at an office along Gaines School Road (from North to South) just after midnight on October 3rd, 2013, when I saw two slow-moving round white lights a few blocks away. I figured it was an airplane or something, but as we got closer it stopped moving entirely. So when we got alongside it, my husband pulled into a parking lot where a K-Mart used to be (but is now a deserted parking lot, between two grocery stores). As we got closer, it seemed no bigger than a go-kart, with 3 bright blue-white lights forming a triangle. One of the lights appeared slightly dimmer than the other two. I rolled down the window of the car to get a better look. I could make out a dark gray triangle shape supporting the three lights. My husband pulled underneath it, and it was up, maybe 150 ft. in the air, but the instant we got under it, the object started to move north. At this point, we assumed it must be some kind of remote-controlled aircraft (with lights?) and looked for someone operating it as we drove. We saw no one. It began to move faster and we continued through the long strip mall drive following behind it. It moved steadily and continued to pick up speed. We lost sight of it when it went over the Jittery Joe's on Barnett Shoals Rd., and by the time we got on the other side of the building, it was completely gone. It was heading in the direction from which we originally came. It was a clear and well lit night and we could see most of the sky from the road. We both felt stunned and very puzzled by what we had seen. A friend of ours reported seeing an identical flying object in size, shape, and movement on the westside of Athens a few days later on October 5th, 2013 around 10:00 pm."],"files":["/var/www/straped/mufon/html2text/51328.html.txt","/var/www/straped/mufon/org/51328.html"],"Region":"Georgia","Source":"MUFON","Log Number":"US-10052013-0016","Date of the Event":"10/03/2013 12:00 UTC","Object Features":"Unknown","Summary":"Go cart sized triangle shaped craft with three bright blue-white lights hovered 150 ft above empty parking lot then flew North from South Eastern Athens, Georgia","City":"Athens","Case Number":"51328"}