{"Weather Factors":"Unknown","Region":"New Mexico","Case Number":"51329","Summary":"BRIGHT LIGHT 5 MINUTE DURATION. DID NOT MOVE, NO NOISE. BLINKED OUT","Longitude":"-105.871161","Source":"MUFON","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-10062013-0001","Latitude":"35.486856","Date Submitted":"10/06/2013 01:06 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.486856,+-105.871161(51329)&iwloc=A&hl=en\"> mufon case (51329) map </A>","Object Flight Path":"Stationary","trends":["There has been one other sighting in Lamy","There were no other sightings in Lamy on or around October 5th 2013"],"files":["/var/www/straped/mufon/html2text/51329.html.txt","/var/www/straped/mufon/org/51329.html"],"Object Features":"Unknown","Object Shape":"Star-like","City":"Lamy","Date of the Event":"10/05/2013 09:00 UTC","divs":["Sighting DetailsDOG STARTED BARKING INTENSELY. BARKING WENT ON FOR 30 SECONDS DOG RAN INTO THE HALLWAY TO COME ALERT ME, WAS HIGHLY RELIEVED WHEN I RESPONDED THINKING IT WAS A MOUNTAIN LION< I LOOKED OUTSIDE. I SAW NOTHING IN THE SURROUNDING AREA HORIZONTAL TO THE HOUSE. I LOOKED OUT YHE WINDOW AND SAW BRIGHT OBJECT HANGING IN SKY ABOVE MY NEIGHBOR'S CATTLE RANCH. . OPENED DOOR, NO NOISE. EXTREMELY BRIHT LIGHT, NO AVIATION STROBES. NO ENGINE NOISE. STARTLED, I RETREATED INTO HOUSE, WENT UPSTAIRS, WHERE MY WIFE WAS AWAKENED BY DOG SHE SAID, 'THAT'S NOT A STAR... LOOK AT THE TWO LIGHTS!\" I THEN REALIZED THAT THERE WAS APPARENTLY A MUCH SMALLER LIGHT TO THE SIDE OF THE BIGGER ONE. THAT SMALL LIGHT THEN WENT OUT AFTER 30 SECONDS AND SEEMED TO FLY IN A CIRCLE THEN INTO THE BIGGER LIGHT.. THE GER LIGHT SEEMED TO BE STATIONARY... BUT SLOWLY APPROACHING. BIG LIGHT WAS ROUGHLY A FEW THOUSAND FEET AWAY AND APPARENTLY CLOSING ON MY LOCATION. PERHAPS 2000 FEET to a MILE IN ALTITUDE ABOVE.. SUDDENLY IT 'BLINKED' OUT AND THERE WAS COMPLETE DARKNESS. EXTREMELY< EXTREMELY, BRIGHT LIGHT. TURNED OFF AS IF A SWITCH WAS TURNED OFF. THEN TOTALLY BLACK. NO SHAPE. NO AFTER GLOW. NO SOUND AT ALL. NOT A HELICOPTER, NOT AN AIRPLANE. NOT A BALLON. NOT A BLIMP. BAFFLED."],"Disposition":"Unresolved","Sighting Duration":"Undisclosed","Country":"United States"}