{"Sighting Duration":"00:05:30","trends":["There have been 3 other sightings in Canterbury","There were no other sightings in Canterbury on or around September 3rd 2007"],"Object Flight Path":"Path with directional change","Country":"United Kingdom","Date Submitted":"10/05/2013 07:06 UTC","City":"Canterbury","Log Number":"GB-10052013-0011","Source":"MUFON","divs":["Sighting DetailsMe and my friend was on a early morning hike from Dover to Folkestone in Kent, we took the country route up on the cliffs. When walking I looked up and whitnessed 7 orbs, brightly shining, they changed position and then froze again. As if they were pretending to be stars. The objects caught my attention because of their quick, 90 and 45 degree direction changes. They would freeze and then all move again. I first thought it could be satellites, but I've seen them in orbit before and they just move in one direction across the sky, not stop, reverse, then freeze and repeat. 7 orbs all at once, this made me ponder. The 7 objects were already on the move when I notice them, as I notice them they froze, which I thought was odd. I continued to observe, all 7 then move to different locations in the sky as a cluster then froze again and again, this repeated 3 times then they remained stationary for 5 minutes then they all disappeared. This incident clearly had an affect on me as I've remembered it all these years, I would like answers for it. I am mostly confused by what I witnessed that day as it looked un-human to me. I remain confused and would like answers. When the objects froze for the last time they remained there for 5 mins and then disappeared, just like a light had been switched off. Me and my friend both witnessed this."],"Viewing Distance":"Over One Mile","Object Features":"None","Disposition":"Unresolved","Summary":"7 orbs directly overhead, hovering, changing directions.","Region":"England","Tags":"City","Weather Factors":"Unknown","Case Number":"51323","map":"<A HREF = \"http://maps.google.com/maps?q=51.310741,+1.066976(51323)&iwloc=A&hl=en\"> mufon case (51323) map </A>","Latitude":"51.310741","Longitude":"1.066976","Object Shape":"Sphere, Star-like","files":["/var/www/straped/mufon/html2text/51323.html.txt","/var/www/straped/mufon/org/51323.html"],"Date of the Event":"09/03/2007 07:30 UTC"}