{"Tags":"City","Log Number":"US-10062013-0003","Object Features":"Unknown","Longitude":"-89.513568","Disposition":"Unresolved","Weather Factors":"Unknown","Region":"Missouri","Case Number":"51331","Object Flight Path":"Unknown","Source":"MUFON","Date of the Event":"10/05/2013 11:49 UTC","Latitude":"37.312904","divs":["Sighting DetailsClose to midnight my wife and I were sitting in the living room watching TV on the computer when suddenly a bright focused beam of white light approx. twenty feet in diameter swept through the top of the tree in the neighbor's front yard, across the neighbor's driveway, over the top of her car and into our window, blinding us as we turned to look at it. Then it quickly swept back across the road and was gone. The whole thing happened in less than three seconds. At first we thought it was a helicopter, so my wife turned our light off to get a better look out the window. My wife opened the window and outside was silent, except for the crickets. Had it been a helicopter shining a light, it would have had to have been less than 200 ft above us and we would have heard it. We looked out about 10 seconds after seeing the light when my eyes adjusted from the light. There were no other lights in the air to indicate any sort of aircraft. The light beam was very focused and bright. We could not see the object it was coming from. It was surprising how fast and bright it was but it did not light up the rest of the surrounding area, only where the beam was shining. It gave us goosebumps and made us feel extremely uneasy. I have never seen a light like it."],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/51331.html.txt","/var/www/straped/mufon/org/51331.html"],"Object Shape":"Unknown","Country":"United States","trends":["There has been one other sighting in Cape Girardeau","There were no other sightings in Cape Girardeau on or around October 5th 2013"],"Summary":"Bright beam through the window","Date Submitted":"10/06/2013 01:36 UTC","Viewing Distance":"Unknown","City":"Cape Girardeau","map":"<A HREF = \"http://maps.google.com/maps?q=37.312904,+-89.513568(51331)&iwloc=A&hl=en\"> mufon case (51331) map </A>"}