{"divs":["Sighting DetailsLast night, around 8:30 my wife, myself and daughter in law, were standing outside watching what appeared to be a satellite making its way from the south sky to the north, when all three of us at the same time saw out of our peripheral what first appeared as a circular grouping of birds surrounded in a fog, flying very fast. Within seconds it was obvious they weren't birds as we all noticed the circular formation was pretty much a near perfect grid with a few around the sides that kept it from being a perfect circle. In no more than 10 seconds at very low altitude, the cluster flawlessly formed a V shape, and then again, flawlessly went into a straight line (side by side) formation, all at very high speed, and all silently of course. Our \"low altitude\" field of view, staring straight up with obstructions was approximately 1-2 miles. I would guess 600 mph or greater at no more than a few thousand feet. We all agree that they weren't really lit up, but more like reflections of horizon and ground light. Almost transparent looking. I was obviously amazed and at the same time very disturbed at what we saw. Basically this \"other worldly\" synchronized night formation flying was a display of power and precision beyond a critical thinkers comprehension. Made me realize in that moment we are no match for what flew over. Magnificent and frightening all in a few seconds. I would consider this one a life altering event. HOLY SMOKES!! or as in all our words last night \"WTF was THAT!!!\""],"Case Number":"51345","Disposition":"Unresolved","Tags":"City","Longitude":"-91.663833","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/51345.html.txt","/var/www/straped/mufon/org/51345.html"],"Region":"Iowa","Object Flight Path":"Straight-line path","Log Number":"US-10062013-0017","Latitude":"41.97908","Weather Factors":"Unknown","Country":"United States","Date of the Event":"10/05/2013 08:45 UTC","City":"Cedar Rapids","map":"<A HREF = \"http://maps.google.com/maps?q=41.97908,+-91.663833(51345)&iwloc=A&hl=en\"> mufon case (51345) map </A>","trends":["There have been 17 other sightings in Cedar Rapids","There were no other sightings in Cedar Rapids on or around October 5th 2013"],"Object Shape":"Boomerang, Disc, Other","Date Submitted":"10/06/2013 03:42 UTC","Sighting Duration":"Undisclosed","Summary":"multiple object flyover"}