{"Log Number":"US-10062013-0020","files":["/var/www/straped/mufon/html2text/51348.html.txt","/var/www/straped/mufon/org/51348.html"],"Disposition":"Unresolved","Latitude":"42.28072","Weather Factors":"Unknown","Longitude":"-72.722634","City":"Easthampton","Case Number":"51348","Date of the Event":"10/05/2013 08:17 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.28072,+-72.722634(51348)&iwloc=A&hl=en\"> mufon case (51348) map </A>","Sighting Duration":"00:02:05","Region":"Massachusetts","Object Flight Path":"Path then hovering","Tags":"City","Country":"United States","Object Features":"Unknown","Summary":"Two objects appeared out of northern sky and hovered then disappeared...a third appeard on same path then disappeared","divs":["Sighting DetailsEight of us were sitting around a fire enjoying beverages and good company when I noticed what I thought was a bright ember from the fire through the trees. My back was facing south so this object was coming from a northern direction. I then realized it was moving north to south so I asked the two women next two me if that was a plane moving in the sky. They thought it was but we quickly changed our opinions when the object came into view out of the trees. The object was moving at about the rate of a plane and was directly overhead when I noticed another similar object through the trees following right behind. The first object continued to move in a north to south flight path when the second object seemed to speed up and catch the first but still keeping a distance of no more than 100 or 200 feet in the sky. As soon as they were about that distance away from each other they stopped and hovered in the sky...that's when we knew we were witnessing something other worldly or classified. At that point these two objects got dimmer and dimmer and then just disappeared...the whole time staying stationary in the sky. Then someone in the group noticed a third object, again traveling in a north to south fashion in the sky. This object appeared to be similar just a little more brilliant orange and red than the first two. This is the object that we finally caught on an iPhone camera and watched as it traveled and stopped then seemed to dim and disappear in the same manner. I have been watching the skies all my life, and never have seen anything like this. You may think you see something and then logical explanations will surface. All eight of us could not come up with a logical explanation for what we all saw last night."],"Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"10/06/2013 06:04 UTC","trends":["There have been 4 other sightings in Easthampton","There were no other sightings in Easthampton on or around October 5th 2013"],"Source":"MUFON","Object Shape":"Circle, Sphere, Star-like"}