{"Object Flight Path":"Straight-line path","Object Shape":"Unknown","Region":"New Hampshire","Viewing Distance":"21-100 Feet","Longitude":"-71.128404","Object Features":"Patterned Surface, Unknown","Weather Factors":"Unknown","Disposition":"Unresolved","trends":["There have been no other sightings in North Conway","This sighting has never been favorited."],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/51359.html.txt","/var/www/straped/mufon/org/51359.html"],"Latitude":"44.05368","Case Number":"51359","Date Submitted":"10/07/2013 01:43 UTC","Sighting Duration":"Undisclosed","Tags":"City","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=44.05368,+-71.128404(51359)&iwloc=A&hl=en\"> mufon case (51359) map </A>","Date of the Event":"06/21/1974 12:00 UTC","Summary":"sleeping at a campsite ,i woke up to see a craft right above the treeline right over our heads moving very slowly from left to right.","City":"North Conway","divs":["Sighting Detailsmy lady and I were camping off the Kangamangus highway at the Blackberry Crossing campsite on the eastern end of the highway. We were in sleeping bags under the stars, no tent.Something woke me up around 3am and right above our heads just above the treeline was a craft moving very slowly from left to right.The treetops were in a circular shape and one third of this craft blocked out the stars. As it slowly moved to the right i saw red and white lights on what seemed like the side of the ship. I could not make out the shape of it.As the rear of the craft passed over us I noticed the rear was lit up. It was sort of oval shaped and it was very bright and the orange-yellow colors in this oval seemed to move or flicker.After it passed beyond the treeline and out of our sight,I got out of the sleeping bag and ran down a footpath in the same direction as the craft but saw nothing .The whole episode took about a minute or so.It was almost 40 years ago but I remember that minute or so like it was yesterday.One more thing, when I say it was moving slow above the treeline ,it was going no faster than a person taking a very, very slow walk. The humming I mentioned was weird, you could almost feel it as well as hear it. I spent some time in U.S. Air force. i have been around B-52s, B-47s and some fighters of the time ande we had nothing that I know of that could travel almost silently at treetop level going 2 or 3 mph. I will never forget that night."],"Log Number":"US-10072013-0006"}