{"City":"Vernal","Tags":"City","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path,Path with directional change","divs":["sighting detailssighting background (narrative of mufon investigator tom benson) friends from florida were visiting a co-worker of mine during the christmas holidays. my co-worker knew the couple for three years. the co-worker's wife was a roommate of the witness' wife while in college. they had a discussion at the time concerning the movie, close encounters of the third kind. the witness had not seen the movie, but mentioned his own sighting to his friends. i mailed a questionnaire and blank tape to the witness soon afterwards, when my co-worker reported the sighting to me. sighting account (narrative of witness) on june 26, 1975, my wife and i were headed west on rt. 40 from craig, co, to vernal, ut. i believe the sighting occurred slightly inside the border of utah, but i'm not exactly certain. we were entering a valley with mountains on the horizon when i saw to my left (south) at 11 o'clock a flash similar to a reflection from a bright metallic object. the object then flew in front of us following the road leading west. at this time it was 1\\4 to 1\\2 mile away from us and several hundred feet from the valley floor. it stayed on this course for a short period of time and then flew off to the southwest at an incredible rate of speed. my wife was asleep at the time and, frankly, i was so stunned to see the thing that i forgot to wake her up. when i first saw the reflection and then the object, i was sure i was seeing a reflection on the glass so i moved my head and observed that the object was now clearer. i went through every explanation i could think of for what i was seeing, but it became evident that what i ovserved was a metal, polished, stainless steel type of craft that resembled two saucers placed together one upside down on top of the other. the best way to describe it was that it was the epitome of the so-called \"flying saucer.\" it was near enough tso that i could see the midline separating the two ovals. this is not to say that it was a stripe or any such marking, as there were none, but it was the metal line that indicated where the two parts of the saucer were joined. i saw the object from a number of different positions so i am quite certain as to what i saw. it did not appear to be spinning, but could have been. the most pronounced feature was its incredible velocity. i might add, oddly enough, i don't believe there were any other cars present at the time."],"Date of the Event":"06/26/1975 12:00 UTC","Disposition":"Unresolved","Log Number":"US-07242006-0001","Latitude":"40.455516","Country":"United States","Object Features":"None","files":["/var/www/straped/mufon/html2text/5136.html.txt","/var/www/straped/mufon/org/5136.html"],"Object Shape":"Disc","Summary":"Witness driving on remote road in NE Utah sees glint of light, then disk.","Weather Factors":"None","Longitude":"-109.528748","Date Submitted":"06/26/1975 12:00 UTC","trends":["There have been 5 other sightings in Vernal","There were no other sightings in Vernal on or around June 26th 1975"],"Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=40.455516,+-109.528748(5136)&iwloc=A&hl=en\"> mufon case (5136) map </A>","Region":"Utah","Source":"MUFON","Case Number":"5136"}