{"Date Submitted":"10/07/2013 06:29 UTC","City":"St. Helens","Source":"MUFON","Object Shape":"Triangle","Country":"United States","Case Number":"51364","Tags":"City","Object Features":"None","files":["/var/www/straped/mufon/html2text/51364.html.txt","/var/www/straped/mufon/org/51364.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=45.844723,+-122.881134(51364)&iwloc=A&hl=en\"> mufon case (51364) map </A>","Log Number":"US-10072013-0011","Date of the Event":"10/06/2013 12:00 UTC","Region":"Oregon","trends":["There has been one other sighting in St. Helens","There were no other sightings in St. Helens on or around October 6th 2013"],"Weather Factors":"Unknown","divs":["Sighting Detailsclear windless night, approx. 35 miles from portland oregon,(NW). Outside on my back deck and saw what first appeared to be a fireball low in the sky. However upon closer observation, the object was not a fireball as it was traveling in a horizontal path. Bright orange triangle shaped object with very bright color. Observed object for approx. 1-2 minutes. I called my neighbor to see if they had seen it, and as we were talking, another similiar object flew over in the same path. neighbor's observed the same thing. Bright orange triangular object traveling in the same direction. As we talked about the direction, i went out my front door, and saw the third set of exactly the same thing in the sky heading again from SW to NE. Neighbors also went into their front yard and followed it. The third object traveled in the same path but lights went out at about the 1:00 position on a clock, after it passed over the neighbors house on the north side, this time much closer. Objects were all silent. A small commuter type jet flew approx 2 miles east following the Columbia River, but much higher at the same time, so that pilot should have seen the second object as it was directly in front of him, although lower in elevation."],"Latitude":"45.844723","Longitude":"-122.881134","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Viewing Distance":"21-100 Feet","Summary":"3 sets of orange lights, traveling from sw to ne. approx 3 minutes apart, same direction/path"}