{"map":"<A HREF = \"http://maps.google.com/maps?q=26.141856,+-97.921572(51361)&iwloc=A&hl=en\"> mufon case (51361) map </A>","Object Shape":"Circle, Disc, Oval, Sphere","Log Number":"US-10072013-0008","Country":"United States","files":["/var/www/straped/mufon/html2text/51361.html.txt","/var/www/straped/mufon/org/51361.html"],"Date Submitted":"10/07/2013 03:19 UTC","Latitude":"26.141856","City":"Mercedes","Longitude":"-97.921572","divs":["Sighting Detailsme and a friend are outside his porch when I decide to look up at the sky. I noticed an object or possible light moving at multiple directions. at first I blew it off as some kind of circus light...but it continued to appear and disappear..at that point I told my friend to look into the sky to verify what I see. once he did he verified he also saw the circular object moving at tremendous speed and multiple directions. once he acknowledged to me that he also sees the ufo he decides not to look back in fear...I told him he had to look and at that point I started to take pictures with my cell phone..soon after the object never reappeared. during this sighting the object seemed to have the ability to almost look blurry. like it was spinning so fast that it looked blurry..i have at least one good photo showing the object moving at a high rate of speed it left a trail. looking at the object put a strain on my vision. I had to look at other stars to make sure my vision was ok...please reply back so that I will be able to down load this picture..i need help from my son"],"Sighting Duration":"Undisclosed","Tags":"City","Date of the Event":"10/04/2013 11:15 UTC","Object Flight Path":"Path with directional change,Path then hovering","Disposition":"Unresolved","Source":"MUFON","Region":"Texas","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Case Number":"51361","Summary":"ufo appeared to look blurry in the sky but all the stars looked perfectly visible","Object Features":"Unknown","trends":["There has been one other sighting in Mercedes","There were no other sightings in Mercedes on or around October 4th 2013"]}