{"Region":"West Virginia","Disposition":"Unresolved","Viewing Distance":"Unknown","Longitude":"-82.443954","Object Flight Path":"Hovering then path","Summary":"saw this lite twice same area about 1 or 2 months apart","Object Features":"Unknown","Tags":"City","Date of the Event":"10/07/2013 07:30 UTC","Object Shape":"Unknown","City":"Huntington","Case Number":"51371","Sighting Duration":"Undisclosed","Latitude":"38.42274","Date Submitted":"10/07/2013 10:41 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.42274,+-82.443954(51371)&iwloc=A&hl=en\"> mufon case (51371) map </A>","Log Number":"US-10072013-0018","files":["/var/www/straped/mufon/html2text/51371.html.txt","/var/www/straped/mufon/more/51371_submitter_file2__10.7.13004.jpg","/var/www/straped/mufon/org/51371.html"],"trends":["There have been 15 other sightings in Huntington","There was one other sighting in Huntington on or around October 7th 2013","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Source":"MUFON","Country":"United States","divs":["Sighting Details1.. I was doing a load of laundry (which is outside in my garage) walking back inside I looked up and saw this thing in the ski. 2..the reason I looked up in this area is because about 1-2 months earlier I saw this same thing or lite behaving the same way moving very slowly in the ski (same direction),only the first sighting the time was about 1 or so a.m. in the morning. this second sighting the time was about 7:30 pm. or so. when I first noticed it, it wasn't quit all the way dark out yet and you could see something in the ski(not a lite, just an object) by the time I got my phone and started taping, it was getting dark and you can see this lite. The only thing I can think what it was that makes any sense is MAYBE some GPS plane (because I saw it twice in same area behaving the same way) or a UFO. As you can see in the video, its moving very slow. I also have a picture that I took from my droid phone (that is not active in service, I just use it for pics and video) from the time I first saw it, I got in my truck and drove down the street to get a better look at it because the tree tops were blocking it alittle. I pulled in a parking lot and took a pic of it, and a small video. then I drove about 3-4 blocks or so to get a better look at it and that's when I shot the video. you can see the moon next to it in the video. after taking video of it, I left and got something to eat at BK. I Drove across the bridge to go back home and I looked up and it was still up there in the ski at around 8:00 pm. in the same area. when I pulled in my driveway back home, looked up and it was gone. I don't know if the pic and videos got uploaded or downloaded (whichever is correct)to this site or not, but I have them on my phone and on my computer. If they didn't, I can try to email them to you. I was able to upload them from my phone to my computer."]}