{"Disposition":"Unresolved","Date Submitted":"10/07/2013 10:33 UTC","Log Number":"US-10072013-0016","Date of the Event":"11/20/2010 08:30 UTC","trends":["There have been 45 other sightings in Grand Rapids","There were no other sightings in Grand Rapids on or around November 20th 2010"],"Country":"United States","Object Features":"Unknown","Viewing Distance":"20 Feet or Less","Object Shape":"Circle, Sphere","Case Number":"51370","Tags":"City","Latitude":"42.973621","Sighting Duration":"Undisclosed","divs":["Sighting Detailsme and my two daughters were walking our dog on a early evening weekday, jessica bent down to tie her shoe, after she finished she said \"dad what that and was pointing up to the northern part of the sky (right ahead of us) at the time she said that i was talking to my other daughter and holding the leash to the dog, so we all 3 looked to where she was pointing and was amazed at what we was looking at, it looked like a small moon that was beyond the color red-orange! it looked like it was on fire, and the intensity of that color was something i NEVER seen before and haven't yet, so, as we stand in silence and watch this thing it's just sitting in the sky, (i'de say about 19-25 feet above our heads) not moving at all. i had goodsebumps and a feeling of not knowing whats gonna happen, but i felt fear and i know my 2 daughters were feeling that fear too, you could just feel it. so after about 55 seconds the object finally moves a little upwards and starts heading west very slowly, so we started to walk fast to see were it was going it picked a little speed and was gone through the tree lines, we were shocked. jessica says \"dad what was that?\" i said what do you think it was and she looked at me and said a ufo and i smiled at her"],"Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/51370.html.txt","/var/www/straped/mufon/org/51370.html"],"Weather Factors":"Unknown","City":"Grand Rapids","Region":"Michigan","Longitude":"-85.762731","Summary":"big ball of fire being driven intelligently seen in sky","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.973621,+-85.762731(51370)&iwloc=A&hl=en\"> mufon case (51370) map </A>"}