{"City":"Toronto","Date Submitted":"10/08/2013 01:09 UTC","Log Number":"CA-10082013-0009","Longitude":"-79.286584","Summary":"Three witnesses, a man, his wife and his step-daughter, saw a disk shaped flying object going west, east and south increasing speed, they were excited.","Country":"Canada","map":"<A HREF = \"http://maps.google.com/maps?q=43.700067,+-79.286584(51384)&iwloc=A&hl=en\"> mufon case (51384) map </A>","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/51384.html.txt","/var/www/straped/mufon/org/51384.html"],"Object Shape":"Disc","Case Number":"51384","divs":["Sighting DetailsThree persons saw a disk shaped flying object fly in the clear moonless sky. The witnesses were a man, his wife and his step-daughter. That man first saw the object's side view which looked like a rectangle flying in the west. As he continued to watch it, it got closer to him in an eastward direction. He realized that it was round, dark and rust orange in color. He later went inside his apartment. That apartment where he lived and saw that object was his previous home. He grabbed a video camera and made a video of that flying object. That man shouted, \"There is a flying saucer outside!\" His wife and step-daughter came to see that flying object. That UFO came closer at about 2200 feet. His wife noticed that the UFO had what looked like modular markings at the edges of it. The UFO flew directly above their heads as they watched it outside next to their home. It was straight up going east. Later it went south at 70 kilometers per hour. Then its speed greatly increased and decreased."],"Source":"MUFON","Region":"Ontario","Latitude":"43.700067","trends":["There have been 136 other sightings in Toronto","There were no other sightings in Toronto on or around May 6th 2006"],"Tags":"City","Date of the Event":"05/06/2006 10:20 UTC","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Object Features":"None","Object Flight Path":"Path with directional change","Sighting Duration":"00:25:00"}