{"Region":"Indiana","divs":["sighting detailswe were traveling west on southeastern ave from 465 . we had just stopped at a stop light at arlington and southeastern ,i was admiring the skyline as the sun was going down on what turned out to be a beautiful day and i saw 5 red\\orange objects hovering very close to one another off to the southwest.at first i thought it was the trailings of an airliner or jet. as we drove closer to raymond st. the objects got closer to one another and then they dispersed. at this time, my husband saw 2 of them headed for each other and they passed each other. one of them disappeared and the other seemed to hover right where it was for a couple of minutes.my husband and i did not quite know what to think of what we were seeing.we pointed at it while stopped at emerson and raymond trying to get the motorists attention in the car next to us but he was either looking too or oblivious. we tried to pull over at sherman and raymond to get a glimpse of what we were seeing and the cluster of three disappeared but the other one became invisible right before our eyes. at this time there was a large air liner that seemed to be decending in its flight pattern that was circling the area and then it was out of sight as well. there was deffinately a huge difference between the airliner that we saw and the red\\orange objects that appeared to be reflecting light that was actually on the other side of the objects as the sun was setting on the side of the objects that we could not see. there was no contrail that would have me believe that these were mearly airplanes or jets, and there was no noise as you would expect from a plane traveling through the area. we don't quite know what we saw , however it was deffinately un identified."],"Object Flight Path":"Stationary,Hovering then path,Other,Unknown","Weather Factors":"Unknown","Date of the Event":"10/08/2013 07:30 UTC","Summary":"Red/orange hovering, things noted southwest of Southeastern and Raymond St.","Log Number":"US-10082013-0012","trends":["There have been 126 other sightings in Indianapolis","There were no other sightings in Indianapolis on or around October 8th 2013"],"Sighting Duration":"Undisclosed","Disposition":"Unresolved","Case Number":"51388","City":"Indianapolis","Longitude":"-86.036436","Object Features":"Unknown","Source":"MUFON","Object Shape":"Cylinder","Country":"United States","Tags":"City","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=39.719824,+-86.036436(51388)&iwloc=A&hl=en\"> mufon case (51388) map </A>","Date Submitted":"10/08/2013 08:52 UTC","files":["/var/www/straped/mufon/html2text/51388.html.txt","/var/www/straped/mufon/org/51388.html"],"Latitude":"39.719824"}