{"Sighting Duration":"Undisclosed","Case Number":"51387","divs":["Sighting DetailsThis event took place in the summer of 1983 when I was 16 years old. I was spending the summer with my grandparents John and Shirley Olson, who worked for a Log Home manufacturing company in Noel, MO. They lived on the property as caretakers and grandpa worked in the manufacturing facility as well. One evening late, I believe that it was mid to late July, I was preparing for bed. I was staying in a small fifth-wheel tow behind camper which was parked just behind and north of the main office building. Across the next lot was a two story Log Home that the owners had built as a Model of what they could offer. As I lay down I was looking out the window up at the stars a light caught my attention from the top of the hill to the east of where I was. To my amazement I could see what I will call a UFO as I do not know what it was.. It glided down the hill to the bottom and crossed the road, South Kings Hwy, and in between the owners Model Home and the camper where I was. The owners were away in Nacogdoches TX, where they had another branch of their log home business. I had a full, unobstructed view of the craft for roughly a full minute as it made its way down the hill and past the house and camper. The object was of a cylinder shape, with a cone on top and flat bottom. The object glided down in a vertical position just above the trees. The cone was lit up from what I can only describe as the inside and the cylinder was black with lighted stripes going around it vertically at about every 3 to 4 feet. It was smaller than the house in height and perhaps 20 feet in diameter. There was no landing gear visible and the bottom was flat and lighted like the cone. The craft hovered silently off of the ground at no more than 4 feet, if that, after it reached the bottom of the hill and crossed the road. At the top of the hill it was about 1000ft away and at it's closest was less than 100ft in distance. As it passed I spun in my bed, now facing west to watch the craft go by the manufacturing facility and cross the Railroad tracks and out of sight. Sorry, I cannot draw or I would love to include a sketch."],"Region":"Missouri","Date Submitted":"10/08/2013 08:33 UTC","City":"Noel","Tags":"City","Disposition":"Unresolved","Country":"United States","Object Features":"Dome, Patterned Surface, Other","Date of the Event":"07/15/1983 10:30 UTC","Longitude":"-94.484622","map":"<A HREF = \"http://maps.google.com/maps?q=36.534141,+-94.484622(51387)&iwloc=A&hl=en\"> mufon case (51387) map </A>","files":["/var/www/straped/mufon/html2text/51387.html.txt","/var/www/straped/mufon/org/51387.html"],"trends":["There have been no other sightings in Noel","This sighting has never been favorited."],"Summary":"saw hovering craft below tree top level within 100 feet unobstructed view.","Object Flight Path":"Straight-line path","Viewing Distance":"21-100 Feet, 101-500 Feet","Object Shape":"Cone, Cylinder","Source":"MUFON","Weather Factors":"Unknown","Log Number":"US-10082013-0011","Latitude":"36.534141"}