{"Longitude":"-80.408421","Weather Factors":"Unknown","Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Disposition":"Unresolved","City":"Christiansburg","trends":["There have been 2 other sightings in Christiansburg","There were no other sightings in Christiansburg on or around October 7th 2013"],"Sighting Duration":"Undisclosed","Object Features":"None","Date Submitted":"10/08/2013 07:04 UTC","Log Number":"US-10082013-0006","map":"<A HREF = \"http://maps.google.com/maps?q=37.156568,+-80.408421(51380)&iwloc=A&hl=en\"> mufon case (51380) map </A>","Viewing Distance":"Unknown","Country":"United States","Summary":"was out on break and looked at sky as i do often and saw object hovering and moving","Tags":"City","Region":"Virginia","Object Shape":"Blimp, Circle, Egg, Sphere","Latitude":"37.156568","divs":["Sighting DetailsAt around 9:10 pm earlier tonight I was on break outside at work. I was joking around and looked at the sky. At first I saw a large slow moving aircraft with bright lights that was being followed by smaller craft, these craft were aircraft as you could hear the sound of the engines as they flew over. This area has a lot of air traffic, the military flies f-15s at regular intervals, at times, multiple times during the week. To the north lies Blacksburg, Va which has a small airport, this airport has various craft from Cesnas, twin turboprop beechcraft and can accomendate for citations and leer jets. Forty miles away is a regional airport located in Roanoke, Va, the craft that operate out of the airport are large commuter planes. Thinking nothing of the large craft overhead as I have seen aircraft at night like that before, I looked to the south and joked if I would see something. A couple of co-workers have said that they have seen something in the night sky previously the week before last. I observed on the horizon a glowing red object, as I watched the object hovered, moved slowly back and forth, then jutted back at an extreme speed. The object continued to hover slowly changing directions, at this time the objected stopped and moved revealing a second object that went in the opposite direction. As I watched I tried to call attention to a co worker who was taking break outside with me, asking him to look at what I was watching. My coworker said,\"yeah, yeah, it's a helicopter\", there was no sound though. the slow moving aircraft I saw had sound. I was becoming excited and after a few minutes wrote down notes of what I saw and how it behaved. The sighting lasted for approximately ten minutes and ended as the objects left slowly and disappeared over the horizon. I am including a scan of my notes image from google maps of the break area and hill that the object was witnessed and also a short 3d animation of the object as best as I can recreate while my memory is fresh"],"files":["/var/www/straped/mufon/html2text/51380.html.txt","/var/www/straped/mufon/org/51380.html"],"Date of the Event":"10/07/2013 10:10 UTC","Case Number":"51380"}