{"map":"<A HREF = \"http://maps.google.com/maps?q=30.53957,+-95.353144(51390)&iwloc=A&hl=en\"> mufon case (51390) map </A>","Object Features":"Unknown","Weather Factors":"Unknown","Date of the Event":"10/08/2013 07:34 UTC","Summary":"It came over the house silently and flew to east then slowly decended into the hills/tree line. then the second one came through to my west to east and disappeared. i got frightened and went inside. 2 weeks ago i saw something else strange .","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Disposition":"Unresolved","Source":"MUFON","Longitude":"-95.353144","Sighting Duration":"Undisclosed","Tags":"City","Date Submitted":"10/08/2013 09:27 UTC","Case Number":"51390","Log Number":"US-10082013-0014","trends":["There have been no other sightings in New Waverly","This sighting has never been favorited."],"Region":"Texas","files":["/var/www/straped/mufon/html2text/51390.html.txt","/var/www/straped/mufon/org/51390.html"],"Object Shape":"Fireball","City":"New Waverly","Country":"United States","Object Flight Path":"Path with directional change","Latitude":"30.53957","divs":["Sighting DetailsI was sitting out on the porch smoking a cig and there is a meteor shower tonight. i heard some airplanes so I looked up a seen this glow light go right over the house and was headed east. so i jumped up and ran out to the yard to see where it was going and at that time it had slowed down and look like it was descending downward toward the ground lower than it was originally going in the first place. once it got past the tree tops i could not see it anymore but as it was going down it started to get duller in color and look a lighter oranges color. so i scanned around to see another one cominging over the trees but not over the house it was due south of house but was going west to east as well. this one was bright a well. was the other but not as white it was already faded the oranges color. i lost it behind the trees and got freaked out so i came in the house brought one of kthe dogs with and locked the doors.. i told my husband that if i saw another one i of these things i would contact you guys. i seen some a couple weeks ago as well but not quite the same scenrio. it was above the house but further up and it flashed a bright light brighter than i have ever seen went out looked like a sat light after that drop down a little thhe flashed the bright light again went out again this time it went completly out and shot two sat lights from it one went straight one way one went another and it was gone. what are these thing? Why are they over my house?"]}