{"Latitude":"36.773828","Source":"MUFON","Object Features":"None","Date Submitted":"10/08/2013 10:53 UTC","Longitude":"-119.715055","files":["/var/www/straped/mufon/html2text/51393.html.txt","/var/www/straped/mufon/org/51393.html"],"Weather Factors":"Unknown","Log Number":"US-10082013-0017","Tags":"City","Disposition":"Unresolved","Date of the Event":"10/07/2013 12:00 UTC","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Region":"California","divs":["Sighting DetailsMy Son-in-Law called me out to the front yard. A bright (very bright_ circular object was coming up from the SW in moved in a straight line for 30-50 miles then took a hard 45-degree left turn (its left) to the North. It then resumed its original course. I am a retired airline captain and I am familiar with fast moving object, I've also witnessed very bright meteors coming into the upper atmosphere. THIS WAS LIKE ANYTHING. At first we thought it was the ISS...until it changed course. By the time it had passed overhead and was at a 70-80 degree vertical angle to the NE, it appears like it slowed and grew bigger and brighter. It almost appears like it dropped out of orbit into the upper atmosphere - this lasted about 10-15 seconds. Then the white glow faded like it was gaining speed and distance from our observation point in California. It finally grew to a pinprick and was red at the center of itself when in finally winked out. It did NOT fly over the horizon and disappear...it accelerated out of our view on an upward trajectory. I am a retire airline captain with over 12,500 hours in jet aircraft (I retired at age 38 due to cardiac issues), I have owned and been CEO of my own airline. This is one of the weirdest \"UFO'S\" I've seen. Your Servant, Rabbi David Miller Luke 24:44-45"],"trends":["There have been 20 other sightings in Clovis","There were no other sightings in Clovis on or around October 7th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.773828,+-119.715055(51393)&iwloc=A&hl=en\"> mufon case (51393) map </A>","City":"Clovis","Summary":"Object appeared from SW moving very fast - thought it was ISS - Byt got brighter and changed course to N - finally faded out and moved NE appeared suborbital and moving 20K MPH+","Country":"United States","Object Flight Path":"Path with directional change,Path then hovering","Case Number":"51393","Object Shape":"Disc, Sphere"}