{"Object Flight Path":"Stationary","Viewing Distance":"Over One Mile","Tags":"City","trends":["There have been no other sightings in Le Raysville","This sighting has never been favorited."],"Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=41.838686,+-76.180208(51395)&iwloc=A&hl=en\"> mufon case (51395) map </A>","Region":"Pennsylvania","Latitude":"41.838686","Object Shape":"Star-like","Disposition":"Unresolved","Summary":"Viewed stationary next telegraph pole. Flitting aroundcental axis through field glasses and displaying various colors.","Sighting Duration":"Undisclosed","Longitude":"-76.180208","Country":"United States","Case Number":"51395","files":["/var/www/straped/mufon/html2text/51395.html.txt","/var/www/straped/mufon/org/51395.html"],"Source":"MUFON","Date of the Event":"10/08/2013 09:02 UTC","Weather Factors":"Unknown","Log Number":"US-10082013-0019","divs":["Sighting DetailsNCIS went off at 9 PM and I went out on the front porch at exactly 9:02 PM to sit with coffee. I noticed what appeared to be a low star alone in the sky at about 45 deg above the horizon to the north west. The object appeared to be about the size of an aspirin, hovering stationary next to the telegraph pole across the street and had a bright twinkling white light. I wanted a better look at the object that didn't move for ten minutes and got my field spotting scope. Observed through the spotting scope and field glasses, the object appeared to move rapidly around a central point and change colors rapidly from white to red, green, and blue predominantly. The object danced around a central point in small arcs that seemed to trace paths similar to the models of the atom you see in high school. I went inside to tell my daughter, her boyfriend, and my grandson to look out a front window and confirm my observation. The boyfriend and my grandson came down to the porch to observe outside, through the scope and binoculars and saw exactly the same patterns I described above. The time was 9:30 PM. The boyfriend observed a more faint object at the 10 o'clock position from the original doing exactly what the first object was doing. My eyesight was not good enough to see the second object. My grandson claimed to see something red shoot out of the bottom of the original object that we could not see with our naked eyes. We were amazed how much the object traced wild orbits around a center and constantly changed colors when observed through binoculars. This was very apparent because we were observing the object so close to the right edge of a telegraph pole. We gave up watching at 10 o'clock pm and went inside. For 1 full hour we watched two apparently stationary objects dance in wild orbits when observed through binoculars. The object appeared to be located over Owego, New York from our geographical location."],"City":"Le Raysville","Date Submitted":"10/08/2013 11:02 UTC"}