{"Date of the Event":"10/20/2006 12:00 UTC","files":["/var/www/straped/mufon/html2text/51399.html.txt","/var/www/straped/mufon/org/51399.html"],"Region":"Florida","Case Number":"51399","map":"<A HREF = \"http://maps.google.com/maps?q=18.992204,+-98.203716(51399)&iwloc=A&hl=en\"> mufon case (51399) map </A>","Log Number":"US-10092013-0002","Weather Factors":"Unknown","Date Submitted":"10/09/2013 12:04 UTC","Country":"Mexico","Longitude":"-98.203716","Object Shape":"Star-like","Object Features":"Unknown","City":"Puebla","Sighting Duration":"Undisclosed","Latitude":"18.992204","Viewing Distance":"Unknown","Source":"MUFON","trends":["There have been no other sightings in Puebla","This sighting has never been favorited."],"divs":["Sighting DetailsMy husband and I left on a cruise ship from Tampa,FL. to Cozumel,Mexico crossing the Gulf of Mexico, around October 20th of 2006, we had decided to go topside and get some fresh air and star gaze since we were in the middle of the ocean and it would be a perfect opportunity not to have any city lights or anything interfere. I can't recall the exact time but it was late midnight or so and I pointed out to my husband this tiny looking star, that after watching closely no bigger than a speck in the sky looked like it was moving so slow that the only way I could tell at first that it was moving was by using other stars around it as a reference. We watched it for about 7 minutes as we were trying to figure out what it was. It was way too high to be a plane we thought and couldn't see any other flashing lights around it as u would see on a plane. Also, we thought it could be a satellite which I've seen many times as they go across a lot faster than what we were seeing and satellites seem to fade out as they go by but, just then outta no where all of our questions were answered in a split second when this very slow star like object shot off faster than the speed of light (just to give you an idea I don't know exactly how fast the speed of light travels but this looked like something off of star trek when they go into warp speed). It was definitely not from this world because nothing moves that slow to as fast as we seen that night. There was no tail like you would see on a shooting star and honestly it was way further up than that. We knew then it was some kind of UFO that we have only thought prior was malarkey until the day, or night in our case, comes along it happens to you and you see something you can never explain but know for a fact was there."],"Summary":"What looked to be a tiny star really far away moving very very slowly, all of a sudden took off at the speed of light .","Disposition":"Unresolved","Tags":"City","Object Flight Path":"Straight-line path"}