{"Region":"Massachusetts","Longitude":"-73.117434","Summary":"Four objects flying around a bigger central object.","Disposition":"Unresolved","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.624225,+-73.117434(51391)&iwloc=A&hl=en\"> mufon case (51391) map </A>","Country":"United States","Object Flight Path":"Other","Log Number":"US-10082013-0015","Tags":"City","Viewing Distance":"Unknown","City":"Adams","Latitude":"42.624225","Object Features":"None","files":["/var/www/straped/mufon/html2text/51391.html.txt","/var/www/straped/mufon/org/51391.html"],"Sighting Duration":"Undisclosed","Date of the Event":"03/14/2011 04:15 UTC","Date Submitted":"10/08/2013 10:05 UTC","divs":["Sighting DetailsI was riding with my mother on the way to my brother's house. It was between 4:15 and 4:30. It was cloudy and oddly that's why I think I noticed the five darker oddly shaped objects in the sky. I told my mother to stop the car and watched them. The biggest one was hovering at the center of the four smaller objects and the closest thing that I can describe it as is a half moon shape. This is because it appeared to change slightly in shape. The four other shapes closely resembled triangles and they moved all about in different patterns around the big center object. They seemed to \"dance and weave\" with the most constant pattern reminding me of a dna double helix. At one point all five seemed to merge before the four smaller ones broke off and did their dance again. Like I said it was cloudy so even though I could definitely make them out, I couldn't notice in detail anything but their shape. In the clouds all five were black shadows against the grey clouds. I knew right away that these were no ordinary aircraft and that what we were seeing was a UFO. Being a believer but never seeing one I was both very excited and a bit frightened I'm not afraid to admit. My mother who is not a believer in the slightest was dumbfounded and sat silent as I enthusiastically rambled on about the objects and justification at last to all of those who think we believers are crazy. After about 4 minutes or so, she must have been too freaked out and started driving again even though I protested very loudly and adamantly. As far as I could tell they were still there cause I kept looking until I couldn't see them anymore. The strangest thing was when we got to my brother's house he and his girlfriend said they saw something similar a few nights back in Beckett MA. I really wish I wrote down exact time and date like a believer should have but sadly I didn't. I figured I'd never forget the exact time and all but I have. BUT I will never forget what I saw. It was amazing! Luckily (and maybe oddly) a week later after dropping my mom off at work on a cloudy (again)morning I briefly saw what appeared to be another object but this time it was just 1 but looked similar to the bigger object that I saw before. This time it was flying and disappeared in the clouds. Wish I contacted you guys sooner! Any info would be great. I have just started looking around and researching to see if there were similar sightings especially in my area. I hope so! Feel free to email me. Thanks for your time!"],"trends":["There have been no other sightings in Adams","This sighting has never been favorited."],"Weather Factors":"Unknown","Case Number":"51391","Object Shape":"Other"}