{"Date of the Event":"10/08/2013 08:30 UTC","Date Submitted":"10/08/2013 10:21 UTC","Object Features":"None, Unknown","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/51392.html.txt","/var/www/straped/mufon/org/51392.html"],"divs":["Sighting DetailsI turned onto my street and had the funny feeling that I turned onto a different street. Houses looked slightly unfamiliar while I thought this. It didn't take long to discover that I was on my street. Then I got out of my car, and looked up. Thinking about how clear the sky was tonight and how beautiful the stars looked. I turned around from my car south, still looking up and saw a light. (Two nights before this I had what I believe to be a premonition that I might see a UFO. The last phase of the dream I was on before waking involved a UFO somehow, I was looking at one or something. My recollection of the dream is hazy. I was thinking in the dream, and after I woke, that the time 5:30AM kept reoccurring. Like I was supposed to remember that time, in fact, my impression was that I should be awake at 5:30AM at my house in the living room waiting for the time to go outside and look. I thought this in the morning and several times later in the day when I was actually AWAKE. This I also did not do, I was in a different city and asleep. That 5:30AM was the morning of Today; the day of the sighting.) It looked to be the brightness of a plane. Slightly brighter. One solid light, no blinking. A little too bright to be a satellite. I looked at it wondering when a second light zig-zagged quickly behind it. It appeared and disappeared in about a seconds time and appeared to be behind the object. The light turned slightly towards the north-east. I had to move from the middle of my street to the front yard because it went behind a tree. It got brighter significantly, then dimmer, then disappeared. It was still faint enough that you could see it shoot in a line in a slanted direction. I had the impression of seeing several zig-zags that were incredibly faint after this. It had left a very short time before airplanes began flying East towards its last location. They seemed to behave normally. I'll mention now that dogs were barking on and off whenever something was visible. In seemingly similar location to where it was in the sky. The light reappeared slightly dimmer moving like a satellite would with some variation. I would wave to this sort of light and it would brighten accordingly on several occasions. It felt like an acknowledgement, a hello. I heard my neighbors on their porch wondering why I was staring at the sky. I invited them over, the one who walked over, got there in time to miss it. They said, \"So you believe in UFOs?\" Only a few seconds too late! Some time after this I began paying attention to what I had already ignored, thinking it to be a plane. It had numerous white lights, some perhaps yellowish, and maybe a red one. After a few seconds of viewing they did turn out to be all-white. Blinking in a random sequence quickly and spastically. It bobbed up and down subtly, and disappeared behind the tree line. This was in the NE heading East. Next was the same as the earlier ones, it was fainter, and in more of a straight line path. I thought this one could have been a satellite. I watched, and and it seemed to respond to one of these questions I was thinking when another light blinked behind it (as with the zig-zag earlier). At the time of this blink, the TVs in both mine and my neighbors house flashed. You know what it looks like when a TV goes from a dark scene to a bright one, and you're viewing the light bounce from outside? I'm assuming it was with the TVs and not a surge in the lights of both houses. Either way, it happened at the same time as the blink. Again I waved hello and it brightened before speeding up and dimming. I was talking on the phone waiting to see something else (there were several minutes between each incident, at various times), when I turned north to see a low, tree level (but several blocks away I think), object descending! About three solid bright glowing yellow, dark-yellow, yellow-orange lights with a black mass of the object. It seemed to be triangle. It also seemed to turn from on its side to reveal this. It was close! It made no noise, and descended through the trees. I joked on the phone that it was landing, and after it disappeared below the trees in my vision it could have. I worried that it may have crashed, but if it did, it would put it somewhere in residential Royal Oak. So unless I hear something on the news or the web, I'm assuming it just descended and then faded away That's why I didn't chase after it to try to keep my eye on it, but I still kinda wish I would have. I had a moment of silent prayer for the well-being of the whatever it is or was, on that note. Then had a similar feeling as when I first turned on my block, like a profound blink. In the realm of thought, or other dimensions? It was a good feeling, similar ones have occurred in other experiences. After that I had the suspicion that there would be no more activity for now. I hung around outside for a while, but the dogs had stopped barking. I'm going back outside now for a little while. What a beautiful thing! It's a really great feeling. I feel so blessed and honored to have witnessed these things, and in front of my own house no less, at the exact time that I was outside to notice. Wow! Peace"],"Summary":"Zig-zaging lights, brightening, fading, changing direction, reappearing, other sight was spastic blinking, dogs barking when visible, other sight; 3 yellow lights triangle shape descent","Sighting Duration":"Undisclosed","trends":["There have been 8 other sightings in Royal Oak","There were no other sightings in Royal Oak on or around October 8th 2013"],"Case Number":"51392","map":"<A HREF = \"http://maps.google.com/maps?q=42.498107,+-83.124739(51392)&iwloc=A&hl=en\"> mufon case (51392) map </A>","City":"Royal Oak","Region":"Michigan","Log Number":"US-10082013-0016","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile, Unknown","Object Shape":"Sphere, Star-like, Triangle, Unknown","Object Flight Path":"Straight-line path,Path with directional change,Other","Disposition":"Unresolved","Tags":"City","Source":"MUFON","Latitude":"42.498107","Longitude":"-83.124739","Country":"United States"}