{"Summary":"This siting appeared to be a dark orange yard light however none exist in that area. It was below trees and either on the ground or just a few feet from it. We were on the porch and it scared me so bad I came inside and watched from the window.","divs":["Sighting DetailsMe and my husband have noticed at least 3 flying objects that make no sound and resemble a large star however they make sudden odd hover and circular patterns. This has been going on for 2 weeks. It appears to be 2 small crafts not too far away but also one that is much closer. The one described above is what I believe to be the mother ship and I found with certainty it can appear to simply look like a yard light but suddenly shift and zig zag or rotate til its ducked behind the trees before coming back in view. Recently scared me so bad I hauled my behind inside my home were I felt safer somewhat. Once inside I viewed this object from my window. The object became brighter and flashes of red lights began. Scariest part was I suddenly noticed these dark slender beings that had unbelievable speeds and if I had of blinked I would not have seen them again. This all began while trying to have a cigarette before bed but out of the corner of our eyes we could see movement and know something wasn't right. At first I felt like the item was simply a yard light but quickly realized different. My feelings are uncertain and I guess my biggest fear is how brave this object is and seeing creatures running across the field in front of my house was very frightening. I just hope and pray my family and neighbors are safe. Several reports have been made in this exact area and I believe it is due to the open field, wooded areas around us plus the body of water, including a pond across the field in front of my home. The craziest part of all was hearing animals all over this quiet community, including dogs, horses, chickens, etc. completely frightened and very much concerned and alerting everyone of danger. Wish us luck and I'm hoping someone will come investigate cause this is the real deal."],"Latitude":"35.477109","Case Number":"51398","Date of the Event":"10/07/2013 12:00 UTC","Object Shape":"Fireball, Oval","Region":"North Carolina","map":"<A HREF = \"http://maps.google.com/maps?q=35.477109,+-76.811604(51398)&iwloc=A&hl=en\"> mufon case (51398) map </A>","Log Number":"US-10092013-0001","trends":["There have been no other sightings in Bath","This sighting has never been favorited."],"Longitude":"-76.811604","Object Flight Path":"Stationary","Weather Factors":"Unknown","Date Submitted":"10/09/2013 12:00 UTC","City":"Bath","files":["/var/www/straped/mufon/html2text/51398.html.txt","/var/www/straped/mufon/org/51398.html"],"Sighting Duration":"Undisclosed","Country":"United States","Disposition":"Unresolved","Object Features":"Other","Source":"MUFON","Viewing Distance":"101-500 Feet","Tags":"City"}