{"Object Shape":"Sphere, Star-like, Other","map":"<A HREF = \"http://maps.google.com/maps?q=26.602275,+-81.780952(51409)&iwloc=A&hl=en\"> mufon case (51409) map </A>","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/51409.html.txt","/var/www/straped/mufon/more/51409_submitter_file1__DSCN1093.JPG","/var/www/straped/mufon/more/51409_submitter_file2__DSCN1088.JPG","/var/www/straped/mufon/org/51409.html"],"Country":"United States","Sighting Duration":"Undisclosed","Object Features":"Unknown","Log Number":"US-10092013-0011","Date of the Event":"10/08/2013 07:14 UTC","Disposition":"Unresolved","City":"Fort Myers","Latitude":"26.602275","Longitude":"-81.780952","trends":["There have been 41 other sightings in Fort Myers","There were no other sightings in Fort Myers on or around October 8th 2013","This sighting has never been favorited.",""],"Date Submitted":"10/09/2013 10:31 UTC","Summary":"Recurring object in WSW sky, NOT Venus","Source":"MUFON","divs":["sighting detailsthis object has appeared on multiple nights, always between 7:15 pm and 8:30 pm, always in the wsw sky, and remains visible for approximately one hour. it does not deviate in altitude. it changes between two forms, seemingly as it slowly rotates. it is either a triple light or a single orb, always white, and changes in intensity. i have watched it through binoculars and when it disappears, it quickly dims and just \"goes out\". it does not set. it does not fly away. first the outer lights begin to dim, followed quickly by the center light until it is no longer visible. i have never seen it reappear the same night. there have been three adult witnesses to this and we all agree on the description. first, we believed it to be spica, then venus. but planets do not \"dim away\" nor do they have three distinct lights. we first observed this in september and filed a report at that time. i have contacted our local control tower as we are a few miles from an airport, but they could offer no explanation. after so many subsequent sightings i have decided to file an updated\\new report for tonight's sighting. tonight's pictures are the best representation i have been able to capture, to date. all three witnesses are responsible, non-drinking adults who would really love to know what it is that keeps appearing in our sky!"],"Weather Factors":"Unknown","Viewing Distance":"Unknown","Tags":"City","Case Number":"51409","Region":"Florida"}