{"Object Flight Path":"Hovering then path","Disposition":"Unresolved","Region":"Utah","Log Number":"US-10092013-0007","divs":["sighting detailsi was driving southbound on utah state road 65 from the east canyon reservoir area (wasatch mountains) toward salt lake city\\interstate 80 enjoying the autumn leaves on oct. 8th, 2013 approximately 430-5pm mst. relatively few cars were on the winding mountain road and the sky was very overcast. while driving on a fairly straight portion of the road, a glowing white light caught my eye. the spherical object was approximately the size of a cantaloupe or basketball and was hovering stationary near the top of a large tree. the object seemed to shimmer white light yet did not blink lights and did not change light color. it was a glowing ball of white transparent light. i quickly braked and grabbed my iphone (which was in camera mode as i had been stopping periodically to take pictures of the autumn leaves) and snapped a picture of the glowing orb. mere seconds later, the orb appeared on the opposite side of the 2-lane road at approximately the same height off the ground yet i did not witness the orb move from one location to the other. it was simply as if it \"disappeared\" as it moved between locations within seconds. i quickly snapped a second picture before the object simply was no longer visible. no longer seeing the object, i proceeding in driving toward my destination. once in slc, i stopped to look at the two pictures of the object i had taken. i was surprised to see that the object (which had appeared bright white to my eyes at the time i observed and photographed the object) appeared glowing green, not white, in the two photographs! the lighted object i witnessed and photographed was not a reflection from another vehicle or street sign, nor was it a malfunction of my iphone camera (inasmuch as i have taken literally hundreds of photos of this season's autumn leaves on the iphone at varying times of the day and early evening and have never seen a reflective green spherical object inadvertently appear in any of them). the green orbs shown in the attached photographs are what appeared to the naked eye as white glowing orbs. i do not know what it was i witnessed and photographed; i do however know i successfully captured whatever it was in two valid photos."],"Source":"MUFON","Sighting Duration":"Undisclosed","trends":["There have been 73 other sightings in Salt Lake City","There were no other sightings in Salt Lake City on or around October 8th 2013"],"Case Number":"51405","Weather Factors":"Unknown","Longitude":"-111.68063","files":["/var/www/straped/mufon/html2text/51405.html.txt","/var/www/straped/mufon/org/51405.html"],"Latitude":"40.789806","Object Shape":"Sphere","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=40.789806,+-111.68063(51405)&iwloc=A&hl=en\"> mufon case (51405) map </A>","Summary":"Glowing white light approx size of basketball at treetops; took photo #1 them orb switched to other side of road within seconds for photo #2; appears green in photos although was white to the human eye","Tags":"City","Viewing Distance":"21-100 Feet","Country":"United States","Date of the Event":"10/08/2013 05:00 UTC","City":"Salt Lake City","Date Submitted":"10/09/2013 02:00 UTC"}