{"Longitude":"-83.59622","Source":"MUFON","Date of the Event":"10/08/2013 08:15 UTC","Summary":"mother ship hovering. many orbs flying around.","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.592868,+-83.59622(51408)&iwloc=A&hl=en\"> mufon case (51408) map </A>","files":["/var/www/straped/mufon/html2text/51408.html.txt","/var/www/straped/mufon/org/51408.html"],"Country":"United States","Disposition":"Unresolved","trends":["There have been 4 other sightings in Milford Township","There were no other sightings in Milford Township on or around October 8th 2013"],"Case Number":"51408","Viewing Distance":"Over One Mile","Log Number":"US-10092013-0010","Object Features":"Unknown","Date Submitted":"10/09/2013 06:20 UTC","divs":["Sighting DetailsOn Oct. 8th. 2013 at approx . 8:15pm saw a bright object below the crescent moon. Then observed several orbs brightly lit around the bright object. Drove towards Milford on Pontiac trail and stopped at a field in Wixom, exited the vehicle and stood in a field and watched for approx. a half hour as what I would describe as the mother ship hovered in position while as many as ten different orbs would fly around it. There was a large amount of planes and helicopters around this area. I watched as the mothership would descend in the flash of a second and then hover stationary. Many little orbs (they looked about the size and brightness of a satellite ) flew around the mothership (usually in pairs of two or three) A second witness that was also looking at ufo stated that it appears two of the ships were firing at each other via a beam of light. I looked to the north where ships were reported as shooting at each other. I observed the orbs in question but did not observe any shooting of rays. i observed orbs get brighter then disappear in a flash. When I looked where the mothership was.... it was gone. The incident lasted about forty minutes. It did appear as if the u.f.o's were engaging each other or engaging planes and helicopters in the vicinity. A poster from Royal Oak ( several cities east of my location) stated he watched what appeared to be a helicopter shoot down a ufo that fell from the sky. around same time frame. Drove west of my location from Wixom to Milford trying to observe more. But to no avail. When I returned home I observed a very low flying airplane (just above tree line) never saw a plane flying that low. The whole event was quite amazing."],"Object Shape":"Sphere","Object Flight Path":"Stationary,Path then hovering","Tags":"City","Region":"Michigan","Latitude":"42.592868","City":"Milford Township","Weather Factors":"Unknown"}