{"Viewing Distance":"Unknown","trends":["There have been no other sightings in Ashfield","This sighting has never been favorited."],"Region":"Pennsylvania","divs":["Sighting DetailsWas outside laying on the ground stargazing at the draconoids meteor shower, in the time frame we witness meteor, planes and even satellites so we had a ray of comparisons for seeing this unknown object in the sky. It appeared directly above us out of nowhere very bright somewhere in the flying zones of planes. It moved very slowly and made its way going south and within a minute it changed direction 60 degrees and continue to travel in a not so straight line until eventually it faded away behind the very little clouds that were in the sky. Being that there was also a satellite making its way across the sky as well as witnessing the meteors, it was easy to tell it was not like anything that could have some reason. Eliminating all possible options left both us questioning what we saw and although we cannot just claim it was an alien or entity, it was definitely an unknown bright orb that appeared in the sky and traveled in a fashion unlike anything found in today's society. With no noise whatsoever and the sudden appearance, even being skeptical we accepted that what we witness was out of the norm."],"Latitude":"40.778832","Sighting Duration":"Undisclosed","Date Submitted":"10/09/2013 11:53 UTC","Object Shape":"Sphere, Star-like","Source":"MUFON","Date of the Event":"10/09/2013 07:47 UTC","Tags":"City","Country":"United States","files":["/var/www/straped/mufon/html2text/51413.html.txt","/var/www/straped/mufon/org/51413.html"],"Weather Factors":"Unknown","Log Number":"US-10092013-0015","Object Flight Path":"Hovering then path,Path with directional change","Case Number":"51413","Longitude":"-75.711066","Summary":"Light appeared out of nowhere in the sky slowly making a path and changing direction","Disposition":"Unresolved","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=40.778832,+-75.711066(51413)&iwloc=A&hl=en\"> mufon case (51413) map </A>","City":"Ashfield"}