{"Country":"United States","Region":"Massachusetts","Object Shape":"Other, Unknown","Longitude":"-71.373417","Sighting Duration":"Undisclosed","Latitude":"42.415381","files":["/var/www/straped/mufon/html2text/51412.html.txt","/var/www/straped/mufon/org/51412.html"],"Summary":"white plane like object viewed edge on or from side no wings seen, tail seen,no sound , solid dome structure on top of body possibly with archform windows","Object Features":"Dome, Window(s), Patterned Surface","Disposition":"Unresolved","Date Submitted":"10/09/2013 11:28 UTC","Object Flight Path":"Straight-line path","City":"Undisclosed","Weather Factors":"Unknown","trends":[],"Source":"MUFON","Log Number":"US-10092013-0014","Date of the Event":"10/02/2013 12:00 UTC","divs":["Sighting DetailsWe were my wife and I visiting a local audubon sanctuary mid day sunny bluesky day.While sitting there in a meadow at approximately the same time we both observed what appeared to be a somewhat unusual looking aircraft.The unusual things about it were its shape ,like the way anormal aircraft would appear edge on from the side except for a pretty large domelike structure on top near center which appeared to be solid from bottom to top.Upon further observing with our birding binoculars we both observed some details on the dome itself resembling possibly a row of arched shaped windows from the base of the dome.Niether of us could see any wings but my wife said she saw a upright tail shape which i do not recall seeing.It moved with no sound in a straight horizontal direction going by us at a hight of about 30 to 40 degrees in the sky although hard to determine the distance . It appeared to me to be moving at jet speed on the slow end although my wife said she thought it could be a glider.We watched it pass from approximately NE to SE for no more than 4 or 5 min before fading from view in distance. My impressions upon fist sight were that I had never seen any aircraft or known of any aircraft with a dome such as that it felt bizzare and dare I say? alien to me. It has stayed in my mind since first seeing it and prompted me to call mufon yesterday and t o write this official report today. sincerely B M"],"Case Number":"51412","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.415381,+-71.373417(51412)&iwloc=A&hl=en\"> mufon case (51412) map </A>","Viewing Distance":"Unknown"}