{"Source":"MUFON","Summary":"unseen aerial object travelling at incredible speed, from horizon to horizon without sound of identifiable propulsion","Weather Factors":"Unknown","Object Shape":"Unknown","Disposition":"Unresolved","Log Number":"US-10092013-0022","Date Submitted":"10/09/2013 09:53 UTC","Country":"United States","Viewing Distance":"Unknown","Tags":"City","City":"Roberta","Case Number":"51421","Date of the Event":"10/09/2013 07:45 UTC","divs":["Sighting Detailsi never saw an object, as i was on my back porch, and i heard \"something\" coming through the air from the east, heading west. from the time i initially heard it to the time i couldnt hear it in the west anymore, was approximately a second, maybe a second and a half. there was no identifiable sound of a source of propulsion, no propellers, no engine, no jet or rocket that i could hear. the only sound was the sound of it cutting through the air. by the time i heard it and attempted to move so that i could see what it was, it was gone. I see alot of air traffic where i live, including military jets and quite often they scream through here shaking the house and all, but i have never \"seen\" anything move this fast. probably just a coincidence, but immediately after it passed, all the outside activity seemed to stop.. no birds chirping, no neighbors yelling and beating on the whatever they beat on. I will ask them tomorrow if they saw or heard anything. i was kinda freaked out by it, and normally it takes alot more than a noise to get my hackles raised, so to speak."],"trends":["There have been no other sightings in Roberta","This sighting has never been favorited."],"Object Features":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path,Unknown","Region":"Georgia","Longitude":"-84.085318","map":"<A HREF = \"http://maps.google.com/maps?q=32.678432,+-84.085318(51421)&iwloc=A&hl=en\"> mufon case (51421) map </A>","Latitude":"32.678432","files":["/var/www/straped/mufon/html2text/51421.html.txt","/var/www/straped/mufon/org/51421.html"]}