{"Tags":"City","Object Shape":"Saturn-like, Sphere, Star-like","Date Submitted":"10/10/2013 01:37 UTC","Object Flight Path":"Path with directional change,Path then hovering","City":"Norman","Weather Factors":"Unknown","trends":["There have been 22 other sightings in Norman","There was one other sighting in Norman on or around October 4th 2013"],"Latitude":"35.220815","Sighting Duration":"Undisclosed","Source":"MUFON","Log Number":"US-10102013-0003","Longitude":"-97.164786","files":["/var/www/straped/mufon/html2text/51427.html.txt","/var/www/straped/mufon/org/51427.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.220815,+-97.164786(51427)&iwloc=A&hl=en\"> mufon case (51427) map </A>","Country":"United States","divs":["Sighting DetailsMy husband and I arrived home late after dropping his brother off at his house down the road, they had seen a green streak across the sky we thought it may be the comets everyone is talking about. We arrived back home and as we were walking up the steps I had an urge to look at the stars.I went to the porch railing, which is facing east, and looked up to see a bight light, it seemed to glow purple but when I blinked thinking it was my eyes playing tricks on me it started to glow light green. It was moving a slow pace south bound. I called for my husband still thinking it was my eyes playing tricks, he came out and I asked him to look up and tell me what he sees. He looked up and his mouth got wide I asked him if it was just me or was that star moving he said yes it was moving. He ran inside to get our video camera, as he came back and started his camera it started to slowly descend down toward us at the same slow pace it had been traveling south at. It did not descend very far before stopping and hovering. We stayed out there for hours watching it pulse different colors and swinging back and forth. While filming we noticed that there were several aircraft in the area coming quite close with the ufo, they kept flying by and the coming back as if they were also watching what we were seeing. Finally at sunrise the ufo ascended and disappeared. The aircraft that had been flying around the whole time continued to fly around our house for an hour looking for the ufo."],"Viewing Distance":"Over One Mile","Summary":"My husband and I saw it from our back porch glowing brightly.","Disposition":"Unresolved","Object Features":"Other","Case Number":"51427","Region":"Oklahoma","Date of the Event":"10/04/2013 02:30 UTC"}