{"Weather Factors":"Unknown","divs":["Sighting DetailsOn the night of October 4, 2013 around 9:50pm, my wife and I decided to go look at the stars. We were in front of my parents house in Salem, Oregon facing south. The sky was very clear that night and, after a minute or two I spotted something that at first I thought might have been a far off plane. It came out from behind a group of trees that was SW of us flying at a very low altitude (the object was parallel with the tops of the trees), and heading East at a very slow pace. I was confused because it was low flying, slow and noiseless, so I alerted my wife to it and she immediately noticed it also. We were observing what appeared to be a small bluish-white light with the occasional blink of red light that seemed to be too off tempo to be a planes. After a minute or so, it finally went behind a larger tree that is taller than the others around it. Interestingly, I noticed that before it reached the tree it changed direction going slightly up. Then, as it was behind the tree, it changed course completely and was now going West with jumpy, erratic movements. Almost like it was caught on a fishing line and was getting reeled in, at first fast then slow, then almost motionless all the while with an occasional blink of red. This startled me and I exclaimed out loud to my wife and myself. Ending up behind the same group of trees that I originally first saw it fly out of, it then changed course again coming back out of the trees going east. At that moment, it was Very bright and shone through the trees whitish light. Coming into the clearing, it was clearly visible with a star-like shining white-blue light that was glinting off of a dark shape. The light was brightest on the right side and on the left is where the red blinking light was located. Finally, with the same unpredictable skip-like movements, it flew behind the tall tree and at that time shone a very bright white light right through the tree at us that illuminated the area. This made us booth exclaim aloud and as we watched it, it smoothly came out of the other side of the tree, hovering east parallel to the smaller treetops. It slowly moved east then seemed to stop and descend behind the trees where we lost sight of it for a minute. We knew it was there and shortly later we caught sight of it moving just below the tree tops, kind of going up and down. It was like it was playing hide and seek with us and it made awkward movements right above the trees, going side to side and up and down. Ascending slowly into the sky, it made all sorts of movements, going in all directions. At this time it was clearly visible and I tried desperately to make out what it looked like. It was like a blue-white arrowhead shaped light that was very radiant and star-like. The light it produce seemed to be bouncing off of its own shape on all sides, especially on the right which was clearly arch-like, and the bottom. Now it started slowly moving west, growing in brightness and gaining a clearly defined central triangular light. Going behind the tall tree, it moved in an unexplainable pattern and then slowed dramatically. At this point, I was very shaken up and when I saw it moving around I was like a frightened animal shaking in fear. It was just beyond the tall tree and what amazed me is that it changed from the white light I was seeing to an incredible golden radiance. It stood almost motionless and seemed to be growing much more radiant than before. The shape looked exactly like an angel. Continually moving west, it seemed to turn slightly and stop. That is when we saw something extraordinary. It now had a translucent golden arrow-head shape encompassing the central light and two constant red lights on its left side, one atop the other. The central light was brilliant golden with the same arrowhead shape and light coming from all sides. Then moving west at a quicker pace, I noticed that the central light could have been three lights grouping together in a triad formation right before it disappeared behind a large group of trees and we lost sight of it for good. I watched this object the entire time it was in view, never taking my eyes from it. In the beginning of the encounter, I had thought that my eyes were playing tricks on me but as I continued to watch, I knew my eyes were fine and I was witnessing something incredible. I was amazed and astounded at what I had seen and exclaimed a lot during the event. Its magnificent star-like radiance left me awestruck. By the time it was leaving, it was large, bright and obvious in the sky, and the golden triangle that surrounded it was very clearly defined. The way this object moved is absolutely unexplainable and confirmed to me that it was definitely not one of our typical aircraft. The event lasted about 15 minutes."],"Summary":"Brilliant star-like object hovers above trees and shines bright lights before changing into golden triangle.","Longitude":"-122.896374","Source":"MUFON","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=44.880653,+-122.896374(51433)&iwloc=A&hl=en\"> mufon case (51433) map </A>","City":"Salem","Region":"Oregon","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Viewing Distance":"101-500 Feet, Unknown","Country":"United States","Log Number":"US-10102013-0009","Disposition":"Unresolved","Case Number":"51433","Object Features":"Unknown","Date of the Event":"10/04/2013 09:50 UTC","Latitude":"44.880653","trends":["There have been 40 other sightings in Salem","There were no other sightings in Salem on or around October 4th 2013"],"Object Shape":"Star-like, Triangle, Other","files":["/var/www/straped/mufon/html2text/51433.html.txt","/var/www/straped/mufon/org/51433.html"],"Sighting Duration":"00:15:00","Date Submitted":"10/10/2013 01:31 UTC"}