{"Sighting Duration":"Undisclosed","Date of the Event":"10/10/2013 02:00 UTC","Longitude":"-80.196319","trends":["There have been 5 other sightings in Fairmont","There were no other sightings in Fairmont on or around October 10th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.421814,+-80.196319(51430)&iwloc=A&hl=en\"> mufon case (51430) map </A>","City":"Fairmont","Date Submitted":"10/10/2013 11:26 UTC","Summary":"Possible abduction attempt","Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Unknown","Object Features":"Unknown","Country":"United States","Region":"West Virginia","Log Number":"US-10102013-0006","divs":["Sighting DetailsI was sleeping soundly when I felt like I was being smothered. In my dream I related it to being wrapped up in a rug. I screamed for help in my dream and awoke with a start not being able to move. I looked to the ceiling like I do when I have disturbing dreams to release them out of my mind and tried to stay awake for a moment. Almost immediately I was back asleep and I even told myself that I didn't want to be asleep and tried to wake up still having the feeling of being confined. This time I was surrounded by a white coloring with black bar-like holding devices. It seems like they were trying to keep me calm as I could hear calming music being played. I told myself that this wasn't real and wasn't right and I started to see thru the white as though I was seeing through their illusion and could really see what was going on. Needless to say this freaked me out quite a bit. I was released and found myself staring up at my ceiling again. I concentrated on a particular shadow and was comforted thinking it was my cat's head displayed in shadow until I realized she just made a small noise on my wife's side of the bed. The shadow moved and I immediately turned on the light to check out what was making the shadow. My wife thought I was nuts. I told her about what was going on and when my mind went back to thinking about the shadow I realized that something had to have been in the room with me. Now, I have seen some freaky scary things in my life before and am not normally scared (and have even talked to Stanton Friedman about UFO sightings), but when I just tried to talk about it to my wife I broke down and had a full-blown panic attack, hyperventilating and all, totally freaking out. I have no idea what happened last night. I can't say 100% what it was or if I am not totally going insane but even my wife heard something in the house later on as we were trying to debunk what had happened. \"Oh it is just one of the kids\" she said. \"Go check\" I said and she did only to find both boys sound asleep where they should be in there room. Tonight I hope to look at what could have made the shadow in depth and come up with a size to generate more information on this case."],"Latitude":"39.421814","Object Shape":"Other","Viewing Distance":"20 Feet or Less, N/A","files":["/var/www/straped/mufon/html2text/51430.html.txt","/var/www/straped/mufon/org/51430.html"],"Disposition":"Unresolved","Case Number":"51430","Source":"MUFON"}