{"divs":["Sighting DetailsWe(my husband, myself and 3 of our 4 children, aged 21, 19 & 16) arrived home from an outing at about 11:30pm on Monday October 7th, 2013. We were in the midst of a terrible family crisis (stemming from a horrible argument between me & my 16 yr. old) and in much distress. There was hysterical crying and screaming and emotions were so high that I chose to gather some essentials and drive off somewhere to be alone. I was attempting to get into my vehicle while my husband was imploring me not to leave. This went on for several minutes because I was determined to go. As I was about to get into the truck, ignoring my husband's wishes (my 21 yr. old had pleaded with me prior, to stay as well. She was distraught)a bright glowing light had appeared in a cloud directly in front of us. It was the only visible cloud in an otherwise perfectly clear sky and it flickered and flashed the reflection of the light which seemed to emanate from it. This was a huge distraction to which I asked, \"what is that in the sky?\" My husband turned to look at it and answered, stunned, \"I don't know... a ufo.\" We thought for a second, that it was a meteor, headed straight for us but we quickly realized that it was much too low and not moving. We were mesmerized by it and continued to watch as it seemed to emerge from the cloud and grow in size and intensity. It shone the brightest white at this point. I ran down the driveway and positioned myself on the road, in line with it, which was perfectly in line with our home. It was about 1.5 kms or 1 mile away, straight out over a corn field to the south, 500-1000ft high, at about a 40 degree alt. It looked to be between 50-100ft in diameter. It appeared as a massive round light with no visible detail, just light. My husband ran in to tell everyone to come back out (including his 23 yr. old son who had been at home) to see the phenomenon. The 6 of us watched (I, on the road, my 21 yr. old on the lawn behind me, crying frantically for me to come back and my husband and the other 3 kids behind her, on the front porch) as it remained still, suspended directly in front of us, changing from an enormous fiery orange sphere of light to a brilliant white, before it shrunk and disappeared in an instant. Despite his intense fear, my husband managed to capture 4 images of the object with his phone. He moved while taking one of the shots, which you'll see looks like 2 lights, but there was just one. We've discussed and pondered and tried to figure out what exactly took place that night. And while I continue to try to work through family problems, I can't help feeling that what occurred was an intentional distraction from an increasingly desperate situation, that instantly halted it, possibly preventing something tragic from happening and ultimately unifying us. The actual event lasted approximately 5 minutes but the effects of it will be with all of us forever."],"Source":"MUFON","Disposition":"Unresolved","Latitude":"45.22566","Sighting Duration":"00:05:00","Object Flight Path":"Stationary","Country":"Canada","Date of the Event":"10/07/2013 11:45 UTC","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Log Number":"CA-10102013-0008","Summary":"A bright light appeared in a low, solitary cloud directly in front of our house. It seemed to emerge from the cloud which reflected its flickering/flashing. It remained still, grew, intensified, shone orangish to white, then shrunk & disappeared.","Longitude":"-74.405198","City":"Bainsville","map":"<A HREF = \"http://maps.google.com/maps?q=45.22566,+-74.405198(51432)&iwloc=A&hl=en\"> mufon case (51432) map </A>","Object Features":"None","files":["/var/www/straped/mufon/html2text/51432.html.txt","/var/www/straped/mufon/more/51432_submitter_file1__UFO4.jpg","/var/www/straped/mufon/more/51432_submitter_file2__UFO3.jpg","/var/www/straped/mufon/more/51432_submitter_file3__UFO2.jpg","/var/www/straped/mufon/more/51432_submitter_file4__UFO1.jpg","/var/www/straped/mufon/org/51432.html"],"Region":"Ontario","Object Shape":"Circle, Fireball","Case Number":"51432","Weather Factors":"Unknown","trends":["There have been no other sightings in Bainsville","This sighting has never been favorited."],"Date Submitted":"10/10/2013 01:01 UTC"}