{"Source":"MUFON","Date Submitted":"10/10/2013 03:48 UTC","Latitude":"40.235847","Case Number":"51435","Region":"Pennsylvania","Longitude":"-75.111407","Viewing Distance":"101-500 Feet","Country":"United States","Tags":"City","divs":["sighting detailsi went to let my dogs out around 8:35 pm and noticed 2 objects from a distance, traveling south and west toward my house. the first thing i noticed was 3 orange\\red balls of light but multiply that by 2 since there was a pair, one closer than the other and moving slow. as they got closer and i really had a fantastic view i noticed that the 3 orange balls of light - formation like an upside triangle, were in an orb or bubble - almost like glinda from wizard of oz. i ran into my house to get my camera and when i returned, only one was in site and snapped a few pictures with my olympus 6.3-63 mm zoom and captured one good picture. when it was leaving it looked as though it followed the same path, but in reverse. when i viewed the pictures, i was surprised to see this fireball because vividly i can remember seeing 3 lights in an upside down triangle within a faded orb or bubble. i can tell you that i did not see anything resembling a plane, helicopter or wish lantern, just something incredibly, unusual."],"Log Number":"US-10102013-0011","files":["/var/www/straped/mufon/html2text/51435.html.txt","/var/www/straped/mufon/org/51435.html"],"Disposition":"Unresolved","City":"Warminster","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.235847,+-75.111407(51435)&iwloc=A&hl=en\"> mufon case (51435) map </A>","Object Features":"None","Sighting Duration":"Undisclosed","Date of the Event":"10/04/2013 08:30 UTC","Summary":"Upside down triangle formation of 3 orange-red balls of light within an orb or bubble like sphere. Bright.","Object Flight Path":"Path with directional change","trends":["There have been 4 other sightings in Warminster","There were no other sightings in Warminster on or around October 4th 2013"],"Object Shape":"Sphere, Other"}