{"Disposition":"Unresolved","Object Flight Path":"Hovering then path","Object Features":"Unknown","Case Number":"51438","Viewing Distance":"101-500 Feet","Longitude":"-86.715207","Summary":"UFO Over apartment complex.","Source":"MUFON","files":["/var/www/straped/mufon/html2text/51438.html.txt","/var/www/straped/mufon/org/51438.html"],"Date of the Event":"10/09/2013 12:00 UTC","divs":["Sighting DetailsThe event happened not to me, but to a friend of mine. I was inside my apartment, when I heard my friend scream 'UFO UFO' so I went outside to see what was going on. When I got outside, she was telling some other people about what she had seen. She told me that while she was outside with her dog, she was looking on the direction of NE when she saw a strange object just above some trees. At first glance, she though that it was an airplane, but then she told that the object hovered above the trees, at straight angle, she realized that it was not an airplane, when the UFO moved to the left, and then moved to the right! She then told me that the UFO was disc shaped, and it was pulsating a whitish color light in the middle of the UFO. After she saw the whitish light pulsating, and not been able to move while she was observing the event, she saw the UFO just disappeared! After the UFO event, I made her write everything down, and made her do drawings of the UFO. She told me that she was feeling scared because she had never witness a UFO... After talking with her for a while, she still could not believed that she saw a strange object. She also wrote everything she saw besides the drawings of the UFO.. She wrote it all in spanish."],"Latitude":"36.109385","Date Submitted":"10/10/2013 05:43 UTC","Object Shape":"Disc","Region":"Tennessee","Sighting Duration":"Undisclosed","Log Number":"US-10102013-0014","Weather Factors":"Unknown","Tags":"City","City":"Nashville","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=36.109385,+-86.715207(51438)&iwloc=A&hl=en\"> mufon case (51438) map </A>","trends":["There have been 72 other sightings in Nashville","There were no other sightings in Nashville on or around October 9th 2013"]}