{"Summary":"stationary star like objects during the day","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around October 10th 2013"],"City":"Chicago","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.884754,+-87.622548(51440)&iwloc=A&hl=en\"> mufon case (51440) map </A>","files":["/var/www/straped/mufon/html2text/51440.html.txt","/var/www/straped/mufon/org/51440.html"],"Disposition":"Unresolved","Date of the Event":"10/10/2013 07:45 UTC","Object Features":"Other","Source":"MUFON","Region":"Illinois","divs":["Sighting DetailsDate: October 10 2013 Time: 7:45 AM to 7:50 AM Location: Stevenson Expressway going into Downtown Chicago, somewhere near Midway airport. Details: me and my mom were driving to downtown Chicago when we saw two unmoving points of light that looked like stars above the horizon.i only noticed them because they looked like stars and i know you cant see stars during the day, also i thought it was strange they didn't move so they couldn't be planes. they were placed apart from eachother horizontally one a little lower than the other. the two points as i said did not move but they would fade in and out. there were planes in the sky at various altitudes but all moved steadily and none shone as brightly if at all. the \"stars\" eventually faded out to much smaller points, eventually i either lost track of them or they just disappeared. there were no buildings or towers nearby that these lights could have come from. at first i thought they might be planes but when i saw they didn't move i knew they weren't, they stayed in one place for too long to be planes. weather: some clouds low on the horizon but clear skies everywhere else. the points were above the clouded horizon quite far up in the sky. second sighting same day 8:20 AM Location: driving on Lake Shore Drive North east direction toward Chicago. i saw one smaller point of light in the sky above Chicago. they appeared to be faint and faded in and out a couple of times before disappearing. at about that time i saw another faint light flickered over the lake a few times i saw two helicopters, one over the lake hovering in place, another moving over the city. neither seemed high up enough to be the points of light and they were black. it is possible that the points of light could have been reflections on helicopters but unlikely. the points of light didn't appear to be any sort of plane or helicopter and they would probably have to be much higher up to appear so small and distant. i know what helicopters and planes look like at high altitudes, and these points of lights didn't resemble either. later the same day,maybe 3 hours or so had passed since the first sightings i saw a couple more of these lights as we were driving away from Chicago. both were very faint and brief, one appeared to be in front of some thin clouds, either that or it was shining through the cloud. as we moved away from the city however i no longer saw these lights. we drove out to indiana that day for some errands and i scanned the sky there as well. no lights. it appears that these lights can only be seen near the Chicago area and over the lake. up until this point i have never seen a UFO. so i was very excited when i saw these. i have tried to explain them many ways, like maybe their helicopters? very unlikely. weather balloons? im not even sure what those look like but i dont think thats what they were. i spent the rest of the day scanning the sky for any similar phenomena, but i haven't sighted anything since. i do plan to if i get the chance bring my telescope and a camera to Downtown Chicago or somewhere nearby to see if i can get pictures. unfortunately though my camera is old and not good quality so im not sure what good that would do. if anyone has seen these strange star like objects near Chicago please let me know, or even if you have sighted them else where. this is my first post here but i am sure that people will be able to comment. i really would appreciate feed back. also if you have any explanations for what i saw let me know. if it turns out to be something normal and terrestrial i may be a bit disappointed but i still would want to know, i am definitely open to any explanations."],"Object Shape":"Star-like","Weather Factors":"Unknown","Case Number":"51440","Longitude":"-87.622548","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Log Number":"US-10102013-0016","Country":"United States","Tags":"City","Latitude":"41.884754","Date Submitted":"10/10/2013 07:33 UTC"}