{"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Longitude":"-89.521554","Source":"MUFON","Tags":"City","City":"Portage","Object Shape":"Triangle","Log Number":"US-10102013-0024","Object Flight Path":"Straight-line path,Path with directional change","Summary":"Triangle Shaped, White Light Outlined Craft near Portage, Wisconsin","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=43.561757,+-89.521554(51448)&iwloc=A&hl=en\"> mufon case (51448) map </A>","Weather Factors":"Unknown","divs":["Sighting DetailsAt approximately 8:35 PM (Central Time) on Thursday, October 10 2013, I was seated in a lawn chair outdoors stargazing to the south on a clear night while cooking dinner. I observed a triangular shaped craft approaching from the south. I thought it odd that it did not have the green and red flashing lights that ordinary aircraft exhibit during nighttime flight. The second thing I noticed is that the craft did not make sound. The vehicle made an abrupt, instantaneous 90 degree turn without slowing. I got up, ran, opened the patio door and shouted to my wife, \"Come quick, I see a UFO, this is for real!\" My wife made it out the door in time to see the vehicle from it's rear side as it traveled to the North East. She confirmed that what we observed did not resemble an ordinary aircraft, and that it did not emit sound. I observed 5 bright white lights that formed an elongated triangle: Each point of the triangle had a light. On each side of the triangle, a light was positioned approximately halfway between the the leading front light, and the two lights forming the points of the tail. I'd estimate the object's altitude to be between higher than 2,000 feet, but lower than 7,000 feet. The object was larger than any jet that I have seen. Considering it's size, it is difficult to estimate it's speed, but it was faster than a low flying single engine propeller craft, and slower than a commercial jet liner. This is the very first time that I have observed an unidentified object flying in the sky. Was it some form of experimental military aircraft, or a craft that came from some other planet? That I do not know. What I do know is that I have never, ever, seen a vehicle that large change direction instantaneously! Unfortunately, the event unfolded so quickly that I did not have time to grab a camera."],"Sighting Duration":"Undisclosed","Region":"Wisconsin","files":["/var/www/straped/mufon/html2text/51448.html.txt","/var/www/straped/mufon/org/51448.html"],"Date Submitted":"10/10/2013 10:04 UTC","Case Number":"51448","Disposition":"Unresolved","Object Features":"Unknown","trends":["There have been no other sightings in Portage","This sighting has never been favorited."],"Date of the Event":"10/10/2013 08:35 UTC","Latitude":"43.561757"}