{"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/51447.html.txt","/var/www/straped/mufon/org/51447.html"],"Tags":"City","City":"Los Angeles","Disposition":"Unresolved","Object Shape":"Cigar, Other","Object Flight Path":"Stationary","divs":["sighting detailsafter work, i stopped at franks liquor store in century city.... popped in for milk. came out and decided to take in the lovely day; i had been inside all day at work. the sky was blue as blue could be (with only a very few sparse upper atmosphere clouds (very high, very thin, hardly any though). as i circled taking it all in (from west towards the east), suddenly i spotted a very small and extremely high up shiny silver object. i stopped and stared, and stared somemore; it did not move. it was too early for stars. it appeared extremely silver and shiny (my guess from the low western sun). i was flabbergasted. i must have stood there staring up into the sky for at least 20 minutes. a gentleman came along and asked me what i was staring at. at that point, it was centered between 2 very thin, yet noticeable clouds --- i pointed up, and said look between those 2 clouds. he looked up and said 'oh yea' and asked what it was... i stumbled for words, not really spitting any out. i did manage to tell him that it hadn't moved since i spotted it. he then went into the liquor store, bought his 'whatever' and upon coming back out, asked if it was still there and had it moved. i nodded to still there, said no it hadn't moved --- he looked up and again asked what it was.... i again fumbled for words (one doesn't really say, 'ufo' and be believed). he again said what was it, then in his own words said, \"et\"? i said, quite possibly perhaps. he said i was scaring him and he proceeded home. i quickly ran to the back door of the store and asked the owner if he had any binoculars.... and of course he did not. i must have stared for almost 50 minutes or so, not wanting to leave -- but wanting to leave. i live 5 minutes from that location. i knew if i could get home that i had camera, binoculars, compass, whatever --- at home that could help me document the moment. i finally decided that i had taken in this incredible moment long enough, and if i didn't try to get home (twilight was coming very shortly) - that i'd have absolutely no chance to see it better from home. i raced home, i pulled out my binoculars and watched it. it took some time to 'refind it' as the sky was vast (in binocular-view), but there it was still!!!! it had not moved. i didn't think that my camera could catch it in low-light sky at that point so watched until real stars starting appearing faintly and finally the completely sun set and there was no distinguishing it from stars. a few footnotes to add.... ** it was extremely hard to tell if this was a cigar-shaped, or dumbell-shaped object. it did not appear as an oval. it was so high and my eyes just could not properly focus on the 'shape' of it. i might have to insist however that it appeared dumbbell-shaped most of the time, however cigar-shaped would have been my first thought except that very often it appeared to have 2 round ends on it. ** quite often it went transparent. i do not think it was due to extremely thin clouds at the same altitude. while it might have been my eyes, there appeared to almost be a fuzzy grey-black transparent cloud\\something around it when it went transparent. i saw that everytime it went transparent. almost, as crazy as it sounds ---- as though it had a shield around it, or entered a slightly different realm for the moment. once it showed itself again, the greyish fuzziness around it disappeared. i do not think that it was my eyes creating that fuzziness, otherwise why wouldn't i see the fuzziness all the time while watching it. ** while watching it from the parking lot, an extremely high-flying aircraft flew perhaps 10 degrees to it's right. while i have no clue how high the object was, it went transparent as the aircraft flew by. it appeared that the two might have been in the same way upper airspace (both extremely high up there)... the aircraft was so very tiny leaving a contrail behind it.... it was very high up there. it certainly appeared as though the object was being cautious and did not want the aircraft to notice it whether with their instruments or maybe even perhaps with their own eyes. ** at some point, i realized that i had my cell phone. although a crappy phone camera, i did pull it out and took some pictures. sadly, i can't see a thing in any of them. when enlarged, they're too artifacted to see anything in the blue sky other than blue sky. ** one final note. and this i've no clue what it was, perhaps nothing. but at one point (this too was while in the parking lot), there appeared something much lower and to my right up in the sky. i watched it and watched it and it flew an extremely straight line and it never waivered. it's speed never increased nor decreased, it did not go up or down at all. i watched it until it was gone from my eyesight, i think it just sort of got too small and blended into the sky. it was a very light brown colored triangle. i thought it to poss be a balloon or a bag but watching it proved that it neither. it was fairly small, but at it's height - possibly the size of a car? it had no dimensional look to it whatsoever; it was flat..... no sides, no top, no bottom. it flew with 1 point forward and the other 2 points basically ---- 1 up, 1 down. it was very weird considering what i was seeing otherwise at the time. it flew much lower, think ballon-height when you can still see it pretty well (although not too low and definitely not a small dot). once it disappeared from site, i watched to see if it would \"meet up\" with the silver object.... but i never saw it again. i think it was way too small and even if it did meet up --- one would have never seen it. that too, i will never know what it was.... but it was awfully strange. i have not included it in this report as an object seen (reported only the main object \\\\\\ only 1 object), it just doesn't seem like i should, although...... ???? i would have reported this sooner, but mufon didn't even occur to me until the next day or two. having 2 extremely important events to deal with since then leaves me with my reporting of the event today. once here --- pure enthusiasm to see other reportings on the same date. way back in my youth, i had 'an experience' --- something at night and never able to prove a thing (although i know what i saw way up in the night sky)...... since then, my eyes have always travelled to the sky, always looking. i still cannot believe that i saw something, and especially during the daylight. i know what i saw the other day, and absolutely no one can take that away from me..... what i saw was as real as you and i. i still tingle."],"Case Number":"51447","Log Number":"US-10102013-0023","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=34.062229,+-118.4244(51447)&iwloc=A&hl=en\"> mufon case (51447) map </A>","trends":["There have been 404 other sightings in Los Angeles","There were 2 other sightings in Los Angeles on or around October 6th 2013"],"Source":"MUFON","Longitude":"-118.4244","Viewing Distance":"Over 1 Mile, Unknown","Object Features":"Unknown","Latitude":"34.062229","Country":"United States","Date Submitted":"10/10/2013 09:59 UTC","Summary":"Saw aREFLECTIVEobject HIGHinTheSky HOVERING-ITneverMoved. SilverShinySurface (frmSunReflect? SunLOWinWESTsky) OccassionallyTransparent notDuetoClouds (HidFrmVeryHighPlane). CIGARorDUMBELL-shaped (tooHIGHtoTell). AMAZING!","Date of the Event":"10/06/2013 06:00 UTC","Weather Factors":"Unknown"}