{"map":"<A HREF = \"http://maps.google.com/maps?q=36.648839,+-120.25266(51449)&iwloc=A&hl=en\"> mufon case (51449) map </A>","Summary":"Observed glistening object while watching Lemoore Naval Air Station jets do manuevers.","divs":["Sighting DetailsWhile doing field work as required by my job,was entertained by 2 LNAS jets doing manuevers above me.After viewing them for about 5 min,I noticed something bright to the west of where I was viewing the jets.I turned to notice 1 shiny object seemingly just hovering in the air.I continued watching it and started ruling out possibilities of what it might be by process of elimination. I viewed this object for just over an hour where it would start to fly away in an erratic pattern,moving south then making like a u-turn,then stop.I ruled out a balloon as there was a good south wind about 10-12 mph and the object was going against the wind when it moved.Also ruled out any celestial body as clouds would drift through and the object could be seen clearly below them. It was a bit peculiar to me that it didn't seem to get the attention of the jet's pilots.The jets went away after about a half hour but the object remained. I had other things to attend to so I left the scene still not knowing exactly what I saw. This is the second object I've seen in this area this year. The previous one was also witnessed by at least 3 of my co-workers who were working about 10 miles from me.And was caught on video by a couple of local tv stations."],"Object Features":"Unknown","trends":["There have been no other sightings in Tranquillity","This sighting has never been favorited."],"Disposition":"Unresolved","Viewing Distance":"Unknown","Log Number":"US-10102013-0025","Longitude":"-120.25266","Sighting Duration":"01:15:00","files":["/var/www/straped/mufon/html2text/51449.html.txt","/var/www/straped/mufon/org/51449.html"],"Source":"MUFON","Country":"United States","Weather Factors":"Unknown","Latitude":"36.648839","Object Shape":"Unknown","Case Number":"51449","Date of the Event":"10/10/2013 09:15 UTC","City":"Tranquillity","Object Flight Path":"Stationary","Region":"California","Date Submitted":"10/10/2013 10:15 UTC","Tags":"City"}