{"Country":"United States","Summary":"Cigar shaped UFO seen for brief period of time","files":["/var/www/straped/mufon/html2text/51450.html.txt","/var/www/straped/mufon/org/51450.html"],"Sighting Duration":"Undisclosed","Case Number":"51450","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsI was outside playing football with my brother when I noticed a cigar shaped object in the sky to my Northeast. I watched it for as long as I could, travel from Northeast to Southeast before losing it behind a tree that blocked my view. I first noticed the object when I was looking up to catch a football thrown by my brother. I thought at first it may have been a cargo plane as we are within 10 miles of a regional airport, and am used to seeing planes at different times of the day and different types of airplanes coming into the airport. The object was shaped like a cigar that seemed to be reflective and it had a darker band around the middle of the cigar. There were no wings or any type of flight control that I could see. The object did not have any discernable sound that I could hear, or any kind of vapor trail that I could see. The weather in our area was clear skies, about 75 degrees F. Humidity is unknown. The object seemed to be on a straight line path from Northeast to Southeast. Speed of the object is unknown due to not knowing the exact distance or knowing the scale of the object. At first I wasn't sure what I was seeing, and I tried to see if I could see a tail section or wings on the object. As I was looking at the UFO, my little brother turned to look in that direction too and he also witnessed it."],"trends":["There have been no other sightings in Port Byron","This sighting has never been favorited."],"Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=41.606422,+-90.335406(51450)&iwloc=A&hl=en\"> mufon case (51450) map </A>","Disposition":"Unresolved","Region":"Illinois","Weather Factors":"Unknown","Date Submitted":"10/10/2013 11:39 UTC","Tags":"City","Object Features":"Other","Object Shape":"Cigar","Log Number":"US-10102013-0025","City":"Port Byron","Longitude":"-90.335406","Latitude":"41.606422","Date of the Event":"10/10/2013 06:15 UTC","Source":"MUFON"}