{"Source":"MUFON","Country":"United States","Latitude":"42.54067","divs":["Sighting DetailsI was in the parking lot of my apartment building and I was getting out of my car and looked up and noticed right above me was a weird looking plane or maybe a drone, it was really short, like the tail end or the back end was shorter than most planes and it flew by this cloud like, circular object in the sky and there was no clouds in the sky, it was clear blue and this object was stationary, it wasn't moving back and forth, it was staying still so I thought that was weird, there was nothing else in the sky in that vicinity at that time. So I went into my apartment to get my binoculars to see if I could see it through my binoculars and went back outside and leaned up against my car. It took me a second to find this object in the sky again because if you are not looking for it, it would be hard to spot it in the clear blue sky so I found it again and tried to look through my binoculars and I couldn't focus them to see the object so then I thought maybe I can get my phone out and take pictures of it and maybe I can see this object in the pictures so I went back into my apartment and got my phone and came back out and had a hard time finding the object again but I did and starting taking pictures of the object at a couple different angles so I took about 4 different pictures and guess what? I got the object in one of the pictures but I have to magnify it in order to see it but you can clearly see that something small and cloud like is in the clear sky, if you magnify it, you can see it, its there. Now with me being a firm believer on UFOs and aliens, of course my first thought was its a UFO but now I'm not sure because it could just be a satellite because I know that the ISS (International Space Station) was in the sky the other night and you can see it with the naked eye so then I thought well maybe its just a satellite. I'm not sure what it was but I have a picture of it. **NOTE** I have the photo saved in my camera on my phone and don't know how to upload it from my phone onto my computer to upload it onto this site."],"Log Number":"US-10112013-0002","Object Shape":"Circle, Cylinder, Egg, Sphere, Star-like, Other","map":"<A HREF = \"http://maps.google.com/maps?q=42.54067,+-83.187414(51453)&iwloc=A&hl=en\"> mufon case (51453) map </A>","Viewing Distance":"Over One Mile","Region":"Michigan","Weather Factors":"Unknown","trends":["There have been 18 other sightings in Troy","There were no other sightings in Troy on or around October 10th 2013"],"files":["/var/www/straped/mufon/html2text/51453.html.txt","/var/www/straped/mufon/org/51453.html"],"Longitude":"-83.187414","Date of the Event":"10/10/2013 02:00 UTC","Tags":"City","Case Number":"51453","Object Features":"Unknown","Disposition":"Unresolved","City":"Troy","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Date Submitted":"10/11/2013 01:53 UTC","Summary":"At first I saw a weird looking plane or maybe a drone (the tail end was really short) and that flew by this object that I noticed in the sky, just stationary, not moving but it looked like it was shifting into various shapes and spinning around slowly."}