{"Summary":"thought it was a star blinking really fast. then it started moving fast, then slow, and changed directions abruptly.","Case Number":"51454","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Date Submitted":"10/11/2013 02:10 UTC","City":"Milan","divs":["Sighting DetailsI went up to my Friend Seans house to talk to him for a few minutes. When I got there he had met me in his yard at about 1:08am. We started talking, and then he said \"Look at that star, its blinking\". So we looked at it for a few seconds, and it seemed to start pulsating faster, with a bright whiteish-blue light. I asked him if it was moving, and he had confirmed that it was. It started out moving really slowly, but picked up pace fairly quickly. As it was moving through the sky, it would take a straight path, and then it would look like it was slithering through the sky, almost like a snake would slither. After a few more minutes of watching it, Sean went to get his girlfriend Chyenne from the house so she could see it. While he was gone, the object came to a dead stop out of nowhere. Sean had only been gone for a couple seconds before he returned with Chyenne. By the time we were all back together the object had moved from as far as the eye could see from one side of the sky to the other. As the object reached the horizon it made an abrupt turn to the left just before it had disappeared. Soon after the sighting, we began to hear strange noises In the woods behind his house. We can't, with any confidence, say that the object that we saw in the sky, and the unusual noises we heard in the woods following the sighting are related, but what we can all agree on is that we've never heard any thing like these noises coming from these woods before. And we've sure never seen anything in the skies like what we all saw tonight."],"Weather Factors":"Unknown","Tags":"City","Source":"MUFON","Sighting Duration":"Undisclosed","Date of the Event":"10/11/2013 01:09 UTC","files":["/var/www/straped/mufon/html2text/51454.html.txt","/var/www/straped/mufon/org/51454.html"],"Latitude":"39.193449","trends":["There has been one other sighting in Milan","There were no other sightings in Milan on or around October 11th 2013"],"Disposition":"Unresolved","Region":"Indiana","Object Features":"None","Log Number":"US-10112013-0003","map":"<A HREF = \"http://maps.google.com/maps?q=39.193449,+-85.098299(51454)&iwloc=A&hl=en\"> mufon case (51454) map </A>","Longitude":"-85.098299","Country":"United States","Viewing Distance":"Unknown","Object Shape":"Sphere"}