{"Disposition":"IFO","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","divs":["Sighting DetailsI know this is going to sound funny, and even believers like yourselves are going to take this claim with a grain of salt but luckily you can look into it for yourselves and I think it will be a worthwhile effort. All you have to do is go out and rent the movie the big lebowski. I have never heard of anyone else taking notice of the fact that there is an unidentified flying object in the sky in a scene of that film. Its near the end of the movie. The scene is where \"the dude\" played by Jeff Bridges and John goodman's character are standing on the edge of a cliff overlooking the pacific ocean about to spread of the ashes of there deceased friend. There are not one but 2 shots during john goodmans farewell speach where in the background sky a light orb like object appears not dissimilar from alot of ufo footage Ive seen. The first time it appears on the left of the screen in the blue sky on the left of goodmans head you will see the light come in from the left of the screen make a fish hook and float straight upwards in a seemingly directed manner. a second time not moments later it appears to the right of goodmans head and again floats upwards but this time at more of an angle. This object whatever it may well have been did not fly in the manner of a seagull or bird of any kind. I think its clear and fare to say based on observation that it cannot be that or any known aircraft as it would have been moving way too fast at angles unreasonable to our known technology. and it certainly is not any kind of light projection as the result of any camera equipment that I would know of. Its definately an object from my perspective and I think you will agree. The way it moves is very interesting. I hope you take the time out to look into it and please let me know of your findings. Just dont tell me its a bug. ;)"],"map":"<A HREF = \"http://maps.google.com/maps?q=46.734353,+-94.68126(5145)&iwloc=A&hl=en\"> mufon case (5145) map </A>","Object Shape":"Star-like","Source":"MUFON","Longitude":"-94.68126","Summary":"please read my detailed description","City":"Undisclosed","files":["/var/www/straped/mufon/html2text/5145.html.txt","/var/www/straped/mufon/org/5145.html"],"Region":"Minnesota","Tags":"City","Case Number":"5145","Latitude":"46.734353","trends":[],"Date of the Event":"Unknown","Log Number":"US-07252006-0004","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Country":"United States","Date Submitted":"07/25/2006 09:26 UTC","Object Features":"Undisclosed"}