{"Date Submitted":"10/11/2013 04:44 UTC","Object Features":"Dome","Viewing Distance":"Over One Mile","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/51464.html.txt","/var/www/straped/mufon/org/51464.html"],"trends":["There have been 52 other sightings in Myrtle Beach","There was one other sighting in Myrtle Beach on or around June 25th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.69662,+-78.877944(51464)&iwloc=A&hl=en\"> mufon case (51464) map </A>","City":"Myrtle Beach","Object Flight Path":"Stationary","Log Number":"US-10112013-0013","Region":"South Carolina","divs":["sighting detailsjune 2011, myrtle beach sc. 21:00 to 22:00 i believe the time was. the night was in the last week in june 2011, can't remember the day. i was sitting on the deck during my vacation week looking at the ocean, night time and seen a few stars, some clouds. instantly i witness an object blink on high above the ocean, at least 1\\2 mile to a mile up. this object was very bright, it blinked on for 60-80 seconds without moving. i'd say it was the size of a very bright star but bigger, much bigger, it was not pulsating,, just a bright lite. it then blinked off, about 2 minutes later the same thing happened, no motion whats so ever. this object did this three times i believe. i did not see any other objects, planes or choppers. this could not of been a military chopper or plane, i've seen choppers hover over the oceans during my military career, this was nothing like that and it was way to high to be searching for subs, to close to the coast i believe. i've never seen anything like this, a few years later i read a magazine and read a story about people seeing the same thing and objects,, i was like wow, this is crazy. i asked myself this question, did i see something unexplanable ? i'll never forget it."],"Date of the Event":"06/25/2011 09:15 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","Latitude":"33.69662","Tags":"City","Object Shape":"Sphere","Longitude":"-78.877944","Summary":"Orb lit up between 9pm 10pm, I believe over ocean for 1 minute blinked on then came on up the coast. No movement","Case Number":"51464","Weather Factors":"Unknown","Country":"United States"}