{"divs":["Sighting DetailsWas on back porch. I saw lights coming through the trees to southwest (approx. Somers, Wisc.) Thought the first few were helicopters, but more appeared and all moved above the trees. No sounds of engines. They glowed red. No flashing lights or strobes. Counted twelve in a group, with two more trailing behind. All were of same uniform size, shape and color. They were not aligned in any pattern or formation and each round red glowing orb looked separate from the others. Objects moved to the northwest at about the same speed expected from a small plane. No fast or erratic movements. The objects were unevenly spaced and all moving in same direction in what looked like a loose group. Two more trailed behind the larger group. Red light disappeared once they passed a point to the west, like a headlight would not be visible once it is turned away from viewer. I called two more witnesses out to see the event. None of us could identify what these round red lights were. We do have a lot of aircraft traffic here, there were planes visible in sky before, during and after sighting. We felt sure these were not planes or helicopters. Watched objects until lights were no longer visible as they moved due west. Total of about 4 minutes lapsed."],"Source":"MUFON","Region":"Wisconsin","map":"<A HREF = \"http://maps.google.com/maps?q=42.640297,+-87.910356(51463)&iwloc=A&hl=en\"> mufon case (51463) map </A>","Object Shape":"Sphere","Tags":"City","Object Flight Path":"Straight-line path","trends":["There have been no other sightings in Somers","This sighting has never been favorited."],"Date of the Event":"10/10/2013 08:30 UTC","Latitude":"42.640297","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/51463.html.txt","/var/www/straped/mufon/org/51463.html"],"Disposition":"Unresolved","Date Submitted":"10/11/2013 03:14 UTC","Sighting Duration":"Undisclosed","Country":"United States","Log Number":"US-10112013-0012","Case Number":"51463","Longitude":"-87.910356","City":"Somers","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Summary":"Ten red orbs sighted to the SW over Somers, with two trailing behind"}