{"City":"Montreal","trends":["There have been 47 other sightings in Montreal","There were no other sightings in Montreal on or around October 10th 2013"],"Latitude":"45.53719","Sighting Duration":"Undisclosed","Object Shape":"Sphere, Star-like","Source":"MUFON","Disposition":"Unresolved","Case Number":"51461","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Summary":"3 Lights hovering ,seemingly aligned , eventually the light furtheset away made a right turn, and I had to catch my bus","Tags":"City","Object Features":"None","Region":"Quebec","Date of the Event":"10/10/2013 07:18 UTC","Country":"Canada","Viewing Distance":"Unknown","Weather Factors":"Unknown","Date Submitted":"10/11/2013 01:08 UTC","divs":["Sighting DetailsI was on my way to meet some friends for our usual thursday night beer(s). I left my place at roughly 7:15 and arrived at the bus stop about 2 minutes later. The bus was scheduled to stop there at 7:22 As I crossed the street I noticed there were 3 people waiting for the bus, 1 to the south of the stop and 2 inside the shelter, even though the sky was clear that evening. What first caught my attention were 3 lights which initially I thought were spotlights for the tennis stadium. The lights seemed to be hovering, still, and very much aligned. For a second I pondered maybe some celestial alignment, but these were no planets, in my humble opinion. I knew I had a dilemma on my hands, as more people gathered at the bustop; do I miss my bus to stare at these odd lights which could end up to just be planes or helicopters? I watched for a minute or two and eventually the light furthest away turned to the right. The other 2 lights seemed to be flickering a bit more at this point, although their flickers all throughout were very subtle. I could see the bus approaching and decided to hop on. I gazed back at the lights as long as I could. They were still there as the bus took me downtown. I should also note that I could see other planes flying, one seemingly behind them ( seemed far away and had a blinking (blue) light, going the same direction from south to north as the furthest light also did. I live just below the flight path so constant planes flying overhead not far from the bus stop. I regret not taking any photos or videos, I don't know why It didn't occur to me to do so at the time. Maybe it's because don't have a fancy I phone."],"files":["/var/www/straped/mufon/html2text/51461.html.txt","/var/www/straped/mufon/org/51461.html"],"Log Number":"CA-10112013-0010","map":"<A HREF = \"http://maps.google.com/maps?q=45.53719,+-73.625102(51461)&iwloc=A&hl=en\"> mufon case (51461) map </A>","Longitude":"-73.625102"}