{"trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around July 12th 2011"],"Viewing Distance":"101-500 Feet","Object Flight Path":"Straight-line path,Path with directional change","Longitude":"-106.604491","Disposition":"Unresolved","divs":["Sighting DetailsOn July 2011 while sitting in the back yard clear sky's minimal cloud cover, I noticed a flash out the corner of my eye towards the Northwest, when my spouse advised me to look towards the Northwest because of a light that she observed that shot down from the sky. At first I thought it was a plane as it was coming our way! then I noticed that it was pulsating in a red orange manor moving slow about 4 to 5 hundred feet above the ground heading southeast making no nose and I realized it was not a plane or a helicopter. Then my spouse advised me of another object of the same nature that shot down from the same direction as the first one did and proceeded on the same flight path as the first object. Upon observing them I got very curious, we saw these objects maintaining a level height moving above our home towards Kirkland Air Force Base SE. then observed the two objects ascending upwards in a high rate of speed until out of sight! at that point because my spouse and I had watched these objects with both of us ending up in the front yard! I looked towards the Northwest and noticed several more of the same objects shooting down stopping and start moving laterally towards us at the same flight path as the first two, a total of nine objects where observed, I contact the Albuquerque Police Dept. to see if these objects where being reported and was advised that no other reports had been called in, they gave me a number to call which was the number to the air traffic control on the air base to see if they could give us info on the sightings. Upon calling and talking to the controller and giving him a description of what we where observing, he said they may be air force jets taking off and I advised him that these where not jets! or any type of aircraft I know of, and I advised him that these objects where headed his direction, as I was on the phone with him, and he advised that he had no visual on any objects coming his way of which I just could not believe because we where fallowing these objects as they headed the direction of the air base and went strait up!! we where perplexed at what we saw it was very bizarre! to say the least, we could not believe what we had just observed, the whole event took about 20 mins. These objects where on a flight path no question about it, they look like a barrel shaped object's that glowed and pulsated in orange red they looked to have been about maybe the size of a bus with a whitish light on the bottom part!. The Albuquerque police contacted me at around 11:45 to advised me that a police office observed the objects and thought them to be Flairs? and as I spoke to the dispatch person, I advised that flairs don't fly across the terrain on a flight path then go up! into the sky!! and she didn't know how to reply and noted that other people had called in on the objects!. I don't know if these were military, or skunk works air craft or what but these object moved without sound and moved weird and shot up into the sky! Flairs don't do that!!! this was very unbelievable as my spouse and I looked at each other with disbelief. I have held back cause no one will believe you and you know your going to get laughed at if you bring it to light! I saw your program on TV and thought I would share this with you for what it's worth, but very accurate none the less as to what we saw. Thank you Joe Macias"],"City":"Albuquerque","Source":"MUFON","Object Shape":"Egg, Fireball, Flash, Oval","map":"<A HREF = \"http://maps.google.com/maps?q=35.113843,+-106.604491(51462)&iwloc=A&hl=en\"> mufon case (51462) map </A>","Tags":"City","Date of the Event":"07/12/2011 10:11 UTC","Region":"New Mexico","Date Submitted":"10/11/2013 01:24 UTC","Log Number":"US-10112013-0011","Latitude":"35.113843","files":["/var/www/straped/mufon/html2text/51462.html.txt","/var/www/straped/mufon/org/51462.html"],"Case Number":"51462","Country":"United States","Sighting Duration":"01:17:17","Weather Factors":"Unknown","Object Features":"Unknown","Summary":"My spouse and I observed 9 objects that came down from the sky! moved SW to SE at a slow pace orange red pulsating no sound then went upwards and despaired"}