{"Object Features":"Patterned Surface","Disposition":"Unresolved","Case Number":"51468","trends":["There have been 2 other sightings in Elk City","There were no other sightings in Elk City on or around August 23rd 2011"],"Latitude":"35.421394","Country":"United States","Object Shape":"Boomerang, Triangle","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/51468.html.txt","/var/www/straped/mufon/org/51468.html"],"Region":"Oklahoma","Summary":"Triangular or Boomerang, with (3) three bright lights, but a darkened upper structure","Date of the Event":"08/23/2011 12:00 UTC","Log Number":"US-10112013-0017","Viewing Distance":"21-100 Feet","Source":"MUFON","Date Submitted":"10/11/2013 08:12 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.421394,+-99.397149(51468)&iwloc=A&hl=en\"> mufon case (51468) map </A>","Tags":"City","City":"Elk City","Weather Factors":"Unknown","Longitude":"-99.397149","divs":["Sighting DetailsI had gone to Clinton, OK. for parts was driving west on US Highway 40 between Elk City, OK. and Sayer, OK., when I was a couple of miles west of Elk City I noticed what I thought was a Helicopter checking the pipeline of in the distance a very bright beam came from the bottom of the craft(Helicopter) not at all uncommon in our industry, it then descended behind a hill. I continued on my way west and at times would see the object in the distance first to the East then after a time to the West I really wasnt concerned as this is common in the Oil and Gas Industry dealing with pipelines, but I became concerned when I noticed it approaching us ( my pickup and 5 tractor-trailer Trucks ) we all slowed a bit but still found nothing strange about this situation almost immediately it was upon us and following us sideways as we proceeded west on the highway, by now all I could see was two of the very bright very white illuminating lights from the lower section of the airframe, the lights were so bright it illuminated the forward section of the airframe, it occurred to me that the skin of the craft was a dull white-cream-grey organic looking patterned ( as in swirled raised featured designs ) brightly lit, this was not aircraft skin, I've worked on aircraft. This was so very close to me and I began to get a bit concerned, and quite angry it followed us sideways for approximately 2 to 3 miles where I turned off to drive North and lost site of the craft. IM a professional scientist and a total skeptic this infuriated me, later my wife whom I had called as I exited the highway and drove north told me I was enraged and she couldn't understand why, my question is why there were no reports of this encounter and why I was involved as I am still quite uncomfortable about all of this."],"Object Flight Path":"Straight-line path,Path with directional change,Path then hovering"}