{"Object Shape":"Teardrop","files":["/var/www/straped/mufon/html2text/5146.html.txt","/var/www/straped/mufon/org/5146.html"],"Longitude":"-71.065062","Latitude":"43.389761","Date Submitted":"09/07/2001 07:03 UTC","Summary":"Very high altitude flash across clear night sky","Source":"MUFON","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=43.389761,+-71.065062(5146)&iwloc=A&hl=en\"> mufon case (5146) map </A>","Case Number":"5146","Log Number":"US-07262006-0001","Disposition":"IFO","Weather Factors":"Unknown","Tags":"City","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Date of the Event":"09/07/2001 07:03 UTC","Sighting Duration":"00:20:01","City":"Farmington","trends":["There have been 3 other sightings in Farmington","There were no other sightings in Farmington on or around September 7th 2001"],"divs":["sighting detailsi was uncomfortable as most people are, wanting to report it, but i now feel more comfortable with it. my girlfriend and i were walking on a clear fall night, it was cold, but crystal clear. we were able to see all the stars. it was about 7pm and i saw this dash of light with streaking tail at a very high altitude. i have been in the california desert before and seen many shooting stars, and new this was too straight of a flight path. the dash was extremely fast and lasted about 25 seconds before it blipped out of sight. the strange thing that tipped me off was that there were 2 planes, that had to be civil air patrol, b\\c they were prop planes.....one was heading from the left going right and one was going to the left from the right. they were almost at the sme altitude as the sighting, and appeared as if on a search and it was within 5 minutes of my sighting! how ironic is that. i remember no report being made in the papers because i had looked! the only thing i can say about the shape of it was that it was moving in a straight pattern, was very high altitude and bright blueish, spherical or teardrop shaped. it lasted about 20 seconds and disappeared completely. --brodie"],"Viewing Distance":"Unknown","Region":"New Hampshire"}