{"Tags":"City","trends":["There have been 20 other sightings in Akron","There were no other sightings in Akron on or around October 11th 2013"],"Object Features":"None","files":["/var/www/straped/mufon/html2text/51472.html.txt","/var/www/straped/mufon/org/51472.html"],"Longitude":"-81.509395","Disposition":"Unresolved","Object Shape":"Fireball, Sphere, Star-like","Source":"MUFON","Latitude":"41.090265","Country":"United States","Date of the Event":"10/11/2013 06:03 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.090265,+-81.509395(51472)&iwloc=A&hl=en\"> mufon case (51472) map </A>","City":"Akron","divs":["Sighting DetailsI was leaving work with my co-worker and his wife at about 6:05, and we were stargazing before leaving because the sky was so clear. We noticed an object that was roughly as large as Saturn, as Saturn was out for us to compare it, but it was Blueish White and it started in a stationary position near the little dipper then started quickly traveling north east. at first we thought it might be a satellite but it started making rapid turns and getting brighter. When it stopped moving and paused for a short time, then Darted away in a rapid sharp angle turn. Then roughly 1 minute later in the same area of sky that the first object darted away to, a second object appeared, This one was roughly the same red color as Mars, but it was much brighter and a bit larger. This object moved to the east in a raped curving s turn then also halted for roughly 20 seconds and rapidly darted away in the same direction the first object vanished to. We thought they might be satellites at first, but I've seen the I.S.S. fly over and several other satellites and these were far brighter, moved far faster, were much larger, and turned and darted far faster than ANY satellite I've EVER seen! Finally, after the red object vanished, There was a large White streak that was roughly as wide as a cigarette, and at it's speed left a large streak about (to our eyes) 3 inches end to end. What made us question if it was a meteor was that it was going in the same direction that the first two objects vanished to and the streak didn't dissipate like the tail of a shooting star would, rather it stayed solid and all vanished at once. Almost looking like a Ship Jumping to Warp Speed on Start Trek. Now, had we only saw one of these object I wouldn't question what we saw. But given that there were three in such close proximity, all going in the same direction, it made us all question what we were seeing. Seeing these objects made all three of us elated, and extremely alert. As though we had just drank a gallon of coffee, and we work third shift and were all talking about how tired we were no more than 5 minutes prior to witnessing this. It was almost like these object overhead revitalized us!"],"Weather Factors":"Unknown","Log Number":"US-10112013-0021","Sighting Duration":"00:10:30","Date Submitted":"10/11/2013 09:33 UTC","Case Number":"51472","Summary":"Bright white-blue upjet flew fast turning path, then flew off. then red object did same. then LARGE white streak across sky","Region":"Ohio","Viewing Distance":"Over One Mile","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering"}