{"Date of the Event":"10/11/2013 12:00 UTC","Weather Factors":"Unknown","Object Shape":"Star-like","Region":"New York","Sighting Duration":"Undisclosed","Longitude":"-77.609532","Country":"United States","Case Number":"51478","Date Submitted":"10/12/2013 01:51 UTC","Tags":"City","Latitude":"43.16403","files":["/var/www/straped/mufon/html2text/51478.html.txt","/var/www/straped/mufon/org/51478.html"],"Object Flight Path":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.16403,+-77.609532(51478)&iwloc=A&hl=en\"> mufon case (51478) map </A>","Summary":"Bright starlike object under cloud cover and under plane path, disappeared momentarily to reappear in same spot","Disposition":"Unresolved","trends":["There have been 53 other sightings in Rochester","There were no other sightings in Rochester on or around October 11th 2013"],"Log Number":"US-10122013-0003","City":"Rochester","Source":"MUFON","divs":["sighting detailswe were on the way home from a grocery store at sunset and noticed a very large bright star-like object hovering in the sky. a plane passed above it and the star-like object was under the advancing cloud cover. as we decided to drive west towards it on the highway, we witnessed it quickly flicker and diminish in its light intensity but noticed a dark spherical object in its place before it disappeared. upon arriving home, it reappeared with the same light intensity with what seemed from the naked eye like a red light at the bottom of the bright object below cloud cover. it did not move and was not a plane but would dim then gain brightness. the cell phone pictures are of poor quality. of note, there were several sightings the evening previous (several witnesses) over lake ontario of bright orange\\red objects in the sky bouncing around and disappearing to reappear with blue contrails that disappeared with the objects. this area has also had sightings of a bright green orb in the southwest two weeks ago that appears and moves at 90 degree angles within seconds then disappears."],"Viewing Distance":"Unknown","Object Features":"Other"}