{"trends":["There has been one other sighting in Cootamundra","There was one other sighting in Cootamundra on or around October 9th 1977"],"Summary":"Travelling by bus south through large open valley when bright light seen darting erratically. Then it darted at speed behind hill and a flash illuminated the hill outline against a dark sky.","Log Number":"AU-10112013-0020","Tags":"City","files":["/var/www/straped/mufon/html2text/51470.html.txt","/var/www/straped/mufon/org/51470.html"],"Object Features":"None","Weather Factors":"Unknown","Region":"New South Wales","Object Shape":"Fireball","City":"Cootamundra","Sighting Duration":"Undisclosed","Longitude":"147.99353","Case Number":"51470","Date Submitted":"10/11/2013 08:42 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=-34.653342,+147.99353(51470)&iwloc=A&hl=en\"> mufon case (51470) map </A>","Source":"MUFON","divs":["Sighting DetailsTravelling at night in a coach when I noticed a star that seemed to be dancing. I thought it may have been because of the window glass vibrating so I stood up and opened the sliding section above so i could see it without looking through glass. I told others on the bus and we all watched it ascend and descend and move at angles to the north and south. It just looked like a star but it moved very fast in a zigzag fashion for up to five minutes as we traversed the large wide open valley. It then dropped at high speed at around 45 degrees to the south east and disappeared behind the outline of a series of hills. Moments later there was a bright flash which outlined the hills from behind. Everyone on the bus witnessed it and all discussed what it may have been throughout the rest of our journey. All we could agree on was that it was was a UFO. After all was said and done this was the most discussed and thought of event of that days excursion."],"Date of the Event":"10/09/1977 12:00 UTC","Latitude":"-34.653342","Disposition":"Unresolved","Object Flight Path":"Path with directional change","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Country":"Australia"}