{"Latitude":"36.878648","Date Submitted":"10/12/2013 12:52 UTC","Region":"Kentucky","trends":["There have been 4 other sightings in Hopkinsville","There were no other sightings in Hopkinsville on or around October 11th 2013"],"divs":["sighting detailsi was driving from murray ky to bowling green to visit the family. i was jamming out to a soundtrack i had on my iphone when i happened to look up on my lefthand side. i didn't look to see if anyone was behind me but i started slamming on the brakes slowly just so i could catch a glimpse at just how beautiful it was. i saw what appeared to be a large airplane but with a bright turquoise underbelly that was domelike in the front and got smaller near the rear but didn't come to a full point. the wings were short and had some turquoise on them as well as red lights on each end. it was radiating these colors almost like it was a thermo plane. i automatically questioned whether the black suv\\tahoe in front of me saw it or if i was just seeing things myself. i believe that's why i slowed down and looked over several times. i kept telling myself nu uh.. theres no way.. but it was there every time i looked over. i was just entering hopkinsville and i remember that because i wanted to remember a landmark so that i could be aware of anything in the news that was happening that might make this make more sense. the little green sign on the right hand side of the road said hopkinsville and the closest building nearby was a church building so i used it as a reference point. the unidentified object was seen on the west hand side of the church building in an open field. i also just thought that it might have been the a thermo plane that picks up heat that the gov.would use to search for illegal crops or for someone who was on the run from the cops. but then again flying objects have codes to adhere to and these bright lights do not fall into code. i honestly wish i had stopped but being i'm a 24 year old female and was alone made things seem a little eery so i didn't. don't know if i'll see it again but i kind of hope so, it was so beautiful and i wasn't really afraid of it. more like mesmerized. if anyone sees anything just report it, we all need to know."],"Object Features":"Wings","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=36.878648,+-87.516732(51476)&iwloc=A&hl=en\"> mufon case (51476) map </A>","Object Flight Path":"Path then hovering","City":"Hopkinsville","Object Shape":"Blimp, Cone, Cylinder, Triangle","Disposition":"Unresolved","Country":"United States","files":["/var/www/straped/mufon/html2text/51476.html.txt","/var/www/straped/mufon/org/51476.html"],"Log Number":"US-10122013-0001","Summary":"The Brightest thing I've ever seen in the sky besides fireworks","Weather Factors":"Unknown","Date of the Event":"10/11/2013 07:45 UTC","Source":"MUFON","Longitude":"-87.516732","Sighting Duration":"Undisclosed","Tags":"City","Case Number":"51476"}