{"Weather Factors":"Unknown","Summary":"Observed a round pulsating very bright red orange light.","divs":["Sighting DetailsMy husband and I were on our deck when we observed a round pulsating very bright orange light. At first we thought it may be a plane on fire as the color appeared more flame-like than traditional plane lights. We did observe what appeared to be pulsating red lights behind the main orange light. The object was traveling north rather slowly. When above our house it made an abrupt right turn. As it was heading west, into cloud cover, we lost sight of the object. My husband who is well-educated in aeronautics estimated it was traveling at an altitude of 20,000 feet at about 500-600 MPH. The turn made was abrupt and not typical of a normal commercial airliner, and was more the type of turn you would witness from a military jet. We live on the flight path of both an International and a county airport, and are very familiar with seeing planes in the sky over our home. This was not a plane. Approximately 10 minutes before our , we did hear a helicopter in the sky over our neighborhood. We cannot be sure this is connected, as we often hear helicopters taking off from the nearby airport."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.447225,+-79.986156(51487)&iwloc=A&hl=en\"> mufon case (51487) map </A>","Country":"United States","Disposition":"Unresolved","Longitude":"-79.986156","files":["/var/www/straped/mufon/html2text/51487.html.txt","/var/www/straped/mufon/org/51487.html"],"Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Case Number":"51487","Region":"Pennsylvania","Object Features":"Unknown","Latitude":"40.447225","City":"Pittsburgh","Tags":"City","Object Flight Path":"Path with directional change","Date Submitted":"10/12/2013 08:33 UTC","Date of the Event":"10/12/2013 08:15 UTC","Source":"MUFON","Object Shape":"Unknown","trends":["There have been 122 other sightings in Pittsburgh","There were no other sightings in Pittsburgh on or around October 12th 2013"],"Log Number":"US-10122013-0012"}