{"Region":"Texas","Log Number":"US-10132013-0002","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Object Flight Path":"Straight-line path,Other","Sighting Duration":"Undisclosed","Case Number":"51502","Object Shape":"Triangle","trends":["There have been 188 other sightings in Austin","There were 3 other sightings in Austin on or around October 12th 2013"],"Longitude":"-97.769135","Date of the Event":"10/12/2013 08:55 UTC","files":["/var/www/straped/mufon/html2text/51502.html.txt","/var/www/straped/mufon/org/51502.html"],"Country":"United States","Date Submitted":"10/13/2013 01:08 UTC","Source":"MUFON","Summary":"Three lights flickering golden yellow orange in a triangle formation tumbling slowly on course north until it faded into clouds, at THE CURE section of ACL FEST, I captured on phone video, shared experience with husband, found another concert goer as wit","Object Features":"Unknown","Latitude":"30.263691","divs":["Sighting DetailsI was sitting at the ACL Fest during THE CURE about 845 pm and was a bit far back so was videoing with my phone the amazing searchlight display and stage light show. I'd taken several vids. I noticed obove left and behind the stage three lights flickering Ogden yellow orange in the formation of a triangle tumbling slowly north trough the sky. I couldn't believe I was seeing a classic triangle UFO formation so having already taken several vids I had the phone ready after I pulled it out and unlocked it and took a 30 second video there bout at 855 pm. I did take time to zoom in a bit before hitting the red button. I followed it until it faded into the clouds going north. I know my husband saw it before me but he only confirmed my seeing it when I mentioned it then I videoed. After taking the video I discussed what I thought it was with my husband. I then inquired of other concert goers if they saw the lights and got several no's and two yes\"'s. I asked permission to have the guys email and he gave it to me. I did not ask for the girls because she was very occupied making out with her boyfriend, (they were so cute)."],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=30.263691,+-97.769135(51502)&iwloc=A&hl=en\"> mufon case (51502) map </A>","Tags":"City","City":"Austin"}