{"Case Number":"51509","Log Number":"US-10132013-0009","Object Features":"None","Source":"MUFON","Tags":"City","trends":["There have been 188 other sightings in Austin","There were 3 other sightings in Austin on or around October 12th 2013","This sighting has been favorited 1 time.",""],"Latitude":"30.264711","Object Shape":"Triangle","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Date of the Event":"10/12/2013 12:00 UTC","Longitude":"-97.765935","Region":"Texas","Sighting Duration":"Undisclosed","Date Submitted":"10/13/2013 10:52 UTC","City":"Austin","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=30.264711,+-97.765935(51509)&iwloc=A&hl=en\"> mufon case (51509) map </A>","divs":["Sighting DetailsI was attending ACL Festival 2013 at Zilker Park, Austin, Travis County, Texas. A friend & I were laying on the grass looking up at the clouds where the Park's spotlights were bouncing around. At the time it was mostly cloudy with the crescent moon occasionally appearing & now & then a star through a hole in the clouds. It was around 9 p.m. & The Cure was playing-- we were laying facing Southish because downtown was to our North. I saw the lights first-- they were orange, in a clear triangle shape, spaced perfectly apart from one another. They were below the clouds & were probably moving in a vaguely NE direction across the Park. We couldn't see any visible structure between the lights. At one point one of the lights seemed to move ahead-- but I think whatever craft it was tilted or dipped slightly. We watched it until it disappeared into the clouds-- it hovered at one point, directly over the park where the spot lights were going up more densely-- then it proceeded on across & it was hard to tell due to the clouds, but I think it ascended up higher through them. It didn't seem to be in any big hurry, but it didn't stick around either. The whole thing from start to finish was probably 4 minutes from the time I spotted it to the time it disappeared. I took a pic of it with my camera phone-- I'd already put away the Nikon because earlier we had thought it was going to rain as the wind had picked up-- but then it didn't until later. You can't see the orange color in this photo, & it was a lot more impressive & distinct than this makes them look. I was in disbelief-- I live in West Texas where there is little light pollution & star gazing is one of my fave past times. I have seen lights in the past I couldn't really explain-- except they didn't appear to be an airplane, a blimp, a jet, a helicopter, etc-- but nothing I have ever looked up & seen & thought WHOA! I was so stunned it took me a couple of minutes to realize I could get a photo of it, honestly. I've heard about triangle light UFOs & I've seen photos of them, videos, but I never dreamed I'd look up over Austin & see one."],"Weather Factors":"Unknown","Summary":"3 orange lights appeared under cloud cover at ACL Festival, Zilker Park, Austin.","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/51509.html.txt","/var/www/straped/mufon/more/51509_submitter_file1__UFO1.jpg","/var/www/straped/mufon/org/51509.html"],"Country":"United States"}