{"Country":"United States","Viewing Distance":"21-100 Feet","Region":"Georgia","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Disposition":"Unresolved","Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=31.931723,+-83.87536(51503)&iwloc=A&hl=en\"> mufon case (51503) map </A>","Tags":"City","Sighting Duration":"Undisclosed","City":"Cordele","Source":"MUFON","Latitude":"31.931723","Date Submitted":"10/13/2013 03:25 UTC","Object Features":"Other","Date of the Event":"08/15/2013 12:00 UTC","Log Number":"US-10132013-0003","Longitude":"-83.87536","Case Number":"51503","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/51503.html.txt","/var/www/straped/mufon/org/51503.html"],"trends":["There has been one other sighting in Cordele","There were no other sightings in Cordele on or around August 15th 2013"],"divs":["sighting details i was driving into town from lake blackshear on mckinney road. when i turned on mckinney road,(from scenic route road), and topped the first hill i noticed what i thought was a law enforcement car with it's blue lights making a stop, on coney road. coney rd. intersects mckinney rd. about a mile down the road. the pulsating light looked like they were on coney rd. about a 1\\4 mile to my right. as i drove toward coney i noticed the blue pulsating light was coming across the field parallel to mckinney rd. toward me. it was about 50 to 60 feet out in the field and about 25 feet off the ground. the object had a dull white glow and had a blue bright fuzzy halo that was pulsating. the object including the halo was about 12 to 16 feet across with the white center being approx. 4 to 5 1\\2 feet across. i was traveling at about 40 mph and i estimate the object was traveling toward me at 10 to 20 mph at this point. i pulled over and got out of my truck and observed the object travel pass me. the object then took off over the lake at a approx. 45 degree angle, what looked to me, into space in fractions of a second. i looked back toward coney rd. trying to make sense of it all and then looked back toward the lake. when i looked back the object was hovering over an irrigation rig that was in use, pulsating and hovering over the end water jet. i noticed the intensity of the pulses increasing and got scared. i got in my truck and finished driving into town. as i drove off, i looked back, but i could not see the object."],"Summary":"At distance a blue pulsating light, up close White solid object w/ blue halo pulsating."}