{"City":"Simi Valley","Date of the Event":"10/11/2013 03:40 UTC","Disposition":"Unresolved","trends":["There have been 20 other sightings in Simi Valley","There were no other sightings in Simi Valley on or around October 11th 2013"],"Latitude":"34.273757","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Tags":"City","Object Shape":"Other","Object Features":"Wings","Date Submitted":"10/13/2013 09:10 UTC","Summary":"Extremely large, looked like huge curved backwards wings, it looked like a huge curl.","Object Flight Path":"Stationary,Hovering then path","files":["/var/www/straped/mufon/html2text/51506.html.txt","/var/www/straped/mufon/org/51506.html"],"Sighting Duration":"Undisclosed","Log Number":"US-10132013-0007","Longitude":"-118.778352","Weather Factors":"Unknown","divs":["Sighting DetailsI was driving south at the far southeast edge of Simi Valley, just about to get on the road that hugs the hills there, on my way to Santa Susana Pass. when i spotted this huge, curled wing above the Chatsworth hills, probably 300 ft above the hill, just hovering, then slid backwarsds and to its left (appeared to go west but unsure). It was partly cloudy and it was under overcast clouds as was I, but there was patchy sunlight all around. It was CRYSTAL CLEAR AND HUGE! It was also stunni.gly beautiful, had an amazing graceful design and unlike anything ive ever seen before....it was so real itlooked amazing. I was driving my sister home from work...when i saw it, i immediately pulled over and stopped the car, anticipating that it was going to come over the hill and into view...but it BACKED OUT OF THERE!! My sister did not witness it. We quickly drove to the other side of the hill range, but it was gone. Honestly the most amazing thing ive ever witnessed. Anyone else see this thing?? I will mention it was hovering over an old rocket test site....the ground there is severely contaminated because of that. There are plenry of places something that size could land back in there."],"Region":"California","Case Number":"51506","map":"<A HREF = \"http://maps.google.com/maps?q=34.273757,+-118.778352(51506)&iwloc=A&hl=en\"> mufon case (51506) map </A>"}