{"Region":"Florida","City":"Parrish","trends":["There have been 2 other sightings in Parrish","There was one other sighting in Parrish on or around October 12th 2013"],"Tags":"City","Weather Factors":"Unknown","Source":"MUFON","Log Number":"US-10132013-0010","Sighting Duration":"Undisclosed","Date Submitted":"10/13/2013 11:23 UTC","Date of the Event":"10/12/2013 09:00 UTC","Object Shape":"Other","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=27.587536,+-82.425094(51510)&iwloc=A&hl=en\"> mufon case (51510) map </A>","Country":"United States","Longitude":"-82.425094","Case Number":"51510","Object Features":"Other","Viewing Distance":"501 Feet - 1 Mile","Summary":"Two beautiful Ufo with blue aura dancing in the sky above Parish, FL","files":["/var/www/straped/mufon/html2text/51510.html.txt","/var/www/straped/mufon/org/51510.html"],"Object Flight Path":"Hovering then path,Path with directional change,Other","divs":["Sighting DetailsThere were four witnesses during this event. My boyfriend Zeke, my little brother Devin, our best friend John and I myself were in our car going to pick up a friend who lives in Parish, FL. Since we live more into Bradenton, FL we get really observant when there are no lights to obstruct our view of the night sky. As we drove down the road which had no lights we saw the two objects above the tree line. This was the first time we saw them. I only saw two blue lights which were about a mile away. Zeke who was not driving started yelling, saying that they were flying around each other in a tight circle. As we went further down the road we lost sight of them. After we had turned into the entrance of our friends neighborhood we changed our heading direction to the South and out of nowhere right in front of us the two objects appeared again, this time in full view. They were also a lot closer, way less than a mile away. As we freaked out a little bit we became silent as the objects began to orbit themselves again. This time they dropped into a graceful spiral and flew down towards the ground in the shape of DNA and left light trails behind them (not too powerful, the light resembled aura light instead). The detail that I could see had tripled since we first saw them down the road. They did not seem solid or like \"ships\" at all. They were made of delicate blue lights which wove around intricately to create a shape that I cannot describe. All I can say is that they were \"not absolutely geometrical\" but they were the same. They preformed one of the most graceful flight patterns I have ever seen. It was similar to a dance, like two eagles wooing one another and it was absolutely beautiful. I stopped the car and we lost sight of them through the trees ahead. We look for them a little bit but we were already late to pick our friend up so we found his house and as we waited for him to come outside we all got out of the car to look some more to see if they would come back. They did not but a helicopter immediately flew into sight coming from the East (inland) and traveled diagonally out to the West (the coast) towards the Palmetto-Bradenton area. It flew through that exact same air space where we observed to light objects. We could hear the helicopter, saw it's blinking lights and watched as it just kept flying towards that coastline."],"Latitude":"27.587536"}