{"Object Shape":"Circle, Star-like","divs":["sighting detailsi was sitting on my patio in my back yard at approx 8:05pm est, when i spotted what looked like a very bright shiny round object similar to daylight star. moving very slowly from east to west. there was a shiny small what looked like a chain with a small bright round object on the end, coming from the left side of the circular object. it came straight out, fell down like a pendulam and was taken back inside the object. i watched through my telescope for approx 6 to 8 minutes and saw this chain like motion approx 9 or 10 times. it reminded me very much of something sampling the atmosphere the way it shot out, swang down and was pulled back in again. i watched it until i could no longer see it behind a big oak tree in my back yard. i own a telescope, so i make a point to look up when i'm outside. i first thought it might be the isp, but it was moving way too slowly. the object looked like a bright disk through my telescope. it did not move up and down, only in a pretty straight east\\west line. i was very excited because i had never seen anything like it before. i first thought the chain like object was distortion through the lense."],"Object Features":"None","Date Submitted":"07/26/2006 08:09 UTC","Case Number":"5151","Latitude":"30.336314","Sighting Duration":"Undisclosed","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=30.336314,+-81.646131(5151)&iwloc=A&hl=en\"> mufon case (5151) map </A>","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/5151.html.txt","/var/www/straped/mufon/org/5151.html"],"Disposition":"Unresolved","Longitude":"-81.646131","Source":"MUFON","City":"Jacksonville","Weather Factors":"Unknown","Log Number":"US-07272006-0003","Viewing Distance":"Unknown","Country":"United States","Summary":"shiny round metallic object slowly moving from east to west","Region":"Florida","Date of the Event":"07/26/2006 08:09 UTC","trends":["There have been 66 other sightings in Jacksonville","There were no other sightings in Jacksonville on or around July 26th 2006"]}