{"Object Shape":"Blimp, Circle, Disc, Flash, Sphere, Other","Tags":"City","Source":"MUFON","Viewing Distance":"Unknown","Date of the Event":"12/09/2012 12:00 UTC","Region":"Florida","files":["/var/www/straped/mufon/html2text/51517.html.txt","/var/www/straped/mufon/org/51517.html"],"Disposition":"Unresolved","Date Submitted":"10/13/2013 04:44 UTC","divs":["sighting detailsi have 3 events, so difficult to answer your questions. all were at cruise ship ports as i like watching the ships come and go. the first one was in port everglades (fort lauderdale). it was on dec 9, 2012. it was early morning while still dark out. above the ships was what looked like old fashioned circus tents with peaks up top i have two photos...one shows the ships below and the other doesn't. you can also see the reflection of my christmas tree. sorry. i have photos and some video of all three events but i don't know if i can send them as i was watching them on a live webcam and they are \"copywrighted\". anyhow, the second event happened sept 18 & 19, 2013 (the first time there)in bermuda (kings wharf). i was watching through a cruise ship's \"bridge cam\" when it was dark. don't know if it had an infrared camera, but i was able to see this very tall thing at the far end of the dock. it was black and it reminded me of something i'd seen before. it was like that scene in \"men in black\" where there was this tall \"pilar\" (like what hold up an overpass on the highways) and then this disk on top of it, except the top of the one i saw seemed to be leaning backwards a bit. now off to the left of the disk it looked like some child got a hold of a black magic marker and drew lines from it toward the water where another ship could park (but wasn't). they were somewhat straight lines but at one point it looked almost like a triangle. also on both sides of the dock, some of the water looked lit up. not a bright light, but lighter than the surounding water on either side of it. no light bulbs. just lit up. also on video i talk about how i was seeing these bright lights one which stayed on all the time and one appearing to be next to it would go off for awhile and then back on. one was a white light and the flashing one green. the white one seems to be about where the small cruise ship terminal is located, but i don't see a whole building lit up. it's not like windows. it was also nightime where there shouldn't be anyone in that terminal especially since there was no ship at that part of the wharf. oh by the way, the \"bridge cam\" isn't continuous. it changes every 30 seconds. the next two times this ship came into this port, the captain parked it facing in the oposite direction. don't know why as it has always parked the other way. so the camera was useless those weeks. the next event was in port canaveral on september 28th. as usual i was waiting to see if any cruise ships were coming in the wee hours of the morning. when the port came up there was this bright white six-sided thingy not too far from the water. it was a little bleary, but it looked like the sides were straight up and down on the sides and \"v\" shaped on the top and bottom. well the top was an upside down \"v\". this was to the right side of center screen. also there was some orange thingy (different shape) to the very top left. have video and still photos. at some point the orange thing went away. didn't see it go. the bright white light did strange things. it started to disappear from the top, but not straight across. i could see the movement of it falling apart. eventually there was only a tiny bit left of it and a fine blue line showed up. eventually the whole thing was gone. did i say i have photos and video of that? well i do. now i only have photos and video again at that port on october 1st. i don't know why i missed the 29th and 30th because i didn't have wifi access. on october 1st there were big things going on in port canaveral. got a lot of stills and video. there were a whole bunch of these very bleary somewhat big dots but not perfectly round. anyhow most of them changed their shape and just disappeared all together. again there were orangy\\yellow \"dots\" as well as white. some bright and some not so much. some i could see white lines (even on the white \"dots\") developing before my eyes. some had one and some had two. some dots seem to split in half and a white line would form vertically whereas some were horizontal. when i went back later that night and the next morning, everything was gone. haven't seen any activity since then, but i keep looking. now just a few days ago that ship that was in bermuda before came back. this time it was facing the right direction. i made a point of start watching it before dusk. i had checked into the port earlier in the day to see if it would show up when it was still light out. at first there was nothing there. then i was thinking i was seeing this object again but wasn't sure. a matter of a few minutes later i was definitely seeing it, but it was a faint color blue. as time went by it got a more solid shape and darker blue. eventually it was black as i had seen on previous trips. oh this time there was a ship parked in that other location in the port. the two ships bows were facing each other and fairly close. now this time there were like three faint white \"dots\" between the two bows. the other things i had been seeing in port canaveral were not perfectly round like these i was seeing in bermuda. i would like to know what all that stuff is....from circus shape tents to disappearing and changing shaped \"dots\" to big black objects in the sky are. got any answers for me? they don't fly, so technically they are not ufo's."],"Sighting Duration":"Undisclosed","Longitude":"-80.140629","trends":["There have been 37 other sightings in Fort Lauderdale","There were no other sightings in Fort Lauderdale on or around December 9th 2012"],"City":"Fort Lauderdale","map":"<A HREF = \"http://maps.google.com/maps?q=26.131708,+-80.140629(51517)&iwloc=A&hl=en\"> mufon case (51517) map </A>","Object Features":"None","Case Number":"51517","Latitude":"26.131708","Object Flight Path":"Stationary,Other","Summary":"3 DIFFERENT EVENTS (AND DATES) OVER CRUISE SHIP PORTS. TWO IN FLORIDA & ONE I IN BERMUDA","Log Number":"US-10132013-0017","Country":"United States","Weather Factors":"Unknown"}