{"divs":["sighting detailsi went outside to walk the dogs for the night just like every other night. i live in an apartment complex and walk the dogs in a grassy area between the buildings. while walking i looked up at the sky and noticed a bright light in the sky. the light at first appeared to be stationary but then began moving in what looked to be in the opposite direction at about a 45* angle. the object began swaying back and forth from left to right while continuing to move forward in a straight line. the object was visable for approx 5 mins before disappearing behind the apartment building across from mine. at the same time there were multiple aircraft in the area that were also visible due to an airport in the area. my first thought was that it was just another airplane, but then i thought to myself that it was strange how none of the others were just 1 solid bright white light. all the other aircraft were the typical blinking blue\\red lights and were moving perfectly straight. the object i saw had no blinking\\flashing lights. after i lost sight of the object i just stared at the sky and felt very confused, wondering if i had actually just whitnessed a ufo."],"Source":"MUFON","Longitude":"-83.723679","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/51524.html.txt","/var/www/straped/mufon/org/51524.html"],"Tags":"City","Disposition":"Unresolved","Log Number":"US-10132013-0024","Object Shape":"Oval","Weather Factors":"Unknown","Viewing Distance":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","Summary":"Bright light appeared to sway from left to right while traveling in a straight path","City":"Fenton","Latitude":"42.809347","Date of the Event":"10/13/2013 07:55 UTC","trends":["There have been 7 other sightings in Fenton","There were no other sightings in Fenton on or around October 13th 2013"],"Case Number":"51524","Region":"Michigan","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=42.809347,+-83.723679(51524)&iwloc=A&hl=en\"> mufon case (51524) map </A>","Date Submitted":"10/13/2013 08:39 UTC"}