{"Latitude":"33.775207","Log Number":"US-10132013-0028","Date Submitted":"10/13/2013 11:19 UTC","divs":["Sighting DetailsReporting for a friend who does not have computer access: \"My dad and I were getting ready for work when my mother called us outside to see a meteor shower. Both of us came out and saw the lights but realized it was not a meteor shower but lights blinking on and off in a stationary position. The three of us continued to stare at the object. There was not a sound coming from it. I sent my dad in to get a pair of binoculars and we looked at the object carefully with them. We discovered the lights were not blinking on and off as we thought but were dimming and then brightening. When they were dim you could not see them with the naked eye. The lights circled a disk shaped black mass that seemed to create a void space in the sky yet at times it seemed almost tranparent. All of the lights appeared to be white there was one white light on the top as we were able to view it as it left. After about ten to twelve minutes the object started to move directly north toward town. It moved slowly with no sound. It looked like it just floated away. Since there was nothing to use as a reference I would guess it was between 50' and 100' in diameter. As it moved north, it appeared to be almost at tree top level around 60' to 100' and the body seemed to turn translucent looking like a frosted glass. Total time viewed was about fifteen to eighteen minutes.\" All three witnesses are mature, level-headed adults who wish to remain anonymous. The man reporting the incident has always been skeptical about UFO reports."],"Object Features":"None","Object Shape":"Disc, Oval","Viewing Distance":"101-500 Feet","Sighting Duration":"00:18:00","Longitude":"-79.021372","Region":"South Carolina","Source":"MUFON","Tags":"City","Disposition":"Unresolved","Date of the Event":"09/23/2013 05:30 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/51528.html.txt","/var/www/straped/mufon/org/51528.html"],"Case Number":"51528","Summary":"Blinking lights on craft over house then moved north to tree line.","trends":["There have been 4 other sightings in Conway","There were no other sightings in Conway on or around September 23rd 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.775207,+-79.021372(51528)&iwloc=A&hl=en\"> mufon case (51528) map </A>","City":"Conway","Object Flight Path":"Hovering then path,Straight-line path","Weather Factors":"Unknown"}