{"Case Number":"51529","Summary":"spotted \"strip of cloud\" noticed it 3 hrs later in same spot. light brightened then dimmed, had trail behind it. did this a few times","Longitude":"-88.33478","Source":"MUFON","Date Submitted":"10/14/2013 12:10 UTC","Viewing Distance":"Unknown","Object Flight Path":"Hovering then path","Date of the Event":"10/13/2013 03:30 UTC","Latitude":"43.107008","Tags":"City","Weather Factors":"Unknown","City":"Hartland","Country":"United States","Sighting Duration":"Undisclosed","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=43.107008,+-88.33478(51529)&iwloc=A&hl=en\"> mufon case (51529) map </A>","Object Shape":"Star-like","divs":["Sighting DetailsMy boyfriend and I were just pulling into a pumpkin farm. He said to me, \" that's a strange place for one single cloud\"... as he was looking up towards the sun just to the west of it. There wasn't a cloud in the sky. It was about 3:30p.m.on the 13th of October. I then looked up, and saw what he was talking about. It looked like a very short contrail off of an airplane, or like an odd shaped thin elongated cloud. I responded saying it was just a contrail from an airplane. We then dismissed it, and carried on our pumpkin picking at the farm. Later, after we had left the farm, and traveled to another nearby city to run some errands, we were finally heading back home. We had just gotten onto HWY16 traveling west when my boyfriend again noticed this \"cloud\". It was still in the exact same spot, in the exact same \"cloud shape\", oddly enough a few hrs had passed, and this \"cloud was still in it's exact position just west of the sun. By this time, it was about 6p.m. This is where we were absolutely astonished by what we were witnessing. At first, my thought was... OMG is this comet ison? What the hell is that?! As we watched this a little more closely, we observed it suddenly brighten like a star, and the trail that looked like a contrail began to fade simultaniously as the light faded with it. It became completely invisible for a few seconds when a faint light could be seen. Then it became bright again, along with the trail still in the same shape that it was before. Again, it brightened, the trail visible, then faded out. Then we noticed from the south a plane became visible in our view. It was on a direct path towards this object. As the plane got closer to the object it very smoothly and rapidly headed on a southwest direction. Again fading as it went cruising off until it disappeared completely. I have seen a couple of sighting before, but at night. This was my first day time sighting, and the most undoubtedly, unquestionable sighting yet. I have no doubt that what we witnessed was def not of this Earth. I thought it was exciting, and amazing. Truly a rare treat!"],"Log Number":"US-10142013-0001","Region":"Wisconsin","trends":["There have been 4 other sightings in Hartland","There were no other sightings in Hartland on or around October 13th 2013"],"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/51529.html.txt","/var/www/straped/mufon/org/51529.html"]}