{"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","trends":["There have been 404 other sightings in Los Angeles","There were 2 other sightings in Los Angeles on or around October 6th 2013","This sighting has been favorited 1 time.",""],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/51534.html.txt","/var/www/straped/mufon/org/51534.html"],"Longitude":"-118.447014","Date of the Event":"10/06/2013 05:30 UTC","Latitude":"34.151588","divs":["sighting detailsfrom balboa park in van nuys, ca. i watched a white orb fly over sparse clouds at a steady speed from north to south. i was laying on my back on the grass in the park. soon thereafter, a larger and brighter orb appeared, flew in an irregular path, would hover and change direction. i observed this object approach from an easterly direction move almost overhead and shift and stall in a zig zag fashion south\\ southwesterly direction until it faded from view. as i was leaving the park i noticed a peculiar phenomena: as the sun was setting behind me in the west, i noticed what looked like a \"false\" sunrise happening in the east. what appeared as rays of light and shadow extending upwards from in front of the san gabriel mountain range. from on top of a hill i took a short video of the phenomen with my camera on my phone. after reviewing the video, i caught something at 9seconds into the video flying from mid left ascending at high velocity. this object appears dark and is moving too fast to be conventional aircraft."],"Sighting Duration":"00:25:00","Region":"California","Object Shape":"Bullet, Missile, Sphere, Star-like","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Country":"United States","Log Number":"US-10142013-0005","Summary":"From the park I spotted a small orb fly over the clouds, soon followed by a larger, brighter, orb that moved irregular and would appear to hold stationery.","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.151588,+-118.447014(51534)&iwloc=A&hl=en\"> mufon case (51534) map </A>","Object Features":"Unknown","City":"Los Angeles","Date Submitted":"10/14/2013 03:58 UTC","Disposition":"Unresolved","Case Number":"51534"}