{"files":["/var/www/straped/mufon/html2text/51536.html.txt","/var/www/straped/mufon/org/51536.html"],"Source":"MUFON","City":"Highland","Viewing Distance":"Over 1 Mile, Unknown","Country":"United States","Tags":"City","Log Number":"US-10142013-0008","Sighting Duration":"Undisclosed","Summary":"Very Fast Moving Light","Weather Factors":"Unknown","Object Shape":"Star-like","Disposition":"Unresolved","Latitude":"34.12462","Region":"California","Date of the Event":"10/14/2013 05:15 UTC","Object Features":"Unknown","Object Flight Path":"Straight-line path,Path with directional change","trends":["There have been 15 other sightings in Highland","There were no other sightings in Highland on or around October 14th 2013"],"Case Number":"51536","divs":["sighting detailsbeen having trouble sleeping. decided to go outside. while standig looking at the stars in front of me (to the east) something drew my attention out of the corner of my eye. i turned to see a very fast bright white object flying nearly directly above me. this thing was fast. it appeared as bright as the brightest star in the sky, larger than the 'visible' stars but not twinkling. it did wink out once or twice as it flew overhead. i was watching it as it soared across the sky and it ever so slightly began turning in an arc. then it suddenly went back to the original path it was on. i've seen planes and various objects in the sky before but i've never seen anything flying this fast. it covered the visible area in the sky in about one minute (max) before it was out of sight. then shortly after that one, i'd say about 5 minutes later, i saw another object (star-like but un blinking) moving through the sky as well. considerably slower than the first one. this one was not bright white, but had a tinge of yellow\\orange to it. this one passed basically in the same area of the sky (above me) but then seemed to wink out."],"Longitude":"-117.224955","map":"<A HREF = \"http://maps.google.com/maps?q=34.12462,+-117.224955(51536)&iwloc=A&hl=en\"> mufon case (51536) map </A>","Date Submitted":"10/14/2013 09:06 UTC"}