{"files":["/var/www/straped/mufon/html2text/51532.html.txt","/var/www/straped/mufon/org/51532.html"],"Case Number":"51532","Object Flight Path":"Path then hovering","Date of the Event":"04/30/1970 12:00 UTC","Country":"United States","divs":["Sighting Details One night in 1970, more than 40 years ago while I attended the now closed Nathaniel Hawthorne College, in Antrim NH; I was returning from a drive into town with some dorm mates after a party. We arrived in 2 cars and parked in our small parking lot that we shared with the dorm next door.I lived in the C.A.P. dorm . Our campus was 900 isolated acres on top of a mountain with only a few developed acres for buildings. My Dorm was on the edge of a large forest,very isolated with 100's of acres of undeveloped forest behind us. We always would look up at the spectacular night sky to see the constellations and the Milky Way. Very clear visuals ,no pollution or street lights.No Clouds. That night at the party, we had been discussing a sighting several nights earlier by the Girl's Dorm. The whole school was aware that they claimed that a UFO had landed on the Great Lawn in front of their new dorm. Nobody believed them. We did not have a description of that UFO, but the police had been called to investigate. I was kidding around with my friends about the incident, there were about 10 of us in the parking lot, and as I said \"Goodnight, we haven't seen anything unusual.\" At that instant. We looked up at the tree line separating the lot from the woods and we immediately saw that the Stars were missing in an enormous Black Void in the shape of a triangle rising up in the near distance, at that moment when I said \"look!\", we simultaneously saw these orange, small circular lights on the perimeter of the Triangle and it started to descend above us and get larger. I could not distinguish any surface reflections, just the lights separated it from the blackness. Basically it was a triangle of yellow-orange lights spaced apart. It remained stationary for awhile, as if it was observing us. It was hard to tell the size, it seemed to be smaller at first, it eventually took up my entire field of vision. No Sounds except us yelling at each other to confirm what we were seeing. I did not feel frightened, more shocked at the coincidence that we had just mentioned the previous incident and here was this strange giant object over our heads near the woods. I felt at the time as if we had summoned it. None of us had ever seen anything like it. Most UFO descriptions of the time were always these flying discs, like Frisbees. This was not like anything I imagined at the time a UFO would look like. After a few minutes the lights got smaller as it seemed that the black triangle was moving away on an angle. We split into 2 groups; my dorm and the other dorm said goodnight to each other and never reported the incident, because we saw how the Girls were ridiculed for their earlier sighting. I have told friends and family of this incident, but I never reported it. I've always been convinced that since the government did not have stealth technology in 1970, and there was no sound , plus the fact that we felt it appeared to be observing us and hovering, that it was a UFO."],"map":"<A HREF = \"http://maps.google.com/maps?q=43.034996,+-71.930549(51532)&iwloc=A&hl=en\"> mufon case (51532) map </A>","Tags":"City","Object Shape":"Triangle","trends":["There have been 2 other sightings in Antrim","There were no other sightings in Antrim on or around April 30th 1970"],"Viewing Distance":"20 Feet or Less, 21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile","Latitude":"43.034996","Weather Factors":"Unknown","Log Number":"US-10142013-0003","City":"Antrim","Source":"MUFON","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Date Submitted":"10/14/2013 02:38 UTC","Object Features":"None","Summary":"We were returning to our 2 dorms that shared a parking lot that bordered on the woods. I looked up at the night sky and saw that most the stars were blocked by a large black shape that had orange lights forming a triangle. Totally silent.","Region":"New Hampshire","Longitude":"-71.930549"}