{"Disposition":"Unresolved","divs":["Sighting DetailsMy daughter was sky watching from our yard on Mount Desert Island in Maine when she came and got me around 7pm, to come look at something she could not identify. I came outside to look. It was a ball of pulsating light Northwest from my position on the island would put the object somewhere north of Bangor Maine or possible Washington County, maybe Cherryfield. It was at least 20 miles away. It was about the size of a large pea from our perspective. It was very high above the tree line to where it could have been a plane or even a helicopter. However, it stayed in the exact same place, not getting farther away or closer, for over an hour at least. It hovered and pulsated three distinct colors in order, green, red, \"white\". The entire object. It moved slightly up and down, left to right and diagonally. Then would return to it's hovering spot. It's movements were not like any helicopter I have seen. No plane hovers and moves like that. That I know of. I could not explain it. I watched it with my daughter for about an hour and she remained watching for another hour or so. It was still there at 9pm October 13, 2013. I did note this morning when I checked there was a similar sighting south of us over Biddeford at 3am the morning of Oct 13. Sounds like they saw the same thing we saw. We did not witness a beam of light though. My husband saw it as well, he is a Marine with flight experience and he could not identify it either."],"map":"<A HREF = \"http://maps.google.com/maps?q=44.607299,+-67.925837(51537)&iwloc=A&hl=en\"> mufon case (51537) map </A>","Log Number":"US-10142013-0009","Viewing Distance":"Over One Mile","trends":["There has been one other sighting in Cherryfield","There were no other sightings in Cherryfield on or around October 13th 2013"],"Region":"Maine","Object Features":"Unknown","Country":"United States","Case Number":"51537","City":"Cherryfield","Date of the Event":"10/13/2013 12:00 UTC","Object Shape":"Circle, Star-like","Summary":"UFO orb of light over Downeast Maine","Latitude":"44.607299","Date Submitted":"10/14/2013 10:27 UTC","Sighting Duration":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/51537.html.txt","/var/www/straped/mufon/org/51537.html"],"Longitude":"-67.925837","Object Flight Path":"Stationary,Other","Tags":"City"}