{"Object Flight Path":"Straight-line path,Path then hovering,Other","Latitude":"41.294134","Longitude":"-73.912736","divs":["sighting detailsi was in my backyard loosely scanning the sky when i saw the object. i noticed the object because there were not many clouds in the sky, only trails left behind from other air traffic. i noticed the object because it was more oval shape, almost mix of an egg or circular in nature. there was no trail being left behind from this object like every other plane in the sky. i first thought the object in question might have been a balloon, but the elevation of the object was around the same or higher than air traffic. the object was going along more or less a particular path, no sudden movements, no sudden change in the opposite or different direction. there was a sort of reflection off the object from the sun, colors were white\\silver\\grey. was very hard to make out a true shape of the object as it almost seemed to morph in nature, hence the balloon theory. i was extremely confused, felt indifferent, knew this was an unknown object as i was observing it. the event lasted for about 8-10 minutes as it was in the sky, it headed toward some clouds or emissions left from other planes. i went to the front of my house to see if i could get a better look, by this time from my backyard which was about 10 seconds in between both points, i had lost sight of the object, went to my backyard again. no object in sight at this point, scanned the clouds, nothing to be seen. the last moment i saw the object it was entering the left over trails\\stretched clouds - moving at a very slow rate and then vanished."],"Date of the Event":"10/14/2013 02:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.294134,+-73.912736(51546)&iwloc=A&hl=en\"> mufon case (51546) map </A>","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Source":"MUFON","City":"Peekskill","Log Number":"US-10142013-0018","files":["/var/www/straped/mufon/html2text/51546.html.txt","/var/www/straped/mufon/org/51546.html"],"Tags":"City","Region":"New York","Object Shape":"Circle, Cylinder, Egg, Oval, Sphere, Teardrop, Other, Unknown","Date Submitted":"10/14/2013 02:57 UTC","Object Features":"Unknown","Case Number":"51546","Disposition":"Unresolved","trends":["There have been 5 other sightings in Peekskill","There were no other sightings in Peekskill on or around October 14th 2013"],"Viewing Distance":"Over One Mile","Summary":"Saw object traveling across the sky, then disappeared.","Country":"United States"}