{"map":"<A HREF = \"http://maps.google.com/maps?q=36.078846,+-83.88209(51547)&iwloc=A&hl=en\"> mufon case (51547) map </A>","Latitude":"36.078846","Log Number":"US-10142013-0019","Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","Tags":"City","Object Shape":"Circle, Fireball","Summary":"Saw 20-30 bright orange, circular shaped objects in the sky in sets of groups in different formations,.","City":"Knoxville","Case Number":"51547","Date Submitted":"10/14/2013 02:58 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/51547.html.txt","/var/www/straped/mufon/org/51547.html"],"trends":["There have been 50 other sightings in Knoxville","There were no other sightings in Knoxville on or around October 12th 2013"],"Region":"Tennessee","Weather Factors":"Unknown","Source":"MUFON","Longitude":"-83.88209","divs":["Sighting DetailsIt was Saturday night, Oct 12, 2013 around 8:45 pm. My next door neighbor called me scared to death, screaming saying,\" Go outside now and look in the sky. NOW!\". With her still on the phone I ran out my front door and into my front yard and looked up in the sky to see bright orange, round lights in multitudes in the sky. There was one set of 4 in a diamond shape, then a set of 3 in the shape of a triangle right behind, then a set of 2 side by side each other behind the triangle one. Then in the distance ( I was looking towards the north sky, they were moving north to south) there was another cluster of about 6 to 7 more coming. I screamed for my husband to come outside. He and my two daughters saw them, along with 3 of my neighbors. The whole experience lasted around maybe 7-8 minutes. Then as they approached this big ridge, which is about 25ft from my back porch, they disappeared. I came inside with my neighbor still on the phone with me and called our local law enforcement on my cell phone. There was nothing going on in the area to account for what we all had witnessed. I was scared to death. My one daughter started crying, while my other daughter was silent but shaking. It looked like something straight out of a movie. I really thought this was it , and we were being invaded. Neither my husband nor I have been able to sleep since it happened. Both my daughters are scared to leave our house now and have trouble sleeping. I tried to catch it on video on my phone but it happened so fast that I couldn't."],"Disposition":"Unresolved","Object Features":"Unknown","Date of the Event":"10/12/2013 08:45 UTC","Object Flight Path":"Path with directional change"}