{"Country":"United States","Viewing Distance":"Over One Mile","Object Flight Path":"Other","Object Shape":"Star-like","Longitude":"-104.983263","Log Number":"US-07282006-0001","Source":"MUFON","Tags":"City","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around July 27th 2006"],"Object Features":"Unknown","City":"Denver","Case Number":"5154","Date of the Event":"07/27/2006 11:35 UTC","Summary":"Neighbours witnessed 3 star like things bobbing on the horizon, 2 dissapeared the third seemed to go down behind the mountain as a silent aircraft flew overhead towards the area of the sightings","divs":["Sighting DetailsThe neighbours called us over to see the 'ufo's' they'd been watching at approx 23.30 my house mates and i arrived there at 00.10 after our movie finished and we saw a single light in the distance bobbing up and down on the horizon. we watched it for maybe a minute before it bobbed below the horizon and did not re-appear. just before it dropped out of sight a low flying aircraft flew over head but it was weird because it made no sound. It headed straight towards the area we had just been watching, flying out of sigght as it flew behind the mountain in the distance. We thought maybe it was a government aircraft dispatched from Norad to the north of us ??? but this is purely speculation. i cant explain what i saw, it was definately not a plane or helicopter as it was moving like a yo yo up and down up and down, until it finally went down and did not come back up. we all wished we'd gone over to take a look when the neigbours first called out to us as we only saw it for a minute or so, they watched 3 of them for about 45 mins !!"],"Weather Factors":"Does Not Apply","Disposition":"Unknown","Date Submitted":"07/27/2006 11:35 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.747254,+-104.983263(5154)&iwloc=A&hl=en\"> mufon case (5154) map </A>","Region":"Colorado","Sighting Duration":"00:40:00","files":["/var/www/straped/mufon/html2text/5154.html.txt","/var/www/straped/mufon/org/5154.html"],"Latitude":"39.747254"}