{"Weather Factors":"Unknown","Latitude":"39.741438","Object Features":"Unknown","Log Number":"US-10142013-0022","divs":["Sighting DetailsI was sitting in my backyard talking to my wife. I leaned back and happened to noticed 7 lights in the sky that appeared to me to be the constellation \"Orion\". I immediately knew something was wrong. Orion should not be visible on a clear blue day and not in that location as I see it in the South early in the morning when I leave for work. Also in that same instant, I noticed they were moving south. I then sprang from my chair to run in to the house an yell at my other family members to come and see the \"ufos\" I was witnessing. They all ran outside and also witnessed the lights and we could now only see 4 and they had changed formation similar to half of an octagon. Then 3 lights hovered in one spot while the fourth made a turn toward the west. It then turned back toward us and then suddenly an additional light came streaking across the sky and disappeared out of sight below the tree tops. The speed made me think of a bullet.I then noticed that all but one of the lights were gone. It appeared to slowly get smaller as if it were going away from me and became impossible to see. One family member phoned a friend and told tell her to come out and see if she could see anything. While on the phone we began to observe more lights coming out of the North. Shortly there after my son and I witnessed another light streaking across the sky. I was extremely happy to have another person witness what I had seen earlier. We were then informed by the person we had called, that they had just witnessed a streaking light across the sky. Several family members along with myself witnessed many lights with time elapsing in between sightings over a period of approximately an hour an forty five minutes. We were finally able to photograph three of the objects. You will have to magnify the image to see them. It simply doesn't show any detail. It is as we saw them \"white lights\" in the sky. Through binoculars it somewhat appeared as if there was a dark ring around the object.It was somewhat blurred. The objects for the most part moved slower than airplane speed which could be observed at the same time. They all eventually left our area to every direction except North. I know this sounds crazy but, we can not explain what we saw."],"Sighting Duration":"Undisclosed","Longitude":"-86.140522","Date Submitted":"10/14/2013 04:13 UTC","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/51550.html.txt","/var/www/straped/mufon/org/51550.html"],"Source":"MUFON","Case Number":"51550","Disposition":"Unresolved","Tags":"City","Date of the Event":"10/13/2013 02:40 UTC","Summary":"Multiple lights in the sky that changed direction and displayed speed like never witnessed before","trends":["There have been 126 other sightings in Indianapolis","There was one other sighting in Indianapolis on or around October 13th 2013"],"Object Shape":"Disc, Oval, Saturn-like","Region":"Indiana","Country":"United States","City":"Indianapolis","map":"<A HREF = \"http://maps.google.com/maps?q=39.741438,+-86.140522(51550)&iwloc=A&hl=en\"> mufon case (51550) map </A>"}