{"City":"Houston","Viewing Distance":"Unknown","Country":"United States","Date Submitted":"10/14/2013 04:55 UTC","Weather Factors":"Unknown","Date of the Event":"10/11/2013 08:00 UTC","Tags":"City","Object Shape":"Star-like","trends":["There have been 173 other sightings in Houston","There was one other sighting in Houston on or around October 11th 2013"],"Region":"Texas","files":["/var/www/straped/mufon/html2text/51551.html.txt","/var/www/straped/mufon/org/51551.html"],"Latitude":"29.963769","Summary":"Star like bright object hovering then moved directions","Source":"MUFON","Case Number":"51551","Object Features":"Unknown","Object Flight Path":"Stationary","Longitude":"-95.554121","Disposition":"Unresolved","Sighting Duration":"01:00:00","map":"<A HREF = \"http://maps.google.com/maps?q=29.963769,+-95.554121(51551)&iwloc=A&hl=en\"> mufon case (51551) map </A>","Log Number":"US-10142013-0023","divs":["Sighting DetailsI was in my parked car with my boyfriend, talking. We were outside of my brothers house waiting for him to come home. While I was talking I noticed what I thought was a larger and brighter than usual \"star\". I even stopped and mentioned it to my boyfriend but he didn't think much of it. I couldn't stay focused in our conversation because I kept looking back at the bright star. I knew it wasn't an airplane because it was not moving it was just there but it was so bright and larger than a regular star. My boyfriend and I continued talking and maybe like 20 minutes passed when I looked back up and noticed the star had moved. It was lower than when I first saw it and it wasn't like a little lower it had moved enough for me to notice it right away. I pointed that out to my boyfriend but he really didn't think much of it and I don't think he had really looked at it anyway. I didn't actually see it move because I took my eyes off of it for a little bit. It was stationary or hovered in place. I ended up getting out of the car and going inside the house because my brother got home. I don't know what happened to it and I didn't go back to check on it, though I kept thinking about it and now wish I would've grabbed some benaculurs. I looked up sightings in my area and found a few stories of people reporting seeing the same thing these past few months."]}