{"Weather Factors":"Unknown","Latitude":"41.37033","Country":"United States","Tags":"City","trends":["There have been 3 other sightings in Elyria","There were no other sightings in Elyria on or around October 14th 2013"],"divs":["sighting detailsbright light in the sky. we see many of them around here on occasion. my aunt louise was getting ready for bed around 2:00 am (early in the morning of 10\\14) and she noticed a bright light out of the window. she didn't think anything of it, when in her room changed, and the light was still outside of the window. by this time she had looked through the window two times, but it never left or moved from the original position. she opened the full view door and noticed it just sat there very bright but would expand a bright light and then retract to almost nothing. at one point it would turn orange and then back to bright white, and then it would grow very large, then retract back to nothing this happened several times before she went into her sister's room, woke her up to come and look at it. they grabbed the binoculars to see if they could a better look. after looking through the binoculars they noticed that the object also had little orange dot lights all the way around it, and still it had not moved. then the orange lights would go away, and the white light would retract to the point of not being able to see, and it would come back again with the same orange lights wrapped around it and then it totally disappeared. it was no longer seen after that."],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=41.37033,+-82.104879(51559)&iwloc=A&hl=en\"> mufon case (51559) map </A>","Summary":"Bright light in the sky not moving, but would disappear and come back.","files":["/var/www/straped/mufon/html2text/51559.html.txt","/var/www/straped/mufon/org/51559.html"],"Object Flight Path":"Other","Sighting Duration":"Undisclosed","City":"Elyria","Log Number":"US-10142013-0031","Object Features":"Unknown","Object Shape":"Oval","Case Number":"51559","Date Submitted":"10/14/2013 08:56 UTC","Source":"MUFON","Date of the Event":"10/14/2013 02:00 UTC","Region":"Ohio","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-82.104879"}