{"Case Number":"51566","Source":"MUFON","Viewing Distance":"Unknown","Country":"United States","Latitude":"31.977549","files":["/var/www/straped/mufon/html2text/51566.html.txt","/var/www/straped/mufon/org/51566.html"],"City":"Undisclosed","Date Submitted":"10/15/2013 03:04 UTC","divs":["Sighting DetailsI took our dog out before bed time at around 1:20 a.m. on October 14, 2013. I observed a red, white, and green brightly lit object in the western sky moving from north to south then back again. It appeared to be going in a circular pattern. In recent months, I have seen a bluish green shooting star and also what I believe is a satellite in the sky west of our home. My eyes now automatically scan the skies in that direction. However, on the morning of October 14, 2013 I saw something unlike anything I had seen before. I ran back in to grab my video camera and yelled for my wife, who came outside immediately. Our next door neighbor was on her front porch smoking a cigarette. The three of us watched the object moving and hovering. We surmised that it was nothing more than a Remote Controlled aircraft. Then, just for our own peace of mind, got into our car and went searching for anyone outside who might be flying such a craft. In the meantime, the object had disappeared from sight. We drove around the neighborhood and around the area but found no one outside or any evidence of any activity. This is when everything started to point to something besides our initial assumptions. The most unsettling thing about the experience is not knowing or having the answers. We have video footage, such as it is, and will gladly share it with you for the sake of research."],"Object Shape":"Circle, Other, Unknown","Disposition":"Unresolved","Object Features":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=31.977549,+-99.893883(51566)&iwloc=A&hl=en\"> mufon case (51566) map </A>","Sighting Duration":"Undisclosed","Region":"Texas","Longitude":"-99.893883","Log Number":"US-10152013-0004","Object Flight Path":"Path then hovering","Weather Factors":"Unknown","trends":[],"Summary":"Object appeared due west of our home as red, white, and green lights. Shape appeared to be circular mostly.","Date of the Event":"10/14/2013 01:20 UTC"}