{"Date of the Event":"07/26/2006 06:30 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.969123,+-94.609301(5156)&iwloc=A&hl=en\"> mufon case (5156) map </A>","Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-07292006-0001","divs":["Sighting DetailsThe subject was a dark gray craft, square in my estimation (slightly rectangular in my wife's) moving southeast from Johnson County, Kansas into Jackson County, Missouri. I was driving east on 83rd street a few blocks east of Mission Road. Our view was intermittent because of trees along 83rd street. The craft moved across 83rd street then out of sight before we reached High Drive where we turned north. It moved at a moderate rate of speed for an aircraft,seeming to \"float along.\" I heard no sound, but the car windows were closed and the air conditioner blower was on high. With such a brief observation it is difficult to estimate size, altitude and speed, but I would guess 50-100 feet square, under 1000 feet and 75 miles an hour The craft attracted my attention because of its shape. I am a retired naval reserve air intelligence officer and familiar with most things that fly. I never saw anything in the air before that looked like this. My first thought was that it was possibly a UFO. I did not have a camera with me. I have long been convinced of the probability that UFOs are real but never expected to see one. I took it rather matter-of-factly that I might now have seen one and didn't consider it to be a particularly singular event. My family convinced me it should be reported, even though I have few details to offer. Perhaps it will corroborate another sighting."],"Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/5156.html.txt","/var/www/straped/mufon/org/5156.html"],"Date Submitted":"07/26/2006 06:30 UTC","Sighting Duration":"00:00:35","Region":"Kansas","Object Shape":"Square, Rectagular","Summary":"Driving E. on 83rd St E of Mission Rd. saw gray,square craft moving SE,","Country":"United States","Weather Factors":"None","Tags":"City","Object Features":"None","Case Number":"5156","trends":["There have been 8 other sightings in Leawood","There were no other sightings in Leawood on or around July 26th 2006"],"City":"Leawood","Latitude":"38.969123","Longitude":"-94.609301"}