{"Disposition":"Unresolved","divs":["Sighting DetailsAt 1:30 am I was heading onto the freeway and I noticed something bright to my left and looked. At first I thought it was a huge star or some type of military base object. All of a sudden it shot up like a shooting star but then shot down and back to where it was. It was a second ordeal. Thats when my heart stopped. Im going 60 on the freeway and some type of energy made me keep looking at it not letting me pay attention to the roadI knew at this moment this wasnt something normal.I thought I was going crazy. I had to keep rubbing my eyes thinking maybe I was just making this up. Then it started following me! I called my friend immediately. I told them what was happening they told me to stay on the phone that maybe they where using my radioactive waves. My phone kept dropping calls. On top of that at one point my phone turned off and I turned it back on and a thing on my phone popped up asking me if Id like to turn on my cellular connection. Well duh its a cellphone why would a message pop up like that? I knew it was following me because I lived 40 minutes away and it followed me for that long. Every exit I got off of. You know how when your driving at night and you see the north star or the moon? Well you take different exits and roads and the side that moon is on changes side from side from the direction your going. Well this object stayed on my passenger side. When I stopped it stopped. I got out of my car and stopped at a gas station asked a random lady look am i crazy is this object moving? At first she said no and looked down and i said please mam please look again and she did and she said holy s**t its coming in our direction. I told the woman what was happening and she said leave it alone stop watching as long as it wasn't hurting us. But I couldn't let go. It sounds super crazy and I still feel crazy but it was like something was watching me and it was listening to me. No happy feeling. I felt danger. Oh I forgot to tell you This all started over Lake Erie. WATER. I felt like it was tapping into my phone call i felt a strike of energy through out my body. Like it knew i was intrigued so they took advantage of me watching. I lost contact don't ask me how its like i cant remember. I woke up not remembering. I didn't tell you the weirdest part. You know how I told you about my cell phone going crazy well when I went into my house I went to turn on my mudroom light and it didn't work. I thought my mom was playing a joke on me making fun of me. I kept trying to flick the switch a hundred times. So I went upstairs in the dark and flicked the switch that works as well for the same room and it worked. So i was like what So I went back and tried the other switch that wasn't working and it turned on. Like some energy through my fingertips. I also wanted to mention another reason I knew it was no airplane helicopter radar thing or military thing was because while I was on the free way it had 3 random bolts of lighting come from the top very quickly. Like some type of radiation thing. I felt like I saw one streak of lighting bolt underneath as well very light. I never felt like this before. I don't connect people for such things. But with this I felt like I needed to talk to someone about it. Someone who understands and doesn't think I'm crazy."],"Date of the Event":"10/15/2013 01:30 UTC","Region":"Ohio","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Date Submitted":"10/15/2013 04:33 UTC","Case Number":"51572","Source":"MUFON","Object Flight Path":"Other","City":"Undisclosed","Log Number":"US-10152013-0009","Viewing Distance":"Unknown","Object Features":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/51572.html.txt","/var/www/straped/mufon/org/51572.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.418797,+-82.898923(51572)&iwloc=A&hl=en\"> mufon case (51572) map </A>","trends":[],"Longitude":"-82.898923","Tags":"City","Object Shape":"Circle, Oval, Triangle","Latitude":"40.418797","Summary":"needs to be talked about. uncomfortable."}