{"Weather Factors":"Unknown","Country":"United States","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around October 15th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.880344,+-87.622448(51574)&iwloc=A&hl=en\"> mufon case (51574) map </A>","Tags":"City","Region":"Illinois","Viewing Distance":"Unknown","Object Shape":"Oval, Sphere","Sighting Duration":"Undisclosed","Latitude":"41.880344","files":["/var/www/straped/mufon/html2text/51574.html.txt","/var/www/straped/mufon/org/51574.html"],"Date Submitted":"10/15/2013 09:06 UTC","Case Number":"51574","Object Features":"None","Object Flight Path":"Straight-line path","Date of the Event":"10/15/2013 12:02 UTC","divs":["Sighting Detailsme and my mom were driving away from chicago and were near Midway airport. ever since my first few ufo sightings i now am constantly scanning the sky and observing planes closely, i saw a plane off in the distance that looked like it was very high but still acending, i got my binoculars to examine it closer and i noticed a white object with some gray on its underside following with the plane as it gained altitude. it was going at exactly the same speed as the plane and was following by its left wing (my right) maybe a bit behind. however we started to go past some trees and i lost sight of the object, however in the time the plane should have come past the trees i noticed it wasnt there. even when the trees cleared i couldn't find it. it had been coming in my direction and should have still been in my view a little farther in the sky by this time but it was no where to be found. is there a lot of ufo activity in this area? this is the second time i noticed a ufo in the area near Midway Airport and near Chicago. let me know what you think. this is the very first ufo sighting i have personally had that involved something moving and not only that but a plane disappearing as well, definitely something strange going on. also even though my mom was with me at the time she didn't see it since it all happened quite quickly. also this happened in the afternoon"],"Source":"MUFON","City":"Chicago","Log Number":"US-10152013-0011","Summary":"white round ufo following plane","Longitude":"-87.622448","Disposition":"Unresolved"}