{"Date Submitted":"10/15/2013 12:23 UTC","Sighting Duration":"Undisclosed","Object Shape":"Boomerang","City":"Denver","Region":"Colorado","Log Number":"US-10152013-0008","Object Flight Path":"Straight-line path","Case Number":"51570","files":["/var/www/straped/mufon/html2text/51570.html.txt","/var/www/straped/mufon/org/51570.html"],"divs":["sighting detailsmy wife and i were on our 800 square foot terrace downtown denver around 845pm when i noticed a v shaped ufo, dark in color, with 5 distinct blu-ish\\white-ish round energy lights glowing below the craft. there was no sound and the ufo was approximately a mile wide. it came from the north heading south. i am an avid cell phone picture taker, but couldnt turn around to grab either my cell or my wifes cell sitting 2 feet from me. i felt like something was preventing me from grabbing my cell(just a feeling). i watched the ufo fly away as though i had seen the craft before. as it flew away, i noticed the back left tail light vere away from the craft and headed into the center of the ufo then back out to its original position. when the event was over apprx 20 seconds into it, i googled v shaped ufo and noticed the craft instantly. this was an event that will be embedded in my soul for ever. we need answers people. we are in the dark about everything. it is our right to know what is going on. besides, we pay the people hidding the information from us. i understand that the government has its duty to protect us, but from what? let's stand united in our search. we the people will prevail."],"Object Features":"Other","Longitude":"-105.012749","Country":"United States","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","Tags":"City","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around October 6th 2013"],"Date of the Event":"10/06/2013 08:45 UTC","Disposition":"Unresolved","Latitude":"39.771953","Summary":"V Shaped UFO","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.771953,+-105.012749(51570)&iwloc=A&hl=en\"> mufon case (51570) map </A>"}