{"Sighting Duration":"Undisclosed","Summary":"Saw 5 orange- red round lights flying from ne to sw then lost them in the clouds.","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.580382,+-74.285147(51581)&iwloc=A&hl=en\"> mufon case (51581) map </A>","Date of the Event":"10/12/2013 07:46 UTC","Region":"New Jersey","Object Flight Path":"Straight-line path","Longitude":"-74.285147","Latitude":"40.580382","divs":["Sighting DetailsWhile driving in a road behind route 1&9 I saw in a distance what I thought was 2 helicopters or small planes coming in my direction.I looked around and saw the airplanes in there normal route.Where I live you could see the planes that are going to Newark airport.When I looked back to the red-orange lights I figured I had never seeing any craft with that type of light.As they where getting closer I stop my car and put down my window to hear any noise. To my surprise there was nothing.I stood there looking to see if they where lanterns but I was very windy and they did not shake or changed there course.They were flying in the same direction, at the same speed and same altitud side by side.After I saw them 2 getting lost behind the clouds I looked and there was 3 more coming they looked so big and I new then It was something weird.The 3 where flying in a triangle formation.I was thinking the airplanes passing in the opposite direction must have seeing them too.Now I know there is something or some one else out there.I have try to search the internet to see if some one else saw them too.I mean there's alot of cars passing by and there is couple traffic lights in that area.I love watching the sky day or night and now I have one more reason to keep looking up any opportunity I have."],"Weather Factors":"Unknown","Object Shape":"Fireball","Object Features":"None","Case Number":"51581","Disposition":"Unresolved","City":"Woodbridge Township","trends":["There have been 7 other sightings in Woodbridge Township","There were no other sightings in Woodbridge Township on or around October 12th 2013"],"Log Number":"US-10162013-0002","Date Submitted":"10/16/2013 01:03 UTC","Tags":"City","Country":"United States","files":["/var/www/straped/mufon/html2text/51581.html.txt","/var/www/straped/mufon/org/51581.html"],"Viewing Distance":"Unknown"}