{"Object Shape":"Unknown","Weather Factors":"Unknown","Region":"New Jersey","Date of the Event":"10/15/2013 08:15 UTC","Case Number":"51580","Country":"United States","Object Features":"Unknown","Longitude":"-74.417682","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was at work and happened to be outside durning my break.I just happened to look up at the night sky looking at the stars. When something caught my eye. I wasnt sure what I saw in the sky. I thuoght it was an airplane at first.The object in question was flying from left to right. I thought it was a plane. Then Inoticed it didnt have a flashing light like a plane would have. I watched it go across the the sky, all of a sudden it stopped in mid flight. It hovered for about a minute or two. Then the object it flew towards my direction, stopped then flew right to left. I didnt know what to think. I was not sure what I had just seen.I was pretty sure that it wasnt a plane. I lost sight of it because it was flying behind trees. Also I was limited to one area .I could only go so far. I am pretty sure it wasnt a plane,because when the object was going in the other direction a plane happened to be flying in the oppisite direction of the object in question."],"Disposition":"Unresolved","Log Number":"US-10162013-0001","Latitude":"40.865377","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.865377,+-74.417682(51580)&iwloc=A&hl=en\"> mufon case (51580) map </A>","Date Submitted":"10/16/2013 12:25 UTC","City":"Parsippany-Troy Hills","Object Flight Path":"Path with directional change,Path then hovering","Summary":"I saw something in the sky. They way it was flying it didnt seem to be a plane.","Source":"MUFON","trends":["There have been 2 other sightings in Parsippany-Troy Hills","There were no other sightings in Parsippany-Troy Hills on or around October 15th 2013"],"Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/51580.html.txt","/var/www/straped/mufon/org/51580.html"]}