{"Region":"Arizona","files":["/var/www/straped/mufon/html2text/51599.html.txt","/var/www/straped/mufon/org/51599.html"],"Log Number":"US-10172013-0003","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.393074,+-110.777452(51599)&iwloc=A&hl=en\"> mufon case (51599) map </A>","Disposition":"Unresolved","Date Submitted":"10/17/2013 01:42 UTC","Object Shape":"Circle","Latitude":"33.393074","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"10/16/2013 07:25 UTC","Object Flight Path":"Straight-line path","Case Number":"51599","Object Features":"Unknown","Country":"United States","trends":["There have been 6 other sightings in Globe","There were no other sightings in Globe on or around October 16th 2013"],"divs":["Sighting Detailsglobe, az near highway 60 and 3rd street. first time i saw the bright orange lights it was at about 6:50 pm looking west above pinal mountains . No clouds, moon was up. Three large round bright orange lights in a horizontal line flashed on for about 2 seconds then fizzled out. then 2 orange lights flashed on then off, then one light on then off. they were above the horizon about 45degrees moving together (like on the side of a blimp) slowly from left to right (south to north) also saw jets flying north and south around the lights. thought the lights came from the jets, but they were so much bigger than the white flashing lights from the jets so i thought it was a ufo! my niece came out and we walked to the circle K on Highway 60 and 7th street. On the way back at 7:25 we saw and heard jets flying around. looking west again saw the three bright orange lights appear then dissappear, then two then one. My niece only saw the last light. we both saw Four jets in the shape of a square flew north made 180 degree turn together then east overhead, then turned north and back past me to the west. saw 4 to 6 jets circling the area for about 20 minutes. we got home, went inside and told my husband. Felt curious and a little scared. he came outside and we watched the jets making huge circles around Globe. i got my phone to make a video. walked out into the middle of the street looking south east at about 7:50 i saw them again, same sequence but this time they seemed closer. the orange lights went out like fireworks fizzling out. this time they were moving together slowly from right to left (south to north) I strained to see if there was anything there after the lights were gone, saw only small white lights from jets. it happened too fast to get a video. my husband walked out and saw the last light (just one orange ball light up and disappear). we stood outside for about 15 minutes and saw jets flying back and forth (north and south, then overhead to the west then back to the east."],"Longitude":"-110.777452","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","City":"Globe","Summary":"three large orange lights in straight line lit up for a feww seconds then disappeared"}