{"Sighting Duration":"Undisclosed","Longitude":"-88.729305","Log Number":"US-10162013-0011","trends":["There have been 2 other sightings in Metropolis","There were no other sightings in Metropolis on or around October 13th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.16274,+-88.729305(51591)&iwloc=A&hl=en\"> mufon case (51591) map </A>","Date Submitted":"10/16/2013 12:57 UTC","Object Flight Path":"Straight-line path","Case Number":"51591","Country":"United States","Disposition":"Unresolved","Weather Factors":"Unknown","Tags":"City","Summary":"Moon could be used for a size reference. Orange oval object traveling in a straight line at a steady speed. No detectable sound or emissions. Orange colored light resembled a jellyfish glow.","Object Features":"None","divs":["Sighting DetailsMy wife and I were sitting outside enjoying the clear night and calm weather. I had just thought to myself \"it would be a good night to see a UFO\" it was so clear. Next and within about 30 seconds my wife noticed a orange light traveling toward us coming from the NE. I had not shared my earlier thought with her yet. We both stood up and I almost immediately started to use my video phone. The object glowed an orange color with light traces of red inside it. It traveled at a steady speed and appeared never to change direction or altitude. My first thoughts was a UFO or if not what is it? My wife says her first thought was a meteor or shooting star, now she is unsure and talks about it less than I do. She is not as open to sharing our story until I start to tell someone. It was no big deal to her. My odd thoughts on the whole experience is that I had just thought about seeing a UFO and during the experience I thought of jellyfish. I think the jellyfish thought came because the objects illumination was iridescent similar to the videos I have seen of jellyfish, not a light that looked like it was from a normal light source. The color spectrum of the light was different somehow? I also was amazed that I didn't want to stay up all night and stare at the night sky searching for more objects. I was tired and all but it was weird it didn't fire me up and have me laying flat on my back on a blanket or looking straight up into the vast unknown. I do remember thinking it may be a thousand years before another object passes over our yard. I stayed up about an hour then calmly went inside and went to sleep. P.S. Look for the red object (it was orange to us at the time) the large white object is the moon. I AM NOT A VIDEO EXPERT, this is obvious after you watch it. The video is pretty low quality and shaky but it is all I had on short notice. I hope someone with video experience can somehow salvage something useful from it. Please let me know if the video is determined to be an identified object or not? I used profanity in the video ...to those that may be offended; sorry ahead of time."],"Object Shape":"Circle, Oval","Latitude":"37.16274","Date of the Event":"10/13/2013 08:01 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/51591.html.txt","/var/www/straped/mufon/org/51591.html"],"Viewing Distance":"501 Feet - 1 Mile","Region":"Illinois","City":"Metropolis"}