{"Region":"California","Tags":"City","Sighting Duration":"00:00:20","Date of the Event":"10/17/2013 05:38 UTC","Longitude":"-117.17043","Log Number":"US-10172013-0012","Source":"MUFON","Object Flight Path":"Hovering then path","Country":"United States","Viewing Distance":"Unknown","Object Shape":"Sphere","Disposition":"Unresolved","Weather Factors":"Unknown","Case Number":"51608","divs":["Sighting DetailsJust a few hours ago at 5:37am on 17 October, 2013, I went out for a smoke. I immediately noticed a bright stationary light in the dark sky. This light was brighter and larger than any star in the sky and I knew it wasn't a star. For comparison, it was at least twice the size and brightness of any star. It was just hovering there for 5 to 10 seconds. Then it slowly winked-out or dimmed to almost nothing over a 2 second period of time. I could barely see the light after it dimmed so much; but, I could still make out a light. This dim light went from a stationary position to out of site in less than an additional 10 seconds. I looked around for a bit longer, but was getting cold. I went in the house and got a jacket and a quick bite to eat. As soon as I came back out, directly above me, were 2 fast moving lights. I only saw these last 2 lights for 5 seconds before they also winked-out or dimmed away to being not visible straight up overhead. I could not see anything after they dimmed; but the sun was coming up and it was not dark enough to see a dim light. These last 2 lights were at 6:14am. These lights were not planes or satellites. There was no sound for any of the lights."],"files":["/var/www/straped/mufon/html2text/51608.html.txt","/var/www/straped/mufon/org/51608.html"],"City":"San Diego","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.751606,+-117.17043(51608)&iwloc=A&hl=en\"> mufon case (51608) map </A>","Date Submitted":"10/17/2013 11:12 UTC","Summary":"Bright light, brighter and larger than any star, hovered then dimmed to almost nothing, then quickly flew north","Latitude":"32.751606","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around October 17th 2013"]}