{"Sighting Duration":"00:05:00","Log Number":"US-10172013-0011","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/51607.html.txt","/var/www/straped/mufon/org/51607.html"],"trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around October 17th 2013"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=29.885583,+-95.691639(51607)&iwloc=A&hl=en\"> mufon case (51607) map </A>","Region":"Texas","Summary":"White star like object well above commercial flight range changed to a solid Turquoise color and flew in a straight path.","Latitude":"29.885583","Tags":"City","divs":["Sighting DetailsI was walking home from my part-time job early this morning when it was still dark as night. As I came into the sidewalk at my subdivision a white light that looked like a star JUST APPEARED OUT OF NOTHING HIGH ABOVE in the Southwestern sky to my 11 o'clock. It was EXTREMELY too high to be a commercial airplane and it was definitely NOT a helicopter. This drew my attention immediately to keep my eyes on it as best I could. The star like object went from White to an all solid Turquoise and continued a straight flight path traveling West IN A VERY BRIEF HYPER SPEED then slowed down to a normal speed until it faded away in the distance. I am not aware of any U.S.fighter jets that uses a Turquoise color, I also did not make out any wings nor any lights at the end of wings. I heard no noise and did not see the colored light object blink as a normal craft's would. I stood there in complete shock the entire time, I immediately knew I was looking at something very, very different. So different that this is my first time feeling the need to report this to someone other then law enforcement. It was as if a star decided to come alive and start flying, that is exactly what it looked like. But this star went from white initially to the color I described. I did not make out a solid structure around the light. It was simply a flying spec of light. I've been around long enough to know what a plane, jet and helicopter looks like. I do not want any \"15 minutes of fame\" or whatever, I just want to do my part as a concerned citizen to tell my sighting. I am far from a UFO buff."],"Date Submitted":"10/17/2013 10:41 UTC","Object Features":"Unknown","Object Flight Path":"Straight-line path","Longitude":"-95.691639","City":"Houston","Case Number":"51607","Date of the Event":"10/17/2013 06:41 UTC","Country":"United States","Weather Factors":"Unknown","Object Shape":"Sphere","Viewing Distance":"Over One Mile"}