{"Sighting Duration":"Undisclosed","Date Submitted":"10/17/2013 11:37 UTC","Latitude":"36.067831","City":"Las Vegas","Region":"Nevada","Disposition":"Unresolved","Viewing Distance":"Unknown","Object Flight Path":"Stationary,Path with directional change","Tags":"City","Country":"United States","Source":"MUFON","divs":["sighting detailsthis is my third time seeing this light in the sky yesterday on 10\\16\\2013 at 5:55 pm sitting on my patio just staring at the sky and i see this light in the sky but it's a little closer than normal but still far away. airplanes are flying by going towards the airport for landing. and it moved slowly and then it will be still while planes are flying by.. i have been seeing this for tha past 3 week now.. and it's not a helicopter.. it has know sound and i can hear the planes flying by and it still floats around.. it's hard to believe i'm the only one who seeing this.. being as though this time around it's a little closer that i can see two bright lights they are not blinking. i left to go eat dinnerand when i came back at 6:30 it was still there so i went to take a shower and i looked aggain it was gone.. next time if i see it i will stay out there to see where it goes or what happends."],"Log Number":"US-10172013-0013","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around October 17th 2013"],"Object Features":"None","files":["/var/www/straped/mufon/html2text/51609.html.txt","/var/www/straped/mufon/org/51609.html"],"Weather Factors":"Unknown","Longitude":"-115.316886","Summary":"this is my third time seeing this light in the sky yesterday on 10/16/2013 at 5:55 PM i see this light in the sky but it's a little closer than normal but still far away. airplanes are flying by going towards the airport for landing. and it moved slow","Case Number":"51609","Date of the Event":"10/17/2013 05:55 UTC","Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=36.067831,+-115.316886(51609)&iwloc=A&hl=en\"> mufon case (51609) map </A>"}