{"City":"Phoenix","Source":"MUFON","divs":["Sighting DetailsI've seen this thing a total of four times now. With the first couple of sightings, I felt an aversion to any notion of reporting this. Despite what I had witnessed, the experience still seemed like an absurdity. Now, after two more sightings, I've finally settled on the need to alert others in the UFO observing community. It resembles a white sheet of paper, standard letter size. On three occasions it has flown directly overhead, over the south side of our parking lot at work, tracking from west to east. On two of those occasions it has arced up into the sky shortly after passing over, and on a third occasion it just continued on a straight path to the east. With the first sighting, it paused in its trajectory and hovered directly overhead for a moment, as if it was observing me while I was looking up at it. On one other occasion, it appeared to be engaged in the sheer joy of being able to fly. It galloped upwards in spurts, rolled over into a dive, and then leveled off while flying in a westward direction. I didn't have time to continue watching its escapades on this occasion, as it was the end of the day at work and I had to go catch my bus."],"Longitude":"-112.086999","Log Number":"US-10172013-0008","Date Submitted":"10/17/2013 08:30 UTC","Sighting Duration":"Undisclosed","Tags":"City","Date of the Event":"10/03/2013 02:10 UTC","Latitude":"33.51349","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around October 3rd 2013"],"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Region":"Arizona","Country":"United States","Object Features":"None","Summary":"Animated flying \"sheet of paper\"","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=33.51349,+-112.086999(51605)&iwloc=A&hl=en\"> mufon case (51605) map </A>","Weather Factors":"Unknown","Object Shape":"Unknown","Case Number":"51605","Viewing Distance":"20 Feet or Less","files":["/var/www/straped/mufon/html2text/51605.html.txt","/var/www/straped/mufon/org/51605.html"]}