{"Object Features":"Other","Disposition":"Unresolved","Longitude":"-42.2","Object Flight Path":"Path with directional change","Country":"Brazil","Date of the Event":"06/15/2003 07:01 UTC","Summary":"15 yeas ago, the ufo came front my car in midle a havy fog whith beathiful yelow ligths, and desapeary after 20 seconds in a ligthly road just like that.","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=-22.366667,+-42.2(51611)&iwloc=A&hl=en\"> mufon case (51611) map </A>","trends":["There have been no other sightings in Casimiro de Abreu","This sighting has never been favorited."],"Latitude":"-22.366667","Region":"Rio de Janeiro","files":["/var/www/straped/mufon/html2text/51611.html.txt","/var/www/straped/mufon/org/51611.html"],"City":"Casimiro de Abreu","Tags":"City","Log Number":"BR-10172013-0015","Source":"MUFON","Viewing Distance":"20 Feet or Less","Object Shape":"Unknown","Sighting Duration":"Undisclosed","divs":["Sighting Details10 years ago in was in friburg around rio de janeiro going back to my land in mountains whith two firnds in my wolks, wem we inter in the secondary road to go to lumiar, a smal city in the mountains, a huge fog come over the road and veicule, i never saw a fog like that there and start drove preaty slow, sudently coming form the left side of the road, true the trees, two yelow ligths start cros the road aproaxing and going to the front off my car, in first place i think the ligths come fron a truk, but i didint listenin no sound but i think whith myseilf, ok that truk came fron strange side of this road and the driver is preaty crazy becouse he just come in my direction i thinked he is very unpolite, my car was 40 kilometres speed, and my frinds was talking all time whith whit other, and i thinked the object was a truck, wem the 'truck\" came in my direction and wem its doing a curve to pass in front of the car i saw a very beatfull yelow ligths projecting forn the truck over the road, they projected in a cone shape and apeares be solid, and i think : ok that truck is preaty nice and the lights is amazing, very silent and in a contant speed the truck went in front my car, and i saw a big structure metalic green square and i think i seeing the principal part of the truck the truck have around 4 meters high but i saw no detaILS JUST A SQUARE AND BEAUTIFUL TURCK, i saw no tires no sound, and one mre time i thinked ok thats the most beautiful truck i ever saw, bu its diferent i can not see windows or enyone detail, and i think ok a cray driver in a most beautiful truck i ever saw let me go behind tre truck becouse my ligths is very smal to ligth my way in that amazing fog, and the truck will gide me, unfortunitly wen the truck continue going in front of me in my same speed just 6 meters front, they re ligths dont ligth me or help me in nothing and the truk has just the beatiful lights in two sides, the road has a amall public ligths but the fog almost cover all visibilit and i think, that truck no helping me let me turn off my ligths to see bether his ligths, wem i turned my ligths off, all ligths forn the truck and road turn off, and i casn not see nothing for 1 second, i thinked f k that truck dont help me in nothing let me turn on the lighs, that lapsed off time during just one two seconds and i turn onn my ligths, for my huge amazing friec feelings the truck wass desapeary in front off my eys, just desapeary, i stop the car imediatly the fog desapearly i same instant, and i ask my friend uaaaauuuu you see that? the truck? the truck desapeary,i go aut my car, the road has more around i kilometer before next curve, have no secondary roads my friends in car didint see nothink becouse they was talking all time and the guy wos sited side me was loking behind to talk whith the othe friend, his name is gabriel, and he anser me wi you didint tell me? wi you didint adivise me? we are in near to piramids city, where a group off people construct a ufos port and houses whith piramids roofs, i am crasy to see ufos? i anserer, sory my friend but i think all time i seeing a truck, the most beatful truck i ever see, and just after he desapeared i andestand what hapens, and i continue folowing hin and turning my ligths, if i see its a ufo i supose stop imedatly and neves folow the guy, whith result off that encounter, now i know the aliens are here, other civilizations are here, thats for sure and now i have afraid to go aut the florest alone in the nigth, i have no afraid fron anycaind animal no afraid fron gosts, but i always thing the guys are out side somewhere, i never had afraid and lived 2 years alone in my familys farm near there, now i have afraid and my girlfrine smile, she dont believe, i tell the same histoy the last 15 years, now she start to believe a litle bit. i hope some day a can go to a hipnose to try remenber everthiny whitjh an other point off viel, today i saw your program in tv and decide share my experience. best regards andre"],"Case Number":"51611","Date Submitted":"10/17/2013 01:59 UTC"}