{"Source":"MUFON","Weather Factors":"Unknown","Date of the Event":"07/30/2006 04:11 UTC","Case Number":"5161","map":"<A HREF = \"http://maps.google.com/maps?q=32.482361,+-96.994449(5161)&iwloc=A&hl=en\"> mufon case (5161) map </A>","trends":["There have been no other sightings in Midlothian","This sighting has never been favorited."],"Disposition":"IFO","Tags":"City","Object Features":"Unknown","Sighting Duration":"00:04:00","Summary":"Three star-like objects in triangle formation moving south to north.","Longitude":"-96.994449","divs":["Sighting DetailsOutside in the backyard letting the dog out. Looked up, saw a shooting star, decided to look for a few minutes to see if I could see more. Then, directly overhead, I noticed three star-like objects in triangle formation moving south to north. I had originally been unsure whether I was seeing one large triangular object or three separate objects. Then I noticed that I could see stars between the moving objects and decided that they must be separate objects. Also, after that determination was made, at least one of the objects made very quick movements out of the formation, then back in, although the triangle was not the same shape afterwards. The triangle kind of bent and warped as it moved, so I surmise that all of the objects were probably moving in varying patterns. I looked for any signs of strobes or running lights, but found none. This was a very strange feeling to see this. The fluid motion of the triangle gave the feel that these things could just move any way they wanted to. As for the size, the objects were about as large and the same brilliance as a star. The triangle they formed itself approximately as wide as my fist when I held up my outstretched arm. Whatever they were, they were way way up there. No sound. No lights. I would have thought they were maybe satellites or something. But moving around like that, I really don't think so. Now, I know a lot of people are going to probably say these were planes or jets, since I do live in the flight path of a major airport about 40 miles away (DFW). But I am telling you this were not planes. They just did not move like that, the snakelike movement of them individually, making that triangle fluid. From the time I saw them directly overhead till I lost them in the city lights to the north, was about 4 or 5 minutes. I would say that I watched them from about 90 degrees to about 60 degrees before I lost them in the lights. Very strange."],"City":"Midlothian","Object Flight Path":"Path with directional change","Region":"Texas","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/5161.html.txt","/var/www/straped/mufon/org/5161.html"],"Country":"United States","Latitude":"32.482361","Log Number":"US-07302006-0001","Viewing Distance":"Unknown","Date Submitted":"07/30/2006 04:11 UTC"}