{"Summary":"seen boomerang type object with 5 ligts on side and behnd a 30 degree v with light in mddle 5 lights making v","Region":"Missouri","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=38.255007,+-90.402732(51617)&iwloc=A&hl=en\"> mufon case (51617) map </A>","Object Features":"None","Longitude":"-90.402732","files":["/var/www/straped/mufon/html2text/51617.html.txt","/var/www/straped/mufon/org/51617.html"],"Latitude":"38.255007","City":"Herculaneum","Log Number":"US-10172013-0019","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Date Submitted":"10/17/2013 07:29 UTC","Case Number":"51617","Source":"MUFON","Country":"United States","Weather Factors":"Unknown","Object Shape":"Circle","Date of the Event":"09/01/2013 09:01 UTC","trends":["There have been 2 other sightings in Herculaneum","There were no other sightings in Herculaneum on or around September 1st 2013"],"Tags":"City","Disposition":"Unresolved","divs":["Sighting Details I was driving north on highway 55 near Herculaneum Missouri when I seen two sets of lights in the distance. The first set of orange lights were boomerang shaped with one orange light in front and one orange light at the back of each arm and one light in the middle of each arm. To the side and behind me about fifty feet I saw more orange lights shaped like an upside down 30 degree angle. There was one orange light on the front, one on each end, and one in the middle of the upside down V like shape. Traveling from the North East towards the South West both crafts came over my car. They took about 45 seconds to pass over and were approximately 500 feet above me. I pulled over and watched the lights pass. I could not see any thing in between the two and I could not hear anything. The lights stayed in a steady motion appearing to go about 50-70 miles an hour with traffic traveling out of sight over the horizon. After seeing this I just wanted to forget all about it I saw my first ufo in approximately 1974, and I still cant get that one out of mind. Seeing these last two ufos about a month and a half ago and not being able to get it out of my mind I decided to look on the internet to be able to share my story and found MUFON. Thank You October 17, 2013."]}