{"Region":"Metro Manila","City":"Paranaque","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","divs":["sighting details1. where were you and what were you doing at the time? on october 17, 2013 at around 7:10 p.m. (asia\\manila time), two of us were lounging at our balcony. our property is on the 10th floor of a residential building. 2. what made you first notice the object? the lights appeared out of nowhere. the sky was dark and there were no clouds. 3. what did you think the object was when you first noticed it? at first we thought about a flock of birds, but decided it couldn't have been because the pieces were very large and the lights were too bright. 4. describe the object and its actions and motions in detail. we saw smokey, shimmering lights (like several large pieces of glass) wobbling or undulating across the sky in a wave-like motion. it's like seeing a ray of sun hit a lake. the over-all shape or formation was a parallelogram. it was as if something was going wrong with the flying object's invisible field. we estimated the size of the parallelogram to be about 15 jumbo planes put together (three rows, five planes per row). 5. describe your feelings, reactions and actions, during and after sighting the object. dumb-founded. 6. how did you lose sight of the object? it moved across the sky like a wave for about 30 seconds. it disappeared and then reappeared after about two seconds. it moved again before totally diappearing. total time: about 40 seconds"],"Case Number":"51628","Longitude":"121.045711","Summary":"We saw smokey, shimmering lights (like several large pieces of glass) wobbling or undulating across the sky in a wave-like motion.","Date of the Event":"10/17/2013 07:10 UTC","Object Shape":"Diamond","Log Number":"PH-10182013-0004","Source":"MUFON","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=14.499343,+121.045711(51628)&iwloc=A&hl=en\"> mufon case (51628) map </A>","Disposition":"Unresolved","Sighting Duration":"Undisclosed","trends":["There has been one other sighting in Paranaque","There was one other sighting in Paranaque on or around October 17th 2013"],"Date Submitted":"10/18/2013 03:43 UTC","files":["/var/www/straped/mufon/html2text/51628.html.txt","/var/www/straped/mufon/org/51628.html"],"Object Features":"Other","Country":"Philippines","Latitude":"14.499343"}