{"Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Country":"United States","Summary":"cigar shape.afternoon.going too fast for any thing flying in those days","City":"Tacoma","Latitude":"47.2459","Tags":"City","Region":"Washington","Date of the Event":"06/15/1947 12:00 UTC","Object Features":"None","Weather Factors":"Unknown","trends":["There have been 29 other sightings in Tacoma","There was one other sighting in Tacoma on or around June 15th 1947"],"Longitude":"-122.551019","divs":["Sighting DetailsI was seven.sitting cross legged, facing my two friends.the object was very shiney and looked like my uncles silver cigar case. it was far away and the sun was shining on it or it was emiting light. I was looking toward the east, by the time I pointed at it and yelled,\"what's that?\" and my 2 friends turned to look, it was gone. I was very aware of how fast airplanes flew in the 1940s, we used to watch planes fly in and out of Ozwald field and even Seatac. we lived within 10 miles of Mcchord AFB and I was used to seeing them and hearing them. This was so fast faster than anything I had seen in person or in the news reels at the movies.It appeared in my right line of sight,and flew perpendicularly straight above the earth it dissapeared to my left. It is the singular clearest memory of my childhood. I went right away to tell my mom, I might as well have told her I saw Santa flying by. but two days later, she told me she had heard on the radio that a day meteor had been seen in several states that day. I thought she was lying to me, because I knew what meteors looked like, and that was not what I had seen.so many people laughed at me, that I stopped talking about it and never talked about it after that. The craft looked solid and reflective, it appeared to have sparkler like sparks falling out of the rear. I have allways known it was a UFO even though that title was not coined untill much later. Soon the phrase, \"flying saucer\", hit our vocabulary, I thought I had been wrong, because what I had seen had not been that shape, years later, I saw some film that showed a saucer like ship, then the saucer turned so that only the side of it was turned to the camera, and behold, there was my cigar shape! from the day I saw it, there has been a solid assurance in my inner psychy, almost creepy, that \"we are here, and we are staying\". I have finally written it down, here for you, I feel relieved and vindicated as though a heavy weight has been lifted from my being. This is all true. sincerly Linda Langdon Schulz born april 1940."],"Disposition":"Unresolved","Viewing Distance":"Unknown","Case Number":"51639","Object Shape":"Cigar, Cylinder","map":"<A HREF = \"http://maps.google.com/maps?q=47.2459,+-122.551019(51639)&iwloc=A&hl=en\"> mufon case (51639) map </A>","Source":"MUFON","files":["/var/www/straped/mufon/html2text/51639.html.txt","/var/www/straped/mufon/org/51639.html"],"Date Submitted":"10/18/2013 06:35 UTC","Log Number":"US-10182013-0015"}