{"Date of the Event":"01/28/2013 03:15 UTC","Latitude":"36.152826","Object Flight Path":"Hovering then path","trends":["There has been one other sighting in Strathmore","There were no other sightings in Strathmore on or around January 28th 2013"],"Region":"California","Summary":"It burned out both cell-phones and we had to buy news one. We are out in the middle of no where; see below","map":"<A HREF = \"http://maps.google.com/maps?q=36.152826,+-119.022556(51637)&iwloc=A&hl=en\"> mufon case (51637) map </A>","divs":["Sighting DetailsMy husband and I have had several things happens to us in the course of our marriage which are unexplainable, and since all the new TV shows about Aliens; we feel it is ok to talk about this now. In Colorado we have lost time, and distance while driving from Colorado Springs, Colorado to Alamos, Colorado. We have seen UFO ships; as all this was in 1999. We had one strange event when we moved to Florida, and now that we live in on a very large farm in Strathmore, California it seems to be getting stranger each year; as we have lived on this farm since June 1, 2010. I have recorded strange voices, interferences, on my cell-phone, and my husband has seen lights hovering over our water meter, and both of us have seen red and blue lights right over our home; and a perhaps a UFO hovering for a longtime and then coming back. We only lost time and space once that we know of, however I have had marks on my stomach a type of an attack in Colorado in 1999 that I thought may have happened within inside my home, but now I am not so sure. I am a Christian so I went to my pastor about this, but maybe it was something else. I still have the marks on my stomach.\" There is a lot more, but I am very uncomfortable right now talking about this. I have also had dreams about the same type of (unknown) on TV they call them the Grey, several times, but my dreams were not bad at all, not like on TV. They were nice and needy. Calm and seemed very concerned. Every time I used my cell-phone I would get major interference, and now the darn things do not work, and we had to buy news one. It is if the UFO burned them out; I am not sure. I still have the phones. The 4th Video that night evening was scary, please look at the 4th one though out the while thing. I heard a some sounds outside, so I got my phone, now I did not see anything, but when I uploaded it; this is what I got."],"Weather Factors":"Unknown","Country":"United States","Log Number":"US-10182013-0013","Tags":"City","Date Submitted":"10/18/2013 04:38 UTC","Disposition":"Unresolved","Case Number":"51637","Longitude":"-119.022556","Sighting Duration":"Undisclosed","Viewing Distance":"20 Feet or Less","files":["/var/www/straped/mufon/html2text/51637.html.txt","/var/www/straped/mufon/org/51637.html"],"Source":"MUFON","Object Features":"Patterned Surface","City":"Strathmore","Object Shape":"Circle, Oval, Unknown"}