{"Region":"Florida","City":"Arcadia","Source":"MUFON","trends":["There have been 4 other sightings in Arcadia","There were no other sightings in Arcadia on or around October 18th 2013"],"divs":["sighting detailsthis is a craft that flew right over our home. my wife was recording while my daughter and i were about a 1\\4 of a mile away at the post office in fort ogden florida. before we went over there we saw a number of large white orbs flying from cloud to cloud, it was a full moon so they were easy to see at around 8pm. so i told my wife to go grab the camera and see if she could get any of them on film. while at the post office getting ready to get in our srx we everything lit up brighter then the moon light and we looked over and this craft was not 500 yards from us, not far above the tree tops moving very slow, it was bigger then a 747 easily and we heard no sound, it moved along a southern path across 17 highway right in front of us. then it turned like it steered like a car and went parallel to the highway and started to turn back like it was going to head back over the highway then just vanished, not sure if it accelerated so fast we couldn't see it or literally vanished. we heard no sound from it and we headed home hoping that my wife was videoing and saw the craft. when we got home she was outside and said you won't believe what flew over the house and i said we were right next to it and tell me you got it on video and she said yes so here it is. she said she heard sound from it like a electrical whirl or buzzing sound but very low decibels. my daughter and i heard nothing . the video is unedited and uncut. my daughter and i both agreed that it was triangle shaped with some things like arms coming off of it. when we saw it it had a ton of solid lit lights and some flashing strobes on the sides and some kind of spinning thing on it. we are sure there will be alot of reports because there was definitely more witnesses then just us 3. government secret craft or something else? you decide or if you know tell us because we are baffled by it. extra note my wife heard a sound but she may have heard our aerators in the pond which makes a humming sound, it came right next to my daughter and i at the post office and it made no sound at all. we have lots of videos of strange craft and this one thats here almost ever night some nights it moves to a different location and is either 3 lights in a row or changes to one big orb"],"Latitude":"27.061185","Longitude":"-81.976022","Tags":"City","Log Number":"US-10192013-0003","Case Number":"51648","Summary":"Large Triangle Craft with arm like things","map":"<A HREF = \"http://maps.google.com/maps?q=27.061185,+-81.976022(51648)&iwloc=A&hl=en\"> mufon case (51648) map </A>","Date Submitted":"10/19/2013 01:52 UTC","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","Object Features":"Appendage(s)","Object Flight Path":"Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","Country":"United States","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/51648.html.txt","/var/www/straped/mufon/org/51648.html"],"Date of the Event":"10/18/2013 12:00 UTC","Disposition":"Unresolved"}