{"Summary":"Large light","Object Flight Path":"Straight-line path,Unknown","files":["/var/www/straped/mufon/html2text/51640.html.txt","/var/www/straped/mufon/org/51640.html"],"Disposition":"Unresolved","Date of the Event":"10/04/1987 12:00 UTC","Case Number":"51640","trends":["There have been no other sightings in Turmo Cali","This sighting has never been favorited."],"Region":"California","Sighting Duration":"Undisclosed","Date Submitted":"10/18/2013 07:09 UTC","Object Features":"Unknown","divs":["Sighting DetailsMy incounter started with this object in 1986 or 1987 and went till 1990. The first time I saw the object was during deer hunting in the high desert between Calif. and Nevada. Late one night I had to urinate, steeping out the camp trailer I walked a short distance to relive myself, will standing facing the west I saw a large brilliant light , standing there in the buff trying to put a shape to this object or running lights I was unable to do ether. Above me I could see a airliner in flight with strobes and hazard lights. I was comparing the two , one I new the other I did not. Quite , slow , with a brilliant white light that came from every where, I was unable to give any structure just that the light was a sphere. A few days later I awoke felling good but a little tired from the before daylight hitting the trails till way after dark, my routine was to brush my teeth wash my face , arms in general a wash cloth bath.Wile washing my face I had very large deep red welt or bit mark on my left temple about the size of a quarter or slightly bigger. There was no pain no eratation if I had not seen It I would not have known about it. The men I hunted with said nothing about it and nether did I. This was to happen again in the next few years will hunting in the same area. For some reason I came to fear this object, just out side of camp is a small ridge, I became afraid of what was on the other side, I did not like the back side. The thing or what ever it was on my temple would have a large Snow White scab that took from 4 to 5 weeks to disappear , I never picked at it or dug at it I left it alone. I have seen this light many times back in that country, something happened don't have clue. You may contact me by phone or email or mail, there is more to tell."],"Country":"United States","Object Shape":"Sphere","Viewing Distance":"Over 1 Mile, Unknown","Longitude":"-119.413382","Source":"MUFON","Tags":"City","Weather Factors":"Unknown","City":"Turmo Cali","map":"<A HREF = \"http://maps.google.com/maps?q=36.785181,+-119.413382(51640)&iwloc=A&hl=en\"> mufon case (51640) map </A>","Log Number":"US-10182013-0016","Latitude":"36.785181"}