{"Latitude":"33.455506","Object Features":"Unknown","City":"McDonough","Source":"MUFON","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/51650.html.txt","/var/www/straped/mufon/org/51650.html"],"Region":"Georgia","Log Number":"US-10192013-0006","Summary":"ballpoint pen tipped size, white, round, in the east headed north, very high near or above cirrus clouds.","Object Shape":"Circle","Date of the Event":"10/18/2013 05:10 UTC","Longitude":"-84.137092","Tags":"City","Date Submitted":"10/19/2013 02:12 UTC","divs":["Sighting DetailsAround 510pm EST on Friday, October 18th, 2013, an object was located in the high sky in the east and was headed at what appeared to be due north. I was outside at work in the north of McDonough, Georgia. A coworker and I were pointing out a couple of the low flying planes to our small children. The children lost interest and I was about to, until a tiny speck caught my eye. I was mesmerized by it. A fleeting thought of an extremely high flying airplane flitted through my mind but was quickly dispelled. The object was between 60 and 75 degrees or so above the horizon. It was very small, as if someone had lost the tip of a ballpoint pen. It was white. I did not think it was shiny, rather it was more like an airplane's finish. It was perfectly roundish to my eye. There was a small gap- around the size of the object itself- between it and what seemed like a thin whitish-grey 'tail.' This tail was easily ten or so times longer than the object itself. Curiously, this apparent tail followed the object and did not leave behind residue as an airplane trail does. The tail was blunt on the proximal end and possibly pointed on the distal end. The object was very high in the sky. It was up and close with the highest cirrus clouds. I have never seen anything so high up. It was flying in a very straight line. It was in the east and definitely headed northward. After two or so minutes I had my coworker come and see. She had to squint to see it and also at very first thought it to be a high airplane. But then she, too, saw that it was round and odd. Our kids took no notice to it at all. And after about five to maybe ten minutes, I lost it in the clouds. Please help me find out what this object was."],"trends":["There have been 8 other sightings in McDonough","There was one other sighting in McDonough on or around October 18th 2013"],"Weather Factors":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.455506,+-84.137092(51650)&iwloc=A&hl=en\"> mufon case (51650) map </A>","Case Number":"51650","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Viewing Distance":"Over 1 Mile, Unknown"}