{"files":["/var/www/straped/mufon/html2text/51658.html.txt","/var/www/straped/mufon/org/51658.html"],"Longitude":"-82.479419","divs":["Sighting DetailsI was driving through my neighborhood and looked up. I saw two red lights and slowed down and drove through the neighborhood keeping an eye on them. I'd never seen lights in that portion of the sky and was a bit surprised and even lowered my window to take a better look and paused the car then continued to my house hoping for a better view. I thought they were unusually bright, even brighter than stars and for a moment I thought someone had put up a tower during the day while I was up at work. I thought it was super strange but as I drove through the neighborhood I noticed they were changing positions. When I got home which was less than a block I got out of my car and looked up and noticed they no longer were one above the other. They now were completely parallel to each other and were barely moving. There was no sound but they were still super bright and really big. There was no flickering and changing of colors which is what I've seen in airplanes and helicopters and no noise. This was a strong stationary red color that moved slowly and barely noticeably. After watching for between a minute to a minute and a half I noticed they were suddenly fading out like a flashlight with batteries dying and then they were gone. I felt as if they'd gone away from me. Within a minute I noticed a jet crossing the sky at a really high altitude with blinking lights. We have the Sarasota Airport locally so it probably was a passenger jet. Ironically, this helped me figure out the size as being probably two to three times bigger because the lights from the jet were tiny in comparison and blinking and much closer. The lights seemed to be right over the area that would be Myakka Park. I don't know what it was that I saw but I know this is nothing normal. I've lived here for at least 10 years and this was nothing like anything I've seen and I've seen all types of helicopters and planes cross over us."],"map":"<A HREF = \"http://maps.google.com/maps?q=27.257584,+-82.479419(51658)&iwloc=A&hl=en\"> mufon case (51658) map </A>","Source":"MUFON","Case Number":"51658","Disposition":"Unresolved","Country":"United States","Object Flight Path":"Path with directional change","Object Shape":"Circle, Sphere","Summary":"Two bright lights in sky that seemed to be above the area where Myakka park would be","Date Submitted":"10/19/2013 09:47 UTC","Weather Factors":"Unknown","Log Number":"US-10192013-0013","Latitude":"27.257584","Object Features":"Unknown","trends":["There have been 39 other sightings in Sarasota","There were no other sightings in Sarasota on or around October 18th 2013"],"Sighting Duration":"Undisclosed","City":"Sarasota","Viewing Distance":"Over One Mile","Region":"Florida","Date of the Event":"10/18/2013 09:30 UTC","Tags":"City"}