{"Disposition":"Unresolved","divs":["sighting detailsmy son first pointed to the ufo. observed (3) blinking orange \\ white lights. lights appeared in a large triangle shape moving uniformly. observed lights for (20) seconds with my 7 yr old son. pulled out camera phone was only able to get (1) of the blinking lights to be viewable on the video. 1. where were you and what were you doing at the time? i was going to pickup pizza and my son pointed out the lights when i was exiting the garage. 2. what made you first notice the object? my (7) year old son. 3. what did you think the object was when you first noticed it? to large to be a plane. thought right away it was a ufo. 4. describe the object and its actions and motions in detail. seen the ufo fly over houses a cross the street under cloud line. seen (3) blinking lights in a triangle design. lasted for 40 sec. then (2) of the lights disappeared leaving (1) blinking light. 5. describe your feelings, reactions and actions, during and after sighting the object. it was pretty cool. my son seen his 1st ufos also..i think it is my 1st one also. 6. how did you lose sight of the object? (2) of the (3) lights disappeared and then large trees abstracted the view. no noise was witnessed. video only contains (1) light blinking faintly.."],"Source":"MUFON","Date Submitted":"10/19/2013 09:25 UTC","Case Number":"51656","Object Flight Path":"Stationary,Straight-line path","Weather Factors":"Unknown","Date of the Event":"10/19/2013 08:05 UTC","City":"Warren","Country":"United States","Sighting Duration":"Undisclosed","Object Shape":"Triangle","Object Features":"Unknown","Longitude":"-83.009714","Summary":"3-Light UFO","Latitude":"42.550265","trends":["There have been 14 other sightings in Warren","There were no other sightings in Warren on or around October 19th 2013"],"Region":"Michigan","Log Number":"US-10192013-0011","map":"<A HREF = \"http://maps.google.com/maps?q=42.550265,+-83.009714(51656)&iwloc=A&hl=en\"> mufon case (51656) map </A>","files":["/var/www/straped/mufon/html2text/51656.html.txt","/var/www/straped/mufon/org/51656.html"],"Viewing Distance":"20 Feet or Less","Tags":"City"}