{"Country":"United States","trends":["There have been no other sightings in Cataula","This sighting has been favorited 1 time."],"Date Submitted":"10/20/2013 01:22 UTC","Case Number":"51667","Weather Factors":"Unknown","Tags":"City","divs":["Sighting DetailsI was standing in my yard after the fire truck's left from a house fire across the street. As they were leaving , we noticed what appeared to be a long white cylinder with a black ring around one area of this. It was falling from the sky a little fast but, not too fast. It had a dome on one end that also had the same color light on the inside of it & it was round shaped. The first thing I thought of was, it's a UFO ! I have seen this very same object 2 day's before this happened. There was no sound at all. We could actually see the redish tint all around the object. As I recorded it, it started falling from the south going to the south west area & then it was gone. I was amazed at what we saw but, I also knew it wasn't right. In my opinion, I knew it was a UFO ! No sound at all, no wing's, and the fact that it had a dome on it was really out of place . It didn't leave any trail of smoke at all. Totally silent. While I was recording, I watched it go behind the tree's & disappear. I'm trying to get an answer to this."],"City":"Cataula","Viewing Distance":"Unknown","Region":"Georgia","Object Shape":"Cylinder","Longitude":"-84.893665","Sighting Duration":"00:02:00","Disposition":"Unresolved","Date of the Event":"08/21/2013 08:00 UTC","Object Flight Path":"Straight-line path","Summary":"It came out of no where without a sound. Flew behind the tree's & was gone.","Log Number":"US-10202013-0007","Source":"MUFON","Object Features":"Dome","Latitude":"32.685361","map":"<A HREF = \"http://maps.google.com/maps?q=32.685361,+-84.893665(51667)&iwloc=A&hl=en\"> mufon case (51667) map </A>","files":["/var/www/straped/mufon/html2text/51667.html.txt","/var/www/straped/mufon/more/51667_submitter_file2__rGEORGIAUFOAUG2013large570.jpg","/var/www/straped/mufon/org/51667.html"]}