{"Case Number":"51668","map":"<A HREF = \"http://maps.google.com/maps?q=37.925545,+-90.597988(51668)&iwloc=A&hl=en\"> mufon case (51668) map </A>","Disposition":"Unresolved","divs":["sighting detailsi was asleep inside home, had several layers of clothing on as it was very cold. home was being remodeled. only heat was kerosene heater. asleep on two couches pushed together in living room. a \"pit\" couch without middle causing a large playpen like bed. awoke outside in the snow to a very loud sound like a train, was naked and was locked out of the home deadbolts were still locked from the inside. beat on the door until boyfriend finally awoke and let me in. only other door\\exit was about 6 foot off the ground. no stairs. have no idea how i got outside, how i became undressed, clothing missing all together and never found. kept this to myself for years, now need to know what happened.was not on drugs, did not drink, started having panic attacks after this experience. completely serious not a hoax please help. can't go to psychiatrist tell this story and expect to walk out. have reoccurring dreams and strange dreams of other worldly things. memory of event is starting to become vague. have lupus and other health issues affecting my memory. want to know what happened, need help.also had a scar that wasn't there before over left ovary and 3 dots in form of triangle on abdomen."],"Summary":"Think I was taken need help to remember","Object Flight Path":"Unknown","Viewing Distance":"Unknown","Tags":"City","Date of the Event":"02/16/1996 12:00 UTC","trends":["There have been no other sightings in Bonne Terre","This sighting has been favorited 1 time."],"Log Number":"US-10202013-0008","City":"Bonne Terre","Region":"Missouri","Sighting Duration":"Undisclosed","Longitude":"-90.597988","files":["/var/www/straped/mufon/html2text/51668.html.txt","/var/www/straped/mufon/org/51668.html"],"Object Shape":"Unknown","Weather Factors":"Unknown","Date Submitted":"10/20/2013 02:02 UTC","Object Features":"None","Source":"MUFON","Country":"United States","Latitude":"37.925545"}