{"Country":"United States","Summary":"Bright \"sun-like\" shapes in eastern San Diego County early morning skies","City":"Lakeside","Weather Factors":"Unknown","Longitude":"-116.913539","Latitude":"32.863162","trends":["There have been 5 other sightings in Lakeside","There were no other sightings in Lakeside on or around October 17th 2013"],"Sighting Duration":"Undisclosed","Region":"California","Log Number":"US-10202013-0003","Object Flight Path":"Hovering then path","Source":"MUFON","divs":["sighting detailsi was driving my vehicle on 67 north towards mapleview exit at approximately 6:45 am on 10\\17\\13. the sun had not risen above the horizon yet and the sky was was getting light. there are two mountains directly east of there about 50 miles east with a \"valley\" in between. i saw a spot in the sky that was as bright as the sun but was only aspirin size in the sky. i didn't know what it was but knew it wasn't a star or plane as stars and planes are not that bright. it was like little pieces of the sun in the early morning sky. as i sat at the stoplight, i watched the light in the sky slowly move in a northerly direction. then all of a sudden a second and third light appeared. one of the lights was elongated, almost like a shooting star but was kind of stationary and appeared like it was moving in a southerly direction. the third light was a little bigger than the first and seemed like it was moving in a northerly direction. as traffic started moving, i tried to keep watch. the lights stayed for a few moments and then disappeared. as i continued up the hill on 67n, i saw one of the lights had come back. i then traveled too far to see anymore. when i arrived at work in poway, i kept watch from a second story window, but the sun had risen and it was too bright. i didn't see them again. as i drove to work the following morning i looked for the lights but they were not there."],"Case Number":"51663","Date of the Event":"10/17/2013 06:45 UTC","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.863162,+-116.913539(51663)&iwloc=A&hl=en\"> mufon case (51663) map </A>","files":["/var/www/straped/mufon/html2text/51663.html.txt","/var/www/straped/mufon/org/51663.html"],"Object Shape":"Circle, Fireball, Other","Viewing Distance":"Over 1 Mile, Unknown","Tags":"City","Date Submitted":"10/20/2013 12:34 UTC","Disposition":"Unresolved"}