{"Disposition":"Unresolved","Log Number":"GB-07312006-0001","Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","files":["/var/www/straped/mufon/html2text/5166.html.txt","/var/www/straped/mufon/more/5166_submitter_file1__sd_300706_sighting.jpg","/var/www/straped/mufon/org/5166.html"],"Country":"United Kingdom","Date of the Event":"07/30/2006 11:05 UTC","divs":["Sighting DetailsAt around 11pm my parents were relaxing outside after work. I went out to join them and my dad said he had just seen a strange object in the sky. He said it was a pitch black shape (he wasn't sure on the exact shape as it moved quickly). The sky was a dark grey with slight orange tint from the street lights but this object was pitch black and obscured everything - background glow and stars - as it went. It took 5-7 seconds to go across the sky. He described it as \"In star trek talk - it was something under a cloaking device - pitch black - darker than anything else in the sky\". It made no noise. A few minutes later both of my parents and I saw another strange object. I'm not sure if it's related so am mentioning it too. It was a triangle of red lights with one red flashing light at the back. It wasnt the standard red and white flashing lights and obvious winged shape of a plane. It moved slowly compared to the other planes in the sky - a few minutes to move across the sky (others were overtaking it). And it also made no noise that I could hear. It could have been at high altitude - it was hard to judge due to being 11pm."],"trends":["There have been no other sightings in Folkestone","This sighting has never been favorited."],"Source":"MUFON","Weather Factors":"Unknown","Summary":"Black object blocking out everything, followed by a smaller red triangle of lights","Object Shape":"Triangle, Unknown","Object Features":"Undisclosed","Sighting Duration":"00:03:00","City":"Folkestone","Region":"England","Case Number":"5166","Date Submitted":"07/30/2006 11:05 UTC","Longitude":"1.169456","Latitude":"51.081397","map":"<A HREF = \"http://maps.google.com/maps?q=51.081397,+1.169456(5166)&iwloc=A&hl=en\"> mufon case (5166) map </A>"}