{"Region":"Colorado","Date Submitted":"10/20/2013 12:39 UTC","Source":"MUFON","Weather Factors":"Unknown","Longitude":"-107.991664","map":"<A HREF = \"http://maps.google.com/maps?q=38.774336,+-107.991664(51672)&iwloc=A&hl=en\"> mufon case (51672) map </A>","divs":["Sighting DetailsHad just bought a new camera and was outside taking quick pix of a passing coal train. I live on the Western Slopes of Colorado along Rt. 92 about 6 miles East of Delta. The western slopes of the Grand Mesa are in the background. Also in all 3 pix there is a jet above the object which barely moves, so it gives an idea as to how quickly the pix were being taken. (Time stamps on the pix is 4:23, 4:24, & 4:24 pm) I didn't notice the object until I downloaded the pictures onto my computer. That's when I saw the object in only the 1st pix. The object only appears in the first picture above one of the coal-cars in the train. In the picture the object looks like a cross between a tear-drop and an oval shape and appears to be black with a smooth surface. Antelope Hill is in the lower background with the Grand Mesa beyond and above that feature. First thought after seeing this is that it's a UFO! This is now the 6th UFO I've seen in the skies out here (this is a desert area not far from the border of Utah). I did not see this in real-time, only saw it after I looked at the pictures on my computer. At the time I was looking into the view window of the camera and not paying attention to what was happening. Plus it must have been moving quite quickly to only appear in the one picture."],"Log Number":"US-10202013-0009","files":["/var/www/straped/mufon/html2text/51672.html.txt","/var/www/straped/mufon/more/51672_submitter_file1__10192013Evening123.JPG","/var/www/straped/mufon/more/51672_submitter_file2__10192013Evening124.JPG","/var/www/straped/mufon/more/51672_submitter_file3__10192013Evening125.JPG","/var/www/straped/mufon/org/51672.html"],"Disposition":"Unresolved","Date of the Event":"10/19/2013 04:23 UTC","Country":"United States","Object Features":"None","Sighting Duration":"Undisclosed","trends":["There has been one other sighting in Delta","There were no other sightings in Delta on or around October 19th 2013","This sighting has never been favorited.",""],"City":"Delta","Tags":"City","Latitude":"38.774336","Case Number":"51672","Object Shape":"Oval","Object Flight Path":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Summary":"Series of 3 pix within 15 seconds object in first pix"}