{"Region":"California","Object Flight Path":"Path with directional change","Object Features":"Other","files":["/var/www/straped/mufon/html2text/51677.html.txt","/var/www/straped/mufon/org/51677.html"],"Weather Factors":"Unknown","divs":["Sighting DetailsI was in my front yard, my Father N Law was buffing out the top side of his R.V. and he wanted me to take a look at it. As I was looking up at the side of the R.V. something caught my eye. At first I thought it was a balloon but it changed direction as we were observing it. After several minutes I told my Father N Law I want to try and video tape it. I went in the house got my video camera I then tried to find a video tape I could use. All that took about 4 to 5 minutes I came back outside and began to record. I first noticed the object moving slowly south west of me then it would come back North West it did that for about 10 minutes. Some times it would stop in one spot. As you hear me say in the video it was fading in and out I thought it was going behind clouds but it was a clear afternoon the object was fading in and out and tilting side to side. There were several trees on both side of where I was recording so im sure they can be used as some type of reference. Not until I viewed the tape later did I notice there was a second object it was silver and gave off a bright reflection but the sun was setting behind it the sliver object was at 1oclock of the object I was recording. I lost sight as my video camera didn't have a very good zoom on it. I really didn't have any feelings I just wondered what I was seeing. I was there with my mother n law and my father n law he is a minister. I have had this for many years I have only shown it to 3 or 4 people but I have many questions and I am reaching out to you hoping with the technology you have you can maybe give me insight to what I was recording that day."],"Longitude":"-119.832034","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=36.807579,+-119.832034(51677)&iwloc=A&hl=en\"> mufon case (51677) map </A>","Country":"United States","Case Number":"51677","Object Shape":"Disc","Disposition":"Unresolved","City":"Fresno","Summary":"after viewing the tape there are 2 one white and one silver","Latitude":"36.807579","Sighting Duration":"Undisclosed","Source":"MUFON","Date of the Event":"12/26/2003 06:15 UTC","Log Number":"US-10202013-0015","Date Submitted":"10/20/2013 05:38 UTC","trends":["There have been 63 other sightings in Fresno","There were no other sightings in Fresno on or around December 26th 2003"]}