{"Case Number":"51670","Object Features":"None","City":"Sedona","Object Flight Path":"Stationary,Hovering then path,Unknown","Weather Factors":"Unknown","Object Shape":"Boomerang, Chevron","Summary":"Again, as on another evening during October I sighted and photographed a large Boomerang hovering above my home in VOC Sedona, AZ","trends":["There have been 47 other sightings in Sedona","There were no other sightings in Sedona on or around October 19th 2013","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/51670.html.txt","/var/www/straped/mufon/more/51670_submitter_file1__IMG20131019183934839.jpg","/var/www/straped/mufon/org/51670.html"],"Source":"MUFON","Disposition":"Unresolved","Region":"Arizona","Viewing Distance":"Over 1 Mile, Unknown","Country":"United States","Tags":"City","Sighting Duration":"01:00:00","Date of the Event":"10/19/2013 07:20 UTC","Date Submitted":"10/20/2013 11:40 UTC","Longitude":"-111.75719","map":"<A HREF = \"http://maps.google.com/maps?q=34.87832,+-111.75719(51670)&iwloc=A&hl=en\"> mufon case (51670) map </A>","Log Number":"US-10202013-0010","divs":["sighting detailsat 19:20 hours on 19 october 2013, as i was leaving my home, i sighted a large, very bright white light hovering above the southern edge of my property in the voc of sedona, az. i took about 5-6 photos with my cell phone but only two photos were any good as once again my camera began; as during one other sighting this month while photographing another ufo, the camera controls began flickering wildly and again refused to photograph correctly. i did not have the time to grab another camera as i had to leave being my wife was getting off work and was waiting in uptown for me to pick her up. fortunately, the object stayed nearby where i first sighted it and\\or moved nearby the sedona airport and was visible all the time while we were on our return trip to the village of oak creek. my wife and numerous others also sighted the object (as well as the quite large full moon which was off to the eastern part of the sky). the object, upon our return to the voc, was further south of the location where i first had sighted it; but i did not see it leave or am aware as to the length of time it was viewable. i am sure a great many others were viewing the object\\craft as numerous cars were parked alongside the roadway and appeared to be watching the object!"],"Latitude":"34.87832"}