{"Tags":"City","trends":["There have been no other sightings in Rocky Mount","This sighting has never been favorited."],"Summary":"HUGE triangle, three HUGE bright white lights, one at each point, one red light in middle, incredibly low, steadily moving, very frightening","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","divs":["Sighting DetailsI was leaving my grandmother's house at 7:20pm, eastern time when, as I was coming around a bend in the neighborhood, I noticed a set of three incredibly bright lights in the sky flying towards me, or in my direction. I pulled over and put my car in park in front of someone's house to stare at the lights because I had never witnessed anything like it before. I thought that maybe it was a plane, but I've never in my life seen anything like it, especially not a plane like THAT. It flew directly over the neighborhood and directly over my car at approximately 500ft going northeast. As it continued it's journey over my car I stuck my head out of the window to get a good look at it and it was a very big, very dark colored triangular shaped flying object with an incredibly bright white light at each of it's three points and a large red light in the middle of the craft. As it passed over me I could hear a low humming sound. In the distant sky behind it I saw another enormous bright white light that was also moving east. As it was moving the light suddenly dimmed and became the size of a very small star and then completely disappeared, all while flying in the sky! I could not believe what I had just witnessed. Furthermore, farther in the eastern sky were two other large bright objects. They were very, very large and bright, but stationary in the sky. I was very frightened and even started to tremble because I didn't know what was about to happen and even thought to myself that something bad might be seconds away. Once I arrived at home, about 4 miles from my original sighting, there were planes everywhere heading in the direction that the first larger, triangle craft was headed in (NE). I am still shaken up over this event and no one could convince me that they were man made. It still has me very nervous about what may happen in the future."],"Region":"North Carolina","Disposition":"Unresolved","City":"Rocky Mount","Object Features":"Wings","Latitude":"35.962286","Source":"MUFON","Sighting Duration":"Undisclosed","Date of the Event":"10/20/2013 07:20 UTC","Log Number":"US-10202013-0022","files":["/var/www/straped/mufon/html2text/51686.html.txt","/var/www/straped/mufon/org/51686.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.962286,+-77.871851(51686)&iwloc=A&hl=en\"> mufon case (51686) map </A>","Object Shape":"Triangle","Case Number":"51686","Object Flight Path":"Straight-line path","Longitude":"-77.871851","Country":"United States","Date Submitted":"10/20/2013 08:49 UTC"}