{"Date of the Event":"10/12/2013 07:45 UTC","Summary":"a gliding boat/triangle shaped craft, assuming it was black but impossible to know, had white lights in the back","Sighting Duration":"00:04:00","map":"<A HREF = \"http://maps.google.com/maps?q=45.605316,+-122.660972(51683)&iwloc=A&hl=en\"> mufon case (51683) map </A>","Case Number":"51683","Tags":"City","Object Features":"Unknown","Date Submitted":"10/20/2013 07:38 UTC","Weather Factors":"Unknown","Longitude":"-122.660972","Source":"MUFON","Log Number":"US-10202013-0019","Disposition":"Unresolved","Object Flight Path":"Straight-line path","trends":["There have been 54 other sightings in Vancouver","There were no other sightings in Vancouver on or around October 12th 2013"],"divs":["Sighting DetailsI walkded out of my buildings to the front porched for a smoke break, was prob 730-745 pm saturday the 12th 2013. It was already dark and the street im on has a couple of street lights out so you could see the sky little more clear than normally at night. I was smoking and just kinda spacing out looking up and i noticed an object coming from the south west. I figured was a plane because PDX is south east of my location, maybe ten or so miles away. Generally the air traffic travels oppsite path that the object was traveling so i watched it about 3-4 mins come from the south east over the top of the buildin and continue in north east direction. It did fairly close but the camera on my iphone like usual was being useless and had tough time keeping hand steady, fortunatly after it passed over head and was maybe a couple hundred feet away i was able to get a decent shot. It moved like how a car moves on ice, like there was no wind resistance slowin it down or drag. It made no noise and was solid object, didnt flicker or morph in any way. After passing over head it slowly blended in with sky and that was that. August 2007 I was watering front lawn about 5pm, it was sunny and clear day when boat shaped solid black craft was crusing about 500 ft off the ground maybe doing 100 mph, if that. It was one of those things after its gone you start looking all around you hoping that someone else saw it, so unfortunatly after witnessing that this doesnt compare"],"files":["/var/www/straped/mufon/html2text/51683.html.txt","/var/www/straped/mufon/org/51683.html"],"Latitude":"45.605316","Object Shape":"Triangle","City":"Vancouver","Region":"Washington","Viewing Distance":"501 Feet - 1 Mile","Country":"United States"}