{"Object Features":"Dome, Other, Unknown","Log Number":"US-10202013-0027","map":"<A HREF = \"http://maps.google.com/maps?q=40.905442,+-73.306138(51691)&iwloc=A&hl=en\"> mufon case (51691) map </A>","Country":"United States","Source":"MUFON","Disposition":"Unresolved","Region":"New York","Longitude":"-73.306138","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Object Flight Path":"Stationary,Straight-line path,Path with directional change","files":["/var/www/straped/mufon/html2text/51691.html.txt","/var/www/straped/mufon/org/51691.html"],"Tags":"City","City":"East Northport","Date Submitted":"10/20/2013 11:04 UTC","divs":["Sighting DetailsEvery Night for the Past 3 Months I've been Observing a Multitude of Various shaped objects of different Size and Mass in the Night Sky. Many evenings, I use Dr. Greer's Meditation Techniques to Signal the Various Craft Flying by or Hovering. I also have Cultivated more Equipment with Better Optical Capabilities. I haven't been able to Buy a N.V. Monucular to Record any or all Events. But I'm working on it. I was Present at the 1st Conference in Joshua Tree, California this August. if you Recall ; it was aptly Named \" Contact In the Desert \". So, that put a kink in my Ability to Buy more Equipment. As to Record Events & Experiences. This entire Weekend all sorts of Craft have Been in the sky ! Of all shapes & sizes. I've been Signaling one Specific Shape & its been Acknowledging my Presence by Flashing a White Beam back at me, from the Darkest part of the Night Sky. One (1) Flash is for Yes & two (2) Flash for \" Do You Understand Me \" ! Usually my Contact is a Large Cigar Shaped Craft with a Conning Tower fore or Aft of the Craft. A Conning Tower that One would see on a US \" Aircraft Carrier \", These ETV's are usually unloading Many Smaller Sphere's; that then fly off into Different Directions. This evening, I walked out on the Porch to have a Smoke. Immediately , around 15 miles Northeast, at a 90 degree angle from where I happened to be Standing: I saw a Pulsating Light. The Light, with my Naked Eye Was giving off a Translucent Green, Menthol-Spearmint Hue; with a White and Red pulsating light in between. I went to my Car & got my Gear. This Craft was Closer then Normal. They usually keep they're Distance. I assume because of all the Airplane Traffic. I guess, where I live is a Regular Flight-path for both Civilian and Military Aircraft. In the early evening. From 9:00pm to 4:00am , maybe One plane fly's by each Hour. Since last October, The Amout of ETV's Seen by me has gone from a few Hundred to Thousands on Any Given Evening ; When the Sky is Clear or Just after a Rain Storm. Something is Going On. I can Feel it. I think our Precious Earth is Headed for a catastrophe of Biblical Proportions. Getting back to the Sighting. Tonight, is the 1st Time I witness an EBE in my Presence, if Only Briefly. Because the Creature Ran in front of me, and disappeared into the Bushes 25 ft in front and exiting to the Right onto Someone els's Property & Vanished. All I heard was the Ruffling through the fallen leaves & Branches. This All took place as I was peering through my Night Vision Goggles ; Night Optic's Generation 3 ; Auto Gated. I was also utilizing a N.O.'s IR-K2 Infared Pointer to draw r the Craft's Attention. Then Mark it with my Green 850nm Laser. I also had an UltraViolet Flashlight Propped up , so its Beam went into the Nights Sky. The Other 100 & Counting Extraterrestrial Vehicles started to Congregate near the UV Beam, in the Night Sky. So me juggling the Equipment And Viewing the Vehicle that was Signaling me. This Tiny Whiteish to Opaque being Ran by me in a Flash."],"Object Shape":"Chevron, Diamond, Disc, Flash, Sphere, Triangle","Date of the Event":"10/20/2013 09:30 UTC","Latitude":"40.905442","Case Number":"51691","Summary":"Was Observing A Large Chevron Above me at an elevation of 5 Miles, was Pulsing Green,White, Red Light , when small entity ran through leaves , 25 ft in front of me.","trends":["There have been 2 other sightings in East Northport","There were no other sightings in East Northport on or around October 20th 2013"],"Weather Factors":"Unknown"}