{"Source":"MUFON","Date of the Event":"10/20/2013 07:30 UTC","divs":["sighting details10\\20\\13 approximately 7:30pm - 7:40pm mst (disappeared and reappeared during timeframe) i was grilling some hamburgers in my backyard tonight and at about 7:30pm mst, a very small but very bright blue-violet dot\\light caught my eye. this happened while i was admiring the moon (although not full it was big and bright tonight) looking towards the ne from my backyard on this clear open night (great weather), as i waited for my burgers. the dot\\light was very erratic in it's movement and it's size\\ or the amount of light it emitted. it would move from side to side, it dipped down below a small tree line where i could no longer see it. it then reappeared but it was higher in the sky and more towards the west (almost due north from where i was standing). the object then disappeared. at about 7:48pm i noticed the small dot again later again before it fell below the tree line again, it got very, very bright and big (the biggest i had seen it) before it seemed to disappear. *i was turned to 27-29 degrees (compass) with my suunto core watch. *downloaded gps app onto phone. my coordinates as i was and shows my coordinates i was standing as: latitude degrees: n33 longitude degrees: w112 bearing: 12.7 altimeter: 345 meters"],"Viewing Distance":"Over One Mile","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Disposition":"Unresolved","Object Features":"Unknown","Longitude":"-112.065087","trends":["There have been 417 other sightings in Phoenix","There was one other sighting in Phoenix on or around October 20th 2013"],"Log Number":"US-10212013-0002","Sighting Duration":"00:10:00","Region":"Arizona","Summary":"small violet-blue light in NE phoenix","map":"<A HREF = \"http://maps.google.com/maps?q=33.451677,+-112.065087(51696)&iwloc=A&hl=en\"> mufon case (51696) map </A>","Case Number":"51696","Weather Factors":"Unknown","Latitude":"33.451677","City":"Phoenix","Date Submitted":"10/21/2013 12:38 UTC","Country":"United States","Object Shape":"Circle, Diamond, Flash, Sphere, Star-like, Other","Tags":"City","files":["/var/www/straped/mufon/html2text/51696.html.txt","/var/www/straped/mufon/org/51696.html"]}