{"Sighting Duration":"00:01:13","Region":"New York","Summary":"Caught on a bushnell trophy cam HD Max. 2013 model","Date of the Event":"10/15/2013 02:55 UTC","Object Flight Path":"Hovering then path","Longitude":"-73.80431","Object Shape":"Circle","Country":"United States","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=44.608378,+-73.80431(51698)&iwloc=A&hl=en\"> mufon case (51698) map </A>","Object Features":"Other","Weather Factors":"Unknown","Case Number":"51698","Date Submitted":"10/21/2013 01:04 UTC","Viewing Distance":"20 Feet or Less","divs":["sighting detailsthis is my second report. the first report involved a cylinder shaped light\\object, at a location about 3 miles south of this location. common factors are both occurred in a driveway one with a steel gate and this one with a steel cable across the driveway. both driveways had iron ore crushed stone and sand from lyon mountain, ny deposited on them to build up the driveways over 20 years ago. both photos and videos were taken with bushnell trophy cam hd max 2013 models. two separate cameras as i had borrowed this one from a friend. both occurred at night. when i first viewed the still photos i thought it was someone with a flashlight looking to jack deer which is common on this road. there is no electric power on this road and just a few hunting camps along the length of the road. the first three still photos numbers 000042, 000043, and 000044 are followed with one minute of video number 000045. included is a video about 30 minutes prior to this event # 000041 and a still photo # 000076 and video # 000077 during the daylight hours the same day. both of these cameras were set up with the sensor lever set at high. do you think there is some kind of defect in these cameras as i have used others and never seen photos like these on other cameras."],"files":["/var/www/straped/mufon/html2text/51698.html.txt","/var/www/straped/mufon/org/51698.html"],"Disposition":"Unresolved","Source":"MUFON","Log Number":"US-10212013-0004","Latitude":"44.608378","trends":["There have been no other sightings in Redford","This sighting has never been favorited."],"City":"Redford"}