{"Weather Factors":"Unknown","Source":"MUFON","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/51692.html.txt","/var/www/straped/mufon/org/51692.html"],"trends":["There have been 14 other sightings in Columbus","There were no other sightings in Columbus on or around October 20th 2013"],"Longitude":"-85.929324","Tags":"City","Sighting Duration":"Undisclosed","Date of the Event":"10/20/2013 09:20 UTC","Object Shape":"Circle, Diamond, Star-like","Region":"Indiana","Viewing Distance":"101-500 Feet","Latitude":"39.149445","Case Number":"51692","divs":["Sighting Detailswhite bright lights somewhat starish shaped they were hovering above our woods the lights appeared to be rotating but could not say for sure because of pulsating they hovered for about 10 minutes then lights seemed to slowly fade the lights seemed to be arranged in a pattern with about four lights making a circle diamond like shape around one in the middle. We got a bit scared and came inside. We have lived on this property for 15 years and never seen lights in that direction. Also of that type ever. The dog curled his posture and tail and is not scared of anything. Attacks animals much bigger than he is . 20 pound Westie. He as was well behaved yet scared. No barking. We had lights out and were outside on upper deck. The odd thing was no sound at all and it stayed just in the high tree line and bit above. There was such bright white lights like a doctor,s lab light brightness. We did not observe it leaving. When my husband came in we told him and he went out with me...it was gone. The night was very quiet. I heard no frogs or normal sounds we usually have in our woods and pond. I usually comment on how loud our land is. No sounds at all. Nothing moving. I am not easily scared but it freaked me out and the kids. I wanted to come in and lock the door."],"Disposition":"Unresolved","Date Submitted":"10/20/2013 11:37 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.149445,+-85.929324(51692)&iwloc=A&hl=en\"> mufon case (51692) map </A>","Country":"United States","Log Number":"US-10202013-0028","Object Features":"Patterned Surface","City":"Columbus","Summary":"diamond arrangment with one in middle very bright white in area never seen lights there in 15 years-"}