{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=44.315838,+-72.745872(51690)&iwloc=A&hl=en\"> mufon case (51690) map </A>","Object Flight Path":"Hovering then path","Latitude":"44.315838","Disposition":"Unresolved","Object Features":"None","Weather Factors":"Unknown","Case Number":"51690","files":["/var/www/straped/mufon/html2text/51690.html.txt","/var/www/straped/mufon/org/51690.html"],"trends":["There has been one other sighting in Moretown","There were no other sightings in Moretown on or around October 19th 2013"],"Longitude":"-72.745872","Region":"Vermont","Country":"United States","Log Number":"US-10202013-0026","City":"Moretown","Tags":"City","divs":["sighting detailsdriving down the end of cobb hill about 200 yards from intersection with route 100 i saw an orange fireball in the sky. had been fireworks earlier but this was a large burst of pulsing orange in the sky. i pilled over on the side of the road (basically just stopped the car in the road) and stared the object down, expecting it to fall, burst, make some noise....something. it just remained in place, about 35 deg. in horizon, a large orange fireball. no strobe. stationary. the light it emitted had to have been several hundred yards across. i tracked it hovering for about 15 seconds while driving, had time to pull over, check it out for a little...then turn the car off...look some more...get out of the car and then think about getting the iphone for a video. i scrambled in the car for the phone. it got much smaller in size and then began to move northeast. i've been searching the skys for decades and reading about pilot, astronaut and civilian sightings for just as long, so i was not surprised when i saw this huge \"exhaust\" like burst or orange..but i was amazed. it was friggin huge and not moving for way longer than any firework. had no strobe, and ended up moving forward\\north and obtaining high altitude before flicking out. this was the real deal. i hope someone else saw it..it was early on a saturday night."],"Object Shape":"Fireball","Date Submitted":"10/20/2013 10:14 UTC","Sighting Duration":"Undisclosed","Date of the Event":"10/19/2013 08:32 UTC","Summary":"Driving down the end of Cobb Hill by route 100 about 35 deg. in Horizon, a large orange fireball. No strobe. Stationary.","Viewing Distance":"Over One Mile"}