{"Source":"MUFON","divs":["Sighting DetailsOn the way home while driving I looked up and thought I saw a blue light pulsating in the sky and thought my eyes may be tricking me. As I kept looking for it, it got brighter and it started to play as if it could tell I noticed it. It started pulsating brighter and hovering back and forth. I took a photo while in the vehicle. I noticed another vehicle pulled over looking up at the object as well so I knew I wasn't seeing things. I pulled over and shot a quick video and then left for the house. It frightened me and I felt as though it knew I was watching it. It was a strange sort of feeling. Before coming to this website to post this information I did some on line searches and found some videos of past sightings in Phoenix, AZ near the same area. These videos can be found on Youtube and some are as far back as 2011. This is a first for me and I am glad I got the video, though the quality is poor since it was from my cell phone. I hope this information is helpful. Thank you and be blessed."],"Sighting Duration":"Undisclosed","Country":"United States","Date of the Event":"10/20/2013 08:15 UTC","Log Number":"US-10202013-0029","Disposition":"Unresolved","Weather Factors":"Unknown","Object Flight Path":"Path then hovering","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/51693.html.txt","/var/www/straped/mufon/more/51693_submitter_file1__BlueLight102013.jpg","/var/www/straped/mufon/org/51693.html"],"trends":["There have been 417 other sightings in Phoenix","There was one other sighting in Phoenix on or around October 20th 2013","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=33.609746,+-112.135151(51693)&iwloc=A&hl=en\"> mufon case (51693) map </A>","Date Submitted":"10/20/2013 11:55 UTC","Region":"Arizona","Latitude":"33.609746","City":"Phoenix","Summary":"Felt like other dementional. Almost like it was observing me.","Object Shape":"Sphere","Longitude":"-112.135151","Case Number":"51693","Object Features":"Unknown","Tags":"City"}