{"map":"<A HREF = \"http://maps.google.com/maps?q=43.786383,+-79.572811(51705)&iwloc=A&hl=en\"> mufon case (51705) map </A>","Country":"Canada","Case Number":"51705","Object Flight Path":"Straight-line path,Path with directional change","Viewing Distance":"Over One Mile","Latitude":"43.786383","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/51705.html.txt","/var/www/straped/mufon/org/51705.html"],"Sighting Duration":"Undisclosed","Source":"MUFON","Object Shape":"Fireball, Star-like","Region":"Ontario","Object Features":"None","Date Submitted":"10/21/2013 01:03 UTC","Tags":"City","Summary":"4 extremely bright orbs travelling in formation","Date of the Event":"10/20/2013 12:00 UTC","trends":["There has been one other sighting in Vaughan","There were no other sightings in Vaughan on or around October 20th 2013"],"City":"Vaughan","divs":["Sighting DetailsI was having a smoke at the above noted address in the driveway facing south. I was watching airplanes flying past going to Toronto Pearson airport, about 15 planes in line of site. Something compelled me to look up and behind me, as though I knew that something would be there. (No strange feeling at all) I just knew something would be there. Immediately I saw these very bright orbs or stars flying past me, from west to east in formation at a slow rate of speed , with one orb maintaining the west to east direction, but also going north to south (zigzaging) always keeping up with the others. It looked like this one orb was going to crash into the others on 3-4 occasions. If they were planes or helicopters, they would have collided with that kind of proximity!!! If these orbs were to be airplanes, I would have been able to tell what airline company they were, they were so close. There was no sound whatsoever. Again, they were so close to me, I would have heard a propellar turning and even more some engine noise. No blinking FAA lights,no body or structure that i could see because they were soooo bright. I have been wanting to see UFO's all of my life, but everything I have ever seen on the internet or in person, I have been able to account as a plane, helicopter or high level government project. Last night was a first for me. They were NOT ours. The objects eventually flew out of site. Thanks for reading my account."],"Longitude":"-79.572811","Disposition":"Unresolved","Log Number":"CA-10212013-0012"}