{"Object Shape":"Bullet, Missile, Circle, Cylinder, Flash, Star-like, Triangle","Region":"New Mexico","Weather Factors":"Unknown","Object Features":"None","Summary":"in 2007, saw 3 triagularcraft at treetop level, near old town. nearly everyday for last 2.5 yrs. was flashed 17x in one sighting.","Disposition":"Unresolved","Source":"MUFON","trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around November 10th 2010"],"Log Number":"US-10212013-0014","map":"<A HREF = \"http://maps.google.com/maps?q=35.056757,+-106.72044(51706)&iwloc=A&hl=en\"> mufon case (51706) map </A>","Case Number":"51706","Latitude":"35.056757","divs":["Sighting DetailsI believe I've been seeing UFOs since childhood, in Santa Fe, NMm. The star The star However, in 2007, I saw three white trianglar craft hovering, silent, for approx 10 min. Then in 2008, I saw in my head, while fully awake, the face of an aliens head, lasted approx 2-6 sec. And has never again occurred. In 2010, I began seeing flashes of light near the star of Orion in November of 2010. It started with on flash, then 17 in one sighting. I would get flashed atleast 2-4x a night, always around 4:40-6 a.m. this has been going for quite sometime. I have moved, worked in different parts of the city, and I feel its followed me. I put myself in a grid-like map, so to speak, and they are always there nearby. I even saw the same lights in Santa Fe this summer, so in a different city, its there. The flashing has lessoned, but not the visual sightings, like a star. They let me see them, then dim out as they make their way through the sky. I would really. Cate .to speak someone. Thank u."],"Tags":"City","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","files":["/var/www/straped/mufon/html2text/51706.html.txt","/var/www/straped/mufon/org/51706.html"],"City":"Albuquerque","Date of the Event":"11/10/2010 05:09 UTC","Longitude":"-106.72044","Date Submitted":"10/21/2013 01:17 UTC","Viewing Distance":"Unknown","Country":"United States"}