{"files":["/var/www/straped/mufon/html2text/51717.html.txt","/var/www/straped/mufon/org/51717.html"],"Tags":"City","Log Number":"US-10212013-0024","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.546174,+-112.459832(51717)&iwloc=A&hl=en\"> mufon case (51717) map </A>","divs":["Sighting DetailsOn Sat morning me and my wife saw another strange thing in the sunny clear sky. We were on our way to Prescott AZ to meet some kids at 8:00 am 10.19.13. We got off from I- 40 and went south on Hwy 89. Halfway to Prescott in some hilly area and covered with small trees. I had noticed a white disc object on the N. side of Granite Mt in the distance. It looked like some smoke that was coming out of the Mountain. Granite Mt still looked the same with rocks, it was light tan. I also noticed that there was some flat areas in the valley, but to me it could have been gray smoke. I kept staring at the haze and Mts in the distance as we went around turns and up and down hills. I then remembered that there are no mesa tops in Prescott and told Terrie to look at what I am seeing. She confirmed that they are flat mesa's with protruding tops. We saw two big ones and one small one very clear and square in the distance. It also looked like some pointed poles below the tops, which were very pointed at each end. They were all one med gray color and very large. There was no shadows or land layers to see. As we drive about 67 mph, we see the left side of the middle mesa start to distort and change. The white disc is now vanished some how and the left areas are distorting and some things can be seen moving. We lost view from trees and rock hill. When we came out, we saw Granite Mt some other hills and Mts in the valley. They had different shades of color and looked normal in the distance. They looked much smaller now with depth. There is No white disc, No mesa's and No pointed poles any where to be seen."],"Object Features":"None","Weather Factors":"Unknown","Source":"MUFON","Object Shape":"Disc","Region":"Arizona","City":"Prescott","Latitude":"34.546174","Longitude":"-112.459832","Date Submitted":"10/21/2013 05:14 UTC","Date of the Event":"10/19/2013 07:27 UTC","Summary":"Driving S. on Hwy 89 noticed white disc and portal to alien base","Case Number":"51717","Object Flight Path":"Stationary","Disposition":"Unresolved","trends":["There have been 25 other sightings in Prescott","There were no other sightings in Prescott on or around October 19th 2013"],"Country":"United States"}