{"Latitude":"44.160481","Region":"Wisconsin","Country":"United States","Object Features":"Unknown","Longitude":"-87.576881","Date of the Event":"10/21/2013 07:45 UTC","Date Submitted":"10/21/2013 10:09 UTC","files":["/var/www/straped/mufon/html2text/51723.html.txt","/var/www/straped/mufon/org/51723.html"],"trends":["There has been one other sighting in Two Rivers","There were no other sightings in Two Rivers on or around October 21st 2013"],"Sighting Duration":"Undisclosed","Source":"MUFON","City":"Two Rivers","Disposition":"Unresolved","divs":["sighting detailsfueled truck returning home 7:45pm heading in a easterly direction. observed 3 bright objects that appeared to be over lake michigan. objects appeared to be in tight formation. weather was overcast and dark. overcast ceiling approximate 1500ft +-. objects had a bright strawberry color. i than observed a fourth object which appeared to be hoovering along the lake shore moving very slowly in a se direction separate from the original 3 objects. extremely bright strawberry color. no navigation lights observed. pulled over turned truck off and opened window. no sound heard, unusual i thought i'd hear something being so close estimating 1\\2 mile or closer. arrived home entered yard observed the first 3 object climbed what i think was a vertical direction very quickly losing sight. lost visibility of the 4th object in the tree lines and neighbors roof. after going inside i went directly onto computer and checked the live radar for my area and saw no aircraft in the vicinity of my city. i've never seen aircraft with such a odd color, i'm 50 and grew up next to uscg air group. i also served in the usmc and never observed such a bright strange strawberry light. max time from entering house to reviewing radar perhaps 1 to 1 1\\2 minutes."],"Viewing Distance":"Over 1 Mile, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.160481,+-87.576881(51723)&iwloc=A&hl=en\"> mufon case (51723) map </A>","Summary":"Larger bright lights.","Weather Factors":"Unknown","Object Shape":"Unknown","Log Number":"US-10212013-0029","Object Flight Path":"Hovering then path","Tags":"City","Case Number":"51723"}