{"Date Submitted":"10/22/2013 01:03 UTC","Source":"MUFON","Log Number":"US-10222013-0004","Weather Factors":"Unknown","Case Number":"51729","Longitude":"-104.973627","Latitude":"39.855066","Sighting Duration":"Undisclosed","City":"Thornton","Object Shape":"Circle","Object Features":"None","Date of the Event":"10/21/2013 09:15 UTC","Summary":"2 objects floating NW to NE - one at 30 degrees above us and one at horizon moving simultaneously for 8 mins then disappeared","Object Flight Path":"Straight-line path","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.855066,+-104.973627(51729)&iwloc=A&hl=en\"> mufon case (51729) map </A>","trends":["There have been 7 other sightings in Thornton","There were no other sightings in Thornton on or around October 21st 2013"],"divs":["sighting detailson 10\\21\\13, 9:15 pm i let my dogs outside in our backyard and i went out to have a cigarette. as i was standing looking at the ne sky, out of the corner of my eye, to the west, i noticed something bright orange in the sky. i turned to look and saw a bright orange circle at about 30 degree in the sky to the nw. i initially thought it was a shooting star, but then i noticed a 2nd one in the sky, further north and lower on the horizon. the objects were moving simultaneously in the sky to the ne. neither object had a trial like a shooting star. that's what really caught my attention. they were moving slowly across the sky. i stepped further out into the yard to get a clearer look. both objects were floating east across the sky. no blinking lights. each appeared to have a red\\orange glow around them, but bright orange in the middle. i ran to the door and called my husband to come look at them. he ran outside and we stood there watching them float across the for 6 mins. my husband took a picture with his cell phone of one object. i ran inside to get my cell phone and the binoculars. i was gone maybe 30 seconds. i gave my husband the binoculars, as he lifted them up to get a better view, both objects were gone. the light on both objects slowly went out and they disappeared. they didn't appear to fly off, they were just gone. from my backyard to where the closest one was in the sky, if i held a 200 mg ibuprofen next to it, they would have been about the same size. once the encounter was over, we just stood there staring at each other to try and rationalize what we had just seen. there was no other explanation as to what they were, clearly they were ufos."],"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/51729.html.txt","/var/www/straped/mufon/org/51729.html"],"Region":"Colorado","Viewing Distance":"Over One Mile","Tags":"City"}