{"City":"Albuquerque","Object Shape":"Triangle","Viewing Distance":"Over One Mile","Tags":"City","Date of the Event":"10/05/2013 08:36 UTC","Date Submitted":"10/22/2013 12:06 UTC","Object Features":"None","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/51739.html.txt","/var/www/straped/mufon/org/51739.html"],"Region":"New Mexico","map":"<A HREF = \"http://maps.google.com/maps?q=35.136566,+-106.492159(51739)&iwloc=A&hl=en\"> mufon case (51739) map </A>","Source":"MUFON","Summary":"10-05-13 lights in a triangle shape captured during mornign launch 2013 ABQ Intl Balloon Fiesta","Longitude":"-106.492159","Latitude":"35.136566","Weather Factors":"Unknown","Case Number":"51739","Object Flight Path":"Stationary","Log Number":"US-10222013-0014","Disposition":"Unresolved","divs":["sighting detailsthis is my first time doing this, so i would like to apologize if the information included is not the right format. i had went up to my rooftop the morning of 10\\05\\13 to actually see if i could film a ufo over the 2013 abq balloon fiesta. i had thought about this for a few weeks prior to this day, and figured that there will be lots of people, lots of balloons, and it seems this type of phenomenon occurs when large gatherings happen. so i set-up my kodak m530 (i think) digital camera about 7:30am on my rooftop and began digitally filming the morning launch. i began filming for about hour and then my battery began to run low. i stopped the videotaping and then click about seven pictures to see if i could get some more battery time. i clicked about six pictures. attached are three that have the anomoly. i hadn't review these until yesterday evening. i also have not fully reviewed the video filming files (two mornings), but will now, and these are available to be sent to your team, if requested. i don't have any \"filtering\" knowledge to do that on these pictures, so you see what i do. the series of pictures i've included here are between the times of 08h:35m:48sam and 08h:36m:41sam. the first picture does not look to have anything visible, even when zoomed in. the next first pics is the original with a second copy of the are to look at. the 2nd set are copies of the first one, but enhanced a bit to see if i could see it better. the third set is an original picture and then a copy with the area circled to look at."],"Country":"United States","trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around October 5th 2013"]}