{"City":"Milton","Source":"MUFON","Country":"United States","Tags":"City","divs":["Sighting Details In 1979 I was a police officer in the metro Boston Mass. area. Late summer that year I was on morning patrol from 23:30 hrs (11:30 pm) to 07:30 hrs (am)with a partner. Around 3 am we decided to take a rest stop and I got a coffee and we went to a wooded parking area closed to the public at night and parked. I drank my coffee and listened to the radio while he took a nap in the back seat for a hour. After 20 minutes I was looking towards the scenic overlook into the night lights of Boston about four miles away. Between Boston and I was the town of Milton and Quincy below the overlook. I noticed in the area that was defined by trees on each side 200 feet apart a strange shape which seemed see through with blinking colors coming from the right side a cone shaped object appearing at 300 to 500 feet off the ground which put it straight in from to my eyes 300 feet away. The edge of the object had a sharp edge line between the sky and what appeared to be an containing within it entire surface was as if you were looking through water with thousands of small various color twinkling lights. It had the effect of blending it in with the background of the city and house lights as well as the stars in the sky. The only reason I noticed it at first and as it went by was the sharp difference between the objects surface and the actual background. it continued westward at a rate of 5 mph. I tried my speed gun on it but got no responce. It was approx. 500 feet long or more with a height of 100 feet or more at its widest point. It resembled a blimp without the engine or control tower. It contiued past me in about four to five minutes and out of sight westward. I sat there and was stunned. About five minutes later it came from the left side (west to east) at the same hight and speed. I woke up my partner this time and he refused to admit he was seeing it then became angry about now saying he sees it but don't tell anyone about it. I tried then to bounce my spot light off it with no responce back from it or any reflection or illuminating any area. Then tried my blue and red lights on and off to see if it would react but nothing. It continued out over Quincy and out to sea. I called Logan Airport Boston after a chuckle they said they had noting on radar. My partner transfered out of this district to the other side 30 miles away the next day and would never ever speak of the incident again."],"Weather Factors":"Unknown","Log Number":"US-10222013-0007","Object Features":"Other","Case Number":"51732","Object Shape":"Blimp, Cylinder","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Date of the Event":"08/14/1979 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.249532,+-71.066165(51732)&iwloc=A&hl=en\"> mufon case (51732) map </A>","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Summary":"had sharp outline with translucent/underwater like with mulitiple small lights","files":["/var/www/straped/mufon/html2text/51732.html.txt","/var/www/straped/mufon/org/51732.html"],"trends":["There have been 2 other sightings in Milton","There were no other sightings in Milton on or around August 14th 1979"],"Longitude":"-71.066165","Region":"Massachusetts","Date Submitted":"10/22/2013 04:28 UTC","Latitude":"42.249532"}