{"Region":"Washington","Case Number":"51734","divs":["Sighting DetailsI was getting ready for bed when I realized this loud but subtle sound outside. At first I thought it was a train, but then I realized that a train would not be here at 1:30 in the morning. It was a very powerful, rumbling, low, deep tone that I heard. I became interested and wanted to check outside to see what was really making the noise. The area is very foggy with low cloud cover, and has been like this for a few days. I instantly noticed the UFO over the water, right above Titlow Park. It was about level with the horizon, maybe 100-300ft above the ground. I was very amazed to see it because the three lights in the shape of a triangle were very bright. They were white lights, and I was surprised that they were so easily visible. I stared out my window, shocked and excited and scared. This UfO moved from left to right very slowly over a period of ten minutes. From West to North West overall. At first it moved some, then paused for a minute, then it continued it's path. At certain times it would fade into the background because of the fog, but I could still see it, and wanted to see it for as long as it was visible. The triangle shape was not flat, but rather perpendicular to the ground, so that I could see all three lights clearly in a perfect triangle shape. This scared me because it made it seem as if the UFO was watching me during its whole flight path. There were no planes, helicopters or anything nearby. It was very early in the morning after all. The UFO eventually moved toward North West and reached a certain point where I could no longer see it from my window, so I let the whole thing go and no longer pursued it. I could still faintly hear the humming, pulsating noise even after it was out of my view. Since I was somewhat close to it, I'm sure other people could hear the noise even better if they were a few hundred feet closer. The UFO really wasn't that far away from me. I feel so surprised and scared to see this UFO, for I have heard the sound that it makes many times before. I use to think that it was just a train going by, since the train tracks are about one mile from where I am. It scares me to know that it was something much more than a train, and that it was really a UFO making these noises. There was a time, about a week ago when I woke up around 3AM and heard those same noises, but much louder as if they were right outside my window. The sound from the UFO is really one-of-a-kind and I have not heard anything else quiet like it."],"Date of the Event":"10/22/2013 01:40 UTC","City":"Phoenix","Summary":"Was making loud noise, like rumbling, humming. I looked outside and saw it hovering at first. It had very bright white lights in the shape of triangle.","Object Features":"None","Object Flight Path":"Straight-line path,Path then hovering","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Latitude":"33.493613","Object Shape":"Triangle","Source":"MUFON","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.493613,+-112.041084(51734)&iwloc=A&hl=en\"> mufon case (51734) map </A>","Country":"United States","Log Number":"US-10222013-0009","Date Submitted":"10/22/2013 05:34 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/51734.html.txt","/var/www/straped/mufon/org/51734.html"],"Longitude":"-112.041084","trends":["There have been no other sightings in Phoenix","This sighting has never been favorited."],"Disposition":"Unresolved"}