{"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.503335,+-112.026611(51748)&iwloc=A&hl=en\"> mufon case (51748) map </A>","Object Flight Path":"Straight-line path","Country":"United States","divs":["Sighting DetailsStepped outside around 10:30 PM MST to smoke. Standing on my porch, which faces West, I suddenly noticed an orange sphere about 30 degrees in the western sky. I am not sure if it just appeared or I saw it as it was already traveling East over my house. I quickly reached into my pocket for my cell phone (Samsung 3 mega pixel) while observing object. It did not seem to be moving fast and I was able to get 1 photo. I then looked down at my phone in an attempt to put it in video mode but when I looked back up, it was gone. The duration was only about 20-30 seconds from 30 degrees in the sky when I first noticed it, to about 90 degrees when I looked back up to video tape it. I dont think it could have passed over the top of my house by the time I looked back up for it and did not see it on the West side of my home. I am a MUFON FI here in UT and just want to report this sighting in case there are any other similar sightings in the area. The picture does not in any way look as bright or big as I viewed it in person and is certainly not impressive but as skeptical as I am, it got my attention. It could have been a lantern although in the 40 years I have been in this small city, I have not observed this before."],"files":["/var/www/straped/mufon/html2text/51748.html.txt","/var/www/straped/mufon/org/51748.html"],"Log Number":"US-10222013-0023","Date Submitted":"10/22/2013 07:47 UTC","Object Features":"None","Sighting Duration":"Undisclosed","Longitude":"-112.026611","Source":"MUFON","Latitude":"41.503335","Tags":"City","Date of the Event":"10/20/2013 10:30 UTC","Summary":"Observed orange glowing light from West heading East over my house.","City":"Brigham City","Viewing Distance":"Unknown","Disposition":"Unresolved","Object Shape":"Sphere","trends":["There have been 2 other sightings in Brigham City","There were no other sightings in Brigham City on or around October 20th 2013"],"Region":"Utah","Case Number":"51748"}