{"Disposition":"Unresolved","Latitude":"40.27654","Country":"United States","Source":"MUFON","Weather Factors":"Unknown","City":"Harrisburg","Viewing Distance":"Unknown","Date of the Event":"10/22/2013 07:30 UTC","Object Features":"None","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/51749.html.txt","/var/www/straped/mufon/org/51749.html"],"divs":["sighting detailsi went outside to let the dogs in because they were barking at about 7:25. we live in relative rural area so the sky\\stars are bright. i noticed movement to my north, saw a sort of transparent chevron shape blocking out stars. if i held up my hand, it would have covered most of it. after looking for a while, i could see 3 white lights with an orange\\red light in the center. the orange\\red was sort of flame looking, sort of like a rocket look but also like a beam and there was no sound. i ran inside to get my camera and telephone to call others to see if they saw it. by the time i came outside again, it looked like it was up high over harrisburg city, pa. at least, five other people were called and went outside their homes from various areas and saw the object. the object slowly descended into the south west horizon at which time i lost sight of it. we do live near an army reserve base, indiantown gap and i believe it came from that direction. i think i saw planes around it and just heard a jet go over right now at 8:10 p.m. which is odd because they never fly this late. very glad others saw it also, otherwise i would second guess myself."],"trends":["There have been 26 other sightings in Harrisburg","There were no other sightings in Harrisburg on or around October 22nd 2013"],"Object Flight Path":"Hovering then path","Case Number":"51749","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.27654,+-76.875218(51749)&iwloc=A&hl=en\"> mufon case (51749) map </A>","Object Shape":"Chevron","Date Submitted":"10/22/2013 08:17 UTC","Longitude":"-76.875218","Summary":"Chervon with bright white lights, glowing and orange/red center light.","Region":"Pennsylvania","Log Number":"US-10222013-0024"}