{"Region":"Ontario","divs":["Sighting DetailsI am a pilot with my own aircraft and have followed aviation since a young age. I know most aircraft as seen from a distance day or night. Two of us were sitting in the back yard facing N. towards Toronto Int. Airport. I stood up to stretch and notices a bright yellow light high and to my left which at first I thought was an engine fire on a jet at about 15,000 ft. It was descending towards us and as it got lower it seemed ball like and the yellow flickered to orange. The solid orange colour then flickered deep red and then solid red. It then turned left about 30 degrees and levelled off at about 3000 ft. passing in front of us left to right. As it passed to our right it turned left again 30 degrees and started to climb faster. As it rose in the sky the red flickered to orange, then solid orange which flickered to the original yellow colour. As it gained speed it turned to white like the look of Jupiter and then clearly sped off at a speed which I could not even believe. This first orb took about 1 min. When it left the two of us started to talk in somewhat a shocked fashion. 10 sec. after this sighting in came the second one fallowing the exact same path with one change. The last turn before climbing out was about 2 miles sooner than the first. This one turning to climb somewhat in line with the airport. The third orb started 10 sec. after the second, followed the exact same sequence of the first 2 and again the final turn to climb was 2 miles before the second orb. All of the craft made no noise, descended, made 2 turns and climbed in the same manner. They were identical in their colour appearance changing from yellow to orange to red, flew level and reversed colour change as they climbed. The size was of a golf ball at arms length. The flight path was intelligent, highly accurate, and repeated 3 times. I had a clear sense that there was a craft and it was shrouded by this vapour which was a reaction to our atmosphere thus the colour change as it moved through the thicker or thinner air. The odd part about this time was as I stood up at the beginning of this event I was about to say I had not seen or heard a departing jet for 10 min. That is unusual for the area we can see is the normal departure end of the active runway at a very busy airport with 2 min. spacing for departures."],"trends":["There have been 7 other sightings in Oakville","There were no other sightings in Oakville on or around August 1st 2013"],"Tags":"City","Sighting Duration":"Undisclosed","Longitude":"-79.725737","Latitude":"43.433306","Date of the Event":"08/01/2013 09:50 UTC","Log Number":"CA-10222013-0019","Summary":"3 round orbs each followed same flight path 10 sec. apart following same path with 2 changes in direction decending them ascending","files":["/var/www/straped/mufon/html2text/51744.html.txt","/var/www/straped/mufon/org/51744.html"],"City":"Oakville","Object Shape":"Sphere","Case Number":"51744","Date Submitted":"10/22/2013 04:03 UTC","Disposition":"Unresolved","Country":"Canada","Source":"MUFON","Object Features":"None","Object Flight Path":"Path with directional change","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=43.433306,+-79.725737(51744)&iwloc=A&hl=en\"> mufon case (51744) map </A>","Weather Factors":"Unknown"}