{"Date Submitted":"10/22/2013 04:02 UTC","Region":"England","trends":["There have been 2 other sightings in Taunton","There were no other sightings in Taunton on or around January 1st 2013"],"Tags":"City","Date of the Event":"01/01/2013 02:01 UTC","divs":["Sighting DetailsI noticed it about 3yrs ago at night in the sky, it looked like a planet,then it was moving slowly to the left and right, then moving towards me. it was about maybe a mile away,then it became lower to the ground, maybe 200 feet.than came with in 500 feet from our house, (note we live in the country. with about 10 miles view.)it then had a beam of light in a down ward movement.it was hoovering for some time. I saw this a number of times. I told my wife who had been a sleep. she did not believe me, but 1 night I woke her up, and there it was, she has now seen it a lot.Now we wake up to a bright light at night,(our curtains are never draw)my says then, feels ill following day, we have had red patches on our faces, anything to due with bright light we dont know. and have seen it disappearing away. we have stayed with binoculars, just as we point the binoculars on it, it shoots off, the same with a camera.Next last winter on my normal walk, this it had been deep snow,when I got to the Elec lines, in the snow were straight lines about 100 feet long and 2\" deep, and no foot prints at all, the snow was a foot deep, I had my camera, took 2 phots and the batteries went flat.it was like something had landed and used the Elec. Reason no date its still on going."],"Latitude":"51.017774","Longitude":"-3.099009","Case Number":"51743","City":"Taunton","Country":"United Kingdom","Log Number":"GB-10222013-0018","Object Features":"Dome","Source":"MUFON","Object Shape":"Cone, Circle, Disc","Sighting Duration":"01:01:01","Summary":"like a planet, then moving and descenting with a beam of light, when its close and I wish to view it, it move away fast and is still there","Object Flight Path":"Stationary,Hovering then path","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=51.017774,+-3.099009(51743)&iwloc=A&hl=en\"> mufon case (51743) map </A>","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/51743.html.txt","/var/www/straped/mufon/org/51743.html"]}