{"Latitude":"29.956396","Object Shape":"Disc","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-90.067592","divs":["Sighting DetailsAround 7:40 p.m. Sunday Oct. 20, 2013, I noticed a blurry light directly overhead in the sky. At first I thought it might be a plane, but it wasn't shaped right. It was a faint disc, light orange in color. Much smaller than the moon, but much bigger than a star or a planet. Didn't move much, but after a few minutes, it drifted south, then southwest, and finally went out of sight on the horizon due west of me. I could only see it for four or five minutes. My guess is it was a balloon due to the drifting nature of its movements. And it's probably a low altitude object but gave off no motor sounds. It could have been emitting a faint light or more likely reflecting some other light source. However, it glowed, glimmered, shimmered, and appeared to smolder. It could also have been a searchlight, but I did not see the shaft of light usually visible leading from ground up to the disc of light characteristic of a searchlight. And the disc had that smoldering quality. I came to notice this because I had been outside a few minutes earlier and saw the bright lights of an apparent big jet plane far away on the horizon. So when I stepped out later a glanced up quickly to see if the plane was passing nearby. There was no plane, but I did see the strange disc of light at the zenith. My first impression was that a plane was on fire, but quickly realized it was not a plane and there was no fire, just that glimmering, smoldering look. After possibly vacillating a little directly overhead, the disk moved south fairly rapidly then circled around to the west and went out of sight over the horizon due west of me. The light was coming through some thin clouds when I first saw it, but retained its general appearance when it moved whether above clouds or in clear sky."],"trends":["There have been 26 other sightings in New Orleans","There were no other sightings in New Orleans on or around October 20th 2013"],"Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=29.956396,+-90.067592(51745)&iwloc=A&hl=en\"> mufon case (51745) map </A>","Region":"Louisiana","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/51745.html.txt","/var/www/straped/mufon/org/51745.html"],"Country":"United States","Summary":"glowing, shimmering disc of light 7:40 p.m. 10-20-13.","Sighting Duration":"00:05:00","Tags":"City","Date of the Event":"10/20/2013 07:40 UTC","Object Flight Path":"Stationary,Hovering then path,Path with directional change","City":"New Orleans","Date Submitted":"10/22/2013 06:59 UTC","Weather Factors":"Unknown","Log Number":"US-10222013-0020","Case Number":"51745"}