{"Date Submitted":"10/23/2013 12:58 UTC","Longitude":"-122.13856","Viewing Distance":"501 Feet - 1 Mile","Case Number":"51756","Log Number":"US-10232013-0001","Source":"MUFON","Date of the Event":"10/22/2013 08:31 UTC","Latitude":"37.444133","Summary":"Spinning, Multi-colored Flashing lights, zig zagging then disappearing into sky behind hills","Region":"California","Object Features":"Unknown","divs":["Sighting DetailsDriving home in dark on Hwy 280 going northbound in Palo Alto, CA after the Alpine Rd. exit. Saw spinning, multi-colored flashing lights, zig zagging then disappearing into sky behind hills. At first thought it was police car driving with lights flashing high up on a windy hill within view. Then it started spinning with rainbow colors, and we noticed it was up in the sky. Went from red-blue-white-purple-turquoise-yellow-orange-red. We were shocked and wondered if perhaps the lights were LED's because they were so bright. We have seen several UFO's but nothing this spectacular. We watched it for about 2 minutes. I was driving at the time, so I had to look away, but my boyfriend was able to capture a cellphone video of it for only a split second before it disappeared. We got home and searched \"rainbow ufo\" and found many similar videos to what we saw on Youtube. I am trying to email the video to myself right now, it is taking too long to load. If anyone is interested we can send it."],"map":"<A HREF = \"http://maps.google.com/maps?q=37.444133,+-122.13856(51756)&iwloc=A&hl=en\"> mufon case (51756) map </A>","Object Shape":"Circle, Disc, Flash","City":"Palo Alto","Object Flight Path":"Path with directional change","Tags":"City","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","trends":["There have been 4 other sightings in Palo Alto","There were no other sightings in Palo Alto on or around October 22nd 2013"],"files":["/var/www/straped/mufon/html2text/51756.html.txt","/var/www/straped/mufon/org/51756.html"],"Disposition":"Unresolved","Country":"United States"}