{"Weather Factors":"Unknown","divs":["Sighting DetailsMy wife was driving to work heading south in the Wenatchee Valley. She looked up and saw a large, yellow, oval-shaped object which she described as \"appearing to be on fire.\" She stated that the object was the size of a penny and was completely stationary. No sounds could be heard. The sky was completely cloudless and the sun was just beginning to rise. When she looked away for just a few seconds and turned back to look at the object, it had disappeared. At this point she texted me to tell me what she had seen. I called her and asked her to tell me details of what she had just seen as I was heading out to take my daughter to school. Suddenly, my daughter and I both saw an object just above the hills in East Wenatchee. My wife, who was on the phone with me, also saw the object, At this point, the object appeared white but definitely oval-like and about the size of a golf ball. If it was indeed the same object that she had seen just moments before, then it would'v had to travel at a remarkable speed to move such a distance. Also, we noticed that two jets flying very high were heading toward the object."],"trends":["There have been 4 other sightings in Wenatchee","There was one other sighting in Wenatchee on or around October 22nd 2013"],"Summary":"My wife saw a glowing oval-shaped \"fireball\" in the sky. It appeared totally stationary and was quite large. She watched it as she was driving and looked away to look at the road. When she looked back it was gone and reappeared in the east.","Case Number":"51752","files":["/var/www/straped/mufon/html2text/51752.html.txt","/var/www/straped/mufon/org/51752.html"],"Object Shape":"Fireball, Oval","Longitude":"-120.309199","map":"<A HREF = \"http://maps.google.com/maps?q=47.43186,+-120.309199(51752)&iwloc=A&hl=en\"> mufon case (51752) map </A>","Country":"United States","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Tags":"City","Date of the Event":"10/22/2013 07:30 UTC","Object Flight Path":"Stationary","Date Submitted":"10/22/2013 09:33 UTC","City":"Wenatchee","Source":"MUFON","Object Features":"Unknown","Latitude":"47.43186","Disposition":"Unresolved","Region":"Washington","Log Number":"US-10222013-0027"}