{"Viewing Distance":"Unknown","Tags":"City","Weather Factors":"Unknown","Longitude":"-94.122106","Source":"MUFON","Date of the Event":"10/21/2013 10:40 UTC","Object Shape":"Triangle","Summary":"Triangle silhouette shape traveling in a circular motion but not in the same circular pattern.","Disposition":"Unresolved","Country":"United States","Latitude":"30.090144","files":["/var/www/straped/mufon/html2text/51762.html.txt","/var/www/straped/mufon/org/51762.html"],"trends":["There have been 12 other sightings in Beaumont","There were no other sightings in Beaumont on or around October 21st 2013"],"Sighting Duration":"Undisclosed","Region":"Texas","Object Flight Path":"Path with directional change","City":"Beaumont","divs":["Sighting DetailsI was getting off work about 10:40 pm. I always look around when I leave work because I work Dispatch at a stadium and it's dark , and I have to walk to my car. I looked up and saw a triangle shaped light in the clouds. At first I thought it was some type of light for an airplane. But as I continued to watch it , I could see that it wasn't that at all. The triangle shape was almost glowing. I watched it for about 5 minutes. I then called another coworker to come outside and see it. We watched it for about another minute. Neither of us could explain it. I then got in my car and headed home and called a friend on the way, to tell him of the incident. Before I could really get my story out, he started telling me exactly what I had seen. He told me he was putting out the trash and saw the same object in the sky. It was scary, but exciting in the same. I have never witnessed anything like this in my life. Almost to afraid to tell anyone, didn't want them to think I was crazy... Tried to video it , but the video is was much to dark."],"map":"<A HREF = \"http://maps.google.com/maps?q=30.090144,+-94.122106(51762)&iwloc=A&hl=en\"> mufon case (51762) map </A>","Case Number":"51762","Date Submitted":"10/23/2013 02:51 UTC","Log Number":"US-10232013-0007","Object Features":"None"}