{"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Case Number":"51764","Longitude":"138.603099","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=-34.920121,+138.603099(51764)&iwloc=A&hl=en\"> mufon case (51764) map </A>","Country":"Australia","Object Features":"Dome, Window(s), Appendage(s)","Viewing Distance":"Unknown","Date Submitted":"10/23/2013 05:29 UTC","Object Shape":"Oval","Log Number":"AU-10232013-0009","Source":"MUFON","Disposition":"Unresolved","Date of the Event":"10/19/2013 12:00 UTC","Summary":"Took photos of moon - 3 photos taken split second increments - discovered UFO when reviewing photos - object 3 positions of moon 1 o'clock, 10 o'clock, 7 o'clock","Region":"South Australia","Latitude":"-34.920121","City":"Adelaide","files":["/var/www/straped/mufon/html2text/51764.html.txt","/var/www/straped/mufon/org/51764.html"],"trends":["There have been 15 other sightings in Adelaide","There were no other sightings in Adelaide on or around October 19th 2013"],"divs":["sighting detailsi took 3 photos of moon in the north eastern sky at approximately 11pm saturday 19\\10\\13 in southern suburb of south australia. when reviewing photos 15 minutes later i detected object firstly at 1o'clock if moon, then 10 o'clock, then 7 o'clock. that was when i knew i had captured a ufo. as photos were taken split seconds apart i could see that the ufo had changed direction from east to north east to south west of the moon. when zooming in on pic i could see a saucer shaped object with lights on the underside and what appeared to be 2 windows under a dome top. i later checked a previous photo taken of the penumbral lunar eclipse taken at same position a year earlier 25\\11\\12 at 11.25pm and was surprised to see a ufo with same saucer shape a larger distance under the moon. i checked the scene in daylight for any obstructions or lights that may have been misconstrued as ufo but the position photographed previous night 19\\10\\13 was clear of any obstructions. there was just a clear view if the sky."],"Object Flight Path":"Path with directional change"}