{"Longitude":"-75.004708","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=39.765657,+-75.004708(51769)&iwloc=A&hl=en\"> mufon case (51769) map </A>","Tags":"City","Sighting Duration":"00:10:00","Log Number":"US-10232013-0009","trends":["There have been 8 other sightings in Gloucester Township","There was one other sighting in Gloucester Township on or around October 14th 2013","This sighting has been favorited 3 times.",""],"Object Shape":"Unknown","Case Number":"51769","Country":"United States","Object Flight Path":"Stationary,Hovering then path","Disposition":"Unresolved","Summary":"Parachute like objects that seemed to hover and descend. the objects glowed and twinkled many colors.","Date Submitted":"10/23/2013 12:46 UTC","Weather Factors":"Unknown","Source":"MUFON","City":"Gloucester Township","Region":"New Jersey","divs":["Sighting Details I was driving on Sicklerville Road about a mile from my home just past dusk. A bright star caught my attention and I looked up. But then i noticed something else. It looked like a somewhat brightly colored parachute that also twinkled with all sorts of colors. And it hovered and descended just like a parachute. It was very intriguing. I couldn't take my eyes off it. But then I noticed another object to the right. I would have to say that they were identical and they both were hovering and descending at the same rate. I thought about stopping the car to take a few pictures, but I'm sure the pictures would just show a couple dots of light. Because they seemed to be very far away and my phone camera is not what you would call state of the art. So I drove on and soon they were behind me as the road turned. But I haven't stop thinking about what I had just saw. So I found your website and decided to report it. I'm sure I'm not the only one to lay eyes on these objects, whatever they may be, and I bet there are a lot of other folks out there wondering about them."],"files":["/var/www/straped/mufon/html2text/51769.html.txt","/var/www/straped/mufon/more/51769_submitter_file1__img001.jpg","/var/www/straped/mufon/org/51769.html"],"Date of the Event":"10/14/2013 06:45 UTC","Object Features":"Dome","Latitude":"39.765657"}