{"Tags":"City","trends":["There have been 9 other sightings in Barrie","There were no other sightings in Barrie on or around October 22nd 2013"],"Weather Factors":"Unknown","Object Features":"None","Disposition":"Unresolved","Summary":"UFO ABDUCTION, OR OBSERVATION ???","Case Number":"51772","Sighting Duration":"Undisclosed","City":"Barrie","map":"<A HREF = \"http://maps.google.com/maps?q=44.38131,+-79.724532(51772)&iwloc=A&hl=en\"> mufon case (51772) map </A>","Object Shape":"Disc, Flash, Star-like","Log Number":"CA-10232013-0011","Country":"Canada","Region":"Ontario","divs":["Sighting DetailsIt was about 2 am i just got my self settled in bed, my girl friend like always, passed out while we watched a late night movie. as i finished brushing my teeth and turning off the lights, i made sure the blinds where closed in case we decided to sleep later then normal. i noticed the sky wasn't as cloudy as it was during the day and that the crappy weather we had the day before is finally gone, but what really struck me was how bright this one star looked as i gazed up in the subdivision complex night sky threw the window i noticed the star seemed to becoming closer doping threw the stay as if a falling star was shooting down and then that's when i noticed, that what i was looking at seemed to be a craft of some sort and not a craft after all the craft hovered over the houses sitting in the complexes occasionally stopping, flashing a light of some soft changing in color and continuing to hover over to the next house. at this point i freaked out rushed over to the room and tryed to wake my girl friend up she got up and walked over to the window but as soon as she looked over the craft flashed its light and zipped bcak into space where i quickly ran out side and lost view of it."],"Viewing Distance":"20 Feet or Less","Object Flight Path":"Path with directional change,Path then hovering","Latitude":"44.38131","Date Submitted":"10/23/2013 07:51 UTC","Date of the Event":"10/22/2013 02:48 UTC","files":["/var/www/straped/mufon/html2text/51772.html.txt","/var/www/straped/mufon/org/51772.html"],"Source":"MUFON","Longitude":"-79.724532"}