{"files":["/var/www/straped/mufon/html2text/51779.html.txt","/var/www/straped/mufon/org/51779.html"],"Latitude":"30.001891","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-10232013-0018","City":"Humble","Object Shape":"Circle, Fireball, Sphere, Star-like","Case Number":"51779","Sighting Duration":"Undisclosed","Object Features":"None, Unknown","Source":"MUFON","trends":["There have been 7 other sightings in Humble","There were no other sightings in Humble on or around October 23rd 2013"],"Country":"United States","divs":["Sighting DetailsI was on my way home from work, on the north east side of Beltway 8 going towards Highway 59. I live in Kingwood, TX which is north east of Houston, TX about 26 miles. I was traveling along the road with several other cars around me, when I saw about 20 flying objects all flying very low, about highway streetlight level. The objects appeared to be hovering, but then started moving very slowly towards the south east. I started slowing down and noticed all the cars around me were also doing the same thing. It appeared that everyone was trying to take a closer look at what these objects were. I did not stop but kept traveling west until I passed under these objects. I did not hear or feel anything, but was a bit scared. I was listening to music off my iPhone when all a sudden, as I was passing under these objects, my music and iPhone appeared to stop working and after I went past the objects they both came on again. This freaked me out and I immediately called my parents to let them know what I had just seen. I have never in my life ever seen anything like a UFO and this event caught me totally by surprise. I hope someone else reports this so that I can confirm that it wasn't just my imagination. Sincerely, (I wish to remain anonymous.)"],"Summary":"On my way home from work,on busy highway with other cars.","Date of the Event":"10/23/2013 08:20 UTC","Region":"Texas","Date Submitted":"10/23/2013 10:20 UTC","Tags":"City","Object Flight Path":"Hovering then path,Straight-line path","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.001891,+-95.257165(51779)&iwloc=A&hl=en\"> mufon case (51779) map </A>","Longitude":"-95.257165","Disposition":"Unresolved"}