{"divs":["Sighting DetailsI moved into our apartment in July 1 2013 on the 8th floor facing the Ottawa river to the north of the building. As soon as the sun set we noticed this flashing light appear in the high sky on our very first night. We watched it and noticed that it simply appeared and did not approach as many of the other aircraft does, because we are directly below the flight path for Ottawa International Airport, meaning we see many aircraft come and go all the time. Once it got dark we can see lots of aircraft (all well below this shape) pass right by it, to no alarm. This intrigued us no end, because how could they not see this item and not report it. So we are perplexed by now and thought nothing more of it because if we can see it, and they can see it and we are on a major flight path, then there must be a rational explanation, perhaps it was an observation balloon for the airport. However, it is now October 23 2013 and we can attest that we have seen this item in the sky (weather permitting) every single night since we moved in and right until now as I am writing this statement. I we have observed it through binoculars, telescope and video camera, and I am looking at it right now, and aircraft are still passing to and from beneath it, without consequence. I am hesitant to contact the Ottaw airport or an authorities for that matter. I have observed this item at various times throughout the night i.e., 8,9,10,11 p.m. 2,3,4,5,6 a.m. and even to this morning at 6:30 a.m. when it just vanished as I watched. If you can offer an explanation for this I would be grateful and my wife and I are willing to discuss this with any investigator should wish to pursue this report. Thank you......and I can see it right now from my balcony just pulsating with the aforementioned colors,,,,however clouds are rolling in.."],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=45.367328,+-75.786207(51773)&iwloc=A&hl=en\"> mufon case (51773) map </A>","files":["/var/www/straped/mufon/html2text/51773.html.txt","/var/www/straped/mufon/org/51773.html"],"Tags":"City","Region":"Ontario","Sighting Duration":"Undisclosed","Date of the Event":"10/23/2013 07:37 UTC","Viewing Distance":"Over One Mile","City":"Ottawa","trends":["There have been 55 other sightings in Ottawa","There were no other sightings in Ottawa on or around October 23rd 2013"],"Source":"MUFON","Date Submitted":"10/23/2013 08:00 UTC","Country":"Canada","Object Shape":"Circle","Weather Factors":"Unknown","Summary":"Hovering circular object, pulsating in the sky above our apartment, for over three months every single night when sky is clear.","Latitude":"45.367328","Object Flight Path":"Stationary","Longitude":"-75.786207","Case Number":"51773","Log Number":"CA-10232013-0012","Object Features":"None"}