{"files":["/var/www/straped/mufon/html2text/51778.html.txt","/var/www/straped/mufon/org/51778.html"],"Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=37.67051,+-122.079096(51778)&iwloc=A&hl=en\"> mufon case (51778) map </A>","Country":"United States","Case Number":"51778","Summary":"2 lg black blimp like objects against sunset sky, very close, nose down aligned horizontally; one mvd under the other & up around to align vertically on top of the other. The top one left SW; the lower one stayed a few more min & followed the other one.","Disposition":"Unresolved","Date Submitted":"10/23/2013 10:12 UTC","Date of the Event":"10/22/2013 07:10 UTC","Tags":"City","Latitude":"37.67051","Region":"California","Log Number":"US-10232013-0017","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-122.079096","Source":"MUFON","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","divs":["Sighting DetailsI was going onto the upper deck facing west and noticed from inside the house looking out the sliding glass doors two very large, dark blimp like objects side by side. They were facing nose down like torpedos.I could not not help but notice them, they were totally \"in your face.\" I could only think they were UFOs. I called to my roommate to come see and she witnessed it too. We stood on the deck and watched. They were side by side, huge, dark, dull black, no windows or light or emissions, no sound whatsoever. I asked her to get her iphone to take pictures and she ran upstairs to get it. I saw the craft on the left start to slowly and gracefully move under the other one and start to move north. I yelled, \"Hurry, hurry! They are going to align vertically now!\" I don't know why I knew this, perhaps because I took it as such a display, I did not feel threatened and neither did she. She came downstairs with her iphone but couldn't get the craft against the sunset sky. By now the moving craft is ascending upwards on the south side of the stationary one. She went to get her ipad to try to take a picture again, but it didn't work either, just too dark, sky getting darker now and the first bright star appeared. Now they are aligned vertically one on top of the other. There they stayed for a few minutes, and then the craft on top slowly left heading southwest. It went up very high into the dark sky. The other one stayed a few minutes longer and then it too left following the same path as the other one. All this while the objects remained torpedo like. In other words they were blimp shaped, but they were vertically positioned. The objects did not make any right angles or abrupt movements, it was very graceful. I was thrilled and baffled to witness this display."],"trends":["There have been 14 other sightings in Hayward","There were no other sightings in Hayward on or around October 22nd 2013"],"Object Shape":"Blimp, Bullet, Missile, Cigar, Cylinder, Oval","City":"Hayward"}