{"Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Date Submitted":"10/24/2013 02:27 UTC","Object Shape":"Circle","divs":["sighting detailsmy son and i had just gotten outta the car and were heading inside. we have this habit of staring up into the sky at night sometimes because we've always been interested in the whole ufo thing. he saw it and said \"hey mom, look at that.\" i looked up and just assumed it was a passenger plane, even though the two nearest airports are quite a ways away from where we are, we just sort of brushed it off and went inside. even though i had never seen those many lights on an airplane before, we continued inside. it wasn't until sunday when i got onto facebook and saw the posting that i flashed back to what we saw. i then realized that what we saw had absolutely no sound. if my son hadn't have noticed it ( the lights were quite bright ) we never would have seen it. and i realized that it was flying awfully low to be that far away from the nearest airport. if i had to measure the distance from the ground where it was i guess i would say it was about 15 stories high. it had been raining a couple of days prior to that and it was really cloudy. we could see the formation of lights ( that flashed a bit, then stopped ) thru the clouds as it flew along at a moderate speed. we only watched it for about 20 or 30 seconds. it quietly flew\\glided directly over my apt complex and i can't believe no one else saw it. there was no wind that night. and i'm in the north part of dallas and the pic was taken in oak cliff, which is in the south-ish. so it flew north to south. according to whomever posted the pic on facebook, it was taken a little before\\after approximately 8pm. my son and i got out of our car around 8:10pm headed inside, so i'm guessing it was the same object. since the clouds were blocking our complete view of it we never saw the actual structured craft. only lights in a circular pattern."],"map":"<A HREF = \"http://maps.google.com/maps?q=32.912987,+-96.700477(51785)&iwloc=A&hl=en\"> mufon case (51785) map </A>","Longitude":"-96.700477","files":["/var/www/straped/mufon/html2text/51785.html.txt","/var/www/straped/mufon/more/51785_submitter_file1__UFOOctober182013.jpg","/var/www/straped/mufon/org/51785.html"],"Country":"United States","Log Number":"US-10242013-0003","Object Flight Path":"Straight-line path","Object Features":"Unknown","Tags":"City","Weather Factors":"Unknown","Region":"Texas","Summary":"A circular object silently flew over my apartment complex under cloud cover a little after 8pm. I could only see lights in the form of a cirlce.","Latitude":"32.912987","City":"Dallas","trends":["There have been 116 other sightings in Dallas","There was one other sighting in Dallas on or around October 18th 2013","This sighting has never been favorited.",""],"Disposition":"Unresolved","Case Number":"51785","Date of the Event":"10/18/2013 08:10 UTC","Source":"MUFON"}