{"Longitude":"-106.486174","Object Features":"Unknown","Disposition":"Unresolved","Object Flight Path":"Stationary,Other","Source":"MUFON","City":"Albuquerque","Object Shape":"Star-like, Triangle","files":["/var/www/straped/mufon/html2text/51782.html.txt","/var/www/straped/mufon/org/51782.html"],"trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around October 12th 2013"],"Log Number":"US-10232013-0021","Tags":"City","Summary":"Triangle UFO over ABQ with smaller ship flying around bigger ship","divs":["sighting detailsthis is another \"by chance\" video i managed to capture. for two nights straight, beginning 10\\11\\13, and ending 10\\12\\13 i observed this \"blinking\" light that had multiple colors viewed by me with my naked eye and through binoculars. on the second night, the light was still there, at the same time - 730pm, so i decided this time to film it on my kodak easyshare m580 digital camera. i set it up on a tripod, and pointed it in the direction of the light, and then recorded the following 11 minutes of this light. one thing i find surprising and amazing, is it is the same set-up of lights that i had photographed and sent to you in a previous report (case #51739 - two photos attached - original pic with circled \"triangle\" and magnified pic of circled area), except those were captured seven days earlier (10-05-13) and during the day, and in a different place in the sky. the most amazing portion of these footage is at the very beginning. it looks as though after the three main triangle lights are visible, on the left-side of the screen, you will see another white light that suddenly appears and then begins to zip and move at a very high speed across the screen. what it looks like to me. is that at times, it passes over the top of the \"mother ship\" (not visible for a second) and then reappears on the other side of the \"triangle\" - all within a brief second. it is quite amazing. imo - there is something happening over albuquerque, which seems to be happening right now, has been happening for the past 30 days (it seems) and it is something not of the ordinary. is this tr3b? i doubt it. it seems to be something else. what is your take on it. please remember.....this my material,so please consider it copyrighted and protected, but you are free to analyze and converse with me on it. i am at your disposal. thanks!"],"Latitude":"35.142648","Country":"United States","Case Number":"51782","Date of the Event":"10/12/2013 07:46 UTC","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Date Submitted":"10/23/2013 11:49 UTC","Viewing Distance":"Over 1 Mile, Unknown","Region":"New Mexico","map":"<A HREF = \"http://maps.google.com/maps?q=35.142648,+-106.486174(51782)&iwloc=A&hl=en\"> mufon case (51782) map </A>"}