{"map":"<A HREF = \"http://maps.google.com/maps?q=53.270985,+-1.406716(51787)&iwloc=A&hl=en\"> mufon case (51787) map </A>","Latitude":"53.270985","Object Features":"None","Case Number":"51787","Sighting Duration":"Undisclosed","Source":"MUFON","Viewing Distance":"Unknown","Summary":"Just a continuos small bright light like a planes headlight travelling from West to East silently","Date Submitted":"10/24/2013 06:32 UTC","Longitude":"-1.406716","Region":"","Log Number":"GB-10242013-0005","City":"New Whittington","trends":["There have been no other sightings in New Whittington","This sighting has never been favorited."],"Date of the Event":"10/23/2013 06:30 UTC","divs":["Sighting DetailsI was in Chesterfield Derbyshire, leaving my parents house at about 6.30pm. I looked up into the sky & pointed out to my mother a jet & it's contrail lit up by the moonlight. Just after that I saw a larger light travelling towards us high in the sky. I said to my mother that it was strange as it didn't have a strobe light or any red flashing lights. So we watched it. Several jets flew by with their flashing lights & jet noises. This one light continued its journey above us silently going from West to East. As it passed over us & slightly beyond, a jet was flying toward it coming from roughly just off East. To me at one point they were relatively close, so I believe the jet pilots would have been well aware of it. My mother & I watched it disappear into the night sky for as long as our eyes would let us. I'm very curious to know what travels at night in the sky with its light visible the whole time with no angle changes & is completely silent? The object didn't seem to be any higher than a jet & was brighter than a star, a planet or a satellite. Both my mother & I were mystified."],"Disposition":"Unresolved","Object Flight Path":"Straight-line path","Object Shape":"Other","Country":"United Kingdom","Tags":"City","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/51787.html.txt","/var/www/straped/mufon/org/51787.html"]}