{"Disposition":"Unresolved","Weather Factors":"Unknown","Tags":"City","Object Flight Path":"Path with directional change","Sighting Duration":"00:45:00","Country":"United Kingdom","Date Submitted":"10/24/2013 06:42 UTC","Case Number":"51788","Summary":"At 7am this morning two objects appeared. Like bright orrange yellow flames, shortly followed by another 3","Object Shape":"Fireball","trends":["There have been no other sightings in Bracknell, Berkshire","This sighting has never been favorited."],"City":"Bracknell, Berkshire","Latitude":"51.466994","divs":["Sighting DetailsI got up at 7am and went into the garden for a smoke. As I sat down I noticed 2 orrangy, yellow flame like shapes in the sky. I did not know what I was looking at but thought it was odd. I had never seen anything like that before. They looked like 2 big flames of fire in the sky. They came down below the roof of the house in front of ours so I did not see what happened to them. about 5-10 minutes later I was in the kitchen and looked out of the window still wondering what it was I had seen and I looked up to see another 3 flame like shapes coming down and one seemed to changed direction. I quickly took a photo on my phone of this event, however, my phone is not an expensive one and although it captured the things, it did not show the colour of them and they were as I said like flames yellowy orange in colour and I could see a trail of smoke behind them. I am reporting this now, as I am still curious as to whether or not anyone else saw this this morning and has reported it. I still am wondering what it was I saw. I am not a UFO follower. I have a photo of this event on my phone but can not send it sorry. I can not download off my phone and well I would not know how anyway. I am 53 years old Christine Phillips"],"Source":"MUFON","Viewing Distance":"Unknown","Object Features":"Unknown","Region":"","Date of the Event":"10/24/2013 07:00 UTC","files":["/var/www/straped/mufon/html2text/51788.html.txt","/var/www/straped/mufon/org/51788.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=51.466994,+-1.185368(51788)&iwloc=A&hl=en\"> mufon case (51788) map </A>","Longitude":"-1.185368","Log Number":"GB-10242013-0006"}