{"trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around October 23rd 2013"],"Longitude":"-118.318786","Object Features":"Unknown","Date of the Event":"10/23/2013 07:10 UTC","Log Number":"US-10232013-0020","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Summary":"It's back. The exact same ship from 9-30-13. This time it made a direct approach at me to within 1/2 mile (vertically).","divs":["sighting details7:10pm 10-23-13. i let my dogs out to use the yard and i see a solidly lit, sharply outlined green oval object that was sometimes half green and red doing its dead silent aerial stunts, right angle turns, rapid ascent and descents, in the nw sky over west la\\culver city area. visibility was maybe 5-7 miles. i go in and tell my girlfriend that, \"it's back!\". she comes running out and watches the stunt show for a while the runs back in for a camera. while she's inside this ship make a direct beeline for me from the west la area and stops almost directly over my head at roughly 70 degrees off the horizon. i estimate that its direct distance (vertically and horizontally) from me was 1\\2 mile or less. so close that i was waiving my arms and yelling at it like an idiot. i saw no structure, as the light was just too bright and unwavering. it sat over my head then retreated in the exact same direction from where it came from. then denise comes back outside and fumbled with the cameras controls in the dark but failed to get it to work in time. it had reached the limit of our visibility due to the cloud cover. this is the exact same ship i saw on 9-30-13 at 7:30pm pst, only this time it approached me directly, in a straight line, to within a few 1000 feet over my head."],"Source":"MUFON","City":"Los Angeles","Disposition":"Unresolved","Case Number":"51781","Region":"California","Weather Factors":"Unknown","Object Shape":"Oval","files":["/var/www/straped/mufon/html2text/51781.html.txt","/var/www/straped/mufon/org/51781.html"],"Date Submitted":"10/23/2013 11:50 UTC","Sighting Duration":"00:03:00","map":"<A HREF = \"http://maps.google.com/maps?q=33.990444,+-118.318786(51781)&iwloc=A&hl=en\"> mufon case (51781) map </A>","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Latitude":"33.990444"}