{"Case Number":"51780","Object Shape":"Cylinder","Longitude":"-78.873219","Tags":"City","Summary":"Cylinder shape object with C shape parts, bright light below and vapor trails.","divs":["Sighting DetailsDriving through Akron New York I was looking at the clouds since there was a storm coming and there were nice looking shape and color combinations. The clouds were moving quickly so I decided to take a few pictures out the window while I was driving. I took several pictures since I was hoping to get at least one good cloud shot in the series. I took the photos at 4:21pm and didn't look at them until about 10pm, at that time I saved the ones that weren't blurry or tilted and zoomed in on the clouds and farm house, when I did this I noticed an odd shape in several photos. The object is cylinder shaped and appears to be made of \"C\" shaped sections stacked together. There is clearly a vapor trail below it coming from the top of one of the clouds. The image quality is good and you can zoom in to see the details and some odd surface features. I took a total of 3 photos in 11 seconds, 2 show the object and vapor trail, the third shows the same plus a VERY bright white spot directly below shaped and sized like the object above, there are vapor trails above and below this bright white light patch. I did not notice the object at the time since I was watching the road and was aiming at a big target (the clouds) and not a focal point. I noticed them 6 hours later when I checked the pictures so the movement or appearance are unknown to me. This is my second report in 2 months under similar circumstances, both involved unusual storm clouds and both involved cylinder shaped objects. My only feelings are curiosity and confusion since I don't know what it is and would like to find out. I do find it unusual that I take photos of the sky all the time and the only time I see these things is when unusual weather events happen quickly."],"Date of the Event":"10/23/2013 04:21 UTC","Region":"New York","Sighting Duration":"Undisclosed","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/51780.html.txt","/var/www/straped/mufon/org/51780.html"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.891837,+-78.873219(51780)&iwloc=A&hl=en\"> mufon case (51780) map </A>","trends":["There have been 56 other sightings in Buffalo","There were no other sightings in Buffalo on or around October 23rd 2013"],"Object Flight Path":"Straight-line path","Log Number":"US-10232013-0019","Object Features":"Other","Viewing Distance":"Unknown","Latitude":"42.891837","Source":"MUFON","Date Submitted":"10/23/2013 11:21 UTC","City":"Buffalo","Weather Factors":"Unknown"}