{"Log Number":"US-10242013-0008","Region":"Kentucky","Date of the Event":"10/23/2013 07:20 UTC","Case Number":"51790","Latitude":"37.506176","map":"<A HREF = \"http://maps.google.com/maps?q=37.506176,+-84.680479(51790)&iwloc=A&hl=en\"> mufon case (51790) map </A>","City":"Stanford","Weather Factors":"Unknown","Country":"United States","divs":["Sighting DetailsI was outside letting my dog back in for the night when I noticed a large basketball size bright orb high above the hilltop. The one thing that was odd to me is that it was so large and I have seen many jets out here at night, helicopters, small planes as we are about 10 miles from a small airport and about 2 miles from a local hospital where it is common for helicopters to fly over our house enroute to the hospital. I have seen Venus and Saturn before and it was three times the size and brightness. I talked to my sister a few minutes later after I went back in and she stated she was seeing the same exact thing (she lives 11 miles from me) and it was the same size I described yet she specifically saw a red tail like a red light that was attached to the back. I did not see that. We both watched it from our homes trying to figure out if it was a comet, yet it did not come closer nor get brighter, it hovered right where it was, stayed the same color with no pulsating, no sound emitting from it, nothing. The pets weren't behaving any differently either. I didn't have any phone interruption, I was on a landline, she on a cell phone. As we watched it over the course of the next few minutes, it slowly seemed to distance itself, and become dimmer and dimmer. The only explanation I could think of was maybe it could have been a very large star that died? As it got dimmer and the more farther away it got, the more it slowly descended to just below the treetops and then I lost sight of it over the hill. I can't explain it being a satellite, it definitely was not a plane or helicopter nor was it a meteor as I have observed them before. I was just astounded because I have never seen anything behave like that before and I was searching the internet to see if anything had been sighted last night because I would really like to know what it is. Hopefully this report will prompt someone else to come forward if they saw it and report their observations."],"Longitude":"-84.680479","Source":"MUFON","Date Submitted":"10/24/2013 09:20 UTC","Summary":"Bright orb of white light, stayed stationary for about an hour and a half; seemed to descend to just a little below the tree lines after an hour and dimmed as it seemed to get smaller","Object Features":"Other","trends":["There have been 2 other sightings in Stanford","There was one other sighting in Stanford on or around October 23rd 2013"],"Object Flight Path":"Stationary","Object Shape":"Circle","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/51790.html.txt","/var/www/straped/mufon/org/51790.html"],"Sighting Duration":"01:45:00","Viewing Distance":"Unknown","Tags":"City"}