{"Date Submitted":"10/24/2013 11:52 UTC","Object Features":"Other","Log Number":"US-10242013-0012","Longitude":"-84.500469","Sighting Duration":"Undisclosed","Case Number":"51794","Tags":"City","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","Object Flight Path":"Stationary","Source":"MUFON","trends":["There have been 43 other sightings in Lexington","There were no other sightings in Lexington on or around May 15th 2013"],"files":["/var/www/straped/mufon/html2text/51794.html.txt","/var/www/straped/mufon/org/51794.html"],"Region":"Kentucky","Latitude":"38.073133","Date of the Event":"05/15/2013 12:50 UTC","Summary":"Saw object hovering low and overhead during the day.","City":"Lexington","divs":["Sighting DetailsMy husband and I went to the Lexington Cemetery, which is on the National Register of Historic Places, on May 15, 2013, just before 1:00 p.m. It's beautiful there with gardens and lakes and the cemetery is heavily treed. I chose for us to go there so I could take some portrait photographs of my husband with the gardens in the background. I know the date and time because of the \"stamp\" on the photographs I took of my husband just afterward. We were slowly driving down the main road through the cemetery and entered an area where the trees are sparse when I happened to look up. For only a few seconds, I saw an object in the sky that appeared to be stationary, nearly directly above us and before I could react, we were back under the canopy of trees. I yelled for my husband to stop the car but he was on his cell phone and took his time stopping. I got out and walked back to the spot where I thought I'd seen the object but I never saw it again. The object was very white, matte with no sheen at all, and was cylinder-shaped with a cone-like front or back end on it. There were two dark \"lines\" encircling the main body that were either painted on or perhaps the object was comprised of three sections and I was seeing where the sections joined each other. I heard no sound from it and there was no vapor trail or lights. The sky was clear and very blue that spring day and the whiteness of the object really popped against the sky. I saw it vividly. It appeared to actually be stationary. I only saw it for a few seconds and though it seemed to not be moving, it may have been moving very slowly. I was very stunned when I saw it because it defied logic and made no sense to me. It was like nothing I'd ever seen. I was extremely frustrated with my husband because he seemed to have no reaction at all to what I had seen and what I was telling him. In fact, he continued to talk on his cell phone while I was rushing up and down the roadway trying to find the object again. Although he believed me, he never had much of a reaction other than to tease me about it. At the time it happened, I immediately got out a piece of paper and drew the object to show him and to keep for myself. I thought about it a lot for several days or a week and the memory still comes back to me often. I guess the mind keeps trying to make sense of mysteries like this because they are so extraordinary and unexplainable. By the way, I attach no significance to this siting being over a cemetery. It just happened to be where I was when I spotted it."],"map":"<A HREF = \"http://maps.google.com/maps?q=38.073133,+-84.500469(51794)&iwloc=A&hl=en\"> mufon case (51794) map </A>","Object Shape":"Bullet, Missile, Cone, Cylinder","Disposition":"Unresolved","Country":"United States"}