{"Weather Factors":"Unknown","City":"Westbrook","Tags":"City","Longitude":"-70.362122","files":["/var/www/straped/mufon/html2text/51810.html.txt","/var/www/straped/mufon/org/51810.html"],"Date of the Event":"10/24/2013 12:00 UTC","Object Features":"Unknown","Log Number":"US-10242013-0028","Disposition":"Unresolved","trends":["There have been 4 other sightings in Westbrook","There were no other sightings in Westbrook on or around October 24th 2013"],"Region":"Maine","Date Submitted":"10/24/2013 08:31 UTC","Sighting Duration":"00:10:00","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsI was leaving Rite Aid in Westbrook, Maine. I turned left onto to Main St. As I was heading from the store, I looked up and saw a large, bright, white light flying in a SE to NW direction. I made myself look at the clock, it was 7:00pm sharp. I saw a helicopter or plane with blinking lights head toward the white orb. It immediately backed off to the NW. I then took a left by the police station. Then a right onto Wayside Dr. I saw two men at the intersection looking up at it too. I then headed toward Spring St. After that the craft started to descend down like a leaf falling slowly. It stayed the same intense, bright, white light. Once I reached the Spring St. intersection I lost sight of it. I pulled into my driveway and tried to record it on my cell phone. It was still there flying, I was now facing E..it was flying in a NE to SE direction. I looked around the sky and saw a few planes in the area. Then just as quick as I could blink it was gone. Vanished into a pinpoint of light then nothing. I think I saw a fighter jet, a plane with lights but a steady and a steady orange glowing on the rear. I heard a jet fly over. To me the white light from my perspective was the size of a basketball flying over the town. My recording is crappy but I have it. I know THAT was not the norm. HAs anyone else reported seeing this. I dont know how they couldnt see it."],"Summary":"large white ball of light flying flying se to sw, then desecended, then took off","Object Shape":"Sphere","Source":"MUFON","Case Number":"51810","map":"<A HREF = \"http://maps.google.com/maps?q=43.67399,+-70.362122(51810)&iwloc=A&hl=en\"> mufon case (51810) map </A>","Object Flight Path":"Path then hovering","Latitude":"43.67399"}