{"Viewing Distance":"Over One Mile","divs":["Sighting DetailsAfter returning home after a meal in a restaurant, as my dad and I were almost home, we observed an orange orb appear in the night sky, to the south east. It appeared, and quickly faded out. We discussed it, and agreed that our area is visited often. Then, I was in my bedroom, playing a video game. It about 11:57 PM. My home stereo started to get static, then about a minute later, the sound level rose and fell. Then, my internet service for my game console started acting up, disconnecting and reconnecting. Then, my cell phone service went down, saying \"Service Down\". Then, my two Cockatiel birds started to chatter wildly, and then all of a sudden just stopped, dead quiet. I then had a headache start all of a sudden, and I got the feeling that somebody was watching me. I got up to look out of my bedroom window, and that's when I saw it. The partial moon was just above the local ridges, and I saw a shape in the dim moonlight. It wage huge. It was moving in a direction towards the moon, and at that point, I could see the entire shape. It was a long triangle shape, with a rounded leading tip. It was fairly thick, with rounded edges, and a curving top, front tip to stern. No lights were to be seen. It was moving in a straight path, at a moderate enough pace for me to see it clearly. Then, it moved in between the moon and me, and completely blocked out the moon. It then continued on, with the moon reappearing, and then disappeared when it went over the ridges. About a minute later, my electronics started working normally. It freaked me out. After I had calmed down, about twenty minutes later, my headache went away as fast as it came."],"Log Number":"US-10252013-0008","Date of the Event":"10/25/2013 12:00 UTC","Date Submitted":"10/25/2013 01:02 UTC","Object Shape":"Triangle, Other","City":"Lake Havasu City","Tags":"City","Weather Factors":"Unknown","Latitude":"34.484394","Object Features":"Other","Longitude":"-114.284247","map":"<A HREF = \"http://maps.google.com/maps?q=34.484394,+-114.284247(51827)&iwloc=A&hl=en\"> mufon case (51827) map </A>","Disposition":"Unresolved","Region":"Arizona","Object Flight Path":"Straight-line path","Sighting Duration":"00:05:00","Country":"United States","trends":["There have been 30 other sightings in Lake Havasu City","There were no other sightings in Lake Havasu City on or around October 25th 2013"],"Source":"MUFON","Case Number":"51827","Summary":"Home stereo sound level faded in an out. other deviced acted up. Looked out window , observed the UFO>","files":["/var/www/straped/mufon/html2text/51827.html.txt","/var/www/straped/mufon/org/51827.html"]}