{"files":["/var/www/straped/mufon/html2text/51820.html.txt","/var/www/straped/mufon/org/51820.html"],"Summary":"Several bright orange/red starlike objects","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=26.089015,+-81.688086(51820)&iwloc=A&hl=en\"> mufon case (51820) map </A>","Object Features":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Source":"MUFON","Tags":"City","Country":"United States","City":"Naples","Date Submitted":"10/25/2013 12:33 UTC","divs":["Sighting DetailsWas out watering plants. First object was bright orange red passing from NW to SW and looked like a small consolation Orion, except that instead of 3 stars for a belt, it was one very bright orange-red star-like orb. Many red stars orbited around the central orb. Moved in an arc and changed direction from NW to SW to NE. Then faded out. This was followed by a 3 regularly spaced orange-red orbs once every 2 minutes (approximately) that did not have auxiliary lights around them. All moved NW to SW over the gulf of mexico. No sound. Certainly not an aircraft of any type. First object noticed at 23:38, followed by the 3 follow-up objects at regular intervals. Looked like what would be a roman candle, except at much further distance and higher altitude - at least 45 degrees above horizon. First object had glowing objects around the central orb. Moved to the SW and then stopped abruptly. Quickly changed directions and moved rapidly to the NE and then faded. Follow on objects arced across the sky and faded below the horizon. Much brighter than any star with a red-orange glow that would not be typical of an aircraft."],"Region":"Florida","Weather Factors":"Unknown","trends":["There have been 34 other sightings in Naples","There were no other sightings in Naples on or around October 24th 2013"],"Latitude":"26.089015","Object Shape":"Cross, Diamond, Sphere, Star-like, Other","Date of the Event":"10/24/2013 11:38 UTC","Log Number":"US-10252013-0001","Longitude":"-81.688086","Viewing Distance":"Over One Mile","Case Number":"51820"}