{"Log Number":"US-10252013-0011","Object Features":"Patterned Surface","Source":"MUFON","Object Flight Path":"Straight-line path","Date Submitted":"10/25/2013 03:52 UTC","Viewing Distance":"Unknown","Country":"United States","Region":"California","Weather Factors":"Unknown","Date of the Event":"10/24/2013 05:45 UTC","Disposition":"Unresolved","divs":["Sighting DetailsJust got back, from chico,Ca. from taking daughter to the dentist. we got home around 5;30 pm 10-24-2013. I went out back to have a cigerette. I glanced up seen to lights at first thought, 2 stars then did a double take and said to myself its to early for stars, then was thinking plane, but objects they weren't moving fast enough. so i looked for venus to see if it was out yet, did not see the planet which should be southwest from my location about 20 degrees or so off the horizon. I ran in house grabbed my binos and started looking ,it made the objects kind of blurry. couldn't get a good view thats when i called the wife out to look. She came out followed by my daughter and they looked seen the same thing thats when i grabbed the telescope 5 inch reflector on tri pod set it up had a 40mm lens in it focused on a round kind of flattend top bottom glow with red light on top almost like a round clam shell it had grooved lines in it verticly or at least like shadows. turned scope on other object to compare same but had white light on top. I watched it for about 30 mins total and through scope approx. 15 mins. they were driffting towards the east, as it got darker they just slowly faded out."],"Longitude":"-121.623167","Case Number":"51830","map":"<A HREF = \"http://maps.google.com/maps?q=39.113023,+-121.623167(51830)&iwloc=A&hl=en\"> mufon case (51830) map </A>","Sighting Duration":"Undisclosed","Object Shape":"Egg, Oval","Latitude":"39.113023","Summary":"I seen two lights in the sky and thought they were stars, until i got the telescope out.","files":["/var/www/straped/mufon/html2text/51830.html.txt","/var/www/straped/mufon/org/51830.html"],"City":"Yuba City","Tags":"City","trends":["There have been 10 other sightings in Yuba City","There were no other sightings in Yuba City on or around October 24th 2013"]}