{"map":"<A HREF = \"http://maps.google.com/maps?q=41.546511,+-88.19251(51839)&iwloc=A&hl=en\"> mufon case (51839) map </A>","Region":"Illinois","Source":"MUFON","divs":["Sighting DetailsWent outside in back to relax and skywatch for awhile. Noticed object as soon as i sat down inbetween a tree branch. At first i thought it was a passenger jet which stage and fly toward midway airport right past my house,sometimes i have counted as many as six at a time. But this one did not move at all it just hovered motionless and it was seemingly much brighter than jet lghts and much larger. There were i think five jets during the sighting that went past it, at that time i was thinking it was a planet as they had no reaction to it so i reasoned it must be much higher than it appeared, However after several minutes i noticed it was descending lower as i lost sight through the tree branch and i realized it was not a planet, i could not figure out why the planes were not reacting to it they were moving below it on their flight path and i wanted to see a higher flying one go over it as i probably saw over 20 aircraft at different heights but none went over it the whole time. After awhile i noticed it was descending lower and to the right. As i wrote it was extremely bright i keep binoculars with me and it was really bright looking through the binoculars. Right toward the last maybe 10 minutes i got the verification i needed to see that it was something other than a plane. From the south i saw a little tiny light heading towards the object and eventhough things shake around in the binoculars i saw it move past it really close and i saw it move behind it and reappear, then i saw what i had never seen before this plane actually went around it and came past it again before moving off to the north, the plane looked tiny compared to the object. At this time it started to descend more rapidly but still slow and its color changed to orange and it appeared to almost be fading out but it descended out of sight but i could not tell. There must have been other people on the ground who saw this besides me, it was cold out but still it reallly stuck out, all the lower altitude passenger jets absolutely had to see this as evidenced by the one that circled around it, there is the tell, another plane reacted to it. I watch for and have seen things in the sky which were much more crazy than this sigjting so i pretty much was just wanting to see if other planes reacted to it, that was a wow moment for me, or it moved off quickly, changed directions, went straight up or disappeared or amything else out of the ordinary. I told my wife after it happened as she just came back home, my daughter witnessed the object with me three different times during the sighting the last time she saw it i told her about the circling plane, i guess the cool part was it was over an hour in duration. Anyway i do not know what it was so its unidentifed, i would really like to know if it showed up on radar and who was thempilot that circled it though. Also i took a picture with a cheap disposable camera when i get the film developed if it shows up i will submit it but i hily doubt it will show anything."],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/51839.html.txt","/var/www/straped/mufon/org/51839.html"],"Object Flight Path":"Stationary,Hovering then path,Path with directional change","Date Submitted":"10/26/2013 10:19 UTC","Tags":"City","Weather Factors":"Unknown","Viewing Distance":"Unknown","Log Number":"US-10262013-0006","trends":["There have been 20 other sightings in Plainfield","There was one other sighting in Plainfield on or around October 24th 2013"],"Latitude":"41.546511","Date of the Event":"10/24/2013 06:55 UTC","Object Shape":"Sphere, Star-like","Country":"United States","Disposition":"Unresolved","Case Number":"51839","City":"Plainfield","Object Features":"Unknown","Longitude":"-88.19251","Summary":"Witnessed a very bright light low in the sky for one hour and three minutes moving very slowly until out of sight"}