{"Region":"North Carolina","trends":["There have been no other sightings in Near Iard Exit of I 40","This sighting has been favorited 1 time."],"Log Number":"US-10262013-0003","divs":["Sighting DetailsOne night i slept in the bed of my truck allowing a friend to drive while i slept. After a long while i woke wonderimg where we were on the trek home.When i opened my eys i thoight we had pulled under a big Truckstop canopy with bright white ligjimgit wasnt that..I saw what I thought at first was a very large bright white skyscraper with a lot of windows in multiple floors of Offices...towering over us and most nearby objects but it wasn't it was actually a huge hovering UFO over interstate 40. I thought man, I hope this thing dont see me laying here in the back of a pickup truck I would be an easy target..my froend was drivimg very fast and i thoughtih was due to the UFO butdue to the angle in tbe sky that it was hovering most people may not had seen it but i was lying on my back looking up. I have no clue how large that thing was but it reminded me of the Starship on Battlestar Galactica it was just as white and no smaller than thier tv scifi model. it looks so much like the TV show sci fi space ship that I actu ally had to wonder if they didn't see one too!? I have nothing to gain by fabricating a story about something like this I just hope someone else did see it that night and know the reason they r comng to Our State? Whatever the reason, we are being visited on a regular thier tv mpdel... basis and we are not alone!t!! Being Native American I have heard a lot of stories ab out visitors i didn 't believe them now I k now!"],"files":["/var/www/straped/mufon/html2text/51836.html.txt","/var/www/straped/mufon/org/51836.html"],"Summary":"Very large White Skyship with multiple levels with Windows hovered over Interstate 40 @ Icard Exit...","Sighting Duration":"Undisclosed","Object Shape":"Sphere, Other","map":"<A HREF = \"http://maps.google.com/maps?q=35.765363,+-79.01318(51836)&iwloc=A&hl=en\"> mufon case (51836) map </A>","Date of the Event":"08/31/2010 12:00 UTC","Latitude":"35.765363","City":"Near Iard Exit of I 40","Longitude":"-79.01318","Viewing Distance":"501 Feet - 1 Mile, Unknown","Date Submitted":"10/26/2013 12:40 UTC","Case Number":"51836","Object Features":"Window(s), Other","Weather Factors":"Unknown","Object Flight Path":"Stationary","Tags":"City","Country":"United States","Source":"MUFON","Disposition":"Unresolved"}