{"Region":"Florida","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Weather Factors":"Unknown","Object Flight Path":"Path with directional change,Other","Log Number":"US-10262013-0004","Summary":"Observed object multiple times as it circled around. Plenty of airplanes in the air, this wasn't one. It was brighter than anything i've seen and very low to the ground.","files":["/var/www/straped/mufon/html2text/51837.html.txt","/var/www/straped/mufon/org/51837.html"],"Longitude":"-82.505507","divs":["sighting detailsi was outside with my girlfriend smoking a cigarette when she pointed out a bright light moving behind some trees across the street. at first i figured it was an airplane, but as it emerged i was shocked at how bright and close by it was. the object appeared as a very bright aura of green\\blueish light. at first it moved slowly at a distance of around 300 yards away. it moved steadily past and at one point ascended 300 feet or so without slowing down or speeding up the whole time. i thought about running inside to grab my phone to record it, but at first i didn't want to miss it so i opted out. as it grew further in the distance after passing, i climbed atop my car for a better view thinking i wouldnt see it again. a slightly jet-like hum was heard coming from the craft, but other than that it was completely silent even when it was within 300 feet of me. after i saw it nearly a mile away i hopped down to continue smoking my cig and discussing it with my girlfriend who had saw the whole thing as well. not more than a minute later we see the object fly almost right above our heads across out street at a high rate of speed back in the direction we originally saw it come from. after quickly leaving our line of sight over the neighbors trees across the street, the object reemerged from some trees down the block flying in almost the same pattern it had originally, only this time faster. i saw it repeat this pattern once more before going back inside, but it is important to note that the light emitted from the object was brighter than any man made light seen. it would burn my vision a bit from looking at it. also to add to the credibility there were several man made aircraft in the sky at the time i could easily differentiate from. i did manage to get some video but the zoom on the phone camera was horrible and you cant see very much"],"City":"Bradenton","Disposition":"Unresolved","Date of the Event":"10/23/2013 12:00 UTC","Object Features":"Other","Object Shape":"Fireball","Source":"MUFON","Country":"United States","Case Number":"51837","Date Submitted":"10/26/2013 03:53 UTC","trends":["There have been 27 other sightings in Bradenton","There were no other sightings in Bradenton on or around October 23rd 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=27.446262,+-82.505507(51837)&iwloc=A&hl=en\"> mufon case (51837) map </A>","Tags":"City","Latitude":"27.446262"}