{"Source":"MUFON","Disposition":"Unresolved","Object Features":"Unknown","Viewing Distance":"Unknown","Longitude":"-77.186295","Sighting Duration":"Undisclosed","City":"Undisclosed","files":["/var/www/straped/mufon/html2text/51831.html.txt","/var/www/straped/mufon/org/51831.html"],"Log Number":"US-10252013-0012","Object Flight Path":"Straight-line path","divs":["Sighting DetailsHeard loud aircraft and looked outside to see jets pursuing what appeared to be a glowing orb. I was working in my garage when I heard a loud aircraft. This was louder than your typical plane. I opened the door and looked up immediately. Right as I did I saw an orb fly directly over me at very fast speeds. Right after that what appeared to be jets chasing it. As it flew right over my house, I kept watching them as they flew away over the tree line. They were going really fast. A typical plane takes about 3 minutes to pass by. These guys were going so fast that I only had what seemed like a few seconds to see them. The orb was a white light that didn't appear to be blinking. The jets had your typical lights on them and they were blinking. Their lights seemed awfully bright though, maybe it was because they were so low to the ground. As the orb and what I will say were jets were almost out of sight, the orb appeared to have an outline of a triangle but it almost appeared to be cloaked. If this was a triangle craft, it wouldn't be the first one I have ever seen, back in 2001 I saw another sighting of a very large triangle craft that was hovering over a river. That's why when I first saw the outline of the triangle I was thinking that my mind was just wanting to see a triangle craft again. After reading more reports online that saw similar last night, I think it could have been another one, only smaller than the last. I wish I could talk to those pilots and get some facts. Also, Their flight path was straight, no turns. They were flying really low to the ground. If i were to estimate I would say 2,000 - 5,000 feet but it would be really hard for me to judge that accurately. This happened at almost exactly midnight."],"Object Shape":"Sphere","trends":[],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.209512,+-77.186295(51831)&iwloc=A&hl=en\"> mufon case (51831) map </A>","Summary":"Heard loud aircraft looked outside to see jets pursuing what appeared to be a glowing orb","Country":"United States","Region":"Pennsylvania","Latitude":"41.209512","Tags":"City","Case Number":"51831","Date Submitted":"10/25/2013 08:41 UTC","Date of the Event":"10/24/2013 11:59 UTC"}