{"map":"<A HREF = \"http://maps.google.com/maps?q=39.693434,+-84.159887(51846)&iwloc=A&hl=en\"> mufon case (51846) map </A>","trends":["There have been 7 other sightings in Kettering","There were no other sightings in Kettering on or around October 25th 2013"],"Latitude":"39.693434","Object Shape":"Circle, Sphere, Star-like","Longitude":"-84.159887","Date Submitted":"10/26/2013 02:26 UTC","Object Features":"Unknown","Case Number":"51846","Tags":"City","divs":["Sighting DetailsIt was just before 9:30 when I got a call from my aunt who was down the street at my grandparents house. She said that her, my grandparents and our cousins saw twenty lights in the sky. One of my family members there works at Wright-Patt and they couldn't identify them. Me and my parents went outside and saw two of them. Outside it smelt like a skunk. One object was hovering, just visible between the sight of two trees. We looked a little to the West and saw another orange orb. This one was still at first and then started flying very fast towards the other. Just before it went behind the sight of a tree it dissappeard. We looked back at the other orb that seemed to be hovering or slightly moving to the northeast. Just then we saw the blinking lights of an aircraft come from just out of view heading towards the object. That orb then stopped and got dim, just before it dissappeared. The plane continued its path but slowed down a little. Once we got back inside I got a slight headache. We called back my aunt and she said they just dissapeared. We also realized they were heading against the wind."],"files":["/var/www/straped/mufon/html2text/51846.html.txt","/var/www/straped/mufon/org/51846.html"],"Summary":"got call from family then went outside to see light for myself and saw 2 orange orbs.","Date of the Event":"10/25/2013 09:30 UTC","Object Flight Path":"Hovering then path","Region":"Ohio","Disposition":"Unresolved","City":"Kettering","Viewing Distance":"Unknown","Country":"United States","Source":"MUFON","Sighting Duration":"00:02:00","Log Number":"US-10262013-0012","Weather Factors":"Unknown"}