{"Date of the Event":"10/26/2013 06:47 UTC","Country":"United States","Tags":"City","Latitude":"37.436863","Disposition":"Unresolved","Object Features":"Other","Summary":"like a dirty snowball or something in apearence but i hit it with my truck and it disentigrated into white powder and left residue. Exploded like if you was to hit a poolball. This thing was like floating in the road and I hit it going about 45-60 mph","Longitude":"-78.650134","map":"<A HREF = \"http://maps.google.com/maps?q=37.436863,+-78.650134(51850)&iwloc=A&hl=en\"> mufon case (51850) map </A>","Case Number":"51850","Date Submitted":"10/26/2013 08:24 UTC","files":["/var/www/straped/mufon/html2text/51850.html.txt","/var/www/straped/mufon/org/51850.html"],"Viewing Distance":"20 Feet or Less","trends":["There have been no other sightings in whitewwod","This sighting has never been favorited."],"Object Flight Path":"Other","Region":"Virginia","Log Number":"US-10262013-0016","City":"whitewwod","divs":["Sighting DetailsMy cousin and I were traveling to West virginia from Virginia talking and going pretty fast. All at once I hit a whitish grey looking object with my windshield where the rear view mirror is. The thing disentigrated leaving white dusty trail on my roof of my truck that is still there. After I finish this I am going outside to take a sample of this. I hit this thing going about 60 mph and have no idea what this was but it looked to me at a quick glance, like a dirty snow ball but the weather this evening is in the 60's with no precipitation. We walked the whole erea to see if this could have been some kind of bird but found nothing. The trail of dust looks like the object would have landed in the back of the truck but nothing there either. If you have any idea what this was or would like to check the sample, please contact me. I will try to take a picture but I do not have a good digital camera and it is now dark outside but I will try anyway Thanks Josh"],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","Object Shape":"Sphere"}