{"Longitude":"-88.773694","Country":"United States","Region":"Illinois","Disposition":"Unresolved","Date Submitted":"10/27/2013 12:10 UTC","Tags":"City","Summary":"bright chevron hovering in eastern sky disappered then reappeared","Object Features":"None","Object Flight Path":"Other","Log Number":"US-10272013-0001","Case Number":"51865","Object Shape":"Chevron","files":["/var/www/straped/mufon/html2text/51865.html.txt","/var/www/straped/mufon/org/51865.html"],"Latitude":"41.771696","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.771696,+-88.773694(51865)&iwloc=A&hl=en\"> mufon case (51865) map </A>","City":"Waterman","Source":"MUFON","Weather Factors":"Unknown","divs":["Sighting DetailsMe, my son and his friend were driving east on Lee Road at about 8:10 pm, October 25, 2013. I noticed a large bright light that was redish orange and was either shimering or rotating. It was larger than a star or planet you might see in the night sky. I kept watching while I was driving because it hadn't moved for at least five minutes. I asked my son what he thought it may be to just joke about it being a ufo and he said I don't know probably a plane. At that time I told him I don't know because it hasn't moved. Then it got brighter and started to fade to a small pin point and got bright again then to a small pin point then disappeared completely. It was gone roughly 10 seconds and came back in the same spot and got bright then faded to a pin point then did that one more time and disappeared completely. About 5 seconds later it reappeared quite a disance north of the spot it was previously in and got bright and was shining for a few seconds then it faded to a pin point and got bright again thn faded to a pin point and completely disappeared and I didn't see it come back at all. I would say from my position to where was first hovering to where it ended up would be about thirty degrees north of the original position."],"trends":["There has been one other sighting in Waterman","There were no other sightings in Waterman on or around October 25th 2013"],"Date of the Event":"10/25/2013 08:10 UTC","Viewing Distance":"Unknown"}