{"Date Submitted":"10/26/2013 10:28 UTC","trends":["There have been 20 other sightings in Plainfield","There was one other sighting in Plainfield on or around October 25th 2013"],"Sighting Duration":"01:03:00","Viewing Distance":"Unknown","Object Flight Path":"Hovering then path","Log Number":"US-10262013-0026","Source":"MUFON","Date of the Event":"10/25/2013 06:55 UTC","Object Features":"Unknown","Tags":"City","divs":["Sighting DetailsI submitted a report on friday of what i thought was a planet and because of a error in seeing a plane go around and come back again i mistakenly believed i had saw a ufo for over one hour time, i would not have made the report before first finding out if there were any planets visible at that time and following up the next night to make sure it was not a planet or just a bright star, i saw the exqct same thing tonight saturday and it followed almost the exact same path as noted the night before. The plane threw me off and it only shows to make sure before submitting a report. 99 out of 100 times there is always a logical answer to what i am seeing, i was seeing venus which in itself pretty cool but i should not have submitted a sighting until i checked out other answers first, which i always do. I apologize for mistakenly submitting my report, the plane really through me off, and was just a coincidence. As a side note saturday night i also saw an orange light that disappeared, this was only a chinese lantern, saw for app.30 - 45 seconds viewed through binoculars, you can normally see that the light will look like yellow and orange and you can see the candle flickering on top and the bottom look orange and when it burns out you can see the black structure of the lantern falling, its easy to think its a ufo,however i have also seen objects much larger that are similar in color but looking through binoculars looks like a ball of fire almost molten the only thing that to me looks like the lit end of a cigar if you blow on it, and it is flying. Make sure to note if its windy or calm. Its easy to mis identify objects, give your sighting time and most of the time you will be able to come up with a logical answer as to what you are seeing, but keep looking up and you may be able to see something incredible."],"Latitude":"41.574976","Summary":"Followup on report from day before","Country":"United States","Case Number":"51860","map":"<A HREF = \"http://maps.google.com/maps?q=41.574976,+-88.202304(51860)&iwloc=A&hl=en\"> mufon case (51860) map </A>","files":["/var/www/straped/mufon/html2text/51860.html.txt","/var/www/straped/mufon/org/51860.html"],"Region":"Illinois","City":"Plainfield","Object Shape":"Other","Longitude":"-88.202304","Weather Factors":"Unknown","Disposition":"Unresolved"}