{"Source":"MUFON","Object Features":"None, Wings","Log Number":"US-10262013-0029","files":["/var/www/straped/mufon/html2text/51864.html.txt","/var/www/straped/mufon/org/51864.html"],"Object Shape":"Boomerang, Cylinder","Viewing Distance":"Over 1 Mile, Unknown","Longitude":"-119.804933","Weather Factors":"Unknown","Disposition":"Unresolved","Case Number":"51864","Tags":"City","Date of the Event":"10/15/2013 12:25 UTC","Object Flight Path":"Straight-line path,Path with directional change","Summary":"saw object out of n side airplane window","trends":["There have been 65 other sightings in Reno","There were no other sightings in Reno on or around October 15th 2013"],"Region":"Nevada","City":"Reno","map":"<A HREF = \"http://maps.google.com/maps?q=39.535533,+-119.804933(51864)&iwloc=A&hl=en\"> mufon case (51864) map </A>","Date Submitted":"10/26/2013 11:29 UTC","Country":"United States","Sighting Duration":"Undisclosed","divs":["Sighting Details while looking out the window of our flight from sf to den, I saw what appeared to be 2 black contrails coming up about 8 oclock and 10 to 20 degrees off to nw of a straight, vertical path. within a minute or two it appeared to be a black, v shaped object (my wife saw it as u shaped). at this point, it appeared to turn into a small, straight black line. it appeared to have rotated and looped around to parallel the flight path of our airplane, horizontal to us and slightly behind. this all took about 3 to 4 minutes. for the remaining 4 to 6 minutes it seem to track with our straight east flight path (we had just reached cruising altitude, 30,000 ft.). after about 2-3 minutes it continued dropping behind us and then began slowly gaining altitude, till it became too far away to see. i'm just guessing it was 10 to 15 miles away the whole time. it had maintained path as a small straight, black line. I had hoped to share this with the pilots, but the flight was continuing to Oklahoma and a crew change was being made too, so they hurried us off the plane as to count the number of continuing passengers. my wife had basically the same observations as I did. mike McCarthy this was southwest flight #355, san Francisco to Denver, lv 10:40am, arrive 2:00pm."],"Latitude":"39.535533"}