{"files":["/var/www/straped/mufon/html2text/51861.html.txt","/var/www/straped/mufon/org/51861.html"],"Longitude":"-118.456559","Region":"California","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=34.005764,+-118.456559(51861)&iwloc=A&hl=en\"> mufon case (51861) map </A>","Source":"MUFON","Viewing Distance":"Over One Mile","Latitude":"34.005764","Object Shape":"Sphere","Country":"United States","Log Number":"US-10262013-0027","Weather Factors":"Unknown","trends":["There have been 404 other sightings in Los Angeles","There was one other sighting in Los Angeles on or around October 26th 2013"],"Summary":"golden white yellowish ball light. No markers or anyother lights. Starlike.","Date Submitted":"10/26/2013 10:58 UTC","divs":["Sighting Details I was out in the backyard playing with my 1 watt blue laser pointing it at a satellite when I saw a glowing light to the left of me becayse I was facing North West. I thought it might be a helicopter or plane as they do fly in the area but they have blinking lights that turn on over my town and you can hear the jet or heli engines. This was like a glowing ball or something so I turned off the laser to be saft and wait. No marker lights ever came on and it looked like a star but low and moving from my left to right so not at me. No way it could be a plane as they do not have bright side lights like a star..The color was more yellow gold with some white at the center. Just looked like a glowing ball with no real solid surface. Not 100% but would say about 80% is was not a plane or traditional aircraft. I know you must put on marker lights and have a blue and red so other planes can tell your direction of which this object had none of. Could be government top secrete or something..Just hope it wasn't Russian...I said hello to them in my mind just to be safe. Swore they said hello back but who knows.. Hope this is helpful."],"Object Features":"None","Date of the Event":"10/26/2013 07:09 UTC","Sighting Duration":"00:02:01","City":"Los Angeles","Tags":"City","Case Number":"51861","Disposition":"Unresolved"}