{"Object Shape":"Other","Date of the Event":"08/24/2013 10:15 UTC","Longitude":"-82.873188","City":"Mount Clemens","Sighting Duration":"Undisclosed","Tags":"City","Weather Factors":"Unknown","trends":["There have been 2 other sightings in Mount Clemens","There were no other sightings in Mount Clemens on or around August 24th 2013"],"Case Number":"51872","map":"<A HREF = \"http://maps.google.com/maps?q=42.59521,+-82.873188(51872)&iwloc=A&hl=en\"> mufon case (51872) map </A>","Region":"Michigan","Log Number":"US-10272013-0008","Latitude":"42.59521","Summary":"my husband and I witnessed 2 orange tulip shaped objects flying in tandem in the western night sky, then seperate and disappeared in the northen sky","Object Features":"None","Source":"MUFON","Disposition":"Unresolved","divs":["Sighting DetailsMy husband and I were out on our porch that faces west, just looking at the August night sky. There were some low clouds, but for the most part it was clear. As I looked towards the north sky, I yelled to my husband, \"Look!!, UFO's like I saw before!\" What we saw were two orange yellow objects flying in tandem. They sort of look like a tulip flower on it's side. They were heading north in a fast path. One of the objects dropped down and behind the other, then flew back up and once again they were flying side by side. They were very bright, but made no sound at all. They proceeded north for approx. 10 seconds (?) Then one disappeared, while the other continued on it's forward path. Approx. 2 seconds later, that too disappeared in the northern sky. We were in shock, my husband more so than me, as I had seen this type of object in the past and had reported it. I had told him of what I had seen in the past, but for him to see if for himself, he could not deny what he saw, especially him being a small airplane pilot. He knew it was not an airplane, or any other craft he had seen in the past. I wish I had made a report at the time of this sighting, as there have been two more since. I am making reports on those occurrences. It made me feel like I was going crazy, but I know now I should report what I see, to se if there is a pattern. I hope someone will call me and talk to me about these things. I'd really appreciate it. Thanks, Lisa Simon"],"files":["/var/www/straped/mufon/html2text/51872.html.txt","/var/www/straped/mufon/org/51872.html"],"Viewing Distance":"Over One Mile","Date Submitted":"10/27/2013 08:47 UTC","Object Flight Path":"Path with directional change","Country":"United States"}