{"Disposition":"Unresolved","Date Submitted":"10/27/2013 10:53 UTC","Log Number":"US-10272013-0012","Case Number":"51876","Summary":"4-6 bright bluish/white glowing circle lights flying above our vehicle spining in formation","Date of the Event":"10/26/2013 09:17 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.640025,+-71.313722(51876)&iwloc=A&hl=en\"> mufon case (51876) map </A>","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Object Shape":"Circle, Disc","files":["/var/www/straped/mufon/html2text/51876.html.txt","/var/www/straped/mufon/org/51876.html"],"Latitude":"42.640025","Tags":"City","trends":["There have been 9 other sightings in Lowell","There was one other sighting in Lowell on or around October 26th 2013"],"Longitude":"-71.313722","Region":"Massachusetts","City":"Lowell","Object Features":"Unknown","Source":"MUFON","Weather Factors":"Unknown","divs":["Sighting DetailsWe were heading west on the high way coming from Salem, MA. when around 9:17pm near Lowell, MA. we noticed 4 big bright lights flying above our vehicle.They were moving just as fast as the car was going on the highway. It was cloudy but their bright light were very visible becuase it was dark cloudy. The 4 spinning lights would all come to togther and then criss-cross each other breaking back into 4 separate lights and still countinously spinning. When they separted out it looked like they were making a square formation then 2 of them at opposite ends would split into 2 more lights then they would all come back toghther spinning as 1 large light. They seemed to follow us for a while then we began to get very nervous. We know the exact time we noticed them beacuse my mothers iphone froze with the time locked on it and then quickly we gave her a nother phone to try and record with. Her cellphone stopped working from 9:17pm-9:38pm. Will submit video when I get from friends phone."],"Country":"United States","Sighting Duration":"Undisclosed","Viewing Distance":"N/A"}