{"Date of the Event":"10/25/2013 12:00 UTC","Weather Factors":"Unknown","Longitude":"2.20948","Country":"France","trends":["There have been no other sightings in Campagne-sur-Aude","This sighting has been favorited 1 time."],"Sighting Duration":"Undisclosed","Disposition":"Unresolved","Date Submitted":"10/27/2013 08:50 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.920574,+2.20948(51873)&iwloc=A&hl=en\"> mufon case (51873) map </A>","Log Number":"FR-10272013-0009","City":"Campagne-sur-Aude","Object Features":"Unknown","Object Flight Path":"Unknown","Source":"MUFON","Object Shape":"Sphere","Case Number":"51873","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/51873.html.txt","/var/www/straped/mufon/more/51873_submitter_file1__UFOlineofsight.png","/var/www/straped/mufon/org/51873.html"],"divs":["sighting detailsit appeared differently on camera than it did using a mono-scope and field-glasses. by far the most interesting event was possibly a rather large emp discharge seen only on camera. this discharge followed a couple of smaller ones. as a former senior aerospace research engineer and private pilot this intrigued me the most and something that i had never witnessed visually. each discharge radiates out in two invisiable-to-the-eye waves from the center. it also appeared that the flight crew was having great difficulty attempting to regain control of the craft in light of a possible mechanical problem. the craft also appeared to lose altitude following each discharge but did appear to regain a little more control. after a period of time they soon dropped down behind a saddle in the mountain but it's glow was strong enough that it could still be seen for many miles. note that this event took place near the area of bugarach mountain and rennes le chateau, both well known as possible energy centers. also note, that my son and i are still on vacation and staying with our friends chris and sue ingram in southern france and have not had a chance yet to down load the video from our camera to the computer, but will up load the video when we return in a couple of days. both chris and sue would be excellent to interview and are both english living in france. chris is a well know writer that can describe most everything to it's smallest detail. one last observation is that one would think that the military, police and others would have taken action to investigate and\\or recover this craft but none appears to have taken place. this craft appears to me to have made a possible hard, simi-controlled landing but did not explode and probably remained in tact."],"Summary":"Pulsating disc, when viewed on camera gave off a rather large energy discharge, possibly EMP.","Region":"Languedoc-Roussillon","Latitude":"42.920574","Tags":"City"}