{"Country":"United States","Log Number":"US-10272013-0007","trends":["There have been 2 other sightings in Mount Clemens","There were no other sightings in Mount Clemens on or around October 26th 2013"],"Date of the Event":"10/26/2013 08:30 UTC","Object Flight Path":"Hovering then path,Path with directional change","divs":["sighting detailsi went out onto my front porch at approx. 8:30 pm. halfway above horizon, in the western night sky, i see a bright orange\\yellow glowing object, shaped like a tulip flower on it's side. i had made a previous report early this year, or late last year, about the same type of sighting. it had appeared out of nowhere, as i was looking at the stars at the time is when i first saw it. it startled me, but it just came out of nowhere. it made no sound at all. it gave off a steady bright appearance. it hovered momentarily, maybe 3 seconds? dropped down a short ways, then ascended and proceeded in a northern direction. what was s strange about this sighting was how fast it was going! it was faster than any airplane, helicopter, jet, etc., that i had ever seen. the entire event took no longer than 15 seconds. as it proceeded quickly north, it then totally disappeared from sight. there were no clouds for it to go behind. i stood and watched for it to re-appear for a couple of minutes, but it was gone from sight and did not reappear. this report will be number one of 3, starting with this latest occurrence. in the last couple of months, from roughly august 2013 up until now, i and my husband have witnessed 3 ufo occurrences. i will be making 2 more reports, but will be approximate dates. i wish i had made a report after each sighting, i kind of felt i was going nuts here. but it is clear to me now that something is going on in the area, and needs to be reported."],"Source":"MUFON","Sighting Duration":"Undisclosed","Region":"Michigan","Object Features":"Unknown","Longitude":"-82.875756","Disposition":"Unresolved","Tags":"City","City":"Mount Clemens","Summary":"Orange yellow glowing object shaped like a tulip appeared in the west speeding fast dropped down proceeded north then disappeared","files":["/var/www/straped/mufon/html2text/51871.html.txt","/var/www/straped/mufon/org/51871.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.58707,+-82.875756(51871)&iwloc=A&hl=en\"> mufon case (51871) map </A>","Weather Factors":"Unknown","Case Number":"51871","Object Shape":"Other","Date Submitted":"10/27/2013 07:38 UTC","Latitude":"42.58707","Viewing Distance":"Over One Mile"}