{"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.293472,+-73.313973(51883)&iwloc=A&hl=en\"> mufon case (51883) map </A>","trends":["There has been one other sighting in Easton","There were no other sightings in Easton on or around October 27th 2013"],"Case Number":"51883","Disposition":"Unresolved","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Sighting Duration":"00:15:00","Source":"MUFON","Region":"Connecticut","Object Features":"Unknown","Object Shape":"Unknown","City":"Easton","files":["/var/www/straped/mufon/html2text/51883.html.txt","/var/www/straped/mufon/org/51883.html"],"Summary":"My son and I observed up to 4 bright objects moving in the sky","Longitude":"-73.313973","divs":["sighting detailsat approximately 6:30pm, my son and i were driving home from my brother house. i noticed a very bright light in the sky, that was extremely low, too low for a plane. i pointed it out to my son. we then observed a second similar bight object move close to the first, both appeared to be hovering and within a few hundred feet of each other. than one moved away swiftly to the north\\west, another object then joined. we observed up to 3 or 4 objects moving in sync, then broke away, one remained above the road and seemed to follow us as we headed west. all these object were bright, very bright, and seemed to have random blinking lights, ability to hover, and move away at fast speeds, sometimes turning abruptly. we stopped the car to try to take a photo on our camera, but were only able to capture a bright object. at that same time, we called my brother to tell him, and talked briefly with him before my phone cut out it's signal. this incident took place as we traveled home in my car, from monroe, ct, through easton ct, to redding ct, a trip of about 30 minutes and we observed the objects for about 10-15 minutes of the trip. this occurred mainly on rock house road, but the objects seemed to be in the western sky over easton or redding. when we first saw it, immediately it looked to bright for a star or plane and too low in the sky for a plane, and it's movements seemed too different than any plan could make. we did not hear any sound, even though we opened the window of the car. at the closest, the objects may have been 500 feet or more above the road. my son and i were certainly amazed as we watched, and a little scared about it. eventually all the objects moved and we could not see them."],"Date of the Event":"10/27/2013 06:30 UTC","Weather Factors":"Unknown","Latitude":"41.293472","Country":"United States","Log Number":"US-10272013-0016","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"10/27/2013 07:56 UTC"}