{"Case Number":"51889","Sighting Duration":"Undisclosed","Source":"MUFON","Date Submitted":"10/27/2013 09:06 UTC","Log Number":"US-10272013-0023","files":["/var/www/straped/mufon/html2text/51889.html.txt","/var/www/straped/mufon/org/51889.html"],"trends":["There have been 18 other sightings in Ann Arbor","There were no other sightings in Ann Arbor on or around October 22nd 2013","This sighting has never been favorited.",""],"Longitude":"-83.734668","Tags":"City","Object Shape":"Sphere","Disposition":"Unresolved","divs":["Sighting DetailsThe morning of Tuesday, October 22 I was waiting for the light to change at the intersection of Brookfield Drive and Ann Arbor Saline Road, facing south-east toward Eisenhower. At 9:20 am, I spotted what I first thought was a helicopter headed toward me, but as it approached I saw that it had no wings or rotors or any other visible attachments. As the object approached my position head on, it looked round, and was very dark or black. It was not very large; perhaps as large as a Volkswagen Beetle. The craft came from the direction of the Applebee's restaurant on West Eisenhower Parkway and made a sharp turn northeast so that it crossed the sky in front of me. When it turned to parallel Ann Arbor-Saline Road, I saw that it was oblong, not round. Occasionally the rear third flashed silver. It moved at a steady rate of speed, and kept about the same height above ground level. I watched the craft for at least three or four minutes as I waited for a green light. I lost sight of it as it moved into the sun's glare."],"Latitude":"42.283786","Viewing Distance":"Unknown","Weather Factors":"Unknown","Country":"United States","Object Flight Path":"Path with directional change","Region":"Michigan","City":"Ann Arbor","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=42.283786,+-83.734668(51889)&iwloc=A&hl=en\"> mufon case (51889) map </A>","Date of the Event":"10/22/2013 09:20 UTC","Summary":"A brief fly-by by a small, dark ET craft."}