{"Tags":"City","Weather Factors":"Unknown","Longitude":"-106.607051","trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around October 27th 2013","This sighting has never been favorited.",""],"Case Number":"51892","Object Shape":"Circle, Sphere","divs":["sighting detailsi am from the east coast (ct) visiting a childhood friend in albuquerque, nm (from thursday, 10\\24 through 10\\28\\13). after finishing dinner at the pf changs restaurant (at 4440 the 25th way ne, albuquerque, nm) on sunday, 10\\27\\13, my friend and i headed to the parking lot when my friend noticed a very bright light hovering in the sky over the general area above the roof of a hotel (i think a drury inn?) in the same parking lot. we stood for about a minute or two debating what we were looking at, since when focusing on two points on the hotel's roof the light wasn't moving. so we decided to get in the car and decided to head sw in the direction of the light outside the city limits where the light pollution was less. it was odd because it was hazy\\some cloud cover in the night sky and the stars weren't many, and the ones that were visible in this parking lot weren't that bright. so this light dominated the sky even in a well-lit parking lot and was rather big and round in appearance. we noted the time on the car clock as 7:58 p.m. (mt) when we got into the car. we headed up paseo del norte (road) heading west in my friend's car. as my friend was driving we noticed planes flying in the sky and they were distinctly smaller, had the typical red and blue blinking lights, and less bright than this light which appeared stationary and unwavering in the night sky. so, as my friend drove her car, i kept my eye on the light so as not to lose its orientation in the sky. the planes appeared to fly under or around the bright light, but it was the planes in the foreground and background that made it clear this wasn't an airplane. and as the planes moved, this light did not. we stopped at a sharp curve in this road which is the perimeter to a local airfield (double eagle?). there are no streetlights at this point and this area is considered \"behind the volcanoes\" which, i guess, means something to you if you're from this area. (it's a dark area from which to view the albuquerque \"valley\" and see the entire city from a terrific perspective.) the photos i took are not really very good. these were taken with a panasonic lumix f 2.8 25-600 mm camera, which i had on me in a backpack for my visit with my friend and her family, as well as to capture our day outings in and around the albuquerque area. the photos simply show a bright light. it's odd because there was no moon visible in the sky tonight and this object, to the naked eye changed colors to include flashes of bluish-green, red orange and yellow before descending below an apparent cloud cover, as the light lit up a layer of low clouds making the light a muted, warm orange, and making it apparent that this light was descending behind\\below the cloud cover. finally, even the warm bright light wasn't visible as even a muted light in the sky and we drove to my friend's home in the albuquerque area. we thought maybe a weather balloon? do they emit bright lights that appear constant? did anyone else see this tonight?"],"Date of the Event":"10/27/2013 08:40 UTC","Summary":"Saw very bright light in the SW sky outsde city limis of Albuquerque, NM","Disposition":"Unresolved","Date Submitted":"10/27/2013 11:41 UTC","Region":"New Mexico","Sighting Duration":"Undisclosed","City":"Albuquerque","Object Features":"None","files":["/var/www/straped/mufon/html2text/51892.html.txt","/var/www/straped/mufon/more/51892_submitter_file10__P1000950.JPG","/var/www/straped/mufon/more/51892_submitter_file1__P1000941.JPG","/var/www/straped/mufon/more/51892_submitter_file2__P1000942.JPG","/var/www/straped/mufon/more/51892_submitter_file3__P1000943.JPG","/var/www/straped/mufon/more/51892_submitter_file4__P1000944.JPG","/var/www/straped/mufon/more/51892_submitter_file5__P1000945.JPG","/var/www/straped/mufon/more/51892_submitter_file6__P1000946.JPG","/var/www/straped/mufon/more/51892_submitter_file7__P1000947.JPG","/var/www/straped/mufon/more/51892_submitter_file8__P1000948.JPG","/var/www/straped/mufon/more/51892_submitter_file9__P1000949.JPG","/var/www/straped/mufon/org/51892.html"],"Object Flight Path":"Hovering then path","Country":"United States","Latitude":"35.116213","Source":"MUFON","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.116213,+-106.607051(51892)&iwloc=A&hl=en\"> mufon case (51892) map </A>","Log Number":"US-10272013-0026"}