{"Latitude":"40.339418","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/51897.html.txt","/var/www/straped/mufon/org/51897.html"],"Disposition":"Unresolved","Object Shape":"Circle, Other","Longitude":"-75.918305","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.339418,+-75.918305(51897)&iwloc=A&hl=en\"> mufon case (51897) map </A>","Weather Factors":"Unknown","Case Number":"51897","Date Submitted":"10/28/2013 08:26 UTC","Log Number":"US-10282013-0004","Object Features":"Wings","Viewing Distance":"Over One Mile","Summary":"I witnessed Four jets, i thought they were drones at first until i used binoculars. Then i saw a white orb VERY high up","Country":"United States","Region":"Pennsylvania","City":"Reading","Object Flight Path":"Stationary,Straight-line path","trends":["There have been 42 other sightings in Reading","There were no other sightings in Reading on or around October 28th 2013"],"divs":["Sighting DetailsAt 7:55 AM I was walking my dog when I saw a strange craft flying overhead to the west. I thought it was a drone, it was silver was long and had short wings closer to the tail then the nose. A minute later another was following it at the same altitude in the same direction. They reflected silver from the morning sun and left no comtrail like other commercial jets off in the distance. Then I saw a third, same direction, same altitude. I went home and got my brother and told him to look and then we saw a fourth flying in the same direction. I had my binoculars this time and looked at it. it has two engines by its rear tail, like a Learjet. But it looked longer and the wings were swept back. Not a drone, although I will research what they look like. But then I noticed very high up, a white orb extremely high up. It never moved and I kept my eyes on it. I thought it might be a very bright star but Ive never seen one this late. I looked at it for 5 minutes and it never moved, this was until about 8:05 AM. I thought maybe it was a weather balloon, but the odd jets made me wonder if it wasnt something else."],"Tags":"City","Date of the Event":"10/28/2013 08:05 UTC"}