{"Source":"MUFON","Latitude":"47.969173","Tags":"City","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Log Number":"US-10272013-0025","Date Submitted":"10/27/2013 09:52 UTC","Case Number":"51891","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/51891.html.txt","/var/www/straped/mufon/org/51891.html"],"trends":["There has been one other sighting in Lake Stevens","There were no other sightings in Lake Stevens on or around July 4th 2013"],"Date of the Event":"07/04/2013 09:45 UTC","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","divs":["sighting detailsit was fourth of july 2013 approximately 9:45 pm. it was just dark enough to observe fireworks displays so i went outside. i looked to the ne, and an unknown strange glowing object caught my eye. it wasn't acting like any normal firework, so i sprinted inside and grabbed my video camera. when i came back outside and started recording, the light was slowly moving south from the north east, and was not making a sound unless it sounded like popping fireworks. i figured it to be moving maybe 2-5 mph tops. i was startled, and my heart was racing with questions. the more i watched this glowing pulsating red orange ball the more i began to realize it wasn't normal it wasn't a plane or helicopters. as i tried to follow the object with my camera, it was moving further away. then it just disappeared like a light switch. i watched the skies for another minute or so, when like a light switch, it was back due east and twice is high as before. i begin filming a second time but it was just too far away to capture any good quality as you will see in the first video. the object appeared to be 1\\4 mile away and i could not determine size. from my vantage point it was the size of a tennis ball. when i first witness the object i knew it wasn't a firework because of its manorism, shape, and pulsating nature. it was mostly all red with a pulsating orange in the middle. seeing this object at first scared me but then i became 110% curious. i still would like to know what it was, as this incident remains in my daily thoughts. the reason i am coming forward now is because i would like some answers, and if there is a 1% chance of this being a true ufo sighting, unlike my government i would like to make it public knowledge."],"Country":"United States","Weather Factors":"Unknown","City":"Lake Stevens","Sighting Duration":"00:03:30","map":"<A HREF = \"http://maps.google.com/maps?q=47.969173,+-122.119418(51891)&iwloc=A&hl=en\"> mufon case (51891) map </A>","Longitude":"-122.119418","Region":"Washington","Object Features":"None","Summary":"I went outside to watch fireworks displays, when a strange unknown object caught my eye."}