{"Source":"MUFON","Log Number":"US-10282013-0006","City":"Tucson","Region":"Arizona","Disposition":"Unresolved","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around September 9th 2013"],"files":["/var/www/straped/mufon/html2text/51899.html.txt","/var/www/straped/mufon/org/51899.html"],"Sighting Duration":"Undisclosed","Longitude":"-110.834226","Date Submitted":"10/28/2013 12:22 UTC","Summary":"Really large and hovering over neighbourhood; glided VERY slowly to the north.","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","Object Flight Path":"Hovering then path","divs":["Sighting DetailsI was driving home from (west) the gym at approx 6:30 p.m. - 7:40 p.m. when I noticed 3 distinct lights in a row hovering without any movement over tree tops in my neighborhood - white, red, blue. I drove up the street and stopped next to it - it didn't move. It was approx. the size of a small house (lenght) or the size of 2 school buses. It was approx 500 ft away from me and no more than 400 ft. in elevation. It made no sound (I turned off music in my car and opened window). It was a dull gray or putty color, and had a slight curved bottom contour - I could not see the top of it bc of my close proximity to it, but I think it was slim sized. I live about 8 miles from Davis-Monthan AFB, so I know how the military jets, planes, helipcopters, etc. look like. The object did not have wings, fins, tail, rotors, propellers, landing gear, antennas, windows, markings or lettering or any kind. After the object hovered for a few minutes, it \"glided\" very slowly to the north. I followed it in my car driving approx 10-15 mph. I thought it was headed toward a park at the end of the street that was highly illuminated with stadium lights bc there was a loud event occurring, but it did not fly directly over it, just by the park headed north. I was mesmerized and my heart was pounding, although I did not feel endangared...I lost sight of it as it glided off (and slowyly ascended) to the north, toward the Catalina Mountains. The next day I called the Community Relations number at Davis-Monthan AFB to inquire if they had flown a weather balloon, blimp, or surveillance craft over the my neighborhood the evening prior, but they stated they do not have that sort of craft. Nothing in the news the next day. I wonder if anyone in Tucson filed a similar report? Can this sighting be rationally explained?"],"Object Features":"None","Date of the Event":"09/09/2013 06:35 UTC","Latitude":"32.187777","Case Number":"51899","Object Shape":"Oval","Tags":"City","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=32.187777,+-110.834226(51899)&iwloc=A&hl=en\"> mufon case (51899) map </A>"}