{"Latitude":"40.089104","Tags":"City","Log Number":"US-10282013-0010","Longitude":"-82.802836","Summary":"Awakened by light movement thru window blinds. Observed what at first appeared a helicopter stop at 129 degree SE from 1:30 AM to 3:38 AM remain in one spot hovering/wobbling, emitting light.","Date Submitted":"10/28/2013 04:37 UTC","City":"New Albany","Viewing Distance":"Over One Mile","divs":["sighting detailsat 1:30 am i awakened from the flashing and moving of lights through my blinds. got up noticed 1\\2 moon, couple of stars and usual activity of helicopters (path from morse\\hamilton around new albany area they usually circle in day and evening. generally 3-5 helicopters and some small planes most evenings. i noticed to the right side one helicopter was brighter like a star east of the rooftop of building behind me. it appeared to move behind the building sideways in straight line so i put on glasses and checked the time on my phone 1:47 am. this light was brighter and didn't have the red blinking light of other helicopters. although the light was facing me it moved slowly from east to se ( compass 129 degree se. it stopped over the rooftop(left side) , emitting light like a star. after a few minutes i decided to time it to see how long this helicopter stayed in place. at 2:02 am it still hadn't moved but i was aware bobbling and wobbling like a top (not a helicopter) & not like a star. i was aware of bright light flashes coming from the top & as the light hit the clouds around it i noticed it was definitely round orb like, and although it was clear outside small clouds were around the parameter of it (a small space of no clouds around it, then small clouds around that space). it would emit a red or green light that wasn't evident until the light bounced off the cloud. at 3:07 am, a red thin flash like a lazer beam shot out of the bottom, but when it hit a cloud below it didn't go through the cloud it rippled across both sides of the cloud. that was interesting. this happened within seconds and only once. i became aware of several very tiny stars i had not noticed next to it, but as i blinked were gone. at 3:10 am the object shot to left about 2 feet, then shot to right, then up and down and then stopped all within the area i was watching. it just seemed to hover and wobble in place. at 3:38 am i decided to go back to bed. it was not there the next when i woke up or the next night. i wish i had had binoculars. there have been military helicopters in the area during the daytime so this may be a test flight area for new equipment. but it was unlike the helicopters i have seen."],"Object Shape":"Sphere, Star-like","Sighting Duration":"Undisclosed","Case Number":"51904","Region":"Ohio","Date of the Event":"10/26/2013 01:30 UTC","Weather Factors":"Unknown","Disposition":"Unresolved","trends":["There have been 11 other sightings in New Albany","There were no other sightings in New Albany on or around October 26th 2013"],"files":["/var/www/straped/mufon/html2text/51904.html.txt","/var/www/straped/mufon/org/51904.html"],"Source":"MUFON","Object Flight Path":"Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=40.089104,+-82.802836(51904)&iwloc=A&hl=en\"> mufon case (51904) map </A>","Object Features":"Unknown","Country":"United States"}