{"Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","divs":["sighting detailsfour of us witnessed while driving south west near jordan river\\sooke vancouver island bc between 8 and 9 pm.noticed it was a bright glowing orange object and was hovering above the water. we pulled over to see what it was as you could tell it was not a star because of the shape and colour of it against the backdrop of the night sky. at first being skeptical, we tried to deduce what it was - maybe chinese lantern, or helicopter? after watching it for about 30 min in which time we witnessed it hovering, then changing colours and moving abruptly from side to side then shooting straight up and then straight down and at time wobbling we realized it was nothing we ever seen before. we have video and pictures taken with our cell phones when blown up show a glowing white orb with a dense center. we were skeptical at first until we seen its actions then were frightened especially when it looked like it was coming towards us. it eventually disappeared tree level in the olympic mountains. just before it disappeared another object the same appeared lower just above the water and just hovered there. an airplane flying well above these objects was noticed also but looked like a regular passenger plane with lights blinking."],"Latitude":"48.420459","Source":"MUFON","City":"Jordan River","Disposition":"Unresolved","Object Shape":"Disc, Flash, Other","Longitude":"-124.044797","trends":["There have been no other sightings in Jordan River","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/51909.html.txt","/var/www/straped/mufon/org/51909.html"],"Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=48.420459,+-124.044797(51909)&iwloc=A&hl=en\"> mufon case (51909) map </A>","Weather Factors":"Unknown","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Date of the Event":"10/27/2013 12:00 UTC","Date Submitted":"10/28/2013 08:56 UTC","Tags":"City","Summary":"Object observed near Jordan River Area BC near Olympic Mtn. Object changed colours and flight patterns abruptly and hovered.","Region":"British Columbia","Log Number":"CA-10282013-0015","Case Number":"51909","Country":"Canada"}