{"Log Number":"US-10282013-0013","Country":"United States","Region":"California","Object Shape":"Sphere","Source":"MUFON","Object Flight Path":"Hovering then path,Path with directional change","trends":["There have been 18 other sightings in Dana Point","There were no other sightings in Dana Point on or around August 3rd 2013"],"files":["/var/www/straped/mufon/html2text/51907.html.txt","/var/www/straped/mufon/org/51907.html"],"Date of the Event":"08/03/2013 08:41 UTC","City":"Dana Point","Longitude":"-117.68222","Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=33.478477,+-117.68222(51907)&iwloc=A&hl=en\"> mufon case (51907) map </A>","divs":["Sighting DetailsI was walking Lola, my little yorkie and talking to my friend on the phone, when I saw a red light up above me it was about half a minute when I told my friend I needed to take a picture of it and I would call her back,.. using the video in my phone to record it. I was moving south, and I noticed the light from the west it started movin erratically and changing colors, from red to white and also sizes and shapes, when it finally stopped, it was moving very slow towards the east almost hiding behind a very tall tree, I followed around with my camera, until it faded away and disappear. I really don't know what I was feeling I just knew that whatever I was seeing it wasn't normal, I was a little bit confused but something in me said I needed to take picture, believe it or not I kinda put it out of my mind until I saw the video again, then I knew I had to share it but I didn't really know how to go about it I felt funny telling people (I have a video of a UFO)."],"Weather Factors":"Unknown","Tags":"City","Case Number":"51907","Latitude":"33.478477","Sighting Duration":"Undisclosed","Summary":"I noticed a round red and white pulsating light up above my head it seemed to be observing me and following me across my path from west to the east","Date Submitted":"10/28/2013 05:52 UTC","Disposition":"Unresolved","Object Features":"Patterned Surface"}