{"City":"Phoenix","Longitude":"-112.192746","map":"<A HREF = \"http://maps.google.com/maps?q=33.39379,+-112.192746(51902)&iwloc=A&hl=en\"> mufon case (51902) map </A>","Source":"MUFON","Weather Factors":"Unknown","Summary":"Object glimpsed above eastern horizon moving westward, reflected morning sun.","files":["/var/www/straped/mufon/html2text/51902.html.txt","/var/www/straped/mufon/org/51902.html"],"Log Number":"US-10282013-0009","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around October 28th 2013"],"Disposition":"Unresolved","Date of the Event":"10/28/2013 08:06 UTC","Object Shape":"Sphere","Object Features":"None","Country":"United States","Tags":"City","Sighting Duration":"Undisclosed","Region":"Arizona","Latitude":"33.39379","Case Number":"51902","divs":["Sighting DetailsI live in the west valley of Phoenix in Laveen at 33∘22'59\"N, 112∘10'30\"W. This morning while on the back porch facing due east at approximately 0806, I saw what appeared to be an object well above the flight pattern reflecting the morning sun on a heading just slightly south of due west. My home is in the primary flight path for Sky Harbor, so commercial aircraft are a frequent and constant sight. Aircraft overflying Phoenix at altitudes above 20,000 feet heading westward in the same approximate area as the UFO I saw are also a common, everyday occurrence. As an avid sky-watcher I keep binoculars close at hand (Tasco 7X35), and the apparent lack of traditional aircraft features and contrails piqued my curiosity. On the horizon at first glimpse the object was reflecting the sun, appeared roughly the size of a baby aspirin, and was traveling at a rate consistent with high flying aircraft, but slower than satellite traffic. Through the binoculars the object was approximately dime-sized, apparently metallic with a highly reflective surface, and clearly discernible as a perfect sphere. No visible wings, no contrails, no heat signature - just a highly polished, metallic sphere that I kept in the binoculars for roughly 3-5 seconds. When the object was 15 degrees east of being directly overhead, I grabbed my iphone to capture an image, maintaining eye contact with the steadily moving object, then watched it vanish instantaneously. I had roughly 30 degrees of visibility before the object would've been blocked by my home, and quickly ran to the rear of my yard which affords a full view of the objects westward path. Visibility was open with only the faintest hint of clouds, and the entire western horizon was devoid of any aircraft whatsoever. I could still clearly identify commercial aircraft to the north and east in the pattern, but the object I'd been following simply disappeared. I grew up around military aircraft, served in the Marines and also in the Air Force as a C-130 Loadmaster. I am VERY familiar with commercial and military aircraft, and have been trained as a professional observer. This object was highly visible, and did not appear to possess any characteristics of any aircraft I've ever seen before, Nor did it resemble high-altitude weather balloons, which I've seen on numerous occasions. It was visible in one instance, then gone without a trace in the next. Truly remarkable sighting, and I hope I wasn't the only one in Phoenix to catch a glimpse of it."],"Date Submitted":"10/28/2013 02:33 UTC","Object Flight Path":"Straight-line path"}