{"Longitude":"-78.267163","Viewing Distance":"Over One Mile","Region":"North Carolina","files":["/var/www/straped/mufon/html2text/51911.html.txt","/var/www/straped/mufon/org/51911.html"],"Case Number":"51911","Object Shape":"Disc","Object Features":"None","City":"Holden Beach","Date of the Event":"10/24/2013 09:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.914102,+-78.267163(51911)&iwloc=A&hl=en\"> mufon case (51911) map </A>","Log Number":"US-10282013-0017","Tags":"City","Country":"United States","trends":["There have been 2 other sightings in Holden Beach","There were no other sightings in Holden Beach on or around October 24th 2013"],"Weather Factors":"Unknown","divs":["Sighting DetailsBeverly saw the object first as they were heading out to breakfast. Dennis also saw the object. It took about 4 minutes from the time they saw the object and then took picture with I-phone camera. They started looking at it at 9:10 AM. I seemed to be about 4 miles off-shore. It was not a sea plane. The binoculars they used was 10 x 50mm strength. You could see it was something hover over the water once the got the binoculars. It then took off away from the witness toward the horizon. The total amount of time they saw the object was about 20 minutes. The picture was taken at 9:26 AM. Not sure if the craft was sucking up water because it seem so strange. But that is what it looks like in the picture. I am attaching the screenshot of the picture but the witness will e-mail the original. Dennis wears glasses but did not have them on him. When they used the binoculars they could tell it was definitely above water. At first they thought it may be a boat but not after they used the binoculars. About 2:00 PM on the 800 block on the same street they saw 2 military green helicopters that were side by side. The were surprise that they hovered over the neighborhood. They were heading east. The saw them hover for about 30 seconds. Stop and go movements over the neighborhood. They said they have see helicopters going down the beach but they have never seen them hovering over the houses."],"Disposition":"Unresolved","Source":"MUFON","Object Flight Path":"Hovering then path","Summary":"UFO seen hovering over ocean an sucking up water","Date Submitted":"10/28/2013 10:46 UTC","Sighting Duration":"00:20:00","Latitude":"33.914102"}