{"Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=30.23402,+-97.626406(51919)&iwloc=A&hl=en\"> mufon case (51919) map </A>","Summary":"stargazing when an orb whent from N to S and seemed to hit an inviable wall at that moment a huge ship was revealed ejecting same type of orb in opposite direction which seemed to hit another cloaked ( never saw what was shooting from N)","Date Submitted":"10/29/2013 01:15 UTC","Longitude":"-97.626406","Case Number":"51919","Sighting Duration":"Undisclosed","Tags":"City","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-10292013-0005","divs":["Sighting DetailsI was star gazing, looking east when I decided to lean back and look overhead. I observed 2 or 3 orbs going from north to south ( short distance- 3 fist wide?), that is when what has to be a HUGE ship uncloaked and engaged sending the same type of plasma fire ball back which would just disappear behind some type of cloak. The ship would re-cloak and only be visible when firing. This went on between 3 to 5 minutes. This ship was huge and reminded me of something out of \"starwars\", needless to say I was very scared and it put a hamper on my star gazing for sometime. It was stationary and then it was over and just disappeared. I was so stunned and did not want to believe what I had seen, I observed for approximately another hour and nothing. I was so stunned and scared, that I finally woke my husband who believed me but wanted to calm me saying that just probably meteorites. I've seen hundreds if not thousands of meteorites, they don't come from ships."],"Weather Factors":"Unknown","Country":"United States","Object Features":"Window(s), Appendage(s), Wings","files":["/var/www/straped/mufon/html2text/51919.html.txt","/var/www/straped/mufon/org/51919.html"],"Object Flight Path":"Stationary","City":"Austin","Source":"MUFON","Latitude":"30.23402","Date of the Event":"06/05/2012 11:30 UTC","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around June 5th 2012"],"Region":"Texas"}