{"Object Features":"None","Longitude":"-84.677229","Weather Factors":"Unknown","Log Number":"US-10292013-0004","Summary":"Has recurred every night since I reported it first last week. Same flight pattern, same time each evening.","Viewing Distance":"101-500 Feet","Object Flight Path":"Hovering then path","Latitude":"37.511076","City":"Stanford","Object Shape":"Circle, Fireball, Star-like","Tags":"City","Date Submitted":"10/29/2013 12:44 UTC","Sighting Duration":"01:30:00","Country":"United States","Date of the Event":"10/24/2013 07:20 UTC","Region":"Kentucky","divs":["Sighting DetailsThis has been an ongoing event since I first reported it last week. Fortunately, it has mostly been clear at night with the exception of one night and that was just scattered cloud cover. So I was able to observe the orb again. It always starts to appear right before dark, before stars even appear. It seems to be the size of Jupiter or Venus when I first see it, but it appears to grow nearer and larger and much brighter. It was so bright and large at one time, that my eyes were very sensitive to it and it bothered me to look at it. As it reaches it's most brightest and largest size, it appears right over top of the sky over the hill of my neighbors house. Then, it begins to slowly move away (backwards) and grow dimmer. Then off to the left where it seems to grow bright once again, and then it descends slowly behind the hillside of trees. It repeats this exact pattern each night. My entire family has witnessed this event several nights in a row. We could not see anything not even stars last night because it has been raining and cloudy here since yesterday. I do not have any feeling of anything threatening or evil, it's just kind of like I am curious as to what it is, I guess I am still searching for a logical explanation. I tried to get video, my camera didn't do very well but I did manage to get a few pics, so did my sister of the one she saw just 11 miles away. When the sky is clear, we will continue to watch and will report any further sightings. If anyone is seeing anything similar to this, it looks like a gigantic star that moves very slowly, please report it so we can find out what it is."],"trends":["There have been 2 other sightings in Stanford","There was one other sighting in Stanford on or around October 24th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.511076,+-84.677229(51918)&iwloc=A&hl=en\"> mufon case (51918) map </A>","files":["/var/www/straped/mufon/html2text/51918.html.txt","/var/www/straped/mufon/org/51918.html"],"Case Number":"51918","Disposition":"Unresolved","Source":"MUFON"}