{"Object Features":"Unknown","Date Submitted":"10/28/2013 10:47 UTC","trends":["There have been 65 other sightings in Baltimore","There were no other sightings in Baltimore on or around October 28th 2013"],"Longitude":"-76.572349","Log Number":"US-10282013-0018","Latitude":"39.292386","City":"Baltimore","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.292386,+-76.572349(51912)&iwloc=A&hl=en\"> mufon case (51912) map </A>","divs":["Sighting DetailsI live in a 5th floor apartment in downtown baltimore. My wall facing the north is a huge window that stretches in parts from the living room, dining room to the bedroom. I have a clear view of the John Hopkins Hospital, The Inner Harbor, Downtown and also North East Baltimorew City. This was a massive sighting. All the lights were off inmy house and at first I noticed 3 blinking white lights overhead. From there I witnessed many objects coming in from the west. They would suddenly appear over the Big downtown Baltimore Cemetery that is adgacent to GreenMount Aveneue between Preston Street and North Ave. They started to come in a processsion, a parade. Most were moving at the same altitude but there were others that were lower and others which were higher. I have a pair of binoculars and focused in on both ones near and far. The shapes of the crafts were very hard to determine but the way the lights pulsated and blinked in a pattern was quite different than anything I ever saw before. I have never witnessed hardly any aircraft flying in the area. I mean this is Downtown Baltimore and like most major cities, I am positive this is a NO FLY ZONE. I called two friends over and they were astounded. I tried to film it with my digital camera and even though I focused the camera directly on many ships, the ship and the lights would not show up. I tried numerous times. I attempted to take pictures with my cell phone and also with my digital camera. What I was seeing with the naked eye, was not appearing on any of my electronic devices. After about an hour or an hour and a half, the sky quieted down some. In the inital procession, I think it is fair to say there were at least 30 ships that moved by. Another thing I noticed when looking through the binoculars, they were not moving like a plane or helicopter does. They sort of thrusted and jolted every few seconds like with bursts if energy they appeared to be gliding in small bursts. I also noted a few that moved in absolutely strange and unfamiliar patterns like a pryamid. I continued to watch out the window and more came. So many flew into, over, around and then away from downtown baltimore, I soon lost count. it had to be over 100. There were no sounds. However when a helicopted was flying in the same distance, you could hear it. Also when they would fly over the joh Hopkins complex they would begin to glow very white and very bright and the green and red lights would disappear. They also looked like this over the inner harbor but it is a little distance from my building so I am not sure if I was able to really get an accurate description from that far. I am certain of what I saw and I am saddened I could not get any type of video or picture of it. But I did have two witnesses. And a third one if you include my friends dog who climbed up in the window and you could tell he too also sensed something there. I hope other people in Maryland saw this and come forward. I will continue watching this evening. It is now 10:45Pm. I just lloked out he window the west and there is an ENORMOUS ONE appraohing. I will return tomorrow and add a new report if needed and continue to watch the skies tonight and tomorrow and after wards too."],"Sighting Duration":"Undisclosed","Region":"Maryland","Source":"MUFON","Object Shape":"Cylinder, Other","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other,Unknown","Country":"United States","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Disposition":"Unresolved","Tags":"City","Date of the Event":"10/28/2013 12:00 UTC","files":["/var/www/straped/mufon/html2text/51912.html.txt","/var/www/straped/mufon/org/51912.html"],"Case Number":"51912","Summary":"Mass Sighting Many Objects with Lights Flying Right Over Inner Harbor & Downtown"}