{"Weather Factors":"Unknown","Log Number":"CA-10292013-0008","Region":"British Columbia","Sighting Duration":"Undisclosed","Date of the Event":"10/26/2013 05:30 UTC","Case Number":"51921","Object Features":"Unknown","Summary":"Glowing orange sphere moved upwards, flashed brightly, then disappeared.","files":["/var/www/straped/mufon/html2text/51921.html.txt","/var/www/straped/mufon/org/51921.html"],"Object Flight Path":"Unknown","City":"Chilliwack","Source":"MUFON","Date Submitted":"10/29/2013 03:17 UTC","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Country":"Canada","Longitude":"-121.811536","Latitude":"49.093706","divs":["Sighting DetailsMy wife and I were out hunting grouse on a logging trail SE of Ryder Lake, near Chilliwack, BC. We stopped to photograph a beautiful view of the valley and surrounding mountains when we noticed a small orange sphere flash quickly (almost like a reflective flare) and disappear. It was a very brief glimpse and we did not think anything of it. We did not realize that we had captured the image on camera until later that evening. I assumed at the time that it must have been a strange reflection off something in the valley below us but upon viewing the photographs assumed it was a lens flare resulting from the reflection off something. A friend of mine suggested sending it to her fiancee who is an film editor so he could try to clean up the image to better view it. However, he suggested it was not lens flare because we saw a flash with the naked eye, and because while the sphere moves, we were not moving while taking the photograph. This submission is the result of jovial pressure from a friend for an expert to follow up. I would be happy to send you the original photographs upon request but as I am writing this from work cannot do so."],"trends":["There have been 9 other sightings in Chilliwack","There were no other sightings in Chilliwack on or around October 26th 2013"],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=49.093706,+-121.811536(51921)&iwloc=A&hl=en\"> mufon case (51921) map </A>","Tags":"City","Object Shape":"Circle, Sphere"}