{"Region":"Oregon","Case Number":"51929","divs":["Sighting DetailsA few weeks ago I started witnessing small UFO crafts flying in a similar path every night, one after the other, and for about four hours from 7:00 p.m. to midnight, when I go outside to view the clear night skies. The crafts descend into the trees across the street, along the branches, and change into small blinking orb like lights. The small blinking lights also resemble stars as well. Sometimes the crafts move back and forth between the trees and get very bright like a huge star. Most of the time the lights blink off and on, and sometimes disappear before my eyes. I do not see them during the day, and so I am not sure if they remain in the sames place. My mother and my brother have both witnessed the lights as well. I do not want to sound paranoid, but at times I feel the lights play hide and seek, and move behind the branches to hide. Sometimes, I feel like they are watching us. There are more lights coming every night, and lately the lights stay hidden more then they make themselves noticeable. I just want to know what the lights are, and if anyone else is seeing anything like this too?"],"Disposition":"Unresolved","Country":"United States","Latitude":"45.525072","Longitude":"-122.669507","Date Submitted":"10/30/2013 04:44 UTC","Sighting Duration":"Undisclosed","Object Shape":"Circle, Flash, Star-like","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Summary":"A few weeks ago I started witnessing small UFO crafts flying over my brothers place, one after another, every night from 7:00 p.m. to midnight descending into the trees. They are small and without noise, and seem to change into star or orb like lights.","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/51929.html.txt","/var/www/straped/mufon/org/51929.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=45.525072,+-122.669507(51929)&iwloc=A&hl=en\"> mufon case (51929) map </A>","Tags":"City","City":"Portland","Source":"MUFON","Log Number":"US-10302013-0002","Viewing Distance":"21-100 Feet, Over 1 Mile, Unknown","Date of the Event":"10/29/2013 12:00 UTC","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around October 29th 2013"]}