{"files":["/var/www/straped/mufon/html2text/51927.html.txt","/var/www/straped/mufon/org/51927.html"],"Object Flight Path":"Stationary","Longitude":"-80.493258","Disposition":"Unresolved","Case Number":"51927","Sighting Duration":"01:00:00","Region":"Ontario","Viewing Distance":"21-100 Feet","Object Features":"Other","Object Shape":"Circle, Other","Date Submitted":"10/29/2013 11:57 UTC","Source":"MUFON","Tags":"City","Log Number":"CA-10292013-0014","divs":["Sighting DetailsI returned home after a closing shift at Home Depot about 2345 in mid Oct. (no sure of the year but was close to the turn of the century). I wanted to see a passing comet which was supposed to be at it's best that night. However; there was a very heavy fog that night, and as I got out of the car in my drive, I noticed a large ship about 60 ft in dia. with 5 large lights glowing like 40 watt lights in the back yard beside a hydro power line. It reminded me of a surgical theatre light in a hospital! It was painted a 'battle-ship' grey. The sides of the ship went up at 90 degrees into the fog ( I was unable to see the top of the ship or any windows). It hovered about 40 - 50 ft off the ground and I was able to walk up to and under it. It made no sound at all! There was a fairly stiff wind blowing at the time, but the craft hovered \"rock-solid\" against it. I suspect that it was watching aircraft that might be making an ILS approach to the local airport (CYKF) as the ILS beam of runway 26 runs just to the north of its position. It would be hidden from radar because of a large hill just to the east. The captain must have know his position very well since he was sitting beside a 110,000 volt power line not more that 50 ft away. My impression was not fear but amazement. To see first hand that UFO's DO exist and are not just unexplained lights in the sky. The weather was getting bad and I thought it better to go into the house. Thus, I don't know how long it was there. I didn't have a camera so no other evidence other than a sketch is available."],"Latitude":"43.416104","Date of the Event":"10/25/2002 11:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.416104,+-80.493258(51927)&iwloc=A&hl=en\"> mufon case (51927) map </A>","City":"Kitchener","trends":["There have been 15 other sightings in Kitchener","There were no other sightings in Kitchener on or around October 25th 2002"],"Summary":"Look like a round light normally found in a hostial sergical room with 5 large solfty glowing lights in the bottom.","Country":"Canada","Weather Factors":"Unknown"}