{"Summary":"Saw orbes/ then mother ship with bottom door open, extremely bright.","Case Number":"51924","Object Features":"Unknown","Tags":"City","divs":["Sighting Details Coming back from Tampa on highway 60 to home in June of this year around 8:30 or 9:00 PM in a very remote part of the highway looking toward Interstate 95 I saw orbs moving around in different directions in the sky. The orbs moved back and forth then merged and headed toward the ocean. As I kept moving East I saw a huge craft which was very bright and about the size of a football stadium. I remained very calm, had a camera next to me but did not take any pictures, just remained calm. The object was moving very slow and coming toward me about 500 feet to 1000 feet off the ground and absolutely silent. The object got really close about 20 yards away I looked up and could see that the whole bottom was open and could see up inside the object. There were structural beams inside as possible docking stations. The whole bottom was extremely bright. I was so fixed at looking at the bottom I am not sure what the structure was, possible acorn or oval. This thing was huge, as big as a stadium and so extremely bright. I just remember having no fear, no excitement, but possibly some memory loss."],"Viewing Distance":"21-100 Feet","Latitude":"27.640296","Object Shape":"Oval","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=27.640296,+-80.619586(51924)&iwloc=A&hl=en\"> mufon case (51924) map </A>","Region":"Florida","Country":"United States","Object Flight Path":"Straight-line path","City":"Vero Beach","Log Number":"US-10292013-0011","trends":["There have been 14 other sightings in Vero Beach","There were no other sightings in Vero Beach on or around June 10th 2013"],"Disposition":"Unresolved","Weather Factors":"Unknown","Longitude":"-80.619586","files":["/var/www/straped/mufon/html2text/51924.html.txt","/var/www/straped/mufon/org/51924.html"],"Sighting Duration":"Undisclosed","Date of the Event":"06/10/2013 12:00 UTC","Date Submitted":"10/29/2013 07:28 UTC"}