{"Sighting Duration":"Undisclosed","City":"Plymouth","Object Shape":"Teardrop","Disposition":"Unresolved","Source":"MUFON","Tags":"City","Summary":"I watched a teardrop shaped metal object maybe the size of a car or larger hover overhead from my neighbors backyard into mine. it changed directions a few times. hovered in one place for a while too. It was clearly turning like a top and was reflecting","Object Features":"Other","Date of the Event":"05/08/2000 03:41 UTC","Latitude":"41.684283","Date Submitted":"10/30/2013 03:08 UTC","divs":["Sighting DetailsI was out in my backyard with my friend and my sister. We were just hanging around and could not have missed the object as it was large and lower than a helicopter would typically fly. It was closer to my neighbors backyard but hovered over towards us. I was in awe and excited and happy as i had always hoped to see such a thing. It was silver and acorn like or a tear drop shape. My guess is that it was only 180 feet high. It was almost directly overhead. I witnessed it along with my friend and sister. It was silent and moved in the horizon toward the east or NE. It stopped, went down toward the ground some. this is all very slow. Then back up. It seemed to do a slow zig zag as if it were checking out or observing the area and maybe even us. I waved at the object repeatedly. This made my friend and sister nervous. I think it may have seen us there. It was NOt a balloon. It was more round toward the bottom and spun quickly. Plus the way it moved a balloon could not. It hovered about 70 degrees above us for a while this way then when it left it ascended diagonally toward the north east gradually but once it was about, i would say 400 feet( maybe?) it was going so fast that it completely disappeared into the atmosphere within a second. I was hesitant to move and watched it the whole time. I could have run for a camera but I did not want to miss seeing it."],"Country":"United States","Weather Factors":"Unknown","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","trends":["There have been no other sightings in Plymouth","This sighting has never been favorited."],"Case Number":"51937","files":["/var/www/straped/mufon/html2text/51937.html.txt","/var/www/straped/mufon/org/51937.html"],"Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=41.684283,+-73.013222(51937)&iwloc=A&hl=en\"> mufon case (51937) map </A>","Log Number":"US-10302013-0009","Longitude":"-73.013222","Region":"Connecticut"}