{"Disposition":"IFO","Object Features":"None","Sighting Duration":"Undisclosed","Tags":"City","Longitude":"-118.319701","Weather Factors":"None","Viewing Distance":"Over One Mile","Region":"California","Date of the Event":"05/05/2006 11:15 UTC","City":"Los Angeles","map":"<A HREF = \"http://maps.google.com/maps?q=34.102459,+-118.319701(5193)&iwloc=A&hl=en\"> mufon case (5193) map </A>","Country":"United States","Summary":"A friend and I saw a two pair of glowing objects slowly rise over Hollywood and drift North","divs":["sighting detailsmy friend and i were smoking a cigarette on my balcony and noticed two pairs of lights in the sky. we initially thought they were two pair of balloons from their odd way of moving. the two lights in each pair kept a slight distance from each other but were moving in near circles, rotating on a common axis, then reversing direction when they completed a half circle and swinging back, then changing direction and repeating the movement again and again. picture a see-saw moving up and down with lights at each end. i live in hollywood and there's a lot of light pollution. these objects seemed very bright and relatively low to the ground when we first saw them. i don't see the entire sky, my balcony is on an alley that might be 15 to twenty feet across and the building next door is slightly taller than mine. we saw the objects very low over the roof and in the distance, we could see them clearly enough that we guessed they weren't more than a few blocks away. at first we figured they were baloons that had been let off on highland ave., a nearby major street. we thought maybe they were mylar and were reflecting illumination from nearby streetlights. the two (four?) objects slowly moved north while ascending\\getting smaller in our view and maintaining the short distance between them. after maybe two minutes we began to wonder how we could see balloons so well at night, and why two pairs of balloons were staying so close to each other as they went so high. there were police helicopters in the sky, and by about halfway through the sighting the objects were clearly higher than the copters. we kept wtaching and the objects began to fade from view. neither of us owned a camera, we wished we'd taken pictures. probably four or five minutes in, the pair of objects got too high and small for us to see. my friend and i argued a little over who would write this. he was reluctant, honestly concerned that he might want to run for office or have his family google his name and see this someday. i decided to write this, sit on it for a few days, then edit it. i completely forgot to send this to mufon, though this was my original intention. i had posted a shorter version of this sighting on my blog, which was pretty much mocked by my friends. the url is http:\\\\alexsfink.livejournal.com\\?skip=20 and the entry is just below the halfway point of the page."],"Case Number":"5193","Latitude":"34.102459","Object Flight Path":"Hovering then path,Path with directional change","Log Number":"US-08052006-0003","Source":"MUFON","Object Shape":"Other","Date Submitted":"05/05/2006 11:15 UTC","trends":["There have been 404 other sightings in Los Angeles","There were 2 other sightings in Los Angeles on or around May 5th 2006"],"files":["/var/www/straped/mufon/html2text/5193.html.txt","/var/www/straped/mufon/org/5193.html"]}