{"Latitude":"38.624973","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Date Submitted":"10/30/2013 03:51 UTC","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=38.624973,+-121.417972(51938)&iwloc=A&hl=en\"> mufon case (51938) map </A>","Object Features":"Unknown","Summary":"3 bright red/orange lights in the night sky east of Sacramento","Country":"United States","files":["/var/www/straped/mufon/html2text/51938.html.txt","/var/www/straped/mufon/org/51938.html"],"Log Number":"US-10302013-0010","City":"Sacramento","Tags":"City","Viewing Distance":"Over One Mile","trends":["There have been 83 other sightings in Sacramento","There were no other sightings in Sacramento on or around October 29th 2013"],"Disposition":"Unresolved","divs":["sighting details while on tower ave near fulton ave i noticed two bright red\\orange lights in the sky 35-40 degrees high, slightly south of due east. i immediately felt uneasy because i realized these were out of the ordinary. i stopped and looked at them more closely and could see they were moving to the sw. as i was watching them a third light intermittently appeared from behind the lone cloud in the area. they were all moving on the same line in the sky, the first two were about 5 degrees apart while the third was trailing about 15 degrees behind. i then pulled out my iphone to try for pics or video but i first texted a friend quickly... \"ufo s in the sky!\" when i looked back at the objects they were gone. in a clear area of the sky, gone in 5 seconds. my first thought was airplanes but the lights were too bright, brighter than any star and there was no navigation lights and airplanes could not have vanished that quickly. meteor breaking up was my second guess but they were moving much slower than any meteor i've ever seen and were without any trails of any kind. a few seconds later an airliner flew over heading east from sac intl. into the same area and it was quite obvious it was a plane. i then saw a sattelite traveling east through the same region but my skyview app on my iphone revealed it as an old rocket body. it was much dimmer than the other 3 lights."],"Longitude":"-121.417972","Case Number":"51938","Weather Factors":"Unknown","Object Shape":"Star-like","Source":"MUFON","Date of the Event":"10/29/2013 07:15 UTC"}