{"Tags":"City","Object Flight Path":"Stationary","Viewing Distance":"N/A","divs":["Sighting DetailsI went for a night run at around 9:30pm and I was looking at the sky observing the stars that I could see. There were no clouds around at the time so the airspace was clear with nothing blocking my vision of the stars. Then suddenly I saw in the corner of my eye a dark blue oval shaped object emitting a light that was bright enough for anyone to see. At first I thought it would have been a plane but given the speed and colour of the light beam and how it appeared there was no way it was human. The light was not just on whatever was there the light actually came out. I would describe it as almost like some sort of lighting scan from whatever was in the sky. The light lasted approximately 1.5-2.0 seconds and then once the light beam ended it quickly disappeared not leaving any trail what so ever or sound. After that there was no more sight of the object it just disappeared into thin air .I felt confused as there was no logical explanation as to what I saw but there were no mental or physical changes to how I felt. The street lights and my phone did not have any effect from this either."],"Country":"Australia","Log Number":"AU-10302013-0016","Disposition":"Unresolved","Case Number":"51944","City":"Werrington Downs","Region":"New South Wales","Object Features":"Unknown","Longitude":"150.733231","Date Submitted":"10/30/2013 07:56 UTC","Summary":"A bright blue light. The light was emitted from an oval shape in sky above my street .","files":["/var/www/straped/mufon/html2text/51944.html.txt","/var/www/straped/mufon/org/51944.html"],"Sighting Duration":"Undisclosed","Object Shape":"Disc, Oval","Date of the Event":"10/08/2013 09:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=-33.740445,+150.733231(51944)&iwloc=A&hl=en\"> mufon case (51944) map </A>","Weather Factors":"Unknown","trends":["There have been no other sightings in Werrington Downs","This sighting has never been favorited."],"Source":"MUFON","Latitude":"-33.740445"}