{"map":"<A HREF = \"http://maps.google.com/maps?q=28.558135,+-81.768384(51954)&iwloc=A&hl=en\"> mufon case (51954) map </A>","Summary":"3 red/orange lights triangular in the sky","Weather Factors":"Unknown","Source":"MUFON","Date Submitted":"10/31/2013 11:39 UTC","Object Shape":"Triangle","Tags":"City","Longitude":"-81.768384","Date of the Event":"10/30/2013 12:00 UTC","Latitude":"28.558135","Log Number":"US-10312013-0005","trends":["There have been 7 other sightings in Clermont","There were no other sightings in Clermont on or around October 30th 2013"],"Country":"United States","Viewing Distance":"Over One Mile","Object Flight Path":"Hovering then path","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/51954.html.txt","/var/www/straped/mufon/org/51954.html"],"Case Number":"51954","divs":["sighting detailsi was driving in my car and my 14 years old daughter were on her passenger seat. we were on north 27 highway from walmart on cagan crossing on the way home. i looked up in the sky because i love to see the stars and then i spotted 3 red\\orange lights triangular and it was so visible. i closed my eyes and opened to make sure it was just a trick. the lights were still there and didn't move. i tapped my daughter and asked her to check the lights out. i had to look close to see if the lights were flashing like airplane and helicopter flash their lights and their lights should be very bright like blue and white..sometime, red. she said ufo aloud and we were laughing but we were baffling because we never seen that kind of lights. then one right light vanished instantly and marked red glow like an aura that was moving right on the direction and then two lights moved closer at the same time on vertical. then we got home and we both got out of my car. i am deaf and my daughter heard the sounds like boom boom that is almost similar to fireworks but there were no firework sight and it's illegal here. only on the seasonal like new years eve and july 4th. we were goose bumped what we saw and she heard the sounds."],"Region":"Florida","Sighting Duration":"Undisclosed","City":"Clermont","Object Features":"Wings"}