{"Viewing Distance":"20 Feet or Less","City":"Wasilla","Object Shape":"Egg, Oval","files":["/var/www/straped/mufon/html2text/51958.html.txt","/var/www/straped/mufon/org/51958.html"],"Weather Factors":"Unknown","Tags":"City","Sighting Duration":"00:02:00","Date of the Event":"05/23/2013 02:00 UTC","Region":"Alaska","Log Number":"US-10312013-0009","Object Features":"None","divs":["Sighting DetailsI walked around the corner of my house on a sunny cloudless day while smoking a cigarette when a glint of light caught my eye. I turned to find myself looking strait a egg shaped, silver pod. At first I thought it was just a big inflatable something but the details of this thing were unworldly. the surface of this thing rippled like water, like it was in a constant state of change. It was dead silent not making the slightest sound while it sat there suspended about 10 to 15 feet off the ground. I was in shock I couldn't move, all I could do is watch it slowly started move back and forth over my neighbor's yard. I watched it for about 2 minuets until it noticed me or something cause it turned the tapered \"the pointier end,\" strait at me and then turned away and took off very close to the ground barely above the tree line. I don't know what that was, but if you saw this thing, you would be able to tell that this thing is not from around here like not from our world. There are 2 other events id like to tell. This is the first account and from what I can tell it won't be the last..."],"Source":"MUFON","Latitude":"61.610816","Case Number":"51958","Country":"United States","trends":["There have been 6 other sightings in Wasilla","There were no other sightings in Wasilla on or around May 23rd 2013"],"Date Submitted":"10/31/2013 07:40 UTC","Object Flight Path":"Stationary","Disposition":"Unresolved","Longitude":"-149.320224","Summary":"It was may 23rd 2013 at 1:49 pm when I saw the first ufo there are several other sighings","map":"<A HREF = \"http://maps.google.com/maps?q=61.610816,+-149.320224(51958)&iwloc=A&hl=en\"> mufon case (51958) map </A>"}