{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=30.465093,+-97.688575(51959)&iwloc=A&hl=en\"> mufon case (51959) map </A>","Weather Factors":"Unknown","Latitude":"30.465093","Country":"United States","Disposition":"Unresolved","Longitude":"-97.688575","Date of the Event":"10/31/2013 09:25 UTC","Case Number":"51959","Date Submitted":"10/31/2013 11:06 UTC","Log Number":"US-10312013-0010","Object Features":"Other","divs":["Sighting DetailsI was outside my apartment with my husband looking at a plane that had a solid red and solid blue light. We thought it odd because it was not flashing. We live near an airport so we see planes all the time and the lights always flash. We were wondering if this was a drone because there was no sound. My neighbor came out at this time and we were talking about the plan. She was looking at it and then saw the UFO. I looked up and also saw it. It move quickly from South to North. We have an open field in front of our building and the craft came from there and swiftly flew over our building. The craft was V shaped and amber in color. The actual V shape was not illuminated however there was a square at the top of the V and two squares on either side forming a V shape. I have never seen anything like this and neither has my neighbor. The craft moved swiftly and had no sound. The plane or drone was following behind. We went out into the field and watched the plane and drone circle several times. The V craft did not appear again."],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/51959.html.txt","/var/www/straped/mufon/org/51959.html"],"City":"Austin","Summary":"Craft was was V shaped with square at tip of V and two squares on each side of V. Dim color.","Viewing Distance":"101-500 Feet","Object Shape":"Boomerang","Tags":"City","Region":"Texas","Object Flight Path":"Straight-line path","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around October 31st 2013"]}