{"Date Submitted":"11/01/2013 12:25 UTC","Object Flight Path":"Path with directional change,Path then hovering","Country":"United States","Longitude":"-117.209173","Region":"California","Date of the Event":"10/31/2013 08:10 UTC","Latitude":"33.558634","divs":["Sighting DetailsIt was a little after 8:00 p.m. I walked out on the back patio to have a smoke like I always do.i just randomly looked over at the foothills to my right, and saw this red,round object with what looked like orange fire( like you see from a rocket) coming out of the back. The thing was, that it made no sound, yet it was moving toward the stationary red lights on the foothill. I remembered that I had my phone in my pocket. So, without taking my eyes off of it, I pulled out my phone. While I was doing this, the orange fire that was coming out of the back went out, and the object stopped moving. It was still red. When I turned my camera on, it turned from red to just a white round light. It then started to move away from the lights on the hil, still not making any sound. I managed to get three still pics. I watched it move away and disappear. The color remained white as it left. At first, I thought that it was a shooting star or something. But, shooting stars don't stop, hover, change direction and color. I truly have no idea what it was. I wish I had thought to get my phone out sooner, I was just so blown away by what I saw. The first pic is of the object moving toward the foothill lights. The next two are of it moving away."],"Source":"MUFON","City":"Murrieta","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/51962.html.txt","/var/www/straped/mufon/org/51962.html"],"Viewing Distance":"101-500 Feet","Log Number":"US-11012013-0001","Object Shape":"Circle, Oval","Disposition":"Unresolved","Object Features":"Unknown","Summary":"I walked out into the backyard, looked toward the foothills, and saw it.","Tags":"City","trends":["There have been 7 other sightings in Murrieta","There were no other sightings in Murrieta on or around October 31st 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.558634,+-117.209173(51962)&iwloc=A&hl=en\"> mufon case (51962) map </A>","Case Number":"51962"}