{"Object Flight Path":"Stationary","Log Number":"US-11012013-0005","Tags":"City","Date Submitted":"11/01/2013 02:16 UTC","Date of the Event":"10/31/2013 08:15 UTC","Weather Factors":"Unknown","Region":"Arkansas","Country":"United States","Source":"MUFON","Object Features":"Unknown","divs":["sighting detailsdriving back from benton arkansas around 8pm saw 2 lights in clear sky that appeared to be airplane landing lights, no blinking around them and noticed they were not moving.. the airport in in opposite direction as well. eventually around alexander exit i drove under the 2 lights hovering and could not see any shape of what they were from, kept on my journey.. when i got to cantrell rd in little rock i noticed when i looked back south i could still see the lights still hovering. i had traveled maybe 8-10 miles since i drove under them. i pulled over took a video, as i pulled over i noticed 4 military helicopters flying in formation from maumelle\\north little rock area flying towards the object in the south. i then noticed lots of helicopters in the sky in all directions, i think i counted 8 of them, i have to watch the video to be sure cause i counted them out. watching the object i noticed that now it had ejected 5 smaller lights to the right of the object about 1\" away from my vantage point. these 5 lights made an l shape and blinked bright white light in sync and just hovered in place. after 10 mins of observing i left the road and continued to drive. i felt kind of comfortable and cool when i first drove under it and when i saw it again, but when i saw the military helicopters flying in formation towards it thats when i got a little scared. i do not know what this object was, i do not claim that it was alien and i do not claim that it was military. for all i know it could have been either. i just saw something odd, unidentified and of obvious interest to many many helicopters that normally would have no reason to be flying around little rock at 8pm-9pm on halloween."],"Latitude":"34.752321","map":"<A HREF = \"http://maps.google.com/maps?q=34.752321,+-92.279865(51966)&iwloc=A&hl=en\"> mufon case (51966) map </A>","City":"Little Rock","Longitude":"-92.279865","trends":["There have been 21 other sightings in Little Rock","There were no other sightings in Little Rock on or around October 31st 2013"],"Disposition":"Unresolved","Summary":"looked like 2 giant headlights with no other lights immediately near it. ejected 5 other smaller objects that blinked in sync","Object Shape":"Circle, Sphere","Case Number":"51966","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/51966.html.txt","/var/www/straped/mufon/org/51966.html"]}