{"City":"Marysville","Latitude":"48.057734","Source":"MUFON","Object Features":"Dome","Longitude":"-122.171802","Viewing Distance":"Unknown","Log Number":"US-11012013-0006","Tags":"City","files":["/var/www/straped/mufon/html2text/51967.html.txt","/var/www/straped/mufon/org/51967.html"],"divs":["sighting detailsi went out to lake cassidy in marysville washington around 11-12 in the afternoon. i did the ce-5 meditation that dr. steven greer performs with cseti. for what seemed to be a half hour i visualized looking down at myself first from a close distance than from above the city, then state, then country, then earth, then further and further shooting through space. using nothing but positive vibes of wanting to experience and learn. for about what seemed to be a minute i saw myself on a craft looking at two beings. i just had a feeling of awe and confusion. they looked to be about 4 feet in height and had bear looking noses but tanned white skin. both looked slightly overweight and had curly blonde hair. after this meditation i felt the need to take a picture of the sky. so i did and when i looked at the picture i saw the craft. it has 4 lights and 8 lights when zoomed in and is transparent with a dome shape it is either very large or close to me. i attached the original image, zoom in to see the additional 4 lights. the image is facing 215 degrees sw and my location was 48* 3' 45\" n\\ 122* 6' 21\" w"],"Weather Factors":"Unknown","trends":["There have been 9 other sightings in Marysville","There were no other sightings in Marysville on or around October 27th 2013"],"Date Submitted":"11/01/2013 02:42 UTC","Case Number":"51967","Date of the Event":"10/27/2013 12:00 UTC","Summary":"Did CE-5 Meditation","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=48.057734,+-122.171802(51967)&iwloc=A&hl=en\"> mufon case (51967) map </A>","Object Shape":"Sphere, Other","Region":"Washington","Disposition":"Unresolved","Object Flight Path":"Unknown","Sighting Duration":"Undisclosed"}