{"files":["/var/www/straped/mufon/html2text/5196.html.txt","/var/www/straped/mufon/more/5196_submitter_file1__JCdisks80506.jpg","/var/www/straped/mufon/org/5196.html"],"Latitude":"26.466262","Object Flight Path":"Other","Object Features":"None","Summary":"Daytime Sighting of Three Discs in Delray Beach, Florida","Country":"United States","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=26.466262,+-80.06487(5196)&iwloc=A&hl=en\"> mufon case (5196) map </A>","Sighting Duration":"00:02:00","Case Number":"5196","divs":["Sighting DetailsI had just left work in the Los Verdes condos where my work is and I was sitting at the light at Military Trail and I just glanced to the northwest of my location towards Atlantic Blvd and there they were three white discs moving very slow towards the west and were maybe a mile up in the sky away from my position. The first one was ahead of the other 2 that were near each other and they were silent and moved in like a floating pattern (Not a straght line) Like up and down and a kinda wobble like free floating. I could see them clear as day and I pointed up to the sky and the people behind me also got out and looked at them. The sighting lasted about 2 mins and as soon as they got my 9:00 position they blended into the sky (just disappeared). I have seen alot of strange objects in the night sky but this is my first Daytime sighting and these were absolutly real! I stopped to talk to some people down the street and they said they have been seeing Strange Objects at night over this area."],"trends":["There have been 35 other sightings in Delray Beach","There were no other sightings in Delray Beach on or around August 5th 2006","This sighting has never been favorited.",""],"Disposition":"Unresolved","Region":"Florida","Object Shape":"Disc","Tags":"City","Source":"MUFON","Log Number":"US-08052006-0006","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"08/05/2006 04:43 UTC","City":"Delray Beach","Date of the Event":"08/05/2006 04:43 UTC","Longitude":"-80.06487"}