{"Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=30.284281,+-98.865334(51960)&iwloc=A&hl=en\"> mufon case (51960) map </A>","City":"Fredericksburg","Sighting Duration":"01:00:00","Latitude":"30.284281","Date Submitted":"10/31/2013 11:25 UTC","Region":"Texas","Object Features":"None","Object Shape":"Sphere","Disposition":"Unresolved","divs":["Sighting DetailsJust after sunset I walked outside and looked to the west to see if the bright object had shown up yet. It showed up after sunset, but before twilight. Around 7:30 pm. I have taken quite a few photos of it over the past months, and decided to take a few more. I set the camera (on a tripod) on the roof of my vehicle. I took eleven photos over a twenty minute period. The first photos showed the white object (orb) with a halo around it. The last photos showed a more distinct orb shaped object, with a purple center. It's as though the 'cloud' around the orb was a product of it's flight. After remaining stationary, the 'cloud' disappeared, showing more distict detail. In other words, I'm guessing the apparant ionization surrounding it was a product of its propulsion. I left the camera set up, and an hour later I went outside to see if the object had moved. I witnessed a jet coming from the direction of San Antonio (coming from the southeast) headed straight for the object. I decided the pilot was a lot braver than I. The object increased in brightness as the jet drew closer. The 'halo' again appeared around the object, as though it had fired up its engine. I had the impression of a cat arching it's back and the fur standing out. I would guess the jet flew within two miles of the object. About four minutes later, another jet appeared, following the same path as the first. This time the object retreated around ten miles into the distance. I happened to check on the object about twenty minutes later and witnessed another jet approach the object from the north. This time the object disappeared into the distance. The first photo shows the object after it first appeared, with the 'halo' surrounding it. The second photo shows the object in more detail with a purple center. The third photo shows the object after the second jet approached it. I recommend zooming in on the photos for a better view."],"Log Number":"US-10312013-0011","Tags":"City","Source":"MUFON","Case Number":"51960","Country":"United States","Summary":"Bright white glowing object makes it's nightly appearance","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/51960.html.txt","/var/www/straped/mufon/org/51960.html"],"Longitude":"-98.865334","trends":["There have been 6 other sightings in Fredericksburg","There were no other sightings in Fredericksburg on or around October 31st 2013"],"Date of the Event":"10/31/2013 07:30 UTC","Weather Factors":"Unknown"}