{"map":"<A HREF = \"http://maps.google.com/maps?q=39.913626,+-80.151625(51973)&iwloc=A&hl=en\"> mufon case (51973) map </A>","Summary":"Upside down V shape with random rapidly flashing lights seen NE towarrds Pittsburgh same location at least 3 hours","Latitude":"39.913626","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Source":"MUFON","Log Number":"US-11012013-0012","Date Submitted":"11/01/2013 10:15 UTC","files":["/var/www/straped/mufon/html2text/51973.html.txt","/var/www/straped/mufon/org/51973.html"],"Sighting Duration":"Undisclosed","City":"Waynesburg","Date of the Event":"09/30/2013 12:00 UTC","divs":["sighting detailson sept 30 2013 at 10pm 2200 hrs my husband and i went on front porch to sit. as soon as i sat down i noticed bright lights to my left (ne). as soon as i saw it i said what is that ... it was an upside down v with bright flashing\\pulsating lights so large it appeared close although probably was far away. looked like i could reach out and touch it. appeared a bit bigger than soft ball size. we watched it for app 15 min then it went to the left and then back then to right and back and then up and down. it stayed in one place after that. it was above the tree line the whole time which appeared to be about 5 ft. we got binoculars and could see the individual flashing lights were outlining the v shape. we went back in and then every time we went back out it was still there until about 1 am or so. we have seen this in the same approximate position 18-20 times in month of october but it is more a boomerang shape now with same flashing lights. several times there were much much smaller ones darting about and several times there were the exact same thing in several positions that could be seen through the tree branches. they have same shape and lights and some are stationary while others moved back and forth horizontally. i have also seen them in a flight path towards the west. one will travel and then another will follow in the same path. larger and closer than a jet and is a gliding motion. i am filing another report of what we saw tonight nov 1st which was very different. we saw this as reported for exactly 1 monthooct and now the 1st of this month nov it has changed drastically."],"Object Features":"Unknown","Disposition":"Unresolved","Region":"Pennsylvania","Longitude":"-80.151625","Case Number":"51973","Object Shape":"Chevron, Triangle","Viewing Distance":"Unknown","trends":["There have been 4 other sightings in Waynesburg","There were no other sightings in Waynesburg on or around September 30th 2013"],"Weather Factors":"Unknown","Tags":"City","Country":"United States"}