{"trends":["There have been 18 other sightings in Chattanooga","There were no other sightings in Chattanooga on or around November 1st 2013"],"Date Submitted":"11/02/2013 06:00 UTC","Log Number":"US-11022013-0004","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/51978.html.txt","/var/www/straped/mufon/org/51978.html"],"Source":"MUFON","Country":"United States","Object Features":"None","Latitude":"35.059646","Case Number":"51978","Date of the Event":"11/01/2013 08:53 UTC","Summary":"ufo acended from behing woods then took a path across the road","City":"Chattanooga","Sighting Duration":"Undisclosed","Longitude":"-85.274592","Region":"Tennessee","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.059646,+-85.274592(51978)&iwloc=A&hl=en\"> mufon case (51978) map </A>","Tags":"City","Object Shape":"Fireball","Viewing Distance":"Over One Mile","divs":["Sighting Detailsmy wife and i were on our way to work, and noticed a very big and bright object rising from the woods from the west. the object went up then took a path from sw to se . looked like a giant orange ball, no blinking no other lights just solid orangeish red light ball. we stopped on the road to watch it. the object as it was flying over looked like it was sewing something out of it over and over, mad no sound at all. it would move and spew something out of it off and on was not a constant spew. the spew dropped out of the bottom of it not the sides. we watched it till more traffic came down the road an had to move. we felt more amazed than anything at what we saw, no other effects. about the photo, my wife was trying to take a picture hanging out of the car while we were stopped. she didnt have a long time to take it cause of cars come down the highway. but she took it up in the air and got a few objects on the picture you can see some shape and some orange mist spewing from it. now from where we could see it just looked like a giant ball"],"Disposition":"Unresolved"}