{"Country":"United States","Region":"Texas","Longitude":"-96.653234","Disposition":"Unresolved","Source":"MUFON","Object Shape":"Cone","Latitude":"33.066182","Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","Summary":"Orange and red. Looked like it was on fire almost. round verticle cone shape with 5 to 6 protrusains below it.","City":"Allen","map":"<A HREF = \"http://maps.google.com/maps?q=33.066182,+-96.653234(51976)&iwloc=A&hl=en\"> mufon case (51976) map </A>","trends":["There have been 5 other sightings in Allen","There were no other sightings in Allen on or around November 1st 2013"],"Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","Object Features":"Appendage(s)","Log Number":"US-11022013-0002","Date Submitted":"11/02/2013 01:14 UTC","Date of the Event":"11/01/2013 07:55 UTC","Case Number":"51976","Tags":"City","divs":["sighting detailsi was inside watching tv. my wife went to take the dogs outside and she yelled for me to come out. my daughter said \"dad mom just yelled for you to go outside.\" i thought that maybe there was something wrong with one of the dogs or an animal had gotten into the yard and the dogs were going after it. ran out and she told me to look up. i saw this object that looked like it was on fire almost. had 5 to 6 appendages protruding below it. i yelled to my daughter to get my phone so i could get a picture of it. she didn't here me so i went in to get my phone and told her what we were looking at and to come out. by the time i got back out the object was moving off to the east. i told my daughter to go get the video camera. she did, turned on the camera and got a little bit of footage. i only got one picture with my phone. the picture isn't great because by then it was to far away for a close shot. i told my daughter go get the car keys and we went to try and catch up to it. i chased it through three towns. never got another shot. when i got back i spoke to my wife about what had happened. she told me that when she looked up she saw the object hovering over or close to our house. when she yelled for me the object then began to move off. what is so weird is on 10\\31\\2013 i had been watching the planet\\star or whatever it is in the sky. and had noticed that it had something orbiting around it. i had been observing it the object orbiting it. for hours it changed positions through the night. also had been trying to research if anyone else had noticed these events. next day i have a ufo over my house. to me that seemed a little weird. as amazed as i was by seeing this object it wasn't the first one i had seen. and certainly not the biggest. this one almost seemed like a probe in my opinion. it reminded my kind of the lunar lander because the appendages\\legs below the object."],"files":["/var/www/straped/mufon/html2text/51976.html.txt","/var/www/straped/mufon/org/51976.html"]}