{"Date Submitted":"11/02/2013 12:33 UTC","Object Shape":"Circle","Source":"MUFON","Weather Factors":"Unknown","Date of the Event":"11/01/2013 09:30 UTC","Tags":"City","Log Number":"US-11022013-0010","trends":["There have been no other sightings in Oyster Bay","This sighting has never been favorited."],"divs":["Sighting DetailsI went out on my balcony to smoke a cigarette. My house is high up on a hill, and surrounded by trees. I am facing north west looking above the tree line towards NYC, when I see a bright light. I see other planes flying about, but this light is brighter than the planes. It could be a helicopters search lights I think. I stare at it, but it doesn't move. There is no noise, maybe its a meteor, I think. But again no movement, it is stationary, and the lights are so bright. I have seen meteors before and this doesn't seem like a meteor. I watch it some more, then I run for my cell phone to get a video. I record the bright light, in my phone it seems to be cigar shaped but with the naked eye it seems circular. it also seems to be pulsating. I am skeptical, I think its a star just very low and bright. I look at the other stars in the sky, and this is not a star it is just way to bright. I really don't know what I saw. It remained in the sky for over an hour. I had to go in my house, when I came back a half hour later it was gone. The lights were so bright it appeared to have lines of lights escaping the center all around it, like a star. I was in dumbfounded, never seen this before. What is it?"],"Region":"New York","Disposition":"Unresolved","Latitude":"40.87155","Longitude":"-73.496841","Case Number":"51984","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=40.87155,+-73.496841(51984)&iwloc=A&hl=en\"> mufon case (51984) map </A>","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Summary":"extremely bright light, stationary and brighter than the planes passing around, possibly a comet or meteor, brighter than stars in the sky, looked like a huge flood light, illuminated the sky around it with bright white light","files":["/var/www/straped/mufon/html2text/51984.html.txt","/var/www/straped/mufon/org/51984.html"],"Country":"United States","City":"Oyster Bay","Viewing Distance":"Unknown"}