{"Summary":"seen bright light coming through window, turned to see light ascending over house","Weather Factors":"Unknown","Object Features":"Unknown","Date of the Event":"11/01/2013 12:00 UTC","Date Submitted":"11/02/2013 10:11 UTC","Case Number":"51981","files":["/var/www/straped/mufon/html2text/51981.html.txt","/var/www/straped/mufon/org/51981.html"],"Longitude":"-97.510033","Latitude":"30.716906","trends":["There have been 3 other sightings in Granger","There were no other sightings in Granger on or around November 1st 2013"],"Country":"United States","Viewing Distance":"20 Feet or Less","map":"<A HREF = \"http://maps.google.com/maps?q=30.716906,+-97.510033(51981)&iwloc=A&hl=en\"> mufon case (51981) map </A>","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Tags":"City","Object Flight Path":"Path with directional change","Log Number":"US-11022013-0007","divs":["Sighting DetailsI live in the country where there are just a very few lights seen in the distant. No close neighbors. The nearest road is half a mile away. It was a restless night for me and was wide awake, it was about 1am when I ventured out my room to make a bathroom visit. I had to go through the office which was pitch dark and only a few steps from the kitchen so I did not turn on the light. As soon as I entered the office I saw the wall that I was turned towards as I was leaving the room suddenly light up outlining the French windows against it. It took only a second to realize that nothing I know of could be making a light come through the window like that, so I quickly turned my head to look behind me to see a huge,glowing white light ascending over the house. Ive been seeing lights around the house since I first moved in going on 13 years now. This event in itself does not seem so disturbing to me if I had not just recently experienced missing time. I often have many restless nights. I watch T.V., mostly with the sound turned down, toss and turn, and go the bathroom, which I have to leave the bedroom, go through the office, kitchen and small hall to get to. I am a clock watcher so I check the time periodically through the night, not always but sometimes. On this night, when I left the room I glanced at the time, it was close to midnight. When I got back into the room for some reason I decided to check the time again and it was 3:12am. To me, all I did was go straight to the bathroom and back. It was quite disturbing to me so I told my boyfriend and daughter later that day about the incident. We just laughed it off. Not laughing now."],"Region":"Texas","Source":"MUFON","Object Shape":"Other","City":"Granger"}