{"Disposition":"Unresolved","Source":"MUFON","Viewing Distance":"Over One Mile","Object Flight Path":"Straight-line path","Date of the Event":"05/24/2013 03:37 UTC","divs":["Sighting Details I was looking at these vacation photos that were taken May 5th 2013 in Yosemite Park when I noticed these 2 objects in the upper left. I know they were not contrails that commercial jets cause, because I had other pictures with contrails that don't look anything like this. The pictures were taken 3 seconds apart. My camera recorded the time as 3:37:18 PM & the next at 3:37:21 PM, my camera was recording in Eastern Standard Time in the Pacific time zone. These photos are not changed in any way - right out of the camera, taken in RAW format and changed to JPEG format for emailing purposes. I noticed the objects about 3 months after they were taken and was curious about them. I was just on this site for the first time, and noticed some other images you have here that resembled these objects. The pictures also show some darker slightly curved verticle streaks in the sky that are unknown."],"trends":["There have been 5 other sightings in Mariposa","There were no other sightings in Mariposa on or around May 24th 2013","This sighting has never been favorited.",""],"Object Features":"None","Country":"United States","Region":"California","Longitude":"-119.957974","Latitude":"37.488458","Date Submitted":"11/02/2013 08:49 UTC","Summary":"Just found them in a vacation picture that I had taken at Yosemite Park","Case Number":"51988","files":["/var/www/straped/mufon/html2text/51988.html.txt","/var/www/straped/mufon/more/51988_submitter_file1__IMG1318.jpg","/var/www/straped/mufon/more/51988_submitter_file2__IMG1319.jpg","/var/www/straped/mufon/org/51988.html"],"City":"Mariposa","map":"<A HREF = \"http://maps.google.com/maps?q=37.488458,+-119.957974(51988)&iwloc=A&hl=en\"> mufon case (51988) map </A>","Object Shape":"Sphere","Sighting Duration":"Undisclosed","Log Number":"US-11022013-0014","Tags":"City","Weather Factors":"Unknown"}