{"Date Submitted":"08/04/2006 10:30 UTC","Case Number":"5198","Sighting Duration":"Undisclosed","Date of the Event":"08/04/2006 10:30 UTC","Object Flight Path":"Undisclosed","Region":"Indiana","Object Shape":"Sphere","Tags":"City","Object Features":"Undisclosed","City":"Lafayette","Latitude":"40.417722","Viewing Distance":"Unknown","Weather Factors":"Unknown","Log Number":"US-08062006-0001","Longitude":"-86.870787","divs":["Sighting DetailsAt aproximately 10:30 PM, August 4th, 2006. I had gone outside to water a tomato plant. Waited until that time as it was alot cooler. I was standing in my backyard facing south. The Moon was to my far right. This sphere came very fast from the far right traveling from southwest to east. I also noticed a jet traveling from the north to south. The sphere was very bright white light, and the jet was alot smaller and had a small white light and a small red light, that were flashing. As the sphere was about in the 10 O'clock position, the jet suddenly turned and started to follow this object. A few seconds after the jet turned the sphere vanished as if someone had flipped a switch and turned it off. The jet proceded for a few more seconds and then turned back to the direction it was traveling. I went to work, August 5th,2006, and was surprized to find out that a friend of mine had seen the very same thing, as he was traveling to work on the 4th. So, this can be corroborated by my co-worker. And perhaps other people in the area. As we work the 11 PM to 7 AM shift we are able to watch the sky when other people are asleep. I was excited and frozen while I watch this event. It was awesome. I was so happy that someone else wittnessed this event. Thanks for your time, Katherine Yates"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.417722,+-86.870787(5198)&iwloc=A&hl=en\"> mufon case (5198) map </A>","Source":"MUFON","Summary":"Bright Sphere Traveling very fast.","files":["/var/www/straped/mufon/html2text/5198.html.txt","/var/www/straped/mufon/org/5198.html"],"trends":["There have been 30 other sightings in Lafayette","There was one other sighting in Lafayette on or around August 4th 2006"],"Country":"United States","Disposition":"Unknown"}