{"Object Flight Path":"Straight-line path","divs":["Sighting DetailsIn the back yard sitting in a patio chair. My wife and I looked up at the same time and noticed it. A glowing orange red sphere. It moved easterly growing in brightness. I asked my wife to get a pair of binoculars that were sitting just inside the house by the door. I kept my eyes on it looking for blinking lights but there were none. By the time I had the binoculars in hand it had increased to its Max brightness. I was able to get the object in focus and even through the binoculars I could not see any blinking lights. Just a large glowing orange red ball. I pulled the binoculars from my face and in that short time it was gone. The entire event was under a cloud layer and well passed sunset. As a result of the lack of blinking lights it could not have been a conventional aircraft and being late in the evening the angle of the the already set sun rules out a satellite, meaning, the angle of the sun could not have illuminated a satellite that close to the N.E. horizon. Besides, satellites do not fly below earth's cloud cover, and the cloud cover covered the entire eastern sky all the way to the observable horizon. Minutes later two aircraft flew by in normal aircraft patterns for the area and time of night and both had easily observed blinking lights. We both saw almost the exact same occurance over a year ago in almost the exact same location with the exact same description of oject, color and direction. As well as same behavior. What are these THINGS?"],"Object Features":"Unknown","Tags":"City","Summary":"glowing orange red, moved N.E. gained in brightness then disappeared, duration 20 sec.","Longitude":"-112.064987","Country":"United States","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around November 2nd 2013"],"Weather Factors":"Unknown","Log Number":"US-11032013-0006","Source":"MUFON","Latitude":"33.452377","City":"Phoenix","Region":"Arizona","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/51997.html.txt","/var/www/straped/mufon/org/51997.html"],"Case Number":"51997","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=33.452377,+-112.064987(51997)&iwloc=A&hl=en\"> mufon case (51997) map </A>","Sighting Duration":"00:00:20","Date Submitted":"11/03/2013 01:23 UTC","Date of the Event":"11/02/2013 08:30 UTC","Viewing Distance":"Over One Mile"}