{"Weather Factors":"Unknown","City":"The Woodlands","Summary":"Two groups of UFO's with Chaser UFO's","Object Features":"None","files":["/var/www/straped/mufon/html2text/51999.html.txt","/var/www/straped/mufon/org/51999.html"],"Tags":"City","Latitude":"30.169003","Country":"United States","Longitude":"-95.464987","Case Number":"51999","Sighting Duration":"00:05:00","Region":"Texas","Date Submitted":"11/03/2013 01:16 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=30.169003,+-95.464987(51999)&iwloc=A&hl=en\"> mufon case (51999) map </A>","Date of the Event":"11/02/2013 01:40 UTC","Object Shape":"Star-like","divs":["sighting detailson 11\\02\\13 at 13:40 hrs i was standing in a parking lot at 9200 grogans mill rd. admiring the clear skies and watching the regular commercial aircraft and a few personal aircraft flying in the area as i waited to go to work, when i noticed 4 white objects flying at a very high altitude in a diamond formation to the north of my location and moving to the east southeast. i continued to watch the group and it made several pattern changes and i thought it looked wierd maybe some pilots were practicing when another object came out of the north and also moving to the south southeast and basically buzzed the original 4 that were moving at a regular pace. i continued watching the faster moving object until i lost sight of it due to the sun. when i looked back to find the original diamond formation it was gone. i went into work and at approximately 14:20 hrs i came back out and looked again and after a few minutes i saw a v formation of approximately 6 or 7 objects at a very high altitude moving from the west to the east until they faded out of sight. it appeared as the v formation was ascending as the formation disappeared long before the horizon. approximately one minutes after i lost sight of the v formation and object a single at what appeared to tbe the same altitude followed the same path and disappeared into the the blue sky as if it was also ascending."],"Viewing Distance":"Over One Mile","trends":["There have been 6 other sightings in The Woodlands","There were no other sightings in The Woodlands on or around November 2nd 2013"],"Object Flight Path":"Straight-line path","Log Number":"US-11032013-0007","Disposition":"Unresolved","Source":"MUFON"}