{"Date Submitted":"11/03/2013 01:22 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=31.775868,+35.232965(51996)&iwloc=A&hl=en\"> mufon case (51996) map </A>","Weather Factors":"Unknown","Disposition":"Unresolved","divs":["Sighting DetailsA little more than an hour before sunrise this morning I was sitting on a bench in the Old City of Jerusalem meditating and praying, at a lookout where you can view the Western Wall, the Al Aksa Mosque and the Golden-domed Dome of the Rock Mosque all at the same time. The bench faced north, so the WW and mosques were on my right, and I looked right to view them. Suddenly I noticed out of the corner of my eye, almost directly above, in the predawn sky, a distant white light with a very, very slight blueish tinge that was traveling N, away from me, that was getting brighter. As I observed, it seemed to me that it was descending, as if falling. The light got much brighter, somewhat brighter than any of the other stars. Then the intensity diminished, and it looked like it was not descending anymore. The time between noticing the object, the growing and then diminishing intensity was not more than 3 seconds. It continued in the same direction N for 2 or 3 more seconds and I lost visual on it. It simply lost intensity to the point it was not viewable. My first thought was that it possibly was a satellite. But I have seen satellites pass from sunlight to darkness, and this did not look like that - plus the object was traveling virtually due N, not east. I thought a satellite should simply maintain a constant brightness if it really was in a northerly orbit. Plus I did get the sensation that it descended rather rapidly. I ruled out an airliner, though they do pass over Jerusalem and with landing lights on. The object was already past by and traveling away from me when I noticed it, and I have never seen an aircraft with lights as bright as landing lights facing backwards. Possibly it was some military aircraft, but again, I've never seen one with lights like that get so bright. Perhaps a fireball entering the atmosphere, but it seemed too slow to be one. However there's no way for me to judge the angle of entry so it might have seemed slower than it actually was simply because of the angle. Nevertheless, I've seen meteor showers and this did not resemble anything I've seen up to this point. I do not think it was a military flare, since they burn with a slightly reddish tinge as far as I know. (I was a radar technician in a USMC fighter squadron in the '70's, and I've also seen IAF aircraft drop flares.) I also waited around until the sky got bright enough to see that the sky was cloudless - no clouds; I'd thought that possibly a drifting cloud in the dark sky might have occulted a bright star. As far as feelings go, I felt that I'd report it for the sake of making a record in case others might have sighted it. Personally I was not overly excited since I have experienced a few of what people might call miracles, and in the 70's experienced about seven episodes of what is called either \"sleep paralysis\" or \"abduction\" (but which I think is demonic buffeting)."],"City":"Jerusalem","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Log Number":"IL-11032013-0005","Country":"IL","trends":["There has been one other sighting in Jerusalem","There were no other sightings in Jerusalem on or around November 3rd 2013"],"Tags":"City","Object Flight Path":"Straight-line path","Case Number":"51996","files":["/var/www/straped/mufon/html2text/51996.html.txt","/var/www/straped/mufon/org/51996.html"],"Latitude":"31.775868","Region":"","Date of the Event":"11/03/2013 04:50 UTC","Object Shape":"Unknown","Object Features":"Unknown","Summary":"noticed a light in night sky traveling N suddenly grow bright and then diminish in intensity","Longitude":"35.232965","Source":"MUFON"}