{"map":"<A HREF = \"http://maps.google.com/maps?q=32.700442,+-97.001435(52008)&iwloc=A&hl=en\"> mufon case (52008) map </A>","Date of the Event":"11/02/2013 10:30 UTC","Country":"United States","Region":"Texas","Case Number":"52008","Viewing Distance":"501 Feet - 1 Mile","Latitude":"32.700442","Object Features":"None","divs":["sighting detailson a saturday night november 2nd. 2013 at around ten thirty pm, i was on the cell phone talking to a friend, walking outside into our backyard from inside the house, when i barely noticed above me throught the branches of the tress glowing unusual lights. (i just checked the time of my call and estimated we had been talking for about 5-10 mins before i walked outside and saw this.) first i only saw one, then another, and as i walked out from under the tree's blockage of limbs i could clearly see what either seemed like eight seperate shpere or disc shaped vessels in a perfect \"v\" formation traveling absolutely simultaneous one from another, or one huge \"v\" shaped vessel with eight lights. the lights actually seemed to be the craft itself glowing and pulsing in a signalling affect like trying to say something. the lights were changing in color drastically! each light pulsated and changed in the same color as the others as if it were an intellegently controled machine. i ran ni the house trying to get witnesses. as i ran back out, i heard the neibors laughing and talking loudly, so i ran out to the front and asked them if they saw that. they were all looking in the same area of the clear stary sky and told me that they thought it was lanturns that were lit. we all noticed at least two clear objects floating down to ground gracefully like huge clear trash bags. these objects floating down were to the south of our sighting. i ran back to the back searching the sky for it\\them, and saw nothing but the stars."],"Summary":"I barely noticed above me and then in a\"V\" formation pulsating lights or flying craft either eight seperate or one large \"V\" shaped vessel traveling west to east clear stary night.","Longitude":"-97.001435","Weather Factors":"Unknown","Log Number":"US-11032013-0016","files":["/var/www/straped/mufon/html2text/52008.html.txt","/var/www/straped/mufon/org/52008.html"],"Sighting Duration":"Undisclosed","trends":["There have been 7 other sightings in Grand Prairie","There were no other sightings in Grand Prairie on or around November 2nd 2013"],"Date Submitted":"11/03/2013 01:32 UTC","Tags":"City","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Object Shape":"Boomerang, Disc, Sphere, Triangle","City":"Grand Prairie","Source":"MUFON"}