{"Object Shape":"Circle, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=38.628983,+-90.615447(52005)&iwloc=A&hl=en\"> mufon case (52005) map </A>","Tags":"City","Sighting Duration":"Undisclosed","Case Number":"52005","Region":"Missouri","Date Submitted":"11/03/2013 12:36 UTC","Latitude":"38.628983","Object Flight Path":"Straight-line path","City":"Chesterfield","Source":"MUFON","files":["/var/www/straped/mufon/html2text/52005.html.txt","/var/www/straped/mufon/more/52005_submitter_file1__FlyingOrb11213.JPG","/var/www/straped/mufon/org/52005.html"],"Summary":"Large Orange orbs (6 to 9) that flew as fast as a plane following the exact flight path and than disappeared in the sky. They were larger and brighter than any object I've ever seen.","divs":["Sighting DetailsOpened the door to let the dog outside and noticed several Orange orbs in the western sky. These were much larger and brighter than I have very seen so did not think it was a plane. The strange thing about them they were following each others fight paths. Flying exactly the same each was a fair distance apart from other. They were a distance away from us so its hard to tell if they made any noise. I would say I say maybe 6 to 9 lights in all. Here's what I wrote right after the sightings: Saw a series of lights (6-8)red in color they were fairly sizable unlike a plane they did not have flashing lights. They were red glowing lights almost like a glowing balloon in the night. Each light followed the first they were at a distance they fly across the sky maybe several minutes. As one crossed another would appear following the same path as the one before it. Must have been a total of 6 or 9 lights same size and color that flew across the sky heading in a southern direction. I would say the speed was that of a jet for the distance they covered over that time frame. Fairly constant and smooth. I called my son out to look so I took my eyes off the sky for several seconds. He witness it and after him called my wife out as well. By this time there were only 2 left in the sky. I wondered where the other lights had gone so I walked out into and down the street away from some trees. At this point could not see any of the other lights so I fixated on the remaining 2 and the one leading as it went southward just vanished. Wow, I than looked at the last one in the sky as it followed the others path it also vanished at about the same point where the previous one did. I only had my cell phone knowing the camera was not that good I did get a photo of the last orb but all I got was a black sky with a very small dot of light. Not sure it even comes close to telling the tale. I wanted to see if any one else had witnessed the event so I called my local police department. Not knowing any where else to call. She listened to my story very curiously and had indicated no one else had call in to say they had witnessed it."],"Country":"United States","trends":["There have been 5 other sightings in Chesterfield","There were no other sightings in Chesterfield on or around November 2nd 2013","This sighting has never been favorited.",""],"Date of the Event":"11/02/2013 09:15 UTC","Object Features":"None","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile, Unknown","Log Number":"US-11032013-0013","Longitude":"-90.615447","Disposition":"Unresolved"}