{"City":"Puerto Maldonado","divs":["Sighting DetailsAt 04:30pm on July 19, 1952, the attention of Customs Inspector Sr. Domingo Troncoso, then with the Peruvian Customs Office at Puerto Maldonado on the jungle frontier with Bolivia, was called to a very strange cigar-shaped flying object over the river area. The big dirigible-shaped craft was flying horizontally and fairly low in the sky, passing from right to left from the observers position. It was leaving a dense trail of thick smoke, vapor, or substance on its wake. This object was a real, structured, physical machine and may be seen from its reflection in the waters of the Madre de Dios river underneath it. The object was estimated to be over a hundred feet long. A newspaper account read in part: \"The colour of the head or nucleus of this disc was an intense orange. The direction was south to north, was visible from 1 to 2 minutes, leaving a thick vaporous trail which floated for more than 15 minutes. The altitude was more or less 2500 to 3000 feet.\""],"Longitude":"-69.191887","Date of the Event":"07/19/1952 04:30 UTC","Date Submitted":"11/03/2013 09:24 UTC","Log Number":"PE-11032013-0025","Case Number":"52017","Summary":"A big dirigible-shaped craft was flying horizontally and fairly low in the sky, passing from right to left from the observers position.","Tags":"City","Object Features":"Other","Latitude":"-12.60342","Object Shape":"Blimp, Cigar, Cylinder","Viewing Distance":"Over One Mile","Region":"Madre de Dios","map":"<A HREF = \"http://maps.google.com/maps?q=-12.60342,+-69.191887(52017)&iwloc=A&hl=en\"> mufon case (52017) map </A>","files":["/var/www/straped/mufon/html2text/52017.html.txt","/var/www/straped/mufon/more/52017_submitter_file1__fotografiaovnipuertomaldonado1952.jpg","/var/www/straped/mufon/org/52017.html"],"Disposition":"Unresolved","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","trends":["There has been one other sighting in Puerto Maldonado","There were no other sightings in Puerto Maldonado on or around July 19th 1952","This sighting has never been favorited.",""],"Sighting Duration":"00:02:00","Source":"MUFON","Country":"Peru"}