{"Object Features":"Dome","Viewing Distance":"Over One Mile","Case Number":"52013","Sighting Duration":"00:05:00","Weather Factors":"Unknown","Latitude":"43.36798","Tags":"City","Disposition":"Unresolved","Summary":"I turned and alerted 3 others, all observed, struck dazed, saw craft menuver behind single small cloud","trends":["There has been one other sighting in Bridgeport Charter Township","There were no other sightings in Bridgeport Charter Township on or around September 19th 1999"],"Date of the Event":"09/19/1999 02:00 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/52013.html.txt","/var/www/straped/mufon/org/52013.html"],"Object Shape":"Disc","map":"<A HREF = \"http://maps.google.com/maps?q=43.36798,+-83.883962(52013)&iwloc=A&hl=en\"> mufon case (52013) map </A>","Date Submitted":"11/03/2013 04:16 UTC","Country":"United States","Object Flight Path":"Hovering then path","City":"Bridgeport Charter Township","Region":"Michigan","Log Number":"US-11032013-0021","divs":["Sighting DetailsIt was mid summer, we was preparing for a yard sale. I don't know why but I turned around and looked exactly where the craft was. I exclaimed to the three other people present LOOK! and pointed. I couldn't say anything else to describe what I was seeing.the other three gathered beside me and behind me as I pointed at this craft. I remember lowering my arm,i cant say exactly how long we stood in that spot, then the craft rotated parallel to the ground and menuvered west ever so slowly to a small cloud. I looked at the one person to my left and asked \"are you ok\" she never responded to my question but stared at me as though she was in a daze. I turned and observed the other two robotically folding and raking the yard.about 10 to 15 seconds passed by and the three others who was present picked up pace and started chatting. not a single one of us said a word 0f what just happened. The beauty of this craft.......,human words cannot due justice. I can say it was as highly polished pure silver. there was no windows or doors.It had a slight domed top and the bottem was slightly convexed. the strangest thing I noticed was it had no shadow. I like to say it was self luminous non-radiant. this event was mentioned in a statement to the government in 2001. since then my personal life has been completely turned up-side-down. a psychologist came to me and said \"they are just trying to get you to hurt someone\" .......im scared but I fear nobody. this is my statement of events. may GOD help us all."],"Longitude":"-83.883962"}