{"Viewing Distance":"Unknown","trends":[],"files":["/var/www/straped/mufon/html2text/5201.html.txt","/var/www/straped/mufon/org/5201.html"],"Disposition":"Unresolved","Source":"MUFON","Summary":"Eight foot tall shadow of a being","Object Shape":"Undisclosed","Weather Factors":"Unknown","Date Submitted":"06/30/2004 05:30 UTC","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=36.787111,+-119.413382(5201)&iwloc=A&hl=en\"> mufon case (5201) map </A>","Tags":"City","divs":["Sighting DetailsI fell asleep on the recliner and woke at 5 am. I had to get ready for work in about an hour, so I decided to lay on the bed for an hour. I was fully awake, lying on my side with my eyes closed. For no reason, I suddenly opened my eyes, and I saw the shadow of something on the window shade. Someone was looking at me from outside through the shade (shade is opaque), and then suddenly moved silently sideways, as if on wheels, away from the window. I saw this shadow for maybe 5 seconds. A few seconds later I heard the top of a metal trash can in the backyard open and then slam shut. The image was of a very angular, skinny being. It did not look quite human, and the shadow of the top of the head had to be at least 8 feet high from the ground. I don't know if it was standing or floating. I'm not sure what this thing was, but it had mass and cast a shadow. And last week, when I was departing from my house, I caught something out of the corner of my eye for maybe a fraction of a second. I thought I saw some sort of large ship or craft through the trees. When I looked backed, it was gone. I believe now that something is watching me. I don't know if it or they are just observing or intending to do something. If they wanted to do me harm, they've already had plenty of chances. I think the reason they are watching is because I recently became aware of the 911 fraud by the media and government, started going to MUFON and Granda Forum events, and attended the Alex Jones 911 NeoCon event. I had seen the weird \"fog\" and \"trails\" last year, and didn't know what they were. I found out they were called chemtrails just in March, when I started learning about 911."],"Object Features":"Undisclosed","Case Number":"5201","Log Number":"US-08062006-0004","City":"Undisclosed","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Longitude":"-119.413382","Country":"United States","Date of the Event":"06/30/2004 05:30 UTC","Latitude":"36.787111"}