{"Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Tags":"City","Sighting Duration":"Undisclosed","Latitude":"45.057362","divs":["sighting detailson 11\\2\\2013 i was driving home after hunting, shortly after dark. i turned south onto bellaire ave in white bear lake mn towards the road i live on. i noticed what kind of looked like street lights that were in a big dipper-like formation, i couldn't exactly tell where they were as i drove down this road but it looked strange to me because they weren't moving or flashing like most objects in the air. i turned left onto my street, orchard lane, and at this point i could see these objects in the horizon were a ways to the south and not just over bellaire ave. a group of 6 to 8 objects hovered in formation. at this point i saw a plane flying to the east from the general direction of the objects. i felt these may be ufo's as they reminded me of what i have seen in many documentaries. i drove 2 blocks to my home, grabbed my wife and camera and headed into my back yard to get some pictures and video. we could only see a portion of the objects and took a few pictures and a little bit of video that did not turn out very well. the pictures are ok but we didn't use a tripod so they are a little fuzzy. after 3 minutes the objects started to slowly fade to darkness, not all at the same time. we drove over to bellaire avenue to see if we could see anything else but everything was gone."],"Country":"United States","Source":"MUFON","City":"White Bear Lake","map":"<A HREF = \"http://maps.google.com/maps?q=45.057362,+-92.992565(52010)&iwloc=A&hl=en\"> mufon case (52010) map </A>","Longitude":"-92.992565","Disposition":"Unresolved","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/52010.html.txt","/var/www/straped/mufon/org/52010.html"],"Log Number":"US-11032013-0018","Region":"Minnesota","Case Number":"52010","Summary":"A group of 6 to 8 red/orange objects hovered in formation then disappeared","Object Features":"Unknown","trends":["There have been 3 other sightings in White Bear Lake","There were no other sightings in White Bear Lake on or around November 2nd 2013"],"Object Shape":"Sphere","Date Submitted":"11/03/2013 01:41 UTC","Date of the Event":"11/02/2013 07:05 UTC"}