{"Date Submitted":"11/04/2013 02:12 UTC","City":"Albuquerque","Tags":"City","trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around November 3rd 2013"],"Log Number":"US-11042013-0010","Disposition":"Unresolved","Latitude":"35.192347","Object Flight Path":"Straight-line path","Longitude":"-106.675555","Case Number":"52028","Country":"United States","Source":"MUFON","Summary":"Grey/Silver cylinder passed overhead without lights or sound","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.192347,+-106.675555(52028)&iwloc=A&hl=en\"> mufon case (52028) map </A>","Date of the Event":"11/03/2013 10:20 UTC","Region":"New Mexico","divs":["Sighting DetailsI was sitting outside last night hoping to hear and maybe locate the direction of the loud booms we had been hearing for the last 3 weeks. The night was cold (57 degrees), clear skies with lots of stars, light wind, and I was sitting facing 255 degrees West. I had my cell phone, a digital camera, and a pair of binoculars. I used the cell phone compass to determine my direction and the voice memo application to record the conditions and my observations. There were many aircraft, jet and helicopter flying in the area, all with appropriate red or white strobe lights flashing. While scanning the skies periodically I noticed a grayish cylinder object float across the sky almost directly above me from a NE to SW direction. The object was definitely not a flock of birds or floating debris as the shape never wavered or formed into any other shape. It remained a cigar shape. The object made no sound, had no lights, and had no contrail. It was definitely lighter in color than the night sky and I did not observe it passing in front of any stars. There were no aircraft in front or behind the object and I could not estimate it's altitude, but I would have to estimate it's speed in excess of 500 MPH. Albuquerque airport is about 15 miles to the SW of my location and is adjacent to Kirtland AFB. All aircraft traffic observed was either in a North to South direction at a lower altitude or East to West at a higher altitude used by commercial aircraft. Before I could point my camera in the objects direction it passed outside of my eyesight or was made difficult to see due to the porch lights of the house across the street to the left and also from the porch lights of the house to my immediate left. The object never returned and there was no sign of pursuit or investigation from other aircraft."],"Object Shape":"Blimp, Cylinder","Sighting Duration":"Undisclosed","Object Features":"None","files":["/var/www/straped/mufon/html2text/52028.html.txt","/var/www/straped/mufon/org/52028.html"],"Weather Factors":"Unknown"}