{"files":["/var/www/straped/mufon/html2text/52024.html.txt","/var/www/straped/mufon/org/52024.html"],"divs":["Sighting DetailsI was in Luther park in wisconson on a church retreat. It was a cloudless night. I was star gazing with my churches pastor when we noticed a satalite we were watching it when all of the sudden this giant ball of blue light that was surrounded by an aura of light blue light appeared out of nowhere by a grouping of four stars in the shape of a diamond. When It appeared it was already in motion it made no noise at all but it traveled faster than the world air speed record and traveled straight towards a grouping of stars that resembled Orion's Belt but dimmer but the middle one was one of the brightest stars in the sky that's the one this object was headed for it managed to travel what must have been at least 50 miles is about 0.5 seconds. It looked kind of like if you take all of the stars in the sky and put them next to each other like in an atom but you make it brighter than that and make it give off more light than that. When it got to the 3 star grouping it just disappeared, gone without a trace. Right after it disappeared is when it hit me, I was thinking there was no possible way that was man made. Then I wondered where was the satalite, the pastor that I was with had the star walk app open on his phone the object was not on there but the it said the satalite was right next to the grouping of four stars but it wasn't there I looked the next night but it still wasn't there and so I still don't know what it was. I still feel shock and awe about it and I still feel a little shaken by it."],"Source":"MUFON","Longitude":"-91.66627","map":"<A HREF = \"http://maps.google.com/maps?q=45.346997,+-91.66627(52024)&iwloc=A&hl=en\"> mufon case (52024) map </A>","trends":["There has been one other sighting in Chetek","There were no other sightings in Chetek on or around November 2nd 2013"],"Latitude":"45.346997","Weather Factors":"Unknown","Region":"Wisconsin","Case Number":"52024","Date of the Event":"11/02/2013 07:15 UTC","Sighting Duration":"00:00:02","Object Shape":"Sphere","Object Flight Path":"Straight-line path","Tags":"City","Date Submitted":"11/04/2013 11:37 UTC","Disposition":"Unresolved","City":"Chetek","Summary":"Came out of nowhere broke a speed record then vanished","Object Features":"None","Country":"United States","Log Number":"US-11042013-0007","Viewing Distance":"Unknown"}