{"Object Shape":"Unknown","Longitude":"-76.306901","City":"Lititz","Object Features":"None","Case Number":"52022","files":["/var/www/straped/mufon/html2text/52022.html.txt","/var/www/straped/mufon/org/52022.html"],"trends":["There have been 2 other sightings in Lititz","There were no other sightings in Lititz on or around November 2nd 2013"],"Latitude":"40.157317","Region":"Pennsylvania","Viewing Distance":"20 Feet or Less","Tags":"City","Object Flight Path":"Hovering then path","Country":"United States","Summary":"Neon Green/white rectangluar space craft with a trail of a arura energy with orbs in its stream,","Log Number":"US-11042013-0004","Date of the Event":"11/02/2013 11:15 UTC","divs":["Sighting DetailsI was at a friends house as normal i live in lititz pa and his neighborhood is called cobblestone. My 3 friends and i were hanging out on the back pourch around 11 oclock at night. when i look up above my friends tree in his back yard and see a rectangular space craft with a white small rectangle in the middle. the outer color was a very bright neon green that light up so much. behind it was a aura type of energy or stream almost in a wave pattern. and it covered and moved to my east slowly till it hovered across the tree fully i cryed out to my friends to look and my eyes started to tear up because ive waited so many ancient aliens and other interviews with old area 51 works and i wanted to believe it all but was truly doubtful till that night. me crying almost literally to my friends to look and me yelling at the top of my lungs and pointed...it vanished. or it seemed to look like it. i honestly, and this might sound crazy..but i think they heard me yell and probably turned on some type of cloak. i only say that because where it hovered and stopped it turned black with the sky and all the bright colors just vanished. but i could still see a black outline of the rectangle, and in all the stars out in the sky i could see a patch of them missing gone right where the ship just vanished at. like the stars where hiding behind the cloaked craft. and i turned to my friends and they saw nothing. it all happened in about 10;15 seconds time. two of my friends were facing me and one was inside on his way outside, and they were shocked by my crying and me shaking they really thought i was joking at first, and i told em everything i saw and two didnt believe two of my BEST FRIENDS...my other did he was always a believer. but i will never forget what i had seen that night. And really know we are not alone in this world."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.157317,+-76.306901(52022)&iwloc=A&hl=en\"> mufon case (52022) map </A>","Disposition":"Unresolved","Sighting Duration":"00:00:10","Weather Factors":"Unknown","Source":"MUFON","Date Submitted":"11/04/2013 09:08 UTC"}