{"Date of the Event":"11/03/2013 06:40 UTC","files":["/var/www/straped/mufon/html2text/52020.html.txt","/var/www/straped/mufon/org/52020.html"],"trends":["There have been no other sightings in Batavia","This sighting has never been favorited."],"City":"Batavia","Case Number":"52020","Region":"Ohio","Longitude":"-84.157317","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.084974,+-84.157317(52020)&iwloc=A&hl=en\"> mufon case (52020) map </A>","Date Submitted":"11/04/2013 02:28 UTC","Latitude":"39.084974","divs":["Sighting DetailsNovember 3, 2013 @ 6:40 pm On my way to work pm shift driving on Route 32 westbound through Batavia then Eastgate. I viewed a bright, stationary white light. No movement. No other stars or celestial shining lights viewed while driving. 31% cloud cover according to weather station online report. The light must have been at very high altitude because I traveled for about 6 miles due West and it stayed in the same exact position from my view through the driver's side window. I estimate it at about 60 degrees above the horizon. I thought it might be a geosynchronous satelite but I don't think I have ever seen one before so I would not know. The white light was at least as bright as the landing lights of a large plane were on while in flight. I do recall seeing the running lights of a plane, white with some red, somewhere in the vicinity of this light, though they did not seem to be close to each other. I am quite certain that I veiwed this same object one night at home a night last week. My house is only about 4 miles from the point where I first noticed this tonight. Both times struck me as unusual because of the brightness of a totally stationary white light many times more luminous and considerably larger than that of a pinpoint starlight-like object I've ever seen in the night sky. While watching from my home's driveway there was no sound. That did not seem strange as the thing seemed to me to be very far away. Tonight I tried without success to find information on the internet that could explain this. I could not find any data that might site an orbiting satilite as the possible origin and no UFO reports similar near my location. I lost sight of the light when I changed direction and entered hilly terrain. My sense is sort of like feeling suspicion, and wonder of what simple, ordinary explanation there probably is for this thing. And if there isn't one then seem to have a feeling of trepidation."],"Object Shape":"Star-like","Object Features":"Unknown","Log Number":"US-11042013-0001","Viewing Distance":"Over 1 Mile, Unknown","Disposition":"Unresolved","Country":"United States","Tags":"City","Source":"MUFON","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Summary":"star-like approx 20 + X's bigger & brighter, no other stars visible, miles ++ up, exact same spot for 6mi travel in car"}