{"Region":"Utah","City":"Salt Lake City","Country":"United States","Source":"MUFON","Case Number":"52033","Summary":"Orange light in slow decent and shape change to very large orage orb.","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Date Submitted":"11/04/2013 02:55 UTC","Log Number":"US-11042013-0015","Object Features":"Other","Disposition":"Unresolved","divs":["sighting detailsi was walking home from the leonardo, a museum in downtown salt lake city, heading east from 200 east and on the north side of 500 south. it was 8:58pm, and i was walking with a friend, both of us witnessed the object. i first noticed the object as i am a natural sky watcher, i like to look up and see what stars, aircraft, clouds, etc. are in the sky at any given time. i noticed a bright point of very clearly orange light north west of our position. i pointed it out to my friend, as it was noticeably unusual from anything i normally see in the sky. the very bright orange light did not blink, and seemed to move relatively slow, and was completely silent. i didn't know what to think of the object at first since it was clearly not an airplane or helicopter, it was to bright and close to be a star or satellite, and it was a steady, constant light. the light moved from north to south in what appeared to be a subtle arch from west to east and back west along it's path. as the object passed the leonardo in my sight line it began to grow in size. as it continued south it expanded to what i might guess to be the size of large car, but it was not possibly for me to tell it's actual size and distance. the intensity of the light diminished as the object expanded and continue it's smooth path\\decent. i lost sight of it as it dipped below the roof line of the near by buildings on the south side of 500 south. the expanded object looked like a blob of glowing orange around a dark or not visible interior, like a glowing viscous fluid over a glass bubble, though the object did not appear to be a perfect sphere. the uneven appearance of the glow around the object gave the impression the object had spin and a subtle wobble. i felt excited to see something so unusual, and i felt the object was beautiful and transfixing. i pulled out my phone and snapped a (unfortunately, slightly motion blurred) photo of the object in it's smallest, brightest form early on, then switched to video mode and attempted to record it on video too. i stopped recoding about 45 seconds in and moved closer to 200 east hoping to get less flare from the street light, then began recording again. the video is dark, and i'm not certain the entire event is visible since the object was less bright as it expanded. as the object neared the roof line of the buildings to the south my friend and i ran to 200 east hoping to regain a visual of the object, but i could not see it anymore. there were commercial airplanes, stars, streetlights, etc. all very clear, and non remotely like this object."],"trends":["There have been 73 other sightings in Salt Lake City","There were 2 other sightings in Salt Lake City on or around November 3rd 2013","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=40.746448,+-111.890425(52033)&iwloc=A&hl=en\"> mufon case (52033) map </A>","Object Flight Path":"Path with directional change","Object Shape":"Fireball, Sphere, Other","Tags":"City","Latitude":"40.746448","Date of the Event":"11/03/2013 08:58 UTC","Longitude":"-111.890425","files":["/var/www/straped/mufon/html2text/52033.html.txt","/var/www/straped/mufon/more/52033_submitter_file1__20131103205847.jpg","/var/www/straped/mufon/org/52033.html"]}