{"map":"<A HREF = \"http://maps.google.com/maps?q=30.255396,+-87.692579(52032)&iwloc=A&hl=en\"> mufon case (52032) map </A>","Date of the Event":"03/31/1990 09:00 UTC","Log Number":"US-11042013-0014","Tags":"City","Latitude":"30.255396","City":"Gulf Shores","Longitude":"-87.692579","Object Shape":"Fireball","Country":"United States","files":["/var/www/straped/mufon/html2text/52032.html.txt","/var/www/straped/mufon/org/52032.html"],"Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Region":"Alabama","Case Number":"52032","divs":["Sighting DetailsI was curious to see if anybody else saw the fireball back on March 31, 1990 Around 9 or 10 p.m. That followed the beach along the coastline in Gulf Shores,Alabama. It was barely 50 ft out from the edge of the waterline and maybe about 50 ft above the water. So much so that you could see the flames eluminating the water when It went by. We were at the old Alabama Point Bridge boat launch.. there were people there launching a boat but they were already out in the water . But I know they had to have saw it. Anybody from the HangOut which is where It was coming from as a small ball of fire as it came up the coastline We realized how huge it was .. it was being maneuvered... not a Comet . It was probably every bit as large as large water tower . I\"ve lived in the area all my life. By the way it was me & my husband. We BOTH saw it. You are welcome to call or email me . My cell # is 251-979 -2161. I told people Not many ..Cause you know they Really Do not believe you. I posted it on a UFO Site once but did not get a respond . It went on past us headed along the coast of Florida. Now that this UFO stuff is so OUT OF THE CLOSET . And everybody seems to be interested I would love to know if someone else reported it.."],"Source":"MUFON","Viewing Distance":"Unknown","Object Features":"None","Date Submitted":"11/04/2013 02:50 UTC","Weather Factors":"Unknown","Summary":"Reported to HQ - RLH Added Case Fireball","trends":["There have been 6 other sightings in Gulf Shores","There was one other sighting in Gulf Shores on or around March 31st 1990"],"Disposition":"Unresolved"}