{"files":["/var/www/straped/mufon/html2text/5203.html.txt","/var/www/straped/mufon/org/5203.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.793664,+-86.10254(5203)&iwloc=A&hl=en\"> mufon case (5203) map </A>","Viewing Distance":"Unknown","Summary":"Star following Star across sky with third party flash occuring","Object Shape":"Star-like","Longitude":"-86.10254","Disposition":"Unresolved","trends":["There have been 20 other sightings in Holland","There were no other sightings in Holland on or around August 4th 2006"],"Country":"United States","Latitude":"42.793664","Case Number":"5203","Object Flight Path":"Path with directional change","Date Submitted":"08/04/2006 11:30 UTC","divs":["Sighting DetailsWife and myself living in trailer park, fairly dark skies, outside on porch around 11:30 pm. Having a smoke and watching for satellites, we spotted two \"stars\" almost overhead just north of the constellation Lyra, that were moving to the south. Separated by about two finger widths, they moved in tandom one behind the other towards the constellation Sagittarius. I think its sagittarius, but I know it better as the teapot. This siting was unique because we followed them for almost two minutes before they got out of sight, and right at the end, a bright \"star\" that I was using a reference point as to where I might lose sight of them at, suddenly flashed bright and disappeared. The appearant magnitudes of the two objects were the same as the two stars opposite of Vega in the constellation Lyra. In fact it was like watching these two stars move themself. We had commercial jets and small planes in the sky to judge altitude by. I am a former pilot myself and a former member of AAVASO. What ever these were, they would have to be unimaginably huge, as they were high enough that we mistook them for stars for several second. They had the same coloration as stars. The flash occured in the sky as the pair passed a rather bright star, orange in color,as they neared my horizon sight. It suddenly flashed bright and then was not there. I was stunned as to what I saw for quite a while."],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Tags":"City","City":"Holland","Region":"Michigan","Date of the Event":"08/04/2006 11:30 UTC","Source":"MUFON","Log Number":"US-08062006-0006","Object Features":"Unknown"}