{"Source":"MUFON","Country":"United States","trends":["There have been no other sightings in Sheldon","This sighting has never been favorited."],"Summary":"Huge uptick in ufos seeing them on a nightly basis now they land they hover 4 different kind i noticed my children and father are seeing these as well e","Date Submitted":"11/04/2013 05:10 UTC","Sighting Duration":"01:00:00","Case Number":"52037","Longitude":"-94.292726","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=37.658099,+-94.292726(52037)&iwloc=A&hl=en\"> mufon case (52037) map </A>","Object Features":"Other","Region":"Missouri","Weather Factors":"Unknown","Date of the Event":"11/03/2013 09:00 UTC","Object Shape":"Circle, Oval, Saturn-like, Sphere, Star-like, Triangle","City":"Sheldon","Log Number":"US-11042013-0019","Tags":"City","files":["/var/www/straped/mufon/html2text/52037.html.txt","/var/www/straped/mufon/org/52037.html"],"divs":["Sighting DetailsI am seeing 4 different kinds of crafts every single night in my area they hover they land they make formations occasionally they shout white light of them occasionally I have even see one shoot another craft off of it. iT IS REALLY STARTING TO FREAK MY CHILDREN AND MYSELF OUT... There is occasionally a white light blinking almost like a beacon in the field across from my house I live in a rural area. There are like I said different types but what worries me is I am seeing them every single night now. Even on cloudy nights hey come low enough to where I can see them. I don't know if this is government or ET. We have never been hurt or affected by them just very un nerved. I welcome you come investigate or give me some feed back. I have some pictures but they are blurry my camera is not that great so I would love to see what these things REALLY ARE!!!! These things hover down below the tree lines or they fly off or a lot of the time they I will get ired and just head in the house and say oh well lol I see these every night while I am out smoking which I know is a really bad habit but I notice more than most cause I am out every night. I guarantee if you come out a few nights you wont be disappointed. I have gotten to the point I am so used to it now I actually have been studying where they go and what they are doing... I first started noticing these a couple months ago and it hs just gotten busier as the days go on!!!!"],"Viewing Distance":"Over One Mile","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","Latitude":"37.658099"}