{"Log Number":"US-08072006-0001","Sighting Duration":"Undisclosed","Object Shape":"Circle","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/5204.html.txt","/var/www/straped/mufon/org/5204.html"],"Summary":"Night observation, colored lights circling a bright white light very large","Region":"Missouri","Latitude":"39.941661","Longitude":"-94.830245","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=39.941661,+-94.830245(5204)&iwloc=A&hl=en\"> mufon case (5204) map </A>","Date of the Event":"12/26/2004 01:20 UTC","Case Number":"5204","Object Features":"Unknown","Source":"MUFON","divs":["Sighting DetailsIt was night and I was having trouble sleeping I got up and went downstairs to watch tv. While watching tv something drew my attention to the northeast window at which I observed a LARGE circular object hovering over a field. It had stationary colored lights in a circle surrounding the very bright white light in the center. Upon viewing this I was perplexed I went back upstairs woke my husband and asked him to come have a look. We discussed at some length what the heck the thing could be. He said it might be some sort of plane, I asked him what kind of plane could stay in one spot for such a lenght of time. We then observed a plane fly near and had an opportunity to compare light configuration and altitude differnce and other aspects. This was no airplane. After about an hour and a half my husband fell asleep. I continued to observe this thing until around 4am. At which time I too fell asleep. Upon waking the object was gone. I remember having an odd sense of, not here to hurt you, dont be afraid etc. Prior to this experience I was very closed off to the notion of ufo's, I have considered the possibility of experimental aircraft and the like as well. Needless to say it has taken me two years to discuss this issue openly. However, more people need to expose their experiences and then a common link might be established or at least there will be sufficient data to look at."],"Object Flight Path":"Stationary","Tags":"City","Date Submitted":"12/26/2004 01:20 UTC","City":"Savannah","trends":["There has been one other sighting in Savannah","There were no other sightings in Savannah on or around December 26th 2004"],"Viewing Distance":"101-500 Feet","Country":"United States"}