{"Country":"United States","City":"Kingston","Case Number":"52042","Latitude":"39.508064","Longitude":"-82.816033","Region":"Ohio","divs":["Sighting DetailsOn the evening of 11.4.13 at approximately 19:30 hours, we were in our barn, taking care of our animals; feeding and watering. I was outside the barn filling the water tank. I turned around just to look at the sky like I always do and in the southwestern sky I saw 3 orange orbs clustered together light up then a forth orb that was by itself light up just as the 3 orbs began to 'fade' then disappear, the fourth orb then disappeared. It was a little further south than the cluster. The total length of time they were visable was at a count of 2 at most. It was when I saw the first three orbs that I called for my husband who was inside the barn tending to one of our horses, but by the time he made it outside, they were gone. We waited approximately 3 - 5 minutes just to see if they came back which the 3 orb cluster did. It was only visable for a count of 2 again but it was further north than were I had originally found them. Trees blocked our view from where we were at that time so I don't know if they came back. I checked in the front of our house but didn't see them again. They were orange in color. They gradually lit up reached what I thought to be the brightest then faded away. This was for both sightings. There was no movement noticable while they were lit and the only 'movement' I can say I noticed is when the second set of 3 orbs appeared further north. My first thought was flares but that would have left more of a noticable trail or noted movement. There was none. I knew it wasn't headlights as it was to far up in the sky for that. The sky was clear so there was no reflection on the clouds. I don't know what it was and really don't have any sort of explanation other than they were orange orbs. I have never seen anything unusal that I couldn't explain as something 'normal' or ordinary. I am always on the look out for these events but this was the first for both my husband and myself."],"Source":"MUFON","Date of the Event":"11/04/2013 07:30 UTC","Sighting Duration":"Undisclosed","Summary":"1st sighting 1 group of 3 orbs, one single orb, 2nd sighting 3 orbs","files":["/var/www/straped/mufon/html2text/52042.html.txt","/var/www/straped/mufon/org/52042.html"],"Tags":"City","Object Shape":"Sphere","Viewing Distance":"Over 1 Mile, Unknown","Object Features":"None","Date Submitted":"11/04/2013 08:15 UTC","trends":["There have been no other sightings in Kingston","This sighting has never been favorited."],"Log Number":"US-11042013-0023","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=39.508064,+-82.816033(52042)&iwloc=A&hl=en\"> mufon case (52042) map </A>","Disposition":"Unresolved","Weather Factors":"Unknown"}