{"Log Number":"US-11042013-0024","files":["/var/www/straped/mufon/html2text/52043.html.txt","/var/www/straped/mufon/org/52043.html"],"Country":"United States","Sighting Duration":"01:14:00","Date of the Event":"11/01/2013 04:15 UTC","Object Features":"Unknown","City":"Steamboat Rock","Object Shape":"Circle, Disc, Oval, Teardrop, Other","Longitude":"-93.072424","map":"<A HREF = \"http://maps.google.com/maps?q=42.405537,+-93.072424(52043)&iwloc=A&hl=en\"> mufon case (52043) map </A>","Latitude":"42.405537","Disposition":"Unresolved","Case Number":"52043","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering,Other","Source":"MUFON","Weather Factors":"Unknown","Region":"Iowa","Summary":"Getiing my kids. Say a round shape in the sky. No lights. No sound.","Date Submitted":"11/04/2013 08:55 UTC","divs":["Sighting DetailsOn November 1st around 4pm Central Standard time my boyfriend and I were driving on Hwy 20 west bound to Fort Dodge, Iowa. We had just picked up my children from Independence Iowa around 3pm. We all were in the vehicle at the time it happened. At Approximately 4:15pm my boyfriend spotted a round circular shape in the sky just above the treetops by the Steamboat Rock exit on Hwy 20 going westbound. He pointed to it and asked if I saw what he did. I said yes and we both watch it turn at a 75 degree angle flying south just above the treeline. We then pulled over on the right side of hwy 20 and watched it. It stayed stationary after that for about 2 minutes and then just vanished reappearing on the South side of our vehicle in a vertical position. No lights were seen or sound heard. After staying vertical for a few seconds it shot straight up in the sky and disappeared. Then reappeared on the other side of our van. Both of my children saw it and were able to tell us exactly what shape and color it was. It scared my children so much I had to sit with them in the back seat. After reappearing on the one side it vanished and we didn't see it again."],"Viewing Distance":"101-500 Feet","trends":["There have been no other sightings in Steamboat Rock","This sighting has been favorited 1 time."]}