{"Source":"MUFON","Log Number":"US-11042013-0022","Latitude":"39.757577","City":"Indianapolis","trends":["There have been 126 other sightings in Indianapolis","There was one other sighting in Indianapolis on or around October 12th 2013"],"Date of the Event":"10/12/2013 04:30 UTC","Region":"Indiana","Longitude":"-86.116534","Weather Factors":"Unknown","Summary":"space shuttle crossed with a stealth fighter floating about 20 ft off ground","files":["/var/www/straped/mufon/html2text/52041.html.txt","/var/www/straped/mufon/org/52041.html"],"divs":["Sighting DetailsI was driving north on Hoyt St just south of I 70, I was just coming up on a armory and just happened to look to my left and had to do a double take. There was an object floating I would say about 20 ft off the ground above a fleet of army trucks, the armory looked pretty deserted, and I was about 50 yards from the object. When I first say the object I was kind of seeing it from a front view which was a very quick look, it appeared to have some sort of wings, and I believe a tail, it was dark in color, maybe black or gun metal gray, it had like a sparkly silver strip on the side, and very stealth with sharp edges and corners on it side, and there was absolutely no sound, no dust or debris flying from some sort of engines holding it in place, it was just floating there. I had too look away because of traffic and when I turned back about 30 seconds later the object had moved at least 2 miles west, not a sound, I had to look away again because of traffic and looked back I could no longer see the object, I would say this all took place with in 1 or 2 minutes, and I will tell you it was the strangest thing I had ever seen, it was just floating there, but I would have to say that I believe it was man made because of the look, but as far as I know we don't have anything that can act like that."],"Country":"United States","Object Flight Path":"Stationary,Hovering then path","Viewing Distance":"101-500 Feet","Case Number":"52041","Sighting Duration":"Undisclosed","Date Submitted":"11/04/2013 08:11 UTC","Object Shape":"Triangle","Disposition":"Unresolved","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.757577,+-86.116534(52041)&iwloc=A&hl=en\"> mufon case (52041) map </A>","Object Features":"Window(s), Patterned Surface"}