{"map":"<A HREF = \"http://maps.google.com/maps?q=42.386148,+-82.911859(5205)&iwloc=A&hl=en\"> mufon case (5205) map </A>","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/5205.html.txt","/var/www/straped/mufon/org/5205.html"],"Date Submitted":"07/15/2000 12:00 UTC","trends":["There has been one other sighting in Grosse Pointe","There were no other sightings in Grosse Pointe on or around July 15th 2000"],"Weather Factors":"Unknown","Disposition":"Unresolved","Date of the Event":"07/15/2000 12:00 UTC","Object Shape":"Circle, Triangle","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Latitude":"42.386148","City":"Grosse Pointe","Case Number":"5205","Log Number":"US-08072006-0002","Longitude":"-82.911859","Object Features":"Unknown","divs":["Sighting DetailsIt was a nice day at the local park. The park is located on Lake St. Clair in Michigan. The sky was clear except for some clouds which were skatered in the sky. As I was laying back on my chair I noticed the shadows of a triangular looking moving shape. The shadows were flying in a trangular formation. There were six individual smaller shadows flying in unison making a triangular formation. At first I thought I was seeing things. I was confused at first, because once the shadows left the clouds there was nothing there. NOTHING THERE EXCEPT BLUE SKY. The objects were moving in a very straight line in the sky so it was not difficult to track its direction. Every time the objects flew into the clouds I could clearly make the shapes out. The formation was perfect! The other amazing point is the rate of a speed. The objects were able to fly from one point in the sky (from south to the north) in very short time, perhaps 30 seconds. NO ONE NOTICED except me. There were people everywhere, there was no sound from the objects and no trace of them in the open sky. BIZARE!"],"Summary":"Flying objects in uniform formation","Tags":"City","Region":"Michigan"}