{"Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"11/04/2013 09:00 UTC","Case Number":"52053","map":"<A HREF = \"http://maps.google.com/maps?q=40.66314,+-122.381985(52053)&iwloc=A&hl=en\"> mufon case (52053) map </A>","City":"Redding","trends":["There have been 39 other sightings in Redding","There was one other sighting in Redding on or around November 4th 2013"],"Object Flight Path":"Hovering then path,Path with directional change","Weather Factors":"Unknown","Region":"California","Sighting Duration":"Undisclosed","Latitude":"40.66314","Tags":"City","Object Shape":"Boomerang, Star-like","Summary":"Sitting out side on front porch smoking a facing E. Noticed red star what I thought was Mars Object slowly floating NW then got binoculars Saw boomerang shaped craft with red/white lights under wings Second airplane entered airspace Chased craft out area","Source":"MUFON","Date Submitted":"11/05/2013 01:55 UTC","Longitude":"-122.381985","divs":["sighting detailson nov 4th, 2013 approximately around 2100 hrs. west coast pacific time, i was sitting on my front porch smoking a cigarette facing the east looking at the stars. i noticed a bright red \"star\" looking object which at the time i thought might have been the planet mars. for the next minute or so i noticed the object moving slowly to the ne. i then got up and quickly retrieved my binoculars from the trunk of my parked car near-by. i then lined the object up in the night sky and it suddenly and quickly morphed into a very large boomerang shaped single wing aircraft with two lights, one under each wing. red light on the port side wing and a white light on the starboard side. both rectangular in shape. this craft made no noise at all until the vehicle was closer to our residence to the nw. the noise sounded like a low humming, muffled jet engine. then almost immediately a small regular type \"airplane\" appeared from the se in almost the first crafts initial direct flight path as if to follow it and\\or intercept the larger. when this seemingly \"cat chase\" ensued the first-larger aircraft increased flight speed and swiftly flew off in to the western sky's out of sight with the smaller aircraft continuing to follow until both were out of my sight approximately 2115 hrs. this statement is true and correct to the best of my recollection."],"files":["/var/www/straped/mufon/html2text/52053.html.txt","/var/www/straped/mufon/org/52053.html"],"Log Number":"US-11052013-0005","Disposition":"Unresolved","Object Features":"None, Wings"}