{"Longitude":"-84.277518","Date of the Event":"11/02/2013 09:02 UTC","Date Submitted":"11/05/2013 08:18 UTC","Case Number":"52059","divs":["Sighting Detailson the eve of nov. 2 2013, I was at my girlfriends apt. helping her move. I stepped out onto the patio, located on the second floor, to take a smoke break, looking out over the pond and skyline, out of nothing just suddenly appeared these orange kinda red, lights? or balls in the sky jst above skyline as in straight ahead! these lights did not appear to shine? or glow? or even project light? they just were there. as like a ball of color? there were four, moving like in a horizontal line? yet idependent? maybe a mile away or so? yet balls of light were like the size of a penny or nickel? large, 4 large lights slowly rotating into position falling straight down... I started beating on the glass door and yelling for my girlfriend to come quickly! and she did. I grabbed my cell phone to get a pic. it was 9:02pm my girl asked wow what is it? and got her cell out with video to film but only got a glimps on film and us yelling and talking, as these lights went more into a line across it appeared to me the object was rectangle or triangle but flat? not positive , but seemed to point down at like a 45deg. angle tilt, then level up and hover a min. and then slowly started moving and flew away slowly heading to the south or south east, I got up and even stood on her patio chair to watch every sec. I could see as it dissapeared toward a small town of Springboro, ohio. we were so confused at what we saw we contacted chan. 7 news and they said nothing reported yet? my girl called the write brother airport, that is that direction. the emergency on call person tells her that it is closed and no one there as of 8pm !later that eve the maintenance supervisor who lives next door to her comes outside and I tell him what we saw, he must have went inside to tell his wife and teenage daughter, who looked at eachother and said see dad we told you!? several nights prior come to find out his wife and kid saw the same or very similar thing! and it scared them to go back inside, this being weird as it is now 4 of us have seen this, the next day I tell my boss the story, and he jst looked and said remember me telling you what me and my wife saw a month ago? ! same thing ! or very close to it and close to same area! when he told me I never really paid much thought to it of course? ufo ? ya right? sure? hahaha.. this now makes 3 couples 3 separate times all same locations or within a few miles, only my boss and wife were on motorcycle, the lights appeared in front of them, as they watched and rounded a turn they jst vanished.. only to reappear min later in totally op direction!! south Dayton, ohio. none of us know what we saw and are making no claims to what it is. but it is something. and its very real ! 6 of us seen this 3 separate times. anyone with any information please let us know. now I cant stop thinking, or looking, yet afraid to tell anyone, because like me I didn't listen or think ya right, your crazy..."],"Region":"Ohio","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.644136,+-84.277518(52059)&iwloc=A&hl=en\"> mufon case (52059) map </A>","Source":"MUFON","Sighting Duration":"Undisclosed","trends":["There have been 7 other sightings in Miamisburg","There were no other sightings in Miamisburg on or around November 2nd 2013"],"Weather Factors":"Unknown","Summary":"standing on second floor patio taking a break, lights jst suddenly appeard out of nothing? these very large lights slowly decended, then started moving , i started yelling for girlfriend to come witness this and her jaw dropped.","Object Features":"Unknown","Disposition":"Unresolved","City":"Miamisburg","Tags":"City","Log Number":"US-11052013-0011","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/52059.html.txt","/var/www/straped/mufon/org/52059.html"],"Country":"United States","Latitude":"39.644136"}