{"Date of the Event":"11/04/2013 05:30 UTC","Region":"Pennsylvania","Longitude":"-76.564411","Log Number":"US-11052013-0009","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Felton","This sighting has never been favorited."],"Disposition":"Unresolved","Country":"United States","files":["/var/www/straped/mufon/html2text/52057.html.txt","/var/www/straped/mufon/org/52057.html"],"Latitude":"39.854824","Viewing Distance":"Over One Mile","Summary":"Light appear, deminish to being off, then reappear","map":"<A HREF = \"http://maps.google.com/maps?q=39.854824,+-76.564411(52057)&iwloc=A&hl=en\"> mufon case (52057) map </A>","divs":["Sighting DetailsWithin in the Felton,Pa. area began seeing abnormal light groups. Having 23 years of aviation experience, began to question the source or object. 3 Nov 2013, notice a bright light that stayed stationary for extended periods of time. I traveled to a higher elevation to find that with the visual horizon of the skyline, 8 additional lights were observed. Each appeared to be less than a 1000 ft about ground level, in a radius perimeter expanding over the entire field of view of approximately 270 degrees. The lights would intensify becoming extremely bright for a short periods of time as the objects remained stationary. As the object dimmed, the lights were in a triangular shape vertically. A brief description would be if 3 incandescent light bulbs were stacked horizontally. Driving towards the source, the lights would vanish. Twice on the evening of 3 Nov, once in the location of the object, the source of the illumination went off, revealing an aircraft. I exited my vehicle in an attempt to listen as it flew directly over head less the 500ft above ground level. The normal position markers and anti collision light were observed but the craft was practical silent. If not straining to hear the power source, if would have easily passed unnoticed. I can not express completely in detail the coloration changes of the lights from each of the craft observed. 4 Nov 2013, I spoke to friends within the aviation community, although none doubted what I described, none of us could come up with a logical explanation. On this same evening, 3 of us travelled to the high point field of few which I witnessed the activity the night before. By 6pm, the craft were back within the same areas. With the vehicle parked, and lights off , we just observed the activities. Attempts were made to capture on video. Once viewed, its just not enough detail. We all agree that whatever the source of the lights, it is high energy. No light beams, or spot lights, but more of a intense glow of variable colors. The most visible activity is between 5:30pm and 8:00pm. Within the course of our observation, once again, a craft few directly over head, emitting practically zero sound. One personal belief is these may be drone aircraft. Prior manufactured drone aircraft could not remain stationary due to being prop driven. Now, drone aircraft do have the ability to remain stationary and are of a rotor wing design. The this being a plausible explanation as what the craft may be, the next question is why are they there and what are they doing ? We search the web for more answers a came upon this site. Seeing the many have described similar sitings, we thought this is the place to post our story. We are going back to the same point tonight being 5 Nov to watch what we consider the unknown. If anyone else witnesses this type of light, be sure to look for others. I was actually shocked to see how many were actually seen at one time. Ten of us will be there tonight. I must say, the one of the observers that was along 4 Nov, has stated she will not go back to watch due to fear of what was seen, and possibly being seen. More to Come !"],"Case Number":"52057","Object Flight Path":"Stationary,Hovering then path,Path then hovering","Tags":"City","Object Features":"None","Date Submitted":"11/05/2013 02:56 UTC","Object Shape":"Diamond, Triangle","City":"Felton","Weather Factors":"Unknown","Source":"MUFON"}