{"Date Submitted":"11/05/2013 03:01 UTC","Sighting Duration":"00:08:30","Object Features":"None","divs":["sighting detailsafter my first ufo sighting in 1978 i soon forgot all about it. in 1995 i had a relative short encounter with aliens. i had my nightlight on as i fell to sleep facing my open window. at around 1:30 am i became aware of myself lightly dreaming seeing gray clouds. i then opened my eyes and realized i could not move my toes or anything else, except for my eyes and head. managing to rool over on my back i saw up against my closet an orange grey, and 3' from it an alien i later found out to be called, \"god mars\". i kept staring at the orange grey in disbelief as how it could be orange noticing its eyes were a lighter shade orange. when i first looked at \"god mars\" being all pure white with radiation moving on its body it projected a 6\" white aura onto my bedroom door for 3 seconds then the aura went back into him. both entities were perfectly still, as they each had a round foot long 3\\8ths of an inch white enamel stick in front of them. neither one touched the sticks. the sticks were upright on a foot wide wooden counter that stretched out in front of them. the counter was waist high to the entities. \"god mars\" had a small head with small round eyes, and huge rounded shoulders. when i looked away from the entities i became aware of one inch long lines hooked on to the backs of my head near my ears. then i realized the lines being thinner than a hair was the source of why i could not move. and then i realized the sides of my head feeling bloated. then looking back at the entities i soon heard a loud motor sound coming from them, and towards my bed. in panic i screamed as loud as i could three times. when i screamed the third time, with my eyes closed, moving my head from side-to-side i noticed everything was gone when i opened my eyes. at this time i was kicking my legs and moving my arms. i went right to sleep. 9 months later i found a website that mentioned orange grey. otherwise i never heard of one, and years later i bought 2 dvds that show the entity i encountered called, \"god mars\". it is engraged on a boulder in a foriegn country and said to have great knowledge. i recognized the small head a huge rounded shoulders. attached are all my ufo sightings and alien abduction, encounter experiences. i might have sent you the document before, but just to make sure. you might find it beneficial in your research. thank you."],"Summary":"The first time I saw an Orange grey and God Mars.","Viewing Distance":"20 Feet or Less","Case Number":"52058","Source":"MUFON","trends":["There have been 27 other sightings in Garden Grove","There were no other sightings in Garden Grove on or around September 17th 1995"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.794541,+-117.956918(52058)&iwloc=A&hl=en\"> mufon case (52058) map </A>","Weather Factors":"Unknown","Log Number":"US-11052013-0010","Country":"United States","Longitude":"-117.956918","City":"Garden Grove","Date of the Event":"09/17/1995 01:30 UTC","files":["/var/www/straped/mufon/html2text/52058.html.txt","/var/www/straped/mufon/org/52058.html"],"Tags":"City","Object Flight Path":"Unknown","Region":"California","Latitude":"33.794541","Object Shape":"Other, Unknown","Disposition":"Unresolved"}