{"City":"Discovery Bay","Sighting Duration":"Undisclosed","Source":"MUFON","Region":"California","Latitude":"37.92433","Tags":"City","Object Features":"None","Case Number":"52052","divs":["Sighting DetailsOn 11-2-13 at approx. 11:00 pm I was walking my dog near my house in a residential area with my 6 year-old daughter. I looked east and saw a bright reddish orange sphere object about 45 degrees above the horizon. I thought this was a very strange object because it just floated and did not move. It then moved very slowly in a south direction. It then turned and went slightly north and then went east picking up speed and then out of view blocked by rooftops. It didn't shoot away quickly it just seemed to accelerate smoothly but at a moderate pace. My daughter and I saw it for about one minute. I could tell it was very close and low by how fast it dropped over the horizon behind the rooftop. It was definitely not a plane and I thought maybe it was a floating Chinese lantern because of the way it glowed and changed colors from red to orange and appeared to float but it did not move with the wind but changed directions. We continued looking for several minutes and it suddenly appeared again near the original location. It seemed to just appear and it may have been a second orb because the first was pretty far away when I last saw it but I only saw one at a time. This time it was not as bright. I ran back to my house which was only a few doors away and got my video camera and told my 11 year-old what we saw. We went back and it was not there. We waited about five minutes and it appeared briefly for about one minute near the original location but the lights then went out or it left quickly. I believe it went east but I was looking through my video camera and lost sight of it. I got a brief video but it was not very good because my dog was pulling on me. We waited about five more minutes and did not see it again and went home. We were all quite excited as this is the first UFO we've have ever seen. I say that because this was unlike anything I've ever seen. When we arrived home, I went upstairs in our two-story home and opened the blinds and looked out a large east window for about ten minutes hoping to see it again but saw nothing and figured the event was over. I left for only about one minute and decided to check one last time and close the blinds and I was shocked to see it right in front of the house at about a 60 degree angle, much closer than the first two times. This time it was very bright because it was very close. I do not know how it got there that quick because I was only gone for a minute. My daughter was on the telephone telling her friend about it who lives a short distance away and told her we are seeing it again and to go outside. I ran outside and began videoing it. My two daughters and wife came and they witnessed it. My daughter also took an image of it with her tablet. It remained still for about 20 seconds and then moved slowly in a southerly direction pulsating its colors with various shades of orange and red sort of like a fire. It was an orb shape but seemed to change shape slightly with the bright glow around it. It flickered a few times getting dim and then would get bright again. It continued moving in a southerly direction and got very dim either because it sped up going away from me or just shut off and then it was gone last seen going south. This viewing lasted about three minutes. I estimated it was about 500 to 1000 feet in altitude. I estimated the size to be about 10 to 20 feet in diameter. It was silent with no sounds or noise emitting from it. I Googled \"red orb over Discovery Bay\" and found two reports this year, one with video and the video was exactly the same type of object we saw. Other searches revealed reddish orange orbs to be a common UFO phenomena in recent years. Can't say it was extraterrestrial but it appeared to be controlled based on its movement and was unlike anything I've ever seen. I called two Sheriff's offices since I live near the border of two counties and they had not received any reports. I called two local papers and they had no reports. I'm sure others must have seen this since it was so bright and unusual and this is a populated residential area. I will post the video on YouTube and here which is okay quality but I used too much telephoto but you can clearly see it."],"Date Submitted":"11/05/2013 01:43 UTC","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-11052013-0004","Object Shape":"Sphere","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Date of the Event":"11/02/2013 11:15 UTC","trends":["There have been 3 other sightings in Discovery Bay","There were no other sightings in Discovery Bay on or around November 2nd 2013","This sighting has never been favorited.",""],"Longitude":"-121.626021","Weather Factors":"Unknown","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/52052.html.txt","/var/www/straped/mufon/more/52052_submitter_file1__redlight.jpg","/var/www/straped/mufon/org/52052.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.92433,+-121.626021(52052)&iwloc=A&hl=en\"> mufon case (52052) map </A>","Summary":"Reddish orange sphere moving slowly in different directions changing colors and then going black","Country":"United States"}