{"trends":["There have been 3 other sightings in Trout Lake","There were no other sightings in Trout Lake on or around August 6th 2006"],"Date Submitted":"08/06/2006 02:30 UTC","Object Flight Path":"Straight-line path","Object Features":"None","Source":"MUFON","Case Number":"5207","Region":"Washington","Sighting Duration":"00:02:00","Log Number":"US-08072006-0004","Viewing Distance":"Over One Mile","Summary":"Triangle pattern of white lights moving in formation across the night sky","Country":"United States","files":["/var/www/straped/mufon/html2text/5207.html.txt","/var/www/straped/mufon/org/5207.html"],"Weather Factors":"None","City":"Trout Lake","map":"<A HREF = \"http://maps.google.com/maps?q=45.997343,+-121.528137(5207)&iwloc=A&hl=en\"> mufon case (5207) map </A>","Tags":"City","divs":["sighting detailshi my uncle ken lives on guler rd in trout lake washington. our family has been coming to trout lake since the marshall family settled there in the many years ago. we always camp in my uncles back yard during the trout lake fair and on friday\\saturday nights we play guitar, sing, and stargaze. often we are up until 2:00 or later watching for shooting stars and we did so again this weekend. sunday morning 8\\6\\2006 at 2:30 am my wife jeannie and i were in ken's yard looking up at the milky way and facing east. the weather conditions were perfectly clear and great for watching shooting stars. out of the south appeared a triangle pattern of stars from behind the trees at the edge of the yard. this formation about was about eighty degrees up from the horizon and slowly began to cross our wide open view of the sky from south to north in the direction of mount adams. we first thought this was our eyes playing tricks on us because the lights were the same intensity as most of the stars except they were all three moving north in a formation that moved without deviation of speed or shape. this was not a solid object but rather three points of light as we could see the other stars in the middle of the triangle as it moved. this was a large triangle, lead across the sky by two stars and the third one following at spacing slightly larger than the other two, but exactly equally spaced in relationship to the first points of light, then forming a triangle. since there were several friend and family all camping in my uncles yard i began yelling for a friend buddy to get up, knowing he had just went to sleep in the back of his pickup truck next to us. he got up and came to where we were standing and we asked him what is that? do you see what we see? he said yes, those three stars are moving! at this point the formation was crossing the milky way but still bright enough to watch them. buddy watched them with us until they were blocked from our view by trees to the north. the entire time it took the three points of light to cross the sky took about two minutes. i have looked at the night sky for years and i have never seen anything like it. it left my wife and me with an uneasy feeling about how weird it was, and then we went to bed gene a. presler 710 w. 24th st vancouver, wa 360-696-1476"],"Date of the Event":"08/06/2006 02:30 UTC","Object Shape":"Star-like","Latitude":"45.997343","Disposition":"Unknown","Longitude":"-121.528137"}