{"divs":["sighting detailsabout 11:10 am on nov. 6th.(wed) 2013.. i was at work and go outside to take a 5 min break to make a phone call, very bright sun to the east, to the right of the sun, very far away, i can see a plane flying away from my location, (very high in the air, can see the vapor trails it makes and the shape of the plane). not a cloud in the sky, about 55\\60 degrees, light wind from the east.. i put my hand up to block the sun from my eyes... and saw a very bright white starlike and starshaped, glowing shape...at first i thought it was a reflection from the sun in my eyes... but i started to see the object move away from the sun (it was very high in altitude) the object was moving in a straight line in very incredible fast speed (by the distance it was in the air, and looking back at the plane, i knew it was not a man made object, the plane was moving slow, and leaving a trail behind, this object was not) i watched the object move incredibly fast towards the northwest, (from my location, it was traveling in the direction towards the akron\\canton area (ohio)....i watched the object for about 25 seconds, and was pointing at it with my finger and from where i was, from the location and distance away from the object, i knew it was not man made... it was not a plane or satilite, it was moving way to fast and in a straight line... after about 25 seconds, it faded into the blue sky... the hair on my neck stood up, and i had a very big chill down my back..after seeing this, i got very excited, my throat tightened up, more chills up and down my body... and i started to say out loud \"yes yes yes!! finally! i got to see my first ufo sighting!!! i can scratch that off of my bucket list!!\" i will never forget this day!! i went back into the door of work, and the other employee was comming out, and i told him. we went back outside, and no visible sight of the object.... hope i see more, i said to him!! he smiled and we went back to work..."],"Object Flight Path":"Straight-line path","trends":["There have been 6 other sightings in Bethel Park","There were no other sightings in Bethel Park on or around November 6th 2013"],"Case Number":"52072","Sighting Duration":"Undisclosed","Date of the Event":"11/06/2013 11:10 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/52072.html.txt","/var/www/straped/mufon/org/52072.html"],"Object Features":"Unknown","Log Number":"US-11062013-0008","Latitude":"40.300256","City":"Bethel Park","map":"<A HREF = \"http://maps.google.com/maps?q=40.300256,+-80.045915(52072)&iwloc=A&hl=en\"> mufon case (52072) map </A>","Country":"United States","Region":"Pennsylvania","Viewing Distance":"Unknown","Longitude":"-80.045915","Date Submitted":"11/06/2013 10:03 UTC","Disposition":"Unresolved","Weather Factors":"Unknown","Object Shape":"Sphere, Star-like, Other","Source":"MUFON","Summary":"very bright starlike moving extremely fast away from sun and plane going northwest..faded out of sight into blue sky"}