{"Object Shape":"Boomerang","Date of the Event":"11/06/2013 11:45 UTC","Disposition":"Unresolved","Longitude":"-94.131442","Case Number":"52077","divs":["Sighting DetailsI was standing in my backyard as I always do after work every night looking up at the stars. I was enjoying the clear night and a sky with no regular aircraft in site. I was looking due west approximately what I thought was about 9 or 10 0'clock. and I saw what I thought at first was a reflection of one of those spotlights that are used at special events or airports. then it moved closer and I could see a series of lights with equal amounts of separation. it had a slight bend in the formation, and it didn't move sqaurley from the apex of the curve, it moved at an angle.with all the lights following in line with the lead light.if I had to put a size on what the mass would be I would say it could have been a mile or two wide. though I couldn't see mass just a row of lights I felt it was one solid object.it moved from the northwest to the southeast. I felt in awe and completely convinced that it was a full blown ufo as I have spent a lot of time looking up at the night sky and I have definitely never seen anything that was as fantastic a site as this thing was. this isn't the first ufo I have seen so I didn't get overly exited but it was thrilling. I watched it go out of site moving to the southwest"],"trends":["There have been 4 other sightings in Springdale","There were no other sightings in Springdale on or around November 6th 2013"],"Object Flight Path":"Straight-line path","Region":"Arkansas","map":"<A HREF = \"http://maps.google.com/maps?q=36.192335,+-94.131442(52077)&iwloc=A&hl=en\"> mufon case (52077) map </A>","Weather Factors":"Unknown","Summary":"a string of lights with about a 20 degree curve [ 15 to 20 ] moved at what seemed like a high altitude and at a very smooth high rate of speed","Log Number":"US-11072013-0004","files":["/var/www/straped/mufon/html2text/52077.html.txt","/var/www/straped/mufon/org/52077.html"],"Object Features":"Unknown","Sighting Duration":"00:00:16","Country":"United States","Viewing Distance":"Unknown","City":"Springdale","Date Submitted":"11/07/2013 03:21 UTC","Latitude":"36.192335","Source":"MUFON","Tags":"City"}