{"map":"<A HREF = \"http://maps.google.com/maps?q=25.625562,+-80.322075(52070)&iwloc=A&hl=en\"> mufon case (52070) map </A>","Sighting Duration":"Undisclosed","Case Number":"52070","Country":"United States","Date Submitted":"11/06/2013 08:07 UTC","Weather Factors":"Unknown","trends":["There have been 3 other sightings in Palmetto Bay","There were no other sightings in Palmetto Bay on or around December 14th 2004"],"divs":["sighting details at the time i in lived in an apartment, 2 story walk-up. i was working in the airline industry. date: it was a typical late fall\\early winter day in southern florida...brilliantly clear with only a few white clouds in the sky. my front door faced east on the second floor...i had a \"panoramic or unobstructed view\" of the sky. as i exited my apartment out of the corner of my eye, i noticed something \"odd\" in the sky. i looked over, in a southeasterly direction and saw a \"black squeakly vertical line\" in the sky at about 10,000 feet. the \"black squeakly line\" was about 50-75 ft. long. next was unbelieveable. out of the black squeakly \"wormhole\" line, emerged a tubular shaped ufo. the ufo was very shiny silver in color. ufo slightly \"bulged\" in the middle area of the tubular shape. ufo was flat at the front and flat at the rear...no wings, no tail no appendages. ufo was black on the front, flat area. from the rear of the tublar ufo emerged brown, billowing, billowing smoke. the smoke did not correspond to the speed of the ufo...it was very \"odd\". the ufo was estimated to be 50-75 feet long and 25-30 feet across the ufo moved in a directly north directiion as it and the smoke emerged from \"wormhole\" , after it and the smoke emerged from the vertical black wormhole, for about 1 mile or so, then made a sharp turn to the east for about 2-3 miles, then turned sharply to the south and coninued. this \"black wormhole\" was not as portrayed on televison..as \"circular\" in shape...but a vertical, black squeakly line...it disappeared after ufo emerged out of it !!! the movement of the tubular shaped ufo was very, very, very odd. it's movement was if the ufo was \"floating on water\" or being \"manipulated\" with \"strings\" like a puppet. i would say its movement was a couple hundred miles per hour. i ran inside my apartment and grabbed my inexpensive camera...took a couple of photos. by the time i returned outside the \"smoke trail was still there...visible in photo\", but the tubular ufo was either too far away by now or not visible to the naked eye in the photos...but what was visible in the photo but not to the visible eye...a blurry, angled at 45 degree line is visible in the center of the photo , lower and closer than the original ufo. at the time, i did send a photo copy to local mufon person. i reported another very interesting ufo sighting to mufon report #45604, plus have an interesting small blog on google titled; ufo over homestead, florida, new years eve 2012...actual date was 12.31.2012 at about 8:50 pm few hours before 01.01.2013 east time,...that is \" really\" shocking also...."],"Object Flight Path":"Path with directional change,Other","Object Features":"None","Disposition":"Unresolved","Region":"Florida","Log Number":"US-11062013-0006","Summary":"Shiny/ Silver UFO emerged from \"BLACK SQUEAKLY LINE...WORMHOLE\" over Palmetto Bay, Florida !!!","Source":"MUFON","Object Shape":"Cylinder","Viewing Distance":"Over One Mile","City":"Palmetto Bay","Longitude":"-80.322075","Tags":"City","Latitude":"25.625562","Date of the Event":"12/14/2004 12:00 UTC","files":["/var/www/straped/mufon/html2text/52070.html.txt","/var/www/straped/mufon/org/52070.html"]}