{"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Date Submitted":"11/07/2013 06:05 UTC","Summary":"ME & MOM DRIVING UP MOUNTAIN. SAW 1 LIGHT BALL DROP FROM SKY, SPLIT INTO 3, HOVER SEPARATED OVER TREELINE, AS CENTER 1 ASENDS OTHER 2 MEET INTO 1 & GO STRAIGHT BACK UP & DISAPPEARS IN THIN AIR","Latitude":"36.892599","Longitude":"-82.629602","trends":["There have been 4 other sightings in NORTON","There were no other sightings in NORTON on or around April 13th 1991"],"files":["/var/www/straped/mufon/html2text/52087.html.txt","/var/www/straped/mufon/org/52087.html"],"Country":"United States","Date of the Event":"04/13/1991 12:00 UTC","Log Number":"US-11072013-0013","Case Number":"52087","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsME & MY MOM (STILL LIVING) WERE DRIVING UP THE MOUNTAIN OUT OF POWELL VALLEY ON THE NEW 4-LANE HWY. WE WERE LISTENING TO THE RADIO & TALKING WHEN SUDDENLY A BRIGHT ROUND LIGHT DESCENDED FROM THE SKY LIKE IT WAS OUT OF THIN AIR! AS IT GOT CLOSER TO THE TREELINE IT SPLIT INTO 3 \"LIGHT OBJECTS\" & SEPARATED. THE MIDDLE ONE CAME STRAIGHT DOWN WHILE THE OTHER 2 FLEW AWAY FROM IT AT AN ANGLE & ALL 3HOVERED OVER THE TREELINE FOR A BIT. THE MIDDLE STARTED TO ASCEND WHILE THE OOTHER 2 (FLYING AT AN ANGLE) MET THE CENTER ONE AS THEY WERE ALL ASCENDING. AT THE EXACT SECOND THEY MET IT BECAME MUCH BRIGHTER LIKE A \"FLASH\" THEN BACK TO THE SAME INTENSITY THEY WERE & THE SINGLE LIGHT OBJECT (WHICH WAS 3 AT ONE POINT) BEGAN TO ASCEND & DISAPPEARED INTO THIN AIR! WHILE THIS WAS GOING ON, IT WAS COMPLETELY SILENT IN THE TRUCK. AFTER IT DISAPPEARED, MY MOM LOOKS OVER AT ME & SAYS \"DID YOU SEE THAT?\"...I SAID \"WHAT DID YOU SEE?\"...SHE SAID \"THOSE LIGHTS?\"...I SAID \"YEAH, I SAW THEM TOO.\" SHE REPLIED \"WONDER WHAT THAT WAS!?\". I SAID \"I DON'T KNOW AND I DON'T CARE TO FIND OUT!\" WE WERE PETRIFIED! WE NEVER SPOKE OF IT AGAIN FOR A LONG TIME. WE SURE DIDN'T TELL ANYONE ELSE BECAUSE WE WE'RE AFRAID PEOPLE WOULD THINK WE WERE CRAZY. MY GRANDMOTHER WAS BORN & RAISED IN OUR VALLEY & ALWAYS TOLD ME TALES OF ALLL THE TIMES SHE SAW \"LIGHTS ON THE MOUNTAINS\" WHILE GROWING UP. SHE WAS BORN IN 1919 & WOULD NEVERRR LIE! SHE TOLD ME OF DIFFERENT COLORED LIGHTS RUNNING BACK & FORTH ON THE SIDES OF THE MOUNTAINS IN THE VALLEY. SHE SAID THEY WERE REALLY FAST & WOULD DART BACK & FORTH. HER COUSIN ALWAYSSSS SAID HE SAW \"LITTLE BLUE MEN\" AT HIS CABIN ON THE MOUNTAIN. HE SAID THEY JUST KEPT COMING BACK TO VISIT HIM. HE NEVERRR CHANGED HIS STORY. HE SWORE TO IT TIL THE DAY HE DIED. HIS CABIN STILL STANDS."],"City":"NORTON","map":"<A HREF = \"http://maps.google.com/maps?q=36.892599,+-82.629602(52087)&iwloc=A&hl=en\"> mufon case (52087) map </A>","Tags":"City","Disposition":"Unresolved","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Region":"Virginia","Object Shape":"Circle, Sphere","Object Features":"Unknown","Source":"MUFON"}