{"Sighting Duration":"00:00:04","Disposition":"Unresolved","Viewing Distance":"20 Feet or Less","Weather Factors":"Unknown","Date Submitted":"11/07/2013 06:10 UTC","Longitude":"-104.83506","Object Flight Path":"Stationary","Date of the Event":"07/20/2012 08:15 UTC","Tags":"City","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=38.966581,+-104.83506(52088)&iwloc=A&hl=en\"> mufon case (52088) map </A>","Latitude":"38.966581","City":"Colorado Springs","Source":"MUFON","trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around July 20th 2012"],"Region":"Colorado","Country":"United States","Case Number":"52088","Summary":"Entitys causing me to pass out","Object Shape":"Unknown","Log Number":"US-11072013-0014","divs":["sighting detailsi need help with this, this is not the first time i have dealings with entitys, i have had it with this problem and need help. please not that this is the second time i have met these beings: i had just gotten in my bed (its about 2-3 feet from the ceiling in my room) and i feel like i am having a heart attack, i i had a strong feeling of some one in my room and (from a laying position i roll over and place my arms flat on my pillow so i can see over the head of my bed) i look over and i see a 7 or 8 foot tall being, he\\she is extremely dark and i cannot see any detail but a total of a black silhouette. it had never moved or touched me this time, it just stared at me. i have about a second of eye contact and i unexpectedly, and like a rag doll, pass out and crumple in my bed. i wake up late in the morning only because my dad had shaken me till i had become conscious. i lost sight of the being because i was unconscious, i have seen it\\one of them before and i had not passed out on eye contact. after this i feel completely powerless and in need of help. i need help, please call me and my dad, i have experienced events previous to this and after, this is just one of the 4 or so events i have dealt with, please, im tired of the stress."],"files":["/var/www/straped/mufon/html2text/52088.html.txt","/var/www/straped/mufon/org/52088.html"]}