{"Log Number":"US-11072013-0012","City":"New York","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.717483,+-74.004223(52086)&iwloc=A&hl=en\"> mufon case (52086) map </A>","Weather Factors":"Unknown","Longitude":"-74.004223","Date of the Event":"07/10/2002 08:30 UTC","Object Features":"Dome","Summary":"A UFO in NY attached me>","Sighting Duration":"Undisclosed","Country":"United States","divs":["Sighting DetailsI was siting in my girlfriends kitchen on the eighth floor with my girlfriends son. I was sitting by the window smoking a cigarette, on the other side of me was the kitchen table and on the other side of the table sat my girlfriends son. We are sitting, having a conversation when all of a sudden the boy which is fourteen at the time picks his hand up, points past me out the window and ask me boomer whats that ? I turn to see what he is pointing at and to my surprise and amazement there directly across the street I see this white shinning \"orb\" of glowing white light hovering. I said what the hell I turn back to look at the child and he said wow I am going to grab my mom!! (from the next room) leaving me alone in the kitchen. I immediately turn back to look at the object and as I did, the object started to glow brighter and more intense this occurred for 6 to ten seconds then as if reacting to the fact that they had been spotted an immense beam of light shot out bursting through the kitchen window hitting me in the chest violently pinning and paralyzing me against the wall, sucking all of the air out my body. I could not breath. At this point I am in a state of shock. The kitchen at that time got so bright that I could not see anything but light all of a sudden I feel some thing spinning violently in my stomach all of this occurring at once. This affect lasted for fifteen to twenty seconds. The light, like a vacuum gets sucked out of the kitchen everything comes back to view the spinning motion in my stomach stops as well and I am released from the wall collapsing to my knees crying uncontrollably. Not wanting my girlfriend to see me like that I crawled on my knees slowly exiting her apartment trying to get next door to my friends apartment I knocked on his door he opens the door to see his friend on the ground crying uncontrollably I crawl into his apartment and cry \"sobbing\" after five to seven minutes past I start to regain my composure again, and he is begging me to tell him what just happen. I guess the residual affect of what just happened wouldn't allow me to speak about it without crying and that night I would cry on and off for two hours. After regaining myself I cautiously walk back to my girlfriends apartment and asked her, did she or her soon notice anything funny in the kitchen? She responded No. I asked her son why didn't you bring your mother back to the kitchen to show her the object? His response was that she wasn't interested.thats when I broke down and asked didn't you guys see a bright light they said no. so after all that I just described my question is there anyone that has had this type of experience. I used to think that I was a tough guy standing 6'3 200 pounds Living in a tough city but after that situation I found out that I am not as tough as I thought I was. willing to listen from anyone willing to help. Thanks"],"Latitude":"40.717483","Viewing Distance":"21-100 Feet","Date Submitted":"11/07/2013 03:39 UTC","Case Number":"52086","Disposition":"Unresolved","Object Flight Path":"Stationary","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around July 10th 2002"],"Tags":"City","files":["/var/www/straped/mufon/html2text/52086.html.txt","/var/www/straped/mufon/org/52086.html"],"Object Shape":"Egg, Oval","Region":"New York"}