{"Summary":"SILENT TRIANGLE 3 SMALL LIGHTS AT POINTS","Object Flight Path":"Straight-line path","Viewing Distance":"101-500 Feet","Log Number":"US-11072013-0008","Case Number":"52082","Tags":"City","Country":"United States","Region":"California","trends":["There have been no other sightings in Larkspur","This sighting has never been favorited."],"Source":"MUFON","Date Submitted":"11/07/2013 09:38 UTC","Object Features":"None","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/52082.html.txt","/var/www/straped/mufon/org/52082.html"],"Disposition":"Unresolved","Latitude":"37.938705","Date of the Event":"11/02/2013 03:45 UTC","Longitude":"-122.51374","map":"<A HREF = \"http://maps.google.com/maps?q=37.938705,+-122.51374(52082)&iwloc=A&hl=en\"> mufon case (52082) map </A>","divs":["Sighting DetailsARRIVED AT WORK LOCKING TRUCK DOOR NOTICED LIGHT OUT OF THE CORNER OF MY EYE THOUGHT IT WAS A SHOOTING STAR AS A LIFETIME SKY WATCHER I WAS QUICK TO LOOK. SUPRIZED WHEN I SAW IT COME CLOSER AND SO CLOSE. AS IT PASSED RIGHT OVER MY HEAD SOUNDLESSLY AT SUCH A LOW ALTITTUDE I COULD SEE IT WAS A LARGE TRIANGLE WITH 3 SMALL LIGHTS ONE ON EACH CORNER. IT WAS ONLY A FEW HUNDRED FEET INCREDBLY LOW SO I COULD SEE IT WAS ONLY ABOUT 40 FEET WIDE. I KNEW INSTANTLY WHAT IT WAS AS I HAVE SEEN MANY STRANGE LIGHTS AND CRAFTS BOTH IN THE ATMOSPHERE AND OUTSIDE OF IT INCLUDING ONE OTHER TRIANGLE IN WISCONSIN IN THE 70'S WHICH WAS THE SIZE OF A CITY BLOCK WITH LIGHTS ALL AROUND ITS EDGES AND IT MADE A HUMMING NOISE HOVERING JUST ABOVE THE TREE LINE MOVING VERY SLOWLY BUT LAST SATURDAYS STUNNING TRIANGLE MOVED VERY FAST MAYBE 100 MPH. I WAS FAIRLY AWESTRUCK AT HOW CLOSE IT WAS ABSOLUTELY AMAZING. NEVER SAW ONE SO CLOSE BEFORE. IT WAS\"MORE THAN SILENT\" IS THE ONLY WAY I CAN PUT IT. ONE COULD SEE THAT ITS MOVEMENT HAD NOTHING TO DO WITH AIR OR \"LIFT\" MORE LIKE IT WAS FLOATING AND GAVE THE APPEARANCE OF NOT MOVING FAST SO MUCH AS BEING IN A HURRY, IT WAS FOLLOWING THE BAY SHORE. AWESOME. I SEARCHED FOR REPORTS FROM ANYONE ELSE AND WAS SURPRISED TO FIND NONE. BUT IT WAS 3:45AM AND THERE WAS NOBODY AROUND REALLY. IT FLEW NORTH TOWARDS SAN RAFAEL AND OUT OF SIGHT."],"City":"Larkspur","Object Shape":"Triangle","Weather Factors":"Unknown"}