{"Object Shape":"Unknown","City":"Holyrood","map":"<A HREF = \"http://maps.google.com/maps?q=38.586955,+-98.411178(52096)&iwloc=A&hl=en\"> mufon case (52096) map </A>","Latitude":"38.586955","Tags":"City","Case Number":"52096","trends":["There have been no other sightings in Holyrood","This sighting has never been favorited."],"Weather Factors":"Unknown","Date of the Event":"09/12/1998 08:30 UTC","Disposition":"Unresolved","Country":"United States","Region":"Kansas","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Sighting Duration":"00:20:00","Longitude":"-98.411178","divs":["Sighting DetailsI was renting a bed and breakfast cabin outside Holyrood Ks. while working in the area and had eaten supper this particular evening and was standing on the front porch which faced east. At around 8:30 I was standing at the porch railing smoking a cigarette when i noticed a strange purple glow in the southeast sky. Ar first it was just a thin faint glow but as I watched it got brighter until it was straight east of me and then it turned east and became what appeared to be approximately 6 by 10 or 12 feet across if it was within a half mile of my location. The whole time I observed the light there was never a sound. On later reflection I realized the frogs in the pond close by were silent also. The previous week and on days after we (fellow co-workers) observed F-117 fighters and B-2's and one B1B in the area but never saw anything different in the daylight. Even an F-18 or two ! I remember telling my forman about the lights and tonight I called him to see if he remembered the dates and he couldn't recall the exact day but said he remembered me telling him. I never forgot the details and while watching an episode of Alien Mysteries on Discovery about the Stephensville sightings a rendering of the violet lights winking out brought it all back like it was yesterday !"],"Summary":"Violet glow traveling S to N, then turn east visibly receeding til winked out, looked as big as 16 ft garage door at first.","Object Flight Path":"Path with directional change","Log Number":"US-11072013-0020","Date Submitted":"11/07/2013 08:02 UTC","files":["/var/www/straped/mufon/html2text/52096.html.txt","/var/www/straped/mufon/org/52096.html"],"Object Features":"Unknown"}