{"Disposition":"Hoax","Log Number":"US-08072006-0007","Latitude":"35.343838","Object Shape":"Boomerang, Chevron, Triangle","City":"Moore","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Date of the Event":"10/31/2005 11:40 UTC","divs":["Sighting Details\"Well, I was taking out the trash to our dumpster Halloween night at 11:40 P.M.. On the way back to my aprtment building, I always look up at the starry sky when it is clear. I noticed that at first glance, that the stars seemed to be appearing on and off. Then I realize that there was something in the sky, that was moving across it. At first glance, it was shaped well, like a dragon-like creature. I tried listening for a noise, but it did not make one. It moved so slowly, that I thought it might even be maybe one of those, creatures from Virginia, like the 'Mothman' or 'The Jersey Devil' of some kind. It also seemed to stop in mid flight, it's form appeared to be either triangular, chevron or a hang-glider shape. The only way that I could determine what shape it was, was by the stars, disappearing and reappearing again. It turned and heading over my building, I then ran around to the other side, and it had fled away. I left wondering...was this a winged creature or a UFO. Being just before midnight on Halloween, I hoped that it was not a winged creature. I felt fear as I seen it, and maybe a little intrigued. As it left I became irritated, knowing it was going over my building, where my kids and hubby were sleeping. I would say it had to have been less than a mile away from me. I didn't have any recording device on me at the time. I do hope that this Halloween will be 'Strange object' free this time.\""],"Country":"United States","Object Features":"Undisclosed","Date Submitted":"10/31/2005 11:40 UTC","Region":"Oklahoma","Case Number":"5210","map":"<A HREF = \"http://maps.google.com/maps?q=35.343838,+-97.483183(5210)&iwloc=A&hl=en\"> mufon case (5210) map </A>","files":["/var/www/straped/mufon/html2text/5210.html.txt","/var/www/straped/mufon/org/5210.html"],"Longitude":"-97.483183","Summary":"\"I wouldn't have known that it was even there, if I had not noticed the stars blacking out & reappearing again.\"","Object Flight Path":"Undisclosed","trends":["There have been 23 other sightings in Moore","There were no other sightings in Moore on or around October 31st 2005"],"Source":"MUFON","Tags":"City","Weather Factors":"Unknown"}