{"Date Submitted":"11/08/2013 01:17 UTC","Object Flight Path":"Straight-line path","Log Number":"US-11082013-0003","files":["/var/www/straped/mufon/html2text/52105.html.txt","/var/www/straped/mufon/org/52105.html"],"Case Number":"52105","divs":["Sighting DetailsFirst off I was sober I take no meds and I do respect this site. I seen the star that many see this is not the orbs or whatever this is what I call the yoke very up close above my hood 2 inches from my windshield Here is what I can tell You.... I got a cup of coffee at a local mini mart and drove off it at first looked like a bright light passing across the road. I thought ok an atv wanted to pass in front of me with a super bright sylvania like light so I slowed down here it was not an atv 4 wheeler it was a star like possibly fish or alien creature I had to slow down and actually stop because I did not want to hit it best way to describe it is it is like a 6ft yoke of an egg with 8 or more sharp triangular points potruding out of it and if it spins fast it could be like a chain saw kinda like the top of the statue of liberty this thing has a center that is like an egg yoke so very bright it looks like a star white from a distance but more yellow egg when You get close I watched this unknown creature almost hit My windshield it somehow knew it was above my hood then spun tilted and arced the top 2 of the bones with webbing to catch wind lifted up the white fish like bones that had a webbing in between each and it lifted up spun for me got out of the way then landed in the woods. it was so bright it landed in the woods I was not going back."],"Longitude":"-77.184795","Object Shape":"Circle, Egg, Star-like","Latitude":"41.211862","Summary":"I thought it was a bright ATV CROSSING ROAD sloved down to see a flying entity","Viewing Distance":"20 Feet or Less","Date of the Event":"11/02/2003 05:45 UTC","Source":"MUFON","Tags":"City","Sighting Duration":"Undisclosed","trends":[],"Disposition":"Unresolved","Country":"United States","Object Features":"Dome, Wings","Region":"Pennsylvania","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.211862,+-77.184795(52105)&iwloc=A&hl=en\"> mufon case (52105) map </A>","City":"Undisclosed"}