{"Summary":"Triangular, black low flying craft with very bright white lights","Object Features":"Unknown","Object Flight Path":"Straight-line path","Source":"MUFON","Date of the Event":"11/07/2013 08:35 UTC","Object Shape":"Triangle","divs":["Sighting Details I was out in our yard about 8:30 on the night of November 7,2013 and first noticed 2 very bright lights coming towards me from the east, like spotlights very low in the sky right over backyard. Called for my husband to come out and we both watched this fly right over our heads just above the treeline. It was quite large, triangular (ish) in shape. The lights were spread out on the front of the craft. It was quiet but did make a low noise like some kind of engine. It flew very slow towards the south and in the distance as it flew away from us it appeared to tilt toward its left side (lights were no longer pointing straight ahead and turned to a more northward direction. We live right outside of Somers Point NJ and it appeared to come right over the Garden State Parkway toward our home,so I am hoping other people saw this as well. We have seen Stealth bombers in our area as NAFAC is not far from here. I do not know if this type of craft has lights on either side (VERY BRIGHT) and can fly this low to the ground. I did manage to run inside after it flew over and tried to get a video of it as it tilted and flew North. I will try to post this once I get it zoomed in and downloaded."],"Tags":"City","Region":"New Jersey","Viewing Distance":"101-500 Feet","Longitude":"-74.605305","trends":["There have been 2 other sightings in Somers Point","There were no other sightings in Somers Point on or around November 7th 2013"],"Latitude":"39.316064","City":"Somers Point","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.316064,+-74.605305(52108)&iwloc=A&hl=en\"> mufon case (52108) map </A>","Sighting Duration":"Undisclosed","Country":"United States","Log Number":"US-11082013-0006","Disposition":"Unresolved","Case Number":"52108","Date Submitted":"11/08/2013 08:02 UTC","files":["/var/www/straped/mufon/html2text/52108.html.txt","/var/www/straped/mufon/org/52108.html"]}