{"Source":"MUFON","Disposition":"Unresolved","Case Number":"52104","Object Flight Path":"Stationary","Latitude":"36.128167","files":["/var/www/straped/mufon/html2text/52104.html.txt","/var/www/straped/mufon/org/52104.html"],"City":"Greensboro","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Date Submitted":"11/08/2013 01:04 UTC","Longitude":"-79.757483","Viewing Distance":"20 Feet or Less","Country":"United States","divs":["Sighting Details Ok Before I get started I know this will sound crazy or like I was on hallucinogens or something and nobody thinks Im telling the truth. Im just wondering if anyone had something similar. This happened several years ago to me but I remember it vividly like it was yesterday. I was in Greensboro Nc out in front of the house I lived in at the time. After watching letterman I went outside to lock the car doors and looked up and noticed a very bright star that seem as if it was getting brighter and brighter. The more i looked the brighter it got but it was not getting brighter it was getting closer, before I realized it was within arms reach and I felt like I couldn't turn away no matter how hard I tried. It was scanning through my eyes with some sort of laser it was like it was reading all my memories like files in a computer. Literally 1000s of images from a baby till the present flowing and I could see the images as it was scanning and I know they were from my mind because well I remembered so many of them. I remember feeling like it was searching for something particular. It reminded me of the old saying that your life will flash before you when you die. Once it finished my mind was blank for what seemed like just a min or two like white. I don't remember going back inside at all and my next memory was eveything was jumping up down side to side eradically and it had me freaking so I ran to the mirror my eyes were wiggling all over the place and would'nt stop I called for my wife and she witnessed the spasming of my Eyes it went on 20 mins or so and she noticed a wierd mark on my chest in the shape of the letter C its still there as of this day. For months after I would dream periodically that I was inside something that had monitors or screens and buttons from the inside it was round with walls covered some sort of wavy liquid. I still wonder if the dream was some sort of memory? So thats basically it."],"Object Features":"Other","Log Number":"US-11082013-0002","Date of the Event":"06/21/1994 12:00 UTC","Region":"North Carolina","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=36.128167,+-79.757483(52104)&iwloc=A&hl=en\"> mufon case (52104) map </A>","trends":["There have been 24 other sightings in Greensboro","There were no other sightings in Greensboro on or around June 21st 1994"],"Weather Factors":"Unknown","Summary":"Star seemed like it was brightening, actually got within one foot or so."}