{"divs":["Sighting DetailsIt was the summer, a couple weeks before I started the 7th grade. I was in my backyard with two of my friends and we were talking about the upcoming school year. As I was talking, I was looking toward the west, when all of the sudden, I spotted a red-pink 'ball' in the sky. I pointed it out to my friends, who also saw it. We watched it moving fairly slowly toward the NE. It seemed to be between 1000 and 1500 ft in the air and appeared to be about the size of a beach ball held out at arms length. The object was a sphere that glowed a red-pink. There was a darker grey, grid-like pattern on the surface, and it looked like the red-pink glow was coming from the center of each grid box. The glow would get brighter and then dim, but didn't seem to be a steady pulsing, it was more random. We followed the object out to the street. I saw one of our neighbors outside in her garden and yelled at her to look up, as we ran over to her yard. I figured that it would be important to have a grown-up witness this too. She looked up and saw the sphere, and her comment at the time was something like, \"Oh, that, that's been flying over the past two nights.\" She didn't seem to be phased by it at all. I was stunned by her lack of amazement. The object continued toward the northeast and then it sped up and began to descend. We lost sight of it as it got further away and was blocked by trees and buildings. My friends were a little upset and decided to go home. I was totally excited, I knew I had just seen a UFO. I went inside to tell my parents, who were playing cards with the neighbors, but they were not interested. The next day I rode my bike to the police station where a family friend was the dispatcher, and I told her what I had seen and what the neighbor lady had said about it being around on the two prior evenings. She (the dispatcher) did call our local airport to see if there were any hot air balloons, weather balloons or aircraft in the area when I saw the object. She said that there not. I was still excited, even though no one else was. It's obviously been many years since the sighting, but it is as clear to me now as if it happened last night. From that point on, I wanted to know all I could about such phenomena, and have tried to educate myself. It's something I think about quite often. It didn't scare me at the time. It was fascinating and exciting."],"Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-11072013-0027","Weather Factors":"Unknown","Sighting Duration":"00:05:00","Tags":"City","Object Flight Path":"Path with directional change","Region":"Iowa","Disposition":"Unresolved","Object Features":"Patterned Surface, Other","files":["/var/www/straped/mufon/html2text/52101.html.txt","/var/www/straped/mufon/org/52101.html"],"Country":"United States","City":"Charles City","trends":["There has been one other sighting in Charles City","There were no other sightings in Charles City on or around August 7th 1976"],"Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=43.08783,+-92.643858(52101)&iwloc=A&hl=en\"> mufon case (52101) map </A>","Date Submitted":"11/07/2013 11:03 UTC","Source":"MUFON","Summary":"Saw sphere moving overhead toward NE then it descended.","Latitude":"43.08783","Date of the Event":"08/07/1976 09:00 UTC","Case Number":"52101","Longitude":"-92.643858"}