{"Object Features":"None","Viewing Distance":"101-500 Feet, Unknown","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.626548,+-83.946399(52107)&iwloc=A&hl=en\"> mufon case (52107) map </A>","divs":["Sighting Detailsabout 9:23 oct 8th i picked up my grandson and his friend from their ffa meeting out in the country. turned north on s.r.380 from spirngvalley paintersville road and noticed about 14 orange lights ahead to the right, at first we thought they were radio towers then realized there are no towers there. then i thought that is alot of helicopters all togeather so we sped up to get there and see them. i started to realize it was not quite what we thought. we stoped right under the lights and rolled down our windows. looking straight up as they passed over us they were aprox 150 feet above the car. they made no sound at all. they looked like orange lights with a slight glow around them. you coukd not see any object they were mounted to just the lights. they were moving south west about 20 mile an hour and as they got about a half mile from us they would dim and dissappear. i tried to do all the math to figure this out. the wind was blowing towards us so it couldnt have been a blimp. i didnt think about it at the time but there were about 14 of these lights half were alittle higher than the other half. they moved at the same speed and held their position in the formation. since we couldnt see the object could it have been one large object with all these lights attached ? if thats true it was a very large object. we were all very interested nobody was scared. it took me 52 years to see something likt this it was very cool i just have no clue as to what we saw. and the car engine did no die."],"Longitude":"-83.946399","Summary":"orange glowing lights","City":"Xenia","Log Number":"US-11082013-0005","Region":"Ohio","Date of the Event":"10/08/2013 09:23 UTC","Latitude":"39.626548","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/52107.html.txt","/var/www/straped/mufon/org/52107.html"],"trends":["There have been 6 other sightings in Xenia","There were no other sightings in Xenia on or around October 8th 2013"],"Tags":"City","Case Number":"52107","Sighting Duration":"Undisclosed","Country":"United States","Source":"MUFON","Object Flight Path":"Straight-line path","Date Submitted":"11/08/2013 06:42 UTC","Disposition":"Unresolved"}