{"Region":"Arizona","Summary":"very large in shape. fast rapid light movement. .changed shapes.went dim to very very bright.","Object Features":"Unknown","Date Submitted":"11/08/2013 12:16 UTC","divs":["Sighting DetailsIt was a Friday night. Heading from Marana to picture rocks when the object caught my eye. It was very very big triangle shape. Across the road there was 2 other vechiles that stopped and got out of there vehicle to watch what was in the sky. At first I thought maybe it was military until I seen it change shapes and colors. It went straight up and down to sideways. It went very very dim and slowly started moving. To slow for a plane and or helicopter. Then it got very very very bright and huge in shape. Like a triangle shape..boomerang shape..I have a video of it.but I captured the red and white rapid lights and is jumping around quickly. After I stopped filming is when my brother jn law and my fiance seen it change shape.my brother in law took a picture ..straight up in the sky and captured a orange orb.i have a video .but in my video you can see the object lights and how fast and slow patters it makes.but can see the shape as good as I seen it with my eyes. The video shows rapid movement and light patterns I was standing still and you can see the object moving crazy like. Sorry for the cuss words I was in shock..but what I describe happend after I filmed. But the rest of what I described is on the video."],"Tags":"City","City":"Picture Rocks","files":["/var/www/straped/mufon/html2text/52114.html.txt","/var/www/straped/mufon/org/52114.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.345907,+-111.246215(52114)&iwloc=A&hl=en\"> mufon case (52114) map </A>","Viewing Distance":"Unknown","Weather Factors":"Unknown","Latitude":"32.345907","Disposition":"Unresolved","Case Number":"52114","Date of the Event":"11/01/2013 08:00 UTC","Country":"United States","trends":["There have been no other sightings in Picture Rocks","This sighting has never been favorited."],"Source":"MUFON","Object Shape":"Triangle, Other","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Longitude":"-111.246215","Log Number":"US-11082013-0013","Sighting Duration":"01:10:02"}