{"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.016787,+-86.024458(52123)&iwloc=A&hl=en\"> mufon case (52123) map </A>","City":"Gadsden","Object Flight Path":"Stationary","Longitude":"-86.024458","Country":"United States","Log Number":"US-11092013-0003","Region":"Alabama","Summary":"stationary starlike object towards the south.seen only with Binacolars, around 1 p.m. (cst)","Date Submitted":"11/09/2013 12:36 UTC","Date of the Event":"11/08/2013 12:00 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Object Features":"Unknown","trends":["There have been 4 other sightings in Gadsden","There were no other sightings in Gadsden on or around November 8th 2013"],"divs":["Sighting DetailsWas out in my back yard with my Binacolars bird watching. Around 1 p.m.(cst) Nov. 8th 2013. Looking to the south. I seen this Hawk flying in circles. while I was watching it with my naked Eyes, It vanish, and there is no clouds in the sky. I started looking thru the Binacolars at the place where it vanished, and that's when I seen this star like object. It was stationary. I also notice it was lined up, almost half way between the moon,( that was up during the day time), and the sun. It had no kind of lights, It had a shine, but I think it was from the sun reflecting on it. It looked round in shape (like a ball) , and very far away. It had no sound. Tried to take video of it, but for some reason my camcorder kept going out of focus, and battery showed full, but after a couple of tries it die. watch object for a couple of hours. It never moved. got tired an went in the house. came back out at 4:30 p.m. It was gone. tried again at around 5:30 p.m. After it was dark. still did not see it. I would have never seen the ufo, if that hawk hadn't vanish right before my eyes."],"Source":"MUFON","Case Number":"52123","Latitude":"34.016787","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/52123.html.txt","/var/www/straped/mufon/org/52123.html"],"Tags":"City","Object Shape":"Star-like"}