{"Sighting Duration":"00:30:00","Country":"United States","Object Flight Path":"Stationary","Case Number":"52130","map":"<A HREF = \"http://maps.google.com/maps?q=44.736264,+-92.849959(52130)&iwloc=A&hl=en\"> mufon case (52130) map </A>","Latitude":"44.736264","files":["/var/www/straped/mufon/html2text/52130.html.txt","/var/www/straped/mufon/org/52130.html"],"City":"Hastings","Log Number":"US-11092013-0009","Tags":"City","trends":["There have been 4 other sightings in Hastings","There were no other sightings in Hastings on or around August 19th 2013"],"Source":"MUFON","divs":["Sighting DetailsIt was a windy August day around dinner time. My wife and I were standing in our driveway talking to our neighbor. The wind picked up causing me to look directly overhead. There were two cloud fronts moving toward each other from different directions. One cloud bank was lower than the other and moved rapidly towards the South, while the other cloud bank moved from the South towards the North. As I watched the two cloud banks head towards each other, I spotted a bright shiney object directly overhead. At first I thought the object was a Mylar ballon. It appeared as a constant bright metallic refection in the sun. I kept watching the object waiting for it to move around in the high winds. It was then I noticed that only the cloud banks were moving and the object appeared to be stationary. I remember thinking, \" How could a Mylar balloon stay put like that with the high winds ? \" I pointed the ojbect out to my wife and neighbor. Although my wife couldn't see it, my neighbor immediatly spotted the ojbect. A bunch of clouds from the South bound cloud bank began to cover the object. I figured once the clouds moved on, the ojbect would be gone. About four minutes after the clouds moved in, there was a hole in the cloud bank. I looked up and the shiney object was in the exact same place it was before. The object looked to be approximately 2-3 thousand feet in altitude. I know this because jetliners from Minneapolis Internation Airport where holding an outbound flight pattern, which was directly over my house. The object appeared to be about two to three hundred feet above outbound air traffic that day. My next thought was that it might be a bright star. However, the sun was out and it was a bright fall afternoon. Looking around, I could see no other star like ojbects in the sky. Next I remembered that there was supposed to be an asteroid passing close to the earth that same day. The cloud bank recovered the object, so I went inside. Once in my house, I got on the internet to do some research on the asteroid. As it turns out, the asteroid in question was only visible with a telescope. Approximately an hour later I went back outside to look at the object. There was a clearing in the cloud formation, so I looked up in the exact same spot the object had been. It was gone..."],"Object Shape":"Sphere","Region":"Minnesota","Object Features":"Unknown","Disposition":"Unresolved","Summary":"Stationary Mylar ballon shaped object approximately 300 feet above outbound commercial airline traffic.","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"11/09/2013 08:18 UTC","Longitude":"-92.849959","Date of the Event":"08/19/2013 12:00 UTC"}