{"Date of the Event":"05/15/2008 03:30 UTC","City":"Portland","Longitude":"-122.671587","Object Flight Path":"Path with directional change","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=45.524552,+-122.671587(52139)&iwloc=A&hl=en\"> mufon case (52139) map </A>","Object Shape":"Unknown","Log Number":"US-11092013-0019","Date Submitted":"11/09/2013 09:00 UTC","Summary":"High altitude light moving in unusual manner","Sighting Duration":"00:00:45","Weather Factors":"Unknown","Latitude":"45.524552","Tags":"City","files":["/var/www/straped/mufon/html2text/52139.html.txt","/var/www/straped/mufon/org/52139.html"],"Viewing Distance":"Unknown","divs":["Sighting DetailsI was working as a night watchman at a recycling facility in Portland, Oregon when this sighting occurred. The date and time given above are approximate. About halfway through my shift, I was performing a patrol which carried me through a rather dark area of the property. After making sure no dangers were present on the ground around me, I usually took a moment to look up at the stars, due to the reduced glare of city lights in the location I was at. I noticed movement in the sky and turned my vision toward it. What I witnessed looked like it might have been a satellite reflecting sunlight. However, the object behaved in an unusual manner. It's general direction of travel was from north to south, however, it oscillated in this path with wide arcing motions, the same way a leaf will sway back and forth when it falls. However, this movement appeared to carry it in a horizontal direction, not a vertical one. The sighting lasted about 30-45 seconds. At this time I decided that it was time to pay attention to my immediate surroundings again. I had judged the object as a curiosity and not an immediate concern. I finished my patrol without further incident and never saw the object again. I regarded the object as a curiosity and felt no fear or apprehension toward it. It was there and I noticed it, simple as that."],"Source":"MUFON","Case Number":"52139","Country":"United States","Object Features":"None","trends":["There have been 158 other sightings in Portland","There was one other sighting in Portland on or around May 15th 2008"],"Region":"Oregon"}