{"Tags":"City","files":["/var/www/straped/mufon/html2text/52137.html.txt","/var/www/straped/mufon/org/52137.html"],"Object Flight Path":"Stationary","Longitude":"-74.282149","map":"<A HREF = \"http://maps.google.com/maps?q=40.305483,+-74.282149(52137)&iwloc=A&hl=en\"> mufon case (52137) map </A>","divs":["Sighting DetailsI was driving my car down Robertsville road, Marlboro, New Jersey, with my girlfriend around 7pm. All of sudden we look up and see something hovering very close to the ground, maybe 20 ft, with red and green non-flashing lights. At first i believed it to be a child's remote control plane or ufo, but it was dark, late, and cold, and definitely not the case. As we approached it, i looked up at it and it just stayed in the same spot hovering up and down with the lights remaining on. I was going to get out and have a look, but my girlfriend got really scared and started yelling for me to keep driving. Wish i could of gotten a picture of it, but unfortunately i was driving. I instantly got immense goosebumps all across my body. It felt unnatural, we couldn't believe it. As we passed the object, i looked back in my mirror and it was gone. My girlfriend started to have a panic attack when we got home. She started hyperventilating, feeling nauseous, and light headed. It was just unbelievable. It was the most amazing thing i have ever seen, it was so close, i felt like if i got a ladder i could of grabbed it."],"Weather Factors":"Unknown","Case Number":"52137","Log Number":"US-11092013-0017","Date of the Event":"11/09/2013 07:05 UTC","Region":"New Jersey","Source":"MUFON","Latitude":"40.305483","Date Submitted":"11/09/2013 07:58 UTC","Object Features":"Unknown","City":"Marlboro Township","Country":"United States","Object Shape":"Circle","Disposition":"Unresolved","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Marlboro Township","This sighting has been favorited 1 time."],"Viewing Distance":"20 Feet or Less","Summary":"Circular object hovering very low to ground with stable lights"}