{"Country":"United States","Sighting Duration":"Undisclosed","Object Features":"None","Viewing Distance":"501 Feet - 1 Mile, Unknown","Summary":"Orange balls of light travelling n-se over east Mesa, Az Nov 8, 2013","Date of the Event":"11/08/2013 09:25 UTC","Date Submitted":"11/09/2013 07:04 UTC","Source":"MUFON","divs":["Sighting DetailsOn November 8th, 2013 I got home from work, pulled into the garage, went inside an immediately let the dog out in the backyard. This was at about 925p. I saw to the north of me a large number of glowing orange balls in the sky with random spacing. They were moving in a way that looked like ascending as the came slowly towards my neighborhood. I made the dog go back inside and stood there watching for a couple of minutes wondering what they were and then remembered my cell phone was in my pocket. The lights were not there less than 2 minutes before when I pulled into my driveway. I took several pictures of the lights and a couple of short videos as they moved across the sky. There was the initial random grouping 6-7 lights, then a second random grouping of about another 6-7 of them and a few minutes later several more in doubles and triples and a few single lights. They seemed to float across the sky. There was some individual movement within the groupings but they all followed the north to southeast path across the sky. There was no noise. I didn't see or hear any other aircraft, helicopters or anything else in the sky during the entire 10 minute event. My first thought was that they were flares, but they did not drop towards the earth at all but continued on in what I believe was a fairly high altitude. Occasionally it looked like one of the lights would sort of accelerate or move away from another light. This again was quite random. Some of the lights appeared to blink out and then come back on. Some blinked out completely Some stayed steadily glowing for the entire 10 minutes. The orange balls glowed but did not seem to cast any light around themselves. I thought I occasionally saw an additional tiny red light inside the orange balls blink, but they were at a distance and I'm not sure of that. In my cell phone pictures the lights appear white but they were glowing orange. The only photo that captures the right color was one where I tried to zoom in, but with a cell phone camera it is all fuzzy and didn't do me any good except it shows the right color. They disappeared after they had passed towards the southeast. I think they just all went out unless my neighbors house blocked me from seeing them if they had come down further out of the air. I went inside and tried to decide who to call to see what they were. I decided on the ABC 15 news desk. I spoke to a woman and asked if she had heard of any strange lights over Mesa. She hadn't and didn't know if there was some kind of military exercise over the area either. I watched the news to see if anything else came out but I haven't heard anything at all. Called the news again on November 9th to see if anyone else had reported these. Nothing. These were so bright and so numerous that I can't believe I am the only one who saw these. There is probably a reasonable explanation, but it seemed very strange to me. I was not afraid during the event because I judged them to be pretty high in the sky. Afterwards my feelings are just a nagging curiosity to know what I saw and why nobody else seems to have seen or reported this."],"Object Flight Path":"Straight-line path,Other","Latitude":"33.375845","City":"Mesa","Tags":"City","Log Number":"US-11092013-0016","files":["/var/www/straped/mufon/html2text/52136.html.txt","/var/www/straped/mufon/org/52136.html"],"Disposition":"Unresolved","Longitude":"-111.646222","map":"<A HREF = \"http://maps.google.com/maps?q=33.375845,+-111.646222(52136)&iwloc=A&hl=en\"> mufon case (52136) map </A>","Case Number":"52136","trends":["There have been 73 other sightings in Mesa","There were no other sightings in Mesa on or around November 8th 2013"],"Object Shape":"Fireball, Sphere","Region":"Arizona","Weather Factors":"Unknown"}