{"Case Number":"52131","Disposition":"Unresolved","divs":["Sighting DetailsI always walk my dog between 4am and 5am every day I am very aware of the celestial sky being a hunter and trapper for over fifty years.The three circles appeared at the bottom of the big dipper one inside the other and were pulsating. No other aircraft were anywhere to be seen in any part of the sky. Now here is the interesting thing two weeks later at the same time when i went outside the house there was a smell of mir all around our home. Ifyou went about fifteen feet away from the home you couldnt smell anything. There were a few other things that were going on but this next one is the most important. Again about tow weeks after the other incident my wife woke me up about 2am.shaking me and saying look lookand at the foot of our bed were three images like sparklers of different sizes and wre pulsating. I wasnt sure what to do and my wife was shaking so i yelled hey and they dissappeard. After thinking about it all this time i should have said who are you and what doo you want. We havve since sold the house and moved to lancaster not because of the happenings at my age 76 we needed to move to town. I reported thie incident when it first happened but only about the circles the other events happened later. Thanx Larry Conrad"],"Viewing Distance":"Unknown","City":"hidde-a-way hills","Region":"Ohio","Date of the Event":"03/26/2011 04:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.420987,+-82.901723(52131)&iwloc=A&hl=en\"> mufon case (52131) map </A>","Summary":"bottom edge of the big dipper three circles made up of silver dics pulsatingi","Longitude":"-82.901723","Object Features":"None","trends":["There have been no other sightings in hidde-a-way hills","This sighting has never been favorited."],"Source":"MUFON","Log Number":"US-11092013-0010","Country":"United States","Date Submitted":"11/09/2013 08:39 UTC","Tags":"City","Latitude":"40.420987","files":["/var/www/straped/mufon/html2text/52131.html.txt","/var/www/straped/mufon/org/52131.html"],"Object Flight Path":"Stationary","Weather Factors":"Unknown","Object Shape":"Circle","Sighting Duration":"Undisclosed"}