{"Weather Factors":"Does Not Apply","Viewing Distance":"Over One Mile","Case Number":"5213","map":"<A HREF = \"http://maps.google.com/maps?q=34.757523,+-112.453781(5213)&iwloc=A&hl=en\"> mufon case (5213) map </A>","Date of the Event":"08/07/2006 07:50 UTC","Source":"MUFON","Object Shape":"Star-like","Log Number":"US-08072006-0010","files":["/var/www/straped/mufon/html2text/5213.html.txt","/var/www/straped/mufon/org/5213.html"],"Disposition":"Unknown","Summary":"Light hovering in Northwestern sky. Changed directions several times at different rates of speed","City":"Chino Valley","Date Submitted":"08/07/2006 07:50 UTC","trends":["There have been 5 other sightings in Chino Valley","There were no other sightings in Chino Valley on or around August 7th 2006"],"divs":["Sighting DetailsWe are house sitting for my father in Chino Valley, AZ. At 7:48pm I went out and fed his dogs. At 7:50pm I noticed a light in the northwestern sky. I thought it was a star initially but it seemed to early. It was bright and then would get brighter on and off. It was just hovering. I called for my wife to come out to show it to her. As she was coming out of the house it started moving east into a cloud. We could still see it so it must of been in front of the cloud. After about 20 seconds it started heading upwards at a faster rate(pretty fast). It then moved west towards a large cloud. At this point it seemed to speed up some and it looked as if it was blinking but not like a plane. My wife thought it might appear to be blinking due to passsing through the cloud. It got really bright and just as it was about to leave the cloud it turned back towards the east and was gone. All in all in lasted about four minutes. I tried to take a picture but it was too dark and far away. My wife and I both noticed the neighbors horses were acting agitated and the dogs in the neighborhood were barking. Our dogs seemed hyper(but that's not unusual). My dad's lab ran towards the northwest section of his yard and kept looking at us."],"Sighting Duration":"Undisclosed","Region":"Arizona","Object Features":"Unknown","Latitude":"34.757523","Country":"United States","Tags":"City","Object Flight Path":"Hovering then path","Longitude":"-112.453781"}