{"trends":["There have been 9 other sightings in Franklin","There were no other sightings in Franklin on or around November 9th 2013"],"Log Number":"US-11092013-0026","Tags":"City","divs":["sighting detailsi was traveling home from a local take out restaurant in malaga new jersey. i first noticed the triangle black object straight ahead of me at a 45 degree angle, out of my front windshield. i made a turn on swedesboro rd heading towards my home aprox 1\\4 mile away. i pulled off the road into the grass and got out of my car to see it. i see planes all the time , night and day, because my home is located on the airlines flight path to phila international airport. this night time object was so different from commercial planes that i had to get out of the car. the triangle slowly traveled overhead and i could hear a slight hum or whining noise. there were two green light on one corner of the triangle and two red light on the other corner or back of the object. there were also two lights, one in the front and one in the back. i have included a rendering of the object. i first noticed the object in the south west sky and after it traveled over my car it headed to the north east direction then made a turn to the north. i am the chief investigator for mufon in new jersey and i found out there is another similar sighting at 7 pm also in new jersey. i am wondering if these ufo's, or some people call them alien craft, try to copy the light patterns of our own commercial jets so they can hide in plain sight ? it would make perfect sense to me. temperature was aprox 50 degrees with no winds and partly cloudy."],"Object Features":"Other","Source":"MUFON","Date Submitted":"11/09/2013 11:40 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/52146.html.txt","/var/www/straped/mufon/org/52146.html"],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","City":"Franklin","Disposition":"Unresolved","Longitude":"-75.069101","Date of the Event":"11/09/2013 06:35 UTC","Object Flight Path":"Path with directional change","Summary":"BLACK TRIANGLE SPOTTER OVER FRANKLINVILLE NJ BY A MUFON CHIEF INVESTIGATOR.","Region":"New Jersey","map":"<A HREF = \"http://maps.google.com/maps?q=39.626641,+-75.069101(52146)&iwloc=A&hl=en\"> mufon case (52146) map </A>","Object Shape":"Triangle","Case Number":"52146","Viewing Distance":"501 Feet - 1 Mile","Latitude":"39.626641"}