{"divs":["Sighting DetailsI live at at a marina downtown. As I got off my boat and started walking down the dock,.I noticed a glowing orange planet like light at about 55 degrees in the night sky. At first I thought is was one of the brighter planets, but it was about twice the size of the brightest planet that is observable. I stopped and watched as it slowly moved towards my right. It appeared to have no definite course, and as it seemed to slowly head away from where it was the brightest, the light dimmed and went out as if it was extinguished. I observed the object for about 15 seconds, the object dimmed to nothing during the last three seconds. I do not believe that it was any type of commercial or military aircraft, as it did not display the characteristic lighting, course, and became extinguished. I have never seen anything like it. There were individuals walking the dock within ear shot of my voice, and even though it was late in the evening, I did yell at a moderate volume,\"UFO\" as I pointed. I did not get any acknowledgement of they having heard me. I did call the Charleston city police station on Lockwood drive and asked if anyone else had called about seeing any objects. I gave my first name as requested, and was told that no reports had been taken nor had they heard any info relating to the object."],"Object Shape":"Star-like","Object Features":"None","Date of the Event":"11/10/2013 11:48 UTC","Summary":"A glowing orangish light. It moved across the sky, then decrease in illimination","Weather Factors":"Unknown","trends":["There have been 20 other sightings in Charleston","There were no other sightings in Charleston on or around November 10th 2013"],"Source":"MUFON","Log Number":"US-11102013-0001","Date Submitted":"11/10/2013 12:48 UTC","Case Number":"52147","Tags":"City","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=32.759901,+-79.955218(52147)&iwloc=A&hl=en\"> mufon case (52147) map </A>","City":"Charleston","Country":"United States","Region":"South Carolina","Object Flight Path":"Path with directional change","Sighting Duration":"00:00:15","Longitude":"-79.955218","files":["/var/www/straped/mufon/html2text/52147.html.txt","/var/www/straped/mufon/org/52147.html"],"Latitude":"32.759901","Viewing Distance":"Over One Mile"}