{"Case Number":"52149","map":"<A HREF = \"http://maps.google.com/maps?q=39.089218,+-76.695936(52149)&iwloc=A&hl=en\"> mufon case (52149) map </A>","divs":["sighting detailsmy father and i were standing outside looking up at the sky. he does this frequently and i do less frequently. i had gotten my new glasses and love looking at the stars. we talk about differing constellations for a moment when the \"moving star\" catches our attention. we watch it, and it disappears. we don't take our eyes off of the sky. it slowly reappears, moving the same direction. it fades again, only to reappear. once more, it fades, but seemingly for good this time. we both thought it was a star until it started moving. around a half hour later, my father noted that it could be a space rock skimming\\skipping along the atmosphere. he noted that it left a slight trail, although i didn't quite notice. seeing it made me somewhat happy, but perhaps this is due to my personal belief of reincarnation and my particular assumed past life. before that dawned on me, though, it was a bit of awe and curiosity. we lost sight of the object when it continued to move in its path but faded for the last visible time. at first, i assumed it was part of a triangular constellation but then it moved. pretty bizarre."],"Date of the Event":"11/08/2013 05:55 UTC","trends":["There has been one other sighting in Odenton","There were no other sightings in Odenton on or around November 8th 2013"],"Tags":"City","Country":"United States","Region":"Maryland","Date Submitted":"11/10/2013 02:46 UTC","Object Flight Path":"Straight-line path","Latitude":"39.089218","Sighting Duration":"Undisclosed","Object Shape":"Star-like","Object Features":"Unknown","Weather Factors":"Unknown","Longitude":"-76.695936","Summary":"\"Star\" moving in straight path, fading and brightening thrice, disappears","Disposition":"Unresolved","Log Number":"US-11102013-0003","files":["/var/www/straped/mufon/html2text/52149.html.txt","/var/www/straped/mufon/org/52149.html"],"City":"Odenton","Viewing Distance":"Over 1 Mile, Unknown","Source":"MUFON"}