{"map":"<A HREF = \"http://maps.google.com/maps?q=27.503052,+-81.438367(5215)&iwloc=A&hl=en\"> mufon case (5215) map </A>","Log Number":"US-08082006-0002","files":["/var/www/straped/mufon/html2text/5215.html.txt","/var/www/straped/mufon/org/5215.html"],"Longitude":"-81.438367","Region":"Florida","Date Submitted":"07/27/2006 09:30 UTC","Source":"MUFON","Object Flight Path":"Stationary,Other","Disposition":"Unresolved","divs":["Sighting DetailsAbout 9:30 in the evening, I saw two strange lights over Lake Jackson. I was coming out of a building on US27, carrying some things to my truck. When I first saw them I thought they were streetlights, similar to the ones that line the highway. They were not moving. I thought to myself how those streetlights must be in the distance, and on some tall poles, seriously. I looked intently at these lights, and realized they were not streetlights, because they appeared to be high above the lake, and several hundred yards in distance from me. After staring in wonder for a minute or so at these totally stationary lights, which were in close proximity to one other, one began to dim until it faded out. The second light then did the same thing. A few seconds later, the light re-appeared in a new location, a little further from me, and the second light then re-appeared close to the first. I thought to run in and get my camera at that time. I started to record these events, amazed as I watch this happen repeatedly for 30-40 minutes. Sometimes they would reappear in new locations unbelievably quickly, and other times several minutes would pass between appearances. All the while, when these lights were visible, they did not move (there are reference points in the video that credit this). I never saw more than two at any given time, but when a reappearance at a new location would follow a fade-out almost instantaneously, as it did a few times, it seemed impossible that there couldn't have been more. The episode came to an end as I began to hear the thundering sounds of jets coming into the area. There is an Air Force bombing range just to the north of Sebring, but because this happened in the heart of the city and the lights were not very high in the sky, I find it hard to believe that this would have been a military exercise. When I got home (I live right across this lake), I searched the skies for another hour or two, but saw no more lights. The sounds of roaring jets was all I heard, which continued for a long time that night, even with the absence of these bizarre lights."],"Summary":"Two seperate STATIONARY lights that would fade out, seperately, reappear in new places, always one before the other, the other would follow the first, happened maybe ten times","Latitude":"27.503052","City":"Sebring","Object Shape":"Circle, Star-like","Country":"United States","Weather Factors":"Unknown","Object Features":"Unknown","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","trends":["There have been 6 other sightings in Sebring","There were no other sightings in Sebring on or around July 27th 2006","This sighting has never been favorited.",""],"Tags":"City","Date of the Event":"07/27/2006 09:30 UTC","Case Number":"5215","Sighting Duration":"Undisclosed"}