{"Source":"MUFON","Longitude":"-82.342336","map":"<A HREF = \"http://maps.google.com/maps?q=28.185231,+-82.342336(52155)&iwloc=A&hl=en\"> mufon case (52155) map </A>","Log Number":"US-11102013-0007","Object Shape":"Sphere","City":"Wesley Chapel","Country":"United States","Date Submitted":"11/10/2013 08:52 UTC","files":["/var/www/straped/mufon/html2text/52155.html.txt","/var/www/straped/mufon/org/52155.html"],"divs":["Sighting DetailsI was sitting out back in our yard with my daughter. I noticed a bright red, non- pulsating, circular light coming over the tree line. I watched closely since it was so bright and there was no flashing as an airplane would do as we view aircraft regularly living where we do. As I told her to turn around and look, several other (approx. 3-4) objects started coming into view over the tree line that looked exactly the same. They were getting closer and you could see even more coming over the tree line. We went out front to see them as they flew overhead and there were neighbors out witnessing the same thing. As they flew overhead, there was zero sound emitted from any of them, and as they got directly over us, they seemed to just disappear. In total, there was probably 15-20 objects, all witnessed by several neighbors. We got some video from an IPhone which is not very good quality, but very interesting. The objects flew in a straight path, but changed positions abruptly, in almost a very wide triangular formation. The first and the last object that came over was much brighter than the others in between. We live fairly close (approx 25 miles) to a major airport and a military base and observe a lot of aircraft from both, but these were something we've never seen before."],"trends":["There have been 7 other sightings in Wesley Chapel","There were no other sightings in Wesley Chapel on or around November 9th 2013"],"Disposition":"Unresolved","Object Flight Path":"Path with directional change","Object Features":"None","Date of the Event":"11/09/2013 08:11 UTC","Region":"Florida","Summary":"Several round red craft coming in waves, zero sound even when directly overhead, witnessed by several neighbors","Weather Factors":"Unknown","Case Number":"52155","Latitude":"28.185231","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed"}