{"Weather Factors":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.890388,+-74.109238(52164)&iwloc=A&hl=en\"> mufon case (52164) map </A>","Sighting Duration":"Undisclosed","Date of the Event":"11/10/2013 04:45 UTC","Viewing Distance":"Over One Mile","Disposition":"Unresolved","Object Flight Path":"Hovering then path,Path then hovering","Summary":"first 2 orange moving lights then 3 then 1 then none.","divs":["Sighting DetailsWas stationed working outside at one of the job locations. My back was turned towards the 2 orbs at first but a co-worker noticed these two \"star like\" objects were moving. I looked up and saw that these objects almost appeared star like, having a white glow but had what looked like orange-ish red flashing lights. What made it not star like was how these lights stopped and moved in the sky. At first there were only 2 moving lights but a 3rd appeared out of no where. Eventually there was only one which eventually disappeared a few minutes later. Total sighting lasted what appeared 15-20 minutes. Orbs appeared to have energy field around them. Like a circle that surrounded the actual lights. Really weird. I've always believed that humans aren't the only intelligent life in this universe. After today I can say that I am 100% sure that what I saw was not a plane or anything from this world. Helicopters arent known to be hovering at heights where planes are leaving chem trails. It wasnt a plane because if a plane stopped moving in the air it would most likely would free-fall towards earth. I've always wanted to see UFO's and today this finally happened. I have a video I took. I need to upload it and edit the beginning to mute the exact location stated in the video. I don't want any problems with my job. Ill try to upload tomorrow or at a later time. Eyes up, ears open. Be safe everyone"],"City":"Garfield","files":["/var/www/straped/mufon/html2text/52164.html.txt","/var/www/straped/mufon/org/52164.html"],"Longitude":"-74.109238","Object Shape":"Sphere","Latitude":"40.890388","trends":["There has been one other sighting in Garfield","There were no other sightings in Garfield on or around November 10th 2013"],"Country":"United States","Region":"New Jersey","Log Number":"US-11102013-0015","Case Number":"52164","Tags":"City","Object Features":"None","Date Submitted":"11/10/2013 11:11 UTC"}