{"Object Features":"Other","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Object Shape":"Star-like, Triangle","Weather Factors":"Unknown","Summary":"Appeared like a star, then it would move up and down,it moved closer and then move away. No noise,noted and stayed in area for about an hour before disappearing to the Southwest..","Date Submitted":"11/10/2013 08:58 UTC","files":["/var/www/straped/mufon/html2text/52161.html.txt","/var/www/straped/mufon/org/52161.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.794611,+-84.385792(52161)&iwloc=A&hl=en\"> mufon case (52161) map </A>","Latitude":"36.794611","Region":"Kentucky","trends":["There has been one other sighting in Whitley City","There were no other sightings in Whitley City on or around November 10th 2013"],"Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","City":"Whitley City","divs":["Sighting DetailsMy husband noticed it in the sky while he was in the bathroom. He said November 9th to me \"That is a funny looking star\". He went out to the back deck and I joined him. I said that \"That's an airplane\". Will I kept looking and it would move up and down, and to the North and then to the South. I went and got the camera. My husband took pictures of the object . I noticed it had blinking red lights at times and at times there would be green lights that would appear. At times it would have a large bright white light. It would finely go down to tree level and then disappeared. My husband said it was over the Big South fork National River, and was not any thing he has seen before. The next night my husband went out to build a fire on the flat land across the street. I looked out the kitchen window and saw it again. I yelled to my husband it was back again. I joined him at the fire with the camera. We stood there and watched the same kind of object again, move up,and down, and from side to side. Mike took video this time. We zoomed in with the camera and noticed it had three lights. And one time I saw a plane (with blinking lights) approach it and looked like it was on top of it. My husband took more video , and gave me the camera. He went in the house and I took one more short video before it disappeared. Then I came in and decided to report our sighting."],"Sighting Duration":"01:30:20","Case Number":"52161","Source":"MUFON","Log Number":"US-11102013-0012","Tags":"City","Longitude":"-84.385792","Country":"United States","Date of the Event":"11/10/2013 06:45 UTC"}