{"Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Disposition":"Unresolved","Log Number":"US-11102013-0016","files":["/var/www/straped/mufon/html2text/52165.html.txt","/var/www/straped/mufon/org/52165.html"],"Source":"MUFON","Object Shape":"Sphere","Summary":"large bright star-like object hovering in the sky for over an hour","Object Features":"Unknown","Region":"North Carolina","Longitude":"-78.972806","divs":["Sighting DetailsOn November 8th my husband made an offhand comment that he thought he had seen a ufo the previous night. Coming from him, I was shocked because he had never said anything like that. He explained that the previous night he had been outside talking on the phone since the reception was better out there. The sky was very clear and he saw a bright object that at first he thought was a star or a planet but as he watched it over the next hour he realized it would move very slightly but continued to shine. I couldn't believe he hadn't come to show me! Since we live right next to Ft. Bragg I reasoned it was some military aircraft but he is a former Marine and said it didn't look like that and had no sound. I was joking and said maybe it will be back tonight. We looked outside after sun set, about 7:15 pm -- and it was there. We got my daughter's play binoculars and I watched it. This was Nov. 8th. It was a very bright white round light. As I watched it, it remained in almost the exact same spot without decreasing in size. It looked like a bright star but it seemed to turn slowly and a red light could be seen briefly. It was just above the treeline whereas the night before it had been high in the sky. I couldn't figure out how it could stay in the same place for that long moving only slowly up or down but not basically moving. It disappeared after about an hour. It was back tonight, the 10th, but back up high in the sky. I wish someone could tell me what it is because I've never seen anything like it. I have lived next to Bragg for years and I'm used to planes flying in and out, but this is something different. I have never given much thought to ufos but once I saw this I felt perplexed."],"map":"<A HREF = \"http://maps.google.com/maps?q=35.16794,+-78.972806(52165)&iwloc=A&hl=en\"> mufon case (52165) map </A>","Weather Factors":"Unknown","Latitude":"35.16794","Object Flight Path":"Stationary","trends":["There have been no other sightings in Spring Lake","This sighting has never been favorited."],"Case Number":"52165","City":"Spring Lake","Tags":"City","Date Submitted":"11/10/2013 11:37 UTC","Date of the Event":"11/08/2013 07:30 UTC","Country":"United States"}