{"Date of the Event":"11/09/2013 10:45 UTC","trends":["There have been 2 other sightings in Epsom","There were no other sightings in Epsom on or around November 9th 2013"],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/52173.html.txt","/var/www/straped/mufon/org/52173.html"],"Case Number":"52173","map":"<A HREF = \"http://maps.google.com/maps?q=43.213028,+-71.378173(52173)&iwloc=A&hl=en\"> mufon case (52173) map </A>","Object Flight Path":"Straight-line path","divs":["sighting detailsi am a paranormal investigator, my teammate frank and i were on our way back from a client reveal. we were on route 28 south, in epsom, nh. we were just talking about how things went that evening when i noticed 2 lights in the sky, as we drove, i noticed a third light. they were in a line. they seemed to be white\\silver\\red tint. it reminded me of the tops of a radio towers (for aircraft) i thought they may be sone kind of copter, but there were no flashing aircraft lights. the 3 lights seemed to be evenly spaced and traveling northwest. we did not stop and take photos. i noticed the lights in the distance over the trees, as we drove they got closer. i am not sure of the altitiude of these lights. they passed over us, or were traveling quickly over us. i had my car window open but did not hear any sound. i kept looking in the mirrors to see them again, but after about a half a mile, they were gone. the lights seemed round in shape, no shape changing, no lights getting closer to eachother, they stayed evenly spaced. i am not sure what these lights were, could they have been some kind of lights attached to a balloon, flares, something along that line. i was very interested as to what these lights were, just as in a paranormal investigation. my teammate and i did talk about these lights for the remainder of our ride. we can not explain what we saw. thank you eric metzler"],"Longitude":"-71.378173","Object Shape":"Sphere","Region":"New Hampshire","Latitude":"43.213028","Summary":"3 lights, evenly spaced, white silver","City":"Epsom","Sighting Duration":"Undisclosed","Object Features":"None","Tags":"City","Country":"United States","Date Submitted":"11/11/2013 06:50 UTC","Disposition":"Unresolved","Source":"MUFON","Log Number":"US-11112013-0006","Viewing Distance":"Unknown"}