{"Weather Factors":"Unknown","City":"Elsdorf","map":"<A HREF = \"http://maps.google.com/maps?q=50.939249,+6.563501(52171)&iwloc=A&hl=en\"> mufon case (52171) map </A>","Summary":"UFO Hovering over House (soundless), green light beam enlightening yard, take off without light but loud noise","trends":["There has been one other sighting in Elsdorf","There were no other sightings in Elsdorf on or around July 15th 2007"],"Source":"MUFON","Case Number":"52171","Longitude":"6.563501","Object Shape":"Unknown","Latitude":"50.939249","Object Flight Path":"Hovering then path","Region":"North Rhine-Westphalia","Country":"Germany","files":["/var/www/straped/mufon/html2text/52171.html.txt","/var/www/straped/mufon/org/52171.html"],"Object Features":"Unknown","Tags":"City","Date Submitted":"11/11/2013 05:50 UTC","Sighting Duration":"00:30:00","divs":["Sighting DetailsAround 2 am I laid in bed but couldn't realy sleep as it was too warm. The bedroom was located in the basement, having big windows facing the yard. I opened my eyes amd saw a bright greenish light, maybe a beam, enlightening the yard. The light was brighter than the usual spot located in the yard and it had a different light color (the actual halogen spot is not green). Somehow it didn't seem to bother me and I felt to be at odds with myself whether I should get up and have a look out off the window or to get out off the house. In someway I also felt like I wasn't really able to move amd I closed my eyes again. After about 1 minute I got scared to death when the light disappeared but a noise I've never heard before come from over the house. It was a growling, roaring and rumbling noise that went through my bones and went from a deep sound to a higher and higher sound as the thing liftet off. I still wasn't able to move and shocked deeply. After some 10 minutes later I heard the same noise again. This time it sounded like it was a couple of streets away. The same roaring with the same lift off sound. After that weekend, I told a colleague about it and he told me that he read something in a forum from a guy who wrote that he had seen something glowing and hovering over the village where I was that night, but I couldn't and can't find his entry. If anybody could tell me what it was that I saw and heared, if anybody could approve this happening it would really ease my life as I've been dealing with this for 7 years now."],"Log Number":"DE-11112013-0004","Date of the Event":"07/15/2007 02:00 UTC","Disposition":"Unresolved","Viewing Distance":"21-100 Feet"}