{"Latitude":"39.819504","Tags":"City","Longitude":"-77.02094","Summary":"Odd light moving in opposite directions!","Disposition":"Unresolved","Viewing Distance":"Over One Mile","Region":"Pennsylvania","trends":["There have been 4 other sightings in Hanover","There were no other sightings in Hanover on or around November 11th 2013"],"divs":["sighting detailsmy girlfriend and i hop in her truck to leave my house and go get some taco bell! we pull to the end of my driveway which is crossed by rt 116. which is pretty busy for a road around here. i look to the sky directly in front of me above the field across the street, and i saw a star in the sky, but for some reason i continued to stare for a moment. when all of a sudden its light intensified by at least 10x! then it slowly faded out into a barely visible, faint orangish\\red glow, it slowly began moving left, i began to wonder if maybe this was just an airplane and my eyes playing tricks on me. but as it moved left it stopped, and begin to go right, right back the way it came!i was shocked...this isnt a plane i thought to myself. i get out of the vehichle,standing at the end of my driveway as all these cars pass by, just staring at the sky! it moved back and forth left to right a good 2-3 times, the whole time moving across the sky in a parabola formation as a whole but along its path it would do almost circular loops to my perspective. none of this seemed fast i should mention. almost as if it were gliding, or more ressembled to a leaf being blown in a light autumn breeze! just creepy! i hope its just something known, i just dont know! any help of anything in that airspace at the time would be appreciated! i like to be logical and realistic, but i do believe!"],"Country":"United States","files":["/var/www/straped/mufon/html2text/52185.html.txt","/var/www/straped/mufon/org/52185.html"],"Date Submitted":"11/11/2013 07:33 UTC","Log Number":"US-11112013-0018","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=39.819504,+-77.02094(52185)&iwloc=A&hl=en\"> mufon case (52185) map </A>","Date of the Event":"11/11/2013 06:30 UTC","Object Shape":"Circle, Flash, Star-like, Triangle","Object Flight Path":"Path with directional change,Other","Source":"MUFON","Sighting Duration":"Undisclosed","Case Number":"52185","City":"Hanover","Weather Factors":"Unknown"}