{"Log Number":"US-11112013-0015","Date of the Event":"11/09/2013 07:45 UTC","Longitude":"-78.649794","Viewing Distance":"Unknown","Weather Factors":"Unknown","Country":"United States","Latitude":"37.433763","Object Features":"Unknown","divs":["Sighting DetailsI was with my girlfriend (at 40 she hates to be called a girl) in Fredericksburg, Virginia about 7:40pm on Saturday, November 9, 2013. She went out on her second floor balcony to have a smoke and in a matter of seconds she called me how to ask me what type of light that was in the sky. The light was very and I do mean very bright and at about 40 degrees in the sky (at 220 degrees SW from our location) visible over some trees and another apartment building. At first I thought that it looked just like the bright white light that is on the front of large passenger planes. The biggest problems with that explanation is that it would have had to be within a mile of our location and flying lower that 750 (approx) feet in order to be that size and bright. The thing was it didn't appear to be moving, there was no sound and it was not accompanied by the flashing red light that is always on the underside of all large aircraft. Together we watched the light for about 10 minutes and finally noticed that it was now lower in the sky (about 30 degrees). This change was so slow that if we hadn't compared it to the trees and the other buildings, we would have never noticed that it had moved at all. I tried my best to come up with an explanation as to what this might could be but nothing seemed to fit. I thought that maybe it was a large plane that was flying directly away from us and that's why it didn't move from side to side, but the size never really changed abd I just how slow could it go in order to appear to not be moving at all. It was way to bright to be a star or planet. I thought about a radio or cell tower, but the light did eventually go lower and eventually disappear. The I remembered about the GOCE satelite that was suppose to be falling back to earth in a couple of days, but everything that I read said that the satelite always had a tail and would blink, this light had or did neither. I also thought about the ISS, but upon looking it up on the NASA website, it was traversing the sky in the wrong direction. It lasted or was visible for about 40 minutes. I'm not saying what it was for I have no idea. If anyone has the answer I be very thankful for any LEGITIMATE answeres."],"trends":[],"Case Number":"52182","Sighting Duration":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/52182.html.txt","/var/www/straped/mufon/org/52182.html"],"Date Submitted":"11/11/2013 04:50 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.433763,+-78.649794(52182)&iwloc=A&hl=en\"> mufon case (52182) map </A>","Source":"MUFON","Object Shape":"Unknown","Object Flight Path":"Stationary","Summary":"Very bright light if moving, it was very slow but appeared to disappear over the horizon","Disposition":"Unresolved","City":"Undisclosed","Region":"Virginia"}