{"Object Features":"Other","Summary":"peeping\\buzzing sounds with lights. it flys towards me everytime it sees me","Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/52199.html.txt","/var/www/straped/mufon/org/52199.html"],"Weather Factors":"Unknown","Longitude":"-92.374889","Log Number":"US-11122013-0004","divs":["Sighting Detailsmy cell phone wont download my video. Ive tried several times and my phone disconnects from the internet or shuts off. I was able to download it to my facebook page. I dont know why it wont download here. The video I have will knock your socks off. its not only creepy but has some sound to go along with it. Ive seen this thing numerous times in the past 3 years. I have still pictures of the first time i saw it also.I saw 2 diamonds that glowed when i first saw it 3 yrs ago. The video is amazing. Someone needs to see this video besides me. The video is not edited in anyway. I dont know how to do that stuff anyway. I just want someone to see what i deal with on a daily basis during the warmer months at my home. Just this week I moved to another house i bought. hopefully to never see this thing again. The video is well worth your time to see. maybe i could get it sent to another cell phone or maybe you can just watch it from my facebook page. I dont know why it wont download here. But i have it if you would like to see it. I just want to know what the heck it is and why its in my yard the last 3 years. Id like help with this issue please. thank you...PJ Tucker"],"Tags":"City","Case Number":"52199","Latitude":"44.00107","Object Shape":"Other","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","City":"Rochester","Viewing Distance":"20 Feet or Less","trends":["There have been 13 other sightings in Rochester","There were no other sightings in Rochester on or around August 27th 2013"],"Date Submitted":"11/12/2013 06:10 UTC","Sighting Duration":"00:30:00","Region":"Minnesota","Disposition":"Unresolved","Date of the Event":"08/27/2013 03:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.00107,+-92.374889(52199)&iwloc=A&hl=en\"> mufon case (52199) map </A>"}