{"divs":["sighting detailson sunday, 11\\10\\2013, in deltona, florida, about 20 miles ne of orlando. stopped at the dollar tree at 8:00 pm. noticed a bright orange \"fireball\" approaching from over the dupont lakes plaza behind me. as my family and i got out of the car, we were discussing the exact same object we saw 6 months earlier, almost in the same location. (the object was traveling in a different direction the first time) the object flew right over us at jet aircraft speeds, in a straight line. not to be confused with a meteor, space debris, or chinese lanterns. right behind it, 3 of the same objects flew the same trajectory in staggered military formation, such as you would see with 4 blackhawk helicopters flying over. the objects looked like fireballs with no plume, like a rocket or missile might have. again, they were not chinese lanterns, although they looked similar. they were flying horizon to horizon at jet speeds. no sound at all! the objects were moving from ne toward sw paralleling the i-4 corridor. a straight line would have taken them from the atlantic ocean, over daytona speedway directly over deltona, sanford, then orlando. filmed one of the objects next to the moon."],"trends":["There have been 5 other sightings in Deltona","There were no other sightings in Deltona on or around November 10th 2013"],"Summary":"4 Bright orange fireballs moving in military formation at jet speeds in straight line","Weather Factors":"Unknown","Log Number":"US-11112013-0024","City":"Deltona","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=28.925751,+-81.191122(52191)&iwloc=A&hl=en\"> mufon case (52191) map </A>","Disposition":"Unresolved","Latitude":"28.925751","files":["/var/www/straped/mufon/html2text/52191.html.txt","/var/www/straped/mufon/org/52191.html"],"Object Shape":"Fireball","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Longitude":"-81.191122","Date of the Event":"11/10/2013 12:00 UTC","Tags":"City","Sighting Duration":"Undisclosed","Date Submitted":"11/11/2013 10:04 UTC","Case Number":"52191","Country":"United States","Region":"Florida","Object Features":"Unknown"}