{"Longitude":"-2.151548","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=53.894072,+-2.151548(52204)&iwloc=A&hl=en\"> mufon case (52204) map </A>","Country":"United Kingdom","Weather Factors":"Unknown","Region":"","Object Flight Path":"Straight-line path","Date of the Event":"11/12/2013 04:00 UTC","trends":["There have been no other sightings in Salterforth","This sighting has never been favorited."],"Summary":"i looked out the back of my house and in the sky was a white oval shaped object that floated seamlessly across the sky, then a plane lower than the object flew past it as it disappeared in the clouds out of sight","divs":["Sighting Detailsi was rolling my cigarette to go for a smoke at about 16:00 i opened my backdoor to go outside,i looked across the sky as i usually do, and there was this white oval object that didn't change shape or size but flew in a straight line towards a small cloud behind a house that cut off my view from it,it was roughly the length of a plane but it flew higher, i know this because a plane flew the opposite direction more lower than the object, i was hoping to see it again after it flew behind the house as it was the direction it was flying, however it didn't it just disappeared in the clouds, i didn't feel any different from seeing it, it was more of an awe like a \"wow\" feeling mixed with \"wtf!?\" as it was different after i knew it went i rushed to the internet and typed in \"what to do if you see a UFO for real\" i ended up on MUFON because i needed to tell someone quickly, and now im feeling a little bit curious. i know its legit because i saw it and i could draw it whenever wherever with whatever i can, it was real, i saw a UFO."],"files":["/var/www/straped/mufon/html2text/52204.html.txt","/var/www/straped/mufon/org/52204.html"],"Date Submitted":"11/12/2013 11:30 UTC","Tags":"City","Disposition":"Unresolved","Viewing Distance":"Unknown","City":"Salterforth","Object Shape":"Oval","Case Number":"52204","Sighting Duration":"Undisclosed","Latitude":"53.894072","Log Number":"GB-11122013-0008","Object Features":"None"}