{"trends":[""],"Date Submitted":"11/12/2013 08:35 UTC","Disposition":"Unresolved","Sighting Duration":"00:02:10","Source":"MUFON","Summary":"It Came off of the Moon in daylight hours","files":["/var/www/straped/mufon/html2text/52209.html.txt","/var/www/straped/mufon/org/52209.html"],"Latitude":"36.785581","Region":"California","Object Shape":"Sphere","Longitude":"-119.415192","Tags":"City","Object Flight Path":"Hovering then path,Path then hovering","Weather Factors":"Unknown","Log Number":"US-11122013-0013","map":"<A HREF = \"http://maps.google.com/maps?q=36.785581,+-119.415192(52209)&iwloc=A&hl=en\"> mufon case (52209) map </A>","divs":["Sighting DetailsI noticed a white orb coming from the moon. The sky was still very blue at 15:44. The sky was so blue, and it was full daylight so it was not a star or planet. It moved from the moon to the left and then stopped. Then it started moving down and then stopped. It appeared to come from the moon or from in front of the moon. This is when I ran inside to grab my video camera. By the time I ran back outside, the orb had moved diagonally to the left and down away from the moon in the \"7 o'clock\" position. This is when I hit record and captured it for 2 minutes and 10 seconds before it just vanished into thin air. I used my Sony HXR-NX30U video camera. You can clearly see the orb in my attached video. I did not edit the video in any way. It's just raw footage. Please enhance the video by 300% or zooming in to see the orb. I was the person in the video filming, and I was asking if my Grandfather saw it but he said something about his eyes so he didn't see it until I showed him the video. My camera was set to 1920 x 1080 60p. Look at the 15-16 second mark as it moves rapidly. Then again look at the 21 second mark, the object begins to clearly move from a stationary position. Definitely watch the orb between seconds 15-16 and 21-23, it moves position rapidly then stops again. Definitely not of this world. Please share. -Thanks -Jeremy Nolen"],"Country":"United States","Viewing Distance":"N/A","City":"Undisclosed","Case Number":"52209","Date of the Event":"11/11/2013 03:44 UTC","Object Features":"Unknown"}