{"Object Features":"Unknown","Log Number":"US-11132013-0004","City":"Warrington","Sighting Duration":"Undisclosed","Date of the Event":"11/13/2013 01:20 UTC","Viewing Distance":"Over One Mile","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.264655,+-75.154999(52214)&iwloc=A&hl=en\"> mufon case (52214) map </A>","trends":["There have been 5 other sightings in Warrington","There were no other sightings in Warrington on or around November 13th 2013"],"Object Shape":"Star-like","Country":"United States","Latitude":"40.264655","Date Submitted":"11/13/2013 02:44 UTC","Weather Factors":"Unknown","Disposition":"Unresolved","divs":["Sighting DetailsWas driving home down Bristol road at approximately 1:20 AM due East South East when I noticed a Bright light with the appearance of a star, but definitely way brighter than a star, brighter than any planet, opposite direction of the moon. I immediately thought the light was strange. I saw it for approximately 10 seconds before it completely vanished. I saw it far in the distance with a great view because there is nothing but a field across from Barness field. I pulled up my compass on my Iphone allowing me to know that it was North East in the sky no higher than 20 Degrees. After I got home I drove back to the spot that I saw it with my dog(just in case) just to verify that there were no bright stars in the area. There were only completely dark skies. Very clear night with absolutely no cloud coverage and beautiful views of the stars. Then when I got back home again and walked over to the fields behind Tamanend middle school just to get a good view of the sky to keep my eyes open in case it happened to come back. My phones battery drained very quickly to 20% from over 50% within 20 minutes then shut off from a dead battery. My guess is it was just the cold though only about 28 Degrees out tonight."],"Tags":"City","files":["/var/www/straped/mufon/html2text/52214.html.txt","/var/www/straped/mufon/org/52214.html"],"Region":"Pennsylvania","Object Flight Path":"Stationary","Summary":"Driving down Bristol road across from Barness Field. Big open field no trees. It's a farm. Bright light disapeared within 10 seconds.","Longitude":"-75.154999","Case Number":"52214"}