{"Tags":"City","Viewing Distance":"Over 1 Mile, Unknown","Latitude":"29.492527","Source":"MUFON","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=29.492527,+-98.306296(52213)&iwloc=A&hl=en\"> mufon case (52213) map </A>","Country":"United States","Region":"Texas","Object Flight Path":"Stationary","trends":["There have been no other sightings in Converse","This sighting has never been favorited."],"Object Shape":"Sphere, Triangle","files":["/var/www/straped/mufon/html2text/52213.html.txt","/var/www/straped/mufon/org/52213.html"],"Date of the Event":"11/12/2013 11:20 UTC","City":"Converse","Case Number":"52213","Sighting Duration":"02:00:00","Longitude":"-98.306296","Summary":"Saw object glowing red green blue white lights towards the east at 11:20pm","Log Number":"US-11132013-0003","divs":["Sighting DetailsCame outside through the front door to feel how cold it had gotten, as I looked up towards Orien's Belt and I saw blinking lights in red, green, blue, white above the neighbors tree across the street as I thought I was seeing a UFO. Called my partner to come and verify the sighting. I seemed to just hover or stay in the origial place I saw the lights for about 20 minutes, then it moved a little towards the south and stayed there for about 10-15 mins. I got the binonculars out and my cell camera. Saw the lights blinking bright in binonulars and with my eyes without and with my glasses and took 2 pictures with my cell phone, checked my picture and the light is in it. My partner verified the blinking lights and agreed with me that I have seen my first UFO. I checked at 12:05 am and the object with lights had moved farther away towards the south. I was very excited to see the lights as was my partner. I came inside so I could not see the lights anymore. I checked outside again at 12:40 am and the bright blinking lights were hovering way under but in direct line with Orien's Belt."],"Disposition":"Unresolved","Date Submitted":"11/13/2013 02:11 UTC","Object Features":"Unknown"}