{"Summary":"Hole left in cloud twice in 5 year period before big storms","Object Flight Path":"Straight-line path,Other","Log Number":"US-11132013-0005","Date of the Event":"08/15/2011 08:00 UTC","Viewing Distance":"21-100 Feet","Source":"MUFON","Latitude":"39.214535","map":"<A HREF = \"http://maps.google.com/maps?q=39.214535,+-94.576166(52216)&iwloc=A&hl=en\"> mufon case (52216) map </A>","Date Submitted":"11/13/2013 09:07 UTC","Case Number":"52216","Object Shape":"Circle, Unknown","Object Features":"Unknown","trends":["There have been 8 other sightings in Gladstone","There were no other sightings in Gladstone on or around August 15th 2011"],"files":["/var/www/straped/mufon/html2text/52216.html.txt","/var/www/straped/mufon/org/52216.html"],"Sighting Duration":"00:00:01","Region":"Missouri","Longitude":"-94.576166","City":"Gladstone","Weather Factors":"Unknown","Tags":"City","Disposition":"Unresolved","divs":["Sighting DetailsCheck the intersection of N. Oak and 67th street in Gladestone near the Vienna Square apartments. When a storm rolls through a perfect circle is punched through the clouds (as if something invisible about 50 ft in diameter) is left at the intersection straight up before a storm arrives. I've seen this cloud pattern twice with other witness' over a 5 year period. The second time I was with in 100 feet of the event but didn't see it happen. The clouds were a low level thin cloud about 100 feet off the ground over the intersection moving at a fast speed (40 mph heading south). A perfect circle was punch through it only a few seconds before I noticed. No sound, no noise, no visual. The circle of the open cloud was only a few feet further down the street from the time I noticed and stopped my conversation to see if I'm seeing it right. It was confirmed with a \"It could be some signal from the radio tower near by\" As a \"I don't care\" I took a moment to point out the flaws in his logic, but I went back to the prior conversation before he could think I was a true UFO believer. If we have 'watchers' at that location than that's the perfect spot. It's a cop trap (Human behavior watching) and has ambulances and fire trucks rolling through there ALL the time! Not to mention a radio tower with in visual range. When any tornado rolls through, it goes right through that area. I'm just saying As for the Date, It is approximate. Me and others lost power due to a transformer blow out next to the apartments that evening so we were just talking. I can't remember if it was before. It might have been the day after ... but that's about the time of this second event."],"Country":"United States"}