{"Case Number":"52228","Summary":"Brilliant light in sky","Object Shape":"Disc, Star-like","Latitude":"40.75583","Log Number":"US-11132013-0015","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=40.75583,+-75.390729(52228)&iwloc=A&hl=en\"> mufon case (52228) map </A>","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/52228.html.txt","/var/www/straped/mufon/org/52228.html"],"Longitude":"-75.390729","Tags":"City","trends":["There have been no other sightings in Bath","This sighting has never been favorited."],"Date of the Event":"11/13/2013 06:33 UTC","Viewing Distance":"Unknown","Date Submitted":"11/13/2013 09:01 UTC","City":"Bath","Object Features":"Dome","Region":"Pennsylvania","Weather Factors":"Unknown","Object Flight Path":"Hovering then path","Source":"MUFON","divs":["Sighting DetailsHusband took dog out and noticed bright object in SW sky @ 6:33pm (brighter than any star) identical to one he observed the night before, only last night it was in a NE position. It was a clear night and the temp was in the 20's. He called me to see it. Object hovered pretty steady for 20+ minutes as we took video of it. It had a pulsating effect. At times you could see different colors. We didn't hear any noise from it. It slowly went below the treeline and we lost sight from our yard. We were going to the store anyway, so we hopped in the car to see if we could still see it beyond the treeline. Sure enough we did. It seemed to be moving SE and then SW. At one point it looked more like a rectangle of light in the sky vs. star shaped. We watched as it seemed to get smaller and smaller, seemed to be moving further away from us in SW direction. I will attach the 2 videos I took. I was glad to get these videos as my video camera was ready to die, so they are pretty brief. They are date and time stamped, however, we just turned the clocks back an hour a week or so ago and I did not adjust the time on my video camera so please note that the actual time is one hour earlier. If you can, watch the video frame by frame, very interesting colors and what looks like a saucer at a few points. Also, please note that I am holding the video camera so it looks jumpy (it was cold out and I was shivering)."],"Country":"United States"}