{"Latitude":"45.665087","trends":["There has been one other sighting in Pendleton","There were no other sightings in Pendleton on or around November 13th 2013"],"Tags":"City","Region":"Oregon","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.665087,+-118.785034(52229)&iwloc=A&hl=en\"> mufon case (52229) map </A>","Date of the Event":"11/13/2013 05:20 UTC","Viewing Distance":"Over One Mile","Date Submitted":"11/13/2013 10:00 UTC","files":["/var/www/straped/mufon/html2text/52229.html.txt","/var/www/straped/mufon/org/52229.html"],"Country":"United States","City":"Pendleton","Object Shape":"Disc","Summary":"a bright star like white light appeared at about 5:20 pm around it 9 t0 11 pulsating flashing objects.","Log Number":"US-11132013-0016","Case Number":"52229","Object Features":"None","Source":"MUFON","divs":["Sighting DetailsAt around 5:20 this evening I was pulling into my drive way and noticed bright white light at about a 48 degree looking south east towards the Blue Mountains. As I looked closer it appeared to be stationary and not a plane or helicopter. I had a pair of binoculars in my car so I got the out and focused on the light. Through the binoculars it appeared to have s some what of a saucer shape, but was really hard to tell. My wife and watched the light through the binocs as well as taking some photos with our phone camera. After about 20 minutes I noticed that there were like little satellites (about 9 to 11) that were in various places around the mother light. The little lights were much more colored having a green, white and blue swirling effect. They appeared to be stationary around the mother light. After about 25 minutes of watching the mother light and the little lights one of the little ones started traversing the sky from an East to S. West trajectory. It was very colorful in that the 3 colors mentioned above were readily apparent. I watched the little light until it disappeared into the Southern sky. At about 6:20 the main light started to dim and was progressively getting dimmer. At about 6:25 I heard a jet go overhead and was headed in a Southerly direction, but not directly headed to the main light. I watched the jet until it went out of view. I definitely heard the jet engines and I thought it was probably military as the direction was not in one of the major commercial routes. I came into the house as my hands were freezing and the light was about gone. From time that I first observed the light until I went inside was about 45 minutes. This is the second time that we have observed the light (two weeks ago was the first time on a Sunday at about 5:38 in the afternoon) but it was the first time that we observed the satellites' that were surrounding the main mother light. I also put a very powerful hand held laser on the mother light and smaller lights with no impact. The main light did appear to be somewhat on the reddish hue on the bottom of the light. My feelings watching this was one of wonder and awe to be able to see something that I have read about, but now was actually seeing this for myself."],"Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Longitude":"-118.785034","Disposition":"Unresolved"}