{"Weather Factors":"Unknown","Longitude":"24.875114","Region":"Harju County","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=59.449855,+24.875114(52226)&iwloc=A&hl=en\"> mufon case (52226) map </A>","files":["/var/www/straped/mufon/html2text/52226.html.txt","/var/www/straped/mufon/org/52226.html"],"Country":"Estonia","Case Number":"52226","Date of the Event":"09/28/2013 02:10 UTC","Source":"MUFON","Object Shape":"Triangle","City":"Tallinn","Object Features":"Patterned Surface","divs":["Sighting DetailsI was on my balcony, having a sigaret, when i unexpectedly saw the fast moving triangular object in the sky. I immediatly thought that it is not an airplane, besause it didnt have any similarity to aircrafts i have seen so far. It was very quiet windless night and there was no noise from the streets. Still i didnt hear any sound from the object. It felt almost ghostly. Streets were brightly lighted and the object was flying only 100-200 meters above the ground (streetlights were reflecting from it like they reflect from the clouds), so i had clear view of the object. It was the size of a large airplane. It was a perfect black isosceles triangle with straight sides. On every angle it had smaller triangle shapes in gray color. It had no lights and i had strong feeling that i was not ment to see it. I saw it only for approx 10 seconds, after that it disappeard behind the buildings. After it disappeard, i searched the internet, hoping to find similar sightings, but i could'nt find the exact match. I also add my sketch of the UFO and excuse my poor english."],"Disposition":"Unresolved","Log Number":"EE-11132013-0013","Object Flight Path":"Straight-line path","Summary":"Triangular UFO sighting in Tallinn Lasnamäe on september 28th 2013 at 2AM","Latitude":"59.449855","Sighting Duration":"00:00:10","trends":["There have been no other sightings in Tallinn","This sighting has never been favorited."],"Date Submitted":"11/13/2013 07:52 UTC","Tags":"City"}