{"Region":"Ontario","Object Shape":"Sphere, Star-like","trends":["There have been 10 other sightings in Kingston","There were no other sightings in Kingston on or around November 13th 2013"],"Date Submitted":"11/13/2013 05:41 UTC","Viewing Distance":"101-500 Feet","Country":"Canada","Date of the Event":"11/13/2013 02:40 UTC","Longitude":"-76.594619","Weather Factors":"Unknown","Summary":"me and my girlfriend saw a glowing orb zoom in, hover than propel off","divs":["Sighting DetailsMy girlfriend and i were heading back to our home in bayridge after a get together, we got out of the cab at the baseball diamond and began walking through the field. we bother noticed the object because it was quite dark over top of the houses and it was very brightly illuminated and swerved into few very quickly (the colour was very similar to the sun). The object was at first about a few feet across, very clearly emitting light. It moved so quickly it seemed to leave a beam-trail behind it, like when they go into warp drive on star treck. It seemed to appear out of nowhere, it was heading north extremely fast than veered west and stopped for a moment. when it stopped the light went out, in the dark i could just see a circular very transparent blurr. seconds later it began emitting light, although the light was much smaller between the size of a base ball and a tennis ball. not a quarter of a second after it began glowing it propelled itself unbelievably quickly. it looked like a rock shot out of a slingshot how smoothly and quickly it moved, it flew high enough and fast enough for us to loose sight of it in less than 2 seconds. I felt happy when i saw it, it was the second time ive seen something like that and for some reason it comforted me. my girlfriend however was extremely freaked out and we agreed to walk along the street home instead of cutting through the field. When i first noticed the object i thought it might have been a firework until i realized i heard no sound and saw that it was travleling on an angle perpendicular to the ground at that moment i felt that it may be something spiritual but when it propelled off it was so unbeleivably fast and fluid i realized it was something mechanical."],"Latitude":"44.248443","Source":"MUFON","Case Number":"52223","Object Flight Path":"Hovering then path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=44.248443,+-76.594619(52223)&iwloc=A&hl=en\"> mufon case (52223) map </A>","Log Number":"CA-11132013-0011","Object Features":"None","Tags":"City","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/52223.html.txt","/var/www/straped/mufon/org/52223.html"],"Disposition":"Unresolved","City":"Kingston"}