{"map":"<A HREF = \"http://maps.google.com/maps?q=37.91093,+-91.898083(52227)&iwloc=A&hl=en\"> mufon case (52227) map </A>","trends":["There have been 2 other sightings in Newburg","There were no other sightings in Newburg on or around November 11th 2013"],"Date Submitted":"11/13/2013 08:49 UTC","Region":"Missouri","Object Flight Path":"Hovering then path","Object Features":"Unknown","Date of the Event":"11/11/2013 05:15 UTC","Tags":"City","Summary":"Bright star like object with accompanying dim red objects in SW sky","Longitude":"-91.898083","Object Shape":"Star-like, Triangle","Viewing Distance":"Over One Mile","City":"Newburg","Disposition":"Unresolved","Latitude":"37.91093","Source":"MUFON","files":["/var/www/straped/mufon/html2text/52227.html.txt","/var/www/straped/mufon/org/52227.html"],"Country":"United States","divs":["sighting detailsi was star gazing a little after 5 pm on 11\\13\\2013 when a very large bright white light caught my eye in the southern sky. it was about 30 degrees up above the horizon. no other stars were out yet. this thing appeared to spin very slowly. it would get very, very bright and slowly go dim only to get very bright again. at first i thought it was the planet venus or maybe the star vega, but then i noticed it had 3-4 smaller lights that were a reddish orange circling it. the smaller objects also appeared as stars but were very much dimmer as compared to the large white light. i watched these objects from 5:15pm to 7:30pm and they appeared to be stationary or slowly following a 90 degree arc from 30 degrees above the horizon due south to treetop level in the sw. the large white object appeared to land as it went down behind a hill and then went out, but i can't verify that since i could not actually see beyond the hillside. i have seen these objects for a little over a month now. my first sighting was around october 5, 2013 when i noticed it just barely above tree top level in the sw. it has been out every clear night since then. it is only obscured by heavy cloud cover or rain. i did get a good look at it through a pair of tasco 10x50 binoculars. it appeared to be a huge triangle with a row of lights on the back that were pulsating bright white. the surface seemed to be shimmering with light. it had a large rotating white strobe on the bottom that was shining down toward the ground. this thing would slowly rotate and the lights would go dim only to get bright again. the smaller objects seemed to be orbiting it. where i live we have fort leonard wood army camp 20 miles to the sw, and whiteman air force base 200 miles to the nw, so i don't know if these are aircraft or not. i did not hear any sound, but i did notice a lot of other aircraft activity in the area after the objects had left, and the scanner chatter on the military air bands was quite heavy. sure would like to find out just to put my mind at ease."],"Log Number":"US-11132013-0014","Case Number":"52227","Sighting Duration":"Undisclosed","Weather Factors":"Unknown"}