{"Viewing Distance":"Over One Mile","Country":"United States","City":"Gastonia","Tags":"City","Date of the Event":"11/13/2013 05:12 UTC","Date Submitted":"11/13/2013 11:27 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.249324,+-81.173062(52232)&iwloc=A&hl=en\"> mufon case (52232) map </A>","Weather Factors":"Unknown","Object Shape":"Cigar, Cylinder","Object Features":"None","Summary":"I saw an unexplainable hovering cigar with 5-7 jets around it.","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/52232.html.txt","/var/www/straped/mufon/org/52232.html"],"Longitude":"-81.173062","Sighting Duration":"Undisclosed","Source":"MUFON","Latitude":"35.249324","Log Number":"US-11132013-0019","Region":"North Carolina","trends":["There have been 8 other sightings in Gastonia","There were no other sightings in Gastonia on or around November 13th 2013"],"Object Flight Path":"Stationary","Case Number":"52232","divs":["Sighting DetailsI am an avid believer in UFOs and the ancient alien theory so I keep my eyes fixated on the sky daily. This day in particular, I was leaving my house on the way to school. I park my car facing west, so as soon as I got in it, I immediately noticed the object in the sky. I also saw four of what appeared to be military jets flying in its vicinity. The object was so far away I didn't even bother trying to take a picture as the focus on my phone wouldn't pick up an image, and I was in total shock and awe at the moment. The object was red at first, then the red light faded to reveal a white, cigar shaped craft, hovering in the sky. It was completely still. Then it started to glow white, like an aura, then went back red, then white again. The next thing sealed the deal for me about it being an UFO. It emitted two huge balls of light from it's belly. Not detached, but emitting them from the hull. They were extremely bright, like what you would expect from a space shuttle taking off, but completely white. Then it started to turn in place, as if it was observing the planes flying around it. Then it turned red and flew off in one direction and came back to approximately the same place. The only way I knew it flew away is the fact that it got smaller. I was trying to track it while I was driving and every time I saw it, it was in a different position in the sky, same altitude, just different place. I also noticed more planes in the sky while I was driving and counted 7 total. I eventually lost the craft because I had to travel in the opposite direction towards the school, but the planes and helicopters in the sky continued throughout the three and a half hours of school and on my way home. I kept the event to myself during class but I told my girlfriend as soon as I got home. In hind-sight, I wish I would've taken a picture. If anybody else saw the object and reported it to you guys, please e-mail me so I know I wasn't the only one to see it."]}