{"Country":"United States","Disposition":"Unresolved","Object Shape":"Disc, Other","Latitude":"31.130373","files":["/var/www/straped/mufon/html2text/52238.html.txt","/var/www/straped/mufon/org/52238.html"],"Source":"MUFON","Log Number":"US-11142013-0006","Case Number":"52238","Viewing Distance":"101-500 Feet","Tags":"City","Longitude":"-97.780315","map":"<A HREF = \"http://maps.google.com/maps?q=31.130373,+-97.780315(52238)&iwloc=A&hl=en\"> mufon case (52238) map </A>","Date Submitted":"11/14/2013 05:52 UTC","Summary":"03:50 20mph central, TX","Weather Factors":"Unknown","trends":["There have been 6 other sightings in Fort Hood","There were no other sightings in Fort Hood on or around November 14th 2013"],"Object Flight Path":"Straight-line path","City":"Fort Hood","Sighting Duration":"Undisclosed","Date of the Event":"11/14/2013 03:50 UTC","divs":["sighting detailswe were woken up by what felt like an earthquake at 03:50 central time. we ran outside and the air and ground was vibrating like standing next to a very loud speaker with a lot of bass. a bit faster than a heart beat. there was no sound. the craft was moving about 20mph in a w to e direction ... a little ne... heading toward killen\\fort hood, tx. the craft was as big as my 5 acres. there was no sound, no lights, the craft was illuminated by my street light. it was a very dark grey and we could see features ... not very symmetrical in nature. the craft was disk shape with a center fuselage, split down the middle, with the fuselage in-between the two disks. the fuselage was semi-square with rounded edges and corners. kind of like batman's batwing... kind of. the disk was about 30 feet thick\\tall. there was no bevel or curve to shape. it was a big squarish disk split in half with a squarish fuselage. it took about 5 minutes before it disappeared into the darkness. it did not zip away. there was swoosh just the steady deep earth shaking vibrations. no damage to my home or trees or anything. enough vibration to wake us up and to make us run outside. shortly afterward (a minute or two), two apache helicopters followed after it, traveling about the same speed."],"Region":"Texas","Object Features":"Patterned Surface, Other"}