{"Source":"MUFON","Region":"New York","Sighting Duration":"Undisclosed","Latitude":"42.457466","Log Number":"US-11142013-0016","Tags":"City","files":["/var/www/straped/mufon/html2text/52248.html.txt","/var/www/straped/mufon/org/52248.html"],"Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=42.457466,+-75.05632(52248)&iwloc=A&hl=en\"> mufon case (52248) map </A>","divs":["Sighting DetailsI was fishing on a lake at about 9;30 AT NIGHT WITH MY FREIND PAT AND HIS BROTHER JIM WHEN ALL OF A SUDDEN APEARED A HUGE GLOWING BLIMP SHAPED OBJECT, IT IMITTED A GREEN AND YELLOWISH LIGHT. mE AND MY FREINDS KNEW INSTANTLY IT WAS A U.F.O. wE WATCHED AS IT MOVED TOWARDS A MOUTAIN AT A SLOW PACE. wHEN IT REACHED THE MOUNTAIN IT WENT BEHIND IT CAME OUT THE OTHER END,WENT BACK IN AND DISSAPEERED. iT WAS THERE FOR ABOUT 20 MINUTES AND THEN WITHOUT A NOISE IT WAS GONE. ABOUT 30 YEARS LATER I HAD TAKEN MY SON TO FISH AT THE SAME LAKE AT THE SAME LOCATION AND I TOLD HIM THE STORY ABOUT THE UFO AND RIGHT AS I SAID THAT MY FREIND pAT HAD BEEN THERE WITH ME A TRUCK PULLED UP BEHIND US. tHE DRIVER STEPPED OUT. iT WAS PAT!!!! WHO HAD NOT SEEN ME FOR 30 YEARS. HE TOLD MY SON THAT I WASNT LYING AND THAT HE WAS THERE WITH ME. i THOUGHT THAT IT WAS A LITTLE WEIRD THAT HE HAD CHOSSEN TO GO TO THE SAME PLACE WE SAW THE UFO ON THE SAME DAY AS ME AFTER WE HADNT SEEN EACH OTHER IN 30 YEARS. WHEN ME AND MY SON LEFT MY SON KEPT SAYING TO ME THAT IF MY STORY WAS TRUE THEN pAT MUST OF BEEN AN ALIEN SENT TO SPY ON US. i JUST LAUGHED AND WE WENT BACK TO THE PLACE WHERE WE WERE GOING TO STAY THAT NIGHT. iM STILL NOT SURE IF PAT WAS AN ALIEN BUT MY SON CONTINUES TO INSIST ON IT."],"Object Shape":"Blimp, Oval","Case Number":"52248","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Disposition":"Unresolved","Weather Factors":"Unknown","Date of the Event":"07/19/1976 12:00 UTC","Summary":"hovered then disappeared behind a mountain then reapeered from behind mountain hovered again then dissapeered for good","Date Submitted":"11/14/2013 05:26 UTC","Longitude":"-75.05632","City":"Oneonta","trends":["There have been 2 other sightings in Oneonta","There were no other sightings in Oneonta on or around July 19th 1976"],"Object Features":"None"}