{"Date Submitted":"11/14/2013 03:39 UTC","Country":"United States","Log Number":"US-11142013-0013","map":"<A HREF = \"http://maps.google.com/maps?q=43.681458,+-75.354623(52245)&iwloc=A&hl=en\"> mufon case (52245) map </A>","Latitude":"43.681458","Longitude":"-75.354623","Summary":"Headed towards my cabin, went over cabin, went out of view","Viewing Distance":"101-500 Feet","Disposition":"Unresolved","trends":["There have been no other sightings in Greig","This sighting has never been favorited."],"City":"Greig","Object Shape":"Triangle","Object Flight Path":"Straight-line path","Case Number":"52245","Region":"New York","divs":["Sighting DetailsI was sitting on my deck, observing sattelites at @ 11:30 at night, looking towards the SE. The view extends into the Adirondack Park Wilderness area. I noticed a triangle shaped lighted object in the distance at a few hundred feet above tree level. It was making a dull roaring noise, which became loader as it approached. It sounded like a C-130 at take off, As it approached, it's shape reminded me of a Concorde aircraft, and the noise was equally as deafening. The lighted silloute seemed similar also, I thought it was possibly a Russian Bomber being tested at Fort drum, it was streamlined and pointy in appearence, and appeared to have landing lights on and navigation lights. However, it took forever for this thing to cover any distance, and I do not think it was travelling at more than 40 or 50 MPH. As it passed over the cabin, the object was clearly a rectangular craft, shaped like a large shoebox, was not very far up, maybe 500 feet max, and appeared as if it was rigged with lighting to make it appear as if it were something other than a big balloon. As It passed overhead, it appeared to have four each simulated engines, round in shape and lit orange to yellow, too simulate flaming jet engines, (Two engines in close proximty on either side of the aircraft) and the lighted rear end of the box bled through partially to the bottom of the box shaped craft. The noise, extremely loud, did not make any sense given the speed of the vehilcle and the look of the engines. It appeared to be about 100 feet wide, and 400 feet long, with a width of 40 feet or so, the upper portion not being lit well. ....The noise continued, seemed to indicate that it was not a hot air balloon enthuist's prank. It disappered out of view, heading through a very rural area to the direction of Fort Drum military base. I would suggest google earth to look for odd aircraft hangers. My feeling upon initially seeing it approach was sheer terror, primarily because of the noise, but after observing the big beast, I felt as though it was a large heavy lift balloon machine with a psy-ops feature to distract an enemy. Oddly, I looked for windows, doors or protrusions and saw no sign of such. How one would use such a balloon is a bit of a mystery. If the machine were used in combat, it would be easy pickings to shoot at!"],"Source":"MUFON","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/52245.html.txt","/var/www/straped/mufon/org/52245.html"],"Weather Factors":"Unknown","Tags":"City","Date of the Event":"10/15/2013 11:50 UTC","Object Features":"Wings"}