{"files":["/var/www/straped/mufon/html2text/52242.html.txt","/var/www/straped/mufon/org/52242.html"],"Disposition":"Unresolved","Date of the Event":"11/04/2013 09:00 UTC","Case Number":"52242","Summary":"HEARD OBJECT BEHIND HOUSE, FOUND BURN MARKS IN GRASS, POWER SURGE UPON TAKE OFF","Viewing Distance":"21-100 Feet","Weather Factors":"Unknown","Date Submitted":"11/14/2013 02:53 UTC","Object Flight Path":"Other","City":"Wallingford","Object Features":"Unknown","Source":"MUFON","Tags":"City","trends":["There have been no other sightings in Wallingford","This sighting has been favorited 2 times."],"Log Number":"US-11142013-0010","Country":"United States","Region":"Vermont","Longitude":"-72.977369","Sighting Duration":"00:03:00","Latitude":"43.471747","Object Shape":"Other","divs":["Sighting DetailsOn Monday, November 4th, 2013, an extremely clear night to see stars, I took my dog out around 9pm for a walk. I was 30 ft. in front of my house when I heard a continuous grrrrrrrrr click grrrrrrrrrrr click hnnnnnnn(like the high compression whine when a helicopter lands). It sounded as though the object was sitting out back. I moved 8-10ft closer to the east side of the house to see what it was but could not find any light. I know there was an object there but I could not see it. My yellow lab led me towards it with his nose straight in the air. Instead of confronting the object behind my house I called the dog and went in and told my wife. She was concerned because I was standing there ghost white. I explained that there is something in the backyard that sounds like a continuous grrrrrrrrr click grrrrrrrrrrr click hnnnnnnn(like the high compression whine when a helicopter lands) and maybe it was some kind of jet propulsion engine or electromagnetic object. She asked if I wanted to go check it and I said, no. It was not bothering me and I was not going to bother it. Just as she began telling me I am crazy, she flicked the light on in the kitchen(the east side of the house) and we heard a dense clang sound like brass symbols crashing but without the reverberating gong. Her eyes widened in disbelief and the light above her head on the ceiling surged power and emitted explosive light 2 feet in every direction nearly consuming the hair on her head. It seemed as though the object was on the southeast side of the house and it ejected or ascended as if it was spooked by the kitchen light coming on. I suspect we were being spied on or analyzed. We went to bed that night somewhat disturbed from the incident. The next morning I was up early to travel. It rained the next day or two and when I got back on Thurs., November 7th I searched for any trace of an object. I found a span of burn marks spanning 8-10 feet wide. In conclusion, I would like to make one other note. Last year around this time (right before the snow came) I had an odd dream that there was an object above my house and something was scanning me. I awoke shaking, hyperventilating, and feeling as though something had been taken from me."],"map":"<A HREF = \"http://maps.google.com/maps?q=43.471747,+-72.977369(52242)&iwloc=A&hl=en\"> mufon case (52242) map </A>"}