{"City":"Atlanta","Country":"United States","Disposition":"Unresolved","Object Shape":"Sphere","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Region":"Georgia","divs":["Sighting DetailsI was on a Delta flight from Tucson to Atlanta. We were descending and making our turn to the NE. About 5000 ft. I was in front of wing, window seat. Right side of aircraft. We started our turn and wing began to rise. I was looking out window almost north at the Chattanooga valley. I leaned into the window to continue to look out window. I saw a sphere solid mass. Looked like aluminum no seams. Reflective surface. About the size of a vw bug. About 500 feet below aircraft. Came from southwest under plane and went to northeast. Beyond wing. It flew in a straight line. we were reducing speed and the sphere appeared to be at a constant speed. I lost site of it after about 30 seconds. I tried to get my wife to move over to see but it was to late. I was excited. I have flown hundreds of times through this area and never seen anything like this. I am a civil engineer and have worked outside and around the country. I am still not sure I saw a alien craft. It was a UFO to me. I am also the son of an Air Force pilot. A was born on an air base and grew up 18 year at or near an air force base. I saw a picture of a UFO in Washington state in 2003 it looked exactly like what I saw. Hope I see another."],"Summary":"Flying into to Atlanta made turn from sw sphere few under aircraft from west to east big as vs bug.","Longitude":"-84.379482","map":"<A HREF = \"http://maps.google.com/maps?q=33.753605,+-84.379482(52255)&iwloc=A&hl=en\"> mufon case (52255) map </A>","files":["/var/www/straped/mufon/html2text/52255.html.txt","/var/www/straped/mufon/org/52255.html"],"Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Case Number":"52255","Date of the Event":"10/30/2010 11:35 UTC","Date Submitted":"11/15/2013 01:35 UTC","Tags":"City","trends":["There have been 95 other sightings in Atlanta","There was one other sighting in Atlanta on or around October 30th 2010"],"Object Features":"None","Log Number":"US-11152013-0003","Latitude":"33.753605","Source":"MUFON"}