{"Longitude":"-74.943038","Viewing Distance":"101-500 Feet","Log Number":"US-11142013-0019","Object Features":"Other","Disposition":"Unresolved","Date Submitted":"11/14/2013 06:30 UTC","divs":["Sighting DetailsI was walking with my friend walking her dog smoking a cigarette in the freezinggg cold. Standing in a field where the entire sky is visible. Not a cloud or ounce of overcast in sight. Light pollution is at a minimum there, as well. At first I heard the humming noise and searched around for what I thought would be a plane. It was not far behind me, coming from the south east. As I started to say, \"Hey, friend check out that pl-\", she said \"Uhhh, wtf isss thatt?\" Even the dog was interested in it more a few seconds, but he has a short attention span, and was way more interested in things he could actually get a hold of here on earth. It didn't fly directly above our heads, and perception of distance without a ruler is difficult for me. However, I'd say it was about three hundred yards to the left, and probably the same in the air. It's shape was an upside down pyramid, with orange blinking lights on each corner that flashed sporadically. The tip of the pyramid, which was facing the ground, was illuminated with orange lights all around about halfway up. The space between those lights and the lights on the three base corners was completely dark, no reflections, just an absence of stars in that space. It traveled at a steady slow speed in the direction of NW. I kept my eyes on it for what felt like forever, probably 2 minutes, as it just got smaller into the distance. It never ascended or descended just sort of vanished. I imagine it shut off the orange lights as it came upon more populated areas, like Washington Twsp. I am a healthy young woman. I have beyond perfect distance vision and was under the influence of nothing, same for my friend. We tried to tell our boyfriends when we got inside, but they were so caught up in GTA5, and think we're both crazy already. Our effort of making them listen and take us seriously seemed futile, so I am reaching out to this community."],"files":["/var/www/straped/mufon/html2text/52251.html.txt","/var/www/straped/mufon/org/52251.html"],"Sighting Duration":"Undisclosed","City":"Buena","Tags":"City","Latitude":"39.565239","Object Shape":"Cone, Triangle, Other","map":"<A HREF = \"http://maps.google.com/maps?q=39.565239,+-74.943038(52251)&iwloc=A&hl=en\"> mufon case (52251) map </A>","Country":"United States","Summary":"upside down pyramid, orange lights, low hum, slow speed.","Region":"New Jersey","Weather Factors":"Unknown","Date of the Event":"11/13/2013 12:00 UTC","Case Number":"52251","Source":"MUFON","trends":["There has been one other sighting in Buena","There were no other sightings in Buena on or around November 13th 2013"],"Object Flight Path":"Stationary"}