{"map":"<A HREF = \"http://maps.google.com/maps?q=34.210588,+-86.610068(52257)&iwloc=A&hl=en\"> mufon case (52257) map </A>","Object Shape":"Blimp, Triangle","files":["/var/www/straped/mufon/html2text/52257.html.txt","/var/www/straped/mufon/org/52257.html"],"City":"Holly Pond","Summary":"spotted light to north east of my location which was 2 miles north of Holly pond on Co Rd 1718","divs":["Sighting DetailsAt around 430 on 18 October 2013 I was pulling on to County Road 1718 headed north when I noticed a curved light that at first I thought was the moon. It was to the North East. I looked too the North West and discovered that the light was not the moon because a near full mine was there in the sky. The object appeared to be moving to the South west I pulled off of the road as the object passed over my car. It appeared to be about 500 feet above me under some low clouds. It was about 60 to 70 feet in length and some what triangle in shape but because it was dark in color a I am not 100% sure. It hah a lot of lights in rows making a square block of lights with a smaller group of lights to the front in a block like shape. The object was silent and moved slowly for an aircraft. The weather was partly cloudy with some patchy ground fog. I estimate the clouds to be less than 700 feet above the surface and the winds were calm. The whole event took place in about 5 to 6 minutes or less. I have never witnessed anything like this before."],"Date Submitted":"11/15/2013 02:21 UTC","Log Number":"US-11152013-0005","trends":["There have been no other sightings in Holly Pond","This sighting has never been favorited."],"Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","Tags":"City","Source":"MUFON","Longitude":"-86.610068","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Case Number":"52257","Latitude":"34.210588","Date of the Event":"10/18/2013 05:30 UTC","Object Features":"Other","Region":"Alabama","Country":"United States"}