{"Date of the Event":"11/15/2013 09:16 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.503209,+-121.425635(52258)&iwloc=A&hl=en\"> mufon case (52258) map </A>","Weather Factors":"Unknown","Latitude":"38.503209","Log Number":"US-11152013-0006","Tags":"City","Disposition":"Unresolved","Case Number":"52258","trends":["There have been 83 other sightings in Sacramento","There were no other sightings in Sacramento on or around November 15th 2013"],"Viewing Distance":"20 Feet or Less","Country":"United States","Source":"MUFON","Region":"California","Longitude":"-121.425635","divs":["Sighting Detailsi had just waken up when i had first seen something in the sky it looked like a black and white sphere (i took a photo at this time) and then it descended towards me extremely quickly and hovered about at necks hight for a min or 2, it was about 4 feet in diameter it began to float to the ground while humming. after it had landed a odd symbol appeared i tryied to take a pic of it at this time but my phone was not working correctly. it made another sound that sounded like talking i couldn't understand it then, then i touched the symbol it was colder than ice the last thing i remember is being pushed by something and then being extremely tired and then i woke up 2 hours later and i cant seem to get these thought out of my mind,there are only 4 there were these small pebbles that were to be inserted into living animals, there were little obsidian ball that exploded and there was seemed like a spherical television that held organs, and the chatter i heard before i can say for certan what exactly it said but i i know it d something to do with human population. during the entire experience i was relatively calm it almost felt like i knew what it was, like an old friend i first belived it to be a childs balloon he had discarded. sombody please see this i think this may be something that needs to be looked into."],"Summary":"first i saw it in the sky then irt came to me i touched it it pushed me back i fell and 2 hours later i wake up with numbers and a strag","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Object Features":"Insignia","Date Submitted":"11/15/2013 03:04 UTC","City":"Sacramento","Object Shape":"Cigar, Sphere","files":["/var/www/straped/mufon/html2text/52258.html.txt","/var/www/straped/mufon/org/52258.html"]}