{"Sighting Duration":"00:01:40","Country":"United States","Log Number":"US-08102006-0006","Latitude":"35.493727","City":"kern county","trends":["There have been no other sightings in kern county","This sighting has never been favorited."],"Date of the Event":"07/19/2006 11:40 UTC","divs":["Sighting DetailsThis all happen in front of my eyes my band went on a tour to livermore,cali i was siting in the passenger seat and my husband was driving my guitar player was awake he would fall asleep then wake up to make sure we were awake. It was around 11:30pm and i was wide awake making sure my husband wouldn't fall asleep on the road. I was looking in the sky at the stars it was so clear that night and i was liseing to music and watching in front of me the rest of the way. I saw something leaving from the ground like how an airplane takes off it was about 100 feet from me not far at all. I was like oh cool airplane i love watching how they take off but then in my head i was like wait we are in the middle of the desert nothing around nothing but dirty and little plants that's when i told my husband look was is that as it was going more up in the sky the lights came on there were blue lights then white lights then that's when it happend it started moving in a circle spinning up sidedown twisting so crazy i was like how is that happening nothing spins like that. My guitar player was like what the hell is that! i was crying out loud i was freaked out my husband almost hit the car next to us i was like drive! the car next to us moved more behind us I'm sure they saw what we did. Then when it was done twisting it was coming towards us the white lights were so bright it was like looking at the car i think and it turned back where it came up from the floor when it first took off when it went back it went so fast! on the ground my guitar player is like its going to crash but it didn't it came back up and just hovered the ground my guitar player got that part of camera we wanted to record the whole thing but we were so scared that we forgot we had a camera. As we were driving away it was still hovering the ground but then we didn't see it after that. We stop to get food i woke everyone else up my bass player,drummer and second guitar player i was like screaming wake up! and we told them and i was crying the whole time and everyone was scared. When we got are food we asked what city is before this we were in bakers field when we got are food he was like Kern county i remember seeing that sign before we saw the UFO and i was telling the guy no after that he was like nothing.... I said nothing?! and the guy said its nothing but dirty and plants its not a county or anything so we thought that was scary. Ive seen other types of UFOs but not like this, i could not understand this one and it was to close in my face that i cant sleep like i use to i freak out thinking what is that did it see me i don't think i will ever understand what it was but its was in between Kern county and Bakersfield."],"files":["/var/www/straped/mufon/html2text/5226.html.txt","/var/www/straped/mufon/org/5226.html"],"Case Number":"5226","Region":"California","Object Shape":"Diamond, Triangle","Weather Factors":"None","Longitude":"-118.85968","Object Features":"Unknown","Source":"MUFON","Date Submitted":"07/19/2006 11:40 UTC","Viewing Distance":"501 Feet - 1 Mile","Summary":"triangle looking with blue and white lights moved very fast","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.493727,+-118.85968(5226)&iwloc=A&hl=en\"> mufon case (5226) map </A>","Object Flight Path":"Hovering then path,Path with directional change","Tags":"City"}