{"Country":"United States","Case Number":"52276","divs":["Sighting DetailsOn November 17, 2013 at approximately 1845, I was checking on a storage unit about 3 miles out on US Hwy 290 West. As I was returning to my vehicle, I happened to look up at the night sky. This was the first night in several nights where it was a clear night sky. I looked back toward 290 West (in a southern direction) and began looking at the stars and various aircraft (mostly small private planes) flying in the area. I'm saying they were small private planes due to the other lights that I could see, such as the green and red blinking lights that accompany the white light. The characteristics of these lights were similar to those of other planes, I have observed in the area. I then observed a single bright white light almost directly overhead. I did not see any other lights attached to the this object such as the green and or red blinking lights one would except to see so that someone could make the assumption that what one was looking at was nothing more that an aircraft. I observed that this bright white object was moving south. From my vantage point the direction the object would have taken would be somewhere between Kerrville and San Antonio. I observed the this bright white object was not descending (falling to the ground) but was traveling at an unknown altitude toward the south. The speed of the object was constant but not fast. I then observed a smaller aircraft off in the distance to the southwest. I could see the faint white light and the accompanying red and green blinking lights on this aircraft. I observed that this plane was flying from west to east. I observed that this plane appeared to be much further off in the distance and close to the horizon. I then looked back up and found the bright white object still overhead and continuing its southern flight. Since I had now observed a plane much further off in the distance with a faint white light and red and green blinking lights, I was now beginning to wonder what this object was that I was observing. I then retrieved my binoculars (10 x 50 fixed) from my vehicle. I located the bright white object through my binoculars and focused. I could not make out any detail of the object but I could also still not see any other lights, red, green, blue, nothing no other lights were accompanying this object. I also noted that the speed of this object was increasing. Before when I first observed the object there was no noticeable increase in speed and my head was only moving slightly but now I noticed that as I was observing this object through my binoculars my head was moving faster as I followed this object. I was even able to see this object pass in front of stars at a fast clip as it continued its southern flight path. Just out of curiosity I lowered my binoculars in an attempt to locate the aircraft I had seen earlier flying from west to east to see how close these two objects were in relation to one another. To my surprise I was able to easily locate the plane still on course from west to east but I could no longer see the bright white object. I searched the night sky for a few more minutes and never located this object again. As bright as this object was I should have been able to easily locate it again with my naked eye as I done in the first place. I know that this object was not a satellite nor was it any type of conventional aircraft that I have seen to date. The total time I observed this object from start to finish was less than 2 minutes. I was the only witness (that I know of) and no photos were taken."],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Latitude":"30.281101","Disposition":"Unresolved","Summary":"Bright white light in the sky","files":["/var/www/straped/mufon/html2text/52276.html.txt","/var/www/straped/mufon/org/52276.html"],"Date of the Event":"11/17/2013 06:45 UTC","Log Number":"US-11182013-0002","Object Shape":"Circle","Object Features":"Unknown","Source":"MUFON","trends":["There have been 6 other sightings in Fredericksburg","There were no other sightings in Fredericksburg on or around November 17th 2013"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=30.281101,+-98.869934(52276)&iwloc=A&hl=en\"> mufon case (52276) map </A>","City":"Fredericksburg","Object Flight Path":"Straight-line path","Region":"Texas","Viewing Distance":"Over One Mile","Longitude":"-98.869934","Date Submitted":"11/18/2013 10:41 UTC"}