{"Region":"Washington","trends":["There have been 41 other sightings in Spokane","There were no other sightings in Spokane on or around September 21st 1996"],"Sighting Duration":"00:05:00","Object Flight Path":"Hovering then path","Case Number":"5227","Tags":"City","Object Shape":"Square, Rectagular","Object Features":"None","Country":"United States","Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"09/21/1996 08:12 UTC","Longitude":"-117.416287","files":["/var/www/straped/mufon/html2text/5227.html.txt","/var/www/straped/mufon/org/5227.html"],"Log Number":"US-08112006-0001","Latitude":"47.6679","map":"<A HREF = \"http://maps.google.com/maps?q=47.6679,+-117.416287(5227)&iwloc=A&hl=en\"> mufon case (5227) map </A>","Date Submitted":"09/21/1996 08:12 UTC","Source":"MUFON","Weather Factors":"None","City":"Spokane","Summary":"Large glowing, bright (almost metallic ) retangular UFO","divs":["Sighting DetailsDates and times are approx. since I don't remember exact dates of either event since it was a long time ago and I tried to forget it. I didn't want to ever admit to what I saw that morning...I was driving to the paint store to meet my boss and pick up supplies...I was driving down the street when I saw a very large craft hovering about 1,000 feet above the ground...approx. 1 mile away....It was very bright and attracted my sight once it came into view in the morning sky...I drove into the parking lot of the paint store and jumped out of my van and ran to the front of the building...my boss and another coworker followed me...floating in the air...making no sound was a craft approx. 200 feet wide...very bright with a very black orb circling the outside center of the craft..All 3 of us couldn't believe our eyes and stood there in amazement, wondering what it was..It floated off due east at a fairly slow pace. We have never talked about it...I haven't seen the other witnesses for years...but when I did bring it up with my boss...he told me to never bring it up again. As far as I could tell..it was of no technolgy that humans posess. I know this may sound crazy...I had another sighting around 1984 while working out by the airport at Geiger heights...I was going home on I-90...it was very early in the morning..when I saw a jet flying fairly low above flying parallel to the freeway and getting ready to land when 3 metallic balls about 6' around came up under the plane and stayed with it til it flew out of site...I pulled over as well as 1 other car...the driver stepped out and said \"Did you see that? What the heck was that?\" I wasn't sure what I saw...But I can tell you...I saw 3 metallic balls fly up under a jet landing at the airport.. Being of rational mind...I can come to the conclusion that what I saw was indeed UFO's"]}