{"Weather Factors":"Unknown","Region":"Texas","Source":"MUFON","Disposition":"Unresolved","Date of the Event":"11/16/2013 11:30 UTC","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Disc, Fireball, Sphere, Unknown","Longitude":"-97.500063","Summary":"BALL OF ORANGE LIGHT ALL AROUND W/ WINGS OR SAUCER TIPS","Sighting Duration":"00:20:00","divs":["Sighting DetailsON SATURDAY AT ABOUT 11:30 PM TO 12:00 MIDNIGHT, I WENT AND SAT ON MY FRONT PORCH TO SMOKE A CIGARETTE.I LOOK UP AT THE SKY.BECAUSE.EARLIER IN THE EVENING A WAS LOOKING AT THE FULL MOON. THEN I SAW WHAT LOOKED LIKE A ROUND BALL OF FIRE.TRAVELING FROM THE SOUTHEAST AS IF IT WERE COMING FROM THE OCEAN.I LIVE JUST OUTSIDE THE CITY LIMITS , SO THERE IS NOT MUCH LIGHTING. WHEN I FIRST SAW IT I COULD NOT EXPLAIN WHAT IT WAS. I STARTED CALLING MY FRIEND TO COME OUTSIDE TO SEE IT.AT THIS TIME, THE OBJECT GOT SO CLOSE BUT WE COULD STILL NOT SEE ANY SHAPE OR FORM,ONLY A BRIGHT BURNING ORANGE LIGHT.THEN IT JUST CUT FROM ITS WEST MOVEMENT TO A NORTHERN PATH WHERE IT ACCELERATED AND IT JUST VANISHED. THEN WE LOOKED OVER WHERE THIS THING CAME FROM AND THERE WAS A SECOND BALL OF FIRE COMING FROM THE SAME DIRECTION AS THE FIRST.WE TOOK OUT OUR CELLPHONES.AND THEY BOTH WERE COMPLETELY TURN OF ,AND WE JUST COULD NOT GET THEM TO TURN ON, TO RECORD ANYTHING. IT TO TOOK THE SAME FLY PATH AS THE FIRST ONE.BUT THIS ONE I COULD SEE WHAT LOOKED LIKE JUST TIPS ON ITS SIDE THEY WERE SILVER METALLIC IN COLOR. I HAVE NEVER SEEN ANYTHING LIKE THIS BEFORE. WE WERE IN SHOCK BECAUSE WE COULD NOT EXPLAIN WHAT WE SAW."],"Date Submitted":"11/17/2013 10:23 UTC","City":"Los Fresnos","Country":"United States","Log Number":"US-11172013-0008","files":["/var/www/straped/mufon/html2text/52274.html.txt","/var/www/straped/mufon/org/52274.html"],"Latitude":"26.060941","Case Number":"52274","map":"<A HREF = \"http://maps.google.com/maps?q=26.060941,+-97.500063(52274)&iwloc=A&hl=en\"> mufon case (52274) map </A>","trends":["There has been one other sighting in Los Fresnos","There were no other sightings in Los Fresnos on or around November 16th 2013"],"Object Flight Path":"Path with directional change","Object Features":"Wings, Unknown","Tags":"City"}