{"Latitude":"37.91646","files":["/var/www/straped/mufon/html2text/52289.html.txt","/var/www/straped/mufon/org/52289.html"],"Object Flight Path":"Stationary,Hovering then path,Path with directional change","Region":"Missouri","Date of the Event":"11/18/2013 06:30 UTC","Weather Factors":"Unknown","Case Number":"52289","Country":"United States","trends":["There have been 2 other sightings in Newburg","There was one other sighting in Newburg on or around November 18th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.91646,+-91.892953(52289)&iwloc=A&hl=en\"> mufon case (52289) map </A>","Object Shape":"Star-like","Tags":"City","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Viewing Distance":"Over 1 Mile, Unknown","Source":"MUFON","Longitude":"-91.892953","Date Submitted":"11/18/2013 09:34 UTC","Log Number":"US-11182013-0015","divs":["sighting detailsat 6:30pm on 11\\18\\2013 i was listening to the scanner. i was tuned to the frequency of 245.100 and heard a lot of traffic. knowing this to be a military aircraft frequency i decided to take a look outside to see if anything was going on in the sky. i noticed a very bright object about 15 degrees above the treetops to the sw of my house. i observed this object move up, down, and sideways several times. it would get really dim then brighten, and repeat the process over and over. it appeared to be hovering or moving in a circle. i noticed a couple of bright flashes coming from this object, the another smaller bright light appeared to the left of it. it did not stay lit, it just flashed and went out. after this happened the larger object descended to treetop level. it again brightened and dimmed several times. it finally went completely out. at almost the same instant the object went out an airplane light started blinking and was heading in the direction of the larger object. this airplane apparently had its lights off until this object went out. the general direction of this object was in the direction of fort leonard wood army base so it could have been a military exercise. i will also mention this activity has been going on since october in my area."],"City":"Newburg","Object Features":"Unknown","Summary":"Bright star like object hovering in SW above treetops"}