{"files":["/var/www/straped/mufon/html2text/5228.html.txt","/var/www/straped/mufon/org/5228.html"],"Region":"Oklahoma","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.346438,+-97.480123(5228)&iwloc=A&hl=en\"> mufon case (5228) map </A>","Date Submitted":"03/17/1991 12:00 UTC","Object Features":"Undisclosed","Weather Factors":"Unknown","trends":["There have been 23 other sightings in Moore","There were no other sightings in Moore on or around March 17th 1991"],"Object Shape":"Unknown","Case Number":"5228","Disposition":"Hoax","Summary":"\"From my back yard windows it was 'Strobing Bright Lights' for an hour or more, but in front windows, was no lights. \"","divs":["Sighting DetailsIt has been many years since the ordeal, but I'll try to recall each moment, the best to my ability. I awoke about 12:50 a.m. I was 17 or 18 years old at the time of the event. I was lying in bed and at first I thought that the strobing lights were an indication that there was a storm on the way. So, I just went back to sleep. An hour later, I woke back up, feeling a little uneasy and queezy. I triied awaking my parents, but they eventually got very upset and scalded me for triing to get them out of bed. I then went throughout our house looking out toward each window, only to find just clouds in the sky, appearing to be over my house. The front living room windows was no lights what-so-ever. But turning my head toward the patio, (even with the shade down) was this strobing light. I was apprehensive to go toward the kitchen and so on. But I kept walking anyway. Our house became colder, the deeper that I walked toward our back den door. I then became chilled, I lifted up the shade to the back door. And the lights were still going. I reached and touched the door knob,and felt chills up my spine. I RAN back through my house (scared half to death) opened my bible, that had not been opened in months. The new book opened right up to Psalm 91. I began reading my bible for the fist time (other than Revelations) every night. I stayed awake for the rest of the night. The next week in my typing class, where my teacher always kept the daily paper. On the front page read: \"Lights reported over Miami Oklahoma\" with a donut shaped cloud photo on the cover. I lived in Moore at the time. I am putting this report in because I hope that someone will remember the event and also, include their story of this happening. Thank You."],"Longitude":"-97.480123","Country":"United States","Source":"MUFON","City":"Moore","Log Number":"US-08112006-0002","Date of the Event":"03/17/1991 12:00 UTC","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Latitude":"35.346438","Tags":"City"}