{"Log Number":"US-11182013-0014","Country":"United States","Region":"New York","files":["/var/www/straped/mufon/html2text/52288.html.txt","/var/www/straped/mufon/org/52288.html"],"Latitude":"43.057901","Summary":"Object was a steady glowing lite with no sound, Ten minutes later saw it leaving as 3 glowing steady lites in a reverse v shape","map":"<A HREF = \"http://maps.google.com/maps?q=43.057901,+-73.702217(52288)&iwloc=A&hl=en\"> mufon case (52288) map </A>","trends":["There have been 6 other sightings in Saratoga Springs","There were no other sightings in Saratoga Springs on or around November 18th 2013"],"Sighting Duration":"00:10:00","Date of the Event":"11/18/2013 05:20 UTC","Source":"MUFON","Case Number":"52288","divs":["Sighting DetailsAt about 5:20 Pm, I went outside to go to my car to have a cigarette. I looked up in the sky across the road which is east of the driveway. I saw an orange glowing light through the trees across the street. It seemed to be moving slowly, but I realized that when planes are coming towards you they seem to move slow. There was no sound like a plane or jet engine would make. I got into my car and turned on the radio on low and smoked my cigarette. When I got out of the car, I looked up in the sky to see if the light was still where I had seen it. It wasn't there, so I looked farther to the north, which is when I saw that the one light I had seen in the beginning had turned into 3 orange yellow lights. They were in an inverted v formation with the middle light a little behind the two side lights. Again they were not blinking and they made no noise. They were well above the tree line but not as far up as some of the usual blinking lights that I see from the planes around here. Truthfully, I thought it must be some kind of new aircraft that I am not aware of. I have never seen a plane with steady orange lights before. And it made no sound whatsoever. So thinking it was just some kind of new aircraft, I went back into the house. Later, when the man I live with came home from a meeting, I asked him what kind of plane has those kind of lights and no sound. He brought up boomerang shaped UFO's. So I Googled it on Yahoo and some Rense site mentioned an increase in sightings of UFO's with orange lights. So I decided to contact you. I really don't know what it was. There is a small airport in a nearby town, so we have all kinds of small planes and jets in the skies at night. I am kind of excited that it could be an alien craft! I have wanted to see a UfO as an adult, since I had seen 3 UFOs in broad daylight and close when I was about 8 or 9 years old. By the way, it was dark tonite when I saw the object with a full moon to the east. It was not moving erratically or suddenly; just a slow easy path!"],"Object Features":"None","Tags":"City","Weather Factors":"Unknown","Object Shape":"Boomerang","City":"Saratoga Springs","Longitude":"-73.702217","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Date Submitted":"11/18/2013 09:18 UTC","Object Flight Path":"Path with directional change"}