{"Object Flight Path":"Straight-line path","Longitude":"-121.604773","Tags":"City","Case Number":"52293","trends":["There have been 10 other sightings in Yuba City","There was one other sighting in Yuba City on or around November 18th 2013"],"Viewing Distance":"501 Feet - 1 Mile","City":"Yuba City","divs":["Sighting DetailsMy 18 year old son and I were closing house for the night and so put the dog out to go to the bathroom. I saw the large orange light through the trees then it moved into a clear area over the uncovered patio. I asked my son several times what it was. We agreed it was an unidentified object but he believed it was much higher in the atmosphere than what I believed I saw. As it went overhead, it appeared to me to be a slowly spinning oval shape with a bright orange light below. He believes it was space junk entering the atmosphere, but it was moving too slowly, almost gently gliding or floating, and there was no trail or tail. He said it burned out when I ran inside to go to the front porch. We looked around the house in the front and back finding no debris. It was a fairly clear night with stars visible and one or two clouds in the distance. There is a nearby air force base that flies drones. This object was about one tenth the size of a full moon."],"Weather Factors":"Unknown","Region":"California","Object Shape":"Oval","map":"<A HREF = \"http://maps.google.com/maps?q=39.084773,+-121.604773(52293)&iwloc=A&hl=en\"> mufon case (52293) map </A>","Object Features":"Appendage(s)","Sighting Duration":"00:00:20","Summary":"Fiery silent slowly spinning oval losing altitude moving south to north. Seen from back porch. Went to front porch to follow but could no longer see it.","Date of the Event":"11/18/2013 09:50 UTC","Latitude":"39.084773","Date Submitted":"11/19/2013 01:42 UTC","files":["/var/www/straped/mufon/html2text/52293.html.txt","/var/www/straped/mufon/org/52293.html"],"Log Number":"US-11192013-0003","Source":"MUFON","Disposition":"Unresolved","Country":"United States"}