{"Disposition":"Unresolved","trends":["There have been 31 other sightings in Winston-Salem","There were no other sightings in Winston-Salem on or around November 17th 2013"],"Weather Factors":"Unknown","Latitude":"36.10587","Object Flight Path":"Straight-line path","Case Number":"52295","files":["/var/www/straped/mufon/html2text/52295.html.txt","/var/www/straped/mufon/org/52295.html"],"Viewing Distance":"Unknown","Country":"United States","Region":"North Carolina","Log Number":"US-11192013-0005","divs":["Sighting DetailsWent out to get my dip out of my truck. It was between 11:30 and 11:45pm. I first noticed the object because of the brightness of the white pulsating light. It was to the southwest of my location. When I first saw it, I knew immediately that it was very strange. I watched it get closer and closer and when it was just about over-head, the white pulsating light got really bright and then very dim. It continued to do this several times before leaving a white streak across the sky from the speed in which it sped off at. It almost looked like a shooting star except I was able to see the streak it left much longer than that of a shooting star. After seeing it, I came inside and looked up a video of the Space Station. In the video, it was moving at a steady pace across the sky. This was definitely not the space station. This object was traveling very slowly up to the point that it started pulsating bright and then dim several times before speeding out of site. Right before it sped out of site, it looked as if the white light went dim and then flashed two times. I cant be sure it did flash two times but this is how it looked to me. My feelings after realizing that it was not the space station was amazing. I even felt a little over-whelmed at what I saw. It made no noise at all. It was raining here about 20 minutes before I went out to my truck so, it was below the cloud cover. Very hard to determine its altitude but, the speed in which it left the white streak behind was mind numbing. Comparing it to anything that we know to fly, nothing could have caught this, nothing."],"Sighting Duration":"Undisclosed","Object Shape":"Sphere","Longitude":"-80.240326","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=36.10587,+-80.240326(52295)&iwloc=A&hl=en\"> mufon case (52295) map </A>","Date of the Event":"11/17/2013 11:43 UTC","Date Submitted":"11/19/2013 02:44 UTC","Source":"MUFON","City":"Winston-Salem","Summary":"Bright White Pulsating Orb","Tags":"City"}