{"Summary":"Observed for over 15 minutes, a Dark metal, larger than an aircraft carrier, right at tree height, Baseball Diamond shaped with lights on the entire circumference.","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=41.330708,+-74.495108(52306)&iwloc=A&hl=en\"> mufon case (52306) map </A>","Date Submitted":"11/19/2013 07:15 UTC","Country":"United States","City":"Westtown","Log Number":"US-11192013-0016","Case Number":"52306","Tags":"City","divs":["Sighting DetailsI was working at a TV commercial film shoot at Dawn Animal agency in Westtown. We were last to wrap the location to head back to the Holiday in in Middletown, about a 20 min drive. There was the truck of Electricians who had left 5 minutes ahead of us. We were a van of other various film crew departments. There were about 10 of us in the van. It was still light out but the sun was getting lower. As we drive on Cty Rd. 12 as we looked out the van window at about 11 o'clock in the sky, there was a pinky orange object that a few of us said at the same time, \"What is that?\" As we drove it was getting closer. At first we could not really make out what it was, but we all agreed it was not a plane or anything else we had ever seen. It slowly got bigger and bigger, and it was getting darker and darker as the sun was setting. We kept looking at it as it was really getting bigger and bigger and we were all freaking out, but at some point the road turns and there was a lot of tree cover so we could not see it. Then at a small turn in the road, there stopped in the middle of the road were the electricians, their truck stopped in the middle of the road and they were out of their truck standing in the middle of the road looking up. We stopped and got out and there above us was this unbelievable enormous ship hovering quietly right at the tree line. The circumference was different colored lights that changed color, but not in a pattern, they just changed colors, pinky orangey bluey, yellowy. We huddled together gazing up for about 5 minutes. and the in a second it pulled away, without a sound and incredibly fast. The electricians told us their truck had stopped. When it was gone, the truck started again. We got to the hotel, told everyone else on the crew - they just thought we were nuts. But it was in the paper the next morning as a crowd in the parking lot of the local supermarket had also seen it. I still talk occasionally a few of my fellow witnesses and we are still freaked out, because it was so completely unmistakably huge, so close and so real. I have told other people in my life and I am afraid it really has had deleterious effect on my credibility. So I just don't tell people anymore, but it has left a huge mark on my life and on how I see our place in the universe, I think in a very good way. It really forces you into a bigger perspective!"],"Object Features":"Dome","Date of the Event":"09/12/1988 12:00 UTC","Region":"New York","Object Shape":"Other","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/52306.html.txt","/var/www/straped/mufon/org/52306.html"],"Longitude":"-74.495108","Sighting Duration":"Undisclosed","Object Flight Path":"Path then hovering","Latitude":"41.330708","Source":"MUFON","Viewing Distance":"20 Feet or Less, 21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","trends":["There has been one other sighting in Westtown","There were no other sightings in Westtown on or around September 12th 1988"]}