{"Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Log Number":"US-11192013-0014","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Case Number":"52304","map":"<A HREF = \"http://maps.google.com/maps?q=41.225056,+-74.027626(52304)&iwloc=A&hl=en\"> mufon case (52304) map </A>","City":"Pomona","divs":["Sighting Details Early Monday morning ,I was still working on my laptop. It was placed directly on my chest as I lay on my bed facing my large Bay window. It had just rained and was particularly dark outside. No moon was showing due to the dense cloud cover. My room was silent and dark and only the faint light of my monitor was dimly lighting the room. At precisely 5:06am a very strong light appeared floating across my window very slowly. Couldn't tell what it was but it was oddly bright flying below the clouds. It was maybe a a mile from me, 650 feet above and at 40 degrees from the horizon. I got up slowly and crossed the room.I have seen 3 strange craft in my life and when I was 6 six very many unusual things have happened to me from: missing time, migraines, chronic nosebleeds and that ever present dark silhouette at night staring over me.That's for another time. So, I went to the window trying not be obvious,and looked at it. It was so bright I couldn't make out the shape entirely,but it was square shaped maybe that of a cross with the external lights being bright white on all ends of the cross and a deep red glowing center that pulsated. It may have been anywhere from 30 ft to 100ft ,hard to tell,but absolutely no sound as it gently drifted in a precise straight line from North to South.I felt a little panicked,and had the urge to follow it. However, it was cold,wet and very late so I just watched it disappear over the forest. I stayed awake until dawn just because of an odd feeling I had that it might return."],"Region":"New York","Date of the Event":"11/18/2013 05:06 UTC","Disposition":"Unresolved","trends":["There has been one other sighting in Pomona","There was one other sighting in Pomona on or around November 18th 2013"],"Date Submitted":"11/19/2013 05:23 UTC","Summary":"4 INTENSE WHITE EXTERIOR LIGHTS AND A CENTRAL RED PULSATING LIGHT,CROSS SHAPED OBJECT MADE NO SOUND ,TRAVERSED SLOWLY","files":["/var/www/straped/mufon/html2text/52304.html.txt","/var/www/straped/mufon/org/52304.html"],"Source":"MUFON","Latitude":"41.225056","Longitude":"-74.027626","Country":"United States","Object Shape":"Cross","Tags":"City","Object Features":"Unknown"}