{"Summary":"SOLID BACK TRIANGLE MOVING LEFT TO RIGHT THEN SHOT STRAIGHT UP MAKING A FINT WOSHING SOUND INTERFERING WITH FLIGHT PATH TO MANCHESTER AIRPORT","City":"Stockport","Weather Factors":"Unknown","Object Features":"None","Longitude":"-2.143067","Case Number":"52316","divs":["Sighting DetailsMY WIFE AND I WERE VISITING MY WIFE PARENTS OVER THE BANK HOLIDAY WEEKEND. ON SATURDAY THE 5TH OF MAY 2012 I WAS SAT OUT IN THE GARDEN AT 103 NANEGREIVE ROAD WATCHING THE PLANES COMING INTO LAND AT THE NEARBY MANCHESTER AIRPORT. WHEN AT APPROX 2015 HRS i SAW A BLACK TRIANGLE MOVE FROM THE EAST TO THE WEST WITH OUT MAKING ANY NOISE THEN IT HOVERED FOR A FEW SECONDS AND THEN SHOT STRAIGHT UP VERY, VERY, FAST ONLY MAKING A LOW WOSHING SOUND. THIS EVENT ONLY LASTED 15 SECONDS. AFTER THE EVENT THE PLANES STOPPED FLYING ON THAT FLIGHT PATH AND THEN 5 MINS LATER STARTED USING A DIFFERENT APPROACH PATH. when I FIRST SAW I THOUGHT AT FIRST IT COULD BE A MILITRY PLANE BUT THEN I REALIZED IT WAS NOT OF THIS WORLD AND EVEN THE STEALTHEST PLANE MAKES A NOISE BUT THERE WAS NO NOISE FROM THIS FLYING OBJECT. THERE WAS NO LIGHTS ON IT AND TO SHOT OF STRAIGHT UP LIKE IT DID IN A BLINK OF AN EYE i DONT KNOW ANY AIRCRAFT THAT CAN DO THAT WITH OUT MAKING ANY NOISE. MY REACTION WAS ONE OF AMAZEMENT THAT I SAW IT. I LIVE ON THE EDGE OF THE COTSWOLDS AND WE DO OCCASIONALLY DO SEE STRANGE LIGHTS AND OBJECTS."],"Latitude":"53.405071","Viewing Distance":"101-500 Feet","Region":"","Date Submitted":"11/20/2013 07:51 UTC","Country":"United Kingdom","files":["/var/www/straped/mufon/html2text/52316.html.txt","/var/www/straped/mufon/org/52316.html"],"Sighting Duration":"Undisclosed","Object Shape":"Triangle","Tags":"City","trends":["There has been one other sighting in Stockport","There were no other sightings in Stockport on or around May 5th 2012"],"Log Number":"GB-11202013-0005","Source":"MUFON","Date of the Event":"05/05/2012 08:15 UTC","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=53.405071,+-2.143067(52316)&iwloc=A&hl=en\"> mufon case (52316) map </A>","Object Flight Path":"Path then hovering"}