{"Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","Weather Factors":"Unknown","Object Shape":"Cylinder, Sphere","Latitude":"30.529902","files":["/var/www/straped/mufon/html2text/52311.html.txt","/var/www/straped/mufon/org/52311.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=30.529902,+-87.897586(52311)&iwloc=A&hl=en\"> mufon case (52311) map </A>","Summary":"My husband and I akways see these pulsating lights in the dark country sky where we live. They move up, down, left,& right. 25% of these sightings change from hovering and pulsating to flying in a path with flasing white lights and a red light on it.","Log Number":"US-11192013-0021","Case Number":"52311","Date of the Event":"11/19/2013 07:00 UTC","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Features":"Other","Date Submitted":"11/19/2013 11:55 UTC","City":"Fairhope","Tags":"City","Longitude":"-87.897586","divs":["Sighting DetailsSince an incident in June, I have been noticing objects in the sky. We live next to the gulf of mexico. We also live in the very dark countryside. We have been noticing these pulsating lights that move for a while. Last week I was a few miles from home sitting in the car and I saw a cigar shaped object fly directly over me. It was flashing white like a strobe light and had red on it; no green. I noticed it flew to a spot that seem close to where we always see these lights from our front porch. Tonight I saw these same lights that seem to be rotating and projecting white red and green but hovering in one spot. Three of these took off like a slow airplane- again flashing white with red lights no green. Two flew right over me and seemto be triangular. I was not able to video tape the flying objects, but I did video tape the orb like objects when the moon was coming up. You can see something fly right above the treeline headed north in front of the moon. You can also see the pulsating lights ascending. There is always a lot of activity almost every night outside my house. It is pretty cool. I have the video but my computer is broken. I can't upload it."],"Region":"Alabama","Country":"United States","Source":"MUFON","trends":["There has been one other sighting in Fairhope","There were no other sightings in Fairhope on or around November 19th 2013"],"Viewing Distance":"Unknown"}