{"Disposition":"Unresolved","Sighting Duration":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/52310.html.txt","/var/www/straped/mufon/org/52310.html"],"Log Number":"CA-11192013-0020","Weather Factors":"Unknown","Date of the Event":"11/19/2013 05:30 UTC","City":"Kingston","Object Flight Path":"Hovering then path","Object Features":"None","Country":"Canada","Longitude":"-76.568793","Case Number":"52310","Latitude":"44.258402","Region":"Ontario","Date Submitted":"11/19/2013 11:32 UTC","Object Shape":"Bullet, Missile, Cigar","map":"<A HREF = \"http://maps.google.com/maps?q=44.258402,+-76.568793(52310)&iwloc=A&hl=en\"> mufon case (52310) map </A>","Summary":"two separate sightings within 45 minutes by two separate witnesses from two ends of the city","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Tags":"City","trends":["There have been 10 other sightings in Kingston","There were no other sightings in Kingston on or around November 19th 2013"],"divs":["Sighting DetailsI work fifteen minutes west of the city of Kingston Ont, the area I work is a low populated sparse buildings and mostly wooded area...while heading home from work approximately 18:20, ten minutes from the west end of the city traveling due east I saw a very, very, very bright area on the ground. There was significant bright white glow towards, around in all directions and into the sky. It surprised me with the amount of light that was emitted from this area, which was approximately one Km (3000 ft) north of the highway I was on, beyond a partially cleared field but just into the woods beyond. I slowed and was taken aback, even shocked, by the brightness. I saw no detail other than the significant amount of light, as whatever was making the glow was hidden in the trees (although light did emit from between the trees as I slowly traveled by. I have traveled this road for years, know the area reasonably well, but never seen anything like that along this stretch of country road. I came home ready to share my strange story when my girlfriend was excited to tell me that while leaving work at 17:25 (approx 55 minutes earlier than my sighting) she had seen something really weird... she left her work (inside the city of Kingston west end) and as she traveled west towards our home (along Princess St- at Gardiners Rd) she witnessed a large, glowing object. She described it as being like a vertical pole, or rocket shape, glowing red as if on fire. The object was hovering a few hundred feet above the ground and slowly moving west, and as she continue to observe the object, it slowly rose in a directly up direction until it went out of her sight. Upon reaching home she could make it out at a higher altitude heading west and up like a rocket, as she described it. The object was large. She was excited to tell me her story, but then was surprised when I then told her of my drive home. Neither of us have ever seen anything of this nature before, and it was very strange that on the same date, same time of day (later and dark) we both 45 minutes apart from opposite ends then see something neither of us can explain. We do live a few km from the city airport, a smaller local airstrip with limited number of flights, but having grown up on a military base I know what we witnessed was not any standard aircraft of any known type. Im a skeptic of UFOs in general, until now that is, however am open to options or explanations of what we may have seen. I really regret that we both had cell phones with cameras, and neither of us thought in the moment to take a picture....I guess we were both a little to excited on what we were seeing."]}