{"Sighting Duration":"00:15:00","Case Number":"52313","Tags":"City","Log Number":"US-11202013-0002","Date Submitted":"11/20/2013 12:39 UTC","Disposition":"Unresolved","Country":"United States","Longitude":"-86.95897","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","trends":["There have been 7 other sightings in West Lafayette","There were no other sightings in West Lafayette on or around November 17th 2013"],"Region":"Indiana","map":"<A HREF = \"http://maps.google.com/maps?q=40.472502,+-86.95897(52313)&iwloc=A&hl=en\"> mufon case (52313) map </A>","Summary":"craft with three lights then craft lit up completely and was gone real fast speed unreal","files":["/var/www/straped/mufon/html2text/52313.html.txt","/var/www/straped/mufon/org/52313.html"],"divs":["Sighting DetailsI was at my telescope checking out the moons craters. stoped to give my eyes a rest\" I rubbed my eyes and looked to the southwest and saw three lights . As it got closer I could see it was one of those triangle people talk about . I ran inside to get my camera but was afraid i'd miss it so grabed my wifes wich was closer and ran back outside. It was on the same corse so I fumbled with the camera to set it and when i looked back up the thing was changing \"\"\" the white lights on the three ends started changeing from white to red to blue and it started over faster and faster till the whole craft lit up\"\"\"\"\" .Well i aimed the camera and brased myself on the porch and snaped one picture . I looked at the photo and back up \" and in a SHOT in left to the east. I've never seen ANYTHING that fast . I've spent a lot of time at the telescope and seen a lot \" some with no explenation BUT NEVER seen anything that close.I felt like it wanted to be seen why else would it be that bright at night??? I'll send the picture with this report . THE PHOTO IS GREAT JUST AS I SAW IT."],"Object Features":"Unknown","Object Shape":"Boomerang, Cone, Chevron, Triangle","City":"West Lafayette","Date of the Event":"11/17/2013 11:30 UTC","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Latitude":"40.472502"}