{"Case Number":"52327","Country":"United States","Date Submitted":"11/20/2013 02:19 UTC","Sighting Duration":"00:09:00","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/52327.html.txt","/var/www/straped/mufon/org/52327.html"],"Weather Factors":"Unknown","divs":["sighting detailsthis report is submitted by iowa mufon field investigator david kreiter in a phone interview, the witness stated that a silent, glowing, amber, cylindrical,object moved from a northeasterly direction to a southwesterly direction at an altitude of about 15 to 20 degree above the horizon. the witness was doing some gardening work at a house that borders the rock river, about five block from her residence, when she noticed the bright glowing amber light in the northeast. after watching the object for a couple of minutes she rang the doorbell of her client so that he could come outside to see the object for himself. they both watched the object for several more minutes as it moved very slowly to the southwest. the object was visible for a total of about nine minutes until it went behind a tree line. she stated that the object's apparent size was nearly as large as her hand at arm's length. the description of the object matched another object she saw on a television program on january 8th 2007. the witness stated that she has had two other sightings during her life-time.\\djk"],"Region":"Illinois","Log Number":"US-11202013-0012","City":"Rockford","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=42.286677,+-89.071436(52327)&iwloc=A&hl=en\"> mufon case (52327) map </A>","Object Flight Path":"Straight-line path","Tags":"City","Latitude":"42.286677","Object Features":"Unknown","Date of the Event":"05/05/2013 08:15 UTC","trends":["There have been 20 other sightings in Rockford","There were no other sightings in Rockford on or around May 5th 2013"],"Summary":"A silent, amber, glowing, cylindrical object moved silently overhead","Object Shape":"Cylinder","Source":"MUFON","Longitude":"-89.071436"}