{"Case Number":"52338","Log Number":"US-11202013-0023","Source":"MUFON","Object Features":"None","trends":["There have been 6 other sightings in Findlay","There were no other sightings in Findlay on or around August 11th 2013"],"Summary":"Was approached by a glowing amber orb at 11pm with two friends. Glowing orb put on a spectacular show.","Date of the Event":"08/11/2013 11:15 UTC","Latitude":"41.05013","Disposition":"Unresolved","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/52338.html.txt","/var/www/straped/mufon/org/52338.html"],"Date Submitted":"11/20/2013 04:50 UTC","Object Shape":"Fireball, Sphere","Country":"United States","Weather Factors":"Unknown","Longitude":"-83.59958","Object Flight Path":"Hovering then path,Path with directional change","Viewing Distance":"101-500 Feet","City":"Findlay","map":"<A HREF = \"http://maps.google.com/maps?q=41.05013,+-83.59958(52338)&iwloc=A&hl=en\"> mufon case (52338) map </A>","Tags":"City","Region":"Ohio","divs":["sighting detailsi was with two friends, and we were at an empty menards parking lot in my city, watching the meteor shower that was supposed to happen those few nights. we were parked facing directly east, sitting on the east side of the lot. there were no lights\\objects obstructing my view at any time. we had noticed the sky was full of planes, and when we bothered to count the blinking lights, it was something like 20-30 flashing lights visible to us in east sky. after about 5 minutes in the lot, my female friend pointed out an orange-ish light to the north-east in the field beside the building. aprox 200 yds away. it was hovering directly off the ground below some power lines, beside a sub-station. after hovering for about 30 seconds, it began moving sw towards the menards building. it slowly rose above the building, and stopped moving, a few feet above the top of the building, no more than 75 yards away from my vehicle. me and my friends were in awe, and the next thing we knew, the objects glow grew in intensity at least tenfold, resembling the sun for roughly 5 seconds, before slowly dimming back to its original amber glow. the object sat there for 3-4 more minutes, and the amber glow spontaneously went out, and the object instantly began rising, moving towards us and up. the glow went away and was replaced by what could best be described as lights that mimic those of a traditional aircraft. 2 blinking lights on the edges of its silhouette (which i could never properly make out even when it flew over) the object flew directly over my sunroof (which i had open) aprox 75-100 yards above my vehicle. i'd say it was round if anything. the only thing that distinguished it from a plane in this form was a bottom central red light, that appeared to sparkle or pulse. this event has changed my life and the lives of my friends. more encounters have happened since, but this was the most profound single experience of my life. -[name removed\\cms\\tg]"]}