{"Source":"MUFON","Disposition":"Insufficient Data","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Tags":"City","Case Number":"5234","Date Submitted":"08/10/1969 11:48 UTC","divs":["sighting detailssome friends and i were standing on my porch, near a creek, and about 1\\2 mile north of soda springs ski hill. the porch faced east and south. it was near midnight. we were talking , when somebody said, \"look at that!\" i looked where they were pointing, which was toward the ski hill. there was a large blimp shaped object flying west to east, over the ridge, at about 200 feet above the ridge. i was approximately 200 feet long and 70-80 feet in diameter. it had a row of lights, or lighted windows, running along the horizontal axis. it was completely silent. as it passed, you could see a glowing tube in the back, going into the rear of the ship, glowing orange. it was apparently part of a propulsion system which may have been cooling off, not in use, or in use operating at a low thrust setting. i am not completely sure, but the windows may have been lights; my initial perception was that i could just barely make out rectangular windows and that there was an inside barely visible through the windows, but the sighting was less that 20 seconds, and then it was receding out of sight to the east. i said, \"let's follow it!\" and 4 of us raced up stairs to my car.(my apartment was down a set of stairs to a lower level above a creek). by the time we got to the car the craft was almost out of sight to the east and we were not able to keep up with it, and lost sight of it after driving only a half mile or so. i am glad we were unable to follow it, in retrospect. after returning to the house, we drew pictures of what we saw, and then showed them to each other. it was pretty enlightening to see the pictures were very similar. there was some discussion of windows or lights, but all saw lights and some saw them as lighted windows. we definately ruled out terrestrial blimps, and agreed we had seen a ufo."],"Object Shape":"Blimp","Weather Factors":"Unknown","trends":["There has been one other sighting in Soda Springs","There were no other sightings in Soda Springs on or around August 10th 1969"],"Summary":"watermelon/blimp shape with light row down central axis","Date of the Event":"08/10/1969 11:48 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.03407,+-123.3099(5234)&iwloc=A&hl=en\"> mufon case (5234) map </A>","Object Flight Path":"Path with directional change","Region":"California","Latitude":"39.03407","Object Features":"Window(s), Other","Sighting Duration":"Undisclosed","Longitude":"-123.3099","files":["/var/www/straped/mufon/html2text/5234.html.txt","/var/www/straped/mufon/org/5234.html"],"City":"Soda Springs","Log Number":"US-08142006-0002"}