{"Region":"Tennessee","divs":["Sighting DetailsI not only have seen these objects I have spoken with them also, they are more stories than I can but on this page if someone would like to archive these events now would be the chance.... there are so many I would have to be jogged back to memory on some of the older events.. but they are the truth they won't answer some questions but they will talk usually about current events my fist event flying object was quarter the size of the moon after three years of research I found it had a speed also of around 100,000 to above the speed of light, I first thought I was looking at a blue moon, till saw the moon in the west, when the object moved north at said speed, I became most interested, it stopped past the earths northern point, paused came back to it's original position, for 30 seconds an left at plus the speed of light in the Andromeda area, it left my field of view. my reaction was three years of research on an off to try figuring what I observed. I later found out that was a small ship do you understand, we are wasting trillions of dollars going into space, if they knew what I do they would understand it's futile and very dangerous, and I'm sure they figured that out, you tell them they better not put that rail- gun in out- space and they don't like that X-47B either, I have seen that craft in this area three times they stopped right over my head one night about tree top level it always had 5 707 jets with it. at that time it was still flat black it is now navy gray...."],"Object Shape":"Cylinder, Sphere, Other, Unknown","Case Number":"52341","Source":"MUFON","Date of the Event":"12/27/1974 12:00 UTC","Latitude":"35.159545","Longitude":"-89.92063","Log Number":"US-11202013-0015","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Other","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet, Unknown","Tags":"City","Country":"United States","Sighting Duration":"Undisclosed","Summary":"Have seen enough that my mom wanted be to right a book, I told her i would, but no one would believe me, before i die, it will be your material","map":"<A HREF = \"http://maps.google.com/maps?q=35.159545,+-89.92063(52341)&iwloc=A&hl=en\"> mufon case (52341) map </A>","City":"Memphis","files":["/var/www/straped/mufon/html2text/52341.html.txt","/var/www/straped/mufon/org/52341.html"],"trends":["There have been 62 other sightings in Memphis","There were no other sightings in Memphis on or around December 27th 1974"],"Date Submitted":"11/20/2013 06:21 UTC","Disposition":"Unresolved","Object Features":"Louvres"}