{"Weather Factors":"Unknown","Log Number":"US-11212013-0002","divs":["sighting details i seen something weird over in galatia on netty green rd and then seen it again over by johnson city by rural route motors kinda. i stopped on netty green and before i could get out the truck it shut the bright lights down. then i was on jc black top over by the place that makes windmills and i made it out the truck with the camera no sooner did my auto focus tune(and you could see lights plainly in screen) i went to hit the button and lights went out and it was small orange, green and red lights. still baffled by it. and no the was no jet or plane sounds.today's date is 11\\20\\13 the other night i'd say the 18th i seen some strange lights in the sky and now tonight it is a topic of one of our local news paper on fb called disclosure newsmagazine monthly. i told no one of this except my gf that was on the phone with me at the time. now it is a multi person report"],"Object Flight Path":"Stationary,Straight-line path","Date Submitted":"11/21/2013 12:30 UTC","Longitude":"-88.604338","Case Number":"52349","Region":"Illinois","City":"Galatia","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/52349.html.txt","/var/www/straped/mufon/org/52349.html"],"Source":"MUFON","Date of the Event":"11/18/2013 12:00 UTC","trends":["There has been one other sighting in Galatia","There were no other sightings in Galatia on or around November 18th 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.839822,+-88.604338(52349)&iwloc=A&hl=en\"> mufon case (52349) map </A>","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Tags":"City","Country":"United States","Disposition":"Unresolved","Object Shape":"Flash, Other, Unknown","Latitude":"37.839822","Object Features":"Unknown","Summary":"Today's date is 11/20/13 The other night I'd say the 18th I seen some strange lights in the sky and now tonight it is a topic of one of our local news paper on FB called Disclosure Newsmagazine Monthly. I told no one but my gf who was on phone"}