{"Longitude":"-73.798456","Date Submitted":"11/20/2013 08:12 UTC","Latitude":"42.532303","Summary":"Glowing hovering light- Approached by two Helicoptors and 2 jets then disappeared","Case Number":"52346","trends":["There have been no other sightings in Selkirk","This sighting has never been favorited."],"Log Number":"US-11202013-0020","Sighting Duration":"Undisclosed","Tags":"City","Object Flight Path":"Stationary","Country":"United States","Source":"MUFON","Region":"New York","Object Shape":"Circle","files":["/var/www/straped/mufon/html2text/52346.html.txt","/var/www/straped/mufon/org/52346.html"],"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.532303,+-73.798456(52346)&iwloc=A&hl=en\"> mufon case (52346) map </A>","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","City":"Selkirk","Weather Factors":"Unknown","divs":["Sighting Details I was at work when my wife was pulling into the rail yard to come and get me. She mentioned at around 5:00pm that she was waiting outside in the truck but is scared because she believes she sees a UFO. I leave work and get in the truck and we begin to pull away when I noticed the light as well. I had her pull over so we could look at it a bit longer. I wanted to make sure it wasn't an airplane or a star or planet visible. After only a few minutes- 2-3 tops= I noticed QTY 2 helicopters s well as 2 jets flying towards where the light is. Close by is a small airport, however there is NEVER this much traffic converging in one location at any given time of the day. As the Helicopters approach the light it slowly begins to fade and then rapidly disappears- (Cloud Cover was OVERHEAD) this thing did not become concealed by clouds. The Helicopters remained in the location for another 15-20 minutes circling the location where the light was. The Jets made two paths through where the light was located and scrambled elsewhere. We continued on out of the railyard and followed Route 32 on our way home- n the Southwest horizon we see the light again- only Orange in color. It was certainly moving as it seemed to keep the pace with our vehicle. At this point we tried to follow (take roads to get us closer) in come the jets flying towards the light again. Moments later the light simply is gone. The light was moving South west to north west- from Vorheesville New york Towards Schenectady New York. Low and Behold there have been sightings of the SAME EXACT THING in Saratoga County at around 5:20-5:30PM - Shortly after the last light disappeared."],"Date of the Event":"11/18/2013 05:00 UTC"}