{"files":["/var/www/straped/mufon/html2text/52344.html.txt","/var/www/straped/mufon/org/52344.html"],"Case Number":"52344","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=34.232126,+-77.94241(52344)&iwloc=A&hl=en\"> mufon case (52344) map </A>","Object Flight Path":"Stationary","Summary":"Very bright object hovered for aprox 2hours,smaller lights lower than main light. Initially I thought it was a helicopter light as I see them often in that direction (nearby hospital transports patients). Yet it cought my attention as it did not move.","Latitude":"34.232126","Longitude":"-77.94241","Date of the Event":"11/20/2013 06:00 UTC","Region":"North Carolina","Object Shape":"Sphere","Country":"United States","Log Number":"US-11202013-0018","trends":["There have been 96 other sightings in Wilmington","There was one other sighting in Wilmington on or around November 20th 2013"],"Weather Factors":"Unknown","Date Submitted":"11/20/2013 07:14 UTC","Disposition":"Unresolved","Tags":"City","Source":"MUFON","City":"Wilmington","Object Features":"Unknown","Sighting Duration":"01:11:00","divs":["Sighting DetailsI was at my kitchen window and noticed a light in the southwestern sky. It was about the same elevation and path where helicopters often fly patients to and from local trauma hospital. I was looking for the chopper and it was then I noted the light was stationary. Much too bright for star. I continued to watch for movement and none noted. I went outside with binoculars and all I could see was very bright light, no sound. Did not seem to waver in position. I briefly saw a smaller and possibly 2 light objects below the larger light. I say perhaps as I convinced myself these were a reflection??when I first noticed the light it was about 6 pm, it is now 7 pm and the light is dimmer an lower in the trees. A helicopter just went by and those lights were as big and bright as the original brightness. I can no longer see the light. It is 7:11 pm"]}