{"Log Number":"CA-11212013-0011","Sighting Duration":"Undisclosed","Disposition":"Unresolved","divs":["Sighting DetailsWe left the landing via boat heading to the cottage and as we were going around the second bend I noticed a bright light in the sky and told my sister who asked \"where\" and I told her we would see it again as we got further out on the river. We did see the light again as we got to the next bend and we stopped the boat and watched the light for a few minutes but after a red light burst in the sky near us we left the area and continued on to the cottage. We observed the light following us and staying parallel to our boat but lost site after we went around another bend on the river. The light appeared again when we got around the last bend to the cottage but it descended behind the treeline and we didn't see it again. After the red light burst in the sky near us my brother in law became nervous and wanted to continue to the cottage. We had a camera but my sister forgot a vital part and we were not able to get any pictures..unfortunately. My sister was excited and my nephew skeptical about the light as he suspected it was only a star. My sister and my nephew did not see the red light that appeared and burst over the land closest to our boat. It was just me and my brother in law who saw the red light. The first light was not a star and the way it followed us was a first for me and also the red light bursting near us. I was not scared or nervous but not sure how I felt about the whole thing..it was a strange experience."],"files":["/var/www/straped/mufon/html2text/52358.html.txt","/var/www/straped/mufon/org/52358.html"],"Case Number":"52358","Region":"Ontario","Object Features":"None","Source":"MUFON","City":"French River","Latitude":"46.059092","Country":"Canada","Tags":"City","Weather Factors":"Unknown","Date of the Event":"09/27/2013 07:45 UTC","Object Flight Path":"Straight-line path","Summary":"light was first observed on the river just before we went around a bend..watched for a few minutes then another light burst in the sky just above and closer to us, we left area via boat and cont. to cottage with first light following us till we lost site.","trends":["There has been one other sighting in French River","There were no other sightings in French River on or around September 27th 2013"],"Viewing Distance":"Unknown","Longitude":"-80.491251","Date Submitted":"11/21/2013 11:47 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=46.059092,+-80.491251(52358)&iwloc=A&hl=en\"> mufon case (52358) map </A>","Object Shape":"Other"}