{"Object Flight Path":"Straight-line path","Object Shape":"Triangle","Object Features":"Unknown","divs":["Sighting DetailsMy husband called me on my cell phone (about 11 pm)I got out of bed and went outside with my dog. I was standing on my porch looking out and noticed what I thought was a star behind some clouds. It got my attention because it was cloudy and I couldn't figure out why it was the only thing visible in the sky. I mentioned to my husband that I was looking at something and that it was getting brighter and I thought that it was strange. Now, I happened to witness a \"February fireball\" event in Weatherford Texas a year or so ago and I had that same feeling of awe and fear about this that I had then and the thing was still pretty far off and moving way slower than the fireball I witnessed back then. In the back of my head I imagined this thing might be a huge meteor coming over head and I have to admit, made me a tad nervous. However, as it got brighter and came even closer - Bright White Light, nearly blinding light and there was a tad of yellow or gold in there, but the white lights is what I mainly saw - then a slight hum. I said \"its got to be a plane, can you hear it?\" to my husband who said \"no, I cant hear anything\" It seemed strange to me somehow, and I don't know if it was the intense light or the weird hum, but I kept my eyes on this object as it grew even closer - the hum growing slightly louder. Now, I asked my husband again \"Do you hear it now? As I began to walk down the step of the porch as this object was pretty close now, flying really low, and I have a large pecan tree in my yard and it was a bit higher than the top of that tree, and I'm not sure how much higher, but it seemed too low for a plane, even for a small plane that has been flying for this amount of distance. He finally said \"yes, I can hear it now\" and then this object is flying overhead, not slow and not fast, just sort of gliding along its path - and I look up and there is this red square, an outline of a square anyways in red light - my first thought was that it looked like an escape hatch or emergency exit type of thing. I looked straight up at this thing and It was shaped like a triangle, but not a pointy long angle triangle - but a blunt, rounded, and stubby triangle. I watched it until it disappeared over the top of my house. I told my husband \" I think I just saw a UFO\" He sort of giggled, and I said \"No, I'm serious\", and then told him that the thing had no wings like a plane should have and the hum was not the sound of a propeller or even like a helicopter , it was a low... but audible hum that my husband could hear on the other end of the phone. I did walk around the side of my house to see if I could get a view of the object from the rear, but I could only hear the hum for a moment or so longer and no longer saw the lights - then it was gone."],"Date of the Event":"11/20/2013 12:00 UTC","Country":"United States","Date Submitted":"11/21/2013 01:49 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.47727,+-97.507928(52353)&iwloc=A&hl=en\"> mufon case (52353) map </A>","Tags":"City","trends":["There have been 78 other sightings in Oklahoma City","There were no other sightings in Oklahoma City on or around November 20th 2013"],"Log Number":"US-11212013-0005","Sighting Duration":"Undisclosed","Source":"MUFON","Viewing Distance":"101-500 Feet","Region":"Oklahoma","Summary":"Bright humming tringle flew over my house","Weather Factors":"Unknown","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/52353.html.txt","/var/www/straped/mufon/org/52353.html"],"Case Number":"52353","Latitude":"35.47727","Longitude":"-97.507928","City":"Oklahoma City"}