{"Longitude":"-99.92121","files":["/var/www/straped/mufon/html2text/52355.html.txt","/var/www/straped/mufon/org/52355.html"],"Weather Factors":"Unknown","Object Flight Path":"Hovering then path","Case Number":"52355","Region":"Oklahoma","map":"<A HREF = \"http://maps.google.com/maps?q=34.688102,+-99.92121(52355)&iwloc=A&hl=en\"> mufon case (52355) map </A>","Latitude":"34.688102","Source":"MUFON","Object Features":"Patterned Surface","Tags":"City","Summary":"Saw flashing in sky. Ran home, got camcorder, object disappeared. Object reappeared in same place about 40 min later. Shot approx. 35 sec. of video. Craft vanished.","Object Shape":"Cylinder","divs":["Sighting Details On Nov. 9, 2012 while walking home I saw a flashing high in the NE sky & thought it was an aircraft but it kept flashing in the same place (unmoving) so I stopped to get a better look & could barely make out a shiny object that was just sitting there flashing very brightly. I got excited & hurried the last block home to get my old camcorder out before it left. I got the camera & hurried out but it wasn't in sight anywhere so I zoomed out & scanned the area for about 20 minutes to no avail. I went back in but kept looking out every few minutes & finally about 20 to 30 minutes later, there it was EXACTLY WHERE IT HAD BEEN. I started filming, zooming in & out to give an idea of how far away the thing was. I was very excited & cursed alot not realizing i was doing so till I watched the video. Embarrassing! Anyway, it was there for 30 seconds or so & suddenly it wasn't. In the video it looks like it shot off to the East but it could have been me moving the camcorder while trying to steady it. It's hard to hold it still while zoomed out over 200X. The object was a large cylindrical shaped thing that seemed to have vertical lines & a raised area on top. It reflected light like a mirror but seemed to change color. Could be caused by the distance & low budget camcorder. A JVC MiniDV 400X digital zoom about 10 yr. old. I downloaded it into my DVD recorder hard drive & burned it onto a few DVDs. It wont play back on the camcorder nor does it record anymore. I still have the original on the miniDV cassette though. Its the sharpest image. The DVDs are okay but need someone with a computer to clean it up some. I started to make this report eariler but was afraid of ridicule. Now that I have two more sightings recently I feel better about it. I also have them on video on my Galaxy S2 here. One cloaks right above me but its only there for 3 seconds. You'll get it also. It's on YouTube on channel Paladone101. \"Accidental UFO\" is the title. Let me know where to go now fellows. Mail you the disc or what? It A LOT better than this one here. I'll send reports on the other videos I sent over the next couple days, okay? Later."],"City":"Hollis","Date Submitted":"11/21/2013 02:48 UTC","trends":["There have been no other sightings in Hollis","This sighting has never been favorited."],"Log Number":"US-11212013-0007","Sighting Duration":"01:00:00","Disposition":"Unresolved","Country":"United States","Viewing Distance":"Over One Mile","Date of the Event":"11/09/2012 05:15 UTC"}