{"Disposition":"IFO","Sighting Duration":"00:02:00","Object Features":"Appendage(s)","Summary":"White, balloon like object with downward, hooked appendage in daylight","Date Submitted":"08/13/2006 11:20 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.320034,+-85.596584(5235)&iwloc=A&hl=en\"> mufon case (5235) map </A>","divs":["Sighting DetailsI was outside this past Sunday morning on my front porch. It was a deep blue, clear morning sky in SE Michigan when I noticed what appeared to be a star shining brightly in the SW horizon above some trees. But as the object was framed by the trees, I noticed that this object was MOVING left to right, then stopping and then accelarating in different directions, moving slightly again and stopping. I then realized that I was witnessing something unusual. I ran into the house and grabbed my camera and video taped the object for about :10 seconds. The object was white, not metallic or silver. Bright white. It also had a very peculiar appendage that jetted out from the bottom. This appendage was clearly hooked and the appendage rotated intermittenly, as if propelling the object. No other way to explain it. A friend commented that it looked like a white cat being hung by it's tail the way the appendage wiggled about (see photo). Weird, I know, but that is what it looked like. The object made no noise, but then again, it was very far off. I would judge that this object were about 15,000 feet up and several miles away. It was not windy at all outside. I have attached 3 photos for your review. In the video I shot, this object moves left to right in a south to north direction, quickly, then abruptly stops, then accelarates off quickly until it gets next to the tree line, from my view, then slowly dissappeared behind the trees out of view. At first I thought this might be a balloon, but it was very, very high and made very deliberate moves, stopping and starting again, with no wobble. Also, the hook like appendage that was moving!!!! Did anyone else see this? Very cool. Thank you..."],"files":["/var/www/straped/mufon/html2text/5235.html.txt","/var/www/straped/mufon/more/5235_submitter_file1__ufo3.jpeg","/var/www/straped/mufon/more/5235_submitter_file2__ufo4.jpeg","/var/www/straped/mufon/more/5235_submitter_file3__ufo7.jpeg","/var/www/straped/mufon/org/5235.html"],"Source":"MUFON","City":"Undisclosed","Object Shape":"Sphere","Tags":"City","Log Number":"US-08142006-0003","Object Flight Path":"Path then hovering","Case Number":"5235","Longitude":"-85.596584","Country":"United States","Region":"Michigan","Weather Factors":"Unknown","trends":[""],"Latitude":"44.320034","Date of the Event":"08/13/2006 11:20 UTC","Viewing Distance":"Over One Mile"}