{"Log Number":"US-08142006-0004","Tags":"City","Case Number":"5236","Date Submitted":"08/13/2006 11:30 UTC","Region":"Georgia","Disposition":"Insufficient Data","Viewing Distance":"Over One Mile","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/5236.html.txt","/var/www/straped/mufon/org/5236.html"],"Object Shape":"Star-like","Summary":"Single light that morphs into line of lights or triangle, then back to a light and speeds away.","Weather Factors":"Unknown","Date of the Event":"08/13/2006 11:30 UTC","Source":"MUFON","City":"Atlanta","Latitude":"33.758925","map":"<A HREF = \"http://maps.google.com/maps?q=33.758925,+-84.386412(5236)&iwloc=A&hl=en\"> mufon case (5236) map </A>","trends":["There have been 95 other sightings in Atlanta","There were no other sightings in Atlanta on or around August 13th 2006"],"Object Features":"Unknown","Country":"United States","divs":["Sighting DetailsI am a sixty year old Marine corps veteran who has watched the skies since I was a teenage Ground Observation Corps volunteer (SKYWATCH). I do not drink nor take drugs which would interfere with my vision. I hesitated for several weeks to report this anamolous phenomenon because sky conditions have not been ideal -- thunderstorms and clouds, not to mention the urban light scatter that makes observations in Atlanta difficult. However this sighting has repeated itself a dozen times in the last few weeks and I felt compelled to report it. In each occurance several hovering lights have been observed out of my bedroom window which faces almost due east. This view looks out on a main air traffic corridor in and out of ATL (Hartsfield-Jackson International) and PDK (Peachtree Dekalb). On these evenings I would observe the normal comings and goings of the aircraft, with their landing lights, wing lights, strobes, etc. and what I observed was obviously not an aircraft. At first I thought they were stars but then I remembered there was a high overcast which covered the stars. I would see one perhaps two lights hovering in position from just above the horizon, perhaps ten degrees, up to almost directly above. On one or two occasions the light would appear just after a flash like a strobe, The lights, which varied from a reddish white to a bluish white, would remain stationary for thirty seconds to five minutes, then would fade and in their place a line of lights would appear, usually canted from the horizontal, like a wing making a turn, or sometimes three tiny red lights would appear in the same spot in the shape of a triangle, equilateral or isocoles, not sure, but sure it was regular. then would morph back into a light and move quickly, probably too quickly for an aircraft, to the northwest or southwest and out of view DIRECTLY ACROSS the flight patterns of two airports. It is extremely difficult to estimate altitude but would not be surprised if they were manuvering over fifty thousand feet. As I mentioned the cloud cover made it difficult to track them completely across the sky but the consistency of the pattern is remarkable. It did not seem to exhibit the flight characteristics of an airplane (unless a Harrier jumpjet which is highly inprobable) or a helicopter or a satellite."],"Longitude":"-84.386412"}