{"Sighting Duration":"07:00:00","City":"Augusta","Region":"Maine","Latitude":"44.316424","files":["/var/www/straped/mufon/html2text/52368.html.txt","/var/www/straped/mufon/org/52368.html"],"Viewing Distance":"Unknown","Summary":"I witnessed this event at my home in Augusta Maine.","Case Number":"52368","Date Submitted":"11/22/2013 12:49 UTC","Disposition":"Unresolved","Object Flight Path":"Unknown","trends":["There have been 7 other sightings in Augusta","There were no other sightings in Augusta on or around November 22nd 2013"],"Tags":"City","Log Number":"US-11222013-0002","Date of the Event":"11/22/2013 05:00 UTC","Country":"United States","Object Shape":"Triangle","Object Features":"None","Weather Factors":"Unknown","Longitude":"-69.7738","divs":["Sighting DetailsI have been noticing an object in the sky that was never there before about a week ago on Tuesday the 12th of November. Every night since then I have observed this same object in the sky anywhere from 4 in the afternoon til midnight. It blinks,flashes and changes it's light from green to blue to red to purple it seems in an endless cycle ( note I didn't notice a distinct pattern). They seemed to blink and flash randomly. I've observed the object at all kinds of different points in the sky east, north. south etc. Tonight (Novemeber 21 2013) it appeared to be very close to the Augusta Airport if not directly over it. Also I saw many other aircraft tonight airplanes and what i think were jets. The jets seemed to have some interest in the object flying very close to it a number of times. I could tell the difference between the planes and the jets because of the lights on the planes and the vast difference in speed of the jets. I could also see the end trail of the jets because the brightness of the moon. I pay very close attention to the sky directly outside my house and see many many types of planes,helicopters and jest that fly by on a regular basis and was none of the previously mentioned. I also know the shape and color of the lights because I used my H60 lens on my telescope to get a very close up look of the object, although it was not possible to get an accurate asessment of size and distance."],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=44.316424,+-69.7738(52368)&iwloc=A&hl=en\"> mufon case (52368) map </A>"}