{"trends":["There have been 68 other sightings in Eugene","There were no other sightings in Eugene on or around November 21st 2013","This sighting has never been favorited.",""],"Disposition":"Unresolved","Summary":"Light in SW sky during dusk as I was driving down W 11th. Eugene Oregon","Country":"United States","Date Submitted":"11/21/2013 11:10 UTC","Case Number":"52365","Date of the Event":"11/21/2013 05:35 UTC","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/52365.html.txt","/var/www/straped/mufon/more/52365_submitter_file1__IMGP3777.jpg","/var/www/straped/mufon/org/52365.html"],"Tags":"City","Log Number":"US-11212013-0018","Latitude":"44.040216","map":"<A HREF = \"http://maps.google.com/maps?q=44.040216,+-123.110839(52365)&iwloc=A&hl=en\"> mufon case (52365) map </A>","Object Flight Path":"Stationary","Region":"Oregon","Longitude":"-123.110839","Weather Factors":"Unknown","divs":["Sighting DetailsDriving down w 11th Ave in Eugene Oregon I noticed a bright light in the SW sky. It was at dusk and this was the only light in the sky. I was at the light at 11th and City View St. when I first noticed the object. I thought it did not look like a airplane as it did not seem to move in the sky. I did not notice any flashing lights on the object. The object appeared as a glowing white light with what appeared to be some sort of structure below the glowing white light. I was only paying attention to the object at the various red lights as I was driving. At the light at w 11th and Oak Patch I saw a flashing light as part of the glowing object, so I thought it must be a airplane. As driving down road glanced at glowing object and noticed the flashing light was falling away from larger glowing object. I almost crashed my vehicle. I paid attention to the road, pulled into the gas station at the Fred Meyers at 11th and Seneca. I had fuel put in my vehicle, and as I was having the fuel put in my vehicle, I continued to observe the light in the sky. While watching the object at the gas station I did not observe any change in the light. It was about 30 degrees from the horizon while I was watching from the gas station. I drove home from the gas station. I kept track of the object as I drove home. It was dark out now and I could start to see stars in the sky now. I pulled in my driveway, went in my house, got my dslr camera put on my 70-300 lens with a 1.5 multiplyer. I took one frame of the light from my yard at this point the light was a on the horizon as there is a hill to the south of my house. As I was setting up the camera on the tripod a helicopter went by to the north of my house. The object was not a helicopter. I was clearly able to see the red and green marker lights on the helicopter that I did not notice on the object that I am reporting. It was freezing outside so I did not stay outside much longer."],"Object Features":"Unknown","Object Shape":"Unknown","Source":"MUFON","City":"Eugene","Sighting Duration":"Undisclosed"}