{"divs":["Sighting DetailsWe were visiting our former home in a private neighborhood in the outskirts of Buenos Aires in the area of Los Polvorines. I believe there is some Argentine military aircraft facilities in the area. I am writing now because in telling the story to my teenage daughter I felt so disturbed that I never shared it and that somehow my memory of it was erased for a time. My husband and I had walked to dinner two blocks away. The area was quiet and dark, families in their homes, little or no movement in the street. After dinner, walking back home, we crossed the two blocks and nearing our tree-lined street, suddenly saw a large disc-shaped object with lights that lit up and turned off, going around its circular edge in a flow pattern. It reminded me of the spaceship from Lost in Space. It was absolutely silent and I remember standing there as the giant disc silently slipped above us across the sky without any seeming hurry or speed and disappeared beyond the trees in the direction from which we had come. While I think this is amazing, I am writing this because what I find most disturbing is that I went home that night. My husband and I did not talk about it at all. I did not call anyone. I simply went on with life as if it had never happened and I don't know what triggered the memory or exactly how long later it occured, but only later did I remember everything. My husband says he remembers seeing something but can't say what it was, or if it was anything unusual. Now, I must share that my uncle Robert Bletchman was very involved in Mufon, and my parents in APRO in Arizona. I know loads about UFOs and that the best thing is not to have too much to do with them! I also know how to describe sightings and know how important having seen this would have been to my parents and to my uncle, who was alive and well at the time. If under any normal circumstance this were to happen to me, the first thing I would do is run, not walk, home and call both parties! I would tell them all about it. I would tell others. Yet, I walked calmly home with my husband and went to bed. And FORGOT about it. Its absurd. Absolutely and totally absurd. Its not me, or how I would have acted. Yet I did. And that is what still bothers me today. I just looked up the idea of memory loss and saw others had experienced the same problem, so I thought I ought to FINALLY, fifteen years later, report mine. Once I remembered it, I recalled and still recall it as if it was yesterday. I hope, although its late, this helps somehow."],"map":"<A HREF = \"http://maps.google.com/maps?q=-34.602373,+-58.376023(52360)&iwloc=A&hl=en\"> mufon case (52360) map </A>","Region":"","Log Number":"AR-11212013-0013","Case Number":"52360","Longitude":"-58.376023","Country":"Argentina","Latitude":"-34.602373","City":"Buenos Aires","trends":["There have been 20 other sightings in Buenos Aires","There were no other sightings in Buenos Aires on or around October 20th 1998"],"Summary":"Large disc with exterior lights that lit up around it in circular pattern flew directly above us. It made no noise. We completely forgot for some time.","files":["/var/www/straped/mufon/html2text/52360.html.txt","/var/www/straped/mufon/org/52360.html"],"Tags":"City","Object Shape":"Circle, Disc","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","Date of the Event":"10/20/1998 12:00 UTC","Date Submitted":"11/21/2013 02:06 UTC","Disposition":"Unresolved","Viewing Distance":"101-500 Feet","Object Features":"None"}