{"Latitude":"39.363384","City":"Nottingham","Region":"Maryland","trends":["There have been no other sightings in Nottingham","This sighting has never been favorited."],"Weather Factors":"Unknown","Country":"United States","divs":["Sighting DetailsIt was dark, around 9:15 p.m. on Friday, November 8th. My husband glanced out the back door, and saw 3 bright orange lights in the sky that were flying towards our house from the West, heading East. He exclaimed \"What's that?\", so I looked out too, and saw 3 lights forming a triangle. They moved at a decent, steady pace (not too fast), and stayed the same distance from each other as they flew over the house. We ran through the house so we could watch them pass over the front of the house. My brother-in-law joined us outside as well. They continued on the same path, and were followed by 3 (or 4) more single orange lights, one after the other following in the same direction, about the same speed. As they headed east, they flickered a little and quickly disappeared. No noise, no smoke or trail followed them. There were many people at the high school in the vicinity, and lots of people out shopping at local malls, etc. I posted an inquiry on our local Patch page, and also the local television station's site, asking if anyone else saw them. No one reported seeing anything at all. Don't know what to make of this, we are puzzled."],"Summary":"Orange-ish lights flew over my house from the West heading East","Disposition":"Unresolved","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Longitude":"-76.451775","Tags":"City","Log Number":"US-11212013-0017","map":"<A HREF = \"http://maps.google.com/maps?q=39.363384,+-76.451775(52364)&iwloc=A&hl=en\"> mufon case (52364) map </A>","Object Features":"None","files":["/var/www/straped/mufon/html2text/52364.html.txt","/var/www/straped/mufon/org/52364.html"],"Case Number":"52364","Source":"MUFON","Date Submitted":"11/21/2013 10:16 UTC","Date of the Event":"11/08/2013 09:15 UTC","Object Shape":"Fireball, Star-like"}