{"Latitude":"46.404869","Tags":"City","Object Flight Path":"Other","Longitude":"-116.993599","Log Number":"US-11212013-0014","Date of the Event":"06/01/1969 11:01 UTC","divs":["Sighting DetailsHello, my name is Chad. I am 41 years old and live in Washington State. Between the ages of 7-9 I was staying with my uncle, his wife and my two cousins. For some evening entertainment my uncle decided to bring out his 8MM home movie projector. During a brief moment in the film my uncle pointed out something my father had filmed in the sky while making chicken deliveries to rural locations In Idaho (not sure that part is relevant). I must stop for a moment here and point out that I have spoken to my father in great detail about this event. However, if needed I can make arrangements so a MUFON investigator can speak to my father or my uncle. My father first spotted the object to his right from inside the cab. The object got his attention enough to make him stop the truck immediately and start filming. The camera my father had with him belonged to my uncle. My uncle had loaned it to him, so I guess my dad got lucky. It's important to note that this is not the best footage of all time. However, I will tell you what I have seen on film. First though I must state my reason for coming to MUFON. I am here to respectfully request help in this matter. Also, I am humbly seeking resources to discover or at least try and understand what this object might have been. I seek NO FAME, MONEY AND I DO NOT WANT A BUNCH OF ATTENTION FROM ALL OF THIS. However, this footage has never been seen by the general public and has remained within our family for over forty years. I have tried to forward the footage and work with some other folk's but have found the act of pulling teeth to be more fun. Okay, so enough of that. The film is about :06 long. After speaking with my father and seeing the film this is what I know. The object was heading North. It was white and cigar shaped and appeared to be tumbling end over end in a slow manner (like a big stick being thrown for a dog). The odd thing is the object stays or appears to stay on a straight trajectory. The object maintained it's course just above some dry, grassy rolling hills. There is farm equipment and a structure in the film that may help in determining it's distance and size. When my uncle had the film converted from 8MM to DVD he was able to create four different presentations with some very limited photo software. The first is of the original footage. The second is a still shot but a little more close up. The third and fourth presentations are slide shows. IT'S IMPORTANT TO NOTE: if you watch closely and click the slide show's at a consistent speed you should be able to see the object tumbling end over end. For the record my uncle still has the original 8MM film. I will try and attach all four presentations below. If I am not successful, PLEASE, get in contact with me so I can e-mail them too you directly. I apologize for this statement's length. The biggest reason I am pursuing this is because seeing that object at a young age left an impression on me my entire life. I never forgot what I saw that night we all gathered to watch home movies. Finally, a few years back I decided to ask my uncle about the film. Prior to this we had never spoken about it since I saw the footage as a kid. He was happy and shocked that I remembered the footage. In short, here I am now, over thirty years later, trying to seek help in identifying the object. On a final note I must state that this footage is old, limited and really needs attention from modern technology. Surely stuff I don't have. I will say this, the more you study it the more you see. I have promised myself to keep an open mind. I have no ego, but all I ask is a good, honest effort be placed into this opportunity. Enjoy and thank you in advance for any help you can lend in an attempt to solve this matter. C. Jerald, Washington State"],"trends":["There have been 4 other sightings in Lewiston","There were no other sightings in Lewiston on or around June 1st 1969"],"files":["/var/www/straped/mufon/html2text/52361.html.txt","/var/www/straped/mufon/org/52361.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=46.404869,+-116.993599(52361)&iwloc=A&hl=en\"> mufon case (52361) map </A>","Date Submitted":"11/21/2013 03:18 UTC","Viewing Distance":"Unknown","Source":"MUFON","City":"Lewiston","Case Number":"52361","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Shape":"Bullet, Missile, Cigar, Cylinder","Disposition":"Unresolved","Object Features":"Unknown","Summary":"A white, cigar shaped object was spotted above rolling hills by my father in the late 60's. He was able to stop the vehicle he was driving and film it with a 8mm Camera.","Country":"United States","Region":"Idaho"}