{"Weather Factors":"Unknown","Date Submitted":"11/22/2013 04:52 UTC","Source":"MUFON","Object Shape":"Star-like","trends":["There have been no other sightings in Guysborough","This sighting has been favorited 1 time."],"Case Number":"52371","files":["/var/www/straped/mufon/html2text/52371.html.txt","/var/www/straped/mufon/org/52371.html"],"Longitude":"-61.826244","Latitude":"45.28732","Viewing Distance":"Unknown","Summary":"U.F.O. Appears to turn into a plane","Log Number":"CA-11222013-0005","Tags":"City","City":"Guysborough","Disposition":"Unresolved","Object Flight Path":"Stationary,Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=45.28732,+-61.826244(52371)&iwloc=A&hl=en\"> mufon case (52371) map </A>","Country":"Canada","Region":"Nova Scotia","Object Features":"Unknown","Sighting Duration":"00:03:00","divs":["Sighting Detailsa few weeks ago, my husband and I had been outside, smoking and looking up at the sky as we often do. We had been noticing this rather bright light in the sky, orange in color, resembling what I would think is a large star. I assumed and told my husband it's probably Mars, but I really had no clue. Around this \"large star\" we could see a lot of activity, a small red light, and a few other things that kept us looking in that direction. After about 7 minutes, the large orange star began to move, toward us, but remaining overhead, and as it traveled the light went from a single orange light to looking almost identical to a plane's lights, and transitioning between the light pattern, the now 3 lights seemed to spin in a circle, in what my husband describes as \"some one trying to get the lights right\". This light comes and goes, for example...we bought a telescope in an attempt to get a better look, at 6pm, i tell my husband we have to eat before we can go out, and it was still in the sky at that time, by 7 pm, it was gone, other stars were still out, but this brightest light had gone. Almost as if it knew we were preparing ourselves for a look. I also noticed a few nights ago that the trees across the river we're lit up from this light, looked similar to light reflected by the moon, except less, smaller. One last note, a few days before we saw the u.f.o. take flight, 2 black unmarked helicopters flew very fast and very low, directly over our house...I don't think this had anything to do with the incident, but may possibly be relevant. This scared me when i first saw it, and still does when i think about it, or see the light it casts on the house across the river, at this point i just try and ignore it"],"Date of the Event":"10/25/2013 08:00 UTC"}