{"Country":"United States","Summary":"2 objects, blinking in synchronization. Moving up and down but not forward. Lights were in sequence.","Latitude":"30.229215","Log Number":"US-08142006-0005","Object Shape":"Star-like, Other, Unknown","Tags":"City","Weather Factors":"Unknown","divs":["Sighting DetailsI was taking my little dog outside for her nightly bathroom break. I was looking at the sky while my dog did her business because there was a meteor shower. I noticed what I thought was a plane with the blinking lights. I watched it, waiting for it to move on. But as I was watching it didnt move forward but instead moved directly upward, then moved back down. Then it looked almost like it rocked side to side, all the while the lights are flashing in some kind of pattern. They would blink fast, in white, then redish tone, then maybe a blue, hard to see. My sister came outside and I told her to bring in our dog & come see this in the sky. She was also shocked by the unforward movement, we both just stared for a while. It moved up, then down, then almost side to side. About half an hour later, 3 other people (a friend & 2 relatives) decided to come see what we were doing. All of us were at a loss as to what this was in the sky. The pattern remained the same. We all decided to get in our cars and go to a boat launch nearby to see if we could get a better view. When we arrived, we soon noticed that there were 2 objects, doing the exact same thing. Hovering, almost, then moving up and down. We then noticed that when one would blink in a rapid pattern the other would blink normally, and vice versa. After another 1 hour, hour and a half they began to ascend upwards, sometimes in a fast shot to another spot. They slowly began to become hard to see so we decided to hear home. About 2 hours later we walked our friend to her car and walked out to the street to see if the lights were still there, but they were both gone. We repeatedly tried to take pictures but it was so dark that nothing came out. Personally, I am stumped and shocked by what I saw. I am not a person who believes in anything until I see proof. I didn't really believe that aliens visited us, though I know we are not alone in the universe. But I am seriously reconsidering my thoughts. I cannot say for sure, but there was something unexplainable in the sky. 5 of us saw it."],"Date of the Event":"08/12/2006 09:30 UTC","Region":"Louisiana","Disposition":"IFO","Date Submitted":"08/12/2006 09:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=30.229215,+-93.207976(5237)&iwloc=A&hl=en\"> mufon case (5237) map </A>","Longitude":"-93.207976","trends":["There have been 16 other sightings in Lake Charles","There were no other sightings in Lake Charles on or around August 12th 2006"],"Source":"MUFON","Case Number":"5237","City":"Lake Charles","Object Flight Path":"Stationary,Hovering then path,Path with directional change","files":["/var/www/straped/mufon/html2text/5237.html.txt","/var/www/straped/mufon/org/5237.html"],"Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Object Features":"Unknown"}