{"Summary":"We witnessed it as it slowly flew toward us, and then overhead as it passed over us.","Country":"United States","Object Shape":"Boomerang, Chevron, Triangle","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Log Number":"US-11222013-0007","Tags":"City","Object Features":"Patterned Surface","Weather Factors":"Unknown","Latitude":"38.909651","Region":"Washington","Sighting Duration":"Undisclosed","City":"Washington","map":"<A HREF = \"http://maps.google.com/maps?q=38.909651,+-77.031514(52373)&iwloc=A&hl=en\"> mufon case (52373) map </A>","divs":["Sighting DetailsWow... seriously, you won't believe this, but as we were going to Yakima tonight to do some shopping - we saw a UFO! it was 8:29 PM, and my daughter, me, and my son were driving on I-82 toward Yakima, WA and just as we were nearing the Wapato Exit, my daughter said \"Dad, UFO!\" and I looked up just in time to see a wing shaped craft, sort of a smudgy Greyish color with a small red and blue light on it. It seemed as if we were driving faster than this 'UFO' was coming toward us. It was only about 25 - 30 feet over our car as we passed under it, and as I turned to watch it go behind us...it was gone! I couldn't see it anymore. When it passed over us it did not make a sound, and as slow as it was going, and as large as it was - it was wider than the four lane highway we were driving on. Later, I thought how could it stay in the sky and move so slowly and quietly? You see something like this, so unexpected... why was it here? Where was it going, and where did it come from....?"],"Date Submitted":"11/22/2013 09:37 UTC","Date of the Event":"11/21/2013 08:29 UTC","trends":["There have been 82 other sightings in Washington","There were no other sightings in Washington on or around November 21st 2013"],"Viewing Distance":"21-100 Feet","Longitude":"-77.031514","files":["/var/www/straped/mufon/html2text/52373.html.txt","/var/www/straped/mufon/org/52373.html"],"Case Number":"52373","Source":"MUFON"}