{"Latitude":"39.197154","Date Submitted":"11/23/2013 12:22 UTC","trends":["There have been 5 other sightings in Hillsboro","There were no other sightings in Hillsboro on or around November 18th 2013"],"Country":"United States","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path,Path then hovering","Object Features":"Other","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=39.197154,+-83.677113(52382)&iwloc=A&hl=en\"> mufon case (52382) map </A>","Longitude":"-83.677113","Case Number":"52382","Tags":"City","Summary":"UFO'S IN THIS AREA SINCE SEPT AFTER THE METEROR","Object Shape":"Circle, Star-like, Other","files":["/var/www/straped/mufon/html2text/52382.html.txt","/var/www/straped/mufon/org/52382.html"],"City":"Hillsboro","Source":"MUFON","divs":["Sighting DetailsMy daughter and I have been seeing these ufo's every night except on cloudy nights since the meteor came down here on Sept. 27 2013. I'm not sure if that is the correct date or not for the when the meteor came down near here. They at first look like a star or airplane. But after watching them they hover and then move up or down and then fly across the sky.There are more then one, in photos I have taken there are up to 10 or more.In the photos they sometimes look like orbs connected together. I also took a video, in the video it was circle shaped and looked like it was spinning. It changed from yellow, to blue, to red,to green and orange and stayed in the same spot. We both have seen lights in the woods not far from our house. We walked to the woods where we saw the lights and took photos which had several orbs in them.The photos showed a very bright blue orb, a green orb and a pale white one. I have seen bright orange and yellow type orbs in the woods from photos I took on my deck during the day. We have several photos of the ufo's and orbs. This has been going on since we first noticed it after the meteor. It is confusing to me because in my photos the ufo's have different shapes it seems each time we take a photo. I know it is not an airplane or anything like that because we have seen several at a time and a bunch in the photo's . We have seen one large white light which looks like a satellite but there were several of smaller ufo's flying around the large white light.I know it has kind of upset my life because I keep checking the woods and sky taking picture to try and find some sort of understanding or answer for whats going on .I'm only going to send two photos of some that I zoomed in, lightened and cropped because I think they be worth something."],"Log Number":"US-11232013-0001","Region":"Ohio","Weather Factors":"Unknown","Date of the Event":"11/18/2013 12:00 UTC"}