{"Longitude":"145.140354","files":["/var/www/straped/mufon/html2text/52396.html.txt","/var/www/straped/mufon/org/52396.html"],"Object Shape":"Cylinder","Weather Factors":"Unknown","Tags":"City","Source":"MUFON","Date Submitted":"11/24/2013 01:53 UTC","trends":["There have been 40 other sightings in Melbourne","There were no other sightings in Melbourne on or around October 14th 1958"],"Region":"Victoria","Summary":"stationary dull white cylinder with distinct hemispherical ends, at great height, seen multiple times","City":"Melbourne","map":"<A HREF = \"http://maps.google.com/maps?q=-37.810351,+145.140354(52396)&iwloc=A&hl=en\"> mufon case (52396) map </A>","Object Flight Path":"Stationary","Case Number":"52396","divs":["Sighting DetailsI was 15 in 1958, and had absolutely no exposure to UFO stories. Object was sighted at great height, above a spotted lower layer of small clouds, image was very clear and distinct. I was working in a farm building, and initially noticed object while walking outside for a brief break from tedious work. Checked again, perhaps four times over an hour or so, object still visible and very much stationary. Was later distracted by work, and forgot the sightings, so did not see any change or movement. Object was clearly a very long cylinder, milky white, with perfectly hemispherical ends, oriented approximately E-W, but no other discernible features. My estimate is that this object was at least 100 feet in diameter, and 1200 feet long, or possibly much larger, as there was no other object useable as a reference. Many years later, was astonished to read a UFO book on historical recorded sightings, and this identical object was reported as the most common sighted object, over 3000 being recorded as at printing of the book. With zero knowledge of UFO sightings, I was totally mystified for many years, until reading the referenced book. Have since read Allen Hynek and many other authors. Even as a young [ uninitiated ] high school student, and later a degreed civil engineer, my absolute conviction was and is that this very large object was a machine, capable of indefinite hovering at great height, with a total absence of features other than its very distinct and clear external shape and milky white colour. As my knowledge of UFO sightings increased, I have long had absolutely no doubt that such phenomena are real and common, and am hostile to any authority actively keeping knowledge from the people who pay all the bills - the public."],"Latitude":"-37.810351","Disposition":"Unresolved","Log Number":"AU-11242013-0001","Object Features":"None","Sighting Duration":"Undisclosed","Country":"Australia","Viewing Distance":"Over One Mile","Date of the Event":"10/14/1958 12:00 UTC"}