{"Longitude":"-75.034611","Date of the Event":"06/15/1970 08:59 UTC","Log Number":"US-11232013-0009","Tags":"City","Date Submitted":"11/23/2013 06:51 UTC","Object Features":"Patterned Surface","Case Number":"52390","divs":["Sighting DetailsI was 13 years old and with several cousins and friends. We were playing hide and seek at my Aunt Dot`s house just down the street from where I lived. We had been playing from the time it got dark outside. So I`m guessing about the time it happened but maybe between 8pm and 9pm. It could have been later but we were always in the house by 10pm. Anyhow I decided to hide in a field that was grown up with weeds, that was right behind my Aunts house. I walked into the field maybe 30 to 50 feet and laid down in the soft weeds on my back so no one could see me. I could hear the other kids talking but not very good. As I lay there I noticed a object way off in the distance. It was very small. If I had held out my hand to measure it, it would have been about the size of my pinky nail. As I watching it suddenly came to stop directly over me in a split second. It moved so quick that I did`t see it actually move from where it was to where it stopped. I laid there looking at it and remember like it just happened today. I did`t feel afraid at all but just felt mesmerized by what it was doing. I know it was only about 300ft above me because it was so easy to see. It was round looking at it from the bottom but I know it was saucer shaped from what I saw when it left but I`ll get to that in a moment.It did not make any sound at all. It was mostly metllic in color and had several lights that were in rings \" one inside the other\" There were 5 rings and each ring had maybe 20 to 30 lightshapes in it that were changing color, size and shape as they moved around the ring. The lightshapes within each ring was moving in a different direction than the other rings.Each lightshape was not a clear square or triangle or oval or other shape. Each lightshape was dark in color and did not light up the ground where I was. I remember thinking it was beautiful. It only stayed there like that for around 30 to 45 seconds or perhaps a minute. Then suddenly as it came, it left. I remember it leaving just a short blurr of itself going in the direction it came from but could not see it disappear into the distance. Within the blurr I saw a side view of a saucer shape. The blurr it left was about 100 to 300ft long.I ask the other kids if they saw it but no one did. I could not believe they did`t see it. If one of them did then they never admitted it. This was my first sighting of three in my life. I have been telling others about it my whole life. My next 2 sightings there were witnesses but that`s another memory."],"Sighting Duration":"00:01:00","Viewing Distance":"101-500 Feet","Disposition":"Unresolved","City":"Commercial Township","Weather Factors":"Unknown","Object Shape":"Circle, Disc","Source":"MUFON","Latitude":"39.24697","trends":["There have been no other sightings in Commercial Township","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.24697,+-75.034611(52390)&iwloc=A&hl=en\"> mufon case (52390) map </A>","Country":"United States","Region":"New Jersey","Summary":"It came from a far distance and hovered then left in the same direction it came from.","files":["/var/www/straped/mufon/html2text/52390.html.txt","/var/www/straped/mufon/org/52390.html"],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering"}