{"Date Submitted":"11/23/2013 09:14 UTC","Longitude":"-94.625451","Region":"Texas","Case Number":"52393","Source":"MUFON","divs":["sighting detailsi was taking my dogs outside. we were out there fot about 10 min. after about 5 mins i went to sit down in my chair & i happened to look toward my neighbor's house and just about 3 houses down above the treeline wete these bright lights. brighter than any spotlights i've ever seen moving in a circular rotation type pattern. there was no sound what so ever. this object looked like it was heading toward the longview airport\\ kilgore, tx area. i live only a few miles from the longview airport so i see & hear airplanes & helicopters. this object was neither of these. after about a minute the object went out of my sight. i sat there thinking oh my god what did i just see. i got up & went into the yard trying to see if i could see this object again, but sadly i couldnt see it anymore. i still can not wrap my brain around what i saw. i tried finding this object again but then i was scared that if it would come back i didnt want to be out in the open. just in case it could abduct anyone. after about 5 mins more my dogs & i came inside & still oinda in shock i called my aunt to ask her to go outside to see if she can see anything. since the object was kind of headed her direction. she wasn't able to see anything. after talking to her i got in touch with [name removed\\cms\\tg]. through facebook & he gave me the link to this page. if you need anymore info or if you find out anymore info please let me know. thank you, [name removed\\cms\\tg]"],"Log Number":"US-11232013-0012","Object Flight Path":"Straight-line path","City":"Longview","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/52393.html.txt","/var/www/straped/mufon/org/52393.html"],"Object Features":"Unknown","Tags":"City","Country":"United States","Viewing Distance":"21-100 Feet","Summary":"object flew above the treeline toward Airport of longview, Tx","Object Shape":"Circle, Disc","trends":["There have been 7 other sightings in Longview","There were no other sightings in Longview on or around November 23rd 2013"],"Date of the Event":"11/23/2013 06:02 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.361138,+-94.625451(52393)&iwloc=A&hl=en\"> mufon case (52393) map </A>","Sighting Duration":"Undisclosed","Latitude":"32.361138","Disposition":"Unresolved"}