{"Date Submitted":"11/24/2013 09:35 UTC","Log Number":"US-11242013-0013","Source":"MUFON","Weather Factors":"Unknown","Date of the Event":"01/01/1977 12:00 UTC","trends":["There have been 36 other sightings in Corona","There were no other sightings in Corona on or around January 1st 1977"],"Object Shape":"Blimp, Cylinder","Summary":"I was out playing with my dogs. I looked up to the south and observed a craft","map":"<A HREF = \"http://maps.google.com/maps?q=33.893931,+-117.544857(52408)&iwloc=A&hl=en\"> mufon case (52408) map </A>","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/52408.html.txt","/var/www/straped/mufon/org/52408.html"],"Viewing Distance":"101-500 Feet","Country":"United States","Case Number":"52408","Tags":"City","Longitude":"-117.544857","City":"Corona","Object Flight Path":"Stationary","Latitude":"33.893931","Object Features":"Other","Sighting Duration":"Undisclosed","divs":["sighting detailsthe dates are approximate. its been almost forty years but i cant stop thinking about it..the best i can do is 1976 to 1978. the location was demolished in 1985 to facilitate the i15\\91fwy interchange the object was basically hovering over the old krel radio building south of my house. i was playing with my dogs. i looked up to the south,i don't remember why. i observed a solid object brownish in color. the object looked like a designer blimp. it made a humming sound like a blimp. it was long possibly cigar shaped with an appendage that looked like a paddle wheel partially covered by a cowling. i remember thinking it looked like a riverboat just hovering about two hundred feet above the ground. i ran back to the house about one thousand feet. when i looked back it was gone. i remember an initial fright but dismissed the whole thing quite quickly. i cant swear to it but i recall losing some time. i cant tell you what i got for x-mas that year but this incident remains..ive often thought of being hypnotized to see if could recall exactly what happened. i have skimmed through the internet but cant find another sighting of a similar object."],"Region":"California"}