{"Summary":"Round white ball above feeding raccoon on video of trail camera.","Object Flight Path":"N/A","Sighting Duration":"Undisclosed","Longitude":"-82.349348","Region":"Georgia","Tags":"City","Source":"MUFON","Viewing Distance":"N/A","Date of the Event":"11/22/2013 01:45 UTC","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/52409.html.txt","/var/www/straped/mufon/org/52409.html"],"trends":["There have been 5 other sightings in Waycross","There were no other sightings in Waycross on or around November 22nd 2013"],"Latitude":"31.215191","Case Number":"52409","divs":["Sighting DetailsI placed a infrared trail camera in my woods on my back land line about 3 weeks ago. Camera was set to take a 10 second video ever 10 minutes. A 2GB SD card was changed out on the afternoon of November 19, 2013. This card stayed in the camera until the afternoon of November 22, 2013. When I viewed the videos on the night of November 22, 2013 I found that two of the night videos, one at 01:45AM and the second one at 01:55AM, on the morning of November 22, 2013 contained the following: 1. A raccoon feeding on some corn. 2. A white ball suspended in the air above the raccoon which moved, shook, and dropped down toward the raccoon. The second video ten minutes later at 01:55AM shows the raccoon backed up looking at the white ball and then deciding it was time to leave. The white ball was dancing around going back and forth, up and down, goes off camera and comes back and video ends. In the second video the white ball seems to be smaller than it is in the first video. There were no white balls of light in any of the other videos before these two nor was there any in the videos following these two. These two videos would have covered a time span of thirty minutes twenty seconds. ten minutes before the video started, ten seconds during the first video, ten minutes between the first and second video, ten seconds during the second video, and then ten minutes after the second video. I dont have any idea if this qualifies as a UFO, or not, but it is above the ground about six feet and moving around like a ball dancing in the wind. The only eye witness is the raccoon and I dont know where it can be located. If it had not been for this moving white ball I would have deleted these two videos. However, because of it I have placed them in a folder to keep. Had to use September for month account it would not take the actual month of November when I tried to submit."],"Log Number":"US-11242013-0014","Date Submitted":"11/24/2013 09:55 UTC","City":"Waycross","Object Features":"None","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=31.215191,+-82.349348(52409)&iwloc=A&hl=en\"> mufon case (52409) map </A>","Object Shape":"Circle","Weather Factors":"Unknown"}