{"Longitude":"-80.799774","files":["/var/www/straped/mufon/html2text/52404.html.txt","/var/www/straped/mufon/org/52404.html"],"Tags":"City","Date Submitted":"11/24/2013 03:18 UTC","Object Features":"None","Case Number":"52404","trends":["There have been 4 other sightings in Huntersville","There were no other sightings in Huntersville on or around November 16th 2013"],"Log Number":"US-11242013-0009","Sighting Duration":"Undisclosed","Latitude":"35.417345","Weather Factors":"Unknown","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.417345,+-80.799774(52404)&iwloc=A&hl=en\"> mufon case (52404) map </A>","Country":"United States","Disposition":"Unresolved","Date of the Event":"11/16/2013 07:03 UTC","Object Flight Path":"Hovering then path,Unknown","divs":["Sighting DetailsOn Saturday November 13th around 6:58pm eastern standard time. I was on the way home from a local mall with my son and my nephew. I notice something out of the corner of my eye that was glowing bright orange and this caught my attention immediately and pulled over my car and investigated further. The glowing orb begin to drop several white looking balls of light out of it toward the ground. I knew this was not a plane so I took out my cell phone and started taking pictures. I also made a 11 second video. There where two objects that showed up on the video. The one object hovered on the horizon and as a commerical airplane approached in the same direction as the object the lights dimmed down and there was a flash of light and it was gone. I came home and reviewed the pictures I had taken only to be shocked by what showed up on film and video. There where multiple objects on film and they appeared in diffenrent shapes,colors, and sizes. I also have pictures that appears to show the face of something standing in the wooded area in front of us? It was not a refection as there was nothing but woods in front of us? The video I record showed 2 orange orbs one moving and zig zaggin off my screen. I don't know what it was that I saw? But I would like for someone with better equipment to view my video and photos and let me know their thoughts? I have more pictures to submit. Also last night November 23 I took some more pictures of a different object in the same area of a. More to come as I will be uploading those pictures and new video as well. Thanks"],"Object Shape":"Sphere, Triangle, Unknown","Summary":"On Saturday November 16, I saw something that caught my eye glowing orange in the sky. The is orange object was dropping several white balls of light out of it toward the ground. The object flashed and then disappeared.","Source":"MUFON","Region":"North Carolina","City":"Huntersville"}