{"trends":["There has been one other sighting in Robb","There were no other sightings in Robb on or around November 22nd 2013"],"Latitude":"53.233578","Object Features":"Window(s), Patterned Surface, Wings, Unknown","Date Submitted":"11/24/2013 02:53 UTC","Country":"Canada","Case Number":"52403","Source":"MUFON","Weather Factors":"Unknown","divs":["Sighting Details#1. I was going and coming from work: On the way towards the foothills Village of Robb Alberta being a hobby photographer I felt 'drawn' to take some pictures of the beautiful sky. I stopped at a well site road and took a couple of shots. When I arrived at my work site I reviewed the pictures I took. I became very excited and apprehensive, then decided to leave the work-site (optional workday)to return and take more pictures. I scanned the sky for metallic bird-size shapes but all I could find of interest were clouds. I Noticed a particularly strangely complicated cloud and thought I will have to have a closer look at those pictures on the computer. The cloud may have been moving slowly cloud-like or it may have been hovering For some reason I didn't think much more about documenting size, distance, with my outstretched fist but guess it would have been about basket ball size at arm outstretched. I have a feeling there were many more of these shapes traveling under that grey ceiling cloud. I get the feeling there is more to come, I should be there."],"City":"Robb","files":["/var/www/straped/mufon/html2text/52403.html.txt","/var/www/straped/mufon/org/52403.html"],"Disposition":"Unresolved","Object Shape":"Bullet, Missile, Disc, Unknown","Object Flight Path":"Unknown","Date of the Event":"11/22/2013 01:14 UTC","Longitude":"-116.974482","Region":"Alberta","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=53.233578,+-116.974482(52403)&iwloc=A&hl=en\"> mufon case (52403) map </A>","Viewing Distance":"501 Feet - 1 Mile","Summary":"Beautiful sky, was 'drawn' to snap some shots of the sky, I did notice this cloud and think I must enhance this but then I took other shots and didn't check back on this cloud.","Sighting Duration":"Undisclosed","Log Number":"CA-11242013-0008"}