{"Log Number":"US-11242013-0018","Date of the Event":"10/01/2013 11:28 UTC","Region":"Maryland","divs":["Sighting DetailsOn Oct. 1 2013 at 11:28 PM I was walking my dog outside when I noticed an unusual cluster of stars high in the sky. What initially caught my attention was the fact that there seemed to be a large number of stars within a very small area and had never seen a cluster of stars like that. After approximately 5 to 10 seconds of staring at the stars I noticed they started becoming more clear and defined in what was already a very clear starry night. At first the stars seemed to move together very slowly. My first thought was I was seen an illusion from temperature changes in the night air or some other explainable cause. Within a second or two the cluster either became brighter and larger or closer as it was hard to tell in the dark sky and began to accelerate in a north by northeast direction. The entire time the stars maintained an exact position with relation to each other and moved as if they were part of the same solid object. Within 20 seconds the cluster had moved completely out of sight. I stood there trying to understand how stars could have appeared to move that way and continued scanning the sky to find some rational explanation. Just then I looked up and over the roof on the apartment building next to mine and I noticed a small translucent circle or sphere moving at a speed slightly faster than walking coming from a Southwest direction just above the tree line and heading straight for the other apartment building. As it approached the roof it had to increase its altitude by a few feet so as not to hit the roof. Once it was above the roof it changed to a straight north direction and continued on directly above my head, then seemed to drop by a foot or two. When it was within a few feet of the apartment building next door it became close enough to illuminate the side. It rose a few feet, cleared the building, and slowly accelerated away in a northerly direction. The entire time I was looking for wings on the object like a bird or bat or some other explanation that could cause something like that to appear. It wasn't until an hour or two later when it really hit me. My wife noticed something was not right with me. I began to have a wave of what felt like extreme sadness, anger, and loss of control that left me wishing the entire incident never happened."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.642823,+-77.662087(52413)&iwloc=A&hl=en\"> mufon case (52413) map </A>","files":["/var/www/straped/mufon/html2text/52413.html.txt","/var/www/straped/mufon/org/52413.html"],"Country":"United States","Date Submitted":"11/24/2013 11:45 UTC","Case Number":"52413","Summary":"Unusual star cluster began to move,formed V shape, followed by small ball over home","Sighting Duration":"00:06:00","City":"Hagerstown","Disposition":"Unresolved","Latitude":"39.642823","Viewing Distance":"20 Feet or Less, 501 Feet - 1 Mile, Unknown","Object Flight Path":"Hovering then path,Path with directional change","Object Features":"Patterned Surface, Other, Unknown","Weather Factors":"Unknown","trends":["There have been 10 other sightings in Hagerstown","There were no other sightings in Hagerstown on or around October 1st 2013"],"Object Shape":"Sphere, Triangle","Longitude":"-77.662087","Source":"MUFON","Tags":"City"}