{"Object Features":"None","City":"New Paltz","Sighting Duration":"Undisclosed","Case Number":"52411","files":["/var/www/straped/mufon/html2text/52411.html.txt","/var/www/straped/mufon/org/52411.html"],"Disposition":"Unresolved","Date of the Event":"11/23/2013 09:30 UTC","Object Shape":"Fireball, Sphere","Object Flight Path":"Path with directional change","Country":"United States","Weather Factors":"Unknown","divs":["Sighting DetailsI was sitting in my kitchen lase night watching television. A bright red-orange light caught my eye out the window. It was traveling south to north, toward me. Then it turned and started moving east. Suddenly another one appeared taking the same course. The second one caught up to the first and they traveled closely together. I thought the color was strange, and noticed they weren't blinking like planes. Also, this is a regular flight path to Newburgh Airport, but those planes are always traveling north to south and east to south, so this was REALLY out of the ordinary. I ran upstairs to alert my husband to this, so that he could witness it as well. He is an amateur astronomer, and I thought \"If I tell him this , and he doesn't see it, he's going to say 'oh it was Venus'.\" So, I made sure he saw it AND EVEN HE said it was highly unusual. Then we saw the third one appear from the same direction as the other two, but it stayed behind them, not catching up. Finally they were almost as far away to the east as we could see from that window when they disappeared, the pair in front first, then the one in the rear. My husband said,\"I think they disappeared like that because they were in the earth's shadow. You know there are planes and things up that high...It could have been satellites. The color could have been a sun event because they were so high.\" I've seen satellites, and they're white and move fast.These moved slowly and were a weird red color. and they weren't planes because they didn't blink they were like...wobbly\" Anyhow, today when I asked him what he thought about it he said, \"Swamp-gas, weather balloon\"and when I told him I was going to write about it to MUFON he said \"Don't put my name on it.\""],"Longitude":"-74.08194","Tags":"City","Source":"MUFON","Summary":"Three bright red-orange objects observed through south facing window.","trends":["There have been 4 other sightings in New Paltz","There were no other sightings in New Paltz on or around November 23rd 2013"],"Latitude":"41.749913","Date Submitted":"11/24/2013 10:27 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.749913,+-74.08194(52411)&iwloc=A&hl=en\"> mufon case (52411) map </A>","Region":"New York","Viewing Distance":"Unknown","Log Number":"US-11242013-0016"}