{"Log Number":"US-11242013-0017","Summary":"2 orange orbs, and 1 white star like UFO.","Tags":"City","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"11/24/2013 10:51 UTC","files":["/var/www/straped/mufon/html2text/52412.html.txt","/var/www/straped/mufon/org/52412.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.69168,+-104.86057(52412)&iwloc=A&hl=en\"> mufon case (52412) map </A>","Country":"United States","Date of the Event":"11/23/2013 12:00 UTC","Object Shape":"Sphere, Star-like","divs":["Sighting Details My girlfriend and I left the condo at 10:10 to walk the dog on the highline canal trail behind the building. We proceeded west, it was cold and overcast with those sorts of clouds that appear misty that come in winter, very grey and heavy looking. We were about 10 minutes in the walk, actively looking for strange lights, etc. as 4 nights previously I had seen another orange orb to the south of the trail in the boundaries of a golfcourse. My girlfriend spotted an owl in the trees which I then photographed. We proceeded west again down the trail when I looked up and spotted a shooting star, and got a bit excited as things seemed to be getting interesting. Not 5 minutes later to the south we beheld another orange orb, very distinctly yellow orange about 50 feet above what I believe would be the lakes surface within the golfcourse, it was very bright, brighter than the moon (not larger)and very intense. We watched it intently to be sure it was not anything we could discern. It rose about 50 feet in this time and then vanished, seeming to implode. We proceeded southward again toward fairmount cemetery, being just south of it, or behind the the cemetery on the highline canal trail, looking even more curiously around in anticipation of something... when we spotted a little white light south- westerly about 70 degrees from horizon and about 1500 feet right at cloud level set between two very grey and heavy clouds. We watched it, quickly dismissing it as a probable airplane, when it then just disappeared, it did not move forward into clouds, it appeared, and disappeared. We were now freaking out, not uncontrollably but rather in a happy excited way. We stayed in that spot, looking all over for anything when about 10 miles northeast seeming to be out by DIA we spotted another orange orb, one could tell this one was quite large due to the distance, and its size. If not for its bright orange color we would not have watched it as intently, it moved from left to right, then stopped and stayed in place, again vanishing in an implosion looking manner. I was trying to photograph them, but was having camera difficulties."],"Source":"MUFON","Disposition":"Unresolved","Object Features":"None","Object Flight Path":"Stationary,Straight-line path","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around November 23rd 2013"],"Longitude":"-104.86057","Region":"Colorado","Latitude":"39.69168","City":"Denver","Case Number":"52412"}