{"files":["/var/www/straped/mufon/html2text/52427.html.txt","/var/www/straped/mufon/org/52427.html"],"Disposition":"Unresolved","divs":["Sighting DetailsI was in the parking lot in my apartment complex when a black triangular object in the Night Sky to the south of where I was standing caught my eye on the backdrop of the gray clouds. It seemed to move as a plastic bag moves in the wind. At first I thought the object was a large bird like a hawk hovering in the sky until I noticed the lights. I felt in awe and amazement when I realized what this objects must be. The object basically stayed in the same area for the 10 to 15 minutes duration that I witnessed it but it moved up down left right closer and further like I previously described as a plastic bag floating around in the wind. The object had two red lights that appeared on it from time to time as it moves about but not steadily. I attempted to record video on my phone but for some reason the object would not show up on the screen to my phone perhaps due to insufficient lighting. There is a small private airport in the direction of where I witnessed this object which it seemed to be very close to or maybe even over. After 10 to 15 minutes of viewing the object it started to rain I then got into my car and when I return home and hour later the object was no longer there. After reviewing the video taken on my cell phone carefully you can barely make out a black dot in the center of the screen, The point where the camera zooms in you can see a black dot in the sky in the very center of the video. I stopped filming because I thought I didn't capture anything, I have added this video with this submission."],"Date Submitted":"11/25/2013 10:38 UTC","Tags":"City","Weather Factors":"Unknown","Region":"Florida","Viewing Distance":"Unknown","Country":"United States","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=26.210789,+-80.187514(52427)&iwloc=A&hl=en\"> mufon case (52427) map </A>","trends":["There have been 11 other sightings in Pompano Beach","There were no other sightings in Pompano Beach on or around November 25th 2013"],"City":"Pompano Beach","Case Number":"52427","Sighting Duration":"Undisclosed","Log Number":"US-11252013-0014","Object Flight Path":"Other","Object Features":"Unknown","Date of the Event":"11/25/2013 07:11 UTC","Summary":"Black triangle dancing in the night sky","Longitude":"-80.187514","Latitude":"26.210789","Object Shape":"Triangle"}