{"Longitude":"-82.524095","Log Number":"US-11252013-0007","Region":"Florida","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/52420.html.txt","/var/www/straped/mufon/org/52420.html"],"Object Flight Path":"Path with directional change","Latitude":"27.284591","Case Number":"52420","Object Shape":"Sphere","Country":"United States","Tags":"City","Date Submitted":"11/25/2013 12:16 UTC","City":"Sarasota","trends":["There have been 39 other sightings in Sarasota","There were no other sightings in Sarasota on or around October 15th 2013"],"Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was dog sitting for our next door neighbor and on this night I decided to have a fire in their fire pit. I was watching the sky while sitting next to the fire and then looked through an opening in the trees to the west. That's when I noticed an orange light. I stood up and took a few steps in that direction and watched for blinking lights in case it was a plane - there were NO blinking lights. It was a steady orange glow and it appeared to be a sphere or orb. We live fairly close to the coast and it seemed this light must have been out over the water (Gulf of Mexico). I kept watching it and it appeared to be moving away from my position although it was hard to tell...then it made a turn to my left(toward the south). It was not an abrupt turn, but a slow turn. It then went out of sight behind the trees. This is the first and ONLY sighting I've ever had, I'm 44 yrs old. It was the only thing I've ever seen that I couldn't explain. Unfortunately, I was alone when it happened. I was excited that I was seeing it but tried to remain calm because I didn't want my emotions to convince myself that I was seeing something that wasn't really there."],"Disposition":"Unresolved","Summary":"Traveling Orange Orb","Date of the Event":"10/15/2013 12:00 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=27.284591,+-82.524095(52420)&iwloc=A&hl=en\"> mufon case (52420) map </A>","Object Features":"None"}