{"Weather Factors":"Unknown","Date of the Event":"10/23/2013 08:30 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.935034,+-118.152363(52436)&iwloc=A&hl=en\"> mufon case (52436) map </A>","trends":["There have been 9 other sightings in Downey","There were no other sightings in Downey on or around October 23rd 2013","This sighting has never been favorited.",""],"City":"Downey","Object Features":"None","Region":"California","Sighting Duration":"Undisclosed","Date Submitted":"11/26/2013 05:24 UTC","Object Flight Path":"Hovering then path,Path then hovering","Source":"MUFON","Object Shape":"Circle, Sphere","Summary":"Red/Orange Light in the sky floated, hovered, and moved around Downtown Downey","divs":["sighting detailsi was standing outside our garage with my father in law when i saw a red\\orange light emerging in the air from the south above the building complex in front of us. i really didn't pay to much attention because this is l.a. and it could have been anything, but after a minute or two i notice it was just floating above us at a south easterly location high above the sky. that is when my father in law and i joked it was a ufo. we actually thought it could have been a sky lantern because of the color of the object, the height and distance, and the light was pulsating. we had a conversation of what it could be when it started to float slowly to the east, then back to the west, then going south. my father in law then began to record the object (which he did for over 5 minutes), as it slowly moved west it stopped and floated stationary before slowly floating to the south and then moving east where the light just disappeared."],"Case Number":"52436","Tags":"City","Viewing Distance":"Unknown","Log Number":"US-11262013-0007","files":["/var/www/straped/mufon/html2text/52436.html.txt","/var/www/straped/mufon/more/52436_submitter_file1__OriginalPictureSouthEast.jpg","/var/www/straped/mufon/more/52436_submitter_file2__OriginalPictureCloseUp.jpg","/var/www/straped/mufon/org/52436.html"],"Latitude":"33.935034","Disposition":"Unresolved","Longitude":"-118.152363"}