{"Object Features":"None","City":"Attadale","Case Number":"52433","Viewing Distance":"101-500 Feet","Latitude":"-32.028814","trends":["There have been no other sightings in Attadale","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=-32.028814,+115.802473(52433)&iwloc=A&hl=en\"> mufon case (52433) map </A>","Object Flight Path":"Path with directional change","Log Number":"AU-11262013-0005","divs":["Sighting Details1. I was in my garden. The Kreepy Krawley (pool cleaning mechanism) got stuck and I had to move it. 2. I looked at the sky because it was very starry. But this one star looked a bit different. I didn't get any feeling. It just looked different. Not moving. 3. I didn't know what it was. It just looked different. It was star-like but not actually a star. It hadn't moved an inch. So I went to get my Canon Powershot A490 camera to photograph it. 4. When I tried to get it in focus (autofocus) it jumped around. Up, down, sideways. That annoyed me because I wanted a clear shot. It went zig-zaggy all over the place. 5. During the siting I was annoyed because it moved around so much. I took a few pics and then went inside because I was fed up. I had a cold and it was late. 6. I didn't lose sight. It was still there and I just gave up and went in because I was tired and feeling cold. I had a temperature, a strong flu and was feeling tired and dizzy well before this sighting. I believe that these things exist, and thought the photo may interest some people. The camera was just there on the counter top. I use it to take pics of my flowers and upload to facebook. My Son, who is really into this has since changed the image resolution on my camera to much higher. I'm not very camera savvy and he thinks they'll be back. So the camera is at the ready just in case. I'm a retired widow, turning 70 next year. Natural redhead still *my Son said to say this as he thinks they are interested in genetic variation). Overall, I'm quite surprised and didn't have much hope getting an image on the cheapy camera."],"Source":"MUFON","Sighting Duration":"Undisclosed","Longitude":"115.802473","Tags":"City","Country":"Australia","Disposition":"Unresolved","Summary":"Saw a light in sky, bit different to stars so grabbed camera and it moved when I tried to snap a pic.","Date of the Event":"11/25/2013 12:00 UTC","files":["/var/www/straped/mufon/html2text/52433.html.txt","/var/www/straped/mufon/org/52433.html"],"Date Submitted":"11/26/2013 03:29 UTC","Weather Factors":"Unknown","Object Shape":"Chevron, Star-like","Region":"Western Australia"}