{"City":"Bhopal","Source":"MUFON","Tags":"City","Disposition":"Unresolved","Object Shape":"Star-like","Date Submitted":"11/26/2013 03:19 UTC","Longitude":"77.412615","map":"<A HREF = \"http://maps.google.com/maps?q=23.259933,+77.412615(52432)&iwloc=A&hl=en\"> mufon case (52432) map </A>","trends":["There have been no other sightings in Bhopal","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Country":"India","Weather Factors":"Unknown","Case Number":"52432","Date of the Event":"11/24/2013 10:33 UTC","Viewing Distance":"101-500 Feet","Region":"Madhya Pradesh","Object Features":"None","Object Flight Path":"Path with directional change","Log Number":"IN-11262013-0004","Latitude":"23.259933","files":["/var/www/straped/mufon/html2text/52432.html.txt","/var/www/straped/mufon/org/52432.html"],"Summary":"There was an orange light that flew in a curved path.","divs":["Sighting DetailsI was standing outside my sister's house gazing at the stars when I saw an orange glow approach from South east direction. It was momentarily obscured behind a tree, then it appeared out from it. I first thought someone was flying a lighted kite because the glow looked like it but when the object moved in a curved path, passing over houses at the end of the street,I realized that it was a UFO as there was no sound. There were no strobe lights and the glow appeared to flicker slightly. As the object flew away in a curved path, its light dimmed and before getting obscured again by houses, it had dimmed completely. The moment I saw the object, I knew it was not an aircraft because there was no sound and secondly, the light was a glow without there being a beam effect. The UFO was at a pretty low altitude of about 300ft and it moved without wavering in path. I could have mistaken it for an aircraft had the glow been of the color of landing lights. I watched the object fully aware that it was most probably a UFO and as the light dimmed, I was even more convinced of the craft being under intelligent control. The light of the UFO dimmed before it disappeared behind houses dimmed to a small point of light. It seems that the craft was accelerating throughout the curved path. I watched the scene calmly and at no time did I take my eyes off the object. It will be apt to say here that I was standing outside and gazing at the skies to see if there is really something out there and I just saw that."]}