{"Case Number":"52443","Object Shape":"Cylinder, Star-like, Other","Summary":"i have the most amazing video","Weather Factors":"Unknown","Longitude":"-85.206702","Disposition":"Unresolved","Viewing Distance":"Over One Mile","Date Submitted":"11/26/2013 01:50 UTC","Latitude":"34.218388","Source":"MUFON","Region":"Georgia","Object Flight Path":"Hovering then path","Date of the Event":"11/24/2013 10:30 UTC","Object Features":"Other","Log Number":"US-11262013-0014","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.218388,+-85.206702(52443)&iwloc=A&hl=en\"> mufon case (52443) map </A>","Tags":"City","divs":["Sighting DetailsAfter arriving home late from work. Approx 10:15pm I noticed a very bright and large \"star\" just under Orions left foot and just to the right of the North star. It appeared \"closer\" and brighter than I thought a star should be and was blinking colors sort of like a planet does. Initially I got a cheap pair of binoculars from the house but they made viewing worst. So I grabbed my phone. I have Droid Maxx and switched on the video camera. What I saw will blow you away! Initially before I zoomed in the single bright blinking light became four distinct lights in a line in sort of the traditional saucer pattern. A series of 3 to 4 lights would flash across in a straight line with the two on each end. When I zoomed in after a minute or so it was the mist incredible thing I've EVER seen. MASSIVE object (only can see black outline of craft) but it was covered in many lights that blinked and flashed dome in sequence and some random. The craft is cigar shaped with a sail shape on one end. Distinct bright flashing red light towards top part of \"sail\" structure and dozens of other lights all over the craft. I have close to 5 mins of video which I have not released but will after I protect my rights to it and have some \"professionals\" validate it. I want no chance of hoax or anything else. Only 3 people have seen video besides my wife who witnessed event and all 3 were blown away. One actually became frightened and concerned. I have proof and utbus undeniably \"something\" itsno star, no planet, not a plane or helicopter or blimp. Its the real deal. Please have someonecontact me and llet's get thus video checked out and released to the world. Its incredible!!!!!"],"files":["/var/www/straped/mufon/html2text/52443.html.txt","/var/www/straped/mufon/org/52443.html"],"Sighting Duration":"04:00:00","City":"Rome","trends":["There have been 10 other sightings in Rome","There were no other sightings in Rome on or around November 24th 2013"]}