{"Disposition":"Unresolved","Summary":"Very strange aircraft in the night sky flashing bright red lights and very bright white lights that remained on at all times and the craft hovered over Levittown in Bucks County PA and then abruptly started moving very fast in what I believe was the NW","Weather Factors":"Unknown","City":"Undisclosed","divs":["Sighting DetailsI was with my girlfriend and father on our way home from picking my father up from work. I was in mid conversation with my dad when my girlfriend pointed out a strange aircraft with very bright white lights and bright flashing red lights. My dad and I thought it was a plane cause it appeared to be moving but, as we got closer at a stop light we discovered it was not moving but, stationary. It was then at the traffic light the it actually looked like a light from on top of a radio tower but, knowing that it was way to high and being from the area i also know that there is not any such towers in the area the object started to draw more and more attention from all of us. For about 5-7 minutes the object was in sight and was definitely stopped,stationary,and seemed to look like it was hovering. Then as I tried to set up a video with my dad's phone the object took off in what I believe to be the NW direction at an incredible speed and almost looked as if it sort of shifted directions a bit. I did manage to get some video of this mysterious object as it was leaving the area but, due to it being dark out it is not the best quality and all of us in the car including myself were awestruck at how uncanny and bizarre this sighting was."],"Date Submitted":"11/26/2013 05:50 UTC","Case Number":"52446","Object Flight Path":"Hovering then path","Longitude":"-77.192215","Object Shape":"Cylinder","Source":"MUFON","Latitude":"41.212192","Log Number":"US-11262013-0017","Region":"Pennsylvania","Date of the Event":"11/25/2013 05:40 UTC","Object Features":"Unknown","Viewing Distance":"N/A","files":["/var/www/straped/mufon/html2text/52446.html.txt","/var/www/straped/mufon/org/52446.html"],"Country":"United States","Sighting Duration":"Undisclosed","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.212192,+-77.192215(52446)&iwloc=A&hl=en\"> mufon case (52446) map </A>","trends":[]}