{"Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=39.979745,+-74.576043(5244)&iwloc=A&hl=en\"> mufon case (5244) map </A>","files":["/var/www/straped/mufon/html2text/5244.html.txt","/var/www/straped/mufon/org/5244.html"],"Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","City":"Pemberton Township","Longitude":"-74.576043","Country":"United States","trends":["There have been 2 other sightings in Pemberton Township","There were no other sightings in Pemberton Township on or around June 30th 2006"],"Date Submitted":"06/30/2006 09:30 UTC","divs":["Sighting Detailsi was in a car with my girlfriend and my friend. we stopped to say hi to some friends we saw. while i was sitting in the car i saw a yellow round object in the sky that seemed unusual. i told everybody about it and we all looked up at it trying to figure out what it could be. as we stood there, the yellow light started to fade away but twinkling at the same time and as this was happening there was a cloud like shaped C that was to the right of the object. wen it faded away the cloud also faded away. as we stood there, like 5 seconds later, the yellow light appeared again but this time is was brighter. after a few seconds it began to turn red and as it changed colors the object got smaller. the object turned red and slowly faded away twinkling. this time the object never appeared again. nobody knew what it was but i had a great feeling it was a ufo. all together this event took around 3 to 4 minutes. the object never moved from the spot. at first i thought it could have been one of those poles that have the yellow light blinking from it but it was way too high in the air and there arent any light poles there, thats what made me believe it was a ufo and because of the actions it was making. if you need any questions, there was about 15 people in all who saw this event."],"Latitude":"39.979745","Case Number":"5244","Disposition":"IFO","Log Number":"US-08152006-0005","Source":"MUFON","Summary":"yellow object appeared few hundred feet in there air n faded away","Region":"New Jersey","Tags":"City","Object Flight Path":"Undisclosed","Date of the Event":"06/30/2006 09:30 UTC","Object Features":"Unknown","Sighting Duration":"Undisclosed"}