{"Tags":"City","Source":"MUFON","Date Submitted":"11/26/2013 10:28 UTC","Sighting Duration":"Undisclosed","Object Features":"Unknown","Country":"United States","Disposition":"Unresolved","Longitude":"-73.532645","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Region":"New York","files":["/var/www/straped/mufon/html2text/52440.html.txt","/var/www/straped/mufon/org/52440.html"],"Summary":"Star like objects zipping accross the sky","Weather Factors":"Unknown","Object Shape":"Circle, Sphere","Log Number":"US-11262013-0011","Latitude":"42.132404","divs":["Sighting DetailsI was at my parents visiting and was laying in bed and decided to star gaze out the window, and boy that was a mistake. It was 1:00am and I didn't get to bed until 3. I noticed a star, that moved and I though okay, meteor shower? Then I saw another one and was able to follow it as it flew around changing colors, stopping briefly and zooming off. I thought my eyes were playing tricks on me, but I had solid points of reference. The harder I looked the more I could see. Somewhere around 6 is what I safely want to say, but it was hard to tell because they moved so fast and would also flicker out at times. They changed in colors from white,blue,green,orange,red and yellow. The consistence of the output of light changed a lot, and at times was quite extraordinary brilliant. They looked like stars, BUT THEY WERE NOT STARS! They would join together and then zoom away, their movements were unpredictable, yet deliberate. After a while I decided to go downstairs and wake my mother up, which was no help because she has poor vision, but I needed someone to tell me I wasn't crazy. After that failed attempt, and still feeling quite insane, I went back up and decided to watch some more. After ten minutes or so, sure enough on the horizon zooming straight up into the sky and seemed to dance with each other and then zoom away. There movements varied so much that I was in awe, from quickly zooming, to slowly like hovering, to dashing off to the left, or falling slowly etc. So after an hour of this, I decided to get on the computer and report what I saw and do some research. (As far as I know the phenomenon was still occurring at this point.) First off concluded that I am not crazy and not seeing things. I had a few great reference points because of the way I was laying in bed, so it wasn't my eyes playing tricks on me. Secondly I made my report and after doing so had some closure, so was able to finally go to bed. I lost sight of the objects by shutting my curtains, leaving my bedroom door open and demanding a night light from my mother."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.132404,+-73.532645(52440)&iwloc=A&hl=en\"> mufon case (52440) map </A>","Viewing Distance":"Unknown","Case Number":"52440","Date of the Event":"11/26/2013 12:00 UTC","City":"Copake","trends":["There have been no other sightings in Copake","This sighting has never been favorited."]}