{"Summary":"Big bright white teardrop hovering with beams over N. Smithfield RI 6/14/2013 @11:11pm","files":["/var/www/straped/mufon/html2text/52447.html.txt","/var/www/straped/mufon/org/52447.html"],"Disposition":"Unresolved","Object Shape":"Teardrop","map":"<A HREF = \"http://maps.google.com/maps?q=41.957876,+-71.503394(52447)&iwloc=A&hl=en\"> mufon case (52447) map </A>","trends":["There have been 2 other sightings in North Smithfield","There were no other sightings in North Smithfield on or around June 14th 2013"],"Log Number":"US-11262013-0018","Date Submitted":"11/26/2013 07:51 UTC","divs":["Sighting DetailsI was watching the 11:00 news in North Smithfield Rhode Island on June 14, 2013. Family members were asleep upstairs. I felt a strange feeling of unease and nervousness for no reason. I was sitting near sliding glass doors with the curtain closed. For some reason, I stood up and wanted to look outside. As I peeked through the curtains,I looked across a 3 acre meadow toward the distant tree line. Directly over one of the large distant trees was a bright, white, translucent, teardrop shaped, glowing object. It was the size of two full moons.It seemed to be illuminating a large area around it-brighter on the right than the left.I looked at the cable box clock and it was 11:11 on the dot. As I continued to look at the object,it blinked and lit up a fairly large area. It made the area near it light up as in a thunderstorm. It was hard to tell how far away it was. It could have been 1000 feet or a mile or more. It was hard to say. As I studied it closer,I saw four or five brighter white spots on it facing toward me. I wondered if they were beams. There were no lights or beams shining down on the meadow which remained dark.There were broken clouds that night. I wondered where the beams could be pointing. I looked up to the clouds directly over the house and saw that the outer edges facing the object were outlined in white light like a beam of light was being projected on them from the object. It was stationary over the tree line for at least 5 minutes. At this point, I was absolutely terrified. I let the curtain close. I was too petrified to ask my family to come and see it and I also was trying to protect them from potential harm. The object stayed there for at least 5 minutes in place. I looked again after that and it was totally gone and the sky was once again pitch black. When it was gone I was very, very shaken up. I could not sleep all night. I called my friend in Weymouth Massachusetts to talk and she told me people in nearby Quincy were demanding answers from their local government about sightings there within the few days prior. I am still traumatized and apprehensive about the event."],"Source":"MUFON","Object Flight Path":"Stationary","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Other","Longitude":"-71.503394","City":"North Smithfield","Country":"United States","Weather Factors":"Unknown","Region":"Rhode Island","Case Number":"52447","Tags":"City","Date of the Event":"06/14/2013 11:11 UTC","Sighting Duration":"00:05:00","Latitude":"41.957876"}