{"City":"Luling","map":"<A HREF = \"http://maps.google.com/maps?q=29.666868,+-97.64281(52453)&iwloc=A&hl=en\"> mufon case (52453) map </A>","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Flight Path":"Stationary,Path then hovering","Region":"Texas","Date Submitted":"11/27/2013 02:57 UTC","divs":["sighting detailsreceived a call stating 2 ufo were in the sky, went outside, in the south\\southeast heard swish\\whir sound, dogs howling from serveal directions. there was a bright strobe like light flashing from the north\\northwest moving south by southwest, appeared lower to the ground. after being outside awhile we walked heading west looking in the sky, the caller said they were still in sight. just before coming in, on three occasions saw three greeish light shooting from high in the sky going south\\southwest downward, they looked like a shooting star, fading the closer it came to the ground, speed was very fast. the ufo was high in the sky, south, the lights of it made a shape like an arrow with the tip pointing east, the shaped changed or moved. got to cold went inside after 20 minutes or so, the shape was still in the sky. the noise (heard in the south\\southeast)had stopped maybe 5 minutes are so of being outside, the bright flashing light in the north disapeared after ten minutes or so. another person's account thought the ufo was like a group of glesting stars moving from east to west very slowly. all three of us observed the shooting orb type light and the ufo had moved in location."],"Country":"United States","Case Number":"52453","Weather Factors":"Unknown","Viewing Distance":"Unknown","Object Shape":"Other","Log Number":"US-11272013-0003","trends":["There has been one other sighting in Luling","There were no other sightings in Luling on or around November 26th 2013"],"Longitude":"-97.64281","Tags":"City","Summary":"got call abt 2 ufo, in the s/se heard swish/whir sound, dogs howling in several directions, saw 3 greeish light like a shooting star going s/sw, ufo lights shaped like arrow with tip pointing E. a bright flashing light was moving from the n/nw to s/sw","Object Features":"Patterned Surface","files":["/var/www/straped/mufon/html2text/52453.html.txt","/var/www/straped/mufon/org/52453.html"],"Date of the Event":"11/26/2013 11:05 UTC","Source":"MUFON","Latitude":"29.666868"}