{"Object Shape":"Flash, Sphere","Longitude":"-76.442719","Sighting Duration":"Undisclosed","Case Number":"52451","Region":"Pennsylvania","Date Submitted":"11/27/2013 12:19 UTC","files":["/var/www/straped/mufon/html2text/52451.html.txt","/var/www/straped/mufon/org/52451.html"],"Disposition":"Unresolved","Object Flight Path":"Hovering then path","Tags":"City","Log Number":"US-11272013-0001","Object Features":"Patterned Surface","map":"<A HREF = \"http://maps.google.com/maps?q=41.767575,+-76.442719(52451)&iwloc=A&hl=en\"> mufon case (52451) map </A>","divs":["Sighting DetailsI was on Burlington mountain bow hunting and right at dark I climb down out of tree w my climber stand and noticed behind me in the sky a big bright light. At first it appeared to have a shape but then it just looked like a big round light. At first I thought star but I've never seen a star that big and that bright. It looked to be about half the size of the moon and it was a full moon that night. In the video I show both for comparison. Then I thought well maybe it was a plane reflecting light but knew full well I was trying to explain away what I was seeing. It was huge and far away. It was slowly moving across the sky I mean slowly. This is when I started recording it w my I phone 5 cause I knew I was watching a UFO and I was gonna get the definitive video. I watched it for about 20 min while a was walking out of the corn field I was hunting in. It started to move away from me then would come back. It kept on getting real big then shrinking down. Like watching a basketball shrink to pea size. Dim then bright but there wasn't any clouds. The feeling I got was man are they coming for me and because of tv shows started looking for things like beams to bigfoot that's how serious it was. About 35 min into watching the object it came close enough to actually see 3 rings which made up the object , all rotating. One inside of the next. The reason I didn't stay and watch more is because I was already late to get where I needed to be and I had already recorded it for over 35 min and it pitch black."],"Date of the Event":"11/13/2013 05:30 UTC","City":"Towanda","Viewing Distance":"Over One Mile","trends":["There have been no other sightings in Towanda","This sighting has never been favorited."],"Source":"MUFON","Weather Factors":"Unknown","Latitude":"41.767575","Summary":"Got out of climber stand while deer hunting and seen it hovering in sky. It then slowly moved across the sky. Seen it change directions multiple times","Country":"United States"}