{"files":["/var/www/straped/mufon/html2text/52456.html.txt","/var/www/straped/mufon/org/52456.html"],"Date of the Event":"11/14/2013 12:00 UTC","Latitude":"42.281313","Case Number":"52456","Country":"United States","City":"Kalamazoo","trends":["There have been 12 other sightings in Kalamazoo","There were no other sightings in Kalamazoo on or around November 14th 2013"],"Summary":"Three distanced, fiery, reddish-orange lights passing NW over West Kalamazoo, MI","Disposition":"Unresolved","Date Submitted":"11/27/2013 05:05 UTC","Source":"MUFON","Longitude":"-85.63429","Log Number":"US-11272013-0006","Tags":"City","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.281313,+-85.63429(52456)&iwloc=A&hl=en\"> mufon case (52456) map </A>","divs":["Sighting DetailsDelivering pizzas in the Arcadia neighborhood, I glanced up and saw three distant, glowing red lights approaching from the SW horizon. They really grabbed my attention. They were high in the sky, distanced from each other but single-file, moving NW at normal passenger plane's pace. It was nighttime -- black starry sky. At first I figured they were planes but as the first one grew closer, it struck me as odd. It didn't have the typical separated (blinking) lights you would see under a plane. It seemed as though it was one mass of reddish-orange light -- all three of them did -- flickering sort of like a fire. A little bit excited, I pulled into the cul-de-sac, parked my car and got out to get a better view. I listened for the sound of a plane but I heard nothing. The second light passed overhead thirty seconds after the first, followed by the third one thirty seconds after that. By the time the third light was overhead, the first one's light faded out well before it reached the NW horizon. As the other two moved, they both faded out when they reached the same place the first one did. There may have been a cloud at that position that they passed through, but since I could see stars in nearly every direction; something seemed off. It's been on my mind ever since, so I started researching similar things over the past couple weeks, and apparently fiery red lights are sometimes associated with ufos. They certainly didn't seem like planes and at no point could a I hear a sound possibly coming from any of them. So that brings me here. A very terrible MS paint drawing is attached showing their formation as they came over the horizon."],"Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Object Shape":"Unknown","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Region":"Michigan"}