{"Object Features":"Unknown","divs":["Sighting DetailsAt approximately 5:21AM on November 27, I witnessed what I thought was a star that just seems to dim every time I have looked at it. I now feel this is beyond anything I actually know of. This 'object', for lack of a better term, was in place nearly perfect north and glowing yellow-orange. When I looked up at this object, I actually said (and feel crazy for even including this) \"there you are again\". After saying this, it dimmed as it has twice before and stayed at it's then new level of brightness. The difference now that drives me to post this event is I was now able to see this thing move. After it had dimmed, I noticed for the fist time something identical to it's level of light down and slightly to the right of this object. At the beginning of this event, they were not sharing the same level of light so the object below the first noticed item was at the same level it was before the object above started to dim to the same level of light. Once the brighter object dimmed, they began to move in unison holding the same distance between the each other and headed down and north east to below the visible horizon. As I had nothing but my phone on hand, I was unable to capture any images of this event but swear on my life this took place. I have included a screen capture from a star map app on my iPad mini since I had to know if there was anything present in that spot in the sky. When placing the iPad in the area with the app running, and adjusting the visible stars to a little higher than what I was actually seeing in the sky, the two objects were not recorded. The only star that actually showed was Kochab (Beta Ursae Minoris). I do not know if this app updates in real time but the two objects I saw were not there when searching the area in which they were seen. I should note that as I have mentioned seeing the glowing 'orb' twice before, I was at work and outside. It had been hazy each time before but it was obvious that the most visible object was there and dimming to almost nothing. I was unable to see the object move unlike today when seeing them in a perfectly clear night sky. This is about all the detail I can give right now but if there are any questions, I am sure I will know."],"trends":["There have been 3 other sightings in St. Charles","There were no other sightings in St. Charles on or around November 27th 2013"],"Summary":"Third times the charm","Region":"Missouri","Object Flight Path":"Path with directional change","Date Submitted":"11/27/2013 11:46 UTC","Tags":"City","Viewing Distance":"Over One Mile","Country":"United States","files":["/var/www/straped/mufon/html2text/52460.html.txt","/var/www/straped/mufon/org/52460.html"],"Date of the Event":"11/27/2013 05:21 UTC","Log Number":"US-11272013-0010","Sighting Duration":"00:01:04","Case Number":"52460","Longitude":"-90.525995","Latitude":"38.796776","Source":"MUFON","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=38.796776,+-90.525995(52460)&iwloc=A&hl=en\"> mufon case (52460) map </A>","Weather Factors":"Unknown","City":"St. Charles","Object Shape":"Star-like"}