{"Country":"United States","Disposition":"Unresolved","Longitude":"-82.898973","trends":[],"City":"Undisclosed","Tags":"City","Object Shape":"Star-like, Other, Unknown","divs":["Sighting DetailsI was standing outside with binoculars. Originally saw a star in the shape of a cross, and went out to look. Saw about 7 spacecrafts moving through the sky interdimensionally. Then a spacecraft flew over my house heading south barely over my treetops over powerlines. My electrical box is blinking words and numbers. A number of artifacts all around my house. Including grass creased as in a crop circle. There were at least 6 stars that were starships and each one I viewed with binoculars moved when I looked at them, squiggled and danced in the sky and would shoot off in various directions. I feel disoriented. My house is definitely affected by an electromagnetic field. Dizzy and feel pulled in different parts of the yard. A friend came over and took photos and she felt the magnetic fields as well. I watched these starships off and on from 12:00 midnight until 6 a.m. in the morning. The starship that flew over the treetops came over me. It looked like an organic being, with two bright oblong lights beneath it. It twisted as it flew, and flew south and vanished in seconds. Can someone come out and investigate with equipment the electromagnetic fields right away?? I think this warrants a visit, rather than just submitting information. If you cannot, is there someone who can? Thank you."],"Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Source":"MUFON","Region":"Ohio","Latitude":"40.424427","files":["/var/www/straped/mufon/html2text/52476.html.txt","/var/www/straped/mufon/org/52476.html"],"Summary":"I saw multiple starships in the sky, and one flew over me and over treetops","Log Number":"US-11282013-0006","Viewing Distance":"21-100 Feet","Date of the Event":"11/27/2013 02:20 UTC","Object Features":"Dome, Other","Date Submitted":"11/28/2013 06:43 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.424427,+-82.898973(52476)&iwloc=A&hl=en\"> mufon case (52476) map </A>","Case Number":"52476"}