{"Weather Factors":"Unknown","Tags":"City","Date of the Event":"03/21/2006 12:00 UTC","Sighting Duration":"Undisclosed","City":"Blountstown","Case Number":"5247","Longitude":"-85.045195","Country":"United States","Object Flight Path":"Hovering then path","Object Features":"Undisclosed","Viewing Distance":"Unknown","Region":"Florida","Log Number":"US-08152006-0008","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/5247.html.txt","/var/www/straped/mufon/more/5247_submitter_file1__sighting2006NWFlorida.jpg","/var/www/straped/mufon/org/5247.html"],"trends":["There have been no other sightings in Blountstown","This sighting has never been favorited."],"Date Submitted":"03/21/2006 12:00 UTC","Latitude":"30.443529","Summary":"Tear Shaped with a long tail, flashed colors, blue, red, and yellow","Object Shape":"Teardrop","divs":["Sighting DetailsI have never really believed in UFOs. I was sitting in the backroom of the house smoking a cigarette when I noticed clouds form. I guess I noticed the clouds because I had went threw a tornado months before and I am paranoid of the weather now. Anyway as I was smoking and looking at this cloud form I saw a tear drop looking object fly out from the cloud. It shot out so fast that if I had blinked I would have missed it. It glowed real bright as a light blue color then a dark red then a bright yellow before it was out of my view. It show down behind the tree tops and that was the last I saw of it. I was so shocked at what I saw that I ran into the kitchen and told my dad who I am taking care of. Of coarse he didnt believe me. I walked back into that same room to finish my cigarette that I had layed down in the ask tray. As I was sittiing there looking at the sky and that same cloud I had the creeps and my hair stood on end. I was still freaked out. I was thinking I wish I had my camcorder at that time. Then it had maybe been 5 minutes after I saw the thing that I seen airplanes go by. I remeber thinking that maybe they were looking for that thing I had seen. I didnt give my name because if it got out that I reported this in this town people would run me out. I did give my e-mail if you want to ask me questions. And if you want I will take pictures of the area I seen it fly. Just wanted someone to know because it was on my mind so much. That saying seeing is believeing is true. Now I dont know what to think of life. P.S. I found this site from the History Channle. I am attaching a scetch I did. I am not a good artist."],"map":"<A HREF = \"http://maps.google.com/maps?q=30.443529,+-85.045195(5247)&iwloc=A&hl=en\"> mufon case (5247) map </A>","Source":"MUFON"}