{"Object Shape":"Diamond, Disc, Flash, Sphere, Star-like, Triangle","Weather Factors":"Unknown","Source":"MUFON","divs":["Sighting DetailsI just went outside and noticed object in the sky. I went and got my family to come outside and look. I went and got my phone with no minutes but the camera still works. I was able to get 3 pictures- I will buy minutes soon and send the pictures to you guys. These are the first pictures I have ever taken before. I talked my son into also taking pictures and attempt to put them with his report. My family cannot stand me even taking an interest in this matter. The fact is I am the victim of Alien Abduction. I was taken back in Sept-2006 en-route to work for US Customs and Border Patrol in Montana. No-one would believe me!! I take care of myself and make reports with you guys when I sight something. This is major tonight. I have noticed something that looked the same following me for the last 2 weeks. I know when these beings are in the area!! They are here. I am not afraid- Im thinking they are just doing the usual and just keeping track of where Im at. I dont think they are going to come down. These beings can beam down from the sky- but hopefully they want. The issue that bothers me a little is the Red solid something I saw beside of the really bright starlike object. The starlike is not a star- it may be a satelite- I will check the internet when possible- could be a planet? Jet flew by- in the area"],"Summary":"I went outside and just noticed - My son and I got pictures- he attempted to send them, and also may have created a report. My family gets upset with me every time I even talk about UFO or what has happen to me. I do not understand why?","Log Number":"US-11282013-0007","Case Number":"52477","Longitude":"-81.535646","City":"Shelby","Sighting Duration":"Undisclosed","Date of the Event":"11/28/2013 06:20 UTC","Latitude":"35.292351","Country":"United States","Region":"North Carolina","map":"<A HREF = \"http://maps.google.com/maps?q=35.292351,+-81.535646(52477)&iwloc=A&hl=en\"> mufon case (52477) map </A>","Object Features":"Dome","files":["/var/www/straped/mufon/html2text/52477.html.txt","/var/www/straped/mufon/org/52477.html"],"trends":["There have been 3 other sightings in Shelby","There were no other sightings in Shelby on or around November 28th 2013"],"Date Submitted":"11/28/2013 07:18 UTC","Disposition":"Unresolved","Object Flight Path":"Stationary","Tags":"City","Viewing Distance":"Unknown"}