{"City":"Sun City","Source":"MUFON","divs":["Sighting DetailsI was inside working on the computer when my mother came into the room and said I had to come outside to see this strange light. I noticed it was the only bright object in the sky. The skies were clear at the time. The time was about 6:55 pm mnt I grabbed my phone and turned on Google sky map. there was nothing there but a constellation. At first I thought it might be a plane. My naked eye saw one big white bright light. But it never moved. It seemed as if it was hovering or staying in place. So I thought maybe it might have been moving away from me to make it appear it was staying still. I grabbed my camera and started to take still pictures. Then I made a video and zoomed in. The weird thing was to my naked eye it looked like a white light. I'm guessing it was 5-10 miles way from me. but I'm really not sure. when looking through the video, there were all kinds of colors coming from it. but I didn't see the colors with just my eyes. On the video it was changing colors. Blue, red, orange, purple, white. I remembered where I was standing and waited to see if it moved. For maybe 5 mins it was in place then it either moved further away or was descending. eventually it went below my viewing eyesight. When I first saw the object. it looked like one white light. 15 mins before I lost sight. there were at least 3 objects. the middle one was on top. I closed one eye ad looked. then another eye and looked. The other witness said they also saw 3 lights and not just one."],"Longitude":"-112.301625","trends":["There have been 2 other sightings in Sun City","There were no other sightings in Sun City on or around November 28th 2013"],"Latitude":"33.590864","map":"<A HREF = \"http://maps.google.com/maps?q=33.590864,+-112.301625(52485)&iwloc=A&hl=en\"> mufon case (52485) map </A>","Case Number":"52485","Object Features":"Unknown","Disposition":"Unresolved","Log Number":"US-11292013-0001","Object Shape":"Oval, Star-like, Triangle","Summary":"Bright light in the sky that caught our eye","files":["/var/www/straped/mufon/html2text/52485.html.txt","/var/www/straped/mufon/org/52485.html"],"Viewing Distance":"Over One Mile","Date of the Event":"11/28/2013 07:03 UTC","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","Country":"United States","Region":"Arizona","Tags":"City","Date Submitted":"11/29/2013 12:03 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed"}