{"Log Number":"US-11292013-0004","map":"<A HREF = \"http://maps.google.com/maps?q=35.327632,+-82.412026(52488)&iwloc=A&hl=en\"> mufon case (52488) map </A>","Date of the Event":"11/28/2013 07:15 UTC","City":"Hendersonville","divs":["Sighting DetailsWhile traveling west on Dana Road, taking my mother-in-law home from Thanksgiving dinner, I was looking at how bright Venus was in the night sky. I noticed three lights in a triangular pattern. Two were about the same elevation above the ground and one higher than the other two. They were traveling west to east and moving fairly fast. I first thought I was looking at airplanes and then I realized that they were steady orange lights that were not blinking. I could see stars between the lights and they were also too close together to be commercial airplanes. I actually said out loud, what the hell is that. My 12 year old daughter then started watching them too. We continued watching them for about five minutes until we turned on Tracy Grove Road and lost sight of them behind the trees. One of the lights disappeared before we lost sight of the other two behind the trees. It just seemed to vanish. After dropping my mother-in-law off at her apartment, near the corner of those two roads, we went back home traveling in the opposite direction on the same roads and never saw the lights again. We looked for them and my daughter talked about it all the way home. She actually said she was a little scared. I have never seen anything before that I could not easily explain as an airplane or a satellite and I would just like to know what we saw tonight."],"Date Submitted":"11/29/2013 12:44 UTC","Tags":"City","Object Flight Path":"Straight-line path","Case Number":"52488","Viewing Distance":"Unknown","Summary":"Three orange lights over Hendersonville","Region":"North Carolina","Weather Factors":"Unknown","Source":"MUFON","Disposition":"Unresolved","Longitude":"-82.412026","files":["/var/www/straped/mufon/html2text/52488.html.txt","/var/www/straped/mufon/org/52488.html"],"Object Shape":"Star-like, Triangle","Country":"United States","Latitude":"35.327632","Object Features":"Unknown","trends":["There have been 9 other sightings in Hendersonville","There were no other sightings in Hendersonville on or around November 28th 2013"],"Sighting Duration":"00:05:00"}