{"Country":"United States","Object Features":"None","Viewing Distance":"Unknown","Summary":"Not sure what I saw. Took me so off guard. Especially after hearing about something similar in montreal only 2 days ago.","Date of the Event":"11/28/2013 07:55 UTC","divs":["Sighting DetailsI had just finished work at 1930 and was headed to the hockey arena to pick up my oldest daughter and my son . My thoughts were busy from the day's events and what I still had to do before going to bed. I pulled into the parking lot and sent my husband a text to let him know I was there and to send the kids out as he was staying with our other daughter at the rink. I was watching for my kids and when they came out I noted that my 2 year old son was without a hat. I looked up to see the temperature gage to check the outside temp when in the corner of my eye I saw what I thought was a shooting star. I expected it to disappear but as it got closer it got larger and slower than a shooting star. When I was staring at it straight on I could see a blue ball the size of the harvest moon. It was bright and glowing. Blue to lighter blue then surrounded by white light. As it was exiting my field of vision I could see what I thought maybe a trail or tail. I am not sure about that. But in front of the ball the sky was brighter than behind it. The object then disappeared over the tree tops. I heard no noise. I looked around my daughter was buckling my son in his car seat and there wasn't another person in the parking lot. I am convinced someone else in the city had to have seen it. The object was too large for only me to have seen it. At that moment I felt like this experience was to extraordinary to not be shared."],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Region":"New Brunswick","Source":"MUFON","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/52480.html.txt","/var/www/straped/mufon/org/52480.html"],"Object Shape":"Fireball","Case Number":"52480","Latitude":"40.494216","Tags":"City","Object Flight Path":"Straight-line path","City":"New Brunswick","map":"<A HREF = \"http://maps.google.com/maps?q=40.494216,+-74.448239(52480)&iwloc=A&hl=en\"> mufon case (52480) map </A>","Longitude":"-74.448239","Log Number":"CA-11282013-0010","Date Submitted":"11/28/2013 10:07 UTC","trends":["There have been 6 other sightings in New Brunswick","There were no other sightings in New Brunswick on or around November 28th 2013"]}