{"Longitude":"-119.416532","Summary":"lights going up over ocean. disappeared. Then about a minute later a white circular object","Country":"United States","Weather Factors":"Unknown","Latitude":"36.784021","map":"<A HREF = \"http://maps.google.com/maps?q=36.784021,+-119.416532(52489)&iwloc=A&hl=en\"> mufon case (52489) map </A>","Date Submitted":"11/29/2013 12:59 UTC","files":["/var/www/straped/mufon/html2text/52489.html.txt","/var/www/straped/mufon/org/52489.html"],"Object Flight Path":"Other","Date of the Event":"11/28/2013 07:30 UTC","City":"Undisclosed","Log Number":"US-11292013-0005","trends":[],"divs":["Sighting Detailswe were out walking around 7 :30 and heading home on our street. Going from west to east. We observed 5 or 6 bright lights in close formation. We thought it was odd on how they were moving. Then two more objects also appeared to follow the other objects. Each object disappeared. They came out of the horizon from the Newport Beach area. Most likely these objects were over the ocean. First we thought it was something from Vandenburg. But Vandenburg is to the the north. These objects were from the south. From the horizon to about 80 degrees and then disappeared. About one minute later, a small white circular object appeared and moved from south to North and went from about 60 degrees to the horizon where we lost it. Usually we can find out what happens by searching on the internet or local news. But nothing so far. We just would like to know what these were. We think they may have been small rockets since we saw one of them do a flare out as it was about 80 degrees over the horizon. Could you find out what these were? We are just curious Thank you. I hope others saw this two. It was really easy to see and odd that they disappeared."],"Sighting Duration":"Undisclosed","Case Number":"52489","Tags":"City","Object Features":"Unknown","Viewing Distance":"Over One Mile","Object Shape":"Other","Disposition":"Unresolved","Source":"MUFON","Region":"California"}