{"Object Features":"Unknown","Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=33.678333,+-117.166944(52487)&iwloc=A&hl=en\"> mufon case (52487) map </A>","files":["/var/www/straped/mufon/html2text/52487.html.txt","/var/www/straped/mufon/org/52487.html"],"trends":["There have been 4 other sightings in Menifee","There were no other sightings in Menifee on or around November 14th 2013"],"Date Submitted":"11/29/2013 12:38 UTC","Latitude":"33.678333","Longitude":"-117.166944","Country":"United States","Region":"California","divs":["sighting detailsi was driving two high school age children home after school on 11\\14\\13 when we noticed several objects hovering at a height of 1\\2 a mile to maybe 1 mile? if there had only been one in the sky, one could have mistaken it for an airplane or jet, possibly a balloon or helicopter...it became very clear to us however, whatever we were looking at were both reflecting off the sun and hovering in formation for approx. 10 minutes before slowly flying away in the direction of big bear and at a slow ascent until they could no longer be seen with the naked eye; at first i tried coming up with explanations, asking the kids if they could be small clouds or possibly jets. they definately weren't birds or balloons. they simply were just unidentifiable, no explanation! i noticed that several cars had pulled over and were watching the same thing, so i decided to pull over as well at which time another car parked in front of me to view the objects. we took some pictures using an ipod before the objects started flying away. we tried taking a video, but couldn't get the objects into focus. funny thing is i've seen ufos before, but never had witnesses with me, so now my ufo stories don't seem so crazy. i now don't go anywhere without my camera, video camera and binoculars, i'll be ready next time!"],"Source":"MUFON","Date of the Event":"11/14/2013 03:05 UTC","Tags":"City","Log Number":"US-11292013-0003","Weather Factors":"Unknown","City":"Menifee","Case Number":"52487","Summary":"5-7 objects reflecting the sun and hovering before ascending in direction of Big Bear","Sighting Duration":"Undisclosed","Object Shape":"Triangle, Unknown","Viewing Distance":"Unknown","Disposition":"Unresolved"}