{"Longitude":"-71.628447","map":"<A HREF = \"http://maps.google.com/maps?q=43.855854,+-71.628447(52497)&iwloc=A&hl=en\"> mufon case (52497) map </A>","Latitude":"43.855854","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Date Submitted":"11/29/2013 06:53 UTC","Summary":"20 to 30 ufo's going east to west","Region":"New Hampshire","divs":["sighting detailsit's hard for me to put in words,call or email me if needed. i looked out my bedroom window looking at the stars while laying in bed and saw 20 to 30 star like ufo,s going east to west in a cluster than forming 3 v's before going out of sight because they were to far away,there was nothing in the way to hinder my view..this lasted for about 20 to 30 seconds. these were not satilites or the many military jets i see all the time.they were to fast and to high for them.the sky was clear and only the stars were out,perfect for viewing.this was also not the first time i have seen them. 6 mos.ago i saw something amazing i can't put into words.my wife also saw five or 6 of them a few mos. ago on her way to work.i have heard of other people seeing these things in the area also.i had to tell this to sombody because i have told friends and they just give me the look u know?.i have 15\\20 vision and do not drink or take drugs this was the most exciting thing i have ever seen in my life except for maybe my other sighting about 6 mos. ago. and know this was not aircraft.sorry for the spelling.again feel free to call or email me."],"trends":["There has been one other sighting in Campton","There were no other sightings in Campton on or around November 29th 2013"],"Object Shape":"Circle","Tags":"City","Object Features":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/52497.html.txt","/var/www/straped/mufon/org/52497.html"],"Country":"United States","Case Number":"52497","Date of the Event":"11/29/2013 04:30 UTC","Log Number":"US-11292013-0013","Viewing Distance":"Unknown","City":"Campton","Disposition":"Unresolved"}