{"Disposition":"Unresolved","Object Shape":"Other","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Case Number":"52498","Source":"MUFON","Date Submitted":"11/29/2013 07:27 UTC","Date of the Event":"11/29/2013 06:40 UTC","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsI took the dog out and was looking at the few remaining stars in the sky. One of them appeared to be moving. I looked closely for a few seconds and realized not only was it moving, it was one light, no blinking lights like planes have. I called to my friend to come out and bring the binoculars. The light made odd movements, almost as if it were jumping to the right or to the left in short spurts. There was no sound. When I got the binoculars I saw the shape which was all light. It looked like a bell shape on the bottom with a little dome on top. The craft did not look very big at all. I had seen this same light before about a month ago but did not report it because I thought it might be a drone and did not get a closer look as I did with the binoculars today. The craft came in from a northwest direction and as it jumped around it moved towards a south direction and then disappeared from my view line. My friend saw the light with no blinking lights however was attending to the dog while I looked with the binoculars. We had another incident in February that blew our minds. I think the 11W corridor may be a flight path of some sort for these visitors. Amazing!"],"Tags":"City","Latitude":"35.521691","Summary":"Early morning odd moving light when viewed with binoculars looks like mini dome of light","map":"<A HREF = \"http://maps.google.com/maps?q=35.521691,+-86.572887(52498)&iwloc=A&hl=en\"> mufon case (52498) map </A>","trends":[],"Object Features":"Dome","Log Number":"US-11292013-0014","City":"Undisclosed","Weather Factors":"Unknown","Longitude":"-86.572887","files":["/var/www/straped/mufon/html2text/52498.html.txt","/var/www/straped/mufon/org/52498.html"],"Country":"United States","Region":"Tennessee"}