{"files":["/var/www/straped/mufon/html2text/52494.html.txt","/var/www/straped/mufon/org/52494.html"],"Region":"Alberta","Tags":"City","Country":"Canada","Log Number":"CA-11292013-0010","City":"Edmonton","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=53.547279,+-113.488027(52494)&iwloc=A&hl=en\"> mufon case (52494) map </A>","Case Number":"52494","Object Features":"Unknown","Disposition":"Unresolved","Date Submitted":"11/29/2013 03:05 UTC","Latitude":"53.547279","Viewing Distance":"Over One Mile","divs":["Sighting DetailsAt around 11 at night, a bright pulsating light appeared over the horizon and increased in brightness. It then began to move frequently in many directions, changing its pattern as well as observable light characteristics during the hour it was observed. The UFO was seen over Fort Saskatchewan, a small town 20 minutes North East of Edmonton, Alberta. This object was seen by 4 individuals, video taped by 1 and then disappeared before we could properly investigate. These objects are appearing more and more frequently in this area, increasing from one a month, to one a week. Other sightings have included 1-3 objects in close proximity. All were observed for around an hour at a time, before flashing brightly and disappearing. These are still ongoing. All parties felt nervous then overwhelmingly frightened after observing the object, having feelings of being watched. One individual became suddenly overcome with vertigo and vomited. I personally felt as if something was scratching at the back of my mind, and would not go away for almost 4 hours. All who observed the object are fine currently, but become anxious if the subject is brought up."],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Summary":"At around 11 at night, a bright, pulsating light appeared over the horizon and increased in brightness","Object Shape":"Blimp, Circle, Diamond, Oval, Sphere","trends":["There have been 70 other sightings in Edmonton","There was one other sighting in Edmonton on or around November 28th 2013"],"Longitude":"-113.488027","Source":"MUFON","Date of the Event":"11/28/2013 11:00 UTC"}