{"Region":"California","Summary":"sighting in broad daylight of hovering cylindrical object. a humming sound was noted. there were occupants who appeared through observation windows of the object.","Case Number":"52490","Longitude":"-117.797869","Object Shape":"Blimp, Cylinder","Source":"MUFON","files":["/var/www/straped/mufon/html2text/52490.html.txt","/var/www/straped/mufon/org/52490.html"],"Viewing Distance":"20 Feet or Less","Latitude":"34.029839","City":"Pomona","Log Number":"US-11292013-0006","Sighting Duration":"Undisclosed","Date Submitted":"11/29/2013 01:08 UTC","Weather Factors":"Unknown","Object Flight Path":"Stationary","Date of the Event":"06/15/1956 12:00 UTC","trends":["There have been 16 other sightings in Pomona","There were no other sightings in Pomona on or around June 15th 1956"],"Tags":"City","Object Features":"Window(s)","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.029839,+-117.797869(52490)&iwloc=A&hl=en\"> mufon case (52490) map </A>","divs":["Sighting DetailsWhen I was 4 or 5 years old (1956-57) I was playing in my backyard. There seems to be a blank as to any preceding events, but I remember standing alone with my head down. I remember hearing a humming noise. I did not immediately look up, but listened for a few seconds. When I looked up, I saw a craft that I can best describe as looking like an airplane with no wings or tail. There were what appeared to be observation windows located along the side of the craft. There were occupants in the craft looking directly at me. The object was hovering between my house and our neighbor's house to the south, approximately tree top height (trees nearby were mature walnut). I stood and looked up at the craft and occupants for several seconds. The occupants were humanoid. I do not recall any unusual features except that they had what I would describe as a serious or intent look. There was no real expression on their faces. I can't say exactly how many occupants there were, but it was more than 3. Initially I did not feel frightened, but after several seconds I remember feeling an intense fear come over me. I screamed and ran into my house. I actually blocked this memory for about 12 or 13 years until I saw a depiction of a similar craft in a book on UFOS I picked up in my high school library. The memory came rushing back and rather frightened me. I came home and asked my mother if there was any unusual incident she could remember regarding me and a frightening experience I might have had when I was 4 or 5. She recalled that about that time I had run screaming into the house repeating over and over that \"the airplane was going to get me\". She said after that it was weeks before I would go outside. She said I was apparently terrified about something. The one thing that troubles me is that the event occurred in broad daylight and in a tract neighborhood (Westmont, located in Pomona, CA. I don't know how a craft like that could have been hovering relatively low to the ground and no one else saw it. That I just cannot explain. I will say that while this was the only time I can say I viewed a craft, there have been other unsettling experiences over the next 30 years or so after my initial recollection of this event. My first husband coincidentally reported an incident that occurred when he was about the same age I was when I had my sighting only his was an actual encounter with beings that involved missing time and amnesia of the event by other family members who were present. I don't want to go into details of this or my own later experiences unless this organization feels it is worth exploring. This memory in particular has haunted me for a long time. It would be nice to know if there is a simple explanation or if this really could have been an alien encounter. I don't talk about this much because frankly I don't want to be thought of as a kook."],"Disposition":"Unresolved"}