{"Object Shape":"Sphere, Star-like","trends":["There have been 4 other sightings in Romulus","There were no other sightings in Romulus on or around September 19th 2013"],"Viewing Distance":"Over One Mile","Sighting Duration":"01:05:00","Object Features":"Unknown","City":"Romulus","Weather Factors":"Unknown","Tags":"City","Latitude":"42.25412","Country":"United States","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Date of the Event":"09/19/2013 02:15 UTC","Summary":"I have had close encounters in the past, mainly after attempting communication. This time it worked again and others saw too.","Case Number":"52504","Date Submitted":"11/29/2013 08:43 UTC","Longitude":"-83.42297","map":"<A HREF = \"http://maps.google.com/maps?q=42.25412,+-83.42297(52504)&iwloc=A&hl=en\"> mufon case (52504) map </A>","files":["/var/www/straped/mufon/html2text/52504.html.txt","/var/www/straped/mufon/org/52504.html"],"Log Number":"US-11292013-0020","Source":"MUFON","Disposition":"Unresolved","divs":["Sighting DetailsIn Florida, I attempted communication as part of my studies, and had three close encounters of the third and fourth kind. Police stopped me, somehow they knew what I was doing immediately. I've been in Michigan for a few months and was outside on the back patio with my skeptic Mother. I told her I have communicated before and she wanted to see it. I had a digital voice recorder with me and as we stared up at the sky, we asked them to talk with us. We then observed 4 yellow star like object very rapidly come into the middle of the sky and into a formation hovering high above us. It was like they were posing as stars. Then we observe huge shadowy waves that sweep the sky when they are around, like an energy field. I asked if they have a message for Earth and the objects started zipping around like bacteria in a glass. I felt dizzy and kind of scared. My voice recorder was on so I stopped it and played it back. On it was something that sounded like someone took part of a tv program and used it to give a message, even tho it was so late, no noise was around at all and no tvs were near by. The playback had a sound of church bells before a speech which was as this: \"Children, he's not ready so do what you have to do..I believe.\" This sounded like an African American preacher, and you could hear faint voices of a congregation in the background of hysteria. Then as fast as it was there, there was nothing. The lights in the sky had then joined and became one object and moved towards a tree and hovered, then just disappeared."],"Region":"Michigan"}