{"Date of the Event":"11/29/2013 06:53 UTC","Object Features":"Unknown","Summary":"Bright Yellow light appeared stationary at first then moved position","Disposition":"Unresolved","Case Number":"52507","Object Shape":"Circle","Viewing Distance":"Over One Mile","Country":"United States","Latitude":"44.37801","Tags":"City","Object Flight Path":"Unknown","trends":["There have been 2 other sightings in Whitefield","There were no other sightings in Whitefield on or around November 29th 2013"],"City":"Whitefield","Source":"MUFON","divs":["Sighting DetailsThe first sighting occurred thanksgiving night i was looking out my window it was a black sky no stars then there was this very bright light that seemed to sit still for a few minutes so i didn't think much other then it was a really bright star but then it appeared to move up then spiral back and i couldn't believe what i saw no plane i know can move like it did and then a minute later it spiraled again and then it just vanished and i stared out the window and ran to other windows and couldn't find it again. The next night November 29th i saw the same light hovering above the tree line and it was around just before 7 pm it hovered and i watched it for about 5 minutes then i ran to get my camera to try to capture an image of it, i zoomed in out the back door and took a couple pictures that caught the object. I took a few minutes to review the images and was astonished and excited and by the time the object was there but it was lower in the sky, in the trees and it was harder to see, then it was just gone. It was me and my dad saw it as well. every few minutes i check to see if its there again and its just gone, it did not move like a plane it was a bright yellow ball of light. The images below are what i saw and i intend to keep my eyes peeled on the skies."],"Log Number":"US-11292013-0023","files":["/var/www/straped/mufon/html2text/52507.html.txt","/var/www/straped/mufon/org/52507.html"],"Region":"New Hampshire","map":"<A HREF = \"http://maps.google.com/maps?q=44.37801,+-71.606541(52507)&iwloc=A&hl=en\"> mufon case (52507) map </A>","Weather Factors":"Unknown","Longitude":"-71.606541","Date Submitted":"11/29/2013 10:00 UTC","Sighting Duration":"Undisclosed"}