{"Object Flight Path":"Path with directional change","Log Number":"US-11292013-0022","Date Submitted":"11/29/2013 09:30 UTC","trends":["There has been one other sighting in Hatfield","There was one other sighting in Hatfield on or around November 21st 2013"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.284895,+-75.275695(52506)&iwloc=A&hl=en\"> mufon case (52506) map </A>","Longitude":"-75.275695","Region":"Pennsylvania","Date of the Event":"11/21/2013 06:00 UTC","Latitude":"40.284895","Sighting Duration":"Undisclosed","Country":"United States","files":["/var/www/straped/mufon/html2text/52506.html.txt","/var/www/straped/mufon/org/52506.html"],"Object Shape":"Flash, Star-like","Disposition":"Unresolved","Tags":"City","Object Features":"Unknown","City":"Hatfield","Viewing Distance":"Unknown","divs":["Sighting DetailsI was coming home from grocery shopping at Giant on Maple ave when I first saw it. It was a single medium brightness white light that was pulsating. When the white light was 'turned off' it was a small bluish light, pale blue, then, the light would ' grow' into a brighter larger white light, then the white light would shrink back to the small bluish white light and grow again to bright white light... I noticed it to the east and it was moving southeast to northeast. At first, I thought is was a plane or helicopter. Something was different about it, so it caught my attention and I kept looking at it. I also followed it. At this point, I no longer thought it was a plane or helicopter but a UFO. So, instead of going home, I followed it for a few minutes until I couldn't follow it anymore. I went to school road park and it flew over the trees and I lost it. I decided to go back home, so I kept driving straight on school road park to turn onto Orville road and head back home. To my amazement, there was the object again, now visible over a clearing... however, it was NOT going in that direction before I lost it. It would have had to have 'jumped' to get to that new position in the sky from where I last saw it to be where I saw it now. Weird. Anyhow, it flew over route 309 and I couldn't follow it any longer. I wanted to get it on video with my phone, but as I was fumbling with my phone, I didn't want to take my eyes off of the object, I didn't want to miss anything. It happened rather quickly and I didn't have chance to catch it on video with my phone. For now on, I will have my phone ready for these things."],"Case Number":"52506","Weather Factors":"Unknown","Source":"MUFON","Summary":"Single pulsating white light, when it was 'off', pale blie light."}