{"Longitude":"-86.970648","Object Shape":"Diamond, Star-like","trends":["There have been 72 other sightings in Nashville","There were no other sightings in Nashville on or around November 29th 2013"],"Date Submitted":"11/29/2013 09:09 UTC","Summary":"{nd} BRIGHT star like flashing. Grey diamond shaped under zoom lens. showed bands and patterns. watched it turn.","map":"<A HREF = \"http://maps.google.com/maps?q=36.127986,+-86.970648(52505)&iwloc=A&hl=en\"> mufon case (52505) map </A>","divs":["Sighting DetailsWe were at home which sits on the top of a high hill just SW of Nashville about 20 miles. We noticed a curiously bright planet like star near SIRIUS location or Venus. It was there about an hour and a half. Put the video camera on it to see it closer up. It was like a squared off diamond shape. The top was a pretty blue. there were moving patterns on it. Sometimes white bands from bottom of the diamond slowly moved up in bands. then there was an X. There were changes in colors. subtle changes. From the naked eye it was beautifully sparkling six pointed star bigger than other planets. Red and yellow flashes. At one point we watched it rotate. It is predominately grey. When it rotated, it looked like a thin card. four of us were watching this. Not sure if it is Sirius or Venus but how do you explain the things we were seeing? Then we left the camera on it and went inside to get warm. When I went out a few minutes later, that particular star or UFO was gone. The other stars were still there. Im feeling a sense of AWE. Excited. Curious and open and searching for answers. Just enjoyed the entire event. Sorry we didnt see it disappear. Maybe we captured it on video. After dinner we will put the video online to see if we can determine how it disappeared. Let me know how to add a video to this...I cant do it at the moment."],"Object Features":"Patterned Surface","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Country":"United States","Tags":"City","Object Flight Path":"Stationary","Latitude":"36.127986","Source":"MUFON","files":["/var/www/straped/mufon/html2text/52505.html.txt","/var/www/straped/mufon/org/52505.html"],"Date of the Event":"11/29/2013 06:30 UTC","Region":"Tennessee","Viewing Distance":"Unknown","City":"Nashville","Disposition":"Unresolved","Case Number":"52505","Log Number":"US-11292013-0021"}