{"Date Submitted":"11/29/2013 04:54 UTC","Summary":"oval shaped light with black outer ring hanging inside a cloud","Disposition":"Unresolved","divs":["Sighting DetailsI was walking around my rig waiting on a tire repairman to finish changing my tire, when I noticed an oval shaped object inside a fog like cloud. I joked to myself that it was a UFO over downtown Knoxville, and thought wouldn't that be something? I pulled out my cell phone and took a picture, then zoomed in and took a second picture. Sorry no landmarks at bottom, my finger covered part of the lens. There were two planes moving around the object one turning above the object, I could see a flash of his wings as he turned, the second was flying next to the object, leaving a trail behind it.I could not I'd the planes, too small, but concidering it was flying at a 45 degree angle, over a city, I assume it was a military plane. Note, there were storms in the background, and there was supposed to be a full moon, but I did not see it. I thought maybe it was a reflection of the moon, but it was just before sunup,still twilight outside. And the object changed from oval to round as it turned downward inside the cloud. There is a dark area at the top right of the circle which looked almost like a w, without the middle section of the letter. It also had some white lines which to me looks like the cloud is rolling upon the downward edge of the craft. I estimate that the jets moved from 10,000 feet to about 25,000 feet within 2 minutes time. And if that is correct, it would make the object between 2 and 3 miles wide. It appeared disc shaped with the top side almost glowing white, and the outer ring black, with a curved edge. I took the two photos, and the repairman yelled at me, and I went and took a few pics of my damaged tire, and went back to look at the object in the cloud again, and it seemed to have disappeared , but the cloud still gloed a little, as if the object was flat, but I could no longer see it. My question is ..why would 2 planes be around it if there wasn't anything there? Also, I watched the weather that evening which had a radar from morristown, tennessee, and thought I saw a blip on the radar during the time lapse radar report. I would like to get a copy of that report. It was there about 2 minutes, then was gone. I have two photos."],"files":["/var/www/straped/mufon/html2text/52502.html.txt","/var/www/straped/mufon/more/52502_submitter_file1__P82A0131.JPG","/var/www/straped/mufon/more/52502_submitter_file2__P82A0132.JPG","/var/www/straped/mufon/org/52502.html"],"Object Flight Path":"Stationary","Longitude":"-83.918619","Log Number":"US-11292013-0018","Sighting Duration":"Undisclosed","Case Number":"52502","trends":["There have been 50 other sightings in Knoxville","There were no other sightings in Knoxville on or around September 19th 2013","This sighting has never been favorited.",""],"Viewing Distance":"Over 1 Mile, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.970298,+-83.918619(52502)&iwloc=A&hl=en\"> mufon case (52502) map </A>","Region":"Tennessee","Object Shape":"Disc, Egg, Oval","Date of the Event":"09/19/2013 05:25 UTC","City":"Knoxville","Latitude":"35.970298","Tags":"City","Weather Factors":"Unknown","Country":"United States","Object Features":"Other","Source":"MUFON"}