{"files":["/var/www/straped/mufon/html2text/52513.html.txt","/var/www/straped/mufon/org/52513.html"],"Object Features":"Window(s)","divs":["Sighting Details I went outside about 4:30 PM on Thanksgiving afternoon, just as the sun was setting and looked to the south. It was a cool, clear, crisp fall evening. I stayed out until 4:45 PM. I was looking for anything strange in the sky. The moon, stars or planets were not out yet, and I didn't see any exceptionally strange, but I did see a lot of small bright orbs zipping and whizzing around. At first I thought it to be a meteor shower. They seemed to be appearing and then disappearing as if to go in and out of phase. Was this a type of cloak? I went back inside to get my my wife and a pair of binoculars around 5:00 PM. After returning to my front porch there was a very bright star like object in the southern sky. Nothing had been there before I went inside. It seemed that it just appeared out of nowhere. I viewed the object through the binoculars and it looked like those smaller objects had attached themselves into a cluster on the outside of this larger object. I think the larger object was in stealth mode or possibly out of phase until it suddenly appeared. The large object was shining bright and slowly rotating. It looked to be sending a white beam of light out to the sides and also down to the ground. The large object was definitely a HUGE triangle, it looked to be jet black with hundreds of what appeared to be orbs attached around the edges. They almost looked like windows. Weird stuff for sure. The small orbs would detach , zip around, and then reattach to the main ship. After I went inside both my wife and I felt real light-headed and nausea stricken. My wife even threw up. Strange indeed. I am going to have to get MUFON up here to record this while I can still see it. I just want to know what it is and why it's here."],"Object Shape":"Star-like, Triangle","City":"Newburg","Sighting Duration":"Undisclosed","Region":"Missouri","Summary":"Huge bright star like triangle with attached orbs","Longitude":"-91.891383","Source":"MUFON","Log Number":"US-11302013-0002","Disposition":"Unresolved","Tags":"City","Viewing Distance":"Over 1 Mile, Unknown","Latitude":"37.91335","Weather Factors":"Unknown","Country":"United States","Date Submitted":"11/30/2013 01:11 UTC","Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=37.91335,+-91.891383(52513)&iwloc=A&hl=en\"> mufon case (52513) map </A>","trends":["There have been 2 other sightings in Newburg","There were no other sightings in Newburg on or around November 28th 2013"],"Case Number":"52513","Date of the Event":"11/28/2013 04:30 UTC"}