{"Object Shape":"Disc","Longitude":"-117.904742","trends":["There have been 17 other sightings in Santa Ana","There were no other sightings in Santa Ana on or around September 8th 1979"],"Source":"MUFON","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.743093,+-117.904742(52512)&iwloc=A&hl=en\"> mufon case (52512) map </A>","Region":"California","Weather Factors":"Unknown","divs":["Sighting DetailsDuring the fall of 1979, I was eleven years old at the time. It was about 3 or 4 pm when I went out to the front driveway. I saw my neighbor Jack, a very old African American man, standing a few feet into the street between both our houses. Jack's house was adjacent to my mom and dads house. Anyway, I walked out to see what he was doing. I always visited with jack because he had this insect collection in a fish aquarium in his garage and I always found it interesting to look at them. Jack always hung out in his garage. He would sit on a folding beach chair and just smoke or listen to his radio I guess. Anyhow, this time I saw Jack doing something a little different. He was just standing in the street gazing up at the sky. I walked over and asked him what he was doing. He said to take a look up or maybe he motioned with his hand and pointed. That part I don't remember, but the part I do remember is when I looked up at the sky and immediately saw two silvery discs visible between some white clouds. They were completely still,motionless. Jack must have seen them originally from his garage and probably saw them there for some time but I only saw them for a few seconds. They looked slightly smaller than the size of a dime actually, each of them. It was mesmerizing to see them. For the few seconds I saw them, They surely burned themselves into my memory forever. Especially when they rotated at about a 40 to 45 degree angle and shot up between the clouds at an unbelievable speed. They blurred or flashed out of view up through the clouds and it was all over as fast as it started for me. I was so excited to have seen such a thing that I ran into the house and excitedly told my mom and dad that I just saw two discs in the sky and I told them what they did and that Jack saw them too, but they really didn't care or believe me I think. I'm now 45 years old and I can still see those discs up there clear as a bell. Silver, no detail, no apparent engines, NO NOISE, no surface detail visible whatsoever. They were simply and purely two silvery discs that demonstrated amazing gravity defying and speed capability and it was impressive as hell. I will never say it's technology from some place other than Earth,I can't possibly know that. Thinking about it today, I feel it's VERY possible that some group here on Earth figured out how to do this and so that's where I stand. I know flying discs ARE REAL, they do exist because I saw them with my own eyes and so did someone else standing right next to me. Those were machines constructed by someone out there."],"Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"09/08/1979 12:00 UTC","City":"Santa Ana","Tags":"City","Sighting Duration":"00:00:12","Case Number":"52512","Summary":"2 stationary silver discs, motionless for seconds suddenly rotated at 45 degree angle, shot up instantly.","files":["/var/www/straped/mufon/html2text/52512.html.txt","/var/www/straped/mufon/org/52512.html"],"Disposition":"Unresolved","Object Features":"None","Date Submitted":"11/30/2013 12:50 UTC","Log Number":"US-11302013-0001","Object Flight Path":"Hovering then path","Latitude":"33.743093"}