{"Longitude":"-65.506119","files":["/var/www/straped/mufon/html2text/5254.html.txt","/var/www/straped/mufon/org/5254.html"],"Object Shape":"Triangle","Date Submitted":"08/31/1996 05:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=47.03,+-65.506119(5254)&iwloc=A&hl=en\"> mufon case (5254) map </A>","Source":"MUFON","divs":["Sighting DetailsIt was about 5:30 in the morning while I was out hunting moose on the Mullinstream road. I stopped at a spot that I knew had lots of moose and was sitting there before the sun came up. It was an overcast day with high clouds. There was a slight northwesterly breeze as there was a tall tree (still with leaves) just behind where I was parked. Just about the time when I could actually see within the treeline I noticed an object rise above the treeline at about a few kilometers (estimated). My first thought that it was a helicopter. I observed the object as it ascended into the air and I could distictly make out that it was moving away from me at about a thirty degree angle. It proceeded on it's trajectory for about a minute, or so it seemed, and then it stopped and turned towards me. At this point it was about a forty five degree angle from the horizon. I watched this thing approach and remember telling myself that it had no sound. It was close enough that if it were the helicopter that I thought that it was that I would have heard it by now. As it got yet closer to my postion I got the idea to put my rifle scope on it so as to get a better look at it. It passed directly overhead and I made no sound what-so-ever. I watched the object pass over me through my scope and could clearly see that is was triangular in shape and that it had five lights on it. The point of the object had a blue light and the four remaining lights were orange with no markings on the rear end of it. I can also remember thinking that I should take a shot at it but decided against such action...out of fear of what might happen....lol. I watched the object go pass me until I could not see it any longer with the naked eye, which was about a twenty minute duration. By the way it seemed to me that it was dark grey in color (almost like charcoal) and the thing made absolutely no sound what-so-ever. This is an honest account of what I saw that morning and I didn't tell anyone for quite some time...for fear of ridicule. This is my story of what I witnessed on my hunting trip. James Denny Jr."],"Case Number":"5254","Weather Factors":"Windy, Light","City":"Miramichi","Date of the Event":"08/31/1996 05:30 UTC","Sighting Duration":"Undisclosed","trends":["There have been 4 other sightings in Miramichi","There were no other sightings in Miramichi on or around August 31st 1996"],"Object Features":"None","Latitude":"47.03","Region":"New Brunswick","Log Number":"CA-08162006-0001","Object Flight Path":"Straight-line path","Summary":"The object was charcoal grey in color and had four orange lights and one blue light...no sound!!!","Disposition":"Unresolved","Viewing Distance":"101-500 Feet","Country":"Canada","Tags":"City"}