{"Date Submitted":"05/22/2005 12:00 UTC","Latitude":"36.569683","Log Number":"US-08162006-0002","Longitude":"-115.670576","Date of the Event":"05/22/2005 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile","Case Number":"5255","City":"Indian Springs","divs":["Sighting DetailsIn 1990, on the way back to my home in california, coming from New Mexico, i stopped off at the Tropicana Casino in Las Vegas and played black jack into the night.I went to the restroom around 4 am and on my way back to the tables i stopped and watched a peculair individual walking up the stairs. This person had a hat and sunglasses on, yet something wasn't right with the way he was walking or climbing the stairs. It looked like he was stuck in mud,his knees sorta came out to the side as he tried raising his feet to take the next step. I noticed also that there were about 3 more that looked just like him at the top of the stairs,yet some taller. They all were skinny,tall,and i recall noticing thier whitish like hair that seemed to shimmer as if light was bouncing off it ,i had never seen hair like this before . My reaction at the time was what a freak ,i repeated to myself. The one on the stairs stopped ,turned, looking at me, the others at the top were looking down at him and me. I felt guilty for staring at a freak ,decided to get back to my table. At the table i immediately tell the dealer ,who was friendly, that man did i see some freaks. He asked what they looked like and i described them. He calmly said ,oh you saw them, there from Spain. It wasn't until i heard Charles Hall interviewed in '05 ,that i made the connection of this event. As a matter of fact ,i had thought my mind was playing tricks on me (i do have a good memory) so i lately had to delve back into my memory to recall all detials of this event. I was able to recall all details prior ,durring and after this (occured on a new moon in May '90) . So, after emailing Charles and finding out that one might be able to contact the Talls by camping on Blm land around Indian Springs, i went out and bought a 4wheel drive and headed to Indian Springs. I found what i felt was a good place to camp and on only 2 occasion did i see tall activity. Late one night thier scout craft approached me ,i signaled my light at it and called out Hello Tall Whites ,please land ,i want to be your friend etc , the ship stopped and then went into reverse and hid in these low level clouds (in the direction of French Pk). Another night ,i saw 2 leviating talls towards the back area of Cactus Springs ,which is next to Indian Springs,on blm land.It was early in the evening around 930-10. The one landed and changed the brightness of its light ---to real bright, the other had it on low ,yet it decended down from the ridge top. They hung out there for about 15 minutes. I signaled and stayed put. The one danced around back there, it seemed to be enjoying itself,i felt. Anyhow, the lights turned off,i couldnt see them, i started to hike thier way but it was too far to hike plus nothing going on anymore ,so i turned around. I had to learn the dirt road better anyhow ,since thier was a gulley that made it hard to hike all the way. There turned out to be a longer road to get there, i later camped there,but no more sightings occured. I gave up and became very frustrated trying to contact them,i might try another day. I definately believe that the Talls are real and that they are around Indian Springs, but they must be alot more private then they were in the 60's. For one the AFB has grown in size and population and thier are MP's 24-7 covering alot of ground. My guess is that the Talls might be exiting out the back ,between Warm Springs and Rachel??? Or threw the town of Mercury. I've shared this information in person with Charles ,by phone with Linda Howe and Dr Boylan ,M Salla. I am not selling anything ,nor do i want to become noticed. I just wanted to communicate with what i feel are the good aliens"],"trends":["There has been one other sighting in Indian Springs","There were no other sightings in Indian Springs on or around May 22nd 2005"],"Source":"MUFON","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=36.569683,+-115.670576(5255)&iwloc=A&hl=en\"> mufon case (5255) map </A>","Summary":"I camped out near their base and saw thier ship and on another night them,etc.","Object Features":"None","Country":"United States","files":["/var/www/straped/mufon/html2text/5255.html.txt","/var/www/straped/mufon/org/5255.html"],"Region":"Nevada","Tags":"City","Sighting Duration":"Undisclosed","Object Shape":"Egg","Weather Factors":"Unknown","Object Flight Path":"Path then hovering"}