{"trends":["There have been 25 other sightings in Fremont","There were no other sightings in Fremont on or around August 13th 2006"],"Date Submitted":"08/13/2006 01:00 UTC","Disposition":"Unknown","Date of the Event":"08/13/2006 01:00 UTC","Country":"United States","Source":"MUFON","Case Number":"5258","Object Flight Path":"Undisclosed","divs":["Sighting DetailsThis is probably nothing but it was clearly strange. My husband and I were at an old staging area for the Alameda Creek Trail in Fremont that continues on out into the sf bay wetlands. Quite deserted at the time. The weather was pleasantly warm there was only a slight breeze with no gusts. The sky was completely cloudless except for one strangely shaped rectangular cloud that sat apparently unmoving. I use a wheelchair when we go on the trail and as my husband was taking it from the car I was watching the cloud and mentioned it's unusual appearance. I sat down and the chair drifted backwards and I took my eyes off the cloud formation for a period of perhaps 20 seconds. When I looked up the cloud had completely disappeared not a wisp. I mentioned it to my husband who is very much a skeptic and he commented that was strange also. My feeling was that cloud was obscuring something else. Having seen some of the reports of rectangular clouds the move at unnatural speed it prompted me to report this. It was in an area where there are often multuple criss-crossing classic case \"chem-trails\" I'm sure there could be a number of explanations for the rapid dispersion of the formation but it left me with the feeling that it was some other than a natural occurance."],"Longitude":"-121.983252","Latitude":"37.55802","Weather Factors":"Unknown","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/5258.html.txt","/var/www/straped/mufon/org/5258.html"],"Sighting Duration":"00:10:00","Log Number":"US-08162006-0005","Region":"California","Tags":"City","Object Shape":"Square, Rectagular","City":"Fremont","Summary":"not a vehicle but a strange cloud formation","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.55802,+-121.983252(5258)&iwloc=A&hl=en\"> mufon case (5258) map </A>"}