{"Log Number":"US-08172006-0001","map":"<A HREF = \"http://maps.google.com/maps?q=39.777916,+-86.156044(5260)&iwloc=A&hl=en\"> mufon case (5260) map </A>","Object Flight Path":"Straight-line path","divs":["Sighting DetailsMy wife & I sit out in the back yard several nights a week watching the sky. We have never seen a ufo until Saturday night August 12th at 10:00 PM.We were waiting on the meteor shower to start, when this thing came into view.It was opaque and disc shaped.traveling from straight up to a southwestern direction.We have lived by the airport and seen about any type aircraft you can name.I am an X military man and served during the Nam era.We have never reported a UFO before to anyone, because we haven't seen one. That is till Saturday.A perfect night, no haze, no clouds and the humidity was down.Stars were a plenty.This disc shaped thing was like a bulls eye target. Center was pinkish, next ring faded to a yellow, and the outer ring was orange.Guessing the height at about 10,000 ft I would say it was traveling very fast;maybe as much as 10,000mph. Not as fast as a meteor but a lot faster then a satalite(which is higher) It was traveling straight south by southwest and in a hurry. It was not bright at all. Just seemed as though the inside lights were shining through the outer skin.Only lasted about 3-4 seconds and went behind my house, out of sight. It clearly WAS NOT a spotlight. It was NOT an airplane. It had no outer lights and left no trail or sound. Nothing.I sent this report before, but got no response. After all these years of watching, and I finally saw something. I'm 67 years old and I am NOT looking for publicity or anything. NO one came and took me aboard, and I've never seen an alien. I was wondering if there were any other reports from Indy folks about this? The whole thing looked as though it was behind a shower curtain or something. Sort of blury yet I could make out what I discribed.If you extend your arm out and look at your thumbnail, it was about that size.A few minutes later we DID see some meteorites fly over fast as a zip. This was not traveling that fast.If it WAS 10,000 feet up we're talking about an object the size of a 747. Please respond and let me know if anyone else saw this thing. Thanks Ron"],"Object Shape":"Circle, Disc","Sighting Duration":"00:00:04","files":["/var/www/straped/mufon/html2text/5260.html.txt","/var/www/straped/mufon/more/5260_submitter_file1__UFOAug12th2006.jpg","/var/www/straped/mufon/more/5260_submitter_file2__FountianSquare01.JPG","/var/www/straped/mufon/more/5260_submitter_file3__FountianSquare02.JPG","/var/www/straped/mufon/more/5260_submitter_file4__FountianSquare04.JPG","/var/www/straped/mufon/org/5260.html"],"Disposition":"Unresolved","City":"Indianapolis","Date of the Event":"08/12/2006 10:07 UTC","Case Number":"5260","Viewing Distance":"Over One Mile","Country":"United States","Object Features":"Dome","Region":"Indiana","Date Submitted":"08/12/2006 10:07 UTC","Source":"MUFON","Latitude":"39.777916","Summary":"traveled across Indy sky, straight overhead for approxamately 4 seconds","Weather Factors":"None","Longitude":"-86.156044","Tags":"City","trends":["There have been 126 other sightings in Indianapolis","There were no other sightings in Indianapolis on or around August 12th 2006","This sighting has never been favorited.",""]}