{"Region":"Pennsylvania","Weather Factors":"Unknown","divs":["Sighting DetailsON a clear night I was sitting outside of my apartment smoking a cigarette, looking up at the stars. An object came into my view, it had 3 circles that made a triangle shape, 2 in the rear and 1 in the front. I say front and rear only because it was moving forward in a direction with the 1 circle in the lead. It made no noise and was almost transparent(light gray or almost white). It was hard to judge the altitude, but if I had to guess using the large pine tree across the street as a reference point I would say it was about 50-200 feet in the air. It did not make any erratic manuvers nor did it have any lights and seemed to not be powered by any engines. There was no smoke or exhaust of any kind that I saw. It just smoothly glided in a straight path across the sky. I only saw it for a few seconds and unfortunetly I was alone. Initially I thought it might have been a spiders web floating (I see them all the time but mostly during the day)or some kind of lights, but when it didnt chage shape or size or direction I could clearly see the features of the object. It also seemed to me, because of the object almost beig transparent that it might of been hard to see it on a bright sunny day. My initial feeling was \"what in the hell was that\", no one is going to belive me, and I am a skeptic so how am I going to convince myself. But I know what I saw and I dont think I am crazy. So take it or leave it this is the only place I found to report a sighting, there isnt any numbers in the phone book to report something like this. I dont know if you will need to contact me but I would be happy to answer any questions you might have, so in turn I can get my questions answered, because I cant come up with any rational explanation to what I saw. Thanks"],"City":"Altoona","Case Number":"5261","Country":"United States","Log Number":"US-08172006-0002","Date of the Event":"08/16/2006 10:55 UTC","Date Submitted":"08/16/2006 10:55 UTC","Sighting Duration":"Undisclosed","Object Features":"Unknown","Tags":"City","Object Flight Path":"Straight-line path","Viewing Distance":"101-500 Feet","Summary":"I saw an unidentified flying object","Object Shape":"Circle, Triangle","Source":"MUFON","Disposition":"Unknown","Latitude":"40.518681","files":["/var/www/straped/mufon/html2text/5261.html.txt","/var/www/straped/mufon/org/5261.html"],"Longitude":"-78.394736","map":"<A HREF = \"http://maps.google.com/maps?q=40.518681,+-78.394736(5261)&iwloc=A&hl=en\"> mufon case (5261) map </A>","trends":["There have been 20 other sightings in Altoona","There were no other sightings in Altoona on or around August 16th 2006"]}