{"files":["/var/www/straped/mufon/html2text/5262.html.txt","/var/www/straped/mufon/org/5262.html"],"Log Number":"US-08172006-0003","Object Features":"Patterned Surface","Sighting Duration":"Undisclosed","Region":"California","Summary":"The Object had No wings and it was huge it looked like a Long Garbage Truck (Tall with gadgets protruding all over)with a small amount of brown smoke trailing the object","Tags":"City","Longitude":"-121.262717","Object Shape":"Other, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.133007,+-121.262717(5262)&iwloc=A&hl=en\"> mufon case (5262) map </A>","Date Submitted":"08/16/2006 07:09 UTC","divs":["sighting detailsi was on my way home from the starbucks with my two children ages 7 and 4 and my son asked me what that truck was doing flying in the sky! i looked and there it was flying from south to north about the height of a passenger jet usually flies, and this object had no visible wings it literally looked like a huge brownish beige colored beat up ship of some type, i put my sunglasses on to get a better look and i could see a brown slight trail of smoke coming from the back end. we were amazed because it wasnt all smooth like a blimp it had some good indents and features that looked like an huge old beat up looking truck. i have only seen on other unidentified object over sonora about 4 years ago but it looked nothing like this was a very detailed object. the speed that it was traveling was so slow at first and then it seemed to pick up speed very quickly, but my family watched the entire event and was utterly amazed for 10 minutes. i'm a college grad and my job is considered a high profile one, so i would like to remain anonymous. thank you. p.s. the object was flying\\floating in a continous line across the skyline almost in a jerky motion almost like it was unstable in the air but it glided through the air with no noise whatsoever. i usually dismiss objects that i'm not sure what they are but this one was so differant like it didnt belong in the air at all. we lost sight from the houses in the neighborhood. thats all thanks"],"City":"Lodi","Date of the Event":"08/16/2006 07:09 UTC","Object Flight Path":"Path with directional change","Source":"MUFON","Viewing Distance":"Over One Mile","trends":["There have been 20 other sightings in Lodi","There were no other sightings in Lodi on or around August 16th 2006"],"Disposition":"Insufficient Data","Country":"United States","Weather Factors":"Unknown","Case Number":"5262","Latitude":"38.133007"}