{"Date Submitted":"08/17/2006 09:03 UTC","Country":"United States","Date of the Event":"08/17/2006 09:03 UTC","City":"St John","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.448333,+-87.476667(5273)&iwloc=A&hl=en\"> mufon case (5273) map </A>","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/5273.html.txt","/var/www/straped/mufon/org/5273.html"],"Longitude":"-87.476667","Log Number":"US-08202006-0001","Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Disposition":"Unknown","Case Number":"5273","Region":"Indiana","divs":["sighting detailson august 17, 2006 at just after 9:00 p.m. i had pulled into a gas station off hwy 41 near st john\\cedar lake indiana. glancing up i noticed seven large disk in a military type formation approaching from the northeast. they seemed to be moving fairly slow.truly taking time to figure what it was i was witnessing i concentrated on them believing at first it was just a large type aircraft, like a stealth with running lights on. there were 7 \"lights\" in total.four across then one slightly behind on the left and two slightly behind on the right together looking like a flying wedge. as they approached though the two disk on the right pulled closer to the four flying across and dipped slightly down, while the single light on the left pulled closer to the four and dipped up and above the front four. now losing its original formation it confirmed that this wasn't one aircraft with seven running lights. the now seven disk moved closer. they seemed maybe four to five hundred yards up. they weren't moving very fast. almost to seem like blimp speed, but then they turned heading almost straight north over lake michigan. once heading north they took off at a great speed and elevated at a remarkable pace. they where a clear almost flat white color, no beaming light. they were large like a standard size door. they made no sound. when they turned around they were nearly straight above me. had they made sound i would have heard it. i waited a hour then contacted both the st john and cedar lake police departments just to see if anyone else reported anything. as of that time i was the only caller. for what its worth i am a six year veteren of the usaf as a law officer. stationed at both sac and tac bases. i have seen my share of aircraft. civilian and military. these were neither."],"Summary":"7 disk size of doors in near military formaton, only to manuver around each other.white in color.300 yds,soundless yet quick.","Latitude":"41.448333","Object Shape":"Disc","trends":["There has been one other sighting in St John","There were no other sightings in St John on or around August 17th 2006"],"Source":"MUFON"}