{"City":"Burlington","Object Features":"Window(s)","trends":["There have been 13 other sightings in Burlington","There were no other sightings in Burlington on or around July 12th 1972"],"Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/5274.html.txt","/var/www/straped/mufon/org/5274.html"],"Object Shape":"Disc","Case Number":"5274","Weather Factors":"Unknown","Longitude":"-73.204542","Sighting Duration":"Undisclosed","Country":"United States","Source":"MUFON","Date Submitted":"07/12/1972 12:00 UTC","Log Number":"US-08202006-0002","Latitude":"44.480312","Region":"Vermont","Tags":"City","Date of the Event":"07/12/1972 12:00 UTC","divs":["Sighting DetailsI was 12 years old and playing in a sand box with my older brother. It was warm, sunny, beautiful summer day. My mom was getting lunch ready for the family. We were relaxing between the farm chores of the day. I was playing, deep in thought when I felt a sort of warm breeze blow across my back which was turned away from the mountain. It was a erie feeling that made the hairs on my back raise. It wasn't a sound but a sort of vibration feeling. Something I had never felt before. I stopped playing and looked up and over my right shoulder and saw what looked like 3 dark-grey saucers hoovering about the mountain. I was mesmerized. I couln't take my eyes away. I started to holler to get someone's attention. The brother I was playing with just had ear surgery with a large gauze bandage covering his ear and couldn't hear what I was trying to say. Another older brother heard my screams. He was sitting in a kitchen chair backwards in the open front door enjoying the breeze. Once he realized something was up he moved in his chair to see what I wanted. I have always been a quiet, content child who didn't make a lot of fuss so this was a strange thing for me to be hollering. I remember I was still starring at the three objects and heard my brother slide his chair around to get a better look. It only took a split second but as soon as my brohter tried to get a look the objects they quickly mooved in a 90 angle pattern and withen a split second was gone from sight. If I had looked toward my brother or blinked my eyes, I would have missed the movement,they were that fast. My brother later said he did see some dark objects but they were a blurr when he finially focused on them. I was not a child to make up stories and my family knew I had seen something stange. I still wonder to that day if other people in the area saw the same thing. Other nearby towns would be Duxbury,Hanksville, Bolton...etc... I may be off the exact date in July of 1972 but I know I was 12 years old and witnessed something I couldn't explain and would always wonder about. I have always thought about being hipnotized but never did it. Sincerely, A witness of a strange sighting many years ago PS. Looking back, I felt like I was being watched. I was a child and it felt like I was being watched because of my youth and innocence. As soon as my brother who was an adult tried to see them; they quickly sped away. Strange!! Uh?"],"Summary":"There were 3-grey saucer-like disks hoovering about Camels Hump approx. 1000 ft. above the tip","map":"<A HREF = \"http://maps.google.com/maps?q=44.480312,+-73.204542(5274)&iwloc=A&hl=en\"> mufon case (5274) map </A>","Object Flight Path":"Hovering then path","Disposition":"Unknown"}