{"Disposition":"Unknown","Object Features":"Unknown","divs":["Sighting DetailsMy wife and I were renting a house in Holt, Michigan during the summer of 1961. We had been out and returned home about 10:00 p.m. When we got out of the car, I noticed that there was a full moon and some of the features were especially vivid and distinct. When we went into the house, I decided to get my binoculars to get a better look at the moon. My wife stayed inside. I remember leaning over the hood of our car and resting my elbow to support the binoculars. There was no traffic on our street and the night was quiet. Suddenly, I heard a rhythmic, swishing noise coming from my left. My first thought was that the noise was at street level, but quickly rejected that because there was no traffic. At that point, I knew that the noise was coming from above and traveling east to west. I could not see anything and could only hear this swishing sound. When the sound reached my line of sight with the moon, I was amazed to see a huge, oval shaped object that was traveling in a westerly direction. There were no lights; only the swishing noise and a flat-looking, gray oval shaped object. I tried to see the object with my binoculars but do not remember seeing much. Since there were very few clouds, I thought that it was unusual that I could not see this object until it was back-lighted by the full moon. When the object passed from under the moon, I could no longer see it but could still hear the swishing sound. I was somewhat familiar the the aircraft of that generation because I had been in the Air Force r.o.t.c. program at Michigan State and had opportunities to see different kinds of airplanes. I know that it was not and airplane, balloon or blimp. Although the actual sighting was 5-10 seconds, I could hear the swishing sound for 30-60 seconds. I am a salary retiree from General Motors and have a B.A. from Michigan State University. (Go Spartans)"],"Country":"United States","Source":"MUFON","Summary":"large, oval shaped & 2-dimensional looking. grey hue. swishing noise.","files":["/var/www/straped/mufon/html2text/5275.html.txt","/var/www/straped/mufon/org/5275.html"],"Object Shape":"Oval","Longitude":"-84.515254","Date Submitted":"08/20/1961 12:00 UTC","Log Number":"US-08202006-0003","Weather Factors":"Windy, Light","Case Number":"5275","Region":"Michigan","Latitude":"42.640591","Sighting Duration":"Undisclosed","City":"Delhi Charter Township","trends":["There have been 3 other sightings in Delhi Charter Township","There were no other sightings in Delhi Charter Township on or around August 20th 1961"],"Date of the Event":"08/20/1961 12:00 UTC","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=42.640591,+-84.515254(5275)&iwloc=A&hl=en\"> mufon case (5275) map </A>","Viewing Distance":"501 Feet - 1 Mile","Tags":"City"}