{"Country":"Iceland","Tags":"City","Date Submitted":"08/20/2006 11:30 UTC","Longitude":"-21.89521","Latitude":"64.135338","Date of the Event":"08/20/2006 11:30 UTC","Object Flight Path":"Straight-line path","Case Number":"5277","Disposition":"Unresolved","Source":"MUFON","Summary":"Lights in the sky","Object Features":"Unknown","Region":"Höfuðborgarsvæði utan Reykjavíkur","Object Shape":"Unknown","trends":["There have been no other sightings in Reykjavik","This sighting has never been favorited."],"Log Number":"IS-08202006-0005","City":"Reykjavik","files":["/var/www/straped/mufon/html2text/5277.html.txt","/var/www/straped/mufon/org/5277.html"],"Viewing Distance":"Over One Mile","divs":["Sighting DetailsThe house I live in is on the highest elevation in the city of Reykjavik with a superb view in every direction. My apartment is on the second floor and my balcony faces southwest and from it I can see the whole downtown area and beyond, the ocean stretching out to the horizon. With little pollution here, the view is often splendid. Tonight there is almost a clear sky, with only a bank of low lying thick cloud on the south west horizon. I don't smoke in the house, so I go to the balcony for a smoke and every time I do, I have a good look around for unusual lights in the sky, or whatever and until tonight I had not spotted anything unusual. At about 23.30 hours I went again for a smoke and a peek and as I opened the door I saw some bright lights in the distance that caught my eye. There were many white lights and one red blinking light in the centre, so naturally I assumed it was an airplane. I then started thinking that was an odd route for a big plane to take, there is no international airport in Reykjavik, but 50 km away in Keflavik and even if the flightpath is over the city, they have reached such an altitude by then, they go unnoticed below. The next thing I notice, is that the lights are over the sea, far from the city and moving in what seemed a slow flight, either towards me, or away. Then it struck me, that the distance between the lights would mean that this thing was huge, so I ran back inside to get my binoculars and rushing back to the balcony, was just able to see with my bare eyes how the lights lowered and disappeared into, or behind the cloudbank in the southwest. I spent many years as a sailor and learned to judge distances of weather fronts, as neccessity demands. This cloudbank is at least 50 km away, probably more like 75 km and as I stated lowlying. So standing there with my mouth agape in astonishment I quickly calculated that the object had to be almost as big as the city. My sceptical mind tried to come up with other explanations, but the distance of the cloud bank cannot be disputed by many km and therefor I write you this short report. Yes the red light in the centre blinked pretty much as you would expect a commercial airliner to do, but the distance simply does not compute to that explanation. End of report."],"map":"<A HREF = \"http://maps.google.com/maps?q=64.135338,+-21.89521(5277)&iwloc=A&hl=en\"> mufon case (5277) map </A>","Sighting Duration":"00:01:00","Weather Factors":"Unknown"}