{"Longitude":"-85.38331","Disposition":"Unknown","Date of the Event":"08/19/2006 03:00 UTC","divs":["Sighting DetailsMe and my 2 buddies were driving down I-69 this past saturday to Ball State University to visit some friends. As we got close to our exit, I think its exit 41, I noticed 2 black objects. I didnt really think much of it, until I noticed how they were moving. The were side by side, except one was a little higher than the other. They were still, then would move positions and kind of go back and forth, very odd movements. At that time I really couldnt believe what I was looking at so I told my friends what was going on, and I rolled down my window to get a better look at these things. We were getting off the exit and there was trees now in front of the objects. As soon as we exited and passed the trees, the objects had either gone away or they were obstructed by the clouds. Either way, it was a very strange and thats all I could talk about. My friends however did not get a chance to see the objects. I do engineering work for a software company and I do have access and do work on one of our F-16 bases near here. I see a lot of military aircraft and these 2 objects did not seem like conventional aircraft in the way they moved. Thanks for your time Jason"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.196187,+-85.38331(5278)&iwloc=A&hl=en\"> mufon case (5278) map </A>","Source":"MUFON","Sighting Duration":"Undisclosed","Country":"United States","Object Features":"Unknown","Log Number":"US-08212006-0001","Tags":"City","Object Shape":"Disc","Weather Factors":"Does Not Apply","Region":"Indiana","City":"Muncie","Summary":"2 disk/flat black object moving in formation","Viewing Distance":"Over One Mile","Latitude":"40.196187","Case Number":"5278","files":["/var/www/straped/mufon/html2text/5278.html.txt","/var/www/straped/mufon/org/5278.html"],"trends":["There have been 13 other sightings in Muncie","There were no other sightings in Muncie on or around August 19th 2006"],"Object Flight Path":"Path with directional change","Date Submitted":"08/19/2006 03:00 UTC"}