{"Summary":"UFO/ Jet Airliner near miss collision","Latitude":"42.480356","Sighting Duration":"Undisclosed","Tags":"City","Longitude":"-73.163414","Object Flight Path":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.480356,+-73.163414(5284)&iwloc=A&hl=en\"> mufon case (5284) map </A>","files":["/var/www/straped/mufon/html2text/5284.html.txt","/var/www/straped/mufon/org/5284.html"],"Object Features":"Undisclosed","Object Shape":"Sphere, Square, Rectagular, Triangle","Case Number":"5284","City":"Dalton","Region":"Massachusetts","Weather Factors":"Unknown","Log Number":"US-08212006-0007","Date Submitted":"08/21/2006 10:30 UTC","Viewing Distance":"Unknown","Date of the Event":"08/21/2006 10:30 UTC","Disposition":"Unknown","trends":["There have been 6 other sightings in Dalton","There were no other sightings in Dalton on or around August 21st 2006"],"Country":"United States","divs":["sighting detailsi had seen several possible ufo's starting at 9:30pm. first was a triangle ufo comming from the south\\west heading northeast. flying at a slow pace, and at a high altitude, around 20k agl. this object had a light in each corner, white, amber, with lights that flash and dance around them(red). flew out of sight. next, around 10pm i saw 2 lights(spheres) come from the outer atmosphere(northeastern sky) looking like a star, then it slowed down, and turned west\\southwest at a constant speed over the tree lines. seconds later, the second one did the same exact thing. lights where amber. lastly, i saw a ufo just miss colliding with a jet airliner. both were flying in a northernly direction , while both were flying closer and closer to each other. when i believe the jet finally saw the ufo, they were 10 to 15 seconds from hitting, when the jet banked to the northeast. this ufo was a square shape, with 4 lights in each corner. red, amber, green, and rose. 2 of the lights flashed like strobes. in the center of the bottom of the square was a light in the shape of a square that changed colors. the ufo continued it's northern direction until out of sight."]}