{"Sighting Duration":"Undisclosed","Longitude":"-70.076627","Tags":"City","Region":"Maine","Latitude":"44.019519","Summary":"Addendum to Abduction and direct comunication.","Log Number":"US-08222006-0003","Object Features":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/5287.html.txt","/var/www/straped/mufon/org/5287.html"],"divs":["Sighting DetailsHere we go again.....More ideas comming through from our alien being(s). There Brains are so much more powerful that i feel overwhelmed by the influx of information! it is giving me a headache....Now, I flunked calculus, I stink with computers and was never good at math, and never took physics, so you tell me if there is some sort of communication here??? OKAY WHAT THEY WANT TO INFORM OR MAYBE KNOW IF WE KNOW, ARE THESE FACTS: SOMETIMES WE NEED TO CALCULATE FROM ALL THAT IS KNOWN AND START LARGE IN EQUATION TO WORK OUR WAY BACKWARDS AND CALCULATE ALL THE IN BETWEENS. LIKE A DISTRIBUTIVE EQUATION ...TAKE ALL THE KNOWNS AND SOLVE FOR X Y Z.....SO HERE GOES....THEY SAY WE FORMULATE LIKE THIS: \"I CAN CALCULATE THE VELOCITY OF A MAN JUMPING IN THE AIR AND LANDING\" IN AN INSTANT THEY HAVE ALREADY CALCULATED MASS...VOLUME...DENSITY..AND PROBABILITY OF THAT ENTITY AS IT RELATES TO 1.) POSITION ON EARTHS SURFACE 2.) DISTANCE FROM THE EARTHS CENTER 3.) DISTANCE FROM THE EARTH TO THE MOON 4.) DISTANCE FROM THE SUN.. 5.) VELOCITY OF THE EARTH AS IT RELATES TO GRAVITY AND VELOCITY OF EARTHS ROTATION AROUND THE SUN (AND GRAVITATIONAL PULL OF THE MOON>???) SIMPLY PUT....HOW MUCH CAN WE CALCULATE OR ESTIMATE IF WE ARE ABLE TO \"CALIBRATE\" A MASS OR VOLUME AS IT RELATES TO ITS TINY POSITION ON THE EARTHS SURFACE....AS EARTH IS A SPHERE, EACH GPS POINT BEING AS A PIN ON A PIN CUSHION....COULDNT WE USE THIS EVEN TRACKING IT IN MID AIR AND THE PHYSICS INVOLVED IN ALL THE FORMULARIES TO INCLUDE GRAVITATIONAL EFFECT OF PLANETARY VELOCITY AND OR ROTATION AND FORCE? DO WE NOT HAVE TO LOOK AT ALL THE ANGLES TO CALCULATE WHAT IS NOT ONLY IN BETWEEN BUT ALSO WHAT MY BE \"PRODUCED\"????????"],"Date Submitted":"08/22/2006 12:00 UTC","trends":["There have been 5 other sightings in Lisbon","There were no other sightings in Lisbon on or around August 22nd 2006"],"Viewing Distance":"Unknown","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.019519,+-70.076627(5287)&iwloc=A&hl=en\"> mufon case (5287) map </A>","Case Number":"5287","Object Shape":"Unknown","Date of the Event":"08/22/2006 12:00 UTC","Country":"United States","City":"Lisbon","Object Flight Path":"Undisclosed","Disposition":"Hoax"}