{"Summary":"two lights moving very quickly at high altitude, swerving at right angles","Weather Factors":"None","Longitude":"-116.204076","Object Flight Path":"Path with directional change","Region":"Idaho","Date Submitted":"08/23/2006 12:00 UTC","City":"Boise","Disposition":"Unknown","Source":"MUFON","Object Shape":"Star-like","Object Features":"Unknown","Viewing Distance":"Over One Mile","Date of the Event":"08/23/2006 12:00 UTC","files":["/var/www/straped/mufon/html2text/5294.html.txt","/var/www/straped/mufon/org/5294.html"],"Case Number":"5294","Country":"United States","Latitude":"43.622331","divs":["Sighting DetailsMy husband and I were sitting outside at our patio table talking, around 10pm. I looked up at the sky and mentioned that the stars were out; it had been cloudy earlier so I noticed that it had cleared up. A few minutes later, my husband was looking up and said \"oh my god, look at that!\" and for a moment I wasn't sure if he was looking at the sky or at a lilac bush that was behind his head. He watched for a few seconds, we both got up, and he said he'd seen two lights moving very fast, they had almost intersected but they both turned abruptly and sort of looked like they were chasing each other. I saw one of the lights, moving very fast toward the southwest, then it disappeared. That was the last we saw of them even though we watched for another 10 minutes or so. They were very high; probably as high as a satellite (one of which we saw about 15 minutes later, moving slowly across the sky). We live in the city of Boise, not far from downtown. We both agreed that you never see anything flying that high moving as fast as these lights moved, nor anything swerve as he saw them doing."],"Tags":"City","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=43.622331,+-116.204076(5294)&iwloc=A&hl=en\"> mufon case (5294) map </A>","Log Number":"US-08242006-0003","trends":["There have been 69 other sightings in Boise","There were no other sightings in Boise on or around August 23rd 2006"]}