{"files":["/var/www/straped/mufon/html2text/5302.html.txt","/var/www/straped/mufon/org/5302.html"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.81114,+-116.416029(5302)&iwloc=A&hl=en\"> mufon case (5302) map </A>","Case Number":"5302","Object Features":"Unknown","Source":"MUFON","Date Submitted":"07/13/2006 11:00 UTC","Date of the Event":"07/13/2006 11:00 UTC","Viewing Distance":"501 Feet - 1 Mile","Region":"Nevada","Disposition":"Unknown","Object Flight Path":"Hovering then path","Tags":"City","City":"unknown","trends":["There have been 2 other sightings in unknown","There were no other sightings in unknown on or around July 13th 2006"],"Weather Factors":"Unknown","divs":["Sighting DetailsWell me and my mother were on a north west flight from minnesota to L.A. when we witnessed the ufo.We were both in our seats mine the window,heres the middle.it was about 11 o clock but im not sure.Anyway the hole time i was starring out the window watching the rolling clouds and such.when it happened we were over desert and it was just before we got into California(According to my mom).So im starring out my window and all the sudden i see this light above the clouds barely moveing.At first i thought it was a helicpoter or a firework.Then i realized it was far to high for either,even higher than the clouds.So i pointed it out to my mom and right as i turned back it was moving.With red and blue lights going round and round.It wasnt going that fast,but then what convinced us that it was out of the norm was when it just took off.Like nothing me or mother had ever seen.And we had seen a fighter jet earlier that flight.but this was soo much faster and just took off. We later on thought that it could have been a reflection,but even the clouds below had a faint red and blue light on them as it dissapered. So we our sure that what we have seen isnt of this world,or possibly not of our knoledge. Ryan N."],"Object Shape":"Blimp, Disc","Summary":"During flight sighting","Latitude":"38.81114","Country":"United States","Longitude":"-116.416029","Log Number":"US-08262006-0004"}