{"Summary":"Lights in clear daytime sky","Object Shape":"Circle, Flash, Other","divs":["Sighting DetailsYesterday (August 25, 2006) I was taking a few sky pictures and noticed this white streak in the sky. Sometimes the streak would have an object flash at one end of it and sometimes not. There were also other white objects in the sky during this scenario at the same time the streak was \"dancing\" around. This streak would move from one side of the sky (horizon) to the other side in a 'split second' and then stop and stay stationary for a few seconds. The streak would also disappear and then reappear sometimes in the same place and sometimes appear in another place. I watched all this going on for 30 minutes and there was no intermission, it was a continuous show for 30 minutes starting at 9:15AM and lasting till 9:45AM. I had my Camera and camcorder with me and took over 40 pictures that came out excellent. I will have to make three posts to show you what I saw. I will post this same message in all of them to avoid confusion in the event someone makes a post in between mine while I am posting mine. The MUFON investigator assigned to my case has a CD-ROM with all the pictures on it for reference if anyone is interested."],"Longitude":"-77.94183","Country":"United States","Region":"North Carolina","City":"Wilmington","Date Submitted":"08/25/2006 09:30 UTC","Object Features":"Undisclosed","Sighting Duration":"00:30:00","Latitude":"34.228116","Date of the Event":"08/25/2006 09:30 UTC","trends":["There have been 96 other sightings in Wilmington","There were 2 other sightings in Wilmington on or around August 25th 2006","This sighting has never been favorited.",""],"Tags":"City","Case Number":"5306","Log Number":"US-08262006-0008","map":"<A HREF = \"http://maps.google.com/maps?q=34.228116,+-77.94183(5306)&iwloc=A&hl=en\"> mufon case (5306) map </A>","Source":"MUFON","Weather Factors":"Does Not Apply","Object Flight Path":"Undisclosed","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/5306.html.txt","/var/www/straped/mufon/more/5306_submitter_file1__camstreak5.JPG","/var/www/straped/mufon/more/5306_submitter_file2__camstreak5en.JPG","/var/www/straped/mufon/org/5306.html"],"Viewing Distance":"Unknown"}