{"Longitude":"-97.401848","Latitude":"32.565612","Source":"MUFON","Disposition":"Unresolved","Region":"Texas","Log Number":"GB-08272006-0004","Object Features":"Dome","trends":["There have been 128 other sightings in Fort Worth","There were no other sightings in Fort Worth on or around November 30th 1971"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.565612,+-97.401848(5312)&iwloc=A&hl=en\"> mufon case (5312) map </A>","Object Shape":"Disc, Sphere","Case Number":"5312","Date of the Event":"11/30/1971 12:00 UTC","Object Flight Path":"Path with directional change","Tags":"City","divs":["sighting details1959 experienced a guided white light infront or at distance from the moon this was witnessed by my brother. again in 1972 a sphere was seen 'arching' for 30 mins approx..covering 30 miles in one arch and returning back and forth. this was around a village called 'brinklow' @ the end of the roman, 'fosse way'. another sighting of one later that year. willesden london 1974 i experienced a pesonal abduction with, 'now i know, now' - \"blondies\" (but did not know any catagories of aliens then) with pale features and blond hair. many people were in the same abduction. there was a round very large disk and the inerior was round skirted by windows. the aliens were examining quite a few people on tables of black supports and conversing with mental communication and not in speech. i provided the alien with some information and she\\he\\it said 'that i was not required'. i then was escourted away, however a lot of people were decending down this black staircase or ramp. i then felt a return to my room. prior to abduction the sheets of my bed were of a 'plastic' texture. i did not know then, of any 'types' of alien, only years afterwards did i learn of the alien groups. so by this aspect it could substantiate the abduction. there is much more to tell on this, so i do hope to be able to to relate to you, at a time in the future."],"Country":"United States","Date Submitted":"11/30/1971 12:00 UTC","City":"Fort Worth","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/5312.html.txt","/var/www/straped/mufon/org/5312.html"],"Summary":"I've experienced 3 UFO( Definate) sightings and had a possible (Personal) abduction","Sighting Duration":"Undisclosed","Weather Factors":"Unknown"}