{"Weather Factors":"Windy","Object Flight Path":"Hovering then path","Latitude":"42.638392","Viewing Distance":"101-500 Feet","Disposition":"Unknown","City":"Angola","Object Shape":"Diamond, Flash","Date Submitted":"08/16/2006 08:30 UTC","files":["/var/www/straped/mufon/html2text/5320.html.txt","/var/www/straped/mufon/org/5320.html"],"Log Number":"US-08282006-0005","Case Number":"5320","Date of the Event":"08/16/2006 08:30 UTC","Longitude":"-79.027816","trends":["There has been one other sighting in Angola","There was one other sighting in Angola on or around August 16th 2006"],"Region":"New York","Tags":"City","Source":"MUFON","divs":["Sighting DetailsSo, this was the 16th of this month. My friend (whom we'll call Vin) and I, at about 8pm, decided to visit another friend of ours, whom we'll call Ed. Ed has a boat, and lives in a more financially higher area here in Angola, Ny, right off of lake Erie. We decided to visit Ed after he had invited us for a bonfire and a boat ride. So after bulding a pretty good fire, enough to where we could see it from the lake, we made way into the water, into canadian waters. We had to have been going 30mph or however you measure it, wind in your hair, holding onto the boat as not to fall off, for about 15 minutes or so. We ended up turning off the boat, turning off the lights, and laid back, watched the stars, seeing some shooting stars. I was looking around, hoping i'd see a shooting star, as i seemed to be the only one who didnt see one. After 15 more minutes, I saw something very peculiar. Almost to the edge of the horizon, you could see niagara falls faintly.. Although we were in canadian waters, it was very far from the coast. In front of me, I saw it. It was far away, it seemed like a star, except it was so low i could see the lights of the city behind it. I didnt say anything to the others, as they were enjoying checking out the stars and talking about work and whatnot. I had alerted Vin and Ed of this thing's presence, as it seemed to move up higher into the air, hover for a second, and go up higher. I thought to myself, \"whatever that was just came out of lake erie!\" As i had gotten them both to look, in a flash, it was gone. the only thing i could explain it as, would be when you stand behind a car as it drives off into the horizon at night. You see a bright light, get smaller and smaller until you can faintly see it. With this object, it was all in a few seconds, as if it went very very fast into the atmosphere and into space. There was at least a minute or two of silence, i turned to see Vin in awe, mouth open and everything. I tried to piece together what i'd seen, i didnt want to jump to conclusions to what i saw. I told them what i saw, hoping that they'd seen the same, and they had. Feeling very eerie, (no pun intended), we started up the boat, and headed back to shore as fast as that boat could take us, put it on the hitch thing for the car, and sped away. It took me a day to actually replay wht happened, i ended up calling both friends to piece together what went on."],"Object Features":"Unknown","Summary":"large, diamond shaped, very bright","map":"<A HREF = \"http://maps.google.com/maps?q=42.638392,+-79.027816(5320)&iwloc=A&hl=en\"> mufon case (5320) map </A>","Sighting Duration":"Undisclosed","Country":"United States"}