{"Object Features":"Unknown","Summary":"Saw a small light in the sky moving around in odd directions","divs":["sighting detailsit was about 11pm in mid july when me and some friends were walking around we sat down on a curb for a break. the sky was clear that night so we were looking up. my friend points something out to me asking me what it is. it was a small light which looked like a star moving in the sky. i follow it with my eyes and it was speeding through the night sky. much faster then any plane or helicopter i had ever seen. while its going at this amazing speed it starts doing turns. it took a right turn the went straight again, then a another right turn, and then curved right and disappeared as if it went up into space. the whole siting lasted about 30-40 seconds. me and my friends were in awe afterwards. we know it could not have been a plane or helicopter because of the turns it was taking at a speed much faster then any plane or helicopter can go. i don't believe it was a shooting star either because shooting stars don't turn like that. heres a very rough direction of what the siting was like --------------------- | | ------------ | | ------- \\ \\ ---------"],"Case Number":"5337","Date Submitted":"07/16/2006 12:00 UTC","Date of the Event":"07/16/2006 12:00 UTC","Tags":"City","Latitude":"41.260673","Source":"MUFON","Log Number":"US-09022006-0001","City":"Omaha","Object Flight Path":"Path with directional change","Country":"United States","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.260673,+-95.993278(5337)&iwloc=A&hl=en\"> mufon case (5337) map </A>","Disposition":"Insufficient Data","trends":["There have been 83 other sightings in Omaha","There were no other sightings in Omaha on or around July 16th 2006"],"Object Shape":"Star-like","Longitude":"-95.993278","files":["/var/www/straped/mufon/html2text/5337.html.txt","/var/www/straped/mufon/org/5337.html"],"Region":"Nebraska"}