{"Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Stationary","Log Number":"US-09082006-0002","City":"Tucson","divs":["Sighting Details I was working night security at a defense contractor just south of the Tucson airport, at the south entrance kiosk with 2 other people. I looked up to the southwest and saw a large light hovering about 35-40 degrees up. Suddenly, another light came on beside it (about an inch apart from my perspective). Both lights were on for about 5 seconds then faded out. A few seconds later, 2 more lights appeared, vertically this time, same distance apart and on for the same duration. I said something to my co-worker and he looked up to see the 3rd event--4 lights in a vertical zig-zag pattern. Again, after about 5 seconds, they just faded out. The lights were circular, off-white with a ring of red and green around the outside--red on one side, green on the other but meeting at the top and bottom like a concentric circle. There was no sound and the lights just came on, hovered there and faded out like a switch had been turned off. Our first thought was fireworks or flares, but they would not be stationery. The local Air Guard did have some of their F-whatevers in the air but they were not in that part of the sky, nor did we see them in that area afterward. I suppose it's possible that it was the jets in formation, turning their lights on and off--some kind of coded visual signals? The lights would have been visible from both the airport and the nearby air force base. We see aircraft flying all night long, but neither of us had seen anything like this. It was very strange. Also, the \"headlights\" of the jets are a harsher, blue-white, while these had a more yellow tinge to them. Be curious to know if anybody else saw them or has a comment. Thanks"],"Summary":"disappearing lights in patterns","Case Number":"5362","Date Submitted":"09/07/2006 08:42 UTC","Date of the Event":"09/07/2006 08:42 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.224473,+-110.920409(5362)&iwloc=A&hl=en\"> mufon case (5362) map </A>","Object Shape":"Circle","Sighting Duration":"Undisclosed","Object Features":"None","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around September 7th 2006"],"Region":"Arizona","Source":"MUFON","Viewing Distance":"Unknown","Longitude":"-110.920409","Country":"United States","files":["/var/www/straped/mufon/html2text/5362.html.txt","/var/www/straped/mufon/org/5362.html"],"Latitude":"32.224473","Disposition":"Unknown"}