{"Summary":"egg-shaped object bouncing up and down, no noise, luminous","files":["/var/www/straped/mufon/html2text/5371.html.txt","/var/www/straped/mufon/org/5371.html"],"City":"Mt Pleasant","divs":["Sighting Details It has been many years, but I will never forget what I saw that cold silent night in early November of 1981. I was commuting to Central Michigan University, (Mt. Pleasant, Michigan) to finish up my B.A.A. Degree in Library Science. I was taking a late night course, which ran on Mondays, Wensdays, and Fridays from 10:00 pm to 12:00 am. One Friday evening I was driving home on a stretch of road which consisted of 2 lanes only, which my mother had informed me would be a short-cut home. No one else was on the road that late in the evening. I was headed for Cadillac, Michigan (my home town). I was living with my parents temporarily, until I got my degree, and a course-related job. I Looked up through the visor and saw what I thought was Venus. It loomed straight-ahead of the car, and very bright. I bent down for an instant to fumble with my purse, or turn on the radio ( I don't remember exactly what). When I looked up again to see Venus, It was no longer there. Startled, I pulled the car off of the road adjacent to a bridge-like gard rail. I got out and looked around. All was still, quiet, and dark. No cars anywhere. There were trees about a quarter of a mile in the distance off to my left hand side. As I scanned the sky for the light, I noticed to this left, over the expanse of trees, a strange egg-shaped luminous white object floating over the tops of these trees. There was no noise, nothing. It bobbed up and down very slightly like a yo-yo. I watched for a few minutes, then I decided that it was probably a balloon. I got back in the car and drove home. The next night, I saw it again over my neightbor's back-yard trees. A balloon does not follow cars home. My neighbor, Mrs. Sapatka saw it, and thought it might be a saucer. I went into the house to phone the police. The dispatcher sounded incredulous, but assured me that a military officer would contact me soon about the event. NO OFFICER EVER CAME. The following Sunday evening after church, I was driving Grandmother the 2 miles home, when out of the blackness, straight for our car, headed a helicopter. It had no markings and was dark green or black. It was coming so fast at us, it scared grandma and I half to death. It must have been only 15 feet off the ground. As it came towards us, there was a flash of white sparks, like a small explosian directly ahead of the copter. It then roared over the car and kept going. Grandma stuck her head out the passenger window and said, \"What on earth was that?\" I told her it looked like a copter was chasing something. My grandmother and Mrs. Sapatka have both since passed away. So much for my witnesses. I never mentioned it again to anyone. My parents didn't seem interested to begin with. I had another UFO expereince in the summer of the early 1990's. I was living with my sister, and working at Sears in Columbus, Ohio. I decided to go into town early one morning to garden shop. The neighborhood was a quiet culdesac, and everyone was still asleep. The sun had cast a pinkish-orange hue over everything. Birds were starting to sing. As I jostled with my car keys to open the door, (my car was parked across from the house on the street), I looked up and saw 3 flaming objects in a triangular formation stopped dead in the sky and very close. Again, there was no noise at all. The flames looked stangely animated, like those fakey halloween torches you might buy for decoration. The flames were a white-yellow color and were flickering downward. I did not notice anything else. I thought of flares later on, but there was no smoke emitted from these flames. I had heard no planes or jets fly over earlier. I went back into the house to grab my clipper camera, and when I came back out, the objects were gone. Again, I was too scared to contact anyone. Thanks for reading this. Michelle"],"Object Shape":"Egg, Fireball","Weather Factors":"Unknown","Log Number":"US-09092006-0005","Country":"United States","Sighting Duration":"Undisclosed","Case Number":"5371","Source":"MUFON","Longitude":"-84.767514","Date of the Event":"11/10/1981 01:30 UTC","Region":"Michigan","Latitude":"43.597808","trends":["There have been 11 other sightings in Mt Pleasant","There were no other sightings in Mt Pleasant on or around November 10th 1981"],"Object Flight Path":"Stationary","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.597808,+-84.767514(5371)&iwloc=A&hl=en\"> mufon case (5371) map </A>","Disposition":"Unknown","Date Submitted":"11/10/1981 01:30 UTC","Tags":"City","Viewing Distance":"501 Feet - 1 Mile"}