{"Weather Factors":"Unknown","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/5375.html.txt","/var/www/straped/mufon/org/5375.html"],"Longitude":"-94.195533","map":"<A HREF = \"http://maps.google.com/maps?q=44.903296,+-94.195533(5375)&iwloc=A&hl=en\"> mufon case (5375) map </A>","Latitude":"44.903296","Object Features":"Undisclosed","Log Number":"US-09112006-0002","Summary":"Videotaping lake, noticed ufo after the fact","Date Submitted":"09/05/2006 01:05 UTC","Object Flight Path":"Undisclosed","Case Number":"5375","Date of the Event":"09/05/2006 01:05 UTC","Region":"Minnesota","divs":["sighting detailsi've recently noticed a number of anomalous object in my pictures\\videos, and have formed the opinion that there are ufos around us more often than not, though probably \"cloaked\". to test this theory, i've been bringing my sony dscp100 digital camera with me to work (i'm a courier) and shooting a few minutes of video here and there, when i have time to stop. i have a route that i do every day, and pass thru a small town called silver lake, just out side hutchinson, mn. i have parked by the lake a couple times and shot random video of the sky over the lake, with the camera focused as wide as it will go. i then bring the footage home and inspect it at half-speed, to see if i can find anything. it seems that every time i've shot there, i come away with something unusual. this footage is the clearest so far, but it's hardly what i would call \"conclusive\". i try to note the times i see insects\\birds pass in front of the camera, so that i can disregard them, and i didn't see anything of the sort at this point in the video. also, judging by the speed and smoothness of the object's flight, as well as its flight path, it seems unlikely that it is a bird\\insect. but i'll leave it up to you to evaluate, since you're the experts. watch the upper left hand corner and you'll see the object enter the frame and make a semi-circular turn and exit the frame. also, there is what appears to be a second object that chases it, which comes from the bottom, mid-left portion of the screen. i am also including another clip from the same location, taken about a week prior to this sighting, which shows a ufo (quite possibly a bug) descend rapidly from the top mid-left of the frame, followed by a very odd black parallelogram that appears in the sky (mid-right of frame)for just a fraction of a second. i'd very much appreciate your expert opinion on this footage. thanks- t."],"trends":["There has been one other sighting in Silver Lake","There were no other sightings in Silver Lake on or around September 5th 2006","This sighting has never been favorited.",""],"Country":"United States","Object Shape":"Disc","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","City":"Silver Lake","Source":"MUFON","Tags":"City"}