{"Date Submitted":"11/30/1980 12:00 UTC","Weather Factors":"None","Viewing Distance":"Unknown","Log Number":"US-09122006-0006","Summary":"entity","Source":"MUFON","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/5392.html.txt","/var/www/straped/mufon/org/5392.html"],"Disposition":"Insufficient Data","Latitude":"36.782841","trends":[],"divs":["Sighting Detailsit was about 1981 and I was in Junior High. I was up late one night (probably a weekend* just watching television my family was asleep. Suddenly and for absolutely No reason I felt an overwhelming need to go outside....i didn't question it whatsoever ( which I would if that ever happened to me again* I just felt urged to go outside so I did...I took 2 or 3 steps into my backyard and there it was...it appeared to be crouched down hard on our fence ( I could possibly be mistaken and it was a tall entity that was standing behind the fence, I just dont know...but my sincere feeling is it was crouched down very hard atop the fence). A pure black being...blacker than the night with deep red very slanted eyes (no pupil.. and red like the color of blood)and a very low and constant hiss coming from it I froze and we were locked in a stare I could not get out of.. I could not move and I was never so frightened in my life...this thing did not feel postive in any way shape or form...and a thought that was not my own seem to come into my head and the exact words were \" I could tear you apart\" I am 38 now and I will never forget that....the entire face to face probably lasted no more than a couple of minutes as soon as i could i jumped back into the house and was convinced I had seen a demon. I could only explain it to myself in those terms at the time. I have never ever heard anyone speak of a black entity with deep red eyes but I know what I saw. It's skin wasn't like skin it was smooth, poreless, hairless...not a wrinkle..as smooth as still water but solid..a being. I did not see it's body but only its head it was human sized and it was Not a cat and I was Not dreaming. this truly happened to me. I had an Amazing ufo sighting last year..a spectacular event and it brought a lot of the memories of this thing back to me. I do not believe in any way that I am an abductee or anything like that. I was never touched by this thing and I have never seen it again. thank God. I'm so curious if Anyone has seen anything like this before."],"Longitude":"-119.412432","Region":"California","Object Shape":"Undisclosed","Tags":"City","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.782841,+-119.412432(5392)&iwloc=A&hl=en\"> mufon case (5392) map </A>","City":"Undisclosed","Country":"United States","Case Number":"5392","Date of the Event":"11/30/1980 12:00 UTC"}