{"divs":["Sighting DetailsOn Sunday, 03 September 2006 at or near 11:30 PM (2330 Hrs) E D T, while sitting outdoors looking across White Fish Bay toward Canada gazing at the red beacons from many electricity generating windmills on an island in the bay, I suddenly became aware of a brilliant gold-white sphere of light just below the cloud layer to my east. I was in a lawn chair and had binoculars with me. Seeing this light appear below the overcast my first thought was of an aircraft with its landing light turned on. As an airplane watcher I kept my eye on the light expecting to see and hear an aircraft approach directly toward me. I said nothing to my wife who was next to me tending our fire. I picked up my binoculars for a better view and noticed while watching the light that I was lowering the glasses to keep it in view as the surface of the lake was becoming visible. I realized the object was not heading toward me but instead was in a slow controlled, steady descent. As it neared the lake's surface its own brilliance formed a reflection on the water. As the object continued its descent the reflection on the water grew brighter and larger. The object, visible only as a ball of light (which may have hard a dark band across the center) lowered itself and the object and its reflection merged at the surface of the lake and the object was gone from view. As I watched the object it had descended into and below the surface of the lake. Not a ripple or other disturbance appeared on the surface. There was no dark outline of a landed craft. There were no sounds. There was never any steady, flashing, or strobing red, green, or white navigation lights as would appear on a conventional air or water craft. I continued to watch but nothing more was seen, just empty, still water. I eliminated all the mundane, prosaic things to come to mind; conventional aircraft, watercraft, meteors, fireballs, parachute flares, signal flares, balloons, etc... This object behaved like none of these things. It was not falling, not flickering and flaring, not drifting, not landing on the water,not hovering, not making sounds. It came through the cloud deck, slowly descended into the lake, and was gone. It took about a minute. I felt I had witnessed something unusual."],"Tags":"City","Case Number":"5393","Source":"MUFON","Longitude":"-85.033475","Summary":"Golden light descending into lake","City":"Paradise","Log Number":"US-09122006-0007","trends":["There have been 2 other sightings in Paradise","There were no other sightings in Paradise on or around September 3rd 2006"],"Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/5393.html.txt","/var/www/straped/mufon/org/5393.html"],"Object Flight Path":"Other","Latitude":"46.63527","Date Submitted":"09/03/2006 11:30 UTC","Disposition":"Unresolved","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=46.63527,+-85.033475(5393)&iwloc=A&hl=en\"> mufon case (5393) map </A>","Region":"Michigan","Country":"United States","Date of the Event":"09/03/2006 11:30 UTC","Weather Factors":"None","Sighting Duration":"00:01:00","Object Features":"Unknown"}