{"Tags":"City","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/5394.html.txt","/var/www/straped/mufon/org/5394.html"],"Viewing Distance":"21-100 Feet, 501 Feet - 1 Mile","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Object Features":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=43.672805,+-84.380554(5394)&iwloc=A&hl=en\"> mufon case (5394) map </A>","divs":["Sighting DetailsI was driving toward sanford on U.S. 10, West when an object with very bright lights on what appeared to be each corner(three) flew from the nort-northwest side of the expressway over it towards the south side of expressway. the object appeared to descend as it was doing this which led me to believe it was going to crash then as it banked sharply and started to hover over the trees on the south side I came across directly from it on my side of expressway. I pulled my truck over quickly and jumped out, the object had flew over toward the north-northeast(behindmeat thispoint) and I watched it disappear behind the tree line on the north side of the expressway. There were alot of cars Monday night coming and going on both sides and it was raining. I did not have my radio on and I went on home as I could not see it any more. I had allready passed stark road exit so this was between stark road and M-30 exit.Ever when I got out I could not hear any noise from this object and even with the traffic I feel it was close enough to me that I should have heard something. I see well without my glasses but better with them, I had them on and I am not hard of hearing.I also believe that many other people had to of witnessed parts of this but I did not see anyone else stop.This is the third report I filed because I don't think mufon recieved my first one because I hit a wrong key and my report dissapeared unfinished. I am a nursing student at Delta college and of sane mind."],"Source":"MUFON","Longitude":"-84.380554","trends":["There have been 4 other sightings in Sanford","There was one other sighting in Sanford on or around September 11th 2006"],"Case Number":"5394","Log Number":"US-09122006-0008","Summary":"Saw what appeared to be a very large object with bright unwavering or blinking lights fly over road in front of me.","Latitude":"43.672805","Date Submitted":"09/11/2006 12:00 UTC","Object Shape":"Triangle","City":"Sanford","Date of the Event":"09/11/2006 12:00 UTC","Country":"United States","Region":"Michigan","Disposition":"Unresolved"}