{"files":["/var/www/straped/mufon/html2text/5397.html.txt","/var/www/straped/mufon/org/5397.html"],"Case Number":"5397","Object Shape":"Disc, Sphere, Star-like, Unknown","Disposition":"Unresolved","Date of the Event":"09/10/2006 12:00 UTC","Object Features":"None","Object Flight Path":"Unknown","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI had Multiple Object sightings Sunday Sept 10 in the Delray Beach, Florida Area. The first was a Black disk to my east around 2:10 PM emerge from a cloud then fade to nothing in about 4 seconds. The second sighting was at 7:10 PM to my west and it was a very high black object almost moving towards the west. The Object seemed to be spinning or moving around as if slowly floated, it was very high so I could not see much detail but my vision told me it was spinning. The third was at 8:10 pm (notice the times were all 10 after the hour) this Object was to my east and glowing as bright as the North Star and it was in the 12:00 position then descended downwards very slow to the 6:00 position then got to low and disappeared. Anyone who was looking in that direction would have seen it. So thats three sightings in one day of different objects. I took this Video while filming a thunderstorm on August 21 in Delray Beach, Fla. I didn't noticed anything until I recently looked at the video and there is a object to the far right that comes into view when I pan to the right and the Palm branch moves from the wind to give a clear view of the Object. Then the object gets bright for a second but remains stationary under the storm clouds. I was trying to film funnel clouds that formed. I did not see this object in the camera viewer. Thanks JC"],"Viewing Distance":"Unknown","Summary":"Florida Thunderstorm Video footage reveals UFO & Multiple sightings","Country":"United States","Longitude":"-81.508754","trends":[""],"Weather Factors":"Unknown","Date Submitted":"09/10/2006 12:00 UTC","Latitude":"27.668387","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=27.668387,+-81.508754(5397)&iwloc=A&hl=en\"> mufon case (5397) map </A>","Source":"MUFON","Region":"Florida","City":"Undisclosed","Log Number":"US-09132006-0002"}