{"Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Source":"MUFON","Date Submitted":"09/14/2006 03:30 UTC","Country":"United States","Case Number":"5403","files":["/var/www/straped/mufon/html2text/5403.html.txt","/var/www/straped/mufon/more/5403_submitter_file1__P9140011.jpg","/var/www/straped/mufon/more/5403_submitter_file2__JC_over55_objects09-14-06.jpg","/var/www/straped/mufon/more/5403_submitter_file3__JCunknownsmany_09-14-06.jpg","/var/www/straped/mufon/org/5403.html"],"Viewing Distance":"Unknown","City":"Delray Beach","Region":"Florida","Object Shape":"Disc, Oval, Other, Unknown","Longitude":"-80.06457","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=26.465342,+-80.06457(5403)&iwloc=A&hl=en\"> mufon case (5403) map </A>","Tags":"City","trends":["There have been 35 other sightings in Delray Beach","There were 3 other sightings in Delray Beach on or around September 14th 2006","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Date of the Event":"09/14/2006 03:30 UTC","Summary":"Part 3 to Multiple Sightings in Delray Beach, Florida","Object Flight Path":"Undisclosed","Latitude":"26.465342","Log Number":"US-09142006-0004","divs":["Sighting DetailsHere's some more photos I took today around 3:30PM just aiming at the sky in all directions. Almost all 75 pictures have objects in them but I will post only a few of the good ones. The first I counted over 55 objects in the picture looking towards the west the same area of the sky where I took many other pictures. I'm also including the original so whoever wants to dabble with the photo to see how many objects I missed feel free to do so. This is an incredible event happening here and I hope to get more photos. I'll post Part 4 after this one with three more pictures then I need to take a break as this has overwhelmed me. All I want to say is the Human Race has to take a good look at itself and to learn the things that are the most important here with their time on this Planet. 1 Your Spiritual Awareness God, Jesus Christ, The Holy Spirit, Angels 2 To LOVE everything, as we are all made up of the same energy 3 To stop destroying this Planet with our Pollution, Poverty, and Politics! 4 To realize that we are not the only intelligent life forms that exist. Thanks JC"]}