{"Region":"California","divs":["Sighting Details 25 years ago in remote Oregon, myself and my wife were abducted at precisely the same time and we awoke to find strange pin-prick like marks all over our body. Our expereince being the same at the same time disells the thorry of dreams as the cause not actual abduction. At the time I did not believe in God, ghosts, demons, spirit etc. Our abduction was from a very remote ranch, and began with our dog screeming for help outside, then there were ultra-bright lights (blueish) cominh in from everywhere including through crack around the closed-up attached garage. A being of light or and least it was transparent appeared in the adjacent room and appeared to be searching for us, as it moved around the bed in that room. We were frozen with fear and could only move our eyes. The transparent being or thing then stop in front of the doorway between the searched room and our bedroom and then came straight at us. The instant it entered our room an extreemly bright light flashed (I think in our brains) and the event as we understood it seemed to have ended, although I think a lot of time had past. The nest day we found many pin-prick marks on our bodies, usually in triangular groups of threes. I believe they took us that night but altered our memory after the bright light flash that seemed to end the event. I have never been the same since. My name is Brian Carlson, my phone is 530 872 4901 or PO Box 1456 Paradise CA 95967 any comments or questions would be welcomed. A year or so after the abduction while in a nearby town I saw flying sausers as close-up as 300 feet hovering silently. At such close range and sitting still, all details were visible. I can also help lead you to police reports made in the early 1980s by numerous Cave Junction Oregon police to the Oregon FBI regarding these hovering, low altitude saucer shaped craft (shaped like a baseball diamond from underneath) in Cave Junction and the surrounding areas seen by thousands of people. I, as well as others stood underneath one of these motionless, low altitude ships for more the 5 minutes as it hovered over the Redwood highway in broad day light at no more than 300 feet above the ground. I called the FBI Office In Oregon, later than night when I heard another go by) and was told by an agent that they had received numerous calls regarding the flying ships including calls from the Cave Junction Police department requesting assistance. I was asssured by the FBI agent that \"it would be taken care of \" The ships were silent when hovering stationary, but made an airy jet like sound when traveling slowly. The following day after speaking to the FBI the sky in the local area was full of jet trails and jets criss-crossing the sky. My wife did not see these ships as she was not there, but she was there at the abduction. My email is brianecarlson@sbcglobal.net My phone is 530 872 4901 I would like to communicate regarding my experiences, and while I have been divorced for twenty years, we could contact my ex wife. Thanks Brian"],"Viewing Distance":"Unknown","Log Number":"US-09182006-0001","Country":"United States","Tags":"City","files":["/var/www/straped/mufon/html2text/5416.html.txt","/var/www/straped/mufon/org/5416.html"],"Weather Factors":"Unknown","Latitude":"36.783911","Source":"MUFON","Summary":"bbb","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Object Shape":"Diamond","Longitude":"-119.416652","Case Number":"5416","trends":[],"map":"<A HREF = \"http://maps.google.com/maps?q=36.783911,+-119.416652(5416)&iwloc=A&hl=en\"> mufon case (5416) map </A>","City":"Undisclosed","Disposition":"Insufficient Data","Date of the Event":"11/30/1979 03:25 UTC","Date Submitted":"11/30/1979 03:25 UTC","Object Flight Path":"Undisclosed"}