{"Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Country":"United States","Date Submitted":"09/17/2006 09:30 UTC","Case Number":"5422","Object Shape":"Diamond, Star-like, Triangle","Source":"MUFON","Disposition":"Insufficient Data","Date of the Event":"09/17/2006 09:30 UTC","divs":["Sighting DetailsWas standing on porch smoking and noticed a really bright \"star\" in the sky but then thought it was too bright and too low to be a star. I thought maybe it was a plane or something so I watched it for awhile (couldn't tear myself away from it actually) and it wasn't moving at all. I was really wishing that someone else would come outside so I could have some validation regarding what I was seeing and make sure it wasn't just me. Then it did start to move - slowly at first it went up and then started to move towards my direction. Still slowly it kept progressing. FINALLY my boyfriend woke up, and I said to him \"look at that weird thing in the sky!?!?\" He said \"helicopter\" after a few minutes but I just wasn't convinved. It got closer and closer and I noticed that in addition to the main light I'd seen, above that was an elongated, whiter light (the lames but yet most accurate comparison I can give it is the lights on the millennium falcon??) and then I did actually see two different colored, smaller lights on either side of the main, yellowish light. Then I thought I was a fool for watching so long because it must be a plane. But it kept just gliding through the sky and as it went overhead, there was hardly ANY noise (so I don't think it was a helicopter) and the lights kind of made a diamond shape as I looked above (though I was kind of scared to keep looking at it, I couldn't help myself) and then it passed our house and I couldn't see it anymore. I don't know why but afterwards, I just felt very weird, almost nauseous and then the rest of the night my stomach kept cramping up every 5-10 mins or so... I'm sure the two things are unrelated, but after what I saw, I couldn't help but wonder. Anyway, I was going to just do a search and see if anyone else reported anything strange from that night and then let it go, but after reading other accounts and seeing a few pictures (wish I hadn't been so transfixed to not go get my camera!) I feel like maybe I'm not crazy and maybe I didn't see a helicopter or strange airplane. I DO live near a military base so my \"logical\" side has been passing it off as some sort of experimental plane or something. I don't know, but it was definitely the most bizarre thing I've seen."],"Latitude":"39.730712","Tags":"City","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Object Features":"Unknown","Weather Factors":"Unknown","City":"Aurora","Longitude":"-104.82913","Log Number":"US-09192006-0004","files":["/var/www/straped/mufon/html2text/5422.html.txt","/var/www/straped/mufon/org/5422.html"],"Summary":"Strangest thing I've seen in my life!","map":"<A HREF = \"http://maps.google.com/maps?q=39.730712,+-104.82913(5422)&iwloc=A&hl=en\"> mufon case (5422) map </A>","trends":["There have been 48 other sightings in Aurora","There were no other sightings in Aurora on or around September 17th 2006"],"Region":"Colorado"}