{"map":"<A HREF = \"http://maps.google.com/maps?q=39.735132,+-104.82672(5424)&iwloc=A&hl=en\"> mufon case (5424) map </A>","files":["/var/www/straped/mufon/html2text/5424.html.txt","/var/www/straped/mufon/org/5424.html"],"Country":"United States","trends":["There have been 48 other sightings in Aurora","There was one other sighting in Aurora on or around September 19th 2006"],"Object Flight Path":"Undisclosed","Date of the Event":"09/19/2006 09:30 UTC","Date Submitted":"09/19/2006 09:30 UTC","divs":["Sighting DetailsI was watching MSNBC on TV at approximately 9:30 am, Sept. 19th. Nora O'Donald was interviewing Jay Barberie about the \"Mystery\" object orbiting with the shuttle. They had what I assume to have been a live feed from NASA onscreen while Mz. O'Donald interviewed Mr. Barberie. The camera was focused on the floating object when I noticed a disc shaped object enter the picture. Very quickly, more and more of the discs (of differing sizes) entered the picture from many different angles and speeds. These images immedeatly reminded me of footage I've seen on Discovery Channel documentories about UFOs filmed by NASA. The Discovery Channel documentary in particular of which I speak is the one where NASA was filming a teather that had gotten loose. These discs were very similar, if not exact. Mz. O'Donald noticed the objects and actually asked Mr Barberie what they were. He said he didn't know. She then said, \"Jay, you've covered the space program for 25 years!\" He then told a story about John Glenn's \"fireflies\", which he said was Mr. Glenn's persperation freezing, creating \"snowflakes.\" I think he mentioned ice as a possible explanation. This all happened quickly. The discs started pulsing and changing colors. One seemed almost to \"wobble\". It had a different shape than the others, maybe like a bow-tie. This one also flashed. It was in the left, bottom third of the screen. Right before they cut the live feed and switched to a tape of the original object, a larger disc with a different color in it's center, came across the screen from the middle bottom of the screen, traveling at a 45 degree angle to about the middle right of the screen where it left the picture. It entered the frame at 6:00 o'clock and left the frame at 3:00 o'clock, if you will. These objects were luminous and glowing, some more than others. It got really crazy towards the end and I couldn't believe what I was watching. It was like the objects got more and more 'frenzied\". I was amazed and excited. I wish I had TIVO. I immedeatly got on Craig'slist and asked if anyone else had seen it. I aslo logged onto MSNBC's Entertainment Blog and told the story there. I haven't found anyone else who had seen it yet. This footage should be pretty easy to get, I would think. Surely, someone recorded it or maybe you could get the footage from other sources, maybe MSNBC or NASA. I will say it was strange the way they cut the feed and switched to the tape of the original object. They never mentioned the objects again. Personally, I can't wait to see this footage again."],"Viewing Distance":"Unknown","Tags":"City","Region":"Colorado","Object Shape":"Disc, Other","Summary":"While watching MSNBC on TV, I saw multiple UFOs on the live feed from NASA.","Longitude":"-104.82672","Sighting Duration":"00:02:00","Case Number":"5424","Object Features":"Undisclosed","Weather Factors":"Unknown","Log Number":"US-09202006-0002","Source":"MUFON","City":"Aurora","Latitude":"39.735132","Disposition":"IFO"}