{"City":"Vero Beach","trends":["There have been 14 other sightings in Vero Beach","There were no other sightings in Vero Beach on or around September 21st 2006"],"Region":"Florida","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/5429.html.txt","/var/www/straped/mufon/org/5429.html"],"Sighting Duration":"00:00:10","Country":"United States","Weather Factors":"Unknown","Longitude":"-80.397274","map":"<A HREF = \"http://maps.google.com/maps?q=27.638643,+-80.397274(5429)&iwloc=A&hl=en\"> mufon case (5429) map </A>","Object Features":"Unknown","Object Shape":"Triangle","Summary":"Very dark grey against sky, v. muted lights 6? along two sides. Totally silent.","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Date of the Event":"09/21/2006 05:20 UTC","Log Number":"US-09212006-0004","Date Submitted":"09/21/2006 05:20 UTC","divs":["Sighting Detailsi had just come outside to sit and look at the stars facing east, south east- no moon - very dark sky. I look up almost directly above me, a bit south and I thought I saw something moving - I am always looking for the fast moving lights we see quite often down here .... I had to really focus and then I saw it - very dark in color - almost same as sky - triangular, about 6 what seemed to be extrememly muted lights - which sort of blended with the stars brightness wise - lights along front two sides. Back was dark. Corners were rounded. It was moving slowly - maybe 25 mph - heading due south - totally, totally silent. It took me about 5 full seconds to realize what I was seeing - it was moving and I could not get inside the house fast enough to get my husband out as it would be gone. When it went out of view behind some trees down the horizon, I ran to get my hussband who was out walking the dog. I shouted down the street \"did you see it? did you see it?\" But he did not. I kept looking in the direction it was heading but it was gone. I only have myself as a witness but I know what I saw. I cannot say the size as I really did not have perspective against the sky. It could have been really low and mid sized or higher up and huge."],"Source":"MUFON","Latitude":"27.638643","Object Flight Path":"Straight-line path","Case Number":"5429","Tags":"City"}