{"divs":["Sighting DetailsI and my other half were driving to tescos last night, and we saw this strange light in the sky to our right, on the horizon as we were going from Margate to Broadstairs, we saw it moving smoothly and too quickly for it to be a plane. It was a bright orange colour. Bearing in mind it was a cloudy night, this was not a star. It seemed to move left a bit, then stopped. We lost it behind some trees, and houses and stuff, but when we actually reached Tescos car park, it reappeared. It was right ahead of us as we parked the car. This was about 8.30 last night. It glided right over us. We tried to come up with an explanation that it must be plane. But when do planes have glowing orange light that doesnt flash?! Anyway it flew over us and disappeared. We then went into tescos to get some cigarettes and stuff, and then we came out and got back in the car and left. We then headed to a country pub near Canterbury for a quiet drink, and to the right of us, as we drove out of the Manston Airport area, this thing reappeared from out of nowhere. I could see it through the right window on my boyfriends side of the car as we drove. We both saw it, and this time it just vanished...out of sight. It was too low down to have vanished behind the clouds, besides it would have kind of faded behind them like planes do, when they fly into the clouds. This thing just blinked out, like a light being switched off. We are not convinced that this was a plane. Not only that, but on Sunday night, the same sort of thing happened. We were driving on the Thanet way heading toward Canterbury, and we saw the same kind of orange light, just hovering ahead of us to the right, and moving very strangely. We lost it behind the horizon. Then about half hour later we were driving up a country lane, and I noticed this orange glow right above us, above the trees, and as soon as I clapped eyes on it, it just vanished, in the same way as the one last night did. We were both curious as to what it actually was. It really did not look like a plane."],"Longitude":"1.080339","Date Submitted":"09/27/2006 08:30 UTC","Source":"MUFON","Summary":"Strange object moving too quickly to be a plane, bright orange, not a star, as it was cloudy","Object Flight Path":"Hovering then path,Path then hovering","trends":["There have been 3 other sightings in Canterbury","There were no other sightings in Canterbury on or around September 27th 2006"],"Country":"United Kingdom","Case Number":"5475","files":["/var/www/straped/mufon/html2text/5475.html.txt","/var/www/straped/mufon/org/5475.html"],"Tags":"City","Date of the Event":"09/27/2006 08:30 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Shape":"Sphere, Star-like","Log Number":"GB-09282006-0002","Region":"England","Latitude":"51.282303","Object Features":"Unknown","Viewing Distance":"101-500 Feet","Disposition":"Unresolved","City":"Canterbury","map":"<A HREF = \"http://maps.google.com/maps?q=51.282303,+1.080339(5475)&iwloc=A&hl=en\"> mufon case (5475) map </A>"}