{"Sighting Duration":"00:05:00","Summary":"3 sets of silent strobing /revolving red lights moving together from SE to NW","files":["/var/www/straped/mufon/html2text/5484.html.txt","/var/www/straped/mufon/org/5484.html"],"Case Number":"5484","Date Submitted":"09/28/2006 07:38 UTC","Viewing Distance":"Over One Mile","Date of the Event":"09/28/2006 07:38 UTC","trends":["There have been 16 other sightings in Torrance","There were no other sightings in Torrance on or around September 28th 2006"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.841729,+-118.331519(5484)&iwloc=A&hl=en\"> mufon case (5484) map </A>","divs":["Sighting DetailsLast evening, about 7:30pm, I walked my dog out to the front yard, and glanced up to view the stars in the fairly clear, late-evening sky. From the SW, I caught sight of rapidly-blinking, very red strobe lights moving quite hurriedly but silently towards the NW...(from my house, this would be towards LAX). The lights were quite far apart, and seemingly as high as very high-flying helicopters...but they were totally silent. I ran inside my house to snag my binoculars (about 20 seconds), and viewed the lights through the binocs. But, all I could see were lights, quite clearly, but no helicopter, no blimp, nor light plane, nor commercial jet, nor military jet. I could discern no shape, only a vague shadowy something, which took up a lot of space...unless there were several aircraft flying in sort of a v-formation. For the 5 or so minutes that I watched the lights, there were no other colored lights visible..no green, no white..nor any colors associated with the Goodyear Blimp. I kept thinking of the lights blinking in a \"dot-dot-dit\" pattern...On the far left, a single red light, blinking, and quite a span to the right, a revolving 2 red lights, with a blinking red light below it. (Four blinking lights in all). It was a really strange sight to behold! I love to look for planets and constellations on clear nights, and have observed many regular identifiable aircraft. Because the night sky was quite clear, I do not believe it was a blimp. My 7 x 50 binocs revealed only pin-point strobing lights, which I watched for about 3 minutes until they were obscured by my neighbor's roof. If they were aircraft, then LAX should have an ID for them, as they were headed in that direction."],"Disposition":"Unknown","Latitude":"33.841729","Country":"United States","Longitude":"-118.331519","Log Number":"US-09292006-0003","Object Features":"None","Object Flight Path":"Straight-line path","Source":"MUFON","Weather Factors":"Windy","Region":"California","City":"Torrance","Tags":"City","Object Shape":"Unknown"}