{"Latitude":"39.197738","Object Shape":"Other","trends":["There have been 3 other sightings in Aspen","There were no other sightings in Aspen on or around October 1st 2006"],"Sighting Duration":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/5502.html.txt","/var/www/straped/mufon/org/5502.html"],"Country":"United States","Object Features":"None","Date of the Event":"10/01/2006 11:15 UTC","divs":["Sighting DetailsHouse is located at 9,500' elevation on a steep hillside in a narrow valley. No houses or lights in the valley south of the house - the direction of the sighting. Low cloud cover with moon partially visible above a mountain range in the WSW sky. 11:15 PM. Alone at home watching TV from bed. No other lights on in house. Suddenly noticed a light formation in a descending approach from the south. The formation appeared be a steeply banked aircraft but with more lights (6-8)than would expect to see on an aircraft and having more of a yellowish tint than landing lights. Could not believe what I was seeing. Thought it had to be some sort of reflection from the TV or lights from cars below on the valley floor. The formation suddenly leveled out and seemed to be coming directly at me. I was paralyzed, convinced that the aircraft was going to crash into the house, and that I was about to die. I then noticed that there was no sound whatsoever. Thought maybe it was a reflection from the TV (it was not - no similar image on the TV) or some sort of reflection created by the low cloud cover and the way the moon was visible on the edge of the cloud cover. As the formation appeared to be getting closer (the horizontal distance between the lights was growing), suddenly the light on the eastern-most end of the formation changed direction and headed due east followed, at an increasing distance, by the other lights all of which disappeared behind a promontory on the eastern side of the valley."],"Disposition":"IFO","Summary":"Light formation similar to aircraft landing lights","Source":"MUFON","Longitude":"-106.810759","Viewing Distance":"Unknown","Log Number":"US-10022006-0005","Region":"Colorado","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=39.197738,+-106.810759(5502)&iwloc=A&hl=en\"> mufon case (5502) map </A>","Date Submitted":"10/01/2006 11:15 UTC","Case Number":"5502","City":"Aspen","Weather Factors":"None"}