{"Source":"MUFON","Date of the Event":"10/01/2006 11:17 UTC","Country":"United States","Object Shape":"Bullet, Missile, Flash, Unknown","Disposition":"IFO","Object Features":"Undisclosed","Viewing Distance":"Unknown","Tags":"City","trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around October 1st 2006"],"Date Submitted":"10/01/2006 11:17 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.837242,+-104.816373(5521)&iwloc=A&hl=en\"> mufon case (5521) map </A>","Object Flight Path":"Straight-line path","City":"Colorado Springs","Latitude":"38.837242","Log Number":"US-10042006-0004","divs":["sighting detailson sunday, october 1, 2006 at 11:17pm, mst, i was in my unlighted living room walking by a large picture window looking to the southwest at the nearly full moon low on the horizon in a position just north of the usaf academy along the front range. my home is at 7,220 feet altitude where i have a panoramic view to the south\\southwest including the academy, pikes peak and colorado springs. i regularly observe commercial jets and high performance military aircraft at high and low altitudes as well as meteors, satellites, and some wild weather systems. having perhaps thousands of hours flightime in commercial and private aircraft, i think i am perhaps somewhat qualified to explain that i have seen something very unusual. however,in all fairness, i have been keeping my eyes open for 50 plus years to see what might be called an ufo, and here it is! back to the sighting. at 11:17pm a flashing streak from the southwest just to the left of the dark side of the moon caught my undivided attention and it was immediately followed in perfect but segmented alignment by two more streaks in a flat laser-like trajectory all seeming to pulsate. the streaks were eastbound at high altitude well above any commercial traffic and travelling several times commercial jet speed i would estimate. maybe the \"pulsating\" visual could be attributed to some light and scattered cirrus clouds below the streaks. my first reaction was that i was observing three consecutive air launched missiles and i thought of the peterson and\\or schreiver bases in that direction. there was no sound or sonic boom. i considered turning to get a camera from my desk but didn't want to miss the observation. in 10-15 seconds, or thereabouts, it was all over. i sat by the window for 20 minutes more scanning the skies to no avail."],"Summary":"Three in-line segmented pulsating streaks of light eastbound at high altitude low on the horizon traveling at tremendous speed.","Region":"Colorado","Longitude":"-104.816373","Sighting Duration":"Undisclosed","Case Number":"5521","files":["/var/www/straped/mufon/html2text/5521.html.txt","/var/www/straped/mufon/org/5521.html"],"Weather Factors":"Unknown"}