{"divs":["Sighting DetailsI went out on my deck to let me dog out to go to the bathroom about 8:35 pm on 10-6-06 and while waiting for him to go the bathroom in the yard, remained on my deck and looked up into the sky at the stars. Stars were easily seen although it wasn't pitch black yet. I always look up at the stars when I am outside at night and look for planets, constellations, satellites, etc. I looked up and saw the easily identifiable lights of a commercial airliner as it headed west to east across the night sky. It was easy to see this was an airliner as it had 2 white lights and then a quick red and green strobe and I see these all the time going across my house at night. It was a perfecty calm night, no wind, no other sound going on and the airliner was high enough so I heard no sound at all. As I tracked this airliner along its course I noticed an orange object about the size of a very bright star you would see on a very clear night. It was traveling in a northeast direction and was about my hands distance from behind the plane with my arm fully extended to cover both the plane and the orange object. The plane and the object were on two different paths. The first thing that got my attention was the orange color. It was solid orange, did not pulse on and off nor did it change any other color. I see satellites all the time and all the ones I have ever seen look just like a faint white star and are traveling at a great speed and are across the sky in 30 seconds or less. The object I saw was definitely orange as I could compare it to the typical bright white stars as it went by them. The size of the object could be covered in its entirety by I would say the size of about a kernel of corn if it were held on my outstreched fingers. I did not actually use anything other than my little finger to cover the object, but the kernel of corn size I feel would be accurate. With the orange oject in view, I could still see the plane and could track the orange obects speed relative to the planes speed and I would say that the object was the same speed to a bit slower than the planes. I see satellites all the time and they are really moving across the sky fast and this was moving much slower than a satellite. Again since I look into the sky all the time during the day and night I know what satellites, planes, shooting stars, all look like and there relative speed. My very first reaction was it was a satellite, but within a few seconds of observing this excluded it based on the orange color, the size, and the speed of it. The object did not stop, nor change direction of any kind and continued to head in a northeastern direction. What did seem strange is that the object seemed to always be the same size from when I first saw it to when it went out of sight. Planes, satellites, etc. that I always observe typically appear smaller the further they are away until just a dot, then gone. This object seemed to remain the same size I would best guess about 5 times the size of a typical satellite that I usually see. Even when continued along its course I did not appreciate it getting smaller. I basically just lost track of it after about 2 minutes. I'm not sure exactly what the object was that I saw, but I know it was not a commercial plane, a satellite, a star, a planet. I went right inside my house and told my wife that I just saw somethng weird and described it to her. I felt like I saw something that I have never seen before and could not put it into any category of anything I have seen before."],"Disposition":"Unknown","Viewing Distance":"Over One Mile","Log Number":"US-10082006-0001","Object Shape":"Sphere","City":"Undisclosed","Latitude":"43.969515","Longitude":"-99.901813","Weather Factors":"None","Sighting Duration":"Undisclosed","Summary":"orange sphere goes across night sky slowly easy to see, non-pulsatile, linear path behind plane","Source":"MUFON","Region":"South Dakota","trends":[],"Date of the Event":"10/06/2006 08:35 UTC","Date Submitted":"10/06/2006 08:35 UTC","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.969515,+-99.901813(5534)&iwloc=A&hl=en\"> mufon case (5534) map </A>","files":["/var/www/straped/mufon/html2text/5534.html.txt","/var/www/straped/mufon/org/5534.html"],"Object Flight Path":"Straight-line path","Tags":"City","Case Number":"5534","Country":"United States"}