{"Region":"Texas","files":["/var/www/straped/mufon/html2text/5536.html.txt","/var/www/straped/mufon/more/5536_submitter_file1__ufo100606007.jpg","/var/www/straped/mufon/more/5536_submitter_file2__ufo100606010.jpg","/var/www/straped/mufon/more/5536_submitter_file3__ufo100606018.jpg","/var/www/straped/mufon/org/5536.html"],"Date of the Event":"10/06/2006 12:00 UTC","Date Submitted":"10/06/2006 12:00 UTC","Viewing Distance":"Unknown","Summary":"strange lights in the sky","Disposition":"Hoax","Tags":"City","Case Number":"5536","Sighting Duration":"Undisclosed","Country":"United States","Log Number":"US-10082006-0003","map":"<A HREF = \"http://maps.google.com/maps?q=30.047433,+-99.140319(5536)&iwloc=A&hl=en\"> mufon case (5536) map </A>","Source":"MUFON","Longitude":"-99.140319","City":"Kerrville","divs":["Sighting DetailsI hope I am sending this to the right place. If not, can you please redirect me? On the 6th of Oct at approx 9:00pm we noticed that the moon was clear and bright so we decided to take some pictures of it. We could not see anything strange with the naked eye but noticed something showing up in the images. We started to take the pics as fast as we could and tried to keep the same angle. We did, after getting a couple with the image, tried to re-locate the camera to see if it still showed. It did! The object was moving very fast as you can see and then it just went away (as the picture shows) and didnt come back. It moved around the moon and the halo of the moon but it also journied outside of that halo. So, my question to you is this...Can you tell me what the hell this is. I am not one to jump and claim I saw bigfoot or little green men but I cant reason this away. There was no flash used so its not a glare and the lense was clean. Again, any clue what this may be? Thanks Brad Golden"],"Object Shape":"Circle","trends":["There have been 3 other sightings in Kerrville","There were no other sightings in Kerrville on or around October 6th 2006","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Object Features":"Unknown","Latitude":"30.047433"}