{"City":"Lehigh Acres","Viewing Distance":"Over One Mile","Latitude":"26.62535","Date of the Event":"09/30/2006 06:30 UTC","divs":["Sighting DetailsLooking West out my back window, I could see in the far distance a large bright red-orange cigar shaped flame or tail (appearing to be maybe two inches, a little thicker than a pencil)in the sky? off a small object that i couldnt see that well. I saw a quick flash, bright like maybe it exploded? but its direction never changed. Or maybe a new stage to a rocket? I didnt know what to think? My son who brought it to my attention showed me how it come up from tree level and curved to travel South- south west in the sky. I stood and watched it to see if anything else would happen till it went behind the trees and i couldnt see it anymore. The sun was just beginning to set, (it was still bright outside) so the clouds had the very beginning of the orange tint to them and the sky was starting to get a deeper blue purplish color. It wasnt traveling at any great speed, but faster than a normal airplane. The weather was good, and visibility was good as well. I dont know where it could have come up from originiating in that direction since its the gulf. I have seen several oddities in the past that i could not explain, and have reported. I dont go looking for things to report, but instead look at things and see how one could think they were a UFO. I believe, yet i am a skeptic. Anyway.. ? who can tell. I have read a few other reports that seems simular to what i reported today, but none from this area. If this can be explained i would love to be contacted on it. Thank you."],"Disposition":"IFO","Tags":"City","Weather Factors":"Unknown","Sighting Duration":"00:05:00","Object Shape":"Bullet, Missile, Cigar, Diamond, Fireball, Star-like","Log Number":"US-10082006-0004","files":["/var/www/straped/mufon/html2text/5537.html.txt","/var/www/straped/mufon/org/5537.html"],"Object Flight Path":"Straight-line path,Path with directional change","Region":"Florida","Source":"MUFON","Summary":"large bright orange trail going across sky, looked like it exploded with a flash but continued on course.","map":"<A HREF = \"http://maps.google.com/maps?q=26.62535,+-81.624803(5537)&iwloc=A&hl=en\"> mufon case (5537) map </A>","Case Number":"5537","Longitude":"-81.624803","Country":"United States","Object Features":"Unknown","Date Submitted":"09/30/2006 06:30 UTC","trends":["There have been 5 other sightings in Lehigh Acres","There were no other sightings in Lehigh Acres on or around September 30th 2006"]}