{"trends":["There have been 11 other sightings in Sydney","There were no other sightings in Sydney on or around October 7th 2006"],"map":"<A HREF = \"http://maps.google.com/maps?q=46.14562,+-60.187924(5540)&iwloc=A&hl=en\"> mufon case (5540) map </A>","Country":"Canada","Sighting Duration":"Undisclosed","Summary":"Red Streaking Light Across the Sky - Flashing Off/On Like a Plane But Made No Noise","Log Number":"CA-10092006-0001","Viewing Distance":"Unknown","Date Submitted":"10/07/2006 07:20 UTC","files":["/var/www/straped/mufon/html2text/5540.html.txt","/var/www/straped/mufon/org/5540.html"],"Object Features":"Unknown","Date of the Event":"10/07/2006 07:20 UTC","Disposition":"Unresolved","Region":"Nova Scotia","Weather Factors":"Unknown","Object Flight Path":"Straight-line path,Path with directional change","Longitude":"-60.187924","Tags":"City","Latitude":"46.14562","divs":["Sighting DetailsI was heading toward Sydney and was crossing the bridge at the Bay Side Canteen when I saw a red light streaking across from the left...I thought it was a shooting star at first...it wasn't overly high in the sky, but the lighting in the area didn't permit me to get a better glimpse of the object creating the flash. The object was going very quick and the light would flash on and off like a plane, but I was struck by the fact that it made no noise and travelled so quickly. I even turned off the radio to see if I could hear it - yet heard nothing. I thought at the time it was a bit unusual to see a plane crossing to head to the airport at this location as I hadn't seen one cross there before, but I thought to myself there is a first for everything. Trees unfortunately obstructed most of my view but it appeared to go toward a wooded area further out and remained there for a few seconds. I could see the red light in the distance, then next time I looked I could no longer see it - either because trees obstructed my view, it landed at the airport if it was in fact a plane or it moved on beyond my view. Unfortunately I could not stop at the time."],"City":"Sydney","Case Number":"5540","Object Shape":"Unknown","Source":"MUFON"}