{"Latitude":"27.670757","Longitude":"-81.506214","Case Number":"5546","files":["/var/www/straped/mufon/html2text/5546.html.txt","/var/www/straped/mufon/org/5546.html"],"City":"Undisclosed","Object Shape":"Cylinder, Unknown","Source":"MUFON","Object Features":"Unknown","Disposition":"Unresolved","Sighting Duration":"00:05:00","Object Flight Path":"Straight-line path","Tags":"City","trends":[],"divs":["Sighting DetailsNoticed two objects at extreme altitude (low earth orbit?), traveling West to East over approximately 30 degrees of arc at an elevation of approximately 85 degrees to the South. Objects were first noticed when looking up at a jet aircraft, which likely had taken off from Orlando International, as it was executing a 180 degree change of direction from due North at an estimated altitude of 15K to 20K feet. Objects were much, much higher and seemed to be moving at a greater velocity than the aircraft. Upon noticing the first (trailing) object, we thought it could be the space station or other low earth orbit satellite but then we noticed the second object leading the first and moving away from it. Both objects pulsated with an extremely bright light at intervals of 3-5 seconds. Lead object was some 3-5 degrees of arc leading the trailing object and pulling away slightly (lower orbit?). The shape of both objects were indiscriminate, although we (my spouse and I) thought we could discern a cylinrical shape slightly longer than wide but we cannot be certain as the objectly were very, very high and slightly to the west of the sun. Even then, the pulsating lights were as bright or brighter than the sun to the East. Needless to say, after observing the objects we felt they were not the space station or other low earth orbit satellite. We eventually lost sight of the objects as they continued to the East beyond the range of our vision."],"Summary":"Two objects emitting a brilliant pulsating light, extremely high altitude.","Log Number":"US-10102006-0002","Weather Factors":"None","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=27.670757,+-81.506214(5546)&iwloc=A&hl=en\"> mufon case (5546) map </A>","Region":"Florida","Date of the Event":"10/10/2006 10:13 UTC","Date Submitted":"10/10/2006 10:13 UTC","Country":"United States"}