{"City":"Denver","map":"<A HREF = \"http://maps.google.com/maps?q=39.741784,+-104.976263(5551)&iwloc=A&hl=en\"> mufon case (5551) map </A>","trends":["There have been 185 other sightings in Denver","There was one other sighting in Denver on or around October 7th 2006"],"Date Submitted":"10/07/2006 02:00 UTC","Log Number":"US-10102006-0007","Region":"Colorado","Disposition":"Unknown","Latitude":"39.741784","Tags":"City","Source":"MUFON","Weather Factors":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/5551.html.txt","/var/www/straped/mufon/org/5551.html"],"Case Number":"5551","Sighting Duration":"Undisclosed","Object Shape":"Square, Rectagular, Triangle","Longitude":"-104.976263","divs":["Sighting DetailsI was driving with my two friends around 2 oclock in the morning when we came to a red light. We stopped and I saw what I thought was a low flying plane so I pointed it out to my friends. But then it looked like a helicopter but it was flying way to low. Then all at the same time we realized that there were more lights that were not shaped like a helicopter. It was directly across the intersection above the street light about 30 yards up. It was coming diagonal and then it stopped. We all yelled at the same time, \"My god thats not a helicopter!\" It then just stopped and began to turn over, this is when we saw that it was huge and a rectangular shape. It then did a bit of a dip turning verticle. This is when we saw lots of bright lights that were very large. It then flipped over and started going in the other direction. We were able to follow it for a few blocks. As we were following it, it was moving very low to the ground and going very very slow. Then the lights went from being just gold to having more lights around it to white. Then at the front a whole sheet of white across the front started flashing, thats when we lost it. It looked as if a car was driving through the air at one point. We had to pull over because we couldn't believe what we just saw. The car was silent and my friend took over driving for me. So we started back for the road home and I called my friend, when one of my friends in the car yelled, \"There it is again!\" We were on a main road and had green lights all the way down but had to stop to look at it. It was still in the same position just stopped, there were about 15 other cars at this time also with green lights that had stopped to look at it too. Then it went into a residential neighborhood slowly, it was above the houses, but we were still able to see it, then it started lowering. I was describing this to my friend on the phone as it was happening. It started getting lower and lower and as it was the lights were turning red and flashing, then we stopped by where we thought we saw it then it flashed and we lost lost it. The whole sky went dark after it disappeared. We went down about 20 blocks and then there suddenly were a lot of helicopters in the sky with bright lights, we figured that they were on a hunt for what we had seen. Later about 5 minutes when I got home there was a huge plane with really bright search lights in the skyflying low, and my dog was freaking out running and scratching just acting unusual than she normally does. We weren't scared when we saw it. We didn't really now how to react we were all yelling at each other stuff like, \"Are you seeing this\", \"Is this really happening\" and while we were following it we were bitting our nails in silence. After we were all silent just taking in what we had seen. While most people do not believe what we saw when we tell them, thats fine because we all know what we saw, it was huge and one of the most exciting experiences of my life. It was a real rush and I am happy that I could experience what I saw, cuz I have definately never seen anything like it at all!"],"Date of the Event":"10/07/2006 02:00 UTC","Object Features":"Patterned Surface","Viewing Distance":"21-100 Feet","Summary":"looked like a low flying helicopter until it got closer then it was bright and flashing and real low to the ground moving extremely slow","Object Flight Path":"Hovering then path"}