{"Log Number":"US-10112006-0004","Weather Factors":"None","Viewing Distance":"Unknown","Source":"MUFON","trends":["There have been 2 other sightings in Ravenna","There were no other sightings in Ravenna on or around August 30th 2006","This sighting has never been favorited.",""],"Latitude":"41.157557","Object Shape":"Star-like, Triangle","Date of the Event":"08/30/2006 01:13 UTC","divs":["Sighting DetailsI was on the computer, when out of the corner of my eye i noticed a vibrant flashing light outside my sliding glass door. I looked straight at the light and realized just how distinct the pulses were. So I observed it standing in my doorway and could not make out any movement. I sat back down and kept an eye on the object to see if it tracked through the sky like a star, peeking back up every 3 or 4 minutes. After about 25-30 minutes the light was still in the same spot above the trees. At this point I grabbed the digital camera and snapped at least 15 photos, using the door frame to steady myself and hitting the button slowly to allow saving of each photo. After about another hour, clouds obscured my view and it was not around anymore. I looked to the sky in that spot every night since, hoping to see the same light, tracking in the sky, like a star or satelite. I did not see the object again until 10-7-2006 around 10:30pm, and this time I had 5 witnesses to verify an odd pulsing light and the other 30+ pictures taken this time. I would like to offer these photos for whatever scrutiny just to find out what we have seen. I have had my eyes to the sky since I was very young, dreaming of piloting, being an astronaut, and always enjoying the stars. This is by far the oddest thing I have ever seen and could not be explained away easily. I even have a reference star to exhibit the steadiness of the camera and swaying movement of the object. It is my opinion that this was a very distant viewing. I have many photos to see,but gave forth the best three that shiws it is not normal. I was using a Kodak Easyshare DX7630 with the Schneider-Kreuznach aftermarket 3x optical lens and was zoomed to the max to take most of the photos."],"Region":"Ohio","City":"Ravenna","files":["/var/www/straped/mufon/html2text/5556.html.txt","/var/www/straped/mufon/more/5556_submitter_file1__UFO005.jpg","/var/www/straped/mufon/more/5556_submitter_file2__2ndSighting009.jpg","/var/www/straped/mufon/more/5556_submitter_file3__11pm006.jpg","/var/www/straped/mufon/org/5556.html"],"Disposition":"Unknown","Longitude":"-81.242047","Case Number":"5556","Country":"United States","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.157557,+-81.242047(5556)&iwloc=A&hl=en\"> mufon case (5556) map </A>","Object Features":"Unknown","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Summary":"Strange Pulsing light in the sky, just above trees and distant-Photos attached","Date Submitted":"08/30/2006 01:13 UTC"}