{"Object Features":"Unknown","Region":"Georgia","Longitude":"-84.512315","Weather Factors":"Windy","Latitude":"34.109087","Sighting Duration":"Undisclosed","Case Number":"5559","Viewing Distance":"Over One Mile","Log Number":"US-10122006-0001","Disposition":"IFO","Tags":"City","divs":["sighting detailsit was a mostly sunny day, but a little windy and big clouds were passing through the area. as i walked out my front door i noticed to my south a small shiny circle\\sphere high in the sky just hanging there. clouds were moving past but this object did not move. if it were a balloon, it would've moved with the wind\\clouds. i live on the southern edge of towne lake, so i estimate the object was high over the highway 92 area. it occurred to me that if ufos exist, this is probably what to look for, but i dismissed it since it was in the middle of a sunny day and the area is heavily populated (atlanta suburb). i assumed there had to be an explanation and i was running late to meet my wife, so i got in my car and drove away. recently, i was watching tv and saw a reported sighting (i think in canada a few years ago) that looked exactly like what i saw - a small silver sphere\\circle just hanging in the sky on a sunny \\ partly cloudy day. i wish i would've trusted my initial instinct and grabbed my camera! i've been comparing it to the time when, a few years ago, i woke up in the middle of the night, felt the bed sway a little and thought to myself \"if we had earthquakes in georgia, i bet that's what it'd feel like\" and fell right back to sleep. then, in the morning, the news reports are abuzz over the small earthquake felt in the atlanta area. if it hadn't been for the news reports, i would've forgotten all about the swaying bed, assuming it was nothing."],"Object Shape":"Circle, Sphere","Date Submitted":"02/29/2004 12:00 UTC","Date of the Event":"02/29/2004 12:00 UTC","Country":"United States","City":"Woodstock","files":["/var/www/straped/mufon/html2text/5559.html.txt","/var/www/straped/mufon/org/5559.html"],"trends":["There have been 12 other sightings in Woodstock","There were no other sightings in Woodstock on or around February 29th 2004"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.109087,+-84.512315(5559)&iwloc=A&hl=en\"> mufon case (5559) map </A>","Summary":"Small shiny/silver object in sky, not moving (March or April '04, Woodstock)","Object Flight Path":"Stationary","Source":"MUFON"}