{"Viewing Distance":"101-500 Feet","Case Number":"5563","Region":"Washington","Source":"MUFON","Weather Factors":"None","Object Shape":"Sphere","Disposition":"Unknown","Date of the Event":"10/11/2006 09:30 UTC","Country":"United States","Longitude":"-122.893885","Date Submitted":"10/11/2006 09:30 UTC","City":"Olympia","Object Flight Path":"Path with directional change","Tags":"City","Latitude":"47.047844","Log Number":"US-10122006-0005","map":"<A HREF = \"http://maps.google.com/maps?q=47.047844,+-122.893885(5563)&iwloc=A&hl=en\"> mufon case (5563) map </A>","Sighting Duration":"Undisclosed","trends":["There have been 22 other sightings in Olympia","There were no other sightings in Olympia on or around October 11th 2006","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/5563.html.txt","/var/www/straped/mufon/org/5563.html"],"divs":["Sighting DetailsI was sitting on my front porch, having a smoke. I heard a low-flying helicopter traveling west to east. It was probably five miles away when I heard it. I soon saw it come into view, a blue light in back, a white light in front. The sky was dark. The helicopter followed a path that most military aircraft tend to, when flying over Olympia. It takes them across the vantage of the sky I have in front of my house. This one came from the west, and flew in front of my house. I paid it a little attention, as it was loud. It seemed to be flying low. I watched it as it came through the trees and into the view I have of the northern sky. That's when I noticed the red ball of light in front of the helicopter. It was as if the chopper was chasing the light. The distance between the two objects was slight, and remained constant. They flew across the break in the trees, where I could clearly see the objects, quite quickly, and by the time I realized what I was seeing, and retrieved my camera, the objects were obscured by trees. They arced northward and I didn't see them again. The sky was clear. The light was smaller than the helicopter. There was no searchlight beam shining from the helicopter. It really looked like the helicopter was chasing the light. I'm enclosing the video I took, but it's terrible quality. Maybe it can be cleaned up by someone with the right equipment, but I'm not sure it will show anything of value anyway. Probably a lot of the helicopter's lights and tree limbs. I don't believe there was a sound coming from the light, though it's hard to say, because the helicopter was very loud. It was a large helicopter, with a deep, low sound."],"Object Features":"None","Summary":"I watched a helicopter chase a red light across the sky"}