{"Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=47.307323,+-122.228453(5565)&iwloc=A&hl=en\"> mufon case (5565) map </A>","Longitude":"-122.228453","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/5565.html.txt","/var/www/straped/mufon/more/5565_submitter_file1__10_12_06_245pm-weirdsky.JPG","/var/www/straped/mufon/org/5565.html"],"Region":"Washington","Source":"MUFON","Latitude":"47.307323","Date of the Event":"10/12/2006 02:45 UTC","Object Shape":"Circle, Disc, Oval, Sphere, Star-like","Weather Factors":"None","Case Number":"5565","Tags":"City","trends":["There have been 12 other sightings in Auburn","There were no other sightings in Auburn on or around October 12th 2006","This sighting has never been favorited.",""],"City":"Auburn","Date Submitted":"10/12/2006 02:45 UTC","Country":"United States","Log Number":"US-10122006-0007","Object Flight Path":"Stationary,Hovering then path,Path then hovering","divs":["sighting detailsok.. i have always \"believed\", but never have never seen any \"proof\\\" with my own eye's... not straight out in front of my face proof... but. not in my life have i actually seen anything like this... actually made my day.. long story short.. about 2:45pm walked to the outside bay door to get some air and saw about 40% of the shop standing outside staring at the sky.. ok.. said to myself.. this has to be good..... tree line was semi blocking my view and asked wtf was going on.. moved over and saw what everyone was looking at.... well.. there was about 40 of us on the particular end of the shop looking at the same thing and wondering wtf is that.. calling horizon .. zero degree's.. at about 75 \\ 80 degree's up from the horizon line straight, north east... ( would of appeared to be straight above fairwood area, but if you were to project out mileage couldn't tell you exactly above where it was actually at.. from standing within 1\\2 mile of auburn valley drive inn movie theater... was 5 white\\silver - prominent objects in the sky. not too far away, but actually there to know, that something was there... \"they\" \\ \"something\" sat there, more like very slowly \"hovered \\ barely moved\" around for about 10 minutes, then the 2 on the left side got closer, then they moved apart.. then 3 of the 5 slowly moved a little to the right.. then all disappeared all together about 15 minutes later.. robb"],"Summary":"( 5 ) PROMINENT \" Objects\" Stationary / In Formation/ Slowly Moving ..Obviously Visable...","Disposition":"Unknown"}