{"files":["/var/www/straped/mufon/html2text/5572.html.txt","/var/www/straped/mufon/org/5572.html"],"Longitude":"-88.078075","City":"Joliet","Date Submitted":"10/12/2006 03:28 UTC","Viewing Distance":"Unknown","Latitude":"41.526681","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.526681,+-88.078075(5572)&iwloc=A&hl=en\"> mufon case (5572) map </A>","Weather Factors":"Unknown","divs":["Sighting DetailsI was asleep early this morning when my wife woke me up to look at something strange in the sky. She said she had been watching this object for about 10 minutes before she realized this was not an airplane, balloon, helicopter or anything like that. I looked out the window to the Southeast, and observed a large white glowing sphere....not really moving at this point. After watching it for a minute or two, I quickly dismissed it as just a bright star. I was about to call my wife crazy and return to bed when the sphere suddenly started moving around in an elliptical circle EXTREMELY fast. Once again using a star as a guide, I DID notice the erattic movement. After doing that for a minute or two, the object quickly shot forward a bit, back to its original position, and then side to side. It's speed was WAY BEYOND anything I had ever seen, and plus it moved in a direct linear line. It's speed was tremendous. We watched it move about for a good half an hour, before it shot straight up into the sky....completetly dissappearing. I am a firm beleiver that we are not alone, and I have seen many strange things....but I have never seen an object that moved through a CLEAR STARLIT sky like this did. I still have chills just thinking that I actually saw what I saw. I wonder if anyone else might have seen the same thing."],"Region":"Illinois","Object Features":"Unknown","Case Number":"5572","Tags":"City","trends":["There have been 12 other sightings in Joliet","There were no other sightings in Joliet on or around October 12th 2006"],"Source":"MUFON","Summary":"We saw a very bright globe object moving in an oval pattern, and the SHOOTING from side to side, and forward and back. Using a close star as a gauge, this object was definitely NOT of this world. The pattern and speed of its movement was incredible.","Object Shape":"Fireball","Date of the Event":"10/12/2006 03:28 UTC","Log Number":"US-10132006-0006","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Country":"United States"}