{"Latitude":"37.313827","Longitude":"-121.020761","Object Features":"Unknown","Date of the Event":"10/04/2006 02:30 UTC","Date Submitted":"10/04/2006 02:30 UTC","Object Shape":"Disc","Source":"MUFON","Viewing Distance":"Over One Mile","Log Number":"US-10142006-0001","Object Flight Path":"Unknown","Tags":"City","Region":"California","Country":"United States","Summary":"The UFO had different color of lights and it was disc shape.","map":"<A HREF = \"http://maps.google.com/maps?q=37.313827,+-121.020761(5575)&iwloc=A&hl=en\"> mufon case (5575) map </A>","Sighting Duration":"Undisclosed","Weather Factors":"None","Disposition":"Insufficient Data","Case Number":"5575","files":["/var/www/straped/mufon/html2text/5575.html.txt","/var/www/straped/mufon/org/5575.html"],"trends":["There have been 2 other sightings in Newman","There were no other sightings in Newman on or around October 4th 2006"],"City":"Newman","divs":["Sighting DetailsI was going home after work and I usually drive on lonely roads to get home faster. Around 2:00a.m. in the morning, I happened to look up in the sky because I saw an object with brights colorful lights and it didn't move for a moment, it just stood there for at least 3 minutes. When I saw it, I said to myself, oh! Look at those lights, their nice! But then I got scared. The object started to get closer and I stepped on the gas to get home faster. There was no cars on the road. I wanted to stop and park the car and off the headlights, but then I said, No, I should just get home now! I kepted looking at the UFO and all of sudden thee UFO fled away real fast. I've never seen something like this before. Days later on October 8,2006, I was going home and far out in the fields near the Merced River, I saw an huge bright Orange glow, I thought it must be a fire burning so I called Gustine Police. Then the next day, I saw it again, the same orange glow, but this time it was less glow. The orange glow looked like fire but there didn't seem to be smoke. I checked in the newspaper for fires and there was no reports of fires."]}