{"Region":"Queensland","Source":"MUFON","Country":"Australia","Date Submitted":"10/17/2006 11:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=-27.462493,+153.025472(5597)&iwloc=A&hl=en\"> mufon case (5597) map </A>","City":"Brisbane","Sighting Duration":"Undisclosed","divs":["Sighting DetailsIt was about midnight on 17th Oct 2006 when i walked out to my verandah which looks directly at mt cootha, brisbane, that i noticed an object moving rapidly from the east of mt coother at about 300 feet above grd level. the only reason i assumed cigar was that there were two white lights at either end and in between was dark. It seemed a lot larger than the craft I have seen previously. It moved at a rapid speed and was by pure luck that i happened to be watching at the right moment. I have noticed more recently that I am present when strange phenomenon are present in the sky. This particular incident made me feel exhilirated and quietly excited. I have seen quite a few strange and unexplained things which I have not reported before as I already believe though thought it was selfish not to share my experiences When i first saw the object I knew immediately it was a ufo as the absence of sound from an object so big and so close, as we live in a valley and the sounds echo from everything!! The object simply moved very fast from over mt cootha towards the city and was gone in five seconds after passing past a palm tree."],"files":["/var/www/straped/mufon/html2text/5597.html.txt","/var/www/straped/mufon/org/5597.html"],"Case Number":"5597","Tags":"City","Object Flight Path":"Straight-line path","Object Features":"Undisclosed","Summary":"Object was moving rapidly at about 300 feet above grd level. Was cigar shaped and had white lights at either end.","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"10/17/2006 11:10 UTC","Longitude":"153.025472","Weather Factors":"Unknown","Latitude":"-27.462493","Object Shape":"Cigar","Log Number":"AU-10202006-0001","trends":["There have been 27 other sightings in Brisbane","There were no other sightings in Brisbane on or around October 17th 2006"],"Disposition":"Unresolved"}