{"divs":["Sighting DetailsWell i was driving down interstate 10west going to New Orleans, when at about 3:50a.m. I seen a light in the sky I watched it for about 15 minutes before i ask my fiancee what it could be, at first we thought it was a star, but it was to big to be a star, so than I was like maybe it's a tower so then I realized that we should have passed the tower up, but we never did. Then all of a sudden blue laser light's at the bottom appeared, then from the top red balls were being spit out. I was so scared that I started to pray cause I thought Jesus was coming back. Then all of a sudden a cloud came in front of the object, and I told my fiancee if that thing popped from out the cloud then I knew something was operating it, and before I could really finish the whole sentence it popped out from behind the clouds. So then now I have realized that I'm about to run out of gas so at this point I'm not looking, but my fiancee is watching at this time so here's her statement. Well when i did look up into the sky the red balls were still being spit from the top of this object, and it started to make different forms of highways, and it even a form of the earth and it was spinning around just like the earth spins around. I was so shock that I couldn't even get my camara and snap pictures of this. So by this time I'm getting very sleepy, and I couldn't stay awake, when we arrive at our desination it was daylight outside and this object was still up there my fiancee took his eyes off it for about a second and we looked up there again it just disappeared."],"files":["/var/www/straped/mufon/html2text/5600.html.txt","/var/www/straped/mufon/org/5600.html"],"trends":["There have been no other sightings in LaPlace","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=30.066591,+-90.480085(5600)&iwloc=A&hl=en\"> mufon case (5600) map </A>","Tags":"City","Sighting Duration":"01:45:12","City":"LaPlace","Viewing Distance":"Unknown","Object Shape":"Circle, Oval","Region":"Louisiana","Disposition":"Hoax","Case Number":"5600","Country":"United States","Summary":"all lit up spitting out red balls that made different shapes and forms of different things.","Object Flight Path":"Stationary,Other","Date Submitted":"02/12/2006 04:45 UTC","Weather Factors":"Unknown","Log Number":"US-10202006-0004","Latitude":"30.066591","Object Features":"Dome","Source":"MUFON","Date of the Event":"02/12/2006 04:45 UTC","Longitude":"-90.480085"}