{"Weather Factors":"Unknown","Date of the Event":"10/26/2006 04:20 UTC","Disposition":"IFO","Object Flight Path":"Undisclosed","Latitude":"26.463392","trends":["There have been 35 other sightings in Delray Beach","There were 2 other sightings in Delray Beach on or around October 26th 2006","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=26.463392,+-80.06387(5643)&iwloc=A&hl=en\"> mufon case (5643) map </A>","Object Features":"Undisclosed","divs":["Sighting DetailsToday I will be posting quite a few photos that were taken Last night and Yesterday and the day before and some vacation photos while I was in Maine last week. Lets start with these three. A white disk is in the first than the Black object in the second then I saw some weird clouds last night and tried to photograph them but all I got was this strange looking object. I was using a flash and the camera was pointed at the sky. I have never seen anything like this before. I want to remind Mufons readers that I just randomly shoot pictures of the sky at certain times and I have been lucky enough to capture all of these objects. The key times to photograph here seems to be between 4:00 and 5:00PM in all directions but most show up to my northeast. I think their may be a opening of some kind in this area that allows them to enter into our dimension from elsewhere as the sky does weird things here in one area and at certain times. I will follow up with more photos and maybe video today. I still have to look at three hours worth of video. The reason I post this stuff is to show readers that they want us to know they are coming here and they really do exist. They could very well block my pictures and Video from coming out but they are allowing us to photograph them as to help make people aware that they are here. Thanks for looking JC"],"Log Number":"US-10282006-0004","Longitude":"-80.06387","Source":"MUFON","Object Shape":"Cylinder, Disc, Square, Rectagular, Other, Unknown","Region":"Florida","Tags":"City","Sighting Duration":"Undisclosed","Country":"United States","Date Submitted":"10/26/2006 04:20 UTC","City":"Delray Beach","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/5643.html.txt","/var/www/straped/mufon/more/5643_submitter_file1__JC-10-26-06-whitedisk.jpg","/var/www/straped/mufon/more/5643_submitter_file2__JC-10-26-06-blackobject.jpg","/var/www/straped/mufon/more/5643_submitter_file3__JC-10-27-06-nightunknown.jpg","/var/www/straped/mufon/org/5643.html"],"Summary":"New Objects photographed in Delray Beach, Florida","Case Number":"5643"}