{"Object Flight Path":"Stationary,Other","Summary":"We wittnessed what looked like perfectly round glowing balls that appeared suddenly and hovered over the water. From our vantage point, we could see no evidence of flares.","divs":["Sighting DetailsI was sitting on the balcony of our beach front condo in Ft. Walton Beach. If memory serves, it was around 9:00pm or so. I was sitting there looking out into the night when suddenly a white glowing ball of light appeared in the sky. I don't know how to tell you how big it was. To me, If I were to stretch my hand out to touch it, the object seemed to be the size of a baseball, perhaps that will help determine how far away it was. It was slightly to the left of our hotel balcony but I had a clear view of the thing. Suddenly another light appeared beside it. Several minutes later another light appeared also. These lights just appeared and then went out. They did not fade out or appear to burn out, they just went out, and then appeared to blink back on, one at a time. There was no sound and no evidence of the lights being flares. By that I mean there was no fire trail or sparks that could be seen. I yelled for my kids to come out and look after I saw the first one appear. All three of us wittnessed the lights. They were bright white and appeared to be burning or glowing. I can tell you is that the moon was almost full that night and we had a clear unobstructed view of the horizon. We could also see the water beneath the lights. I could not make out a boat or floating object of any kind. A while later (maybe 15 minutes or more later), after the lights had dissapeared for the last time, we did hear military jets overhead. We often heard and saw jets out over the water during the week we spent down there, but we always \"heard\" them. I told someone I was talking to the next day about the lights and he said they were the after burners on F14s. I told him that I didn't hear any jets at all and pointed out that we heard them all the time. He said they were too far out to hear. These lights were not that far out. If they were in fact farther out than they appeared, they must have been huge! I do remember seeing a large ship at the edge of the horizon during most of the time we were there, but these lights seemed much closer to us, at least closer than halfway between us and the horizon. We spoke with some friends who were staying a few hotels down from us who also saw the lights. Several days later, they said they had seen the lights again and that they did seem to be flares. Do you have any idea what these lights were? Would't you hear or see the jets leaving these after burners? Could it have been something the navy seals were doing out in the water that we simply couldn't see? I don't know what we saw, but it was an unusual sight for us. I believe we attempted to video these lights and may have captured at least one of them on tape. Should I locate footage of these lights, I will figure out how to send them to you."],"Latitude":"30.426571","Object Features":"Unknown","Object Shape":"Fireball","Weather Factors":"None","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Tags":"City","Log Number":"US-11242006-0003","Date of the Event":"09/27/2005 12:00 UTC","City":"Fort Walton Beach","Date Submitted":"09/27/2005 12:00 UTC","trends":["There have been 24 other sightings in Fort Walton Beach","There were no other sightings in Fort Walton Beach on or around September 27th 2005"],"Region":"Florida","Country":"United States","Case Number":"5810","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=30.426571,+-86.612101(5810)&iwloc=A&hl=en\"> mufon case (5810) map </A>","files":["/var/www/straped/mufon/html2text/5810.html.txt","/var/www/straped/mufon/org/5810.html"],"Longitude":"-86.612101","Viewing Distance":"Unknown"}