{"Sighting Duration":"00:00:03","Country":"United States","Region":"Michigan","divs":["Sighting DetailsOn my way to work, driving down I-75, northbound, (this was the first sighting, approx. three weeks before the one dated here), a huge-ball shaped object, with the most beautiful color of blue appearred out of nowhere, flew overhead, and as fast as it appearred, it vanished before my eyes. I have thought of all \"the could bes\", and, nothing fits. Approx. three weeks later, driving (mind you, the time of seeing this both times was within the same hour of 9:45pm-10:30pm), I am sure of the time due to work schedule. The second sighting of this object, which was the same exact description as the first, I was driving southbound on Telegraph Rd. when I seen it in the eastern sky as it was heading more towards Toledo this time, near Lake Erie. I am so very curious to know if anyone else has seen this, and has any information as to what they think it might be. This object appearred out of nowhere, and just vanishes, dissappears. This is not a fire-work, this is not any type of flare, this is something that made my heart stop, it hasn't left my thoughts; especially the shade of blue that it was, unique."],"Summary":"Seen a huge, beautiful-colored blue, ball shaped object appear, fly and dissappear","Latitude":"41.512536","Object Shape":"Circle","Source":"MUFON","trends":["There have been 3 other sightings in Toledo, Ohio","There were no other sightings in Toledo, Ohio on or around December 4th 2006"],"Case Number":"5971","Longitude":"-83.673943","Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=41.512536,+-83.673943(5971)&iwloc=A&hl=en\"> mufon case (5971) map </A>","Date of the Event":"12/04/2006 10:30 UTC","Viewing Distance":"Unknown","Log Number":"US-12262006-0015","Date Submitted":"12/04/2006 10:30 UTC","City":"Toledo, Ohio","files":["/var/www/straped/mufon/html2text/5971.html.txt","/var/www/straped/mufon/org/5971.html"]}