{"trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around October 9th 2002"],"Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/5985.html.txt","/var/www/straped/mufon/org/5985.html"],"Source":"MUFON","Object Flight Path":"Straight-line path","City":"New York","Latitude":"40.718493","Log Number":"US-12262006-0029","Sighting Duration":"Undisclosed","Object Shape":"Triangle","Object Features":"Unknown","Longitude":"-73.999803","Country":"United States","Date Submitted":"10/09/2002 12:20 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.718493,+-73.999803(5985)&iwloc=A&hl=en\"> mufon case (5985) map </A>","divs":["Sighting DetailsArrived from work, dragged telescope onto balcony to study two blue stars I seen the night before. Scope in place looking through eyepiece searching the sky, nothing. First I thought I failed to removed lens cover; checked, cover was not there. Looking outward wondering, perhaps I was wrong and there had never been any blue stars. Alone looking northward and enjoying the peace, I caught many other twinkling stars in the heavens extinguishing in clumps. Than by surprise I came to realize developing before my eyes a huge (closed) \"V\" shape or triangle shadow was slowly, silenty approaching and causing immediate area within to darken. Just moments earlier, I felt rather cold and was planning a retreat inside for some warmth. However, now I found myself unable to move or turn away for fear of losing sight of this unusual yet astonishing event. Carefully laying ear and listening for any sound it might've been admitting but sorry to say I detected not a whisper. Living on the 33rd floor (very top) offers a view like no other. A plus, maybe a gift, but that night had been exceptionally quiet. As it carefully neared I was allowed to distinguish two outstanding colors: an over whelming brown or dark-orange and at its trailing a smaller but vivid black trim. Being I witnessed color, I thought it must not be flying very high and the streetlights are rendering reflective illumination. From my position (and perhaps excitment) I failed to recongnize nothing more than two deimensions. Residing at Co-Op City, the the tower I live in is large in size. Nonetheless, the object in the sky I sensed would have covered most if not the entire building. The event took nothing more than two minutes."],"Date of the Event":"10/09/2002 12:20 UTC","Disposition":"Unresolved","Region":"New York","Weather Factors":"Unknown","Summary":"Standing on my balcony looking North to North East I saw a huge triangle","Case Number":"5985","Tags":"City"}