{"Object Shape":"Fireball, Star-like, Other","Longitude":"-111.653184","files":["/var/www/straped/mufon/html2text/6001.html.txt","/var/www/straped/mufon/org/6001.html"],"Sighting Duration":"Undisclosed","Summary":"Light in sky split in 2 (dripped away from eachother) and flew off in the same direction.","Region":"Utah","Disposition":"Unresolved","Source":"MUFON","Log Number":"US-12272006-0004","Date Submitted":"11/30/1998 02:30 UTC","trends":["There have been 6 other sightings in Provo","There were no other sightings in Provo on or around November 30th 1998"],"Object Features":"Unknown","Date of the Event":"11/30/1998 02:30 UTC","Viewing Distance":"Over 1 Mile, Unknown","Latitude":"40.241094","Weather Factors":"Unknown","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering,Other","Tags":"City","Case Number":"6001","map":"<A HREF = \"http://maps.google.com/maps?q=40.241094,+-111.653184(6001)&iwloc=A&hl=en\"> mufon case (6001) map </A>","Country":"United States","City":"Provo","divs":["Sighting DetailsIt was 1999. Me, my friend Luke, and my girlfriend at the time were on our way home. It was around 2am and we were driving on the old Springville Highway (SR-89) heading south towards Springville. This highway runs North and South right next to the Wassatch Mountain range. My freind Luke was driving, my girlfreind was in the passanger seat and I was in the back seat sitting behind the driver seat. We were heading south towards Springville. I was in the back looking out the window like I normally do while im in a car. We were about 1 minute from the Springville border when I saw a light come from over the mountain and over the valley. At first I thought it was a plane flying over like I've seen so many planes do before. I was watching the light moving and it was moving at the same speed I've seen comemercial airlines fly, so I didnt really think anythying of it at first. After watching it for about 20 seconds I saw it Split in-two. The best way to describe what this looked like is if you've ever lit the end of a plastic straw on fire and watch it drip in flames. I remember the lights being a whitish-orange color. That is what this looked like. It split (dripped) in 2 pieces. The bottom piece that dripped away from the main light dripped south away from the main object while the main object remained in the same place north of the dripping object. The lights looked to be the same size and what appeared to be about 100-200 yards away from eachother (north and south.) At this time I said \"oh my god, it split! Look out the window.\" They didnt immediatly look at first and I remember how mad it made me because I really wanted them to see what I was looking at in the sky before the lights went away. So I said it again more agressivly to look out the window to the sky above the mountains. And before I got finished telling them to look out the window the second time the 2 lights took off at a very high speed in the same direction (slanted upward direction) and the lights just disapeared. I asked my girlfriend and Luke if they saw the lights in the sky and they said they did not. I explained what I had saw to them and what happened and still remember the feeling I had inside me and how upset I was because they didnt look out the windows when I told them to the first time. The reason for me writing this now is beccaue I had no idea who to report this to. I wanted to tell people about what I saw but had no idea where to go. I watched a episode on the History channel tonight and they started talking about Mufon and your website and It reminded me of these lights I saw I and got a pen and paper and wrote it down. I've only told few people about what I saw and most seem to blow me off and dont take me seriously. Thats why im so glad there is a place I can report this and get my experience out there. I know I saw something weird in the sky that night and nothing of this earth can explain the manner in which in moved and behaved and the speed at which it flew away in. If you would like any other information on this please feel free to email me. My name is Brett. Thank you so much for your time in reading this. It means alot to me. Brett"]}