{"Longitude":"-103.724966","Summary":"Witnessed 3 bright lights in a perfect triangle above a large thunderstorm","files":["/var/www/straped/mufon/html2text/6002.html.txt","/var/www/straped/mufon/org/6002.html"],"Case Number":"6002","City":"Tucumcari","Tags":"City","Country":"United States","Latitude":"35.171723","trends":["There have been 3 other sightings in Tucumcari","There were no other sightings in Tucumcari on or around June 15th 1995"],"Date Submitted":"06/15/1995 12:00 UTC","Weather Factors":"Unknown","divs":["Sighting Details My friend and I were returning from a fishing trip and had just passed through Tucumcari heading south on highway 209 shortly before sunset. There was a strong thunderstorm about 2 miles east of the highway that had some of the most violent lightning that I've ever seen. I was riding as the passenger in my friends mustang when I noticed a light just west of the storm and well above it. At first I thought that it was the moon, but then I saw the moon on the other side of the car. Upon further inspection the light was actually three seperate round lights in a perfect triangular formation. The lights did not appear to be seperate objects, but part of a larger triangle shaped object. There was no variation at all in their relation to each other. At this point I told my friend about it and he wanted to see it too. I then took control of the steering wheel while he looked out of his open window to look at the lights. He witnessed the lights as well and came to the same conclusion that they were part of a large object. We took turns looking at the object and driving for about 2 minutes before the thunderstorm blocked it from our view. The object appeared to be moving very slowly and steadily with the storm and maintained its postion relative to the storm the entire time that we viewed it. After we had both confirmed the object we were both excited and fearful at the same time. This object was truely awesome to witness due to its imense size and rock steady trajectory. It was obvious that this was not some sort of freak weather event or some type of aircraft (or even several aircraft in formation). It was moving very methodically and with what seemed like purpose, definately not random at all. We were both pretty freaked out about this event on the trip back to base, and we were left with the feeling that we had been witness to something special. My friend and I were both aircraft mechanics in the Air Force, stationed at Cannon AFB, NM. We both had plenty of experience around aircraft, and you learn to easily recognize the movements of aircraft when viewed at a distance. This object was imense, and unlike any aircraft that we had ever seen (in size or movement). Based on the high altitude that the object was at and the distance between the three lights, this object had to be hundreds of yards across. It was not moving fast enough to be an aircraft either. I seriously doubt that we have any technology that is capable of making an object that large fly. This object would have dwarfed even a C-5."],"Log Number":"US-12272006-0005","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=35.171723,+-103.724966(6002)&iwloc=A&hl=en\"> mufon case (6002) map </A>","Sighting Duration":"00:02:00","Object Flight Path":"Straight-line path","Object Shape":"Triangle","Disposition":"Unknown","Source":"MUFON","Region":"New Mexico","Object Features":"Unknown","Date of the Event":"06/15/1995 12:00 UTC"}