{"Tags":"City","Sighting Duration":"Undisclosed","Log Number":"US-12272006-0008","Case Number":"6005","Source":"MUFON","Object Flight Path":"Straight-line path","Region":"New York","Country":"United States","divs":["Sighting DetailsIt was November 2nd 2005 and I had just left my 12 year old son. I went home at about 6:30pm and started watching T.V. At 6:45pm a looked out of my window. The reason why I know it was 6:45pm was because when I looked up and saw the object I made sure to look at my cable box and check the time, it was 6:45pm. So as I am looking out of my window I noticed planes going by overhead. I've lived hear all of my life and I know that over my house is a plane route to LaGuardia Airport, and I have watched planes go over my house all of my life. I say this because I want you to know that I know what a plane looks like. As the planes are going by I noticed on my left a very bright light. That is when I checked the time, and it said 6:45pm. I then steped out of the window onto my fire-escape. I live on the 3rd floor of an apartment building. I looked all around the light. I looked for wings, and a tail, I did not see either. I looked for a nose and saw nothing. I looked for blinking red lights that planes have under them I saw nothing. I continued to focus my eyes in a circle around the object and saw nothing but a very bright object. I bent my head over and covered the ear facing the ground, and the ear facing the object in the sky was uncovered and I heard nothing, not a sound. The object was as high as some of the planes that go by. I can hear them when they go by, but when this object went by I heard nothing. I had no camera at the time. Believe my I thought of it first but my neice had it. I am used to seeing planes passing by, but when I saw this object I really did not know what it was. I was going in a striaght line on my left towards my and then pass my. I was moving with no sound. I knew that I did all the checks that I knew to do, so after I did all of that and knew that it was not a plane that I ever saw I was a little shocked that I saw it. then happy that I was able to see something that I could not explain. I lost sight of the object when is pasted over and pasted the buildings next to my building. I have never seen an object that bright in my life."],"Latitude":"40.65411","Date Submitted":"11/02/2005 12:00 UTC","Date of the Event":"11/02/2005 12:00 UTC","Disposition":"Unresolved","Object Features":"None","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around November 2nd 2005"],"Object Shape":"Sphere, Star-like","Longitude":"-73.94459","Viewing Distance":"Over One Mile","City":"New York","files":["/var/www/straped/mufon/html2text/6005.html.txt","/var/www/straped/mufon/org/6005.html"],"Weather Factors":"Unknown","Summary":"I was looking out of my window towards the south, when I saw a very bright light in the sky.It was coming towards my direction. I looked at it for about 30 seconds, maybe a minute.","map":"<A HREF = \"http://maps.google.com/maps?q=40.65411,+-73.94459(6005)&iwloc=A&hl=en\"> mufon case (6005) map </A>"}