{"divs":["sighting detailsi returned from picking up dinner immediately after sunset this evening and noticed low in the western sky an illuminated object which i initially suspected was a planet or a satellite reflecting light from the sun. to the naked eye the object was approximately as bright as venus would be. i noticed that no other stars were visible yet, and that the object was slightly to the south of where the sun had set (in other words wsw). i thought it was odd that it would reflect light toward me if it were between me and the sun. i went and got my camera, a panasonic fz5. i shot some shots with a normal exposure: http:\\\\205.244.202.158\\p1090293.jpg http:\\\\205.244.202.158\\p1090294.jpg http:\\\\205.244.202.158\\p1090295.jpg http:\\\\205.244.202.158\\p1090296.jpg http:\\\\205.244.202.158\\p1090297.jpg http:\\\\205.244.202.158\\p1090298.jpg http:\\\\205.244.202.158\\p1090299.jpg http:\\\\205.244.202.158\\p1090300.jpg i then shot 2:41 of 320x240 video on the camera with the same exposure setting: http:\\\\205.244.202.158\\p1090301.mov pardon the size (72mb), i did not further compress the video from the original. i did notice the red and green flashing while shooting the video, but attributed it to the low pixel res of the viewfinder. i then began stopping down to capture more detail in the object if possible and reduce glare. the first few were too dark, but at http:\\\\205.244.202.158\\p1090308.jpg i hit the right exposure (f3.2, 1\\40 sec. exposure) and shot some shots in burst mode. some are clear, some are blurred: http:\\\\205.244.202.158\\p1090309.jpg http:\\\\205.244.202.158\\p1090310.jpg http:\\\\205.244.202.158\\p1090311.jpg http:\\\\205.244.202.158\\p1090312.jpg http:\\\\205.244.202.158\\p1090313.jpg http:\\\\205.244.202.158\\p1090314.jpg http:\\\\205.244.202.158\\p1090315.jpg http:\\\\205.244.202.158\\p1090316.jpg http:\\\\205.244.202.158\\p1090317.jpg all shots are cropped to 1280x1024 from 2560x1920 with the object centered in the frame, but they are not resized. (throughout the white balance was set on the \"sunlight\" setting.) i then went inside and ate dinner with the family. my wife watched the video after dinner and confirmed that it was \"strange\". i do realize that this could be a combination of a satellite and atmospheric effects, and if it's there tomorrow i'll know, but it seems a bit odd. the object did seem to follow the rotation of the earth. thanks a bunch, barry stock hollywood, florida, usa"],"Source":"MUFON","Region":"Florida","Latitude":"26.019091","Country":"United States","Object Features":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=26.019091,+-80.14815(6009)&iwloc=A&hl=en\"> mufon case (6009) map </A>","trends":["There have been 18 other sightings in Hollywood","There were no other sightings in Hollywood on or around December 27th 2006"],"Log Number":"US-12272006-0012","Object Shape":"Sphere","Case Number":"6009","Weather Factors":"Unknown","City":"Hollywood","Longitude":"-80.14815","files":["/var/www/straped/mufon/html2text/6009.html.txt","/var/www/straped/mufon/org/6009.html"],"Date of the Event":"12/27/2006 12:00 UTC","Viewing Distance":"Unknown","Summary":"Rotating sphere flashing red and green following sundown in Hollywood, Florida","Object Flight Path":"Stationary","Date Submitted":"12/27/2006 12:00 UTC","Sighting Duration":"00:05:00","Disposition":"IFO"}