{"divs":["sighting detailslarge group high flying lights - much higher and faster than commercial jet which passed below the object(s). commercial airliner approx. 10k ft. departing from dfw airport. lights appeared faint due to the height and seemed to be moving approx. twice the speed of the commercial airliner. it was moving west to east. did not seem to be involved with the aircraft as the air craft was making a slow south easterly turn. the \"v\" kept on a straight path. due to the height of the object(s) and poor visibility due to surrounding city lights, that is all i can report. 1. sitting on from porch facing north. 2. i watch for shooting stars when i want to relax. 3. something different. i thought of the flying triangle over arizona. that is the only thing close. what i saw was much higher. 4. just flew what seemed to be a straight, level and high path. due to the airliner that was below, for a short period...that is my only reference. 5. i felt perplexed and i went in to get my sister, who also saw the same thing. total time of the sighting was approx. 1.5 min. and 30 seconds for my sister. 6. it simply slowly kept on going until the lights of the city of addison\\carrollton made it too difficult to see. i was originally very faint and hard to see."],"Source":"MUFON","Object Features":"Undisclosed","Disposition":"Unknown","Object Flight Path":"Undisclosed","Latitude":"32.979202","Weather Factors":"Unknown","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/6010.html.txt","/var/www/straped/mufon/org/6010.html"],"Country":"United States","Sighting Duration":"Undisclosed","Region":"Texas","trends":["There have been 15 other sightings in Carrollton","There were no other sightings in Carrollton on or around December 27th 2006"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.979202,+-96.881574(6010)&iwloc=A&hl=en\"> mufon case (6010) map </A>","Date Submitted":"12/27/2006 09:05 UTC","Viewing Distance":"Unknown","City":"Carrollton","Date of the Event":"12/27/2006 09:05 UTC","Case Number":"6010","Summary":"Large group high flying lights - Much higher and faster than commercial jet.","Longitude":"-96.881574","Log Number":"US-12272006-0013"}