{"Region":"Central Macedonia","Latitude":"40.63935","Object Shape":"Unknown","Summary":"Object photographed in the night over Halkidiki, Greece","trends":["There has been one other sighting in Thessalonika","There were no other sightings in Thessalonika on or around July 31st 2004","This sighting has never been favorited.",""],"Country":"Greece","Case Number":"6016","Longitude":"22.944607","Sighting Duration":"00:15:00","Disposition":"Unresolved","Date Submitted":"07/31/2004 11:00 UTC","Source":"MUFON","Weather Factors":"Unknown","City":"Thessalonika","Viewing Distance":"Unknown","divs":["sighting detailswitness took these photos in august 2004 in halkidiki\\greece. the object looked like a blue dot under the moon and the photos are shot with full zoom with the camera on a table (to get a steady shot). the camera was a digital olympus c-350. the pictures are not faked. witness and his wife were on the balcony watching the full moon and he was playing with his new digital camera, when he saw something blue over the village, which was moving to the right. the 1st photo was blurry, the 2nd was taken with a flash and nothing could be discerned, 3rd photo was taken with camera profile for night without flash but due to zoom and motion was also blurry. finally he put the camera on the table on top of 2 books (to get a steady shot) and took the attached 2 photos. the whole event lasted about 15-20min while the object was moving to the right. he couldn't discern features with the naked eye, but it seemed to change inclination. the conditions were not ideal due to full moon and garden lights. the seacoast is at 200m and the object seemed to be over the sea. the odd thing was that while everything else was lit with white light due to full moon, this was blue and it seemed to have some 'exhaust' below. some people whom they showed the photos, suggested it could be a reflection of light sources on the camera lens, but they could see it with their own eyes."],"Tags":"City","Log Number":"GR-12282006-0006","files":["/var/www/straped/mufon/html2text/6016.html.txt","/var/www/straped/mufon/more/6016_submitter_file1__P7290071.jpg","/var/www/straped/mufon/more/6016_submitter_file2__P7290072.jpg","/var/www/straped/mufon/org/6016.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.63935,+22.944607(6016)&iwloc=A&hl=en\"> mufon case (6016) map </A>","Object Flight Path":"Undisclosed","Date of the Event":"07/31/2004 11:00 UTC","Object Features":"Undisclosed"}