{"City":"Greater Landover","Case Number":"6020","Date Submitted":"11/10/1975 12:00 UTC","trends":["There has been one other sighting in Greater Landover","There were no other sightings in Greater Landover on or around November 10th 1975","This sighting has never been favorited.",""],"Tags":"City","Sighting Duration":"Undisclosed","Summary":"3 triangle lights in unison speed across from horizon to horizon in 10 seconds","Object Features":"Unknown","Log Number":"US-12292006-0002","map":"<A HREF = \"http://maps.google.com/maps?q=38.934,+-76.89664(6020)&iwloc=A&hl=en\"> mufon case (6020) map </A>","Object Flight Path":"Straight-line path","Country":"United States","Viewing Distance":"Unknown","Region":"Maryland","Date of the Event":"11/10/1975 12:00 UTC","Disposition":"Insufficient Data","Weather Factors":"Unknown","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/6020.html.txt","/var/www/straped/mufon/more/6020_submitter_file1__LandoverUFO.jpg","/var/www/straped/mufon/org/6020.html"],"Latitude":"38.934","Longitude":"-76.89664","divs":["Sighting DetailsIt was a cold clear night outside of Washington D.C. I was sitting in my wheelchair on the deck of a friends house in Landover Md smoking a cigarette when I noticed an airliner making a final approach to land at National Airport. It took the airliner a good minute to slowly cross my field of view . Just as the Airliner was out of site I noticed something above it moving in the opposite direction (west to east) it was 3 perfect triangles flying in a triangle formation. Now that I think about it it could of been 1 object with 3 triangle lights. THis object was moving at an unbelievable speed. In the minute it took the airliner to cross my field of view these lights shot across the sky in seconds from Horizon to Horizon and made no sound whatsoever. It felt like I just witnessed a UFO. How could anything move that fast across the sky. I told everyone in the house about it. But without seeing it yourself its hard to get the real sense of what happened. Attached is a drawing of what it looked like, the Triangle Lights moved West to East, the Airliner moved East to west landing at National Airport"],"Source":"MUFON"}