{"trends":["There have been 53 other sightings in Rochester","There were no other sightings in Rochester on or around July 31st 1989"],"Summary":"Looked like a dark-gray stingray in the sky with 3 red lights on the underside in the center of it","Region":"New York","Country":"United States","divs":["Sighting DetailsMy friends & I were hanging out together one night at the football field at our high school. We were watching this \"thing\" in the sky that seemed to just stay in one place and change colors quickly from red to green to yellow, etc. We sat on the bleechers & watched for a while and noted that there were about 5 helicopters and several airplanes flying around also. Surprisingly, this was one of the few nights of that summer that we were all sober, so I can't blame this on substance abuse! We watched this \"thing\" in the sky for a while & were talking. I'm not sure how much time passed (maybe an hour?) and then there was a craft hovering over the top of the football field right where we were. It was probably no higher than the top of the high school which was four stories high and was about 30 yards long & the almost the width of the field. It did NOT make any noise, it was the wierdest thing. I think we were all in shock, so I'm not sure how long it hovered but when it took off again, it made maneuvers that we've never seem regular airplanes do. Then, the wierdest thing, about 2 soccer fields down there was a purple strobing light flashing for a while. No idea what it was, but I remember getting freaked out when my boyfriend started walking towards it. Everyone kept saying it was just someone's TV, but it was so bright & fast I didn't think that was the case. It flashed for about 2 mins and then just stopped. After a while we walked down the field to where it would have been and didn't see anything (although it was dark out...). We all know we witnessed something strange that night, but no one knows what. We haven't talked about it since. I wish I had reported earlier since almost 18 years have passed and I probably would have had more details before.'"],"Date of the Event":"07/31/1989 12:00 UTC","City":"Rochester","files":["/var/www/straped/mufon/html2text/6022.html.txt","/var/www/straped/mufon/org/6022.html"],"Viewing Distance":"21-100 Feet","Object Features":"Wings","Date Submitted":"07/31/1989 12:00 UTC","Tags":"City","Source":"MUFON","Weather Factors":"None","Log Number":"US-12292006-0004","Object Flight Path":"Hovering then path,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=43.16813,+-77.606022(6022)&iwloc=A&hl=en\"> mufon case (6022) map </A>","Sighting Duration":"Undisclosed","Longitude":"-77.606022","Latitude":"43.16813","Disposition":"Unknown","Object Shape":"Boomerang","Case Number":"6022"}