{"Longitude":"-76.30149","Tags":"City","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/6032.html.txt","/var/www/straped/mufon/org/6032.html"],"Sighting Duration":"Undisclosed","Region":"Virginia","Object Features":"Undisclosed","Disposition":"Insufficient Data","divs":["Sighting DetailsI was in the army in the early 70s.I was stationed at Fort Monroe.I had started to get into photography and I was at an amusemant park just a short walk from where I was renting.The park was a great place to hang out on a weekend night.I was taking pictures of the lights and all of the familys that were there.A guy came up and shook my shoulder and said I should take a picture of that.I looked over my shoulder and saw a bright white ball of light moving across the sky.I did not get my camera up because I was stunned by the site.It flew passed me and was gone before I could move. It was reported in the news up and down the eastern states and had been seen and reported many people. I'm 53 now.I have seen many effects of light on windows and outside over the years.I think alot of what is reported as UFOs are the same kind of effects.I do know what I saw that night and it was not anything I have ever seen sence then.I keep trying to find the answer to what I saw then,but I have not been able to in the past 33 years. It moved in one direction and changed direction as soon as I looked at it.Like a baseball that changes it's path just infront of the batter.Then it was gone.I knew I had seen something special.I was just mad at my self for not getting a picture."],"Weather Factors":"Unknown","Source":"MUFON","Case Number":"6032","Latitude":"37.012267","trends":["There have been 8 other sightings in Hampton","There were no other sightings in Hampton on or around June 10th 1974"],"City":"Hampton","Viewing Distance":"Unknown","Date Submitted":"06/10/1974 12:00 UTC","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.012267,+-76.30149(6032)&iwloc=A&hl=en\"> mufon case (6032) map </A>","Country":"United States","Date of the Event":"06/10/1974 12:00 UTC","Log Number":"US-12312006-0003","Summary":"Bright white ball of light passed over the beach"}