{"Tags":"City","trends":["There have been 6 other sightings in Milford","There was one other sighting in Milford on or around December 30th 2006"],"Latitude":"39.175338","Case Number":"6036","Sighting Duration":"01:42:02","map":"<A HREF = \"http://maps.google.com/maps?q=39.175338,+-84.294382(6036)&iwloc=A&hl=en\"> mufon case (6036) map </A>","Viewing Distance":"Over 1 Mile, Unknown","Longitude":"-84.294382","Weather Factors":"Unknown","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/6036.html.txt","/var/www/straped/mufon/org/6036.html"],"Object Shape":"Flash, Sphere","Country":"United States","divs":["Sighting Detailsit was about eleven thirty p.m. on december 30, 2006. i went to take my two dogs out and i saw one light moving in the sky and at first i thought it was just a flood light, i went in and came back out. it then went to 3lights then to 4 and 5 lights. it sounds strange but you could see it move north(my right) then back south(my left) then it went right and you wouldnt see it come back left but would start back from the left and go right and see it go back leftthen right but you wouldnt see it come back left and start over. it sounds weird but two days before i saw something even stranger which i will report in a different sighting on this website. ill tell you about that in the next one. but my family arent strangers to ufos. my grandpa told me that two of my great uncles my great uncle charlie and great uncle lester were involved in the military and one was invoved in space recovery and he suposevly was involved in the roswell incedent recovery. also lester worked at right field now known as wright patterson airforce base in dayton ohio. he never told us anyhting but that there is other life out there because if he said anything more he would be court marshelled. but any way they were circilur and were bright lights. they could be flood lights but it was awfully bright for how far back it was. and it looked like that it had something solid behind the lights. but thats the truth and it was what my family and i saw.it lasted for 1 hour and 42 minutes."],"Date of the Event":"12/30/2006 11:30 UTC","Summary":"it was a light then to 4 or 5 lights moving back and fowarth but it was in a pattern.","City":"Milford","Log Number":"US-12312006-0007","Object Features":"Undisclosed","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Date Submitted":"12/30/2006 11:30 UTC","Source":"MUFON","Region":"Ohio"}