{"Date Submitted":"01/01/2007 08:27 UTC","Source":"MUFON","Object Features":"Other","Object Shape":"Fireball, Flash, Square, Rectagular","Country":"United States","Weather Factors":"Unknown","Longitude":"-117.076841","Date of the Event":"01/01/2007 08:27 UTC","Disposition":"Unresolved","City":"Escondido","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Latitude":"33.120857","Tags":"City","Case Number":"6046","Region":"California","Object Flight Path":"Hovering then path,Path then hovering","Summary":"thought it was the space station, but it was larger and brightermoving south. it had 2 objects desend out of the bottom also bright and moved southwest, turning from orange to red and getting brighter then dimmer, back and forth.","trends":["There have been 28 other sightings in Escondido","There were no other sightings in Escondido on or around January 1st 2007"],"Sighting Duration":"Undisclosed","divs":["sighting detailsi was in my front yard in escondido, ca. and noticed what i thought was the iss. it was much brighter and larger looking and i went to get my 8 year old son to look at it with me. when we came back out (5-8 second later)the object moving south was just passing over our house when two more objects came out of the bottom of the original object, on like a beam of light and started to move southwest and become almost as bright as the first object. one of the objects that came out of the first object then ejected another object the same as the first, only one object came out instead of two and it faded out in a few seconds.the original object continued on it's southern path and the two objects moved away at a high rate of speed. five minutes later i saw military fighter type jets moving fast in the same heading almost the exact same position in the sky as the ufo(south)and then turn southwest. that is it. the moon is almost full and it is very bright tonight. clear skys and starry out.this took place on 01\\01\\07 at 8:27pm it was maybe 4 to 6 thousand feet up in the skyand lasted about 6-8 minutes. please let me know if you know what the heck it was, my son,wife and i would like to know what it was. thank you, billy"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.120857,+-117.076841(6046)&iwloc=A&hl=en\"> mufon case (6046) map </A>","files":["/var/www/straped/mufon/html2text/6046.html.txt","/var/www/straped/mufon/org/6046.html"],"Log Number":"US-01022007-0001"}