{"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.76709,+-73.957338(6049)&iwloc=A&hl=en\"> mufon case (6049) map </A>","Latitude":"40.76709","Tags":"City","Summary":"It was a clear sky and I was talking to a friend near my house and I thought there was a balloon off a distance behind my friend so i thought nothing of it until it stoped behind my friends head.","Country":"United States","Date of the Event":"08/29/2005 05:05 UTC","divs":["sighting detailsit was a summer afternoon clear sky no clouds at all i was just talking to my friend in front of my house about sports and at a distance in the same line of sight at which im taliking to my friend an object that came in from the left it was 1\\2 mile out. i passed it off thinking it was a plane or a balloon, so it was still moving left in the distant directory behind my friends head. then it just stoped making my conversation stoped when my friend looked at me and siad \"yoh,what the hell are you looking at!\" and to my surprise my other friend lance that was sitting on my porch saw the same thing i seen. when my friend that i was having the conversation with turned around he amediately understood what was going on because he saw our faces frozen. that is not even the amazing part, while lance and i staired at the disked shape object my friend that just turned around after stoping the converastion identified another simular object right above that i did no see. specificly at a right angle upward on the right side. when all three of us realized that it was a ufo due to the stationary position with no noise thats when the objects slowy picked up and started moving away quickly and disapeared out of sight. till this day im still amazed because i live in the urban area and things like this just don't happen by chance. but that day it did."],"Disposition":"Unresolved","City":"New York","Viewing Distance":"101-500 Feet","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around August 29th 2005"],"Longitude":"-73.957338","Log Number":"US-01022007-0004","Object Shape":"Disc","Object Flight Path":"Path then hovering","Sighting Duration":"Undisclosed","Date Submitted":"08/29/2005 05:05 UTC","Weather Factors":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/6049.html.txt","/var/www/straped/mufon/org/6049.html"],"Case Number":"6049","Region":"New York"}