{"Date Submitted":"12/12/2006 04:16 UTC","Object Flight Path":"Hovering then path,Straight-line path","Latitude":"39.613658","Disposition":"Hoax","Tags":"City","Date of the Event":"12/12/2006 04:16 UTC","Case Number":"6050","map":"<A HREF = \"http://maps.google.com/maps?q=39.613658,+-86.106653(6050)&iwloc=A&hl=en\"> mufon case (6050) map </A>","Country":"United States","Sighting Duration":"Undisclosed","Log Number":"US-01022007-0005","Summary":"saw object in sky south of greenwood airport","Source":"MUFON","Longitude":"-86.106653","files":["/var/www/straped/mufon/html2text/6050.html.txt","/var/www/straped/mufon/org/6050.html"],"Viewing Distance":"501 Feet - 1 Mile","Region":"Indiana","City":"Greenwood","Object Features":"Other","Weather Factors":"Unknown","divs":["Sighting DetailsI was driving down 65 south headed to the county line road exit to go home, when I saw a disc shaped object,hovering in place about a mile south of Greenwood Municipal airport. It was disc shaped,dark in color(very deep shade of gray,and had 3 white lites flashing in sequence on the side I saw. It was about 600 ft. in the air, and from the distance I was away,I estimate it's size to be about 10 yards in diameter. I got off on th ecounty lin eroad exit,and headed south on emerson ave. trying to get closer. I kept it in veiw,till it went STRAIGHT up in the air and disappeared. I saw ALOT of people in their cars looking at it as well. I don't know what it was..but I do know it was not a plane of any sort.I watched the news that evening,as these things tend to get some air time here in the Hoosier state,but no station ran anything. Interestingly enough,that evening and the next day,there was ALOT of military helicopters flying over the area, and a bunch of military vehicles parked at the airport. When I first saw the object, I though maybe it was an ultralight,till I saw closer. It seemed to be about 8 feet thick, and made no noise. I was in complete awe,and thought \" ain't nobody gonna believe this\" till I saw how many others were looking at it. I lost sight when it flew straight up into the sky, and it flew fairly fast."],"Object Shape":"Disc","trends":["There have been 17 other sightings in Greenwood","There were no other sightings in Greenwood on or around December 12th 2006"]}