{"Tags":"City","Log Number":"US-01022007-0007","Longitude":"-86.571657","City":"Undisclosed","divs":["Sighting DetailsWitness reported that he was driving north on US Hwy 421 this morning and had stopped at a traffic light in Mountain City, Tn. As he sat at the traffic light and was watching for it to change, He noted a large shiny (silvery-white) slightly elongated disc shaped object moving in the sky beyond the lights in a slow wobbly motion to the west and below broken clouds. At first he stated, he thought it was some kind of blimp or something possibly dangling from the wires but soon realized what he was observing was very high in the sky. He estimated the object to be the size of a silver dollar at arm's length and about 45 degrees in elevation from his position. The object was smooth, featureless and was plainly visible in the early morning light. He stated that as he watched, a gentleman in a car beside him rolled down his window and yelled \"what the (expletive) is that?\".The reporting witness rolled down his window and replied. When they looked back at the position the object was in previously, it was gone from sight. We request that anyone else having witness this event, please report your experience here using this form. KS(MUFON east TN.)"],"Disposition":"Unknown","Object Shape":"Disc","Sighting Duration":"Undisclosed","Country":"United States","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/6052.html.txt","/var/www/straped/mufon/org/6052.html"],"Object Features":"None","Viewing Distance":"501 Feet - 1 Mile","Summary":"disc shaped object observed by multiple witnesses while waiting on a traffic light","Object Flight Path":"Straight-line path","Case Number":"6052","Date Submitted":"01/02/2007 07:25 UTC","Region":"Tennessee","Date of the Event":"01/02/2007 07:25 UTC","Latitude":"35.521691","Source":"MUFON","trends":[],"map":"<A HREF = \"http://maps.google.com/maps?q=35.521691,+-86.571657(6052)&iwloc=A&hl=en\"> mufon case (6052) map </A>"}