{"Summary":"partialy transparent oval shaped object solid black vertical line in center","Weather Factors":"Unknown","Region":"Connecticut","Sighting Duration":"Undisclosed","trends":["There have been 13 other sightings in Hartford","There were no other sightings in Hartford on or around January 14th 1981"],"Object Shape":"Oval, Square, Rectagular","Date of the Event":"01/14/1981 12:00 UTC","Log Number":"US-01022007-0013","map":"<A HREF = \"http://maps.google.com/maps?q=41.771131,+-72.683033(6058)&iwloc=A&hl=en\"> mufon case (6058) map </A>","City":"Hartford","Disposition":"IFO","Longitude":"-72.683033","divs":["Sighting DetailsI am not certain of the date and year? It had to be between 1980 - 1982? I was attending college at the time. I was also playing guitar for a church prayer meeting in Norwich CT. After the meetings I would usually join a group of friends to go to \"Friendly's\" for an ice cream. I know it was late because I remember the Friendly's closing for the night. It is a 20 minute ride up RT. 2 to Colchester Ct. So it was around 1am. I was unfortunately alone. Just as I was taking the Parem Road exit into Colchester I noticed a strange object over the tree line of the opposite side of the highway. I stopped my car at the end of the exit and sat on the hood of my car as I had a great view of the object. This lasted for at least 5 minutes. It was stationary & totally silent. I have never read or seen anybody else describe on the net or on TV anything like what I witnessed. The object was oval in shape. Solid bright white in the center. As one viewed outward from the center the object became transparent with a distinct edge that moved. I can only best describe the edge as being like a jelly fish! It had an organic appearance. The overall size would be at best guess at 20 to 25 feet? No flashing or colored lights. In the center where it was bright and solid there was a perfect vertical narrow black rectangle. Very un-organic looking! This rectangle was vibrating and moving left to right always staying within the solid area of white. I kept hoping that another car would come up the exit but Colchester was a pretty dead town after 9pm back in the 80s. After about 5 minutes the object began to move directly north. It slowly moved over what once was the Chestnut Lodge restaurant. I got in my car and tried to follow it but it headed North towards Hartford. This is over a small valley so following Mainstreet Colchester I quickly lost sight of it. Early the next morning I called a friend of mine about the incident. He later called me and told me that there was a rash of reports of UFO sightings to the Hartford police Dept that night on the television news. I wish I took note of what station he was watching, what day it was, checked the newspapers for any writeups ... I didnt realize at that time that 26 years later I would still be dying to know what it was I saw and wanting to hear someone elses account of it. For the record I dont subscribe to UFO magazines, or own any books, or have any desire to visit Area 51... It is not a hobby for me. I have shared what I have seen honestly to alot of people. I would hope that my general lack of interest would give a little more credibility to my sighting? But I do keep an open mind.( I have no choice now!) I would love to know if anyone else saw what I saw back in the early eighties? Or even modern reports that are the similar?"],"Object Features":"Other","Latitude":"41.771131","Country":"United States","Viewing Distance":"101-500 Feet","Source":"MUFON","Date Submitted":"01/14/1981 12:00 UTC","Tags":"City","Object Flight Path":"Stationary,Straight-line path","files":["/var/www/straped/mufon/html2text/6058.html.txt","/var/www/straped/mufon/org/6058.html"],"Case Number":"6058"}