{"Object Features":"Unknown","Region":"Florida","Object Flight Path":"Path with directional change","Log Number":"US-01022007-0014","Source":"MUFON","Disposition":"Unresolved","Weather Factors":"Unknown","trends":["There have been 26 other sightings in Tallahassee","There were no other sightings in Tallahassee on or around January 1st 2007","This sighting has never been favorited.",""],"Object Shape":"Cylinder","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=30.441616,+-84.274533(6059)&iwloc=A&hl=en\"> mufon case (6059) map </A>","Date Submitted":"01/01/2007 12:00 UTC","City":"Tallahassee","Country":"United States","Date of the Event":"01/01/2007 12:00 UTC","Case Number":"6059","Latitude":"30.441616","divs":["sighting detailsthe object i saw last night flying over my home in tallahassee, fl was large and to me seemed cylindrically shaped. i was sitting outside on my patio so i am estimating about the time of evening it came into view was about 9-ish eastern time. it was flying rather high and slowly in a direction from north or north west to the south. and after several minutes of watching, looked as if it may have curved to a more south eastern path. i noticed it approaching because of the size, slow speed and light .. unlike the airplanes or satellites i've seen .. and because it was extremely bright, steadily emitting whitish light. eventually i lost view of the object because of trees. i was excited because it was a very unusual thing and then i thought perhaps i was looking at the shuttle going back to the space center. that's until today when i looked it up and found out that it already landed december 22. i am very curious and reporting this episode hoping that someone else in the south georgia\\north florida area got a better look at the actual object\\craft than i did. or, perhaps somebody knows exactly what i was watching."],"files":["/var/www/straped/mufon/html2text/6059.html.txt","/var/www/straped/mufon/org/6059.html"],"Sighting Duration":"Undisclosed","Longitude":"-84.274533","Viewing Distance":"Unknown","Summary":"First thought it was the space shuttle flying over, it seemed larger and brighter then tonight I discovered the shuttle landed on Dec. 22."}