{"Log Number":"US-01032007-0001","City":"Bloomington","Viewing Distance":"Unknown","Object Features":"Undisclosed","Object Shape":"Circle, Disc, Egg","Country":"United States","Date Submitted":"06/17/1997 08:10 UTC","Disposition":"Insufficient Data","Case Number":"6060","Latitude":"40.489773","Longitude":"-88.990387","map":"<A HREF = \"http://maps.google.com/maps?q=40.489773,+-88.990387(6060)&iwloc=A&hl=en\"> mufon case (6060) map </A>","Sighting Duration":"00:00:06","Source":"MUFON","Tags":"City","Region":"Illinois","files":["/var/www/straped/mufon/html2text/6060.html.txt","/var/www/straped/mufon/org/6060.html"],"trends":["There have been 10 other sightings in Bloomington","There were no other sightings in Bloomington on or around June 17th 1997","This sighting has never been favorited.",""],"Weather Factors":"None","Date of the Event":"06/17/1997 08:10 UTC","Summary":"fat disk with 10 or 12 lights on side.","Object Flight Path":"Undisclosed","divs":["Sighting DetailsMy name is Brian Clark. I am 17 years old now. When i viewed the object i was about 7 or 8. This experience was a very large one, even though it was very short lived. One day in the summer i was outside. This was in the backyard of my house on the porch facing north. the sky was very vivid and i could see the stars brightly. I was old enough at the time to know the differance from a commercial jet or airline and something else. my mom or dad went inside for a moment and i looked up and saw this brilliant object in the sky. it looked pretty clear and far away, so it must have been pretty large. It moved in a mechanical path from NE to SW at a slow pace, but judging by the distance it was from me it must have been moving very quickly. at the time i felt a little disappointed that it was moving so slow, but i was still amazed by its presence. i looked for about 5 or 8 seconds as it flew past me. it was like a fat disk shape with 10 or more lights on its side. the lights were constant and did not blink. it had an object on its top that i couldnt make out its shape exactly. i think i ran in to get the binoculars and it had vanished. i then told my dad and he didnt believe me. the next day i told my mom and she told me it might be from the millitary. she believed it was possibly a secret project and flight. i think it was a large pleidian im almost completely sure that this was real, but i always try to keep an open mind that maybe it was just a dream, or a mirage or a hullucination. i had always loved the stars as a child and this experience made me look at them with wonder even more."]}