{"Longitude":"-84.347168","Object Flight Path":"Path with directional change,Path then hovering","Tags":"City","Date Submitted":"01/01/2007 10:30 UTC","Object Shape":"Circle, Triangle, Unknown","Log Number":"US-01032007-0002","Summary":"7 different UFO's within hours of each other","files":["/var/www/straped/mufon/html2text/6061.html.txt","/var/www/straped/mufon/org/6061.html"],"Date of the Event":"01/01/2007 10:30 UTC","trends":["There have been no other sightings in Addison","This sighting has never been favorited."],"Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","divs":["Sighting DetailsMy mom (who was visiting me from ohio)and I were watching television when I noticed something outside of my window. I motioned for my mom to come over only to see a triangluar object hovering for a quick second then picking up speed and then slowly hovering again. It started out to the left of the back of my property, made it's way over my barn and then did a quick left. We lost site in the one window, only to go over to the other one to find that it had made it's way to the other side of the property heading towards Rome Road. During the 3hr time span, 6 more appeared just slowly making their way. One of the other six we know was a circular while the remaining 5 we are not so sure. The one thing we do know is the first one we saw near my barn and going towards Rome Road was in the shape of a triangle. We really at first thought of it as plane activity since we are in a flight path but these were flying way too low to be a plane. The entire time we were stunned and amazed by what we saw as it had been years since the last sighting in our area. We lost site of them all one after the other as each picked up speed and disappeared. We attempted to get footage by way of my camera phone but was unable to capture them. Please note though that when I say Hillsdale County and city being Addison, my farm is located outside of Addison just a few miles from where the Lenawee County and Hillsdale County Borders meet on North Adams Road with the nearest crossroad to us being Somerset Road."],"Object Features":"None, Other","Source":"MUFON","Region":"Michigan","Disposition":"Unknown","Country":"United States","Case Number":"6061","Latitude":"41.986434","Sighting Duration":"03:00:00","City":"Addison","map":"<A HREF = \"http://maps.google.com/maps?q=41.986434,+-84.347168(6061)&iwloc=A&hl=en\"> mufon case (6061) map </A>"}