{"Date Submitted":"07/31/1981 12:00 UTC","Date of the Event":"07/31/1981 12:00 UTC","Source":"MUFON","Weather Factors":"Unknown","Case Number":"6072","Latitude":"41.883869","Summary":"A uniquily colored light in the night sky moving radically","Log Number":"US-01032007-0013","divs":["Sighting DetailsThe light was first seen as I was driving on Route 74 from the center of Tolland toward Willington, CT just as I finished the sharp bend at the Old Cathole Road intersection. I was driving home after visiting a friend and was alone. Home was about one quarter of a mile away. I slowed considerably and kept the light in my peripheral vision as I turned into the home street (Gary Road) and then up the driveway, then another turn to park which positioned my view directly where the UFO was located. Once parked I turned off my lights and the light in the sky, which had remained stationary, made a slow move toward my position. It was at that moment that I realized I was seeing a UFO. I watched in amazement for what seemed to be a short time then turned to see if anybody else was home. To my dismay, it appeared that I was the only one at the house, but my younger sister may be inside. The UFO would float closer and move back but never to the same location, changing it's position each time I made a move of some sort such as taking the keys out of the ignition. I decided to make a run into the house to see if anybody was inside. As soon as I opened the car door, the UFO made an incredibly fast relocation quite a distance away. I ran toward the house and up the first section of stairs, which required turning my back to the UFO. Once at the first plateau of the steps, I turned to look at it again and it shot away and almost instantly was out of sight. Once I got into the house, I was disappointed to find nobody there. I did look at the clock and saw that the time was 9:30. I distinctively remember the clock radio in my car reading 8:00 when I turned the car off in the driveway. What seemed to be only a few minutes of watch the UFO had actually consumed 90 minutes. The realization was startling and a bit frightening. I waited until the next day to get the newspaper to see if there were any reports of UFO sightings and found none. I never filed a report with any authorities. Understanding that I was one of the privileged few to have this experience was enough satisfaction to me. I have told many people about my sighting. Some time in the late 1990s I watched a television show on Public Television's NOVA on UFOs and was very excited to hear the description of a very similar experience that a Priest in Mexico had. The uniquely colored very bright light moving in smooth but radical ways and eventually flying away in a split second. I have checked \"circle\" and \"sphere\" as a shape description, but all I could really see was the intense light that appeared round in shape. The most recent report of UFO sightings in Chicago inspired me to file my report at this time. I am sure there are many more citizens like me that have seen UFOs and have never reported them wishing to avoid attention and the criticism that always comes from authorities and the non-believing public."],"Region":"Connecticut","files":["/var/www/straped/mufon/html2text/6072.html.txt","/var/www/straped/mufon/org/6072.html"],"Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.883869,+-72.363777(6072)&iwloc=A&hl=en\"> mufon case (6072) map </A>","City":"Tolland","Longitude":"-72.363777","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Object Shape":"Circle, Sphere","trends":["There have been no other sightings in Tolland","This sighting has never been favorited."],"Object Features":"Unknown"}