{"City":"Aschaffenburg","trends":["There has been one other sighting in Aschaffenburg","There were no other sightings in Aschaffenburg on or around January 31st 1977"],"Date of the Event":"01/31/1977 01:00 UTC","Country":"Germany","Date Submitted":"01/31/1977 01:00 UTC","Weather Factors":"None","Latitude":"49.973547","Case Number":"6075","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Tags":"City","Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Log Number":"DE-01032007-0016","Source":"MUFON","Region":"Bayern","files":["/var/www/straped/mufon/html2text/6075.html.txt","/var/www/straped/mufon/org/6075.html"],"Longitude":"9.152597","Object Shape":"Oval","Disposition":"Unresolved","divs":["Sighting DetailsI have been sitting on this story for 30 years and feel the obligation to report it. A friend and I were moving belongings into an apartment near Aschaffenburg, Germany in February 1977. We dropped off a car load at the apartment and started to return to Aschaffenburg(after this TOWN)in my car. The time was about 1130-1200 at night. As we left the village my apartment was in, we saw an oval shaped light pattern, football shaped, with 1 red light at each end, 3 red lights at the top, equally spaced and 2 red lights with 1 green light between them, also equally spaced at the bottom. None of the lights were blinking. We were in a very narrow valley, about 500 meters wide and the object was at our same vertical height above the ground. I estimate no more than 300 meters away. I also estimate, due to the apparent distance to the object, taht it was about 35 feet in length and 15 feet from top to bottom as indicated by the lights. I was driving and did not stop. We only commented to each other that neither of us had ever seen that particular light pattern on an aircraft before. We continued our trip to TOWN and began our return with another car load of belongings. Our route took us up and along the side of an open hill with a superb view to the north and west I believe. We were overlooking the TOWN on a bright, clear night and at this time it was about 1AM. I am an observer wheh I drive and am continually looking around at the vicinity aroung my car at all times. As we neared the top of the hill we were driving up, I looked to my left and saw a very large, bright, round light in the sky. I am a professional soldier and know that we humans have no depth perception during darkness so I won't speculate on the distance to this light. I will say without a doubt that I knew that it was out of place. I pointed it out to my friend , he saw it, and when we got to the top of the hill, I stopped the car and turned off the motor. We both got out of the car and this is what we saw. There was a very large, round bright light hanging motionless in the sky that was completely out of perspective with every other light that we could see. Because we were on a hill top, the light was not apparently too much higher than we were. I will estimate it's height above the ground below it to be less than 3000 feet. This will become clear in a moment. We stood outside the car and it was a brilliant clear cold winter night with zero cloud cover. As we watched this large light, another light appeared dropping from what was apparently the bottom of the large light. (Imagine looking at a spot light and having a 100 watt light bulb fall out of it) The small light fell apparently 100-200 feet below the large light and stopped in the air. It held that position for about 2 seconds and winked out. About 2 seconds after the small light winked out, the same oval or football shaped red and green light patern that we had seen on the way to TOWN appeared in it's place and this object travelled toward us and to our right, apparently following the path of the original object we had seen down the same narrow valley. This valley was to our right front, and as the object approached and passed us it was within no more than 1000 meters and as it passed, below us so that we were looking down on it. At no time did either of us hear anything at all. This act was repeated at 4-5-6 minute intervals 5 more times, for a total of 6. (7 including the original spotting about an hour before) We didn't have a watch and no other clock so the times are approximate. Assuming a 5 minute interval, we witnessed this activity for about 30 minutes. The only speculation I am willing to make about this sighting is that it was not anything I have ever seen before or since. It appeared to be a large aircraft of some kind, air-launching several smaller aircraft. I don't know of any power on the planet with that capability. After the 6th object, no others appeared for about 10 minutes. We were cold so we left the hill top and continued to my apartment. During the entire 30-40 minutes we were on the hill top, the large, bright white light remained stationary in the sky as far as we could tell and was still in the same position when we left. If I were given a relatively accurate map of the area, preferrably a military 1:50,000 with grid lines, I could pinpoint where these sightings took place within 50 meters or so. I KNOW that what I saw was extraordinary. We had no camera so there are no pictures."],"map":"<A HREF = \"http://maps.google.com/maps?q=49.973547,+9.152597(6075)&iwloc=A&hl=en\"> mufon case (6075) map </A>","Sighting Duration":"Undisclosed","Summary":"At least 6 aircraft, air-launched 5-6 minutes apart from a larger aircraft."}