{"Longitude":"-95.989558","Tags":"City","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/6083.html.txt","/var/www/straped/mufon/org/6083.html"],"Disposition":"Unknown","trends":["There have been 83 other sightings in Omaha","There were no other sightings in Omaha on or around January 4th 2007"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.258843,+-95.989558(6083)&iwloc=A&hl=en\"> mufon case (6083) map </A>","divs":["Sighting DetailsLeaving a drive-thru restaurant and headed east on Dodge Street in Omaha, Nebraska. It was still quite light and no clouds in the sky, aperfect blue. I noticed the a large loosely organized flock of blackbirds flying about particulary slowly, thinking it strange. The traffic was slowing for a stop light so I sat watching the birds looking northeast and then north, and that's when I saw the object. I watch the skies frequently and this object caught my attention. This is a regular path for the airport (perhaps eight miles to the NE of where I was stopped in traffic), but what I was watching didn't seem to be flying like a plane, as you would normally see. The sun was quite low on the horizon, so the light was good. I rolled down my car window, so I could see without distortion. I just sat there and watched as the object traveled slowly --- not ascending, or dropping. It just seemed to cruising slowly, at an even height. No exhaust. No blinking lights. No apparent wings or tail fins. There did seem to be a darker marking at the east end -- but it wasn't protruding like a plane tail would. The object was high enough that one needed to raise their eyes above the horizon, but low enough not to crane your neck and raise your head to see it. It was low enough that you couldn't see under it --- just the side of the object. For those familiar with Omaha, it was on a course -- perhaps in a line following Blondo Street straight west (again, I was watching from 43rd and Dodge). I wanted to pull off the road and watch it longer, but traffic and my location wouldn't allow. Rushing up to my apartment, I let my food get cold as I called the number on the Omaha MUFON sight, which happened to be a number in Colorado. I spoke with James and he suggested I fill out this form. Hope others saw it. The first thing that came to James' mind was a blimp, but it didn't look that fat. I was quite excited after seeing the object and wanted to yell to others stopped at the light to look, but it was chilly and everyone had their windows rolled up. The first thing that came to my mind, was rush home and report the sighting. After traffic started moving I continued east, the object continued west. I lost sight of it because of the trees in my neighborhood blocked the view when I was able to stop again."],"Region":"Nebraska","Sighting Duration":"00:02:00","City":"Omaha","Date Submitted":"01/04/2007 05:05 UTC","Source":"MUFON","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Summary":"Steady, but slow moving Cigar/Cylinder shaped object. Silver-white in color. No lights. No windows. No apparent wings. No exhuast.","Object Features":"None","Log Number":"US-01042007-0007","Latitude":"41.258843","Date of the Event":"01/04/2007 05:05 UTC","Object Shape":"Cigar, Cylinder","Case Number":"6083"}