{"Log Number":"US-01042007-0010","trends":["There have been 221 other sightings in Chicago","There was one other sighting in Chicago on or around January 2nd 2007","This sighting has never been favorited.",""],"Summary":"Very big bright light","Longitude":"-87.621878","Object Shape":"Star-like","Latitude":"41.879864","Case Number":"6086","Tags":"City","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.879864,+-87.621878(6086)&iwloc=A&hl=en\"> mufon case (6086) map </A>","Date of the Event":"01/02/2007 05:15 UTC","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI'm sitting in my bedroom looking out the west window, it is around 5pm to 5:30 and lasted about 20 minutes. I saw this very bright light and I thought That's pretty bright for a star and low too! Theres a bright moon out too on the other side of the house and a clear night. I opened my window and started taking pictures with my fuji digital camera,and a movie with it too but it dident turn out so will I moved around to much. The object moved so slow you could hardly notice it moving, I watched till I could not see it any more for it was going down ward past the trees. Then I took pics of stars and planes that pass over my house to compare it to the object. But you could hardly see them in the pics even if I lighten the pic up. I can't say how far off this very bright light was. When you zoom up the pic you could say it might be a satelite. What do you think? I don't think I can get that good of a pic of a satelite!!! Zoom it up and tell me your the export! I decided to add the video clip but it needs to be lighten up, the colored lights at the bottom of the video are just cars passing by my fence. and like I said I was moving around too much."],"Source":"MUFON","Region":"Illinois","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/6086.html.txt","/var/www/straped/mufon/more/6086_submitter_file1__tue2.JPG","/var/www/straped/mufon/more/6086_submitter_file2__about525.JPG","/var/www/straped/mufon/org/6086.html"],"City":"Chicago","Date Submitted":"01/02/2007 05:15 UTC","Weather Factors":"None","Viewing Distance":"Unknown","Disposition":"IFO","Object Flight Path":"Straight-line path"}