{"Weather Factors":"Unknown","Object Shape":"Undisclosed","Source":"MUFON","Latitude":"39.417602","Object Features":"Undisclosed","Log Number":"US-01052007-0001","Date Submitted":"07/31/1985 12:00 UTC","Disposition":"Insufficient Data","Country":"United States","Date of the Event":"07/31/1985 12:00 UTC","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.417602,+-81.447824(6088)&iwloc=A&hl=en\"> mufon case (6088) map </A>","City":"Marietta","Summary":"UFO like a Bi plane with just wings.","Viewing Distance":"Unknown","divs":["Sighting Details Do I believe in UFOs, Yes are there aliens? maybe, I am a New Testament Christianand, here are a couple of my experiences. Back in the 80s I was driving my 77 ford pick up home from work one evening. It was just starting to get dark and I was driving up a streach road that led close to the top of a hill when something to the right caught my eye,there are mostly trees on the right side but in an open space I caught a glimps of a glowing light, low and moving the same direction I was going. I thought what the hoot maybe I can get to the top of the hill where the road turns left or right and get another look. When I came to the top it had already turned left around the top of the hill and was coming parallel to me going in the opposite direction, about seventy yards away and maybe sevety five or eighty feet up but listen to this, I stopped, shut my motor off and got out as it came to about a hundred feet away, it didn't make a noise.....it looked like a bi-plane with the nose cutoff flush with the wings and the tail section also cut off at the wings with a full height cab . There wasn't enough light to see any outline of any persons inside. Out near the ends and in between both the wings were large amber colored lights, made like two Dixie cups with the big ends together with the points centered and secured in the wings...... If anone else has seen one please let me know. Another one was nothing but lights, I saw about dark, back about 1963 a light that looked as though a small plane just topping over a hill about a hundred or so yards away all I could see was a blinking light. I was standing leaning on my cousins car, he was facing the other way. Suddenly this small moving light stopped blinking and it looked as though someone was opening a big garauge door and the garauge was filled with brilliant light, then after a second or so it looked like the door closed but there was nothing there and not a sound.........."],"Region":"Ohio","trends":["There have been 5 other sightings in Marietta","There were no other sightings in Marietta on or around July 31st 1985","This sighting has never been favorited.",""],"Longitude":"-81.447824","files":["/var/www/straped/mufon/html2text/6088.html.txt","/var/www/straped/mufon/more/6088_submitter_file1__UFO1.JPG","/var/www/straped/mufon/org/6088.html"],"Tags":"City","Case Number":"6088"}