{"Summary":"My friends and I were out in the woods when we noticed lights in the sky.","trends":["There have been 3 other sightings in Harrison","There were no other sightings in Harrison on or around July 15th 2001"],"Weather Factors":"Does Not Apply","Date of the Event":"07/15/2001 01:04 UTC","Tags":"City","divs":["Sighting DetailsMy friends and I were out in the woods celebrating another summer when around 1:00 am I noticed there was a large orange circle in the west sky I thought nothing more than harvest moon I was a bit tipsy I brought it to my friends attention just then I noticed a steady moving small white light in the north sky it looked like a star but I suspected it was a UFO my friends and I are free thinkers with open minds and this wasn't the first thing we have seen so me and my friend jumped inside his truck to flash the bright lights at the object to try to get a reaction or \"make contact\" after a couple of flashes the steady moving star like light became incredibly bright then dissapeared we jumped out of the truck excited at what we had seen when I noticed the large orange light in the west sky had vanished you can imagine my surprise that genuinely scared me I could almost read the pilot's mind \"there on to us lets get out of here\" I've seen a lot of strange things in my relatively short life but nothing quite like this to this day on a clear night I watch for strange movement in the sky when I told someone close to me about this they responded with if UFO's were real don't you think everyone would see them to this I said noone is looking, I would wager the majority of the U.S. doesn't believe and the rest of the people don't have the time or presence of mind to look at a beautiful night sky. Sincerely, James Davis"],"Country":"United States","Latitude":"44.019186","Source":"MUFON","City":"Harrison","Object Flight Path":"Stationary,Straight-line path","Object Shape":"Circle","Disposition":"Insufficient Data","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.019186,+-84.799468(6089)&iwloc=A&hl=en\"> mufon case (6089) map </A>","Log Number":"US-01052007-0002","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/6089.html.txt","/var/www/straped/mufon/org/6089.html"],"Case Number":"6089","Longitude":"-84.799468","Region":"Michigan","Date Submitted":"07/15/2001 01:04 UTC","Sighting Duration":"Undisclosed"}