{"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/6091.html.txt","/var/www/straped/mufon/org/6091.html"],"trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around August 15th 2004"],"Latitude":"41.887834","Viewing Distance":"501 Feet - 1 Mile","Summary":"three objects approached from east/south-east/ performed maneuvers/last of the objects passed almost directly overhead as I watched with 10x binoculars.","Region":"Illinois","Date Submitted":"08/15/2004 12:00 UTC","City":"Chicago","Object Flight Path":"Path with directional change,Path then hovering","Object Features":"Unknown","Log Number":"US-01062007-0001","Source":"MUFON","Tags":"City","Object Shape":"Egg, Sphere, Star-like","Date of the Event":"08/15/2004 12:00 UTC","Case Number":"6091","divs":["Sighting DetailsFirst off, please note that the month and day of sighting are very approximate, but the time of day was late afternoon; to the best of my recollection, the sun was just setting near the end of the events. I was in my backyard setting up binoculars for a coming evening of star-gazing and picking up around the yard. Looking at the beautiful clear sky, I happened to notice what I recall as three \" glowing objects \" approaching from just south of east over the neighborhood. As a beginning amateur astronomer, I'd made a habit out of trying to guage sky conditions. I thought that these objects were either helicopters or some kind of hover -craft, and remember thinking that this sighting could be associated with the Oshkosh Air Show which I believed to be taking place at the time. These three objects, however , put on quite a show for me! Each of the three objects looked identical . The shape was roughly circular. The size was about the size of a pencil viewed end-on at about 6\" from my eye. The color was an unvarying , glowing red-orange. The luminosity of the object was very striking.I could best describe the effect as blazing . The colored shape did not have a distinct border , but rather seemed to emanate with an even light that nevertheless had a \" fuzziness \" at it's outer edge . The actions of the objects were as follows: They approached in an organized looking group of three covering an area of 20 to 30 degrees in length, north to south, with rather even spacing between them. Their altitude was demonstrated to me when, of all things, a commercial airliner , possibly making an approach to O'Hara field , passed over the group of objects! I'm not sure about the timeframe of the next events ( in terms of how long after the airliner pass they took place), but I do remember the sequence of following events.The southern most object slowly moved further south while not appearing to gain or lose altitude, until it was no longer visible due to being blocked by tree lines to the south. The next most northerly object hovered, and then began to gain altitude without any apparent east to west motion. It simply seemed to ascend in place until it was no longer visible. That left the third object, which seemed to pass directly over my backyard and neighborhood while maintaining a constant, slow speed and altitude.I was able to view this object with tripod-mounted 10x binoculars arranged in such a way that I could view straight up while reclining in a lawn chair"],"Longitude":"-87.628398","Sighting Duration":"00:15:00","Country":"United States","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.887834,+-87.628398(6091)&iwloc=A&hl=en\"> mufon case (6091) map </A>"}