{"Source":"MUFON","Date of the Event":"01/02/2006 05:30 UTC","Date Submitted":"01/02/2006 05:30 UTC","Summary":"Red White & Green lights","trends":["There have been 13 other sightings in Delaware","There were no other sightings in Delaware on or around January 2nd 2006"],"Sighting Duration":"Undisclosed","Tags":"City","Case Number":"6095","files":["/var/www/straped/mufon/html2text/6095.html.txt","/var/www/straped/mufon/org/6095.html"],"Longitude":"-83.062495","map":"<A HREF = \"http://maps.google.com/maps?q=40.302062,+-83.062495(6095)&iwloc=A&hl=en\"> mufon case (6095) map </A>","City":"Delaware","Country":"United States","Object Features":"Appendage(s)","divs":["Sighting DetailsI had two sightings in the city of Delaware, Ohio. The first sighting was around 5:45 P.M. It caught my eye because I thought I saw a plane in the air but had some unique festive like red, white and green bright lights. The object was estimated to be 50 feet above the tree tops, hovered slowly, with no engine sounds. It would make a complete stop and then continue slowly south east. Ok..festive lights on a airplane is possible but I can not give a good description because it alsmost seemed foggy er transparent but did notice 2 long pole like objects attached to it. The second sighting was at 8:30 P.M. Unfortunately there are no witness that I know of. Usually the winter in Ohio is windy and cold but it's been warm and calm. That night the sky was clear, calm and with a full moon. I called it festive because the lights had no pattern to distingish. A light that was once red would turn green or white or skip and stay green when it was exsposed to turn red. It was not a normal aircraft light pattern. It did have three main areas that the lights seemed to come from. Back in the summer of 2001 I had another sighting of a triangle shaped what ever it was crossing over head while I was camping in Kirkersville, Ohio. I stood there with my jaw dropped until it passed behind the trees. The sad part was that the three other friends I was with went to get more beer while I watched the fire when it happened and I never said anything. This time it just bothered me so much that I had to say something."],"Weather Factors":"Unknown","Disposition":"Insufficient Data","Object Shape":"Unknown","Region":"Ohio","Log Number":"US-01062007-0005","Viewing Distance":"101-500 Feet","Latitude":"40.302062","Object Flight Path":"Path with directional change"}