{"Object Features":"None","City":"Walpole","files":["/var/www/straped/mufon/html2text/6099.html.txt","/var/www/straped/mufon/org/6099.html"],"Date of the Event":"01/02/2007 10:20 UTC","trends":["There has been one other sighting in Walpole","There were no other sightings in Walpole on or around January 2nd 2007"],"Weather Factors":"None","Object Shape":"Chevron, Sphere","Latitude":"43.079494","Date Submitted":"01/02/2007 10:20 UTC","Region":"New Hampshire","divs":["sighting detailsmy husband and i were travelling north on rt 12 through walpole nh on the way home. i had looked at our truck's clock at 10:18pm when we were still in westmoreland nh on rt 12, so it was 2 minutes later when we entered walpole nh on rt 12 that we spotted it. there was one vehicle 1\\4 or so mile behind us. whatever it's start point we did not see from the view in our truck. it came directly into our line of sight from above, diagonally crossing our path from west to east, plummeting in a swift-looking decline towards the area, geographically to our east, which we rationalized as the area of alstead or surry nh. my husband is very familiar with the area, having grown up here. we lost track of it when it passed the treeline. no flash or sound that we could sense. it was a large bright fluorescent green orb in the center, perfectly round, with a bright red arrow head shape surrounding it. the visual impression suggested a great speed of decline with no impression of slowing, as for a landing. it was very clear and there was nothing else, no plane or air vehicle shape, indicating a manmade transport. consistency of color, with no variation, which might indicate fireworks or other incendiaries. sorry, no camera!!! as a follow-up, we have seen an increase in military airtravel in the area of our sighting the last several nights."],"Viewing Distance":"501 Feet - 1 Mile","Summary":"while driving a bright green orb with a bright red arrowhead shape surrounding the orb quickly descended toward Alstead NH","Country":"United States","Disposition":"IFO","Log Number":"US-01072007-0001","Tags":"City","Object Flight Path":"Straight-line path","Sighting Duration":"00:00:05","Case Number":"6099","Source":"MUFON","Longitude":"-72.425823","map":"<A HREF = \"http://maps.google.com/maps?q=43.079494,+-72.425823(6099)&iwloc=A&hl=en\"> mufon case (6099) map </A>"}