{"Region":"Colorado","Date Submitted":"05/25/2002 08:30 UTC","City":"Grand Junction","Viewing Distance":"Over One Mile","trends":["There have been 24 other sightings in Grand Junction","There were no other sightings in Grand Junction on or around May 25th 2002","This sighting has never been favorited.",""],"Log Number":"US-01082007-0001","Disposition":"Unresolved","Country":"United States","Object Features":"Patterned Surface","Longitude":"-108.544449","Summary":"I was watching jets overhead , when I seen something different.","Latitude":"39.06695","divs":["Sighting DetailsMy wife and I were over the road truck drivers. On the way home from california we stopped at a favorite truck pulloff of ours on I-70 just east of Grand Junction colorado. Its a box canyon, on the colorado river.I was trying to relax after a long day of trucking,Standing outfront of my truck I was watching the jets flying overhead. When I noticed a dot in the sky that was dark & was moveing in a different line, than the other jets. Than I yelled at my wife to come see. She climbed out of the truck & joined Me in the front of the truck. The dot grew larger and larger, My wife grabbed me shouting is it coming tward us!!?? By this time we noticed there was no sound. we seen no lights. the only way we seen this thing was the moon was riseing in the east, and we were inthis box conyon with no light trash, the stars really come out with no clair. This thing HUGE!! It was NOT from this world. We watched it until it dissapered behind the rocks. We were so shook up about this that we didn`t talk about it until the next day around noon, and we compared notes & decided we seen the same thing. It moved in a straight line leaveing no jet trail, and makeing No sound...."],"Case Number":"6105","Weather Factors":"None","Object Flight Path":"Straight-line path","Date of the Event":"05/25/2002 08:30 UTC","Source":"MUFON","Object Shape":"Egg, Teardrop","Tags":"City","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.06695,+-108.544449(6105)&iwloc=A&hl=en\"> mufon case (6105) map </A>","files":["/var/www/straped/mufon/html2text/6105.html.txt","/var/www/straped/mufon/org/6105.html"]}