{"Summary":"shiny, chrome-colored at distance of 8000 ft","Sighting Duration":"Undisclosed","Tags":"City","Weather Factors":"Unknown","divs":["Sighting DetailsI was driving through the desert outside Albuquerque on the east side of the Sandia mountains towards Madrid and Santa Fe. I was looking out the driver side window at the beautiful mountains. I saw a commercial airline jet slowing down and heading into the city. About 1000 ft behind the jet was a UFO trailing the jet at the same speed. It was very clear. The jet was white. The egg-shaped object behind it was round, shiny, and reflecting the sun like a mirror. I was directly below it looking up at it. I stopped the car and got out to take a better look. I stood and stared at it for another minute. I rubbed my eyes and pinched myself not believing what I was seeing. I was totally straight and sober. After that the jet and the spacecraft went over the mountain, so I could not see them anymore. I was standing there in the middle of the desert with nobody else around for miles. I stood there a little while hoping I would see it again or see another one. I was a skeptic until that day. Now I know it is real. My friends have seen them. My mother, my grandma, my neighbor, and my aunt have seen them too. Most people are afraid to speak out for fear of ridicule."],"Case Number":"6112","trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around February 29th 2000"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.093421,+-106.646967(6112)&iwloc=A&hl=en\"> mufon case (6112) map </A>","Disposition":"Unknown","Latitude":"35.093421","Date Submitted":"02/29/2000 12:00 UTC","Country":"United States","Region":"New Mexico","Object Shape":"Egg","Longitude":"-106.646967","Date of the Event":"02/29/2000 12:00 UTC","Log Number":"US-01092007-0001","City":"Albuquerque","files":["/var/www/straped/mufon/html2text/6112.html.txt","/var/www/straped/mufon/org/6112.html"],"Source":"MUFON","Object Features":"Other","Object Flight Path":"Straight-line path","Viewing Distance":"Over One Mile"}