{"Date of the Event":"05/19/1966 01:13 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.694805,+-105.929759(6119)&iwloc=A&hl=en\"> mufon case (6119) map </A>","Longitude":"-105.929759","Object Features":"None","Country":"United States","Latitude":"35.694805","Tags":"City","files":["/var/www/straped/mufon/html2text/6119.html.txt","/var/www/straped/mufon/org/6119.html"],"Source":"MUFON","Date Submitted":"05/19/1966 01:13 UTC","Object Flight Path":"Stationary,Hovering then path","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 20 other sightings in Santa Fe","There were no other sightings in Santa Fe on or around May 19th 1966"],"Weather Factors":"Unknown","City":"Santa Fe","Log Number":"US-01092007-0008","divs":["Sighting DetailsI was alone in my car, driving from Santa Fe down to Albuquerque. The highway is very straight for miles. The sun was shining with hardly a cloud in the sky. Somewhere between Santa Fe & Albuquerque something caught my eye as the reflection of the sun bounced off this object. I looked up and don't recall seeing a super giant blimp, but there it was. It was maybe 20 times larger than any blimp I ever saw and it was hovering about 2000' over the highway towards the east from my position. I watched in amazement this huge silvery blimp. I recall not seeing what I call the undercarriage where people ride in blimps, which was odd. I watched it for several minutes. The highway was virtually empty so I was able to watch it while driving about 55 mph going straight. Suddenly it began to turn in place while it hovered. As it turned in place, which I watched, it disappeared before my eyes. When I got back to Highlands University in Las Vegas later that day, I mentioned the incident to one of my roommates, Greg Goodpasture. Greg told me that his dad was a General in the Army and was involved in the famous crash at Roswell 19 years earlier. Greg suggested it might have been a UFO which seemed plausible. He told me to keep my eyes out for more as there were many UFO sightings in the area. I remember beliving in their existance, but seeing one, confirmed it for me in my bones. I have always been afraid to file such reports, fearing who or what might want to interact with me. I'm not sure if I filed this report in the past, but I no longer fear the result."],"Region":"New Mexico","Summary":"saw object hovering & turning. As it turned it disappeared as I watched.","Case Number":"6119","Disposition":"Unknown","Sighting Duration":"00:10:00","Object Shape":"Blimp, Cigar"}