{"trends":["There have been 6 other sightings in Los Banos","There were no other sightings in Los Banos on or around August 10th 1968"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.061999,+-120.846535(6122)&iwloc=A&hl=en\"> mufon case (6122) map </A>","Date Submitted":"08/10/1968 10:10 UTC","Latitude":"37.061999","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-01092007-0011","Object Features":"Dome","Weather Factors":"None","Country":"United States","City":"Los Banos","Case Number":"6122","Longitude":"-120.846535","Disposition":"Insufficient Data","divs":["Sighting DetailsMy friend, George Lehrfeld, and I were driving from San Francisco to Los Angeles. South of San Jose we turned onto Hwy 152 to go to Hwy 99 (this was before Hwy 5 existed). As we drove east on Hwy 152 we were just west of the town of Los Banos. The area was mostly farmland and cattle ranches. George was driving. I was looking up at the partly cloudy sky when I saw something through the front window. It was darting into and out of several clouds. I said, \"George! Look up there, I think I see a UFO in the clouds!\" I was pointing and George saw it too. It spent several seconds in a cloud then darted to another cloud. It visited many dozens of clouds over a wide expanse of the sky. We both saw it and were a bit freaked out, hoping it wouldn't stop us or abduct us. There were hardly any other cars out and we decided to not stop and get out, but to just continue on. At one point the flying saucer hovered over some cattle grazing adjacent to us which is when we got a very good look at it. It was classic flying saucer shaped with a bubble on top and on the bottom. Both our mouths were wide open. I can't recall most of what we said to each other at this time. Time seemed to slow down. Then as it darted into a cloud about 1500' high which was close to being overhead, George had his head out the window as he looked up and I had my head on the dashboard looking up. We both saw it dart up towards outer space in a southerly direction at a rate of speed so great, that any human being aboard would surely have died from the G forces exhibited. I have never seen anything move that fast before or since. It may have left a \"comtrail\" but I can't recall for sure. George and I are still friends to this day, but we haven't talked about what we saw together for a long time. I frankly don't recall how much he still remembers but I intend to call him when he returns from his vacation to ask him. I'm not sure what county Los Banos is in but I think its San Benito."],"Region":"California","Summary":"flying saucer darting into clouds then shooting straight up @hyperspeeds","Object Shape":"Disc, Oval, Other","files":["/var/www/straped/mufon/html2text/6122.html.txt","/var/www/straped/mufon/org/6122.html"],"Date of the Event":"08/10/1968 10:10 UTC","Sighting Duration":"00:20:00","Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Tags":"City"}