{"Disposition":"Hoax","Region":"Texas","Object Flight Path":"Hovering then path,Path with directional change","Log Number":"US-01102007-0002","files":["/var/www/straped/mufon/html2text/6124.html.txt","/var/www/straped/mufon/org/6124.html"],"Source":"MUFON","Tags":"City","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around June 10th 1986"],"Viewing Distance":"Over One Mile","Case Number":"6124","Date Submitted":"06/10/1986 12:02 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=30.268853,+-97.738681(6124)&iwloc=A&hl=en\"> mufon case (6124) map </A>","Country":"United States","Date of the Event":"06/10/1986 12:02 UTC","Object Shape":"Triangle","Sighting Duration":"Undisclosed","Latitude":"30.268853","Summary":"I saw 2 UFO's, one in Hays County, Texas it looked like a Nasa rocket taking off, the other was at Nasa 9 red lights in a triangle shape","Object Features":"Patterned Surface","Longitude":"-97.738681","City":"Austin","Weather Factors":"Unknown","divs":["Sighting DetailsI saw a rocket take off from Wimberly, Texas. It looked like a Nasa rocket, while I was staring up at the sky. Wimberly, Texas had a UFO meeting which I attended and many others saw the same thing. I also saw a Nasa rocket, I was near Nasa, and I looked up at the sky and saw 9 red lights in a triangle shape, then I had hallucinations of travelling in a spaceship from Colorado Deep Space to another planet. It was like a dream. I have had many dreams since. I have had my children, grandchildren abducted and disappeared. The man I married has alien powers of disappearing, and contacting others like him, using ice cream cones to communicate with them, then the place we went disappears. I cannot sleep at night, and neither can my sister, she is now in a hospital on life support to get oxygen. My grandscon, Jimmy Garman, disappeared in Gratz, Pennsylvania, and my daughter, disappeared in Corpus Christi, Texas and my 2 great grandchildren disappeared to Mexico, all my children, grandchildren, great grandchildren, have been cut off from me. I am isolated, the man I am with is the only person I ever talk to, no one else, he degrades me to others, to make even my family enemies to me. I think I married an alien. He is smart on physicists, chemicals, mind control. He uses mind control on me and others, and they all do what he says to do. He took me away from Houston, Texas where I grew up and took me to Alabama, Florida, Louisiana, Montana, California and he installed antennaes all over Austin, Texas. His brother sold air space with FCC regulations to someone for millions of dollars. His brother worked for Nasa selling Nasa food. My sister is dying and she was with a man whol also worked at Nasa selling security systems, who wanted to know the names and addresses of all my friends and family. Most of them died and I just lost my brother and my sister is dying. My child disappeared and her 3 children disappeared and her daughter's children disappeared. They put a device in my broken arm which tracks me and it hurts all the time. They did this in June, 1986, World Trade Center, Dallas, Texas. I have real weird drems of space travel. My husband has isolated me from every human being. He destroyed all my family relationships, and he keeps me isolated from any human contact. I sit alone every day and if anyone in my family tried to c all me he interrupts their conversation so I can't talk to anytone. He has the power of mind control over me and my family. Or anyone else, I have seen him do amazing things with physisists at Nasa. He never has sex with me, he is only a roommate, the same with my sister. They are trying to kill us off. They treat us like children, commanding we do what they say, and then they interrupt any conversation we have so we can't talk. My sister had her throat cut up 3 times and she no longer can talk, she is on life support for oxygen to live, she is dying and she can't speak, all my family has disappeared.If anyone comes to see me at my home, he dies. I have had 32 deaths of people in my family and friends who have died after contact with me. Many many suicides. My sister tried to commit suicide, my daughter tried to commit suicide my neice tried to kill herself, her baby and her fetus. My granddaughterr had 4 abortions, killing 4 of my family. Many many suicide have I learned of since being with him. I fear he will kill me too eventually, he tried to strangle me once and none of my family can sleep at night. We all stay awake at night. They have invaded Texas and are immigrating here, replacing us with clones of us. The government is cooperating with them and won't help me or my family, I have tried hundreds of times to get help on the kidnappings of my kids, and the law won't help me. DKimmons@aol.com"]}