{"Object Flight Path":"Straight-line path","Latitude":"40.527391","Date of the Event":"10/27/1996 08:30 UTC","Sighting Duration":"00:20:00","City":"Altoona","map":"<A HREF = \"http://maps.google.com/maps?q=40.527391,+-78.392866(6132)&iwloc=A&hl=en\"> mufon case (6132) map </A>","Longitude":"-78.392866","Case Number":"6132","Object Shape":"Square, Rectagular, Triangle, Other","Country":"United States","Tags":"City","Disposition":"Insufficient Data","Object Features":"Unknown","divs":["Sighting DetailsAlthough this event occured over 10yrs ago, it is permenantly burnt into my memory. This is the first official report I have made, however it is not the first time I've shared my experience. In fact, when it happened, I was not alone. Altoona, the city I live in, is a small city nestled in the Appalacian Mts., thus having lots of hills and valleys. It was atop one of these hills that my story begins. I remember being with two of my friends in a section of town called Pleaseant Valley. We were invited to go to a girls house, because she liked one of my friends and her parents were'nt home. While we were there my friend \"Jon\" and I went out on her 2nd floor deck to smoke cigarettes and leave them alone. It was then that I looked up and saw what I can only now describe as well the single largest object that I have ever seen. And to think that this thing was flying is astonishing. At first, I just noticed stars disappearing and then parts of clouds. I told \"Jon\" to look up too, and although I took his eyes a while to focus on the object, for it was jet black, he said in his slow Norther drawl, and I will always remeber this, \"What the F*%k is that thing!\" Next thing I did was call into the house for my lucky friend and his female companion. My sheer excitement made them come rushing out and just as they reached the deck the object was flying over the sunken space between two hills. In this sunken area sits a Lowes Hardware Store. Lowes lit up the night sky and the valley like a beacon in the night, as it has until the recent development of a mall at the top of the very hill it rests beneath. But for the first time we could really see the object. It was massive, dark, overbearing, silent, frightening. This was not your usual sighting. No lights, no supersonic speed,no sound, nothing. It just moved silently through the night sky swallowing it up as it passed. It was truely amazing. In the light, what we did see was also very unusual. The front came to a point, while the back was squared off. Underneath, there was large structers that hung down, while dented crater shaped areas pocked the bottom. Other than that, there was no more detail about the object I can report for certain. Eventually it just glided away, the same way it came, soundless, lightless, and very very slowly."],"trends":["There have been 20 other sightings in Altoona","There were no other sightings in Altoona on or around October 27th 1996"],"files":["/var/www/straped/mufon/html2text/6132.html.txt","/var/www/straped/mufon/org/6132.html"],"Date Submitted":"10/27/1996 08:30 UTC","Summary":"An astonishingly massive object that seemed to have no color slowly crept across the sky above me at no more than 200ft.","Source":"MUFON","Log Number":"US-01102007-0010","Viewing Distance":"501 Feet - 1 Mile","Region":"Pennsylvania","Weather Factors":"None"}