{"divs":["Sighting Detailsfirst of all I am from mexico so I apologize for my spelling. I was in bed at around 9.00 am I think it was sunday when my dad started telling me to get up (from bed) and go to the back yard to see someting funny in the sky,(northwest direction). Him and I often at nigh like to observe the sky and atually we have seen funny lights He always likes to look up to the sky; I ingnore him because I was tired, for some reason my wafe got out of bed to do something else, so my dad took the oportunity to show my wife what he was looking at and she saw it also, I still was in bed whet I ask my wife whats was it like and she said to me thas it was something thas changed shapes, it was around 9:30 am. so I got curious and decided to go and look, My dad and I have a pair of binoculars his are 20x80 and mine are 25x100 celestron both with stands or tripods (sorry for my spelling) since his binoculars where already set I took a look throw his , I wear correcting glasses so one eye was more clear the the other one, when I looked at the object I got so ecxited and set my binoculars also and this is what I see: OOOOOOO because of the distance I am not sure if they were apart but to me they formed only one object never on horizontal position I did it that way so you can see the shape using the O letter, it was on vertical position stationary problably very long with out binoculars it appear like a shinny star and me movements it did to me were like a number 9 , question mark, horse shoe, sea horse , a capital L , it apear to be made of silver like color, or maybe like vapor claud, I coll 911 and told them what I was seeing the direction , the shape, color , they asked were I was, my name , my address, and told me to wait (aprox. 2 minutes) then again ask me somethin else dont remember the question and made me wait for about one more minute, then she gaveme some website address to see if they had some phone number to call them ( which I never did call) and that was it finally I went to my neighbor's house and him and his two sons also saw the object, it took like three hours to disapear maybe because some clauds."],"Source":"MUFON","Viewing Distance":"Unknown","City":"Undisclosed","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/6137.html.txt","/var/www/straped/mufon/org/6137.html"],"Sighting Duration":"Undisclosed","Region":"California","Longitude":"-119.409932","trends":[],"map":"<A HREF = \"http://maps.google.com/maps?q=36.783861,+-119.409932(6137)&iwloc=A&hl=en\"> mufon case (6137) map </A>","Object Features":"Patterned Surface","Object Flight Path":"Stationary","Summary":"like joined spheres forming like ,quiestion mark, L , musical note, C, horizontal line , with blue joints between the sphares.","Log Number":"US-01112007-0003","Tags":"City","Date of the Event":"11/16/2006 12:00 UTC","Weather Factors":"Unknown","Latitude":"36.783861","Case Number":"6137","Country":"United States","Disposition":"Unresolved","Date Submitted":"11/16/2006 12:00 UTC"}