{"Viewing Distance":"Unknown","City":"Morristown","files":["/var/www/straped/mufon/html2text/6138.html.txt","/var/www/straped/mufon/org/6138.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.796767,+-74.481544(6138)&iwloc=A&hl=en\"> mufon case (6138) map </A>","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Date of the Event":"08/12/1991 12:00 UTC","Date Submitted":"08/12/1991 12:00 UTC","Source":"MUFON","divs":["sighting detailsi have never reported this before but feel compelled to now as it troubles me. i also experienced an earlier sighting with my wife on nov 23, 1976.the 1976 event was made in wayne, nj returning from my wife's grandmothers house. on the road we saw a flat looking oval shaped object passing south to north quickly in the clear sky. it seemed to be at a high altitude with a pale white color. it quickly accelerated and disappeared in 10 seconds. our second event occurred on august 12, 1991. my son thomas and i were sitting on lawn chairs to observe the pleiades meteor shower. suddenly we both became aware that the star field above was blacked out, followed by the observation of what seemed to be a triangular shaped body with squared off corners and lights at the front and rear which were very palish in color. as i am red\\green color vision deficiecient i only saw a bluish color but htere were other colors across the rear. the object emitted a humming sound not unlike the 60 cycle hum one hears from an electric motor. when first noticing this object i was certain it was not an aircraft despite the fact that airlines pass over my house at approximately 19-20,000 feet en-route to newark approach. being familiar with aircraft and being an usaf veteran i know that the object i saw on august 12, 1991 was not an airplane. what intrigues me is this objects altitude seemed very low, possibly 1000 feet and it's sudden departure upward was instant. my son thomas will vouch for this report as will my wife for the nov 1976 sighting. glad to get this off my chest."],"Longitude":"-74.481544","Sighting Duration":"Undisclosed","Disposition":"Unknown","Log Number":"US-01112007-0004","Latitude":"40.796767","Case Number":"6138","Weather Factors":"Unknown","Object Shape":"Triangle","Country":"United States","Summary":"Observing sky for Pleiades meteor shower, my son (11 years old at the time) witnessed a huge trianglular object passing overhead with pale lighting and a humming sound","Tags":"City","Region":"New Jersey","trends":["There have been 9 other sightings in Morristown","There were no other sightings in Morristown on or around August 12th 1991"]}