{"divs":["Sighting DetailsAmateur astronomer viewing full, bright moon, and planets in clear sky; low humidity, no cloud cover - 450 power reflector telescope. Direction: East; towards Pompano Beach [distance to beach approx. seven miles]. slow-rising boomerang shape formation of fluorescent disks out of the East. First thought: Spielberg promo for Christmas release of \"Close Encounters.\" Turned telescope on front area of formation, seeking aircraft \"towing\" formation. None seen. Attempted to resolve disks to closeup; could not. Could not gauge height, distance, or size of formation, when meterite \"burn\" occured in front of boomerang. height: over 100,000 ft.? Watched slow rise of formation towards overhead constellation of Orion; boomerang intersecting belt of constellation, and obscuring first two stars of horizontal belt within dark, empty space of boomerang! Arc continued over eliptic and, as any large extra-terrestrial body, did not continue down horizon [as might an aircraft passing overhead], but \"fell off sky\" as would an extra-terrestrial body passing the planet at a great distance. Size then estimated equivalent to as large as planetoid. Contacted Ft. Lauderdale airport to report sighting. Was told I was one of four reporting. Offered Washington, D.C. telephone number instituted by President Carter for UFO sighting reports. Called, and reported sighting. Received telephone confirmation call shortly thereafter, and a second call at 6:30 a.m. from Professor Hynek from California, who asked me pertinent astronomical questions regarding the sighting, and then requesting I watch Feb. TV show [UFO]; Jack Webb production to see \"mother ship\" first seen in 1888, and again in 1950 [corroborated by retired Admiral vacationing in Arizona RV site who saw exactly like I did, the \"mother ship\" reported]. Placed sighting on UFO computer site, and received, a number of years later, a corroborative response from individual who, with two friends, was fishing off Pompano Beach when they sighted same as I...with one exception. Individual insisted little \"red light\" left mother ship and buzzed their boat, and caused an incoming piper cub to go down and crash onto Beach. He never reported, for all three were not supposed to be where they were that night. Regardless I shouted for viewer support from neighbors, my sighting was made alone, with no real corroborative evidence. But, like Lou Costello of the movies used to say: \"I saw what I saw when I saw it!\""],"Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=26.23786,+-80.124767(6139)&iwloc=A&hl=en\"> mufon case (6139) map </A>","Viewing Distance":"Over One Mile","Source":"MUFON","Object Shape":"Boomerang, Disc","Summary":"19-20 fluorescent small disks against a boomerang form single ship","trends":["There have been 11 other sightings in Pompano Beach","There were no other sightings in Pompano Beach on or around December 3rd 1977"],"Country":"United States","Latitude":"26.23786","Longitude":"-80.124767","Date Submitted":"12/03/1977 01:00 UTC","Case Number":"6139","Date of the Event":"12/03/1977 01:00 UTC","Object Flight Path":"Other","City":"Pompano Beach","files":["/var/www/straped/mufon/html2text/6139.html.txt","/var/www/straped/mufon/org/6139.html"],"Weather Factors":"None","Object Features":"None","Disposition":"Unknown","Log Number":"US-01112007-0005","Sighting Duration":"00:22:00","Tags":"City"}