{"Viewing Distance":"21-100 Feet","Latitude":"34.507011","trends":["There have been 8 other sightings in Apple Valley","There was one other sighting in Apple Valley on or around June 18th 1993"],"Sighting Duration":"Undisclosed","Weather Factors":"Windy, Medium","Country":"United States","Object Flight Path":"Other","Source":"MUFON","Object Features":"None","Case Number":"6143","City":"Apple Valley","Object Shape":"Circle","Date of the Event":"06/18/1993 02:45 UTC","Date Submitted":"06/18/1993 02:45 UTC","Tags":"City","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/6143.html.txt","/var/www/straped/mufon/org/6143.html"],"Summary":"Large ball high in the sky.","divs":["Sighting DetailsMe and a friend were heading down long desert road. I was driving friend Mario was riding shotgun. We were just getting out from Apple Valley high school. Was around 2:30 3:00pm. Heading down Bear Valley rd. Going tords Lucerne Valley. Close to Death valley. In the high desert. We both saw off to the slite right (Our 2:00) over the mountins a ball in the sky. Lookt to be about 2000 feet up and was the size of a dime in the sky. It was a very clear sunny day. We both were pointing and asking eachother \"What is that?\" Was a perfect circal and was blending colors. Reds Blues greens. Colors blending at a fast rate. Object was very still at this time. Changing colors as i drove stright down the road. Watching it for about four minutes when object shot in a blink of an eye to our left field of view (our 11:00). Shot at a slite downword angal behined a small mountin maybe 20 miles away. As soon as the UFO was behined the small MT. there was a short bright white flash of light. I dont know if this UFO crasht or what the short white flash was from. We both felt this was a UFO sighting. We never heard anything about it from anyone else in the area. Caleb R."],"Log Number":"US-01122007-0003","map":"<A HREF = \"http://maps.google.com/maps?q=34.507011,+-117.178036(6143)&iwloc=A&hl=en\"> mufon case (6143) map </A>","Longitude":"-117.178036","Region":"California"}