{"City":"San Diego","files":["/var/www/straped/mufon/html2text/6147.html.txt","/var/www/straped/mufon/org/6147.html"],"Latitude":"32.722229","Weather Factors":"Windy","Country":"United States","Case Number":"6147","Date of the Event":"01/13/2007 07:15 UTC","divs":["Sighting DetailsI was looking out my window in the early morning, and i happened to look up and a round \"disc\" like flying object zoomed (cant think of a different description) into the sky EXTREMELY fast. Then, completely stopped over a tree that was across the street, behind a house. It stationary, but it was spinning in place. While it was spinnging, there was a big, blue, diamond shaped light and it was VERY bright. As I kept looking at the light i noticed that the ship was beautiful. It was the brightest silver I have ever seen and it was perfectly clean not one spot. There were windows on it, i could see them, but i couldnt focus in on it enough to see inside of them. I wouldnt say that I was scared when i saw it, i would probably say I was more stunned than anything. My eyes got big as i saw it fly into the sky. Before I saw it, I was sitting in my room next to my window. I had starting the news. There was nothing interesting on so i looked out my window. I was probably staring for like 2-3 mintutes and then I saw it \"zoom\" into the sky. I automatically thought that it was a UFO once I first saw it. At that time i was thinking, \"Am I seeing things?\". After about 45 seconds to a minute of staring at it, it flew out of the sky very fast."],"Sighting Duration":"00:00:45","Log Number":"US-01132007-0002","Region":"California","Object Features":"Window(s), Appendage(s)","Viewing Distance":"101-500 Feet","Disposition":"Unresolved","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around January 13th 2007","This sighting has never been favorited.",""],"Longitude":"-117.153665","Summary":"Flat, round, flying object with a blue diamond shaped light on the front.","map":"<A HREF = \"http://maps.google.com/maps?q=32.722229,+-117.153665(6147)&iwloc=A&hl=en\"> mufon case (6147) map </A>","Object Flight Path":"Path then hovering","Object Shape":"Disc","Date Submitted":"01/13/2007 07:15 UTC","Source":"MUFON","Tags":"City"}