{"Object Features":"Undisclosed","Longitude":"-95.897141","divs":["Sighting DetailsI have never seen a ufo that I can remember, but have had strange things happen to me as a child when I thought I was safe in my bed. What follows has been haunting me ever since. I was a young boy, about 6 or 7 years old, living out in the country with my mom, dad and two brothers. My dad was in the Air Force and worked at Offutt A.F.B. in Bellvue, Nebr. We lived probably 15 miles west out in the country near Plattsmouth. I shared a room with my middle brother and was asleep in the top bunk while he was in the bottom bunk. I slept facing the wall on my right side, and still do, when all of the sudden I woke up, still facing the wall, and felt as if I was being watched. I slowly turned over only to come face to face with something. Even though it was only 2 or 3 feet from my face, I could not make out its face. I could only see an outline of a head and what appeared to be part of a cape extending out from both sides of its head, reminded me of Dracula. Needless to say, I was petifried but heard or felt a voice say dont be scared, turn back over. So i did. Facing the wall again, I was wide awake and scared shitless but dont know why I never called out for mom or dad. I dont know how much time passed, but I stayed looking at the wall and hoping whatever it was would just go away. Finally, getting enough courage to turn around and look, I seen that whatever was there was gone. Let me tell you, I never, ever made that trip to the bottom bunk faster than I did that night. Flying through the air over my brother to get between him and the wall took seconds flat. He woke up wondering what the heck I was doing and I told him Dracula was in our room. Now both of us are awake and scared with the covers pulled up just below our chins. Our bed was located in a way that when we were sitting up with our backs against the headboard, we could see out into the hallway. We both heard something in the hall and then silence. What happended next, I will never forget, a big green head with big eyes peered around the corner and looked at us and then was gone. We slowly looked at each other as if to say \"Did you just see what I saw?\". Needless to say we spent the rest of the night huddled there awake and waited till daylight. I know this happended during the winter, because we went outside the next day to look for footprints in the snow that was on the ground, but did not find any. To this day, I dont know why we didnt scream bloody murder for our parents as was the case when we would have a nightmare. I told our parents, but they said I dreaming. I wish I could remember more, if there is more, from that night. I have one more weird thing that happened to me but wont go into that now. Growing up, I put these down as bad dreams but would always think about them from time to time. Gradually they faded from memory until I happened upon a book in the library when I was about 16 or 17. It was about ufos and aliens. As I read it, I became engrossed and couldnt put it down, until I came to an artists rendering of what is now the classic grey. Seeing that picture sent chills down my spine and scared me to where I put the book away only to get it out later because I couldnt stop thinking about it which brought me back to this night. About ten years ago, I brought up that night to my brother. He remembers something happened that night but doesnt recall much. I showed him a picture of an alien from a book and he probably thought me to be crazy so I havent mentioned it since even though I think about it time to time. I dont know if what I saw was an extraterrestrial, but I pretty sure it wasnt Dracula and Frankenstein!"],"Log Number":"US-01132007-0004","Tags":"City","Case Number":"6149","City":"Plattsmouth","Summary":"When I was a young child, I was awakened in my bed to see something looking at me.","Viewing Distance":"Unknown","Disposition":"Unknown","Source":"MUFON","Region":"Nebraska","map":"<A HREF = \"http://maps.google.com/maps?q=41.0079,+-95.897141(6149)&iwloc=A&hl=en\"> mufon case (6149) map </A>","Object Flight Path":"Undisclosed","Object Shape":"Unknown","Weather Factors":"Snow","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Plattsmouth","This sighting has never been favorited."],"Date of the Event":"01/01/1975 12:00 UTC","Latitude":"41.0079","Country":"United States","Date Submitted":"01/01/1975 12:00 UTC","files":["/var/www/straped/mufon/html2text/6149.html.txt","/var/www/straped/mufon/org/6149.html"]}