{"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.073611,+-70.261667(6150)&iwloc=A&hl=en\"> mufon case (6150) map </A>","Tags":"City","Source":"MUFON","Longitude":"-70.261667","divs":["Sighting Details On the evening of the sighting three of us were returning to the Sugarloaf ski resort from a trip to the store. It was about 8:40pm we parked our vehicle in the parking lot and started to walk to our hotel when one of us spotted the lights in the clear night sky. At first we thought maybe it was the northern lights since we were so far north, but two of us have seen the northern lights before and this didn't have the same characteristics. There was a central set of bright white lights high in the sky which were shaped in a diamond formation. There were 4 sets of lights surrounding the diamond set like strands, three were whitish and one band was goldish. We proceeded to walk towards the hotel when I spotted a local police officer, I asked him if he was familiar with the northern lights and if this could be it. He said it did not look like it, that many ufo's are seen up here. We went into the hotel to retrieve a camera, we came back out just a few minutes later. The peripheral strands were gone and the diamond shaped seemed to be going higher in the sky and getting dimmer. We watched until it became too dim to see. We went back to the hotel after dinner and each of separately drew what we saw. I am unable to attach the drawings to this e-mail."],"files":["/var/www/straped/mufon/html2text/6150.html.txt","/var/www/straped/mufon/org/6150.html"],"Log Number":"US-01132007-0005","Date Submitted":"01/13/2007 08:40 UTC","Sighting Duration":"Undisclosed","Object Shape":"Diamond","trends":["There have been no other sightings in Carrabassett Valley","This sighting has never been favorited."],"Case Number":"6150","Weather Factors":"Unknown","Viewing Distance":"Unknown","Date of the Event":"01/13/2007 08:40 UTC","City":"Carrabassett Valley","Country":"United States","Disposition":"IFO","Object Flight Path":"Stationary","Summary":"viewed diamond shape set of bright white lights high in the clear night sky, accompanied by 4 sets of smaller rows of various lights.","Region":"Maine","Latitude":"45.073611"}