{"Sighting Duration":"Undisclosed","Source":"MUFON","divs":["Sighting DetailsCool crisp night. Went out to stand on my patio with my former son-in-law to get some air after moving a lot of boxes. Clear night with lots of stars. This was very close to the Dorval International Airport, now called Pierre Elliott Trudeau Airport. We were facing west, just standing there. All of a sudden we both saw four round yellowish lights above us - can't remember if initially they were moving slowly or not moving. Then they moved, or started to move, very, very slowly to the north (to our right). I think what made us first notice these things was that 1) they seemed low so as to be seen from the \"corner\" of our eyes, and 2) with it being such a beautiful night I naturally wanted to look up at the stars. What did I think it was when I first noticed? Immediately UFO came to mind.. what \"type\" of unidentified flying object, I didn't know, but nothing I'd ever seen before. I knew it was most unusual. They were not pinpoint lights, like stars. There were two and then a bigger space, then another two - i.e., four in a row: One, then a space, then one, then a bigger space, then one with the same smaller space as between the first two, then one. Couldn't tell if it was four objects, or two, each with two lights. The lights were not bright like airplane lights. There was no sound, no vibration, no wind, no markings on them. They moved slowly to the north, then the two on the left side took off together at an astonishing speed, to the north. A couple of seconds later the other two lights, together, took off in the same direction at the same astonishing speed. ---I realize this was over 20 years ago, but I've always wondered about it and would like to know if you're aware of any other reports from that night. I went into the house and immediately wrote an account of it, which I still have. Because the night sky was black, it was very hard to get perspective, so I can't say if they were close to the ground, although I think so, or if they were very big things and high up. Right after all four lights took off, I looked way down at the sky westward and saw a very thin red line of light pointing in our direction. It looked like a laser, that's the only way I can describe it. We were absolutely spellbound. Neither of us blinked, moved, nudged each other or said to each other \"Hey, did you see that?\". I also think we didn't even breathe, not wanting to miss a second of it. My former son-in-law said he \"felt\" like they (the four lights) had come into our atmosphere, then left. I didn't see them coming, but I sure saw them going at lightning speed. The next day I had a bad intestinal upset, which kept me running to the bathroom (sorry, don't want to be graphic). I was to start a new job that day at 4:00 p.m. and was worried that I might not be able to go. I did though - the upset lasted for a only few hours in the early part of the day. I have very rarely ever gotten upsets like that. I have never forgotten this, and I'm really interested to know if you've ever heard of this. I remember, although this part I did not write down, that somebody told me the next day that there had been reports on the radio of people seeing what we'd seen. Do you have any information? It would be much appreciated. Thanks. Cathy O'Brien"],"trends":["There have been 47 other sightings in Montreal","There were no other sightings in Montreal on or around April 26th 1986"],"Log Number":"CA-01142007-0006","Case Number":"6156","Object Flight Path":"Straight-line path","Tags":"City","Longitude":"-73.544572","Summary":"Four pale round yellowish lights moving slowly, then two taking off at extremely high speed, then the other two.","Object Features":"None","City":"Montreal","Region":"Quebec","Object Shape":"Circle","Viewing Distance":"101-500 Feet","Latitude":"45.51053","Date of the Event":"04/26/1986 10:00 UTC","Date Submitted":"04/26/1986 10:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.51053,+-73.544572(6156)&iwloc=A&hl=en\"> mufon case (6156) map </A>","Disposition":"Unresolved","Weather Factors":"None","Country":"Canada","files":["/var/www/straped/mufon/html2text/6156.html.txt","/var/www/straped/mufon/org/6156.html"]}