{"Latitude":"42.433333","Source":"MUFON","Date of the Event":"12/18/2005 06:45 UTC","files":["/var/www/straped/mufon/html2text/6157.html.txt","/var/www/straped/mufon/org/6157.html"],"Summary":"bright- orange silent object moving slowly dropping fire out of underneath object with fire dissipating after roughly 300 ft. object flying near 2,000 ft high","Object Shape":"Other","Weather Factors":"Unknown","City":"White City","Sighting Duration":"Undisclosed","Country":"United States","divs":["Sighting DetailsFirst of all, this was 1 year ago, first at the end of December 2005 and then again within the first week of January 2006. My wife, 8yr. old son and I were driving home and I noticed a bright orange object flying in the normal route of airplanes that take off and turn and then head south. I assumed at first it was an airplane but because of the bright orange glow I joked to my family \"look there's a ufo\". This was actually just a joke not even being serious myself. We drove for a few more seconds and my son said \"Daddy, the ufo's dropping fire\". And of course I thought he was playing along and I was like \"yeah right you're really funny\" . And then when my wife said, \"He's serious, the thing's dropping fire from underneath. So at that time we were just turning right on Atlantic Avenue and I looked to my right and saw the thing still heading south. I didn't pull over yet but they kept looking at it. We were almost home. Anyhow so I turned left on Avenue G and actually pulled over and rolled my window down and the thing looked as if it wasn't moving although it could have been traveling away from us but it looked like it wasn't moving and fire would come out of this thing. The best way to describe it was: deliberate. This was not any kind of aircraft with electrical problems causing sparks. The fire would come down. Obviously for it to be fire, something had to be \"on fire\" but whatever it was it would just dissipate after falling hundreds of feet. By the way this was over rural suburbs. Not subdivisions(although it did fly over subdivisions at first but where it was actually dropping fire, there was houses below, not many but nonetheless-houses. It wasn't fire shooting out the bottom. It wasn't a beam. It could have been a solid object or a group of small objects being let go at once. But the point is this \"spec\" of fire would fall and fall and fall and then just disappear before it hit the ground. Then a few seconds would go by and nothing. Then another fire thing would come out. The truth is I was angry when this was happening because it appeared so deliberate that I was afraid that somehow, even though the fire disappeared before it hit the ground that it would somehow catch someone's house on fire. I was very upset about this. So altogether there were about 5-10 of these things that dropped out. I contacted the airport authority to see if they knew anything about a distressed plane. They said there were no reports of any kind. The next day I contacted a \"hotshot\" forest fighter. He told me that during forest fires they drop fire things that are used to fight the fire somehow by diverting it but that there's no chance that these things would be used so near a town and especially when there's no forest fire. I contacted an airplane mechanic that told me that it did not sound like fog \"seeding\" because the seeding is a white color. I agreed with him because there was no fog that night. There was low clouds though, both times we saw them. I contacted the FAA in Portland. They were kind of like\" well who knows what you saw\". They actually told me about Mufon at that time but I didn't know you guys investigated. I would have loved to talk to you about it but after the FAA guy didn't seem too interested I figured nobody would be. We contacted the radio station. It is 1400AM located in Medford, OR. That's only a few miles from White City. They invited us on the next morning to tell people what we saw. We didn't use our last name on the program, just the real first names. I found 2 other accounts of people seeing this same exact described object in 2003. July I think, in Concord, CA.Ultimately both times we lost sight of the object as it moved upward and disappeared. By the way, the second time we saw it we had actually just got home and got out of the car. On this occasion I actually ran to my front door, unlocked it ran to the office with my shoes on which is breaking the no-shoe rule grabbed the camcorder, ran outside. I had plenty of minutes of film available but of course the battery was virtually dead. For the last year I've been hoping to see it again. I always have my camcorder ready but what are the odds I'll see it again. We do have an airforce base about 80 miles to the east, but why would they drop fire over people's houses if it is classified? Thanks for your time. You can ask my wife or son of 10 now what they saw too. (My son is the one who actually spotted the fire-dropping craft both times)"],"Case Number":"6157","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Disposition":"Unknown","Log Number":"US-01142007-0007","Object Features":"None","Longitude":"-122.833889","Tags":"City","trends":["There has been one other sighting in White City","There were no other sightings in White City on or around December 18th 2005"],"Object Flight Path":"Hovering then path,Path then hovering","Region":"Oregon","map":"<A HREF = \"http://maps.google.com/maps?q=42.433333,+-122.833889(6157)&iwloc=A&hl=en\"> mufon case (6157) map </A>","Date Submitted":"12/18/2005 06:45 UTC"}