{"Longitude":"-104.979173","files":["/var/www/straped/mufon/html2text/6158.html.txt","/var/www/straped/mufon/org/6158.html"],"Object Flight Path":"Stationary","Latitude":"39.748454","Tags":"City","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around October 25th 2005"],"Region":"Colorado","Source":"MUFON","Log Number":"US-01142007-0008","Case Number":"6158","Object Shape":"Disc, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=39.748454,+-104.979173(6158)&iwloc=A&hl=en\"> mufon case (6158) map </A>","Object Features":"None","Summary":"Black circular object hovering below clouds at approx 5,000 feet","Viewing Distance":"Over One Mile","Date Submitted":"10/25/2005 03:30 UTC","Date of the Event":"10/25/2005 03:30 UTC","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Country":"United States","Disposition":"Unresolved","City":"Denver","divs":["Sighting DetailsI worked at the Union Pacific Railroad Terminal in Denver, CO as a Switchman in the yard that day and after work I decided to sit under the bridge next to the railyard terminal to wait for my friend to get off his shift. As I took a seat under the bridge, I happened to gaze up and saw a helicopter fly by at approximately 2,000 ft. I knew it was a helicopter because of the lights flashing on it and I could see the outline of the copter as well as the rotorblades turning. Plus it was moving below the cloud deck in a straight westward movement. I am also very adept at identifying aircraft, as I was an airborne aircraft controller and surveillance operator for 20 years in the Air Force. Planes have always been a passion of mine and I have over 7,000 inflight hours in the E-3A AWACS and EC-130E. I am also very aware of weather baloons, fighter aircraft, UAVs and stealth technology through my experiences in the Air Force. I then happened to lean my head back onto the bridge pillar when my eyes became fixed on a small black dot stationary in the sky. It was floating right below the cloud deck at approximately 5,000 ft. My first thought was why aren't there any lights flashing off of it. I know that all aircraft are supposed to have lights flashing on them to alert other pilots of their position. This object appeared to be floating right at the bottom of the clouds as it periodically would enter a cloud and then reappear. I knew this was strange, but also felt that my eyes were playing tricks on me. So I decided to take my eyes off of the object for a few seconds and then see if I could find it again. Sure enough, I was able to find it with ease. Again I watched it closely, to see if I could distinguish what it was but all I saw was a small black circular object. I then took my eyes off of it several times to see if my eyes were playing tricks on me again, but I found it easily time and time again. As the Denver Airport was not too far away, I could see other aircraft moving on the horizon, some even farther away than this object was, but I could clearly see they were aircraft as their lights were flashing and they were manuevering. I did this for comparison to see what the differences were between this object and known aircraft in the area. After a few more minutes, the object faded up into the clouds and disappeared. I stayed to see if the object would still be there when the cloud rolled by, but it wasn't. It was clearly gone and I truly believed I had witnessed something out of the ordinary and unexplainable. When my friend finally arrived, I couldn't contain my excitement and told him what I saw. He told me it was time to go get a beer! I am very confident that this object was not a balloon of any sort as it was not moving with the wind nor was it there when the clouds finally moved on. It was not a helicopter or any other aircraft as it was not flashing any lights like the other aircraft in the sky and it was not properly flying by VFR rules. It remained stationary as the clouds rolled through it and then it appeared to go up into the clouds and disappeared. This even happened in the middle of the day at approximately 1530 hours so visibility was good. Because of this incident, I find that I am watching the skies a lot more closer."]}