{"Country":"Canada","Latitude":"50.393333","divs":["Sighting Details I was an air trafic control officer working the early morning shift at the RCAF training base just outside the city of Moose Jaw Sask. As a traing base we opened the tower at 5 am. The first flight of the day was a weather flight to determine the base of clould and the tops. We had just launched Buzzard One and the pilot reported the base of cloud at 16000 ft he soon reporteon top at 23000 and was given an eta to the tacan at a time. This info was passed to the briefing room for the students. The assisant and me were looking south when out of the ground to the east we witnesed a hugh ball of fire climbing on a constant angle to the ground. It was trailing a hugh multi coloured flame of many colours. It was moving so fast that we only saw it for maybe 5 sec.before it entered cloud far to the west of Moose Jaw.At this time i called Buzzard One and reported the object as traffic. The pilot saw nothing. The land line phone to the civilian tower at the Regina airport lit up and when i answered the phone the controller there asked me what i had seen. We discussed each others story. The object was first sighted by Regina somewhere around the Man. Sask. border and was seen entering the base of cloud west of MJ. The land area from Man. to Alta. is around 400 miles and after talking to Regina again and from where the object entered cloud it couvered 400 miles in about 5 seconds.I went back to the pilot and gave a much greater briefing on what had happeened and he proceded west on top but saw nothing. This was all logged in the tower log and was passed on to base higher ups. Nothing more came back to me or my assistant. End of story I have one moreand will pass it on after hearing from you."],"trends":["There have been 15 other sightings in Moose Jaw","There were no other sightings in Moose Jaw on or around May 15th 1968"],"Longitude":"-105.551944","Sighting Duration":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","Tags":"City","Region":"Saskatchewan","Summary":"a multi coloured ball of flame, much like a jet eng with a rooster tail. Could be afire ball moving from the ground at a 40 degree angle at speeds in excess of mach 4. a guess.","City":"Moose Jaw","Date of the Event":"05/15/1968 06:14 UTC","Object Shape":"Fireball","map":"<A HREF = \"http://maps.google.com/maps?q=50.393333,+-105.551944(6159)&iwloc=A&hl=en\"> mufon case (6159) map </A>","Disposition":"Unresolved","Case Number":"6159","Log Number":"CA-01142007-0009","files":["/var/www/straped/mufon/html2text/6159.html.txt","/var/www/straped/mufon/org/6159.html"],"Viewing Distance":"Unknown","Object Features":"Undisclosed","Date Submitted":"05/15/1968 06:14 UTC","Object Flight Path":"Undisclosed"}