{"files":["/var/www/straped/mufon/html2text/6160.html.txt","/var/www/straped/mufon/org/6160.html"],"Sighting Duration":"Undisclosed","City":"Kelowna","Latitude":"49.891582","Source":"MUFON","Object Shape":"Sphere","Longitude":"-119.490311","divs":["Sighting DetailsI woke up at 4:15 am because my outside dog was barking and that was very unusual unless there was somebody there. I looked out the window to look for the dog and I saw a bright white object through the pine trees. It was very bright and it wasn't up very high in the sky, I was gauging where the object was exactly by where it was in relation to the tree branches. I watched for about 15 minutes when I decided to run downtairs and get the binnoculars. The object was so bright I could not make out the exact edges but I could see lights coming out from the top intwo different directions (like attennas going in different directions but I could not describe an exact shape) the object did move but very slowly, it drifted upward and to the right of the tree and as it got lighter in the sky it floated up until it was a dot in the sky at aroung 5:30 a.m. When it was light enough to see I looked at the tree branches to see exactly where I saw the light first and it was in front of one of our mountains called Black Mountain (it is on the very outskirts of Kelowna where not many people live. I told my husband and children what I saw the next day and was very spooked about the experience. I phoned a T.V.station and newspaper to ask if anyone had reported a light and one fellow told me it was Venus. I thought it could be possible so a few nights later I got up at 4:30 a.m. so I could verify in my mind if this light was Venus but to my surprise when I looked out the window hoping to again see the light it was black. I was quite upset to think what I saw may have been a UFO. I went back to bed and when I awoke a couple hours later I walked out to our driveway to get our daily paper and to my surprise the front page had a picture of a crop circle that had been found in a nearby field. The crop circle was the same shape as the light that night and the crop circle was found July 31. I started screaming for my daughter to take a look at the paper and she was also very freaked out looking at the paper and seeing in print what I had been describing to my family for days."],"Date Submitted":"07/31/2006 04:30 UTC","trends":["There have been 9 other sightings in Kelowna","There were no other sightings in Kelowna on or around July 31st 2006"],"Date of the Event":"07/31/2006 04:30 UTC","Log Number":"CA-01142007-0010","Weather Factors":"Unknown","Region":"British Columbia","Object Features":"Appendage(s)","Country":"Canada","map":"<A HREF = \"http://maps.google.com/maps?q=49.891582,+-119.490311(6160)&iwloc=A&hl=en\"> mufon case (6160) map </A>","Summary":"Bright White Sphere shaped","Viewing Distance":"Over One Mile","Disposition":"Unresolved","Case Number":"6160","Object Flight Path":"Hovering then path","Tags":"City"}