{"Tags":"City","trends":["There have been 55 other sightings in Ottawa","There were no other sightings in Ottawa on or around November 12th 1971"],"Region":"Ontario","files":["/var/www/straped/mufon/html2text/6165.html.txt","/var/www/straped/mufon/org/6165.html"],"Latitude":"45.42394","map":"<A HREF = \"http://maps.google.com/maps?q=45.42394,+-75.688673(6165)&iwloc=A&hl=en\"> mufon case (6165) map </A>","Log Number":"CA-01152007-0005","Disposition":"Unresolved","Summary":"Flying low level-fast-then came to complete stop- then departed to clouds","Country":"Canada","Weather Factors":"None","Date Submitted":"11/12/1971 05:30 UTC","Object Features":"Window(s)","Source":"MUFON","Viewing Distance":"101-500 Feet","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Object Shape":"Disc","Longitude":"-75.688673","Date of the Event":"11/12/1971 05:30 UTC","Sighting Duration":"Undisclosed","City":"Ottawa","divs":["Sighting DetailsI was in PeeWee Hockey and often walked to arena and on that Nov day there was no snow on ground but a heavy frost. I lived on the Canadian Forces Airbase formally known as Uplands. I was walking alone in a field on base property and was a little afraid of dark and decided to look for stars to occupy my time. I suddenly noticed very bright ( like LED white) light off to my left and noticed 3 black out areas were visible. No sound was emitted at all and the object came to complete stop and hovered at tree top level as if to observe me. After a few seconds it took off at high rate of speed to low level cloud layer. I left running...and this is were it gets wierd..I have no memory of playing hockey that day. The object impressed with its speed and no sound at all and the sharpness of the blacked out areas in the UFO with the middle squared shaped and the two outer ones like a square tilted slightly to follow the conture of the shape of the UFO. I was very familar with most aircraft at that age and went on in later life to become a Military Air Traffic controller. I never told anyone to this date about the memory loss, but did convey the event of the UFO I saw. I was so close that I really had the impression that it stopped to look at me and then left in must faster than originally flying along when I first observed it...no sound barrier broken."],"Case Number":"6165"}