{"Summary":"saw an object move very very fast between clouds, not a plane, too too fast","files":["/var/www/straped/mufon/html2text/6167.html.txt","/var/www/straped/mufon/org/6167.html"],"City":"Knoxville","map":"<A HREF = \"http://maps.google.com/maps?q=35.962878,+-83.916859(6167)&iwloc=A&hl=en\"> mufon case (6167) map </A>","Tags":"City","divs":["Sighting DetailsI was letting my cat out and since its still unseasonably warm here still, 54 degrees, I decided to step outde with my first cup of coffee. It was between 5am and 5:45 maybe even 5:30. I was facing northwest to north and I was looking up at the relative fast moving clouds. It was not totally overcast. I saw a very bright object, brighter than a plane but it did not illuminate the sky. It was a white light not a blinking one. I do look up qite a bit at the evening sky and know what a plane looks like and this moved much much faster than any jet I have ever seen. Although it was the size of a plane traveling at a normal altitude it moved faster than anything I have ever seen. It moved from left to right and if I extended my arm the object could be covered with my thumb but traveled the distance of a yardstick if held in my hand. I noticed that it traveled in between clouds. Maybe a shooting star, I don't know. The brightness and the speed made this unlike anything I have ever seen. Probably explainable but I thought I would report it anyway just in case anyone else saw it. My feelings? Glad That I had seen something unusual but it was probably shooting star or space debris reentering the atmosphere."],"Longitude":"-83.916859","Object Shape":"Circle","Object Features":"Unknown","Date of the Event":"01/15/2007 05:40 UTC","Latitude":"35.962878","Sighting Duration":"Undisclosed","Country":"United States","Object Flight Path":"Straight-line path","trends":["There have been 50 other sightings in Knoxville","There were no other sightings in Knoxville on or around January 15th 2007"],"Weather Factors":"None","Log Number":"US-01152007-0007","Date Submitted":"01/15/2007 05:40 UTC","Viewing Distance":"Over One Mile","Disposition":"Unknown","Case Number":"6167","Region":"Tennessee","Source":"MUFON"}