{"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.661756,+-79.380704(6168)&iwloc=A&hl=en\"> mufon case (6168) map </A>","Region":"Ontario","City":"Toronto","divs":["Sighting DetailsI was on a break at work! I worked in the shipping and receiving department! I was looking out the large shipping office window about 4:30 in the morning when I looked up and noticed a red flashing light in the sky! It was a clear night, and as I looked at it I noticed it was staying in one spot. I kept my eyes on it, not knowing what it was! As one who believes in UFOs, I looked with great interest to see what would happen! The object appeared to be far away, and appeared to be large! It could have been about a mile away and at approximately a seventy degree angle from the horizon. But I wasn't guessing what it was at that moment. I was trying to keep an open mind! I had a strange feeling while I was watching it! It seemed like the flashing object was putting me into a trance! Not that I know what a trance is like or anything, but I did feel my concentration was being impaired! Anyways I wasn't about to fall asleep! I tried to focus more intently! As I looked on, I saw smaller lights moving quickly to the Flashing red object from opposite directions! How many, I am not sure! It might have been about 20 smaller objects (than the red object). They looked like white lights and disappeared at the moment they reached the larger red light! After the 2 rows of lights were gone, the red light disappeared! It was like the red light was turned off. It didn't move from its' spot for the approximate 5 to 7 minutes I watched it in the sky. After this event, I thought that the Red object was a 'mother ship' signaling to other (smaller), ships and then moved on after all the ships in the area were back aboard. I am not sure what the lights were or what they meant, but if i was going to tell anyone, this is how I would describe it. This is the third time that I seen something in the sky that I thought was an unidentified object in the sky. I guess I'm just a good observer."],"trends":["There have been 136 other sightings in Toronto","There were no other sightings in Toronto on or around September 15th 1975"],"Case Number":"6168","Log Number":"CA-01152007-0008","Summary":"A motionless, red flashing light in the sky!","Object Flight Path":"Stationary","Disposition":"Unresolved","Date Submitted":"09/15/1975 04:30 UTC","Country":"Canada","Date of the Event":"09/15/1975 04:30 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Longitude":"-79.380704","Object Features":"Unknown","Object Shape":"Flash, Sphere","files":["/var/www/straped/mufon/html2text/6168.html.txt","/var/www/straped/mufon/org/6168.html"],"Tags":"City","Latitude":"43.661756"}