{"files":["/var/www/straped/mufon/html2text/6171.html.txt","/var/www/straped/mufon/org/6171.html"],"Object Features":"Unknown","Date of the Event":"07/07/1994 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.782519,+-117.228648(6171)&iwloc=A&hl=en\"> mufon case (6171) map </A>","Latitude":"33.782519","Date Submitted":"07/07/1994 12:00 UTC","Summary":"I saw a triangle shaped craft hovering over the lake with a very bright white light making a wobbleling spinning sound","Source":"MUFON","Tags":"City","Object Shape":"Triangle","Log Number":"US-01152007-0011","City":"Perris","Country":"United States","Weather Factors":"None","trends":["There have been 5 other sightings in Perris","There were no other sightings in Perris on or around July 7th 1994"],"divs":["Sighting DetailsI was Fishing by myself on the north end of Lake Perris, CA. I had been doing pretty well fishing, when I noticed a white light on the other side of the lake. I figuered it must have been another fisherman's lantern. The light appered to be moving slowly as though someone was walking with the lantern. All of a sudden I saw two bright red lights from the area where the lantern was. At first I thought who ever had the lantern was getting into their vehicle and leaving. It seemed strange (too big for a car or truck)so by this time I was entranced on the lights. They slowly moved up the side of the mountain and as it moved up it turned sidways and there it was, a cold black triangle shaped craft, the lights had become three light fading from red to amber almost pinkish. I watched the craft, which was probably 100 feet long in comparison with the background which is very familiar to me, move back down the side of the mountain and began hovering over the lake. It moved silently around skimming over the top of the lake. All of a sudden the red lights went dark and they were replaced by one very bright white light. At this time I heard the sound of something spinning, it made a wobbling sound that would speed up and slow down. This went on for sometime. I was very afraid of this thing, my hair was standing on end, there seemed to be a electrical or magnetic feild in the area, so I walked back up toward camp. I watched it for about ten more minutes, then all at once the lights and spinning sound was dead dark silence. I have had other experiances from that area if you guys are interested. This thing was for real. I reported this on the national UFO repoting center some years back. looking back on the event I think the craft was a lot larger then reported."],"Viewing Distance":"Over One Mile","Disposition":"Insufficient Data","Region":"California","Longitude":"-117.228648","Case Number":"6171","Object Flight Path":"Stationary,Path then hovering","Sighting Duration":"Undisclosed"}