{"Region":"North Carolina","Country":"United States","Case Number":"6174","Object Features":"Unknown","Log Number":"US-01152007-0014","Date of the Event":"01/09/2007 08:30 UTC","Object Shape":"Triangle","Source":"MUFON","divs":["Sighting Details'My brother and I were travelling home from what was unfortunately our step-grandmother's wake when we saw three rather bright lights in a line to the left of the car. I guess it was around 8:30-8:40 p.m. It consisted of three bright white lights in a triangle with a red light positioned just behind the forward point. The front light was brighter than the others. The red light did not flash like one on a jet, but rather it pulsed fairly slowly, growing bright then fading out. At its closest, its wingspan looked fairly consistent with Orion's Belt in the night sky, if not a little larger. There was some noise associated with it, but if it was a jet, the noise was far too soft- almost just like wind blowing, and sometimes a low hum. When we first witnessed the object, my girlfriend, who was following us in her car, called me about the time I reached for my phone to call her. It was hard to miss. The object stayed on our left side, thought the road turned a bit, but it did get almost directly overhead at one point. As we passed under it, it was out of sight for a couple moments, then ended up along side us again travelling a completely different direction from when we first saw it. A couple miles down, we parked to see if we could snap a picture of it on our camera-phones, but they're pretty usless for that sort of thing. As we were parked watching it, it turned at almost a 90 degree angle and started heading away again. This time, we decided to head home. Once we arrived there, we saw it cross overhead infront of us, head into the tree line. It then turned away again and came into view, and it then came directly towards us, and when it was at about a 45 to 60 degree angle infront of us, it a sharp turn to the left and headed into the horizon- still heading away from the nearest airport or military base. As I stated before, the sound was nothing like a jet, more like a steady rush of air as if from a fan. My girlfriend and I left to run some quick errands, and my brother called me back to tell me he could hear the noise from inside the house, much louder this time, but when he got outside could not locate the object. The reason it baffles me is that the nearest airport is 30+ miles away. If it was a jet, it was very lost. It was circling our little town randomly, making very un-jet-like turns. Ontop of that, as I stated before, there were no strobes, only the three brights and the one red pulse. I hope this helps! Good luck out there!"],"Longitude":"-78.456391","Summary":"Zig-zagging fly-by of town- UFO circling, crossing over its own path","trends":["There has been one other sighting in Clayton","There were no other sightings in Clayton on or around January 9th 2007"],"Weather Factors":"None","Tags":"City","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=35.650711,+-78.456391(6174)&iwloc=A&hl=en\"> mufon case (6174) map </A>","City":"Clayton","Latitude":"35.650711","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"01/09/2007 08:30 UTC","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/6174.html.txt","/var/www/straped/mufon/org/6174.html"]}