{"Viewing Distance":"Unknown","Country":"United States","Weather Factors":"Unknown","Disposition":"Unknown","Latitude":"41.575387","Date of the Event":"Unknown","Log Number":"US-01162007-0001","Sighting Duration":"Undisclosed","Longitude":"-87.779374","Summary":"Red lights above sky one year and one month later!","Case Number":"6175","trends":["There have been 15 other sightings in Tinley Park","There were no other sightings in Tinley Park on or around","This sighting has never been favorited.",""],"Date Submitted":"01/16/2007 05:38 UTC","Object Features":"Undisclosed","divs":["Sighting DetailsI'm going to make this quick because I have told this story so many times and it was featured in the daily southtown here in Orland Park. On Novemeber 31st, 2005, me and my friends were driving to my friends house coming home from the gas station. A friend and I actually started to argue about UFO's because I saw a plane in the sky and stopped to check it out as I was driving. As we turned the corner, BAM!, 3 red lights were up in the sky. At first it seemed as if there were only two, but the third was soon seen. These were the same lights seen a year and a month earlier on Haloween 2004. We observed these lights for about 10 minutes, and my friend even got his dad to pull out the telescope but something was wrong with a mirror. The objects moved very slowly across the sky, and were bright red. Eventually they went so high and far away that it could not be seen, and honestly, I could not tell if it was one object, or 3 seperate lights. At about 10:30, we were still outside and about to leave when I saw what I thought was a tower with a red flashing light and I joked around saying that the lights were back. I was wrong, the lights were back and they slowly climbed their way across the sky going further and what seemed to be higher. A friend snapped pictures from his camera phone which was actually a very good camera phone, 2 megapixels. There were hundreds that called the police and it was featured in the newspaper as I have stated. I thought that maybe a year and a month later they would show up again. So i was outside on January 1st, 2007. What did I see? This time a green and red object in the sky spinning, in the vacinity of my friends how were we had seen the red lights a year and a month earlier. It was amazing how I was argueing about UFO's with a friend who made fun of me and then right then and there he was proven wrong, I loved it. It doesn't have to be \"Aliens\" and we'll never know but it was an amazing event in my life! I just wanted to send you these to aid your research because we have the proof from the photos from my friend's sony camera phone. Don't worry, they're legit! As you can see, they look just like the ones from haloween 2004. I hope this can help you in any way. Thanks for your time."],"files":["/var/www/straped/mufon/html2text/6175.html.txt","/var/www/straped/mufon/more/6175_submitter_file1__DSC00097.JPG","/var/www/straped/mufon/more/6175_submitter_file2__DSC00096.JPG","/var/www/straped/mufon/more/6175_submitter_file3__DSC00095.JPG","/var/www/straped/mufon/org/6175.html"],"Region":"Illinois","Source":"MUFON","Tags":"City","Object Shape":"Diamond, Star-like","Object Flight Path":"Undisclosed","City":"Tinley Park","map":"<A HREF = \"http://maps.google.com/maps?q=41.575387,+-87.779374(6175)&iwloc=A&hl=en\"> mufon case (6175) map </A>"}