{"Object Shape":"Boomerang, Chevron, Triangle","Viewing Distance":"Unknown","Date Submitted":"06/15/1951 12:00 UTC","Weather Factors":"Unknown","Longitude":"-104.606667","Region":"Saskatchewan","trends":["There have been 10 other sightings in Regina","There were no other sightings in Regina on or around June 15th 1951"],"map":"<A HREF = \"http://maps.google.com/maps?q=50.454722,+-104.606667(6176)&iwloc=A&hl=en\"> mufon case (6176) map </A>","Summary":"Noticed a slow moving object low in sky northeast of me","Log Number":"CA-01162007-0002","Source":"MUFON","Country":"Canada","City":"Regina","Sighting Duration":"Undisclosed","Date of the Event":"06/15/1951 12:00 UTC","Object Flight Path":"Undisclosed","divs":["Sighting DetailsI had arisen early, and had gone out to the front yard of my home. It was a nice late spring morning, the sun was up fairly well to the east, and there were no clouds in the sky. I glanced up, for whatever unknown reason, and saw an object, it appeared to be a craft without no fusilage, just a wing. From its rear and front trailing edges, there were rows of red flashing lights. But there was no sound, and I felt uneasy. Later on I found myself in the kitchen at the rear of the house, and my father and mother were quite angry. I was told I had missed breakfast, and that they were looking for me and couldn't find me anywhere. I told them I had been in the front yard. My dad got angry and told me I was a lier because they had checked there and I was no where in the yard. I looked at the kitchen clock, at that time, because they were so angry with me. The clock showed 8:30AM. To this day I do not know how where the time went, because I am sure that I had gone outside, at 6:30AM. To this day, I often have vivid rememberances of that object I saw in the sky. I know I saw it and it was travelling from northeast to southwest. At the time I was eleven years old. I used to walk in my sleep at that age and my parents used to put a table knife in the door jamb so I could not walk outside the house. But I feel that I was not walking in my sleep, nor dreaming what I saw, and there was no knife in the doorjamb,I am sure of that."],"Latitude":"50.454722","Object Features":"Undisclosed","Case Number":"6176","Tags":"City","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/6176.html.txt","/var/www/straped/mufon/org/6176.html"]}