{"trends":["There have been 2 other sightings in Anson","There were no other sightings in Anson on or around March 10th 2006"],"Object Features":"Patterned Surface","Summary":"large silver oval hovering over pond ,3 witnesses,","Disposition":"Unknown","Country":"United States","Date Submitted":"03/10/2006 02:00 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/6177.html.txt","/var/www/straped/mufon/org/6177.html"],"Sighting Duration":"00:02:00","Source":"MUFON","divs":["Sighting Details My girlfriend, her mother, and I were driving east on rt 234(valley road), about to turn right onto what is known as the horseback road.my girlfriend was driving ,I was in the front passenger seat and her mom was in the back on the drivers side. We were in a chevy s10 blazer. as we were making the turn mom in the back,(who never curses) said loudly,\"What the hell is that???\" My girlfriend stopped the vehicle as she looked out the window. I leaned over to see and looked up .Beyond and above the trees which were still bare of leaves was a huge silver thing in the sky. it looked to be about 300 feet long and 50 or 60 feet thick. It filled the sky from my perspective ,and I estimate it was less than 1000 feet away. It had a pattern of lines on it that reminded me of the old jiffypop popcorn dome.it was so close that I could not see the entire object but I could see clearly underneath it and there was no lines or tethers, no gondola as on a hot air balloon, no cockpit or any kind of control surfaces. My girlfriend said that the top of the object had a reddish glow but I did not see this. As we looked My girlfriend took her foot off the brake and we started rolling,up the road. The object stayed motionless with absolutely no sound,and was very visible through the bare trees. as we moved on there was a row of evergreens that screened the sky for about 5 to 10 seconds when we could see that spot again the object was gone. one of the strange things is, I had a 35mm. camera right next to me on the floor, and I never thought to use it. Also nobody in the vehicle felt like staying there to watch longer than we did, it was almost like something was saying \"nothing to see here, move along.\" We rode all the way to the end of that road still watching the sky for another glimpse,but nothing was said between us about it for over an hour. all of our descriptions matched when we did talk. I mentioned the sighting to a friend and he said that he and his sister had seen almost the same thing in the same place 3 years before. the next day I drove by the small pond that was under the spot we saw it,and there was a hole in the Ice of the pond that looked to be around 30 feet across and appeared round from my perspective. This was in late winter and this pond was frozen since december it was also frozen the next day. For the next week or so there was a red bumpy rash on my left side that itched and burned and my side really hurt,like I had been kicked . noone else had those symptoms. I have also seen many lights and other phenomena in the area ,as have others I have talked to who live in this valley. There are also episodes of missing time, that I have personally experienced,with some corroboration from others. Feel free to contact me at the addresses listed, I can probably getthe others to talk to you as well but they don't live with me anymore. Sincerely, Steve Camden"],"Viewing Distance":"501 Feet - 1 Mile","City":"Anson","Weather Factors":"Unknown","Object Flight Path":"Stationary","Region":"Maine","map":"<A HREF = \"http://maps.google.com/maps?q=44.798362,+-69.889241(6177)&iwloc=A&hl=en\"> mufon case (6177) map </A>","Date of the Event":"03/10/2006 02:00 UTC","Case Number":"6177","Longitude":"-69.889241","Latitude":"44.798362","Object Shape":"Oval","Log Number":"US-01162007-0003"}