{"Date Submitted":"01/15/2007 06:55 UTC","Summary":"three round fireball circles moving in a row some feet apart very slowly, thought it was helicopters at first.","trends":["There have been 3 other sightings in Pittsburg","There was one other sighting in Pittsburg on or around January 15th 2007","This sighting has never been favorited.",""],"Object Features":"None","City":"Pittsburg","Tags":"City","divs":["Sighting DetailsI live in Pittsburg California. At about 6:55 pm I was on my way to the grocery store headed east on frontage road with my 10 year old daughter. I noticed two brigt reddish orange lights moving slow above highway 4, railroad exit, thought it was helicopters, and I ask my daughter what is that? I do not hear any noise, like a helicopter sounds. I noticed these objects, two, turning west very slowly, so I made a u-turn and told my daughter that I wanted to get the binoculars from our home, I noticed the objects were above my vehicle like they were following us? When we arrived at home, I asked my daughter to get her father and and my 16 year old daughter. We got the binoculars, my husband and my 10 year dauhgter both said it looked like balls of fire, and my husband said, there is three balls not two, at this time about 7:10pm the objects were abouve us while we were standing on the sidewalk. When I tried to look at these objects, I only seen a second of one of them and it looked like a bright fire ball, then it dissapeared. My 16 year old tried to look thru the bionculars and could not see anything. After I seen one dissapear, the other two followed after. I did not think of a camera at the time, I was curious about the objects, what they were? I did not know whom to call, I opened the phone book and called 911 non emergency and asked if there was any one I could call about this sighting, and if any one else had called obout it, the reply that the gentleman gave me was he had no idea whom I could call and that no one else had called in. I then went on line to Yahoo and located a number to call,it is called UFO North West, the gentlemans name is William Puckett, phone# 1866-611-8367. My family and I looked up at the sky several times after to see if we could see anything, nothing. Then at 9:30 pm. my husband went out to have a cigar, then yelled, Lisa, Lisa, I see one again! It was east of our front yard, just one this time, I called my 16 year old daughter because I asked her to have her poloroid digital camera ready just in case, she took a picture of this object, had it zoomed in a 3x, I also called my neighbors a husband and wife and their two sons to see this object, they were able to see it for about ten minutes, then it dissapeard. When we looked at picture it looked like three objects instead one? Immediatly I called Mr.Puckett and emailed him the photo.He was kind enough to forward the information to the Mutual UFO Network.Hopefully someone in the City of Pittsburg seen also what we saw and will report it. I have never seen anything like this before, My family and I were astonished by this sighting, we were quite excited to see what we believe was a ufo."],"Country":"United States","Disposition":"Unknown","Latitude":"38.033836","Viewing Distance":"Unknown","Date of the Event":"01/15/2007 06:55 UTC","Log Number":"US-01162007-0005","Case Number":"6179","Object Shape":"Circle, Fireball, Sphere","files":["/var/www/straped/mufon/html2text/6179.html.txt","/var/www/straped/mufon/more/6179_submitter_file1__DSCI0012.jpg","/var/www/straped/mufon/more/6179_submitter_file2__scan0005.jpg","/var/www/straped/mufon/more/6179_submitter_file3__pittsburgsightinghistory.jpg","/var/www/straped/mufon/org/6179.html"],"Weather Factors":"None","Sighting Duration":"Undisclosed","Region":"California","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.033836,+-121.876371(6179)&iwloc=A&hl=en\"> mufon case (6179) map </A>","Object Flight Path":"Path then hovering","Longitude":"-121.876371"}