{"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Object Features":"None","Date of the Event":"10/18/1967 02:18 UTC","Region":"California","Tags":"City","Latitude":"37.37142","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.37142,+-122.03481(6183)&iwloc=A&hl=en\"> mufon case (6183) map </A>","City":"Sunnyvale","Date Submitted":"10/18/1967 02:18 UTC","Summary":"6 ufos flying in formation in the middle of the day","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsI was at school, 12 years old. Patrick Henry Jr High, It was PE class about 50 girls were on the playground with our 2 teachers. We'd been playing bastketball, The boys had already gone in to the showers and the girls were heading inside for the showers, somebody said, look! We all turned and saw 6 egg like things flying toward us coming from over the field that was just beyond the playground. they were flying in formation like a triangle, like an arrow pointed toward us. Going about 15 miles per hour, very slow. I'd say they were about 75 yards up. Flying from the north southward. Then they slowed and stopped we all had the idea that they we watching us watch them. They were kind of egg shaped though both ends were the same shape. There were no windows, no lights, no exhaust, no noise, there was no wiggle in their movment, smooth. They were white I'd say they had a bit of a sheen to them. This was the middle of the day in a very populated area, 1 block off the Main street in the town,The El Camino Real.They hovered for about a minute then they moved away-Westerly, What had been The left point of the triangle of the formation was now the lead as they moved west in perfect formation again slowly but faster than the approach. We were all excited and a little afraid, the teachers made us go inside they also saw them. Now this next part This is why Ive never reported this..I also kind of remember that before they went west one went east then down into an orchard just to the east of the school. I went to the orchard after school but I don't remember anything else. I do have about 2 hours of missing time. I came home from school late..2 hours nobody else from the school went to the orchard and I had never been there before. weird. We weren't allowed to talk about it at school, the event very stangely died away in 1 day. the kids weren't even talking about it. very weird for kids. A possible connection--- Moffet Field which is now NASA is just down the road--west from where this occured. Thanks for listening, Lynn Shannon"],"trends":["There have been 4 other sightings in Sunnyvale","There were no other sightings in Sunnyvale on or around October 18th 1967"],"Object Shape":"Egg","Case Number":"6183","Longitude":"-122.03481","Country":"United States","files":["/var/www/straped/mufon/html2text/6183.html.txt","/var/www/straped/mufon/org/6183.html"],"Weather Factors":"Unknown","Source":"MUFON","Log Number":"US-01182007-0001"}