{"Tags":"City","Date Submitted":"09/01/1996 08:30 UTC","Object Shape":"Fireball, Oval","Disposition":"Unresolved","Date of the Event":"09/01/1996 08:30 UTC","Region":"Florida","Source":"MUFON","City":"Pensacola","Viewing Distance":"21-100 Feet","Weather Factors":"None","Latitude":"30.423809","Case Number":"6185","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=30.423809,+-87.214685(6185)&iwloc=A&hl=en\"> mufon case (6185) map </A>","Log Number":"US-01182007-0003","divs":["Sighting DetailsThis sighting was one of several I have had while growing up in Pensacola Florida along side the navy base and on the water. This happened when I was around 10 years old. Me and my mom and grandmother were driving back from visiting family along Blue Angel Pwky. which also runs along some unused navy property that is all wooded with large pines. I was sitting in the back seat and was leaning forward inbetween the front seats of the car when I noticed what I thought was a helecopter in the distance ahead to the left of the road. Being a kid I got really excited and said to mom and grandmom \"Look, A helecopter!\" As we continued to drive we were intersecting with the flight patern of the craft. As we got closer I noticed it was no aircraft I had ever seen growing up along the base. It was a UFO. The large saucer was the size of a small house and was not flat. It was like a puff star fish, or round loaf of bread in shape. It was the same color as the night sky with a few small colored lights in no certain order around the bottom. I noticed all of the other 7 or 8 cars on the road were obviously seeing it as well because they were running off the side of the road. I asked mom to pull off to the side of the road so we could see it better but it made the line of sight blocked by being closer to the pine trees. We then pulled back onto the road were we observed the saucer moving very slowly to the right, south, over the tree line and even though the craft was moving in a staraight line it was tilted about 40 degrees almost skimming the tree tops. There were a couple other sightings I have seen also through the years. One was red balls that were the same color as a red laser and just as bright. They all flew over the road in a wooded area between Milton and Pensacola around 9pm and they took a 90 degree pivot turn down into the woods toward the ground. They were so fast they left streaks as they followed each other. maybe 10 to fifteen orbs. This was also witness with 2 of my best friends. The other was in a storm cloud above the beach. Five lights would light up then go out in a intelligent looking pattern. Then several military helicopters showed up scanning the area. There are more but I am tired of typing!"],"Longitude":"-87.214685","Object Flight Path":"Straight-line path","Country":"United States","trends":["There have been 68 other sightings in Pensacola","There were no other sightings in Pensacola on or around September 1st 1996"],"Object Features":"None","files":["/var/www/straped/mufon/html2text/6185.html.txt","/var/www/straped/mufon/org/6185.html"],"Summary":"Black puffy disk shaped ship about 500ft. long with several small lights underneth flew slowly over the road, over our car, and then over the pine tree line going straight but the ship was tilted at an angle almost skimming the tree tops headed south"}