{"Viewing Distance":"Unknown","Sighting Duration":"00:00:40","Log Number":"US-01182007-0006","Latitude":"29.432122","divs":["Sighting DetailsIt was approximately 12:30 a.m. and my husband and I were watching television. The noise began suddenly, was very loud, and was coming from something that was hovering over our house. Our windows were rattling and it was if we were sitting inside an airliner that about to take off. It sounded like an airplane engine that was reving. We were terrified. It stopped after 30 seconds and Jason went outside and saw nothing. He came inside and the noise started again. This time it lasted for 10 seconds, then it was abruptly gone. We were so shocked. I reported it to the police, who made a sweeping surveillance through our neighborhood. Our children did not awaken. We have been interviewing our neighbors this evening and so far, at least one family also heard the noise. They live across the street from us. Our home are on huge lots, so we wer relieved to hear that at least one other family \"heard something.\" More later. Thank You."],"Date of the Event":"01/18/2007 12:30 UTC","Object Flight Path":"Undisclosed","City":"San Antonio","Source":"MUFON","Region":"Texas","Date Submitted":"01/18/2007 12:30 UTC","Country":"United States","Tags":"City","Longitude":"-98.486918","files":["/var/www/straped/mufon/html2text/6188.html.txt","/var/www/straped/mufon/org/6188.html"],"Object Features":"Undisclosed","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around January 18th 2007"],"map":"<A HREF = \"http://maps.google.com/maps?q=29.432122,+-98.486918(6188)&iwloc=A&hl=en\"> mufon case (6188) map </A>","Weather Factors":"Unknown","Object Shape":"Undisclosed","Summary":"horrific noise above our home - house was vibrating and windows rattling-lous, as an airplena engine - suddenly began and lasted 30 seconds-suddenly stopped and began again suddenly and lasted for about 10 seconds. Noise stopped abruptly.","Case Number":"6188","Disposition":"Unknown"}