{"trends":["There have been no other sightings in Millstone","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=37.167222,+-82.751667(6189)&iwloc=A&hl=en\"> mufon case (6189) map </A>","Date Submitted":"01/17/2007 12:00 UTC","Longitude":"-82.751667","Summary":"I woke this morning with a small bruise and 3 punctures marks inside my left elbow.","files":["/var/www/straped/mufon/html2text/6189.html.txt","/var/www/straped/mufon/org/6189.html"],"Region":"Kentucky","Case Number":"6189","Object Flight Path":"Undisclosed","divs":["Sighting DetailsI awoke this morning, Thursday, Jan 18, 2007. I was very cold, and my right hand was numb. The house was warm, thermostat at 69 degrees. My entire right side felt so cold. It was about half an hours before I could warm up my right side. I felt a soreness in my left arm and found a small bruise(about 2 inches in diameter)with three very small puncture marks. This was not there when I went to bed. Wednesday evening I was feeling very tired and went to bed early, about 9:45pm. This is odd for normally I stay up until 11pm or midnight before I go to bed, and I always get up at 5 am. This morning it was 6:34am when I woke. I keep an alarm clock beside my bed, with lighted red numbers showing the time. It is now about 16 hours after I woke and the bruise has shrunk in size quite a bit, and the 3 puncture marks are almost healed. I have taken 4 photos of the injury and will have them developed as time permits. The camera is one I have had for about 5 years, but today when I was taking the picture of my injury, a red circle appeared in the view screen, centered on the bruise. My camera does not have a targeting grid or crosshairs in the view finder. I cannot explain this. I am a MUFON Field Investigator #10332."],"Disposition":"Unknown","Source":"MUFON","Tags":"City","Date of the Event":"01/17/2007 12:00 UTC","Object Shape":"Unknown","Weather Factors":"None","Country":"United States","City":"Millstone","Latitude":"37.167222","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Log Number":"US-01182007-0007","Object Features":"Undisclosed"}