{"Source":"MUFON","Case Number":"6194","Region":"Pennsylvania","map":"<A HREF = \"http://maps.google.com/maps?q=39.979266,+-76.276347(6194)&iwloc=A&hl=en\"> mufon case (6194) map </A>","Viewing Distance":"101-500 Feet","Latitude":"39.979266","Country":"United States","files":["/var/www/straped/mufon/html2text/6194.html.txt","/var/www/straped/mufon/org/6194.html"],"divs":["Sighting DetailsLate on the night of Wednesday, January 17, around 11:30 PM, I noticed a strange red light is the sky. It was about the size of a car and was falling from the sky from east to west over 272 in the area of shiprock road. My girlfriend and I were taking our dog out when we noticed it. It was a reddish pinkish color with a reddish haze around the outside. The light from the object was so bright that the pavement on the road had the red light cast on it. It fell slowly towards the West and once it was close to the ground suddenly disappeared. I am extremely skeptical as to what this was. I know it was not a flair, this was far too big, high and bright but similar in color. I called WGAL (news 8) right when I had seen this and reported it. Then on Thursday a friend who was traveling north about 2 miles from where I was on the 17th, at 11:30, had reported seeing the same mysterious light. Our stories were identical when we compared notes. I know more people had seen the object, there were cars traveling on 272 at the time and there's no way you could miss this thing. I would greatly appreciate if you looked into this further. This was a large object, again about the size of a 4 door car, where ever it landed it should be visible. It went down behind the tree line somewhere starting from the west of 272 in the shiprock road area heading towards the frogtown area. Please let me know if your hear anything more or find anything out. It would be greatly appreciated. Thank you. Sincerely, Shawn Douglas"],"Date Submitted":"01/16/2007 11:30 UTC","Object Shape":"Circle, Sphere","Summary":"Bright reddish pinkish light, about the size of a four door car, slowly decending to the west","trends":["There have been no other sightings in Willow Street","This sighting has never been favorited."],"Log Number":"US-01192007-0004","Tags":"City","City":"Willow Street","Object Flight Path":"Straight-line path","Date of the Event":"01/16/2007 11:30 UTC","Longitude":"-76.276347","Weather Factors":"None","Sighting Duration":"00:03:00","Object Features":"None","Disposition":"Unknown"}