{"Date of the Event":"10/28/2006 12:30 UTC","Object Shape":"Fireball, Other","Country":"United States","Case Number":"6203","Date Submitted":"10/28/2006 12:30 UTC","Longitude":"-116.759226","files":["/var/www/straped/mufon/html2text/6203.html.txt","/var/www/straped/mufon/org/6203.html"],"divs":["Sighting DetailsLast October my husband and myself were driving from Reno, NV to Las Vegas, NV at about 12am MST, we took 95 S. About 5 min. after we took the turn at Tonopah, I was reclined in my chair starring out of the sunroof as I often do on road trips, my husband noticed something odd out his driver side window, (which would be to the East). I sat up to see what it was, there was an amber glowing light a few miles out, from what it looked like, hovering over some mountains but it was very dark, so it is hard to say for sure... anyway, there was one light, then it looked like it split in to 2 amber lights! Of course this could have been a trick of the eye, so now there were 2, I thought maybe it was a jet from a fighter plane or something but then they seemed to pace with us, saying in the same position in the window frame for 87 miles, they would go off and on, sometimes 1, sometimes 2, never more than 2, at about midpoint around Scotty's junction, we stopped to watch at a pull off, however, while we were parked they did not light up, once we started driving again, they began to light up again. Once we got to Beatty there was a turn in the road and we lost sight. Shortly after leaving Beatty we witnessed 2 fighter jets flying fairly low and very fast directly above us heading towards the area we had seen the lights. We did not see anything on the drive back to Reno, has hard as we looked. I'm not sure what this was, but I nor my husband, have ever seen anything like it before or since. I spend a lot more time looking up nowadays. Thanks for your time, Angela I've attached a very bad depiction..."],"Disposition":"Unresolved","Object Flight Path":"Stationary,Hovering then path","Latitude":"36.908557","City":"Beatty","Sighting Duration":"Undisclosed","Tags":"City","Region":"Nevada","trends":["There have been 2 other sightings in Beatty","There were no other sightings in Beatty on or around October 28th 2006","This sighting has never been favorited.",""],"Object Features":"Unknown","Viewing Distance":"Over 1 Mile, Unknown","Weather Factors":"Unknown","Summary":"Amber lights near Beatty, NV","Log Number":"US-01212007-0002","map":"<A HREF = \"http://maps.google.com/maps?q=36.908557,+-116.759226(6203)&iwloc=A&hl=en\"> mufon case (6203) map </A>","Source":"MUFON"}