{"Object Shape":"Circle, Oval","trends":["There have been 73 other sightings in Salt Lake City","There were no other sightings in Salt Lake City on or around November 30th 2006"],"Object Features":"None, Unknown","divs":["Sighting DetailsI was standing on my back patio with my husband having a smoke and letting the dogs take care of business when I looked up at the east mountains, it was dark and you couldn't really see the top of the mountains, but from experience it was towards the top where the mountains kind of come down a bit, I saw three bright lights, they would slowly and randomly take turns fading off and quickly turning back on bright, I asked my husband what the heck they were, he told me they were headlights from someone on the mountain, I told him we were to far away for them to be headlights, he then decided it was a radio tower, I then started to think well I'll check in the morning, I don't remember them ever being there before. The next morning I didn't notice any radio towers large enough to explain the lights and then thought oh well, it was probably nothing. the next night there was nothing, a couple night later, my husband was in bed and I went out for a smoke and they were back. I came in the house and grabbed my video camera which has really good night vision (0 lux) and I started zooming in on one (they were about the size of an eraser at the end of a standard pencil, and I almost had one zoomed in it was looking slightly oval then all of the sudden it got really bright and I almost dropped the camera, my eyes looked almost like I had been out in the sun for a while and walked inside, I couldn't see real well for about 2 minutes, then when I looked back out they were gone. The next night they were back and I had to run in the house because they looked like they were getting closer and it scared me, even when I came in I had a strange feeling like I was bein watched, it was odd! I have seen them a lot since then and they scare me!!! I will not go out back alone to smoke anymore. I see them through kitchen window though, mostly in the summer but they do show up in the winter too. I'm freaked out because I usually don't believe in this and my husband makes fun of me saying what would they want you for? I don't think they want me, but do they know I saw them? Lately I have been going on the front porch which faces west, but there have been a couple times I've seen odd lights that way too, maybe I should just quit smoking (ha ha) but everyone thinks I'm crazy so I don't know who else to tell about these odd lights... I almost forgot, there had also been a few times where there were only one or two lights instead of the 3, all I know is there is something out there. There was one time the news was showing images from the helicopter they use for traffic (morning news) and there was an odd light in the sky and you could hear the news lady saying what was that, what was that light, but everyone ignored her and nothing more was ever said about it. I would like to stay annonymous because everyone thinks I'm crazy about them."],"Date Submitted":"11/30/2006 12:00 UTC","Case Number":"6204","Region":"Utah","Tags":"City","files":["/var/www/straped/mufon/html2text/6204.html.txt","/var/www/straped/mufon/org/6204.html"],"Viewing Distance":"Over One Mile","Date of the Event":"11/30/2006 12:00 UTC","Object Flight Path":"Stationary","Country":"United States","Disposition":"Insufficient Data","Log Number":"US-01212007-0003","Sighting Duration":"02:00:00","Summary":"three lights over east mountains that happen more frequent in the summer.","Weather Factors":"None, Unknown","Latitude":"40.769759","Longitude":"-111.889297","map":"<A HREF = \"http://maps.google.com/maps?q=40.769759,+-111.889297(6204)&iwloc=A&hl=en\"> mufon case (6204) map </A>","City":"Salt Lake City","Source":"MUFON"}