{"Object Flight Path":"Stationary","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=35.787652,+-78.480556(6210)&iwloc=A&hl=en\"> mufon case (6210) map </A>","Sighting Duration":"Undisclosed","Summary":"Ferris Wheel in the sky","divs":["Sighting Details I played pop warner football when I was a kid, for about 5 years. I was on a team called the Knightdale Knights, and we practiced and played in the same field, very close to Knightdale elementary school in Knightdale, N.C. I was about 11 years old when this event took place. After practice one night, as we were walking to our car, I looked up across the street and over a nearby playground, and saw something that my mind could barely comprehend. It looked exactly like a carnival or fair ferris wheel had somehow managed to come off of its track and fly through the air... but this I knew was physically impossible, and that even if it were reasonable, there was no carnival or fair nearby. I studied the object for about 10 minutes, but I'm sure it was in the air for a much longer period of time. It just hung in the air, stationary in its position, but seemingly spinning. It made no sound. It had lights around the edges of it, blinking on and off and in different colors- blue, yellow, amber, even green. The lights were probably what made me think of it as a ferris wheel. They blinked around the external area of the... (craft?) and like I mentioned earlier, it seemed to be spinning. I don't know if I told anyone about this then, or if anyone else noticed it when it occurred, but it's really the only time I've seen anything strange in the skies that couldn't be explained. I know what man-made aircraft look like, flares, meteors, comets, \"falling stars,\" and this was definitely not something that resembled any of those things. I didn't believe in \"UFO's\" or \"aliens\" or anything of the sort then either... I was just a kid. But I did see something unidentified and flying, and it was definitely an object. To all those that have seen strange things in the sky, well, the universe is huge. For there to be only one planet in the entirety of the cosmos that houses living organisms... that's just a little absurd to me, and the biggest waste of space imaginable. Thank you everyone for your time."],"Log Number":"US-01222007-0005","Source":"MUFON","Weather Factors":"None","Date of the Event":"11/17/1997 07:00 UTC","Date Submitted":"11/17/1997 07:00 UTC","City":"Knightdale","Tags":"City","Longitude":"-78.480556","files":["/var/www/straped/mufon/html2text/6210.html.txt","/var/www/straped/mufon/org/6210.html"],"Country":"United States","trends":["There has been one other sighting in Knightdale","There were no other sightings in Knightdale on or around November 17th 1997"],"Object Shape":"Circle, Disc, Oval","Region":"North Carolina","Object Features":"Unknown","Case Number":"6210","Viewing Distance":"501 Feet - 1 Mile","Latitude":"35.787652"}