{"Date Submitted":"01/09/2007 12:00 UTC","trends":["There have been 4 other sightings in Dunn","There were no other sightings in Dunn on or around January 9th 2007"],"Country":"United States","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/6212.html.txt","/var/www/straped/mufon/org/6212.html"],"Object Features":"None","Latitude":"35.306274","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Summary":"triangle turned around very bright white light funny looking glow","Date of the Event":"01/09/2007 12:00 UTC","Region":"North Carolina","Longitude":"-78.608903","Log Number":"US-01222007-0007","Source":"MUFON","Weather Factors":"Unknown","Object Flight Path":"Straight-line path,Path with directional change","City":"Dunn","map":"<A HREF = \"http://maps.google.com/maps?q=35.306274,+-78.608903(6212)&iwloc=A&hl=en\"> mufon case (6212) map </A>","Tags":"City","Sighting Duration":"Undisclosed","Case Number":"6212","divs":["Sighting DetailsTwice I have seem orbs in the night sky once about 3 years ago. the lights were moving and zipping around each other, as if they were playing a game. All of a sudden they formed a triangle. In that triangle appeared to be engerized with electrity or something. Then they disappeared. The second time was 1 month ago. we were coming home from an appointment. it was dark allready approximally 7:30. I kept seeing these funny looking lights, real bright white. very odd glow. We would traven a few miles and them would be ahead of us then behind us. As if they were looking for something. we were on a straight road by the way. They finially disappeared. After being at home for a while, i decided i would look out at the sky. to my amazement the lights,closer now were in the sky toward the west, the direction that we had come from. I stood on my porch and watched to see if they were planes or what. The lights all moved together. They did not move straight, but were as if a large triangle in the sky turning around. If indeed this was a solid object i would say it would have been 100x100x100 feet, very large. Ps I am a person that watches the skies, and I have seen many things that I can't explain from what seemed to be a shooting star, that stopped and went back out in space, to what looked like a enormous red flare pass over my house."],"Disposition":"Hoax"}