{"Date Submitted":"01/22/2007 05:15 UTC","Log Number":"US-01232007-0009","Date of the Event":"01/22/2007 05:15 UTC","Viewing Distance":"Unknown","Summary":"Black, round-to-circular object with several other similar smaller objects.","Case Number":"6221","files":["/var/www/straped/mufon/html2text/6221.html.txt","/var/www/straped/mufon/org/6221.html"],"Country":"United States","Tags":"City","Disposition":"Insufficient Data","Latitude":"44.058829","trends":["There have been 68 other sightings in Eugene","There were no other sightings in Eugene on or around January 22nd 2007"],"Sighting Duration":"00:10:00","Object Flight Path":"Undisclosed","Longitude":"-123.082924","Object Shape":"Circle, Disc, Oval, Sphere","City":"Eugene","Region":"Oregon","Object Features":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=44.058829,+-123.082924(6221)&iwloc=A&hl=en\"> mufon case (6221) map </A>","Weather Factors":"Unknown","divs":["sighting detailshere's an interesting sighting i made just about a half hour ago. i was running due south-west along a path off 11th street in eugene, oregon when i spotted an unusual structure about 1,500 to 2,00 feet or so in the sky moving slowly in a generally southern direction. it was black, round, approximately the size of a large airliner, but shaped differently. another object appeared to dangle from the back of it that looked almost like another circular ufo, but much smaller. several times it appeared to catch up with the larger object and meld into it, then re--emerge. at that height and apparent distance it might, of course, have been circling the larger object. i also saw what appeared to be another object leave the first and fly southwest ahead of the object. at this point you are the only person that i have reported this strange object to. i stayed to watch the slowly moving object (that at times appeared to accelerate and hover for about ten minutes), then continued my run back home. when i left it was still moving south-west but somewhat faster. i am sure it was not a conventional aircraft, a helicopter, a bird or balloon, but was some kind of self-propelled round, cylindrical-shaped device. what the main larger object was or the smaller ones, i cannot to specifically identify. one more point, i have excellent near-sighted vision and don' t wear glasses for driving. nahu lanham 01\\22-07 approximately 5:15 pm pst eugene, oregon author of: ufos: god from inner space"]}