{"City":"Thoreau","Date Submitted":"01/22/2007 11:05 UTC","Date of the Event":"01/22/2007 11:05 UTC","Disposition":"Unknown","Country":"United States","Weather Factors":"Unknown","Log Number":"US-01242007-0001","Longitude":"-108.215352","Latitude":"35.411447","Tags":"City","Object Features":"Undisclosed","Case Number":"6222","Source":"MUFON","Object Shape":"Triangle","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/6222.html.txt","/var/www/straped/mufon/org/6222.html"],"Sighting Duration":"00:15:00","Summary":"While stargazing a black triangle flew silently overhead","map":"<A HREF = \"http://maps.google.com/maps?q=35.411447,+-108.215352(6222)&iwloc=A&hl=en\"> mufon case (6222) map </A>","trends":["There has been one other sighting in Thoreau","There were no other sightings in Thoreau on or around January 22nd 2007"],"Region":"New Mexico","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsMy fiance' and I were sitting out in the car star watching as we always do on clear nights, when at about 2305 my fiance' points out an odd orange light on the western horizon. I initially dismissed it and went back about watching the southern sky. She once again got my attention and said \"Look, it's moving!\" The light she had pointed out had risin a few degrees off the horizon and it came toward us. We watched for around 3 minutes and the object became closer and easier to make out. It had 3 lights in a triangular pattern with a red light in the center that was bright then dim, kind of like a gas lamp being turned up and down. I called my brother who lives a mile away to confirm if he'd seen it and he saw it as well. When the craft was overhead I could make out the outline of an equilateral triangle against the backdrop of the sky. The object was approximately 200 feet above the ground and appeared to be very large. I would estimate roughly 40-50 yards in diameter. We continued to watch the craft move slowly and noislessly toward the eastern horizon. It seemed as if time stood still during this time, we were very intrigued by the craft. My fiance' also noticed a jet come in from the south at very high speed headed in the direction of the object followed by 2 more jets. The object was to the east of us and before the other aircraft got to it, it simply seemed to \"fade to black\". The sighting ended at around 2320. We stayed out a bit longer to see if anything else happened. With no further activity I went in and filed this report."]}