{"Disposition":"Unresolved","Latitude":"41.920584","Date Submitted":"01/20/2007 07:20 UTC","Longitude":"-83.39344","Country":"United States","Tags":"City","Case Number":"6224","Object Features":"Wings","divs":["Sighting DetailsI was driving north on Telegraph Rd going into Monroe on Saturday morning with my 17 yr old daughter. It was apx 8:20 am and it was just beginning to turn daylight. My daughter and I saw a single bright light in the sky ahead of us, off to the left. It looked slightly smaller than a dime from our view. We watched this bright light, first it looked like it was hovering, but then it was slowly moving. Real slow. The light was shimmering, not blinking, but like it would dim then grow brighter, dim again, etc. We watched for abt. 1 min and it just disappeared. Like a light switch, it was on and then it was off and there was nothing there. We saw it again about 2-3 minutes later, except by the second sighting it had moved it's position in the sky to where it was directly ahead of us. We watched for about a minute, and again, like a light switch, it just vanished. It was totally light out at this point now and there was not a cloud in the sky. We found it a third time in the sky, and we could tell it was moving slowly again. We followed it with our eyes, and within a minute, the bright light went totally out again, but this time instead of being nothing there, as soon as the bight light went out, we saw some kind of object (resembled a tomahawk missle) with three blinking lights running parallel underneath it ( two white, one red). It had two small...wings, for lack of a better word, positioned midway on the object. It looked black (possibly dark grey, dark green). It was not made with shiney metal, it was more dull. The three lights underneath the object were not the same bright light that we had originally saw when we first spotted it in the sky. These were different lights, much smaller. This object just disapeared in the sky, just like the bright lights had disappeared. No trail, no haze, no nothing. There one minute and gone the next. It didn't fly off, it just disapeared into thin air. I should also mention that this sighting was near the Fermi Nuclear Power plant in Monroe, Mi. The 'wings' that I mentioned were very small. It was like this thing had some sort of cloaking device that made it invisible. Attached is a animation, only to give an idea. I had a hard time making the missle type object, and lining it up with the bright light. There was apx. a ten minute duration from the time we saw the first light, until the time the object vanished in the sky."],"Region":"Michigan","Sighting Duration":"Undisclosed","Weather Factors":"Does Not Apply","map":"<A HREF = \"http://maps.google.com/maps?q=41.920584,+-83.39344(6224)&iwloc=A&hl=en\"> mufon case (6224) map </A>","Object Shape":"Bullet, Missile, Other","files":["/var/www/straped/mufon/html2text/6224.html.txt","/var/www/straped/mufon/org/6224.html"],"Viewing Distance":"Unknown","City":"Monroe","Summary":"We saw a shimmering light in the sky 3 times then a craft appeared and disappeared into thin air","Log Number":"US-01242007-0003","trends":["There have been 9 other sightings in Monroe","There were no other sightings in Monroe on or around January 20th 2007","This sighting has never been favorited.",""],"Date of the Event":"01/20/2007 07:20 UTC","Source":"MUFON","Object Flight Path":"Other"}