{"divs":["sighting details[report by norman gagnon mufon field investigator] received an email from a clifton, virginia man, reporting that his wife witnessed something strange late in the night, during a storm that hit our area the previous day (clifton is approximately 12 miles west of springfield, in which i reside). email sighting account in part: \"we had a power outage last night and my wife was awakened by the answering machine clicking on and off as the power tried to recover, and then it went out completely. she went to the front door to see if it was raining or windy and saw a very large object hovering over a nearby house about an 1\\8 of a mile from our house. it was larger than the house, seemed to be at an angle to her view with the bottom exposed and had lights all around it evenly spaced. when it began to move away, several lightning flashes were seen and then it was gone. the power returned two hours later\". a second email was received the next day stating that he had a chance to talk to his wife about this sighting and he added that it would seem that his wife might have actually observed \"balls of lightning\". he also wrote: \"what she describes sounds just like a multiple ball lightning display which she says disappeared as she watched it, and then a bolt of lightning went up into the space above the house from the ground to where the lights had appeared to be\". a little more details were obtained during a telephone interview that was conducted march 31st: sighting took place around 12:30 am, march 23, during a thunderstorm, as she was facing south, towards manassas. the length of the appearance lasted just a few seconds, from the \"balls of light\" formation to the vertical lightning flash. it is my belief that this woman may have witness a natural, rare atmospheric phenomena (rap) involving multiple ball lightning, or mobile luminous spheres. according to dominion virginia power website, their electrical outage legend summary dated 3\\23\\2005, indicated that there were about 24 homes that were affected by this storm in the northern virginia's fairfax county area. march 23rd temperature: 44 degrees, cloudy with rain, average humidity 81, wind 13 mph ne. graphic illustration link: http:\\\\hometown.aol.com\\facadefx\\cliftonufo.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.780114,+-77.386654(6230)&iwloc=A&hl=en\"> mufon case (6230) map </A>","Weather Factors":"Unknown","Disposition":"Unknown","Country":"United States","Region":"Virginia","Sighting Duration":"Undisclosed","Tags":"City","trends":["There has been one other sighting in Clifton","There were no other sightings in Clifton on or around March 23rd 2005","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","City":"Clifton","Summary":"Clifton Virginia woman witnessed what appears to be a large disk shape UFO with mutiple lights during power outage.","Latitude":"38.780114","Date of the Event":"03/23/2005 12:30 UTC","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Case Number":"6230","Object Shape":"Oval, Unknown","Source":"MUFON","Longitude":"-77.386654","Date Submitted":"03/23/2005 12:30 UTC","files":["/var/www/straped/mufon/html2text/6230.html.txt","/var/www/straped/mufon/more/6230_submitter_file1__clintonufo.jpg","/var/www/straped/mufon/org/6230.html"],"Log Number":"US-01252007-0001"}