{"Longitude":"-114.405875","Latitude":"42.936016","divs":["sighting detailsokay, it was the middle of summer vacation and me and my friend, matt, had a sleepover dealy-do and i went over to his house. it was around 7:00 pm when i got there, and we watched some tv played playstation and so on. about 9:30 we had to go to bed, so we got some sleeping bags and went outside and rolled out the bags on his trampoline. we got to laying down and we were sitting there talking about some stuff that we had done previously, i think we talked about how we almost killed his cat in an accident with some fire crackers on the 4th of july, and then we noticed something that we will never forget. coming from the north, i noticed what i thought was a military jet because of it's speed, but it was not a jet. it was a triangle shaped object with green, blue, and red lights, the green one flashing. it hovered over us for a brief time and for some reason it had no noise and made no wind. it was probly 150-225 feet above us. when it navigated directly over us, i felt weezy almost like i were going to throw up my dinner. then my friend matt did throw up, all over his sleeping bag. it also produced some heat. it was probly 70* f outside and when it went over us it probly rose to about 120* because i started to sweat. it hovered there for about 30 seconds and went on slowly for about 1\\4 mile and then there was a flash brighter than lightning and a very loud noise like a sonic boom and it vanished out of the night sky. i don't know what the hell it was but i'm scared out of my shorts to sleep outside now! i didn't get shut-eye for months after that incident."],"Date of the Event":"07/09/2006 10:00 UTC","Object Shape":"Triangle","City":"Shoshone","Country":"United States","Sighting Duration":"00:02:00","Tags":"City","Disposition":"Unknown","Log Number":"US-01262007-0004","Case Number":"6235","Viewing Distance":"Unknown","Summary":"Triangular UFO with dim and bright lights.","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.936016,+-114.405875(6235)&iwloc=A&hl=en\"> mufon case (6235) map </A>","Date Submitted":"07/09/2006 10:00 UTC","Region":"Idaho","Source":"MUFON","trends":["There have been no other sightings in Shoshone","This sighting has never been favorited."],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/6235.html.txt","/var/www/straped/mufon/org/6235.html"]}