{"Case Number":"6236","Log Number":"US-01272007-0001","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=35.167777,+-114.573021(6236)&iwloc=A&hl=en\"> mufon case (6236) map </A>","Date of the Event":"11/08/2006 11:20 UTC","Summary":"Ball of Amber Light. Made 4 turns. Sped up, got lighter in color & then gone.","Object Flight Path":"Path with directional change","Disposition":"Unresolved","Date Submitted":"11/08/2006 11:20 UTC","Longitude":"-114.573021","files":["/var/www/straped/mufon/html2text/6236.html.txt","/var/www/straped/mufon/org/6236.html"],"Tags":"City","trends":["There have been 4 other sightings in Laughlin","There were no other sightings in Laughlin on or around November 8th 2006"],"Object Features":"None","Region":"Nevada","Object Shape":"Circle","City":"Laughlin","Country":"United States","Latitude":"35.167777","Weather Factors":"Unknown","Sighting Duration":"00:03:00","divs":["sighting detailsi went out that evening to walk my dog before going to bed i do this every night. when i walk, i am more often than not looking up at the stars all around. this one night i noticed a small orange light appearing to the eye to be about 1\\4\" in size in the night sky approx. a 35 degree angle. it was moving from west to east and much more quickly than any conventional craft i ever saw, it appeared to go straight for a number of miles and then turned north, went straight for some distance, turned south, coming back to near the path i originally saw it on and finally turned west just about on the same path. the object never appeared to have change it's altitude, appearing to me to be no more than a couple of miles high, and never made any sound nor left and type of contrail. then the object obviously sped up a great amount and as it did so it appeared to get light in color. within a matter of just a couple seconds after beggining to get lighter, the objected completely disappeared from view. during this entire event i stood still and did nothing to remove my eyes from this object. it was a most exciting experience and it was obvious to me that the turns made by this thing were not naturual in any way and in no way was it's speed normal, even for the fastest jets. i live in a mountainous area and we are very often, almost on a daily basis, overflown by all types of jets out of the air force base outside of las vegas. but this object traversed an expanse of sky that i have never seen before."],"Viewing Distance":"Unknown"}