{"files":["/var/www/straped/mufon/html2text/6237.html.txt","/var/www/straped/mufon/org/6237.html"],"Longitude":"-76.485643","City":"Annapolis","Date of the Event":"06/15/1979 12:00 UTC","Object Shape":"Circle","Log Number":"US-01272007-0002","Object Features":"Undisclosed","Weather Factors":"Unknown","divs":["Sighting DetailsI was driving my husband's truck coming off of Route 3 South on to St. Stephens Church Rd. My son Sean was with me and he was about 8 years old when this happened. We were on our way home from picking up feed for the animals and saw a very bright light from the highway. I remember telling Sean that airplane was flying very low. It was a very bright light. It takes about 4 minutes or so going on to St. Stephens to get to the place where the light was very visible. The light was on a hill on the Jone's farm and I stopped the truck to see what it was. I could see a saucer shape object hoovering over the pond that was there. I stood on the truck step up to get a better view. Just as I stood up the saucer approched my truck with it's white and red lights and it was so close I felt like I could have touch it. Just then another car came over the hill and this object just wheezed away making no noise what so ever and headed toward the power lines. It has been years since I saw this, no way to prove or disprove it. I would be willing to take a lie detector test, but it was so long ago this information may not be of any help to you. I can tell you with 100% accuracy this was a flying saucer and whether it was our ship or some unknow ship. I know what I saw and it is still very much in my mind. It was not a huge ship maybe 40X40 or so, but the interesting fact was that it actually stop over the truck. I always wonder what would have happened if the other car had not come over the hill. Hope this helps in some small way. Sincerely Doris Stevens"],"Disposition":"Unknown","Summary":"Saw your show on fox and friends and it brought to mind something that happened in 1979","Latitude":"38.980445","trends":["There have been 14 other sightings in Annapolis","There were no other sightings in Annapolis on or around June 15th 1979"],"Case Number":"6237","map":"<A HREF = \"http://maps.google.com/maps?q=38.980445,+-76.485643(6237)&iwloc=A&hl=en\"> mufon case (6237) map </A>","Sighting Duration":"Undisclosed","Date Submitted":"06/15/1979 12:00 UTC","Region":"Maryland","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Country":"United States","Source":"MUFON","Tags":"City"}