{"Longitude":"-71.439788","Object Shape":"Circle, Triangle","Country":"United States","divs":["Sighting DetailsI have seen the mother ship from the space shuttle window recall three flying circles (saucers) over Brazil,Russia,and Australia on STS-69 through a real time video feed at 1:30 am on day 2 of the hubble repair mission.It was around 1994-1995.I was working second shift in Satellite Beach,Florida. NASA Select was our local cable channel,and broadcast live video when the shuttle was in orbit.The video is now delayed 15 minutes for editing.I saw this giant bicycle tire slowly spin into view,and said \"what the hell is that\".Then the astronauts said \"what the hell is that\",then three flying saucers came up from earth and got in line and got in this thing.One astronaut said \"Houston you copy,and then silence for 45 seconds,then came back \"Copy\".This mother ship is the size of an NFL stadium, with lots of windows and about 300 antennas pointed at the earth.It had 5 spokes that went into the center like walkways and support cables in a cross section configuration.In the center top and bottom there was like a ground control tower similar to an airport tower on top and bottom.The craft was perfectly symmetrical top to bottom,just like the flying saucers and flying triangles.The saucers are grey in color,no windows or doors.They are 25 yards in diameter. The triangles are black in color and 100 yards wingtip to wingtip, and 10 yards high top to bottom. Again,no windows or doors.The triangles have red and green wingtip lights. They seem to circle the planet and only come down on the dark side,so the best time to see one would be 10pm to 2am.I am tired of seeing phony UFO's on television and hearing someone with a Phd try to explain what a solar flare is.I am an avionics technician with 30 years experience,that has worked on everything that flies,but I also am a model maker,so I decided to make some fiberglass models of the saucer and triangle this summer when the weather warms up.I've already made the molds,so the models are next.The mother ship would be too hard to make.You can't be afraid of something that doesn't make any noise. It is only human to be afraid of loud noises.Why are they here ? Your guess is as good as mine."],"Latitude":"42.764811","Disposition":"Hoax","Date of the Event":"01/06/2000 10:25 UTC","Viewing Distance":"21-100 Feet","Sighting Duration":"Undisclosed","City":"Hudson","Source":"MUFON","Case Number":"6239","Log Number":"US-01272007-0004","Object Features":"Wings","Weather Factors":"Unknown","Summary":"While working second shift ,on our way home (carpool) we saw a 300 ft triangular craft fly towards us 80 ft off the ground. It was flying over the power lines with its center light on.It also had wingtip lights (red,green).","map":"<A HREF = \"http://maps.google.com/maps?q=42.764811,+-71.439788(6239)&iwloc=A&hl=en\"> mufon case (6239) map </A>","files":["/var/www/straped/mufon/html2text/6239.html.txt","/var/www/straped/mufon/org/6239.html"],"Tags":"City","Region":"New Hampshire","Object Flight Path":"Straight-line path","trends":["There have been 4 other sightings in Hudson","There were no other sightings in Hudson on or around January 6th 2000"],"Date Submitted":"01/06/2000 10:25 UTC"}