{"Date Submitted":"12/27/2006 05:25 UTC","Country":"United States","Object Shape":"Circle, Disc, Sphere, Other","map":"<A HREF = \"http://maps.google.com/maps?q=37.157835,+-90.692325(6243)&iwloc=A&hl=en\"> mufon case (6243) map </A>","City":"Piedmont","Sighting Duration":"Undisclosed","Log Number":"US-01272007-0008","Disposition":"Unknown","Case Number":"6243","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Latitude":"37.157835","Object Features":"Other","Summary":"orange/golden rays around it about the size of a dime / and silver disk","Longitude":"-90.692325","Source":"MUFON","trends":["There have been 4 other sightings in Piedmont","There were no other sightings in Piedmont on or around December 27th 2006"],"Tags":"City","Weather Factors":"Unknown","Region":"Missouri","Date of the Event":"12/27/2006 05:25 UTC","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsBetween Christmas and New Years me and my 12 year old daughter saw a orange glowing UFO. I don't know the date but I can find out from my auto repair man. I was coming home from the auto repair shop when I turned down the road I live on something caught my attention a bright light. When I turned and looked to the left there was a very bright orange light in the sky. In the sky west south west it was setting still not moving it was low in the sky. It glowed real bright then slowly dimmed till it went out then it moved because it came on in a different place.If you held a wooden ruler at arms length against the sky it moved that far to the right or west. I didn't see any object during the movement the only way I know it moved was because it glowed in a different place. After it moved it glowed again very brightly then it dimmed and went out. Then it moved back to the original place, and glowed again then it went out .Then I saw a jet fighter coming from the west south west from the other side of the UFO object from where I was. It came almost to the place I last seen the glowing object then the jet turned south. Then it looked as if a silver disk flew up and down the side of the jet. I saw what looked like a small silver disk fly up the left side of the jet to the front tip then back down to the end of the jet or rear of the jet. Then it flew up to the front once more then flew away to the north. Then the jet appeared to try to follow but could not turn fast enough and looked as if it began to slow down. I am sending this because I feel it is important to make a record of all sightings. For all of our safety.And I would also like to say where I live Piedmont Missouri is having a lot of these types of sightings just the other night my friend called to ask if there was a fire over this way, said she was listening to the scanner when a report was made of a orange red glow in the woods two roads up from me but when the fire department responded while I was on the phone with her there was nothing there. And I have had 3 sonic booms over my house in 2 years. One of the sonic booms almost broke the windows out. And much more stuff but I don't know if it is related."],"files":["/var/www/straped/mufon/html2text/6243.html.txt","/var/www/straped/mufon/org/6243.html"]}