{"Source":"MUFON","Log Number":"US-01272007-0012","Region":"Oregon","Case Number":"6247","Country":"United States","City":"Portland","Sighting Duration":"Undisclosed","divs":["Sighting DetailsOn March 8th, 2001, around 5:30 PM, I walked out of my office into the parking lot to look at the ominous cloud formations that had been massing that afternoon. A massive black cloud had been building for hours, and I was monitoring it to see what kind of storm it would produce. In the foreground was a large, white cloud bank, low enough to give me an unobstructed view of the black cloud bank. Oddly enough, it was intensely sunny, despite the clouds. Our office was on Highway 43, in West Linn, OR., which looks out in a North Easterly direction (Mt. Hood is East of where we are). As I looked at the huge, very dark cloud behind the shopping center across the street, I noticed a large number of objects hovering around in a kind of slow, corkscrew pattern. At first I thought it might be a huge flock of birds, but then realized they weren't moving like birds, and everything was at half-speed. The objects appeared to be gold, metal balls, moving in slow motion, carefully avoiding each other as they hovered up and down. I estimated there to be about 100 of them, but I can't give a exact number. The orbs, or balls, were gathered in groups, moving along 3 motion paths. A column of orbs in the center moved up and down, (like an elevator), while other orbs travelled around the column, corkscrewing their way up; a second group corkscrewed their way down, giving the appearance of an animated double-helix moving around the column of orbs. They appeared between the two cloud banks, and they must have been sizable for me to be able to discern them as balls and not birds or something else. They may have been over the Willamette river, a short distance away. It was an amazing display, but I can't imagine the purpose of the strange formation.I was awe-struck; I watched for 30 seconds or so, and then called for my office mates to come see the swarm. Two co-workers came out, (everyone else was gone) and I asked them what they thought we were looking at. At first they seemed astonished, but then frightened, and couldn't really articulate what we were seeing. One went back inside, deciding he couldn't explain the sighting. The other person sort of shrugged and followed him into the building. Later, they both seemed unnerved and didn't want to discuss the event, even though I was overly excited and curious. I also had my two small dogs with me (they were allowed at work). They came out with me when I first noticed the orbs, but they seemed unconcerned. They are pomeranians (one is particularly excitable), but they acted completely normal through the whole event. It was as though nothing was in the sky at all. The balls appeared solid and opaque, with no wings or exhaust decernable. The only sound was of the traffic passing by, and I wasn't able to detect any sound from the orbs. (No one else seemed to notice! I figured someone would see the orbs and stop, but no one did.) The sun was very bright, not at all blocked, and the rays fully hit the spheres, making the sun reflect off of them as if they were metal. The sun made the cloud behind the orbs particularly dark, and one could not see through it. This event lasted about 10 minutes, until all the orbs had drifted into cloud cover, and as cloud cover moved over them."],"trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around March 8th 2001","This sighting has never been favorited.",""],"Object Flight Path":"Path with directional change","Date of the Event":"03/08/2001 05:30 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/6247.html.txt","/var/www/straped/mufon/org/6247.html"],"Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unknown","Object Shape":"Sphere","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.526752,+-122.668747(6247)&iwloc=A&hl=en\"> mufon case (6247) map </A>","Object Features":"None","Summary":"Over 100 gold spheres, moving in a double-helix column in bright sun.","Date Submitted":"03/08/2001 05:30 UTC","Latitude":"45.526752","Longitude":"-122.668747"}