{"Source":"MUFON","Object Flight Path":"Path with directional change","Object Features":"None","trends":["There have been 6 other sightings in Brockville","There were no other sightings in Brockville on or around January 31st 1999"],"Longitude":"-75.690712","Country":"Canada","Disposition":"Unresolved","Object Shape":"Star-like","Case Number":"6251","divs":["Sighting DetailsI will submit this report followed by another which occured on a more recent date. I am a licenced private pilot. I was arriving at our clubhouse at CNL3 to attend a club meeting one night in February of 1999 at about 20:00 hours. Bright clear night. Rural area with very little light pollution. I don't recall seeing a moon that night. As I exited my van parked in front of the clubhouse and parked facing about 040 degrees ( runway alignment) I happened to look up and see a bright object ( about Venus intensity) directly above my head at an undetermined distance. My immediate thought is \" no star there! What is that?\" I began walking forward towards the clubhouse almost tripping on a small six inch snow bank and looking down to avoid falling. Quickly looking up again to the object noticing then that it was visibly increasing in size as I watched. It increased in intensity proporionate to its' size. To this point maybe 10 seconds had elapsed. I was standing still looking straight up as it increased in size for a few more seconds to maybe double Venus intensity. It then began to slowly shrink in size although still same brightness in relation to size. At one point it began veering to the NW maybe 300 degrees in direction. At that point I realized that the object was moving away because it was no longer moving in a vertical line DIRECTLY above me but moving in an arc . The speed increased as it began to dim and arc to the NW at increasing speed ( many times faster than a satillite) and within a few seconds tremendous speed. as it increased in speed it appeared to be in an arcing trajectory. At the same time it gradually dimmed from bright white star like to a dull orangy colour which I could follow for several more seconds as it speeded, arced, turned orangy and disappeared as a dull speck in about 10 seconds or less. It looked like it was going into orbit. I could make out a barely visible vapour trail which lasted about a few seconds. Total elapes time was less than a minute but somewhat more than 30 seconds. That is my impression of the time lapse. I could not determine how close it was and there was no sound. Feelings: At first I found it odd to see a bright object in that location of the sky. Once I noticed it was getting brighter I was really curious. Once I determined that it was moving in an arc at increasing high speed I KNEW it was something I could not explain. Although I was calm, I was very exited inside. I remember saying out loud WOW!........WOW!................WOW!!!!! I interpreted it as VERY personnal because I realized that the object had been moving DIRECTLY towards me and away soon after the lateral movement started. With the beginning of the lateral movement It was obvious that the object was moving rather than getting larger or smaller. Telling the pilots inside the building was a let down......... Typical old flying farts more interested in reliving memories of the glory days than a truly current and unique event. Second sighting Clear summer night perhaps 22:00 hours later that year and possibly a year later. I am not sure of the year as I did not write a diary. It was about 5 to 6 years ago and since the sighting above. I was parked at the waterfront in Brockville Ontario Canada. Brockville is on the north shore of the Saint Lawrence River opposite and slightly west of Morristown New York. Note that Brockville is almost exactly due north of FORT DRUM New York, about 50 kilometers or more. Fort Drum is a very large US Army base. I had rented one of my residential apartments to a young man who was struggling to pay the rent and follow the rules set out in the lease. We went to a public waterfront park to have a coffee and try to work out the problem. Facing the river and parked in my van facing about 150 degrees. I noticed a bright light at about 180 degrees about 5 to 10 degrees high. I thought to myself.... an aircraft landing light perhaps a helicopter maybe from Fort Drum. Within seconds a light appeared of same intensity and close enough to the other to appear in formation slightly to the right. I pointed this out to Peter and said they are likely helicopters rather than fixed wing because they are not moving. Suddenly two more identical lights appeared slightly east and slightly higher in the sky. The group of two and two were close enough to be in formation. I was watching earnestly now because this was unusual as none of the the lights were moving in relation to each other or the ground. Very unusual for even helicopters to be frozen in one spot this way. The four lights were the same intensity and size and appeared to be the same distance away. All four lights reflected in the river leading me to believe they were either above the American shore or somewhat back from the shore but not to far. Note the river is more than a kilometer wide and perhaps a little more than a mile. I judged range to be less than two miles due to the 5 to 10 degree angle and the lights reflection almost all the way across the surface of the water. The altitude based on a very rough triangulation in my head would be somewhat above 500 ft agl. We watched them for about five minutes or more when the one furthest to the right appeared to dim slowly and go out over about 10 or more seconds. About 30 seconds to a minute later the second of the pair dimmed and went out the same way. After about two or three minutes more the remaining pair dimmed and went out at more or less the same rate at the same time with one slightly ahead of the other. I should say that they didn't really dim. My impression is of a light where the size and intensity decrease proportionally. Such that while getting smaller the light was of the same relative brightness until disappearing. As if a manual shutter effect was in play to diminish the amount of bright light getting through. The objects appeard stationary even while \"dimming\" because the reflection off the water did not move but \"dimmed\" at the same rate. No sound only bright white light. Like a larger landing light or helicopter spot light about a mile or so away I remember that the fellow I was with acknowledged seeing what I saw and hearing my commentary with little reaction even to my suggesting UFO's I looked around at a waterfrot park with perhaps a 100 people enjoying a warm evening on the riverfront and appearing not to notice the sight. I should note that I have always been a sky watcher and take a keen interest in anything in the sky from birds to aircraft to moon and stars. As a pilot I think a am a reasonable judge of something which is out of place in the sky. I've watched stars and planetary bodys. I've been picking out satilites since sputnik and up to the space station. I have seen comets and also meteors bright enough to turn night into day. These I would consider normal. My two experiences noted above although not dramatic like some reports are honest and accurate accounts of the only two times in my 55 years that I saw things I couldn't explain."],"Viewing Distance":"Unknown","Region":"Ontario","City":"Brockville","files":["/var/www/straped/mufon/html2text/6251.html.txt","/var/www/straped/mufon/org/6251.html"],"Tags":"City","Weather Factors":"Does Not Apply","Date of the Event":"01/31/1999 08:00 UTC","Sighting Duration":"Undisclosed","Summary":"At Brockville Airport CNL3 looked directly overhead , saw bright starlike object growing larger then smaller veering away 300 degrees and disappearing","Log Number":"CA-01272007-0016","Latitude":"44.602214","Date Submitted":"01/31/1999 08:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.602214,+-75.690712(6251)&iwloc=A&hl=en\"> mufon case (6251) map </A>"}