{"map":"<A HREF = \"http://maps.google.com/maps?q=48.475821,+-81.330495(6258)&iwloc=A&hl=en\"> mufon case (6258) map </A>","Case Number":"6258","Source":"MUFON","trends":["There have been 5 other sightings in Timmins","There were no other sightings in Timmins on or around"],"Summary":"an ancient abduction involving 3 cree boys, they were abucted about 1000 years ago.","Object Flight Path":"Unknown","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/6258.html.txt","/var/www/straped/mufon/org/6258.html"],"Country":"Canada","Date Submitted":"01/28/2007 01:42 UTC","Viewing Distance":"Unknown","Latitude":"48.475821","City":"Timmins","Tags":"City","Log Number":"CA-01282007-0006","Longitude":"-81.330495","Object Shape":"Unknown","divs":["Sighting DetailsThe event I am telling you about happened before the arrival of europeans. It is an ancient account about three young men who were hunting at a place called \"Moshawa\". It has been told that these boys mysteriously vanished for many years, when they returned they were the same age as when they had disappeared. The people that were their age were old, they said that had traveled very far and every where they went they flew. They brought back a book, the native people at this time did not have a written language. This story has been told for a thousand years, and the descendants of these people have known about these events even before the UFO phenomenon began to show up in the media. A number of these events from sitings to abductions have occured over time.My grandfather told many legends and stories, these stories have been passed down and memorized word for word in the cree language. Many people do not know this but where this occurred is a hotspot for UFO activity. This occurs near Cape Henrietta Maria in northern Ontario, Moshawa means great plain. A rough reference of the area 54 degrees; 57 minutes, 82 degrees 50 minutes. I'm somewhat hesitant to provide more information because the majority of people where I am from do not like media attention. This includes me, we have bigfoot sitings in our area as well and we have received ridiculing comments. There was a more recent occurance involving my relatives, I am not sure if they will share their experience. They are very reclusive and do not like attention. Email me and give me some feedback on your thoughts."],"Object Features":"Unknown","Region":"Ontario","Date of the Event":"Unknown","Disposition":"Unresolved"}