{"Tags":"City","Date of the Event":"11/30/1971 12:00 UTC","Object Features":"Other","Country":"United States","files":["/var/www/straped/mufon/html2text/6260.html.txt","/var/www/straped/mufon/org/6260.html"],"trends":["There have been 9 other sightings in Brunswick","There were no other sightings in Brunswick on or around November 30th 1971"],"Region":"Georgia","Object Flight Path":"Path then hovering","Summary":"I was jogging with a friend saw two spheres flying on the horizen very fast and no sound turned and hovered over pine tree it pionted toward us front sphere became bright 3-5 sec then back to normal turned up toward sky and was gone in a split second","City":"Brunswick","Viewing Distance":"101-500 Feet","Longitude":"-81.491489","divs":["Sighting DetailsI was jogging with a female friend when I notice an object(two sphere's flying together as if they hooked end to end together in the middle) flying at a high rate of speed above the horizen. No sound was noted. The object then turned flying towards me and my friend staying just above the pine trees. We both stop running when the object started flying towards us. The object two sphere's glowed at approx 60 watt blub. As we continued watching the object it came to hover over a pine tree about 20 yds away. It hovered level to the ground above the pine tree making no sound. I looked at my freind and said \"do you see what I see\". We both were fixed as if a statue. As we watched the object it tilted down towards us like pointing a light on us. Then the front sphere incresed in brightness to about 125 watts of light. The rear sphere remained at about 60watts. For about 3-5 sec the brighter light remained pointed at us. Then the front sphere decresed back to about 60 watt light intensity. Then the object rotated 180 degrees pointing toward the sky and in a split second was gone out of sight. Again no sound was made by the object."],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=31.149953,+-81.491489(6260)&iwloc=A&hl=en\"> mufon case (6260) map </A>","Disposition":"Unknown","Log Number":"US-01282007-0008","Date Submitted":"11/30/1971 12:00 UTC","Weather Factors":"Unknown","Case Number":"6260","Object Shape":"Sphere","Latitude":"31.149953","Sighting Duration":"Undisclosed"}