{"Viewing Distance":"21-100 Feet","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/6261.html.txt","/var/www/straped/mufon/org/6261.html"],"Latitude":"29.375656","Disposition":"Unknown","Date Submitted":"01/28/2007 02:45 UTC","Object Features":"Other","Log Number":"US-01292007-0001","Object Shape":"Diamond, Sphere","Sighting Duration":"Undisclosed","Summary":"two unidentified flying objects in the Del Rio sky","City":"Del Rio","Country":"United States","trends":["There have been 12 other sightings in Del Rio","There were no other sightings in Del Rio on or around January 28th 2007"],"Case Number":"6261","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=29.375656,+-100.888507(6261)&iwloc=A&hl=en\"> mufon case (6261) map </A>","Source":"MUFON","divs":["Sighting DetailsWhile my bassist Paulo and I were walking to our friend Mannys house on Gregory Dr. val verde neighborhood(will not put exact adress because for our own safety) at exactly 2:45pm. We noticed Mannys neighbors were pointing at the sky above. We both looked towards the area they were pointing at,we were astonished by a silver unidentified flying object. Paulo and I rushed to mannys house. As we rushed in screaming \"manny look a UFO!! a UFO outside in the sky!!\" his family ran to the door looked outside and just stayed looking at the UFO as it moved with so much intelligence from one spot to another then back where it was at first. Then we notice that this UFO had two small sphere rotating around it. Then mannys neighbors yelled \"look over there!! OVER THERE!! THERE IS A GIANT BLACK ONE OVER THERE!!!!\" just across the silver UFO. As we all looked at the black UFO it started to leave west towards Del Rio, then vanished. The silver UFO remained at the same spot. As manny tryed to take a picture of this UFO. Suddenly, the UFO began to move slowly and just a little closer to land. Then moved back higher into the sky. All of a sudden the silver flying object left the area going north with incredible high speed(This defenetly wasnt no weather balloon). This scenario lasted 15 or 20 minutes. Manny, Mannys brother Ray, Paulo and I got in mannys truck and tryed following the UFO going toward Rocksprings. But, the UFO was not seen again. Myself being a longtime UFO & extraterrestrial life believer couldn't feel any happier then ever. My most desired perseverance came true."],"Tags":"City","Longitude":"-100.888507","Region":"Texas","Date of the Event":"01/28/2007 02:45 UTC"}