{"map":"<A HREF = \"http://maps.google.com/maps?q=44.279491,+-73.979871(6265)&iwloc=A&hl=en\"> mufon case (6265) map </A>","City":"Lake Placid","Sighting Duration":"Undisclosed","Summary":"I saw a large black object crossing the sky below the clouds heading from south to north. At first I thought it was a hang glider but as it was moving, it slowly continueed to clime","Source":"MUFON","Country":"United States","Weather Factors":"Does Not Apply","Latitude":"44.279491","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Triangle","Date Submitted":"01/28/2007 01:00 UTC","Object Flight Path":"Hovering then path,Path with directional change","Region":"New York","Disposition":"Unresolved","Date of the Event":"01/28/2007 01:00 UTC","Tags":"City","Case Number":"6265","files":["/var/www/straped/mufon/html2text/6265.html.txt","/var/www/straped/mufon/org/6265.html"],"Object Features":"Unknown","trends":["There have been no other sightings in Lake Placid","This sighting has never been favorited."],"Longitude":"-73.979871","Log Number":"US-01302007-0001","divs":["Sighting DetailsI was waiting to see if there were any reports about what I observed, but I haven't heard of any yet, so I guess I have to be the one to report it. I was driving up Main St in Lake Placid and saw a strange looking object through my windshield. I parked alongside the street and got out of my vehicle to watch. I saw a large black, triangular shaped object crossing the sky below the clouds heading from south to north. When I first saw it, I would estimate it to be about 1500 to 2000 feet high. As it moved northward it steadily gained altitude until it passed through the clouds which were very high. At first I thought it was a hang glider or a large kite but determined that it wasn't either as it continued to rise as it traveled northward. On two occasions, as it was moving, another similar black triangular shaped object, appearing a little smaller and less distinct, seperated from the first and moved away about twice the distance as the width of the first object. It did a little manuvering on its own then slowly returned to and became part of the original object again. There was no apparent sound and no vapor trails (which would be likely if it was a jet as the air temp was around zero degrees) This thing just did not move, act or look like anything I have ever seen in the air. While watching it, I called a friend in a different location in Lake Placid and she was able to see it from a different vantage point. She said she saw a small light on it, but I did not."]}