{"Country":"United States","City":"Lawton","Date Submitted":"01/24/2007 06:50 UTC","trends":["There have been 7 other sightings in Lawton","There were no other sightings in Lawton on or around January 24th 2007","This sighting has never been favorited.",""],"Sighting Duration":"00:30:00","Case Number":"6266","divs":["Sighting DetailsFirst off let me start by saying that I have observed this object at least 5 times, the first time was Dec.31, 2006. I was leaving a friends house, which is in the middle of town, around 6:20 pm. I was headed west towards my home when I looked up in the sky and saw a very large object that appeared to be hovering over neighborhood which was about 30 street blocks from where I was. It was still daylight, I was on the phone with a friend who could also see the object. I was very interested in trying to see exactly what it was so I continued west about 60 blocks from where I first saw the object. That was when I realized that the object was not hovering over a neighborhood. The town I stay in isnt very big, everything is pretty close together, so once you past all the houses and stores, you are pretty much in the country(open fields, trees,etc). I drove south until I was at the very edge of the town. I could see the object very clearly hovering over a field where I believe there may be cows. I could have easily gotten a much closer look if I would have gone down this country road, but it was dark by then and for some reason I was getting the feeling that what ever was in this craft was watching me. So I pulled over at this retirement home and begin recording it with my cell phone. I would have to say just guessing, that the size of the object was about 2-3 times larger than a commercial airliner. It was saucer shaped with very bright blue and white lights around it, spinning. The object appeared to change shapes a couple of times, and a very bright white light, which was on the bottom of it, was circling around it kindof lke some type of search light or something. The object simply faded out and reappeared like miles away, and then disappeared. Since then I've seen the same object about 4 more times, and all around the same time in the day, around 6:30 pm. And it always seems to be visible for about 30-40 minutes. I have video from three of those sightings. Thank you for giving me the opportunity to share my story."],"Object Shape":"Disc, Flash, Star-like","Object Features":"Unknown","Latitude":"34.605877","Weather Factors":"None","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-01302007-0002","Date of the Event":"01/24/2007 06:50 UTC","Region":"Oklahoma","Summary":"stationary, rotating, lights around the edges, appears to change shapes","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.605877,+-98.387289(6266)&iwloc=A&hl=en\"> mufon case (6266) map </A>","files":["/var/www/straped/mufon/html2text/6266.html.txt","/var/www/straped/mufon/org/6266.html"],"Object Flight Path":"Stationary,Hovering then path","Longitude":"-98.387289","Tags":"City"}