{"Summary":"A very large rectangle-shaped object that had five lights flew extremely slowly over my home and then left area.","divs":["Sighting DetailsI had pulled into the driveway of my rural home and was exiting the vehicle when the sound of what seemed very familar to a jet airplane engine winding down caught my attention. It was dark out and I looked up and immediately saw the object above me moving to the south. My best recollection of its appearance after all these years, and points that I am very positive about, is that I saw four small points of light at the four corners of the rectangle shape (all four lights had the same color) and a fifth point of light \"detached\" from the four rectangle corner-points but in the \"front\" of the object as it moved in a southerly direction. That fifth light was of a different color than the other four lights behind it. At the time I was aware of what the two colors were, but I have since forgotten those two specific details. The object appeared to be approximately as wide as about 50 to 100 feet and maybe 75 to 125 feet in length (these measurements apply specifically to the rectangle portion of the object) and the fifth \"leading\" light point was a distance from the other four that I just don't really recall now. My estimation on the measurements may be highly incorrect, but two points that I'm absolutely positive about is that the object was very, very large (in the size range of a very large house or two)and that the object was moving through the sky AT A VERY, VERY, VERY SLOW SPEED - NOT A WHOLE LOT FASTER THAN THAT OF A PERSON WALKING AT A FAST PACE. I personally am not aware of any manmade object that large and capable of flight but able to move that slowly. I really have no exact idea how far up it was but would estimate 2-300 feet, but that is only a guess, especially after all these years. I initially saw the object and was absolutely stunned by it. I could see no actual object or superstructure, just the five lights. It moves, from its initial location where I first laid eyes on it, about 100 feet and then, while directly over my home, rotates to the right from its initial due-south direction and continues in the same fashion westbound. Ironically, at the time this occured I was a press photographer and had my bagged equipment in the car. I did not make an attempt to photograph it because that would have required the time necessary to retrieve the camera and a flash, put the flash on the camera, make necessary adjustments to the camera and flash for a properly exposed picture, etc. Even though the object was moving EXTREMELY slowly for a manmade object, I knew that its slow speed was going to be quick enough for it to move out of sight before I could get the camera equipment ready for a hand-held flash exposure. I was so completely fascinated by what I was seeing (instinctively I knew I was seeing something extremely strange) that I did not want to take the time to avert my eyes to get the photo equipment out of the car. I then ran to the house and pounded on the front door to attract my wife's attention, all the while not taking my eyes off of the object. She came to the door in bewilderment and I pointed upward and told her to look, taking my eyes of the object just long enough to glance at her to make sure she was seeing the same object. She was seeing the same thing, with her mouth dropped in amazement, and I immediately returned my gaze to the object and we both watched it continue westbound until it flew over a tree line and out of sight. The entire episode lasted no more than about three to four minutes. At this point, I do not recall if the loud jet engine-like noise continued throughout the entire episode or if at some point it died out or just what was occurring audibally. I truly have no idea what the object was, but based on the facts presented above, and just a deeply instinctive feeling that it was not a \"normal\" machine, I have elected to provide this report to MUFON."],"Object Features":"None","Sighting Duration":"Undisclosed","Region":"Illinois","trends":["There has been one other sighting in Shelbyville","There were no other sightings in Shelbyville on or around March 16th 1990"],"City":"Shelbyville","Latitude":"39.412698","Date Submitted":"03/16/1990 07:00 UTC","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/6277.html.txt","/var/www/straped/mufon/org/6277.html"],"Tags":"City","Disposition":"Unknown","Object Flight Path":"Path with directional change","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.412698,+-88.787199(6277)&iwloc=A&hl=en\"> mufon case (6277) map </A>","Longitude":"-88.787199","Date of the Event":"03/16/1990 07:00 UTC","Source":"MUFON","Weather Factors":"None","Log Number":"US-01302007-0012","Object Shape":"Square, Rectagular","Case Number":"6277"}