{"Date Submitted":"01/28/2007 03:30 UTC","Latitude":"41.307817","Case Number":"6278","Date of the Event":"01/28/2007 03:30 UTC","Object Flight Path":"Stationary","City":"Princeton","Country":"United States","Viewing Distance":"Unknown","Region":"Illinois","Source":"MUFON","Log Number":"US-01302007-0013","Weather Factors":"None, Does Not Apply","map":"<A HREF = \"http://maps.google.com/maps?q=41.307817,+-89.33811(6278)&iwloc=A&hl=en\"> mufon case (6278) map </A>","trends":["There have been no other sightings in Princeton","This sighting has never been favorited."],"Longitude":"-89.33811","Tags":"City","files":["/var/www/straped/mufon/html2text/6278.html.txt","/var/www/straped/mufon/org/6278.html"],"Object Shape":"Circle, Other","Summary":"huge (really big),pale blood red circle with upper left missing (like a bite out of it.)","Object Features":"None","Disposition":"Unknown","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was driving a semi-tractor west on I-180, over the Illinois river on the Hennepin bridge. As I approached the crest of the bridge I saw a huge pale, blood red circle with the upper left part of the circle missing to the west, north west. There is a large antenna in the same direction and it was just to the right of the antenna. I observed it for about 20-25 seconds through the front windshield. If you were looking forward you couldn't miss it. As I drove down from the bridge I entered the bottoms, a large wooded area and lost sight. The object appeared to be somewhat high in the sky, but with the trees so close and all around I couldn't see it. I said to myself, was that the moon? What is it, a cloud? It was very strange, especially since I have driven over the bridge at all hours and all seasons, and never have I seen anything like it. So I stepped on the throttle to get up to the highlands to get another look. As I climbed a big hill, when I leveled out, I saw it again out of my drivers side window, this time I only saw the top of the circle with the missing upper left part. The rest of the circle, I presume was obscured by trees. I was headed north at the time. I observed it for about 5 seconds this time, before I was back in the trees. I was driving to the quad-cities, so I stepped on it again to get to interstate 80 about 5 miles north, where the ground is flat to get another look. All the time I was looking west, and I never saw it again. When I got to the farmlands, I looked again and I never saw it. I got on I-80 west bound, I looked to the south, south west, north, northwest, And I never saw it again. I looked the whole time i drove the 50 or 60 miles. It was a starry night without any clouds in the sky. Whatever I saw it was huge. It reminded me of the harvest moon. It was also higher in the sky. I know if it was the moon I should have been able to see it the 10 or 12 minutes it would take for me to get to west bound I-80. I know I saw something what it was I don't know. I am sure someone else must have seen it, because like I said it was huge, and you couldn't miss it. I can draw picture if you would like."]}