{"Object Shape":"Star-like","Country":"United States","Longitude":"-118.778963","Date Submitted":"10/31/1964 12:00 UTC","divs":["Sighting DetailsI was driving by myself at about 2 AM along Highway 50 in Nevada, heading West. There was a solid cloud cover, quite high. Up ahead I noticed a bright red light emerge from the cloud cover and make a half circle, disappearing back into the cloud cover. As the light entered the clouds, another brigt red light dropped down and followed the same path. I continued to drive, watching these lights come and go for about 30 minutes. During this time the cloud cover was lowering so that I saw less and less of the arc the two lights were consistantly following. Finally I pulled off the road and shut off the engine and got out of the car to listen. At this point, I could only catch a glimpse of a red light at the bottom of its arc. There was no sound. The lights were solid bright red without flashing or any other colors. As I got back into the car I glanced to my left, South, and off over the desert I could see the faint blue glow of lights on the ground. Later I saw on a map that the Fallon Naval Air Base was in the area and I concluded that the blue lights were runway lights. One of the oddest things about these red lights was that I never seemed to get closer to them, which indicats they were either moving away from me or, more probably, were at a great distance."],"Tags":"City","Object Flight Path":"Path with directional change","Date of the Event":"10/31/1964 12:00 UTC","Weather Factors":"Unknown","Sighting Duration":"00:30:00","Region":"Nevada","Log Number":"US-01302007-0015","City":"Fallon","Disposition":"Unknown","Object Features":"None","Source":"MUFON","Viewing Distance":"Unknown","Latitude":"39.472762","trends":["There have been 4 other sightings in Fallon","There were no other sightings in Fallon on or around October 31st 1964"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.472762,+-118.778963(6280)&iwloc=A&hl=en\"> mufon case (6280) map </A>","files":["/var/www/straped/mufon/html2text/6280.html.txt","/var/www/straped/mufon/org/6280.html"],"Case Number":"6280","Summary":"Bright red lights emerging and re-entering cloud cover"}