{"Object Features":"Unknown","Tags":"City","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Object Shape":"Circle, Star-like, Triangle","Longitude":"-116.908998","Source":"MUFON","Latitude":"55.711436","divs":["Sighting DetailsI have this whole thing recorded in one of my journals, so it's not from memory, it's taken from the day it happened after I wrote it down in my book. My brother and I were playing basketball late one summer night but while it was still quite bright out, when we noticed a small opaque(seeming) circle in the sky, perhaps the size of a dime if you held it up and squinted your eyes. This was in the northern sky. It had a bright silvery kind of ring around it, and a really bright spot off one part of the ring.We sat down to watch it because it looked like nothing \"normal\" to be in the sky.After about 10 minutes , the circle broke up into 5 white glowing , smaller circles. Then a yellow triangle shaped object moved down from the center of the 5 circles( kind of like all these shapes had just 'appeared' from the opaque circle) and stopped in the middle of the sky.Then a smaller yellowish-orange cicular object \"came down out of \" the yellow triangle shaped ufo, and the two objects moved slowly sideways together in the sky.Meanwhile 4 of the 5 glowing objects in the sky shrank to pin points and started moving all around and then disappeared.The last white circle moved slowly west in the sky and disappeared.The small yellow-orange object that appeared lastly, moved west and towards the horizon and then out of sight. Lastly the yellow triangle shaped object moved straight west and stopped, moved straight down, and then disappeared. All this, and no sound at all. Judging only by sight, I'd say this all happened at the most a few miles north from where we were, in the middle of the town. I was 17 at the time, and my brother was 16. We were both pretty excited and ran home and told our parents. They believed us right away, and said they'd wished that we'd called them from a pay phone so they could have seen it too. I have heard a lot of stories of people seeing ufos in the sky by this small northern town. Myself and a friend also had another ufo sighting in the town about a year a half later."],"Weather Factors":"None","Object Flight Path":"Stationary,Straight-line path,Path with directional change","Region":"Alberta","trends":["There have been no other sightings in McLennan","This sighting has never been favorited."],"Case Number":"6282","Date of the Event":"07/30/1998 10:00 UTC","Log Number":"CA-01312007-0001","map":"<A HREF = \"http://maps.google.com/maps?q=55.711436,+-116.908998(6282)&iwloc=A&hl=en\"> mufon case (6282) map </A>","files":["/var/www/straped/mufon/html2text/6282.html.txt","/var/www/straped/mufon/org/6282.html"],"Date Submitted":"07/30/1998 10:00 UTC","Country":"Canada","Viewing Distance":"501 Feet - 1 Mile","Summary":"sighting of multiple ufos appearing out of the sky , and gradually disappearing in multiple directions","City":"McLennan"}