{"Object Shape":"Disc, Fireball","Date Submitted":"01/28/2007 07:45 UTC","Weather Factors":"Unknown","Country":"United States","Latitude":"42.724737","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Log Number":"US-01312007-0004","Tags":"City","Region":"Michigan","files":["/var/www/straped/mufon/html2text/6285.html.txt","/var/www/straped/mufon/more/6285_submitter_file1__blue.jpg","/var/www/straped/mufon/org/6285.html"],"Longitude":"-84.426164","trends":["There have been 9 other sightings in Meridian Charter Township","There were no other sightings in Meridian Charter Township on or around January 28th 2007","This sighting has never been favorited.",""],"Summary":"Eastbound on I-96, Blueish Disk Like Object Covered in Blue Flame","divs":["Sighting DetailsWas traveling Eastbound on I-96 coming home. This event occured Sunday night at about 7:45 in the evening. Around mile 105, what seemed like a blue fireball flew across the sky on a downward angle from right to left. The object appeared to be disc shaped and covered in a blueish flame and tinged with yellow spots. The object was moving very fast and could not have been a plane or any other flying object I can recognize. The object moved from the right to the left and promptly vanished. I was not the only person in the vehicle when this occured and my girlfriend could surely vouch for me. I understand that exit 105 is near the Lansing airport, but this object moved too fast to be a plane. The object caught both mine and my girlfriends attention immediately and we both saw the same object. After seeing the object and then seeing it vanish I remember feeling excited that I had seen something unusual."],"Case Number":"6285","Date of the Event":"01/28/2007 07:45 UTC","Viewing Distance":"Over One Mile","Disposition":"Unknown","City":"Meridian Charter Township","Source":"MUFON","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.724737,+-84.426164(6285)&iwloc=A&hl=en\"> mufon case (6285) map </A>"}