{"Summary":"a large round white light with specks jumping airound inside passed through a clearing in the clouds, no sound. then another of the same passed through the same opening in the clouds. seemed to be very close,","divs":["Sighting DetailsIt was just about dusk, the sky was covered in broken clouds. Through the breaks in the clouds I could see stars. I was just about to walk inside my home when I looked up. What I saw through the breaks in the clouds was the most spectacular thing I have ever seen. I t was like a large globe, like you would see on top of a large light pole, round, large, clear with kind of a black lines jumping airound inside, Like one of those static balls that when you touch the sides of them the electricity jumps to where you move your finger. This thing was huge. It passed through the break in the clouds and disappeared for a couple of seconds. Ididn't see any stars when it went back under the clouds, just black. Then another globe of the same size , shape and color passed through the same break in the clouds. The two globes wern't moving very fast which gave me the chance to view the detail. There was no sound, no vibrations, nothing but a very beautiful light comming from what ever it was passing over my house. I wasn't scared as I watched It pass over head. I was just in awe. I stood there for a minute just looking up wandering what it was that i had just seen. I then went inside and told my wife what I just seen. I can still see this thing in my minds eye even today. I watch the sky alot even before this and have seen things that you normally wouldnt see but I usually put them off as high tech aircraft or metiors etc. Just a few month before this sighting I was looking up on a beautiful star lit night sky. There were more stars in the sky that night than you would normally see, I was just amazed at the number of stars when I noticed a triangular patch of 5 stars moving across the sky fron north to southeast. I followed them across the sky for about a half minute untill they were out of my line of sight. They traveled across a good amount of sky in a short time till I lost sight. No sound just 5 stars in a triangle moving across the sky. My wife and kids think I'm nuts. I dont believe in ghoasts because i've never seen one. But as for machines from other worlds or wherever I know they are here."],"Latitude":"38.369937","Date of the Event":"08/22/2003 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.369937,+-98.757947(6296)&iwloc=A&hl=en\"> mufon case (6296) map </A>","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/6296.html.txt","/var/www/straped/mufon/org/6296.html"],"Tags":"City","Sighting Duration":"00:00:15","trends":["There have been 3 other sightings in Great Bend","There were no other sightings in Great Bend on or around August 22nd 2003"],"Viewing Distance":"101-500 Feet","Region":"Kansas","Country":"United States","City":"Great Bend","Longitude":"-98.757947","Source":"MUFON","Date Submitted":"08/22/2003 12:00 UTC","Log Number":"US-02012007-0002","Case Number":"6296","Object Shape":"Sphere, Other","Disposition":"Unknown","Object Flight Path":"Straight-line path","Weather Factors":"Unknown"}