{"trends":["There have been 63 other sightings in Fresno","There were no other sightings in Fresno on or around January 29th 2007","This sighting has never been favorited.",""],"Summary":"i was taken video like i always do. and this object showed up on tape. it looked like the moon but was roatating","Date of the Event":"01/29/2007 09:00 UTC","Viewing Distance":"Unknown","Latitude":"36.756247","Country":"United States","Log Number":"US-02012007-0005","Case Number":"6299","map":"<A HREF = \"http://maps.google.com/maps?q=36.756247,+-119.767606(6299)&iwloc=A&hl=en\"> mufon case (6299) map </A>","Weather Factors":"Unknown","Sighting Duration":"00:01:00","Source":"MUFON","Object Shape":"Boomerang, Cross, Triangle, Other","City":"Fresno","Object Features":"Undisclosed","Disposition":"Insufficient Data","Date Submitted":"01/29/2007 09:00 UTC","Tags":"City","Region":"California","files":["/var/www/straped/mufon/html2text/6299.html.txt","/var/www/straped/mufon/org/6299.html"],"divs":["Sighting Detailsi was tapeing ufos outside in the front yard. every day i tape some sort of ufo crafts. they have beem comming around my house sense aug. well thats when i first taped anything. its a lond story. i would like to talk with someone about it rather than write it all down. im sure i have 100 hours of ufo type things i recorded myself right here in fresno. some very incredible stuff !!!! on with this encounter. i was tapeing ufos planes whatever. i was watching my video and i soon noticed these very weird clouds with faces. and on the bottom just over a house was a abject that looked like the moon. but was spinning slowley. it was brite and about the same size as the moon you can only see the top half do to the house. i have some ufos on video no one else has ever seen. i have aliens in the dark. and some look like gohst or showdows. but there real and there here. i need to talk with someone now! im kind of scared because i feel they come in my room as i sleep. i have soo much to show on video! more than anyone , im sure of it!!"],"Longitude":"-119.767606","Object Flight Path":"Undisclosed"}