{"Sighting Duration":"00:02:00","Disposition":"IFO","trends":["There have been no other sightings in Albers","This sighting has never been favorited."],"Latitude":"38.543382","Date Submitted":"01/30/2007 04:00 UTC","Viewing Distance":"Over One Mile","Log Number":"US-02022007-0001","map":"<A HREF = \"http://maps.google.com/maps?q=38.543382,+-89.612313(6301)&iwloc=A&hl=en\"> mufon case (6301) map </A>","City":"Albers","Weather Factors":"None","Date of the Event":"01/30/2007 04:00 UTC","Country":"United States","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/6301.html.txt","/var/www/straped/mufon/more/6301_submitter_file1__ATT00005.jpg","/var/www/straped/mufon/more/6301_submitter_file2__ATT00003.jpg","/var/www/straped/mufon/more/6301_submitter_file3__ATT00001.jpg","/var/www/straped/mufon/org/6301.html"],"Summary":"Two objects, one red one white on either side of the moon. when the red one appeared, the white one developed a white halo around it","Object Shape":"Circle, Flash, Sphere","Region":"Illinois","Source":"MUFON","Object Flight Path":"Stationary,Path then hovering,Other","Longitude":"-89.612313","Case Number":"6301","Tags":"City","divs":["Sighting DetailsI was driving home from work at 4 AM and stopped passed my fathers home to check up on it while he is out of town. WHen I got to his house I noticed 4 odd contrails (i think they were) in front and around the moon. I thought it would be a cool picture to try and get with my cell phone camera. Just to see if it would take it. As I started to snap the shot, a bright white light just apppeared above the western horizon. Just as if someone turned on a switch. I thought it was odd so I took the picture. As I went to save it on my phone the light shot directly in front of me to the right side of the moon. It didn't slowly go there it just went from point a to point b in a flash. I then snapped another picture just as a pale red ball appeared along the left side of the moon and started bouncing and going back and forth and up and down seeming to vibrate. The odd thing is that when the red one first appeared, the white light on the right developed a white circle around it with a hazy center as to protect it. I was able to get out of my car by then and snap another picture just before they both completely vanished. This took place in a very secluded rural area. There are no street lights nor was there any sound at all, nothing, and the night was so still and quiet at 4 am. Im sending 3 pictures. THe first picture I took was with the gazeebo in the foreground. you can see the first light just above the horizon. the bright light is the moon. the other 2 pics are after the red ball showed up and the white light got a ball of light around it. the third picture is when i zoomed in on it and you can see a shadow of some kind blocking out the moons light over the plane contrails. I now am wondering if the clouds were plane contrails after all."]}