{"Case Number":"6309","Longitude":"-79.086108","Country":"Canada","Source":"MUFON","Sighting Duration":"Undisclosed","trends":["There have been 16 other sightings in Niagara Falls","There were no other sightings in Niagara Falls on or around August 31st 1981"],"Object Features":"Undisclosed","Date of the Event":"08/31/1981 02:10 UTC","Summary":"Huge metal like object hovering above our car","Viewing Distance":"Unknown","City":"Niagara Falls","Latitude":"43.090389","divs":["Sighting DetailsI was inspired to report this sighting after all these years because of listening to Stan Friedman who was a guest on a radio show (Coast To Coast) last night. My husband and myself were on our way home from an evening of cards at a friends home shortly after 2 am. We stopped at a red light waiting to turn left, when I commented on a very bright light in the sky ahead of us. My husband (a non believer at the time) said it was only a light on a tower in a neighbouring town straight ahead (West) of us. The traffic light turned green, and only for me did he go straight towards the light in the sky. We no sooner crossed the intersection and this now huge thing was directly above our car in plain view. I rolled my window down and stuck my head out to look at it. It just sat there above us not moving and not making a sound. We then got frightened, rolled up the window and locked the doors. It was amazing as we were now watching it through the front windshield of the car. It was like looking at a factory in the sky with jut outs and I think I could see inside it. It was not that far above us. I can't remember exactly how to describe it as it was so bizarre for the human mind to accept what it was looking at. A couple of minutes later it started to move slowly (East) in the direction we just came from. We turned the car around and started to follow it. This only lasted for a few seconds because like a rocket it sped away at an unbelievable speed and was out of sight. I have always been a believer in UFOs and this sighting confirmed my beliefs. I have seen other sightings but not like this one. There is no denying that this was not man made and from that morning on, my husband is now a true believer . Our eyes now are always in the skys hoping to experience such an exciting event again. I'm now sorry that we didn't report it and would consider going under hypnosis (both of us) to describe it better. Sincerely, Sue Burberry"],"Weather Factors":"Unknown","Disposition":"Unresolved","Object Shape":"Unknown","Log Number":"CA-02032007-0005","Object Flight Path":"Undisclosed","Tags":"City","Date Submitted":"08/31/1981 02:10 UTC","files":["/var/www/straped/mufon/html2text/6309.html.txt","/var/www/straped/mufon/org/6309.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.090389,+-79.086108(6309)&iwloc=A&hl=en\"> mufon case (6309) map </A>","Region":"Ontario"}