{"Summary":"lights from uknown flying object over halifax harbour","map":"<A HREF = \"http://maps.google.com/maps?q=44.663897,+-63.568182(6311)&iwloc=A&hl=en\"> mufon case (6311) map </A>","Log Number":"CA-02032007-0007","Object Flight Path":"Path with directional change,Path then hovering","Date of the Event":"09/29/2004 07:30 UTC","Source":"MUFON","City":"Dartmouth","Country":"Canada","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/6311.html.txt","/var/www/straped/mufon/org/6311.html"],"Object Shape":"Unknown","Longitude":"-63.568182","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 6 other sightings in Dartmouth","There were no other sightings in Dartmouth on or around September 29th 2004"],"Object Features":"Unknown","Tags":"City","Latitude":"44.663897","Sighting Duration":"Undisclosed","Region":"Nova Scotia","divs":["Sighting DetailsMy residence at the time was very near the Halifax Harbour. I had a clear unobstructed view of most of the harbour and a completely unobstructed view of the sky from the Dartmouth side, facing towards the open Atlantic Ocean. With a military air base and an international airport nearby, I am used to seeing all kinds of aircraft from there. I was sitting outside at approximately 7:30 in the evening. The dark sky was fall-like and clear other than a couple strata of low lying clouds. I noticed what looked like a star moving over the harbour from inland towards the open Atlantic Ocean. My curiosity was peaked by the fact that it appeared to be drifting silently. I watched and listened as it moved past the strata of clouds, an estimated one mile away. The object was almost to the open ocean (approx.one and a half miles away), when it stopped on a dime and started comimg back in the exact opposite direction. It then stopped just as suddenly in the cloud strata and lit it an orange color. After about ten seconds the object came out of the cloud and I could clearly see it as it became a large ball of amber light. This light was extremely unusual and hard to describe. Even though I could see it clearly it seemed to have a blurry quality to it. Then a streak of amber light came out from the side of this ball in a direction that would be roughly 90 degrees from the path it had been travelling. This streak got faster as it extended out until once again the object returned to it's star-like condition and took off like a sling shot. There was no sound associated with any of this whatsoever. I immediately went inside and told my wife. This whole event was awesome to witness and I have spoken about it often since. Unfortunately the date is a guess because as I didn't know about MUFON at the time and thought others must have witnessed this phenomenon. The account as described is accurate however."],"Date Submitted":"09/29/2004 07:30 UTC","Disposition":"Unresolved","Case Number":"6311"}