{"divs":["Sighting DetailsHello, a couple of weeks ago I made a report(historical) of a 1959 sighting in Goose Bay, Newfoundland. I would like to know if it was received and if and how I can find out. The event I am reporting this time is a very recent one. I had been walking on the beach at Port Hardy on Northern Vancouver Island on a early September evening of 2006. I was taking pictures of cloud formations and had shot the same formation three times within seconds of each other. I am attaching the middle shot to this report. The first and third shot had only the clouds and the trees in them. The middle or #2 shot had a red object in it. I had no idea that there was anything unusual about the scenery until I had downloaded to my computer. I was photographing the clouds only. This came as a complete surprise. I have taken hundreds of shots of cloud formations and never encountered any thing like this. In the photo the rays from the sun can be seen to the right of the object. The object is not touching the sand and seems to be suspended above it. It certianly is not a ray of sunlight and my beleif is that it has nothing to do with the sun. I have had other photographers look at this photo and everyone is at a loss to explain the object. If you look close you will notice a green haze around the object. I have zoomed it up to over half the size of my monitor and I am still at a loss to explain it. It might be or might not be an alien object however it is unidentified and it is an object, whether it is flying or not is another question. I am calling it a \"UO\" instead of a \"UFO\". I will leave that to you. I would appriciate it if you would not use my name or personal information except for your own use. I repeat, I have no idea of what showed up in my photograph but I expect there would be a lot of\"expert\" skeptics who would have some \"solid\" explanations for it. Thanks for reading this, if you need more info concerning the photo you can contact me. C.J. Hayes"],"Viewing Distance":"Unknown","Source":"MUFON","Tags":"City","Object Features":"Undisclosed","Log Number":"CA-02032007-0008","Case Number":"6312","Summary":"A red(orange) object with a green haze around the outside","files":["/var/www/straped/mufon/html2text/6312.html.txt","/var/www/straped/mufon/more/6312_submitter_file1__NewFolder635.jpg","/var/www/straped/mufon/org/6312.html"],"Date Submitted":"08/31/2006 12:00 UTC","Weather Factors":"Unknown","Longitude":"-127.492789","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=50.722741,+-127.492789(6312)&iwloc=A&hl=en\"> mufon case (6312) map </A>","City":"Port Hardy","Country":"Canada","Object Shape":"Undisclosed","Object Flight Path":"Undisclosed","Region":"British Columbia","Date of the Event":"08/31/2006 12:00 UTC","trends":["There has been one other sighting in Port Hardy","There were no other sightings in Port Hardy on or around August 31st 2006","This sighting has never been favorited.",""],"Latitude":"50.722741","Disposition":"Unresolved"}