{"Latitude":"38.14874","Country":"Italy","Summary":"Water ufo","Weather Factors":"Unknown","Date Submitted":"01/31/2007 04:45 UTC","Region":"Sicily","map":"<A HREF = \"http://maps.google.com/maps?q=38.14874,+15.211396(6313)&iwloc=A&hl=en\"> mufon case (6313) map </A>","divs":["Sighting DetailsHi, here i am to tell something weirs happened a couple of days ago just in the place where i live: I read that in a small article on local newpaper (see GAZZETTA DEL SUD daily newspaper of the febr. 2 2007) and people talked abt it. The morning of february 1 2007 at 4.45 in the morning while he was dirving near the sea in CICERATA a small place in Barcellona Pozzo di Gotto (MESSINA Sicily Italy) a man saw a round object moving fast on a surface of the sea at a distance of abt. 1 km from the beach. It was very strange as he describe it.. it was sailing a bit under the sea with only a small part over the waves...what took his attention is that it was that it was full of lights . The man said at most they were red lights but also withe ones. It just didn't look as a submarine (or something from the navy) as it ha such a different shape and it w too big. While the man was watching , other people came and stopped as they saw the same weird thing. The object have been visbile for other 5 minutes then it disappered underwater. Looking at yr. site i just discovered that it happened jsut in the same place described in Report # 658 of water ufo site. I also saw in the same site that there have been lots of similar episodes in the past years especially in 70s, within 5 miles from this places (Eolie islands, milazzo Patti) . Very curios , don't u think so ? Now i will not feel anymore so safe sailing in these waters.... Please let me know what to think abt. it . Thanks."],"files":["/var/www/straped/mufon/html2text/6313.html.txt","/var/www/straped/mufon/org/6313.html"],"Longitude":"15.211396","City":"Barcellona Pozzo di Gotto","Sighting Duration":"00:15:00","Tags":"City","Viewing Distance":"Unknown","Date of the Event":"01/31/2007 04:45 UTC","Object Flight Path":"Undisclosed","Source":"MUFON","Case Number":"6313","Disposition":"Unresolved","trends":["There have been no other sightings in Barcellona Pozzo di Gotto","This sighting has never been favorited."],"Object Shape":"Oval","Object Features":"Undisclosed","Log Number":"IT-02032007-0009"}