{"Date of the Event":"02/05/1998 02:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.960618,+-85.814152(6315)&iwloc=A&hl=en\"> mufon case (6315) map </A>","Source":"MUFON","trends":["There has been one other sighting in Smithville","There were no other sightings in Smithville on or around February 5th 1998"],"Latitude":"35.960618","City":"Smithville","files":["/var/www/straped/mufon/html2text/6315.html.txt","/var/www/straped/mufon/org/6315.html"],"Country":"United States","Object Features":"None","Summary":"saw black, dead silent ,triangle descend","divs":["Sighting DetailsApproximately 2 am I was in backyard with the telescope. I saw out of the corner of my eye at first a black dead silent triangle. It got my full attention as it descended app.100 yds away from me at 1 oclock into a ravine near a center hill lake tributary. I saw it for app. 2minutes as it moved slowly at 25 degrees at my right It was app 35 ft in length from tip to center tail and was more like a black hole against the sky and tree background. There was no lights ,no sound, and was on a steady course .It drifted at the speed of a piece of down on the air. I saw it plainly and wanted to go see what had come down but it was a pitch dark night and the terrain was a sheer dropoff for several hundred feet and a broken leg was on my mind.I was excited and thought about waking my sleeping wife but she had gotten up and asked me if i saw anything unusual. i thought that she referred to my telescope and answered her what i saw . She laughed and went back to bed. At daylight i went to where the triangle would have went down and saw nothing but what appeared to be military troop transports in the area. I left and didnt ask questions for i didnt see anyone near vehicles. Nothing else was seen. Trucks left on highway and no more was heard. I havent reported until now for it is a small town and i was in law enforcement and did not want ridiculed. Wanted this report for reference. This took place behind my old residence on Old sparta hwy. I dont know what it was but iknow it wasnt a hanglider or plane or parachute."],"Case Number":"6315","Object Flight Path":"Hovering then path","Weather Factors":"None","Log Number":"US-02042007-0002","Date Submitted":"02/05/1998 02:00 UTC","Object Shape":"Triangle","Tags":"City","Disposition":"Unknown","Longitude":"-85.814152","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Region":"Tennessee"}