{"Sighting Duration":"Undisclosed","Country":"United States","Viewing Distance":"101-500 Feet","Object Features":"Other","City":"Hartford","trends":["There have been 13 other sightings in Hartford","There were no other sightings in Hartford on or around January 29th 2007"],"Disposition":"IFO","Longitude":"-72.680453","Object Flight Path":"Straight-line path,Path with directional change","Date Submitted":"01/29/2007 10:30 UTC","Case Number":"6317","divs":["Sighting DetailsiT WAS MONDAY NIGHT AFTER WATCHING THE SERIES 24 WE HEADED UP STAIRS TO BED. IT WAS 1025 PM THEN. I WAS LYING ON MY SIDE JUST LOOKING INTO THE DARK WOODS, THE SKY THE STARS. ALL OF A SUDDEN I NOTICED S BRIGHT LARGE LIGHT IT SEEMED TO HAVE A SPARKLING AFFECT. AFTER STARRING AT IT I SHOOK MY HUSBAND,HE LOOKED AND HIS CURIOSITY MADE HIM GET UP SAYING THATS UNUSAL WHAT COULD THAT BE? i STARTED TO FEEL A LITTLE UNCOMFORTABLE INSIDE,& WITH THAT STATEMENT WE SAW THE LIGHT MOVE UPWARD ABOVE THE TERRAIN OF THE MOUNTAIN AND FLY AWAY. IT APPEARED TO BE OVAL IN SHAPE AND HAD YELLOW,GREEN AND RED LIGHTS THAT SURROUNDED IT.IT WAS A MATTER OF SECONDS THAT IT WAS NO LONGER IN VIEW FLYING NORTH. QUESTION HOW LONG HAD IT BEEN THERE? THAT LEFT US IN AWE, iT WAS THEN MY HUSBAND STATED THAT HE SAW A FLYING SAUCER IN 1972 IN ENFIELD CT WHERE 500 PEOPLE REPORTED THE SIGHTING. NEEDLESS TO SAY I DIDN'T FALL ASLEEP FOR A WHILE."],"Object Shape":"Oval","Region":"Connecticut","map":"<A HREF = \"http://maps.google.com/maps?q=41.766061,+-72.680453(6317)&iwloc=A&hl=en\"> mufon case (6317) map </A>","Latitude":"41.766061","Source":"MUFON","Summary":"SAW A SPARKLING LIGHT IN THE WOODED AREA ACROSS THE STREET FROM OUR 2ND FLOOR BEDROOM WINOW THAT IN MOMENTS LIFTED STRAIGHTUP INTO THE SKY AND FLEW OFF RED.YELLOW AND REN LIGHT SURROUNDED THE OVAL SHAPED OBJECT.","Date of the Event":"01/29/2007 10:30 UTC","files":["/var/www/straped/mufon/html2text/6317.html.txt","/var/www/straped/mufon/org/6317.html"],"Log Number":"US-02042007-0004","Weather Factors":"Unknown","Tags":"City"}