{"Tags":"City","Case Number":"6320","Log Number":"US-02052007-0002","Longitude":"-112.353124","map":"<A HREF = \"http://maps.google.com/maps?q=33.457856,+-112.353124(6320)&iwloc=A&hl=en\"> mufon case (6320) map </A>","Source":"MUFON","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/6320.html.txt","/var/www/straped/mufon/org/6320.html"],"Disposition":"Unknown","trends":["There have been 8 other sightings in Goodyear","There were no other sightings in Goodyear on or around February 4th 2007"],"Country":"United States","Latitude":"33.457856","Object Flight Path":"Path with directional change","Viewing Distance":"Over 1 Mile, Unknown","Sighting Duration":"Undisclosed","Object Shape":"Sphere","Region":"Arizona","Date Submitted":"02/04/2007 12:00 UTC","Date of the Event":"02/04/2007 12:00 UTC","Summary":"Multiple fast flying objects","divs":["Sighting DetailsMy wife and I were sitting on our deck sunning. The day was perfectly clear, no clouds. We kept moving our chairs to keep our faces out of the sun. I looked up and the sun was just out of view behind the overhanging eave, but left a bright aura. I noticed a fast moving object moving from behind the eave and heading toward the west. I appeared to be extremely high in altitude leaving no condensation trail. It seemed to be very similar to a star, only in the daylight. I showed my wife, but it had already disappeared. I kept looking mostly to see the suns location so I could move my chair back in the shadow, I saw several more objects. I told my wife where to look and she saw them too. We sat watching for several minutes, and I said I was going to get our binoculars to get a better view. We watched for over an hour and kept moving our chairs just out of view of the sun. The object seemed to be easier to spot in the suns corona. The objects appeared metallic, and moved a hight rate of compared to the jets passing overhead. I wondered if I was seeing something closer, so I intentionally focused my binoculars at a passenger plane on the horizon. When I went back to looking at the objects, they were in focus, birds and insects were not. The objects seemed to fly at a high rate of speed, could maneuver at angles that would seem impossible for a human pilot to endure. Some objects appeared to be \"Dogfighting\" for lack of a better term. Some would arc, and appear to leave trails behind them. My wife looked through the binoculars to an area of blue sky away from the corona area and spotted them too. I could not spot them in the blue sky area, but when I had one in view could trail it there. As I said previously, they were too far away to make out any shape, but in the sunlight of the suns corona, appeared metallic. They looked much like stars, only in the daylight. Some were very bright. We watched for about an hour and a half. We still don't know what we saw, but we are going to watch and see if we can see them again. I don't know if we have photographic equipment with enough power, or resolution to catch the images. We live close to Luke Air Force base and see the fighters regularly but these were at a much higher elevation."],"Weather Factors":"Unknown","City":"Goodyear"}