{"map":"<A HREF = \"http://maps.google.com/maps?q=35.475745,+-81.249795(6322)&iwloc=A&hl=en\"> mufon case (6322) map </A>","Source":"MUFON","Object Flight Path":"Stationary","Viewing Distance":"501 Feet - 1 Mile","Latitude":"35.475745","Sighting Duration":"Undisclosed","Date of the Event":"01/24/2007 07:45 UTC","Date Submitted":"01/24/2007 07:45 UTC","Country":"United States","Longitude":"-81.249795","Disposition":"Unknown","Region":"North Carolina","trends":["There have been 3 other sightings in Lincolnton","There were no other sightings in Lincolnton on or around January 24th 2007"],"Log Number":"US-02052007-0004","Summary":"small, oval shape, bluish light, hovering over road, cone of light emanating downward","City":"Lincolnton","divs":["Sighting DetailsMy husband and I were traveling east on NC27 between 7:30 and and 8 p.m. going from Lincolnton to Boger City. He was driving. While we were talking, I looked up at him, and happened to see this stationary object in the sky hovering over the land, just to the north of where we were, from one to two thousand feet away, I would guess. it wasn't large. We were travelling east, and were about to pass over HWY 321, a four lane divided road. Between us and the craft was a shopping center with a lot of lights. There was a lot of traffic, so I can't have been the only one to see this. It was rather low in the sky, and there were buildings between us and it, as we travelled along. We'd pass a building, and then I would see it again. I remarked to my husband, \"WHAT am I looking at!\" I thought I'd wait until we got passed this brightly lit service station (Petro Express) and then I would get a long look at it as we passed over 321. Well, we got past the station, and it was no longer there. What I had seen was an oblong shaped disk that had some sort of bluish light in it, but what was also spectacular was the cone-shaped, white beam of light emanating down, pointing to the south, much like a helicopter beam would be like. I've seen those. But this was NOT a helicopter. There was a plane behind it, that was probably approaching the Charlotte airport (we are 40 minutes from there). When I got to the overpass, the plane was there, but the object with the beam of light was not. I have never really given any credence to such sightings, so I was a bit slow to tell my husband. But I did, about two hours later. Then, two days later I read a story in the Charlotte Observer about all these reports that had come in, along with a photograph of the vehicle one man in Kings Mountain (just South of here) had taken. It was exactly the same object I had seen, but without the beam of light going down. The paper just laughted at it. But they did insert a map showing locations of all the calls that had come in---there were 19, not including any from Lincoln County, where we live. The sightings were from Union, Iredell, Cabarrus, Gaston and Mecklenburg Counties. But there was a man from Lincoln who called 91i, Granville Angell, who wrote a column in our local paper about it. I was so glad he did, because I did not want to be the only one here who had seen it. I talked with him today, and he said he is going to be interviewed on CNN by Anderson Coopeer tonight or tomorrow, at 10 p.m. He is going to be in touch with me about this this week. He is connected with your group. I told him that I would not have believed people talking like this had I not seen it. But I also told him that I was a bit surprised that I felt not any fear at all about seeing this, that I felt that whoever they were, they were curious and investigative and had gone to a lot of trouble to be here, but that none of that adds up to anything that would inspire fear in an observer. They might be quite friendly. If you want to be afraid of something, be afraid of global warming. That's the BIG one. I have seen Al Gore's video three times now. And my husband, an environmental geologist, has been worried about this problem for 25 years. That is the real catastrophe around the corner. Do you think these beings know about this calamity that is about to befall us? Our government is hiding its head in the sand about climate change. And probably you think it's doing the same regarding ufo's. I can't understand why they seem to want to hide this from the public. But maybe knowledge is power, and they want all of it. A real democracy, we do not have. Who knows. All I know is, God is still in charge. He is over everything, including life from elsewhere. And He is a kind and loving God. So my feelings are not against whoever is in these vehicles. I don't have anything against them at all. Maybe they are positioning themselves to live here when we have really ruined the environment for ourselves. Maybe they have reason to believe they will be able to live in it, for all I know. We may see more and more of these now, as the climate problem escalates. I'd love to know if someone in your group agrees with me."],"Case Number":"6322","Object Features":"Unknown","Tags":"City","Weather Factors":"Unknown","Object Shape":"Oval","files":["/var/www/straped/mufon/html2text/6322.html.txt","/var/www/straped/mufon/org/6322.html"]}