{"divs":["Sighting DetailsMy 35 year old male friend and I (40 year old female)were standing with a large crowd of people on the west bluffs east of the south tower of the Golden Gate Bridge looking west north west at the Queen Mary 2 awaiting her entrance to the gate. The QM2 had just started to proceed toward the gate as this sphere came from the direction over our right shoulders into our line of sight, from the south end of the gate heading west first, then south west on an arcing trajectory in, toward Baker Beach. At first I assumed it was a balloon that had been release but then it was not acting like a balloon in that it moved so fast (approx 30-50 mph)and it did not move with the winds. The winds were very light, which is unusual for that location. It was perfectly round and I saw it change direction and stay perfectly round. A balloon is not perfectly round; it always has some tail shape. Its speed and smoothness of movement combined with no sound reminded me of the video images I have seen on TV of other UFO's, specifically, the ones over the crop circles in England. I had pointed it out to my friend who, watch it with as much interest as I did and we watched it until it landed in the water and disappeared with no splash. We could not come up with an explanation and both concluded it to be an Unidentifiable flying object. If I were to hold up my hand at arms length (I'm 5'2\") as it went by it would have been no bigger than my thumb. It was approximately 100-150 yards distance from us and about 100 yards higher at first, and then dropped to sea level. What is interesting is how much air traffic was in the area at the time. We counted three small planes and 6 helicopters. The helicopters were flying close overhead so I had had a good perspective to judge the sphere's size by. Slightly bigger than a basketball. Other's must have seen it given the amount of air traffic in the air and people (approx 300-500) on the bluffs. There might be a picture of it too as everyone was taking pictures of the QM2. Except for me. :("],"Object Features":"None","Tags":"City","Latitude":"37.78366","Disposition":"Unknown","Object Flight Path":"Path with directional change","Viewing Distance":"501 Feet - 1 Mile","Case Number":"6323","Longitude":"-122.417106","Source":"MUFON","files":["/var/www/straped/mufon/html2text/6323.html.txt","/var/www/straped/mufon/org/6323.html"],"Date Submitted":"02/04/2007 03:48 UTC","Object Shape":"Sphere","Summary":"small sphere either silver or black","Region":"California","Log Number":"US-02052007-0005","City":"San Francisco","map":"<A HREF = \"http://maps.google.com/maps?q=37.78366,+-122.417106(6323)&iwloc=A&hl=en\"> mufon case (6323) map </A>","trends":["There have been 127 other sightings in San Francisco","There were no other sightings in San Francisco on or around February 4th 2007"],"Weather Factors":"None","Sighting Duration":"00:00:20","Date of the Event":"02/04/2007 03:48 UTC","Country":"United States"}