{"Summary":"Spotted ufo north of I 90 between Moorcroft and Sundance WY.","Date of the Event":"06/01/1976 09:00 UTC","trends":["There have been no other sightings in Moorcroft","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=44.263315,+-104.950254(6327)&iwloc=A&hl=en\"> mufon case (6327) map </A>","Longitude":"-104.950254","Sighting Duration":"00:02:00","files":["/var/www/straped/mufon/html2text/6327.html.txt","/var/www/straped/mufon/org/6327.html"],"Case Number":"6327","Region":"Wyoming","Object Flight Path":"Stationary,Straight-line path","Tags":"City","Log Number":"US-02052007-0009","Source":"MUFON","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","Latitude":"44.263315","Weather Factors":"None","Country":"United States","divs":["sighting detailsreturning to wyoming from sister-in-laws wedding in wisconsin. picked up hitch hiker in minnesota. traveling west between sundance and moorcroft when i spotted lights out on the prairie that resembled the derrick lights on a drilling rig. i lived in moorcroft so was familiar with the area. i remarked to the hitch hiker that they must have just set up a drilling rig out there. then the lights became brighter and brighter. then they rose from the ground and headed up rapidly. as they ascended, they became brighter and turned from white to more orange, then red then disappeared from sight. the spot where they took off was about 3\\4 mile north of us and is near a high voltage transmission line. after the light disappeared i looked at the hitch hiker and said \"did you see that?\" he replied \"yea\". i then said \"what was it?\" he said \"i don't know\". we didn't talk about it any more. i know this happened almost 31 years ago but after watching several ufo documentaries on tv, i decided to report it for the first time. i know ufos exist not only because i saw one but because i know a number of credible people who have also seen them including my ex-wife and a deputy sheriff that i worked with. i have no idea who they are or where they come from, but here they are."],"Date Submitted":"06/01/1976 09:00 UTC","City":"Moorcroft","Object Shape":"Unknown"}