{"Date of the Event":"01/28/2005 12:00 UTC","trends":["There have been no other sightings in Wickliffe","This sighting has never been favorited."],"Disposition":"Unknown","Viewing Distance":"Unknown","City":"Wickliffe","Log Number":"US-02062007-0001","Tags":"City","Summary":"No shine just a cloud texture no wings","Case Number":"6328","Sighting Duration":"00:00:17","Longitude":"-89.089235","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Latitude":"36.964775","Weather Factors":"Unknown","Source":"MUFON","Region":"Kentucky","Country":"United States","Date Submitted":"01/28/2005 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.964775,+-89.089235(6328)&iwloc=A&hl=en\"> mufon case (6328) map </A>","divs":["Sighting DetailsWaterfowl hunters look up alot. Near the end of January I was looking NW from a floating 20 ton duck and goose blind. 1,100 decoys were bobbing at eye level. The sky was mostly clear. Two lanes of white clouds were to my right in my viewing area. Around 10 AM there was an object oval in shape moving North towards Cairo, Illinois. It's finish was like the nearby white clouds and not a bit of shine on it. I had 15 seconds to view this object with no apparent wings. It went behind cloud lane # 1 and I expected to see it re-appear between the lanes. I watched for a bit and did not see it again in the blue sky clearing. Like I said the texture was like an oval cloud, and the edges were distinctly oval but like a cloud's edge. No contrail was seen like a airliner or Air Force jet would have. Two men were on either side of me and I said nothing to them. I told my friend later of the sighting. He had seen a UFO before. I am real sure this was my first UFO. The speed was like an airliner. Steady, straight, and then nothing to be seen again. When it should have re-appeared in the next opening. The size compares to holding an oval shaped pill up at arms length. It was 30,000 feet as a guess. When I first noticed this object I thought UFO. I have been advised to send this to you by Colorado's MUFON director Leslie."],"Object Shape":"Oval","files":["/var/www/straped/mufon/html2text/6328.html.txt","/var/www/straped/mufon/org/6328.html"]}