{"Summary":"Massive green spotlight over California (SF bay area)","Date of the Event":"08/31/2000 12:00 UTC","Source":"MUFON","Date Submitted":"08/31/2000 12:00 UTC","Country":"United States","Tags":"City","Sighting Duration":"Undisclosed","Longitude":"-121.948396","trends":["There have been 12 other sightings in Santa Clara","There were no other sightings in Santa Clara on or around August 31st 2000"],"Log Number":"US-02062007-0003","Object Flight Path":"Stationary","Object Shape":"Other","City":"Santa Clara","Region":"California","Latitude":"37.362258","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/6330.html.txt","/var/www/straped/mufon/org/6330.html"],"Object Features":"None","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.362258,+-121.948396(6330)&iwloc=A&hl=en\"> mufon case (6330) map </A>","divs":["Sighting DetailsSanta Clara, CA. - My girlfriend and I were walking from a restaurant into a theater through the parking lot, I stopped to light a cigarette and looked west and saw the most massive greenish light glaring down from the sky, just like a spotlight in fog, however, it was a crystal clear night, so this was not a normal halogen or LED type light. It started from a small point and expanded as it went down, I'm surprised everybody in California couldnt see this. From the point it was coming from, there was another white light beaming up slightly tilted in about the 1 O'clock position, we both stood there just watching this for minutes in complete amazement, I'd never seen anything like it before or since. From the size, it looked to possibly be out maybe a hundred miles (well over the Pacific Ocean), so the widest point in the cone shaped light I could see had to be at least a couple miles wide. The following day in the news they said it was a test missile launched from and island in the pacific, which had gone wrong (not sure of the exact details). However, if this was a missile gone \"wrong\" why would a missile have such sophisticated lighting, and almost intentionally be beaming down with purpose for at least five minutes? I still wonder to this day, the news said it could be seen from as far as southern California, so this light was massive! If anybody else saw this event please e-mail me at \"robogden2002@yahoo.com\" and lemme know your story and theories, because I truly believe this to be a U.F.O. sighting."],"Disposition":"Insufficient Data","Case Number":"6330"}