{"Log Number":"US-02062007-0005","Region":"South Carolina","Country":"United States","Summary":"Taken while trying to capture lighting pics","Longitude":"-78.883494","Object Shape":"Disc, Oval","Case Number":"6332","Latitude":"33.69591","Weather Factors":"Unknown","City":"Myrtle Beach","Date of the Event":"06/20/0001 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.69591,+-78.883494(6332)&iwloc=A&hl=en\"> mufon case (6332) map </A>","divs":["Sighting DetailsI just want to send this image in and see what you think it could be, I have the original I can send through a private email, as I would feel better about sending it that way. I work in forensics in law enforcement and wish my name not to be mentioned right now until I find out what this is. I left the meta data attatched to the image so you can see the setting in which it was taken, the camera used was a Fuji S2 pro and the original image size is 4256x2848. The image was an accident, I was trying to photograph lighting and this is what I got, I never saw the object until I looked at the images later on my pc. Sorry about the copy transparent on the image, I just did not want anyone to try and enhance or alter the image and make it something it is not. The original has not been touched and is just as it was when it was taken, I can send the original and please feel free to have it verified that it has not been altered in any way. Just wanted to get your expert opinion on what this might be and if you may have observed anything like this before as most of the images I have seen are always grainy or very blurred and leave to much to the imagination. Dave"],"Source":"MUFON","Viewing Distance":"Unknown","Disposition":"Insufficient Data","Object Features":"Undisclosed","Date Submitted":"06/20/0001 12:00 UTC","Object Flight Path":"Undisclosed","trends":["There have been 52 other sightings in Myrtle Beach","There were no other sightings in Myrtle Beach on or around June 18th 0001","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/6332.html.txt","/var/www/straped/mufon/more/6332_submitter_file1__DSCF4625cropped.jpg","/var/www/straped/mufon/org/6332.html"]}