{"Date of the Event":"02/06/2007 06:30 UTC","Longitude":"-117.790994","Object Features":"Undisclosed","Viewing Distance":"Over One Mile","Disposition":"Unknown","Latitude":"33.687867","Case Number":"6333","Source":"MUFON","files":["/var/www/straped/mufon/html2text/6333.html.txt","/var/www/straped/mufon/org/6333.html"],"Sighting Duration":"Undisclosed","divs":["sighting detailson february 6, 2007 my brother, mother and i were all coming back from dinner, when all of the sudden we saw these lights in the sky. my mom quickly pulled over and we rushed out of the car. when we looked up, about 15 miles ahead of us and approximately 5,000 feet up, we saw a swarm of lights in a sphere shape, moving in unison together. the lights were perfectly aligned. there were thousands of lights. they were colors of blue, green and red. the object was huge! an airplane had flown next to it, and was about 1\\50 the size of it. this object made no noise, and was moving slowly northwest. when the object flew through the moon's light, there was no direct \"outline\" or \"metal body\" to the object. it was completely see through filled with lights. we watched for about ten minutes, until it floated northwest. i didn't know what it was when i first noticed it because of it's massive size. but once we stopped and looked at it for a while, i knew this was something out of the ordinary. i was able to take pictures of the object from my phone, but it just looks like a light in the sky. the object slowly faded away once it went further out towards the city. that was my experience with an unidentified flying object!"],"Object Shape":"Disc, Egg, Oval, Sphere","Weather Factors":"None","Object Flight Path":"Path with directional change","Country":"United States","Date Submitted":"02/06/2007 06:30 UTC","Tags":"City","trends":["There have been 28 other sightings in Irvine","There were no other sightings in Irvine on or around February 6th 2007"],"Log Number":"US-02072007-0001","Region":"California","Summary":"A large, sphere like object with thousands of lights surrounding it and within it.","map":"<A HREF = \"http://maps.google.com/maps?q=33.687867,+-117.790994(6333)&iwloc=A&hl=en\"> mufon case (6333) map </A>","City":"Irvine"}