{"Date Submitted":"09/23/2006 10:30 UTC","Log Number":"US-02072007-0004","Object Flight Path":"Undisclosed","Region":"Minnesota","map":"<A HREF = \"http://maps.google.com/maps?q=46.713286,+-93.488569(6336)&iwloc=A&hl=en\"> mufon case (6336) map </A>","Summary":"It flew almost all the way across the clear night horizon far too fast to be an aircraft or a satelitte, zig-zagged, then darted upwards out of sight.","Tags":"City","Latitude":"46.713286","Longitude":"-93.488569","Source":"MUFON","Sighting Duration":"00:02:00","Country":"United States","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/6336.html.txt","/var/www/straped/mufon/org/6336.html"],"Date of the Event":"09/23/2006 10:30 UTC","Viewing Distance":"Unknown","City":"Palisade","Object Shape":"Star-like","Object Features":"Undisclosed","trends":["There have been no other sightings in Palisade","This sighting has never been favorited."],"divs":["Sighting DetailsMe, my brother and sister-in law were enjoying the clear night sky around a bon-fire at our hunting schack in central Minnesota, when we noticed a brighter star-like object very fast light moving across the sky from the west. When we noticed it, we knew it could not be an aircraft, as the speed it moved across the sky was just plain way too fast!! We weren't sure, and looked in the sky for another aircraft as a reference speed and found one. When we looked back, we noticed it had started to go from left to right in an upwards direction. It continued it's course eastward, then suddenly went upwards moving slightly towards the east much much faster than it moved across the sky, in a matter of seconds it was out of our eyesight. At that point, we realized it could not have been an aircraft, nor a satellite! My brother saw it again the next night, travel the same sort of path, at appoximately the same time. But we have never seen it again. We tried to rule out the possiblity of it being a non earth-like flying phenonmenon, but due to it's speed it moved across the sky and the fast back and forth manuevers it made, it was just not at all possible to determine it was of this earth. We realized there was no other alternative explaination. We still look for it whenever we are there."],"Case Number":"6336","Weather Factors":"Unknown"}