{"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Latitude":"41.255063","Longitude":"-95.991488","Source":"MUFON","Region":"Nebraska","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=41.255063,+-95.991488(6337)&iwloc=A&hl=en\"> mufon case (6337) map </A>","Summary":"Sightings have occured beginning at dusk January 6, 2007 to present. Please see below.","Weather Factors":"None","Object Shape":"Saturn-like, Sphere, Star-like","Case Number":"6337","Tags":"City","Country":"United States","Sighting Duration":"Undisclosed","Object Features":"None","Date of the Event":"01/06/2007 05:00 UTC","Date Submitted":"01/06/2007 05:00 UTC","divs":["sighting detailsmy wife and i live in council bluffs, iowa. a bluff is like a little mountain\\large hill, and we live on the top of one. we have an excellant view of the city of omaha, ne, which is just across the missouri river. saturday january 6, 2007 was the first sighting, these sightings have continued for over a month. their routine changes every week. sometimes there are two, most of the time, it is just one. they are not nor have they ever tried to hide themselves. this is a pretty long story, but several weeks ago i e-mailed the mufon nebraska head, john c. kasher, and he never got back to me. i was inquiring why the web site was not discussing\\publishing this phenomenom. i told him that i have film footage of it. in fact, i have over 6 hours of it. i would really like to have someone trustworthy analyze this footage. i can fill in all the details for you later, if you like, but the film speaks for itself. it is pretty convincing and unfortunately, the real convincing occurances, we never got on film. there have to have been scores of people in omaha who witnessed are witnessing this thing(s). my step daughter lives in omaha and she has seen it several times. please advise. thanking you in advance, joe m. fahey"],"City":"Omaha","Log Number":"US-02072007-0005","trends":["There have been 83 other sightings in Omaha","There was one other sighting in Omaha on or around January 6th 2007"],"files":["/var/www/straped/mufon/html2text/6337.html.txt","/var/www/straped/mufon/org/6337.html"],"Disposition":"IFO"}