{"Source":"MUFON","Country":"Australia","Summary":"Unseen when photographed, Unseen on original print (cropped out)","trends":["There have been 2 other sightings in Cairns","There were no other sightings in Cairns on or around March 18th 1999","This sighting has never been favorited.",""],"Date Submitted":"03/18/1999 12:00 UTC","files":["/var/www/straped/mufon/html2text/6341.html.txt","/var/www/straped/mufon/more/6341_submitter_file1__72250001.jpg","/var/www/straped/mufon/org/6341.html"],"Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Tags":"City","Weather Factors":"Unknown","City":"Cairns","Disposition":"Unresolved","Object Features":"Undisclosed","Longitude":"145.773851","Case Number":"6341","Date of the Event":"03/18/1999 12:00 UTC","Latitude":"-16.923399","Log Number":"AU-02082007-0001","map":"<A HREF = \"http://maps.google.com/maps?q=-16.923399,+145.773851(6341)&iwloc=A&hl=en\"> mufon case (6341) map </A>","divs":["Sighting DetailsFrom back of original print- view looking back toward Cairns from Normandy Island. We spent the day on a trip to the great barrier reef, had lunch on an island as part of a sight seeing trip. This was just a random picture I took to show these islands. I was using an advantix camera (aps cartridge) and the original print (4 X 12 inches) cropped the top and bottom of the image. Therefore the objects were not seen. Recently I took the cartridge to Costco to have the images (40 images) placed on an archive quality disk. This is when I discovered the objects in the picture. One in the upper left side of the picture and a faint one mid picture just where the water turns to dark blue. We were in Cairns March 17-20 so I am guessing the picture was taken the 18th or 19th. I can't say for sure what time exactly the picture was taken as it was a run of the mill picture until just a few days ago. I know that there had previously been a lot of rain and flooding and the boat had to take a slightly different route than normal to get us to the island. Further description on the back of the picture was that the 2 center islands are one joined together by a narrow strip of land with the passageway between the far right island and the left island. That is about as much as I can remember."],"Viewing Distance":"Unknown","Region":"Queensland","Object Shape":"Unknown"}