{"Log Number":"US-02082007-0006","Longitude":"-76.922461","Source":"MUFON","trends":["There have been 2 other sightings in Franklin","There were no other sightings in Franklin on or around January 23rd 2007","This sighting has never been favorited.",""],"Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/6346.html.txt","/var/www/straped/mufon/more/6346_submitter_file1__comparison.jpg","/var/www/straped/mufon/more/6346_submitter_file2__ufo2.jpg","/var/www/straped/mufon/more/6346_submitter_file3__Map.jpg","/var/www/straped/mufon/org/6346.html"],"Latitude":"36.677651","City":"Franklin","Tags":"City","Case Number":"6346","Object Flight Path":"Undisclosed","Date Submitted":"01/23/2007 07:40 UTC","Viewing Distance":"Unknown","Weather Factors":"Unknown","Country":"United States","Region":"Virginia","Sighting Duration":"00:05:00","Summary":"Three orange lights in a triangle formation","divs":["Sighting Details On Tuesday, January 23, 2007, at approximately 7:40p.m. I was driving SE with my four year old son on my way home from a friends house when I spotted what I thought at first was a planet, maybe Venus. This object was to my left in the eastern sky, and looked to be a few miles away from me--(after some research I found out that this object was most probably 2-3 miles away from my location when I first spotted it.) This object was VERY bright, and a light orange color. Even though I thought it looked awful large for a planet, I still assumed it must be since it was not twinkling like stars do. I pointed the light out to my son, and proceeded to bore him with trivia like how to tell if a star is a star or if its a planet. The object was in my view the entire time I was driving-(except short periods when trees obscured it.) A little over 2 miles up the road I had to make a left turn to head due east. I had started thinking there was something weird looking about the light so once I turned, and saw no other cars were coming, I stopped in the road to have a safer look. This was when I noticed the light was moving, and also that it was not a single light, but THREE lights! I thought to myself that it was weird for an airplane to have three large lights underneath it like that because for it to have been an airplane the two front lights would have had to have been on the end of each wing, and the third rear one on the tail, but all would have had to have been directly UNDERNEATH the object. These lights all looked to be the same distance apart and were very big looking lights, all large, all the same color, no pulsing, or color changing, and they were set in a triangle pattern--(note I stated the shape of the craft was triangular, but I am unsure of the actual shape of the craft itself--only what formation the three lights were in.) One thing that struck me as very odd as well was that the triangle formation was backwards---the two side by side lights were leading, with the 'tip' bringin up the rear. They didn't appear to be landing lights, and after later checking a map I realized the 'plane' was not coming from, or going towards the direction of the closest airport anyway, so I'm sure it wasn't landing or taking off. The object was closer to me by the time I stopped to look and was heading towards me in a diagonal path. I made no unusual note of speed, or movement--(it appeared to move slowly, but I wouldn't say notably slow, nor did I see any unusual movements that defy conventional aircraft performance.) I heard no sounds as if an airplane, or helicopter, was passing overhead, but I never actually cut my van off, so I suppose it's possible there were some sounds. This object appeared to be flying pretty low, yet was too high for me to make out any of the aircraft itself--I could only see the three lights. It's possible this may have been a normal, everyday aircraft, but I have to say that I've been driving for many years, and have been out lots of times at night, and I have seen many, MANY, airplanes, helicopters, and such in the night sky at varying distances. I've seen all kinds of colored lights on planes at night time,at different altitudes, sometimes steady, sometimes blinking and blipping around. More than a few of them have given me pause, but I always realize very quickly that it is in fact just an airplane, or some other form of 'normal' aircraft. I can't say as I've ever seen three big orange colored lights in that formation on the very bottom of an airplane like that before. Ever. To give you an idea of the distance away from me, as well as the size of these lights, it would have probably taken a nickle held out at arms length in order to have covered just one of the 3 lights. So, just when the object was about to pass overtop of me, a car ended up turning on the road behind me that I was stopped on, so I drove up to the next side road and turned on it to find a place to turn around and try to watch this thing some more. I did this in about a one minute time period, losing sight of the object as I did so. I made a left onto this side road, went a very short distance, then turned left again into a dirt path that was in front of a clearing. This put me facing straight at where I had just came from. I stopped and searched out the object, finding it easily as it made its way in the same diagonal trek, but in front and away from me this time. I sat there maybe 30 more seconds as it grew smaller in the distance, then drove home, calling the person whos house I had just left from to tell him that I thought I may have just seen a UFO--(This is the reason I am positive about the time and duration of the sighting due to my cell call log.) Don't know if this is helpful or not, but my physical coordinates around the time I first laid eyes on the object were at roughly LAT: -76.9872522354126 - LON: 36.74926092648688 and after studying a map of the area, and judging by the horizontal direction this object was flying in while it was coming towards me on Black Creek Rd--(when I realized first this thing was three lights)--I estimate that the craft was coming from the vicinity of the following coordinates; LAT: -76.96995735168457 - LON: 36.75394593241057 I wanted to add that I filed my sighting with the NUFORC the night after I saw this. I've recieved no response from them, but my report is now posted on their site. The night after I submitted to the NUFORC site, I was googling around, in search of any other possible information, or witnesses, that may have came forward about the same sighting and came across the HBCC UFO Research site owned by a very nice man by the name of Brian Vike. I filed a report with his site as well, which led to a subsequent radio interview I did for him for his weekly radio show called The Vike Report, that aired this past sunday. Since I filed my report with those two sites, I have been trying to locate any other possible reports that may pertain to what I saw. I've called my local paper here in Franklin, 'The Tidewater News', as well as contacted a lady from a bigger paper, 'The Virginian Pilot', to see if either of the papers had any reports. Both were negative. I also contacted via email one of our local news channels,WAVY TV-10, which also turned out to be a dead end. I have kept an eye and an ear out for anything pertaining to any unusual sightings made that day, or that week, but so far have found nothing. I am confused because I find it so hard to believe I was the ONLY person to see this! This is a big reason why I decided to file with your site as well--I got to thinking that with my report on these three main UFO research site, that maybe out of the three, maybe someone from my area might see my report who also saw what I did, and decide to contact one of you. I hope so, anyway. I made and am sending you two drawings I made via a computer paint program. One drawing represents pretty much the exact way I saw the object in the sky--the direction it was heading, as well as the size in relation to how it looked to me up in the sky from my van. The other represents how large the 'orange planet' appeared to me when I first spotted it by comparing it to the 'north star'--(my north star isn't meant to say thats how big the north star really is, but only to show a comparison--in other words, this is how much bigger my object was in relation to how big the north star might look.) I also am sending a map that I located online detailing exactly where I was while seeing this object. Thank you so much for your time."],"Object Shape":"Unknown","Object Features":"Undisclosed","Date of the Event":"01/23/2007 07:40 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.677651,+-76.922461(6346)&iwloc=A&hl=en\"> mufon case (6346) map </A>"}