{"Country":"United States","Weather Factors":"Unknown","Tags":"City","Latitude":"41.156446","divs":["Sighting DetailsMy husband and I went outside after dinner to smoke, as we were standing on the back deck of our home we were talking about a recent article my husband had read about all of the \"Junk\" that is floating around in space due to sattelites or whatever. I looked up at the sky towards the south and thought to myself how clear the sky was and how beautiful the stars were that night. Out of the corner of my eye I saw this strange object appear from the East. I immediately said to my husband, \"What is that?\" He then turned around and saw it also. I can only describe it as looking like a group of birds flying in a v formation. Although I am quite certain it was not birds (at least not any that I have ever seen before). It was a v or triangular shape and had no outline it just had about a dozen bird shaped objects forming a triangle. It was white almost transparent kind of like it was reflecting off of something. It was about two tree lengths high ( im horrible at judging distances) I know that birds do not fly that high! It was also extremely quiet. No noise whatsoever. It headed towards the west and then after about five to ten seconds it was gone it just dissapeared. The sky was very clear so I know that it didn't go behind a cloud. My husband and I were speachless and then the reality hit us of what we had just seen. He told me to go into the house right away. He was so alarmed by it that he went and got his shotgun out of the gun cabinent and put it beside the bed that night. Neither my husband nor I believe in ufo's or alians however, I know that what we saw Wednesday night was not normal. Believe me we have tried to explain it away. My twelve year old son is the one who encouraged me to report this. He found this website so that is the only reson I am reporting this. I have included my e-mail address please help me to \"make sense\" of this because believe me I could probably be staring an alian in the face and still be saying I dont believe in them. Hopefully there is some kind of scientific explanation for what we saw. Thank you for your time in reading this."],"Source":"MUFON","Date of the Event":"02/07/2007 09:05 UTC","Longitude":"-80.569239","Object Shape":"Triangle","Log Number":"US-02092007-0004","Object Features":"Undisclosed","Summary":"It came out of nowhere flying from East to West . It appeared to be flying in a v formation as aflock of birds might do, although birds arent shiny and white and they do not fly that high up in the sky.","Disposition":"Insufficient Data","trends":["There have been no other sightings in Hubbard","This sighting has never been favorited."],"Date Submitted":"02/07/2007 09:05 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.156446,+-80.569239(6353)&iwloc=A&hl=en\"> mufon case (6353) map </A>","City":"Hubbard","Case Number":"6353","files":["/var/www/straped/mufon/html2text/6353.html.txt","/var/www/straped/mufon/org/6353.html"],"Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Region":"Ohio"}