{"Region":"Illinois","divs":["Sighting Details It was the 4th of July, 1997 when my mother, sister and I were driving home from a department store in Fairview Heights, Illinois. Fairview Heights is only about a half hour drive from St. Louis, Missouri but on the Illinois side of the Mississippi River. We took a short cut down some country, back roads that would help us avoid the holiday traffic. Though St. Clair County is a highly populated area, it still has a little bit of farm land left. We stopped on one of the back roads to watch a fireworks display that was visable in the distance. It was being heald at a store about a mile away. We sat there for about 5 minutes watching when my mother asked me if a car was coming. I looked behind me but saw no car. This was odd because our whole car was engulfed in light. It was as if we were sitting under a street light but we were in the middle of nowhere (sort of) My mother asked me if there was a car as more of a confirmation than a question. When I confirmed that I didn't see a car either, we both looked into the corn field on the side of the road to see if someone was shining a flashlight into our car. When we saw that no one was in the field we got a little worried. (Not that some maniac in a corn field with a flash light on the 4th of July would have been a welcome sight.) No car, no maniac, we were starting to worry. Then, out of the corner of my eye I saw something both amazing and terrifying at the same time. A large blue ...something... was in the sky above us and a little to the left of us. The object was shaped sort of like a saucer with a tail. We only saw it for a brief monent. We didn't stick around long enough to see the *inside* of it, if you know what I mean. I don't know what I saw was and no matter how hard I try, I can not logically explain away the event. Not using the logic that holds with the rest of the worlds views as *logical*. Though I can't tell you what I did see, I can tell you what I did NOT see. I didn't see a plain or jet. I didn't see a helecolptor. I didn't see a commit or metior. I didn't see a satelite. I didn't see a missile. I didn't see a rocket ship, and I sure as hell didn't see a weather baloon! I must note that the next morning my mother brought home the latest edition of the St. Louis, Post Dispatch (newspaper). On the front page was a picture of the thing that we say the night before. It was seen over the St. Louis V.P. Fair at about the same time we saw it. Hundreds of people reported seeing it including the reporter who wrote the article. He contacted Scott Air Force Base that night. (A militairy instilation a few miles from where I saw the object). Scott AFB reported that they picked up nothing out of the ordinairy and that there were no strange atmosphereic phanomina that night that they were aware of. They also stated that they were not flying any aircrafts at that time (or weather baloons). I know what I saw and I know what I didn't see. You might think I am out of my mind or incapable of distinguishing between a sky scraper and a helecopter but I KNOW what I saw. It was no weather baloon either."],"Latitude":"38.592272","Source":"MUFON","Viewing Distance":"21-100 Feet, Unknown","Summary":"Blue, teardropish (blob), shaped ufo spotted in O'Fallon Illinois on the 4th of July, 1997","files":["/var/www/straped/mufon/html2text/6358.html.txt","/var/www/straped/mufon/org/6358.html"],"Object Shape":"Teardrop","Log Number":"US-02112007-0001","Country":"United States","trends":["There have been 4 other sightings in O'Fallon","There were no other sightings in O'Fallon on or around July 4th 1997"],"Disposition":"Insufficient Data","City":"O'Fallon","Weather Factors":"None","Object Features":"Unknown","Sighting Duration":"Undisclosed","Case Number":"6358","Longitude":"-89.911212","Date of the Event":"07/04/1997 10:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.592272,+-89.911212(6358)&iwloc=A&hl=en\"> mufon case (6358) map </A>","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Tags":"City","Date Submitted":"07/04/1997 10:00 UTC"}