{"Date Submitted":"01/09/2007 12:00 UTC","Object Shape":"Undisclosed","Latitude":"33.418184","Sighting Duration":"Undisclosed","Tags":"City","Object Features":"Undisclosed","divs":["Sighting DetailsDriving, heading east, saw lights in the eastern, lower sky, straight ahead of me. It seemed about 10 miles ahead of me, perhaps above the area of Gold Canyon, AZ. Lights were low in sky, and in a straight line, the far left one going out and coming back on. It did not look like anything I have ever seen before, not man-made. The lights disappeared very suddenly. My 16-year old daughter was with me and we both watched them until they disappeared. The sky was very dark at this time. There was no wavering of the lights, they were steady and in a perfectly straight line slanted downward to the right, almost a 45 degree angle. And yes, they did look very similar to the recent Phoenix Lights (early February 2007), but these were much closer and more defined and were slanted downward. Definitely not something dropped by parachute or on fire (flaring). It was stationary in the sky; no movement at all. It was exactly 6:50 p.m., definitely a Tuesday night, I think it was early January. I make this trip every Tuesday night at this exact time and my daughter and I have watched the sky and area each time. I have not seen anything like it since then."],"Date of the Event":"01/09/2007 12:00 UTC","files":["/var/www/straped/mufon/html2text/6359.html.txt","/var/www/straped/mufon/org/6359.html"],"Case Number":"6359","map":"<A HREF = \"http://maps.google.com/maps?q=33.418184,+-111.824932(6359)&iwloc=A&hl=en\"> mufon case (6359) map </A>","Disposition":"Unknown","Country":"United States","Source":"MUFON","Region":"Arizona","Longitude":"-111.824932","trends":["There have been 73 other sightings in Mesa","There were no other sightings in Mesa on or around January 9th 2007"],"Object Flight Path":"Undisclosed","Summary":"4 or 5 separate lights, in straight line, far let one blinking on and off","Weather Factors":"Unknown","City":"Mesa","Log Number":"US-02112007-0002","Viewing Distance":"Unknown"}