{"Viewing Distance":"501 Feet - 1 Mile","Latitude":"34.187899","Log Number":"US-02112007-0003","City":"Burbank","Object Features":"None","Source":"MUFON","trends":["There have been 39 other sightings in Burbank","There were 2 other sightings in Burbank on or around February 10th 2007"],"Object Shape":"Other","Country":"United States","Date Submitted":"02/10/2007 04:30 UTC","divs":["Sighting DetailsI was about to pull off to park and eat at Burbank's \"Smoke House\" restaurant just actoss the street from Warner Bros. studio. It was about 4:50 pm. While at the light, I looked out and a dark object caught my eye. By the time we parked, I had found the object again, but this time saw a second one as well. They were very high, and sat perfectly still, despite a bit of a breeze. When I got out of my car, my wife thought they were kites, but after seeing them perfectly still, it became obvious that they weren't. I looked over and there was another man looking up at them as well. He called over after he saw us looking up and said there was a second one. I said, yes I saw that one as well. The entire time we watched the event, the two objects remained a perfect distance apart from each other. Maybe 300 yards from each other. As we walked to the restaurant, we kept a close eye on the object, they didn't seem to move the entire time. We even pointed it out to another woman who was also going to the same place to eat. She too had no idea what they could be. Without anything to judge size or hight of the objects, I couln't give an exact report. My best guess, however, would have the objects the size of a car and approximetly 2000 feet up. I asked my wife today what shape she thought they were and she responded closer to a triangle than a disk shape, but I remember it more like an upside down french fry basket. It was dark and definetly had shaded areas that lead me to believe it wasn't totally smooth. It was close to a disk shape, but had demention. We didn't have time to stand there and spend the night looking into the sky, so we eventually went in to eat, leaving the objects behind. When we came out an hour and a half later, it was dark and couldn't see a thing. I'd love to know if anyone else reported the sighting. My feeling at the time was \"What The Hell Is That?\" Very curious. Thanks, Kenny"],"files":["/var/www/straped/mufon/html2text/6360.html.txt","/var/www/straped/mufon/org/6360.html"],"Region":"California","Summary":"Two objects hovering above Burbank CA that remained motionless. Very high and very still.","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Case Number":"6360","Disposition":"Unknown","Weather Factors":"None","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.187899,+-118.306366(6360)&iwloc=A&hl=en\"> mufon case (6360) map </A>","Longitude":"-118.306366","Date of the Event":"02/10/2007 04:30 UTC"}