{"Viewing Distance":"101-500 Feet","Date Submitted":"06/29/2006 12:00 UTC","Object Features":"Unknown","Country":"Canada","Object Shape":"Teardrop","divs":["sighting detailsi was driving home mid afternoon approximatly a half hour east of north bay ontario on hwy.#17. it was raining sporadically and weather was heavily overcast with fast moving low clouds. the light caught my eye from the far right of my fov. it was sillouetted against a background of trees on a hillside. as i focused my attention on the object it proceed to shoot across the sky from my farthest right,. to my farthest left so fast i could barely track it. i knew right away that i had seen a ufo because no aircraft we use can move so rapid from standstill. i remember feeling awestruck because although im not a sceptic. im a type of guy who wont believe something until i see with my own eyes. the clouds were very low {aprox. 500 ft} and the craft flew underneath the cloud cover which made it quite clear to see the shape. i pulled over on the highway in hopes to see the object but never seen it again. i noticed the car behind also slowed down and their eyes were fixed to the spot where i lost sight of the craft which i assumed they had also seen it as well. http:\\\\www.ufocasebook.com\\vancouverislandcanada.jpg im attacting this link because when i seen this picture it reminded me almost identically of what i had seen that day."],"Latitude":"46.316845","Log Number":"CA-02112007-0004","Weather Factors":"Windy, Rain, Heavy","Disposition":"Unresolved","Sighting Duration":"00:00:10","map":"<A HREF = \"http://maps.google.com/maps?q=46.316845,+-79.45676(6361)&iwloc=A&hl=en\"> mufon case (6361) map </A>","files":["/var/www/straped/mufon/html2text/6361.html.txt","/var/www/straped/mufon/more/6361_submitter_file1__ufo1.JPG","/var/www/straped/mufon/org/6361.html"],"Date of the Event":"06/29/2006 12:00 UTC","Object Flight Path":"Hovering then path","trends":["There have been 12 other sightings in North Bay","There were no other sightings in North Bay on or around June 29th 2006","This sighting has never been favorited.",""],"Case Number":"6361","Longitude":"-79.45676","Source":"MUFON","Summary":"silver reflective surface, point in the front,. larger in the back with a light at rear","City":"North Bay","Region":"Ontario","Tags":"City"}