{"Log Number":"US-02112007-0005","Case Number":"6362","Latitude":"36.857469","City":"Norfolk","Viewing Distance":"21-100 Feet","Date of the Event":"11/01/1974 06:30 UTC","divs":["Sighting DetailsMy first husband and I were picking up another couple who had an apartment on the beach, off Ocean View Ave, on the Chesapeake Bay, Norfolk, Va, about Nov. 1, 1974. (This event occurred anytime from the 1st to the 10th of Nov. I know this because we were on our way to hear Billy Graham. I checked with their organization. He had a Crusade there Nov.1-10, 1974. The 1st was a Friday, and I think that was the night we went.) We parked, went into their apt. a few minutes, then stepped outside onto the sand to leave. I happened to glance up and said, \"What's that?\". Hovering silently over the beach, where the water meets the sand, at about tree-top level was a flying object. It was round, like two saucers put rim to rim. Around the rim were white lights going around. There was a single red light on top. It was large enough to hold several people. All four of us saw it. We weren't frightened, just startled and perplexed. I was a little awestruck. We stood and watched it for quite awhile, then it started to move east down the beach very slowly. It did not change altitude. There was no sound. We hopped into the car and drove east on Ocean View Ave., which runs parallel to the beach. By looking out the window to our left, we could just see it between the buildings. We followed it until we lost sight of it,(we had stop lights) then went on to see Billy Graham. I'd say the whole event lasted 15 min. or so. We didn't report it, as Norfolk is a navy town, and we thought it might have been some experimental craft. I did check the newspapers the next day to see if anyone else saw anything, but couldn't find any information. Even though it was many years ago, I remember it vividly and I'm sure my ex-husband does too. Unfortunately, I cannot remember the name of the other couple. My husband's name at that time was Mark Lewis. He was in the navy and was stationed in Norforlk in 1973-1974, where we lived on Ocean View Ave. If you have any questions, feel free to contact me."],"Object Shape":"Circle, Disc","Sighting Duration":"00:15:00","Longitude":"-76.276963","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=36.857469,+-76.276963(6362)&iwloc=A&hl=en\"> mufon case (6362) map </A>","Summary":"saucer-shaped, white lights around rim, over beach","Object Features":"Undisclosed","trends":["There have been 24 other sightings in Norfolk","There were no other sightings in Norfolk on or around November 1st 1974"],"Disposition":"Unknown","Object Flight Path":"Hovering then path,Straight-line path","Date Submitted":"11/01/1974 06:30 UTC","Source":"MUFON","Tags":"City","files":["/var/www/straped/mufon/html2text/6362.html.txt","/var/www/straped/mufon/org/6362.html"],"Weather Factors":"None","Region":"Virginia"}