{"Country":"United States","City":"Grand Mound","files":["/var/www/straped/mufon/html2text/6372.html.txt","/var/www/straped/mufon/org/6372.html"],"Source":"MUFON","Region":"Washington","Object Shape":"Cigar","Sighting Duration":"00:05:00","Summary":"cigar shape,quite large, darkened cocpit area dark, very light gray, or white, no wings, tail, or any other stablizing apparatus.","Object Features":"Undisclosed","Tags":"City","divs":["Sighting DetailsI'll bgin with this; this same day only hours later than my sighting, our local news reported people seeing a ufo from Los Angeles, all the way to Seattle, Washington. I give you that sighting because I can't remember what time of year, or day it was. I hope you can fix a day and year to this for both of us. I work swing shift Security for DSHS Juvenile Rehab at Maple Lane Shool about 20 miles south of Olympia. I entered the office and shift change was going on with the passing of information on the days events, over to us. It's a small office, maybe 10by20. I sat in a chair next to the windows facing West, watching the clouds cover the sunset at due west. The clouds were large cumulis, some dark with moisture, and some light. My gaze was interuped with this object moving from right to left, or from Noth to South, estimating about 10 miles away. I remember looking very intently as it began to emerge from a cloud into the open in front of another cloud that was dark as a whole. At this time I got up and went outside for a more clearer look. What caught my eye, was this very dark object moving, and as I kept looking, I could see that it was part of a larger object that looked cigar shaped, and if you hold your thumb up at arms length sideways, that is about the size of this object. The leading edge or front with the cocpit, resembled a Boeing 747 but with no hump like a 747. The body did not appear to have windows of any type, and it had no wings, tails, or any stablizers. The end of the craft seemed to have the appearence of being flat, vertically, as if cut off. It was moving so slow estimating the speed at about 15 mph. I watched it for about 5 minutes as it just seemed to glide. Then I noticed that it was turning away from me headed due west into this dark cloud that was the background for this event. It turned as slow as it was traveling and appeared to seemingly pivot from left to right. It seemed to keep it's speed and disapear into that cloud as if you slowly were to put your finger into a glass of water---slowly! Iam familiar with diferent kinds of aircraft, as my brother and me have flown together for 30 years or so. He is a private pilot with all the ratings. There was no sign of propulsion of any kind, and no sound that was detectable by me. This is not my first sighting here in Washington, and California. I hope I have been of some help, and could you let me know when this may have happened. I have another sighting from last year which I will put on another e-mail. Thanks------Doug"],"Date of the Event":"08/31/2005 12:00 UTC","Longitude":"-123.012697","Log Number":"US-02132007-0002","Date Submitted":"08/31/2005 12:00 UTC","Case Number":"6372","Weather Factors":"Unknown","Latitude":"46.809985","trends":["There has been one other sighting in Grand Mound","There were no other sightings in Grand Mound on or around August 31st 2005"],"Object Flight Path":"Undisclosed","Disposition":"Unknown","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=46.809985,+-123.012697(6372)&iwloc=A&hl=en\"> mufon case (6372) map </A>"}