{"divs":["Sighting DetailsMy wife and family were driving back from a trip to Cincinatti, Ohio on February 11, 2007. We were approximately 5-10 miles north of US 35 heading North on I-71 when my wife noticed a bright object in the sky to my left which would have been towards the east. I looked out the window and saw a bright, silver type of light in the shape of egg but seemed spherical as well. My first thought was it wasn't bright enough to be an airplane but it was brighter than a star. My wife asked me what I thought it was and I realized it was not moving nor was there any blinking lights that I could see. We watched as I drove for about 2 to 3 minutes and went down a small dip in the road and it was obscured by a small grouping of trees and I looked at the road and looked back and it was gone. I mean gone. I slowed down to about 30 miles an hour and we could not spot it anywhere in the Eastern Sky. I do not have any pictures but I could draw it if asked. I was curious if anyone else reported seeing anything in this area, on this night. You can e-mail me if you have any questions. Thanks."],"Source":"MUFON","Summary":"Saw object over farm field while driving.","map":"<A HREF = \"http://maps.google.com/maps?q=39.543061,+-83.435734(6378)&iwloc=A&hl=en\"> mufon case (6378) map </A>","Disposition":"Insufficient Data","Date of the Event":"02/11/2007 12:00 UTC","Object Shape":"Egg, Sphere","Sighting Duration":"Undisclosed","Tags":"City","trends":["There have been 6 other sightings in Washington Court House","There were no other sightings in Washington Court House on or around February 11th 2007","This sighting has never been favorited.",""],"Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","Case Number":"6378","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/6378.html.txt","/var/www/straped/mufon/org/6378.html"],"Log Number":"US-02142007-0005","Date Submitted":"02/11/2007 12:00 UTC","Latitude":"39.543061","City":"Washington Court House","Longitude":"-83.435734","Region":"Ohio","Weather Factors":"Does Not Apply","Country":"United States"}