{"Date Submitted":"11/30/2004 12:00 UTC","Source":"MUFON","Longitude":"-71.531982","Case Number":"6382","Disposition":"Unknown","Object Features":"None","trends":["There have been 23 other sightings in Concord","There were no other sightings in Concord on or around November 30th 2004"],"Region":"New Hampshire","Viewing Distance":"Unknown","Object Flight Path":"Path with directional change","divs":["Sighting DetailsWitness was at the local Audubon Society walking the nature trails with his wife bird watching. It was nearing sunset when he noticed a silver, metalic object traveling across the sky \"relatively\" close to him. At first he though maybe a bird, no, it stopped and backed up. He is thinking he is looking at the side view of the object. His wife could not see it. After only a minute, the object \"faded\" into a a black dot and disappeared. This uis the first of two incidents where his wife was present and could not see the object. He only reported reaction was to the fact his wife could not see the object. After his Jan 28, 2007 sighting where his wife also could not see what he was pointing out, the wistness is very concerned if he is really seeing things or they are really there. The witness felt the second and third sightings were not important but his first was significent and would only fill out a report on the first sighting. I (investigator) has tape recording of his accounts on all three sightings."],"files":["/var/www/straped/mufon/html2text/6382.html.txt","/var/www/straped/mufon/org/6382.html"],"Object Shape":"Cigar","Weather Factors":"Unknown","Date of the Event":"11/30/2004 12:00 UTC","Log Number":"US-02142007-0009","map":"<A HREF = \"http://maps.google.com/maps?q=43.213257,+-71.531982(6382)&iwloc=A&hl=en\"> mufon case (6382) map </A>","Country":"United States","Summary":"While hiking nature trails at local Audubon Society with his wife, witness noticed silver object moving in sky, Thought maybe an airplane but it stopped backed up then continued only to fade into a black dot and disappear","Latitude":"43.213257","City":"Concord","Tags":"City","Sighting Duration":"Undisclosed"}