{"Country":"United States","Log Number":"US-02152007-0001","Disposition":"Unresolved","Latitude":"19.640556","trends":["There have been 2 other sightings in Kailua-Kona","There were no other sightings in Kailua-Kona on or around February 12th 2007"],"Longitude":"-155.995556","Sighting Duration":"Undisclosed","Object Shape":"Disc, Star-like","Tags":"City","Summary":"Very bright object seemingly hanging over the ball field, no other stars visible...","map":"<A HREF = \"http://maps.google.com/maps?q=19.640556,+-155.995556(6385)&iwloc=A&hl=en\"> mufon case (6385) map </A>","Weather Factors":"None","divs":["Sighting DetailsI was looking towards Kailua-Kona from Hualalai farms area(well above the ball field looking westlerly). I saw this bright star like object hanging over the ball field(which had the lights on, which are very bright for night time mountain ball team play)What set it apart from the backround was its intensity.There were a few stars just becoming visible but this object was orders of magnetude greater than backround. When I put the field glasses on it, I thought I saw 4 or 5 distinct lights on its base. (which could have been improper focusing). Funny thing is...Its back in approximately the same place tonight. Submitted...8:02pm Feb.14th. 2007 Paul Schreiber (808)937-0993) (c) 1)I was standing outside of my friends Home 2)What made me notice it was its intensity 3)UFO 4)It was just sitting there above the ballfield(from my vantage point) 5) I was excited, I haven't seen a UFO since being on Kauai in 1998. 6) I was spending time with my friend. I didn't observe it longer than a half an hour. It stayed motionless the entire time."],"City":"Kailua-Kona","files":["/var/www/straped/mufon/html2text/6385.html.txt","/var/www/straped/mufon/org/6385.html"],"Source":"MUFON","Date Submitted":"02/12/2007 07:20 UTC","Object Features":"Unknown","Date of the Event":"02/12/2007 07:20 UTC","Object Flight Path":"Stationary","Case Number":"6385","Region":"Hawaii","Viewing Distance":"Over One Mile"}