{"Summary":"Two star-like objects in a blue cloudless sky. One directly above the other.","map":"<A HREF = \"http://maps.google.com/maps?q=35.318728,+-82.460953(6387)&iwloc=A&hl=en\"> mufon case (6387) map </A>","Country":"United States","files":["/var/www/straped/mufon/html2text/6387.html.txt","/var/www/straped/mufon/org/6387.html"],"Case Number":"6387","Log Number":"US-02152007-0002","Date of the Event":"02/15/2007 05:35 UTC","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Object Flight Path":"Stationary","City":"Hendersonville","Sighting Duration":"Undisclosed","Longitude":"-82.460953","Date Submitted":"02/15/2007 05:35 UTC","Tags":"City","Disposition":"IFO","Object Features":"Unknown","Weather Factors":"Windy","Latitude":"35.318728","divs":["Sighting DetailsI was driving west on East 7th Avenue in Hendersonville, NC. The objects caught my eye, as they were out of the ordinary. They appeared motionless, yet were very bright, almost like super powered enormous flashlights, or star-like, yet in a bright blue sky, before sunset. They were higher than planes, maybe cloud height. One was directly above the other, the lower looking like a plumb bob. I looked at the clock in my car, and it was 5:35PM. I looked back at the objects. The sight lasted about 5 city blocks as I drove just under 20 miles per hour. Without warning or change, they vanished, no trace in the sky. I don't know how long the objects had been visible before I noticed them. I was still staring at the sky to see if they would come back, when I noticed a small plane, or helicopter, flying fromt the direction of the Asheville Airport towards the area of the sky where the objects had been. Seeing the plane removed any doubt that the objects had also perhaps been planes or helicopters. How I felt - At first I was a little scared. I wasn't in the mood to play War of the Worlds. The fear passed fairly quickly, and then I was very excited. I had never seen anything like them before. I wanted to call my husband and tell him to run outside and see them, but then they vanished, and I decided I had better pay attention to my driving."],"trends":["There have been 9 other sightings in Hendersonville","There were no other sightings in Hendersonville on or around February 15th 2007"],"Region":"North Carolina","Object Shape":"Star-like"}