{"Tags":"City","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/6388.html.txt","/var/www/straped/mufon/more/6388_submitter_file1__100_7843.JPG","/var/www/straped/mufon/more/6388_submitter_file2__100_7840.JPG","/var/www/straped/mufon/org/6388.html"],"Summary":"We spotted a bright orange pyramid (triangle) shaped object in the summer of 2000 that was huge.","Region":"Illinois","Longitude":"-89.38064","Date Submitted":"07/31/2000 12:00 UTC","Object Shape":"Triangle","Latitude":"38.343661","Country":"United States","Viewing Distance":"Unknown","divs":["Sighting DetailsI am a person who had never believed in UFO's, Martians, or little green men. I simply did not listen to or get envolved in such *rediculous* matters. These toppics were in my openion very ludacris figmants of over active imaginations. However, due to an event that occured that I hold as phenomenal and simply beyond any *reasonable* explanation I find myself so mystafied that I am contacting you about my own UFO event in my search for answers and I can't believe I'm doing it but here it goes. I was staying out at my brothers farm in Nashville, IL. for a couple of weeks helping him with some remodeling on his home and for the most part, everything was pretty normal around there. I always slept in the living room on the sofa when we were through working and eating, resting for another busy day. It was in the late summer or early fall of the year 2000. My brothers wife, Debbie worked the night shift at a local bar and grill,as a cook, in Addieville, Illinois called the Eagles Nest. She was at work when we went to bed at approximately 10:30 in the evening. We had to start working early the next morning so naturally, we were NOT drinking. I was in a very deep sleep when Debbie came home from work in an excited state. She turned the light on and hollered in at me to get up because there was something outside that she wanted me to see. From there she went into my brother, Ricks room and told him the same thing except she mentioned to him that there was something in the sky and she didn't know what it was. She told him she thought it was a UFO. On hearing this I rolled back over to go to sleep but still awake, I heard them walk out the kitchen door and could hear them talking about the color, shape, and size of what they were seeing. When they noticed that I hadn't come outside, my brother Rick came in just as excited as Debbie with Debbie at his side telling me that I had to get up and see this UFO. In response I said, \"I do NOT believe in that UFO crap so leave me alone we have to work in the morning and I'm not working tired\", but Debbie looked at me and simply said \"Have I ever lyed to you before and why would I lye about this\". I said \"No\" as they walked outside to view it again and that got my attention. She wouldn't lye about this and neither would my brother. So that they would leave me alone and I could sleep again, I figured that I would take a look at what they were talking about. As I walked from the front room through the kitchen and walked toward the door which was open, I saw something that woke me up immediately. I was officially curious and sleep was the furthest thing from my mind. I walked out the door to where they were with my eyes trained on the object and said nothing as they continued to talk. I felt like I was in shock and I could not believe what I was seeing because I didn't believe in such events. A few minutes went by and still in shock, I hadn't said anything. About that time Debbie asked me what I thought it was and instantly my mezmerising shock was broken. I turned and looked to my brother and said, \"Ok, Rick, tell me about it and somebody wake me up\". He told me, \"Believe it or not, I think we are seeing something extrordinairy. I can not explain it except that we must be viewing a UFO\". In response I said to him \"Is it possible for the Government or the Militairy to be able to have something so enormous like that?\". In answer,as it stood hovering in silence, he said, \"Look at the size of that thing and the shape and color and how far away it is and how huge it is. It would be impossible for anyone to be able to construct something so big and brilliant.\" Description: It was a enormous pyramid shaped object that looked like it was hovering above the tree lines but I knew it was a greater distance away. It was a brilliant, bright orange with no glare or halo. This object did not appear to be moving. As I looked at it, I was looking for imperfections in the objects shape but it appeared perfect. There was no distortion or fuzzyness. I knew that it wasn't the moon with some sort of gasses because the moon was to the right and the sky was extrordinairily clear that morning. I seen nothing that appeared to be rivits or any sort of writing or print. There were no sort of man made features visable. It was not of any oregion that I have ever seen or known in my life time. As my trade, I do professional, custom, autobody work, work with many materials and I know about the surface of objects, yet, this was like nothing that I had ever come in contact with and I have no idea what it was made of. It was not an aircraft or giant, orange, glowing, pyramid shaped weather baloon. Time seemed like it flew by as we observed it. We could tell that the object though appearing to stand still, was actually moving slowly away from us because it began to get smaller as we watched. Debbie said, \"Why don't we get our video camera and film it.\", so we all went back inside to get the camera and while we were inside, Rick started calling people telling them to look and see if they could see it from where they were and told them to call him back. It wasn't long before the phone started ringing off the hook by a lot of people who others had called to confirm the object. Several people came over and some even in their pj's. A few broutht their own video cameras. It was a short time after that before it was almost invisable even from camera view. It was about 30 to 35 minutes from the time I first saw it to the time it was gone from site. Debbie and Sally made coffee for everyone who saw it because we all knew after such an event we would not be sleeping any time soon. The next day: Some people came by the next day who did not show up durring the event and said they did in fact view it as it happened but because of relative positions in the community they did not want to be mentioned. They were afraid that claiming to have seen such an event would stain their name and hurt their position in the community although they too witnessed it and were dumbfounded by it. Debbie was called into work at approximately 11am in the morning. Although she was tired she decided to go. Someone had called in sick. My brother and I were awake and working in the house and had been awake a short time. Rick was in the bathroom working on the shower and I was in the front room working on some trim. I had the TV on scanning the news to see if the news knew anything about the event. To my amazement, it was all over the news because people everywhere were calling in including police officers, medical staff and people from every background even people in 5 other nations. Scott AFB was tracking the object and confirmed that it wasn't *ours* and no other nation claimed it. The news said that the UFO society would be contacted about the issue (It might have been you guys) and after that I never heard any more about it but would like to know what it was that we saw if possible. My brother and I speak about it periodicaly with friends. After this, I don't know what to believe. Since the event my e-mail is Planetmeister@yahoo.com, sort of as an inside joke to those of us who saw it. Thank you for letting me tell my story. If you have any questions please contact me. I would be glad to help. P.S. WHO'S OUT THERE??? Respectfully, Planetmeister"],"trends":["There have been no other sightings in Nashville","This sighting has never been favorited."],"Log Number":"US-02152007-0003","Sighting Duration":"Undisclosed","Object Features":"None","Case Number":"6388","Date of the Event":"07/31/2000 12:00 UTC","City":"Nashville","map":"<A HREF = \"http://maps.google.com/maps?q=38.343661,+-89.38064(6388)&iwloc=A&hl=en\"> mufon case (6388) map </A>","Weather Factors":"None","Source":"MUFON","Object Flight Path":"Stationary"}