{"City":"Fredericktown","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/6390.html.txt","/var/www/straped/mufon/org/6390.html"],"Date Submitted":"02/15/2007 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.559775,+-90.294007(6390)&iwloc=A&hl=en\"> mufon case (6390) map </A>","Object Features":"Unknown","divs":["Sighting DetailsI first spotted it getting onto Madison 401 coming off of E highway. It seemed to follow along beside my car so I stopped the car and turned the radio off and had my son in the passenger side roll down the window so we could see if we could here anything. It was definetly not a plane or a helicopter it made like a humming sound and that is when we seen it shoot a red beam of light down towards the ground. We watched it for about ten minutes and then I told my son lets see if it follows us home. So we continue down 401 leaving it behind us and then we went around a curve and there it was in front of us to the right side of the road. It wasnt as low as it had been but it was still very bright and how it got ahead of us without us seeing it was weird. So we continue down 401 to C highway and we could see it the whole time and the closer we got to home the closer it was and follow us home it did,it beat us home when we pulled into the driveway it was hovering above the neighbors house, where it stayed stationary for about 45 minutes and then it was gone."],"Region":"Missouri","trends":["There has been one other sighting in Fredericktown","There were no other sightings in Fredericktown on or around February 15th 2007"],"Log Number":"US-02162007-0001","Summary":"much brighter than a star with a purplish glow around it that shot red beams down towards the ground","Date of the Event":"02/15/2007 12:00 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","Longitude":"-90.294007","Latitude":"37.559775","Object Shape":"Star-like","Country":"United States","Source":"MUFON","Disposition":"Unknown","Case Number":"6390","Object Flight Path":"Stationary,Hovering then path,Path with directional change"}