{"Log Number":"US-02172007-0003","Case Number":"6397","Country":"United States","Sighting Duration":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/6397.html.txt","/var/www/straped/mufon/org/6397.html"],"Longitude":"-120.945245","Latitude":"41.19378","Disposition":"Insufficient Data","divs":["Sighting DetailsI was driving home one night from a neighboring town, and just outside of a town called Adin, in Northern California, I seen this object that was very brillant white, that was flying in one direction than without hesitation start traveling in a 180 degree opposite direction. When I first seen the object I thought it was a falling star, due to the brillant white color; however I have never seen falling stars change their course of flight. I pulled to the side of the road and continued watching this object fly all around the sky, when it reached an altitude of, I am guessing, 2500 feet it put off this extremely bright white light that made me see spots for about 5 minutes. After I stopped seeing spots I never saw the object again. After this bright light made me see spots, I asked myself to try and justify in my mind what I had just witnessed, through all my rational thought processes I couldn't come up with a logical explanation. Most would say that it was a star that had just burned out and I witnessed it; however the flight pattern prior to the bright light would destroy all theories of physics as we now. I have not had a chance to talk about this event in many years, but I can say with confidence now that indeed it was something not of this plant. Saying I saw a UFO sounds cliche, but I really think that that was indeed what it was."],"Object Shape":"Diamond","Date of the Event":"07/11/1993 11:30 UTC","trends":["There have been no other sightings in Adin","This sighting has never been favorited."],"Region":"California","Source":"MUFON","Object Flight Path":"Path with directional change","Summary":"Seen a diamond shaped object fly in odd directions and engage in odd turn arounds.","map":"<A HREF = \"http://maps.google.com/maps?q=41.19378,+-120.945245(6397)&iwloc=A&hl=en\"> mufon case (6397) map </A>","City":"Adin","Date Submitted":"07/11/1993 11:30 UTC","Weather Factors":"Unknown","Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile"}