{"Longitude":"-97.878391","Date of the Event":"07/31/1965 12:00 UTC","trends":["There have been 3 other sightings in Enid","There were no other sightings in Enid on or around July 31st 1965"],"Log Number":"US-02172007-0004","Weather Factors":"Unknown","Object Shape":"Disc, Sphere","City":"Enid","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Latitude":"36.395589","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=36.395589,+-97.878391(6398)&iwloc=A&hl=en\"> mufon case (6398) map </A>","Viewing Distance":"Over One Mile","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Region":"Oklahoma","Summary":"several round objects/v formation/traveling high rate of speed across sky, stopped them accelerated immediately","Date Submitted":"07/31/1965 12:00 UTC","files":["/var/www/straped/mufon/html2text/6398.html.txt","/var/www/straped/mufon/org/6398.html"],"Case Number":"6398","Object Features":"Unknown","divs":["Sighting DetailsMy friend and I were laying in lawn chairs on a patio, looking up at the sky and talking when we observed several disc shaped objects in a V formation flying from west to east at a very high rate of speed. We didn't know what they were, but we knew they were moving too fast to be aircraft. Their altitude was very high. They looked like lights as if stars in a formation. Seconds later the objects appeared again flying at a high rate of speed flying from the east to the west. Just a few seconds later they appeared flying from the south, when they got directly overhead they came to a complete stop. One lone object coming from the south joined up with the formation and the entire formation continued northward at a very high rate of speed, and disappeared from sight. My friend and I were very excited, but not really scared. We knew we'd seen true UFO's. This was north of Vance Air Force Base in Enid, Oklahoma. To my knowledge, nothing ever appeared in local newspapers. Just a few years ago, I spoke with a lady who had lived in Enid, OK about the same time whose kids had seen something similar. My friend and I were just teenagers at the time and because of our ages weren't taken seriously. I've been wanting to tell this story for some time. Thanks!"],"Country":"United States","Source":"MUFON"}