{"Longitude":"-0.184828","divs":["sighting detailsi belive i saw a \"black triangle\" flying ajacent to the airport on friday 22\\12\\06. i was meeting my wife from the railway terminus as we live close by thia would be about 6pm. at the time the airport was actually closed to traffic for 3 days due to fog affecting the sounthern half of the uk, it would be the following day before resuming normal operations. while walking to the airport i have a clear view of the flight path,needless to say when saw white \"lights\" approaching the runway my interest was immediate, the next aspect of the sighting was that rather follwing the normal decent path the \"aircraft\" was actually flying horizontal to the ground,and i would say at about 500-1000 ft in height, next there was no sound at all, and the landing lights were all \"wrong\" what i mean is they were more like disco strip lights in arranged in linear formation i.e horizontal and moving as i saw it, in the direction of travel i.e left to right and in sequence, that's when i started to feel very eerie. the craft passed in front of me and by which time it would have been just over the landing apron and then it \"vanished\" or perhaps quite literelly someone switched had the \"lights\" out ..."],"Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Fog","trends":["There have been 3 other sightings in Crawley","There were no other sightings in Crawley on or around December 22nd 2006"],"Object Flight Path":"Straight-line path","Country":"United Kingdom","Summary":"possible ufo sighting at major uk airport (when closed due to fog)","Object Shape":"Triangle, Other, Unknown","Object Features":"Other","Case Number":"6406","City":"Crawley","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=51.15183,+-0.184828(6406)&iwloc=A&hl=en\"> mufon case (6406) map </A>","Latitude":"51.15183","files":["/var/www/straped/mufon/html2text/6406.html.txt","/var/www/straped/mufon/org/6406.html"],"Region":"","Log Number":"GB-02182007-0005","Date of the Event":"12/22/2006 06:10 UTC","Disposition":"Unresolved","Date Submitted":"12/22/2006 06:10 UTC","Source":"MUFON","Sighting Duration":"Undisclosed"}