{"Case Number":"6409","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 2 other sightings in St John's","There were no other sightings in St John's on or around March 14th 1979"],"Object Features":"Unknown","Date of the Event":"03/14/1979 12:00 UTC","Object Shape":"Fireball, Sphere, Other","Country":"Canada","files":["/var/www/straped/mufon/html2text/6409.html.txt","/var/www/straped/mufon/org/6409.html"],"Disposition":"Unresolved","Object Flight Path":"Path with directional change,Path then hovering","Latitude":"47.560541","Log Number":"VI-02192007-0002","Tags":"City","Longitude":"-52.712832","Summary":"Red pulsating ball came out of cloud , 6-8 white balls circled and shot redish white rays down out of view","City":"St John's","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=47.560541,+-52.712832(6409)&iwloc=A&hl=en\"> mufon case (6409) map </A>","divs":["Sighting DetailsIn 1979 I was honeymooning in the Virgin Islands, specifically a place called Secret Harbor on St. Thomas. My wife and I were sitting on the beach around midnight and three strange clouds came floating in from our right. My wife spotted them first and brought them to my attention. Something about these clouds was different, they didn't look like normal clouds. The first cloud started flashing and lighting up, and I could see something was inside it. All of a sudden this big red pulsationg and revolving bright ball came floating out of the first cloud; the ball started getting brighter and pulsating and then 6-8 smaller bright white balls started circling around the red one and gave the appearance of an atom. Suddenly the little white balls begain to circle much faster and the whole object shot down what looked like reddish white rays down and out of sight. This lasted about 5 minutes. We heard no noise at all though-out this entire episode. I could not see where the rays or what-ever hit because we in a cove and could not see around the small mountain to our right. After that this atom looking thing went back into the cloud and all three \"clouds\" just slowly floated away. This whole episode lasted 10-15 minutes. Like I said we never heard a sound except for our hearts pounding. We were frightened and felt enlightened at the same time. We both knew immediately something very strange had happened. I always have the feeling that if I went back I could find something. Sine then we have been extreamly interested to know what it was we saw. I read and watch anything having to do with UFOs and USOs and the paranormal. That sighting changed my life forever. I know that something is going on and I want to know what it is."],"Date Submitted":"03/14/1979 12:00 UTC","Region":"Newfoundland and Labrador","Weather Factors":"Unknown","Sighting Duration":"Undisclosed"}