{"Country":"United States","Sighting Duration":"Undisclosed","trends":["There have been 3 other sightings in Geneseo","There were no other sightings in Geneseo on or around"],"Log Number":"US-02192007-0004","Summary":"Looking up at the stars I saw a light among the stars that went lightning speed and stopped on a dime, changed direction and went same distance and stopped, changed again and ended back where it started forming a triangle.","Object Flight Path":"Path with directional change","City":"Geneseo","Date of the Event":"Unknown","Disposition":"Unresolved","Object Features":"Unknown","Date Submitted":"02/19/2007 01:04 UTC","divs":["Sighting Details I was camping with some friends at Letchworth State Park an hour east of Buffalo NY.I can't remember the exact year but it was between 1987 and 1989 because my son was only a few years old. It was near the end of July and we were sitting around a camp fire around midnight.I was laying back in my chair and gazing at the stars when I saw this light up in the stars move at lightning speed and travel a long distance and stop.Just as fast as it stopped it changed diections and went almost the same distance and stopped.As fast as it stopped it changed direction again and went almost the same distance ending up where it started from making the shape of a triangle.The light then disappeared. The whole thing lasted maybe 5 seconds.I sat up in my chair asking if anyone had seen what I just saw.I explained to them what I saw and they all just laughed and said I was drinking to much.I kind of let the incident go until I was watching a UFO program on the History Channel about 2 years ago.It showed a video from the cargo bay of the space shuttle and showed a light that traveled at a high rate of speed,stopped and changed direction and stop and change direction again to form the shape of a triangle. I almost fell out of my chair. That video from the shuttle is exactly the same thing I saw in late July in the later part of the 1980's. I didn't know what it was because it was so far away.I have never seen anything move that fast,stop and change direction,stop change direction as that light did on that night in July.The year was approximately 1987-1990"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.800026,+-77.814547(6411)&iwloc=A&hl=en\"> mufon case (6411) map </A>","Object Shape":"Circle","Latitude":"42.800026","Weather Factors":"Unknown","Region":"New York","Case Number":"6411","Tags":"City","files":["/var/www/straped/mufon/html2text/6411.html.txt","/var/www/straped/mufon/org/6411.html"],"Longitude":"-77.814547","Viewing Distance":"Over One Mile"}