{"City":"Grand Mound","Disposition":"Unknown","Date Submitted":"02/19/2007 02:34 UTC","Source":"MUFON","Log Number":"US-02192007-0006","Summary":"two huge round lights moving together in a snake like movement back and forth over I-5 North bound","Date of the Event":"Unknown","trends":["There has been one other sighting in Grand Mound","There were no other sightings in Grand Mound on or around"],"Longitude":"-123.008867","Weather Factors":"Unknown","Sighting Duration":"00:02:00","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/6413.html.txt","/var/www/straped/mufon/org/6413.html"],"Viewing Distance":"Unknown","Tags":"City","Region":"Washington","Case Number":"6413","divs":["Sighting DetailsI entered I-5 Northbound at Grand Mound leaving my work, and had traveled North to the Maytown exit. As I passed the exit doing about 70mph,you will encounter a small hill as your driving. As soon as I started up the hill I noticed a bright light shining through the sun roof, the inside cover was open. I looked up and saw two bright round lights moving in a snake like movement from one side of I-5 to the other and back again, repeating this all the way up I-5. The lights moved as an ice skater would propell ones self, pushing and falling off and repeating. The lights never crossed one another. If it was on the East side of I-5 the left light would cross first, then the right light would follow, and then the right would cross over, and the left would follow. I slowed my vehicle to about 60mph in the #2 lane to better watch this event. Traffic was very light at this time as I don't remember any one passing me. I rolled down my window but could not hear any sounds coming from the lights. As I got to the top of the hill I could see the lights of the Olympia area ahead of me. When the lights seemed to be over the Olympia area, they looked to be between 1000 and 500ft above the city and then disapeared over that horizon. There was no other shape to the lights that could be seen. It could be that sometimes a light will loom large from it's sorce, but in fact the sorce is small. In any case, I could not see the sorce of the lights, other than they just seemed to be two huge balls of light, flying independently of each other. When over the city lights, you could see that they were seperate entities because of the light that shown between them. If you need any other info do not hesitate to contact me.-------Thanks Doug"],"Country":"United States","Latitude":"46.812475","map":"<A HREF = \"http://maps.google.com/maps?q=46.812475,+-123.008867(6413)&iwloc=A&hl=en\"> mufon case (6413) map </A>","Object Flight Path":"Other","Object Features":"Undisclosed"}