{"map":"<A HREF = \"http://maps.google.com/maps?q=42.365486,+-88.077862(6416)&iwloc=A&hl=en\"> mufon case (6416) map </A>","Object Shape":"Star-like","Summary":"multiple sightnings of a large star huvering seeming to move slowly but then darting a long distance in a matter of seconds","City":"roundlake","Latitude":"42.365486","Tags":"City","Disposition":"Unknown","divs":["Sighting DetailsI was in my car driving home from my boyfriends house i was driving south down fairfield road near roundlake, il. i first noticed the object because it was directly ahead of me and lloked as thought it was a plane flying but all i saw was one bright light i looked closer and it was flickering like a star and very bright, it was a orangish color and it was hovering and then suddenly it dARTED OFF TO THE LEFT AND IT SEEMED TO travel a long distance in just a matter of seconds and then in the amout of time it took it to get to that destination it had arrived back where it started it continued to do this several more times. at a certain point it was doing circles in the sky. i continued watching it my entire way home to lake zurich, il. It seemed like it was following the same route as me just traveling a distance ahead of me. when i reached my neighborhood it was circling the houses and coming closer and closer to the houses. then i ran inside to tell my mom, she came out to look and it was far ahead in the distance and barely in vissability. during all of this i was very intrigued, at first i was confused trying to figure out what it was for a while i thought it was a plane in distress, but as it got closer to the ground i could tell it was not a plane at all. that is when i became startled, i was convinced something was not right and that could very well be a ufo. i have seen this object a handful of times since then driving down the same road. but i usually lose sight of it before i reach the lake zurich area."],"Object Features":"Undisclosed","Date Submitted":"01/10/2007 12:00 UTC","Object Flight Path":"Hovering then path","Date of the Event":"01/10/2007 12:00 UTC","Country":"United States","Sighting Duration":"Undisclosed","Source":"MUFON","Log Number":"US-02202007-0001","trends":["There have been no other sightings in roundlake","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/6416.html.txt","/var/www/straped/mufon/org/6416.html"],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Region":"Illinois","Longitude":"-88.077862","Case Number":"6416","Weather Factors":"Unknown"}