{"Object Features":"Wings","Object Flight Path":"Straight-line path","Country":"United States","Log Number":"US-02202007-0003","Region":"Illinois","Weather Factors":"None","City":"Glendale Heights","divs":["Sighting DetailsThis event happened in 1977 I believe I was 12 years old at the time. It was the 3rd week of March or 2nd or 3rd week of April or maybe even into May. Between 4:05P.M. and 4:25 P.M.It was not cold out maybe 68-75 degrees, comfortable warm and sunny. I was just a kid flying my kite. In the distant horizon I saw what appeared to be a U.F.O. It was a dull red in color and twice the size of a airplane, it looked like Saturn a ball with a ring around it. It was traveling from North to South I was facing East. It was traveling 2 or 3 times as fast as a airplane. I was located about an 8th of a mile just East of Glen Ellen Road perpendicular to Armitage Avenue in Glendale Height, IL. I was in awe and speechless when I first laid my eyes upon it. I then turn to the girl I was flying my kite and said look do you see it, she looked but did not see it at first, then she was in awe and disbelief, I looked back to see it dissappear out of site. I then handed her my kite and ran up to were the Glendale Heights pool was at the time. I called the police. I was excited when I made the call, running up there to use the phone I thought they would not believe me and that I might be wasting my time or even riduculed. We did not have 911 then so I called the operator and asked for the Glendale Heights Police. I was connected right away. The lady dispatcher could tell I was upset. Instead of ridiculing me, her first question to me was what direction it it heading in. I told her North Avenue, she took me seriously and wanted to know what it looked like and I told her so. I dispacher could tell I was upset, after getting off the phone I went and got my kite nd ran home to tell the family what it is a saw. Please contact me with any questions. Did any one aroung my town see this as well? Just curious. Sure wish I had a copy of the tape so I could hear the police report Thank You Tim"],"Disposition":"Unknown","Date Submitted":"03/28/1977 12:00 UTC","Latitude":"41.92881","Tags":"City","Case Number":"6418","Viewing Distance":"Over One Mile","Longitude":"-88.070899","Summary":"Looked like Saturn, all same color dull red, a ball with a ring around it.","files":["/var/www/straped/mufon/html2text/6418.html.txt","/var/www/straped/mufon/org/6418.html"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.92881,+-88.070899(6418)&iwloc=A&hl=en\"> mufon case (6418) map </A>","Object Shape":"Circle, Saturn-like, Sphere","trends":["There have been 2 other sightings in Glendale Heights","There were no other sightings in Glendale Heights on or around March 28th 1977"],"Sighting Duration":"Undisclosed","Date of the Event":"03/28/1977 12:00 UTC"}