{"Source":"MUFON","Log Number":"PH-02202007-0004","City":"Quezon City","Longitude":"121.0437","Object Shape":"Unknown","Region":"Metro Manila","Object Flight Path":"Stationary","Case Number":"6419","Country":"Philippines","divs":["Sighting DetailsI was driving down the street close to my home in a large subdivision in central Quezon City. There appeared to be a bright yellow light about 20 degreEs above the horizon. My eyesight is not real good as my contact lens are not new and my sight is pretty weird at times at night as my eyes are burning from the high amount of polution here. I went inside the house to see if I had a camera in the house so I could maybe get some pictures. My luck was not good as no camera was there. My sister-in-law went outside with me as her curosity was awaken by my stories I told her about the new flap of UFO sightings AROUND the world. She discribed the lights to me and said it seemed to be moving back towards our house but it did not come toward us. I asked the intent like Art Bell was talking about Sat Nights show. I asked the object to come back to our area but it did not. Ws watched it move slowely away and it apperared to be blocked by the trees in our area. The lights wer very unusual as they stayed in the same location for over 20 minutes. The primary color was yellow and there was a red light flashing and she said there appaered to have some rotating lights at times. I checked to see if this was the International Space Station and we are not in the pattern now. I saw the Space station about 3 years ago and I thought it was a UFO. But this was not a helocopter or a aircraft. I estimate the lights were maybe 3 to 4 miles away as a minimum. AS WE VEIWED THE LIGHTS A MERORITE CAME RIGHT NEAR THIS AREA AND WE WAS THINKING THIS WAS A SIGN OF SOME KIND FROM THESE CRAFT OCCUPANTS MAYBE."],"Sighting Duration":"Undisclosed","Summary":"Yellow light that also had a red blinking light. very unusual and it appeared there was blinking or rotating lghts at times.","Date Submitted":"02/19/2007 06:00 UTC","trends":["There have been 9 other sightings in Quezon City","There were no other sightings in Quezon City on or around February 19th 2007"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=14.676041,+121.0437(6419)&iwloc=A&hl=en\"> mufon case (6419) map </A>","Object Features":"Unknown","Viewing Distance":"Over One Mile","Date of the Event":"02/19/2007 06:00 UTC","files":["/var/www/straped/mufon/html2text/6419.html.txt","/var/www/straped/mufon/org/6419.html"],"Disposition":"Unresolved","Latitude":"14.676041","Tags":"City"}