{"City":"Las Vegas","Latitude":"36.118546","Longitude":"-115.166706","map":"<A HREF = \"http://maps.google.com/maps?q=36.118546,+-115.166706(6425)&iwloc=A&hl=en\"> mufon case (6425) map </A>","Weather Factors":"Unknown","Date Submitted":"02/15/2007 05:45 UTC","Region":"Nevada","Viewing Distance":"Over One Mile","Source":"MUFON","Tags":"City","Case Number":"6425","Disposition":"IFO","Sighting Duration":"Undisclosed","Object Shape":"Triangle","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around February 15th 2007"],"Summary":"two clusters of flying objects in a v formation, first cluster w/ about 20, second group had about 6.","files":["/var/www/straped/mufon/html2text/6425.html.txt","/var/www/straped/mufon/org/6425.html"],"Object Flight Path":"Undisclosed","Country":"United States","Date of the Event":"02/15/2007 05:45 UTC","divs":["Sighting DetailsI was driving home from work and saw a cluster of flying objects traveling from west to east. The sun was down, yet the sky was not black yet. The objects were black and did not have lights. There were two clusters in a v formation. The objests were staggered somewhat, not like a perfect v, almost like birds, but they were not birds. They were too big and flying too fast to be birds. It was clearly a group of aircraft. Nellis Air Force base is close and I see F15's often. I would have assumed thats what I was seeing, but there were way too many and they were too close to each other. The first group had probably twenty and the second had about six. They were triangular in shape and flew in the direction of the pointed side like a jet or something. They were right above Sheep Mountain at about 10,ooo feet to the north of the Las Vegas valley. I was traveling north on Jones and saw them ahead of me. It was very earie and scared me to see the number of objects. I almost wanted to stop the car a get out and point. I looked around to see if anyone else was seeing it and it didn't seem so. I picked up my cell phone to call a non emergency number because I was so shaken and my phone rang. On the phone was a friend who lives nerby. The objects were gone by this time because the whole thing was less than 30 seconds. Roughly 10 minutes later when I was home and still on the phone I heard a military jet and mentioned it to my friend and she said \"yeah, I can hear it too.\" I then asked her if she heard anything when she called me and I told her what I saw and she said \"no.\" The jets you can hear and see for miles. The objects I saw had no sound and disappeared out of nowhere. I was not able to watch them for a distance like the military jets. The staggered v formation flew from west to east and disappeared out of nowhere. The smaller formationed followed and did the same. There were no lights, there was no sound. I tried to figure out if it could be anything else at all. Clearly they weren't birds. They flew too high, too fast, and were too big. That many military jets would have been extremly loud, not to mention they were too close to each other. The jets usually fly in a straight line and I have never seen more than a hand full. This was a cluster of flying objects. I am not crazy, I was not under the influence of anything, and I am curious if anyone else saw this event."],"Object Features":"Wings","Log Number":"US-02202007-0010"}