{"Case Number":"6433","Region":"Minnesota","Tags":"City","divs":["Sighting DetailsIt was a clear night and there were quite a few visible stars here in rural northern Minnesota. I was out with my dogs when I heard a military jet. Because of my rural upbringing, I still look up every time I hear a plane and since I'm 46 yrs old, I've seen a lot of different planes. I know by sound what type of plane is flying over before I see it. I live in the flight path between Duluth Int'l Airport and the Minot North Dakota air base so there is a fair amount of air traffic over my town, though most of it is pretty high in the sky. I could tell by the sound and the flight path that it was a military jet of some type and since it was about the time that there was talk of deploying more troops to Iraq, I'd been seeing and hearing military jets fly over more frequently (for what ever reason). I looked up in time to see the jet and at the same time, a small red light came from another direction, almost perpendicular to the path of the jet. The red light was the same size as the satellites that I see, so I couldn't see a definite shape. I have watched the sky all my life and know the difference between stars, satellites, and meteors, and this was like none of those. I've even seen some meteors that were quite spectacular, including a double one that was bright green, which I knew it wasn't a UFO sighting. The red light turned and followed the same flight path of the jet. I shoved the dogs inside and yelled for my husband, who had to bolt up a flight of stairs to get outside where I was, and he agreed it was nothing like he'd ever seen before, either. We watched it until it was out of sight on the horizon. The jet wasn't low in the sky, but a lot lower than passenger planes that fly over this area, and even at night it was unmistakable. The red light kept pace with the jet the entire time. I just kept on wondering what the heck it could be and tried to think of a rational explanation. I guess it was unidentified, it was flying, and all I can say is that I know what it \"wasn't\". Even if I'd had a camera on me at the time, it wouldn't have photographed well, unfortunately."],"Summary":"Red light pacing a military jet","Date of the Event":"01/21/2007 06:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=47.294207,+-93.40228(6433)&iwloc=A&hl=en\"> mufon case (6433) map </A>","Object Features":"Unknown","Country":"United States","Source":"MUFON","Log Number":"US-02212007-0005","Weather Factors":"Does Not Apply","Date Submitted":"01/21/2007 06:30 UTC","Disposition":"Unknown","Latitude":"47.294207","files":["/var/www/straped/mufon/html2text/6433.html.txt","/var/www/straped/mufon/org/6433.html"],"Object Flight Path":"Path with directional change","Longitude":"-93.40228","City":"Bovey","Sighting Duration":"Undisclosed","Viewing Distance":"Over 1 Mile, Unknown","Object Shape":"Other, Unknown","trends":["There has been one other sighting in Bovey","There were no other sightings in Bovey on or around January 21st 2007"]}