{"divs":["Sighting DetailsHave you received any reports of a large plane (or other object?) passing over our skies @ about 1:10 a.m.Thursday morning of February 22? I certainly saw something, raced up to tell my brother, and he saw it as well. I was peeking my head out our window to see if Sirius had set yet and to see Saturn, when I noticed what looked like two stars of equal magnitude that I didn't recognize (not that I'm knowledgeable enough to notice something out of place...it just looked odd). They were moving though (from southwest to northeast), so I thought plane...which would be nothing out of the ordinary, they are always overhead, blinking away. These really weren't blinking...and the lights were way too far apart to be from the same plane. it passed overhead slowly, couldn't have been extremely high in the sky, on account of the wingspan covering a wide field of the sky. There was a noise similar to the kind of noise you get as a large plane many thousands of feet in the sky passes overhead (you know, you see it and the sound is slower, so it appears that the sound of it is trailing behind)(it was very low in pitch, could be easily heard from indoors, and spooked a few of the local animals, including a cow...which I didn't know lived so close to us:). I could not make out a shape of the object, just its lights...three of them two on the outside being a very light orange with the third being grayish but not centered in between the two on the outside. They weren't crisply flickering, I'm not even sure you could say they flickered at all. I wasn't sure who to contact, I looked in the phone book under Evansville Regional Airport, but the numbers were for parking employees, Security office...none of them seemed like the right contact for this type of question. Anyways, I just wondered if anyone else had seen it and reported of it, or if there was some kind of way you might forward this to anybody who would be interested or aware of what was flying overhead during that time. I am an amateur stargazer, have seen planes, planets, meteors all the like; but this was quite unusual and worth my trouble to email you, and hopefully I wasn't to much trouble for you to hear out. Thanks, Phil Schmitt"],"Object Features":"Unknown","Weather Factors":"Unknown","Object Shape":"Square, Rectagular, Unknown","Tags":"City","Latitude":"37.977079","Viewing Distance":"501 Feet - 1 Mile","City":"Evansville","Longitude":"-87.56127","Source":"MUFON","Region":"Indiana","Sighting Duration":"Undisclosed","Summary":"Amateur astronomer with witness views LARGE unknown object passing over Evansville Indiana","Log Number":"US-02222007-0002","Object Flight Path":"Straight-line path","Date Submitted":"02/22/2007 01:10 UTC","Date of the Event":"02/22/2007 01:10 UTC","files":["/var/www/straped/mufon/html2text/6436.html.txt","/var/www/straped/mufon/org/6436.html"],"trends":["There have been 27 other sightings in Evansville","There were no other sightings in Evansville on or around February 22nd 2007"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.977079,+-87.56127(6436)&iwloc=A&hl=en\"> mufon case (6436) map </A>","Case Number":"6436","Disposition":"Insufficient Data","Country":"United States"}