{"divs":["Sighting DetailsI was at work, standing outside, looking towards the mountain (Sandia Peak in Albuquerque, looking East). It was cloudy that day, But the clouds were above the mountain tops. I noticed 3 round objects just below the cloud cover. I thought they were balloons. As I watched them, they just hung there. They did not move at all. I grabbed my boss, and showed the objects to her. We just stared for a few minutes. She was pretty freaked out. Enough that she went into the office. I just stared. I felt the objects were looking at ME. I was thinking this when they seperated from each other, made a triangle in the sky, spun around each other and just sat there. They rotated around each other again (in the triangle form) and just shot up into the clouds. I still to this day remember this event. I still believe these objects knew that I was watching. This was no airplane, no light reflecting off Uranus. This was grade A weird stuff. I have since moved to Nebraska, but I still look for my 3 little pals. Please let me know if anyone else has seen these objects. David Howard"],"Case Number":"6446","Tags":"City","files":["/var/www/straped/mufon/html2text/6446.html.txt","/var/www/straped/mufon/org/6446.html"],"Disposition":"Unknown","Object Features":"None","Latitude":"35.092421","Object Shape":"Circle, Triangle","Summary":"Three round objects below cloud cover. Formed a triangle then disappeared.","trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around September 15th 2000"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.092421,+-106.644347(6446)&iwloc=A&hl=en\"> mufon case (6446) map </A>","Region":"New Mexico","Date Submitted":"09/15/2000 12:00 UTC","Log Number":"US-02232007-0004","Source":"MUFON","Date of the Event":"09/15/2000 12:00 UTC","Longitude":"-106.644347","Weather Factors":"Unknown","Country":"United States","Object Flight Path":"Stationary,Path then hovering,Other","City":"Albuquerque","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed"}