{"Disposition":"Unknown","Case Number":"6460","Sighting Duration":"02:00:00","map":"<A HREF = \"http://maps.google.com/maps?q=37.648335,+-105.87391(6460)&iwloc=A&hl=en\"> mufon case (6460) map </A>","Tags":"City","Object Features":"Dome","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","divs":["Sighting DetailsThe following is an account of the UFO sighting that I witnessed, along with one other friend. The location was Great Sand Dunes National Monument in southern Colorado. The date was approximately Saturday, May 18, 1996. The sighting began after 9:00 PM and lasted for over two hours. I have waited until now (February 25, 2007) to file this report simply because I have only recently become aware of this opportunity to publicize what I saw. My friend and I were seniors in college, and we were camping in Great Sand Dunes National Monument early in our summer vacation. Our campsite was located near the base of the Great Sand Dune itself, in a wooded area near the river, and well within the Monument. We had been hiking during the day, and when it got dark after about 8:00 PM we got ready for bed in our tent. The weather was mild, but there was some cloud cover. At about 9:00 PM my friend and I noticed some well-lit aircraft in the eastern sky. These aircraft were above an open, prairie-like area, away from the trees to the west (where we were) and the mountains to the north. The aircraft were probably less than 5 miles away, and at an elevation of probably less than 1000 feet above the ground. We did not observe them closely yet, as we assumed they were simply the usual type of aircraft. However, after sitting up and talking for about an hour, we noticed that the aircraft were still in the same vicinity of the sky. So, at about 10:00 PM we began to observe them. It quickly became apparent to us that the vehicles we were watching were very unusual. For one thing, they were completely silent. We heard no sounds from motors or engines. We did not hear the rattle of propellers or the roar of jets. In addition, the lights on these vehicles seemed unusual. It appeared as though large portions of these aircraft were illuminated, instead of just particular points where bulbs might be expected. Perhaps most importantly, though, we soon discerned the shape and flight pattern of these aircraft, both of which were certainly unlike any we had seen before. The vehicles were not flying in any particular direction. Rather, they were hovering in a particular area of the sky. What's more, they were able to change direction instantly. They would remain still for a few seconds to minutes, and then suddenly move straight up, down, or sideways to a nearby position. There appeared to be two types of aircraft, one larger than the other. Neither type of vehicle left trails in the sky as it flew. The aircraft were just below the clouds, so they were not visible the entire time because they were occasionally obscured by the clouds. There were about 5 or 6 of the larger aircraft. These larger vehicles resembled big, upside-down cereal bowls. They were capable of hovering and of making sudden directional changes, as mentioned above. However, they also appeared to be spinning in place as well. Their spinning was not necessarily horizontal, however. Rather, they were kind of tilted, so when they rotated, their profile would rock back and forth. Their movement was like that of a flipped coin as it strikes the ground. Just as only the edge of a coin makes contact with the floor, so too the edge of these \"upside-down bowls\" appeared to be rolling along an imaginary, horizontal plane in the air. It was difficult to judge the size of these larger aircraft. However, they seemed to be similar in size to a cabin or a trailer, so their diameter may have been approximately 30 feet. The bottom of these bowl-like vehicles was brightly lit up, but the rest of them apparently was not. There was a constant glow emanating from their flat, lower surface. In addition, mobile searchlights projected downward at various angles, as though the vehicles were scanning the ground. These lights were reminiscent of the searchlights helicopters use, or of the spotlights that theaters shine upward toward the sky during important events (although, again, the lights in question here aimed toward the ground, not the sky). These lights appeared to be scanning a relatively wide area in all directions. They were so powerful and so maneuverable, that they actually illuminated our tent for a few seconds as they scanned the area. I repeat: the search lights were shined in our direction, and for a moment they lit up our tent. In addition to these larger vehicles, there were also smaller ones. These small aircraft were well illuminated as well, and again, it appeared as though light emanated from a large percentage (if not most or all) of their surface area, rather than from just a few points. It was difficult to tell their size and shape. However, they appeared to be rather spherical instead of bowl-like. They were much smaller than the larger vehicles, probably only about 6 feet in diameter. In fact, these smaller spheres appeared to be coming out of the larger aircraft and then going back into them again. They would emerge from the bottom, perform various maneuvers, and then re-enter through the top. Whereas there were only about 5 or 6 of the bowl-like aircraft, these smaller spheres were more numerous. They may have numbered about 15 in total. They also seemed more agile than the larger vehicles. They would emerge relatively quickly, and then would fly in a haphazard way, reminiscent of an insect buzzing around through the air (although not quite so agilely). Their flight pattern was usually curved and variable; I don't recall seeing them fly in a straight line at all. With so many of them, it was impossible to identify individual vehicles or gauge how much time they spent inside or outside the larger vehicles. However, this pattern of emerging and re-entering happened fairly frequently, perhaps every 5 minutes or so. My friend and I noticed this activity at about 9:00 PM. We began watching it in earnest from about 10:00 PM to about 11:00 PM. We became tired and had to go to sleep while the activity was still going on, so we do not know for how much longer it continued. However, we estimate that the activity lasted for more than 2 hours. The experience of seeing these aircraft was both fascinating and frightening. I was amazed, but I was also afraid that my friend and I might come to harm if we were discovered. Fortunately, nothing bad happened to us. We slept soundly through the night and awoke the next day feeling fine and wondering what we had seen the night before. We did not see anything unusual the rest of the day, and we returned home around midday. My experience that night left a great impression on me. Because I am unaware of any military or commercial aircraft anywhere in the world that match the description of what I saw, I can only describe those aircraft as UFOs. I am forced to wonder if what I saw is of extraterrestrial origin. I hope that this report is helpful in solving at least some of the mysteries surrounding this issue. Note: Including myself, two people were witness to this sighting. Because I am writing this report, I have listed myself as Witness A and my friend as Witness B below. I will refrain from providing information about my friend at this time. However, I will confer with him, and if he is interested, we can provide information about him in the future."],"Region":"Colorado","Country":"United States","Source":"MUFON","Date of the Event":"05/18/1996 09:00 UTC","Log Number":"US-02262007-0001","Latitude":"37.648335","Object Shape":"Circle, Disc, Sphere","Viewing Distance":"Over One Mile","Summary":"Prolonged, intensive UFO activity at Great Sand Dunes National Monument","City":"Mosca","Weather Factors":"Unknown","Longitude":"-105.87391","Date Submitted":"05/18/1996 09:00 UTC","files":["/var/www/straped/mufon/html2text/6460.html.txt","/var/www/straped/mufon/org/6460.html"],"trends":["There have been no other sightings in Mosca","This sighting has never been favorited."]}