{"Sighting Duration":"00:00:03","Source":"MUFON","files":["/var/www/straped/mufon/html2text/6461.html.txt","/var/www/straped/mufon/org/6461.html"],"Latitude":"40.024166","Date Submitted":"03/19/1994 11:00 UTC","Viewing Distance":"101-500 Feet","Longitude":"-105.269096","Object Shape":"Boomerang","Country":"United States","trends":["There have been 30 other sightings in Boulder","There were no other sightings in Boulder on or around March 19th 1994"],"Tags":"City","Log Number":"US-02262007-0002","Region":"Colorado","Date of the Event":"03/19/1994 11:00 UTC","Summary":"Sighting of boomerang-shaped UFO above campus of CU-Boulder","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=40.024166,+-105.269096(6461)&iwloc=A&hl=en\"> mufon case (6461) map </A>","Case Number":"6461","divs":["Sighting DetailsThis sighting took place at about 11:00 PM, on approximately Saturday, March 1994, over the campus of the University of Colorado at Boulder. I have waited until today (February 25, 2005) simply because I have only recently become aware of this opportunity to report this sighting. There was a total of two witnesses to this brief but interesting sighting: myself and my friend. I was a freshman at the University of Colorado at Boulder, and my friend was a sophomore. We were leaving the on-campus coffee house known as Whizzers Cafe, located near the center of campus in one of the dormitory buildings. It was a nice night out with a clear sky, so my friend and I looked up to see the stars. While we were facing northeast, we saw a large boomerang- or V-shaped aircraft flying directly overhead in the same direction. The aircraft was probably only about 200 feet above the ground, and it flew completely silently over the dormitory and classroom buildings of the campus. I could not see the actual body of the aircraft, perhaps because it was too dark out or because the body was too dark, or both. However, what I did see was a series of circular lights moving in such perfect unison that I concluded they had to be on the underside of a single machine. The arrangement of the lights reminded me of a V-formation of migrating Canada geese. There was a total of 5 lights: one at the apex of the V, followed by two in each flank of the V. The flanks made an angle of about 30 degrees from the horizontal to create a shallow V, or a boomerang shape. As I said, I could not actually see the body or fuselage of an aircraft. However, the lights kept their formation perfectly. Thus, either their flight formation was very tightly cohesive, or they were simply all part of the underside of the same vehicle. I had to conclude the latter. Estimating size and speed is difficult. However, each light was probably about 10 to 12 inches in diameter, and emitted a whitish or at least a very light-yellowish color. Given that the vehicle was probably only about 200 feet above us, I estimate its width from one tip of the boomerang to the other at about 50 feet. It's speed was surprisingly fast given where it was flying, probably about 150 mph. Again, this aircraft was completely silent. Had my friend and I not looked up when we did, we might not have ever known it had been there. I hope that this report is helpful in furthering research on the UFO phenomenon."],"Weather Factors":"Unknown","Object Features":"Undisclosed","Object Flight Path":"Straight-line path","City":"Boulder"}