{"Object Flight Path":"Undisclosed","Object Shape":"Sphere","divs":["sighting details at approx 8:10pm me and 3 coworkers watched a green orb pulsed high in the sky and then drift away before dropping down vertically and hiding behind a hill. i gave my binocs to a coworker and she described the same thing. it did the same movements and hid behind the same hill last friday,1\\23. me and the security guard watched it together that night and he agreed that it wasnt a star nor plane and we watched it move off and away before dipping down behind a hill. i 1st saw it last thursday eve around 8pm and it pulsed strongly and dimmed down as a plane approached low under it and then it resumed the same size and shape. i watched it for 10-15 minutes before it pulsed and then blinkied out. i'm having headaches, loss of appetite, strong thirst (especially orange juice-i could live off of it alone. but i feel very, very good and at peace. i also have a very strong hyper-awareness and clear headedness. i feel the time is now and i'm ready. i have goosebumps constatntly and feel as though i'm going to bust out of my skin like a butterfly emerging from a chrysillis. at the risk of sounding delusional, i feel very special. saw it late last night after midnight (12:20am~)very high up and noticed it eject a red orb and saw a light streak under it..looked like an orb through my binocs. get ready and god has blessed us all."],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/6474.html.txt","/var/www/straped/mufon/org/6474.html"],"Source":"MUFON","Latitude":"38.42894","map":"<A HREF = \"http://maps.google.com/maps?q=38.42894,+-82.440784(6474)&iwloc=A&hl=en\"> mufon case (6474) map </A>","Region":"West Virginia","Date Submitted":"02/27/2007 08:10 UTC","Longitude":"-82.440784","Summary":"Cones and orbs","Tags":"City","Object Features":"Undisclosed","Log Number":"US-03012007-0001","Country":"United States","Date of the Event":"02/27/2007 08:10 UTC","City":"Huntington","trends":["There have been 15 other sightings in Huntington","There were no other sightings in Huntington on or around February 27th 2007"],"Case Number":"6474","Viewing Distance":"Unknown","Disposition":"Insufficient Data","Weather Factors":"Unknown"}