{"map":"<A HREF = \"http://maps.google.com/maps?q=44.653891,+-63.568812(6477)&iwloc=A&hl=en\"> mufon case (6477) map </A>","Object Shape":"Cross, Flash","Date Submitted":"02/01/2007 02:00 UTC","Region":"Nova Scotia","Case Number":"6477","Disposition":"Unresolved","City":"Halifax","Date of the Event":"02/01/2007 02:00 UTC","trends":["There have been 22 other sightings in Halifax","There were no other sightings in Halifax on or around February 1st 2007"],"Summary":"FLASHING LIGHT","Longitude":"-63.568812","Source":"MUFON","Log Number":"CA-03022007-0001","Viewing Distance":"Unknown","Object Flight Path":"Stationary","Latitude":"44.653891","Country":"Canada","divs":["Sighting DetailsTHIS OBJECT IS NOT FLYING. I AM NOT A CRAZY PERSON AND I HAVE REPORTED THIS TO ENVIRONMENT CANADA AND ST. MARY'S UNIVERSITY. BOTH SAY THEY DO NOT KNOW WHAT IT IS BUT AGREE IT IS NOT A PLANET OR STAR. IT IS STATIONARY AND MOVES WITH THE TURNING OF THE EARTH. I OBSERVE IT THE SOUTH EASTERN SKY. WITH MY BINOCULARS I SEE IT AS FLASHING RED, WHITE AND GREEN. THIS WOULD MAKE YOU THINK THAT IT IS A PLANE AND WE DO SEE MANY PLANES AND HELICOPTERS IN THE SKY AT ANY GIVEN TIME BUT I HAVE BEEN OBSERVING THIS FOR OVER A MONTH AND IT IS IN THE SAME PLACE EVERY NIGHT THAT THE SKY IS CLEAR. I THINK IT IS SOME KIND OF A SECURITY SATALITE OR SOMETHING AS IT CANNOT BE THE SPACE STATION OR AN ORBITING SATALITE. IT IS REALLY AN UNIDENTIFIED OBJECT NOT SOMETHING FROM SPACE BUT IT IS IN SPACE. I JUST WOULD LIKE TO KNOW WHAT IT IS. TO THE NAKED EYE IS JUST LOOKS LIKE A VERY BRIGHT STAR (BRIGHTER THAN VENUS) BUT WHEN YOU LOOK AT IT THROUGH BINOCULARS IT LOOKS LIKE A CROSS. AGAIN I AM TRUTHFULLY TELLING YOU THAT I AM NOT CRAZY OR ON DRUGS OR DRUNK. I AM A NORMAL RETIRED PERSON WHO SEES SOMETHING IN THE SKY. MY HUSBAND ALSO HAS OBSERVED THIS OBJECT AND SEES THE SAME AS I DO. SO THAT'S MY STORY AND AS THE SONG SAYS \"AND I'M STICKIN' TO IT.\" I CANNOT SEND YOU A PICTURE OF IT AS MY CAMERA WOULD NOT PICK IT UP BUT IT IS IN THE SKY EVERY NIGHT AND IT IS NOT GOING AWAY. THANK-YOU VERY MUCH JOAN"],"Sighting Duration":"Undisclosed","Object Features":"Other","files":["/var/www/straped/mufon/html2text/6477.html.txt","/var/www/straped/mufon/org/6477.html"],"Tags":"City","Weather Factors":"None"}