{"Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","City":"Undisclosed","divs":["Sighting DetailsThis is the second time this week I have witnessed this odd light from my back porch.. The odd thing is it comes and goes. Is in relatively the same position yet then will disapear. On tuesday Feb. 27 My son and I witnessed this. I knew it was not an ordinary star, planet or air craft. It was just hovering. When my son saw the light he went to get his telescope. As he began to sight it in the light- I kid you not - seemed to become thin and as if it were changing into two parts. Then I told my son to get in. I did not want to see any more since it was so profound!!!!! When my husband returned home from work late at 12:45 THE LIGHT REAPPEARED.. It was not visible shortly after the first sighting at 7:30, once we heard planes in the sky we looked and it was gone. When my husband saw it he too thought it was unusual. He went in to get his scope. The light seemed to flicker and when he did get it in his sight we could see beautiful colors of red green yellow pulsating from this. It was like nothing I can explain! After we returned in the house and spoke of this a while I told him I betr it was once again gone- Surre enoughit was! I will be looking tonight. I will have camera in hand! Please note we are in rural Kentucky and there was no sound. You can hear a train for five miles! Definately an odd sight!"],"Region":"Kentucky","Disposition":"IFO","Date Submitted":"03/01/2007 07:25 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.845383,+-84.260248(6480)&iwloc=A&hl=en\"> mufon case (6480) map </A>","Source":"MUFON","Case Number":"6480","Log Number":"US-03022007-0004","Tags":"City","Country":"United States","Longitude":"-84.260248","trends":[],"Date of the Event":"03/01/2007 07:25 UTC","Latitude":"37.845383","Viewing Distance":"Unknown","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/6480.html.txt","/var/www/straped/mufon/org/6480.html"],"Object Shape":"Fireball","Summary":"fire ball emiting colors of red green and flashing"}