{"Object Features":"None","Object Shape":"Sphere","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.605493,+-117.664585(6481)&iwloc=A&hl=en\"> mufon case (6481) map </A>","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/6481.html.txt","/var/www/straped/mufon/org/6481.html"],"Disposition":"IFO","divs":["Sighting DetailsI walked outside to empty trash on the N, NW, side of the house. With a clear night, partial moonlight and stars, I noticed a glowing object moving slowly across the sky in a S, SE direction. I first noticed it when it was about 4-5 miles away. It was not at a high elevation, I would estimate between 4-6000 feet. I think I expected to see some kind of aircraft lighting appear, but none appeared. I observe aircraft from this location, notably, mid-size commercial airliners on their approach into John Wayne airport, some 16-18 miles north, and a local Sheriff's patrol helicopter. I am aware of what flies in my area. This was not an aircraft. It had no navigation lights or other lights. It was too low to be picking up sunlight but too high for me to get a clear, detailed view. It was mostly sperical and had a dark orange color that appeared to emanate from some thing inside it. The logic of this caught my attention. How come I could see something that is not reflecting sunlight in a very dark night sky and is not an aircraft as we know them? And what gives it this dull dark orange color? I ran back into the house and grabbed some binoculars and was able to find the object again and focus on it. It appeared the same as with the naked eye, however, I was able to notice the tumbling a bit more and also the appearance of it slowing expanding, contracting or metamorphing into different, yet still sperical shapes as it traveled. It was gainig altitude at the same rate that it traveled across the sky. I was very surprised to see something so unusual. I have seen the, Shuttle, the ISS and many other satelites cross the night sky, but this was not in an apparent orbit and it was nit the typical silver or white in appearance. This happened two days ago and I'm still flabbergasted as to what it was. I lost sight of it as it got higher and higner and moved into the moonlight at which point the light affected my eye too much to find it or even see it again. What was it? Thanks-"],"Weather Factors":"None","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","City":"Mission Viejo","Source":"MUFON","Summary":"Witnessed a tumbling burnt orange sphere moving S, SE, across night sky.","Longitude":"-117.664585","Log Number":"US-03022007-0005","Date of the Event":"02/28/2007 08:45 UTC","Date Submitted":"02/28/2007 08:45 UTC","Tags":"City","Case Number":"6481","trends":["There have been 10 other sightings in Mission Viejo","There were no other sightings in Mission Viejo on or around February 28th 2007","This sighting has never been favorited.",""],"Latitude":"33.605493","Region":"California"}