{"Disposition":"Unknown","Date of the Event":"02/23/2007 12:00 UTC","Case Number":"6482","files":["/var/www/straped/mufon/html2text/6482.html.txt","/var/www/straped/mufon/more/6482_submitter_file1__Copyof_IGP0410.jpg","/var/www/straped/mufon/org/6482.html"],"Log Number":"US-03022007-0006","Latitude":"34.902248","City":"Holbrook","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.902248,+-110.158177(6482)&iwloc=A&hl=en\"> mufon case (6482) map </A>","Object Shape":"Cylinder","divs":["sighting detailsi was driving west on i-40 perhaps an hr. west of the n.m\\az border....i had stopped to take photgraphs of the sunrise......the image attached was shot from a knoll on the side of i-40. at the time of the shoot i did not see anything, although the night before had sighted something several times just west of albequerque n.m. the image became apparent during post processing when i enlarged the frame to a 100% of its value.....i do not know what it is....i have had four sightings in my life time, this would be 5 and the first recorded image if indeed it is an et craft. my feelings about the subject are enthusiastic, i believe whole-heartedly that we are not alone, though i have only speculation as to the interest of these craft and et's........as i said the night before this occurance, i watched a bright object-very illuminated over the traffic just outside albequerque n.m.....it eventuall slid away and 10 minuets later ...popped! dierctly in front and above me perhaps 3-4000 feet; the light was phenomenal and the shape somewhat star-like......i drove under the object and continued on my way without incident."],"Date Submitted":"02/23/2007 12:00 UTC","Summary":"verticle light in distance","Region":"Arizona","Sighting Duration":"Undisclosed","trends":["There have been 2 other sightings in Holbrook","There were no other sightings in Holbrook on or around February 23rd 2007","This sighting has never been favorited.",""],"Weather Factors":"None, Windy, Light","Tags":"City","Object Flight Path":"Stationary","Longitude":"-110.158177","Country":"United States","Viewing Distance":"Over 1 Mile, Unknown","Source":"MUFON"}