{"divs":["Sighting DetailsI was just shooting out the window at my Mom's house around 2 a.m. in the morning, there were three red triangular dot things darting around and then there were balls of light bouncing around and sometimes they would get in front of my camera and block my vision and seem to grow. Some were medium and some were smaller. But when I ran the tape back, this mushroom shaped thing showed up outside Mom's window, and it had writing on the top of it I did not understand. There is no way I could get everything in this note to you that has been happening and is still happening. Our lives have become a nightmare. I feel like I am living in a movie sometimes and I cannot turn it off. No one will believe me, because they do not believe in flying saucers. The story is really that unbelievable that it is hard to believe. I have 5 cassettes so far and I plan on taking more. They know I am out to get them, I haven't made any secret of it, so they are not afraid of me. When anyone else shows up, there is not a sign or a sound. But, pictures do not lie. The only problem is.....my digital camera, for some strange reason, will not download to the computer. It is hooked up correctly, but it will not download. And when I run the cassettes to check them, things on the cassettes will disappear in front of my eyes. So, I am just going to put what I have in envelopes and seal them. I will get them to you in any way possible, but I do not trust these things. I have seen people like us, hairy ape looking people, animals, see what I mean. There have always been two men in charge as far as I have been able to film. An older man with white hair, full white beard and mustache and a younger man with reddish brown hair, neatly trimmed mustache and beard. Please help me. My mothers health has suffered terribly with this, and my nerves are just about shot. You feel like you are alone in the world. I appreciate any help you can give us. Thank you very much. Lori Gates"],"Summary":"I was taping three triangular dot things and some small and medium size balls of light floating around when I picked this up on the film.","trends":["There have been 122 other sightings in Pittsburgh","There were no other sightings in Pittsburgh on or around December 15th 2007"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.447685,+-79.992526(6483)&iwloc=A&hl=en\"> mufon case (6483) map </A>","Log Number":"US-03022007-0007","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/6483.html.txt","/var/www/straped/mufon/org/6483.html"],"Source":"MUFON","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Latitude":"40.447685","Region":"Pennsylvania","Case Number":"6483","Sighting Duration":"Undisclosed","Tags":"City","Object Features":"Undisclosed","Date of the Event":"12/15/2007 12:00 UTC","Country":"United States","Disposition":"Insufficient Data","Longitude":"-79.992526","Date Submitted":"12/15/2007 12:00 UTC","Object Shape":"Circle, Other","City":"Pittsburgh"}