{"Longitude":"-100.889117","Summary":"Top Hat shaped cluster of lights accompanied by a deep, loud, resonating hum.","files":["/var/www/straped/mufon/html2text/6488.html.txt","/var/www/straped/mufon/org/6488.html"],"Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-03032007-0005","Date Submitted":"03/01/2007 11:15 UTC","Object Shape":"Other","Latitude":"29.377836","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=29.377836,+-100.889117(6488)&iwloc=A&hl=en\"> mufon case (6488) map </A>","Region":"Texas","Date of the Event":"03/01/2007 11:15 UTC","Country":"United States","Object Features":"Other","divs":["Sighting DetailsAt approximately 11:12 pm, I was in my den watching T.V. at a medium volume accompanied by my girlfriend. It was around that approximate time that I was drawn outside by a very deep, loud, hum. As best as I can descride the noise it was as loud as a train but less rumbling, like continuous rolling thunder only no crackling. The sound was consistent for a few minutes and so strange to me that I walked outside. I looked in the direction of the sound but had zero expectations as I could not imagine what could be making such a noise. As I looked up at about a 50 degree angle from the horizon I noticed a cluster of lights, possibly multicolored in the form of a top hat. The shape was about the size of a quarter at about 125 yards away. The light configuration was that of possibly 3 lights on top a few lights in the center and possibly 5 lights along the \"bottom.\" The lights were sparkling much like a cluster of several bright stars. The sky was lightly cloudy possibly a few wisps of cloud, but none to separate my position and the object. The object descended very slowly about 1 degree every few seconds. My girlfriend was behind me also witnessing the event as I began to yell for my father to come outside. She ran inside to call him and he was outside at exactly 11:15 as he made note of the clock. The object had by that time descended to about 30 degrees or so and was floating about 30 feet above the trees that span approximately 30-50 yards. I apologize for my lack of precise measurement. As we stood out there for several minutes watching the object the lights merged and the sound ceased. The several lights solidified into one light about the size of a small marble at the same distance. I was compelled to call my younger bother and told him that I was staring at a UFO. He told me to hang up and record it with a camera phone. I was able to get one picture but I was unfamiliar with the camera and could not successfully film the event. As I was fumbling with the camera I could see through the screen that the light was bouncing and thought that that was due to my shaking hand. However, I was not shaking. My father and girlfriend then began to say that the light was \"bouncing\" and had possibly turned to our direction because the light intensified. The picture quality was very poor as the camera could not pick up the light at that distance and I was hoping for a video instead of a picture. [The time on the picture is 11:22 pm. I can send the picture to anyone who feels they can decipher anything out of it.] As I put the camera down I noticed a very different behavior from the object that was now a smaller brigher ball of yellowish light. The ball of light moved off into northeaterly direction at an increased speed, but maintained a relatively slow speed. My father reported the sighting to the local Del Rio police non-emergency number. The sound was intermittent throughout the evening at a lower decibel level but I did not see anything else. In the afternoon of March 2 I contacted the local airport to ask if there was any outgoing traffic at between the times of 11 and 11:30 they were curious to ask why I was asking but told me that there may have been, but not that they were aware of. Since the lady was of little help. I spoke with the assistant traffic director Joel Martinez who discussed the event with me and said at his best guess was that of a black hawk helicopter but none were in activity at that time to his knowledge. I discussed with him my unprofessional familiarity with black hawks and we did come to an agreement that this did not match the light configuration. It was at that point that I felt that reassured in the previous idea that what we had witnessed was definitely an Unidentified Flying Object."],"Source":"MUFON","City":"Del Rio","trends":["There have been 12 other sightings in Del Rio","There were no other sightings in Del Rio on or around March 1st 2007"],"Tags":"City","Disposition":"Unknown","Sighting Duration":"Undisclosed","Case Number":"6488","Object Flight Path":"Hovering then path"}