{"divs":["Sighting DetailsI am a 54 year old father of six, my wife is a teacher and we live in Evansville, Indiana and I had to travel to Montoe City, Indiana (appx. 60 miles north of Evansville and 15 miles west of Vincennes, Indiana and 3 miles west of LUCKY POINT)I had to show come cleaning equipment to a new church at 6:00 P.M. that lasted appx 45 minutes and after getting loaded up and back on the road was probably 7:05...I headed out of town and took 241 South...at appx. 7:15 I noticed a bright light to the west of me as I traveled south. I wasn't thinking to much about it because this type of light so many times before just turned out to be a plane...But in no time I could tell this was different. So, I kept focused. What made this different was it appeared to disappear as if it went into a cloud and then would reappear a distance later. Did this several times and then I realized this was one of those nights that didnn't have a cloud in sight...then it appeared to be gone (appx 20 seconds) and then it reappeared this time directly in front of me...The light was quite large now and especially for the distance it was away (unlike the lights on the larger planes or jets). What happened next was the part that was spectacular...first of all it appeared abruptly in the sky in front of me as quick as it appeared it then bolted out another light like a shooting star and then in like manner did this again... it was \"BRIGHT LIGHT\"-flash-\"BRIGHT LIGHT\"-flash-BRIGHT LIGHT...then the three lights stayed lit for appx.5 seconds and then the lights went out(the lights flashed toward the 8:00 hour not straight out...this wss also the unusual thing about this experience. VERY BRIGHT AND VERY LARGE...and at no time did I see any of the typical green and red flaching lights associated with conventional aircraft...I took a few minutes to think about it and had to talk to someone, so I called my wife...couldn't get it out of my mind so 3 days later I went to google and typed in \"UFO sightings indiana\" only to find out that I wasn't alone and that Indiana was a hot spot and that the hottest spot was only 2 to 4 miles west of my sighting and in reality that was the direction it was heading...by the way the lights were white but the lightning type bolts or flashing like a shooting star as the other lights protruded were fire like in appearance...I wanted to report this for the same reasons I needed to tell someone...and for the same reason I researched GOOGLE...I was blown away...and only wish family members or a friend or for that matter anyone could have been with me to have seen and shared this experience...in short no one else was, so this is all I can do...Is report it...and just this weak in Yahoo News the ex prime minister of Canada came to the fore-front asking the Nations of the world to release UFO technology to help save the planet...Maybe it will be sooner then later I and others will get our answers...thanks for letting me tell my lenghty story and bend your ears...Thomas Rennels"],"Date of the Event":"02/08/2007 07:20 UTC","Source":"MUFON","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.518936,+-87.523078(6490)&iwloc=A&hl=en\"> mufon case (6490) map </A>","Case Number":"6490","Object Shape":"Flash, Star-like","Summary":"phenomenal light show (definitly not an identifiable object)","files":["/var/www/straped/mufon/html2text/6490.html.txt","/var/www/straped/mufon/org/6490.html"],"trends":["There has been one other sighting in Decker","There were no other sightings in Decker on or around February 8th 2007"],"Object Flight Path":"Straight-line path,Path with directional change,Other","Longitude":"-87.523078","City":"Decker","Region":"Indiana","Object Features":"Unknown","Country":"United States","Latitude":"38.518936","Sighting Duration":"Undisclosed","Log Number":"US-03042007-0002","Disposition":"Unknown","Date Submitted":"02/08/2007 07:20 UTC","Weather Factors":"None","Viewing Distance":"Over One Mile"}