{"divs":["Sighting DetailsI had just made a right hand turn onto Cactus Blvd. from 32nd Street heading due East around 2pm. Out of the corner of my left eye something caught my attention, probably because it was hanging in the air above a large building (say, something like a Wal-Mart size wise). I was driving against a median so I glanced up quickly and saw this huge craft (I guess it was several hundred feet long and was suspended mid-air at about five hundred feet). I was blown away. The object didn't make me feel anything but awe. It was beautiful. It was, what I would call, the perfect machine. The funny thing is, is I only had seconds to look at it (since I was trying to avoid getting in an accident, and I couldn't pull over), but I had two clear unimpeded views of it. It was made of some kind of black metal(?), it was missile like yet the back of the craft had almost an octagon shape with four (I don't know what to call them) arms that pointed to the very front tip of the craft--the tip of the craft and these four arms had, what looked like, pure gold orbs. Even though I saw this craft for only seconds, I knew that the gold orbs had something to do with its power source--don't ask me why, I just knew, most likely because all of these were in perfect alignment. On my second look at the craft, I noticed it had kind of an organic quality about it--that it was somehow alive. Well, it was. I had to look back to the road and my driving, and when I looked back the craft was gone. I believe what I interpreted as \"organic\" was actually it's cloaking device which, I believe, had failed and that's why I saw it. This craft had about fifty, what I believe were, portholes or windows as well. When I looked back and it was gone my first thought was to pull over and try to throw something at it--silly, but true. I knew that it was still there. Child-like thoughts can overwhelm a person at a time like this. Anyway, that's what I saw, in my right mind, and in broad daylight. Years earlier, I had a physical experience at this sight, well near it anyway. I believe that this sight holds a huge energy source of some kind."],"Log Number":"US-03042007-0004","files":["/var/www/straped/mufon/html2text/6492.html.txt","/var/www/straped/mufon/org/6492.html"],"City":"Phoenix","map":"<A HREF = \"http://maps.google.com/maps?q=33.449567,+-112.072337(6492)&iwloc=A&hl=en\"> mufon case (6492) map </A>","Date of the Event":"08/12/2006 12:00 UTC","Disposition":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","Object Shape":"Bullet, Missile, Square, Rectagular","Viewing Distance":"101-500 Feet","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around August 12th 2006"],"Tags":"City","Object Features":"Window(s), Appendage(s), Other","Longitude":"-112.072337","Date Submitted":"08/12/2006 12:00 UTC","Latitude":"33.449567","Object Flight Path":"Stationary","Weather Factors":"Unknown","Region":"Arizona","Case Number":"6492","Source":"MUFON","Summary":"UFO Sighting"}