{"Tags":"City","files":["/var/www/straped/mufon/html2text/6496.html.txt","/var/www/straped/mufon/org/6496.html"],"Country":"United States","Longitude":"-96.768663","Case Number":"6496","Viewing Distance":"101-500 Feet","Region":"Texas","Date Submitted":"12/14/2006 01:20 UTC","Summary":"standing on my patio one night i look up and see an orange round large ball,sitting in one position.","Object Shape":"Fireball","Disposition":"Unknown","City":"Dallas","Object Features":"Other","Sighting Duration":"Undisclosed","Latitude":"32.808385","divs":["Sighting DetailsOne night about 1;15 am , i stepped outside of my apartment for a breath of fresh air, and and did not see anyone out at that time.Across the street is a large parking lot and a highway and then a hillside to the freeway. I looked down for a second and then looked up again and saw what seemed to be a large 8-foot wide and 8-foot in height large round ball of orange see through plasma. Not believing my eyes,i looked away for a second to rub eyes,then i looked again and it was still there in the same position .I looked around to get someones attention but no one was i sight.Do not know if the cars on the freeway even noticed it. well i stared at it for a little longer,when right about that time it just blinked out as if it was never there,but i know it was there. A woman walked from the side of one the buildings ,and as she did,the object blinked out as if it did not want her to see it. Haven't seen the object since but i look for it everynight. The only other thing that i would like to add is that the object seemed to be floating about at least 2 to 3 feet off of the grassy area of the freeway hillside ."],"Date of the Event":"12/14/2006 01:20 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.808385,+-96.768663(6496)&iwloc=A&hl=en\"> mufon case (6496) map </A>","trends":["There have been 116 other sightings in Dallas","There were no other sightings in Dallas on or around December 14th 2006"],"Log Number":"US-03042007-0008","Object Flight Path":"Stationary","Weather Factors":"None","Source":"MUFON"}