{"Longitude":"-104.706658","Sighting Duration":"Undisclosed","Country":"United States","Case Number":"6497","Disposition":"Unknown","divs":["Sighting DetailsI'm a skeptic, and I don't know what this was. I haven't read any accounts like this is any UFO-related book, so I'll just tell it like I saw it. My husband J (then boyfriend) and I were driving from Colorado to Santa Fe to visit some friends. It was maybe 2 o'clock in the morning. That stretch of highway (between Raton and Las Vegas, NM) was pretty empty at that hour, two lanes of highway in each direction, divided by a wide grassy median. That's why I immediately noticed two lights pop up behind me out of, what seemed like, nowhere. I thought it must be a cop that had pulled out from a hiding spot. This area is empty prairie. No trees, no nothing, and you can see for miles. But the lights were rather far apart, so I began to think it was two motorcycles or a really old classic car. They were not entirely round, more like horizontally elliptical, if that makes sense. They looked a bit different than traditional modern headlights. I'm not a good judge of distance. The lights weren't threateningly close, but close enough that I wondered if they'd ever pass me. There were no other cars around at all, so I was paying close attention. I mentioned the lights to J and he started watching them in the sideview. They really just looked like headlights, moving in unison, just farther apart than normal headlights and there was no sound. I honestly don't remember if they were yellow or white. I wish I could. Anyway, they followed me for maybe 5 minutes and then they seemed to turn upward and disappeared in a blink. I said \"Did you see that?\" and J said \"yeah\" so I slowed down and tried to decide what to do. Being followed by headlights isn't weird, but this experience felt VERY weird so I actually pulled over, then drove across the median and headed the other way. There was nothing. And I would have noticed something, anything out there because it's just empty, rolling hills. No sign of any car. No car heading the other way. No car on the side of the road. So I got back on the highway going the right direction and drove on. I hadn't taken any drugs, hadn't been drinking, wasn't very sleepy. In fact, that's about as wide awake as I've ever felt in my life, when those lights disappeared. J and I drove on in complete silence for a long time, maybe 20 minutes, then both kinda said \"What the hell was that!?\" and \"I have no idea\" at the same time and rolled down the windows to look up frantically at the sky. We both had a \"hey, come back\" attitude at that point, even though neither of us ever said the word UFO or alien. We only referred to the \"incident\" a few times because all of our friends and family are skeptical, educated people. Even just remembering this event, I have nervous chills. Obviously, anyone would ignore it as an incident easily explained. Two lights on a highway. Big deal. But I looked. I looked everywhere. The lights came out of nowhere and disappeared. I'm a secularist, not prone to belief in anything unprovable or \"supernatural,\" but headlights don't turn upward and disappear. They just don't. And I was watching closely. And even though I tried to brush it off, I felt profoundly changed by the experience. I was even sad about getting rid of my old car because I thought \"Well, that's the only way they could identify me. That license plate was my address, of sorts.\" I know. It sounds crazy."],"Latitude":"36.008925","Object Features":"None","Date of the Event":"01/09/1999 12:00 UTC","Log Number":"US-03052007-0001","files":["/var/www/straped/mufon/html2text/6497.html.txt","/var/www/straped/mufon/org/6497.html"],"Viewing Distance":"21-100 Feet","Weather Factors":"None","Object Shape":"Oval","Summary":"Followed by two lights on deserted highway","Object Flight Path":"Undisclosed","Tags":"City","City":"Wagon Mound","trends":["There have been no other sightings in Wagon Mound","This sighting has never been favorited."],"Source":"MUFON","Date Submitted":"01/09/1999 12:00 UTC","Region":"New Mexico","map":"<A HREF = \"http://maps.google.com/maps?q=36.008925,+-104.706658(6497)&iwloc=A&hl=en\"> mufon case (6497) map </A>"}