{"Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/6500.html.txt","/var/www/straped/mufon/org/6500.html"],"Tags":"City","Weather Factors":"Unknown","Object Features":"Undisclosed","Disposition":"Insufficient Data","Summary":"Ufo incident near local college CNU. Cigar-Shaped craft sighted.","Region":"Virginia","map":"<A HREF = \"http://maps.google.com/maps?q=37.091192,+-76.463892(6500)&iwloc=A&hl=en\"> mufon case (6500) map </A>","Date of the Event":"03/01/2007 10:30 UTC","Country":"United States","Longitude":"-76.463892","Log Number":"US-03052007-0004","Sighting Duration":"00:10:00","City":"Newport News","Case Number":"6500","divs":["Sighting DetailsI was visiting the Christopher Newport University campus on March 1st, due to the possiblility of my attending the university next fall. I was planning on spending the day with some friends who were already attending the school, and hopefully hang out with them a lot while they weren't giving me the full-campus tour. That lasted until about one or two, when we all decided to grab some lunch in the city. After a nice drive over to Newport News, we found a Subway. It wasn't so much the food choice as the scouting out of the city-life that I was interested in. On the way over we noticed a nice looking park, and decided, that after spending the rest of the day there we would go over at night and play some flashlight tag. Night did come, and after exploring much of the city, we all managed to purchase 5 flashlights for each of us. About an hour into playing the game, I looked up into the sky, because I noticed that the moon seemed noticably brighter. After analysing the sky for a few moments i realized that the brightness was actually comming from a shape in the sky, maybe 100 yards up. The first reaction I had to the incident was to tell my friends, and make sure I wasn't seeing things, but sure enough, they were looking at it too. The object, shaped like a cigar, was glowing all over, with only the base showing a circular area of glowing red and white lights. As I looked at the lights, I felt strangely tranquil, and couldn't move from the position that I was standing. The aparatus then began to bounce in the air, before darting across the sky much faster than any craft that I have seen before."],"Source":"MUFON","Latitude":"37.091192","trends":["There have been 7 other sightings in Newport News","There were no other sightings in Newport News on or around March 1st 2007","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","Object Shape":"Bullet, Missile, Cigar, Cylinder","Date Submitted":"03/01/2007 10:30 UTC"}