{"Viewing Distance":"Over One Mile","Disposition":"Unknown","Longitude":"-93.519614","divs":["sighting detailsi was in my hot tub and at about 8:20pm looked up to the east to see 2 objects flying in echelon formation with the lead element to the right of his 'wingman'. they were in what appeared to be a northernly course, slightly east of me. they traveled from the constellation of leo's throat to the handle of the big dipper in about 10 seconds. this is 53 degrees in the sky. this is about the speed i have seen low f-16's from the iowa national guard do. there was absolutely no sound, though. they were a dim, fuzzy orange. at first it seemed fake to me, because of the lack of brightness. it was almost as if the object was illuminated, not giving off it's own light. and if it was, it was a dim source of light when compared to the moon. the orange in the middle was surrounded by a fuzzy white light emitting radially. there was no tail in anyway. they did not follow an exactly straight path. the leader was very slightly weaving back and forth. his wingman was also weaving, more noticeably, about 90 degrees out of phase from the leader. i estimate the weaving oscillation to be about 2 hz. they got dimmer and smaller as they went into the distance and i lost them over the house. the sky was clear, i could see venus setting in the west, the waning moon rising in the east, and clearly make out the constellations over head. i am an ameteur astronomer used to looking at the sky at various things and i am also a fan of military aircraft. this sighting still has me baffled, i have not even an idea of what it could be. i would also like to add a past sighting to this report as it was very similar. in april 2005, i saw 2 circular orange glowing objects pass directly over my house heading north. they were in the same echelon formation as this 2007 sighting was. the difference was these appeared much lower and larger. i estimated the size to be between 1\\4 and 1\\2 the diameter of the moon. each object had a pattern in the light. it was a diffraction pattern, lines of brighter orange and dimmer orange, about 4 or 5 of each. the lines of the pattern were about 45 degrees off the direction of travel. i only saw these for a few seconds as they flew over my house and i grabbed my binoculars running to the front yard, but i could not reacquire them. i did not previously report this because i only had a small window of observation, less than 3 seconds. with the similarity to this recent sighting, i found if relevant to include this report as well. i have attached a photo of each sighting as they appeared to me. thanks. troy"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.58739,+-93.519614(6502)&iwloc=A&hl=en\"> mufon case (6502) map </A>","Date Submitted":"03/05/2007 08:20 UTC","Object Features":"Unknown","Country":"United States","Tags":"City","Region":"Iowa","files":["/var/www/straped/mufon/html2text/6502.html.txt","/var/www/straped/mufon/org/6502.html"],"City":"Pleasant Hill","Source":"MUFON","trends":["There has been one other sighting in Pleasant Hill","There were no other sightings in Pleasant Hill on or around March 5th 2007","This sighting has never been favorited.",""],"Date of the Event":"03/05/2007 08:20 UTC","Object Shape":"Sphere","Object Flight Path":"Straight-line path","Log Number":"US-03052007-0006","Weather Factors":"Unknown","Case Number":"6502","Summary":"2 orange spheres near Des Moines, Iowa flying formation","Latitude":"41.58739"}