{"divs":["Sighting DetailsIn May 1982, (I do not recall the exact day or date.) I had a close up day light sighting of a huge, classic disc (saucer)shaped UFO. Four of my neighbors also saw it. I reported it to the police, but nothing came of that. After all these years, I decided I want to let the sighting be known for whatever good it might do in the search for the truth. I was living at 55 Normandy Dr. Piscataway, N.J. at the time. It was at 8 pm and at that time of the year the sun is low in the western sky, but the sky is still bright and clear. I usually went out back at this time to watch the sunset. My yard ended at railroad tracks and power lines that went east and west. Across a field on the opposite side of the tracks, I had a clear view of the distant Watchung Mountains in the northwest direction from my yard. It was a cloudless clear sky, I was facing due west. The sun had just gone behind the mountains so it did not obstruct my vision. After a while I noticed a small object in the sky coming from west to east, not far from and paralleling the power lines. It was coming directly towards me. I thought nothing of it at first. As it got closer I noticed it had an odd shape. At first I thought it was a hot air balloon. But, as it came closer and grew larger, I could see that it was in the classic shape of a flying saucer and was metalic silver in color. It came almost directly overhead and it had to be at least 100 ft. in diameter or larger. When it was nearly overhead, about 350 yards at its closest point to me, it made a 90 degree turn and went north gaining in altitude as it went. I ran to get my neighbors. Four of them came out and saw the saucer, but only after it had gained some altitude and distance so they did not see it nearly as close up as I did. They were none the less amazed at what they saw because even when they saw it, it was plain to see that it was no known conventional aircraft. There was a small local airport not too far away and my house was under major flyways for the New York and Newark city area airports. Usually at any given time you can go out and look up and see various normal aircraft of jet trails in the sky. On this occasion, however, the sky was oddly empty except for one small private plane (about a two to four seater) coming from the direction (west) of the local small airport. The small plane came to a distance of about half way between me and the departing UFO. Even at these distances the UFO could be seen to be well over twice the length of the plane. The plane suddenly made a 180 degree curved turn about and flew back in the direction of the airport. I thought that was a strange maneuver. They may have spotted the UFO or may have been contacted by radio and told to clear the area. We watched the UFO until it faded from sight into the distance. At no time did we hear any noticable sounds at all coming from the UFO. If it made any noise at all it owuld have had to have been a low hum. Later on, I told other neighbors about the sighting. Naturally, they thought I was crazy. My neighbors who saw the flying saucer with me would not talk to anyone but me about it. To this day I regret that I didn't get any photos of the UFO. If I had photos to show as back up, it would have made it a lot easier for me to report this sighting. I hope that someone else in the general area may have seen it and taken photos and that these photos may turn up some day. If they already have, I would like to know about it and see those photos. I affirm that everything I have reported here is absolutely true."],"Weather Factors":"None","trends":["There have been no other sightings in Bound Brook","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.568436,+-74.538489(6506)&iwloc=A&hl=en\"> mufon case (6506) map </A>","Region":"New Jersey","Object Features":"Dome","files":["/var/www/straped/mufon/html2text/6506.html.txt","/var/www/straped/mufon/more/6506_submitter_file1__13NJdiscMay82Boundbrook.jpg","/var/www/straped/mufon/org/6506.html"],"Case Number":"6506","Object Shape":"Disc","Country":"United States","Log Number":"US-03062007-0004","Summary":"I had a daylight sighting of a disc shaped UFO that came as close as 350 yards and was100 ft. in diameter.","City":"Bound Brook","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Tags":"City","Date Submitted":"04/30/1982 08:00 UTC","Longitude":"-74.538489","Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Latitude":"40.568436","Source":"MUFON","Date of the Event":"04/30/1982 08:00 UTC"}