{"Disposition":"Unresolved","Date Submitted":"02/28/2007 08:45 UTC","files":["/var/www/straped/mufon/html2text/6509.html.txt","/var/www/straped/mufon/org/6509.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=17.644315,+-101.553073(6509)&iwloc=A&hl=en\"> mufon case (6509) map </A>","Case Number":"6509","Region":"Guerrero","Object Shape":"Triangle","trends":["There have been no other sightings in Zihuatanejo","This sighting has never been favorited."],"Longitude":"-101.553073","Country":"Mexico","Tags":"City","City":"Zihuatanejo","Latitude":"17.644315","Weather Factors":"Unknown","divs":["Sighting DetailsMy wife and I were vacationing in Zihuatanejo,Mexico for one week. We returned from dinner to our hotel on Wed. night Feb.28,2007 at approximately 8:15 pm. We got a pot of coffee and sat outside on the veranda in front of our room which overlooks Zihuat.Bay. The night was perfectly clear, temp.approx.75F .Our position was facing south toward the ocean. At approximately 8:40 - 8:45 my wife (looking to our right West) said what is that. I immediately looked to the west to see (what was my first impression) appeared to be balloon or large canopy shaped piece of plastic with fire burning below it rising into the air from the beach below. I thought someone had sent a balloon or plastic bag with something on fire attached below it into the air as a prank,advertisement,or just something fun to do. As we and 2 other people in the pool next to us watched the object, I really thought it had something on fire(flameing)below it. The object then was coming toward us. It was heading west to east(from our right to our left). As it came closer, I then realized this was not what I originally thought. Firstly, there was a light breeze that night. The object was moving at a fairly slow steady unwavering pace. No movement up or down,right or left. The entire time we watched,it kept the same steady speed never wavering. Secondly, when the object got close enough, I could distinctly see the shape. The object was dark, but had a perfect triangular outline. It still looked like flames burning under the center in a circular dome like shape. It could possibly have been a strobing light, but looked flame- like. Thirdly, the object made no sound. It was perfectly quiet. We watched it for approximately 5 minutes until it dissapeared to the east. The entire time it never deviated it's speed or made any wavering movements. It was like it was on a rope. Straight,steady,and perfect speed and tragectory. On reconsideration,I believe we actually saw the object coming over the hillside from the direction of Ixtapa when we first sighted it. I think at first glance it gave the illusion of rising up, but was actually moving over the hill and coming toward us. My initial feeling was curiousity. Once I could see the shape of the object and that it was not making a sound I then became more intent and somewhat in awe watching it. The fact of the matter is that I was so intent on watching this event from start to finish that I neglected to go into our room and get our camera. For this I am now kicking myself. I have been very interested in UFO's for many years, but even though I wanted to experience an event myself, I never had. I honestly thought I probably never would. This was very surprising and exiciting. ie: I approximated the size to be somewhat equivilant to a commercial jet aircraft, although I could not exactly judge the altitude in the night sky. The object also appeared to be following the coastline from my reference. We finally lost sight of it when one of the buildings on top of the eastern hill to our left blocked our line of sight. Our angle of sight was approx. 60-70 degrees. The object was not directly overhead but fairly close so that we were able to get a good visual of it."],"Source":"MUFON","Log Number":"MX-03062007-0007","Object Flight Path":"Straight-line path","Date of the Event":"02/28/2007 08:45 UTC","Summary":"Large perfect triangular object w/what looked like fire(possibly strobing lights)crossed over the bay","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile"}