{"Object Shape":"Triangle","Sighting Duration":"Undisclosed","Viewing Distance":"21-100 Feet","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Log Number":"US-03072007-0001","City":"Tallahassee","trends":["There have been 26 other sightings in Tallahassee","There were no other sightings in Tallahassee on or around"],"Date of the Event":"Unknown","Weather Factors":"None","Object Features":"Undisclosed","Summary":"Triangular-shaped object floating leisurely across the road","Country":"United States","Case Number":"6512","files":["/var/www/straped/mufon/html2text/6512.html.txt","/var/www/straped/mufon/org/6512.html"],"Latitude":"30.447996","Region":"Florida","Tags":"City","Date Submitted":"03/07/2007 05:41 UTC","divs":["Sighting DetailsThis was quite a long time ago, but certain aspects of the incident are still clear in my memory. I was driving home at around 12:30am on a back road in the northern part of Tallahassee, Florida. There were very few other cars on the road at the time. Without warning, I felt a strange sensation. It was almost a sound, but not quite. It felt like an extremely low frequency vibration that was just on the edge of the audible range. I noticed something at the top righthand corner of my windshield drifting slowly from right to left across the road. It didn't look like a conventional aircraft, so I slowed down and leaned forward over the steering wheel to get a better look. It was a dark, triangular object with an oval light on each of the three corners. I remember it being around 30 - 35 feet in diameter. It was low enough, maybe 50 feet or so, that I could actually make out the dark body in between the lights. In the middle of the triangle there was a smaller circle with a light in the middle. I don't remember if the circular portion was a dome shape or just a circular patern on the body of the object. I continued to drive slowly and watch it drift across the road and out of sight. It continued to \"vibrate\", but made no other sound. I'm familiar with Ed Walters' reports from Gulf Breeze and what I saw looked nothing like the photos or video he took. I did, however, see the exact object on a Discovery Channel special on UFOs being filmed over Mexico. With the nearby military bases at Pensacola, there's always the posibility it could be a military drone of some sort, but it definately wasn't a conventional fixed-wing or rotary air craft."],"map":"<A HREF = \"http://maps.google.com/maps?q=30.447996,+-84.275933(6512)&iwloc=A&hl=en\"> mufon case (6512) map </A>","Source":"MUFON","Longitude":"-84.275933"}