{"files":["/var/www/straped/mufon/html2text/6516.html.txt","/var/www/straped/mufon/org/6516.html"],"Sighting Duration":"Undisclosed","Object Shape":"Boomerang, Triangle","Disposition":"Unknown","Latitude":"32.268672","Source":"MUFON","Case Number":"6516","Tags":"City","Longitude":"-112.738759","City":"Why","trends":["There have been no other sightings in Why","This sighting has never been favorited."],"Region":"Arizona","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Date of the Event":"03/13/1997 07:30 UTC","Date Submitted":"03/13/1997 07:30 UTC","Country":"United States","Log Number":"US-03072007-0005","Summary":"We were driving on a 2-lane highway when we were shadowed by a UFO.","Viewing Distance":"21-100 Feet","divs":["Sighting DetailsMy husband and I were driving on Hwy 86 (A.K.A. Ajo Hwy) returning to Tucson from a working vacation weekend in Rocky Point, Mexico. We had left the town of Why, Az and I had been driving for a while. My husband was asleep. There was no radio reception in the area and I figured it was because we were going through the Reservation lands. Traffic was very sparse. I was contemplating a roadside pit stop and was looking out for a likely place to turn off. I spotted several dirt roads running perpendicular to Ajo Hwy but they each had a parked car, perhaps 50'from the intersection, with its headlights turned on and pointed at Ajo road. It was as if they were watching something. I thought it was strange. Plus, it prevented me from stopping. I kept on driving when I noticed in my rearview mirror that everything behind me was pitch black. Looking forward through my windshield was a beautiful bright starry sky. I thought it was awfully quick for a rain cloud to appear, so I turned to look behind me several more times. Then I leaned forward over the steering wheel and I looked straight up. I saw silently gliding above me a huge solid black morphing metallic UFO. It was so huge and so close (15'-25')that all I could see was a rounded nose cone with two, of what were surely many, gigantic round lights. I thought it was trying to remain unnoticed, because when I would lean forward to get a better look I would inadvertently ease my foot off the accelerator, it would end up gliding over the automobile hood and then quickly try to pull back to my speed. I did this a few times to be sure. I just felt my adrenaline rushing. In my head I kept saying \"This can't be happening\" over and over and over. I stayed calm but inwardly I was extremely panicked. After two good looks,and concluding that it was real, I leaned over and awakened my husband, calmly but urgently and asked him to look too. Yep, he saw it too. I remember trying to get the exact time and knowing that I would forget it, I noticed that it was dusk. That I can remember. For a brief moment I just gave into the helplessness of it all. Irrationally, I thought that if I would stop the car that it would be the end of us. To continue driving would keep us safe. Made no sense. After a few minutes the space ship just shot off at \"warp speed\" and I got a good look at it. It stayed low and headed to and along a large mountain range. Then it disappeared. It was about a third of the width of the mountain range-that could be a mile or more. I lighty predicted that it was headed for Prescott. Once we recovered our sense of control, I tried to find a radio station but nothing came up until we were almost to Kitt Peak. (I think about 45 minutes) I was so sure that this was \"the day the world stood still\". When we got to the outskirts of Tucson, the radio stations skeptically reported that there were lots of UFO sightings in Pima County. We got home at 9:55 PM and I didn't help unload the car until after the TV news was over. It's amazing that the whole incident was so successfully margionalized."],"map":"<A HREF = \"http://maps.google.com/maps?q=32.268672,+-112.738759(6516)&iwloc=A&hl=en\"> mufon case (6516) map </A>","Object Features":"Other"}