{"Date Submitted":"03/07/2007 07:30 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=26.924582,+-80.75924(6518)&iwloc=A&hl=en\"> mufon case (6518) map </A>","Date of the Event":"03/07/2007 07:30 UTC","Log Number":"US-03072007-0007","Latitude":"26.924582","Weather Factors":"Windy","Longitude":"-80.75924","Summary":"Alternating Red and white lighted object on overcast sky","Sighting Duration":"01:00:00","Tags":"City","Object Features":"Unknown","Source":"MUFON","Disposition":"Unresolved","Case Number":"6518","trends":["There has been one other sighting in Okeechobee","There were no other sightings in Okeechobee on or around March 7th 2007","This sighting has never been favorited.",""],"Object Shape":"Circle","City":"Okeechobee","Region":"Florida","files":["/var/www/straped/mufon/html2text/6518.html.txt","/var/www/straped/mufon/more/6518_submitter_file2__0040.JPG","/var/www/straped/mufon/org/6518.html"],"Country":"United States","Viewing Distance":"Unknown","divs":["Sighting DetailsMy roommate and I were at the corner store off of Highway 78W at 7:30PM when my roommate pulled me outside and pointed to the sky. It was overcast and nothing was visible in the sky except one circular object. It had red and white lights that were alternating. It hovered in the area and then shoot upwards at 7:45PM. When we returned to the house shortly there after, we live only 2 miles behind the store. It appeared again in the same area. At our house the sky was clear you could see the planets, stars, aircrafts, and even the satellites orbiting the Earth. This object was lower than satellites and in no possible a plane. It was doing circular movements, like down sideways and back up. I dashed into the house and grabbed my new digital camera and we headed for the canal dyke area which is about the highest we can go. I took pictures and recordings of the object in the air while my roommate took his LED Maglight and flashed at it like morse code. Amazingly enough it responded back and moved in our directions a little. We keep doing that until it went out of sight and then suddenly reappeared faintly in the distance. The footage I have is ruff, however I one recording I got the object making a downward descending. I am a skeptic when it comes to UFO's because I have never actually experienced anything close enough for me to say \"Yeah that is nothing I have never seen.\" But I still question tonight, what was that? Now I am really curious is something else really out there? Could that have been a UFO and if so I wonder what it thought the blinking of my roommate's light was. The attachment is the best video I got of it. The camera is steady until 1min43s when the camera about feel off the tripod when my roommate got into the car. The photos I took all turned out like the one I am posting."]}