{"Object Shape":"Unknown","Country":"United States","Date Submitted":"03/04/2007 12:00 UTC","files":["/var/www/straped/mufon/html2text/6521.html.txt","/var/www/straped/mufon/org/6521.html"],"Sighting Duration":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","Tags":"City","Viewing Distance":"Over One Mile","Case Number":"6521","map":"<A HREF = \"http://maps.google.com/maps?q=36.992277,+-91.969874(6521)&iwloc=A&hl=en\"> mufon case (6521) map </A>","Date of the Event":"03/04/2007 12:00 UTC","Longitude":"-91.969874","Summary":"three bright orange lights in the sky, close","City":"Willow Springs","Region":"Missouri","Disposition":"Unknown","Object Features":"Unknown","Object Flight Path":"Hovering then path","Log Number":"US-03072007-0010","Latitude":"36.992277","trends":["There have been 2 other sightings in Willow Springs","There were no other sightings in Willow Springs on or around March 4th 2007"],"divs":["Sighting DetailsI walked out side and noticed lights in the sky. The lights are the color of sodium vapor lights. (orange). I noticed these about 8-10 years ago at Mountain Grove, Missouri. These were the same lights but went off and on in a cycle. The lights appeared to be part of a circle. One would stay on for a while then up to three would come on differently but the same amount of time. I am 59, ex-cop and pilot. I would say they were around 5000 feet up and a dime would cover the lights. This thing was huge. These lights are the same color of artillery flares. But they were not, as we have no base close. The light timing varied from 5 seconds to one second. The thing the lights were attached to moved off to the East fairly fast. Later (fifteen minutes) on I saw the same lights to the West about fifty miles away. There was no sound. About ten minutes after I saw the last lights I called the local Highway Patrol (troop G) and asked them if they had any reports of lights in the sky and they cautiously stated \"no\". Sorry to say my camcorder batteries were dead! Thanks, Jim"]}