{"Log Number":"US-03082007-0001","Object Shape":"Unknown","Viewing Distance":"Unknown","Country":"United States","divs":["Sighting DetailsI was driving home from a night of ice blocking with 1 friend and i saw a light in the sky. At first i thought it was a plane but then it seemed as if it wasnt moving, and it was also chaning from an orange to a purple to a white and then red. I felt curious so i pulled my car over onto a side street and showed my friend. 2 other friends saw me on the side of the road and thought something was wrong so they pulled over. I showed them what we were watching and they got there camera out. We took 5 pictures and four of the pictures came out completely different than the next. It was about 12:00 or 12:30 on August 1st 2nd or 3rd. The lights appeared to be getting bigger and smaller in size very quickly. it then would make random sperts in different directions while changing colors to purple, orange, red and white. some times it would seem as if the light would fade completely away but then show back up again in the same position it dissapeared from. when the light became really tiny all four of us saw something shoot out from the light. it looked like a series of tinier lights coming from the light. All the lights at the time were red. as soon as it shot something out, the ufo made a rapid movement away from the series of lights and dissapeared. We were watching it for a good 30 minutes. Not one of us could think of what it could be other than a ufo. I was not scared at all durring this time, i was just in awe and puzzled."],"map":"<A HREF = \"http://maps.google.com/maps?q=34.277697,+-118.776822(6522)&iwloc=A&hl=en\"> mufon case (6522) map </A>","Longitude":"-118.776822","Date Submitted":"08/02/2006 12:00 UTC","Weather Factors":"Unknown","Case Number":"6522","trends":["There have been 20 other sightings in Simi Valley","There were no other sightings in Simi Valley on or around August 2nd 2006","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/6522.html.txt","/var/www/straped/mufon/more/6522_submitter_file1__ufo1.jpg","/var/www/straped/mufon/more/6522_submitter_file2__ufo5.jpg","/var/www/straped/mufon/more/6522_submitter_file3__ufo2.jpg","/var/www/straped/mufon/org/6522.html"],"Source":"MUFON","Date of the Event":"08/02/2006 12:00 UTC","City":"Simi Valley","Object Flight Path":"Undisclosed","Tags":"City","Disposition":"Unresolved","Summary":"light changing colors and hovering over town while changing directions quickly.","Object Features":"Undisclosed","Sighting Duration":"00:30:06","Latitude":"34.277697","Region":"California"}