{"Case Number":"6523","City":"Tampa","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=27.956055,+-82.450368(6523)&iwloc=A&hl=en\"> mufon case (6523) map </A>","Weather Factors":"Unknown","Tags":"City","Disposition":"Unresolved","Region":"Florida","Date Submitted":"03/08/2007 06:09 UTC","Country":"United States","Latitude":"27.956055","Object Features":"Undisclosed","Source":"MUFON","Date of the Event":"03/08/2007 06:09 UTC","Log Number":"US-03082007-0002","Object Shape":"Star-like","Longitude":"-82.450368","trends":["There have been 105 other sightings in Tampa","There were no other sightings in Tampa on or around March 8th 2007"],"Summary":"Two star-like objects moving together","Viewing Distance":"Unknown","divs":["Sighting DetailsAt 6:09am this morning went outside to retrieve the newspaper and looked up at the moon when I noticed two star-like objects to the left of the moon from my POV. Looking southwest. I realized that they were in motion and moving in a uniform speed and path. At first they appeared to be moving in a northeastern direction. My first thought was that they were satellites. I watched both objects moving, one just in aheaed of the other, but separated by some distance, when the object ahead faded out. Just about parallel with the position of the moon. I was still able to see the first object when the second object reached the first object's position, but parallel and it also faded out. After about another 30 seconds I was unable to see any of the objects. I realized that the objects were not moving in a northeastern direction, I would have seen them floating over ahead like satellites would in orbit. Have witnessed satellites in orbit before. My conclusions was that the objects were moving straight up into the sky. Waited for several minutes to see them reappear or something, but nothing. Both objects were very easily noticeable in the sky when I first saw them. I would think more people would have noticed them and I hope they make a report too."],"files":["/var/www/straped/mufon/html2text/6523.html.txt","/var/www/straped/mufon/org/6523.html"],"Sighting Duration":"Undisclosed"}