{"Object Flight Path":"Stationary","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Case Number":"6528","Viewing Distance":"Over One Mile","Latitude":"61.227306","Disposition":"Unresolved","trends":["There have been 24 other sightings in Anchorage","There were no other sightings in Anchorage on or around March 8th 2007","This sighting has never been favorited.",""],"Summary":"Adding pictures to star-like object over Anchorage night skies lately","Object Shape":"Circle, Star-like, Other, Unknown","Date of the Event":"03/08/2007 08:00 UTC","Tags":"City","Object Features":"None","City":"Anchorage","Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/6528.html.txt","/var/www/straped/mufon/more/6528_submitter_file1__mufon004.jpg","/var/www/straped/mufon/more/6528_submitter_file2__mufon006.jpg","/var/www/straped/mufon/org/6528.html"],"Date Submitted":"03/08/2007 08:00 UTC","Log Number":"US-03092007-0001","divs":["Sighting DetailsUsually right around 7pm it has been coming into view. One would think it was a sattelite, but no way of knowing for certain. I attempted to take many many pictures of it, but none came back as I thought. All of the pictures had streams of light emanating from the object. It has been over the city of Anchorage, i.e. the Cook Inlet, for several nights now. The other person who reported this light on the 6th mentions that even through a telescope it has streams of light emanating from it. Not sure what it is, but this is the first time all winter long that it has been viewable. Dont see how it could be a planet, its definitely within our atmosphere. Sattelite maybe, but why then the streams of light? I have noticed that since its arrival, the local Air Force Base, Elmendorf, has been relatively quiet. Actually, uncharacteristically quiet. My dad works on base and I am sure has also noticed the lack of jets in the skies over Anchorage, but I havent called him to ask if he has noticed. Not much more to add, just wanted to add the pictures. You can save the pictures, zoom in on edit, and see the streams of light I am talking about."],"map":"<A HREF = \"http://maps.google.com/maps?q=61.227306,+-149.899188(6528)&iwloc=A&hl=en\"> mufon case (6528) map </A>","Region":"Alaska","Longitude":"-149.899188"}