{"Country":"United States","Weather Factors":"Unknown","divs":["Sighting Details i was sleeping and my bed is next to and under a large window. the venetian Blinds were up. i woke up at 4:26 AM. And out of the corner of my eye i saw. A moving light. As i was watching i opened the window and screen. To see bettar. The Moon was Low in the sky i saw a trail of light thousands high Contrail coming from my direction low in the sky traveling across from me to under the partial moon going under the moon. and past it towards the earth. Then Much Higher in the sky At a steeper angel a lengthening contrail traveling across going down from way above the moon to below it. Their was a very Bright cluster of lights blinking at the end of the contrail of light. The higher one appeared first then the lower one had a much wider trail this also went towards the ground. I first thought it was a meteor shower. Then as i watched it was acting strange the end of it the Bright Part of it was morphing. At the time i was woken up by??? And looked out the Window. I had been woken up by a unusual sound. i don't know what the sound could have to do with the moving lights in the sky."],"Tags":"City","Disposition":"Unresolved","Sighting Duration":"04:28:09","City":"New York","Viewing Distance":"Over 1 Mile, Unknown","Object Shape":"Fireball, Flash, Oval, Square, Rectagular, Other","files":["/var/www/straped/mufon/html2text/6529.html.txt","/var/www/straped/mufon/org/6529.html"],"Latitude":"40.722223","Log Number":"US-03092007-0002","Object Flight Path":"Straight-line path","Object Features":"Unknown","Source":"MUFON","Region":"New York","map":"<A HREF = \"http://maps.google.com/maps?q=40.722223,+-73.996763(6529)&iwloc=A&hl=en\"> mufon case (6529) map </A>","Date Submitted":"03/08/2007 04:28 UTC","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around March 8th 2007"],"Longitude":"-73.996763","Case Number":"6529","Date of the Event":"03/08/2007 04:28 UTC","Summary":"Huge Cluster of Circles and morphing Squares, Brighter than the mooon"}