{"Object Flight Path":"Hovering then path,Path then hovering","Tags":"City","Log Number":"US-03092007-0007","Weather Factors":"Unknown","Source":"MUFON","Case Number":"6534","Region":"North Carolina","map":"<A HREF = \"http://maps.google.com/maps?q=35.262664,+-77.581635(6534)&iwloc=A&hl=en\"> mufon case (6534) map </A>","Date of the Event":"12/27/1997 10:30 UTC","trends":["There have been 3 other sightings in Kinston","There were no other sightings in Kinston on or around December 27th 1997"],"Date Submitted":"12/27/1997 10:30 UTC","divs":["Sighting DetailsMy parents and I were out on our deck smoking,talking and looking at the stars. It was a beautiful, clear night! The stars were at their peak, as if you could reach right up and touch each and every one of them! We were talking about the sky and different star clusters when all at once something strange was appearing to come right at us. As this thing got closer to us, I asked my parents,\"What the HELL is that?!\" My mother just looked at the thing as if she couldnot believe her eyes. My father said,\"I be damned if I know! We just watched as it hoovered over the house behind us, which is appro. 75-80 ft away from us. The lights on it were flashing in sequences like christmas tree lights. We just stared. I told my moma and dad, I had to go in and get my husband so he could see this and that he would never believe it if I didn't but at that moment it was as if I couldn't take my eyes off the lights! It was like something out of TV or a dream! Finally, I ran in the back door, and yelled for him to come out now! I turned around and ran back out. Just as I got out it shot right straight up and disappeared! I said \"where did it go?\" and my mom said up somewhere?! She said, \"I'm 69 years old and I have never, never seen anything like this in my life and probably never will again. I think if there is such things as UFOs, we just saw one!\" My dad said, \"Well, I think we just saw exactly that, a UFO!\" I personly was still shaking from seeing this thing. When my husband came out and we told him what happened, he just looked at us as if we were crazy and so does people that I tell about it. But it happened and I'm glad I got to witness this with my parents because my mom died in April of 1998 and my father died in June of 1999. Until they died, we spoke often of what we witnessed that beautiful night and wonder what and where it came from. Even a week before my father passed away, He and I were telling a friend of his about it. He was in the hospital at that time and later this man asked me if it were true. I told him, \"I promise you on my son's life it is true! This is my story, honestly.\""],"Latitude":"35.262664","Viewing Distance":"21-100 Feet","Object Features":"Unknown","City":"Kinston","Summary":"appeared to be round with lights flashing in sequencesmy","files":["/var/www/straped/mufon/html2text/6534.html.txt","/var/www/straped/mufon/org/6534.html"],"Sighting Duration":"00:10:00","Longitude":"-77.581635","Country":"United States","Disposition":"Unknown","Object Shape":"Disc, Flash"}