{"Date Submitted":"03/09/2007 12:05 UTC","Longitude":"-110.919909","divs":["Sighting DetailsWhile picking up my son from The Montessori Schoolhouse near the intersection of 6th Ave. and Speedway Blvd. at five minutes after noon I looked up at the chemtrails and noticed a white dot next to one. It remained stationary so I pointed it out to my mom and to some adults (teachers and two parents) on the schoolyard. We observed it for about ten minutes from the schoolyard and parking lot combined. It seemed to move, but the movement was perhaps the chemtrail moving. When the UFO was in the chemtrail it was hard to see. It did not seem to give off light but rather to be a white sphere or metalic sphere. It was observed northwest of the Santa Catalina mountains, high in the sky. I called George Parks on my cell phone and reported it to him. He is the State Section Director of MUFON here. I lost sight of the object because I decided to get in my car and leave after some time. I took a photo of it with a disposable camera. I don't suppose it will be visible in the photo because the camera did not have a telephoto lens. I was very excited to see it as it looked like the orbs often seen floating in flotillas in Mexico. There was only one, however. I was with my mother, who is visiting from Alabama. That also made it more exciting. One of the witnesses, a parent, had had a previous sighting and is a Coast to Coast fan. He may go to the MUFON meeting tomorrow because I told him about our meetings after he asked me about my being a \"UFO expert.\" I am a MUFON member and abductee. This was my second sighting in Arizona since I moved here last year. The other one was an orange orb trailing a plane at night. I have had two other daylight sightings in Los Angeles and two night time sightings in the California deserts."],"Weather Factors":"None, Does Not Apply","Case Number":"6535","Latitude":"32.224443","Object Features":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.224443,+-110.919909(6535)&iwloc=A&hl=en\"> mufon case (6535) map </A>","Summary":"While picking up my son from school I looked up at the chemtrails and noticed a white dot next to a chemtrail. I observed it with at least three witnesses for around ten minutes.","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around March 9th 2007"],"City":"Tucson","Viewing Distance":"Over One Mile","Disposition":"Unknown","Object Shape":"Sphere","Date of the Event":"03/09/2007 12:05 UTC","Region":"Arizona","Log Number":"US-03102007-0001","Source":"MUFON","files":["/var/www/straped/mufon/html2text/6535.html.txt","/var/www/straped/mufon/org/6535.html"],"Sighting Duration":"Undisclosed","Object Flight Path":"Unknown","Country":"United States"}