{"Date Submitted":"03/09/2007 11:30 UTC","Disposition":"Unknown","Longitude":"-94.570417","Country":"United States","Sighting Duration":"Undisclosed","Summary":"bright fast moving lights no sound erratic behavior","Latitude":"39.103206","Source":"MUFON","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.103206,+-94.570417(6536)&iwloc=A&hl=en\"> mufon case (6536) map </A>","divs":["sighting detailsat around 11:30 pm march 9 2007 we were in an apartment in kansas city mo, city market area, third floor with windows facing the west. we were (4 people) were in the living room when a fast moving bright light went overhead. my friend was standing at the open window when it went over and heard no noise. we watched thru the window as it moved northwest at rapid pace. there was at least 3 white lights in what seemed to be in a triangluar pattern. it went to the area of the kansas city downtown airport, seemed to hover, the white lights went off, but red lights came on in the same pattern, then it seemed to disappear for maybe 5 seconds. it reappeared over the area of the airport, still hovering, went north slightly, went south slightly, hovered over the same area, the white lights came back on, and then it quickly moved south. we watched until it went behind the downtown skyline, and we lost it. there was no noise, no sound. i called 911 and the operator asked my location, i described what i saw, and i asked if there were any helicopers flying in the area. she said no, and that my call wasn't the first one she had gotten about the incident. after the call, 5 minutes later, i went outside on the fire escape\\balcony and noticed 2 helicopters going towards the airport with spotlighs on. we called the local fox newsline and told them what happened. it moved too fast for a helicopter and too quiet for a plane and it moved fast. please contact us, we are excited about what we saw! it was amazing!"],"City":"Kansas City","Viewing Distance":"101-500 Feet","Tags":"City","files":["/var/www/straped/mufon/html2text/6536.html.txt","/var/www/straped/mufon/org/6536.html"],"Object Features":"Unknown","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Region":"Missouri","Log Number":"US-03102007-0002","Case Number":"6536","Date of the Event":"03/09/2007 11:30 UTC","trends":["There have been 134 other sightings in Kansas City","There were no other sightings in Kansas City on or around March 9th 2007"],"Object Shape":"Triangle"}