{"Log Number":"US-03102007-0006","Sighting Duration":"Undisclosed","Object Shape":"Triangle","Case Number":"6540","Object Flight Path":"Hovering then path,Path with directional change","files":["/var/www/straped/mufon/html2text/6540.html.txt","/var/www/straped/mufon/org/6540.html"],"Tags":"City","divs":["Sighting Details20 years ago, my Aunt was driving myself, my sister, and cousin to get ice cream. My cousin and I were in the back seat of the car goofing around (this is going to sound stupid) imitating the opening scene to \"Leave it to Beaver\" when he's in the back seat of the car and then turns around and looks out the back window. Well, we did that and when we looked out the window and looked up we saw the UFO in the tree line. We screamed (we were 13 at the time) and my Aunt stopped the car and pulled over. We all got out of the car and stared up at the triangle shaped object that hovered above us. There was no noise. The object had red, green, and clear lights outlighting it. We stood there for no more than 2 minutes and the object then shot vertically up extremely fast and then moved horizontally in the sky at an extremely fast speed. It was out of our sight very quickly. We stood there in awe and I remember my Aunt saying \"That was no airplane\". We all knew it was nothing we had ever seen before. I remember not being scared, just more amazed. If I was by myself I may have been scared. We contemplated calling the police, but did not after realizing that there would be nothing they could do. If I remember correctly, there was a story in the local newspaer \"The New Jersey Herald\" about strange lights seen over Sussex County. I think about that night often, and even 20 years later, my sister, cousin, and I remember that night clearly. It's definitley something I will never forget."],"Longitude":"-74.632222","City":"Sparta","Country":"United States","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.038333,+-74.632222(6540)&iwloc=A&hl=en\"> mufon case (6540) map </A>","Date Submitted":"06/30/1987 09:00 UTC","Region":"New Jersey","Viewing Distance":"21-100 Feet","Weather Factors":"None","Object Features":"Unknown","Latitude":"41.038333","Date of the Event":"06/30/1987 09:00 UTC","trends":["There has been one other sighting in Sparta","There were no other sightings in Sparta on or around June 30th 1987"],"Disposition":"Unknown","Summary":"UFO appeared over tree line. Triangle shaped, red, green, and clear lights."}