{"Source":"MUFON","Disposition":"Unknown","Case Number":"6543","Region":"Iowa","Object Shape":"Unknown","Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=41.432173,+-91.041855(6543)&iwloc=A&hl=en\"> mufon case (6543) map </A>","Longitude":"-91.041855","Tags":"City","Viewing Distance":"Over One Mile","divs":["Sighting DetailsWas out walking the dog when noticed at about nine o'clock in the western sky a brilliant white light. The light appeared to be hovering and steady in brilliance. It then became brighter and moved southerly at a rapid speed approximately five miles. The light itself seemed to be about fifteen miles away from my house. It's brilliance made it easy to follow through the trees. It again hovered steadfast over one location for five minutes before the brightness began to fade and then change to blue making it difficult to see in the night sky. After about one minute it then regained its bright white color and remained in the same location and moved in a northerly direction a slight distance, I did not have to move much to regain sight through the trees. I then put the dog in the house and yelled for my wife to come out and look at the light. It remained bright white in color and was easy to find again and point out to my wife. It had move only a slight distance from when I let the dog in. My wife noticed its color and brilliance changes and asked what it was. I didn't have a clue and said so. My wife then went back into the house. I continued to watch the light do its slow color changes and movements normally south a few miles for about five minutes. I then noticed the light began to pulse between bright white and deep blue and back in closer intervals. I began to notice numerous jets flying towards the light from the east, north, and south. These craft were easy to determine because of their flashing lights and engine noise. The white light then began to move while pulsating between colors in a zig-zag motion northeast to southeast. It almost appeared to be a fiber-optics strand with only the end visible being swung through the air. I wondered why would intelligent beings do stupid things like that. The light then dimmed to a low brilliance white and dropped below the tree light so I could not follow it any more. I waited and watched for another five minutes before coming in the house."],"Date of the Event":"03/10/2007 07:20 UTC","Object Features":"Unknown","trends":["There have been 4 other sightings in Muscatine","There were no other sightings in Muscatine on or around March 10th 2007"],"Date Submitted":"03/10/2007 07:20 UTC","Weather Factors":"Unknown","City":"Muscatine","Sighting Duration":"Undisclosed","Log Number":"US-03102007-0009","Summary":"Bright white light dimming to blue doing rapid lateral movement then hovering","files":["/var/www/straped/mufon/html2text/6543.html.txt","/var/www/straped/mufon/org/6543.html"],"Latitude":"41.432173","Country":"United States"}