{"Sighting Duration":"Undisclosed","Latitude":"40.743368","Object Shape":"Triangle","Object Flight Path":"Hovering then path","Viewing Distance":"21-100 Feet","Region":"Illinois","files":["/var/www/straped/mufon/html2text/6547.html.txt","/var/www/straped/mufon/more/6547_submitter_file1__Gridley-IL.jpg","/var/www/straped/mufon/more/6547_submitter_file2__Gridley-IL_b.jpg","/var/www/straped/mufon/org/6547.html"],"Case Number":"6547","Source":"MUFON","City":"Gridley","Log Number":"US-03122007-0001","Object Features":"Patterned Surface","Longitude":"-88.881458","divs":["Sighting DetailsI was in the kitchen getting ready to feed my bunny when all of a sudden I got hot from the inside out and had to run outside because of the heat..it was pretty dark outside and around 9pm...I looked toward the North and saw two huge white lights in the sky(fairly low) through the pine trees that were coming right towards our apartment...there was no noise the whole time this was happening...I called for my 25 year old daughter to come out and look and I asked her to run and get the binoculars...After she gave it to me, it hovered for almost a minute or two above us. It swayed from side to side and at one point stood up and looked tall but then went back to it's triangular shape...we could see pulsating white and red lights...and it was huge! We agreed on what we both saw...it was definitely a UFO. After we looked through the binoculars and saw details of the ship it was obviously not of our world! It was a dark gray color with odd looking squiggly like markings on it. My daughter got scared when she saw it up close with the binoculars and was trying to pull me back inside...I was pretty shook up too..I ran back out to see if it was still there and it was heading south of town. I watched it until it disappeared."],"Country":"United States","Summary":"My daughter and I saw a triangular craft over our home with pulsating white and red lights","Disposition":"Unknown","Weather Factors":"None","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.743368,+-88.881458(6547)&iwloc=A&hl=en\"> mufon case (6547) map </A>","trends":["There have been no other sightings in Gridley","This sighting has never been favorited."],"Date Submitted":"02/21/2007 08:15 UTC","Date of the Event":"02/21/2007 08:15 UTC"}