{"trends":["There have been 2 other sightings in Flushing Township","There were no other sightings in Flushing Township on or around March 10th 2007"],"Object Features":"Unknown","divs":["Sighting DetailsI was just getting ready to head to a friends house warming party when I looked off towards my house. I couldn't see my house, but I looked in the direction as I was looking down towards the river that goes through my town. As I was looking, I noticed an extremely bright, flashing light. It was flashing white, red, and orange. I enjoy looking at stars, and I know that this was nothing of the sort. I knew what direction I was facing, but just to make sure it wasn't Venus I looked towards where Venus is normally and there it was, bright and white. I continued to stare at the object as I was driving, and then I looked back at the road when my cell phone rang and about two minutes into the conversation, I looked back and the light was totally gone. I have seen this light before in different areas of the sky as well, but mostly in the area that I was looking this night. I can see it from just about anywhere I go, too, and it doesn't go down the horizon at all when I move over the curve of the earth. Later on in the evening once I reached my friends house, I got out of my car and went up to his car and started to talk to him. When I looked off to the horizon down the street, I saw a bright, completely red light. I was not familiar with the area that this house was in so I figured it was the light on top of a water tower or something similar. I started talking to my friend again, and for one reason or another, I looked up and just as I did, I saw the red light take off in an extremely fast pace, disappearing behind a house on the horizon. I know that it was not a plane because it literally sat on the horizon for ten minutes while I talked to my friend, all of a sudden to just immediately take off north. I told my friend about it was it was moving, and I never looked away. By the time he got out of his car and looked, it was gone. He got out of his car immediately, so it shows just how little time he had to actually see the object."],"Object Shape":"Fireball","Country":"United States","Log Number":"US-03132007-0002","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Longitude":"-83.863937","Latitude":"43.108875","map":"<A HREF = \"http://maps.google.com/maps?q=43.108875,+-83.863937(6549)&iwloc=A&hl=en\"> mufon case (6549) map </A>","Date of the Event":"03/10/2007 08:15 UTC","Source":"MUFON","Date Submitted":"03/10/2007 08:15 UTC","Weather Factors":"Unknown","City":"Flushing Township","Summary":"Flashing, extremely bright, light","Viewing Distance":"Unknown","Region":"Michigan","Disposition":"Unresolved","Tags":"City","files":["/var/www/straped/mufon/html2text/6549.html.txt","/var/www/straped/mufon/org/6549.html"],"Case Number":"6549"}