{"Case Number":"6553","divs":["Sighting DetailsIt was a bright clear spring morning in mesa arizona. We went to the end of gilbert road and The Salt River. The river was flooding due to spring snow melt and rain. As me and two other friends watched the flood along with a dozen or so others in the area not known to us, I noticed a hang glider coming in very low from the south behind us. I asked Don and Dave where could a hang glider take off from around here. They did not pay attention to me the first time I asked. The craft was moving very slowly 5miles per hour tops. As It got within 150yards I could see it was not a hang glider at all , It was a dull matalic wedge shaped craft about 6 to 8 ft long 3 ft wide 2ft tall. It was silent. It had rods coming out from the front four corners at 45deg from the hull the same from the rear four corners. The rods were facing forward in the front and backward in the rear. I grabed my friend by the arm and said That Is no hang glider. They then turned to watch as the craft went over and to the east. We all watched speachless as the craft slowly rose as it went to the north east over Red Mountain .I watched untill it was just a dot. It never made a sound or changed speed.No lights No windows, no sound. We went back to dons apt and all made a picture of what we saw. They were the same, Don and Dave were very sceptical yet they new what we saw. Over the years Iam the only one who likes to talk about it. They seem bothered by the encounter.It was the most incrdible thing I ever saw. I have been in Aerospace for 21 years and still would like to see another one."],"Longitude":"-111.824362","Sighting Duration":"00:03:00","trends":["There have been 73 other sightings in Mesa","There were no other sightings in Mesa on or around April 15th 1980"],"Country":"United States","Log Number":"US-03142007-0002","Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=33.416884,+-111.824362(6553)&iwloc=A&hl=en\"> mufon case (6553) map </A>","Disposition":"Unresolved","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Date Submitted":"04/15/1980 11:30 UTC","Date of the Event":"04/15/1980 11:30 UTC","Region":"Arizona","Summary":"We were watching the Salt River during a spring time flood and I saw a Hang glider coming from the south, as it closed to within 150 yards it was clere it was a wedge shaped craft 6 to 8 foot long with rods on the front and rear corners.","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/6553.html.txt","/var/www/straped/mufon/org/6553.html"],"Weather Factors":"Unknown","City":"Mesa","Latitude":"33.416884","Tags":"City","Source":"MUFON"}