{"files":["/var/www/straped/mufon/html2text/6554.html.txt","/var/www/straped/mufon/org/6554.html"],"Summary":"Woke up to use bathroom. Climbing up my bunk-bed and out the window I saw a Glowing sphere floating diaganoly up between the woods and building.","trends":["There have been 11 other sightings in Portsmouth","There were no other sightings in Portsmouth on or around September 13th 1996"],"Object Features":"Unknown","Date of the Event":"09/13/1996 03:00 UTC","Disposition":"Hoax","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=43.075455,+-70.756113(6554)&iwloc=A&hl=en\"> mufon case (6554) map </A>","Object Flight Path":"Hovering then path","Longitude":"-70.756113","Latitude":"43.075455","Country":"United States","Case Number":"6554","Region":"New Hampshire","Date Submitted":"09/13/1996 03:00 UTC","City":"Portsmouth","Weather Factors":"Unknown","Viewing Distance":"21-100 Feet","Tags":"City","Sighting Duration":"00:00:05","Log Number":"US-03142007-0003","Object Shape":"Sphere, Star-like","divs":["Sighting DetailsI woke up and had to use the bathroom. I had a bunk bed with my older brother. I slept on the top bunk so I had to climb down to use the bathroom. The bathroom was halfway down the hall between the bedrooms and the living room. The living room was dark, but the bathroom light was on so I had no problem getting up to go. I went back into my room to go back to sleep. As I was climbing up to get back into bed, I saw a glowing orb outside my window move diagonally up and to the right slowly. It disappeared from view. I was in shock and scared, but I still ran to the window to see it. In the short time that it had moved out of my view and me running to the window it had disappered. It was by far the most frightening part of my life. I told my friends and I told my sister, but to this day I have not told my parents do to the fear of them not believing me. One scarier part of this is the fact that you would think this was a once in a lifetime event. Something you would see by chance just once. It happened again two nights later. Same events. I woke up to use the bathroom, but this time I checked my parents clock as I walked by their bedroom. The time was 3:35 AM. I saw the orb and when I ran to the window it wasn't there. The second time I saw it I turned the lights and the television on and slept on the floor at the foot of his bed. I never told my brother or my parents about the experience. So far I don't think anyone believes me, but it doesn't matter because I know what I saw. It was to close to be a plane. It made no sound at all. It happened twice. It didn't move fast from what I had seen and it disappeared instantly. I was twelve when this happened. The only reason I am reporting this is because the newspaper had an article about this site. I also think about it a lot and I've just had a more recent sighting. I have no evidence for it not something I could've planned."]}