{"Disposition":"Unknown","Longitude":"-112.421806","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Latitude":"33.300007","Country":"United States","Tags":"City","divs":["Sighting DetailsAbout a month ago I witnessed three lights heading south bound that looked like flares. Then one of them moved away from the others and disappeared. Then subsequnetly reappeared. Then all three headed away from me very rapidly and disappeared. I told my wife about it. She reacted very nonchalantly about it. Then, last night I was walking out of my garage and my niece who was visting my sister in law across the street, ran up to me and said \"look uncle we see some UFOs.\" I looked out across the sky and saws two lights next to each other. I called my wife to look and I told here that, that's what I had seen last month. We all watched as they both went up and disappeared. Besides my niece, there were three nephews and my sister in law who witnessed this event. We have not discussed it either! As we all stood outside, the lights reappeared one above the other this time. They began to decend. The top one would disappear then reappear below the other then the other one would disappear and reappear below the other. This occurred several times untill they both reached the bottom and disappeared."],"trends":["There have been 33 other sightings in Maricopa","There were no other sightings in Maricopa on or around March 13th 2007"],"Region":"Arizona","Log Number":"US-03142007-0005","Date Submitted":"03/13/2007 12:00 UTC","files":["/var/www/straped/mufon/html2text/6556.html.txt","/var/www/straped/mufon/org/6556.html"],"Date of the Event":"03/13/2007 12:00 UTC","Case Number":"6556","City":"Maricopa","Object Flight Path":"Path with directional change,Path then hovering","Source":"MUFON","Object Features":"Unknown","Viewing Distance":"Over One Mile","Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=33.300007,+-112.421806(6556)&iwloc=A&hl=en\"> mufon case (6556) map </A>","Summary":"I saw two lights in the distance that were stationary, looked like automobiles. Then both started to move upwards and quickly disappeared. Then they both reappeared and moved downward disappearing and taking turns reappearing."}