{"Viewing Distance":"501 Feet - 1 Mile","Tags":"City","trends":["There have been 12 other sightings in St Charles","There were no other sightings in St Charles on or around March 10th 2007"],"Date of the Event":"03/10/2007 08:05 UTC","Case Number":"6558","Object Flight Path":"Straight-line path","Country":"United States","City":"St Charles","Region":"Illinois","divs":["Sighting DetailsI was in my hot tub only 10 sec. looking up at the clear star lit night when a triangular object flew over my head. It appeared very low, less than 1000 ft. It was very large, dark arrowhead shape with a concave back traveling very fast. I could see the entire shape as it was lit with little white lights around the perimeter of the craft. The lights weren't shining but twinkling. It was thin and curved like an arrowhead. It seemed very stealthy and emitted no sound. It was about the size of a stealth fighter. The size of it with no noise totally scared me. The only way I saw it was because I was looking in the right place at the right time or you would have never seen it. It was traveling East to West in a straight line. Approx. Dupage airport toward Dekalb. Just north of Rt. 38. I called the local police dept., but no one had reported anything. I did notice the dogs in the area barking after it went by. My heart was going 100 mph, it was very scarry, yet I wanted to see it again. I'm posting this hoping someone else saw what I saw. It was only 4 seconds as it flew over the trees and houses, but I know what I saw."],"Summary":"Arrowhead shape UFO with little white lights around perimeter flew over my head","Weather Factors":"Does Not Apply","Log Number":"US-03142007-0007","Object Features":"Wings","Sighting Duration":"Undisclosed","Object Shape":"Triangle, Other","Date Submitted":"03/10/2007 08:05 UTC","files":["/var/www/straped/mufon/html2text/6558.html.txt","/var/www/straped/mufon/org/6558.html"],"Latitude":"41.913611","map":"<A HREF = \"http://maps.google.com/maps?q=41.913611,+-88.310833(6558)&iwloc=A&hl=en\"> mufon case (6558) map </A>","Disposition":"Unknown","Longitude":"-88.310833","Source":"MUFON"}