{"Date Submitted":"03/14/2007 06:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.780941,+-119.412572(6559)&iwloc=A&hl=en\"> mufon case (6559) map </A>","Source":"MUFON","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/6559.html.txt","/var/www/straped/mufon/org/6559.html"],"divs":["Sighting DetailsI was sitting on the side porch of my house in the country 4 miles from Buttonwillow, a small town of 2000 people. It was approximately 6 p.m. in the evening. I saw something out of the corner of my eye, looked up and saw what at first I thought was a very large jet. Then I noticed there were no wings and no tail. It was very shiny silver and was approximately 3 football fields in length it seemed anyway.It was very straight, no curves. It was quite far away but I could see it clearly. It was a long cylinder with 3 things on the top of it that looked like fish gills sticking up. In comparison to the cylinder, they were very small, one in the front, one in the middle and one at the end, but they were on top of it, not to the sides and not underneath. It was traveling slowly from the south to the north and then dissappeared. It was moving in a steady motion, not wiggily like the saucer ufos many times do. I wasn't surprised to see it because I have seen ufos quite a few times. I just wish I had gotten my camera and taken a video or snapshot. It was really beautiful. It was so shiny and silvery. I was not afraid. Actually once about 40 years ago I saw a similiar object in Shafter, California. But it was red, like blood. It also passed overhead at a slow steady pace."],"Longitude":"-119.412572","Object Shape":"Cylinder","Object Features":"Other","Country":"United States","Object Flight Path":"Straight-line path","trends":["There have been no other sightings in Buttonwillow & Bakersfiel","This sighting has never been favorited."],"Weather Factors":"None","Sighting Duration":"Undisclosed","Log Number":"US-03152007-0001","City":"Buttonwillow & Bakersfiel","Case Number":"6559","Region":"California","Disposition":"Unknown","Date of the Event":"03/14/2007 06:00 UTC","Latitude":"36.780941","Tags":"City","Summary":"long shiny silver cylinder; about 3 football fields in length; had a trail;"}