{"trends":["There have been 7 other sightings in Stone Mountain","There were no other sightings in Stone Mountain on or around March 11th 2007"],"files":["/var/www/straped/mufon/html2text/6561.html.txt","/var/www/straped/mufon/org/6561.html"],"Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was out for an evening of telescoping and star gazing at mu home in Atlanta Ga.- It was was 3:27 am sun morn. I was using the finder scope that came with my telescope , it has a 6 x 30 magnification and is great for viewing large areas of the night sky with a good amount of magnification. I had been out looking into the heavens for aprox. 2 hours when a pulsating very bright ligh came into my view from the right side. The light was not blinking , but pulsating, and that in itself struck me as odd looking, the pulsation of the light enabled me to track the fligh path, had it been blinking i would not have been able to. I thought at first that maybe i was looking at sevral lights independant of each other. I thought this only for a split second when i pulled the scope away from my eye, only to not see anything. I quickly re-positioned the finder scope and to my utter amazement, the pulsating light moving extremely quickly across the sky performed a triangular flight pattern before i lost it behind the trees or it took off so fast that i could not tell if it had disspeard behind the trees or just took off. I think the object was very far away,while not visible to the naked eye , i could clearly see it through the high magnification of the finder scope. I now go out every night between 2-4 am and just use my binoculars to scan the Heavens and to behold the beauty of the constellation that are not clearly visible with the naked eye, and for whatever else i might be privy to behold amidst the starry skies. I actually cried after seeing this performance- i never thought i would be privy to such an incredible display of aeronautics. I have read about various UFO sightings , and had I not read previous info , I might not have recognized the mportance of what i saw, the pulsating -electro magnetic self illuminated light in the sky- perhaps in space, and then to witness the incredible manuevers i witnessed - wow - what a joy- i too can now say - I have seen something , I know not what for sure, but there is a good possibility that it was a UFO of the type most commonly seen by those who have truly seen these crafts and know their behavior. I count it all joy- what an earth we inhabit."],"Summary":"while scanning a constellation in the southern sky- a pulsating very bright light came into my spotting scope and then did a triangular flight pattern all the while pulsating - not visble to the naked eye.","Log Number":"US-03152007-0003","Weather Factors":"Unknown","Disposition":"Insufficient Data","Object Features":"None","Object Shape":"Flash, Other","Date of the Event":"03/11/2007 03:27 UTC","Case Number":"6561","Country":"United States","Longitude":"-84.160696","Source":"MUFON","Tags":"City","Region":"Georgia","map":"<A HREF = \"http://maps.google.com/maps?q=33.812871,+-84.160696(6561)&iwloc=A&hl=en\"> mufon case (6561) map </A>","Viewing Distance":"Over One Mile","City":"Stone Mountain","Latitude":"33.812871","Object Flight Path":"Path with directional change","Date Submitted":"03/11/2007 03:27 UTC"}