{"Country":"United States","Summary":"Saw a triangle-shaped ufo fly over my car as I was driving to a friend's house.","Date Submitted":"03/14/2007 08:03 UTC","City":"Trussville","Longitude":"-86.607746","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"00:00:20","Latitude":"33.625265","Source":"MUFON","Date of the Event":"03/14/2007 08:03 UTC","Object Flight Path":"Path with directional change","Tags":"City","Region":"Alabama","Weather Factors":"Unknown","trends":["There have been 3 other sightings in Trussville","There were no other sightings in Trussville on or around March 14th 2007","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/6564.html.txt","/var/www/straped/mufon/more/6564_submitter_file1__ufo2007.jpg","/var/www/straped/mufon/org/6564.html"],"Log Number":"US-03152007-0006","Object Shape":"Triangle","Case Number":"6564","Disposition":"Unknown","Object Features":"Unknown","divs":["Sighting DetailsI was driving to my friend's house, going the same route I always do on Chalkville Road. It was a clear, pleasant night in March. After I crested the hill I was on and took a left, I saw a remarkably lit triangular shaped craft right in front of me. It was on either one of its sides where its distinct triangle shape could not be mistaken. My initial impression was that this had to be some kind of plane, but the more I looked at it, the less it looked like any conventional airplane. My next thought was that maybe it was one of those stealth bombers because of its triangle shape. But this craft had a large red, circular light in the middle of it. One white light on its nose, three white lights on its rear. I think there was one white light on the other two sides, but I can't remember that detail because I was transfixed by it. Shortly after getting a good look at it, I started looking all over for a blinking light somewhere, the kind that all planes have. There was no blinking lights, the lights on it all stayed constant. The craft was on its side when I first saw it, then it flattened out as it flew off into the distance, heading west. My car has a digital compass in the top center console, so I know the direction is correct. Also, I always have my driver's side window cracked to thump out ashes and to be able to hear any possible sirens. I mention this because I didn't hear any engine noise, which should have been significant because it was pretty close at first. The details I kept coming back to were its triangle shape, large red light in the middle of it and no blinking lights anywhere. I thought as it flew off and it straightened out that I might see a blinking light somewhere on it since it was at a different angle then. No blinking lights. I've tried to figure the distance it was from my car and estimate its size, but I really can't. I wished I had taken a picture with my camera phone because it was close enough to make a good picture, but its hard to think straight when you're looking at what I think was a ufo. It was mesmerizing to look at, I couldn't believe what I was seeing. The large red light in the middle of it had me perplexed and stunned. After turning off Chalkville Road, I came to a stop to look at it and had to glance behind me a couple of times just to make sure another car didn't hit me. As it flew off I drove again to try to keep eye contact with it. I did for a short while. Two other cars traveling on the same road passed by going in the other direction. I shortly thereafter saw a plane fly overhead once I got to Parkway East, a half mile away. I mention the plane because it was easily recognizable, as was its blinking light. I'm not sure what it was, but it was amazing looking. I wished I had taken a picture of it with my cell phone."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.625265,+-86.607746(6564)&iwloc=A&hl=en\"> mufon case (6564) map </A>"}