{"City":"Guildford","Log Number":"GB-03162007-0001","map":"<A HREF = \"http://maps.google.com/maps?q=51.23622,+-0.570409(6565)&iwloc=A&hl=en\"> mufon case (6565) map </A>","Weather Factors":"Unknown","Summary":"At the time I just thought it was weird, but I have thought about this for years.","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Longitude":"-0.570409","Object Shape":"Cylinder","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Stationary,Hovering then path,Path then hovering","Latitude":"51.23622","Country":"United Kingdom","Date Submitted":"05/10/1961 08:45 UTC","Tags":"City","trends":["There have been 3 other sightings in Guildford","There were no other sightings in Guildford on or around May 10th 1961","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/6565.html.txt","/var/www/straped/mufon/more/6565_submitter_file1__FlightofCylinder.jpg","/var/www/straped/mufon/org/6565.html"],"Source":"MUFON","Disposition":"Unresolved","Case Number":"6565","Date of the Event":"05/10/1961 08:45 UTC","Region":"England","divs":["Sighting DetailsI was walking to school ( George Abbott Scool for Boys ) which is at one end of the road and the girls school was at the other, they are all one now. From where I lived I had to come along an alley way, which went under a railway line and then stopped by the gates of the girls school. As I got to this point I noticed an object in the sky which was strange. This was a brown cylinder, it was approx 2,000 feet up very distinct, the sky was clear, If I had the camera that I have now, Nikon D2h then the photos would have been amazing. What was weird besides the fact that a brown cylinder was just sitting in the sky, was the way that this craft flew. Gravity was NOT an option, there was no noise from it, it was just sitting there, then it turned on edge and acended about 3 lenths of the craft, leveled off and went along about the same distance then decended the same way, then leveled off again and I thought to myself 'that's weird'. This was back in the 60's Sci-fi as we know it had not come about, but even now we have nothing on this planet that can fly like it in that sort of formation and everything still has to conform to gravity. As I said as far as this craft was concerned gravity was not an option. I did not stay to watch more because assembly was at 9am and if you did not want to get into serious trouble you were not late. Since this sighting I have longed to see one again but with no luck. I hope this helps."]}