{"Source":"MUFON","files":["/var/www/straped/mufon/html2text/6566.html.txt","/var/www/straped/mufon/more/6566_submitter_file1__bayobject.jpg","/var/www/straped/mufon/more/6566_submitter_file2__bayobjectcloseup.jpg","/var/www/straped/mufon/org/6566.html"],"Disposition":"Insufficient Data","Case Number":"6566","divs":["sighting detailsfirst sighted in 2004 from our front porch. we noticed a very bright light hight up on the island. we watched it for about ten minutes until the light went out. i took a look with my binoculars to see what had made the light & i saw a disc like craft. i took a few pictures [not featured because they have been lost] & by the time i set the camera down, it had disappeared without a trace. the photos featured here were taken in early 2005 on a boat. this marked the third or fourth time i had seen the light in the area. it seems to have some interest in the island. it tends to be stay the same area, but higher or lower. more recently [as in two weeks ago], we spotted it again at sea level. i managed to take a picture, but it is not visible. which is odd because the light was quite visible. each sighting is ten to fifteen minutes in length. there is no sound & the craft does not move. it does appear in different spots around the island\\bay. it has appeared at several different times during the day. i have only seen it in its non illuminated [disc] form once. if i had to estimate, i would say that it has been spotted at least six times by either myself or a family member. i'll submit more info\\pics next time we see it."],"Latitude":"48.762523","Summary":"Bright light hangs around Lummi island/Bellingham bay.","Date Submitted":"02/07/2005 12:00 UTC","Viewing Distance":"Over One Mile","Tags":"City","Object Flight Path":"Stationary","Longitude":"-122.481215","Log Number":"US-03162007-0002","Object Features":"Unknown","Object Shape":"Disc, Other","Weather Factors":"Unknown","trends":["There have been 27 other sightings in Bellingham","There were no other sightings in Bellingham on or around February 7th 2005","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=48.762523,+-122.481215(6566)&iwloc=A&hl=en\"> mufon case (6566) map </A>","Sighting Duration":"Undisclosed","Region":"Washington","Date of the Event":"02/07/2005 12:00 UTC","Country":"United States","City":"Bellingham"}