{"Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Case Number":"6568","Tags":"City","Date of the Event":"03/07/2007 04:15 UTC","Longitude":"-103.222545","Object Flight Path":"Stationary","trends":["There have been 10 other sightings in Rapid City","There were no other sightings in Rapid City on or around March 7th 2007"],"Log Number":"US-03172007-0001","Object Features":"None","Summary":"very shiny silver soft cornered triangle","files":["/var/www/straped/mufon/html2text/6568.html.txt","/var/www/straped/mufon/org/6568.html"],"Object Shape":"Circle, Sphere, Triangle, Other","divs":["Sighting DetailsWe were facing west overlooking soccerfield behind school up in very clear sky with sun behind and to left of object; I and my daughter saw a round shape that changed into a triangular shape in a matter of moments and then it moved from a three dimensional to a two dimensionalvshape as if laying down in the sky and then turning verticle and then disappeared. The total time we saw it would have been about seven seconds if counting \"one thousand one...etc.\" My daughter saw it first as we were walking out of her school building after work and walking out to our car. As we crossed the parking lot she said' \"Mom look its another one of those things I saw.\" By the time I focused on the object from the time she said to look was a second or two. The object was very shiny and fluid like mercury appears when it runs on a table after one of the old thermometers breaks. This shape was in the sky so very high (I do not know exactly how high it was but it was about the size of a small green pea)As we looked at it the shape was changing from that of a silver sphere that she saw to what I saw which was a silver soft curved triangle into a sharp triangle that faced us. This shape then seemed to lay down in the sky and became like a horizontal black line in the sky, no longer having its three dimensional quality. This took a couple of moments and then this line turned verticle;then it appeared to layforward, remained for a moment and then was gone. I did not understand how it could have such a shiny surface that appeared to reflect light when the sun was behind it as it was about 4:15pm Mountain Time. I do not know what it is that we saw, but I have never seen anything like it before. My daughter stated that she has seen similar things before when outside at her school. The school is located on top of Hwy. 16. When I first saw the object I wondered if it was a silvery giant balloon like one of those weather balloons that most reports say an unknown object is. But do balloons change their shape from spheres to flat lines and disappear? I don't know. Was this really a balloon or was it something else, I did not know. I was not upset, but I was positively excited, as was my daughter. We watched the object as we were standing still until it disappeared. I know how to describe how it finally left. It was like on an old television that when you turn it off it makes a verticle line and then the line goes to a point and then is gone. We were wondering if anyone else saw this as well and maybe they reported it."],"Date Submitted":"03/07/2007 04:15 UTC","Latitude":"44.087543","Sighting Duration":"Undisclosed","Source":"MUFON","City":"Rapid City","Weather Factors":"None","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.087543,+-103.222545(6568)&iwloc=A&hl=en\"> mufon case (6568) map </A>","Region":"South Dakota"}