{"Case Number":"6570","Weather Factors":"Unknown","Disposition":"Unresolved","Object Shape":"Star-like","divs":["Sighting Details About 12:30 am my brother > James,cousin Dwayne,friend Terry and myself traveled > in a truck from Pincher Creek, Alberta to Brocket to > bring Dwayne home to his mother's house(her house is > about 3 kilometers north of the Brocket town > site.There also about 9 homes within a 5 kilometer > radius) . We parked in the driveway (the truck was > facing west) and Dwayne got off. He walked up the > stairs onto the balcony as we backed up he pointed > to the northeast direction. Terry rolled down his > window and he asked Dwayne what he was pointing at. > Dwayne said: \"look at those lights over there\" we > backed up until we were facing in the north > direction. We then seen a group of lights in the > northeast they were almost above the Head Smashed In > Buffalo Jump site(the Buffalo Jump is about 10 > kilometers northeast of Brocket and about 8 > kilometers northwest of Fort Macleod, Alberta).I > opened the door and i looked between the cab and > door.I thought to myself it must be a > constellation,but i realized i have never seen a > constellation in that area at anytime of the year. > The lights did not make any sound nor appear to move > in any direction. Our reaction to what we were > looking at was very quiet. Then in about two minutes > the group of lights slowly started to dim and fade > away,which took about thirty seconds."],"Date Submitted":"01/01/2002 01:00 UTC","Log Number":"CA-03182007-0002","Region":"Alberta","City":"Lethbridge","Latitude":"49.69349","Object Flight Path":"Undisclosed","Country":"Canada","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=49.69349,+-112.84184(6570)&iwloc=A&hl=en\"> mufon case (6570) map </A>","Source":"MUFON","Summary":"A group of objects that looked like a constellation that slowly disappeared in the northeast sky .","Date of the Event":"01/01/2002 01:00 UTC","Object Features":"Undisclosed","Sighting Duration":"00:03:00","Longitude":"-112.84184","trends":["There have been 5 other sightings in Lethbridge","There were no other sightings in Lethbridge on or around January 1st 2002"],"Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/6570.html.txt","/var/www/straped/mufon/org/6570.html"]}