{"Sighting Duration":"00:45:00","Tags":"City","City":"Thompson","map":"<A HREF = \"http://maps.google.com/maps?q=55.744925,+-97.850872(6573)&iwloc=A&hl=en\"> mufon case (6573) map </A>","Longitude":"-97.850872","divs":["Sighting DetailsI had came home from a walk and there in the sky was an unusual object. I was notified by the people in my home, that the object was there for about 5 minutes. I looked at this object and decided to get my cam corder. I recorded some footage and it was in black and white, untill I played it on the television. At first I thought I overreacted, it being just a star, but then when I watched a show on UFO's where your organization was featured I decided to write this email. The Video showed an object that first appeares to fade then when I focused in, the object appeared to get brighter. I thought it was quite interesting. When I had a good shot of the object, a number of different colors appeared, from white, dark blue, burgandy, grey, and black. The object then faded and in the camera shot it reapears in the sky. the sky night was clear, also, I thought that my hand was shaking, but when I stabilized it on the balcony window( I live on the 7th floor) and got a clear focused shot of the object it appeared to be moving away and then closer and finally it was moving around as on the camera footage. Later the object was not in the sky any longer. A person said it was a star but I and another person who was there that night of the camera footage, witnessed the tape and is convinced: it is quite unusual. p.s I could not download the video camera to the computer, because of the compatibility of the computer and the video camera."],"Country":"Canada","Object Shape":"Circle, Fireball, Flash, Sphere, Star-like, Triangle","Date Submitted":"03/16/2007 10:15 UTC","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","trends":["There have been 2 other sightings in Thompson","There were no other sightings in Thompson on or around March 16th 2007"],"Object Features":"Dome, Patterned Surface, Unknown","Region":"Manitoba","Disposition":"Unresolved","Case Number":"6573","files":["/var/www/straped/mufon/html2text/6573.html.txt","/var/www/straped/mufon/org/6573.html"],"Log Number":"CA-03182007-0005","Object Flight Path":"Stationary","Latitude":"55.744925","Date of the Event":"03/16/2007 10:15 UTC","Weather Factors":"Unknown","Summary":"I arrived at home and there is was in the sky, I grabed my cam corder and recorded for 5 minutes.","Source":"MUFON"}