{"map":"<A HREF = \"http://maps.google.com/maps?q=41.505405,+-81.690139(6587)&iwloc=A&hl=en\"> mufon case (6587) map </A>","files":["/var/www/straped/mufon/html2text/6587.html.txt","/var/www/straped/mufon/org/6587.html"],"Country":"United States","Log Number":"US-03202007-0006","Sighting Duration":"00:03:30","Source":"MUFON","Date of the Event":"03/18/2007 10:22 UTC","Object Features":"Insignia","Disposition":"Insufficient Data","Summary":"VERY FAST AND STOPED AND TURNED","trends":["There have been 47 other sightings in Cleveland","There were no other sightings in Cleveland on or around March 18th 2007"],"Case Number":"6587","Latitude":"41.505405","Object Flight Path":"Path with directional change","Region":"Ohio","Date Submitted":"03/18/2007 10:22 UTC","Weather Factors":"Unknown","divs":["Sighting DetailsME AND MY FAMILY WAS DRIVING DOWN A BUSY HIGHWAY IN CLEVELAND OHIO. ITS WEIRD BECUASE WE WAS TALKING ABOUT HOW IN THE BIBLE IT TALKS ABOUT MESSENGERS FROM THE SKY. MY DAD DIDNT AGREE WITH US, SO HE LOOKED OVER TO THE LEFT OUT THE WINDOW AT THE BIG BUILDING DOWNTOWN, AND LOOKED THE LEFT MORE AND SAW A PLANE, OR SO HE THOUGHT. HE SAID LOOK AT HOW FAST THAT PLANE IS GOING, WE WAS LOOKING AT THE SIDE OF IT AND IT DIDNT LOOK BRIGHT, UNTIL IT TURNED TWORD US. THE WAY IT TURNED WAS AMAZING, WITH LIGHTNIG FAST SPEED AND VERY SWIFTLY AND SUDDEN. WE THOUGHT THIS COULDENT BE A PLANE. SO WE PULLED OF THE SIDE OF THE HIGHWAY AND MY MOM GOT OUT. WE WAS AMAZED WHAT WAS COMING RIGHT OVER OUR HEADS. IT WAS ABOUT 80FT OFF THE GROUND, ABOUT THE SIZE OF A SMALL PLANE, AND 4 \"HUGE\" LIGHTS ON THE FRONT. IT CAME ABOUT 100 FEET AWAY FROM US AND ATOMATICLY TURNED. BEFORE IT TURNED IT WAS GOING SLOW AND THE WHEN IT TUNED IT STOPED AND FLORED IT EXTREAMLY FAST AND WENT THE OPPOSITE DIRECTION OF US. THE IT STOPED ABOUT 500 FEET AWAY TURNED AROND STRAIGHT AT US AND WENT PROBABLY 1000 MPH. THERE WHER 3 WITNESSES AND OUR DOG WE FELT VERY EXITED AS IT CAME AND WENT. AND I SAW THIS ON THE BOTTOM OF IT (!)IN A BLUE LIGHT."],"Object Shape":"Square, Rectagular","Viewing Distance":"21-100 Feet","Longitude":"-81.690139","City":"Cleveland","Tags":"City"}