{"Disposition":"Unknown","Case Number":"6593","Summary":"Slow moving ufo lit up like a cop car","Longitude":"-122.134132","Latitude":"38.019366","divs":["Sighting DetailsI was looking up in my back yard and saw a slow moving UFO flying directly overhead. Skies were clear. Wind less than 5mph. Tempurature was 55-60 degrees f. Stars were out, sky was exceptionally clear, no clouds no fog. I could barely discern a outline to the craft - it was either the shape of a triangle or boomerang, I could not make out a tail. What caught my attention was its speed and altitude. I estimate that it was no more than 800ft above the ground and traveling 50 to 60mph in a straight line. It passed overhead and over my house, I moved to the front yard to observe it's flight. I heard no noise until it passed. I distinctly heard the sound of a jet engine, but the volumne of the its engine was incredibly faint. The time of night this occured flights of jets over my area are rare and can be heard easily even when they fly at commercial jet liner altitudes -25 - 30k feet. Jet planes at 800 feet make a lot of noise and is easily recognizable, this craft made the sound of a jet plane, but the volumne is what you would expect to hear if it was several miles away. After it passed overhead the engine noise quickly dissapeard. The lighting on the craft was not like commercial aircraft. It had what could only be described as cop car rollers on the underside of the craft. Red and white rotating lights as well as FIXED Position Green and Blue lights could also be seen. The action of the lights were exactly like police car lights - up close you could see the beam coming off the the rotating lights. As the craft continued on its course the lights appeard to strobe like what you see with police car lights. These sets of lights were arranged in parallel and as the craft moved away, toward Buchanan field (east of my location), it looked exactly like a airborne cop car. The craft never changed its course or altitude and was visible flying over Martinez, Pacheco, and parts of Concord CA. I could see it clearly for up to fifteen minutes - its flight path looked like it would intersect Mount Diablo if it continued on the path I observed. Interestingly, I noticed the craft was exceptionaly stable. As a former pilot I can easily recognize the change in flight path of a plane that engages its rudder, alierons or elevator to maintain level flight. This craft seemed to be flying without using areodynamics. Thrust + Speed + WIngs = lift. THis craft was not flying like a normal airplane. My guess is that this was not extrateresstrial, but rather a new toy for the USAF. The sound of a engine, the look of the lights, the look of it looked terrestrial, the flight behavior of it was anything but. If I'm right, I'd like to know what how much this thing cost and what our governement intends to use it for."],"Object Shape":"Boomerang, Triangle","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=38.019366,+-122.134132(6593)&iwloc=A&hl=en\"> mufon case (6593) map </A>","Object Flight Path":"Straight-line path","Country":"United States","Date of the Event":"03/17/2007 11:00 UTC","trends":["There have been 4 other sightings in Martinez","There were no other sightings in Martinez on or around March 17th 2007","This sighting has been favorited 1 time.",""],"Tags":"City","Log Number":"US-03212007-0001","Source":"MUFON","Date Submitted":"03/17/2007 11:00 UTC","City":"Martinez","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"None","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/6593.html.txt","/var/www/straped/mufon/more/6593_submitter_file1__AlexFrittz8.26.2007.jpg","/var/www/straped/mufon/more/6593_submitter_file2__frittzobject1.jpg","/var/www/straped/mufon/more/6593_submitter_file3__frittzobject2.JPG","/var/www/straped/mufon/more/6593_submitter_file4__frittzobject3.jpg","/var/www/straped/mufon/more/6593_submitter_file5__frittzobject4.JPG","/var/www/straped/mufon/org/6593.html"],"Region":"California"}