{"Object Features":"Undisclosed","Latitude":"42.214206","map":"<A HREF = \"http://maps.google.com/maps?q=42.214206,+-83.149924(6604)&iwloc=A&hl=en\"> mufon case (6604) map </A>","trends":["There have been 4 other sightings in Wyandotte","There were no other sightings in Wyandotte on or around March 22nd 2007"],"Date of the Event":"03/22/2007 05:26 UTC","Date Submitted":"03/22/2007 05:26 UTC","Longitude":"-83.149924","divs":["sighting details it was very windy when i let my dog out to do her business at 5:24 a.m i know the time because the microwave is right by the side door to our kitchen. it was a mix of high clouds & swirling winds with a storm brewing to the west. i stared into the nnw sky over 3\\4 of the way up there were a series of lights spaced well apart moving at the exact same speed as the others. there were 6 of them total. i seen the one & it was dead silent except for the wind occasasionally gusting. i first thought it was a distant star until i followed it & it was moving. i noticed through the breaks of clouds that there were others not too far way. obviously no set pattern, but they all moved at exactly the same speed.it would not have helped to have my camera as they were too far away to get a good shot. the clouds moved in a few minutes in to my tracking & it was over. i wish i could have gotten my telescope out of the garage to get a better view, but time was not on my side. then i tried to get back to bed. knowing that what i just saw was inexplicable. but i know what i saw. sincerely, mark simon"],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/6604.html.txt","/var/www/straped/mufon/org/6604.html"],"City":"Wyandotte","Summary":"Several lights at high altitude fling in a steady formation north to south","Viewing Distance":"Unknown","Object Shape":"Star-like","Object Flight Path":"Undisclosed","Source":"MUFON","Case Number":"6604","Log Number":"US-03222007-0004","Region":"Michigan","Disposition":"Insufficient Data","Tags":"City","Country":"United States","Sighting Duration":"Undisclosed"}