{"Disposition":"Unknown","Source":"MUFON","Region":"California","Latitude":"36.33681","Object Flight Path":"Straight-line path","Country":"United States","Log Number":"US-03232007-0001","Date Submitted":"03/15/2007 01:00 UTC","City":"Hanford","Date of the Event":"03/15/2007 01:00 UTC","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=36.33681,+-119.638714(6605)&iwloc=A&hl=en\"> mufon case (6605) map </A>","trends":["There have been 3 other sightings in Hanford","There were no other sightings in Hanford on or around March 15th 2007"],"Summary":"Elongated triangle shape, zero noise emission","Tags":"City","divs":["sighting detailswhile conducting law enforcement operations, myself and 2 partners observed a very bright \"star\" to the south of our location. we commented that it must be one of the planets that are sometimes very visible. as we conducted our business, we continued to glance at the \"star\" that was hanging in the sky. there was no movement to this object. we then suddenly noticed that the bright star was not there anymore, replaced with red and green lights. this object then moved slowly towards our location at an altitude of about 3,000 feet agl. we heard no sounds associated with an aircraft, i.e. helicopter, fixed wing, jet, etc. the object passed over our location silently. it had a myriad of red and green lights underneath it, and you could make out that it was a elongated triangle shape. note that we were in a very rural location, conducting undercover operations. it was very quiet, and this craft made absolutely no noise whatsoever. it continued northbound over the laton area, which borders kings\\fresno counties. note that lemoore naval air station is located in kings county, and would have been located southwest of this sighting. definitively i can state that this was not a fixed wing\\motorized plane, nor a rotary wing, nor a jet. it was silent at 3000 ft\\agl. interesting to say the least."],"Object Features":"Unknown","Viewing Distance":"Over 1 Mile, Unknown","Object Shape":"Triangle","Case Number":"6605","Longitude":"-119.638714","Sighting Duration":"00:05:00","files":["/var/www/straped/mufon/html2text/6605.html.txt","/var/www/straped/mufon/org/6605.html"]}