{"Viewing Distance":"Unknown","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=45.43825,+-122.80481(6607)&iwloc=A&hl=en\"> mufon case (6607) map </A>","Weather Factors":"Unknown","Disposition":"Unknown","Object Features":"None","Region":"Oregon","Country":"United States","files":["/var/www/straped/mufon/html2text/6607.html.txt","/var/www/straped/mufon/org/6607.html"],"Object Shape":"Egg","City":"Tigard","Source":"MUFON","Date Submitted":"03/23/2007 07:20 UTC","Sighting Duration":"Undisclosed","Summary":"Saw orange ball of light move in two directions past bedroom window","divs":["sighting detailsmy husband and i were in our bedroom talking before we left for work in the morning (we were dressed and had been awake for 1\\2 hour or more). we both happened to be looking out our large bedroom window at the same time. this window faces west. out of this window we can see a patch of sky and saw an oval-shaped ball of orange light streak past, going very fast. it was heading south. we both were startled by it. i got up and went up to the window, and approximately 15-20 seconds later i saw it again, going northwest, but it made an arc towards the northeast before it disappeared from view (behind houses and trees in the foreground). it could have been reflecting the sunrise (though it was partly overcast and the sun was not very bright this morning), but as it turned the glare never changed. it seemed to stay a uniform \"ball of bright light.\" we never saw any lights on it, or and part of any structure that would indicate a helicopter tail, or airplane wings. it was devoid of any detail, although we were seeing it from quite a distance away. this thing struck both of us as being very unusual. we both agreed it looked egg-shaped and it was so, so bright. it left no trail. when i saw it make the arc, the movement did not seem to resemble a helicopter or anything i had seen before. i can't stop thinking about it. i can take a photo of the window and create a simulation in photoshop that i can submit later. thank you for listening."],"Tags":"City","Date of the Event":"03/23/2007 07:20 UTC","Latitude":"45.43825","Longitude":"-122.80481","trends":["There have been 11 other sightings in Tigard","There were no other sightings in Tigard on or around March 23rd 2007","This sighting has never been favorited.",""],"Case Number":"6607","Log Number":"US-03232007-0003"}