{"Object Flight Path":"Undisclosed","Source":"MUFON","Tags":"City","trends":["There have been 24 other sightings in Oakland","There were no other sightings in Oakland on or around March 12th 2007"],"Case Number":"6609","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Date Submitted":"03/12/2007 02:14 UTC","Country":"United States","Latitude":"37.811434","map":"<A HREF = \"http://maps.google.com/maps?q=37.811434,+-122.268514(6609)&iwloc=A&hl=en\"> mufon case (6609) map </A>","Weather Factors":"Unknown","City":"Oakland","Summary":"flat, triangular shapped UFO with red stipe on top and shinny, gray bottom","Disposition":"Insufficient Data","Log Number":"US-03232007-0005","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/6609.html.txt","/var/www/straped/mufon/org/6609.html"],"divs":["Sighting DetailsIt was a cloudy day with only high Cirrus clouds in the sky with some blue sky comming through. visibility was good below 25,000 feet. I took out my 12-36 power by 70mm zoom bonoculars outside. I stopped on the hill on Beaver street about thirty feet from Castro and Beaver. I pointed my bonoculars at about an eighty degree angle into the sky and immediately spotted a strange Gray, triangluar object. It was about half the size of the full moon at 12 power. I zoomed in for a closer look. The object appeared now to be close to the size of the full moon at about 25 power. It was heading south at high velocity, maybe several hundred miles and hour. It made several three hundred and sixty degree rolls so I could see what it looked like on the top. It had a red stripe going straight down the top from point to back. I noticed it was very flat, too flat to have a pilot. The sun reflected off its shinny Gray bottom. At about close to two minutes of observation, The object went behind the roofs of the building accross the street. It was heading south all the way. My best guess as to the size of the object was no larger than fifteen feet in diameter. I don't think it was very large and was low in our atmosphere maybe only one or two miles up. It made no sound at all. I am an avaition fan and this object did not resemble any man made automated craft including the new small propeller unpiloted craft as seen in the latest issue of popular mechanics or any of the unpiloted, automated stealth jet spy craft which all have wings or anything like any of our stealth bombers. It also did not resemble the flying wing from the 1950's. It clearly was flat and without any wings but it did have rounded edges and one could say that it was aerodynamic by they way it flew. It flew like it was a air show craft doing rolls and a few sharp turns but still heading in a southward direction. It could see the flatness object when it did some rolls and when it was south from me. It could see the flat back of the object. When I first sighted it, The UFO was in the East towards the S.F. bay at an eighty degree angle overhead and heading south. It wished I had with me a zoom digital video recorder as it would have made an excellent film."],"Longitude":"-122.268514","Date of the Event":"03/12/2007 02:14 UTC","Object Shape":"Triangle","Region":"California"}