{"Tags":"City","Date Submitted":"05/03/2005 09:34 UTC","Summary":"luminous white ball crossed most of the sky and behind clouds in southeast","Log Number":"US-03232007-0006","Longitude":"-122.470208","Country":"United States","Viewing Distance":"Unknown","City":"Daly City","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.687924,+-122.470208(6610)&iwloc=A&hl=en\"> mufon case (6610) map </A>","Case Number":"6610","Latitude":"37.687924","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Disposition":"Insufficient Data","Weather Factors":"Unknown","Date of the Event":"05/03/2005 09:34 UTC","Object Shape":"Star-like","Region":"California","Source":"MUFON","files":["/var/www/straped/mufon/html2text/6610.html.txt","/var/www/straped/mufon/org/6610.html"],"trends":["There have been 16 other sightings in Daly City","There were no other sightings in Daly City on or around May 3rd 2005"],"divs":["Sighting DetailsI was walking my older brother up to the 24 divisdero bus stop and we as we crossed into the middle of Beaver street I was looking to the West as saw a moving white luminous sphere heading towards us. It was about the size and brightness of the planet Jupiter. We both saw it fly towards us then it crosses in front of us in the North at about 75 degrees above the horizon and above the rooftops on the North side of the street. The it heading towards the North East and disappeared into a small amount of fog which was accross the bay. The object took about a minute in a half to cross the sky. It was very high and It did not appear to be a plane light; the whole object was lighted. I have seen high planes before and they usually have flashing lights or one small light but I doubt it could be a plane. It was not a sattelight because they take at least five minutes to cross the sky. I was to slow to be a meteorite. This was the first luminous of two luminous balls I have seen the other one I have already reported to MUFON."]}