{"divs":["Sighting DetailsI was walking in the Parking lot of Safeway located on the corner of Market and Church Streets. I was heading towards Safeway and walking through the parking lot. About halfway through the parking lot I spotted an object with a flashing light coming from the North. I stopped to observe it. As it came closer I could see it shape; first is was too far away to recognize it's shape. It was a bright red colored rectangular box shaped object with it length pointing vertically. It made no sound and had no exhaust I could see. Then at it's closes point as it crossed in front of me it was about the appearant size of the full Moon. It flashed so brightly that the box was completely covered by the light or my eyes could not see the object during its flash. The light was not random but flashed at a timed interval of three seconds between flashes. The flash appeared to be coming from inside the box from the exact center of the box. Between flashes I noticed something silver and shinny in the upper right corner of the box on its very edge which was reflecting Sun light with a silver color. It was as if the cube had a silver steel frame under some kind of red material which was covering it but not at that small corner or angle so it relfected silver light instead of red light. The box appeared to be low and small no larger than ten feet in width and maybe about two or three thousand feet high. I doubt it was piloted by living beings since it was too small. It must have been some kind of robot or automated spy craft. It was heading south. At one point it stopped in mid air and hovered for about three seconds. Then it went straight up for about one thousand feet and started heading south again until it was so far away I could only see the flashing light. From far away it could easily be mistaken for a plane. The UFO was moving slowly the time I observed it and the time it took to cross the whole sky which was about five minutes. It apeared to be moving slowly accross the sky and was not very high. If I had a range finder that would have helped in my determination of its exact height and size. It was a clear, blue cloudless sky and good visibility."],"Object Features":"Undisclosed","City":"Daly City","Latitude":"37.693434","Viewing Distance":"501 Feet - 1 Mile","Region":"California","Date of the Event":"09/16/1995 02:11 UTC","Tags":"City","Summary":"Bright red rectangular box shapped UFO the size of full moon","map":"<A HREF = \"http://maps.google.com/maps?q=37.693434,+-122.461398(6612)&iwloc=A&hl=en\"> mufon case (6612) map </A>","Disposition":"Unknown","Longitude":"-122.461398","Object Flight Path":"Path with directional change","Country":"United States","trends":["There have been 16 other sightings in Daly City","There were no other sightings in Daly City on or around September 16th 1995"],"Date Submitted":"09/16/1995 02:11 UTC","Object Shape":"Square, Rectagular","Case Number":"6612","Source":"MUFON","Log Number":"US-03232007-0008","Weather Factors":"None","Sighting Duration":"00:05:00","files":["/var/www/straped/mufon/html2text/6612.html.txt","/var/www/straped/mufon/org/6612.html"]}