{"Source":"MUFON","Longitude":"138.608255","files":["/var/www/straped/mufon/html2text/6617.html.txt","/var/www/straped/mufon/org/6617.html"],"trends":["There have been 15 other sightings in Adelaide","There were no other sightings in Adelaide on or around February 12th 2004"],"Object Shape":"Teardrop","Tags":"City","Log Number":"AU-03242007-0004","City":"Adelaide","Object Flight Path":"Path with directional change","Object Features":"Patterned Surface, Other","map":"<A HREF = \"http://maps.google.com/maps?q=-34.920256,+138.608255(6617)&iwloc=A&hl=en\"> mufon case (6617) map </A>","Summary":"My brother and I were driving to Roxby Downs, and we had been driving through the night and we saw several lights in the sky.","Case Number":"6617","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"02/12/2004 02:54 UTC","Country":"Australia","divs":["Sighting DetailsWe had been driving overnight, (my brother James and I) headed to Roxby Downs. It was a really clear night and pitch black, with just less then a full moon. James was driving, and I was asleep, when I was jerked awake by him yelling at me and suddenly stopping the car. He was freaking out and yelling \"Look, look!\" and \"What the hell is that, oh my God\" and shaking me, ordering me to look at the north-eastern sky. I did, and there was several arrangements of lights in the sky. Three lights on each in triangle formation, the lights themselves elliptical. I was fully awake now and we were both staring in shocked silence and horror. Were they really UFO's, I asked myself? My brother and I believe in such things, and immediately searched for any sign that they were an Identifyable aircraft. As they flew closer to the moon, sillhouettes in the moonlight, we could see that they were shaped a bit like a teardrop. They were flying fast and high at first, but nearing us they slowed their pace, hovering slightly lower, terrifying us. Then our car died, and my phone went dead. We were horrified. Filled with horror, shock, Excitment, panic, and confusion at what we were seeing, we talked to eachother about what we were seeing, never taking our eyes of the three crafts. Dissapearing to north-western skies, we watched the lights fade from vision in a ghostly fasion. Shocked still we sat in the car talking about the event, trying to make sense of it untill the car and my phone came back to life about half an hour later. the Experience would have only been 45 minutes, an hour at most, but our car clock read 7:07, 4 hours and 13 minutes from the time my brother first sighted the lights."],"Date of the Event":"02/12/2004 02:54 UTC","Disposition":"Unresolved","Latitude":"-34.920256","Region":"South Australia"}