{"Summary":"Small brown colored rectangular box shaped object moving at high velocity in the night sky","Tags":"City","Source":"MUFON","Date of the Event":"03/29/2000 09:00 UTC","Region":"California","Viewing Distance":"Unknown","Log Number":"US-03242007-0006","Disposition":"Unknown","Object Shape":"Square, Rectagular","Latitude":"37.695194","Object Features":"None","trends":["There have been 16 other sightings in Daly City","There were no other sightings in Daly City on or around March 29th 2000"],"City":"Daly City","files":["/var/www/straped/mufon/html2text/6619.html.txt","/var/www/straped/mufon/org/6619.html"],"Longitude":"-122.464368","map":"<A HREF = \"http://maps.google.com/maps?q=37.695194,+-122.464368(6619)&iwloc=A&hl=en\"> mufon case (6619) map </A>","Date Submitted":"03/29/2000 09:00 UTC","Object Flight Path":"Straight-line path","Country":"United States","Weather Factors":"None","Case Number":"6619","divs":["Sighting DetailsI went to Corona Heights with my six by thrity millimeter bonoculars to view to newly opened Pack Bell park baseball stadium. I was on Corona Heights looking to the East at the lights of the new Pack Bell baseball park. I looked up at about a seventy or eighty degree angle above the ball park towards the East and suddenly I spotted a rectangular box shaped object much like the shape of the one I saw in 1995 in San Francisco on September 16, 1995 at 2:11 p.m. It was very small and high and moving fast; maybe as much as five hundred miles per hour since I only observed it for ten seconds while it flew in a straight line directly East. It became to small and far away for me to see after ten seconds as it flew over the San Francisco bay and beyond the distant Berkeley hills. It had no lights and I suspect that it's dull brown color was the result of only the glow of the city lights illunimating the object so I could see it. It was about one seventh the diameter of the full moon or smaller but I could clearly see it was a retangular box shaped object. It flew very near by the right side of the ball park but not direclty over the ball park. I doubt anyone could have seen it without bonoculars as it would be too faint in brightness and small for the naked eye to notice on a dark night. Maybe the ET's like baseball? It was a clear night and the visiblity was good."],"Sighting Duration":"00:00:10"}