{"map":"<A HREF = \"http://maps.google.com/maps?q=37.957592,+-119.119943(6620)&iwloc=A&hl=en\"> mufon case (6620) map </A>","Source":"MUFON","Case Number":"6620","Sighting Duration":"03:00:00","Region":"California","Date Submitted":"10/15/1964 04:00 UTC","City":"lee vining","Date of the Event":"10/15/1964 04:00 UTC","Weather Factors":"None","divs":["Sighting DetailsMy father and I had gotten up at 2a.m. in our home in Mammoth Lakes Ca. to go on a goose hunting trip with a friend of his, we were on the road with his friend by 3 a.m. and headed north on hwy 395. We were passing by Mono lake (it takes about 40 minutes to get from Mammoth Lakes to Lee Vining). I looked up throught the windshield and saw a large white glowing sphere with a much smaller white glowing sphere moving in unison across the sky. I pointed and said what is that? My father and friend both looked up and we pulled over by the lake and got out of the truck. We watched it move across the sky from west to east over the lake and then it came back over the center of the lake and moved down just above the surface of the lake almost setting the whole lake aglow. We stared in amazement and then it came across the lake directly towards us and stopped just off shore, then shot straight up into the sky and vanished with incredible speed. Not a sound at all. We stood there a moment then got back into the truck and my father said, I never believed in ufo's before but I sure do now! We pulled back onto the hwy and down the road. Then I noticed that it was no longer night time and that the sun was out. I said to my Dad, what time is it? He looked at his watch 3 times and said, It's 7 a.m. My Dad just said, we're late and we all sat in silence for a long time. That's the best I can remember for so many years ago. All my life I have wondered what happened to the time. Aprox. 3 hrs. missing. I have no idea what happened other than we arrived about 3 hrs. late to our destination. I don't know if it's been to long to get any of my questions answered, but I would really like to know what happened that early morning so long ago. Can you help me? Sincerely Philip C. Stockwell Jr. 96465 Coverdell rd. 28 Brookings, OR. 97415 541 412 8291"],"Disposition":"Unknown","Latitude":"37.957592","Tags":"City","trends":["There have been 4 other sightings in lee vining","There were no other sightings in lee vining on or around October 15th 1964"],"Object Shape":"Sphere","Longitude":"-119.119943","Log Number":"US-03242007-0007","files":["/var/www/straped/mufon/html2text/6620.html.txt","/var/www/straped/mufon/org/6620.html"],"Country":"United States","Viewing Distance":"21-100 Feet, Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Object Features":"None","Summary":"We saw it in the sky over Mono Lake Ca. two sphere's, one small the other large, they came down over the lake and hovered a moment then came towards us and hovered very close then shot up into the sky and vanished, aprox. 3 hrs had vanished."}