{"divs":["sighting detailsdear mufon, i have written to you before regarding a ufo a saw last year in a plane i am now writing to ou now about something different.i am not sure of the exact date when i saw this ufo\\uso,but i am sure of the time. before i saw the object i was being driven to school by my dad.we were talking and driveing down a hill that leads to a street right next to the ocean.as we were driveing a security car pulled next to us and speeded in front of our car.the security car was from marymount college witch we had just passed.we then made a turn and saw the ocean as we began our way down what the locals call the switchbacks(a very winding road).on the side of the road the security car pulled over and looked out to the ocean,by the way the dya was very windy,and we are right across from the island santa catilina.i then looked towards the direction he was and saw many white caps along with multiple cargo ships.the ocean disapered as we amde a turn then reapered,and there it was.it was a white object,as big or bigger than the cargo ships,and moving very fast.at first i thought it was a white cap,but it was kepping form and just to large to be a white cap becuase a wave that big just wouldnt hold and move like that.its movement was unpredictable going this way and that.it kept vanishing though as we would lose sight of it,when we go behind a tree or something.we saw for the last time and my dad,a total skeptic,looked at my and said what the hell was that.that for me was liike a nial in the the coffin that it wasnt ordinary.reason being that my dad had lived his childhood near the caspian sea and had spent his early years seeing white caps every day. we got to the bottom of the hill and never saw it aian. the object i described it as best as possible but in detail it almost was like a mussel that you like eat,but white and pushed down kinda flat. ryan"],"Weather Factors":"Windy","files":["/var/www/straped/mufon/html2text/6625.html.txt","/var/www/straped/mufon/org/6625.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.747801,+-118.381857(6625)&iwloc=A&hl=en\"> mufon case (6625) map </A>","trends":["There have been 4 other sightings in Rancho Palos Verdes","There were no other sightings in Rancho Palos Verdes on or around January 7th 2007"],"Longitude":"-118.381857","Date Submitted":"01/07/2007 07:35 UTC","Region":"California","Disposition":"Insufficient Data","Source":"MUFON","Latitude":"33.747801","Object Shape":"Triangle","Date of the Event":"01/07/2007 07:35 UTC","Tags":"City","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-03252007-0002","Case Number":"6625","City":"Rancho Palos Verdes","Object Flight Path":"Path with directional change","Sighting Duration":"00:06:00","Summary":"shell like,white,almost see thruogh,fast","Object Features":"Undisclosed"}