{"trends":["There have been 35 other sightings in Kingman","There were no other sightings in Kingman on or around March 24th 2007"],"Country":"United States","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","City":"Kingman","Object Shape":"Boomerang, Chevron","Case Number":"6626","Log Number":"US-03252007-0003","map":"<A HREF = \"http://maps.google.com/maps?q=35.192333,+-114.047396(6626)&iwloc=A&hl=en\"> mufon case (6626) map </A>","files":["/var/www/straped/mufon/html2text/6626.html.txt","/var/www/straped/mufon/org/6626.html"],"Date of the Event":"03/24/2007 12:00 UTC","Object Features":"Wings","Summary":"35 to 37 dark triangular or boomerang shapes moving appx. Southesat to Northwest direction.","Tags":"City","Latitude":"35.192333","Region":"Arizona","Disposition":"Unknown","Date Submitted":"03/24/2007 12:00 UTC","Source":"MUFON","Weather Factors":"Unknown","Longitude":"-114.047396","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsApproximately 4:00 in afternoon my son and I looked up from my semi-remote cabin area to see around 35 to 37 triangular or boomerang shapes moving from the Southwest to the Northeast in a direction towards Kingman, Arizona. At first we both thought they were large birds, but there was absolutely no wing movements nor directional or altitude variances typical of soaring birds. And because they had wingspans that we had estimated to be \"at least\" anywhere from ten to fiften feet in length, we ruled out any known birds of that size that could soar motionless in a straight line at an angle accross the prevailing winds. There was no pattern to their flight,like a V-shape for example, but rather random 'bunching' and a couple stragglers. Because we witnessed them for a period of a few minutes in which they traveled about five miles in distance, we both had time to grab binocculars and a rifle with a scope to observe them closer. Neither of us could distinguish typical bird-like heads or tails or feet. The entire time we saw them there was no movement of the wings, no sound and they all kept uniform distances from each other and altitude did not change. Altitude was very hard to estimate, but we thought perhaps 1500 to 2000 feet, and about a quarter mile distant from us at the closest point. It looked like to me while observing through binocculars that the tips of the wings were greyish in color whiile the main body was black. The l9cation of the sighting was one mile West of Hiway 93 between mile markers 100 and 102...I know this from knowing the location of my land parcel in relation to the hiway and the direction of the flight of the unknowns. We lost sight of them as they got to small to see above the horizon, they were still moving in a straight line in the general direction of Kingman. The weather conditions were very clear under high, scattered clouds. There was 8-10 mph winds from the Southwest. At the time of the event we had just completed some target shooting and relaxing around the cabin area. We noticed the event because I had happened to look up and see them approaching us from the direction of the Aquarius mountains accross from Hiway 93, and immediately I alerted my son to them. We both later and immediately discussed the sighting and had similar feelings that it was almost surreal in that \"if\" they were very large birds (and hard to determine exact altitude or size) they moved in a continuous straight line and did not change altitude, which convinced us they were more mechanical than biological in nature."]}