{"Object Features":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=44.652101,+-63.573792(6629)&iwloc=A&hl=en\"> mufon case (6629) map </A>","trends":["There have been 22 other sightings in Halifax","There were no other sightings in Halifax on or around January 23rd 2007"],"Tags":"City","Source":"MUFON","files":["/var/www/straped/mufon/html2text/6629.html.txt","/var/www/straped/mufon/org/6629.html"],"Disposition":"Unresolved","divs":["Sighting DetailsI was taking out the garbage, about 10:30 pm, Atlantic Time, on the 23rd of January, 2007. It was a cold, clear night, with cloudless sky in my neighbourhood, 73 MIcmac Drive, Hammonds Plains, Nova Scotia, Canada. (My wife and I live in an area that is on the flight path to the Halifax International Airport from the western approach and see many commercial flights throughout the day and night pass overhead).I was halfway down our driveway when I just happened to look up and over towards the western sky. Much to my amazement I was looking up at a large black triangle about the size of a 747. I didn't get excited but acted as though it was an everyday occurance, nothing out of the ordinary. But it was out of the ordinary since it was a large, black, equilateral triangle flying over my street at low level altitude. The triangle shape was clearly defined. At the underside of each of the three angles was one bright white light and at the center of the underside of the craft was a red dome. It must have been a few hundred feet in the air but the craft was well defined as I said above. I thought to myself way cool man...so what the hell is that. At about the same time, coming in from the southwest was a 757; the pilots had to have seen the triangle. Well anyway I went about my business and went back to the house to get a few more items that I was putting out to the side of the road for pickup in the morning; the triangular craft was still around when I got out to the street but was moving slowly in a north easterly direction as if following the street lights on Micmac Drive, the street where we live. The craft was not silent, but did not make the same sound that other aircraft make as they pass overhead. It was sort of like the sound our furnace makes as it exhausts up the chimney. Here is the real kicker that gets to me; we have a digital camera and because I was not used to using the thing it didn't cross my mind until later that night that I could have taken some great pics of that thing. I could have followed it down the street in lots of time to get some great shots, it was moving so slow, but I didn't."],"Case Number":"6629","Object Shape":"Triangle","Longitude":"-63.573792","Region":"Nova Scotia","Viewing Distance":"101-500 Feet","Date Submitted":"01/23/2007 09:30 UTC","Latitude":"44.652101","Summary":"Black Triangle cruised overhead rather slowly from a west-south westerly direction, turned and followed my street in a north easterly direction.","City":"Halifax","Date of the Event":"01/23/2007 09:30 UTC","Log Number":"CA-03262007-0003","Country":"Canada","Weather Factors":"Unknown","Object Flight Path":"Path with directional change"}