{"Country":"United States","Latitude":"41.881144","files":["/var/www/straped/mufon/html2text/6631.html.txt","/var/www/straped/mufon/org/6631.html"],"Date Submitted":"06/01/1982 09:00 UTC","City":"Chicago","Weather Factors":"Unknown","Source":"MUFON","Region":"Illinois","Tags":"City","Disposition":"Unknown","Object Flight Path":"Path with directional change","Sighting Duration":"00:00:07","Date of the Event":"06/01/1982 09:00 UTC","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around June 1st 1982"],"Log Number":"US-03262007-0005","Case Number":"6631","Object Shape":"Unknown","Longitude":"-87.626978","Summary":"extremely high speed lights in bowling pin formation moved horizontally then vertically to disappear","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.881144,+-87.626978(6631)&iwloc=A&hl=en\"> mufon case (6631) map </A>","divs":["Sighting DetailsI'll prefact my comments by saying that I was an F-4 Phantom jet fighter pilot and a member of the astronaut program, so I'm familiar with jets in full afterburner and I had a good feel for how fast those of that generation could move -- including the SR-71. My sister and now ex-brother-in-law were visiting my wife and I. My brother-in-law and I were sitting in the front seats on our way back from dinner at a restaurant and we were on the Interstate headed west out of Chicago toward O'Hare. Suddenly, I noticed some lights moving very rapidly away from us -- apparently more or less horizontally -- in a formation resembling a set of bowling pins. I don't remember the exact number, but there were either 6 or 10. I said to my brother-in-law \"what the heck is that\" and pointed. He looked and saw it. About that time, the formation of lights abruptly moved vertically and accelerated. Their size dwindled VERY quickly until they were just GONE. At the time, I had vision that was superior to every other fighter pilot I'd ever heard of. In fact, a flight surgeon once reported me to the commanding office of my group, claiming that I cheated on the comprehensive eye exam they give pilots because NOBODY could have scored so well and so quickly without cheating. That said, within a matter of just a second or so, I could see nothing more. By the time my wife and sister could lean forward to look out the windshield -- and they started to move forward about the time I exclaimed to everyone to \"look\", they could see nothing. We heard no sonic boom. I'm pretty sure the year was 1982, but there's a small chance it could have been 1981 and an even smaller chance it was 1983. However, I'm not sure what month it happened, let alone the day. I *think* that it was during one of the summer months, but I could easily be wrong about that. If it should ever come to pass that you'd like me to try to do a better job of recollecting the event, I'll ask my wife (who is at work right now) and sister what their recollection is."],"Object Features":"Unknown"}