{"Weather Factors":"Unknown","Longitude":"-115.164586","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around May 25th 2005"],"Country":"United States","Latitude":"36.120766","Date of the Event":"05/25/2005 12:00 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Tags":"City","Region":"Nevada","City":"Las Vegas","map":"<A HREF = \"http://maps.google.com/maps?q=36.120766,+-115.164586(6634)&iwloc=A&hl=en\"> mufon case (6634) map </A>","Log Number":"US-03262007-0008","Viewing Distance":"Unknown","divs":["Sighting DetailsMy friend that witnessed it with me said that she had seen the same disc shaped black spacecraft on several Saturdays prior to this sighting. She said she thought everyone knew about them and it was very common. It hummed across the sky very slowly. It was flying from the south to the north. It was about as high up as an airplane that is not making a stop but passing over the city. I lost sight of it when it disappeared behind the mountain by Nellis AFB. My first reaction was my heart dropping down into my stomach because I had seen UFOs on 3 other occasions prior to this one. They were at night and flying erratically until they (3 lights)shot from one horizon to the other in a matter of seconds,like shooting stars without the trail of light behind them. One time I saw 3 UFOs being escorted by jet planes of some kind to the AFB. Another time I saw just one(light) that shot across the sky from west to east and then hovered in the east sky until daylight. I stayed up all night to watch it and it was bouncing around in the sky to the east like a marshmallow on the end of a clothes hanger but in the same little area. I witnessed each of these events from my front and back yard on E Twain Ave in Las Vegas. Only the first one mentioned was in the daytime."],"Date Submitted":"05/25/2005 12:00 UTC","Disposition":"Unknown","Object Shape":"Disc","Source":"MUFON","Case Number":"6634","Object Features":"Undisclosed","Summary":"The black UFO was flying over Vegas on a Saturday afternoon in plain sight.","files":["/var/www/straped/mufon/html2text/6634.html.txt","/var/www/straped/mufon/org/6634.html"]}