{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=44.845278,+20.410278(6635)&iwloc=A&hl=en\"> mufon case (6635) map </A>","Longitude":"20.410278","trends":["There have been no other sightings in Zemun","This sighting has never been favorited."],"Object Features":"Unknown","divs":["Sighting DetailsWitnesess There where 3 of us on top of the house (since it`s flat, no roof)just relaxing chating in lieing position watching sky. Time It was around midnight when, I saw slow moving object south-east of our position. The Moment I didn`t mention my sighting to my friends at first place, because I was confused at what I saw. couple of seconds later my friend noticed it as well warning us on what he saw: -Look at that- I confirmed him: -Yes i can see it! We all stood up! Position and movement We just stared at what apeared to be- slow moving, silent dark triangle, Flying steadily from east to west and a litle to the south from our possition. Altitude of object It was hard to determine the altitude and the size of the object. But we estimated to be not higher than 100-150 meters (300feet aprox)from our position. My friend gave an estimation as close as 70-80 meters. We conclude that the size of object was unknown therefore we cannot estimate exact altitude. Therefore maybe it was maybe higher than 100 m Size of object If altitude was corect than object was around 10-30 meters in size roughly estimated! Duration Around 10-20+ seconds Wanishing point The object moved steadily to west when desapears from our sight. It disapeared only as a result of distance, not to be confused wtih any other means of same word! Personal conclusions and emotions at the time sighting First moment I saw the object I was confused, not sure what I`m seeing. Group of birds in delta formation? NOTHING ELSE! No Meteorological phenomena, no aircraft manmade, nothing similar... Group of birds? No way, sky would have been visible between them, and there is no way thay kept that perfect triangle shape all the time with absolutely no digression! No birds was my later conlusion! I was excited after the event, and I noticed my friend was a bit afraid! Because he saw something he could not explain I guess!"],"files":["/var/www/straped/mufon/html2text/6635.html.txt","/var/www/straped/mufon/more/6635_submitter_file1__Sketch.jpg","/var/www/straped/mufon/org/6635.html"],"Region":"Central Serbia","Log Number":"CS-03262007-0009","City":"Zemun","Object Shape":"Triangle","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Sighting Duration":"00:00:20","Weather Factors":"Unknown","Country":"Serbia","Case Number":"6635","Tags":"City","Date Submitted":"07/31/2006 12:00 UTC","Latitude":"44.845278","Summary":"black, silent triangle","Viewing Distance":"101-500 Feet","Date of the Event":"07/31/2006 12:00 UTC"}