{"Viewing Distance":"Over One Mile","Date of the Event":"10/31/2006 12:00 UTC","City":"Malibu","Country":"United States","Disposition":"IFO","Tags":"City","Date Submitted":"10/31/2006 12:00 UTC","divs":["sighting detailsplease take a look at these photos and let me know what you think. i took a series of 16 pic's with my digital camera of my daughter jumping and posing in front of the sunset on the beach near malibu,ca. when i loaded them onto the computer i noticed the white streak of light in the upper right hand of the pic(s) at first i thought \"plane\", but when i zoomed in on the area it doesn't indicate any image of a \"plane\" ...no wings, no tail.... also the time frame seems a bit odd for a \"plane\" as well as the trajectory. the object seems to be heading down at an angle that isn't characteristic of a plane. i found it interesting that perhaps the back ground activity such as the rate of the sunset, the people on the beach, the kayaking person in the water and the horizon line\\ treeline, would be helpful to someone to gage the speed of the object? in addition to these photos i'm sending in 2 separate e-mails with a progressive \"zoomed\" in version of the pic's. i have numbered the pic's for reference purposes. if you could have someone look at these pics and give me some feedback that would be helpful. if you would like to refer me to someone who could please feel free to forward my contact info to them."],"Log Number":"US-03262007-0010","trends":["There have been 20 other sightings in Malibu","There were no other sightings in Malibu on or around October 31st 2006","This sighting has never been favorited.",""],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.009708,+-118.803589(6636)&iwloc=A&hl=en\"> mufon case (6636) map </A>","Region":"California","Object Shape":"Bullet, Missile, Cigar, Fireball","Object Flight Path":"Straight-line path","Summary":"UFO at sunset - After loading my digital pictures onto my computer I noticed an object in the sky when looking at a series of Pictures I took at sunset on Malibu","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/6636.html.txt","/var/www/straped/mufon/more/6636_submitter_file1__100_6673.jpg","/var/www/straped/mufon/more/6636_submitter_file2__100_6678.jpg","/var/www/straped/mufon/more/6636_submitter_file3__100_6682.jpg","/var/www/straped/mufon/org/6636.html"],"Source":"MUFON","Case Number":"6636","Latitude":"34.009708","Object Features":"Undisclosed","Longitude":"-118.803589"}