{"map":"<A HREF = \"http://maps.google.com/maps?q=32.321991,+-86.901298(6641)&iwloc=A&hl=en\"> mufon case (6641) map </A>","Date of the Event":"11/30/1975 12:00 UTC","Latitude":"32.321991","Object Features":"Window(s)","Date Submitted":"11/30/1975 12:00 UTC","Country":"United States","trends":[],"Object Shape":"Circle, Disc, Other","Weather Factors":"Unknown","Longitude":"-86.901298","files":["/var/www/straped/mufon/html2text/6641.html.txt","/var/www/straped/mufon/org/6641.html"],"Disposition":"Unknown","Summary":"I saw a round one about midnight coming home from work 1979 or 1980.","Log Number":"US-03262007-0015","Tags":"City","Region":"Alabama","Case Number":"6641","Object Flight Path":"Stationary,Hovering then path,Path with directional change","City":"Undisclosed","Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","Source":"MUFON","divs":["Sighting DetailsThe one I saw one night coming home from work was round. It was over as section of the road I was driving on. It was just about tree top high and not moving. I drove under a small secetion of the round UFO and I got a close look at it. There was a row of windows around the center of the UFO and there was two windows that was larger then the rest of them. I could see forms of some kind sitting in these large windows. On the top side of the larger windows was huge beem light that was on and shingin down into the trees. I cound not see what the light were shining on. The lights beem was so strong I believe you could walk on them. I cound not here any kind of motor it was not sitting on any thing, it was just suspended in mid air. The forms in the windows were busy and I saw movement behind the ones that was sitting. If I were to guess I would say they were conducting some kind of experement. This same one I saw it behind my house going up and down the lake. This thing would not stop, would not turn around but would go back the other direction as fast as it went down. It went up and down the lake about three times then left. I have seen two other UFOs one was saucer shape with a dip in the center and the other was oblong. All three of the sightings were in Alabama. The round UFO I saw one night coming home from work when I like in Baview. That area at the time was concidered to be very spookey and a lot of people did not like to take that road home. The lake was a dump and no one was allowed in it. We lived with our back door to the lake at that time. The UFO was so big that you could not miss it. I stoped but some thing scared me. There was something shouted out dont stop and it felt like the car rocked with that, and I left fast. I was shaking like a leaf and I went home and called the UFO number in the phone book. The saucer shaped UFO was over Dora High school and the oblong one was across the road from there hovering over a place where the dumped coal that was sold to people who used it for heating there homes."]}