{"Longitude":"-77.429998","Tags":"City","Region":"Virginia","Summary":"It was a light emmitting object appearing like a star.","Object Features":"Unknown","Disposition":"Unknown","Date Submitted":"03/24/2007 01:30 UTC","divs":["Sighting DetailsI was outside on my front porch smoking a cigarette star gazing like I often do. I first noticed the object as a moving light in the sky and thought it was an airplane. But it was somewhat odd in that there were no flashing lights and it appeared to be quite distant but relatively large for something that distance away. I first noticed the light at about twenty degrees to my left from vertical, this was to the north from the direction I was standing. It continued moving north at a pace that made me first assume it was an airplane, however after a second or two of observing the object it suddenly reversed direction and accelerated to an incredible speed. It went from roughly 50 degrees from horizontal to the north to disappearing over the southern skyline in less than one second! While I could not accurately guess as to its altitude to gauge its speed it seemed to be at least as high as most overpassing airplanes if not much further. I know this kind of accelleration and speed is not attainable by human air craft so the event left me quite stunned."],"Weather Factors":"None","Country":"United States","Source":"MUFON","City":"Richmond","Sighting Duration":"00:00:05","Log Number":"US-03262007-0016","Latitude":"37.549275","Case Number":"6642","trends":["There have been 39 other sightings in Richmond","There were no other sightings in Richmond on or around March 24th 2007"],"files":["/var/www/straped/mufon/html2text/6642.html.txt","/var/www/straped/mufon/org/6642.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.549275,+-77.429998(6642)&iwloc=A&hl=en\"> mufon case (6642) map </A>","Viewing Distance":"Over One Mile","Object Shape":"Unknown","Object Flight Path":"Path with directional change","Date of the Event":"03/24/2007 01:30 UTC"}