{"Object Features":"Undisclosed","Log Number":"US-03262007-0018","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.511781,+-71.739813(6644)&iwloc=A&hl=en\"> mufon case (6644) map </A>","Source":"MUFON","files":["/var/www/straped/mufon/html2text/6644.html.txt","/var/www/straped/mufon/org/6644.html"],"Longitude":"-71.739813","Tags":"City","Object Shape":"Circle","Country":"United States","Sighting Duration":"Undisclosed","Date of the Event":"08/09/1997 10:50 UTC","divs":["Sighting Detailsa friend and i were traveling down rt.2 in my truck when we both at the same time saw a metal object floating above the highway, as we went under it,i could see the different sizes and shades of the metal like panels covering it.it was about 1 and half telephone poles high,so we pulled over along with acouple of other cars to watch it,it started to change colors and admit a smoke or steam around it,as it apeared to be spinning,then a red blinking light came on,on the bottom, and started to make a sheeee- sound,like the hydrolics pumps on fun park ride,then 3 round glowing balls came out of the bottom and started flying over our heads at a very high rates of speed, i ran to my truck to get my camera,then i began to snap the first picture and 1 ball went back in,then i snapped second picture and second ball went in,and after the third picture third ball went in and like turning a light switch off, it disserpeared. my friend and i said we would not tell anyone if the pictues dont come out. next morning i dropped the film off at brooks in leo. then after work i went to pick them up and the last 4 pictures were all black. i feel that someone might have called it in and said that pictures were taken,and goverment? got them first.or when the balls flew over at the end it did something to my camera? my feelings on this object are that i am 110percent sure that it was not from this earth. it realy has changed my life. i hope i live to see the day when there is proof for the world to see and beleive like i do."],"Summary":"not a goverment stunt because it being derctly over the highway if it fell could have killed people.","Weather Factors":"Unknown","City":"Leominster","Disposition":"Unknown","Date Submitted":"08/09/1997 10:50 UTC","Region":"Massachusetts","Case Number":"6644","trends":["There have been 9 other sightings in Leominster","There were no other sightings in Leominster on or around August 9th 1997"],"Object Flight Path":"Undisclosed","Latitude":"42.511781"}