{"divs":["sighting detailsi was a passenger in an automobile that was being driven along ocean drive in corpus christi, texas. it was about 30 minutes from sunset, headed away from downtown. i was casually gazing at the sky and the ocean when i noticed a metallic object low in the sky that appeared to be very bright. it was so bright, i pointed it out to the driver, wondering if it could be a shooting star. the object appeared to be either very far away or moving towards us, because it was not moving across the sky or up\\down. as we both were watching, the object suddenly moved incredibly fast. it moved first in one direction, then banked in a arc of blinding speed. it curved back and sped off over the ocean and disappeared into the sky. we both shouted in surprise and could not imagine what it was that we saw. we checked the newspaper to see if there was any plane being tested in the area or to see if anyone else saw it and reported it to the paper, but there was nothing about it. it was as if we were the only two people to have seen it. like any person in the u.s., i have observed hundreds of planes and flying objects, but nothing has ever moved like the object i observed that day. i have never forgotten the sight. i came to this website to see if anyone else had ever recorded seeing a similar object in corpus christi and decided to (finally) tell someone about what i saw that day.:-)"],"Case Number":"6647","files":["/var/www/straped/mufon/html2text/6647.html.txt","/var/www/straped/mufon/org/6647.html"],"Summary":"bright object moving at blazing speed unlike any plane by the ocean","Object Shape":"Disc, Star-like","Log Number":"US-03272007-0003","Tags":"City","Sighting Duration":"Undisclosed","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=27.803113,+-97.389731(6647)&iwloc=A&hl=en\"> mufon case (6647) map </A>","Object Features":"Undisclosed","Object Flight Path":"Hovering then path","City":"Corpus Christi","trends":["There have been 26 other sightings in Corpus Christi","There were no other sightings in Corpus Christi on or around September 1st 1974"],"Latitude":"27.803113","Date of the Event":"09/01/1974 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unknown","Source":"MUFON","Date Submitted":"09/01/1974 12:00 UTC","Longitude":"-97.389731","Country":"United States","Weather Factors":"Unknown"}