{"City":"San Ramon","Object Shape":"Star-like","Weather Factors":"Unknown","Date of the Event":"11/30/1996 12:00 UTC","Disposition":"Unknown","Tags":"City","Source":"MUFON","Object Features":"Unknown","Region":"California","Longitude":"-121.978015","Object Flight Path":"Path with directional change","Log Number":"US-03272007-0008","trends":["There have been 5 other sightings in San Ramon","There were no other sightings in San Ramon on or around November 30th 1996"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.779927,+-121.978015(6652)&iwloc=A&hl=en\"> mufon case (6652) map </A>","divs":["Sighting Detailsive had a dozen sightings of these \"lights\", star like. the two most interesting happened in '97 and '01. the first occurred while i was sitting on my front porch having a cigarette. as i was stargazing at a patch of sky to the north, the 5-7 stars i was looking at began to slowly form the shape of a circle, then began rotating clockwise, like a wheel or a childs pin wheel in the wind. after about 5 seconds they dispersed and the lights slowly faded away. i was aw struck the second also happened in northern california. i was about four hours away from point reys on foot hiking tword the ocean. once i got to the coast it was dark. while i was standing on the beach and looking out over the water. a light appeared at close range but never emerged from the fog. as i was standing there i was once again aw struck by the light. i entered a kind of half awake half dream state and a mental image of the crafts interior appeared in front of my eyes. i saw two human figures inside standing up observing me as i was looking back at them, the air inside was super clean, like something in a laboratory clean room. the image in my head was crisp,clear and in black and white. and the only way i can clearify this experience to you is something a kin to what happens to a person after they set down a book theyve been reading for several hours, thier I.Q. and eye sight are raised to crisper and clearer levels. after about 5 seconds of this the light slowly faded away as it always does. ive mostly kept this to myself until now, i dont know why im coming out with this. im afraid people will think im nuts. but after seeing other people do it on the history channel i figured what the hell, what harm can it do. thank you,"],"Case Number":"6652","Summary":"jaw dropping aerial acrobatics. no doubt e.t.","Country":"United States","Date Submitted":"11/30/1996 12:00 UTC","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/6652.html.txt","/var/www/straped/mufon/org/6652.html"],"Sighting Duration":"Undisclosed","Latitude":"37.779927"}