{"Object Flight Path":"Undisclosed","Summary":"CIgar Shape UFO over Bloomfield College moving at a steady spead at about","Object Features":"Undisclosed","Case Number":"6653","Date Submitted":"03/27/2007 03:45 UTC","Weather Factors":"Unknown","Source":"MUFON","Tags":"City","Object Shape":"Cigar","divs":["Sighting DetailsI was parked outside one of the dorm houses waiting for a friend to come out. I looked out of the sunroof of my car directly straight up at the sky and there it was. It was a white cigar shaped object without wings. I kept blinking my eyes because I was trying my hardest to find some sort of wings on the object, there were none. So I thought to myself, \"perhaps its a helicopter\" but it had no characteristics of a helicopter neither. In my area there are lots of news and police helicopters always around the area, so i'm used to spotting them, but this object was just weird. It flew like a airplane very straight and with a constant speed in a perfect straight line across the sky. It was at a pretty high altitude, yet moving a lot quicker than a normal airplane would be moving at that altitude. Again I live by New York and Newark, so I see many airplanes on a daily bases. This object was just different simply because it made no sound, had no apparent wings and flew at a high altitude with above average speeds. There where no lights on the object and I watched it as it flew from the right of me towards the sunset on the left side of me clear across my view of the sky."],"City":"Medford","Log Number":"US-03272007-0009","Date of the Event":"03/27/2007 03:45 UTC","Viewing Distance":"Unknown","trends":["There have been no other sightings in Medford","This sighting has never been favorited."],"Longitude":"-74.823611","Region":"New Jersey","files":["/var/www/straped/mufon/html2text/6653.html.txt","/var/www/straped/mufon/org/6653.html"],"Sighting Duration":"00:01:00","map":"<A HREF = \"http://maps.google.com/maps?q=39.900833,+-74.823611(6653)&iwloc=A&hl=en\"> mufon case (6653) map </A>","Disposition":"Insufficient Data","Country":"United States","Latitude":"39.900833"}