{"Weather Factors":"None","trends":["There have been 3 other sightings in Rocky Mt","There were no other sightings in Rocky Mt on or around February 28th 2007","This sighting has never been favorited.",""],"Country":"United States","Longitude":"-77.790534","Object Features":"Unknown","Tags":"City","Object Flight Path":"Straight-line path,Path with directional change","Log Number":"US-03272007-0011","Sighting Duration":"00:15:00","Date of the Event":"02/28/2007 01:15 UTC","divs":["Sighting Details1. On February 28, 2007 I had been filming my grand kids playing in our backyard with my new Canon model ZR850 camcorder. After the kids had gone in to eat lunch I saw a high flying jet and thought I would see if I could capture a video of the plane going over. Soon after I started filming a second jet appeared into view close to the first jet so I tried to get both into view. After a few seconds I noticed something go through the view finder very fast and to the bottom of the jet. 2. I saw the (second object) object for only a second or two when it came through the view finder from left and disappear from view to the right. I only saw the first object after I downloaded the tape to my PC and went through the section of video frame by frame. 3. I had (have) no idea what the objects were. 4. The objects seemed to be two bright points of light traveling to the top and bottom of the jet. (Maybe to the right and left of the jet would be a better description?) The first object to come into view seems to turn away from the plane as it got closer. The second object passes by the jet and disappears from view. 5. I was curious at the time as to what the objects were as I still am. 6. The objects passed from view in the viewfinder. I don't think I would or could have seen them with the naked eye. I have very little experience with camcorders and to my knowledge all settings were set at the factory default settings. I will attach a small clip of the section of the tape as I don't know if I can e-mail the entire clip being it is about 130MB. The clip I'm sending is only about 5 seconds long but if you go through it frame by frame you can see both objects. If possible let me know what they may be. Thanks for your help. Doug Cartledge"],"Date Submitted":"02/28/2007 01:15 UTC","Source":"MUFON","City":"Rocky Mt","Disposition":"Unknown","Object Shape":"Unknown","Region":"North Carolina","files":["/var/www/straped/mufon/html2text/6655.html.txt","/var/www/straped/mufon/org/6655.html"],"Viewing Distance":"Unknown","Case Number":"6655","Latitude":"35.93821","Summary":"While filming two jets flying over my home I saw what appeared two small bright objects fly by the jets. One seemed to turn away, the other flew pass the jet.","map":"<A HREF = \"http://maps.google.com/maps?q=35.93821,+-77.790534(6655)&iwloc=A&hl=en\"> mufon case (6655) map </A>"}