{"Region":"Michigan","Log Number":"US-03272007-0012","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Insufficient Data","Country":"United States","Latitude":"43.674415","Object Features":"None","Longitude":"-84.376674","Source":"MUFON","Object Flight Path":"Path then hovering","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=43.674415,+-84.376674(6656)&iwloc=A&hl=en\"> mufon case (6656) map </A>","Date of the Event":"03/26/2007 08:30 UTC","City":"Sanford","Case Number":"6656","divs":["Sighting DetailsI want to report something that happened yesterday evening in Sanford, Michigan. Three friends and myself went out boating on Sanford Lake at 5:00 p.m., March 26, 2007. We launched the boat at the Sanford Lake Park public access and headed north up the lake. We boated for about 3 hours and headed back south toward the public access. The weather was unusually warm that day (76 degrees which broke a record from 1925!) and the sky was mostly clear. It was around 8:30 p.m. and the sun had almost set. We could see Venus and several star constellations. We saw a few planes way up in the sky with their usual aviation lights. However, as we were boating south on the water, my friend noticed a big bright yellow ball of light hovering just above the tree line. From where we were, it seemed like it was the size of a jet plane and shaped like a lemon. We also saw a light beam coming out of the bottom at about a 45 degree angle. The light only emitted a short distance from the object. It was moving south very slowly and seemed to be keeping pace with our boat (we were going very slow). All of us saw the light and we watched it for 7-8 minutes and it stayed at tree line level the whole time. We then boated under the US-10 over pass. When we came out from under the over pass and could see the object again, bu then it began to rise very slowly, straight up into the sky. We watched it rise for 2-3 minutes and it ended up about 45 to 50 degrees up from the tree line where it stopped and hovered motionless. As we watched it, it looked like something wrapped around the light and it went out and disappeared. The way it went out was strange. It looked like a blanket wrapped around it, almost like a cloak wrapped around it in a counter clock-wise direction. And it just disappeared into thin air. Needless to say, we were all pretty wide-eyed about the experience and confirmed to each other what we had seen. We all agreed that it was definitely not a helicopter as the shape and lights were not that of a copter and the way it just disappeared like a light being turned out was very unusual. Two of the witnesses have flown many times in helicopters and are familiar with them. This is the second time I've encountered an unexplainable object in the sky."],"Summary":"Large lemon shaped yellow light sighted over Sanford Lake, Michigan","Sighting Duration":"Undisclosed","Date Submitted":"03/26/2007 08:30 UTC","files":["/var/www/straped/mufon/html2text/6656.html.txt","/var/www/straped/mufon/org/6656.html"],"trends":["There have been 4 other sightings in Sanford","There were no other sightings in Sanford on or around March 26th 2007"],"Object Shape":"Egg","Weather Factors":"None"}