{"Log Number":"US-03272007-0015","Weather Factors":"Unknown","Object Shape":"Triangle","Longitude":"-71.07078","Source":"MUFON","Object Features":"Undisclosed","Date of the Event":"01/16/2007 07:00 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path","trends":["There have been 9 other sightings in Haverhill","There were no other sightings in Haverhill on or around January 16th 2007","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=42.784452,+-71.07078(6660)&iwloc=A&hl=en\"> mufon case (6660) map </A>","Date Submitted":"01/16/2007 07:00 UTC","Tags":"City","Disposition":"Unknown","Region":"Massachusetts","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Summary":"saw triangular object directly above me hovering with no sound","Sighting Duration":"Undisclosed","Case Number":"6660","divs":["Sighting DetailsI was driving my car in a residential area of Haverhill, MA going back home from picking up a pizza. As I drove up Hilldale Ave. I noticed a light in the sky that looked stationary. I had no idea what it was but because it wasn't moving it caught my eye. As I got closer, I pulled over letting cars go past me, and leaned out of the window to see this object almost directly above me (I estimate it was 1200 feet above me). The object was not moving and was completely silent. As I looked up I saw a dark grey triangular object (see drawing) with two red lights and at the bottom two criss-cross long panels with white lights on them. The strangest part of what I saw (besides the hovering with no sound) was the cobalt colored \"blue mist\" surrounding the object. From the moment I looked at this object until it started to move was probably 5 seconds ( I had this feeling that \"it\" or \"something\" knew I was observing it, and that's why it moved so quickly from its stationary position. When it started to move it made a low whooshing sound (almost like a \"quiet\" fighter jet and at a lower frequency). As it moved, the \"blue mist\" surrounding it stayed with the object. It moved slow, but seemed to get out of my sight quickly, which seemed odd. So I probably observed this object for about 40 to 50 seconds total, with about 12 seconds looking up close (5 seconds not moving, and 6-7 seconds moving away). I thought of trying to follow it, but didn't. I actually felt very lucky to see something like this. It kind of hit me as I was driving away that they could have come from another part of our universe, another time of this earth (past or future), or from another dimension."],"City":"Haverhill","files":["/var/www/straped/mufon/html2text/6660.html.txt","/var/www/straped/mufon/more/6660_submitter_file1__mysighting.jpg","/var/www/straped/mufon/org/6660.html"],"Latitude":"42.784452"}