{"Source":"MUFON","Weather Factors":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","Summary":"Had seen a being looking over me in bed, where i couldnt move anymore.","map":"<A HREF = \"http://maps.google.com/maps?q=35.203322,+-111.634759(6663)&iwloc=A&hl=en\"> mufon case (6663) map </A>","Date Submitted":"01/31/2005 01:30 UTC","Object Features":"Other","Region":"Arizona","Object Flight Path":"Other","Disposition":"Unknown","Log Number":"US-03272007-0018","City":"Flagstaff","Longitude":"-111.634759","Latitude":"35.203322","Object Shape":"Other","divs":["sighting details i worked all day at arizona snowbowl ski resort. i went home after work and went to bed early(10-10:30pm). the next thing i know is that i woke up i believe anround 1-1:30am, not sure exactly what time, due to a feeling of a presence of someone looking at me. all i really remember is a person with a rather large head and eyes looking down on me in bed. i tryed to move, but wasn't able to. there must have been some sort of force field holding me down. all i could use were my hands and barely able to lift my head with all my energy. the only thing i could do was flip the bird to this person\\being. i know it sounds funny, but this event scarred me so bad, i couldn't sleep in my bed for weeks fearing they would come back. now heres where the story turns twisted. i had not told anyone but my father what had happened to me. he thought that it was just a dream and kind of laughed. three to four weeks later, my younger brother devin had the exact same thing happen to him in his room. i had not told him anything about this sighting. i noticed he wasn't sleeping in his room for a while, so i asked him what was going on. he told me that he had an encounter with something not from this world in his room the night before. he then explained to me exactly to detail what had happened to me a month or so prior to him. if you guys have any questions or comments, feel free to e-mail me at darkskycitymob@yahoo.com. i am still kind of freaked about this. not one day goes by that i don't think about this. please try to explain! have others had similar experiences. sincerely, eric dosh"],"Tags":"City","Date of the Event":"01/31/2005 01:30 UTC","Viewing Distance":"20 Feet or Less","trends":["There have been 24 other sightings in Flagstaff","There were no other sightings in Flagstaff on or around January 31st 2005"],"Case Number":"6663","files":["/var/www/straped/mufon/html2text/6663.html.txt","/var/www/straped/mufon/org/6663.html"]}