{"Log Number":"US-03272007-0019","map":"<A HREF = \"http://maps.google.com/maps?q=38.899912,+-77.031346(6665)&iwloc=A&hl=en\"> mufon case (6665) map </A>","Summary":"Approx. 50' disc shaped windows around bottom (like Space Needle)","Weather Factors":"Unknown","Tags":"City","Case Number":"6665","Sighting Duration":"Undisclosed","Date of the Event":"08/15/1968 10:15 UTC","Source":"MUFON","trends":["There have been 82 other sightings in Washington","There were no other sightings in Washington on or around August 15th 1968"],"Latitude":"38.899912","divs":["Sighting DetailsWarm summer night in 1968 I took my telescope out to look at stars. As I was trying to focus it, a light disrupted me. I thought it was light from the moon but when I looked up it wasn't the moon. It was a disc shaped object with lights around the bottom. I ran into the house to get the family and they thought I was joking until they saw what I saw. Our neighbors were watching too. It was about 500' away and I felt we might see someone come to the lights on the bottom. They were similar to windows and I was sure we could of saw someone if they came to the windows. We never saw anyone. I was hoving over a power sub-station and slowly moved to the east. I wanted to get in the car and follow. But the family and neighbors were too afraid. It slowly disappeared out of sight. We called Sandpoint Naval Air Station which was less then 3 miles away over the hill and across Lake Washington. Sand Point said they were getting a few calls but there was nothing on the radar. I have waited this long out of fear of ridicule. Both the power sub-station and Sand Point Naval Air Station are gone. This sighting was in the Finn Hill area at about 392'elevation. Other people must of seen this but I am unaware if it was reported. When we called Sandpoint we felt it was reported but we never hear about again. I would love to know if you have any info on this sighting. Please contact me at takrn7@comcast.net"],"files":["/var/www/straped/mufon/html2text/6665.html.txt","/var/www/straped/mufon/org/6665.html"],"Region":"Washington","Object Shape":"Disc","Country":"United States","Date Submitted":"08/15/1968 10:15 UTC","Viewing Distance":"501 Feet - 1 Mile","City":"Washington","Object Flight Path":"Hovering then path","Object Features":"Dome, Window(s)","Disposition":"Hoax","Longitude":"-77.031346"}