{"Case Number":"6667","Country":"United States","Viewing Distance":"Unknown","Summary":"3 Orange disk-like orbs over Downtown Portland","files":["/var/www/straped/mufon/html2text/6667.html.txt","/var/www/straped/mufon/org/6667.html"],"Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Region":"Oregon","map":"<A HREF = \"http://maps.google.com/maps?q=45.533242,+-122.673457(6667)&iwloc=A&hl=en\"> mufon case (6667) map </A>","trends":["There have been 158 other sightings in Portland","There was one other sighting in Portland on or around May 1st 2005"],"City":"Portland","Tags":"City","Latitude":"45.533242","Date Submitted":"05/01/2005 12:00 UTC","Date of the Event":"05/01/2005 12:00 UTC","Log Number":"US-03272007-0021","Object Flight Path":"Undisclosed","Longitude":"-122.673457","Weather Factors":"Unknown","divs":["Sighting Detailsapprox 1:00 AM Relaxing on balcony (approx 60 feet up) with 4 friends; first \"vessel\" seen moving South parallel to the river over downtown Portland. From our vantage point seemed to be moving over the Wells Fargo tower, altitude unknown, but relatively low. Object was very bright and there was a visible halo. The \"vessel\" appeared to be orb-like due to the extremely bright orange fire-colored halo there was a definite disk-like shape. The lights seemed to be at the bottom of the ship, the top of the ship was very hard to make out but was definatley a very large metal structure. A second ship of same description came into view moving at the same slow, lurking speed, almost as if they were patrolling or searching for something, a third ship comes into view a few moments later. All three ships pass the northeast corner of the building and are no longer visible. We run down the stairs to watch them move across the rest of the sky. They have stopped moving across the city. They are in a clear triangular formation like a 90 degree triangle and are moving vertically up and out of the atmosphere until they can no longer be seen. This upward movement is what really classifies this as a spectacular event. I have been out in the wilderness and seen sattelites and \"shooting stars\" and can tell the diffence between helicopters and airplanes. These objects were not in these categories, they flew in formation, and were quite odd. Very Strange and awesome but spine tingling and scary as well. I have goosebumps as I place this report here two years later The event was so odd and mystifying that no one even took a photo, though the event lasted many minutes. I believe this event to be significant"],"Object Shape":"Disc","Source":"MUFON","Disposition":"Unknown"}