{"divs":["sighting detailsmy wife and i arrived at boulder oaks rv resort b\\t 1700 and 1800 hrs. we were assigned space 137. after parking our rig and setting up,we had some supper and relaxed as we had been driving most of the day. at approx. 2030-2100 hrs.my wife asked me if i had conneted the sewer line,she wanted to wash some clothes. i had not. i went outside and around to the right side of the trailer(looking from the front) and made the sewer connection. as i stood up,a movement above me caught my eye and i looked up. i observed a flying wing shaped craft proceding west bound parallel to hwy.93. i estimate the speed to be no more than that of cessna 152 at cruise and i could not hear any propulsion sound. i estimate the craft's altitude to be less than 1000 ft. as its shape was clearly visible due to back scatter light from the ground. the craft had five circular white spots(not lights)on the side that i could see. there were no lights visible. if the craft was at 1000ft,i would estimate its wing spread to be approximately 100ft. when i first saw the craft it was approximately above canyon dr. and between hwy.93 and industrial rd. it moved west at constant speed and made a shallow right turn at the railroad pass near the henderson,nv city limit. and passed out of sight. fot the first eight or ten seconds i stood there astounded,then i yelled for my wife to come out and look. she came out but was under the awning on the trailer and did not get to the right side until it was too late to see the craft. boulder oaks rv resort is located at 1010 industrial rd.,boulder city,nv 89005. tel. 800-478-5687 i held a private airman's certificate with instrument rating and was a los angeles county deputy sheriff for 34 years(7 regular\\27 reserve). i hold a bs degree in chemistry from ucla and worked many years at several aerpspace firms and at jpl and sri."],"map":"<A HREF = \"http://maps.google.com/maps?q=35.986491,+-114.826365(6668)&iwloc=A&hl=en\"> mufon case (6668) map </A>","Region":"Nevada","Object Features":"Insignia","Latitude":"35.986491","Date of the Event":"06/26/2001 12:00 UTC","Country":"United States","Summary":"Oserved flying wing craft W/B parallel to Hwy 93. Speed est < 100 mph. No sound.","Date Submitted":"06/26/2001 12:00 UTC","trends":["There have been 5 other sightings in Boulder City","There were no other sightings in Boulder City on or around June 26th 2001"],"files":["/var/www/straped/mufon/html2text/6668.html.txt","/var/www/straped/mufon/org/6668.html"],"Case Number":"6668","Object Shape":"Boomerang","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","City":"Boulder City","Weather Factors":"Unknown","Disposition":"Unknown","Log Number":"US-03272007-0022","Longitude":"-114.826365","Tags":"City","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed"}