{"Sighting Duration":"Undisclosed","Object Shape":"Star-like","City":"unknown","Country":"United States","Date Submitted":"09/20/2006 12:00 UTC","Weather Factors":"Unknown","trends":["There has been one other sighting in unknown","There were no other sightings in unknown on or around September 20th 2006"],"Viewing Distance":"Unknown","Tags":"City","Region":"Pennsylvania","Summary":"while on a houseboat, me and other witnessed a (star) brighten then move then dim","Disposition":"Unknown","Source":"MUFON","Date of the Event":"09/20/2006 12:00 UTC","divs":["Sighting DetailsI would first off like to say that I am not sure why I am sending this, I feel like a fool. However what myself and two others saw was at best... unusual. we had taken a vacation at Raystown Lake in Pennsylvania and on our ssecond night we happened to be up late and sitting on the roof of the boat just looking at the sky without the known effects of light polution to which we are used to. while sitting there chatting and joking around I happened to look up and see two bright \"stars\" and I knew one of them would be the north star, so joking around and thinking nothing of it I said, \"hey who knew there was two north stars... (that brought to the attention of my friends the second bright star that was equal to or a little brighter than the north star... it is at this point that our strange experience happened.) my friends looked up and approx 5 - 10 seconds pass and then bright star on our right DIMMED TO ALMOST A NON-VISIBLE LIGHT (if we had not been looking at it when it dimmed we would not have been able to maintain visual conatact) after dimming it moved down (looking up at the sky hold your arm up and make your fingers into the letter C and that would be the approx. distance it moved - taking about 2 seconds to move from index fingertip to thumb tip) it then got brighter than it was before; dimmed again and moved to the left at double the aformention distanced (same speed). It then stopped brightened again then dimmed to the point where once you took your eyes off of it you would not be able to locate it again but only be able to look in that area and guess. now I have lived on air force bases my whole life and I will not say that this was a \"alien craft\" but I will say that the light was not in our atmosphere and no airplane I have ever seen can stop in the air. I do not think that our space shuttles can A. produce such an intense ligth B. move in that way due to (and I am pretending to know here) orbital patterns? so... there it is. I told someone and know I can be done with this. I only ask that I not be contacted unless and I mean unless this is a common experience and it has a explanation, or someone has video of the same thing I have seen and only to confirm that what that video shows and what I saw are the same thing. Chris Stover"],"Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Latitude":"41.212792","Longitude":"-77.184905","Log Number":"US-03272007-0023","files":["/var/www/straped/mufon/html2text/6669.html.txt","/var/www/straped/mufon/org/6669.html"],"Case Number":"6669","map":"<A HREF = \"http://maps.google.com/maps?q=41.212792,+-77.184905(6669)&iwloc=A&hl=en\"> mufon case (6669) map </A>"}