{"Case Number":"6670","Disposition":"IFO","Date of the Event":"03/20/2007 07:20 UTC","Weather Factors":"Unknown","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.980056,+-85.612191(6670)&iwloc=A&hl=en\"> mufon case (6670) map </A>","trends":["There have been no other sightings in Edmonton","This sighting has never been favorited."],"Object Shape":"Star-like","City":"Edmonton","Summary":"Appeared as a bright light,,began to swing back and forth like a pendulum then spiral like a corkscrew.","divs":["Sighting DetailsThis is my 6th sighting,since this night there has been 3 more sightings in the same general part of the sky.I was talking to a friend on the phone when I noticed a bright light in the western sky.I got my binoculars out,,because I have learned from years of watching for UFO's that they are a different kind of light.I watched as it began to swing back and forth like a pendulum then after a few minutes it would go in small circles in a clockwise direction ,,like a corkscrew ,,then back to the pendulum motion.After about 15 minutes it split apart and became 2 different ones.After about 1 minute it went back together and changed colors from blue to green then back to just a bright light.As I watched it would move very quickly from one position to another so fast that I would lose sight through my binoculars and would have to look to find it ,,then it would come back to the same position.After 1 hour and about 10 minutes I noticed 2 more lights come from it and went in a southern direction very quiclky and was out of sight in a blink.After another 10 minutes or so I noticed some red lights below the main one that were a lot closer to me.They appeared to be within a mile or closer and was going back and forth over the tree tops in a pattern ,,like a search pattern.This continued for at least 20 minutes then disappeared to the south and did not return until the next night at about the same time and in the same place doing the same pattern. The main light which appeared first stayed in sight until it went behind some trees out of my sight.The next 2 nights more lights appeared in the same area at about the same time,,,around 7 p.m. eastern time. They would do a seach type pattern in the sky close enough that I could tell that they made no sound at all. I have seen several in my life ,,,the best and clearest went right over my head and was rotating with different colored lights .It was only about 1000 feet above me at the closest point and made no sound,,then made a 90 degree turn and was gone in a flash."],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Date Submitted":"03/20/2007 07:20 UTC","Country":"United States","Latitude":"36.980056","Region":"Kentucky","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Source":"MUFON","Tags":"City","Longitude":"-85.612191","files":["/var/www/straped/mufon/html2text/6670.html.txt","/var/www/straped/mufon/org/6670.html"],"Log Number":"US-03272007-0024","Sighting Duration":"02:20:45"}