{"Viewing Distance":"Unknown","Disposition":"Unresolved","Source":"MUFON","Case Number":"6671","Date Submitted":"06/18/1978 12:00 UTC","Log Number":"VN-03272007-0025","trends":["There have been no other sightings in Can Tho","This sighting has been favorited 3 times."],"Object Shape":"Star-like","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/6671.html.txt","/var/www/straped/mufon/org/6671.html"],"Object Features":"Undisclosed","Tags":"City","Date of the Event":"06/18/1978 12:00 UTC","Sighting Duration":"Undisclosed","Longitude":"105.783333","Country":"Vietnam","Region":"Cần Thơ","Latitude":"10.033333","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=10.033333,+105.783333(6671)&iwloc=A&hl=en\"> mufon case (6671) map </A>","divs":["Sighting Details I remembered when I was a child, my grandmother told me not to go near the river because they had seen weird living creature in the river. People in our neighborhood are uneducated therefore they do not know what they had encounter, but story told that there was a lot of childs being abducted by this weird living creature. My grandmother house is about 50 yard from the river and the river is where I like to hang out the most since my mother was always away for business. I like to sit on the coconut tree leaning against the river currents, looking at the stars at night. There are several time, I had seen bright star object flying very quickly at night and scope down into the river currents. I don't know what it was except thinking that it was a falling stars. Some night, I even seen the bright star object move out of the water very quickly and into the sky. I was confuse about falling stars since it can move down into the river and up into the sky. One night, I remembered it was a full moon and I can even see the full moon shinning into the river and my shadow as I walked toward the river with my grandmother. I had asked my grandmother to come along with me that night because I was scare and I needed to go to the restroom near the river. We do not have a restroom in the house at that time because we was poor. As I get closer to the river, my grandmother and I saw two weird living creature sitting on the coconut tree leaning against the river currents that I had always like to sit and watch the stars. They were talking to each other and their hands are pointing at the stars. We were standing about 10 feet behind them therefore they don't even notice that we were there. My grandmother was really scare that she tried to scream but her mouth cannot make any sound. She grabbed my hand really hard because she was shaking and scare. At that time, I wasn't scare because I can see their shadow which told me that they are not a ghost and I was amazed of that one minutes encounter with aliens. I remembered it so clearly like it was yesterday, a feeling that I will never forget until I grow old and die. The two alien wasn't wearing any clothes as they sit on the coconut tree with there legs hanging down. They look so friendly and relaxing on that very warm night. I can see their skin was very white and slippery like fish skin. There head is so big but no hair. It seem like they don't have any hair except white slippery skin. Their eyes are so big and dark, but shinny. Their mouth and nose are small. I can see there fingers are long and also there tose. They don't seem short to me even thought I was a child, but I know they are taller then my grandmother. I was lost in my curiousity with the aliens body feature. Suddenly, my grandmother scream so loud that the aliens turn their body around and look at us in the eyes for a few second. They stand up on the coconut tree and dived exactly like the professional olympic swimmer diving contest. I don't see a lot of water splash in the air and I don't see they ever come up for breathing. My aunty and uncle rush outside the house and asked, \"What had happen.\" I was so amazed as to what I had encounter that very night and a little regret that it end so quickly. In my eyes during that time, they almost look like human being. At that time, I don't really know what I had encounter but when I got into junior high in the US, then I've finally knew what I had encounter. Now that I am 35 year of age, I can finally tell a story of my one minute encounter with aliens. I don't like to tell this story to my friends because I don't want them to look at me differently. It is weird for people that haven't encounter with aliens, but it is amazing for me to have the opportunity to see aliens once in a lifetime. I believe there are many undiscover thing in this world that we have not encounter and maybe we are just aliens ourselves. Thank you for taking the time to read my story. Sincerely, Dai Nguyen"],"City":"Can Tho","Summary":"One minute encounter with alien in Can Tho of Vietnam."}