{"map":"<A HREF = \"http://maps.google.com/maps?q=37.973983,+-91.824633(6672)&iwloc=A&hl=en\"> mufon case (6672) map </A>","trends":[],"Country":"United States","Tags":"City","Summary":"A dark object came down and then due south. Never seen anything like it!","Object Features":"Undisclosed","Case Number":"6672","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","City":"Undisclosed","Longitude":"-91.824633","Viewing Distance":"Unknown","divs":["Sighting DetailsI was in my hot tub just like almost every other night and I was looking at the stars, it was pretty clear that night... then I noticed that a few stars I was looking at were just getting like blocked out? so I sat up and wiped my eyes and got out of the steam coming off the water and was trying to see really good, and I could make out a DARK object (the best way to discribe it is if a cruise liner was going through the ocean with not one light on, you know you can make out the shape, and tell its moving but it was totally dark) also no sound at all. this thing did not want to be seen, It came down and then whent into a clouded part of the sky, so I could see only the back part of it. It was alot..ALOT bigger than I thoght ufos would be! I think the thing was triangle shaped but would'nt swear on it, the back was rectangle, but very thick, I'm telling you this thing was BIG. I was really in shock for a few minutes! I always heard of lights asociated with ufos. This was hard to see but once I did...I realized there might be alot more ufos flying around than you think? this great big thing was the same color as the night sky and no lights no sound...it's a little scary. I would not have been able to track it if I wasnt looking right at those few stars but once I seen it and followed it and it came down to about 40,000 feet and then the contrast of the clouds was the only time I could really make it out.(It was very stelthy) the whole sighting lasted less than ten seconds. Anyway thats it, I never seen a ufo before or since and I'm 44 years old. by the way I don't drink or smoke anything! and I came in the house and said to my wife \"Holly Shit I just seen a ufo\" she said thats nice don't tell anyone else that. What I seen was real... very real. Thanks! Larry"],"Date of the Event":"01/15/2007 12:00 UTC","Date Submitted":"01/15/2007 12:00 UTC","Log Number":"US-03272007-0026","Region":"Missouri","Latitude":"37.973983","files":["/var/www/straped/mufon/html2text/6672.html.txt","/var/www/straped/mufon/org/6672.html"],"Source":"MUFON","Sighting Duration":"10:30:00","Object Shape":"Square, Rectagular, Triangle","Disposition":"Hoax"}