{"trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around May 31st 1992"],"City":"Los Angeles","Latitude":"34.083944","Summary":"three space travelers visit my home","Date Submitted":"05/31/1992 12:00 UTC","Object Features":"Undisclosed","Region":"California","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.083944,+-118.200028(6675)&iwloc=A&hl=en\"> mufon case (6675) map </A>","Date of the Event":"05/31/1992 12:00 UTC","Weather Factors":"Unknown","divs":["Sighting DetailsMy name is Rene Barrios. I have a small office where I work as a Realtor, Paralegal, Notary Public, Tax Preparer. I been writing poetry and two years ago I published a book. I study a major course in political science in the Fuh Sing Kang College in Taiwan. I took 32 units of psychology at a community college. I read the Classics and a lot of phylosophy. I am a normal person father of one boy and two girls, all of them pursuing a professional career. My wife is a physician from El Salvador. I do not use or have been used any kind of drug. I do not have a drinking habit, i do not use any kind of medicament. I do not like to talk about this because some time people think you are not a normal person. That night my friends Raul Blanco and Mario Jarquincame to visit me at Montecito Heights. They both were always talking about the war in El Salvador. This botter me. I always express my felings about the war. They will stay overnight, but they decide to go sleep in an small plave we have in the back of the house, in order to feel free to talk about politics, war and guerrilla. After they left, I check all the windos and doors to see if everything was lacked. Then I went to bed. three minuts after, I herd a noice like an electrical saw comming from behind the bathroom, in the patio, there was an orange tree. I tried to stand up, but I could not move at all. I was frozen against my bed. Suddenly three persons or whatever enter my bedroom. They use acrilic uniform blue and silver, with a Zeus sign in the side of the hart. There were two men and one girl. She did a medical something to me, open may pants and make sex on me. She was white, the men that was talking was black, and the other I can remember anything but that he was not moving at all. The gay that was talking speak very softly, talking about a son. Later he said that I will not be able to remember anything that happened here. He took his glove, with hand was black. He puted his hand in my forehead and I slept. Nest morning I called my friends to take breskfast. They were excieted talking about what they heard last night. They said they felt afraid . They heard a noice but have not strenght to see what was it. They keep talking the whole breaksfast, but I can not say anything, because I ws not able to remember. Sudenly Mario said that it is very strange taht you did not heard anything, it sound like a dentist equipement, like an electrical saw... that was enough, those were my last words, my key, my integrity of my mind.I felt and lost my concious. Twenty four years after that, what I wrote is all I remember. I am not a fanatic to nothing. If you do not believe what I wrote, you should be wrongest that I am."],"Sighting Duration":"Undisclosed","Longitude":"-118.200028","Log Number":"US-03282007-0003","Tags":"City","Case Number":"6675","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/6675.html.txt","/var/www/straped/mufon/org/6675.html"],"Viewing Distance":"Unknown","Object Shape":"Undisclosed","Country":"United States","Source":"MUFON"}