{"map":"<A HREF = \"http://maps.google.com/maps?q=43.003596,+-78.177777(6680)&iwloc=A&hl=en\"> mufon case (6680) map </A>","Log Number":"US-03282007-0008","Object Flight Path":"Stationary,Hovering then path","Source":"MUFON","Country":"United States","Summary":"It has beams of white/bluish light emanating from it, and it blinks and moved closer","Viewing Distance":"501 Feet - 1 Mile, Unknown","Disposition":"IFO","divs":["Sighting DetailsThis is not the first time that we have seen this object. It appears to be similar to an object we saw in August, 2006. It is different from an object that we have also observed over western New York since October, 2005. I walked outside to bring in my dog from the yard and I saw a very bright light in the western sky at approximately 70 degrees above the horizon. The light was very bright, with light rays eminating from it. The light was not as bluish as halogen lights on cars, but as bright. I called to my boyfriend to come out and look at the light,and he confirmed that it resembled the light that we had seen in August, 2006, and it moved slightly south while we were watching it. It had also blinked when I had first gone outside, and moved slightly south, and closer. I took 3 or 4 photographs of the object with a 35mm camera on 70mm zoom. I had attempted to film the object in August, but it was too dark, and the object did not appear in the film. This film was taken at just past dusk, so I am hopeful that the object appears in the photos. It is triangular in shape from top to bottom (appearing taller than wide), and it hovers for hours. The object is STILL in the sky, in the same place. I am contacting you because I can't believe that we are the only people who have observed this object, and the silence of mainstream media in regard to these indidents is insane. In August, we observed helicopters in the sky, that appeared to be approaching the object, and there was no mention of the incident on the news, or in the local newspapers."],"Sighting Duration":"Undisclosed","City":"Batavia","Date of the Event":"03/28/2007 08:28 UTC","Tags":"City","Longitude":"-78.177777","Case Number":"6680","files":["/var/www/straped/mufon/html2text/6680.html.txt","/var/www/straped/mufon/more/6680_submitter_file1__steve4-12-20089.jpg","/var/www/straped/mufon/org/6680.html"],"Latitude":"43.003596","Object Features":"Unknown","Weather Factors":"Unknown","Object Shape":"Triangle","trends":["There have been 7 other sightings in Batavia","There were no other sightings in Batavia on or around March 28th 2007","This sighting has never been favorited.",""],"Region":"New York","Date Submitted":"03/28/2007 08:28 UTC"}