{"Tags":"City","City":"Stratford","Source":"MUFON","Case Number":"6681","trends":["There have been 10 other sightings in Stratford","There were no other sightings in Stratford on or around March 18th 2007","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Country":"United States","divs":["Sighting DetailsI WAS OUT TAKING MY DAILY WALK. I CARRY A DIGITAL CAMERA TO TAKE PICTURE OF THE WATER FOWL AT THE LAKE BEHIND MY HOUSE. THE DAY WAS COLL ABOUT 45 DEGREES WITH A VERY CLEAR SKY. THE WIND WAS GUSTY ABOUT 25 MPH. I WAS RETURNING HOME AND WAS WALKING EAST ON PATTERSON AVE. WHEN I GOT TO THE CORNER OF PATTERSON AND OSBORNE STREETS, ILOOKED OVER TO MY RIGHT WHICH WAS SOUTH TOWARD A TREE WHERE BIRDS HAD GATHERED. THE TREE WAS BARE OF LEAVES SO I COULD SEE THROUGH IT TO THE SKY BEHIND. I NOTICED A BRIGHT WHITE OBJECT IN THE SKY TRAVELING VERY FAST AND TRAVELING NORTH. I TOOK OUT MY CAMERA AND WAS ABLE TO SNAP ONE PICTURE BEFORE THE OBJECT WAS BEYOND MY CAMERAS VIEW. THE OBJECT WAS ALL WHITE WITH NO VISABLE FEATURES. IT WAS CIGAR SHAPED AND COMPLETELY SILENT. IT WAS MUCH LOWER THAN THE JET CONTRAIL BUT HIGHRT THAN THE LOCAL PRIVATE PLANS FLY. IT COVERED THE ENTIRE VISABLE VIEW OF THE SKY FROM THE SOUTH TO NORTH IN ABOUT 20 SECONDS. I WATCHED IT UNTIL IT FLEW INTO A CLOUD FAR OFF TO THE NORTH. THE ENTIRE INCIDENT TOOK ABOUT 2 MIN. I WALKED HOME AND DOWNLOAD THE PHOTO I AM SENDING. I WAS VERY CALM AND DID NOT GET TOO EXCITED. I AM VERY USED TO LOOKING AT THE SKY BEING A BIRD WATCHER AND AN AMATEUR ASTRONOMER. I AM A SCHOOL TEACHER WITH A MASTER'S DEGREE IN EDUCATION."],"Longitude":"-73.126125","Object Shape":"Cigar, Cylinder","Object Features":"None","Date of the Event":"03/18/2007 05:30 UTC","Viewing Distance":"Unknown","Region":"Connecticut","Disposition":"IFO","Date Submitted":"03/18/2007 05:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.191942,+-73.126125(6681)&iwloc=A&hl=en\"> mufon case (6681) map </A>","Latitude":"41.191942","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/6681.html.txt","/var/www/straped/mufon/more/6681_submitter_file1__ufo.JPG","/var/www/straped/mufon/more/6681_submitter_file2__ufo2.JPG","/var/www/straped/mufon/org/6681.html"],"Sighting Duration":"Undisclosed","Summary":"ALL WHITE CIGAR SHAPED","Log Number":"US-03282007-0009"}