{"Log Number":"US-03292007-0005","Source":"MUFON","Disposition":"Unknown","Tags":"City","Viewing Distance":"Unknown","Object Features":"Dome","divs":["sighting detailsi was attending jackson state university during the month of august of 2005. at that time the national weather service said a huge hurricane was headed for the gulf of mexico. i was paying very close attention to the news broadcast, so i would know which direction the storm was headed. unfortunately the storm was headed toward louisiana, mississippi,& alabama. around the time between 3 & 4:oo p.m. the wind was picking up rapidly. i lived in an apartment complex located in south jackson. while the storm was headed this direction power in the city of jackson started to go out. i was still able to watch the news, then the power went out. i went outside so i can watch the trees. \"why\"? because in the area i lived in it was surrounded by huge trees. if those trees would had fallen they would had fallen on top of the apartments. me and my neighbor where the only people outside after the power failed. around 6:00 p.m. & 8:00 p.m. the storm had reach the gulf. the wind and rain was incredible to view. i was looking up at the sky and saw a glowing object running look like from hurricane katrina. it was moving very, very fast. i asked my neighbor what the hell is that? he replied \"man i don't know\"? however, this would not be my last sighting of strange objects over the city of jackson, ms. i have another story to tell. about how these object entire our skies. their technology is incredible. i know yall get alot of messages and stories. but what i seen in the past 2 & 1\\2 years have truly convience me that mankind is being watched, studied."],"files":["/var/www/straped/mufon/html2text/6688.html.txt","/var/www/straped/mufon/org/6688.html"],"City":"Jackson","Summary":"I observe this object while Hurricane katrina was taking place. It was running from the storm very, very, fast.","Case Number":"6688","map":"<A HREF = \"http://maps.google.com/maps?q=32.300587,+-90.17665(6688)&iwloc=A&hl=en\"> mufon case (6688) map </A>","Weather Factors":"Unknown","Object Shape":"Star-like, Teardrop","Date Submitted":"08/18/2005 06:10 UTC","Longitude":"-90.17665","Sighting Duration":"00:05:20","Country":"United States","Latitude":"32.300587","Region":"Mississippi","trends":["There have been 9 other sightings in Jackson","There were no other sightings in Jackson on or around August 18th 2005"],"Date of the Event":"08/18/2005 06:10 UTC","Object Flight Path":"Stationary,Path with directional change,Path then hovering"}