{"Object Features":"Unknown","Source":"MUFON","Object Flight Path":"Path with directional change,Path then hovering,Other","divs":["Sighting DetailsI have lived at the above address for 8 yrs. we live in the flight path of west palm beach intl airport. Iam used to large commuter air traffic over my house. there is something else up there. it is difficult to describe. I will do my best but understand that nothing is as extraordinary as the experience itself. there are what I believe to be a type of craft that cannot be seen by the naked eye buzzing the sky over my home. this is not a joke and i am not crazy. the craft sound as if they have no engine but rather glide a very high rates of speed. I and all of my family and friends have heard and followed these craft by ear. they sound like they pop in and out of a hole in the sky, although they cannot be seen. they appear to be trying to follow commercial air commuter jets or using the noise for cover as they sometimes pop out of the hole a few seconds after the jets fly over. also this is not jet engine reverberation off the atmosphere... they come when nothing is in the sky sometimes as well. on overcast days they go crazy all day long, with very little commercial air traffic. all of this has been going on in my life for the last 8 years. I would say that i have witnessed this phenomenon atleast a thousand times. sincerely Mark A Zaskey. please come listen for yourselves."],"Summary":"possible worm hole over my home.","Date of the Event":"03/29/2007 11:10 UTC","Case Number":"6689","Country":"United States","Sighting Duration":"00:00:15","Object Shape":"Other, Unknown","Region":"Florida","Viewing Distance":"101-500 Feet","Longitude":"-80.049515","map":"<A HREF = \"http://maps.google.com/maps?q=26.718702,+-80.049515(6689)&iwloc=A&hl=en\"> mufon case (6689) map </A>","Disposition":"IFO","Log Number":"US-03292007-0006","Tags":"City","Date Submitted":"03/29/2007 11:10 UTC","files":["/var/www/straped/mufon/html2text/6689.html.txt","/var/www/straped/mufon/org/6689.html"],"City":"West Palm Beach","Weather Factors":"Unknown","trends":["There have been 27 other sightings in West Palm Beach","There were no other sightings in West Palm Beach on or around March 29th 2007"],"Latitude":"26.718702"}