{"map":"<A HREF = \"http://maps.google.com/maps?q=25.792939,+-80.224689(6692)&iwloc=A&hl=en\"> mufon case (6692) map </A>","Region":"Florida","Summary":"Glowing orb with short very bright contrail","Date Submitted":"08/29/2007 07:45 UTC","Object Flight Path":"Straight-line path,Path with directional change,Other","Latitude":"25.792939","Log Number":"US-03292007-0009","Viewing Distance":"Unknown","Object Features":"None, Unknown","Disposition":"Unknown","trends":["There have been 97 other sightings in Miami","There were no other sightings in Miami on or around August 29th 2007"],"Country":"United States","Date of the Event":"08/29/2007 07:45 UTC","divs":["Sighting DetailsI know I saw something I cannot describe,but here goes. I was sitting in my upstairs room using the computer, when my five year old son said mom what do they call those things in the sky. He asked me a few more times when curiosity kicked in. I opened my small balcony door so. I could take a better look. What I saw was impressive to say the least. It looked like a vey bright orb pinkish in color with a very bright tail. It appeared to be travelling straight up. I watched this for about a minute, then it started traveling horizontally at a very fast pace. I knew I would lose track of it so I ran down stairs to keep looking, this took me about 30 seconds. When I got outside I could not see it. I did not see it again. After about 10 minutes I noticed a faint contrail in the sky, I kept my eye on it, there was no sound and appeared to traveling very fast from west to east. Then it dove straight down for what seemed like 30 seconds it quickly turned in the opposite direction and disapperared. What I saw today was very strange. I used to aircraft f;ying close to my house. Miami Int'l Airport is close by. I'm wondering if anyone saw this."],"Weather Factors":"Unknown","City":"Miami","Longitude":"-80.224689","Case Number":"6692","Tags":"City","Source":"MUFON","Object Shape":"Fireball","files":["/var/www/straped/mufon/html2text/6692.html.txt","/var/www/straped/mufon/org/6692.html"],"Sighting Duration":"00:03:00"}