{"map":"<A HREF = \"http://maps.google.com/maps?q=41.62855,+-71.663813(6693)&iwloc=A&hl=en\"> mufon case (6693) map </A>","Longitude":"-71.663813","Summary":"Trio of lights seen moving adn stopping in the sky","files":["/var/www/straped/mufon/html2text/6693.html.txt","/var/www/straped/mufon/org/6693.html"],"trends":["There has been one other sighting in West Greenwich","There were no other sightings in West Greenwich on or around March 29th 2007"],"Viewing Distance":"Unknown","Weather Factors":"Unknown","Source":"MUFON","City":"West Greenwich","Sighting Duration":"Undisclosed","Disposition":"Unknown","Case Number":"6693","Object Flight Path":"Path then hovering","Region":"Rhode Island","Log Number":"US-03292007-0010","Date of the Event":"03/29/2007 07:52 UTC","Date Submitted":"03/29/2007 07:52 UTC","Country":"United States","Latitude":"41.62855","Object Features":"Unknown","divs":["Sighting DetailsI was returning from class. I was driving downhill on Congdon Mill rd past the west Greenwich Volunteer Fire Department. I saw two very bright white lights in the sky as I neared a small one lane bridge. I first thought it was a low flying commercial airliner. However, through the treetops I saw what was in fact a line of three white lights. The center light was slightly oval shape and ran perpendicular to the assumed shape of the object. I say assumed since I could not discern a true shape of the object. There was still a touch of sunlight remaining but I could make out no definite shape. This means it must have been high in the sky. From the furthest light to the other it measured approx. 2 inches. It moved slowly over my car and stopped abruptly at roughly a 45 degree angle from my seat. It began to move after a second of being still in the same direction only to stop abruptly once more. After another brief second it slowly (slower than before) kept its course and drifted over my car. I had already turned off the radio and rolled down the window. It made no noise, no engines no humming. I first thought it to be a commercial airliner but being that large in the sky it would be close enough to hear the engines. I wasn't afraid per say but very curious. It didnt seem to want to harm me or anything like that so I was pretty calm. Another curious note is that after it had drifted over me and I continued on the way home my vision became a tad blurry and I had a headache I had not had previously to witnessing this object. These ailments vanished as quickly as they came however, lasting only a few moments."],"Tags":"City","Object Shape":"Cigar"}