{"Date of the Event":"08/31/1974 12:00 UTC","Log Number":"US-03302007-0003","Tags":"City","City":"Portland","Longitude":"-122.668707","Region":"Oregon","Object Shape":"Disc","files":["/var/www/straped/mufon/html2text/6697.html.txt","/var/www/straped/mufon/org/6697.html"],"trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around August 31st 1974"],"Date Submitted":"08/31/1974 12:00 UTC","Case Number":"6697","Object Features":"Undisclosed","Weather Factors":"Unknown","Country":"United States","Latitude":"45.527942","Object Flight Path":"Undisclosed","Disposition":"Insufficient Data","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.527942,+-122.668707(6697)&iwloc=A&hl=en\"> mufon case (6697) map </A>","Sighting Duration":"00:00:15","divs":["Sighting DetailsIn 1974 I was living in Portland, Oregon with my then husband. We had finished work, I believe it was a Friday eve., and we were on our way out to dinner in Portland. It was dusk but not dark out. We were crossing this bridge leading into the city and I looked out our car window and saw this very large disc in the sky. The disc was metallic but not shiny and had rotating lights encircling the entire perimeter of the disc. It was just hovering in the sky - not moving at all. We couldn't stop to watch it as traffic was pretty heavy on the bridge and there was no place to pull over. When we got to the restaurant we thought we would hear other people talking about the object in the sky but there wasn't. We even told an employee that we had just seen a UFO but you can imagine the response \"ya sure\".. We thought for sure the next day there would be some mention of it in the newspaper or on TV but that didn't happen either. Since that encounter I have been a believer in UFO'S. The only explanation I can come up with as to why no one else saw it is possibly my husband and I saw for a brief moment into another dimension or we saw an event yet to happen. My husband and I had, as far as I can remember,not discussed UFOS or believing or not believing in them before this event. I think my husband and I had some sort of psychic connection because one night I had a dream, a pretty vivid dream, and the next day I began to tell him about it and he stopped me and continued to tell me what I had dreamt and now at this time I'm living that dream I had a long time ago. To recapitulate I was looking out the passenger window up to the sky and saw the disc (UFO). You couldn't help but see it it was so big. We were not afraid seeing it in the sky we were more, I'd say, excited and curious and then incredulous that no one else had seen it. I can remember no markings on the disc or writing on any kind. The only thing I recall are the rotating lights moving very quickly around the perimeter in a continuous motion. I don't recall when we lost sight of the it. It was the approx. size of a baseball diamond. disc."],"Source":"MUFON","Summary":"large disc approx. size of a baseball diamond seen just before dusk hovering in the sky. It had rotating on and off lights circling the outer perimeter of the disc.."}