{"Object Features":"None","City":"Mesa","map":"<A HREF = \"http://maps.google.com/maps?q=33.420954,+-111.822352(6703)&iwloc=A&hl=en\"> mufon case (6703) map </A>","Latitude":"33.420954","Longitude":"-111.822352","Date of the Event":"03/30/2007 10:30 UTC","Log Number":"US-03302007-0009","divs":["Sighting DetailsI was watching a military prop plane pass from west to east at a relatively high altitude. As it passed, a light caught my eye. It looked like a bright, daylight star. No clouds in the sky. I thought perhaps it was a weather balloon. I watched it stay in the same place for about 10 minutes. I went inside to get my camera. When I came back outside, it was still in the same place. I took one digital picture then came back inside to look at it on my computer. I couldn't see it on the screen so I changed cameras to one with a higher resolution. When I went back outside, it had moved approximately 30 degrees to the south or what appeared to be maybe 7 - 10 miles judging from it's apparent altitude. I wouldn't venture to guess, but it seemed very high. A few seconds later, from an apparent stop, it suddenly moved very quickly towards the south then quickly cut at an approximately 80 degree angle to the left then stopped. It looked like it had moved about 5 - 10 miles in about 5 seconds. I could barely see it for about five seconds more, then it was gone. I have never seen anything like this. It was exhilarating. I have attached the two photos I took, but I couldn't make out what I saw for sure."],"Object Shape":"Star-like","Tags":"City","files":["/var/www/straped/mufon/html2text/6703.html.txt","/var/www/straped/mufon/more/6703_submitter_file1__P3290001.JPG","/var/www/straped/mufon/more/6703_submitter_file2__P3290003.JPG","/var/www/straped/mufon/org/6703.html"],"Summary":"Star-like light remaining still or appearing to remain still - then moved swiftly","Weather Factors":"None","Sighting Duration":"Undisclosed","Disposition":"Unknown","Case Number":"6703","Date Submitted":"03/30/2007 10:30 UTC","Object Flight Path":"Stationary,Path with directional change","Source":"MUFON","Region":"Arizona","Country":"United States","trends":["There have been 73 other sightings in Mesa","There were no other sightings in Mesa on or around March 30th 2007","This sighting has never been favorited.",""],"Viewing Distance":"Over 1 Mile, Unknown"}