{"Case Number":"6705","Date of the Event":"03/30/2007 09:15 UTC","files":["/var/www/straped/mufon/html2text/6705.html.txt","/var/www/straped/mufon/org/6705.html"],"Latitude":"39.940345","Longitude":"-82.013192","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.940345,+-82.013192(6705)&iwloc=A&hl=en\"> mufon case (6705) map </A>","Disposition":"IFO","Weather Factors":"Unknown","divs":["Sighting DetailsI was sitting on my front porch with my two sisters and one of their boyfriends. I was just star gazing and watching passing planes go by. We live a couple of blocks from a hospital and we see helicopters fly in and out all the time. I noticed a bright light in the sky and thought it was just another passing airplane. This object was about the same brightness, and size of a passing airplane. I watched for a few moments and waited to see if i could see its blinking light or lights, but i couldn't. Which in itself is no big deal. So I compared it to a stationary object to see if I could find its path or see any movement. I couldn't. So I continued to watch it for about another ten to fifteen minutes. Still no movement. Then suddenly it faded until it was almost out of sight. It reappeared, but got brighter for a few seconds and changed its color from whitish blue to an almost red. It stayed this color for only a few seconds and then changed back to the whitish blue color. At this time I told my sisters and their boyfriend what I had saw. At this time they started watching as well. It continued to fade in and out of sight like before, and every once in a while you could the red color reappear. Then I noticed it started to move up. Like it was going further away or it was changing to a higher elevation. Still it wasn't moving very fast. It reminded me of a helicopter in some ways. For example it seemed to just hover in the sky. But you could tell it was far away, and it would be to big at that distance to be a helicopter. The light that this object giving out was a very strange light. It was like a star that was kind of twinkling. The center of the light was brighter than the rest of it. It reminded me of a very small cross. But when you looked at the object as a whole, with all the light around the edges of the cross gleaming, it looked like a circle. You didn't really see the cross center unless you really focused on it. I never really lost sight of the object, I came inside to get something and when i returned to the porch the object was no longer visible. I just want to know if there has been any other reporting of the object, or if maybe i was seeing a planet . The object was in the east to N.east sky from my house. I don't know if any of this will help you guys but I hope it will. And another i want to mention is that I always watch the sky especially at night and I have never seen anything like this. I wish I had saw more. If you have any questions I would be happy to answer them via email. Thank you"],"Object Features":"Unknown","Object Flight Path":"Hovering then path","Region":"Ohio","Viewing Distance":"Over One Mile","Summary":"Kind of glowing but has moments where it fades until it disapears but comes back brighter, not much movement","Country":"United States","Object Shape":"Circle, Cross","Sighting Duration":"00:45:00","Log Number":"US-03302007-0011","City":"Zanesville","trends":["There have been 2 other sightings in Zanesville","There were no other sightings in Zanesville on or around March 30th 2007"],"Date Submitted":"03/30/2007 09:15 UTC","Tags":"City"}