{"trends":["There have been 65 other sightings in Fort Collins","There were no other sightings in Fort Collins on or around March 23rd 2007"],"City":"Fort Collins","Tags":"City","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.59329,+-105.075083(6706)&iwloc=A&hl=en\"> mufon case (6706) map </A>","Log Number":"US-03302007-0012","Disposition":"Hoax","files":["/var/www/straped/mufon/html2text/6706.html.txt","/var/www/straped/mufon/org/6706.html"],"Source":"MUFON","Case Number":"6706","Date of the Event":"03/23/2007 02:15 UTC","divs":["Sighting Detailswas at dining table and looked out patio door for no special reason and saw a white ball in the sky.thought it was balloon let go and just watched it.expected to see that swing motion ballons do but didn't.then it stopped and held still for maybe 30 seconds.it then DROPPED about 50 feet and stopped again.my son was sitting with me and I thought\"if I say something it's gonna disappear and I'll look stupid.\"it then moved in a \"meandering fashion\"up,down,left,right no real rhyme or reason for about 30 seconds.and it stopped again.when I say stopped I mean it held still COMPLETELY.I said to my son \"hey ****,look at that!\"he stood up to look over me and the ball slowly went into a cloud.\"did you see that?\"\"yeah what is that\"then it came back out in the space between clouds and i said \"look,there it is again!\" and he saw it again too before it reversed direction and went into original cloud.the wierd thing is,four times it came out and went back as soon as we noticed it again.when fourth time was over we saw it flat boogie out to east and left a sort of empty channel in clouds it went through.channel stayed in same place even though clouds moved through same area continously."],"Summary":"white ball shape over fort collins","Latitude":"40.59329","Region":"Colorado","Object Features":"None","Date Submitted":"03/23/2007 02:15 UTC","Longitude":"-105.075083","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Object Shape":"Sphere","Country":"United States","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet"}