{"Longitude":"-73.549136","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/6709.html.txt","/var/www/straped/mufon/org/6709.html"],"Viewing Distance":"501 Feet - 1 Mile","Country":"Canada","Summary":"Disk lands near Waswanipi,Que","Object Features":"Dome","Disposition":"Unresolved","Object Shape":"Disc","map":"<A HREF = \"http://maps.google.com/maps?q=52.939916,+-73.549136(6709)&iwloc=A&hl=en\"> mufon case (6709) map </A>","Source":"MUFON","Case Number":"6709","City":"Waswanipi/ ValdOR,Que","Region":"Quebec","divs":["Sighting DetailsWaswanipi hill. My coworker lived in the staff trailor which sits on top of hill which gives us a long view out on the landscape, It was night out as my co-worker walked past the window and saw a bright light. He asked me to check out the lights and if it could be a UFO. I looked out and watch it.Fear came over me but controlable.. I have seen four sightings in my live and this was another sighting. On the west side of the hill and off to the distance of three kilometers is a valley, there was gold disk sitting there flashing and rotating the lights. Then it hovered went side to side as they looking for something. Then it sit there hovering. Three youthes came over and told about the lights. :See those lights I fell came from the sky.They wanted to go there because they drove four wheelers. I told them get a camera first and dont get to close to it it may be radio active. I watched with Dale and the lights from cars reflected of the clouds. the highway north was just below us and the lights could seen at a ditance.The Disk did not reflect lights yet it was very bright. I told him If it comes overhere we are in trouble. I sat down and took notes There was no phone so dale watched it while a wrote things down. He watched it for several minutes until he went to the bathroom. When he turn the disk was gone. I drew the position and landmarks. This was my last night in Waswanipi. I was glad it didn't come towards us. I been told there are a lot of UFO's sightings since the Hydro lines were put up in the region. Directions: North west end of the town. New building face west in beween two valleys.Disk stays there for several minutes. Witness Dale Baptise. Secondary The three kids that saw it."],"Date Submitted":"11/25/2007 11:28 UTC","trends":["there have been no other sightings in waswanipi\\ valdor,que","This sighting has never been favorited."],"Tags":"City","Log Number":"CA-03312007-0003","Date of the Event":"11/25/2007 11:28 UTC","Object Flight Path":"Stationary,Path with directional change","Sighting Duration":"Undisclosed","Latitude":"52.939916"}