{"Case Number":"6715","trends":["There have been 4 other sightings in Troy","There were no other sightings in Troy on or around July 20th 1962"],"Sighting Duration":"Undisclosed","Object Features":"Dome","Country":"United States","Region":"New York","map":"<A HREF = \"http://maps.google.com/maps?q=42.730642,+-73.681778(6715)&iwloc=A&hl=en\"> mufon case (6715) map </A>","Date of the Event":"07/20/1962 12:00 UTC","files":["/var/www/straped/mufon/html2text/6715.html.txt","/var/www/straped/mufon/org/6715.html"],"Latitude":"42.730642","Summary":"In broad daylight, no glare, no obstructions and at very close range a UFO was clearly seen by me and a friend.","Object Shape":"Cylinder, Disc, Other","Date Submitted":"07/20/1962 12:00 UTC","City":"Troy","Log Number":"US-03312007-0009","Disposition":"Unresolved","Object Flight Path":"Stationary,Hovering then path","Source":"MUFON","Viewing Distance":"21-100 Feet","Tags":"City","divs":["Sighting DetailsI was riding my bike with a friend on a sunny sunday . He was a short distance behind me when all of a sudden I heard his bike crash. I stopped and turned around to look and he had fallen off his bike and was now starring into the sky. As I followed his eyes this object which was a combination of a cylinder and disk shape was hovering over this parking lot we were next to. It was hovering no more than one hundred feet about the ground and was nearly the circumference of the entire parking lot. It made no noise what so ever but had a bank of lights that encircled the bottom and side of the craft. The lights didn't spin but appeared to be more like flashing green, red, blue and yellow. I asked my friend what we should do. He was in shock and still starring. It was at that point a humming noise came form within and it flew over the Hudson River which was a few blocks away. It became a dot in the distance as it totally disappeared in a matter of maybe 2 seconds, no more. I was excited and intrigued but my frined was never the same after. He starred at the chalkboard in school that Monday (the next day) without a sound and was dismissed from school. He remained out for the remainder of the week. He would never speak of it again and would not respond to my questions of what we saw. I never saw him after I moved several years later. I did run into him nearly 15 years after the event. Even then he would not talk of it. I approached him and we said our usual hello's, how have you been, what's new etc. The moment I opened my mouth and said \"hey, do you remember when.......\" and that was all i got out of him. He was began to shake and said he didin't want to talk about it and walked away. To this day I have not seen him since. It is really unfortunate because he is the only one that can colloberate this event. Actually it is the effect that it had on him that has kept me from telling this earlier in the first place. I shared this event with many friends after it happened and because of my reputation, even at an early age, there was no dounbt I was telling the truth. I would really like to be contacted about this. I have drawn over many years thsi object and every time I recall the object I drwa it the same every time."],"Weather Factors":"None","Longitude":"-73.681778"}