{"Source":"MUFON","Sighting Duration":"Undisclosed","Tags":"City","Log Number":"US-03312007-0010","Date Submitted":"08/17/1966 12:00 UTC","Country":"United States","Case Number":"6716","Latitude":"39.970856","Object Features":"Other","Region":"Ohio","divs":["Sighting DetailsI can't tell you the exact time or date or my age, but I do remember this happening. When we lived at that location, there was a crab apple tree in our front yard. When the crab apples ripened we would sometimes have battles throwing them at each other. It was in the evening, but still daylight, someone said what's that, looking straight up. We all stopped to look and could see an object directly over us and hovering. I say hovering, it was stationary, there was no sound. It was high enough as to not see details. The next door neighbor kid said his parents had binoculars, and went and got them. We all took turns looking at it and what I remember was that it was triangular, seemed to have some thickness to it, it was gold like jewlery, but each tip of the triangle was colored. After a while we lost intrest and never looked again. The type of binoculars were a very short and I'm sure weak design. I have never offically reported this to anyone before and had completely forgoten about it until a few years ago. I don't remember who the other kids were. I am 52 years old, and around ten when this occured."],"Disposition":"Insufficient Data","Object Flight Path":"Stationary","Summary":"kids playing outside, notice something overhead, triangle, gold with colored tips hovering","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"08/17/1966 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.970856,+-82.989794(6716)&iwloc=A&hl=en\"> mufon case (6716) map </A>","Object Shape":"Triangle","City":"Columbus","Longitude":"-82.989794","trends":["There have been 70 other sightings in Columbus","There were no other sightings in Columbus on or around August 17th 1966"],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/6716.html.txt","/var/www/straped/mufon/org/6716.html"]}