{"Case Number":"6717","Object Features":"Unknown","Country":"United States","Viewing Distance":"21-100 Feet","Longitude":"-72.702222","Object Shape":"Circle","City":"Stowe","Disposition":"IFO","Tags":"City","Weather Factors":"Unknown","Date of the Event":"11/29/2006 10:30 UTC","files":["/var/www/straped/mufon/html2text/6717.html.txt","/var/www/straped/mufon/org/6717.html"],"Log Number":"US-03312007-0011","map":"<A HREF = \"http://maps.google.com/maps?q=44.475278,+-72.702222(6717)&iwloc=A&hl=en\"> mufon case (6717) map </A>","divs":["Sighting DetailsOn Wednesday November 29, 2006, at 2230, I had just stepped out of the laundry building at Top Notch Resort (behind the Tennis Center), where I worked part-time. I looked toward the Resort on the hill (to my left), when I noticed two objects with bright multi-colored flashing lights, flying very low over the resort heading across Mountain Road. My first thought was it was a plane out of Morrisville Airport towing a glider. But I realized I didn't hear an airplane engine and that the lights seemed to go around each object instead of being on the wings or tail of an airplane. I watched the objects just glide slowly across in front of me until they disappeared over the mountain ridge (to my right). The thought that kept going through my mind as they slowly went over was, \"Please don't see me\", over and over again. After they were out of sight, I went back into the laundry and called my daughter, more then a little shaken by what I had just seen. The next day, I saw in the Stowe Reporter newspaper, the headline \"NASA balloon lost: probably landed in Stowe\". In the article, it said the balloon was launched on November 18th, and would have landed hours after being launched. It also said it had reflective tape on it. What I saw was two objects, with lights, 11 days later."],"Latitude":"44.475278","Summary":"Two unknown objects in the sky over Stowe Vermont","Date Submitted":"11/29/2006 10:30 UTC","Sighting Duration":"Undisclosed","Region":"Vermont","trends":["There have been no other sightings in Stowe","This sighting has never been favorited."],"Source":"MUFON","Object Flight Path":"Straight-line path"}