{"Date of the Event":"03/31/2007 10:15 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.731599,+-97.31145(6718)&iwloc=A&hl=en\"> mufon case (6718) map </A>","Date Submitted":"03/31/2007 10:15 UTC","Object Flight Path":"Undisclosed","Longitude":"-97.31145","files":["/var/www/straped/mufon/html2text/6718.html.txt","/var/www/straped/mufon/org/6718.html"],"Object Shape":"Cigar, Other","Log Number":"US-03312007-0012","Disposition":"Hoax","Summary":"A black cigar shaped ufo changing the shape of a small cloud.","Source":"MUFON","trends":["There have been 128 other sightings in Fort Worth","There was one other sighting in Fort Worth on or around March 31st 2007"],"divs":["Sighting DetailsWhile driving north on I-35, 3 miles south of I-20, I noticed a lone cotton ball shaped white puffy cloud. It was the only cloud in the sky except for a cloud front at least 30-40 miles due east. I new that it was not normal at all. The cloud was changing shapes at a rapid rate.It started out as a cotton ball, then a triangular shape, and then to a spiral shape, and then went from white to a dark gray color. I then noticed a black or very dark gray cigar shaped object that appeared to hovering motionless to the lower left of the cloud. I looked at the object several times to make sure that it was not an airplane or a helicopter. I then drove by a large building trying to get closer to the object to try and identify the object better and it was gone. I scanned the entire sky looking for any aircraft and none were found.I have a background in U.S. military aircraft and experimental versions also. I have only observed aircraft such as this on ufo web sites. I was not scared because I know that they exist. I dont know the origin of these aircraft, and I dont need to know. I like my career and don't want to jeopardize it in any way. I just thought you would like to know what I saw."],"Country":"United States","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Case Number":"6718","Region":"Texas","Weather Factors":"Unknown","Latitude":"32.731599","Viewing Distance":"Unknown","City":"Fort Worth"}