{"trends":["There have been 39 other sightings in Redding","There was one other sighting in Redding on or around February 17th 2007"],"files":["/var/www/straped/mufon/html2text/6726.html.txt","/var/www/straped/mufon/org/6726.html"],"Sighting Duration":"Undisclosed","Latitude":"40.59046","Country":"United States","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=40.59046,+-122.387685(6726)&iwloc=A&hl=en\"> mufon case (6726) map </A>","City":"Redding","Case Number":"6726","Log Number":"US-04012007-0007","Object Shape":"Other","Viewing Distance":"Unknown","divs":["Sighting DetailsI was travelling north by car at the onset of dusk. The sun had just set, the sky still lit. I noted a strange airborne silhouette to my left, strange enough to maintain my attention. It was moving approx. NE from the SW at a moderate rate. I turned to the west at an intersection, and now the craft was no longer in silhouette as I was now looking South. It was banking slightly to the North and was awash with light from the West. I would judge the craft at 1-2000 feet altitude, presuming my perceived size of the craft is correct. There was no sound from, nor no lights on, this craft. It could best be described as being in 3 sections: the middle section had a down-slope to the nose, somewhat like a shuttlecraft from the Star Trek series. On either side of the mid-section, and opposite the other, was a sphere. Each appeared to be a metallic burnished copper color, with what appeared to be a black seam traversing the equator of the sphere. I remember thinking \"This thing should not be able to fly!\" It was now banking behind me to the north, seemed to pick up speed, and disappeared from my sight over the low hills. I called the PD and the paper to find that no others had reported any sighting of this craft. I have never seen anything like this craft before, nor witnessed such an inexplicable airborne event since I was a child growing up in upstate NY."],"Tags":"City","Date Submitted":"02/17/2007 05:00 UTC","Date of the Event":"02/17/2007 05:00 UTC","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Longitude":"-122.387685","Source":"MUFON","Disposition":"Insufficient Data","Weather Factors":"Unknown","Summary":"Saw an un-aerodynamic flying craft on my way home from the golf course."}