{"Longitude":"-88.566704","Case Number":"6734","Object Shape":"Cross, Fireball, Flash, Oval, Triangle, Other, Unknown","Date Submitted":"04/01/2007 08:10 UTC","Object Features":"Other, Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/6734.html.txt","/var/www/straped/mufon/org/6734.html"],"divs":["Sighting DetailsI was standing outside in the backyard looking at the constalations for a comet that I had heard about on the internet when i noticed a couple of commercial ariliners lights far away in the sky. Nothing unusual as I looked toward the full moon one last time when I saw what appeared to be a jet of some sort but moved more like a sesna type airplane. I saw nothing but the lights that normally blink on a large commercial plane but a little bigger, and it had more of a police strobe to it but irratic to the speeds of each other. There was a blue light and behind it was a red light, exactally on both sides of the red light spaced evenly were 2 strange oval shaped lights that stayed the same color and brightness resembeling a florecent light looking somewhat like afterburners but no tail stream or vapor, ever since it came over the horizion of the trees near the moon which was east. As it flew from the moon to orions belt it kept in a straight line but was going in a normal turn in a half cirele as a plane would. Suddenly it began to move very strangly, banking and manuvering in different angles yet the craft didn't show any signs of turning itself and most of all it did it in a small area in the sky. What was strange as well was the fact that it was a full moon, no afterburner, no sonic boom or noise, and nothing reflecting from the moon itself, just the 2 straight colored lights blinking irratically in the direction it flew and the 2 oval shaped lights on both sides of the red one in a straight line, and the blue light in which was the craft's front or middle. The craft flew normally since then and flew toward and below the moon then went back to its same path, like a lap in a race. It flew across orions belt again and went straight onward to the west out of sight. It was a bit confusing and I thought that perhaps it was a helicopter, but the manuvers it made at that one point were too fast and impossible and there were no sign of spotlights coming from it nor noise at all. Also with the full moon some kind of shape would have appeared but none was there."],"Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Summary":"What I thought was a 747 taught me a 101","Country":"United States","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Region":"Mississippi","map":"<A HREF = \"http://maps.google.com/maps?q=34.65816,+-88.566704(6734)&iwloc=A&hl=en\"> mufon case (6734) map </A>","Date of the Event":"04/01/2007 08:10 UTC","Log Number":"US-04022007-0006","Latitude":"34.65816","City":"Booneville","Weather Factors":"Unknown","trends":["There has been one other sighting in Booneville","There were no other sightings in Booneville on or around April 1st 2007","This sighting has never been favorited.",""],"Disposition":"Unknown"}