{"Weather Factors":"Unknown","Source":"MUFON","Date of the Event":"03/31/2007 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.733518,+-73.780145(6736)&iwloc=A&hl=en\"> mufon case (6736) map </A>","Region":"New York","Date Submitted":"03/31/2007 12:00 UTC","Log Number":"US-04022007-0008","Latitude":"40.733518","Object Shape":"Egg, Star-like","Disposition":"Unresolved","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/6736.html.txt","/var/www/straped/mufon/org/6736.html"],"divs":["Sighting DetailsMy family and I were out in the yard doing some work. At the same time we were constantly observing the sky because of heavy chemtrail spraying activity that was going on. There has been a massive amount of this activity happening here in NYC for a few months now. The day before we took some pictures of the chemtrails and the NYPD helicopters that are often hovering around when the spraying is taking place. Anyway, as I was watching the chemtrails from the yard, I noticed five very bright small points of light slowly moving across the sky. Three of these lights formed a triangular pattern and moved in unison. The other two lights were off to the sides. I had my children look up and they saw the lights too. We called my wife outside where she observed them as well. Shortly after the lights appeared, another object showed up. This one was a white egg-shaped object, almost like a large balloon. It was slowly moving across the sky in the same area where the lights were. It's motion was very peculiar. It seemed to swim in the air, almost like a fish does in water. Following this object were a couple of more like it. One of them seemed to have a ray of light emitting from under it. As we were observing all this, the lights and objects moved across the sky and disappeared, one at a time. We didn't know what we were looking at, but we knew they weren't anything we were familiar with or had ever seen before. We felt shocked and excited at the same time. I was convinced that what we were seeing had some connection to the chemtrail activity. That was confirmed to me today. I was doing research on the internet regarding any connection between chemtrails and UFOs. I came across accounts, pictures and videos (YouTube) of chemtrail activity accompanied by the egg-shaped objects we saw. I did not find anything similar regarding the points of light. My only regret in all of this is that I did not have a video camera available to me when it happened. I'm hoping these things actually come back again soon. Next time I'll be ready."],"Country":"United States","Tags":"City","Summary":"Several points of light and egg shaped objects accompanying chemtrail spraying activity.","Viewing Distance":"Unknown","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around March 31st 2007"],"Object Flight Path":"Straight-line path,Path with directional change","Longitude":"-73.780145","City":"New York","Sighting Duration":"Undisclosed","Case Number":"6736"}