{"divs":["Sighting DetailsAs a Chief Quartermaster in the U.S. Coast Guard, I was standing the underway Officer of the Deck on board the USCGC Cherokee. As this happened over 25 years ago, I don't remember the location, but I believe we were in the Straits of Florida. I believe it was around 10 pm. The weather was warm and calm with scattered cumulus clouds. I'm almost certain the moon was out. I was out on the forward bridge walk chatting with the Captain, when he noticed a strange light off the left side of the front of the ship. The best description was a searchlight shining on the top of and inside of a small cumulus cloud. The cloud was only about 1,000 yards away and there was absolutely no sound except the ship moving through the water. The \"searchlight\" scanned the cloud for about 1 minute while we stood there transfixed. The Captain asked me to check the radar. I went inside the bridge and looked on the radar - there was nothing on the radar. Since this was a surface search radar, this was no surprise. When I went back outside, the \"searchlight\" was gone and there was a formation of blue lights, best described as propane torch flames. There were 4 of them in a v-formation. They appeared to be some distance away, off the left side and moving toward the rear of the ship. They could have been the engines of an airliner, but they were moving much slower than any airplane and there was no sound. They remained in view for about 5-10 minutes. This entire episode was witnessed by 5 experienced sailors, with many years at sea. We were very excited and agreed that none of us had ever seen anything like it. We agreed that it could have been a helicopter equipped with a \"Night Sun\", only there was no sound and what was it looking for? The Captain directed me to make an official ship's log entry of a UFO. This is unusual to have a military officer acknowledge a UFO sighting and record it in a legal document. This log is available from the National Archives. It was my job to box up old logs and send them to the Archives."],"Case Number":"6747","Country":"United States","trends":[],"Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/6747.html.txt","/var/www/straped/mufon/org/6747.html"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=27.665867,+-81.506354(6747)&iwloc=A&hl=en\"> mufon case (6747) map </A>","Longitude":"-81.506354","Object Flight Path":"Hovering then path","Date of the Event":"01/26/1981 10:00 UTC","Region":"Florida","Date Submitted":"01/26/1981 10:00 UTC","Latitude":"27.665867","City":"Undisclosed","Source":"MUFON","Tags":"City","Summary":"Appearance of searchlight scanning cloud top from above, then 5 blue flames flying in v-formation","Sighting Duration":"00:15:00","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-04042007-0001","Object Features":"Unknown","Object Shape":"Unknown"}