{"Country":"United States","Object Shape":"Circle, Star-like, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.203102,+-111.630379(6748)&iwloc=A&hl=en\"> mufon case (6748) map </A>","Weather Factors":"None","Latitude":"35.203102","Viewing Distance":"501 Feet - 1 Mile","Summary":"Just to the south as i come to the sign Rodgers Dry Lake and to the east both above the canopy of the forrest i saw two objects. I stopped and filmed them on VHS.","Case Number":"6748","divs":["sighting detailsrodgers dry lake, flagstaff, az. aproximately nov 1999 i was an ranch care taker for an ranch south of the miller ranch just south accross the rodgers dry lake (diectly south). i had just driven into the opening of rodgers dry lake and saw an brite yellish\\amber collor object just above the canopy of the forrest and practicaly above the ranch but a little more east\\south of the ranch. my son was with me for an week visit. i reached the sign rodgers dry lake and thought to pull off and video tape the situation. i did this for an while and also noticed another same like object to the east of this position as well and video taped it as well going back and fouth to show it was so. i also focused the camera (vhs) close up on both objects to see if the camera could get an close up what it was and their was an dark circle in the center. this was between 9p.m. and 11p.m. the exact time and day is on the film (vhs) (date)! both object's did'nt move with the star's !!! i thought this odd!! also they were to close to be stars as well so close to the canopy of the forrest. i didnt report this in fear of well you know what i mean; however im getting old and maybe its about time someone would like to see this film of this unknown incident that shook me up years ago. this film is also gotten the ranch identification i am not to release info on and i must not let any copy be made. but it can be reviewed and unidentified objects film portion can be copied by me front of your case reporter to verify true copy of incident.-----------------------nothing follows----------------------------------------------------------------------- michael dungan ret, u.s.a."],"Disposition":"Unknown","trends":["There have been 24 other sightings in Flagstaff","There were no other sightings in Flagstaff on or around October 31st 1999"],"Longitude":"-111.630379","Sighting Duration":"Undisclosed","Source":"MUFON","Object Features":"Unknown","Log Number":"US-04042007-0002","Date Submitted":"10/31/1999 12:00 UTC","Date of the Event":"10/31/1999 12:00 UTC","Tags":"City","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/6748.html.txt","/var/www/straped/mufon/org/6748.html"],"City":"Flagstaff","Region":"Arizona"}