{"files":["/var/www/straped/mufon/html2text/6749.html.txt","/var/www/straped/mufon/org/6749.html"],"Object Features":"Appendage(s)","divs":["Sighting DetailsWent out to smoke with my co-worker at the office. It was a beautiful day, clear with unlimited visibility, so I laid down on the sidewalk and was looking straight up, soaking up the sun. An object floated into view that was shape shifting. I asked my friend what was that and he said it was a baloon, which it was, you could see the string hanging down and it floated off to the north. While I was observing the baloon some movement caught my eye to the right(south). This obect was cigar shaped, traveling on a straight course due east at high velocity. I said what in the #%&@ is that? He said it's an airplane. I said where are the wings? He said it's a missile and I said no it's not. Then it vanished as we were observing it, literally. The object was dark, maybe black. I can't estimate altitude and size but if I were to hazard a guess I'd say it was at ten thousand feet and maybe 350 feet long. I am certain that the aspect ratio was aout 10 to 1. It was totally silent, with no contrail. Where I show the side fins we couldn't see clearly because it was shimmering as if with heat energy, but the size is about right. The rest of the craft did not shimmer. When I saw it it was directly overhead, maybe 5 degrees to the south. It traveled about 30 degrees of arc before vanishing at about 60 degrees. There were two large jets in the area, probably commercial, at high altitude and leaving contrails. We could hear them. I'm guessing that the craft was somewhere between the jets and us. If I knew how big it was I could estimate altitude better. We would have never seen this if I hadn't been laying on my back. I believe that it flew directly over Washington DC! If my guesses are right it vanished about when it got over the ocean. Needless to say we were both stunned and I am a different person today because of it. A couple of days later I made a drawing of the object which is attached to this report. My friend wishes to remain anonymous but he will confirm the details of this account."],"Object Shape":"Cigar","Sighting Duration":"00:00:10","map":"<A HREF = \"http://maps.google.com/maps?q=39.083997,+-77.152758(6749)&iwloc=A&hl=en\"> mufon case (6749) map </A>","Log Number":"US-04042007-0003","Region":"Maryland","Case Number":"6749","Longitude":"-77.152758","Tags":"City","Date Submitted":"03/30/2007 02:15 UTC","Viewing Distance":"Unknown","Weather Factors":"Unknown","Source":"MUFON","Latitude":"39.083997","Summary":"Object at altitude flying due east at high velocity.","Country":"United States","Disposition":"Unknown","Date of the Event":"03/30/2007 02:15 UTC","City":"Rockville","Object Flight Path":"Straight-line path","trends":["There have been 7 other sightings in Rockville","There were no other sightings in Rockville on or around March 30th 2007","This sighting has never been favorited.",""]}