{"Date Submitted":"01/04/2007 06:30 UTC","Case Number":"6751","Weather Factors":"Unknown","Source":"MUFON","Object Features":"Undisclosed","Region":"Colorado","Viewing Distance":"Unknown","City":"Denver","files":["/var/www/straped/mufon/html2text/6751.html.txt","/var/www/straped/mufon/org/6751.html"],"Date of the Event":"01/04/2007 06:30 UTC","Country":"United States","trends":["There have been 185 other sightings in Denver","There was one other sighting in Denver on or around January 4th 2007"],"Longitude":"-104.983033","divs":["Sighting DetailsMy sister was driving be to the airport from her home on Kipling. We took the express way and were deep in converstation about some family matters, when I looked up and say this group of lights. At first I thought it was the bottom part of an airplane, but I noticed that they were spread out like the handle on the Big Dipper and all moving together. I just giggled to myself and thought that I could have used another hour of sleep because now the stars were all floating across the sky together. Now, since my mother lives on the far back side of the airport, I have seen light moving across the sky that I knew belonged to so other form of life, so I am used to seeing this. However, I wasn't sure if my sister would look at me like I was crazy or kick me out of the car an make me walk the rest of the way. Just as the subject was changing in the conversation, my sister turned to me and asked me if I say the light that were moving together. I just started laughing and told her that I had been tracking it since we started heading to the airport. I told her that at first I though that it was maybe a comet, but it wasn't bright enough. Then I thought it could have been some space garbage coming down from the heavens, but still no brun of the atmospheric changes. So we decided to rule those out. It was beautiful and moving peacefully across the sky as if it had all day to get to it's destination. The stars were white, light blue and a soft golden yellow. It was an amazing sight to see I we were both very happy to have seen it. We finally reached the airport and I made my flight. I called home later that evening to listen to her tell me that it was some metors that had come apart and fallen. I guess I would have swallowed that, but as I stated there were 7-12 stars grouped and moving together. I just wondered if anyone else say whay I did?"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.745164,+-104.983033(6751)&iwloc=A&hl=en\"> mufon case (6751) map </A>","Object Flight Path":"Undisclosed","Log Number":"US-04042007-0005","Summary":"A group of stars moving slowly across the sky.","Tags":"City","Sighting Duration":"Undisclosed","Latitude":"39.745164","Disposition":"IFO","Object Shape":"Square, Rectagular"}