{"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=38.132737,+-121.267637(6756)&iwloc=A&hl=en\"> mufon case (6756) map </A>","Tags":"City","Object Shape":"Circle, Flash, Sphere","Case Number":"6756","divs":["Sighting DetailsMy freind and I where on a houseboat repairing the back of the steel houseboat and had the boat anchored in the delta and we where swiming late that night doing some relaxing.While we where messing around I noticed a bright lite in the sky not like all the rest of the stars this light was in motion moving very fast and erractic up and down left and to the right and the light was changing super bright and then very dim. The light in the sky did not look like stars the light was consatly changing marbleing in color changing form white to red orange green blue yellow consantly change in color and intensity. We where in the delta facing the west, this happen southwest of us over the top of Mount Diablo mountian which is a single large mountian in the area.We where watching it for a while then I remimbered that I had a good pair of binocholars down in the cabin and retived them at this time I had started to get a lettle on the scared side I relised what I was seeing and did not want it to come this way.We had been watching it for what I beleived was about a hour which till then there had been no noise. From over our right witch I beleived came from Vaden Air Base a jet come over our heads and flew straight tords the lighted oject we could hear the jet and see it fly over head.I beleive that this jet ingaged the oject at this time when the jet had gotting close to the oject it look from the the ground that a light left from the jet and shot striaght tords it. I beleive that the jet had shot a rocket or something at it maybe tracers. At this time all hell broke lose the oject seperated into about four deferent peaces and all four seperated and then all headed in the same direction up and together to the south and clean out of sight in a matter of secounds twice maybe three times as fast as the jet had been flying. P.S. I know that the date this happen seems suspect but this really happen me and one other witness it and it was real."],"Latitude":"38.132737","Country":"United States","Date of the Event":"07/04/1982 02:59 UTC","Longitude":"-121.267637","Sighting Duration":"Undisclosed","Log Number":"US-04052007-0003","Object Features":"None","Disposition":"Insufficient Data","Summary":"Saw UFO in the sky over the top of Mount Diablo mountian","Region":"California","Date Submitted":"07/04/1982 02:59 UTC","files":["/var/www/straped/mufon/html2text/6756.html.txt","/var/www/straped/mufon/org/6756.html"],"Weather Factors":"Unknown","City":"Lodi","trends":["There have been 20 other sightings in Lodi","There were no other sightings in Lodi on or around July 4th 1982"],"Viewing Distance":"Over One Mile","Source":"MUFON"}