{"Log Number":"US-04062007-0001","City":"Undisclosed","Summary":"dim oval shaped object which got brighter and made odd manouvers, then vanished","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=43.812513,+-120.548141(6758)&iwloc=A&hl=en\"> mufon case (6758) map </A>","Date Submitted":"04/06/2007 05:19 UTC","Longitude":"-120.548141","Sighting Duration":"00:02:11","Date of the Event":"04/06/2007 05:19 UTC","Case Number":"6758","Latitude":"43.812513","Source":"MUFON","Country":"United States","files":["/var/www/straped/mufon/html2text/6758.html.txt","/var/www/straped/mufon/org/6758.html"],"Disposition":"Unknown","Weather Factors":"Unknown","Viewing Distance":"Unknown","Object Features":"None","Region":"Oregon","Tags":"City","trends":[],"Object Shape":"Oval","divs":["Sighting DetailsI was walking my 3 Pembroke Welsh Corgi's outside of my apartment at about 5am, Friday Morning, and noticed that the night sky was brilliantly clear and the stars seemed to be particularly out tonight. I said thanks to God for the beautiful night sky, and asked for two things. One, a view of one of the sattelights I had een wondering about, as I used to watch for them in Aloha, at my house back a few years ago. I looked up, and saw a faint object, crossing right in front of me, with a trajectery of a North to South run. It kept up it's speed, was dim, but I got to watch it cross the night sky, in it's normally fast pace. It took about 2 minutes to cross the sky. But then, I looked up again, and saw another one, right behind it, maybe one minute's time, and it followed the exact same line, like tailgating in outerspace. But this one was much bigger, and it shimmered, pulsated with a faint light, which got bigger and brighter, and then became as bright as the full moon, which it then pulsated bright to dim twice, and even though it was rather dim, like a faint distant star, it stood still for a moment, the took off at a 45 degree angle, and dissappeared. Wow."]}