{"files":["/var/www/straped/mufon/html2text/6761.html.txt","/var/www/straped/mufon/org/6761.html"],"Longitude":"-74.324319","Weather Factors":"Unknown","Disposition":"Unknown","Region":"New York","City":"Goshen","Case Number":"6761","Object Shape":"Other","Latitude":"41.402038","Object Features":"None","Log Number":"US-04062007-0004","Tags":"City","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=41.402038,+-74.324319(6761)&iwloc=A&hl=en\"> mufon case (6761) map </A>","Sighting Duration":"Undisclosed","Date Submitted":"02/10/2006 12:00 UTC","divs":["Sighting DetailsI had taken my son to the doctor in Goshen. After, we regularly go to Burger King. On our way to a red light I saw a shine in the sky. I stopped at the red light and saw the shine again. It was just abnormally bright to be an airplane. I looked and saw what appeared to be a stainless steel acorn shaped object quite some distance away. Still from where we were it was about the size of a large marble if I were to have held my fingers up from that location and \"pinched\" it. My then 11 year old son also saw it. It just hovered there glinting in the sun. It seemed to be spinning in a counter clockwise direction. It didn't dip or turn or even move...it stayed in one spot and spun. I don't see how no one else saw it except my son and I. I almost would have dismissed it as a normal plane if I hadn't stopped at that red light. We turned left towards Burger King and in the parking lot turned round to see the object but it was gone. I came home and immediately told my husband. My son and I both felt exhilarated and excited but a little fearful. I have never confirmed nor denied extraterrestrial existence to my children. But I have told them of a couple other experiences I had."],"Country":"United States","Object Flight Path":"Stationary","trends":["There has been one other sighting in Goshen","There were no other sightings in Goshen on or around February 10th 2006"],"Summary":"Steel-looking Acorn in the Sky","Source":"MUFON","Date of the Event":"02/10/2006 12:00 UTC"}