{"Region":"British Columbia","Viewing Distance":"Over One Mile","Log Number":"CA-04072007-0001","Tags":"City","Country":"Canada","divs":["sighting detailson april 6\\2007 at 9:30 p.m.i was sitting on my porch & i saw a light streak through the sky from east to west, when i walked out into the street to follow it but it had disapeared ,i saw a large bright light s.w. of abbotsford b.c. it was stationary and when i looked through the binoculars i could see the various brightnesses from the object and as i zoomed in the best i could it seemed to be a number of lights from that object, i found the space station which was more in an easterly direction & it was much higher in the sky, my accurracy for distance is not reliable, i also noticed 3 other objects of light they were more towards the airport s.w. but high above, these lights seemed to show blue & red color but they to were also stationary i just went outside 10:46 p.m. waked to the corner & the bright lights were gone, don't know what to make of it, total time of sighting was under 1 hr. d.lee abbotsford b.c."],"Longitude":"-122.470758","Weather Factors":"None","Date of the Event":"04/06/2007 09:00 UTC","Summary":"Very bright light in the N.W. direction from Abbotsford, close to airport, I've been watching this bbright light for almost 45 min. not sure of distance but when I look through the binoculars I can see different brightnesses of light from this object .","Disposition":"Unresolved","Case Number":"6764","Latitude":"49.058048","Sighting Duration":"Undisclosed","City":"Aldergrove","trends":["There have been no other sightings in Aldergrove","This sighting has never been favorited."],"Source":"MUFON","Date Submitted":"04/06/2007 09:00 UTC","files":["/var/www/straped/mufon/html2text/6764.html.txt","/var/www/straped/mufon/org/6764.html"],"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=49.058048,+-122.470758(6764)&iwloc=A&hl=en\"> mufon case (6764) map </A>","Object Flight Path":"Stationary","Object Shape":"Circle"}