{"Summary":"viewed what I thought to be a planet through binoculars... it wasn't a star.","Source":"MUFON","Disposition":"Insufficient Data","divs":["Sighting DetailsThis happened when I was much younger. I'm currently 24. I believe I was somewhere around 9 or 10 at the time. the date I posted this is an aproximation. However, this has been on my mind for quite some years... and I've always thought I should tell it to someone. It was a summer evening. I was playing games with some neighborhood friends. One of my friend's father had told us that there were going to be 3 planets visible in the sky that night... an event that happens once every few thousand years or something. He had purchased a nice telescope a few weeks earlier and invited us over, later that night, to look at the planets. Being kids we were pretty excited about the opportunity. just before dusk we noticed a bright light high up in the sky. we assumed it was one of the planets showing up. we were excited and didn't want to wait till later to view it through the telescope... so... we grabbed a pair of binoculars. We saw 3 points of light, forming a triangle. being young, I assumed, that rather than being one of the planets, it was all 3. every second or so (exact intervals) the three points of light spun, almost instantaniously, 60 degrees. the object was far enough away where it appeared to be one light, yet when viewed through binoculars you could see 3 points of light, in an equilateral triangle, intermitently pivoting 60 degrees around a central point. we only viewed it for a few minutes. we all had to go home and check in with our parents. a half hour later we all returned to view the planets... by this time they were spread out through the sky. Untill I studdied astrology, in junior high, I assumed that the 3 planets entered the sky closely aligned (as whatever it was we saw) and then spread out (into what we later viewed). It wasn't untill then that I knew what I had seen was something odd."],"Date of the Event":"06/15/1991 09:00 UTC","Region":"Minnesota","map":"<A HREF = \"http://maps.google.com/maps?q=44.839444,+-92.991667(6765)&iwloc=A&hl=en\"> mufon case (6765) map </A>","Date Submitted":"06/15/1991 09:00 UTC","Longitude":"-92.991667","City":"St Paul Park","Log Number":"US-04072007-0002","Weather Factors":"Unknown","Country":"United States","trends":["There have been no other sightings in St Paul Park","This sighting has never been favorited."],"Tags":"City","Case Number":"6765","Viewing Distance":"Unknown","Sighting Duration":"00:10:00","Latitude":"44.839444","Object Shape":"Triangle","Object Flight Path":"Stationary","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/6765.html.txt","/var/www/straped/mufon/org/6765.html"]}