{"Summary":"The Mesa Lights....Four lights in sky hovering low and beaconing without any sound.","map":"<A HREF = \"http://maps.google.com/maps?q=33.422334,+-111.826312(6770)&iwloc=A&hl=en\"> mufon case (6770) map </A>","Log Number":"US-04082007-0001","files":["/var/www/straped/mufon/html2text/6770.html.txt","/var/www/straped/mufon/org/6770.html"],"Date Submitted":"10/25/1991 07:00 UTC","divs":["Sighting DetailsMy wife and I were over at some friends of ours apartment and we had been just hanging out having fun and me and my friend were on his balcony and right in front of appeared four glowing lights moving across the sky that seemed to be perfectly spaced and glowing in and out like a beacon of sorts. We had a camcorder there at the time and quickly grabbed it and started to film the event that I like to call \"The Mesa Lights\". These lights were moving Southwest in direction and were at a low altitude. The lights that I observed were only four that we saw and definitely moving across the sky fairly quickly, however observing this happen seemed much longer. My friend said that he had read about an airshow that was going on around this same time in the paper but now looking back at this footage again I don't believe that to be the case as there was no sound coming from these so called \"jets\". It was ominous, and where I currently live whenever military \"jets\" fly by at a much higher altitude the whole house practically shakes. The footage I have of these lights seemed much lower to me than any military \"jet\" I have ever seen. Also, is it common to practice for an airshow in the evening? That question still to this day looms in my head. All four of us there were very intigued by this event as we all watched in amazement these lights that none of us had ever seen before. It was a bit strange to have witnessed this, almost like maybe we saw something that we shouldn't have. Afterwards some of us wanted to go follow them to see if we could document anything else but not everyone there was as interested in doing so. The lights ended up moving to far out of view from the balcony that we were on and we lost sight of them. My friend did call up the police and they had said that they had received a lot of calls on the lights but still confirmed it was planes practicing for an airshow. I never believed this theory. There we're no other lights on these objects neither like airplanes have that blink in the night sky when flying. All I know is that to this day I've shown numerous people (friends,family) the footage and we've all tried to come up with a logical explanation of what these objects could be and still no one can! Here in Arizona we had a mass sighting ~ 10 years ago called The Phoenix Lights and it still happens from time to time again. Being that the 10th anniversay of this mass sighting just happened in March, it really sparked my interest to get my footage out there and share my story. I'm not sure what these lights in the sky were, but I do not feel they are military in any way."],"City":"Mesa","trends":["There have been 73 other sightings in Mesa","There were no other sightings in Mesa on or around October 25th 1991","This sighting has never been favorited.",""],"Latitude":"33.422334","Case Number":"6770","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Longitude":"-111.826312","Source":"MUFON","Disposition":"Unknown","Country":"United States","Region":"Arizona","Tags":"City","Viewing Distance":"Unknown","Date of the Event":"10/25/1991 07:00 UTC","Object Shape":"Circle, Other","Weather Factors":"Unknown"}