{"Object Shape":"Egg","Summary":"Election day at the public plaza on top of the crowd it went real slow down then up and dissapear into the sky","Tags":"City","Country":"Puerto Rico","Latitude":"18.0525","City":"Juana DÃƒÂ­az","Object Features":"Dome","Longitude":"-66.504444","Source":"MUFON","Date Submitted":"11/15/1967 03:23 UTC","Date of the Event":"11/15/1967 03:23 UTC","Viewing Distance":"Over One Mile","Case Number":"6772","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=18.0525,+-66.504444(6772)&iwloc=A&hl=en\"> mufon case (6772) map </A>","trends":["There have been no other sightings in Juana Díaz","This sighting has never been favorited."],"Object Flight Path":"Stationary,Other","Disposition":"Unresolved","Region":"","files":["/var/www/straped/mufon/html2text/6772.html.txt","/var/www/straped/mufon/org/6772.html"],"Log Number":"PR-04082007-0003","divs":["Sighting DetailsIt was the election day in P.R. in the town of Juana Diaz in the year 1967 or 68. Me and three of my friends after voting went to the plaza to celebrate with everybody else the results of this election.When we where standing in the middle of the crowd, we all saw this egg shape form thing in the sky; we just looked at each other with ammusement.We did not talk to each other until the thing was gone.We couldnt move and to our surprise nobody else seem to care to look up so we did for about 20 to 25 minutes...there was also a humming sound that was silenced by the noise of the crowd coming from this thing.It was real high in the sky and got closer in zig zag motion real slow;then if as the thing got scare went up in super fast motion and dissapear into the sky.The people that saw this are dead now, this included my mother in law at the time. Since then I had the need to tell someone about it, but never had the chance to do it until now. Dont know if this will be of any help, but it was real and also very scary. If you need more information please fell free to contact me at 754 422 5819( my cell)."]}