{"Object Shape":"Star-like","Weather Factors":"Unknown","Latitude":"45.532252","divs":["Sighting DetailsFor many months now, both my house mate-Randy and I have been observing a large star-like object in the evening and night sky to the west of our NE Portland residence location. Some nights it seems to be closer to earth than others - but it usually is stationary for some hours, then disappears, before any other stars dim. Also, it is the first one in the sky - often the only one in the sky and it is huge - 5-10 times the size of the biggest stars in the night sky. Looking through the binoculars, it definiely is not a star; it shines about 100 times brighter than any brightest star in the night sky - it is about 10 times larger that any stars in that quadrant, and it seems to flicker or sometimes pulse it's lights (which have a bluish hue and reddish tinge to it at times). The light seems to be more like a hallogen type light or brightness, and it seems to get closer and farther away from the earth (moving) as the night progresses. Recently, we've noticed that there is another similar object to the South of the other one. They both are bright, and obviously huge, whatever they are. There are times, when we take out our doggie in the back yard, when we notice the object gone, all of a sudden, or perhaps, the lights have been turned off. Then, later, it appears a long distance from its original location (higher or lower in the sky and farther to the north or south), once more. It usually sits to the West of our residence, at about a 25'-30' angle from the Western horizon. We have thought of taking photos of it with our digital camera, but figured nothing would really register, except a bright spot in the sky, so why bother. If you instruct us to take photographs, and tell us how and with what type of equipment, we will certianly attempt it, if they will still be here. We always feel \"strangely\" after these sightings, often feeling a bit frightened, just by the obvious sheer size of it. It often feels like \"someone is watching us.\" Nothing that we can put our fingers on, but it is unnerving nevertheless. FYI: I always want to run in the house and lock all the doors for some inexplicable reason. By the way, the object is typically still there, and its lights are flickering, like the sunrays off a huge diamond. It would be helpful if someone from your organization would check this phenomenon out, as it is rather disturbing to note it just sitting there, as \"if observing us,\" and know that no one from earth (that we know of) is atempting to find out what's going on with it. We realize that if that is some kind of a \"space ship of alien origins,\" then given their size and obvious technological superiority, we, on earth, are probably helpless and unlikely to investigate it with any certainty or confidence. Thank you for your assistance on this. It is my hope and expectations that I will not have unwanted \"visits from the Men in Black,\" or have any of my personal information distributed outside of your scientific circle of inquiry. Respectfully,~ Eva Starmach, Ph.D. ~"],"Region":"Oregon","Longitude":"-122.670647","Summary":"large, bright, object in the Western sky in Portland, Oregon","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=45.532252,+-122.670647(6773)&iwloc=A&hl=en\"> mufon case (6773) map </A>","Sighting Duration":"Undisclosed","Date Submitted":"02/28/2007 12:00 UTC","Object Flight Path":"Undisclosed","Tags":"City","Log Number":"US-04082007-0004","Disposition":"IFO","Object Features":"Undisclosed","City":"Portland","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around February 28th 2007"],"Case Number":"6773","Date of the Event":"02/28/2007 12:00 UTC","Source":"MUFON","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/6773.html.txt","/var/www/straped/mufon/org/6773.html"]}