{"Viewing Distance":"101-500 Feet","Object Flight Path":"Hovering then path","Country":"CA","Object Shape":"Disc","divs":["Sighting DetailsMy boyfriend and I were standing on the corner of Elmhurst and Albion Rd, waiting for a bus. We looked across the street and above the tree line of the Humber Valley Golf course was a space ship. It was a solid structured craft, metallic gray.It was shaped like two saucers with their rims together. It was huge with many spots that looked like windows. In the center were 3 rows of lights that flickered on and off one after the other. It was hovering. It moved to the right a bit and then to the left. Then it started to move toward us. We grabbed a hold of each other in fear. It stopped then, like it knew what we were feeling. It then hovered back towards the Humber River and moved back and forth in the direction of the river. then it came back to it's original position and seemed to let us take a very good look at it. Then it shifted to a 45 degree angle with the higher end facing the northwest and then it took off. There was combustion from the lower angle of the ship as it sped upwards and northwest and disappeared in a couple of seconds. There was no visible difference of one side of the ship or the other. We gasped and I saw a woman about 40 walking up Albion and I ran up to her and I said \"Did you see that!\" She said \"Yeah!\" We didn't say anything else , I guess because we were in shock and it was so extrordinary. A police car from 23rd division pulled into the little plaza and parked directly behind us and he went into the little store. I said to my boyfriend, \" We should tell the police and ask him if he saw it.\" We were afraid to tell or ask him. I guess if he did see it he also felt the same way. I haven't seen my then boyfriend for about 30 years. If we find him I'm sure he will tell you the same thing. This is true. It was the middle of the day.It wasn't a light, or a flash. It was solid, clearly visible and there was no mistaking what it was. I get frustrated watching the shows on tv. Little blips and lights. If you help me find my old boyfriend and maybe that woman or the cop or someone else that must have seen it, we can help the world to really know that we are not alone. Please get back to me. I have other things to convey about this."],"Date of the Event":"11/30/1975 12:00 UTC","Longitude":"-77.742488","City":"TO.","map":"<A HREF = \"http://maps.google.com/maps?q=43.592086,+-77.742488(6774)&iwloc=A&hl=en\"> mufon case (6774) map </A>","Date Submitted":"11/30/1975 12:00 UTC","Disposition":"Unresolved","Summary":"2 saucers together","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Latitude":"43.592086","Source":"MUFON","files":["/var/www/straped/mufon/html2text/6774.html.txt","/var/www/straped/mufon/org/6774.html"],"trends":["There have been no other sightings in TO.","This sighting has never been favorited."],"Tags":"City","Log Number":"CA-04092007-0001","Object Features":"Window(s)","Region":"Ontario","Case Number":"6774"}