{"Case Number":"6775","map":"<A HREF = \"http://maps.google.com/maps?q=40.448208,+-122.297782(6775)&iwloc=A&hl=en\"> mufon case (6775) map </A>","Object Features":"None","Disposition":"Unknown","Latitude":"40.448208","trends":["There have been 2 other sightings in Anderson","There were no other sightings in Anderson on or around April 1st 2007","This sighting has never been favorited.",""],"Longitude":"-122.297782","Summary":"While watching an aircraft turn to land at the redding airport i saw a fireball in the same area.","Object Shape":"Fireball","Date of the Event":"04/01/2007 11:02 UTC","Weather Factors":"None","City":"Anderson","Country":"United States","Viewing Distance":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/6775.html.txt","/var/www/straped/mufon/more/6775_submitter_file1__DSC00607.JPG","/var/www/straped/mufon/more/6775_submitter_file2__DSC00606.JPG","/var/www/straped/mufon/org/6775.html"],"Object Flight Path":"Path with directional change","Date Submitted":"04/01/2007 11:02 UTC","divs":["Sighting Details Being a big fan of airplanes I heard a large aircraft fly over my house on April 1st. at 11:00 P.M. I went to my backyard and saw it was Horizon Air making a left hand turn for runway 34 south of the airport. When the aircraft was close to final approach I saw what appeared to be another aircraft taking off in its path through the trees. After a short moment the light was clearly visible and my first thought was it was an aircraft with an engine fire. Looking at the object to the north moving to my right, I ran in the house and got my digital camera and took two pictures at 12x optical. Then the object slowly dropped down from my sight. Using the software on my camera I zoomed in on the object and saw this was clearly not an aircraft. The next morning I took the pictures to the Redding Record Searchlight News Paper. There Environmental Reporters looked at the photos and later contacted Military, Horizon Air and F.A.A. with no reports of seeing the object."],"Log Number":"US-04092007-0002","Region":"California","Sighting Duration":"00:01:30","Tags":"City"}