{"files":["/var/www/straped/mufon/html2text/6779.html.txt","/var/www/straped/mufon/more/6779_submitter_file1__shiprockOriginal.jpg","/var/www/straped/mufon/more/6779_submitter_file2__shiprockwidedarker.jpg","/var/www/straped/mufon/more/6779_submitter_file3__shiprockhisto.jpg","/var/www/straped/mufon/org/6779.html"],"Summary":"Going back through old Photo's , Found this picture of ShipRock , NM !","Source":"MUFON","Object Features":"Undisclosed","Log Number":"US-04092007-0006","Latitude":"36.785554","Longitude":"-108.687032","Object Shape":"Undisclosed","divs":["Sighting DetailsThis is an incredible capture, 1 of a kind shot it appears to me, and I just found it going through old photographs from 1993. SO I scanned it into my PC and did a negative image of it, and WOW ! Look at whats going on. it appears that the object was flying from above and you can even see the air trail from the angle it came in on. shutter speed was more than likely set at 1000 , because of bright sunshine that day,. so object was going basically the speed of light. I even did a negative on it and it shows up even better. I have more pictures , if your interested in seeing them, but I will attach the original first, and the other 2 will be my negative and zoom pictures. and you can do your image enhancements. I have a long History with UFO footage , I was on a show called \" UFOS: The best evidence ever caught on tape 2 \" about 1999 I think that aired on Fox network. From 1995 to 2000 , I captured a total of 37 different sightings caught on video, But, I have not been active on my research for 7 yrs now, but now for some reason I am starting to get back into it, and will get my video camera out again soon. wish me luck on getting new footage. Finding this picture among others that I thought was lost , was a wakeup call to myself I think , and I decided to go ahead and email this photograph to you , because its just simply fantastic. especially with the history behind shiprock. My personal thoughts on my picture would be , that the Volcano below is wide open lava tube , maybe going undeground for 100's of miles. and this is an entrance way. remember that the history for the hollow earth theory says there is a land below and they called it Agartha ! Yes, I know my history well. Please email me for furthur questions if need be. Thank You, Chris Miller"],"Object Flight Path":"Undisclosed","trends":["There have been no other sightings in Shiprock","This sighting has never been favorited."],"Date of the Event":"10/05/1993 12:00 UTC","Sighting Duration":"Undisclosed","Region":"New Mexico","Viewing Distance":"Unknown","Weather Factors":"Unknown","City":"Shiprock","Tags":"City","Disposition":"IFO","Case Number":"6779","map":"<A HREF = \"http://maps.google.com/maps?q=36.785554,+-108.687032(6779)&iwloc=A&hl=en\"> mufon case (6779) map </A>","Date Submitted":"10/05/1993 12:00 UTC","Country":"United States"}