{"City":"Parrish","Source":"MUFON","Latitude":"33.730664","Disposition":"Unknown","Tags":"City","trends":["There have been no other sightings in Parrish","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.730664,+-87.284447(6788)&iwloc=A&hl=en\"> mufon case (6788) map </A>","Country":"United States","divs":["Sighting DetailsIt was dark, around 9:45pm. I stepped outside onto my porch to smoke a cigarette and I saw two objects flying in tandem at about the height that airplanes fly around here. The sky was clear and I could see stars too. I could only see a row of lights blinking for each craft. It looked like each object had at least 4 lights, maybe 5, and they all appeared to blink. The light in the center of the row of lights was red and the other lights were white or yellow. I heard a low rumbling noise. When I noticed them I did not think they were airplanes because of the way they flew together and maintained the space between them and the lights looked strange. My first thought was that they were UFOs, then I thought, no, they are probably airplanes. But I didn't really think they were airplanes. It was exciting and I tried to get a good look and count the lights, but they were pretty far away and I can't be sure about it. They had too many lights to be airplanes I think, and they made a low rumbling noise that wasn't like airplanes. They flew in a straight path, about the speed of airplanes. They were heading west and crossed the sky in about 5 minutes. It occurred to me that they could be military planes, the really big ones, flying together. I went inside and got my mother to come out and look at them. She saw them too. We watched them disappear behind some trees over the horizon. I don't know. They could have been those really big military planes, but they were strange. I don't know if I should report it, but maybe somebody else saw it?"],"Object Flight Path":"Undisclosed","Region":"Alabama","Date Submitted":"04/10/2007 09:45 UTC","Summary":"two objects moving in tandem. I could only see flashing lights, white and red.","Date of the Event":"04/10/2007 09:45 UTC","Case Number":"6788","Log Number":"US-04102007-0009","Object Shape":"Undisclosed","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/6788.html.txt","/var/www/straped/mufon/org/6788.html"],"Longitude":"-87.284447","Weather Factors":"Unknown"}