{"Log Number":"CA-04112007-0003","files":["/var/www/straped/mufon/html2text/6792.html.txt","/var/www/straped/mufon/org/6792.html"],"Date Submitted":"05/01/2006 12:00 UTC","Source":"MUFON","City":"Saskatoon","Object Flight Path":"Undisclosed","Summary":"Over 50 witnesses including and RCMP officer.","Country":"Canada","Weather Factors":"Unknown","Case Number":"6792","Latitude":"52.14048","Disposition":"Unresolved","Object Features":"Undisclosed","Tags":"City","Sighting Duration":"Undisclosed","Longitude":"-106.638486","map":"<A HREF = \"http://maps.google.com/maps?q=52.14048,+-106.638486(6792)&iwloc=A&hl=en\"> mufon case (6792) map </A>","Viewing Distance":"Unknown","divs":["Sighting DetailsDuring ice break-up last April 2006, we the people of Waterhen Lake First Nation (A Cree Tribe Reservation), started noticing frequent predictable UFO activity. It came to a point that each night at about 10:30pm until about 11:00pm, people would be waiting for the expected light show. I tried to convince a friend from a neighboring town to bring his digital camera and to come and witness the activity, but he said he had other things to do that evening and that he would check it out some other night. In a serious way I guaranteed him about a 75 percent chance he would record something that night (Before the sightings, I would never even give anyone a 1 percent chance of a UFO sighting). That night was the best light show we had ever seen. At first it formed a semi-circle of lights with each light flickering on in sequence, then would flicker off in sequence but in reverse order. The lights then repeated the sequence, but this time in a row which stretched out about a half mile to three quarters of a mile. The approximate distance from our viewing area to the lights was about two miles away across the lake. Just before I got to the sighting area, an RCMP constable had just pulled someone over and had his lights flashing. When I pulled up beside him I told him to look to the Northwest. The RCMP constable just said \"Oh, there back\". From this statement, I knew he had seen them before. One other thing is that we are situated near the Cold Lake Air Weapons range. We see many types of military aircraft from many countries flying in our airspace. You just get use to the noise. Whatever we seen that night didn't make a noise and there was no wind that night. These lights resembled what were referred to as the Phoenix lights. I am not guaranteeing that we will see a repeat from last year, but it would be worth checking it out, wouldn't you say. I am however guaranteeing a location to view from with no interference from anyone. I tried to report this to other agencies but I got no response. I just recently found out about MUFON. To be honest, I don't know what I seen that night, after all UFO does mean 'Unidentified' Flying Object. There was a video released to the Canadian Broadcasting Corportation (CBC)and they did show it. It was a spectacle and they picked the wrong individual (Nightwatchman) to represent us and I am not proud of how it was presented. Since then I have been elected into Council and would like to remain anonymous please. I will give you the utmost respect if you do the same. Thank you"],"Date of the Event":"05/01/2006 12:00 UTC","trends":["There have been 16 other sightings in Saskatoon","There were no other sightings in Saskatoon on or around May 1st 2006"],"Region":"Saskatchewan","Object Shape":"Flash"}