{"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.208428,+-73.891248(6796)&iwloc=A&hl=en\"> mufon case (6796) map </A>","Tags":"City","Log Number":"US-04112007-0007","trends":["There has been one other sighting in Croton-on-Hudson","There were no other sightings in Croton-on-Hudson on or around December 10th 2005"],"Source":"MUFON","Date Submitted":"12/10/2005 02:00 UTC","City":"Croton-on-Hudson","Weather Factors":"Unknown","Latitude":"41.208428","Region":"New York","Object Shape":"Flash","files":["/var/www/straped/mufon/html2text/6796.html.txt","/var/www/straped/mufon/org/6796.html"],"Country":"United States","Summary":"Bright flash that lit up the night sky 3 seperate occasions in the same general area near nuclear reactor","Object Flight Path":"Other","Longitude":"-73.891248","Case Number":"6796","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting Detailsin the beginning of december of 2004 i was traveling north on RT.9A leaving ossining and entering Croton. i was in my car a 1991 eagle talon with 2 other friends in the vehicle, we were on our way home from a night out and i was the designated driver so i had not had anything alcoholic to drink. both friends were asleep at the time because it took us close to an hour to get home so no one else witnessed the event. as i was driving over a small bridge parallel to the croton train station a large flash lit up the entire sky and it appeared to be comming from somewhere north or slightly northwest of our location. right after the flash i felt as if my entire body was engulfed by goosebumps, and at this moment i am feeling the same sensation. at the time i didnt think much of the event and blamed my imagination or maybe i was just seeing something especially because there were no witnesses so i ignored it. about a month later on a snowy night i was driving to the Croton point park which is within a mile of the location i described above to fool around in the snow with my car. i was alone this time, i was on the road that leads to the croton point parking lot when once again there was a massive flash whitch lit up the sky but unlike last time it was snowing quite heavily and the sky was covered by clouds yet the flash seemed to be eminating from below the clouds because i vaguely remember seeing the clouds being iluminated. once again my body was engulfed with goosebumps and this time i was quite frightened especially because my location was secluded with no one near by. once again the flash seemed to be emanating from the north or northwest. finally about a year ago i was traveling south on RT.9 leaving montrose going towards croton when once again i saw the flash again and the sensation i experienced the same feeling as before. this time i was several miles north of the location i had witnessed the flash the last 2 times and this time the flash seemed to come from the west. strangely this may have nothing to do with these incidences but there is an active nuclear reactor in peekskill called Indian Point which is also extremely close to these locations i mentioned above. i have heard rumors that this reactor sits on an inactive fault line but dont quote me on that. i have never had any eye sirgury nor do i wear glasses or contacts and consider my eyes to be in perfect condition and the last time i had a full eye exam was about 2 years before the first sighting. i have believed in UFOs and extra terrestreals for many years after i was introduced to a show called \"unsolved mysteries.\" Since then i enjoy watching any kind of show relating to this subject mainly the shows on the scifi channel which is where i heard of your organization and led me to come forward with this information. i know i saw those flashes but what caused them i can not explain, and after researching UFO sightings in westchester county i found that there have been quite a few so anything is possible. i hope this may help but if this turns out to be nothing i am deeply sorry. Thank you Vitor"],"Date of the Event":"12/10/2005 02:00 UTC","Object Features":"None","Disposition":"Unresolved"}