{"divs":["sighting detailsdriving home westerly on our road noticed very bright white light in the sky nearly due west and 15 to 20 degrees above the mountains. got home, ran inside, got dad, got binocs (25x80) and video camera (20x optical w\\ image stablization) and watched it for about 30 minutes until it set with the stars over the horizon. we kept trying to think of what else it could be, mylar research balloon reflecting the sun? international space station? planet? definitely not a plane. finally, dad said, jesus! it really must be a ufo. it was very amazing and we were all quite giddy and excited. brightly, distinctly colored rings would rotate around the orb latitudinally from bottom to top, changing colors with each cycle, sometimes regularly, sometimes staying the same for several minutes. brightness seemed to deminish somewhat as it neared the horizon but as it set behind the mountain it showed an aroura like the setting moon. we got digital photos and video on card and tape but haven't reveiwed them yet. will follow up. object was pretty distant so even at 20x probably won't look like much. maybe it was a weather balloon, but i don't think so. that's it."],"Case Number":"6798","Date of the Event":"04/11/2007 12:00 UTC","Country":"United States","Region":"Colorado","Object Shape":"Sphere","Summary":"Very bright (10 times Venus) moved w/ stars to set over Rocky Mts. @ 10:15, bright white center w/alternating red, blue, green, yellow rings. No movement. Stationary.","map":"<A HREF = \"http://maps.google.com/maps?q=40.58729,+-105.080593(6798)&iwloc=A&hl=en\"> mufon case (6798) map </A>","Tags":"City","Longitude":"-105.080593","Object Flight Path":"Stationary","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/6798.html.txt","/var/www/straped/mufon/org/6798.html"],"Log Number":"US-04122007-0001","Source":"MUFON","Weather Factors":"Unknown","Object Features":"Other","Sighting Duration":"Undisclosed","trends":["There have been 65 other sightings in Fort Collins","There were no other sightings in Fort Collins on or around April 11th 2007"],"Viewing Distance":"Over One Mile","Date Submitted":"04/11/2007 12:00 UTC","Latitude":"40.58729","City":"Fort Collins"}