{"files":["/var/www/straped/mufon/html2text/6801.html.txt","/var/www/straped/mufon/org/6801.html"],"Case Number":"6801","Source":"MUFON","Log Number":"GB-04122007-0004","Object Features":"Undisclosed","Longitude":"-99.996246","divs":["Sighting DetailsI saw something when I was about 12 or 13 (so would have been about 1975-6). I live in Rugby in the Midlands, UK. There are radio masts close to the town, some of which are used by the M.O.D., and you could see them at night from my bedroom window, due to the red warning lights they had on them. A number of these have been removed within the last few years, but there are still some left in that location. When I couldn't sleep, I used to look out of the window at the mast lights, and one night, while doing just that, I noticed a white light moving across the sky. I couldn't tell how far away it was from me or the masts, but it moved across, from right to left, at approximately the speed I would have expected of a light aircraft. Naturally, that is what I first assumed it to be, but the light suddenly shot upwards at an angle of about 60 - 70 degrees, and was moving so quickly out of sight that I would have missed it if I had blinked. I am 100% positive that this was NOT a light- or passenger aircraft, as it's last movements would be impossible for an aircraft to accomplish. Unfortunately, my sister, who shared the bedroom with me, remained asleep during the event, so I have no witness to validate my sighting. I am now 43 years old, and this memory has remained very clear in my mind since that evening, as it was a very exciting event for me."],"trends":["There have been no other sightings in Rugby","This sighting has never been favorited."],"Date of the Event":"11/30/1974 12:00 UTC","Date Submitted":"11/30/1974 12:00 UTC","Region":"North Dakota","Latitude":"48.368888","City":"Rugby","Tags":"City","Country":"United States","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=48.368888,+-99.996246(6801)&iwloc=A&hl=en\"> mufon case (6801) map </A>","Object Shape":"Unknown","Sighting Duration":"00:01:00","Object Flight Path":"Undisclosed","Summary":"White light seen moving across sky in evening, not aircraft.","Disposition":"Unresolved","Weather Factors":"Unknown"}