{"Object Flight Path":"Stationary","Log Number":"US-04132007-0001","Object Features":"Other","Latitude":"42.550855","City":"Silver Creek","Case Number":"6805","Longitude":"-79.160707","files":["/var/www/straped/mufon/html2text/6805.html.txt","/var/www/straped/mufon/org/6805.html"],"Weather Factors":"Unknown","Source":"MUFON","Date of the Event":"04/03/2007 09:30 UTC","Disposition":"IFO","trends":["There has been one other sighting in Silver Creek","There were no other sightings in Silver Creek on or around April 3rd 2007"],"Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy wife and I were driving west on I90 from Buffalo in seperate cars on April 3rd, 2007 when we spotted two UFO's. We had just left my friends house and had only been driving about 15-20 min. when I noticed a strange looking, almost luminescent small cloud in the sky ahead of me. It was a clear night with a few puff ball clouds in the sky. Almost as soon as I noticed the strange cloud a glowing orange-silver light dropped down from the left and made a reverse \"J\" into the cloud. It then turned into two lights. I watched it for about 30 seconds, before I decided to call my wife, whom I was following. Just as I picked up the phone, she called me and I answered with,\"Do you see that?\" She replied,\"What is that?\" We stayed on the phone watching these two lights that were absolulty still. We drove for about 6 min. at 70 mph until we passed them floating about 200-300 feet off the ground and maybe a quarter mile to our right just past the Silver Creek exit, maybe 2-3 miles past. The oval balls had a very unearthly glow that radiated from them. We were close enough, that if it was a plane or an ultralight, I could have told you the make and model. I am an airplane buff and an outdoorsman, and I can tell you that what we saw was not of this world. I always thought I would stop and stare at something like this, but It scared me so bad I'm shaking typing this."],"Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Object Shape":"Oval","Date Submitted":"04/03/2007 09:30 UTC","Summary":"2 UFO's spotted for 7 min by Silver Creek, NY","Region":"New York","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.550855,+-79.160707(6805)&iwloc=A&hl=en\"> mufon case (6805) map </A>"}