{"Viewing Distance":"Unknown","Region":"Montana","Summary":"There was a bright orange light over a moutain top. It split into two and then rejoined itself and took off.","Date Submitted":"04/12/2007 09:05 UTC","Date of the Event":"04/12/2007 09:05 UTC","divs":["Sighting DetailsMy daughter was driving home shortly after dark from her boyfriends ranch in the Bears Paw mountains outside of Havre, when she noticed an unusual light in the sky over a mountain top. she said the color was fire like orange and very bright. She pulled the truck up and watched it. It then split into two orange lights and one flew very quickly away to her right, and then very quickly back together and joined the one it had left. She said the head lights, and the dashboard lights went out, but she said the music on the CD player kept playing. She came home hysterical, shacking and crying. She said she'd never been so scared. I can tell you, I've been in the moutains, and rafting with this girl when we where stalked by a momma and two year old grizzly, and had one, flat run us out of our camp after dark after we had been rafting all day.I have never seen her so scared. She isn't the hysterical kind. I'm kind of a UFO buff after having many sightings in my life, but she always treats me like I'm weird. Well, now this is her third sighting, but the only one so close up and while she was alone. SHE WAS SCARED!!!After she watched this thing do the split and rejoin, she said it just disapeared, this fact seem to frighten her more then seeing it. She said she felt like she was being stalked for the next 30 miles home.She knows enough from being around me, that she kept an eye on the clock the whole way home. She said she glanced at it every couple of minutes to make sure there was no missing time. Boy, was she shook up."],"Object Features":"Other","Disposition":"Unknown","Object Shape":"Circle, Fireball, Sphere","Country":"United States","trends":["There have been 2 other sightings in Havre","There were no other sightings in Havre on or around April 12th 2007"],"Weather Factors":"None","Latitude":"48.545278","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Source":"MUFON","files":["/var/www/straped/mufon/html2text/6807.html.txt","/var/www/straped/mufon/org/6807.html"],"Tags":"City","Log Number":"US-04132007-0003","Sighting Duration":"Undisclosed","Case Number":"6807","map":"<A HREF = \"http://maps.google.com/maps?q=48.545278,+-109.6775(6807)&iwloc=A&hl=en\"> mufon case (6807) map </A>","Longitude":"-109.6775","City":"Havre"}