{"Disposition":"Unknown","Object Features":"Undisclosed","divs":["sighting detailson march 20, 2007 around 3pm my friend (scott) came over to my house to visit. my roommate (charlie) and i greeted him out in the front yard and that's when we observed a bright ball of light moving around a thunderstorm. the thunderstorm was approaching us slowly from the north and we still had sunshine above us. the clouds were dark, so the ufo was easy to see. it seemed like it was less than half a mile away. the object did a number of movements. it darted left to right while it ascended\\descended and vice versa. the most impressive maneuver was a series of figure eights. during that time charlie and i went inside to grab our cameras. charlie took 11 pictures of the object with his digital camera and i got a little over a minute of footage with my camcorder. the ufo went nw out of our view. we only saw that one ball of light during that time, but when we reviewed the film, there was more than one object. the film somehow picked up more activity, very close to us, at least 50 yards away from the camcorder. the first object is a streak of something moving so fast it is hard to catch it on the pause button. it looks very similar to a rod. the second object is a ball of light that descends from the top of the screen all the way to the ground, and it seems to go into the ground. it was very close to me. i'm so surprised that my friends and i never knew that it was there. the 3rd and 4th objects seem to fly in formation off in the distance, and the 5th object is the one that did the figure 8's which got our attention to take pictures."],"Date of the Event":"03/20/2007 03:15 UTC","files":["/var/www/straped/mufon/html2text/6808.html.txt","/var/www/straped/mufon/org/6808.html"],"City":"Sacramento","Object Shape":"Oval","Longitude":"-121.48551","Log Number":"US-04132007-0004","Region":"California","Country":"United States","Summary":"Bright light or orb observed near a coming thunderstorm over Sacramento.","Source":"MUFON","Latitude":"38.585372","trends":["There have been 83 other sightings in Sacramento","There were no other sightings in Sacramento on or around March 20th 2007"],"Sighting Duration":"00:15:00","Date Submitted":"03/20/2007 03:15 UTC","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Weather Factors":"Windy, Lightning, Light","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.585372,+-121.48551(6808)&iwloc=A&hl=en\"> mufon case (6808) map </A>","Case Number":"6808"}