{"Region":"California","Country":"United States","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/6810.html.txt","/var/www/straped/mufon/org/6810.html"],"Object Shape":"Circle, Sphere, Triangle","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=33.699806,+-117.860656(6810)&iwloc=A&hl=en\"> mufon case (6810) map </A>","Date of the Event":"03/31/2007 12:00 UTC","Date Submitted":"03/31/2007 12:00 UTC","Longitude":"-117.860656","trends":["There have been 17 other sightings in Santa Ana","There were no other sightings in Santa Ana on or around March 31st 2007"],"Object Features":"Window(s)","Object Flight Path":"Stationary,Straight-line path","divs":["Sighting DetailsI was walking to the park on Bristol and Warner with my kids about 1:00 PM March 31st. I spotted an unusual object in the sky along side a cluster of spherical shaped objects over Costa Mesa. About a minute after, my oldest son spotted another object to the right of this thing. When we first saw the second object, it looked like a cigar or an unsharpened pencil. A short while later it seemed to morph into a balloon or a tadpole. Once it morphed, it started to move like a ballon in the sky. 30 minutes later [while at the park], the firt object we saw began to release shperical objects that would move away from it, but would return in a matter of minutes. As the day went on, more objects began to appear. I decided to call a photographer friend of mine to help me take pictures of these object. I went to his house about 4:30PM. When I on my way there. I saw an object that totally blew my mind. It had the shape of an arrowhead and its color was a dirty brown. This particullar object, was so close, I saw a lot of detail. As it flew over my car, I heard nothing. It almost seemed like it was scanning the neighborhood it was flying over. I told my friend about it and we went directly to his back yard. What we saw at that time was a group of spheres forming basic shapes [a perfect triangle]. This happened through the day and probably after the sun went down."],"Latitude":"33.699806","Tags":"City","Source":"MUFON","Weather Factors":"Unknown","Case Number":"6810","Sighting Duration":"Undisclosed","City":"Santa Ana","Log Number":"US-04132007-0006","Summary":"Circular ufo with a tail or a flying fish"}