{"divs":["sighting detailsmy son and i were returning home after an evening walk up to the mountain base. it was very large, guessing the size of a cargo plane, the side view was shaped like a cigar with lights all around, moving very, very slowly, seeming to defy gravity. it was very low, just along the cliff ridge, tree tops. we losts sight of it as it grew darker and we could not see it at all after watching it for about 15 minutes, from up the hill as we walked down the hill to our home. it was just over the trees along mountainous ridges that line kam hwy., along kaneohe bay. when i first noticed it i just looked for a while, expecting it, at any moment, to become clear as to what it was, what was going on, but as we walked closer, i was thinking it was too large to be so low, going so slow, making no noise, i realized it was quite possibly a ufo. it was unlike anything we had ever seen or had knowledge of and my son (now a pilot), was into aircraft, yet didn't know of any us aircraft that looked like that. he thought it might be a military experiment since kaneohe marine corps base was nearby, sited on kaneohe bay (i have now learned it is a possibility because we have learned new technology from visiting ets since 1947). either way, it was a ufo, either visiting ets or us government testing of flying saucers. i felt very special, privileged to have been able to see such a sight in my lifetime, although i did not report it for, back then, to make such claims, people thought you a loon. i received confirmation of our sighting a few days later when the local news reported numerous people on the other side of the island (leeward side) reported ufo sightings. it had a great impact on me, causing me to think of it for days, weeks, years on end and, as a result, i believe ets have\\are visiting earth."],"City":"Kaneohe","map":"<A HREF = \"http://maps.google.com/maps?q=21.409167,+-157.799167(6811)&iwloc=A&hl=en\"> mufon case (6811) map </A>","Date Submitted":"11/30/1985 08:00 UTC","Case Number":"6811","files":["/var/www/straped/mufon/html2text/6811.html.txt","/var/www/straped/mufon/org/6811.html"],"Weather Factors":"Unknown","Country":"United States","Object Shape":"Cigar","Region":"Hawaii","Summary":"Cigar-shaped UFO with lights moving very slowly over small mountain ridge, tree line","Tags":"City","Latitude":"21.409167","Longitude":"-157.799167","trends":["There have been 2 other sightings in Kaneohe","There were no other sightings in Kaneohe on or around November 30th 1985"],"Object Features":"Window(s)","Disposition":"Unresolved","Object Flight Path":"Hovering then path","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"11/30/1985 08:00 UTC","Source":"MUFON","Log Number":"US-04132007-0007","Sighting Duration":"Undisclosed"}