{"Country":"United States","Disposition":"Unresolved","Longitude":"-83.377161","Object Shape":"Unknown","Case Number":"6812","Date Submitted":"12/31/1977 09:30 UTC","Weather Factors":"Unknown","Date of the Event":"12/31/1977 09:30 UTC","Latitude":"42.684198","Object Flight Path":"Unknown","trends":["There have been 7 other sightings in Waterford","There were no other sightings in Waterford on or around December 31st 1977"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.684198,+-83.377161(6812)&iwloc=A&hl=en\"> mufon case (6812) map </A>","Source":"MUFON","Tags":"City","Region":"Michigan","Viewing Distance":"21-100 Feet","Sighting Duration":"Undisclosed","City":"Waterford","files":["/var/www/straped/mufon/html2text/6812.html.txt","/var/www/straped/mufon/org/6812.html"],"Summary":"Green, Red, Yellow Flashes. The same as in S. America 1977 on History Channel","Object Features":"Unknown","divs":["Sighting DetailsIt was End of dec. 1977 or 1st of Jan 1978 I was on my snowmobile after taking my girl freind home. I was riding across Lake Oakland when I noticed some lights that seemed to be trailing me off to the side. I slowed down and noticed a Green and Red light that seem to flash intermintantly and every other time there was a yellow light that flashed to. I was going to stop when I noticed a bright blueish white light that seemed to be searching thru the houses and the woods. I came around a section of the lake and there it was 50 feet or less from me. I freaked out and tried to get home all I can remember is a bright light hit me and and it was like a suspended animation I was riding my snowmobile but not going anywhere. All I know is that when I got home it was after midnight and I dropped my girl off at 9 or 9:15 pm and it was less than a twenty min. ride home. This I cant explain. I dont even remember getting home. I know that I had a semi-circular shape mark on my leg with a bunch off little holes that looked exactly like those of the people on the History channel they are showing on Friday night 4-13-07 (South America). The mark is still there puncture marks are hard to see though. After watching that UFO show I figured I should find what I could on the wed and see if anyone was interested in my story since this happened around the same time as what was happenning in S. America 1977. Thanks."],"Log Number":"US-04132007-0008"}