{"Country":"United States","Disposition":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/6817.html.txt","/var/www/straped/mufon/org/6817.html"],"Viewing Distance":"Unknown","Latitude":"30.275883","Weather Factors":"None","Date Submitted":"04/03/2007 01:34 UTC","Region":"Texas","Longitude":"-97.733851","Object Shape":"Disc","Object Flight Path":"Straight-line path","Tags":"City","Summary":"a SILVERISH METALLIC DISC IN THE WESTERN SKY. MOVING WESTWARD THEN STOPPING.THEN STARTING AGAIN.","divs":["Sighting DetailsI was leaving the back of Central Market Westgate Store moving a PowerJack to the other dock when I heard a Jet passing over head. Being a plane lover I naturally looked up and watched a white Fed X plane desending in its flightpath toward Bergstrom International Airport. AS the plane passed through the sky it seemed to pass near a round, bright object. I focused my eyes on this object forgetting about the plane. The object was metallic, round or disc in shape and texture. the sky was a clear blue with very thin clouds at higher levels. The object seemed not to be moving when I first witnessed it then it began to move westward very slowly. At this time my boss S.H. passes by me in the back lot as I am staring at the object and they ask me what I was doing. I responded that I was looking at the disc in the sky. They then proceeded to look for it but by now it had become small in the sky and not as bright. I pointed to it as best I could and they serched the sky till they saw it too. They discribed the same thing I had been watching now for at lest ten minutes. We stood and watched for another five minutes or so till it vanished from sight. There were no lights visible yet it was very bright and metallic. I could see the sunlight reflecting of the side. Silverish and Golden. There was also no sound that I could detect. After the object was gone I went back to work. -Rene Aguirre"],"Log Number":"US-04142007-0005","trends":["There have been 188 other sightings in Austin","There was one other sighting in Austin on or around April 3rd 2007"],"City":"Austin","map":"<A HREF = \"http://maps.google.com/maps?q=30.275883,+-97.733851(6817)&iwloc=A&hl=en\"> mufon case (6817) map </A>","Object Features":"Unknown","Date of the Event":"04/03/2007 01:34 UTC","Case Number":"6817"}