{"Tags":"City","Date Submitted":"04/01/2007 01:45 UTC","Date of the Event":"04/01/2007 01:45 UTC","Disposition":"Unknown","Object Features":"None","Summary":"Metallic sphere hovered and flew over South Austin in mid-day, flashing, no noise, no clouds, very visible.","Case Number":"6818","map":"<A HREF = \"http://maps.google.com/maps?q=30.273443,+-97.740481(6818)&iwloc=A&hl=en\"> mufon case (6818) map </A>","Sighting Duration":"Undisclosed","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around April 1st 2007"],"City":"Austin","Log Number":"US-04142007-0006","Region":"Texas","Source":"MUFON","Latitude":"30.273443","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsI honestly don't know what it was. Around 1:30pm or 1:45om, I was outside of a Pep Boys in South Austin (Texas), in the parking lot, with my boyfriend. We were waiting for the tow truck guy to show up to tow our car back to our house. The sky was a bright, flat blue. Not one single cloud in the sky. And I see this.... thing. This silver thing hanging in the sky. I laughed and poked my boyfriend in the arm, then pointed at it, saying \"Think it's a UFO?\" we both laughed a little, but... the more we watched it, the more we couldn't dismiss the idea. We stopped laughing and watched it. First of all, it was VERY high up in the sky. Higher than you normally see birds for sure. And even if a bird WAS up that high, it wouldn't be anywhere near as large as the thing. Definitely bigger than a balloon. I'd wager to say it was bigger than a car. Second, it was silver. It was obviously silver, and highly reflective. It kept kind of \"twisting\" in the air. As we watched this thing, we began describing it outloud, planning what I would report seeing. I said that the way it was flashing--brilliantly flashing--was like a coin flipping in the air. My boyfriend shouted \"Yes!\" It kind of pulsed with reflected light, and my he remarked that it looked like it was doing it rhythmically, in a pattern. Not erratic. It was most certainly round in shape, no visible fins or wings... In fact, we were certain it wasn't an airplane, because shortly after we spotted it, a large white passenger plane flew near it. To me, from where I was standing beneath it, it appeared that the object was closer to the ground than the plane. And if so, and if it was a plane, shouldn't it have been clearly definable as such? The plane made a loud noise, but the object made no noise at all. We watched this thing, transfixed, as it moved in a straight line against the wind, appearing to go West. Then it paused. Then continued to move West. I watched it until I could no longer see it anymore. At its furthest distance, when I could no longer see the object properly, I could still see the bright flashing. I'm interested in seeing if anyone else in Austin reports seeing what I saw."],"Object Flight Path":"Straight-line path,Path then hovering","Country":"United States","Longitude":"-97.740481","files":["/var/www/straped/mufon/html2text/6818.html.txt","/var/www/straped/mufon/org/6818.html"],"Weather Factors":"None","Object Shape":"Sphere"}