{"Sighting Duration":"Undisclosed","Country":"United States","City":"Undisclosed","Source":"MUFON","Tags":"City","Object Flight Path":"Hovering then path","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.787221,+-119.416382(6819)&iwloc=A&hl=en\"> mufon case (6819) map </A>","Case Number":"6819","Summary":"looked like a red balloon","Latitude":"36.787221","Date of the Event":"04/14/2007 03:30 UTC","trends":[""],"Longitude":"-119.416382","divs":["Sighting DetailsI was getting my car washed at the Eldorado car wash in laguna niguel. I was standing outside scannning the sky (as i always do) looking for ufos'. When i saw a red baloon high up in the (as high as the low clouds maybe 1000ft) at first I thought I saw a ribbon dangling down from the balloon and said to myself \"well that one is a balloon for sure I can even see the string on it\" it was gently floating across the sky just like you would expect a balloon to do. Then I took my eyes off it to see how my car was doing and when I looked back it was gone. I couldn't find it for a minute and then I saw it way far away from where it had been. And I began to get more interested in it because I didn't the wind could have blown it that far, and as I watched I notice it was no longer moveing it seemed to be stationary but slowly getting smaller. At that point I called My wife and told her I was watching a possible ufo. Then It dissappeared behind a cloud. I had been standing away from most of the other people waiting for thier cars. I now moved closer to the crowd and leaned on a rail still scanning the sky which was partialy cloudy and I caught sight of it again directly over the car wash now and there was two of them. There was a woman in front of me reading a book and I said to her \"excuse I would like someone else to witness that there is something strange up in the sky\" and pointed out the two red balloons that were above the carwash (I still wasn't sure what they were so I was to embarrased to say \"oh look ufos\") and she looked up at them and went right back to book. Then I remembered my cell phone camera and set it up to take pictures and when it was ready to go, they were gone, but my car was ready so I went back home. I got my camera and took my wifes car down to be washed (it took me about 40 minutes home and back) I didn't think it would still be there but it was and I got these photos and a short video. if you zoom in on these pictures you can see an aura around the balloon."],"Object Features":"None","Date Submitted":"04/14/2007 03:30 UTC","Disposition":"IFO","Region":"California","Object Shape":"Circle","Log Number":"US-04152007-0001","files":["/var/www/straped/mufon/html2text/6819.html.txt","/var/www/straped/mufon/more/6819_submitter_file1__Picture005.jpg","/var/www/straped/mufon/more/6819_submitter_file2__Picture010.jpg","/var/www/straped/mufon/more/6819_submitter_file3__Picture011.jpg","/var/www/straped/mufon/org/6819.html"],"Viewing Distance":"501 Feet - 1 Mile"}