{"Country":"United States","divs":["Sighting DetailsIt was about 9:15pm when i went outside, because i wanted to look at this star, which i think is a planet, to the West sky. so i was sitting in a chair looking in the west sky because it was so clear that night, And i remember telling myself that it would be strange if i saw something tonight because there was little league baseball at the park which made me feel like no one would of even seen the stars due to the field lights!. well about 10, 15 minutes go by and i tell myself to go inside but to the other way around my house that way on the way in i could see that star before i go inside. Alright well a soon as i turn around i start walking around the other side of my house and with the corner of my right eye i see some red pulsing lights, threw my neighbors trees. and i tell myself what the heck , and across the street my other neighbor is pulling in her drive way , and i say i don't care im gonna look at this thing. well to get a better view i have to walk to my curb, i was looking the whole way and it was so slow , no sound , just 2 red pulsing lights at the same time , it was like floating north then it make like a quick jump and shifted directly east and the lights weren't as clear anymore i thought my eyes were straining , then as it floated away east , threw each pulse the 2 lights were getting closer together i took 3 pulse's for the 2 lights to become 1 light. After i saw that happen it seemed like the object was far away but it didn't look like it, it was the lights fading slower and slower to nothing! i ran inside to tell my brother and step dad because i know i had just seem something in the sky that is rare i saw it transform who knows. my eyes were teary i was so shocked and sure and straight serious. i went back out with my step dad's video cam. and stayed outside to try to get it on tape but it never came around. this was my sighting i hope u refer it. and thank you for hearing my sighting."],"Case Number":"6820","Latitude":"31.976529","Region":"Texas","Date of the Event":"04/13/2007 09:30 UTC","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=31.976529,+-99.893593(6820)&iwloc=A&hl=en\"> mufon case (6820) map </A>","trends":["There have been no other sightings in Bruni & Realitos same dis","This sighting has never been favorited."],"Summary":"I was walking back inside my house when 2 red pulsing lights caught my eye big lights and pretty far apart .","Date Submitted":"04/13/2007 09:30 UTC","Object Shape":"Oval, Star-like","City":"Bruni & Realitos same dis","files":["/var/www/straped/mufon/html2text/6820.html.txt","/var/www/straped/mufon/org/6820.html"],"Object Flight Path":"Path with directional change","Log Number":"US-04152007-0002","Tags":"City","Source":"MUFON","Longitude":"-99.893593","Sighting Duration":"Undisclosed","Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"None"}