{"Sighting Duration":"00:03:30","Country":"United States","files":["/var/www/straped/mufon/html2text/6821.html.txt","/var/www/straped/mufon/org/6821.html"],"Object Features":"Unknown","Region":"Wisconsin","Date of the Event":"04/14/2007 08:50 UTC","Source":"MUFON","Viewing Distance":"101-500 Feet","Object Shape":"Triangle","Disposition":"Unknown","Tags":"City","City":"Darlington","map":"<A HREF = \"http://maps.google.com/maps?q=42.683057,+-90.117626(6821)&iwloc=A&hl=en\"> mufon case (6821) map </A>","Latitude":"42.683057","trends":["There has been one other sighting in Darlington","There were no other sightings in Darlington on or around April 14th 2007","This sighting has never been favorited.",""],"divs":["Sighting Details Last night ( April 14th 2007) my boyfriend and I were driving from Dubuque, Iowa going to a relatives house in Darlington, Wisconsin I was on the passengers side of the car and my boyfriend was driving. We were ten minutes away from darlington when I saw an extremely bright light about 1 or 2 miles ahead of me on my right side. I had no idea what it was but I knew it wasn't a plane because it was way to bright and not moving that fast. Whatever it was was going in the opposite direction as we were. As the we drove closer to the light we were at an angle where we were looking at the bottom of some kind of triangular flying craft, there were three white lights, one in the front of the craft and two in the back, in between the two back light was a flashing red light. I'm assuming the rest of the craft was black because the sky was pitch dark and all I could see were the lights. When I was looking up at the craft I was scared and in shock, for some reason I wanted to hold my stomach, probably to protect my unborn child. I couldn't stop looking at it, but when i couldn't see the lights anymore I got really scared and told my boyfriend to speed up. The craft didn't seem to move fast it was going about the same speed we were, when we were at the same point it was it was moving slowly kind of hoovering. I tried to take a picture with my cell phone but there wasn't enough light and the craft was to far away. I kept staring at it until I couldn't see the lights anymore."],"Longitude":"-90.117626","Summary":"triangular craft with 3 white lights and a flashing red light","Date Submitted":"04/14/2007 08:50 UTC","Log Number":"US-04152007-0003","Case Number":"6821","Weather Factors":"None, Does Not Apply","Object Flight Path":"Path with directional change,Path then hovering"}