{"Latitude":"41.581812","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Straight-line path,Path with directional change","Log Number":"US-04152007-0005","Tags":"City","Longitude":"-93.707602","Summary":"It was a moving \"star\" or space lab but then quite suddenly stopped!","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/6823.html.txt","/var/www/straped/mufon/org/6823.html"],"Date Submitted":"07/04/1999 09:15 UTC","trends":["There have been 5 other sightings in West Des Moines","There were no other sightings in West Des Moines on or around July 4th 1999"],"Date of the Event":"07/04/1999 09:15 UTC","Region":"Iowa","divs":["Sighting DetailsMy wife and I were attending the annual fire works show at the local city park. After parking our car we got our lawn chairs out and were commenting to some other people near us what gorgeous weather it was for a fire works show. As I was looking up at the cloudless sky, I noticed a moving \"star\" that appeared to be the space lab. I commented that \"the space lab must be moving directly over Iowa at the time\". Then while trying to fix my wife's attention on the object, it STOPPED! I'm just smart enough to know that \"stars\" and space objects do not stop their forward motion and pointed it out to several other people within ear shot. I continued to watch it to see if it would continue to move but \"stars\" don't just start and stop and neither do orbiting space vehicles. I must admit that it was completely dark by this time and my gaze did wander to the remaining fire works show for no more than 5 minutes. With completion of the show my line of sight was directed back to the \"star\" that quit moving and within no more than 2 to 3 minutes, it suddenly moved ....but at a 90 degree angle to what it had been traveling when I first noticed it. Originally, it had moved in an easterly direction prior to stopping but the second move was directly northbound. My wife and I spoke about it but she poo-pooed it as just my imagination but I know what I saw and to this day, I'm convinced I witnessed something out of the ordinary that evening. When the object did finally depart northbound (at a VERY HIGH ALTITUDE)it moved out of my line of vision within 2 to 3 seconds. This thing really moved!"],"Viewing Distance":"Unknown","Source":"MUFON","Disposition":"Unknown","City":"West Des Moines","map":"<A HREF = \"http://maps.google.com/maps?q=41.581812,+-93.707602(6823)&iwloc=A&hl=en\"> mufon case (6823) map </A>","Weather Factors":"Unknown","Case Number":"6823","Country":"United States"}