{"divs":["sighting detailsme and a friend were traveling east by car on 143rd street around 84th ave. when suddenly i saw something move across the night sky. before i could even open my mouth to tell my friend about it he said, \"oh my god, did you see that?\" it was a very clear night, my car said it was 41 degrees f, and we could even see some stars (very rare for orland park). what we both saw was like a shooting-star but what made it completely different was it's speed and color. it was an aqua-marine\\teal color and when it went across the sky it didn't leave a trail, like a shooting star does. it traveled across a huge amount of sky in a pretty straight line in less than a second, but it was bright enough for both of us to see it. after a second it just disapeared in the sky. my first thoughts were extraterrestral because i am unaware of anything man made that can cover such a large amount of sky in a second. i am unhappy that it was such a short experiance because my friend and i might have been the only ones on the road who saw it, although i wasn't looking at the sky and it grabbed my attention easily. if anyone else saw this please let me know."],"Log Number":"US-04152007-0006","Longitude":"-87.853942","Source":"MUFON","Region":"Illinois","Object Shape":"Bullet, Missile, Sphere, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=41.63031,+-87.853942(6824)&iwloc=A&hl=en\"> mufon case (6824) map </A>","Object Flight Path":"Straight-line path","Sighting Duration":"00:00:01","trends":["There have been 4 other sightings in Orland Park","There were no other sightings in Orland Park on or around April 14th 2007","This sighting has never been favorited.",""],"Date of the Event":"04/14/2007 11:45 UTC","Latitude":"41.63031","Weather Factors":"None","Summary":"an object that covered a large area of sky in less than a second","Object Features":"Unknown","Country":"United States","Disposition":"IFO","Tags":"City","files":["/var/www/straped/mufon/html2text/6824.html.txt","/var/www/straped/mufon/org/6824.html"],"Case Number":"6824","Viewing Distance":"Unknown","Date Submitted":"04/14/2007 11:45 UTC","City":"Orland Park"}