{"Date of the Event":"04/15/2007 09:42 UTC","Date Submitted":"04/15/2007 09:42 UTC","Object Flight Path":"Straight-line path","Longitude":"-117.179616","Source":"MUFON","Summary":"Object passing west to east through clear sky","Region":"Washington","map":"<A HREF = \"http://maps.google.com/maps?q=46.731274,+-117.179616(6826)&iwloc=A&hl=en\"> mufon case (6826) map </A>","Latitude":"46.731274","Log Number":"US-04162007-0002","Object Shape":"Star-like","Country":"United States","Object Features":"Unknown","Tags":"City","trends":["There have been 3 other sightings in Pullman","There were no other sightings in Pullman on or around April 15th 2007"],"Disposition":"IFO","Weather Factors":"None","Sighting Duration":"00:00:45","Viewing Distance":"Unknown","divs":["Sighting DetailsI was sitting on my porch at 21:42 lighting a cigarette, looking towards the North West, observing the stars in the exceptionally clear sky. A moving object, appearing star like, caught my attention just above the western horizon, tracking eastward in a straight line. The object was in the sky at about a 45 degree angle. The object appeared much brighter than any stars in the sky, and had just a hint of orange to it. As the object tracked through the sky to the point due north of my position, it started to fade in brightness, quickly disappearing all together as it hit a point north by north east in the sky. This event lasted no more than 45 seconds. I had thought at first the object may have been an airplane. Due to the fact that there were no flashing marker lights which should have been clearly visible considering the brightness of the object, and there was absolutely no sound of engines either jet or propeller, I dismissed the notion of an airplane. Secondly I thought of the object as a satellite, but due to the exceptional brightness and lack of clouds for it to disappear behind, I also dismissed that idea. Finally, I had considered a shooting star, and also dismissed that idea since there was no trail produced by the object. It was not until the object rapidly faded and ultimately disappeared from sight that I began to consider the idea of a UFO. Given my quiet country location, and having 3 airports and an airforce base all within 100 miles, I have the opportunity to see and hear many objects passing through the skies during the day and at night. The utter silence I think is what ultimately brought me to the decision to file a report. Never before on such a quiet, windless, and clear night have I seen something of this nature."],"files":["/var/www/straped/mufon/html2text/6826.html.txt","/var/www/straped/mufon/org/6826.html"],"City":"Pullman","Case Number":"6826"}