{"Region":"Indiana","Object Features":"Unknown","Case Number":"6831","Summary":"Boomerang Shaped Opaque in color and silent","Country":"United States","Sighting Duration":"Undisclosed","Object Shape":"Boomerang","Object Flight Path":"Path with directional change","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Date of the Event":"04/16/2007 11:39 UTC","Disposition":"Unknown","Date Submitted":"04/16/2007 11:39 UTC","trends":["There have been 126 other sightings in Indianapolis","There were no other sightings in Indianapolis on or around April 16th 2007","This sighting has never been favorited.",""],"Longitude":"-86.154114","divs":["sighting detailson monday, april 16th at approximately 11:39 pm est i was standing on the deck at my home on the east side of indianapolis. the back of my home faces south, i was facing north towards the back of my house and as i was talking to my fiance' on the phone i noticed an inbound commercial aircraft coming towards me from the northeast, on approach to indianapolis international airport, at approximately 2000-3000 feet(we see a lot of commercial air traffic both inbound and outbound since we are inside the 465 beltway). as i glanced up at the aircraft passing overhead i noticed what appeared to be an opaque boomerang shaped object passing just underneath the commercial jet, from south to north in a straight line, very quickly and quietly. the object was unlit and had no distinguishing markings. the shape of the object was one large eliptical in the front but the wings were semi elipticals on each side meeting in the middle. compared to the size of the jet passing over, it was approximately 1\\3 the size at that altitude although i cannot determine the actual distance the object was from the aircraft. the color of the sky was a light bluish haze because of the amount of light pollution from the ground but the skies were clear and starry so the object was clearly visible. as the object quickly passed overhead just north of my home it made a very sharp right turn at almost 90 degrees and sped off towards the east in the general direction of greenfield, indiana. i lost contact of the object due to extreme light pollution on the horizon in that direction. the entire event occurred in just a matter of seconds. i was in shock and couldn't believe what i had just witnessed and as i spoke to my fiance' i conveyed to her those exact details. i'm a navy vet of 21 years and have seen a lot of aircraft from all the branches of the military and i worked for the department of homeland security, transportation security administration at indianapolis international airport and have obseverd numerous civilian aircraft as well and this was like nothing i've ever seen. i don't know if anyone else in the area has seen anything like this or if any reports have been made since i feel fortunate to have seen it based on the objects nearly transparent appearance."],"City":"Indianapolis","files":["/var/www/straped/mufon/html2text/6831.html.txt","/var/www/straped/mufon/more/6831_submitter_file1__boomerang001.jpg","/var/www/straped/mufon/more/6831_submitter_file2__6boomerang001.jpg","/var/www/straped/mufon/org/6831.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.771916,+-86.154114(6831)&iwloc=A&hl=en\"> mufon case (6831) map </A>","Tags":"City","Log Number":"US-04172007-0001","Latitude":"39.771916","Weather Factors":"None"}