{"trends":["There have been 4 other sightings in Bemidji","There were no other sightings in Bemidji on or around April 15th 2007"],"Sighting Duration":"Undisclosed","City":"Bemidji","Disposition":"Insufficient Data","divs":["Sighting DetailsI was standing outside with a group of friends and family. We were all standing around my dad's friends van. Well I happened to turn around. And look to my right. I look in the sky everynight just to look up there. I love the stars. I thought when I first seen it. \"This is not normal!\" I told my cousin \"Do you see that out there?\" He said \"Yea!\" I said \"I wonder what that is.\" everyone seen it too. I knew than it couldn't be no airplane or anything like that. I went closer to the road to look. And you can see a redlight flashing on it. My cousin got some binoculars, being that hes taller than me. He went stood on the road to get a better look. And he said it had a cone. So we knew it wus triangular. And he also said he can see that redlight flashing clearly. I could too. Because when we'd just stare at it. That little part would really light up into red. This thing was orange, or it almost look like a carlight with a redlight blinking under it. When I first seen it I was amazed, wasn't scared or anything. I kept a real close eye on it. I remember as we walked to the road, that's when it start fading away. I was thinking whatever it was, knew were watching it out there. Somebody said this might be a local satellite from a military base. But who knows. I don't know what this object was, but it sure was interesting. I watched this thing slowly fade away til it was a little dot in the sky, & I couldn't see it nomore, So I jus came inside for the rest of the night. That was amazing whatever it was. Thanks for reading my story!"],"Tags":"City","Longitude":"-94.876208","files":["/var/www/straped/mufon/html2text/6836.html.txt","/var/www/straped/mufon/org/6836.html"],"Latitude":"47.476611","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=47.476611,+-94.876208(6836)&iwloc=A&hl=en\"> mufon case (6836) map </A>","Source":"MUFON","Case Number":"6836","Date Submitted":"04/15/2007 12:02 UTC","Object Features":"Undisclosed","Summary":"Whatever it was. Was in the sky for 20 minutes & 10 minutes into watching on it. It shifted.","Date of the Event":"04/15/2007 12:02 UTC","Viewing Distance":"Unknown","Object Shape":"Circle, Flash, Triangle","Log Number":"US-04172007-0005","Country":"United States","Region":"Minnesota"}