{"Region":"Washington","divs":["Sighting DetailsSky conditions were mostly clear with scattered clouds in the vicinity. The lighting was twilight and visibility was at least 30 miles. I was looking south toward Whidbey Island NAS through a pair of 30x77 astronomical binoculars. I had spotted a very bright red blinking light moving very slowly in an easterly direction. At first I thought I was looking at a military helicopter that was flying in the vicinity of the Naval Air Station. But the longer I looked at the object through my binoculars I realized it wasn't a helicopter as I had never seen aircraft with the lighting configuration I was looking at. I am a commercial pilot with 23,000 hours in airline operations and am familar with aircraft lights. This object had a very bright red blinking light and below the red light there was some structure that separated the red light from a dimmer smaller steady white light. Red and green navigation lights were not seen. The other thing that was strange was the flight path the object was following. When I first spotted the object it was west of the NAS and was flying in an easterly direction. It was moving vey slowly in a very slight sine wave type motion. After watching it for about five minutes it suddenly stopped, immediately reversed direction and shot straight up a few hundred feet, then stopped again and sat motionless for a few moments. Then what it did next really got my attention. It accelerated very rapidly in an easterly direction to a position that almost put it out of my sight behind a hill. It stopped suddenly, sat motionless for a few seconds and resumed a slow steady flight in an easterly direction when it disappeared from my view behind a hill. The next thing I noticed was a fast flying aircraft departed Whidbey NAS and immediately turned to fly a course south that put it in the vicinity of where I had initially spotted the object. I could not tell how far the object was from my position, what it's approximate size was, or even what altitude it was at. But at the time I estimated that it was several miles south of the NAS and was quite low to the ground. I did notice that when it accelerated rapidly to the east I noticed a very small dim whit light appear in front of the red blinking in the direction it was flying and when the object suddlenly stopped I didn't notice the small white light anymore. Also, the aircraft that had departed Whidbey NAS appeared to fly a straight course to the southeast in the general vicinity of where I had seen the object but it continued flying a steady course but did not appear to climb very high it eventually flew out of sight."],"files":["/var/www/straped/mufon/html2text/6841.html.txt","/var/www/straped/mufon/org/6841.html"],"trends":["There have been 27 other sightings in Bellingham","There were no other sightings in Bellingham on or around April 16th 2007"],"Summary":"Very bright red blinking light on top of smaller white steady light","map":"<A HREF = \"http://maps.google.com/maps?q=48.762323,+-122.481285(6841)&iwloc=A&hl=en\"> mufon case (6841) map </A>","Disposition":"Unknown","Log Number":"US-04182007-0004","Case Number":"6841","Date Submitted":"04/16/2007 09:30 UTC","Date of the Event":"04/16/2007 09:30 UTC","Latitude":"48.762323","Weather Factors":"Unknown","Object Features":"Unknown","Source":"MUFON","Longitude":"-122.481285","Object Shape":"Unknown","Country":"United States","Object Flight Path":"Path with directional change,Path then hovering","City":"Bellingham","Tags":"City","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed"}