{"Sighting Duration":"00:00:30","Tags":"City","Object Flight Path":"Straight-line path","Source":"MUFON","Date Submitted":"04/14/2007 11:30 UTC","Date of the Event":"04/14/2007 11:30 UTC","Log Number":"US-04192007-0001","Summary":"Orb seen zipping around while I was driving towards Annapolis.","Object Shape":"Sphere","Object Features":"Other","Disposition":"Unknown","Longitude":"-76.486543","map":"<A HREF = \"http://maps.google.com/maps?q=38.982945,+-76.486543(6842)&iwloc=A&hl=en\"> mufon case (6842) map </A>","Viewing Distance":"101-500 Feet","Country":"United States","Region":"Maryland","files":["/var/www/straped/mufon/html2text/6842.html.txt","/var/www/straped/mufon/more/6842_submitter_file1__463524666_43fae7b635_b.jpg","/var/www/straped/mufon/more/6842_submitter_file2__22222.jpg","/var/www/straped/mufon/org/6842.html"],"Weather Factors":"Unknown","City":"Annapolis","divs":["Sighting DetailsI was driving towards Annapolis, MD on US Route 50 East at 10:30 am on April 14th it was sun shining, clear and cold outside. I looked up to my 1:00 position and saw something flash. So I bent down a little to get a better look and I saw an orb just hovering in the sky. As I was watching, it immediately zipped from the 1:00 position to the 4:00 position in a split second and stopped dead in it's tracks. It happened extremely fast and moved roughly 500 yards south in a split second. It was now in my 3:00-4:00 position. I happened to have my digital camera with me and using fast thinking I grabbed it and snapped a quick photo. The Orb made no noise, nothing was seen around it and it was just hovering in the sky. It isn't a weather balloon because balloons don't move like that, nor was it a plane or bird or blimp. I pulled off at an exit about 3 to 5 miles outside of Annapolis near a town called Crownsville, MD and got out. I didn't see the object any longer. I got home and checked my camera and sure enough, there it was. My windshield is dirty, so I put a red arrow pointing out the object. Otherwise, the picture has not been edited or enhanced in any way. Keep looking up !"],"Case Number":"6842","Latitude":"38.982945","trends":["There have been 14 other sightings in Annapolis","There were no other sightings in Annapolis on or around April 14th 2007","This sighting has never been favorited.",""]}