{"Tags":"City","Date of the Event":"11/30/1974 12:00 UTC","divs":["Sighting DetailsIN THE MID 1970'S YEAR AND TIME UNSPECIFIED BY THE WITNESS THEY SAW A MOON SIZED OBJECT THAT APPEARED OUT OF THE SKY AND DESCEDED HOVERING WITHIN 10 FEET ABOVE THE CAR. ROUTE 31 SANBORN NY. THE INDIVIDUAL WAS VERY NERVOUS DISCUSSING THE INCIDENT.NO ELECTROMAGNETIC EFFECTS REPORTED. THE CAR WORKED FINE. THEY WERE TERRIFIED OF THE OBJECT. THE SIGHTING TOOK PLACE WHERE NCCC PROPERTY IS LOCATED TODAY.THE OBJECT DESCENDED, WAS STATIONERY HOVERING ABOVE THE CAR-THEN TOOK OFF STRAIGHT INTO THE AIR. THE INDIVIDUAL WAS HIGHLY AGITATED OVER THE EVENT SIGHTING FAMILY RIDICULE. STILL IS AFRAID OF THE FAMILY RIDICULE STATING THE MOTHER WAS VERY DIFFICULT TO DISCUSS THE EVENT WITH AND VERBALLY ABUSIVE IN RIDICULE. THIS PERSON ATTENDED A SPEAKER PRESENTATION BY STANTON FRIEDMAN WHEN THEY DECIDED TO DISCUSS THE EVENT WITH ME. THIS EVENT WAS NOT THE FIRST SIGHTING. THERE WAS ANOTHER SIGHTING OF A \"DWARF PLANE\" THEY HAD SEEN IN THE PAST. I GAVE THEM MY NUMBER TO DISCUSS THE EVENT FURTHER. NO OTHER CONTACT BY THIS PERSON HAS BEEN MADE TO DISCUSS THE SIGHTING. THEY WERE UNABLE TO GIVE ME A PROPER DISCRIPTION OF THE OBJECT THOUGH IT WAS 10 FEET FROM THEM. JUST SAID IT LOOKED LIKE A SMALL PLANE.I HAVE QUESTIONS ABOUT THIS CASE ESPECIALLY SINCE THE FEAR FACTOR WAS SO PREVALENT. OF ALL THE PEOPLE I HAVE EVER SPOKEN TO ABOUT SIGHTINGS THIS PERSON WAS THE MOST NERVOUS HAVING A HIGH DEGREE OF FEAR AND ANXIETY EXHIBITED IN HER FACE, BODY LANGUAGE AND SPOKEN COMMUNICATIONS."],"Object Features":"Undisclosed","Viewing Distance":"20 Feet or Less","files":["/var/www/straped/mufon/html2text/6846.html.txt","/var/www/straped/mufon/org/6846.html"],"Disposition":"Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Longitude":"-78.884807","Weather Factors":"Unknown","Source":"MUFON","City":"SANBORN","Country":"United States","Summary":"SIGHTING OF OBJECT SEEN AT NCCC COLLEGE 10 FEET FROM CAR","Date Submitted":"11/30/1974 12:00 UTC","Region":"New York","map":"<A HREF = \"http://maps.google.com/maps?q=43.137194,+-78.884807(6846)&iwloc=A&hl=en\"> mufon case (6846) map </A>","Sighting Duration":"Undisclosed","Latitude":"43.137194","Case Number":"6846","Log Number":"US-04192007-0005","trends":["There has been one other sighting in SANBORN","There were no other sightings in SANBORN on or around November 30th 1974"],"Object Shape":"Circle, Unknown"}