{"Longitude":"-58.430248","divs":["Sighting DetailsI have recently photographed a UFO in a series of images. The sighting ocurred on Wednesday the 4th at aprox. 5PM. The sighting lasted over 7 to 10 seconds. The object descrived a circular flying pathern. I am located in Buenos Aires, Argentina. I do not know who to send the images to. I am confident the object appearing in the images its an aircraft, not a spaceship. If you are not interested in the images please let me know who can I contact. I already talked to Dick Knapinski from EAA ( dknapinski@eaa.org). He said he was not able to identify the aircraft and that I should contact a more resoursefull organization (Yours). Please let me know about this. I will be sending some images. The rest of them, I will hold in case its something important. Please do not share it or publish it without my consent or permition whatsoever. I would really apreciate your insight regarding this. Looking forward for some answers, Thanks in advance and best wishes, Gaston. 1 - we were taking pictures (with my girlfiend) together (It was a lovely clear afternoon and suitable for it). we were at my home. 2 - My girlfriend saw it first and made me notice it. 3 4 - A spaceship. However after a couple of seconds I believed it was an experimental aircraft since it had numbers or simbols written on one of the sides and also a very strange camouflage pattern on the top side of it. It was flying at the same speed commercial planes usually do (I have an airport next to my city (aiport international code: EZE) and planes usually fly above my house in an approach pattern). The object described an S pattern above us. At a certain moment, it speed decreased drastically but I was not able to take pictures of that moment since I stopped to watch (not through the camera lens for a better look), however during this moments the object kept its current altitude. 5 - First my girlfriend got anxious since she believed it was the falling piece of a plane. However we soon realize it was not and we were very curious about it. At a certain moment I got really exited since I believed it was a spaceship. But everything on it made me believe it was \"human made\" if you wish. 6 - After describing the S manouver, it flew out of my field of view (I have my house roof covering most of my sky view)."],"Date of the Event":"04/04/2007 05:00 UTC","Weather Factors":"Unknown","Viewing Distance":"Unknown","Date Submitted":"04/04/2007 05:00 UTC","Log Number":"AR-04192007-0006","Summary":"Object descrived a circular flying pathern.","Sighting Duration":"00:00:09","Source":"MUFON","Case Number":"6847","trends":["There have been no other sightings in Lomas de Zamora","This sighting has never been favorited."],"Tags":"City","Object Flight Path":"Path with directional change,Path then hovering","Object Features":"Patterned Surface, Insignia","Region":"Buenos Aires","Object Shape":"Bullet, Missile, Other, Unknown","Latitude":"-34.761182","Country":"Argentina","City":"Lomas de Zamora","files":["/var/www/straped/mufon/html2text/6847.html.txt","/var/www/straped/mufon/more/6847_submitter_file1__OVNI_003.jpg","/var/www/straped/mufon/more/6847_submitter_file2__OVNI_005.jpg","/var/www/straped/mufon/more/6847_submitter_file3__OVNI_012.jpg","/var/www/straped/mufon/org/6847.html"],"Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=-34.761182,+-58.430248(6847)&iwloc=A&hl=en\"> mufon case (6847) map </A>"}