{"Tags":"City","Region":"Washington","Longitude":"-122.652676","divs":["Sighting DetailsI was setting up to take a series photos of the moon and venus setting over the horizon from my deck. I was planning on experimenting with photo overlays as I just purchased the new Adobe CS3 and am new to photoshop and was going to use this series of photos to learn how to use it. I took about 20 shots with Canon EOS 5D digital SLR. I have not used the RAW format in my camera so was this was going to be a learning experience for me. Camera was set on tripod with shutter release attached. Camera settings were ISO 1600, aperature 4.0, and shutter speed 2 seconds. I took one picture every 3 minutes to document the moon and Venus setting over the tree line. On the 6th photo, as I opened the shutter, something flew into the frame from the right. Moving right to left. I immediately thought this was an airplane and it was going to ruin the shot. I decided I would wait until the object moved across the frame and immediately take another one. Unexpectedly, the object just disappeared. There was no evidence of it anywhere, the object only made it as far as what is seen in the photo and then nothing, I scanned the sky and no planes were visible anywhere in the vicinity. By all rights this should be an airplane as this would be close to the flightpath of planes going from Seattle to Portland (Horizon Air flys these). The only thing that made this strange was its sudden disappearance shortly after the shutter closed. Also, in reviewing the photo, the flight path doesn't match up to the normal path of the Seattle to Portland flights (in hind-sight, I'm wishing I had set a quicker shutter speed setting). The photos attached are unaltered. The .CR2 format is in RAW directly from my Canon camera, while the .jpg is converted directly from photoshop. The time stamp on the photo is one hour early from that listed in the event time as I had not changed the time setting on my camera from daylight savings yet. (event occured at 9:05 Pacific). Mark Sikkema"],"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.639958,+-122.652676(6848)&iwloc=A&hl=en\"> mufon case (6848) map </A>","Disposition":"Unknown","Country":"United States","Source":"MUFON","Summary":"Object entered into still frame photo then immediately disappeared","Date Submitted":"04/19/2007 09:05 UTC","City":"Vancouver","Object Flight Path":"Straight-line path","Weather Factors":"None","Viewing Distance":"Over One Mile","Case Number":"6848","Sighting Duration":"00:00:04","trends":["There have been 54 other sightings in Vancouver","There were no other sightings in Vancouver on or around April 19th 2007","This sighting has never been favorited.",""],"Log Number":"US-04202007-0001","Object Shape":"Cigar, Disc","Latitude":"45.639958","Date of the Event":"04/19/2007 09:05 UTC","files":["/var/www/straped/mufon/html2text/6848.html.txt","/var/www/straped/mufon/more/6848_submitter_file2__Venus-Moon-6.jpg","/var/www/straped/mufon/more/6848_submitter_file5__UFO-comments.jpg","/var/www/straped/mufon/org/6848.html"]}