{"Viewing Distance":"Over One Mile","Source":"MUFON","Object Shape":"Boomerang, Cigar, Triangle, Other","Disposition":"Unknown","trends":["There have been 9 other sightings in St Clair Shores","There were no other sightings in St Clair Shores on or around April 19th 2007"],"Date of the Event":"04/19/2007 09:20 UTC","Latitude":"42.49801","Sighting Duration":"00:01:00","Longitude":"-82.886254","Date Submitted":"04/19/2007 09:20 UTC","Country":"United States","City":"St Clair Shores","files":["/var/www/straped/mufon/html2text/6849.html.txt","/var/www/straped/mufon/org/6849.html"],"Summary":"Stationary triangle banked in front of us then glided away","Log Number":"US-04202007-0002","Tags":"City","Weather Factors":"Unknown","Object Features":"Wings, Other","map":"<A HREF = \"http://maps.google.com/maps?q=42.49801,+-82.886254(6849)&iwloc=A&hl=en\"> mufon case (6849) map </A>","Case Number":"6849","Object Flight Path":"Hovering then path","divs":["Sighting DetailsIt was a nice clear night on the east side of Detroit, the moon was waxing in the west. I had just picked up my friend from his house, and as we turned a corner looking ESE we simultaneously said \"Whoa!\". Nearly stationary in front of us at about 1,000 feet over Lake St. Clair was a formation of lights. There were 5 of them in a line at about a 45 degree angle, as if an airliner was banking in front of us with an array of lights on it's wings. The center light was the brightest. We followed the same direction and watched as the craft banked north to our left and it's bottom faced us. What we both saw was a triangle of yellow lights with a white flashing light at it's rear. As it headed north, light after light went out until there were two blue lights at it's tips and then it disappeared past the trees faster than we could keep up with it. I spend a lot of time looking at the sky. We have a couple major airports in our area as well as a National Guard Base. I have seen a lot of lights from all kinds of aircraft, and this was the first time I've looked up and questioned anything I have ever seen before. My friend was in as much surprise as myself. It defied all logic of modern aircraft that I have witnessed. It was as large as a 747, yet behaved like a slow helicopter with no sound. I would love to know if anyone else in the area saw anything similar."],"Region":"Michigan"}