{"Object Features":"None","Sighting Duration":"00:00:53","Weather Factors":"Unknown","Date of the Event":"10/14/2004 04:15 UTC","City":"Mineola","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-95.48564","Date Submitted":"10/14/2004 04:15 UTC","Summary":"no sound,wings,windows,stabilizer,engines,traveling north to south at1500 to2000 ft about 250 mph . t","Case Number":"6853","Region":"Texas","files":["/var/www/straped/mufon/html2text/6853.html.txt","/var/www/straped/mufon/org/6853.html"],"divs":["Sighting Details I was sitting on the deck facing South on a beautiful cloudless October 14th 2005 day. When I turned my head to the left which would be to the East Northeast I saw this football shaped shinny object moving North to South at about 200 mph and at a hight of about 1500 to 2000 ft. It was flying at a level which was constant and was totally silent. It was going so slow that I had time to call my wife out to see it which she did. I asked her what that was and she said \"I don't know but it's not and airplane\". It was only visable for about a minute but it was close enough to us that we could see that it had no wings ,windows,engines,and made absolutely no sound.It just flew out of sight. In October of 2006 on a clear day I was sitting on the same deck and looking South I saw the contrail of a very high flying plane. It was so high that I could not see the aircraft so I went into the house and brought out my binoculars to see what kind of plane it was. As I was looking at the plane this very same football shaped craft flew through my field of vision going very, very, fast and upwards at about 15 degrees.In my estimation it was going between 3 and 4 thousand mph and was traveling North to South. It was an impressive thing to watch. If we have any craft like these then we should not be going into space on the shuttle. I might add also that I worked for a major airline for 27 yrs and am quite familiar with many kinds of aircraft and their characteristics including the SST."],"Object Flight Path":"Straight-line path","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.665418,+-95.48564(6853)&iwloc=A&hl=en\"> mufon case (6853) map </A>","trends":["There has been one other sighting in Mineola","There were no other sightings in Mineola on or around October 14th 2004"],"Country":"United States","Latitude":"32.665418","Object Shape":"Blimp, Egg","Disposition":"Unknown","Tags":"City","Log Number":"US-04202007-0006"}