{"Source":"MUFON","Longitude":"-117.172736","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Object Features":"None","Object Shape":"Sphere","City":"Pullman","Object Flight Path":"Path with directional change","Region":"Washington","Log Number":"US-04202007-0007","Date Submitted":"04/20/2007 12:40 UTC","files":["/var/www/straped/mufon/html2text/6854.html.txt","/var/www/straped/mufon/org/6854.html"],"Date of the Event":"04/20/2007 12:40 UTC","Case Number":"6854","Latitude":"46.736044","Weather Factors":"None","Tags":"City","Summary":"Black orb in the sky","Sighting Duration":"00:05:00","divs":["sighting detailsi was just outside of my apartment in pullman, wa having a smoke break from studying for finals. i heard a plane nearby, and i saw it was a large military cargo jet. around this time of year, they conduct multiple training ops at low elevations etc. anyways, i decided to keep looking up, and as i was looking nnw, i saw a small black object moving s really fast in a straight line. it was about a half mile away over a hill\\neighborhood, maybe 200-300 ft elevation, and i would estimate it to be travelling around 100mph. at first i thought it was a local hawk that chills on a street lamp looking for food, but when i didnt see its wings flap, and i realized how fast it was moving i payed closer attention. i watched it turn around, and head n, then it came ene towards my location. the closest it got to me was probably 500ft, then it went back to a ssw heading, it gained elevation, and dissapeared into a cloud. i'd say the object was about 20ft in circumference, black, perfect sphere, moved very fluidly, silent, and had no reflection from the sun. it wasnt a jet, nor a bird."],"map":"<A HREF = \"http://maps.google.com/maps?q=46.736044,+-117.172736(6854)&iwloc=A&hl=en\"> mufon case (6854) map </A>","Country":"United States","trends":["There have been 3 other sightings in Pullman","There were no other sightings in Pullman on or around April 20th 2007"]}