{"Disposition":"Unresolved","Case Number":"6857","Summary":"UFO","Region":"Al Qahirah","Sighting Duration":"Undisclosed","Country":"Egypt","Viewing Distance":"Unknown","Log Number":"EG-04202007-0010","Date Submitted":"04/20/2007 07:49 UTC","files":["/var/www/straped/mufon/html2text/6857.html.txt","/var/www/straped/mufon/more/6857_submitter_file1__Image001.jpg","/var/www/straped/mufon/more/6857_submitter_file2__Image002.jpg","/var/www/straped/mufon/more/6857_submitter_file3__Image005.jpg","/var/www/straped/mufon/org/6857.html"],"trends":["There have been 45 other sightings in Cairo","There was one other sighting in Cairo on or around April 20th 2007","This sighting has never been favorited.",""],"Longitude":"31.243255","Object Shape":"Circle, Disc, Other, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.04637,+31.243255(6857)&iwloc=A&hl=en\"> mufon case (6857) map </A>","Weather Factors":"Unknown","Tags":"City","Object Flight Path":"Undisclosed","divs":["Sighting DetailsHello to every one, From Cairo Egypt ,this is again Dr.Ibrahim ,Founder and Directot of web site :- www.ufo-egyptian-hunter.org Just hours ago ,before I could have a time for full study,I caught the UFO here in Cairo together with the Moon (cresent shape) following its orbit from southeast to northwest on the way heading Giza pyramids. The fotoes is very clear that was a big different betwen UFO and Moon. May be my fotoes are not very clear ,as in hurry I took it through my cellphone camera from my tv screen in which was conected to my video camera But the actuel video tape is crystal clear. The duration of recording time was thrity one minutes on one tape. Here I can only send some urgent photoes ,as your system seems not accepting videos films any more as it was before. I will send all photos and videos by separate e-mail to many e-mail address of MUFON. Just some thing I want to add to my report,it was also an airplane(commercial) passing-by heading to Cairo International Airport in a lower altitude as preparing to land (distance to airport around 30 kilometers). The airliner not affected atall by passing in a lower altitude of the UFO,but noticed that the shape of the UFO changed after aircraft passing under it,it was very clear and recorded in my video tape . Many thanks again ,soon I will instale extra information and details on my web site,www.ufo-egyptian-hunter.org With my best wishes to every one and regards from Egypt.Dr.Ibrahim"],"Object Features":"Undisclosed","Source":"MUFON","City":"Cairo","Date of the Event":"04/20/2007 07:49 UTC","Latitude":"30.04637"}