{"map":"<A HREF = \"http://maps.google.com/maps?q=46.4978,+-81.0018(6858)&iwloc=A&hl=en\"> mufon case (6858) map </A>","Country":"Canada","Region":"Ontario","City":"Greater Sudbury","Tags":"City","Case Number":"6858","Viewing Distance":"Unknown","Object Features":"Undisclosed","Date of the Event":"04/18/2007 10:05 UTC","Date Submitted":"04/18/2007 10:05 UTC","Weather Factors":"Unknown","Source":"MUFON","Object Shape":"Triangle","divs":["Sighting DetailsMy girlfriend, two other friends, and myself had stepped out in the backyard to have a smoke. My girlfriend and I were looking up to the north and I was showing her how to find the North star by running a line off the lip of the big dipper's ladle. I suddenly saw a moving light in the right(East) corner of my field of vision. I assumed it was a satellite and looked over at it to get a better look as I usually do when I spot a satellite. Once I had focused on it, I realized it wasn't a satellite because it was low to the ground and there was three dim reddish lights in the shape of a triangle. The object was moving at a high rate of speed comparable to a Snowbird or Blue Eagle jetplane passing overhead. I know this because when the Snowbirds are in town they have to fly over my house to get from the airport to the lake where they perform their act. At this point I was confused as to what I was seeing and excited by the possibility of what it might be. I immediately spoke up in an attempt to get everyone's attention and get them to look at it. Since my girlfriend was already looking up at the big dipper and the object was moving in a straight line through her field of vision, she quickly saw it and was as excited as I was at seeing something so strange. As the object passed directly over us, I noticed how it made absolutely no noise. I found this strange considering it was so low and moving at such a high speed. Normally aircraft, planes and helicopters alike, produce noise, and at that level it would have been very loud if it was a jet. Also, the object was small, as it would have been hidden behind my fist held in front of my face at arms length. When the object was moving past directly overhead, I noticed that as it passed in front of a star, that I could still see the star in the center of but it was a blurred image, as if the object was semi-transparent. We attempted to point the craft out to our other two friends but it was quickly heading off in an Eastern direction and they were not able to locate it. When the object was about a quarter mile away, the three lights began to spin in a clockwise direction, then the began to zigzag in and out from the central point. Suddenly the three lights all merged in the center and then vanished. No sight of it was seen after that. My girlfriend and I were both very excited about what we had just witnessed and began describing it to our friends in as much detail as we could. We both had the exact same desciption of what had happened. Unfortunately this all occured in the span of roughly 20 seconds or so, and there was not enough time for any of us to run in the house and find my SLR or my video camera. It's a shame because my video camera does high res video and I would have got a great video of it."],"Longitude":"-81.0018","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Log Number":"CA-04202007-0011","trends":["There have been 12 other sightings in Greater Sudbury","There were no other sightings in Greater Sudbury on or around April 18th 2007"],"Latitude":"46.4978","files":["/var/www/straped/mufon/html2text/6858.html.txt","/var/www/straped/mufon/org/6858.html"],"Summary":"low altitude, high speed fly by directly overhead"}