{"Date Submitted":"04/20/2007 06:10 UTC","Weather Factors":"Unknown","Viewing Distance":"Unknown","Object Features":"Unknown","Source":"MUFON","Tags":"City","Disposition":"Unknown","Log Number":"US-04212007-0002","Object Flight Path":"Straight-line path","Object Shape":"Circle","Country":"United States","Date of the Event":"04/20/2007 06:10 UTC","Sighting Duration":"Undisclosed","Summary":"It was northbound at a high rate of speed, an airplane was flying at a very high altitude above and to the left of it","City":"Tuscaloosa","divs":["Sighting DetailsWe were on our porch smoking a cigarette around 6:10pm in the evening I saw a flash out of the corner of my eye. When I looked I saw a bright silver circular shaped object flying north and not at a very high altitude ,but way up there all the same. I watched it for about 20 seconds and it just vanished. My husband was outside but he didn't see it. When I first noticed it , it was shining very bright like the sun was reflecting off it There was a plane flying at a very very high altitude to the left of it.The plane was flying southbound. The plane was putting out contrails in a dotted line pattern,for lack of a better way to describe it. I've been seeing this thing for years. Most times when I have a daylight hour sighting of it , it will dart out from behind a cloud and then back behind the cloud really fast , it is almost as if it knows it's been spotted. But today the only cloud cover we had was the contrail clouds , some in lines beside each other and some x like patterns. We have those all the time here in Tuscaloosa also. Anyway I watched it for about 20 seconds and it just vanished right before my eyes. If anyone knows what these things are feel free to e-mail me. I have tried to get local authorities and the local airport to check into and they have written me off as a nutcase. I am 37 years old I have no desire to be noticed over this and I am not looking for money or fame . The fact is it scares the hell out of me thinking that something is flying around up there and no one seems to care. I won't be flying anymore , it's not safe because these things sometimes seem to follow the air traffic that fly's over here leaving or headed to the Birmingham airport. When I see them it gives me a really really bad feeling. I started watching the skies in 1993 when I saw a reddish orange and silent object fly right over the tree tops beside my house. This silver thing is also silent.And at night it sometimes not always though shines a very intense white light in a sweeping pattern towards the ground. I really scares me and to me it is a ufo because I do not know what it is . It looks nothing like anything I've ever seen in person or on tv."],"Longitude":"-87.561874","Region":"Alabama","map":"<A HREF = \"http://maps.google.com/maps?q=33.216471,+-87.561874(6861)&iwloc=A&hl=en\"> mufon case (6861) map </A>","Latitude":"33.216471","Case Number":"6861","trends":["There have been 2 other sightings in Tuscaloosa","There were no other sightings in Tuscaloosa on or around April 20th 2007"],"files":["/var/www/straped/mufon/html2text/6861.html.txt","/var/www/straped/mufon/org/6861.html"]}