{"Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Object Shape":"Disc","divs":["Sighting DetailsI was working at Kawartha Downs in the kitchen when at around 730 I went out for a break. It was a very clear sky. Lately when outside I've been watching jets spraying chem-trails over Peterborough so I have become accostomed to looking up alot. I noticed a jet first and then a flash of sunlight in the air caught my eye above it 30000 feet aprox. in total. The jet underneath was at half that. When I looked up I saw a huge silver round disc directly above the huge parking lot we have. It was slowly moving east slightly tipped forward. There were SO many people around but no-one would look even though I was gaping mouthed and pointing and shouting UFO. I found it so f'ing strange that nobody would look at first. Finally a security guard came over and I showed him at this point it had drifted east at about 1 third the speed of the jet noiseless but I could hear the jet. If held at arms length it was the size of a small coffee saucer and REAL high up so I thought it was huge!!! aircraft carrier size. We watched with like 5 others until it disapeared in the eastern horizon. 7 minutes elapsed total..........I was already looking up its like it appeared all of a sudden and flashed in the sun silvery metal. The way it moved at first was strange it was as if it gave 3 little bursts of speed at the beginning. I told everyone at work and people generally believed me. I am a 29 year old cook and have never seen anything like this................it was massive. The appearance was silver round tipped at a -15 degree angle and soundless. I was excited as hell running around trying to get people to look. After I ran around telling EVERYONE I had just seen a UFO for real!!!!!!!!!"],"Date of the Event":"04/21/2007 07:40 UTC","Disposition":"Unresolved","Log Number":"CA-04222007-0001","map":"<A HREF = \"http://maps.google.com/maps?q=44.308803,+-78.319656(6867)&iwloc=A&hl=en\"> mufon case (6867) map </A>","City":"Peterborough","Summary":"saw a large silver disc","Region":"Ontario","Viewing Distance":"Unknown","Object Features":"Undisclosed","trends":["There have been 11 other sightings in Peterborough","There were no other sightings in Peterborough on or around April 21st 2007"],"Longitude":"-78.319656","Sighting Duration":"Undisclosed","Country":"Canada","Date Submitted":"04/21/2007 07:40 UTC","Tags":"City","Source":"MUFON","Case Number":"6867","Latitude":"44.308803","files":["/var/www/straped/mufon/html2text/6867.html.txt","/var/www/straped/mufon/org/6867.html"]}