{"files":["/var/www/straped/mufon/html2text/6868.html.txt","/var/www/straped/mufon/org/6868.html"],"trends":["There have been 21 other sightings in Little Rock","There were no other sightings in Little Rock on or around January 7th 2007"],"Longitude":"-92.281975","Case Number":"6868","Sighting Duration":"00:08:00","Country":"United States","Date Submitted":"01/07/2007 03:15 UTC","Weather Factors":"None","Object Shape":"Circle, Oval, Sphere","City":"Little Rock","Latitude":"34.755331","divs":["Sighting DetailsI was taking my dog out .As I walked down the steps I had a strange feeling something was out of place.Or like I was being watched.Just a odd feeling that some thing was not right.When I got my footing on the ground I looked straight up and saw a huge white Ball.It almost looked flourecent.Thats the only thing I can come close to describing the color or light.A very clean pure white light.I really could not get a grip on what I was seeing.I new it was not a planet or a star.All the sudden it shot straight up.With a speed that my mind could not even comprehend.Then all the sudden it stoped.Then darted to the right back to the left and then shot straight up again till it was out of sight..I have had 3 other sightings in my life.Yes I admitt I was very shaken up. My heart was pounding. I came back in and sat down.I think most of all I was jarded by the speed and the size.Like I said it took awhile for my mind to even comprehend what I had just saw..So on this one, I finally said ok this is it.We aren't alone and we never have been.I have no doubt now.The experience has litterally altered my view on so many levels.Sorry this took so long to post.I did not know of the website."],"Object Features":"None","Log Number":"US-04222007-0002","Disposition":"Insufficient Data","Source":"MUFON","Object Flight Path":"Stationary,Other","map":"<A HREF = \"http://maps.google.com/maps?q=34.755331,+-92.281975(6868)&iwloc=A&hl=en\"> mufon case (6868) map </A>","Date of the Event":"01/07/2007 03:15 UTC","Viewing Distance":"501 Feet - 1 Mile","Summary":"Large round ball high up but huge glowed white with incredible speed","Region":"Arkansas","Tags":"City"}