{"trends":["There have been no other sightings in Raglan","This sighting has never been favorited."],"Disposition":"Unresolved","Tags":"City","Sighting Duration":"00:00:05","Summary":"Filming and taking pictures of my buddies new bike","Object Features":"Undisclosed","City":"Raglan","Source":"MUFON","files":["/var/www/straped/mufon/html2text/6871.html.txt","/var/www/straped/mufon/more/6871_submitter_file1__ImportedPhotos00016.jpg","/var/www/straped/mufon/org/6871.html"],"Date Submitted":"04/20/2007 03:58 UTC","Log Number":"CA-04232007-0001","Region":"Ontario","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Object Shape":"Disc","Longitude":"-78.928117","Date of the Event":"04/20/2007 03:58 UTC","divs":["Sighting Details Me and my buddie went out to have fun on his dirtbike. I was filming my friend riding his bike, as he quickly finds his way out of range of the camera I began to look around, possibly for a nice desktop background for my computer. I switched my camera to take photos so I could take pictures instead of film,I notice this perfect picture of the landscape and think nothing but taking the photo of the landscape.To myself I thought was a black object in the sky but did I see it?, or was somthing in my eyes. Anyways I got my photo and at the time I thought nothing of the object I have just thought to have seen. I went home to look at my picture.After uploading and veiwing my new my resent photo's I notice a black spot in the sky on my nice new desktop background so I zoomed in , and began to think what the heck is that, It was that thing I thought to have seen, when I get a closer look at the picture I notice 2 more black ojects but smaller like distance apart from each other. The obects were moving and did not stop I believe thats why I barelly noticed them and they moved fast. Also felt really wierd kinda like somthing inside me was telling me somthing but didnt really understand especially when my friends new dirt bike didt start after he stoped to rest,I kinda thought to myself thats wierd. Was using a cannon DC40 on photo mode with 4.0 mega pixels nothing was edited , nothing was on my camera lense, In fact the same photo remains on my camera's memmory card untouched since I captured and uploaded. Ive scanned the film ive taken on this day to see if I got more proof and there is to much motion and moving to even see my buddie on his dirt bike."],"Country":"Canada","map":"<A HREF = \"http://maps.google.com/maps?q=44.018594,+-78.928117(6871)&iwloc=A&hl=en\"> mufon case (6871) map </A>","Latitude":"44.018594","Weather Factors":"Unknown","Case Number":"6871"}