{"divs":["sighting detailsbefore i begin, i should note that i have much better than normal 20\\20 vision (as a boy, i had 20\\5 vision, but it's denigrated to 20\\10). i also grew up in the mojave desert not 40 miles from edward's afb, and have seen virtually every type of flying vehicle in action at a variety of altitudes and aspects, and can easily identify most of them on sight. i also have a degree in physics. that said, i was putting my son down for a nap when i saw what appeared to be a very long, bright white fuselage of an aircraft heading due south at subsonic speed, approx. 20 miles away (which would put it close to the coastline). i was looking out my son's west-facing window. the object was at approx. 10,000 feet, moseying along. upon closer examination, i noticed that the bogie had no tail or wings, and was about 6-7 times longer than a 747. the white cylinder presented great contrast (and was subsequently easy to track) against a sky that was perfectly clear and blue. there was no contrail or sound. i eventually lost the object behind a 50-foot redwood. the object had caught my eye as i'd seen another object travel the same \"air lane\" two weeks previous, moving very fast at high altitude; i thought twice about the speed and altitude, but eventually dismissed it as a jet. i thought this odd as the air lanes are typically on the other side of our house, and in a different direction (sse), even during bad weather. feelingswise, i felt rather nonplussed before the event, and a bit excited after -- until my 21-month-old son spilled milk all over the chair in which we'd been sitting."],"Sighting Duration":"00:00:15","Object Features":"None","Country":"United States","Summary":"Long White Cylinder Heading South Over CA's Coast","Longitude":"-122.568383","trends":["There have been 18 other sightings in Novato","There were no other sightings in Novato on or around April 23rd 2007"],"Object Shape":"Cylinder","Object Flight Path":"Straight-line path","Region":"California","City":"Novato","Viewing Distance":"Unknown","Date of the Event":"04/23/2007 11:10 UTC","Latitude":"38.11144","map":"<A HREF = \"http://maps.google.com/maps?q=38.11144,+-122.568383(6875)&iwloc=A&hl=en\"> mufon case (6875) map </A>","Log Number":"US-04232007-0005","Source":"MUFON","Weather Factors":"None","Date Submitted":"04/23/2007 11:10 UTC","files":["/var/www/straped/mufon/html2text/6875.html.txt","/var/www/straped/mufon/org/6875.html"],"Disposition":"Unknown","Case Number":"6875","Tags":"City"}