{"City":"New Paltz","Source":"MUFON","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.756483,+-74.08551(6878)&iwloc=A&hl=en\"> mufon case (6878) map </A>","Log Number":"US-04232007-0008","Case Number":"6878","Tags":"City","Weather Factors":"Unknown","Region":"New York","Disposition":"IFO","Date Submitted":"04/22/2007 09:39 UTC","Object Features":"Undisclosed","Date of the Event":"04/22/2007 09:39 UTC","Sighting Duration":"00:43:00","Summary":"It looked like a mirrored ballroom Dance Hall Ball. the ball were spinning, and reflecting light could< This could explain the appearance of it pulsating.","Object Shape":"Oval","divs":["sighting detailsi live in the country, upstate ny, in a grist mill town, across the road from my home, is an enormous potato field, with a forest on the other side. it was a beautiful spring evening, and so, i decided to sit outside on my porch, without any outdoor light, listening to the nearby river, and gaze at the sky. the moon (although not full) was so bright, and it seemed as though every star in the universe were right before my eyes (they illuminated everything. i could see everything around, very clearly). but there was one in particular that didn't look at all like a star. i was on the telephone with a friend, who lives in the city. i was decribing to him what it looked like up here, when all of a sudden, the object caught my eye (in the same place as before - i'll explain later), moved very swiftly from one point to the next stopped, and then, would go back to the same distance(about 2 to 3 miles west of me). i was telling my friend (who knows a great deal about these things - as a matter of fact, he was the one that referred me to your site). we we're on the phone for (at least) 40 minutes, and it remained there the entire time - going back and forth, and pulsating (actually more like a quiver). this is not my first time seeing this since i'd moved up here from manhattan, to the country 3 months ago. i saw one for the first time on, monday, february 11th, 2007, at 12:21am, when (while turning down my bed),i heard this strange humming sound, that i'd heard on several other occasions, after lying down in bed (i would discribe it as more of a \"pulsating hum\"). i shut off the lights, and drew back the drapes, and i immediadtely saw it (or one) in the very same spot(s), swooping from side to side (at 3 to 30 second intervals). i immediately phoned my friend (the same friend that i was speaking with during the second sighting). i phoned him on his cell (so, as not to wake his wife), and i got his answering machine. i left a message as i stood there transfixed. i stared at this opject for 5 minutes, before running into my foyer, to grap my binoculars, and ran back, raised the glasses to my eyes, and got a glimbs of it before just to off, so fast it was hard to tell which direction it actually went in. i went, and stood in my front door (kept the porch light off)looking out into the darkness of my yard, and drive down to the road, (mind you; there are no street lamps anywhere, and the only light cast is that of the moon, and stars, when they're out), when all of a sudden the entire yard lit up with a very soft light. it was as though a helicopter passed over with a flood light. but; this was absolutely, positively, certainly not a helicopter\", because there was no sound of prop's, or engine, not flying dust, or gust of wind, just that pulsating hum, (most importantly) the light was not harsh (like that of a helicopter flood light), but very soft (like the light from a soft pink light bulb)making the snow on my lawn look like pink sand. it just passed over. my friend got my message and rang me back about ten minutes after it all occurred. and he said to me, \"i was wondering how long it would be, before you saw something. i had heard on the news about sightings in you area, two-weeks before you moved into that house!\" has there been any other report of a sighting (on either of these specific dates), in the area of gardiner\\new paltz? many thanks!"],"trends":["There have been 4 other sightings in New Paltz","There were no other sightings in New Paltz on or around April 22nd 2007"],"Latitude":"41.756483","files":["/var/www/straped/mufon/html2text/6878.html.txt","/var/www/straped/mufon/org/6878.html"],"Country":"United States","Longitude":"-74.08551","Object Flight Path":"Undisclosed"}