{"divs":["Sighting DetailsAlong US-40 in Maybell, Colorado, is a small model on the south side of the highway. After checking in at 10:30PM I spend a few minutes unpacking. At 10:40 I go out to check the car one last time before going to bed. The parking lot faces north from the motel. The place is pitch black except for a couple of street lights and the stars. Over the northern sky, 10-15 degrees above a horizontal line from my eyes, two lights come flying from the east. They move west faster than an aircraft would. The lights are too bright to be position lights on an airplane at that distance. Then suddenly they slow down and make a lateral course change. Right after, they separate briefly, putting such distance between them that they could not possibly be not airplane lights. One almost comes to a standstill, the other makes another course change. Then they join together again and quickly accelerate away, direction west. They suddenly vanish. The next morning I try to recall their flight pattern in daylight and discover that they had vanished behind a mountain top. They did not emerge on the other side of it so I assume that they either went down or took off north. There was no sound at all. The place was dead quiet so it would have been easy to hear jet engines, even from that distance. I grew up around an air force base so I am familiar with aircraft of all known kinds in the air both day and night. I do not know if the following incident had anything to do with this. Earlier that night in Vernal, Utah I had been advised by a gas station attendant and two unidentified men not to climb the Flaming Gorge at night. (A hotel lobby receptionist had also advised against it.) The weather was fine, there had been no snowfall for days, and the storm advisory was for the Colorado Rockies, not Wyoming. My truck was certainly up to the job, which I pointed out. But the two men were so adamant in discouraging me that I felt it necessary to change travel plans and go east through Colorado instead. My own estimate of the flight path of the two objects is that they were heading in the direction of Flaming Gorge. This could all be unrelated, and it probably was, but it also appears to be a strange coincidence."],"Case Number":"6884","Object Shape":"Other","Country":"United States","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=40.517746,+-108.087028(6884)&iwloc=A&hl=en\"> mufon case (6884) map </A>","Viewing Distance":"Over One Mile","Log Number":"US-04242007-0005","Weather Factors":"Unknown","Object Features":"Unknown","Disposition":"Unresolved","Source":"MUFON","Region":"Colorado","Tags":"City","trends":["There have been no other sightings in Maybell","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/6884.html.txt","/var/www/straped/mufon/org/6884.html"],"Summary":"Two bright lights passing from east to west over northern sky, maneuvering unlike airplanes or natural objects","City":"Maybell","Sighting Duration":"Undisclosed","Longitude":"-108.087028","Date of the Event":"04/10/2007 10:40 UTC","Latitude":"40.517746","Date Submitted":"04/10/2007 10:40 UTC"}