{"Disposition":"Unknown","Case Number":"6887","Date of the Event":"11/30/1982 12:00 UTC","Log Number":"US-04252007-0002","Object Shape":"Star-like","Source":"MUFON","City":"FARMINGTON","Sighting Duration":"Undisclosed","Region":"New York","Weather Factors":"None","Date Submitted":"11/30/1982 12:00 UTC","Tags":"City","Country":"United States","Object Flight Path":"Other","Summary":"MULTIPLE WITNESS SIGHTING OF AN OBJECT FLYING IN RECTANGULAR PATTERN OVER & OVER THEN REVERSING DIRECTION","map":"<A HREF = \"http://maps.google.com/maps?q=42.985504,+-77.320479(6887)&iwloc=A&hl=en\"> mufon case (6887) map </A>","Object Features":"Unknown","Longitude":"-77.320479","Viewing Distance":"Unknown","divs":["sighting detailsthis sighting is reported by a ny state trooper. the year and date are unknown but the incident occured during the time of a conflict with the mohawk indians (st. regis indian reservation) which historically can help pinpoint a time period if further investigation is warranted. the sighting took place above the state police barracks located near the canandaigua airport.the witness saw a star like object in the sky which looked nothing more than a star\\dot in the night sky. the object flew in 90 degree rectangular patterns over and over. then would stop on a dime and perform the same flight maneuvers in reverse. it appeared that the object flew in rectangular formation over and over-then would come to a complete stop and reverse the flight pattern over and over. the witness went inside and got a female state trooper to come out and look at the event. together they watched the object fly in rectangular formation and reverse its pattern or \"stop on a dime\" for a half hour. the trooper reporting the sighting served in the us airforce for four years and believes the aircraft was not conventional and unlike anything he had seen in his time with the military. the other state trooper who witnessed the event with him was originally highly skeptical of ufo related observations. he indicated that she came away from that particular sighting with a changed more open point of view and regarded the sighting as \"highly unusual\". no report was filed however i asked the trooper if sightings were filed with the state troopers. he indicated one sighting was reported on the \"trooper blotter\" and the individual making the report \"never heard the end of it\". no police report was made of this sighting. no shape or features could be discerned from the object due to distance."],"files":["/var/www/straped/mufon/html2text/6887.html.txt","/var/www/straped/mufon/org/6887.html"],"Latitude":"42.985504","trends":["There have been 3 other sightings in FARMINGTON","There were no other sightings in FARMINGTON on or around November 30th 1982"]}