{"trends":["There have been 3 other sightings in FARMINGTON","There were no other sightings in FARMINGTON on or around November 30th 2002"],"Region":"New York","Case Number":"6892","Disposition":"Unknown","Object Shape":"Circle, Sphere","divs":["sighting detailsthe witness along with his wife saw several glowing lights in the skies over lake ontario. the sighting took place in the fall of 2003 while he & his wife were on the back deck of their home. the witness (a state trooper at the time) stated they saw saw several lights north over lake ontario. the objects were bright and larger than planets flying in an east to west direction. the exact number of object werent given\\remembered (odd) but there were more than three. the weather conditions were clear. the objects flew in a horizontal pattern. no definitive shape or windows were seen other than the objects seemed cirular\\sperical and appeared larger than planets. there was no sound and the sighting lasted one hour in length. the lights\\objects reminded him of the phoenix lights. he did not believe they were flares. another state trooper showed up and saw the strange lights. this trooper was normally skeptical and refused to comment on the object. the witness cited a case from newark in which an officer reported a sighting of an unidentified craft. the report and the officer received a good deal of negative reaction from superiors, peers and fellow officers. sightings were not reported in most cases. the trooper also related an odd incident at buckhorn state park when he was 33 approximately 25 years ago. he was at the park with his wife and 3 children. he went by the waterfront area and observed what appeared to be \"a wedding party\" in \"weird fitting clothing\". he related that everyone at the park (his family) was especially \"euphoric and having a great time\" and that everything seemed \"perfect\". he used the term euphoric many times to explain his feeling of the day. as he came back from the waterfront by some thick brush area two little girls ran out from the brush. it didn't make sense to him because the brush was too thick for anyone to walk into let alone run out of. seven family members saw the two little girls run out of the brush toward the waterfront area of the park in the direction of the wedding party. as the two girls ran around the bend everyone else followed. when they came to the clearing by the waterfront seconds later they were astonished to find everyone had vanished. the wedding party and the two lttle girls were gone with no explanation. the witness considers this the most unusual incident of his life. he and his brother have had multiple sightings of fireballs and ufo related crafts as youth, teens and adults. both brothers work in a security\\law enforcement field. our witness claims no psychic enhancement or dreams or unusual phenomena to report associated with these reports. as a mufon investigator i have many questions and will keep these files open for further review as this greatly piques my curiosity."],"Latitude":"42.987284","files":["/var/www/straped/mufon/html2text/6892.html.txt","/var/www/straped/mufon/org/6892.html"],"Date Submitted":"11/30/2002 12:00 UTC","Summary":"MULTIPLE WITNESS SIGHTING OF SEVERAL UNUSUAL LIGHTS IN THE SKY OVER LAKE ONTARIO","Sighting Duration":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","Longitude":"-77.316199","map":"<A HREF = \"http://maps.google.com/maps?q=42.987284,+-77.316199(6892)&iwloc=A&hl=en\"> mufon case (6892) map </A>","Tags":"City","Log Number":"US-04252007-0007","Date of the Event":"11/30/2002 12:00 UTC","Object Features":"Unknown","City":"FARMINGTON","Country":"United States"}