{"Longitude":"-79.035149","Region":"New York","Summary":"DISC SHAPED OBJECT SIGHTED OVER GRAND ISLAND BRIDGE NEAR NIAGAR FALLS 1983","trends":["There have been 19 other sightings in Niagara Falls","There were no other sightings in Niagara Falls on or around November 30th 1982"],"Object Shape":"Disc","Object Flight Path":"Straight-line path","Disposition":"Unknown","divs":["sighting detailsthe witness reported the sighting of a disc shaped object in 1983\\1985 as the year is uncertain due to a 23-25 year lapse in reporting the event. the sighting took place just over the grand island bridge on the niagara falls side of the island\\bridge. the object came out from behind a cloud between 12 & 3 pm on this late spring early summer afternoon. the witness caught a glimpse of the sun reflecting off the craft. it was metallic and greyish colored. three was no sound. he cannot estimate the craft altitude. he saw the craft descend and hover over the niagara river. it had an antenna\\protruberance on it similar to a ufo he believes was seen in france as per a stanton friedman presentation he had recently seen. good of the witness to relate the sighting to other craft sightings. the length of the sighting was 4-5 minutes. the witness felt \"blessed to have seen this object. the craft size is not known-only that it was disc shaped. this witness has had multiple sightings and works within the security field. there was one cloud in the sky that day. coincidentally it was the same cloud that he saw the disc shaped object come from as it seemed to use the cloud as a cover. the weather conditions for the day were clear and sunny. he spoke to his brother about the sighting and his brother was sympathetic as they have both had multiple sightings."],"Sighting Duration":"Undisclosed","Weather Factors":"None","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=43.097824,+-79.035149(6893)&iwloc=A&hl=en\"> mufon case (6893) map </A>","Source":"MUFON","City":"Niagara Falls","Date Submitted":"11/30/1982 12:00 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/6893.html.txt","/var/www/straped/mufon/org/6893.html"],"Tags":"City","Case Number":"6893","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-04252007-0008","Date of the Event":"11/30/1982 12:00 UTC","Latitude":"43.097824"}