{"Log Number":"CA-04252007-0009","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.43014,+-75.692023(6894)&iwloc=A&hl=en\"> mufon case (6894) map </A>","divs":["sighting detailsthe photograph was taken in the mid-afternoon of april 19, 2007, with a digital camera. the exposure time was 1\\2506.2 seconds. it shows a small aircraft on its approach to nearby ottawa international airport in ottawa, canada. above the aircraft is another object that appears to be a disc-shaped flying saucer. it was not noticed until the photo was displayed on the computer screen. the saucer diameter can be estimated if we make the following assumptions. - the airplane is a bombardier dash 8 which has a wingspan of about 26 m. - the airplane was roughly 5 km from the airport, so its elevation was probably about 500 m. - the saucer altitude was somewhere in the range from 500 m up to the cloud ceiling at 6000 m. the cloud ceiling in ottawa around that time was obtained from the weather underground web site. on the photo, the apparent width of the saucer is about 2\\10 of the width of the airplane. therefore, if it were at 500 m, it would actually be (2\\((500\\500)*10)) x 26= 5.2 m across. similarly, if it were at 6000 m, the saucer's diameter would be about (2\\((500\\6000)*10)) x 26= 62.4 m. therefore, given the assumptions, the saucer diameter could have been anywhere from 5 to 62 m."],"Source":"MUFON","Sighting Duration":"Undisclosed","Region":"Ontario","Weather Factors":"Unknown","Summary":"Photo of a disc above an airplane","Country":"Canada","Longitude":"-75.692023","Disposition":"Unresolved","Case Number":"6894","Date Submitted":"04/19/2007 04:00 UTC","Object Shape":"Disc","Object Flight Path":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/6894.html.txt","/var/www/straped/mufon/more/6894_submitter_file1__DSCN3138.JPG","/var/www/straped/mufon/org/6894.html"],"trends":["There have been 55 other sightings in Ottawa","There were no other sightings in Ottawa on or around April 19th 2007","This sighting has never been favorited.",""],"Object Features":"Dome","Date of the Event":"04/19/2007 04:00 UTC","Latitude":"45.43014","City":"Ottawa"}