{"Latitude":"42.337041","Object Shape":"Fireball","Sighting Duration":"Undisclosed","Region":"Massachusetts","Source":"MUFON","divs":["Sighting DetailsThis was the day of the great northeast blackout. That is why I remember the date so well. After the power failed, I was sitting on my front steps of our house which faced west. The time was just after dusk. I believe it was around 6:15. Because of the blackout, the object's brightness made me look up to see what it was. The object appeared to be like a very bright fireball which passed over me from about 15 degrees south of due east travelling at a very high speed. It continued on in a straigt line passing out of site to about 15 degrees north of due west. The time it was in site was between one and two seconds. As it passed out of sight, it appeared to light up the horizon to the west with a bright orange reddish glow for an additional 1-2 seconds. I don't have an idea of its altitude, but it was low enough to seem as if it were following the curvature of the earth as opposed to be coming straight down. I do not remember hearing any noise associated with the object. I have always assumed that this was some kind of meteor which it may well have been, but I've never seen anything so close or so bright since then."],"files":["/var/www/straped/mufon/html2text/6898.html.txt","/var/www/straped/mufon/org/6898.html"],"Country":"United States","trends":["There have been 2 other sightings in Newton","There were no other sightings in Newton on or around November 9th 1965"],"Viewing Distance":"Unknown","Longitude":"-71.209221","Case Number":"6898","City":"Newton","Disposition":"IFO","Summary":"Observed fireball-like object travelling East to West","Tags":"City","Weather Factors":"None","Object Flight Path":"Straight-line path","Date of the Event":"11/09/1965 06:30 UTC","Log Number":"US-04262007-0001","map":"<A HREF = \"http://maps.google.com/maps?q=42.337041,+-71.209221(6898)&iwloc=A&hl=en\"> mufon case (6898) map </A>","Date Submitted":"11/09/1965 06:30 UTC","Object Features":"None"}