{"Date of the Event":"04/25/2007 12:00 UTC","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/6899.html.txt","/var/www/straped/mufon/org/6899.html"],"Object Features":"Undisclosed","Longitude":"-122.467658","Disposition":"Insufficient Data","Sighting Duration":"00:00:15","Case Number":"6899","Summary":"Very bright white starlike object which changed in brightness","Object Flight Path":"Undisclosed","Country":"United States","Latitude":"37.694254","divs":["Sighting DetailsI was standing on the corner of Forth and Howard streets in downtown San Francisco. I was just had arrived at the street corner and was about to cross Howard moving towards to the south and I looked up into the sky and I immediately noticed a very bright, white light slowly moving accross the sky. I stopped at the street corner and did not cross the street when I first sighted the object. It was in the South, very high in the sky; I estimate at least at an eighty five degree angle from the south horizon. It was moving to the South West and after two seconds of observation the light appeared to slowly shut off but I noticed it became much dimmer; It turned into a faint but clearly visible star and continued to move accross the sky towards the south west; it moved mostly to the West and only slightly in the direction of the South. It passed just to the South of the Moon and Saturn by a few degrees in the sky which allowed to have a rough guess of it's brightness which was clearly much dimmer than Saturn. I observed the object for about 15 seconds and then it became too faint for me to see it. It was walking down forth street towards my destination which was Whole Foods market on forth and Harrison. When I first noticed the object I knew right away it was something unusual because of it's color. I have watched airplanes for many years and they mostly have yellow lights and always have a flashing light but never use their search lights when they are very high in the sky but only turn them on when they are in a few miles of landing and less than a mile above the ground. This object appeared to be very high in the sky above five miles above the land. My feelings about the object were one of surprize; I was suprized when the objects luminosity was drastically reduced; it was almost like the Sun going out during a solar eclipse; the object slowly turned off it's very bright white light and there was a very big contrast and loss of light in the sky. I don't believe airplanes fly blind without bright lights at such a high altitude. The starlike object was very faint after that and I lost it in the sky as a result after 15 seconds. It was as if a high flying craft had a powerful spot light and then turn it off. The object clearly had a light of some kind and the faint light was definitly a electronic light of some kind as well and not the Sun's reflection which would only be visible if the object was high in orbit like a satellite but it was not that high. It was still moving too fast to be a satellite. I believe I saw a similar object in late October 1999, but even though that object was as bright it was not still visible after the bright light went out. The sky was clear without clouds."],"trends":["There have been 16 other sightings in Daly City","There were no other sightings in Daly City on or around April 25th 2007"],"City":"Daly City","Tags":"City","Weather Factors":"Does Not Apply","Log Number":"US-04262007-0002","Region":"California","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=37.694254,+-122.467658(6899)&iwloc=A&hl=en\"> mufon case (6899) map </A>","Date Submitted":"04/25/2007 12:00 UTC","Source":"MUFON"}