{"Summary":"The light stayed","Sighting Duration":"03:59:59","Latitude":"37.812664","Object Shape":"Star-like","Date Submitted":"04/24/2007 11:00 UTC","Longitude":"-122.261244","map":"<A HREF = \"http://maps.google.com/maps?q=37.812664,+-122.261244(6901)&iwloc=A&hl=en\"> mufon case (6901) map </A>","Object Flight Path":"Undisclosed","Disposition":"Insufficient Data","Source":"MUFON","trends":["There have been 24 other sightings in Oakland","There were no other sightings in Oakland on or around April 24th 2007","This sighting has never been favorited.",""],"Country":"United States","Date of the Event":"04/24/2007 11:00 UTC","divs":["Sighting Details2007 April 24, around 11p.m. I found the bright star but looked like a somethin different, I used my glasses , it was blinking red, blue and white , repeatdely. My family joined to watch it, he said, blinking and red and blue and white. But we found this earlier and we watched same thing since 2005, twice. Time and place to find this were diffrence but around our house. So we talked it might be a satelight. I was watching this 24 to 25 , from 11:20 to 1;20, about two hours, it did not change the place but looked to move toward little bit, little bit far away from our place in two hours. When I was watching same red and blue and white in 2006, was also moved like this, but I rememberd the place to see it, was little bit diference from our house. I quit to see it around 1:30a.m., because I was tired. I took a picture but not clear. And it seemed a blue color star or something. So it does not help you but I attach this. Orange lights down below were city. The blue one , above. I have UFO experience japan three time as I remember well. But such kind of looks star or air plane were more often. March 29 2007, I was in Los Cabos Mexico, I also found bright color was blinking automatically on the see in the night sky. It stayed there until Sun rise since 2a.m., So over 4 hours there. I have missing time and saw really clear UFO in Japan 1994, and I had many experiences related this. I know some stories related UFO encounter and abduction are similer to my experience but I did not have horrible experience. So I don't want to talk about this in USA. USA stories are horrible related Aliens and UFO and I don't want to put my story in same place.( Honestoly to say, I think so) I felt peaceful something from the experience . I am still thinking 24 April, what I saw , this might be satelight. I would like to know satelight around here or not. But next night, I could not see it. This is my whole story of April 24 2007. Regards, Yukako"],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/6901.html.txt","/var/www/straped/mufon/more/6901_submitter_file1__DSC00591.jpg","/var/www/straped/mufon/org/6901.html"],"Viewing Distance":"Unknown","Object Features":"Undisclosed","Log Number":"US-04262007-0004","Region":"California","Tags":"City","City":"Oakland","Case Number":"6901"}