{"Object Features":"None","Date Submitted":"04/27/2007 02:50 UTC","Weather Factors":"None","Region":"Colorado","Source":"MUFON","Case Number":"6908","Longitude":"-104.867193","Latitude":"39.585005","City":"Centennial","Summary":"Bright Green light unknown shape with small white light below, not known if attached or not","Log Number":"US-04272007-0007","Object Flight Path":"Stationary,Hovering then path,Path with directional change","trends":["There have been 16 other sightings in Centennial","There were no other sightings in Centennial on or around April 27th 2007"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.585005,+-104.867193(6908)&iwloc=A&hl=en\"> mufon case (6908) map </A>","Object Shape":"Sphere, Unknown","divs":["sighting detailsthe object started out in the northeastern horizon and appeared to be hovering at first glace it looked like a star, but i know from a somewhat great deal of education in astronomy that there are few visable green stars. the object then turned in some way or another and a smaller white light was visable just below it. it is unknown weather or not the second light was attached. the object then proced to move east tward a local airport, it then began to come back tward me (west) it picked up speen aprox. 200-300mph and began moving south. the object continued south untill it was out of sight. noteable conclusions are test aircraft and since this is colorado there are a number of facilities that could be doing tests, however it in no way flashed or seemed to have a visable shape, it was florescing and seemed to have a very spontaneous flight path. notable sights of intrest in the area include numerous airports, weapons building facilities, army\\ airforce bases and other goverment property. the abvoe was witnessed while leaving my home at about 2:45am on my way to work. low cloud cover made all other objects in the sky unnoticeable. object was extreamly bright. at second glace it appeard to be ofcourse a ufo weather extraterrestrial or military etc is unkown light emmision was so bright that no physical from could be made out. in no way did this object seem to be threatening to myself it also did not seem to be in contact with anything no lights pointed tward ground or other aircraft, how ever no noticeable port\\starbard lights were on the vehicle which is what makes it very interesting. lost sight of the object once trees were blocking view."],"Country":"United States","Date of the Event":"04/27/2007 02:50 UTC","files":["/var/www/straped/mufon/html2text/6908.html.txt","/var/www/straped/mufon/org/6908.html"],"Viewing Distance":"Over One Mile","Disposition":"Unresolved","Tags":"City","Sighting Duration":"00:01:00"}