{"Object Features":"None","divs":["Sighting DetailsI was in my backyard floating on a sun tan raft, on my back in the pool for approximately an hour when just out of nowhere I noticed a very bright, metalic looking object in the northern sky. I noticed it because the sky was so blue, and it looked at first like a plane coming into Tucson at a definately wrong angle and it had its landing lights on. I rose out of the pool, and viewed this object which semed to be hovering in the sky. If you were to stand, and raise your arm in a hitler type salute, this would be the angle. In my estimation it was the size of a green pea held at arms length. It seemed to be spinning in a very slow speed. The sighting seemed to change from a shiny chrome body with the sun bouncing off the left side of it, where the sun was in the sky to a more satin or brushed silver appearance. Then it would go red in color, only to repeat the patern. I watched it for approximately 2 minutes before I called my family out. They too saw the object and first stated it might be a childrens ballon. But, after watching it for an additional 5 minutes, it never moved from its position in the sky. It would just slowly spin. I ran inside our home and grabbed a camera. I took 4 photographs and only captured the object on one picture. When viewing the object on the digital it had lost its shine and color, and only appeared dark metalic grey. But, it did still hold its shape. After we watched the object for approximately 3 more minutes it simply disapeared. It never moved from its location. There was no drift in the sky. I can say this because it was between two trees and we watched movement between branches. No movement, no sound."],"Summary":"Alternating shiny chrome, brushed silver, then red object that spinned","Date of the Event":"04/14/2007 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.230873,+-110.924169(6912)&iwloc=A&hl=en\"> mufon case (6912) map </A>","Log Number":"US-04282007-0002","Date Submitted":"04/14/2007 12:00 UTC","Object Flight Path":"Stationary","Disposition":"Unresolved","Object Shape":"Saturn-like","Country":"United States","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around April 14th 2007","This sighting has never been favorited.",""],"Latitude":"32.230873","City":"Tucson","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Tags":"City","Source":"MUFON","files":["/var/www/straped/mufon/html2text/6912.html.txt","/var/www/straped/mufon/more/6912_submitter_file1__100_0883.JPG","/var/www/straped/mufon/org/6912.html"],"Case Number":"6912","Region":"Arizona","Longitude":"-110.924169"}