{"trends":["There have been 11 other sightings in Paris","There were no other sightings in Paris on or around August 11th 1999","This sighting has never been favorited.",""],"Object Shape":"Circle, Cylinder, Disc, Egg, Fireball, Flash, Star-like, Other","Case Number":"6913","map":"<A HREF = \"http://maps.google.com/maps?q=48.856614,+2.352222(6913)&iwloc=A&hl=en\"> mufon case (6913) map </A>","Summary":"i filmedthis in a field during solar eclipse in 1999","Viewing Distance":"Over One Mile","Object Features":"Undisclosed","Country":"France","Source":"MUFON","Date Submitted":"08/11/1999 12:23 UTC","files":["/var/www/straped/mufon/html2text/6913.html.txt","/var/www/straped/mufon/org/6913.html"],"Sighting Duration":"Undisclosed","Date of the Event":"08/11/1999 12:23 UTC","Weather Factors":"Unknown","Latitude":"48.856614","Disposition":"Unresolved","Tags":"City","Log Number":"FR-04282007-0003","Longitude":"2.352222","Region":"Île-de-France","Object Flight Path":"Path with directional change","divs":["sighting detailswe were in this field and all of a sudden we saw people pointing i turned the video camera and filmed what you see here. the time on the camera is uk time but we were in france, it was minutes before the full eclipse http:\\\\video.google.com\\videoplay?docid=8761599581053769210&q=solar+eclipse+france+1999 it moved around and covered great distances in milliseconds, you can really see the form if you play it on slow motion. it was not in the direction of the sun eclipse and it was a cloudy day it seemed at times that it was close to the trees and then a second later it was far above them you can hear my surpriseed voivee as i am filming it. the camera is a bis shaky but if you play it frame by frame it seems to expand and then leave a vapour trail as it moves to another spot. frame by frame you can clearly see it pulsing and you can also clearly see a round \"saucer\" shaped ship after about 50 seconds it just vanished, it was not a laser from the ground and i know when i was filming it i had filmed something special. anyone wanting a copy to play frame by frame can email me, id love to know what it was!"],"City":"Paris"}