{"Disposition":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","trends":["There have been 21 other sightings in Brandon","There were no other sightings in Brandon on or around April 28th 2007"],"Source":"MUFON","City":"Brandon","Viewing Distance":"Unknown","Case Number":"6916","Latitude":"27.939651","Summary":"Two flat black inverted teardrop objects paced me north on US 301","Log Number":"US-04292007-0002","Region":"Florida","Date Submitted":"04/28/2007 07:30 UTC","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=27.939651,+-82.282805(6916)&iwloc=A&hl=en\"> mufon case (6916) map </A>","Longitude":"-82.282805","Tags":"City","files":["/var/www/straped/mufon/html2text/6916.html.txt","/var/www/straped/mufon/org/6916.html"],"divs":["Sighting DetailsI was going north on US 301. Just south of the intersection with US 60 I sighted two black objects that I took to be balloons at the auto dealership on the corner of 301 and 60. When I reached the corner I realized that these objects where much further north. I noticed that they were flat black disk with a cone on the bottom. Since they sometimes launch hot air ballons from the Florida State fairgrounds about 2 miles north from my position, I thought that's what they were. But as I moved north I begain to have doubts: They paced me, remaining in the same relative position NNW. from my truck which ment that they were traveling at the same speed as me. Hot air balloons don't travel at 45-50mph! And, it was dead calm at that time. I also noticed that there was little reflection off the objects from the early morning sun. I followed them north for 10-15 min. untill I reached my turn off just short of the apex at 301 and Flower ave. Two flat black disks with a cone on the bottom. The cone was much shorter than an ice cream cone. I would estimate the angle at the apex of the cone to be between 30 and 45 degrees. Very little reflection from the morning sun. Distance from me 1-3 miles? Height above ground less than 2000 feet? They could have been hot air balloons but I doubt it for the reasons I gave."],"Date of the Event":"04/28/2007 07:30 UTC","Object Shape":"Teardrop","Country":"United States","Weather Factors":"Unknown"}