{"Object Flight Path":"Stationary","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","Date of the Event":"03/10/2007 10:00 UTC","Latitude":"46.323742","Tags":"City","Date Submitted":"03/10/2007 10:00 UTC","Object Shape":"Other, Unknown","divs":["sighting detailswhile driving from yakima washington to kennewick washington, while on the highway, i happened to look at the amber city lights of sunnyside washington(sunnyside is a rural town between between yakima and kennewick). i noticed an amber light the exact same color as the city lights above the town. i noticed the light was too high in the sky(approximately 500 feet) to be a regular street light. i assumed it could habe been a hot air baloon or maybe a blimp because it was stationary. i thought the light was strange because it was the same color, size, and brightness as the street lights below. after a couple minutes, i continued to observe the light trying to determine its origin. at this time i decided to flash a spotlight at it (located on my patrol car) several times. at this time im unsure if this object was done with its task or if it saw the flashing light on my patrol car. after flashing the object, took off south at a high rate of speed. it was gone in nearly a blink of an eye but left an amber trail similar to the trail a 4th of july sparkler creates or similar to what a laser pointer leaves if you move it quickly. the trail disappeared in approximately 1 and 1\\2 seconds."],"Region":"Washington","Case Number":"6926","trends":["There have been 5 other sightings in Sunnyside","There were no other sightings in Sunnyside on or around March 10th 2007"],"Log Number":"US-04302007-0005","Summary":"Unknown mimic light, took off at high rate of speed, disappeared","map":"<A HREF = \"http://maps.google.com/maps?q=46.323742,+-120.008654(6926)&iwloc=A&hl=en\"> mufon case (6926) map </A>","Longitude":"-120.008654","files":["/var/www/straped/mufon/html2text/6926.html.txt","/var/www/straped/mufon/org/6926.html"],"Country":"United States","City":"Sunnyside","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Weather Factors":"None"}