{"map":"<A HREF = \"http://maps.google.com/maps?q=42.965881,+-83.823874(6927)&iwloc=A&hl=en\"> mufon case (6927) map </A>","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/6927.html.txt","/var/www/straped/mufon/org/6927.html"],"Disposition":"Unknown","Date of the Event":"04/16/2007 12:00 UTC","Source":"MUFON","Viewing Distance":"101-500 Feet","Longitude":"-83.823874","Object Flight Path":"Straight-line path,Path with directional change","trends":["There have been 10 other sightings in Swartz Creek","There were no other sightings in Swartz Creek on or around April 16th 2007"],"divs":["Sighting DetailsTruck Driver, around 1 am traveling westbound in Swartz Creek Michigan on I-69 I seen this fast object come down and directly parallel to the interstate coming straight at me and it flew overhead about 200 ft from the ground tree top level. It was the shape of a basketball with what appeared to be in pearl metallic grey with no lights whatsoever, the only way I could have seen it was because my headlights may have reflected off its surface. It had to have flown down and past me at an amazing speed of 500+ miles, and caught a glimpse of the object for only a few seconds. It looked like it was going to impact my windshield and I had began to duck as if it were. I felt a great fear as because of the speed and precise maneuver it had made to descend from a parabolic angle to become parallel with the interstate as it traveled from West to East at speeds I cannot describe. There was no impact as I looked in my mirror for something to happen. The object appeared to look like a round pearl grey ball with grainy contoured lines and perhaps orb like and did not light up or glow, with an intent on getting somewhere fast. My first thought was this a probe?? I am a truck driver and had seen over 2 million miles, and this was the first time something like this has caught my eye. -"],"Date Submitted":"04/16/2007 12:00 UTC","Region":"Michigan","Object Features":"Patterned Surface","Case Number":"6927","City":"Swartz Creek","Summary":"Pearl grey sphere size of basketball 500 miles per hr shooting overhead..","Sighting Duration":"00:00:05","Object Shape":"Sphere","Latitude":"42.965881","Tags":"City","Log Number":"US-04302007-0006","Country":"United States"}