{"Disposition":"Hoax","Object Shape":"Fireball, Triangle","files":["/var/www/straped/mufon/html2text/6929.html.txt","/var/www/straped/mufon/more/6929_submitter_file1__a.jpg","/var/www/straped/mufon/more/6929_submitter_file2__aaaa.jpg","/var/www/straped/mufon/more/6929_submitter_file3__alllights.JPG","/var/www/straped/mufon/org/6929.html"],"trends":["There have been 21 other sightings in Springfield","There were no other sightings in Springfield on or around","This sighting has never been favorited.",""],"Object Features":"Undisclosed","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","divs":["Sighting DetailsI noticed an extremely bright white light motionless in the sky. I could see the stars and was very dark out in the middle of springfield mass. This was actually the 2nd time I saw the light but only took pictures one time because I didn't have my cell phone the other morning at the same location. I was surprised when I downloaded the picture and the single white light was no longer there and was replaced by 3 glowing red lights in a triangluar form. I am a mechanical engineer by trade a recieved a bachelors degree from wentworth institute of technology. The pictures can be tested and will prove to be authentic. Please let me know if you have any questions. I have a total of 4 pictures and you must zoom in to see the 3 red lights in a triangle. I will attach 2 original pictures and 1 with all 4 of the images blown up."],"Summary":"While driving to work one early morning I saw a bright light in the sky and took a picture with my cell phone.","Viewing Distance":"Unknown","City":"Springfield","Country":"United States","Date of the Event":"Unknown","Latitude":"42.105383","map":"<A HREF = \"http://maps.google.com/maps?q=42.105383,+-72.583641(6929)&iwloc=A&hl=en\"> mufon case (6929) map </A>","Tags":"City","Case Number":"6929","Sighting Duration":"Undisclosed","Log Number":"US-04302007-0008","Region":"Massachusetts","Date Submitted":"04/30/2007 02:19 UTC","Longitude":"-72.583641","Source":"MUFON"}