{"map":"<A HREF = \"http://maps.google.com/maps?q=35.764853,+-79.0121(6930)&iwloc=A&hl=en\"> mufon case (6930) map </A>","Object Flight Path":"Straight-line path","Region":"North Carolina","Sighting Duration":"10:35:10","Latitude":"35.764853","Summary":"Double steady glowing bright sphere flying under airplane","divs":["Sighting DetailsMy wife and i saw some orange flashes in the sky on the 25th of april so the next night we sat outside in our backyard in lawn chairs with our Sony handycam. Supernightshot was used. We notice a lot of air traffic as usual to the west of our house. Living next to Camp lejeune we are quite customed to seeing a lot of traffic. I was in the military for 7 yrs. I know my aircraft. It was about 1035pm a civilian jetliner was in the air about 25-30 thousand feet. Then about 5-10 thousand ft below it was what we thought was another plane. Then we noticed it was on the same flight path as the one above it. We then both remarked how it had no lights blinking. No red no blue no strobe. Just solid white-ish Glowing orbs. Two of them not quite side by side. This double glow was beneath it like it was staying hidden. However it was not flying as fast as the jet. it was just sailing along. I zoomed in and tracked it for about 20-25 seconds till it was blocked by my roof. Seeing this gave us a state of awe. We neither could explain to eachother or ourselves why some thing so bright let alone two of them so close together would be flying so low. We know Camp lejeune is restricted airspace so that limits all of the little craft. I would say it was the same size as the airplane about 50-75 feet long flying at about 17000ft. We have been seeing a lot of different things in the last month here. Lots of flashes in the sky lots of very fast craft. Not military Not civilian."],"Object Features":"Unknown","Date of the Event":"04/26/2007 12:00 UTC","Date Submitted":"04/26/2007 12:00 UTC","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/6930.html.txt","/var/www/straped/mufon/org/6930.html"],"Object Shape":"Sphere, Other","Tags":"City","Weather Factors":"Unknown","Case Number":"6930","trends":[""],"City":"Undisclosed","Log Number":"US-04302007-0009","Viewing Distance":"Unknown","Source":"MUFON","Country":"United States","Longitude":"-79.0121"}