{"Region":"California","Date Submitted":"04/30/1994 12:00 UTC","Case Number":"6931","files":["/var/www/straped/mufon/html2text/6931.html.txt","/var/www/straped/mufon/org/6931.html"],"Object Flight Path":"Hovering then path","Date of the Event":"04/30/1994 12:00 UTC","Summary":"Two luminescent unidentified flying objects appear in my home and make contact","Source":"MUFON","Weather Factors":"Does Not Apply","Log Number":"US-04302007-0010","Viewing Distance":"20 Feet or Less","Tags":"City","Country":"United States","Object Shape":"Circle, Sphere","Latitude":"33.648972","Longitude":"-117.908969","Sighting Duration":"Undisclosed","Object Features":"Unknown","City":"Costa Mesa","map":"<A HREF = \"http://maps.google.com/maps?q=33.648972,+-117.908969(6931)&iwloc=A&hl=en\"> mufon case (6931) map </A>","divs":["Sighting DetailsIt was approximately May of 1994. I was home alone, when at approximately 11PM to Midnight there appeared in my bedroom (where I was) two unidentified flying objects. They were quite luminous and bright red. They appeared to be emitting their own light. They were spherical, and approximately the equal diameter of a U.S. Nickel. They moved quickly throughout the room; much quicker than any type of an insect or even a bird. There movements appeared to me to be thoughtful, and indicative of intelligent beings. They were aware of me, or so I thought. I don't remember exactly how long they were there before they attempted to communicate. I was not afraid, but rather seemed calm and intrigued. I don't think this would have been my natural reaction. I think that somehow they were able to prevent me from getting to fearful or excited. At some point, I heard a telepathic communication (inside of my head) that they wanted to communicate. They specifically used the word \"Commune\" which I thought had religious connotations at the time. They said, \"We want to Commune... with you.\" A few moments later one of the object came around on my left side and entered my left ear. I could feel that the object was physical. For the next few minutes (not sure how long) I heard what I perceived to be multiple high-pitched voices inside of my ear. I was unable to discern anything specifically that was communicated. I am also not sure how long this took place. I think that I went into a trance of some sort, durring the majority of this \"communication\" and don't remember more than a few minutes of it. I estimate that I came out of the trance a couple of hours later. The two light-emitting red objects were still in my vicinity. I went to bed, and went to sleep and did not see them the next day. However, that night, one of the objects appeared in my room again, momentarily, before exiting the room, {apparently} by entering a fluorescent light tube that was turned off at the time. I have not seen them since, and although at the time of the event I regarded this as an extra-terrestrial event. Because this experience differed from the common descriptions of close encounters that I was aware of, I was reluctant to report the event at the time that it occurred. Recently I was reading a book called The Watchers by Ray Fowler, which indicated that a lot of reports are atypical of the \"common\" UFO report, especially contact reports. I perhaps would never have reported this event for I am not looking for publicity or anything like that but through the years I realise that I have no idea what or who these things were, what their intention was, or what (if anything) they did and for what reasons? In short, I have no clue-- and I would like to know. I felt that in reporting this event that perhaps you may be aware in your investigations of similar experiences that others have had, and I may be able to learn more about these many questions that I have about the event."],"trends":["There have been 17 other sightings in Costa Mesa","There were no other sightings in Costa Mesa on or around April 30th 1994"],"Disposition":"Unknown"}