{"Object Shape":"Circle, Disc, Sphere","Case Number":"6933","map":"<A HREF = \"http://maps.google.com/maps?q=33.644002,+-117.913399(6933)&iwloc=A&hl=en\"> mufon case (6933) map </A>","divs":["Sighting DetailsWhile bicycling home from work, in the Costa Mesa Area, traveling south bound on the Sana Ana River Trail, I approached a bridge, constructed by the Army Core of Ingineers. Here I rested for a few minutes. It was a clear night, and I happened to look up and observe what first appeared to me to be two moons in the sky. For several seconds I pondered what I was seeing, and then eventually realised that what I was seeing was the moon and a reflection of the moon off of an unknown and invisible object. It was then that I realsed that there was a black shape, based on the sillouette of stars, in the same area as the reflection. By observing, I could see that the object was moving very slowly, almost hovering. As the moon's reflection passed along the outer edge of the craft I could momentarily make out some detail - that the craft did have a distinct edge and appeared disk like. I would estimate the size of the craft to quite large; over 200 feet in diameter. I would estimate the distance from me to be less than 1500 feet but more than a 1000 feet. I would estimate it's elevation to be somewhere between 1000 and 1500 feet. I was along and somewhat isolated at the time of the event, but not feel fearful at first. After the reflection of the moon passed over the edge of the craft, it was more difficult to \"see\" the craft - being that it was only a dark shape that \"absorbed\" some of the stars, and being in a somewhat star-less location, this rendered the craft almost totally undetectable. At this time I got spooked and left the location."],"files":["/var/www/straped/mufon/html2text/6933.html.txt","/var/www/straped/mufon/org/6933.html"],"Weather Factors":"None","Date Submitted":"08/01/2000 01:00 UTC","Date of the Event":"08/01/2000 01:00 UTC","Object Flight Path":"Hovering then path,Path then hovering","Sighting Duration":"Undisclosed","trends":["There have been 17 other sightings in Costa Mesa","There were no other sightings in Costa Mesa on or around August 1st 2000"],"Summary":"Large unidentified object hovering over location","Country":"United States","Disposition":"Unknown","Tags":"City","City":"Costa Mesa","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-04302007-0012","Region":"California","Object Features":"Unknown","Latitude":"33.644002","Source":"MUFON","Longitude":"-117.913399"}