{"Weather Factors":"Unknown","Object Shape":"Disc","Case Number":"6936","Date Submitted":"06/26/1987 11:01 UTC","Viewing Distance":"21-100 Feet","Summary":"disc shaped object with one large white light in the center,white ligths around the edges,glass windows without the whole center.","files":["/var/www/straped/mufon/html2text/6936.html.txt","/var/www/straped/mufon/org/6936.html"],"Object Features":"Other","Log Number":"US-04302007-0015","Disposition":"Insufficient Data","Object Flight Path":"Hovering then path","Source":"MUFON","divs":["Sighting Detailsit was a summer night around 11pm, in kissimmee Florida was with my brother,and his girlfriend.we went out to the gas station,and on the way back home.we were driving on Florida parkway when all of a sudden my brother slammed on the breaks. about 70 ft in front of the car and about 120 ft in the air there was a disc shaped object hovering in front of us.we exited the vehicle and stood on top of the car,starring at this object in amazement .about 30 seconds later their was another car that pulled up behind us,the guy stepped out of his car and starred at the object. i was feeling confused,scared,and numb.no one said a word. i couldn't believe what was happening!the object made a very low sound like when you put your ear against an florescent light,and a very low humming noise.the object hovered in the same spot for roughly one minute,it started to move very slow off the street,and started heading towards the trees.all of a sudden the large UFO vanished!we ran into the car and drove to our parents house,we ran out the car to the front door and knocking hard to get in.when my mother opened the door we almost knocked her down. i was crying,confused,and thinking that something was going to happen to us and the world.we ran and closed all the blinds and windows and hide in a room.we were looking out the window to see if the object was going to return. i was thirteen years old when this occurred,and never really told anyone about this event until i hit my late 20's,and now i can't forget what happened that day and i tell as many people as possible about that night,everybody feels as if I am making this story up,but i am willing to take a lie dector test and to be hpynized so i can relive this amazing event that happened to me.i was watching a eposide of the ufo files and they talked about mufon and i was hoping that i could dicuss with someone this event that they would undersand,believe and not think this was some type of joke. thank you for allowing me to express that amazing night."],"Sighting Duration":"00:10:01","Country":"United States","Date of the Event":"06/26/1987 11:01 UTC","Region":"Florida","Latitude":"28.300706","Tags":"City","Longitude":"-81.404391","map":"<A HREF = \"http://maps.google.com/maps?q=28.300706,+-81.404391(6936)&iwloc=A&hl=en\"> mufon case (6936) map </A>","City":"Kissimmee","trends":["There have been 18 other sightings in Kissimmee","There were no other sightings in Kissimmee on or around June 26th 1987"]}