{"Disposition":"Unknown","Source":"MUFON","Object Features":"Undisclosed","Viewing Distance":"Unknown","Date Submitted":"04/11/2007 03:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.998395,+-84.487164(6938)&iwloc=A&hl=en\"> mufon case (6938) map </A>","divs":["Sighting DetailsWhile traveling on the highway to visit a friend, I noticed movement in the sky and saw a cylindrical object. I was riding as a passenger, so I had the luxury to watch it travel at a quick, but not impossible speed, for a typical aircraft. Its path was a very straight angle from the upper left area of my field of vision toward the lower right, with no obvious deviation. It was broad daylight in a blue sky with sparse, full clouds, so I could see the object quite clearly, with my vision obscured only by distance. Since it was quite far and my visual impression of it wasn't perfectly clear, I dismissed it as nothing but a commercial plane, likely a 747 judging by apparent size. I remember noting mentally, though, that it was strange for a jet aircraft to not leave a vapor trail, but also dismissed that, since that's what I saw, and assumed the absence of vapor was due to whatever climate conditions existed locally relative to the object. Convinced that it must be mundane, my attention momentarily wandered to focus casually on other scenery, but then I glanced back a few seconds before the object was about to pass in front of the only nearby cloud directly in its course. I was very surprised when the object instead passed behind the cloud, as judging by distance and speed I assumed it was much closer than the cloud, and wouldn't be flying at such a high altitude. My attention was now fixed, and I mentioned it to my friend who was driving. I explained everything in detail, and he watched with me, we were both paying attention, hoping to get another look when it should clear the cloud and emerge on the other side. Even though we watched with fixed attention for several minutes, the object never appeared again, seeming to have vanished while behind the cloud. We watched long enough that the cloud (which was drifting gradually in an almost directly opposing course to the object) eventually moved beyond the approximate point in the sky where the object passed behind it, and the cloud had mostly dissipated by that point. Both of those factors: the position of the cloud, and its dispersement, meant that we were satisfied that there was no possibility to reestablish visual contact with the object. My friend, the driver of the vehicle, never actually established visual contact with the object, but knows me well enough to know that I didn't fabricate or exaggerate any part of what I told him, so there's no doubt in his mind that I saw exactly what I described. Even though there was nothing particularly strange about the object aside from its seemingly unusual shape and the fact that it never emerged from behind the cloud, it left me with a very intense sensation that I can only described as unsettled, and somewhat excited."],"trends":["There have been no other sightings in Fairview","This sighting has never been favorited."],"Tags":"City","Longitude":"-84.487164","Date of the Event":"04/11/2007 03:00 UTC","Sighting Duration":"00:05:00","Object Shape":"Cylinder","Region":"Kentucky","files":["/var/www/straped/mufon/html2text/6938.html.txt","/var/www/straped/mufon/more/6938_submitter_file1__cylinder.png","/var/www/straped/mufon/org/6938.html"],"Object Flight Path":"Undisclosed","Log Number":"US-05012007-0001","Latitude":"38.998395","City":"Fairview","Weather Factors":"Unknown","Country":"United States","Summary":"Light colored cylinder with rounded ends and darkened bands near either end.","Case Number":"6938"}