{"trends":["There have been 19 other sightings in Niagara Falls","There were no other sightings in Niagara Falls on or around November 30th 1969"],"Summary":"NIAGARA FALLS AREA MULTIPLE WITNESS SIGHTING OF TWO OBJECTS IN 1969","Country":"United States","Object Features":"Unknown","Weather Factors":"Unknown","Date of the Event":"11/30/1969 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.101234,+-79.029579(6940)&iwloc=A&hl=en\"> mufon case (6940) map </A>","Latitude":"43.101234","Sighting Duration":"Undisclosed","divs":["sighting detailstwo brothers aged 14 & 15 at the time in 1969 witnessed two star like objects in the night skies over the niagara falls near the junior high school\\hyde park area.they were lying on their back in the snow watching stars in the sky when they both saw two points of light that looked like two moving stars that came toward each other from opposite ends of an east\\west sky-stop on a dime as they came very close to each other-(about a minute in duration) hover-then rotate in a circle and take off in different directions. (this is a carbon copy of a ufo sighting i had in september of 1983 in the syracuse area night skies about 4am)the two objects they witnessed were directly overhead as they lay in the snow. the whole sighting took 5-6 minutes in duration. both brothers have since had multiple sightings and both work in security\\police related positions. the weather conditions were cold with clear skies. other than the star like quality of the objects they could give no description of them . they heard no sound associated with the sighting."],"Case Number":"6940","Date Submitted":"11/30/1969 12:00 UTC","files":["/var/www/straped/mufon/html2text/6940.html.txt","/var/www/straped/mufon/org/6940.html"],"Disposition":"Unknown","Object Flight Path":"Path with directional change","Tags":"City","City":"Niagara Falls","Viewing Distance":"501 Feet - 1 Mile","Region":"New York","Source":"MUFON","Log Number":"US-05012007-0003","Object Shape":"Disc, Star-like","Longitude":"-79.029579"}