{"Object Flight Path":"Path with directional change","Weather Factors":"None","Date of the Event":"04/30/2007 11:30 UTC","Tags":"City","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.521161,+-78.393526(6941)&iwloc=A&hl=en\"> mufon case (6941) map </A>","divs":["Sighting DetailsThe event I am reporting occurred from 11:30-11:37 p.m. on the night of April 30th, 2007. We were in a small clearing between some woods around a development, on a path that leads down to cliffs and a river below that. We were returning from sitting at the cliffs and gazing out over into the river, in the sky, etc. I often look at the night sky because I am interested in UFO phenomenon, and I was leading the group of us (7) back to the car when I looked up at the moon (which is around 99% full in its phases at the moment). The object was moving right past the moon, moving up like it was gaining altitude and parallel to the moon. I pointed out the object to the group and we all stopped to witness it. My first reaction was that it looked like what a shuttle launch would look like from a distance, but knowing what I do about launches (very little at best, but more than most) I believe launches are earlier in the morning and upon further investigation of NASA's mission schedule I came to under stand there was no mission set for this evening. As I was trying to think of what it could be the object turned away from the moon and began to span the sky in a lateral direction (right to left from our perspective). When it turned there was a glow visible to the object and red lights that flashed on either side, no green. The contrail that the object left remained completely tight and did not span out like planes I watch over head do, which I also found unusual. The speed at which the object crossed the sky was also out of ordinary, it covered (if you were to hold your arms out at length and look at the space between) a arms span of distance in a shorter time then I usually watch airplanes fly. As the object moved directly in front of our vantage point, no sound followed, it was completely silent, except for a low hum that could be heard as well as felt. As the craft finished its parallel path across the sky, it took a sharp right (close to 90 degrees) and started to gain altitude again. The rear of the craft was visible now, and along with the glow and red flashing the back appeared to glow of blue flame. Still no sound was heard and the object was now moving at a faster pace than before. The object was lost because it was moving so fast and was getting to far away that it faded to star sized, and looked as if it replaced the position of one star that was fixed in the sky. Although the object faded, the \"star-like\" glow kept the object in vision until some clouds passed over and it became too overcast to continue watching for it. My feelings as the object was flying were many. As it came into view for the first time I tried to think and eliminate terrestrial options for ID'ing the craft, but as it passed us and flew out of sight I was struck with wonder, excitement and a small amount of fear about the oddity. I was even more excited when there were no launches that appeared because that eliminated what I thought to be the most viable option of what it could be."],"Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","City":"Altoona","files":["/var/www/straped/mufon/html2text/6941.html.txt","/var/www/straped/mufon/org/6941.html"],"Longitude":"-78.393526","Log Number":"US-05012007-0004","trends":["There have been 20 other sightings in Altoona","There were no other sightings in Altoona on or around April 30th 2007"],"Object Shape":"Bullet, Missile, Star-like","Latitude":"40.521161","Date Submitted":"04/30/2007 11:30 UTC","Sighting Duration":"00:07:00","Region":"Pennsylvania","Summary":"Craft moving fast across the sky","Country":"United States","Disposition":"Unknown","Case Number":"6941"}