{"trends":["There have been 19 other sightings in Niagara Falls","There were no other sightings in Niagara Falls on or around November 30th 1962"],"Summary":"1963-1965 FIREBALL SHAPED OBJECT SIGHTED OVER NIAGARA FALLS REPORTED ON NY THE NIAGARA FALLS GAZETTE WITH MANY WITNESSES","Country":"United States","Latitude":"43.104814","Date Submitted":"11/30/1962 12:00 UTC","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=43.104814,+-79.030079(6942)&iwloc=A&hl=en\"> mufon case (6942) map </A>","Region":"New York","Source":"MUFON","divs":["sighting detailsthe witness saw this event 1963-1965. he can't remember the year and says he was 10-12 years old. he was in the car with mother, sister and a friend. they all saw a green fireball. ferry avenue east over the hyde park area. it was low and blue green in the color of its trail. it seemed very hot to him and like something from a flash gordon movie. he said there was a picture in the niagara falls gazette about the sighting. (it will be interesting to see if we can find that news article to corroborrate the date & time of the event) he also said he heard a loud \"whoosh\" as the object passed them by. he said the object came in low, appeared to hit the atmosphere then \"bounce out\". his impression is that the object seemed \"artificial\". he said the picture in the gazette was \"a picture with a contrail\\fireball \". in the 60's my brother also saw a daytime \"comet like event\" that took place over the western new york area of scranton ny. ( i was 10-11 & my younger brother 7-9 depending on the year of the sighting. they could be related. i believe that object was also traveling in the same direction as this witness stated. he isn't sure of the time\\season of the year the sighting ocurred."],"Case Number":"6942","Disposition":"Insufficient Data","Viewing Distance":"Unknown","Tags":"City","Sighting Duration":"Undisclosed","Longitude":"-79.030079","Object Shape":"Fireball, Flash","City":"Niagara Falls","files":["/var/www/straped/mufon/html2text/6942.html.txt","/var/www/straped/mufon/org/6942.html"],"Date of the Event":"11/30/1962 12:00 UTC","Log Number":"US-05012007-0005","Object Flight Path":"Straight-line path,Unknown","Object Features":"Undisclosed"}