{"Sighting Duration":"Undisclosed","Country":"United States","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.719763,+-74.001113(6943)&iwloc=A&hl=en\"> mufon case (6943) map </A>","Source":"MUFON","Object Features":"Unknown","Date Submitted":"11/30/1990 09:20 UTC","Region":"New York","Tags":"City","Latitude":"40.719763","City":"New York","Object Shape":"Sphere","Summary":"1991 SIGHTING OF AN OBJECT EXHINITING A SPIRALING OUTWARD FLIGHT.","Longitude":"-74.001113","Disposition":"Unknown","divs":["sighting detailsin 1991 this witness sighted an object which appeared to be the size of venus in the early evening skies over western new york and possibly as far as virginia. the object was bright and travelling in a spiraling outward motion. it was not venus. it was circular\\spherical. it was bright but the witness clearly stated it was not star like nor was it venus. the object was first sighted in the south and flew in a norrteast direction.they are not sure of the year or season since approximately 16-17 years passed since the sighting. the witness said they thought there was something in the papers about the object. the newspaper is unknown. they said it was not a \"japanese rocket\\ satellite\". the witness said the light diffused after awhile. it was the odd spiraling motion of the object which caught their eye. the individual has had no prior sightings before or since and no strange dreams or after effects. they have had an interest in the ufo phenomenon because of a great aunt who was interested in the subject back in the 1940's."],"Case Number":"6943","files":["/var/www/straped/mufon/html2text/6943.html.txt","/var/www/straped/mufon/org/6943.html"],"trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around November 30th 1990"],"Object Flight Path":"Stationary,Hovering then path,Path with directional change","Log Number":"US-05012007-0006","Date of the Event":"11/30/1990 09:20 UTC","Weather Factors":"Unknown"}