{"Region":"New York","Weather Factors":"None","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/6944.html.txt","/var/www/straped/mufon/org/6944.html"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.648052,+-79.022996(6944)&iwloc=A&hl=en\"> mufon case (6944) map </A>","Country":"United States","Log Number":"US-05012007-0007","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unknown","divs":["Sighting DetailsON AUGUST 16, 2006 3 WITNESSES IN A BOAT SIGHTED AN OBJECT WHILE BOATING IN LAKE ERIE NEAR ANGOLA NY. THE OBJECT APPEARED TO BE A DIAMOND SHAPED MULTI COLORED OBJECT JUST ABOVE THE HORIZON OVER THE CANADIAN BORDER A GOOD DISTANCE AWAY FROM ANGOLA. AS THEY GOT FURTHER OUT THEY SHUT THE BOAT OFF AND DRIFTED.TWO OF THE WITNESSE LAID BACK & LOOKED INTO THE NIGHT SKIES CLAIMING THEY SAW SHOOTING STARS. THE WITNESS I SPOKE TO SAID HE DIDN'T SEE THE SHOOTING STARS (THE OTHER TWO DID). HE SAW A STAR LIKE DIAMOND SHAPED OBJECT COME OUT OF THE WATER NEAR THE CANANDIAN BORDER AND ASCEND INTO THE NIGHT SKY. HE TOLD THE TWO FRIENDS WHERE TO LOOK FOR THE DIAMOND SHAPED BRIGHT OBJECT HEADING INTO THE EBVENING SKY WHEN THE OBJECT APPEARED TO ASCEND AND DISAPPEARED IN A FLASH LIKE A CAR SPEEDING OFF INTO THE HORIZON. THE THREE MEN WERE IN AWE OF THE EVENT. THEY WENT HOME DIRECTLY AFTER THE SIGHTING AND TOOK THE BOAT OUT OF THE LAKE. ONE WITNESS SAT THERE OPEN MOUTHED IN DIS-BELIEF AFTER THE SIGHTING. THE WITNESS I SPOKE TO-THE ONLY ONE I HAVE BEEN ABLE TO ESTABLISH CONTACT WITH (AND THIS TOOK SOME DOING ON MY PART) HAS STATED THEY DON'T TALK ABOUT THE EVENT BETWEEN THEM AND ONE OF THE MEN-THE YOUNGEST THEY HAVE HAD NO CONTACT WITH. THE WITNESS SAID HIS TWO FRIENDS TO HIS KNOWLEDGE SEEMED OK BUT HE HAS HAD SOME THINGS TO DEAL WITH. i HAVE BEEN UNABLE TO GET THE OTHER TWO WITNESSES TO SPEAK TO ME REGARDING THE SIGHTING TO DATE. AFTER THE SIGHTING THE WITNESS CLAIMS TO HAVE BEEN VERY \"MOVED\" BY THE EVENT. HE HAD TROUBLE SLEEPING FOR SEVERAL MONTHS WITH LOSS OF CONCENTRATION AND FOCUS ON HIS NORMAL DAILY ACTIVITIES. HE SAID HE WAS SICK AND LETHARGIC AFTER THE INCIDENT. WAS DIZZY, AND HAD LOSS OF EQUILIBRIUM AND BALANCE. HE WENT TO SEE A DOCTOR FOR COLDS AND EAR PROBLEMS. HE SAID HE IS STABILIZING AND THAT WAS 3 MONTHS AFTER THE SIGHTING. ADDITIONAL COMMENTS ON MY END-AUGUST IS THE TIME OF THE PERSEID METEOR SHOWERS AND THEY MAY HAVE SEEN A FEW SHOOTING STARS AROUND THIS TIME. THE AFTER AFFECTS OF THE SIGHTING COULD BE A COMBINATION OF BOTH PHYSIOLOGICAL AND PSYCHOLOGICAL-BOTH MENTAL & PHYSICAL EFFECTS .I FOUND IT INTERESTING THAT THEY BUILT A HUGE BONFIRE BEFORE TAKING THE BOAT RIDE. COULD HAVE BEEN A NICE SIGNAL THAT SAYS \"HERE WE ARE\" AS THEY LEAVE THE DOCK AND HEAD INTO LAKE ERIE. HE HAS ALSO EXPERIENCED COMPUTER, RADIO AND STREETLIGHTS THAT SHUT OFF IN HIS PRESENCE. I WILL TRY TO FOLLOW UP ON THIS INTERESTING CASE MORE IF THE WITNESS IS WILLING TO CONTINUE DIALOGUE. MANY ADDITIONAL QUESTIONS HERE AS TO WHAT CAUSED THE PHYSIOLOGICAL EFFECTS THE WITNESS SPEAKS OF."],"Case Number":"6944","Date Submitted":"08/16/2006 08:30 UTC","Latitude":"42.648052","City":"Angola","Object Shape":"Diamond, Star-like","Object Features":"Unknown","Summary":"MULTIPLE WITNESS SIGHTING OF A DIAMOND SHAPED OBJECT AUGUST 2006 OVER LAKE ERIE FROM ANGOLA NY","Longitude":"-79.022996","Tags":"City","trends":["There has been one other sighting in Angola","There was one other sighting in Angola on or around August 16th 2006"],"Sighting Duration":"Undisclosed","Date of the Event":"08/16/2006 08:30 UTC"}