{"Sighting Duration":"Undisclosed","Log Number":"US-05012007-0009","Longitude":"-104.977013","Country":"United States","Weather Factors":"None","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around April 17th 2007","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","Date of the Event":"04/17/2007 03:00 UTC","divs":["Sighting DetailsOn April 17, 2007 at around 3:00 pm the children were outside playing I was prepairing for dinner and doing some dishes. My grandson Mick came running in the house asking me to come on outside we see a ufo!!! (he had heard my stories about the ufo's I have seen and many times came in and said I saw a ufo grandma! well this time was different!) he practically pulled me out of the house I knew it was a different reaction from him and knew I had to hurry or it would be gone. As I ran out the door I could see his sisters and three of the neighbor kids pointing into the South Eastern sky and exclaiming there it is there it is! I looked and saw nothing then all the sudden I saw it, a gray disc with three round lights or maybe reflective metal at first it was more of a side view the disc would appear and then disappear it seemed as though it would ascend and move over to the left or the right about thirty feet away from where it last appeared and then it would appear and disappear.....it seemed to be playing peek a boo with the kids... I saw it from the underside it was circular and seemed to have five lights around it, or circular reflective metal spots that resembled lights, it had a design on the bottom of it that consisted of what I believed to be five loops, topside of the loop by a light, they seemed to be something moving on the underside the loops maybe. I ran into the house and got our binoculars to get a better look when I came out and put the binoculars to my eyes I amazingly pointed them straight at what looked like the same ufo or another one that was carrying or attached to a long white rectangle that was long ways hanging down, also it seemed to have no shadowy areas and sizewise I thought it to be as big as the quest building ( a high rise) attached to this ufo that looked exactly like the one we were watching , it seemed to me that while I viewed through the binnoculars I could hear the kids saying there it is!! there it is! like they were seeing the same thing they saw before I came out to look and interestingly enough none of them said what is it carrying now! which amaized me also. I don't think they saw that for some reason. The ufo that I saw through the binnoculars that was carrying the white rectangle seemed to be desending and then just disapeared. My impression was that the other ufo the first one the one the kids were watching attached to the bottom of the one I saw in the binnoculars the one with the white rectangle. If so I believed this to be a white spool of thread. I believe it lasted for about 15 minutes that we were out there viewing this sighting."],"Summary":"there was a ufo disc shaped it was appearing and disapearing and would reapear about 30 feet from where it appeard and seemed to be assending and dessending I got my binoculars I saw what looked the same but with a huge white rectangle attached underneath","Object Features":"Patterned Surface, Other","Date Submitted":"04/17/2007 03:00 UTC","files":["/var/www/straped/mufon/html2text/6946.html.txt","/var/www/straped/mufon/more/6946_submitter_file1__threadspoolufo.jpg","/var/www/straped/mufon/more/6946_submitter_file2__threadspoolufopencildraw.jpg","/var/www/straped/mufon/org/6946.html"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.744974,+-104.977013(6946)&iwloc=A&hl=en\"> mufon case (6946) map </A>","City":"Denver","Region":"Colorado","Object Shape":"Disc, Square, Rectagular","Case Number":"6946","Object Flight Path":"Hovering then path,Path then hovering,Other","Tags":"City","Disposition":"Insufficient Data","Latitude":"39.744974"}