{"Summary":"I saw a UFO over my house in the summer of 1969. It was dark,no noise--then it lit up and flew towards Malibu.","Date Submitted":"07/15/1969 09:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.094759,+-118.356844(6951)&iwloc=A&hl=en\"> mufon case (6951) map </A>","Weather Factors":"Unknown","Object Features":"Undisclosed","divs":["Sighting DetailsOn a hot night in the summer of 1969--I was cooling off on my front porch when I noticed an acorn shaped object(oval)hanging over my house about 150 feet in the air. It was about 20 feet high and 15 feet wide--camouflaged against the dark night sky. No lights at all. Definitely trying to hide itself. I called a couple friends out to the porch and it was so hard to see--that they had to follow my finger as I pointed at the object. We observed it hanging there for about 5 minutes. Suddenly the bottom of the craft lit up with a swirling kind of energy source. (If I recall it was red yellow and green) Although the sides of the UFO were not lit--the reflection from the bottom lights enabled us to make out portholes that went around the craft. The UFO hung there--lit up--for about 5 seconds then took off slowly. We could not hear any noise-total silence. It then accelerated at a terrific speed towards Malibu,CA and about 30 seconds later--it looked like a star as it grew smaller and disappeared into the Northwest sky. It did not disappear behind any mountain--but high in the sky--into the stars. I called the weather bureau and they had no other report of a UFO. I also checked the next day papers and nothing was there. I never heard or saw any report about this incident. I never ran into any other person (besides the 3 of us) that witnessed this. This amazes me as it took place in West Hollywood,CA--at an early night hour--just a quarter mile from the main section of Sunset Strip--one of the most populated streets and areas in the country. Have you ever got a similar report about this incident? I wish I could recall the exact date but I cannot. Summer of 1969 is the best I can do. Thanks, Wayne Hagstrom"],"Latitude":"34.094759","Longitude":"-118.356844","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/6951.html.txt","/var/www/straped/mufon/org/6951.html"],"Region":"California","Tags":"City","Disposition":"Unknown","Date of the Event":"07/15/1969 09:00 UTC","Object Shape":"Egg, Oval","City":"West Hollywood","Source":"MUFON","trends":["There have been 7 other sightings in West Hollywood","There were no other sightings in West Hollywood on or around July 15th 1969"],"Case Number":"6951","Log Number":"US-05022007-0001","Country":"United States","Sighting Duration":"Undisclosed"}