{"Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=34.062084,+-118.237825(6954)&iwloc=A&hl=en\"> mufon case (6954) map </A>","Source":"MUFON","Summary":"Apparently diamond shaped and with occasionally flashing red, slow moving","Object Shape":"Diamond, Flash, Star-like","files":["/var/www/straped/mufon/html2text/6954.html.txt","/var/www/straped/mufon/org/6954.html"],"Date Submitted":"04/28/2007 10:30 UTC","Latitude":"34.062084","Object Features":"None","Longitude":"-118.237825","Viewing Distance":"Over One Mile","Log Number":"US-05022007-0004","City":"Los Angeles","Disposition":"IFO","Sighting Duration":"00:22:15","Date of the Event":"04/28/2007 10:30 UTC","Tags":"City","Weather Factors":"Fog, Light","divs":["Sighting DetailsFirst filming I was watching TV and opened my front door facing the ocean and I noticed a light and starting filming it. I noticed a light over the Pacific ocean looking west to northwest and it looked like a airplane or a star but wasnt moving fast and didnt have flashing beacons. The next day I shared the footage with my friend Chris and he was amazed and I suggested that we look and see if it was there again and to our amazement the light did reappear.I filmed it 2 days April 27 and April 28, the first day was at 9:51pm and the next day around the same time but an hour later. I couldn't decipher the distance because of the darkness at night. The object was moving very slowly and progressively moved west to northwest and in the distance I noticed it move extremely fast. At times fading out and reappearing. My feelings are Iam not sure what the object was or is and wanted document it. I lost sight of the object because it went of sight and completely disappeared."],"Country":"United States","Case Number":"6954","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around April 28th 2007","This sighting has never been favorited.",""],"Object Flight Path":"Stationary"}