{"Date Submitted":"03/25/2006 09:30 UTC","Disposition":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.183888,+-96.031127(6959)&iwloc=A&hl=en\"> mufon case (6959) map </A>","trends":["There have been 2 other sightings in La Vista","There were no other sightings in La Vista on or around March 25th 2006"],"Date of the Event":"03/25/2006 09:30 UTC","Object Flight Path":"Stationary","Latitude":"41.183888","files":["/var/www/straped/mufon/html2text/6959.html.txt","/var/www/straped/mufon/org/6959.html"],"Sighting Duration":"Undisclosed","Log Number":"US-05032007-0005","divs":["sighting detailson march 25, 2006, at 9:30am i was driving my car and was headed ese. i had left my home at 9:25am and it took me about five minutes to get to the location where i observed the large, about 25'-30', round black circle hovering above the trees. it was about 1\\4 mile from my observation point. i was leaving my subdivision and the street i was driving on makes several curves before it reaches the main n\\s street, 72nd street. i spotted the object as i was about to drive around the last curve, the sighting was no more that 5-6 seconds. however, during that time period i could see that the object was not moving relative to the trees. since it was march the trees were just starting to bud and i could see through the tees and observed the roofs of several homes, so i knew that the object was east of 72nd street where the homes were located. the object was about 20'-30' above the trees, which were 5'-10' taller than the homes. the wind was about 10-15mph, however, i didn't see the object moving relative to the homes or trees. the object was not a weather balloon, airplain, helicopter, hot air balloon, and i didn't see anything that looked like a teather attached to the object. it should also be noted that about 100 yrds to the north there is a power sub-station the furnishes electricty to about 1\\3 of the city of lavista, about 1000 homes. after i rounded the curve the object was gone. i didn't make any attempt to try to locate it. i later contacted the lavista police department & the faa. the spokeperson for the police department said that there had been no calls about the object. the faa spokesperson said that no such object had been sighted or seen on their radar."],"Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Case Number":"6959","Region":"Nebraska","Weather Factors":"Unknown","City":"La Vista","Object Features":"None","Object Shape":"Circle","Summary":"sighted circular black object hovering above the trees.","Longitude":"-96.031127","Country":"United States"}