{"trends":["There have been 2 other sightings in Aliso Viejo","There were no other sightings in Aliso Viejo on or around April 1st 2007","This sighting has never been favorited.",""],"divs":["sighting details(see previouse report 4-15-07 looked \"like a red balloon\") i was once again getting my car washed at the el-dorado car wash (la paz rd and the 73, laguna hills\\aliso viejo) i walked around the building after giveing my car over to the carwash workers, pushing my 15 month old son in his stroller and scanning the sky for balloons or anything, but i didn't see any balloons this time and decided to lean against the rail in front of the carwash and wait patiently for my car to be finished. i kept on looking up into the sky for anything strange and vouala a balloon right above my head maybe 200 feet high. it was moving like a ballon blowing around, but staying in pretty much the same place. i don't know how it got there because i had been scanning the sky but never saw it drift over, it just was there when i looked up. i immediatly grabbed my camera out of the diaper bag put it in on full zoom and took 8 pictures then switched to video and captured some, good footage and a lot of bad, because i wasn't using the view finder. (i'm an idiot) the balloon hovered above me for a minute and the began to drift? south east very slowly just like a balloon till it passed into a cloud or otherwise disappeared. i wasn't sure that it wasn't a balloon till i got home and looked at the photos' and watch the video in slow motion, at 21 seconds into the video a ball of light appears and seems to go into the balloon this can be seen when you set your media player to slo-mo and right after the ball of light hits the balloon, the balloon starts to move. weird huh?"],"Summary":"I looked up and saw what looked like a dark blue/black mylar cone shaped balloon","Disposition":"IFO","Sighting Duration":"Undisclosed","City":"Aliso Viejo","Log Number":"US-05032007-0009","Case Number":"6963","Tags":"City","Object Shape":"Cone","Object Features":"None","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/6963.html.txt","/var/www/straped/mufon/more/6963_submitter_file1__Picture002.jpg","/var/www/straped/mufon/more/6963_submitter_file2__Picture008.jpg","/var/www/straped/mufon/org/6963.html"],"Object Flight Path":"Hovering then path","Date of the Event":"04/01/2007 02:30 UTC","Date Submitted":"04/01/2007 02:30 UTC","Source":"MUFON","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=33.575096,+-117.725431(6963)&iwloc=A&hl=en\"> mufon case (6963) map </A>","Longitude":"-117.725431","Country":"United States","Latitude":"33.575096","Weather Factors":"Unknown"}