{"Country":"United States","Date Submitted":"04/30/1965 10:05 UTC","Latitude":"43.651653","divs":["Sighting Details Myself and several other guys from school were hanging around the fire eating hotdogs and drinking coca colas. Our campsite was on the very top of this hill we called \"Baldy Mountain\".Baldy is the highest hill for a dozen miles around. It was quite dark and I don't recall seeing stars or even noticeing the sky at all when someone said \"hey look at that\".We stopped what we were doing and saw an orange globe sitting just above the hills maybe 7 or 8 miles away to the north. It was absolutely stationary but looked to have a kind of swirl on the surface like moulten lava or melted steel. We at first said it must be some kind of experiment from the observatory at Dartmouth College. Then the more we looked at it, the more we could not be sure how far away it was. I thought it was just like looking at the Sun when it first becomes visible in the morning. one thought it was a planet... but it was way to big andvisable. The more we gazed at the object, the stranger it became. A dull redish orange globe just sitting over the distant hills. We soon became distracted in animated debate about what this object could be, when someone said \"hey its gone\". Not one guy had kept his eye on it. A big lament came over us that no one had seen fit to keep it in view. We soon returned to our campfire and pretty much forgot about the globe. I looked up and over the hills every now and then to see if it had returned, but we never saw it. I don't think we thought much more about the incident after that. Some 20 years later, I ran into 2 of these guys that still live in the area. I asked them if they remembered the globe in the sky. There answer was a resounding \"hell yes\". I asked what they thought it was that we saw, and the reply was \"a god damn UFO\"."],"trends":["There have been 4 other sightings in Lebanon","There were no other sightings in Lebanon on or around April 30th 1965"],"Source":"MUFON","Weather Factors":"Unknown","Date of the Event":"04/30/1965 10:05 UTC","Object Features":"None","Disposition":"IFO","Object Shape":"Fireball, Saturn-like","Region":"New Hampshire","Case Number":"6964","Log Number":"US-05032007-0010","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/6964.html.txt","/var/www/straped/mufon/org/6964.html"],"Sighting Duration":"00:10:00","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=43.651653,+-72.243017(6964)&iwloc=A&hl=en\"> mufon case (6964) map </A>","City":"Lebanon","Summary":"object observed by several high school students while camping out on the highest hill in the area.","Longitude":"-72.243017","Tags":"City"}