{"files":["/var/www/straped/mufon/html2text/6967.html.txt","/var/www/straped/mufon/more/6967_submitter_file1__scan0002.jpg","/var/www/straped/mufon/more/6967_submitter_file2__scan0001.jpg","/var/www/straped/mufon/org/6967.html"],"Case Number":"6967","Disposition":"Unknown","Date Submitted":"03/29/2007 11:30 UTC","Date of the Event":"03/29/2007 11:30 UTC","trends":["There have been 4 other sightings in Douglas","There were no other sightings in Douglas on or around March 29th 2007","This sighting has never been favorited.",""],"Longitude":"-82.841625","Tags":"City","divs":["Sighting DetailsMy husband and I were traveling down Hwy. 158 West out about 7-8 miles from Douglas Georgia on Thursday March 29 2007 enroute to the Satilla Baptist Church Cemetery to take flowers. On a hill overlooking a new pond with a huge forest of Pine trees to the north my husband who was in the passenger seat said to me as I was driving, \"What is that?\" and pointed toward the northeast. We both watched as a very strange object was slowly floating above the pine trees on the right side of the road and moving in our direction toward the southeast. I stopped the car in the road and we watched it barely moving. I began to inch forward knowing if I took my time at the bootom of the hill it would be directly over us and we could get a real close up look. As I continued to inch forward the object came to a complete stop and stood still not moving. Because I was now near the bottom of the hill and on a bad curve I was fearful someone would come over the hill and hit me so I moved quickly down to a dirt road to my right to see if the object had moved forward. It had not so I quickly turned around and headed east on Hwy. 158 back up to where the object was visible. As we looked now to our left we saw the object begin to back up - NOT turn around! It slowly began to float away from us in the same direction we first saw it coming in as if it knew we were watching it. I drove back to the top of the hill and turned into an area where a gate faces the pond and we observed the object fly just above the trees in a northeast direction very slowly. I could not go that slow in my car as I have a clutch and the oject was slower than my car. As the object was getting more out of sight we decided to travel back down HWY. 158 west TO Conrad Vickers road where we took a right to eventually connect to HWY 32. We took this route in hopes that on some of the open hills on that road we could get another glimpse of the object so I drove as fast as I could without breaking the speed limit but on each of the hills which allows you to see for miles across the farmlands and pines we never saw it again. The object about the size of a football held at arms length was big and looked like it was made of metal without seams and did not shine. At first my husband thought it was a shoonok (?) military helicopter or the B17 vintage plane a businessman from Douglas owns and had been flying over our house earlier that morning which makes a tremendous amount of noise and rattles our windows. Upon closer observation we noted there was no sound, no propellers, no wings, no windshield, no numbers or markings, and no landing wheels. It was tarnished stainless steel with a yellow green tint making it blend with the pine trees. It was also disc shaped with rounded edges and no dome. Had we not been at the apex of the hill when we spotted it then we would not have noticed it at all. Later that week we traveled to Savannah, GA where we keenly observed several different types of helicopters and military planes and not one of them resembled what we had seen in color, size, markings, sound or shape which only reinforced our belief we had indeed witnessed a UFO. On the day of the event, the sun was very bright as I was wearing sunglasses which I rarely do. The temperature was in the 80's and very few clouds in the sky. The wind was very little if any because when I got to the church I was cleaning the cemetery and was sweating because the air was so still. During the sighting, my husband and I did not notice any strange things like clocks stopping or hair standing on in. Two cars did pass by us once we were back on top of the hill and had turned into the gate area. These drivers did not slow down and probably thought we owned the pasture and were getting out to open the gate. Later that afternoon when I got home, I called the local airport and spoke to Ken. I asked him if the B17 pilot had seen anything strange earlier that morning and he said no one had mentioned anything strange. I asked if he knew whether any helicopters had been in the area and he asked his assistant who responded that a heliocopter pilot had radioed around noon day wanting to know if they had any fuel but had never shown up. This may be a little strange but he could have gone somewhere else to fuel up they said. One thing is for certain what we saw was not a helicopter because it flew forward and then traveled backward without ever turning around which would mean the pilot was flying backward. It was too close to the pine tree tops to probably have been on radar. Having seen blimpes before I can without hesitation say it was not a blimpe or a ballon or a plane or a helicopter. I searched photos of various UFOs in Filers Files and found two on the front covers of Filer's Files # 13 ande Filer's File # 14 which I will attach that were shaped and colored like what we saw - except the one we witnessed had no dome. Having been a Consultant with MUFON for many years, now, I tried to observe this sighting with great skill. Whatever this object was, there is no doubt in my mind it knew it was being observed and that is why it stopped and moved away because I could not follow its' path in the direction it had come as no roads exist in that direction except the one I took that went to the Northwest as it flew back to the Northeast. Several days later, I mentioned the sighting to a fellow church member who said they had overheard a man at an eating place called Peck's in Ocilla Georgia about 20 miles away say that he had seen a huge strange object one morning that he thought was going to land on his house. We have tried to locate this man but have been unsuccessful. I contacted the sheriff and police chief but they had not received any calls in Irwin County where Ocilla is located regarding a strange aerial object. John Bodin, FI from Wray, Georgia and I discussed the event which I also emailed to our MUFON State Director Walter Sheats in Atlanta in hopes we could find others who had seen this object. John and I also discussed a case years back where a disc was seen dropping out golf ball size objects that were believed to have started fires. With all the recent fires in WARE County, Coffee County, Irwin County, Atkinson County etc. one has to wonder if there could be a coorelation. If someone remembers the case I am talking about regarding the golf ball objects and fires involving a UFO please let me know at drjoye@charter.net. Thanks!"],"Region":"Georgia","Summary":"Tarnished Stainless Steel UFO with a yellow green tint shaped like a disk with no top in daylight on Hwy. 158 West from Douglas Georgia","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=31.512277,+-82.841625(6967)&iwloc=A&hl=en\"> mufon case (6967) map </A>","Log Number":"US-05042007-0003","Latitude":"31.512277","Viewing Distance":"101-500 Feet","Source":"MUFON","Object Features":"None","Object Flight Path":"Stationary,Straight-line path,Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","City":"Douglas","Object Shape":"Disc","Country":"United States"}