{"Tags":"City","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.575317,+-87.776184(6968)&iwloc=A&hl=en\"> mufon case (6968) map </A>","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","Latitude":"41.575317","Object Flight Path":"Undisclosed","Date Submitted":"05/03/2007 08:30 UTC","Summary":"Flashing green & red shapes, hovering and moving slowly very low in the sky","Weather Factors":"Unknown","Region":"Illinois","Object Features":"Undisclosed","Case Number":"6968","files":["/var/www/straped/mufon/html2text/6968.html.txt","/var/www/straped/mufon/org/6968.html"],"Country":"United States","Date of the Event":"05/03/2007 08:30 UTC","trends":["There have been 15 other sightings in Tinley Park","There were no other sightings in Tinley Park on or around May 3rd 2007"],"Longitude":"-87.776184","Object Shape":"Blimp, Boomerang, Flash, Oval","City":"Tinley Park","Log Number":"US-05042007-0004","Source":"MUFON","divs":["sighting detailscoming home from the mall we saw several bright lights in the sky flashing green and red. from one or two of these we did hear some engine sounds. after getting home we began to see more of these flashing objects, each approaching from the same direction about 2 minutes apart. these objects were moving slowly and moved toward the western part of the sky. once they reached the western sky, they seemed to begin to circle around the tinley park \\ orland park area. these objects do not appear to make any noise as they travelled. these flashing lights actually seemed to descend to where they could not have been more than a couple thousand feet off the ground. what was really unusual was that they were moving so slow that they looked to be hovering in the lower part of the sky. three or four of these objects could be seen at one time. while we were watching these slowly moving flashing objects, we noticed a stationary green and red light flashing object in the southwest sky. this object did not move for the entire hour we were watching it. i know this was not a tower light, as it was too high and too large. i have lived in the area for almost 20 years and had never seen this before. we called the police to report the observation; apparantly there were no other reports that night. next day at school my children learned from several friends that they had seen these things also. several years ago (~ 2003 or 2004), several \"ufo's\" or unexplained lights were spotted by some of my neighbors in the sky above our neighborhood. i have since learned of the large number of people who also reported these 2003 \\ 2004 observations."]}