{"Case Number":"6974","trends":[],"Longitude":"-119.412822","Date Submitted":"05/05/2007 02:45 UTC","Weather Factors":"Unknown","Region":"California","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=36.787391,+-119.412822(6974)&iwloc=A&hl=en\"> mufon case (6974) map </A>","Country":"United States","files":["/var/www/straped/mufon/html2text/6974.html.txt","/var/www/straped/mufon/org/6974.html"],"Disposition":"Insufficient Data","divs":["Sighting DetailsI was walking up Beaver street and I looked towards the South slightly South East and after a couple of sweeps through the sky, I spotted a bright silver shinny starlike object in my 12 to 36 times 70 millimeter bonoculars. I moved from 12 power and zoomed up to about 25 power; The object was shinny silver in color. It was still too small to see its shape; It appeared to be round. It was moving towards the north under the high Cirus cloud deck. I first spotted it about seventy five degrees about the horizon but it then slowly moved accross the sky until it was directly above me at ninety degrees. At that time my younger brother saw me and came near me. It was 3:50 p.m. I handed him the bonoculars and after ten second he also found the same object. He watched it for three minutes and it started heading south back down to about seventy five degrees above the south horizon. It clearly was below the Cirus clouds and was not a balloon since it was flying in the opposite direction of the clouds or against the wind. It first was on may way up to the park, Corona Height to look in the sky for UFO's. I noticed the object when I made a couple of sweeps accross the southern sky with the bonoculars. I went home after we lost sight of the object in the South and my brother left to go some where else. I went inside my house and around ten minutes later I went back outside onto my front steps and I spotted the object again at 3:17 p.m. It was in the south again. It was heading north. It kept moving north until it was directly above my head at ninety degrees. It was very bright like the Sun was reflecting off a shinny steel surface. After about five minutes, I lost the object above my roof. I went inside and ate a sandwich. Then I went up to Corona Heights and at near the bottom of the wooden staircase which leads to the top of Cororna Heights where the path turns overlooking the city, I spotted the same object again in my bonoculars. It was South of me but slightly South West. It was about seventy five degrees above the horizon. It was heading North coming towards me. After a couple of minutes it was directly above me. I lay down with my back in the grass so my arms would not get tired. As it crossed directly above me after about five minutes I saw a large passenger jet pass directly between it and the sky. It was much higher up than the Jet. I watched the object for about an hour laying down. It moved back and forth accross the sky heading West and back East. When the object at one point was under thick white high cirus clouds and it was very bright, shinny and white. It could not have been Venus because Venus is not that bright in the day and cannot penetrate the clouds like that. At one point I saw a small hand held balloon in the bonoculars pass to the south in the direction of the wind and movement of the clouds. The object was moving North against the winds at that time. Clearly, it could not be a balloon stay up there for an hour against the wind. It was not a plane. It lost the object as it gradually moved to the East and was too near the Sun. I held the bonoculars as still as possible and noticed that in fifteen seconds the object moved out of my field of view from the center of the view. I repeated this test several times and beyond a shadow of a doubt, the object was moving under its own power and choosing its own direction. My estimation of the objects hight is that it was quite high but lower than the cloud deck of only Cirus clouds. The object was very bright and I am not sure it was only reflecting Sunlight. It appeared to be bright at all angles; It may have had it's own light source but I was not sure; I believe it was definitely reflecting Sunlight due to it's brightness. Even at maxium magnification, thirty six power, the object did have a dark spot on it but the object was still too small to make out its exact shape. It looked like two round objects connected by a black center but at that maginification there is some distortion. I lost the object at 5:07 p.m."],"Source":"MUFON","City":"Undisclosed","Object Flight Path":"Undisclosed","Latitude":"36.787391","Viewing Distance":"Unknown","Object Shape":"Star-like","Object Features":"Undisclosed","Summary":"starlike silver shinny object moved back and forth under clouddeck","Log Number":"US-05062007-0003","Sighting Duration":"Undisclosed","Date of the Event":"05/05/2007 02:45 UTC"}