{"Case Number":"6978","Viewing Distance":"Unknown","City":"Prescott","Date Submitted":"10/31/1959 12:00 UTC","files":["/var/www/straped/mufon/html2text/6978.html.txt","/var/www/straped/mufon/org/6978.html"],"Source":"MUFON","divs":["Sighting DetailsI was 14 years old at the time and had just left my friend's house, directly across the street from my own. It was cold (35 degrees), cloudy--no stars or moon-and no wind was apparent. As I walked down my friend's driveway toward home, I noticed a group of lights in the sky (45 degrees or more above the horizon) moving slowly from my right to my left. (I assumed I was looking at a conventional aircraft of some type.) Momementarily, I saw another group of lights close behind the first. Still another group appeared, moving with the same speed and pretty much \"following the leader.\" These objects were passing \"through\"(behind, actually) the tops of pecan and ash trees directly to my front, in a neighbor's yard. (The trees were bare of leaves.) Around this point, I yelled for my friend to come out to see these things. He and his mother both came out and observed what I did. A total of five or six objects appeared in all, following a general northeast-to-southwest track. (That's approximately parallel to East Sixth Street here in Prescott--the street that runs between our respective houses.) As the objects progressed across the sky, they eventually banked to their left, which would be toward a more southerly direction, before disappearing in the distance. We could discern no particular pattern to the lights; nor could we see an \"outline\" behind the lights. At the time, we were much impressed by two facts: the slowness with which these objects flew; I remember thinking that a Piper Cub could have outpaced them! Secondly--and more puzzling--was the absolute lack of sound! They were CLOSE to us. Our town is only about population 4000; these craft were most certainly over the city. Jet or conventional piston engine-powered craft would have made a tremendous racket! ( I stood a full 15 minutes after the objects disappeared, hoping to hear some sound. I heard absolutely nothing.) I still cannot understand that. My friend (Bill) is now an attorney in Fayetteville, AR. Several months ago, I visited him and mentioned our \"UFO sighting.\" Much to my relief he remembered it pretty much as I do: \"Five or six lighted objects moving slowly from right to left and banking at the far end of our street. And they didn't make a sound!\" Although-after 47+ years-I had trouble remembering the colors of the lights and whether or not they were blinking, my friend insists that the lights were all \"pale white\" and were NOT blinking. (We were both aviation buffs at the time; I could name all the various military aircraft of the U.S. and well as other countries. Bill gave me several reasons that those unknowns couldn't have been commercial aircraft.) Bill also reminded me that he called Little Rock Air Force Base the next day to report what we had seen. He was told, \"We'll check it out.\" Never heard anymore from them. At the time LRAFB was a SAC B-47 base, about to transition to the B-58. (I guarantee that we didn't see B-47's!) Prescott is located about halfway between Little Rock and Bossier City, LA--and Barksdale AFB (B-52's--they weren't B-52's either!) These craft moved as slowly as blimps, but even blimps would have made a lot of noise. (Besides, who ever heard of a formation of blimps--at night even.) So, what were they? I wish we could have seen them in the daylight; then there wouldn't have been any doubt. I recall watching the 10 o'clock news (a Little Rock station) shortly after our sighting. Nothing had been reported. Note: I actually wrote down my observations and thoughts at the time, and I wish to goodness I could find them now. Perhaps I'll come across them someday! Any ideas as to what we saw would be greatly appreciated. By the way, this happened on a Thursday night; it had to have been, I think, Nov. 5, 7, 19, or 26, 1959."],"Latitude":"33.802611","Weather Factors":"Unknown","Country":"United States","Region":"Arkansas","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.802611,+-93.381006(6978)&iwloc=A&hl=en\"> mufon case (6978) map </A>","Summary":"5 or 6 lighted , silent, slow-moving objects observed at night","Object Shape":"Star-like, Other","trends":["There have been no other sightings in Prescott","This sighting has never been favorited."],"Longitude":"-93.381006","Object Features":"Undisclosed","Tags":"City","Disposition":"Unknown","Date of the Event":"10/31/1959 12:00 UTC","Log Number":"US-05072007-0001","Object Flight Path":"Undisclosed"}