{"Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.690424,+-122.465148(6980)&iwloc=A&hl=en\"> mufon case (6980) map </A>","trends":["There have been 16 other sightings in Daly City","There was one other sighting in Daly City on or around May 6th 2007"],"Object Features":"Undisclosed","Longitude":"-122.465148","City":"Daly City","Country":"United States","Latitude":"37.690424","Disposition":"Insufficient Data","Date Submitted":"05/06/2007 05:50 UTC","Object Flight Path":"Undisclosed","Object Shape":"Sphere","Date of the Event":"05/06/2007 05:50 UTC","divs":["Sighting DetailsI decided to go to Corona Heights to look for UFO's in the sky. I arrived at 5:40 pm. I sweeped the entire sky in the South and East for UFO's for about ten minutes. I mostly looked at a high angle and after about ten minutes I found nothing and I was going to leave but instead I walked to the South on the Eastern most hill overlooking the city where the path with the wooden stars turn to go to the top of the hill. I looked directly South East over Dolores Park and I noticed a red sphere like object rising. My first thoughts were that the object was a balloon and a good example to test my bonoculars. After a couple of seconds the object suddenly changed direction and started flying straight towards the South. AFter a few more seconds the object started moving much faster. It also was gradually moving higher until it stopped rising but kept moving towards the South at a speed of at least three hundred miles per hour. It became very small and It was flying in the sky over Burnal Heights. At this point it looked like a tiny red spec. After it past over Burnal Heights and at that point the object was too far away for me to see in my bonoculars. When I first saw the object it was not much higher up than my elevation; It was around five hundred feet up and over a mile away. The object reminded me of a traingular UFO I saw on March 12, 2007 because it was small. I guess it was not much larger than fifteen feet in diameter. I was suprized by the object because it was so low in the sky. Low enough to deceive me into thinking it was a rising balloon. Its maximum height was less two thousand feet? It leveled off at a certain hight and flew straight; It was moving South West to the right of Burnal Heights when I could no longer see it."],"Log Number":"US-05072007-0003","Tags":"City","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/6980.html.txt","/var/www/straped/mufon/org/6980.html"],"Summary":"red sphere shaped object first rising then moving straight away at high speed","Source":"MUFON","Region":"California","Case Number":"6980"}