{"Longitude":"-119.411352","trends":[],"map":"<A HREF = \"http://maps.google.com/maps?q=36.782391,+-119.411352(6981)&iwloc=A&hl=en\"> mufon case (6981) map </A>","Sighting Duration":"Undisclosed","Object Shape":"Triangle, Other","Source":"MUFON","Object Features":"None","Date Submitted":"05/06/2007 11:03 UTC","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Tags":"City","City":"Undisclosed","Date of the Event":"05/06/2007 11:03 UTC","Weather Factors":"Does Not Apply","Log Number":"US-05072007-0004","Summary":"3 soft glowing objects in triangle formation. Broke apart into straight line","Case Number":"6981","Latitude":"36.782391","divs":["Sighting DetailsMy sister her boyfriend and myself was outside smoking ciggaretts. We were facing west. I happend to look into the night sky and immedialty knew I was looking at something not ever even remotley seen before. The formatiopn as well as the speed and lights immediatly caught my attention. I immediaty pointed up at it and shouted to my sister wtf!! do you see that!! It was \"flying\" eastward and from our view we were under it. It was 3 round soft glowing \"discs\" in a tight triangle formation with the triangle tip pointing east the 2 other objects making the bottom of the triangle. After a few seconds once we established that we all where looking at the same thing and long enough for her bf to dismiss it as possable aircraft it then broke formationn and the 2 bottom glowing \"discs\" seperated and the one that was on the bottom right stayed in same tight formation but went as if on a hinge perfectly to the side of the discs that had been the point of the triangle, simultantiously the object on the left also went out to the left side however it didnt have as tight a flight patern it kinda wavered and then got make into a single side by side line formation. At this point it then went outa view over the top of our apartment building. Mind you this was way way up and not directly low over our building. The light from these object was very soft. But bright enough to make out clearly.It was flying equal to or faster than normal aircraft. Ive seen many aircraft and I can say with out hesitaion this was craft Ive NEVER EVER seen before. There was no other color to the lights either."],"Viewing Distance":"Unknown","Region":"California","files":["/var/www/straped/mufon/html2text/6981.html.txt","/var/www/straped/mufon/org/6981.html"],"Country":"United States"}