{"Case Number":"6987","Log Number":"US-05082007-0001","Weather Factors":"Unknown","City":"Durand","Date Submitted":"06/01/1998 09:00 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.911975,+-83.984684(6987)&iwloc=A&hl=en\"> mufon case (6987) map </A>","trends":["There have been no other sightings in Durand","This sighting has never been favorited."],"Date of the Event":"06/01/1998 09:00 UTC","Object Features":"None","files":["/var/www/straped/mufon/html2text/6987.html.txt","/var/www/straped/mufon/org/6987.html"],"Sighting Duration":"Undisclosed","Longitude":"-83.984684","Object Shape":"Sphere","Latitude":"42.911975","Country":"United States","Summary":"4 - 6\" red glowing sphere hovered, menuvered, flew fast, and dissapeared","divs":["Sighting DetailsIn Durand, MI, in the spring of 1998, the sky was slightly dark and the weather was nice. My mother (about 40 then) and I (16) were in her van when she pulled onto our road. As we slowly rolled up to our driveway, I saw a 4 to 6 inch wide red glowing sphere hovering right in front of the neighbors mailbox, about ten feet away. It was swaying slightly from side to side. I said, \"What is that?\" and my mom said, \"I was about to say the same thing.\" The red orb suddenly stopped moving (like a deer staring into headlights). Then, the object started to fly away from us. I said, \"Follow it!\" We followed the sphere as it flew away in a jaged path toward an adjacent neighbors home. It was about ten feet in the air when it changed directions. The sphere quickly flew in a direct path across the road and up into the top of a pine tree (about 25 feet tall), where it dissappeared. At the moment that we lost sight of the orb, the tree was about 20 feet away. We drove around to the other side of the tree and still saw nothing. I think the sphere was initially moving at about 30 mph, and when it flew up into the tree, it moved quicker, around twice as fast. Neither of us was scared when this sighting occurred. We did not hang around to see anything else. I think the flying red orb was a spy camera or something. It is too small to be much else. I think it was checking everything out, exploring the mailbox."],"Source":"MUFON","Viewing Distance":"20 Feet or Less","Object Flight Path":"Hovering then path,Path with directional change","Disposition":"Unknown","Region":"Michigan"}