{"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Date of the Event":"07/31/2005 12:00 UTC","Sighting Duration":"Undisclosed","Disposition":"Unknown","Case Number":"6988","Region":"Nevada","Date Submitted":"07/31/2005 12:00 UTC","Country":"United States","Object Features":"None","divs":["Sighting DetailsIn August of 2005 at approximately noon during my scheduled shift as a loss prevention officer, I began routine observaton of the parking lot with my external PTZ CCTV Camera. It was a very clear day with high visibility and I often look around at the city and the surrounding mountians. I directed my camera towards a mountian near lake mead I noticed a shining object that I thought at the time was a vehicle on the side of it. I left the camera on the mountian and left my security office to get a drink when I returned I noticed the object had moved. At this time I began to observe the object and noticed it was sphere shaped and was moving very slow at times and speeding up at others. During my observation I went outside to check if I could see it from the parking lot and could not being at least 20 miles away in my estimation. I returned to the security office and continued to observe the craft it became obvious it was not a known craft had no external parts wings engines etc. During this time the craft actually dropped very close to the ground and I was able to zoom in on it. I watched the craft till the end of my shift at which time I took the whole tape home with me and I still have. During my observation I felt the craft was intelligently controlled and was either a experimental military craft or was in fact an extraterrestrial vehicle. I have seen predator drones and various jet fighters and helicopters around vegas being very close to several military bases and I can say it was somthing I have never seen. I also showed the tape to an ex airforce air traffic controller who was stationed at Nellis AFB for a couple years and he could not explain the craft."],"Viewing Distance":"Over One Mile","Source":"MUFON","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around July 31st 2005"],"Log Number":"US-05082007-0002","City":"Las Vegas","Longitude":"-115.164416","Object Shape":"Sphere","Weather Factors":"Unknown","Tags":"City","Summary":"Sphere shaped object shiny white metallic in color hovered and moved near lake mead","map":"<A HREF = \"http://maps.google.com/maps?q=36.118826,+-115.164416(6988)&iwloc=A&hl=en\"> mufon case (6988) map </A>","files":["/var/www/straped/mufon/html2text/6988.html.txt","/var/www/straped/mufon/org/6988.html"],"Latitude":"36.118826"}