{"Tags":"City","City":"Undisclosed","Longitude":"-119.412362","Country":"United States","Latitude":"36.783531","Log Number":"US-05082007-0005","Date of the Event":"05/07/2007 10:30 UTC","Object Features":"None","Disposition":"IFO","Summary":"Unusually bright star appears for 45 minutes then disappears","trends":[],"Sighting Duration":"Undisclosed","Region":"California","Case Number":"6991","Date Submitted":"05/07/2007 10:30 UTC","Object Shape":"Flash, Star-like","divs":["Sighting DetailsOn the evening of May 7th in the city of Anaheim, California, near the Disneyland area. At approximately 9:30PM Local time (PST) I observed what appeared to be an unusually bright star to the North West at approximately 40 to 45 degrees declination from the Western Horizon. I am not an astronomer, but I have some experience with stars and planets. I know that Venus is the brightest object in the sky other than the sun. This was neither Venus or the sun-- that much I know for sure. The brightness of the observed object was approximately 2 to 3 times brighter than Venus. It remained near motionless in the moonless sky as I and two witnesses observed the object. After several minutes it appeared that the object may have migrated slightly eastward. At approximately 11PM, one witness went to bed. At approximately 11:15PM the other witness went to bed. At approximately 11:30PM I noticed that the star was no longer visible. I looked around the night sky and it was no longer visible. At 40 to 45 degrees, it would have been impossible for the star to have set, in this short of time, and besides it appeared to have been slowly migrating eastward away from the horizon anyways. The apparent star-like object was gone. Several minutes later there was a bright flash across the sky, which appeared like lightning. It was a white flash or white-bluish. I got up again to see if it actually was lightning, but there were no rain clouds in the sky. There also was no thunder. This flash occurred approximately 15 minutes after the sudden disappearance of the bright object. Darron R."],"map":"<A HREF = \"http://maps.google.com/maps?q=36.783531,+-119.412362(6991)&iwloc=A&hl=en\"> mufon case (6991) map </A>","Viewing Distance":"Unknown","Object Flight Path":"Stationary","Weather Factors":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/6991.html.txt","/var/www/straped/mufon/org/6991.html"]}