{"Source":"MUFON","Disposition":"Unresolved","Object Shape":"Cylinder, Disc","Case Number":"7007","Latitude":"21.315194","Sighting Duration":"Undisclosed","City":"Honolulu","Tags":"City","Viewing Distance":"Unknown","Region":"Hawaii","Object Features":"Undisclosed","Longitude":"-157.851633","Log Number":"US-05102007-0010","Weather Factors":"Unknown","divs":["Sighting DetailsI went to the park near our home with my wife and dogs on May 6th, 2007 I think it was around 12-2pm. I was taking alot of photographs with my new camera Sony 7.2 megapixel. I set the camera at the highest setting and took two photos one of a kite flying, and one of the mountains with the clouds above them. Upon returning home I uploaded the photos into my computer as I was going through the pics I saw something strange on the left corner of the picture above the street light their was a cylindrical object laying horizontal to the ground, but about a 1000 feet over the mountains which I believe are about 1500 to 2000 feet up. As I zoomed in the hair stood up on my arms! I was a cylinder! Then I quickly looked through the other pictures when on my 3 pic I saw another strange thing in the picture. This was the picture of the kite flying, this time I see what looks like a gray disc. When I enlarged it to 200% then 400% I freaked, it was a classic saucer shaped craft! Look for yourselves and please tell me what you see. Thanks, Frank Im concerned about the quality of the pics that I send you. On my photo program (picasa) it enlarges really clear and not pixelated at all. I hope you have the same. If not let me know then maybe I can upload it right from my pic card. thanks, F"],"Country":"United States","Date of the Event":"05/06/2007 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=21.315194,+-157.851633(7007)&iwloc=A&hl=en\"> mufon case (7007) map </A>","Summary":"UFO's showed up on digital pictures I was taking at the park","files":["/var/www/straped/mufon/html2text/7007.html.txt","/var/www/straped/mufon/more/7007_submitter_file1__DSC01074.JPG","/var/www/straped/mufon/more/7007_submitter_file2__DSC01076.JPG","/var/www/straped/mufon/org/7007.html"],"Date Submitted":"05/06/2007 12:00 UTC","Object Flight Path":"Undisclosed","trends":["There have been 17 other sightings in Honolulu","There were no other sightings in Honolulu on or around May 6th 2007","This sighting has never been favorited.",""]}