{"Object Features":"Undisclosed","Viewing Distance":"Unknown","Country":"United States","Disposition":"IFO","Log Number":"US-05102007-0013","Weather Factors":"Unknown","Sighting Duration":"00:00:45","Case Number":"7010","Tags":"City","Date Submitted":"05/10/2007 10:57 UTC","trends":["There have been 27 other sightings in Gainesville","There were no other sightings in Gainesville on or around May 10th 2007"],"Latitude":"29.657764","Summary":"OK I WANT TO BE A UFOLOGISTS THIS IS SOMETHING I'VE BEEN LOOKING FORWARD TO SEEING AND IT WAS A TYPE OF FEELING I'VE NEVER HAD!","Source":"MUFON","files":["/var/www/straped/mufon/html2text/7010.html.txt","/var/www/straped/mufon/org/7010.html"],"Longitude":"-82.322936","Object Shape":"Cylinder, Flash, Oval, Square, Rectagular, Triangle, Other, Unknown","Date of the Event":"05/10/2007 10:57 UTC","divs":["Sighting DetailsOK THIS IS HOW IT BEGAN I GOT CALLED FROM MY DAD AND WE (ME AND MY MOM) HAD TO GO TO THE STORE FOR GAS AND THE LIQOUR STORE. WHEN I'M IN THE CAR I ALWAYS SCREAM UFO TO SEE WHAT MY MOM THANKS OF IT. SHE ALWAYS TELLS ME THATS NOT A UFO YOU DON'T HAVE HIGH CHANCES OF SEEING A UFO THROUGH OUT THE WHOLE WORLD. JUST GIVE IT UP. SO TONIGHT WHEN WE WERE AT THE STORE AT SPRING GLENN JACKSONVILLE,FL AS WE WERE COMING BACK TOWARDS JAX BEACH ON BEACH BLVD. I SAW A STRANGE FIGURED-SHAPE GOING IN A RATHER STRANGE DIRECTION VERY AQUIRDLY.IT HAD ABOUT 5 WHITE LIGHTS AT THE BOTTOM SIDE. AND 1 THAT FLASHED WHITE AT THE BOTTOM.I SAID MOM WHAT IS THAT SHE SAID WHERE I SAID RIGHT THERE BY THE TREES SHE SAID I THINK THATS A PLANE. I SAID MOM LOOK HOW CAN THAT BE A PLANE WHEN ITS TRAVELING FASTER THAN US NOT THAT BUT GETTING FURTHER AHEAD OF US SHE SAID I DON'T KNOW. I HAD A FEELING THAT THIS WAS NO TYPE OF MAN-MADE OR EARTH LIKE AIRCRAFT. SO I LOOKED AT IT CAREFUULY ONE MORE TIME AND SAW THAT IT WENT IN A PERFECTLY STRAIGHT HORIZONTAL DIRECTION.THEN IT SLOWLY TILTED AS IF IT WERE TRYING TO FLY SRAIGHT THRUGH THE GROUND WITH SPEED INCREASING TREES WERE IN THE WAY OF MY SIGHTING SO IT DISSAPEARED. IF THIS WAS A PLANE WHY DIDNT IT HAVE RED OR BLUE LIGHTS. IF THIS WAS A BLIMP WHY DID IT TRAVEL SO FAST. IF THIS WAS A HELICOPTER WHERE WERE THE BLADES TO IT.IF SO A JET WHY SO GIGANTIC. I'M NOT SURE HAT IT WAS AND IT COULDN'T HAVE BEEN A CRASH BECAUSE NOTHING BLEW UP. IT WASN'T A LANDING BECAUSE THERE WERE NO AIRPORTS IN THE NEXT 30 MILES OR SO IT WAS ABOUT HALF-A-MILE AWAY FROM US.WHAT WAS IT AND WHY DID IT NOT COME BACK UP? 1.I WAS IN JACKSONVILLE,FL ON BEACH BLVD. AT THE TIME I WAS LOOKING IN THE SKY 2.WHAT MADE ME NOTICE THE OBJECT WAS THE FACT THAT THE LIGHTS WERE SO BRIGHT IT CAUGHT MY ATTENTION 3.I HAD NO IDEA OF WHAT THE OBJECT WAS I THOUGHT OF ALL POSSIBILITIES BUT ALL WERE ELIMINATED 4.THE OBJECT WAS SORT OF LIKE A LONG VERTICAL DIAMOND IT'S MOTIONS WERE DIFFERENT FROM THE USUAL AIRCRAFTS I SEE IT WENT A STRAIGHT LINE ACROSS THEN STARTED TO TILT IN A DIAGONAL ANGLE AS IF IT WERE TRYING TO STRIKE THE GROUND 5.MY FEELINGS WERE VERY ODD I FELT AS IF I WAS BEING WATCHED BY SOMETHING BESIDE HUMANS MY REACTION WAS STAY CALM AND STUDY THE OBJECT HARDER WHILE YOU CAN AFTER THE SIGHTING I COULDN'T THINK OF WHAT IT COULD HAVE BEEN 6. I LOST SIGHT OF THE OBJECT UNFORTUNATELY BECAUSE OF TALL TREES THIS IS NOT A HOAX,FAKE,OR ANY TYPE OF JOKE SOMETIMES PEOPLE JOKE AROUND BUT THERES JUST THINGS LIKE THESE IN LIFE YOU JUST DONT JOKE ABOUT"],"City":"Gainesville","map":"<A HREF = \"http://maps.google.com/maps?q=29.657764,+-82.322936(7010)&iwloc=A&hl=en\"> mufon case (7010) map </A>","Object Flight Path":"Undisclosed","Region":"Florida"}