{"Longitude":"-120.012126","trends":["There has been one other sighting in Lake Tahoe","There were no other sightings in Lake Tahoe on or around May 5th 2007","This sighting has never been favorited.",""],"Object Features":"Undisclosed","Tags":"City","Object Flight Path":"Undisclosed","Disposition":"Hoax","Latitude":"39.128256","City":"Lake Tahoe","Date Submitted":"05/05/2007 07:00 UTC","files":["/var/www/straped/mufon/html2text/7013.html.txt","/var/www/straped/mufon/more/7013_submitter_file1__070505_02.jpg","/var/www/straped/mufon/more/7013_submitter_file2__070505_03.jpg","/var/www/straped/mufon/more/7013_submitter_file3__Craft050607a.jpg","/var/www/straped/mufon/more/7013_submitter_file4__Craft050607b.jpg","/var/www/straped/mufon/more/7013_submitter_file5__Craft050607c.jpg","/var/www/straped/mufon/org/7013.html"],"Viewing Distance":"Unknown","Summary":"I saw this thing in the sky at about 7 pm in Lake Tahoe. It was spinning and moving slowly. Took 2 cam phone pics.","Region":"California","Weather Factors":"Unknown","Case Number":"7013","Date of the Event":"05/05/2007 07:00 UTC","Sighting Duration":"00:01:00","map":"<A HREF = \"http://maps.google.com/maps?q=39.128256,+-120.012126(7013)&iwloc=A&hl=en\"> mufon case (7013) map </A>","Object Shape":"Other","Source":"MUFON","Country":"United States","Log Number":"US-05122007-0003","divs":["Sighting DetailsMy husband and I were in Lake Tahoe over the weekend. We left on friday afternoon and came back monday morning. On saturday at about 7 pm, I was walking out to my car to get a sweater when I saw this thing in the sky. It was pretty close I think, but still above the trees. It was moving and spinning slowly, heading towards my right. I was startled and confused at first and wanted to take a picture, but our camera was still inside so I took two pictures with my camera phone before it passed behind the roof of the house. I ran around to the other side and was yelling to my husband to come out. We came around the other side and saw it just as it was going down behind some trees. He didn't get a good look at it, but he saw enough to convince him that it was something really strange. We decided to take a drive around the area to see if we could see it again, but we never did. We didn't see it the next day either. Since we were renting the cabin for the weekend we didn't know any nearby residents but I would bet at least a few other people saw it. It was very visible and very strange looking. I was definitely a little freaked out but my husband didn't seem very bothered by it. He was more interested in it than scared. He wanted to drive around a lot longer trying to find it than I did! =) It didn't make any noise except for a very, very faint sound that is hard to describe but sounded like something vibrating. We both heard the sound although just barely. It moved in a very straight line when it went over the house but when we saw it on the other side of the house, when it was going down behind the trees, it made a very sharp turn. It didn't move like a helicopter or airplane, it was very \"exact\". We did see one person on our drive who was a few blocks away taking a walk and asked him if he saw it, and he said no. Then we asked him if he heard any weird noise and tried to describe it as best we could, and he said he might have but he wasn't sure. By this time it was at least 20 minutes since we first saw the thing so who knows. I talked to some friends over the week about sending these to a newspaper or something but a guy at work suggested I look up Mufon, so I'm starting with you guys."]}