{"Weather Factors":"Unknown","Date Submitted":"05/09/2007 10:15 UTC","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=33.816941,+-84.168386(7028)&iwloc=A&hl=en\"> mufon case (7028) map </A>","Tags":"City","Object Shape":"Other","divs":["sighting detailswhile sitting outside in the backyard on the eveneing of may 9th wed, at aprox 10:12 pm , a friend and i spotted fast moving lights in the sky .my buddy yul first noticed the light as they travelled very quickly across the sky. i did not have my glasses on and could not find the objects he was referring to. i quickly grabbed my 20 x 70 binoculars which were near by and was able to clearly see a very very bright object, brighter than any of the surrounding stars, moving very rapidly across the sky. my friend yul advised me that three had gone by prior to my viewing the fourth. the crafts seemed to be fleeing. as they were moving so fast. we could not tell if they were within our atmosphere or in space. the nearest reference point was a nearby star which the moving light passed by. i did not think these were airplanes as i have watched many airplanes fly by and none with this type of speed. the lights each seemed to dissappear shortly after passing overhead. i was very surprised to see multiple lights moving at such a high rate of speed.my friend yul was ecstatic as this was his first sighting and my second. the strange thing is that i have witnesses two sightings basically in the same region of sky. i am beginning to wonder what is it about this area of the sky \\ heavens ."],"files":["/var/www/straped/mufon/html2text/7028.html.txt","/var/www/straped/mufon/org/7028.html"],"Country":"United States","Longitude":"-84.168386","City":"Stone Mountain","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Case Number":"7028","Summary":"while outside on the evening of Monday may 9th my friend Yul noticed three objects fly by heading in the same direction- i did not see the first three. i grabbed my 20x 70 binoculars and was able to see craft # 4 as it sped in the same direction","Region":"Georgia","Sighting Duration":"Undisclosed","Date of the Event":"05/09/2007 10:15 UTC","Log Number":"US-05162007-0001","Latitude":"33.816941","Object Features":"Undisclosed","trends":["There have been 7 other sightings in Stone Mountain","There were no other sightings in Stone Mountain on or around May 9th 2007"],"Source":"MUFON"}