{"Viewing Distance":"21-100 Feet","Object Flight Path":"Path with directional change","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/7029.html.txt","/var/www/straped/mufon/org/7029.html"],"Sighting Duration":"01:11:03","trends":["There have been 4 other sightings in Rogue River","There were no other sightings in Rogue River on or around May 16th 2007"],"Tags":"City","Case Number":"7029","Log Number":"US-05162007-0002","Source":"MUFON","Date Submitted":"05/16/2007 04:18 UTC","Summary":"3 of them. Flew close to ground like a plane. strange radio communication over my car radio. loud screech from object","Latitude":"42.439304","Longitude":"-123.162678","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.439304,+-123.162678(7029)&iwloc=A&hl=en\"> mufon case (7029) map </A>","divs":["Sighting DetailsI was driving on highway 99 near Rogue River and all of a sudden, green flashes hit in front of my car as if they were shooting at me. there were three of them flying in a wege formation like the military, but i turned on my military scanner and picked up nothing. i was listining to a news show on my radio, but during the event, i herd communication over the radio. there were four voices on it. what was strange was they used call signs and they spoke perfect english. the call signs they used was Alpha 1-1, 1-2, 1-3 and command? so i followed for one hour till they shot strait up. they looked like a H if you looked at he front. ecause it from the sides, the wings were shaped like a hexagon. on the back were two red lights. there was a sphere in the center with a window in the front. I couldnt see in there it was dark. but it was obious that it was an one person craft. it was about ten meters wide and black and blew colors except the lead ship that had a mustard yellow color on the front half of the \"wings\". after the incident, i couldnt sleep. this morning, i heard military craft flying overhead at high speed. so i called a friend at Kinglesy AFB. He said that they were doing drills."],"Object Features":"Window(s), Patterned Surface, Insignia, Wings","Weather Factors":"None","Region":"Oregon","Disposition":"Hoax","City":"Rogue River","Date of the Event":"05/16/2007 04:18 UTC"}