{"Summary":"Caught UFO on Shot of Mayan Ruins @ Tulum","Date of the Event":"04/23/2006 12:06 UTC","Object Flight Path":"Undisclosed","Case Number":"7031","divs":["sighting detailsvactioning with my family on the riviera maya in mexico last year when we explored the ruins of tulum. this was on a sunday morning where the ruins are not overrun by too many tourists. most visitors were locals enjoying the free entrance, sights and beautiful beach. my oldest child and i took pictures of the ruins up and down. we ended in the afternoon swimming at the beach and otherwise enjoyed an interesting day. next day at the hotel i overheard several of the local workers talk about sightings of ufo's up \\ down the coast line near tulum but never gave it a second thought. upon returning to the states i uploaded the pictures from the digital camera to our pc. started looking at the photos when i noticed a speck in the corner of one shot. upon maximizing it i first thought it resembled a helicopter but we all remembered how quiet and peaceful the days was and did not hear any aircraft. upon further review the bottom of the craft seems to have some sort of glow and seems to be almost oscillating. my oldest has been bugging me ever since to either submit this picture to a ufo site or have a professional photograhper look into it. i'm a bit of a skeptic but i cannot seem to explain that object or the coincendence that people saw ufo's the same day the shot was taken."],"Object Features":"Undisclosed","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=20.212,+-87.466(7031)&iwloc=A&hl=en\"> mufon case (7031) map </A>","files":["/var/www/straped/mufon/html2text/7031.html.txt","/var/www/straped/mufon/more/7031_submitter_file1__Picture067.jpg","/var/www/straped/mufon/org/7031.html"],"Log Number":"MX-05162007-0004","Latitude":"20.212","Object Shape":"Square, Rectagular","Region":"Quintana Roo","Source":"MUFON","trends":["There have been 3 other sightings in Tulum","There were no other sightings in Tulum on or around April 23rd 2006","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","Country":"Mexico","Longitude":"-87.466","City":"Tulum","Date Submitted":"04/23/2006 12:06 UTC"}