{"Region":"New Jersey","map":"<A HREF = \"http://maps.google.com/maps?q=40.738967,+-74.162697(7034)&iwloc=A&hl=en\"> mufon case (7034) map </A>","Source":"MUFON","Sighting Duration":"Undisclosed","Object Shape":"Fireball","divs":["Sighting DetailsIn 1965 I was living in the city of Kearny, NJ, at 499 Belgrove Drive to be exact. The address was that of the now defunct New Jersey Boystown. I had almost a 2 year stay there from 1965 to 1967. We usually ate dinner at 5pm everyday, and as usual we had to line up outside, then walk down to the mess hall. As I waited in line I was gazing at the skyline before me (the back of Boystown faces the Passiac River and Newark) The area is much a higher elevation than Newark, so the view was great. As I looked up I saw a full moon to my upper left and settled my gaze on that for a moment. The sky was clear for a December evening...no haze or clouds. I saw a \"dot\" fly from the left side of the moon and that caught my attention! The \"dot\" got bigger and bigger by the second and it was clear to me and everyone else that this \"dot\" was a fireball! Within less than a minute it was flying in to my left and was as big as a house and flying an altitude of what a jet looks like when approaching to land. It vered a little and seemed to find a \"path\" to fly the rest of it's flight. My thought at the time was \"this can't be a meteor because it's flying horizontally\" I always thought meteors came in on a diagonal and smashed into the earth. This fireball was flying at an amazingly slow speed and I thought \"how is that thing staying in the air\"? As the event ended there was a lot of talking in line by the guys waiting to go to dinner, and we were told to settle down. Needless to say it was the talk of the night and the next day. The next day the radio said it was a meteor, and also joked that they received calls that people called it a UFO and even said they saw windows in it. That was 1965, here it is 2007 and I still remember it like it was yesterday. I hope one day the truth of my experience will come to light. Johnny"],"Date Submitted":"12/09/1965 04:45 UTC","Summary":"Photo Addendum to Prior Report of FireBall","Weather Factors":"None","Viewing Distance":"101-500 Feet","Longitude":"-74.162697","Disposition":"Insufficient Data","Log Number":"US-05162007-0007","trends":["There have been 27 other sightings in Newark","There were 3 other sightings in Newark on or around December 9th 1965","This sighting has never been favorited.",""],"Latitude":"40.738967","Country":"United States","Tags":"City","Case Number":"7034","Object Flight Path":"Undisclosed","City":"Newark","Object Features":"Undisclosed","Date of the Event":"12/09/1965 04:45 UTC","files":["/var/www/straped/mufon/html2text/7034.html.txt","/var/www/straped/mufon/more/7034_submitter_file1__SatImage2.JPG","/var/www/straped/mufon/more/7034_submitter_file2__Map1.jpg","/var/www/straped/mufon/org/7034.html"]}