{"Region":"Texas","Source":"MUFON","Date Submitted":"05/17/2007 08:14 UTC","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/7040.html.txt","/var/www/straped/mufon/org/7040.html"],"Log Number":"US-05182007-0001","Country":"United States","City":"Austin","map":"<A HREF = \"http://maps.google.com/maps?q=30.273343,+-97.738061(7040)&iwloc=A&hl=en\"> mufon case (7040) map </A>","Disposition":"Unknown","Latitude":"30.273343","Date of the Event":"05/17/2007 08:14 UTC","Object Features":"Undisclosed","Longitude":"-97.738061","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around May 17th 2007"],"Object Shape":"Star-like","Weather Factors":"Unknown","Tags":"City","divs":["Sighting DetailsI was getting out of the hot tub right at 8:30pm. This bright light caught my eye. At first thinking it was very large plane at first. But it was way to big an bright to be that far away. So ofcourse I kept whatching it. Then it dawn on me Oh my god could it be? What was it? I ran in the house to get my binocular and get a better look!! But the binocular didn't help it was jumping around to much to have a clear view. I didn't, couldn't, understand why I was still couldn't see it better! Then I said shit get the camera ran in an got back out as fast as I could!! Now ya ready for this, The pictures show something totally differnt. My camera is a nikon d-70 with the af on it couldn't focus it was going in & out. To much time was being wasted. So being VERY PUMP I started snaping!! Now here it goes the pictures of this ufo are as weird as it comes to me, I mean what I saw with my naked eyes was a very large bright ball are star like. Through the binocular the same kind of but it seem farther? The pictures well it s like this what every frame your looking at it something differnt from a metal looking cloud, a small bright upside down u, then a large or long y, with the tips of it pruple&green, then all most the same but longer, to allmost can't see it sphere light green, to a very bright in your face jagged line wide. I've look at them 3 times now while I'm tpying you an that the best I can do. Oh yes AND POOF IT THEY WERE GONE!!!! AND NO I'M NOT GOING TO DOWN LOAD THESE PICTURES. I WILL HAVE SOMEONE DO IT FOR ME TOMMOROW. COMPUTERS DOWNLOADING PICTURES AN STUFF. I'M NOT VERY GOOD AT IT , I KNOW WHAT I'VE GOT, NO MATTER WHAT ANYBODY ELSE SAYS. I KNOW WHAT I SAW. AND WHAT I SAW WAS NOT FROM HERE. YOU'VE GOT MY NUMBER CALL ME AROUND 10:30AM. I'LL MOST LIKELY HAVE THEM IN EVERY FREAKING SIZE YOU CAN GET!!!!!!!!!!!!"],"Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Summary":"large bright object very unsteady with spark or something falling from the bottom with a small ufo to its bottom left","Case Number":"7040"}