{"Log Number":"US-05182007-0001","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"05/17/2007 07:45 UTC","Region":"Indiana","divs":["Sighting Detailsi was driving west on bristol st. in Elkhart, IN. I looked up in the clear sky and i noticed a tear drop shaped object. it seemed to be heading towards the ground, but it was up really high and seemed to be falling away from me towards the western sky. It did not have a long tail, more of a stubby one... which made it look more like a tear drop to me. it was going for about 5 mins. in a downward angle, then it seemed to start heading straight out that lasted for another 13 mins or so. ..It was heading more of a western direction instead of a downward angle at this point. It was going pretty fast because i noticed the how the size was getting smaller. It continued on it's path. As i decided to turn away and start heading home, I noticed a streak in the sky... like a jet trail of another object, heading in the direction of the object i first saw. I tried watching it more, but traffice behind me started getting impatient. I lost the object through the tree line that was about 30 yards away from me. the object i saw had a surface like a jet streak. it looked like a cloud, in a tear drop shape & was obviously moving. i thought i was falling, but its velocity seemed to be carrying it towards the western sky, at a faster rate that gravity was pulling it. in the end, it no longer seemed to falling, but flying away... fast. I felt curious to see what it was. It was a clear day, so I knew others could see as well. which is why i am reporting it. I wanted to know if there was an official explanation."],"Object Shape":"Fireball, Teardrop","Object Flight Path":"Path with directional change","City":"Elkhart","trends":["There have been 12 other sightings in Elkhart","There were no other sightings in Elkhart on or around May 17th 2007"],"Sighting Duration":"Undisclosed","Tags":"City","Disposition":"Insufficient Data","Date Submitted":"05/17/2007 07:45 UTC","Country":"United States","Longitude":"-85.975277","Case Number":"7041","Weather Factors":"Unknown","Summary":"i saw a shape that looked like a comet coming down in the distant sky. i found it odd beause it was still day time and it didn't have long tail","Source":"MUFON","files":["/var/www/straped/mufon/html2text/7041.html.txt","/var/www/straped/mufon/org/7041.html"],"Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=41.689564,+-85.975277(7041)&iwloc=A&hl=en\"> mufon case (7041) map </A>","Latitude":"41.689564"}