{"Object Shape":"Circle, Oval, Star-like","Date of the Event":"05/16/2007 09:00 UTC","Viewing Distance":"Unknown","trends":["There have been 73 other sightings in Salt Lake City","There were no other sightings in Salt Lake City on or around May 16th 2007"],"Summary":"A solid black object that kept changing shape then moved and slowly shrunk in a stationary place.","Log Number":"US-05182007-0002","Weather Factors":"None","Disposition":"Unknown","Date Submitted":"05/16/2007 09:00 UTC","files":["/var/www/straped/mufon/html2text/7042.html.txt","/var/www/straped/mufon/org/7042.html"],"Object Flight Path":"Stationary,Hovering then path,Path then hovering","Source":"MUFON","Case Number":"7042","City":"Salt Lake City","Region":"Utah","map":"<A HREF = \"http://maps.google.com/maps?q=40.766209,+-111.882957(7042)&iwloc=A&hl=en\"> mufon case (7042) map </A>","Latitude":"40.766209","Longitude":"-111.882957","Country":"United States","Tags":"City","divs":["sighting detailsi was taking out the trash with a client at my place of work. i work in a facility with juveniles who are in incarceration & treatment. the sun had just gone down when we noticed an object in the sky about 40 degrees up from the horizon by the star that was the planet. the object was on the north side of the planet\\star and was large enough to be some type of object like a plane or helicopter. as the client and i looked at the object we noticed that it was not moving. the object was however unjulating and changing its shape. we thought it was a flock of birds however it was very high up in the air and it never moved, just kept changing its shape like a blob. the object was also totally black, no light however it had this edge like it was composed of something liquid. being in the western sky after sunset with the sky still bright, there should have been some type of light reflected off it however it was like the pure absense of any light. planes landing at the slc airport were coming in just under where we witnessed the object. it was about the same size as the planes coming in however it appeared to be far higher than the planes. we could not figure out what this object was. i also attempted to take a picture of this with my phone, the planet\\star would show on the display of the phone however the object would not. this was weird since the object was large enough to show. the client and i watched the object for a few minutes stay in the same place. the object then traveled to the other side of the planet\\star and took another stationary place. the time that it took to move was about 2 minutes. i took the client inside our facility. i then went back outside and continued to watch the object. it started to get smaller however it stayed in the exact same place. i watched it for about 15 minutes total. it basically just shrunk out of sight while the sky started to get darker. the entire time that i watched the object, there was nothing in the sky except the plant\\star and the occasional plane coming into land at the airport. the sky was cloud free and clear. when the client and i first went back in the building we ran into one of my coworkers taking out trash too. we told him that there was something in the sky and he asked what we were smoking outside. i saw him come back in from taking out his trash and he stated that he witnessed the object too. when i went outside i grabbed two other coworkers and told them to come look at this. they came outside with me and noticed it too as it was going out of sight."],"Object Features":"Other","Sighting Duration":"00:15:00"}