{"Disposition":"Unresolved","Viewing Distance":"Unknown","Source":"MUFON","Longitude":"-81.242868","Tags":"City","divs":["Sighting Detailssitting in a park with a friend...first saw 3 or 4 very dim almost translucent grey type lights (like a small spot light on the clouds but was a clear night out) going NE to N direction. I saw them but friend didnt... 30 seconds later another set whent by with no sound traveling across the horizon in about 4 seconds. We eventually over about 20 min saw roughly 10-12 sets of these lights including one set that had about 10 lights in a V duck looking formation that change shape. There was also a set of 3 or 4 that went about 2 times faster then all the other ones..that was very scary then they stoped for about 40 min then as we walked home we saw them 2 more times heading over the east end of the city of london Ont. My friend called her mom who lives about a 4 min drive away in the direction these lights were going...she said she saw them but with a few seconds delay. these were NOT airplane or star looking lights..they where like dim-shadowy sillouets coming from nowhere. This is no joke...it rattled me and her and we are 100% confident it was nothing man made. It looked nothing like a plane, weather thingy,satelite or anything like that..this is scary cause they all went north from all diferent directions and they sometimes changed formation or crossed over eachother and or converged togtether...one I noticed was oscilating almost (shaking)."],"Date Submitted":"05/18/2007 11:00 UTC","Log Number":"CA-05192007-0002","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.982698,+-81.242868(7044)&iwloc=A&hl=en\"> mufon case (7044) map </A>","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/7044.html.txt","/var/www/straped/mufon/org/7044.html"],"Case Number":"7044","Latitude":"42.982698","Summary":"Dim spooky lights (about 40) flying over city","Object Flight Path":"Undisclosed","City":"London","Object Shape":"Triangle, Other","Date of the Event":"05/18/2007 11:00 UTC","Weather Factors":"Unknown","trends":["There have been 32 other sightings in London","There were no other sightings in London on or around May 18th 2007"],"Country":"Canada","Region":"Ontario"}