{"Object Flight Path":"Straight-line path","Region":"Illinois","files":["/var/www/straped/mufon/html2text/7046.html.txt","/var/www/straped/mufon/org/7046.html"],"Case Number":"7046","Object Features":"None","Country":"United States","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","divs":["Sighting DetailsAfter noting the object travel NE in direction and out of our view into a cloud . we then noted a track in the night sky traveling in the same direction. After it was past we heard a big boom. The track was like one sees when the hot exhaust of a plane hits cold upper air....unlike skywriting which is broad, this was a narrow track. Having lived two blocks from Northrup Aviation in Hawthorne CA in my teens, the boom was not unlike what we'd hear when planes would break the sound barrier.......and at Chicago's Air & Water Show in the summer. We were out in the yard looking up and admiring the proximity of Venus to the crescent moon........and then wham. My son was quite excited at seeing \"we don't know what\".......he estimated it's speed as contrasted by the usual planes traveling overhead. He noted that the fiery ball cut a hole in one of the clouds.......I asked him where the nearest military installation was...because of the jet following the object. He said Rantoul . Rantoul is south of us.....I'd have to lookat a map to see if its SW. I"],"Log Number":"US-05192007-0003","Summary":"standing in yard noted fiery red circular object traveling NE at speedy clip","Date Submitted":"05/19/2007 08:54 UTC","Date of the Event":"05/19/2007 08:54 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.88003,+-88.007844(7046)&iwloc=A&hl=en\"> mufon case (7046) map </A>","City":"Lombard","Longitude":"-88.007844","Latitude":"41.88003","trends":["There have been 5 other sightings in Lombard","There were no other sightings in Lombard on or around May 19th 2007"],"Disposition":"Unknown","Tags":"City","Weather Factors":"None","Object Shape":"Circle, Fireball, Sphere"}