{"Object Shape":"Flash, Star-like, Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=35.424772,+134.254642(7054)&iwloc=A&hl=en\"> mufon case (7054) map </A>","Case Number":"7054","trends":["There have been no other sightings in Yazu District","This sighting has never been favorited."],"divs":["Sighting DetailsDear MUFON investigator, I hesitate to bring this to your attention, as I am one who often prefers to look for a rational explanation for many of these so-called \"Phenomena\", however i could find no such reasoning for what had befallen me on this night, nearly a month ago now. I was sitting on my back porch, listening to Neil Diamond and Billy Idol, while sipping on my champagne and rocking in my rocking chair. It was a relatively quiet night, with only a few kookaburras in the background, and the faint cry of a dingo. My wife, by this time, had since retired to bed, and i was not yet heading that way myself, as i still had much to complete from my days work. I was alerted by my dearest pet cat to a strange goings on in the night sky, and to my bemusement and wonder I happened to notice an Unidentified Flying Object, known as a UFO. It was in the shape of a triangle, or so I assumed, as all I could see of it were a red, yellow and white flashing lights at each 'corner'. It was travelling at a steady pace across the night sky, in a westerly direction. I estimated that it was approximately 1400 metres in the air (this is merely an estimation, as i had no real point of reference at the time) and was decending at a uniform pace. It is my guess that about 10 kilometres down the road in the direction it was travelling, the craft would have collided with the earth, however i was unable to see this as it dissappeared behind the treeline. The whole incident lasted less than 5 minutes, and it left me confused and scared. However, I have not reported this to anyone as it was not reported in the news, and no mention was made of it by my friends. Unfortunately, i had not the presence of mind to take a photo or recording of the object. I hope this was helpful, Hermon Sniggerfield."],"Region":"Tottori Prefecture","Date of the Event":"04/26/2007 11:24 UTC","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Latitude":"35.424772","Date Submitted":"04/26/2007 11:24 UTC","files":["/var/www/straped/mufon/html2text/7054.html.txt","/var/www/straped/mufon/org/7054.html"],"Summary":"Tri-coloured flashing lights moved across the sky in a direction of east to west.","City":"Yazu District","Country":"Japan","Tags":"City","Weather Factors":"Unknown","Disposition":"Unresolved","Source":"MUFON","Log Number":"AU-05202007-0008","Sighting Duration":"00:04:27","Longitude":"134.254642","Object Features":"Undisclosed"}