{"Sighting Duration":"00:20:00","Disposition":"Unknown","Object Flight Path":"Path then hovering","Longitude":"-85.593124","Date of the Event":"12/20/1975 12:00 UTC","Region":"Indiana","Viewing Distance":"21-100 Feet","Object Shape":"Disc","Tags":"City","Log Number":"US-05212007-0001","Summary":"We had a very close-up look at a flying saucer in Indiana in the winter of 1975.","divs":["Sighting DetailsMy cousin, Desi, was driving and his wife, Rita, was in the back seat. We were on the I-80 eastbound in Indiana about 10:15 PM heading back to New York for Xmas. They were arguing about a light in the distance, off to our left. Desi said it was the top of a tower; Rita said it was moving. After a few minutes watching the light, you had to admit that it was moving. Sometimes it would move very quickly forward, then stay in one spot for a while, then move slowly backwards, then stay in one spot for a while again, then move forwards quickly again. Occasionally, a light would flicker rapidly, maybe a blue or green light, not like an airplane light that goes on and off. It seemed incandescent. After about 10 minutes of watching this light, Desi pulled into a gas station to fill-up. We weren't even talking about this light. When we got back on the road, Rita was driving and Desi sat in the back. Rita spotted it again, and this time it was closer because it was brighter. Then, suddenly, it zipped across the I-80 and stayed in one spot. When we approached it, I rolled the window down, so that there would be no reflection. Desi and I stuck our heads out the window. It was about 30 yards off the highway, about the height of a water tower. It was saucer-shaped with windows around it, and what appeared to be lights on top, although they were not lit. After we passed it, Desi and I were about to start looking through the rear window when it took off in a flash. With no sound, and extremely fast, it was gone. We were all amazed that we had actually seen a flying saucer. It sure didn't seem like anything our government was building and operating. We weren't scared or anything. It was more a feeling of awe."],"City":"Undisclosed","Source":"MUFON","Case Number":"7055","Latitude":"40.554976","Object Features":"Window(s)","Date Submitted":"12/20/1975 12:00 UTC","trends":[],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.554976,+-85.593124(7055)&iwloc=A&hl=en\"> mufon case (7055) map </A>","files":["/var/www/straped/mufon/html2text/7055.html.txt","/var/www/straped/mufon/org/7055.html"],"Weather Factors":"Does Not Apply"}