{"trends":["There have been 7 other sightings in West Lafayette","There was one other sighting in West Lafayette on or around May 21st 2007"],"Longitude":"-86.901486","divs":["Sighting Detailswhile driving to west lafayette from the northwest -state hwy 52. i slowed down to flash my brights on a truckdriver that was slowed to the side of the shoulder. i happened to glance up to the sky to see a series of three lights, in a horizantal pattern. fade to black, one after another, from left to right.extending my arm and flashing a peace sign, mid way between the horizon and straight up, will aproxamate the distance all the lights were spread out. at the next traffic signal, in west lafayette. i happened to have driven in front of, and passed the truck driver. i got out of my vehicle and asked him if he saw something unusual in the night sky. he replied that he had. i asked him if he would mind turning into the menards parking lot and telling me about what he saw. he said not at all. he went on to further state that it might have been in the aprox. area of grissom air base. near peru, indiana. he saw 3 or 4 yellow lights one to the left middle and right. in a straight horizantal line. when they went out, he said they appeared to fade out, one by one. the truck driver and i both confirmed to one another we had not seen anything like this before. the weather was clear, stars were clearly visable."],"Latitude":"40.427079","Object Features":"None","Date Submitted":"05/21/2007 12:00 UTC","City":"West Lafayette","Source":"MUFON","Country":"United States","Date of the Event":"05/21/2007 12:00 UTC","Region":"Indiana","Weather Factors":"Unknown","Case Number":"7059","Tags":"City","Object Shape":"Other, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.427079,+-86.901486(7059)&iwloc=A&hl=en\"> mufon case (7059) map </A>","Disposition":"Unknown","Object Flight Path":"Stationary,Other","Sighting Duration":"Undisclosed","Log Number":"US-05222007-0001","files":["/var/www/straped/mufon/html2text/7059.html.txt","/var/www/straped/mufon/org/7059.html"],"Viewing Distance":"Over One Mile","Summary":"unusual sequence of lights in the night sky"}