{"trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around July 4th 2003"],"divs":["Sighting DetailsIt happened on July 4 2003, on the roof top of my sister's old building in Manhattan. The building is located on the corner of Amsterdam & 60th st. I had gone up on the roof to see some fireworks that had been going off in the vicinity of central park. Upon looking toward the park area, I took a look over to the right and saw a perfectly round, about 4ft. in diameter ball, sphere, orb, etc. It appeared to be orange (a lite glow), but transparent with a smoke or gas inside. The reason it caught my eye, was because it was slowly floating uptown toward us on Amsterdam Avenue, at around the same elevation (maybe a floor higher) then we had been on. This means it was under the rooftops of some of the surrounding buildings. So hear it was floating between the buildings and up the avenue in a slow straight line. This is what made me more curious. I tapped my friend who started watching it too. We were making guesses at what it could be. I thought a may be some big round balloon or beach ball with helium in it, but there was no nub or string from it. It had no distinctive colors. Just that smokey orange glow. The other thing was it didn't move with the wind as would a balloon. It just slowly floated by in a perfect straight line. Then it disappeared behind an adjacent building to the Northeast. I was wondering if anybody could see it right outside there windows. I no longer could see it, when just then a firework went off and lit up the sky. I saw the orange orb now floating in a straight line East, and away from us. It was still creeping slow and between the buildings, but now it made a 90' turn and was heading East on 60th st. toward the park and the fireworks. A second after that the hospital building across the street cut off my view. After that experiance, I just kept thinking of what it could be. I wasn't scared when it happened, I was just observing. I sometimes think that this thing was doing the same. In all my life I've never seen anything like that. It made a believer out of me. My friend was laughing (as in disbelief) about it, as if we had made a new discorvery of some sort. It was like seeing bigfoot. It was something said to not exist. Something many people claim they've seen, but still a piece of you is a sceptic. Now I feel like I'm the crazy one, because I still don't know what I saw that night. It's taken me a long time to come forward, but I still feel as though I need an answer. Now I have a greater interest in the UFO world. Upon browsing for answers, I came across this web sight that I never knew of. Now I'm sending you in hopes that I may get some sort of answer to what this might have been. Does the government really know of these things, or even care? Is it taken seriously? Will I be looked at as crazy? Will anyone even read this? Are there others who have reported this, or something like this? Will I ever get an answer to these questions? Please help to enlighten me on this subject."],"Region":"New York","Log Number":"US-05222007-0004","Object Shape":"Sphere","Sighting Duration":"Undisclosed","Tags":"City","Date Submitted":"07/04/2003 10:00 UTC","Longitude":"-73.95673","files":["/var/www/straped/mufon/html2text/7062.html.txt","/var/www/straped/mufon/org/7062.html"],"Summary":"Me and my friend both saw a floating orange orb","map":"<A HREF = \"http://maps.google.com/maps?q=40.784654,+-73.95673(7062)&iwloc=A&hl=en\"> mufon case (7062) map </A>","Object Flight Path":"Path with directional change","City":"New York","Viewing Distance":"21-100 Feet","Date of the Event":"07/04/2003 10:00 UTC","Case Number":"7062","Object Features":"Other","Latitude":"40.784654","Disposition":"Unresolved","Source":"MUFON","Weather Factors":"None","Country":"United States"}