{"Source":"MUFON","Sighting Duration":"00:10:00","Date Submitted":"05/22/2007 05:46 UTC","Log Number":"AU-05222007-0008","Object Features":"Undisclosed","Tags":"City","trends":["There have been 15 other sightings in Adelaide","There was one other sighting in Adelaide on or around May 22nd 2007"],"Object Flight Path":"Undisclosed","Summary":"What seemed to be a UFO on fire.","map":"<A HREF = \"http://maps.google.com/maps?q=-34.921336,+138.601535(7067)&iwloc=A&hl=en\"> mufon case (7067) map </A>","Disposition":"Unresolved","Longitude":"138.601535","Date of the Event":"05/22/2007 05:46 UTC","divs":["Sighting DetailsI had just gotten off work at 5:40pm and was heading home along a dirt path. It was the usual shortcut that I took home after work so that it didn't take me a half hour to get home. I looked up the sky and noticed that the sun was beginning to set and that soon it would be dark, so I picked up my walking speed so that I wouldn't be left walking at night. Just as I was reaching the end to the dirt road I looked up at the sky again and noticed what appeared to be a dark metallic object on fire in the sky. I thought that it was a meteor, but as I focused harder I noticed that it began swaying from side to side, as if it had lost control. I looked at my watch and saw that the time was precisly 5:46pm. As I watched the cigar shaped object swaying from side to side I felt like I was witnessing something truly astounding that made my heart race. After ten minutes the fire that had engulfed the object ceased, and the dark metallic object stopped swaying and straightened up. I couldn't believe what I was seeing. Then, before I could do anything the object hovered into the sky for a few metres and then disappeared completely. After that I quickly ran home to tell my family of the event that had occured, but they said that I was crazy and should rest. I was upset that they didn't believe me, and was saddened deeply after the object had disappeared. That night my dreams were full of the object in the sky, and the next day I went around my neighbourhood, asking if others had seen the same thing. A married couple living across the street from me said that they noticed an unusually bright object in the sky but took no real notice to it. I knew that I had to report my sighting. Yours faithfully, Matt."],"Country":"Australia","Object Shape":"Cigar, Fireball","Viewing Distance":"Unknown","Region":"South Australia","Weather Factors":"Unknown","City":"Adelaide","Case Number":"7067","files":["/var/www/straped/mufon/html2text/7067.html.txt","/var/www/straped/mufon/org/7067.html"],"Latitude":"-34.921336"}