{"map":"<A HREF = \"http://maps.google.com/maps?q=39.984651,+-86.112074(7087)&iwloc=A&hl=en\"> mufon case (7087) map </A>","divs":["Sighting DetailsThis happened 5-23-07 at 10:15 pm. My boys and I had just finished watching American Idol which ended at 10 pm est. After the show I went to check the doors to make sure they were locked and we were all going to bed. When I got to sliding door in back of the house I noticed that the planet Venus was visible again so I went outside to look at in my back yard. I looked at it and the moon which was to upper left of the planet(I presume it was Venus). It was a clear sky and I thought it would be neat for the boys to see this so I went back into the house and called the boys down to take a look at a planet. So we all went back outside and looked at it. As we were looking at it my oldest boy said what is that? and ofcourse I said what and he pointed to the north our right. When I looked I saw two points of light that were spaced apart and the second was flickering eratically and real fast which I thought was odd. They were both moving fast headed south towards Indianapolis. The flickering pattern was inconsistent unlike a normal jetliner. The second light vanished and I said where did it go but the first light was still moving( I can't remmeber if the lead light was flickering). Then the second light reappeared and again behind it but somewhat above and behaving eratically and again the flickering which I can only describe as like \"machine gun fast\" and it seemed like it was moving in zig zag but still behind the first light. I made the comment to my son it seemed like it was chasing it. We watched this for about 10 seconds as they both flew south and the trees and our house blocked our view so we ran around to the front and they were gone. We kept looking for 20 more minutes but nothing. Ofcourse we were saying it must be a plane or something but as we kept looking we saw a normal plane with normal lights and very consistent which was clearly different then what we saw. One last thing there was no noise,only white points of light no other colors and these things were clearly flying and moving fast."],"Date of the Event":"05/23/2007 10:15 UTC","Viewing Distance":"Unknown","Region":"Indiana","Summary":"Not Provided","Disposition":"Unknown","Tags":"City","Object Features":"Undisclosed","Source":"MUFON","Latitude":"39.984651","Date Submitted":"05/23/2007 10:15 UTC","Sighting Duration":"Undisclosed","Log Number":"US-05242007-0004","files":["/var/www/straped/mufon/html2text/7087.html.txt","/var/www/straped/mufon/org/7087.html"],"Longitude":"-86.112074","Country":"United States","trends":["There have been 10 other sightings in Carmel","There were no other sightings in Carmel on or around May 23rd 2007"],"City":"Carmel","Case Number":"7087","Object Flight Path":"Undisclosed","Object Shape":"Unknown","Weather Factors":"Unknown"}