{"Sighting Duration":"01:10:00","map":"<A HREF = \"http://maps.google.com/maps?q=30.697627,+-88.035514(7093)&iwloc=A&hl=en\"> mufon case (7093) map </A>","files":["/var/www/straped/mufon/html2text/7093.html.txt","/var/www/straped/mufon/org/7093.html"],"divs":["Sighting DetailsMy grandson and I were fishing apx 16 miles offshore south of dauphin island. We were watching the stars, it was a very clear night. There were 3 stars that were overhead that we watched come across the sky for about an hour. Standard ark across the sky. Well then one of them started to move very rapidly in many different directions,90 degree turns and that sort of thing. and then it was joined by two others that came from space. It was like they were doing a dance in the sky for us,going in every direction at very fast speeds and stopping. looking like stars again.This took place for over an hour,we had stoped fishing and just watched. then all three headed up and out into space. my Grandson was very surprised as he had never seen them before I was not so surprised as I have seen them before on four other nights,I have fished offshore for many years. I also have documentation of inplants in my brain, and memorys of being abducted sence the age of five.This also happend to my father,he could never come to terms with this, and had a very hard time with it. This is the first time that I have told anyone other than those close to me. my wife has had a hard time with this for 30 years,it has made me diffrent from others."],"Disposition":"Unknown","Weather Factors":"None","Viewing Distance":"Over One Mile","Region":"Alabama","trends":["There have been 19 other sightings in Mobile","There were no other sightings in Mobile on or around July 16th 2004"],"Object Shape":"Circle, Star-like","Summary":"At first it looked like any other star just brighter,then when it moved and the others came they were much brighter and changed colors to yellow,ornge and brite white.","Object Features":"None","Source":"MUFON","Longitude":"-88.035514","Tags":"City","City":"Mobile","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering,Other","Case Number":"7093","Date of the Event":"07/16/2004 10:15 UTC","Latitude":"30.697627","Country":"United States","Log Number":"US-05262007-0001","Date Submitted":"07/16/2004 10:15 UTC"}