{"City":"Portsmouth","divs":["Sighting DetailsI was on my deck in back of my house. I was with my neighbor and my daughter. I looked up and said hey what is that. My neighbor said it was a sattelite, I said no way it's too low to be a sattelite. So for second there I thought he may be right. I kept following this object with my eyes. Just as it was all most out of view. A white flash of light came from the object about ten times the size of the object itself and then it was gone or out or view. This object looked liked it was about 30,000 ft. up right about where commercial airlines fly, which go over my house frequently and I know their flight path. This object was traveling quite fast and opposite of airline flight paths. I've seen sattelites before and they are usually hard to spot and the moon was bright that night so it would be even harder to spot. This object was pretty easy to see. My daughter also saw the flash of light, my neighbor did not because he was trying to explain that it was a sattelite and he wasn't looking."],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/7097.html.txt","/var/www/straped/mufon/org/7097.html"],"Latitude":"43.075625","Object Shape":"Star-like","trends":["There have been 11 other sightings in Portsmouth","There were no other sightings in Portsmouth on or around May 26th 2007"],"Longitude":"-70.753513","Tags":"City","Viewing Distance":"Unknown","Region":"New Hampshire","Disposition":"IFO","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=43.075625,+-70.753513(7097)&iwloc=A&hl=en\"> mufon case (7097) map </A>","Country":"United States","Case Number":"7097","Summary":"on back deck of my house, I was looking up in the sky and I saw a white light going by, like a sattelite, but it was too low.","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Date Submitted":"05/26/2007 09:30 UTC","Log Number":"US-05272007-0003","Date of the Event":"05/26/2007 09:30 UTC","Source":"MUFON"}