{"Date of the Event":"05/31/1964 11:00 UTC","trends":["There have been 579 other sightings in New York","There were 2 other sightings in New York on or around May 31st 1964"],"Object Flight Path":"Hovering then path,Path with directional change,Path then hovering,Other","Region":"New York","Weather Factors":"None","Case Number":"7101","Latitude":"40.655","Object Shape":"Blimp, Disc","Viewing Distance":"21-100 Feet, 501 Feet - 1 Mile, Unknown","City":"New York","Sighting Duration":"Undisclosed","divs":["Sighting DetailsIt was the begining of the summer of 64 late in the evening. I was sitting on my front porch as I have done many times and just enjoying the warm evening and watching the stars. I lived in Sheepshead Bay so it was common to observe the incoming flights to JFK airport which I also would would follow as they made their approch pattern before landing. On this particular night this one light in the far distance was not following the normal approch course which caused me to follow it more intently. It was moving from south to north turning than north to south. Thought it was stange but it appeared to have airline flashing lights so I kept watching waiting for it to form a normal landing pattern. As it got closer I than observed the flashing lights started to take the shape of what then looked like a blimp with scrolling letters but there was no letters? So I keep staring at it waiting to see what message it might be displaying. All along beliving at that point it was a blimp as it had no sounds and was common to see over Manhattan & Brighten beach but never in the evenings. I continued it slow back and forth flight pattern disappeared breifly (vision blocked by the homes)until it finally came several yards from my house just above what seemed like several 100 yards up and a span of several houses. At that point I could see the object clearly. Still in disbelief of what I was looking at I walked down my steps and stared at it for I don't know how long with a 100 thoughts running thru my mind of what it could be until the realization that it wasn't a blimp, a film prop, etc. etc. and a cold chill of fear ran thru me. I ran back to my house and locked myself in and turned of the lights (lol I was a kid, who thinks)After awhile I got up enough nerve to go to the window and peek out, it was gone. I check both the front and back but could not see it. My parents were out that evening and I sat in the dark waiting for them to return and when they did I hystericaly blurting out what I saw. Needless to say they ignored it. From the distance it appeared to look cylindrical with flashing strobbing lights but once it was close enough to see it was circular with the lights (retangular pane's) along the rim, there was no sound except for possibly the sounds of wind moving as it hovered motionless above me. The underside was flat but had an irrgular pattern. OK, here's the kicker, a few nights later I was at a party when I overhear a young man talking about UFO's so of course I began to listen to what he was say and interupted his conversation with I just saw one. He immediately responded with so did he and described exactly as I have. Turned out he also lived several blocks from me although I had never meet him before but he was sitting on his back porch when he also noticed the irregular movements and started to watch it as well. Those memories have lingered in my mind and every time I by chance turn on a show relating to UFO's I keep hoping someone has documented it or has an explanation for what we had observed that night."],"Source":"MUFON","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.655,+-73.94596(7101)&iwloc=A&hl=en\"> mufon case (7101) map </A>","files":["/var/www/straped/mufon/html2text/7101.html.txt","/var/www/straped/mufon/org/7101.html"],"Log Number":"US-05272007-0007","Summary":"watch for over an hour at a distance as it snaked back and forth moving slowly and closer","Disposition":"Unresolved","Longitude":"-73.94596","Object Features":"Patterned Surface, Other","Tags":"City","Date Submitted":"05/31/1964 11:00 UTC"}