{"City":"Mobile","trends":["There have been 19 other sightings in Mobile","There were no other sightings in Mobile on or around September 14th 1991"],"divs":["Sighting DetailsMy father and step-mother had just picked me up from my mother's house on Dauphin Island Parkway. I lived with them during the school year to attend a better highschool in their area. We often drove along Mobile Bay on Bayfront Road to calm my younger half-brothers and get them to go to sleep. We were driving along very slowly looking out into the water between the trees when we came upon the first big opening. There we saw a white craft hovering above the water, barely twenty yards off the coast. The first thing that came to mind was, \"oh my God! Is this real?\" My brothers were screaming with exctiement, hell we all were. I remember a lot of, \"do you see that?\" and \"what is it?\". My father and step-mother were wearing the same jaw dropped expression as we were. My step-mother, who was driving the van, pulled over and we observed the craft for about forty-five minutes. It made no movements at all, it just hovered over the water. There was a light shining down into the water from below the craft as well as several other lights mounted along the surface. It stood straight up and down and resembled what I would call a \"Tylenol\" capsule. We could see some form of writing along one side of the craft, illuminated by one of the lights on the craft. The writing was red in color and appeared to be some kind of symbols. At one point I popped open the side door and tried to get out. I wanted to get a closer look but was rather harshly told to get back in the van by my father. We argued back and forth for a few minutes but he wouldn't budge on his position so I closed the door. I'd estimate that the craft was thrity feet from top to bottom and roughly half that wide. There was what seemed to be a window near the center of the craft with bright white light coming from it. There was also what I thought looked like a small runged ladder on one side. I'd say it was maybe five feet in length striaght up and down and to the right of what appeared to be the window. I recall a faint sound coming from the craft but nothing booming that I would associate with a helicopter or airplane, more like a dull humming. The water below the craft did ripple though. After about forty-five minutes my father and step-mother decided we had seen enough and cranked up the van and pulled off from the shoulder of the road. My two brothers and I looked back to see if the craft was still there and it wasn't. We then looked into the sky and saw a bright white light, probably a mile or more high. As we headed down dauphin island parkway the object seemed to be following us. We made a quick stop at a grocery store and my father, I and my two brothers remained in the van and watched the object hovering high above in the sky. My step-mother returned and we headed for their home in the Emogene Street and Sage Avenue area. We could still see the object in the sky and as we turned onto their street the object seemed to descend to about thirty feet above the treetops. When we pulled into their driveway, we watched the object disappear over the trees as it headed towards the park directly behind thier house. As we exited the van we headed into the house and my father, brothers and I immediately went into the back yard to see if we could view the craft. It was nowhere to be seen. That was the last we saw of it. In the months after, there were a number of strange things that happened in that house. Things that frightened me and give me chills to this day. I went to live with my mother shortly afterwards and my father and his family eventually moved from the house. This all happened from about 8:45 P.M. until we arrived at their home at about 10:30 P.M."],"Tags":"City","Latitude":"30.700847","Case Number":"7106","Object Features":"Window(s), Insignia, Other","Region":"Alabama","Object Flight Path":"Stationary,Hovering then path","Date of the Event":"09/14/1991 08:45 UTC","Viewing Distance":"21-100 Feet","Country":"United States","Weather Factors":"None","Date Submitted":"09/14/1991 08:45 UTC","Object Shape":"Other","Sighting Duration":"Undisclosed","Disposition":"Unknown","Log Number":"US-05282007-0001","Summary":"UFO encounter started along Mobile Bay on Bayfront Road near Nan Seas.","Longitude":"-88.035324","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=30.700847,+-88.035324(7106)&iwloc=A&hl=en\"> mufon case (7106) map </A>","files":["/var/www/straped/mufon/html2text/7106.html.txt","/var/www/straped/mufon/org/7106.html"]}