{"Object Features":"Other","files":["/var/www/straped/mufon/html2text/7107.html.txt","/var/www/straped/mufon/org/7107.html"],"Longitude":"75.007808","Country":"India","Sighting Duration":"00:05:00","Weather Factors":"Unknown","Source":"MUFON","divs":["sighting detailsit was april end but i can remember the exact date. even it has been more than 6 years i am submitting this information to you. because at that time i didnt knew of such internet facilities and doesnt knew that ufo are available online. so let me start my story... i and my 2 friends were sitting outside in front of our room in dharwad ( a city in karanataka in india). i was studying my secondary in this city and i was staying with my roomates i a room. we were sitting outside our room on the road. there was a heap of sand on the road which was put for some construction work. i and my two friends were chatting about some matters. suddenly our room owners son came out of his house for pissing. he was pissing on the road and we were teasing him. after that we turned our attention and were busying chating. suddenly that little boy pointed to the sky and said \" see ........ a big aeroplane....!\" he shouted. at once we three looked at the sky and saw a strange object. it was not a neither a plane nor a chopper. but was in triangular shape with 3 lights on each end... it was so close that i would have caught it if i was on a 2-storei building. it was cruising towards a hill on which our college was located.. we chased it upto 4-5 minutes.... but we couldnt climb the mountain so fast. and it was approx 30-40km\\hr moving faster... at last we climbed the mountain after 20 minutes suspecting that it would have landed on the mountain......but it was not there.. it dissappeared in the clouds..... that was mind blowing. we were sure it was a ufo(non-human made). the whole night we didnt slept..... morning we shared these experiences with our friends... no one beleieved. but we 3 were confident. next day a daily news paper reported a ufo sighting. and after that every one beleived."],"map":"<A HREF = \"http://maps.google.com/maps?q=15.458924,+75.007808(7107)&iwloc=A&hl=en\"> mufon case (7107) map </A>","Object Shape":"Triangle","trends":["There have been no other sightings in Dharwad","This sighting has never been favorited."],"Summary":"It was a trianglur UFO. With 3 lights on each corner...with no sound","Latitude":"15.458924","Date Submitted":"04/16/2000 11:30 UTC","Case Number":"7107","City":"Dharwad","Object Flight Path":"Undisclosed","Date of the Event":"04/16/2000 11:30 UTC","Disposition":"Unresolved","Viewing Distance":"Unknown","Tags":"City","Log Number":"IN-05282007-0002","Region":"Karnataka"}