{"Region":"Tennessee","Weather Factors":"Unknown","Longitude":"-82.353473","Object Features":"Unknown","City":"Johnson City","Object Flight Path":"Path with directional change","Country":"United States","Viewing Distance":"Over One Mile","divs":["sighting detailswhile out with a couple of friends having diner on 5\\24\\07 i saw something very strange in the sky over johnson city, tennessee. we were sitting on the patio of the restaurant and i happened to look up at the sky and see what initially looked like a commercial jet's landing lights turn out. as it got closer it all of the sudden got very bright and increase in size dramatically. i would guess that the object was about 15,000 feet in altitude when i first saw it, but it's hard to tell when you don't know the size of the object. anyway, after about 5 seconds at it's brightest and biggest point, it immediately shot straight into the sky at an incredible rate of speed until it was merely a pinpoint of light about the size of a very distant star. it continued to move slowly at that point until it was out of view completely. i barely had time to mention it to my friends before it was too small to see, so as far as i know there were no other witnesses near me. i did not notice any other lights on the object and am quite certain that it was not a airplane, and it certainly moved faster and in a way that i've never seen a traditional aircraft move. all i had available to me was a camera phone and knew that it would not capture anything useful. i have no doubt that i saw something amazing and beyond the norm. truely remarkable."],"Date of the Event":"05/24/2007 10:00 UTC","Date Submitted":"05/24/2007 10:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.31344,+-82.353473(7109)&iwloc=A&hl=en\"> mufon case (7109) map </A>","Case Number":"7109","Log Number":"US-05282007-0004","Sighting Duration":"00:00:45","Latitude":"36.31344","trends":["There have been 7 other sightings in Johnson City","There were no other sightings in Johnson City on or around May 24th 2007"],"Tags":"City","Object Shape":"Star-like, Unknown","Disposition":"Unknown","Summary":"Strange moving light in sky above Johnson City, TN","files":["/var/www/straped/mufon/html2text/7109.html.txt","/var/www/straped/mufon/org/7109.html"],"Source":"MUFON"}