{"City":"Tacoma","Object Shape":"Circle, Fireball","files":["/var/www/straped/mufon/html2text/7112.html.txt","/var/www/straped/mufon/more/7112_submitter_file1__5.28.07ufoTacoma.JPG","/var/www/straped/mufon/org/7112.html"],"Sighting Duration":"Undisclosed","Disposition":"Unknown","Log Number":"US-05292007-0001","trends":["There have been 29 other sightings in Tacoma","There were no other sightings in Tacoma on or around May 28th 2007","This sighting has never been favorited.",""],"Object Flight Path":"Straight-line path","Country":"United States","Case Number":"7112","Region":"Washington","Tags":"City","Object Features":"Unknown","divs":["sighting detailsi went outside my back porch to gather some herbs for a late dinner. when i was heading back into the house, i noticed a rather large reddish-orange\\yellow round object near the moon. it looked really unusual so i stopped to watch it. it appeared to move slowly westward in the sky. i got excited so i yelled for my husband to come here quickly! he also thought it was very peculiar so he went in to grab the camera, while i did not want to take my eyes off it. it looked like a fireball to me, but it moved so slowly and in a controlled fashion from east to west. i suspect it was not a meteor. it definitely was not an airplane or helicopter. it was completely silent. i stayed to watch it as it faded from sight, still hight in the air several minutes later. i wonder if anyone else saw this thing? i saw it from the tacoma area, on the south end of tacoma. it appeared brighter with the naked eye than the picture i have included. by the time he got the camera, it was further away than when i first saw it."],"Date of the Event":"05/28/2007 09:30 UTC","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Latitude":"47.255547","Date Submitted":"05/28/2007 09:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=47.255547,+-122.438091(7112)&iwloc=A&hl=en\"> mufon case (7112) map </A>","Source":"MUFON","Summary":"Slow moving \"fireball\"","Longitude":"-122.438091"}