{"Date of the Event":"06/13/2005 10:00 UTC","files":["/var/www/straped/mufon/html2text/7116.html.txt","/var/www/straped/mufon/org/7116.html"],"Region":"Arizona","Longitude":"-114.020381","Weather Factors":"Unknown","Latitude":"35.254559","Log Number":"US-05292007-0005","Disposition":"Unknown","Source":"MUFON","Viewing Distance":"Over One Mile","trends":["There have been 35 other sightings in Kingman","There were no other sightings in Kingman on or around June 13th 2005"],"Date Submitted":"06/13/2005 10:00 UTC","Case Number":"7116","Object Flight Path":"Path with directional change,Other","Summary":"Unexplainable blatant UFO sighting in Northern Arizona.","Tags":"City","Object Shape":"Fireball, Flash, Star-like, Other","City":"Kingman","Object Features":"Unknown","divs":["Sighting DetailsThis is completely uncharacteristic of me - but I have no explanation for the following. My wife and I had been home approx. 20 min after being away for four days. We heard a very loud noise approaching outside. Instantly thinking 'car' or 'train' and quickly discounting those thoughts, I jumped and ran outside. The aircraft-like noise boomed through the air like extremely fast, low flying aircraft. What I saw next made me drop my iced tea. Two sets of lights - red, horizontally set - spinning around each other in perfect cylindrical form... then the heart-stopping separation; one set sharply northwest, the other slightly northeast. The NW set continued directly away in sight for some time. The sound passed quickly. The NE set seemed to stop altogether and dim. If one were to walk up and see at that moment, the NE set would have appeared no more than a faint star. As I continued to watch the Same area, the most brilliant shooting star tore from the upper right to the lower left quadrant of the sky. At this point I should add - it is not characteristic of that portion of the sky to be home to massive air traffic. But as I continued to look in that one direction, my peripheral vision picked up 10-15 aircraft - high, low, fast, stationary - all in the same quadrant. My wife can verify this. I don't know what to think - I'm an intelligent logical thinking person. I could find nothing regarding this phenomenon on any satellite news or otherwise channel. I can find no mention or astronomical explanation on the internet (meteor shower, homeland security, I've tried many things). If ANYONE saw this in the same time period and area - or if anyone reads something that could be offered as an explanation to this, I am completely open for suggestion."],"map":"<A HREF = \"http://maps.google.com/maps?q=35.254559,+-114.020381(7116)&iwloc=A&hl=en\"> mufon case (7116) map </A>","Sighting Duration":"00:10:00","Country":"United States"}