{"divs":["Sighting DetailsOur family was walking the dog in the middle of Washington Park on Saturday evening, May 26, 2007 around 9:30. Our eleven year old son pointed and asked \"what's that?\" There were event search lights flashing on the clouds at the time. At first we thought he was asking about the lights. However, all four family members quickly spotted a dark triangular or boomerang shape moving slowly across the background of light, broken cloud cover. The clouds were part of a storm front moving out toward the southeast. The sky to the northwest was clear. There was a half moon due south and occasionally visible through breaks in the receding clouds. The dark shape was clearly moving independently of the cloud movement. The shape was never illuminated by the search lights and had no lights of its own. It also did not appear to reflect light. It was evident primarily due to the absence of light, like a shadow. It was distinct when the cloud backdrop was solid and very hard to see when it crossed a darker or broken patch in the clouds. We first spotted the shape maybe 50 degress above the southeast horizon, in the direction of South High School from our vantage point. The shape moved slowly to the southeast, maybe 10 degrees and then reversed direction back toward the northwest without turning. It became faint and then disappeared in a larger area of dark sky. We watched it for a total of 3 to 4 minutes. It was very hard to tell its size or how far away it might be, other than it was below the clouds. At first we speculated that it might be a kite or a bird. There was no discernable breeze to keep a kite aloft and it did not move like either a kite or bird. We kept our eyes on that area of sky for the rest of our walk to the south end of the park and back and did not see anything further. So, we are just curious if anyone else saw this or has an explanation."],"Object Shape":"Boomerang, Triangle","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around May 26th 2007"],"Latitude":"39.744144","City":"Denver","Longitude":"-104.982653","Tags":"City","Date Submitted":"05/26/2007 09:30 UTC","Disposition":"Unresolved","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/7119.html.txt","/var/www/straped/mufon/org/7119.html"],"Source":"MUFON","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.744144,+-104.982653(7119)&iwloc=A&hl=en\"> mufon case (7119) map </A>","Viewing Distance":"Unknown","Case Number":"7119","Region":"Colorado","Date of the Event":"05/26/2007 09:30 UTC","Object Flight Path":"Undisclosed","Log Number":"US-05292007-0008","Object Features":"Undisclosed","Summary":"Dark, unlighted triangle silhoutted against lighter clouds. Moved first southeast, then reversed. Lost sight of object when it moved beyond clouds into dark sky."}