{"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.501556,+-122.425901(7127)&iwloc=A&hl=en\"> mufon case (7127) map </A>","Sighting Duration":"08:30:00","Disposition":"Unknown","Log Number":"US-05312007-0003","Summary":"LOOKED LIKE SIRIUS OR VEGA IN BROAD DAYLIGHT HANGING STILL HIGH IN THE ATMOSPHERE","trends":["There have been 19 other sightings in Gresham","There were no other sightings in Gresham on or around May 29th 2007"],"Weather Factors":"None","Object Flight Path":"Stationary","Country":"United States","Case Number":"7127","Date of the Event":"05/29/2007 12:00 UTC","divs":["sighting detailsi was playing ball with my dogs on the evening of tuesday, may 29th at around 8-8:30pm. i was in my yard admiring the almost full moon that was in the south east area of the sky. i noticed, what seemed to be a star (as bright as sirius or vega would be, but in the night sky) floating still, relitivly close to the moon...this did not make since, being that the sun was still up. i continued to examine the \"star\" for the next 1-2 minutes. i was looking around for any neighbors who could confirm the that there was an object up there, because i could not believe what i was seeing myself, but no one was outside, and i did not want to distract myslef away from the situation any more than i already had. i stared at this \"star\" intensivly, trying to make since of it. \"could i actually be seeing a ufo?\" i asked my self a few times...i tried to rule out a plane (i live next to an airport) or even military aircraft, but there was no movement...it was just hanging there still, high in our atmosphere. i had taken my eye off of the object, to briefly check on my dogs, and looked back up at the sky to find the object was gone. i was very stunned, and a little bit angry that i looked away from the object,because i knew better. but it appeared again!!! in the exact same spot...i was determined to not look away again. about 15-20 seconds after i relocated the object, it faded from its diamond color into a light brownish\\red color (like mars appears in the night sky), faded in and out 2 times, then was gone. if i was questioning what the object was before...seeing it fade in and out and completly dissapear was making me question it more. i could not justify the object being a plane or any other earthly aircraft at this point. i tried desperatly to snap pictures with my cell phone camera, but with no luck. my experience lasted about 2 minutes total."],"City":"Gresham","Object Shape":"Star-like","Date Submitted":"05/29/2007 12:00 UTC","Latitude":"45.501556","Source":"MUFON","files":["/var/www/straped/mufon/html2text/7127.html.txt","/var/www/straped/mufon/org/7127.html"],"Region":"Oregon","Object Features":"Unknown","Longitude":"-122.425901","Tags":"City"}