{"Country":"United States","divs":["Sighting DetailsIt was early afternoon in about the middle of May in Kansas City, KS. A partly cloudy day with plenty of sunshine. I was practicing a technique called cloudbusting when I noticed a high-flying dark object float into view. If not for me looking directly at the cloud I wouldn't have noticed this object and several times I lost sight of it momentarily as it dipped and flew backwards down and then stopped. It looked like a bird without flapping it's wings. It stood motionless for a few minutes as the clouds behind it continued drifting, and then it would turn on it's side slightly and shoot backwards rather quickly and then just as soon as it began it stopped again and drifted virtually motionless. At first my wife and daughter and myself thought it could be a very large high flying bird that was caught in a jet-stream and instead of traveling south in the direction it was pointing it just stayed stationary for a few minutes before dipping down and backwards as if the wind was too strong for it to make any progress. Soon we began to doubt whether or not it was a bird because of the height and size. I know some birds have been known to fly several miles up but none of the north American species looked like this object. The way it moved made me think I was possibly seeing some type of unmanned drone aircraft that wasn't powered by conventional engine, maybe it was designed to float high above a specific point. From where I was standing the object looked to be approximately 7500-15000 feet or more in alttitude and about as big as a leerjet in size. All black in color shaped like a bird crossed with a boomerang and a B-2 stealth bomber. As time passed on the object continued drifting backwards towards the north as it was a southerly wind that day, until I lost track of it. PS: I have read a few accounts from witnesses in the states around me who have reported similar sightings maybe they are the same thing. Also of note I don't know if it was because the sky was so bright and the object so far away and small but when I looked at it there appeared to be a fuzzy dark moving aura surrounding it. Like I said it may have just been because the sky was so bright with the white illuminated clouds around it and because it was so dark maybe it was an optical illusion gving it the aura."],"Object Shape":"Boomerang, Chevron, Triangle","Viewing Distance":"Over One Mile","City":"Prairie Village","Sighting Duration":"Undisclosed","trends":["There have been 4 other sightings in Prairie Village","There were no other sightings in Prairie Village on or around May 15th 0001"],"Date Submitted":"05/17/0001 12:00 UTC","Case Number":"7129","Summary":"Looked like a large mechanical triangular black bird without flapping wings","Disposition":"Unknown","Region":"Kansas","map":"<A HREF = \"http://maps.google.com/maps?q=38.999433,+-94.629978(7129)&iwloc=A&hl=en\"> mufon case (7129) map </A>","Weather Factors":"Unknown","Date of the Event":"05/17/0001 12:00 UTC","Log Number":"US-06012007-0002","Longitude":"-94.629978","Object Flight Path":"Hovering then path,Unknown","Tags":"City","Source":"MUFON","Object Features":"None","Latitude":"38.999433","files":["/var/www/straped/mufon/html2text/7129.html.txt","/var/www/straped/mufon/org/7129.html"]}