{"map":"<A HREF = \"http://maps.google.com/maps?q=44.947228,+-123.032746(7130)&iwloc=A&hl=en\"> mufon case (7130) map </A>","Case Number":"7130","City":"Salem","Viewing Distance":"Unknown","Date of the Event":"02/14/1999 12:59 UTC","Weather Factors":"None","Object Shape":"Triangle","Object Flight Path":"Stationary,Straight-line path","Object Features":"Unknown","Sighting Duration":"07:00:00","Longitude":"-123.032746","files":["/var/www/straped/mufon/html2text/7130.html.txt","/var/www/straped/mufon/org/7130.html"],"trends":["There have been 40 other sightings in Salem","There were no other sightings in Salem on or around February 14th 1999"],"Region":"Oregon","Disposition":"Unresolved","Log Number":"US-06012007-0003","divs":["Sighting Details June 1, 2007 Dear Mr. Bowden I hope you received my ex wife's side of the encounter, now I want to tell you mine, in case I forget and leave something out when I speak to you in person. I called the clinic today that did my steroid injections, main desk couldn't find the year, so I am expecting a call back from scheduling, to see if they have the year, but I can tell you if my wife says 97 or 99 its one of those, I also called my regular Doctor to see if they might have the date, the nurse told me she looked pretty far back and couldn't find it, I'm thinking the date was removed because The specialist that did my spine injections made a mistake, here's my story. Got up early still dark out went in for my spine injections, I will speed this up, was in getting the injections, when doctor missed the pocket the steroid was to go into, I yelled out in much pain, ex wife took me home, I was on strong pain meds, it didn't help, my ex wife wanted to go do some shopping, I told her I didn't want her to go as I was in more pain then I had ever had, even worse than the spine infusion years ago, I knew I shouldn't be left alone, she said she would hurry back, I fell asleep on the sofa, when I woke I got up very slowly to go to the rest room, I lost all, and I mean all hearing both ears, I thought for sure I was going to die, as a Christian I prayed for Gods help, I walked over and grabbed the phone, I laid back down and called 911, I told them that every time I got up I lost all hearing, and to please send Rescue, when Rescue got there they noticed my strong pain meds, and said I probably just took to many pain meds, I told them I hadn't, I said the Doctor made a mistake with the steroid shot, and I was sure it went to my brain, they almost laughed at me, they just told me to call my doctor, and they left, soon my ex wife came back, I told her I need to go back to doctor, as my pain is very bad and when I stand up, all hearing goes, then it happened everything went silent, I pointed to my ears to let her know, I couldn't hear, I could see her worried look, she called the doctor, and then took me back in, I told the doctor at home I was loosing my hearing, he didn't believe me and told me, in a stern voice, this has never happened before with any patients I have had, in fact he said he had never heard of it before, I didn't believe him. My ex wife took me back home, I went into the bed room to lay down by now it was getting dark outside, I looked up and saw what was kind of shaped like a Xmas tree with lights under it (triangle), point facing me, it didn't move, it made no sound, ex wife was gone again, I went into bathroom, as I stood over the toilet, all hearing left me again, but I didn't feel like I was passing out. I went back to bed, I looked up and I noticed this small craft was now slowly moving forward, I looked close and I noticed a alien looking back at me from a small opening underneath the craft (Big head, Big eyes, no nose, small lips) I got the feeling he was telling me to not be afraid he seemed nice, but as a Christian I was a little pissed, as I had heard bad things about what they do to people, I don't trust aliens, as I don't feel they are from God, and I thought with all the pain and hell I'm in why are they enjoying watching me, leave me the hell alone, I prayed all night for God to help my pain, my wife and I fell asleep, then I was awake I noticed what looked like humans sitting on the floor in a circle, but there skin was very white and pail, the one that looked female spoke she said we are hear to help you, I noticed what looked like steam coming up from the floor, they asked me to come and sit down in the circle where the steam was coming from, I was now standing on the floor with them around me, I started jumping around mocking them, putting my hands to my lips acting like, oh I'm so scared, I thought I'm not falling for your evil tricks, I serve the Lord you cant touch me and I'm not afraid of you, next thing I knew the people, steam and craft were all gone, and I was praying Lord please take me home, I cant stand this pain anymore, to this day I do regret not sitting down in what ever that was coming from the floor, I knew what had happened was real when my wife said she also saw them, and that I was jumping around acting like a fag ( her Very Words), I told her it was because I was pissed at them, and I figured they would of taken or done something bad to me, like I had read about with other people. About a week latter, my ex wife went into the living room looked outside and saw little aliens, she said they were kind of walking in a jerky robotic way there were three of them, the leader looking one pointed up to the night sky, as the other two also looked up, she came back into the room to tell me I could see she was terrified, I said cool lol, don't worry there probably just coming back to check on me. One day after that I was in my back yard and was buzzed by a black helicopter, I was just sitting in a chair and I was being watched so close I went in and told my ex wife to come see this, she goes wow mark OMG the black copter was close just a few feet above the tree line and it was side ways, just watching me, I'm ex military (6 years national guard) I thought this is strange a black out of place military copter watching me and no marking on it, must be the police looking for someone, for over a week this same black copter buzzed my house, sometimes I would play with them to see what they would do, so I would try to hide behind a bush etc. one time I jumped in my car and headed to the store up the street to see if they would follow me, I was freaked out to find not only did they follow me to the store, but they were waiting for me when I came out. I want to add that ever since my UFO encounter, I started having sleep problems, kicking and screaming in my sleep, it got so bad my ex wife and I could no longer sleep in the same bed, part of what destroyed our 20 year relationship, I was sent to the sleep lab, and was told I scream and act like I'm fighting something off , a nurse video tapped me in my sleep she said it was very dramatic to see, and that at one point my foot came up and I even kicked myself in the rear end. to this day, I'm told I have nightmares all the time but I never remember them. Sincerely, Mark Akers"],"Latitude":"44.947228","Summary":"Healers Or Evil Deception, You Decide?","Tags":"City","Country":"United States","Source":"MUFON","Date Submitted":"02/14/1999 12:59 UTC"}