{"trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around May 29th 2007"],"Disposition":"Unknown","Date of the Event":"05/29/2007 12:00 UTC","Region":"Colorado","Sighting Duration":"Undisclosed","Latitude":"38.838252","Date Submitted":"05/29/2007 12:00 UTC","Object Features":"Undisclosed","Tags":"City","Case Number":"7131","Longitude":"-104.814363","files":["/var/www/straped/mufon/html2text/7131.html.txt","/var/www/straped/mufon/org/7131.html"],"City":"Colorado Springs","Source":"MUFON","divs":["sighting detailsi was walking during my lunch break on may 29, 2007 directly east of the afa stadium about 3 miles. during my walk, i noticed what appeared to be a white point of light, below the foothill ridge line, about a mile or two to my northwest. the sky was dark behind the foothills, as a storm was probably a 10 miles away. i noticed a small, round, light object that traveled in circle pattern of less than a 1\\4 mile. soon, another light followed. i thought it might have been a ballon caught in an up draft; however, then an other light followed. these appeared to travel from the north, in a circle pattern down, then back up. their velocity was not constant (slow, then fast). i followed one as it circled up, then moved south at a constant rate before it became too difficult to see above the ridge line. there were aircraft traffic in the area (not exactly at this time); however, there was no noise and i know the types of aircraft allowed in this restricted airspace. it was not an aircraft of any sort. i know that it could not have been an aircraft, because the object was within 3 miles of my position (below the ridgeline) and it would have been easy to id. could it have been weather ballons\\devices for observations? i first took notice because of 'some white thing caught in an updraft'. however, when i continued to look over a period of 5 minutes, it appeared to be white a point light with. then another appeared. after years of observing aircraft in this area, these did not fit anything i've ever noticed before. it left me feeling like i saw something that didn't fit any norms."],"Country":"United States","Log Number":"US-06022007-0001","Object Flight Path":"Undisclosed","Summary":"White lights traveling in circular patterns, near foothills of Colorado","Weather Factors":"Unknown","Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=38.838252,+-104.814363(7131)&iwloc=A&hl=en\"> mufon case (7131) map </A>","Viewing Distance":"Unknown"}