{"Tags":"City","Sighting Duration":"00:05:15","Object Flight Path":"Stationary","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Case Number":"7132","Longitude":"-104.694356","City":"Fountain","Region":"Colorado","Disposition":"Hoax","Object Shape":"Cylinder","Latitude":"38.683219","Date Submitted":"05/31/2007 11:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.683219,+-104.694356(7132)&iwloc=A&hl=en\"> mufon case (7132) map </A>","trends":["There have been 11 other sightings in Fountain","There were no other sightings in Fountain on or around May 31st 2007"],"files":["/var/www/straped/mufon/html2text/7132.html.txt","/var/www/straped/mufon/org/7132.html"],"Log Number":"US-06022007-0002","Weather Factors":"Unknown","Date of the Event":"05/31/2007 11:45 UTC","divs":["sighting detailsi just saw a ufo today, 5\\31\\07 at 12:45pm. i was at fountain creek nature center near my home in fountain, colorado doing yoga on a platform out in the wetlands...when i noticed swirling energy (not clouds) above me. i was relaxing, doing meditation, while lying flat on my back looking up into the sky. i usually meditate with my eyes closed...but for some reason i'd opened them and was observing the interesting energy swirls. they are difficult to describe. i'd never seen anything like it before...but there was an obvious energy disturbance taking place directly above me in the sky. then a small white cloud appeared out of nowhere (now here). it was just suddenly there. it didn't form...one second it wasn't there and the next second there was this peculiar little white cloud that showed up and looked about the size of a softball. an even smaller piece of this small white cloud separated from the main cloud. the main cloud quickly disappeared...evaporated or something...leaving this peculiar little white triangular cloud in the middle of the blue sky. the swirling energy was no longer noticeable by the time the main little cloud disappeared. then this little bitty (gee, it's hard to gage size in a huge blue sky with only one little bitty cloud...but i'd say it looked about the size of a big marble...a shooter i think they call them. then that little white cloud started spreading out...and behind it i saw, clear as day, a cylindrical shaped matte metal object. it looked about the size of half a ball point pen...and was rounded on both ends. it's cloud cover totally disappeared leaving a non-shiny silver grey object...it was only visible for approximately 15 seconds or so...but i saw it clearly. i'd like to state that i was not under the influence of any mood or mind altering substances...unless fresh air and exercise are considered to be mood or mind altering. i admit i have been sleep deprived...but that hasn't affected my mental functioning to my knowledge. i believe i'm operating on all cylinders. i know what i saw and i give my word as a woman of honor that i saw what i saw. i am of extremely sound mind and body, have never hallucinated that i remember, and know what i saw was not made by human intelligence. then it just disappeared. it did not move or accelerate in any way. it made no noise. it must have shifted into another dimension or whatever they do...i don't know how they operate but would love to learn. hopefully more solid metal objects will be appearing for others everywhere soon...not just in my area. one thing i'd like to add, is that i consciously had asked to see one yesterday. i was playing the game \"wouldn't it be nice if....\" and i decided it would be nice if i finally had a really-oh truly-oh sighting...not just lights flying around or orbs like i've seen before...i wanted to see something solid with no mistaking it for anything else. damned if whoever (or whatever) was tuning into the vibration of my thoughts didn't deliver. i encourage those of you reading this...if you would like to see something...put that intention out to the universe...play \"wouldn't it be nice if...\" and be specific. keep looking up. keep your eyes peeled. be aware. they are here...now!! the universe delivers! respectfully submitted, elise eagle"],"Country":"United States","Object Features":"None","Summary":"UFO at Fountain Creek Nature Center, Fountain, Colorado, USA 5/31/07 12:45 pm"}