{"Object Shape":"Boomerang, Bullet, Missile, Disc, Fireball, Flash, Saturn-like, Sphere, Star-like, Triangle","Log Number":"CA-06022007-0007","Source":"MUFON","Country":"Canada","Date of the Event":"09/13/2006 12:00 UTC","files":["/var/www/straped/mufon/html2text/7137.html.txt","/var/www/straped/mufon/org/7137.html"],"City":"Kitchener","divs":["Sighting DetailsIt was the night of September,13,2006 when I looked out the window to admire a days work of gardening when I noticed that there was an odd shaped airplane in the sky,when I looked closer,I was shocked! It had an amazingly bright head and was moving remarkably fast.It could have been discribed as a hummingbird because it could hoover in one spot or move in any direction,then I soon realized a plane could never do that. I quickly took out my cellphone and took a picture before it hovered over my house and disappeared. I was not the only witness to this event,my parents were witnesses as well,but after a while they became so scared they regarded it as a figment of their imagination. But I still belive that picture tells a thousand words, and the fright we all expirenced that night. I truly am not a skeptic anymore!"],"Object Features":"Undisclosed","Summary":"It turned into various shapes, at first I thought it was an airplane but it started hoovering and it moved in various directions the best way to describe it was \"It moved like a Hummingbird\".This is because it hoovered then moved back rapidly and so on.","Object Flight Path":"Undisclosed","Latitude":"43.434311","Viewing Distance":"Unknown","Date Submitted":"09/13/2006 12:00 UTC","Weather Factors":"Unknown","Tags":"City","Region":"Ontario","Sighting Duration":"Undisclosed","trends":["There have been 15 other sightings in Kitchener","There were no other sightings in Kitchener on or around September 13th 2006"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.434311,+-80.477747(7137)&iwloc=A&hl=en\"> mufon case (7137) map </A>","Longitude":"-80.477747","Case Number":"7137","Disposition":"Hoax"}