{"map":"<A HREF = \"http://maps.google.com/maps?q=42.623608,+-80.450174(7140)&iwloc=A&hl=en\"> mufon case (7140) map </A>","City":"Port Rowan","Sighting Duration":"Undisclosed","Object Shape":"Sphere, Star-like","Tags":"City","Date Submitted":"05/20/2007 11:20 UTC","Region":"Ontario","Log Number":"CA-06032007-0003","divs":["Sighting DetailsI was visiting my friend for a week. She lives on a farm just outside port rowan. At 11:20pm I was sitting by a camp fire relaxing when i decided to look for the little dipper(the stars were very bright that night). I eventually saw what looked to be a satallite(see them all the time up there). After watching it for approx. 20 sec. move in a straight line, it abruptly dipped like a v. I then knew it was not a sattalite,nor was it likely to be an aircraft in my opinion(I was in air cadets for many years,have taken multiple aircraft identification classes and have been to multiple air shows so i know what a plane flying looks like) so I ran in the house to tell the 2 girls that live there, when we came back outside it was gone. Approx. 20 min later I came outside to bbq some late night burgers. I walked over to check where i had seen the ufo and immediatly i saw it in the sky. It was more to the east(right) of where i had originally seen it and it was much closer. it was now hovering. Also,I was seeing it between the roofs of two barns(which eventually made it extremely easy to gage the movement). you could now see that it was dull green in colour, giving off a red hue every now and then. If i had to guess i would say it was at least still 60 kms away. for the next half hour all three of us watched this thing \"dance\" in the sky. It stayed in generally the same area of the sky, but it flew very eratically. It would be going left, then all of a sudden just start going right. down, then up. but it wasn't just vertical or horizontal, this thing was flying at all different angles. Also, it's speeds would very alot. it would dive down vertically very slowly then shoot up very fast. We did have a pair of cheap binoculars which did not help us see it any better(it just looked bigger). We also snapped a couple of pictures with a digital camera which did not come out any good(to far away). It was in the sky for so long that the girls got bored and went back in the house.i watched it for about another 10 min. befor getting informed that my burger was now cold. i went into the house for aprox. 3 min. to nuke my burger, when i came out it was gone. Trust me this was no plane or helicopter."],"Source":"MUFON","Longitude":"-80.450174","Disposition":"Unresolved","Case Number":"7140","Date of the Event":"05/20/2007 11:20 UTC","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Object Features":"Undisclosed","Summary":"watched green light in the sky fly eratically for over 40 min","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/7140.html.txt","/var/www/straped/mufon/org/7140.html"],"Latitude":"42.623608","trends":["There have been no other sightings in Port Rowan","This sighting has never been favorited."],"Country":"Canada","Viewing Distance":"Over One Mile"}