{"Country":"United States","Longitude":"-70.303056","Latitude":"41.701417","Viewing Distance":"Unknown","divs":["Sighting DetailsJust before 5am I was passing by a south-facing window on the second floor of my house. We are on a high point and can see the horizon. To the south of us are two radio towers with blinking red lights. Between and above them I saw a light that at first I thought was the rising sun because of its pink-red color, and its crescent shape-- round towards the top and curved in at the bottom. After a moment, however, I realized that it was in the wrong direction for the sunrise--south--it was probably too high off the ground for it to be the sun yet, and also, it was overcast. As I watched it for a few minutes, it stayed in the same place in the sky, but changed shape from crescent to oval to circle, (in no paticular order). When it was in a round shape, another small dot of light appeared just to the right of it, the same red-pink color, probably 5-10x smaller than the initial light. The second light moved from the upper right side to the lower left side of the first light, but was visible the whole time and I don't think it actually crossed in front of the light, rather moved underneath it. Now on the left side, the second light sat there for maybe half a second, then moved towards the bigger light and was absorbed into it. Then it turned back into a crescent shape and faded out until it disappeared. I stood there for maybe a minute, waiting to see if it would appear again. It did appear-- all of a sudden, no fade in, in exactly the same spot and exactly the same color, in a crescent shape. I watched it for a much shorter time, maybe thirty seconds, and then it disappeared again. I can't remember if it faded out or totally disappeared. I thought to run downstairs and get binoculars during all of this, but i didn't want it to disappear while I was gone. I've been trying to rationalize this and there are only a few answers I can come up with. One, is that there is a municipal airport to the south of us, as well as the Boston airport to our northeast, and we often see planes from either airport over our house. However, it was overcast and there was no break in the clouds as far as I could tell that would allow aircraft to be seen. I also didn't hear an aircraft, though it probably would have been too far away to hear. The light also didn't move. It seemed too low in the sky for it to be an aircraft that appeared not to be moving because it's so far away. There is no way I mistook the sun for this light, because as I said, it was in a southerly direction. I also checked the sunrise time yesterday, which is listed as 5:09. As soon as the incident was over I checked the clock in my room, and it was exactly 5 am. My clock might be a little off, but I don't think it's off that much. It could have possibly been the sun reflecting off of something in the sky, but again, the sun wasn't up yet and it was overcast. Which, by the way, raises another point-- it seemed as if this object was far away. I don't know how high the clouds are when the sky is overcast, but if I saw everything correctly, either te clouds were high and this object was far away, or the object had some quality to it that made it look far away when it was really much closer, beneath the clouds. If the light was really just a hole in the clouds, letting through the light of the rising sun-- again, I'm 95% sure that it was before 5am when I saw it, and even if the sun was starting to come up, I don't think the color of the sky would be that intense pink-red already in the south. So thank you very much for documenting this... if you try and contact me about it, please only do so by email."],"City":"Barnstable","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.701417,+-70.303056(7141)&iwloc=A&hl=en\"> mufon case (7141) map </A>","Summary":"Pink-red object changed shapes, disappeared, reappeared; changed shapes again,; disappeared","Weather Factors":"Unknown","Date Submitted":"06/02/2007 04:55 UTC","Tags":"City","Case Number":"7141","Object Flight Path":"Undisclosed","Object Shape":"Circle, Oval, Teardrop, Other","Disposition":"IFO","Sighting Duration":"Undisclosed","trends":["There have been 9 other sightings in Barnstable","There were no other sightings in Barnstable on or around June 2nd 2007"],"Date of the Event":"06/02/2007 04:55 UTC","files":["/var/www/straped/mufon/html2text/7141.html.txt","/var/www/straped/mufon/org/7141.html"],"Log Number":"US-06032007-0004","Region":"Massachusetts","Object Features":"Undisclosed"}