{"Summary":"green/blueish","City":"Baton Rouge","Case Number":"7144","Log Number":"US-06042007-0001","Date Submitted":"06/06/2007 12:00 UTC","divs":["sighting detailsi was walkin my dogs. there was a flash of light, kinda like normal light. i looked up. at first it looked like a spot light. i ran back home to get a camera. i had to drag the dog. she wouldn't run. we figured out it wasn't a spot light. it was greenish\\blueish. i countinued to walk the dogs and saw it at a different angle. it was a few 100 ft. in the air. it appered to cirle the area, but the circle was kinda wobly.the circle was several hundred feet in diamiter. but at the new angle, i could tell it was slowly gliding down in a circle. like it was coming down for a landing. the two wings were glowing, but you could tell there was a center. when i looked at it, for a second it shined a lighed on me. it's still out there. we recorded some of it on a camera. i just went out and checked on it. it slowed down some. but it was about 70 ft lower.the circle has decreased about 50 ft less. i think it's coming down to land.there are several fields in the area. it's been there for 3 hours now. this is all i can tell for now."],"Weather Factors":"Unknown","Disposition":"Insufficient Data","Longitude":"-91.13713","trends":["There have been 27 other sightings in Baton Rouge","There were no other sightings in Baton Rouge on or around June 6th 2007"],"Object Flight Path":"Other","Tags":"City","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/7144.html.txt","/var/www/straped/mufon/org/7144.html"],"Country":"United States","Object Shape":"Blimp, Boomerang, Cigar, Cone, Chevron, Circle, Cross, Cylinder, Diamond","Sighting Duration":"Undisclosed","Latitude":"30.459513","Source":"MUFON","Region":"Louisiana","Date of the Event":"06/06/2007 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=30.459513,+-91.13713(7144)&iwloc=A&hl=en\"> mufon case (7144) map </A>","Object Features":"Wings"}