{"Date of the Event":"08/01/1960 12:00 UTC","Weather Factors":"Unknown","divs":["Sighting DetailsMy two older brothers and myself decided to go fishing one Sunday afternoon on the Great Cataraqui River(Rideau Canal)a few miles North of Kingston, Ontario, Canada. We were about half-way between Kingston Mills Locks and the Locks at Washburn. We had rented a 12 foot boat at Mount Chesney(Sunbury)at a local marina and rowed a mile or so into the river to fish the shallow waters for bass and pike. The sun was quite hot that day and the sky was clear as we fished and chatted. While fishing we noticed several craft hanging in the sky some distance off(perhaps a mile)We could see about five of these objects lined-up going away from us to the South-West. These objects appeared to ne at different heights at the time but I realised later that this illusion was probably caused by their distance apart. It was impossible to gauge the size of these craft, due to the unknown distance they were from us.They might have been anything from 25 to 100 feet across but in the distance they looked smaller than the latter. These craft one-by-one faded from sight over the next hour or so. At this point in-time, 1958 - 1960 there were many reports by newspapers of UFO'S being sighted around the world. We did not see anything too remarkable about these craft at the time. Other than a casual mention to our parents when we returned home we never gave this much thought. It was not until many years later that I realised the significance of this sightings and described it in a letter and interview to the local newspaper. My revelation was greeted by the public in the usual way that UFO reporters have to endure. 'How much beer did you drink that day?'(None) or 'How long were you out in the Sun that day?' I did receive ONE phone call one evening from a very kind and interested gentleman whose name I didn't ascertain. He was very knowledgeble about UFO'S and asked me several questions, mostly about what I have typed here. He did tell me that the Rideau Valley and Canal system between Kingston and Ottawa was 'a hotbed for UFO activity.' My being candid about my UFO(if you will) experience has led to others in the area coming forth with their own stories to me. These people had waited for years to describe the events being mostly afraid of the sure-derision, that would follow. This meeting(?) with these beings has changed my life significantly as I finally realised that the god that my fore-fathers worshipped back into Biblical times is really one of these beings with only a much-higher, developed technology than our own. I joke with people now and tell them that although I 'have never met God, I have seen His mode-of-transportation!' I trust that you at MUFON will find this useful - - I might add that I don't believe that there was any abduction involved with myself or my two brothers during this incident. The only thing I observed in later years was that they didn't appear comfortable talking to me about it. One of my brothers involved passed away six years and, of course, we are all getting older. I would like to see this UFO phenomena fully explained before I go back to the elements. I might also add that I think it is a HUGE mistake to insist that these beings come from far-off planets and galaxies. With the enormity of our planet - in and under the sea and with the ability that these beings possess to hide-at-will, there is likely lots of room right here for an unknown civilization. Unfortunately(?) it will probably be up to these beings WHEN they want to be discovered by those lesser- beings that we choose to call 'humans.' Thank you, and good luck, Glen E Smith"],"Object Flight Path":"Stationary,Hovering then path","Summary":"We watched several craft sitting in the sky near to the river where we were fishing from a small boat.","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Undisclosed","Latitude":"44.231172","Disposition":"Unresolved","Tags":"City","Longitude":"-76.485954","Region":"Ontario","Sighting Duration":"Undisclosed","trends":["There have been 10 other sightings in Kingston","There were no other sightings in Kingston on or around August 1st 1960"],"Country":"Canada","Object Shape":"Disc","Case Number":"7158","map":"<A HREF = \"http://maps.google.com/maps?q=44.231172,+-76.485954(7158)&iwloc=A&hl=en\"> mufon case (7158) map </A>","Date Submitted":"08/01/1960 12:00 UTC","City":"Kingston","Log Number":"CA-06052007-0003","files":["/var/www/straped/mufon/html2text/7158.html.txt","/var/www/straped/mufon/org/7158.html"],"Source":"MUFON"}