{"Case Number":"7159","divs":["Sighting DetailsI'm a smoker and I go upstairs every day to my top floor and hang my head out of my window to smoke a cigarette. I do this at least 7 or more times a day. So I'm always looking at the same patch of sky, watching the planes fly by (at night) and generally paying close attention to whatever is happening outside. Well on the night of the 21st March I hung my head out of my window as I usually do and started smoking. I caught a glimpse of a streak of light rush off to the left out the corner of my eye. At first I thought to myself that I could have been a reflection off of the window or metal handle as I moved my eyes to look somewhere else, it might have appeared to be something different. You know, as you move your eyes quickly you sometimes catch a glimpse of a light leaving a tail? Well that's what I thought it was and I ignored it. A few minutes later, I was still thinking about it because there were no cars around so it couldn't have been a reflection of light onto my window. There were no stars in the sky because it was partially misty and the stars were unable to shine through. As soon as I started thinking about it, a brilliant bright blue object much like a star shot extremely fast in to the sky and stopped dead still at what I imagine to be 1000ft or more. This object was a very bright blue ball of light that seemingly made no noise. After it shot in to the sky and came to a dead stop instantly, it then started to lower itself down to the ground whilst pulling very large circles as if it was spirally back down toward the ground. At around 500ft (or there-a-bouts) it stopped again, instantly. Moved off to the left at a high rate of speed, stopped, pulled 1 or 2 more circles (horizontally) and stopped, darted back off to the right, pulled one last circle before it shot off out of sight. At this point I couldn't believe me eyes and this object made me all awe-inspired. So I ran downstairs and woke my mother up who was sleeping at the time. I shouted through the door \"Mum, come upstairs, I want you to see something\". She asked me 'What?' I said \"Quick, there's some strange blue light flying around outside\". So she got up as fast as she could, and we went back upstairs to the window and gazed outside. For two minutes this object did not appear. I refrained from telling my mother what I had seen, and I was beginning to get frustrated at the idea of telling her what I had seen (however unbelievable it was) and she might or might not believe me. Sure enough, 2 or 3 minutes later this object instantly reappeared and shot back up into the sky and stopped dead still at around 1000 ft. Exactly the same thing it did the first time, only this time I had a witness who could verify what it was I was looking at. As soon as it did this my mum let out a whale, almost as if she was not expecting to see this object appear in this way. After stopping at 1000ft (or there-a-bouts) it started lowering its altitude very quickly (almost free-fall speed), but at the same time as its altitude was decreasing it was pulling large horizontal circles. Large as in, 100ft or so, but seemingly effortless. It again stopped instantly, darted off to the left, began lowering its altitude once more whilst pulling these large yet swift horizontal circles, stopping dead still, darting off of the right, pulling yet more circles. It stopped for a final time before zipping off extremely quickly, almost leaving a tail behind it as it shot out of sight. I for one am very pleased that my mother was there to experience the same series of events, even though the two events were only 2 to 3 minutes apart. I felt as if it would be pointless if I tried to explain it, and perhaps looked at as a nut-case (even from my own mother). I did ask her what she thought it was, she too didn't think it was a helicopter, or a plane. It made absolutely no noise. This object was half a mile away at best. If it had been a combustion engine powering this thing, we would have heard it for sure. But it made absolutely no sound, not a whisper. It also moved in a way that I didn't think was possible. It almost seemed to be flying on air, effortlessly moving itself from side to side, pulling circles and traveling at a high rate of speed with the capabilities to stop at will in an instant. I hope this description of this incident is clear enough for you to draw up your own conclusions. I did however speak to some friends of mine once, recently. We were discussing UFOs over a program called Teamspeak. The conversation didn't begin with UFOs, but it sure ended up sending a chill down my spine. Why? Because my friend claims that he has seen exactly the same object (probably not the same one) but another just like it, performing these same aerial stunts, in the same series of events. Witnessed by both him and his friend who live a few miles in opposite directions. They two were on Teamspeak. One discussing what was going on, the other listening (as we all were). My friend mike who was discussing what he was looking at, at the time, asked his friend who was a few blocks away if he could see the same object. They both gave running commentaries about the same object, both of whom described the same object I had seen a few nights before. However, they're in California and I'm in England. So it can't have been the same object... can it?"],"Log Number":"GB-06052007-0004","Date Submitted":"03/21/2007 10:45 UTC","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-0.757072","Country":"United Kingdom","Object Shape":"Star-like","Summary":"Blue Star-Like Object","map":"<A HREF = \"http://maps.google.com/maps?q=52.038601,+-0.757072(7159)&iwloc=A&hl=en\"> mufon case (7159) map </A>","Source":"MUFON","Tags":"City","Object Flight Path":"Hovering then path,Path with directional change","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/7159.html.txt","/var/www/straped/mufon/org/7159.html"],"City":"Milton Keynes","Latitude":"52.038601","Weather Factors":"Unknown","Sighting Duration":"00:03:00","Date of the Event":"03/21/2007 10:45 UTC","trends":["There has been one other sighting in Milton Keynes","There were no other sightings in Milton Keynes on or around March 21st 2007"],"Region":"England"}