{"files":["/var/www/straped/mufon/html2text/7162.html.txt","/var/www/straped/mufon/org/7162.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.214567,+-71.535312(7162)&iwloc=A&hl=en\"> mufon case (7162) map </A>","Log Number":"US-06052007-0007","trends":["There have been 23 other sightings in Concord","There were no other sightings in Concord on or around August 31st 1991"],"Summary":"Red, blue, silvery white orbes appear over Merrimack Valley","Tags":"City","Date of the Event":"08/31/1991 12:00 UTC","Date Submitted":"08/31/1991 12:00 UTC","Source":"MUFON","Longitude":"-71.535312","Disposition":"Unknown","Object Features":"Undisclosed","Object Shape":"Sphere","Sighting Duration":"Undisclosed","Country":"United States","Latitude":"43.214567","City":"Concord","Object Flight Path":"Undisclosed","divs":["sighting detailsin september of 1991, i witnessed what became known in the local media as the concord lights. each morning(approx 6-7am) and each evening (approx 7-8pm), i witnessed these orbes hanging approximately 2500 ft above the valley floor over or near the merrimack river on the north side of concord , nh. my father, with whom i worked and carpooled also saw what i saw. in fact, several of my friends witnessed this event. after about 10 days to 2 weeks, the orbs disappeared. beginning a week after the event, rumours began circulating about non-descript men following\\watch people around the concord. these rumours persisted until the end of october 1991. i didn't give this event another thought. i have a very good memory and i would not have forgotten this incredible event. beginning in 2004, i began to have a hazy recall of the concord lights. by 2005, i could recall with great clarity the events. i sent an information request to mufon, but was told there where no previous reports. i finally questioned both my father and my closest nh friend in 2007. neither man recalls these events."],"Weather Factors":"Unknown","Region":"New Hampshire","Case Number":"7162","Viewing Distance":"Unknown"}