{"Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"06/05/2007 06:44 UTC","Object Features":"Other","divs":["Sighting DetailsI was not aware of the alleged U.F.O event at the time. I was watching what I thought might have been starting of a tornado. The region was under heavy storm warning. I took pictures with my new HP photosmart M627. The original cloud shape stood motionless for several hours. I would play with my daughter and then come back to observe every 20 minutes or so and snap a picture. Suddenly the cloud shape veered off towards the south. I follow the cloud with a fascination for this was an amazing weather event. The cloud changed form into a ball with a greenish hue (my camera does show the colour that is described). The cloud changed direction rapidly and went flying towards my fixed position. It was frightening the speed that the cloud came in I took some video unfortunately my video that shows the speed that it came was not aimed at the cloud as I ran for the condo. Anyway as I was looking at the pictures I saw something in the clouds that struck me as very odd. In one picture is an orb. The Camera is facing towards the south the is setting far in the west so it seems unlikely be a sun refraction I believe that refraction of the lenses happens if you take a picture towards the sun. Any way in a subsequent picture the orb seems to divides into four orbs and taken a formation. These orbs were not observable when I saw the images initially."],"map":"<A HREF = \"http://maps.google.com/maps?q=51.0511,+-114.048272(7165)&iwloc=A&hl=en\"> mufon case (7165) map </A>","Object Shape":"Circle","Weather Factors":"Unknown","Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","Latitude":"51.0511","Date Submitted":"06/05/2007 06:44 UTC","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/7165.html.txt","/var/www/straped/mufon/more/7165_submitter_file1__Bigcircle.jpg","/var/www/straped/mufon/more/7165_submitter_file2__formationcircle.jpg","/var/www/straped/mufon/org/7165.html"],"Summary":"In one picture is an orb. The Camera is facing towards the south the is setting far in the west so it seems unlikely be a sun refraction I believe that refraction of the lenses happens if you take a picture towards the sun. Any way in a subsequent picture","Region":"Alberta","Source":"MUFON","Tags":"City","Longitude":"-114.048272","Case Number":"7165","Country":"Canada","Log Number":"CA-06062007-0002","trends":["There have been 76 other sightings in Calgary","There were no other sightings in Calgary on or around June 5th 2007","This sighting has never been favorited.",""],"City":"Calgary"}