{"Weather Factors":"None","Summary":"Smooth rounded disk with white lights. Very shiney silver metallic","City":"Salem","Object Flight Path":"Hovering then path,Straight-line path","Disposition":"Unknown","Region":"Oregon","Log Number":"US-06062007-0004","Case Number":"7167","Tags":"City","Country":"United States","divs":["sighting detailsi was only seven, and i don't reacall the month or day, but it had to have been summer because it was a hot sunshiney day in salem oregon. i was in my glassed-in atrium\\frontporch finding our geko when i looked up and out the window and saw what i did...across the street was a parking lot with a warehouse to the right, another home to the left and a commercial railway was behind it all. there was a big willowy tree across the average residential sized stree and it was above that, off a distance. however, it seemed very close... it was the sive of a car and it slowly inched forward over the warehouse. it was silver and shiney, the sun was reflexting off of it, but i could see white lights all around it and under it. it was a totally stereotypical looking ufo. i watched it transfixed because i didn't know what it was... it stopped and seemed to be idling for a good five minutes, then slowly moved forward again. it almost seemed like it was looking at the neighboorhood. it stopped again and then zipped away so fast in the direction it was going. i ran outside to see where it had been and where it went, but it was gone. no exaust or trail left behind. nextdoor my best friend and two neighboorhood kids i played with were standing in the front yard, jaws dropped and eyes wide. they saw it too. we told our parents and they all said it was an airplane. i remember asking if they had flying cars, because it was that big and shiney. but to this day i swear what i saw was not an airplane. i was only seven, but years later when i heard of ufos i knew what i had seen. i remember i was in such awe, i didn't know what it was, but it was so amazing it kept my attention unlike anything else. my friends where scared but transfixed too. seeing something so strang so young makes me convinced i saw a ufo because i had never heard of such a thing before."],"Sighting Duration":"Undisclosed","Date Submitted":"06/15/1993 01:00 UTC","Date of the Event":"06/15/1993 01:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.949768,+-123.028806(7167)&iwloc=A&hl=en\"> mufon case (7167) map </A>","Longitude":"-123.028806","Object Features":"Dome","Viewing Distance":"101-500 Feet","Object Shape":"Circle, Disc","Latitude":"44.949768","Source":"MUFON","files":["/var/www/straped/mufon/html2text/7167.html.txt","/var/www/straped/mufon/org/7167.html"],"trends":["There have been 40 other sightings in Salem","There were no other sightings in Salem on or around June 15th 1993"]}