{"Object Shape":"Triangle","Case Number":"7168","City":"Petaluma","trends":["There have been 11 other sightings in Petaluma","There were no other sightings in Petaluma on or around November 30th 2002"],"Sighting Duration":"00:05:00","Date of the Event":"11/30/2002 09:00 UTC","Log Number":"US-06062007-0005","Latitude":"38.234167","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.234167,+-122.632312(7168)&iwloc=A&hl=en\"> mufon case (7168) map </A>","Summary":"Dark or black, underside with multiple lights in a triangular shape, slow moving","Disposition":"Hoax","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/7168.html.txt","/var/www/straped/mufon/org/7168.html"],"Longitude":"-122.632312","Viewing Distance":"Over One Mile","Region":"California","Date Submitted":"11/30/2002 09:00 UTC","Weather Factors":"None","Country":"United States","Source":"MUFON","divs":["Sighting DetailsI don't know what this was. I am not an avide believer, but if this was a UFO, it would be the second ever I saw. My mother, sister, then boyfriend and me were driving home to Rohnert Park from Petaluma California in I think the summer of 2003 0r 2004. I didn't drive then, so I don't know the exact road, but we took the highway which was occupied by many cars. It was between 10:30 pm and 11:30 pm when we were on the road, stopped due to an accident up ahead. I was in the back seat driver side looking out the window when I noticed this huge dark shape maybe two or three miles off lingering in the sky. The road was higher than the valley below and there must have been an airport or something because there where light towers below the thing. It was about two miles above the towers. There was also three heliocopters flying around it. I informed everyone in the car to look out the window and nobody could tell what was going on. I rolled down the window and could hear the heliocopters, but it was so wierd because they where circling this huge black triangular thing, which didn't seem to make any noise. The traffic started moving again, so as we drove away I kept watching the whole situation with the heliocopters examining this thing. When we got home my mom turned on the news to see if there was anything about it, because a lot of people must have seen it as they waited on the road. Nothing on any station reported anything. My sister and boyfriend could care less, but all week, all month me and my mom listened up for anything on the news. We never herd a thing so dismissed it. But I'll never forget how strange the whole thing was."],"Object Features":"None"}