{"Disposition":"Insufficient Data","Region":"Wisconsin","Longitude":"-92.536586","Summary":"Triangular shaped, with chasing lights above the horizon","files":["/var/www/straped/mufon/html2text/7169.html.txt","/var/www/straped/mufon/org/7169.html"],"Date of the Event":"04/07/2007 09:30 UTC","Tags":"City","divs":["Sighting DetailsOn April 7, 2007 at 9:30 p.m. my son in law noticed a strange light in the sky as he was getting something out of his car. He called me, my daughter and son to the back deck. We saw a triangular shaped object above the tree line on the horizon. With the naked eye we could see different colors of lights, blue, green, red, white. When we viewed it through binoculars, we could clearly see that the lights were chasing around the outside edge, and the points of the triangle were rounded. The object appeared to be jerky, but it could have been our hands. It stayed stationary in the sky for over three hours. We didn't stare at it the entire time, but went back frequently to look. It was gone after about three hours. The sky was beautifully clear. We were out in the country and the night sky was very bright. We often go outside just to marvel at the beauty. He just happened to do that and saw the object. We identified several airplanes while the object was there, and it was definitely not an airplane. We thought it must have been a satellite, but we have seen satellites before, and they move rather quickly across the sky. This didn't move at all. We don't know what it was."],"City":"New Richmond","trends":["There have been 2 other sightings in New Richmond","There were no other sightings in New Richmond on or around April 7th 2007"],"Weather Factors":"Unknown","Object Flight Path":"Stationary","Object Shape":"Triangle","Log Number":"US-06062007-0006","Country":"United States","Sighting Duration":"Undisclosed","Object Features":"None","Case Number":"7169","Date Submitted":"04/07/2007 09:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.123021,+-92.536586(7169)&iwloc=A&hl=en\"> mufon case (7169) map </A>","Latitude":"45.123021","Viewing Distance":"Over One Mile","Source":"MUFON"}