{"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/7171.html.txt","/var/www/straped/mufon/org/7171.html"],"Log Number":"US-06062007-0008","Date Submitted":"06/06/2007 10:55 UTC","Source":"MUFON","Summary":"3 Fly objects (one orange two white)","Case Number":"7171","Region":"Pennsylvania","Tags":"City","Object Features":"Unknown","trends":[],"Object Flight Path":"Undisclosed","Date of the Event":"06/06/2007 10:55 UTC","Latitude":"41.205162","Viewing Distance":"Unknown","Longitude":"-77.189355","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.205162,+-77.189355(7171)&iwloc=A&hl=en\"> mufon case (7171) map </A>","City":"Undisclosed","divs":["Sighting Detailsfirst off i have really bad spelling, so just go with it. But heres how it started. I fixing the front end of my car in the garage because i hit a raccoon the other day and i have a big road trip im going on tomorrow. After im done banging the dang thing out i get this urge to go outside and check out the stars, the night was really clear and i just had this weird urge to do just that. Normally im pretty scared of the dark outside and rarely go outside after turning the outside lights off. So i go outside and can clearly see venus, very bright lower in the Western sky. I also see a low flying plain to the north of me that is very easily noticeable as a plane... red and blue lights with a flash every once in while. So i look back to the western sky and i notice this orange light heading in a north-east direction. I thought it could have been a distant plane or a satellite at first but as it got closer it wasn't flying in an orbital path (it was going straight) and it certainly didn't have a red and blue light with the occasional flash. So this light is getting closer and closer (id say probably about 1,000 to 2,000 feet up, but its hard to say with no reference). So as this thing is approaching i suddenly get this feeling that something is watching me from behind, and right as i turn around (looking South-east) there is a very bright white (that comparable to venus) light moving south and another less bright white light moving in the same direction (basically follow-the-leader). As soon as i see this light i feel that it knows im there, some sort of deep down feeling that was pretty much indescribable. So the bright light shrinks down to the size of the light infront of it and they continue to move across the sky beyond the tree line at the same speed in the same direction one behind the other. This is when i knew something was weird. So i look back in the direction of the orange light and its just sitting there in the sky. And i all of the sudden get the same odd feeling that it knows im there. And right when i got this feeling the object began to head north east heading towards Erie. Pretty intense. Overwhelming fear at the same time i felt comfort from my deep down need to know that something else is out there. And that it is real. And that its probably watching us."],"Country":"United States","Disposition":"Unknown","Object Shape":"Sphere"}