{"map":"<A HREF = \"http://maps.google.com/maps?q=42.538935,+-123.141675(7172)&iwloc=A&hl=en\"> mufon case (7172) map </A>","Source":"MUFON","trends":["There have been 4 other sightings in Rogue River","There were no other sightings in Rogue River on or around June 6th 2007"],"City":"Rogue River","Date of the Event":"06/06/2007 07:03 UTC","Weather Factors":"None","Case Number":"7172","Object Features":"Window(s), Insignia, Wings, Other","files":["/var/www/straped/mufon/html2text/7172.html.txt","/var/www/straped/mufon/org/7172.html"],"Country":"United States","Tags":"City","divs":["Sighting DetailsI was out walking on a back trail with my dog when six to ten ships fly low overhead. three of them were inverted Y from the back and front. thoes ships landed in a clearing while three more flew overhead. the three were black with a blue outline on the hexagon wings. from the front view, they looked like a H with a ball in the center. the ones that landed were white with white blinking lights, such as an aircraft on earth and a contuous blue light on the back. their two wings on the bottom folded up making a W shape as it landed, making a deep moan and a whine as a jet engine. when that happened, 6 ramps, two per ship, opened up. i couldnt believe it. then, several human like creatures came out. they were white with black joint areas. then, one took off his head, but it was a helmet. it was human! he caried what looked like an automatic weapon of some kind. the weapon was black. it looked like an earth weapon. there were dosens of the aliens! some were talking, some were unloading boxes. they spoke english. it seemed like they were military, but not ours. i got a peak in the only window on the ship closest to me. a human wearing a space suit such as our astronauts and a black helmet just like the white guys. so as soon as the ships left and the white guys were gone, i got the hell out of there."],"Date Submitted":"06/06/2007 07:03 UTC","Object Shape":"Square, Rectagular, Other","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","Sighting Duration":"03:07:23","Region":"Oregon","Log Number":"US-06072007-0001","Latitude":"42.538935","Disposition":"Hoax","Summary":"landing of three ships. total of six ships","Viewing Distance":"21-100 Feet","Longitude":"-123.141675"}