{"Region":"Alberta","Sighting Duration":"Undisclosed","trends":[],"divs":["Sighting Details I get up every morning around 6 am, go to my kitchen turn the hot water on for my coffee. When I have my toast and coffee ready I sit down at my table which is facing west, and have my breakfast, turn the TV on and watch CNN news. At around 6:30 to 6:45 I just happened to look outside, ( there was a few clouds around and the sun was coming up and it was very bright outside) I noticed a couple of silver ball type objects heading north,there was a few trees in font of the objects, and then an open patch, and then the roof of the house next door. I could not believe what I was seeing, I ran to the window ( which was closed ) and tried to see what they were, it was not a plane ( no tail ), it was not a helicopter, it was just plain silver balls. When they disappeared behind the house I then ran to my front window to see if I could see them again, but the street is lined with trees which blocked my vision. My heart was really pumping, I just could not believe what I just saw. As they were going behind the roof of the house next door, they seemed to be gaining speed, but I don't know for sure. I then sat down to finish my breakfast, my head going a million miles an hour and then I saw another one, silver ball, by the time I got to the window again it was gone. I must not be the only one who saw it, as at that time of the morning there are a lot of people heading down town to work. They were probably 5 to 7 city blocks away. Just guessing of the altitude of about 500 feet of the ground. Now when I have my breakfast, or go anywhere I always have a digital camera with me."],"files":["/var/www/straped/mufon/html2text/7177.html.txt","/var/www/straped/mufon/org/7177.html"],"Case Number":"7177","Country":"Canada","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Summary":"Silver balls, coming from the south going north, 2 and then 1 about 1 to 2 min later","Tags":"City","Object Shape":"Circle","City":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=53.938411,+-116.569284(7177)&iwloc=A&hl=en\"> mufon case (7177) map </A>","Latitude":"53.938411","Object Features":"None","Date Submitted":"04/27/2007 06:35 UTC","Log Number":"CA-06072007-0006","Date of the Event":"04/27/2007 06:35 UTC","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Longitude":"-116.569284","Source":"MUFON"}