{"Tags":"City","Latitude":"43.300628","Longitude":"-73.585949","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/7183.html.txt","/var/www/straped/mufon/org/7183.html"],"Disposition":"Unresolved","Weather Factors":"None","City":"Hudson Falls","divs":["Sighting DetailsAt appx 9:03 pm on Wednesday, June 6, 2007, I went out to put my car windows up and a bright light in the southern sky caught my eye. I looked up and saw a round, very, very bright light moving in a northeasterly direction. I watched for a few seconds observing the object. There were no flashing lights, no strobing lights, no identifying lights as seen on the many planes that fly in our skies (day and night)from our local county airport. There was no trail of any kind either. It appeared to be a circular glowing bright light - not something on fire or burning. I quickly went to the porch, opened the door and called to my 14 yr old grandson to come look. He came out and observed the object as well. He said, \"Gram, get your camera!\" I said, \"What is that? It is so bright and moving so fast.\" The light never changed in brightness or appearance as it approached me, passed over us, or moved away from us (The object was entirely enveloped in bright white light - I noticed that there were light rays eminating from it as though the light source was internal). It appeared to be traveling at a low altitude and at a very high speed. There was no sound to be heard as this object approached, flew over us and flew away from us. Before we lost sight of it beyond the trees, my grandson was observing it with the binoculars: I said, \"Look there is a plane headed in its direction (the plane was heading north and was in the eastern sky). The plane must have been at a much higher altitude and further away from us as it appeared as a pin dot, but you could clearly make out the flashing red and white lights. The unknown object was very large in size in comparison to the plane and to the stars that were out at the time. I have never seen anything like this before in my entire life. One other note: The object seemed to zig-zag a few times as it was moving away from us. My grandson and I both noticed this. The object did not appear to be falling at any time during my observation, but navigating. This was a very odd experience!"],"Case Number":"7183","Date of the Event":"06/06/2007 09:10 UTC","Summary":"Large, silent, fast-moving and very bright white circular light was seen in the night sky over upstate NY on 6-6-07","Viewing Distance":"Unknown","Object Features":"None","Object Flight Path":"Path with directional change","Region":"New York","Log Number":"US-06082007-0006","Country":"United States","Date Submitted":"06/06/2007 09:10 UTC","trends":["There has been one other sighting in Hudson Falls","There were no other sightings in Hudson Falls on or around June 6th 2007"],"Object Shape":"Circle, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=43.300628,+-73.585949(7183)&iwloc=A&hl=en\"> mufon case (7183) map </A>","Source":"MUFON"}