{"Object Flight Path":"Straight-line path","trends":["There have been 9 other sightings in Citrus Heights","There were no other sightings in Citrus Heights on or around June 8th 2007","This sighting has never been favorited.",""],"divs":["sighting detailsdate & time: friday, june 8, 2007; 9:00 p.m.--ish place of encounter: i was in my backyard. i was out to run my little dog with the light pen and to do some sky-watching--not really thinking to see much over the suburbs of sacramento...when i looked over my rooftop to the eastern sky and this \"thing\" which was flying low at a moderate rate of speed come across the sky. when i say \"low\" i mean it was flying at about the height of local helicopters when they buzz over your house and it was fairly large, so that's how close it was. duration of encounter: i counted the seconds (7) from the moment i saw it and followed it through my backyard as it passed across the skyline out of my range of vision as i have large trees in my backyard. my backyard length is about 110 feet, so do the math. color and shape: it was light grey, oval-shaped, but not defined--as if you took a picture of a cloud, imported it into photoshop or other photo program then cropped out an oval shape and filtered a gradient from the center to the edge, giving it a three-dimensional hazy appearance. it had no visible lights. ground lighting: the sky was almost completely dark. there was ambient light from local businesses, but we have a tall fence, so most all of the light is filtered softly through the trees or appearing just over the cusp of the fence-line to the west of my house. the encounter was to the east. flight pattern: it flew in a straight line from a south-eastern heading to a north direction: from my home it would be from orangevale\\fair oaks, over citrus heights (where i live), heading towards roseville, ca. sound: it made no sound. my reaction was one of disgust in myself because i had my video camera, set on night vision, but my dog was bugging on me to play with the light pen so i sat the camera down. that is when this \"thing\" appeared. my feelings about it were elation; my rational mind said that it was quite unusual."],"Latitude":"38.716355","Date Submitted":"06/08/2007 09:00 UTC","Object Shape":"Oval","files":["/var/www/straped/mufon/html2text/7184.html.txt","/var/www/straped/mufon/more/7184_submitter_file1__060807_CitrusHeights_ufo(2).JPG","/var/www/straped/mufon/org/7184.html"],"Disposition":"Unknown","Log Number":"US-06092007-0001","Object Features":"None","Tags":"City","Date of the Event":"06/08/2007 09:00 UTC","Country":"United States","Sighting Duration":"00:00:07","map":"<A HREF = \"http://maps.google.com/maps?q=38.716355,+-121.279651(7184)&iwloc=A&hl=en\"> mufon case (7184) map </A>","City":"Citrus Heights","Source":"MUFON","Case Number":"7184","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Region":"California","Weather Factors":"None","Longitude":"-121.279651","Summary":"Oval-shaped object flying south to north over eastern skyline"}