{"trends":["There have been 16 other sightings in Livonia","There were no other sightings in Livonia on or around June 8th 2007"],"Latitude":"42.36837","Sighting Duration":"01:45:00","Longitude":"-83.35271","Country":"United States","files":["/var/www/straped/mufon/html2text/7190.html.txt","/var/www/straped/mufon/org/7190.html"],"Object Flight Path":"Unknown","Log Number":"US-06102007-0002","Date of the Event":"06/08/2007 09:45 UTC","divs":["Sighting DetailsI work outside at night for a major transportation company. At around 2145 I noticed a bright white light in the sky at about the 40 degree position in the sky. Since I work only about 10 miles from Metro Airport, I thought it was the landing lights at first of a airliner, but dismissed that thought as it was at a higher altitude for a normal approach to the airport. Then I thought maybe it was the Space Station or something like that? It was a lot larger than a normal star, so i thought maybe it was some planet passing close to earth. I then went about doing my work, and kind of forgot about it. My location at the time of the sighting was on the West side of our building. I was driving a fork lift while preparing the trailers for the next loads. At about 2330 I was waiting for a tractor to come for fuel on the North side of the building when I noticed the orb again. It was now about at the 20 degree point in the sky, having now almost traversed half the sky. I seen another employee come by a overhead door to have a smoke. He started telling me he was a tomato grower, and was worried about the weather lately. So I said \" have you ever seen this star when you have been outside\"? An took him out a few steps so he could see it. He said no. Then said he would look tomorrow with his brothers telescope on saturday night for it. Another Tractor came at the fuel island about 15 minutes later, and i asked the driver if he had ever seen this bright star before. As I pointed at where it was last time i seen it, it was gone. Later when he came back to the Yard, I was driving a tractor out of the wash tunnel when he flashed his lights to tell me that it was \" all over the radio about something in the sky\". I told him what I saw was not a shooting star or a comet, but a large star like object. The same white as a star. I don't know what it was. It moved from south to north from about the 40 to last i seen the 20 degree mark in the western sky. What I heard on the radio after work did not describe what I saw."],"Summary":"White light orb, star color, size in sky slightly smaller than a street lamp","map":"<A HREF = \"http://maps.google.com/maps?q=42.36837,+-83.35271(7190)&iwloc=A&hl=en\"> mufon case (7190) map </A>","Tags":"City","Viewing Distance":"Unknown","Case Number":"7190","Disposition":"Unknown","Object Features":"Unknown","Region":"Michigan","City":"Livonia","Date Submitted":"06/08/2007 09:45 UTC","Object Shape":"Star-like","Weather Factors":"Unknown","Source":"MUFON"}