{"Longitude":"-75.510844","Sighting Duration":"Undisclosed","Date Submitted":"06/08/2007 10:00 UTC","Object Shape":"Star-like","divs":["Sighting DetailsLast Friday night June 8th around 10 to 10:30PM my family and I were having a bonfire on the beach in Avon, NC on Hatteras Island. We had been star gazing for about 10 minutes or so and I spotted what looked like 1 moving star. I pointed it out to my wife and my mom and they started watching it too. The moving light looked just like a star but I thought it may have been an airplane. The thing about it was that it did not have any blinking lights it was a solid light that looked like a star. The light was moving from the north to the south in the night sky. The light had been moving for about 30 seconds to a minute when it passed by another star that was stationary and kept going. The star or light that was stationary started following the 1st light. When the second star or light started following the first light the first light changed direction from south to north to a east direction which made it look like it was loosing altitude. The 1st star or light stayed on this course for maybe a minute and then started moving north across the sky again. As the first light switched direction from east to north the second light turned south follwoing the path of the first light. The first light continued north and disappeared and the second light disappeared around the same area that the 1st light turned north. I only saw the one light following or chasing the other but my wife was telling me that she saw a third star or light follwing the second and she said as the second light disappeared the third light became stationary and looked like a dim star. About 30 minutes later as we were getting ready to walk back to the house we were still looking at the sky to see if we could find any more moving lights. I noticed another star and it was probably the 3rd brightest star in the sky. It was directly east of us over the horizion of the ocean and was stationary. This star or light did not have any blinking lights as well and we only looked at it because it was so bright. We watched it for a few minutes and this star or light got dim and started moving south across the sky. I was thinking that maybe just maybe this was a plane that had changed direction but there were not blinking lights on this object either. As this object started moving south it just disappeared. Right now I don't know what we watched. I don't believe that the first siting with the stars following the stars were planes. However I kind of lean toward the fact that the second siting may have been a plane that changed direction. I don't know though because it did not have any blinking lights. If someone could pull any kind of radar logs or something I think they could either prove or rule out airplanes."],"Object Flight Path":"Path with directional change","Summary":"Stars chasing a star? Moving stars?","trends":["There have been 2 other sightings in Avon","There were no other sightings in Avon on or around June 8th 2007"],"Country":"United States","Weather Factors":"Windy","City":"Avon","Object Features":"Unknown","Log Number":"US-06102007-0004","Latitude":"35.352186","files":["/var/www/straped/mufon/html2text/7192.html.txt","/var/www/straped/mufon/org/7192.html"],"Case Number":"7192","Disposition":"Unresolved","Tags":"City","Viewing Distance":"Unknown","Date of the Event":"06/08/2007 10:00 UTC","Source":"MUFON","Region":"North Carolina","map":"<A HREF = \"http://maps.google.com/maps?q=35.352186,+-75.510844(7192)&iwloc=A&hl=en\"> mufon case (7192) map </A>"}