{"Object Features":"None","Country":"United States","Region":"California","Object Shape":"Star-like","Disposition":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.600238,+-121.894676(7197)&iwloc=A&hl=en\"> mufon case (7197) map </A>","Log Number":"US-06112007-0004","Date of the Event":"06/10/2007 10:10 UTC","Sighting Duration":"Undisclosed","Weather Factors":"None","Date Submitted":"06/10/2007 10:10 UTC","City":"Monterey","files":["/var/www/straped/mufon/html2text/7197.html.txt","/var/www/straped/mufon/org/7197.html"],"Summary":"Observed a swarm of objects flying from north in a southerly direction in the western sky","divs":["Sighting DetailsI was out walking at spproximatelt 10:10 PM on Sunday evening and stood still for a moment just outside my house tracking an object flying silently directly overhead in a westerly direction with two blinking red lights when suddenly there was a flash (similar to a huge camera flash or a stroboscopic flash) in the western sky at about 70 degrees up in the sky in my right field of vision. Immediately thereafter I observed a \"swarm\" - and I say \"swarm\" because that is the closest thing that what I saw resembled - of tiny lights moving very rapidly from the north (near where the flash in the sky had occurred) in a southerly direction. There were many tiny lights - perhaps as many as fifty or more, though I cannot say for certain how many, there were as many as the idea of a \"swarm\" came to my mind to describe what I saw. The lights moved in an atypical manner as compared to common aircraft in that the individual trajectories of the lights criss-crossed one another in a manner similar to living things - a moving swarm of insects, a flock of birds, or a school of fish. Though moving very rapidly, they did not appear to collide or combine with one another. The lights seemed to have volition, that is - they seemed conscious of their movement and direction. The lights were very tiny pinpricks of white light, and appeared, based on the plane that I had been observing flying overhead just prior to seeing them, to be flying at a very very high altitude. I observed them for perhaps 10 seconds as they flew in a southerly direction in general towards the bright star or planet that presently dominates the southern sky in the evening hours until they disappeared from sight - not behind an obstruction in my field of vision, but when they got too far away for me to see them any more. The line of trajectory within which I observed this swarm of lights flying was not more than one foot in the sky from the time of the flash until they disappeared from sight. There were no sounds, and to be honest, I was so shocked at what I saw, that I totally forgot the aircraft I had been observing, or what happened to that. I am sure that the pilots on that aircraft must have observed what I saw. This event occurred directly over the Monterey Bay. The weather conditions were the sky was clear and very dark with a few wisps of fog or clouds at a low level. It was cool and silent and visibility was excellent. This is what I saw in its entirety. I did not get any bad feelings from what I saw. At first when I saw the flash, I was confused, thinking perhaps a camera flash had gone off, but in a moment I realized that was not what had occurred, and that I had seen a flash in the sky. When I looked back towards where the flash had occurred, that was when I observed the swarm of lights. I never have seen anything like this before, and do not know what it was. There is plenty of military in this area and there is a NASA installation south of here near Big Sur. I would be very curious to know (probably we will never know) whether these objects or lights were observed by NASA or the Military, or if anyone else in this area observed what I saw last night."],"trends":["There have been 18 other sightings in Monterey","There were no other sightings in Monterey on or around June 10th 2007"],"Case Number":"7197","Tags":"City","Viewing Distance":"Over One Mile","Latitude":"36.600238","Longitude":"-121.894676","Object Flight Path":"Path with directional change"}