{"divs":["Sighting DetailsI was standing behind my mini-van in my driveway preparing to load it with lawn cutting equipment.It was a beautiful moring after a strong cold front moverd through the region and the sky was eccepitonaly clear and blue.And I couldn't help notice how well I could see a jet aircraft flying out of Detroit airport and it had not met its cruising altitude yet and just thought to myself that the atmosphere was so clear.Then I noticed just above the jet was a object stationary just like the planet venus or jupiter but there was no way it could have been a star or planet at that time in the morning.It was just so out place. It was not moving twoard me or away from me it did not move left or right. It was not a seagull or flock of them. At that time I wanted to get my binoculars then i had hoped that my video tape recorder was charged and it wasnt so i tried to plug it in and take it out and it was gone after about a quick two minutes. I scanned the sky with my eyes and nothing."],"City":"Toledo","Case Number":"7200","Tags":"City","Region":"Ohio","Log Number":"US-06112007-0007","Source":"MUFON","trends":["There have been 35 other sightings in Toledo","There were no other sightings in Toledo on or around June 9th 2007"],"Longitude":"-83.545742","Object Shape":"Circle, Sphere, Star-like","Date of the Event":"06/09/2007 10:55 UTC","Object Flight Path":"Stationary","Viewing Distance":"Over One Mile","Summary":"Watching passenger jet flying out of detroit over Toledo looking into western sky clear blue morning i noticed above the aircraft was a object stationary above and west of jet","Country":"United States","Sighting Duration":"00:03:00","Latitude":"41.671708","files":["/var/www/straped/mufon/html2text/7200.html.txt","/var/www/straped/mufon/org/7200.html"],"Object Features":"None","Weather Factors":"Unknown","Disposition":"Insufficient Data","Date Submitted":"06/09/2007 10:55 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.671708,+-83.545742(7200)&iwloc=A&hl=en\"> mufon case (7200) map </A>"}