{"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=29.380196,+-100.888437(7205)&iwloc=A&hl=en\"> mufon case (7205) map </A>","Longitude":"-100.888437","Sighting Duration":"Undisclosed","Date of the Event":"06/11/2007 12:00 UTC","City":"Del Rio","Region":"Texas","Case Number":"7205","divs":["Sighting DetailsMY FAMILY AND I WERE SWIMMING IN THE BACKYARD WHEN I NOTICED AN OBJECT IN THE SKY AND JUST LIKE THE OTHER REPORT FROM THE PERSON IN TOLEDO IT LOOKED LIKE A STAR OR PLANET OUT OF PLACE WHICH IS WHY IT CAUGHT MY ATTENTION TO BEGIN WITH.IT STARTED AS CLOUDS WERE PASSING AND AS THEY PASSED THIS ONE OBJECT REMAINED.MY HUSBAND INSISTED IT WAS A PLANE OR A STAR BUT IT WAS MOVING ACROSS THE SKY AND THEN JUST REMAINED IN ONE SPOT FOR ABOUT 2-3 MINUTES.BUT AS IT FLOATED THERE YOU COULD SEE WHERE IT WOULD (AT LEAST THAT'S HOW IT SEEMED) TO DIVIDE INTO 2 SEPARATE OBJECTS AND THEN RETURN TO ONE. I SAW THAT HAPPENED TWICE. DURING THIS TIME AN AIRPLANE TOOK OFF FROM OUR LOCAL AIRPORT FLYING OVER US TAKING AWAY ANY DOUBTS THAT THE UNIDENTIFIED OBJECT MIGHT HAVE BEEN AN AIRCRAFT.MY DAUGHTER HAD RAN IN TO GET HER VIDEO CAMERA BUT AS MUCH AS EACH OF US TRIED TO FOCUS IN ON IT, THE OBJECT WOULD NOT SHOW UP ON CAMERA. WE COULD SEE IT WITH OUR OWN EYES BUT WHEN WE LOOKED THROUGH THE CAMERA THE OBJECT COULD NOT BE SEEN.MY DAUGHTER TRIED, MY HUSBAND TRIED, AND I TRIED BUT NOTHING. THEN ANOTHER AIRCRAFT WENT BY CLOSE TO THE OBJECTS I DON'T KNOW WHAT THEY'RE CALLED BUT WE SEE THOSE OFTEN, THE ONES THAT LEAVE THAT SMOKE TRAIL BEHIND.ANYWAY AS THAT PASSED BEFORE IT GOT CLOSE TO THE OBJECT THE OBJECT FLAT OUT DISAPPEARED.I DID NOT SEE IT MOVE IN ANY DIRECTION JUST SIMPLY DISAPPEAR FROM SIGHT.AT THIS POINT THERE WERE NO CLOUDS ANYWHERE NEAR IT TO HAVE HIDDEN IN.IT WAS A CLEAR BLUE EVENING.I DON'T KNOW WHAT IT WAS I SAW, MAYBE THERE IS AN EXPLANATION FOR IT,AND WE DO HAVE AN AIRFORCE BASE NEARBY BUT I'VE NEVER SEEN ANY AIRCRAFT MOVE LIKE THIS.BY THE WAY, I'M NOT A MEMBER I'M NOT EVEN ONE WHO GOES OUT LOOKING FOR THESE KIND OF INCIDENTS SO MY OWN SAKE CAN ANYONE TELL ME IF THEY'VE SEEN ANYTHING LIKE THIS IN THE DEL RIO AREA OR IF THERE IS AN EXPLANATION PLEASE SHARE ?"],"Disposition":"Unknown","Source":"MUFON","Country":"United States","files":["/var/www/straped/mufon/html2text/7205.html.txt","/var/www/straped/mufon/org/7205.html"],"Date Submitted":"06/11/2007 12:00 UTC","Weather Factors":"Unknown","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Summary":"A STAR-LIKE ALMOST OBJECT APPEARED AND DISAPPEARED","Latitude":"29.380196","Tags":"City","Object Shape":"Circle, Star-like","Log Number":"US-06122007-0005","trends":["There have been 12 other sightings in Del Rio","There were no other sightings in Del Rio on or around June 11th 2007"]}