{"Weather Factors":"None","Latitude":"40.557206","Date Submitted":"06/09/2007 04:58 UTC","Longitude":"-85.598044","map":"<A HREF = \"http://maps.google.com/maps?q=40.557206,+-85.598044(7207)&iwloc=A&hl=en\"> mufon case (7207) map </A>","divs":["sighting details i awoke on the morning of june 9, 2007 at 4:58 am to go to the bathroom. i walked into the bathroom and did not turn on the light as something caught my attention through the window. i could see bright lights through the limbs of a very tall tree. it is very easy to see through this tree. the object was about 150 feet (approx) from my window and moving very slow north. i noticed there were two flashing white lights on the back of the ship and each time they flashed i could see they were round. i could tell the shape of the back the best and it was shaped like a boomerang. there were light panels all over this craft.i could also see a seperation or space between the panels. it was lit up so much i could not tell if the craft was round or pointed at the front. the bottom was flat, the back was pointed, i could see a shape on top that slanted down toward the front. i was trying to figure out what i was looking at, trying to make sense of this. planes can not go this slow, planes have red and green lights. planes make alot of noise. helicopters make more noise than a plane, i was trying hard to make sense of what i was looking at. i did not see any red or green flashing lights. i also did not hear any sound of a engine. but there was a a\\c unit running in the bedroom. i watched the craft fly slowly northward from behind the tree, into a clear area with no limb abstructions. the craft continued moving very slow northward a short distance then was just above the white pines on the other side of my driveway. at this time it went out of sight, only because it was just above the tree tops. if it would of been higher i could of seen it longer. i observed all i could for the time i had. since i have seen this i have felt different. it is hard to explain, but because it did not fit into anything i know, then what do i say it was? i have not told my kids yet, and do not know if i should. there young and am afraid they would be scarded."],"Object Flight Path":"Straight-line path","Country":"United States","Object Features":"Dome","Tags":"City","Sighting Duration":"Undisclosed","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/7207.html.txt","/var/www/straped/mufon/org/7207.html"],"trends":[],"Summary":"Slow moving object (4MPH) With many white lights, 2 white lights blinking on back , About 80 feet off the ground. Flying north Just over trees.","City":"Undisclosed","Log Number":"US-06122007-0007","Case Number":"7207","Source":"MUFON","Date of the Event":"06/09/2007 04:58 UTC","Viewing Distance":"101-500 Feet","Region":"Indiana","Object Shape":"Boomerang, Cylinder"}