{"trends":["There have been 23 other sightings in Beaverton","There were no other sightings in Beaverton on or around June 12th 2007","This sighting has never been favorited.",""],"Date Submitted":"06/12/2007 02:05 UTC","Viewing Distance":"Unknown","Date of the Event":"06/12/2007 02:05 UTC","files":["/var/www/straped/mufon/html2text/7208.html.txt","/var/www/straped/mufon/org/7208.html"],"Object Shape":"Oval","Latitude":"45.477351","Log Number":"US-06132007-0001","Summary":"Bright Neon Blue Ring of Light Flashed High in the Sky for a few seconds","Case Number":"7208","Object Features":"Unknown","Tags":"City","Weather Factors":"None","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=45.477351,+-122.790193(7208)&iwloc=A&hl=en\"> mufon case (7208) map </A>","Region":"Oregon","divs":["Sighting DetailsI was standing on the 3 story deck of my friend's townhouse, and I was talking to her when over her head to the Southwest in the sky appeared an oval ring of bright blue light that appeared out of nowhere and stayed visible for a few seconds and then disappeared in front of my eyes. It was a very clear and cool night. We had gone out on the deck to just chat and stargaze before we went to sleep. The deck is three 12 foot ceiling high stories and the townhouse sits on a hill with a big view of the sky and rooftops below. There is a \"hill\" behind us with tall evergreen trees and beyond that is farmland. We are up pretty high. We had just been looking at a bright star (probably a planet), and the object appeared about 10 minutes later above and to the right of the bright star or planet we had just been looking at before I saw the object. I grabbed my friend's arm and said...\"OH MY GOD! WHAT THE HELL WAS THAT!?\" and she said, she saw a flash of light out of her peripheral vision to the right of her. She's been a UFO buff for about 35 years, and I have thought it was all kind of a bunchy of hooey, but it also scares me the things she tells me she reads about, but I don't want to believe it. When I saw this bright oval light appear out of nowhere and then disappear again, it made a believer out of me!!! My friend said she was jealous she didn't see it, but only saw what she described as \"Like a flashbulb going off in the sky behind me\". I KNOW what I saw, and it was an oval ring of blue light with a dark hole center. It had no tail or trail like a shooting star or a comet. It made no noise. It was just there, and then it wasn't there, and it was so bright and blue and such a weird shape against everything else in the clear night sky. This was no ordinary or natural light in the sky and no reason for it to just appear. It didn't come from a direction or leave in a direction. It was just there, and then gone a few seconds after I saw it. Just long enough to scare the heck out of me, and freak me out. I had nightmares about it that night, and I couldn't get to sleep for the longest time. My friend laughed and told me not to be scared of UFO's or aliens, because she said if they wanted to harm us, they'd have done it ages ago! I am still scared after seeing that! I'm not going anywhere without my camera now!"],"Disposition":"Unknown","Longitude":"-122.790193","Country":"United States","City":"Beaverton","Source":"MUFON","Object Flight Path":"Stationary"}