{"Tags":"City","Sighting Duration":"00:15:00","Date Submitted":"06/06/2007 10:00 UTC","Object Flight Path":"Undisclosed","Longitude":"-87.700819","Country":"United States","Region":"Alabama","divs":["Sighting DetailsI and one other person witnessed anomalous lights from near Gulf Shores, AL on June 6, 2007 at approximately 2200 central time. The lights were observed in the WSW at approximately 35 degrees above the horizon while I and one other person were stargazing. The lights initially appeared as three separate lights horizontally level in relation to each other. I was able to observe the lights through binoculars and and each individual light appeared to be two separate rectangular lights spaced closely together. I was also able to discern a third, faint, strobing light near the two rectangular lights. When the lights faded out the rectangular light on the right went out followed immediately by the rectangular light on the left. The lights apparent size was that of pea held at arms length. It was impossible to estimate the altitude or the actual size of the lights. No noise was heard, however the sound of the surf would almost definitely masked the sound of any distant aircraft. At the time I thought that they were possibly the exhaust of jet fighter aircraft as the aircraft were flying at level flight at an angle directly away from my position, however the lights reappeared three or four times in approximately the same position over a period of several minutes. This, in my mind, rules out that hypothesis. A few minutes later, a single light appeared slightly to the south of the original lights at roughly the same angle above the horizon. The light remained stationary for approximately 2 seconds and then expelled a similar light from the left (my left) which quickly descended approximately three times the width of the original light as if it were in free fall then both lights faded out simultaneously. Initially, I thought that this might have been a flare dropped from an aircraft, however the short duration of the light is not a characteristic of a military-type flare. One or two minutes later another similar light appeared in roughly the same position as the one previously described. About one second after it appeared the light seemed to streak to my left (east) a short distance and then quickly faded out. When the object moved it produced streaks of light behind it (opposite the direction of travel). That marked the end of the observation. Nothing further was observed. Afterwards, the other witness and I discussed the possible explanations of what we had just seen. We considered the possibilities mentioned above, meteorites and space junk reentering the atmosphere. However, we concluded that none of these possibilities could adequately explain what was observed. We both agreed that what we witnessed was unlike anything ever observed by either of us. I am a Captain in the Army with 18 years of service, have served in combat and I have a B.S. in geology. The other witness has served in the military, is a combat veteran and has a degree in and currently practices law. One last note: There is a report on the NUFORC website of a similar sighting from the same area on the same date and time. I have also reported the sighting to their website."],"City":"Gulf Shores","Weather Factors":"Unknown","Object Shape":"Fireball, Star-like, Other","Date of the Event":"06/06/2007 10:00 UTC","Viewing Distance":"Unknown","Case Number":"7215","Summary":"Anomalous Lights Near Gulf Shores, AL","trends":["There have been 6 other sightings in Gulf Shores","There were no other sightings in Gulf Shores on or around June 6th 2007"],"Log Number":"US-06142007-0001","Disposition":"Unknown","Latitude":"30.246036","map":"<A HREF = \"http://maps.google.com/maps?q=30.246036,+-87.700819(7215)&iwloc=A&hl=en\"> mufon case (7215) map </A>","files":["/var/www/straped/mufon/html2text/7215.html.txt","/var/www/straped/mufon/org/7215.html"],"Object Features":"Undisclosed","Source":"MUFON"}