{"Region":"Colorado","Viewing Distance":"Unknown","Date of the Event":"05/14/2007 03:25 UTC","Country":"United States","Case Number":"7219","Source":"MUFON","trends":["There have been 11 other sightings in Castle Rock","There were no other sightings in Castle Rock on or around May 14th 2007"],"Log Number":"US-06142007-0005","Disposition":"Insufficient Data","Date Submitted":"05/14/2007 03:25 UTC","files":["/var/www/straped/mufon/html2text/7219.html.txt","/var/www/straped/mufon/org/7219.html"],"Latitude":"39.379832","divs":["Sighting DetailsI was driving north bound on I-25 just a couple of mile south of Castle Rock Colorado. Traffic was only moving about 35 mph since there was an accident ahead. I looked north toward the sest side of the hiway and saw a helicopter moving southward. Then I noticed a trapizoidal shaped object that at first seemed to be being towed by the helicopter. The aircraft moved out of my view but the object behind it remained. I could not really tell its size and the shape changed and appeared to glide like a bird and sort of hover. At one point it looked like a bipalne, but I know a plane when I see one. Traffic was almost stop and go so I could only view it at short intervals. After a couple of minutes it started to move upward and looked like an ink blot in the clear sky. It ascended up toward a small cloud moving east. It seemed to stop and then shot downward toward the horizon in a north easrsterly direction at a high rate of speed until it disapeared as a black dot. I have nevr saw anything move the way this thing did. The sky was clear and the object was only at about 30 degrees. There must be others who saw this. It was so plain to see, especially for the fact that it came up behind the helicopter which would have drawn someones ele's eye to it as well"],"Longitude":"-104.85396","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Object Features":"Unknown","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Shape":"Boomerang, Triangle, Other","City":"Castle Rock","map":"<A HREF = \"http://maps.google.com/maps?q=39.379832,+-104.85396(7219)&iwloc=A&hl=en\"> mufon case (7219) map </A>","Tags":"City","Summary":"It frst looked like a kite with a trapaziodal shape then appeared to glide like an eagle and hover. It was dark in appearance,"}