{"Object Flight Path":"Undisclosed","City":"Narrows","Longitude":"-80.807537","Source":"MUFON","Viewing Distance":"Unknown","Latitude":"37.33268","Country":"United States","Case Number":"7227","Summary":"I turned on the camera / video and started filming and there it went...","Region":"Virginia","Object Features":"Undisclosed","Date Submitted":"06/16/2007 12:00 UTC","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/7227.html.txt","/var/www/straped/mufon/org/7227.html"],"divs":["sighting detailsi decided to take a video of the area that i have been photographing and in one video i captured two flying throughout the video at high rates of speed and towards the end of the video they are shown flying off in the same direction. i used a kodak easyshare c653 camera for all photos and these videos. in the second video the ufo is in the first second or two flying west to east. i didn't see the first ufo's in the first video until i uploaded it onto computer. i saw only a dark streak\\blurr in the second one through my camera and actually had hoped that i caught it on video but thought initially it might be a bird. i uploaded it, using quicktime i then reduced the speed then enlarged it to see a disk\\cylinder shaped object. using quicktime i found that i could pause the video and review it frame by frame. it is definitely disk shaped. no noises other than my dogs are present. i really wish that someone would come to check this out because for over a week now almost every photo i take has these orb shaped objects and disk shaped objects in them and i don't have the proper equipment to film them well."],"Tags":"City","trends":["There have been 8 other sightings in Narrows","There were 2 other sightings in Narrows on or around June 16th 2007","This sighting has never been favorited.",""],"Date of the Event":"06/16/2007 12:00 UTC","Log Number":"US-06162007-0005","Object Shape":"Undisclosed","Sighting Duration":"00:00:01","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.33268,+-80.807537(7227)&iwloc=A&hl=en\"> mufon case (7227) map </A>"}