{"trends":[],"Disposition":"IFO","Object Features":"Unknown","City":"Undisclosed","Latitude":"36.786961","Longitude":"-119.415642","Country":"United States","divs":["Sighting DetailsThe past 20-25 days I have seen lights in the sky appearing to have the same flight pattern as birds would...sometimes flying in V like formations (up to seven at a time) I am a smoker so i often go outside and will gaze at the stars...I have never in my life seen anything like i have the past month. I have been viewing the moving lights over the newport bay. I have seen the lights moving in different directions most of the time along the coast in both directions. Some nights i will see maybe 10-15 sightings a nights in increments of about 2-5 minutes...while some nights I may only see 1 or none. The lights appear to change speeds. It is pretty much impossible to guess the speeds or distance of the lights because I see the lights at night and i can not see the figure of the object. I only see the lumination. I have seen the lights at times change dirctions once i saw one flying alone make a u-turn and immediately following the turn the light vanished. I would defenately say that the lights are within the atmosphere and sometimes the lights may appear very close while over the bay. On occasion I will see 2 flying together as well. Now I can not say that what I am saying is Alien, but I am having trouble identifying them. 1 out of 5 lights i see will appear to flash once or twice while in flight. While visible I will see the lights in the sky for about 5-20 seconds. The best description i can give for the object would be that it looks like birds flying in the sky that give or reflect light from the belly area. While it is day time I will look at the birds and there patterns to give me reference at night sometimes the lights at night seem to be moving much faster than the birds i will see during the day. The hardest part I am having is explaining the light I see. I have never seen a bird emit light before. The first time i saw it I immediately thought alien. I saw about 7-10 the first night. It had my heart racing. They seemed to move so fast...maybe because they seemed farther away than they were...I dont know. I tried to video tape the events for two of the night but was unsuccessful the camera I was using was no where near capable of capturing the objects mostly because getting the object in focus at night while moving was impossible. Thats pretty much it...If anyone knows what it is i am seeing please let me know"],"Object Flight Path":"Path with directional change","Tags":"City","Log Number":"US-06172007-0001","Summary":"many lights at night over 25+ days over newport beach","Date Submitted":"05/31/0001 12:00 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/7232.html.txt","/var/www/straped/mufon/org/7232.html"],"Region":"California","Case Number":"7232","map":"<A HREF = \"http://maps.google.com/maps?q=36.786961,+-119.415642(7232)&iwloc=A&hl=en\"> mufon case (7232) map </A>","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Date of the Event":"05/31/0001 12:00 UTC","Object Shape":"Star-like, Unknown"}