{"trends":["There has been one other sighting in Bath (Berkeley Springs)","There were no other sightings in Bath (Berkeley Springs) on or around September 11th 2001"],"Date of the Event":"09/11/2001 08:00 UTC","Log Number":"US-06172007-0004","map":"<A HREF = \"http://maps.google.com/maps?q=39.626233,+-78.226253(7235)&iwloc=A&hl=en\"> mufon case (7235) map </A>","Country":"United States","City":"Bath (Berkeley Springs)","Date Submitted":"09/11/2001 08:00 UTC","Longitude":"-78.226253","divs":["Sighting DetailsLocation: Berkeley Springs, WV. On September 11, 2001, between 8 or 9 AM, I was standing outside next to a fence, waiting for my mom to come back to the house from the barn (I was homeschooled at the time). I don't remember how, but somehow something in the sky caught my eye, and I was at once intrigued. A silvery object, cigar-shaped, was traveling in a northern direction. I'm not sure of its size, but it was clearly very high up. I can't recall how fast it was moving...I hesitate to say that it was pretty fast. I wouldn't have thought much of it if I hadn't noticed a faint, dull brown speck circling perfectly below it. Its orbit, if one could call it that, was very tight; the diameter of this \"speck's\" trajectory appeared shorter in length than the silver object it circled. It never appeared to deviate from its course; it was as if it were attached by a string to the hull of the silver object...that's how perfectly it stayed in stride. Neither of the objects made any visible trails. The sighting may have lasted anywhere from 30 seconds to a minute, but as the house was in the way of my view of the object I had to stand on the fence to continue watching the two objects until they disappeared behind the trees. My younger brother saw it, too, though he remembers little. I talked about the event excitedly until we learned of the Terrorist Attacks on America. I do not believe the objects are connected with the attacks, save (perhaps) observation."],"Disposition":"Unknown","Tags":"City","Source":"MUFON","Object Flight Path":"Straight-line path,Other","Object Features":"Unknown","Sighting Duration":"Undisclosed","Object Shape":"Cigar, Other","Case Number":"7235","files":["/var/www/straped/mufon/html2text/7235.html.txt","/var/www/straped/mufon/org/7235.html"],"Weather Factors":"Unknown","Summary":"I was outside. Saw two objects heading north; silvery cigar under which circled a brown speck. Altitude high. Unable to recall speed. No sound or trails.","Region":"West Virginia","Viewing Distance":"Unknown","Latitude":"39.626233"}