{"Source":"MUFON","Country":"United States","Viewing Distance":"Unknown","Longitude":"-122.866395","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Log Number":"US-06182007-0004","Latitude":"42.329135","Sighting Duration":"Undisclosed","City":"Medford","Tags":"City","Date Submitted":"01/01/2006 12:01 UTC","Disposition":"Insufficient Data","trends":["There have been 34 other sightings in Medford","There were no other sightings in Medford on or around January 1st 2006"],"Summary":"Not a one time thing. Its every night! 100's of them in the Oregon sky. Nobody else sesm to notice?","map":"<A HREF = \"http://maps.google.com/maps?q=42.329135,+-122.866395(7239)&iwloc=A&hl=en\"> mufon case (7239) map </A>","files":["/var/www/straped/mufon/html2text/7239.html.txt","/var/www/straped/mufon/org/7239.html"],"divs":["sighting detailsdoesnt matter what time of sundown i go outside and look. they are there. at first i figured it was satellites but as night after night of seeing them, i started realising that maybe its something a little more. ive had a about 10 instances where i would go outside and look and there will be one just over the tree line moving slowly with no sound. i do wear contacts so i can say in my defense that i cant quite make out what they are but even through binoculars is alomost impossible to tell as they alost seem to glow so much they look like stars from the sky not a 1\\4 mile in the air. its fun showing others such as friends and family and seeming them see them and keep on seeing them night after night but totally blow it after awhile. there is so much going on that its basically gotten boring to everyone around here. you can see them appear as satelites and then all of a sudden take off\\disappear\\stop\\change direction all in one night of looking.i find it amusing when others give me the yeah right look and then i open thier eyes to the sky here in oregon.ive seen them flash myself and my younger cousin with a camera like flash.the very night that opened my eyes to them i seen a huge flash in the sky and seen literally about 1000 of these lights all of a sudden take off in all directions. im probably one of 1000's who feels kinda weird even talking about this but it would be nice to know what and the heck all this is. please! feel free to check the skies here in oregon.they are here."],"Weather Factors":"Unknown","Region":"Oregon","Case Number":"7239","Object Shape":"Sphere, Star-like, Unknown","Date of the Event":"01/01/2006 12:01 UTC"}