{"City":"Minneapolis","Date Submitted":"06/12/2007 12:00 UTC","Country":"United States","Disposition":"Insufficient Data","Latitude":"44.984825","files":["/var/www/straped/mufon/html2text/7242.html.txt","/var/www/straped/mufon/org/7242.html"],"trends":["There have been 52 other sightings in Minneapolis","There were no other sightings in Minneapolis on or around June 12th 2007"],"Region":"Minnesota","Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Viewing Distance":"Unknown","Source":"MUFON","divs":["Sighting DetailsOver the past couple of weeks residents of the Stevens neighborhood witnessed what appeared to be small orbs of light mainly above the Wells Fargo Skyscraper in downtown Minneapolis. It started when I was out in my back alley and just happened to glance up at the night skyline. The objects were bright enough to jump out at me, but likely wouldn't have been noticed had I not at least been looking in that direction. It looked like a couple of glowing balloons, but it was the way they moved that really caught my attention. The lights would sit still for about a minute, then suddenly shoot off behind another building only to suddenly re-appear directly over the Wells Fargo building. The objects would zip back and forth at high speed, moving and stopping abruptly. The lights have appeared regularly each night. They seem brightest when the city lights seem brightest, but are still able to be seen after the lights downtown are turned off. Birds have been ruled out due to the agility, the speed of the objects, and their apparent luminosity. It is unknown whether or not there were possible weather experiments being conducted on top of the Wells Fargo building during the times in question, but this also seems an unlikely explanation considering the speed and movement of the objects. There is, of course, a large international airport nearby, but this makes it that much easier to distinguish planes from other airborn craft. Being a large city, Minneapolis has helicopters with spotlights that occasionally circle the sky, however their appearances have been far more frequent since these objects were first noticed. There have also been loud military jets tearing directly over downtown that look as if they are coming from the airport, but only c-130s fly from that airport as far as I know. Watching these things made my heart race. It was very exciting, and very beautiful in a strange way. I've tried to convince myself they were anything other than UFOs, but after a lot of thought I don't know what to think. Believing they are UFOs is way more fun, anyway. Perhaps there is a simple explanation for these things, but it has at least one Minneapolis neighborhood completely baffled! I'm sure we'll all continue to watch the skies until we find out its somebody with super-fast radio-controlled airplanes on top of a skyscraper, or something like that."],"Longitude":"-93.258876","Case Number":"7242","Date of the Event":"06/12/2007 12:00 UTC","Object Shape":"Sphere, Star-like","Sighting Duration":"Undisclosed","Log Number":"US-06182007-0007","Summary":"A series of small orbs of light were seen above downtown Minneapolis, zig-zagging, disappearing, re-appearing","map":"<A HREF = \"http://maps.google.com/maps?q=44.984825,+-93.258876(7242)&iwloc=A&hl=en\"> mufon case (7242) map </A>"}