{"Date Submitted":"01/06/1968 11:30 UTC","Case Number":"7244","map":"<A HREF = \"http://maps.google.com/maps?q=41.952065,+-84.206799(7244)&iwloc=A&hl=en\"> mufon case (7244) map </A>","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/7244.html.txt","/var/www/straped/mufon/org/7244.html"],"Weather Factors":"Unknown","Date of the Event":"01/06/1968 11:30 UTC","Sighting Duration":"Undisclosed","Summary":"town and car engulfed in intense blue beam of light","Latitude":"41.952065","Longitude":"-84.206799","Log Number":"US-06182007-0009","trends":["There have been no other sightings in Rome","This sighting has never been favorited."],"Source":"MUFON","Country":"United States","City":"Rome","Disposition":"Unknown","Region":"Michigan","Object Shape":"Oval","Viewing Distance":"Unknown","divs":["Sighting DetailsWell, this is my second attempt at relaying this story to you since the power just inexplicably went off during my first attempt. I have kept this sighting secret for close to forty years. This was mainly due to fear. I will explain this at the end. At the time of this sighting I was a college student at The University of Toledo. It was a cold, overcast Saturday night in January, 1968 (it did snow later that evening). I was on semester break. I and two of my fraternity brothers were on our way to a camping trip at one of the other brother's parents' cottage located in the Irish Hills of lower Michigan. We were headed up route 223 out of Toledo, Ohio and had just driven through the small town of Rome Center (near Adrian, Michigan). I was sitting in the back seat of the car on the passanger's side when I felt a sensation of light coming from behind me. At first I paid little attention to this thinking it was just bright car lights coming up from behind us. However, after it happened again I paused then turned around to look out the back window of the car to discover that there was no other car on the road behind us. Puzzled, I continued to look out the back window. Then, approximately 500 feet in the clouds, the outline of an oval shaped blue light with a similar beam of blue light came on to engulf the small town which we had just driven through! We were driving up a small incline, so it was very easy to discern the oval shape of the blue beam of light. It was so distinct that I could clearly make out the oval edge of the beam in the darkness of the night (there were NO street lights!) Again, it was the most intense, beautiful blue I have ever seen! But strangely, I could look at the light without squinting. I cannot say enough how I was awe-struck by this beautiful blue light! However, there was a definite on-off pattern to this light. It reminded me of a \"gigantic\" flash bulb. And, it was huge! I would say that the size of the UFO, when closest to our car, would compare to a pineapple held out at arms length. As I continued watching, the UFO came on again, but, this time directly over the road behind us. It was definitely moving in a SE to NW direction. Why it reminded me of a huge flash bulb is because the blue oval shape in the clouds and the beam of brilliant blue light came on at the same time but then, the beam of light would fade back into the oval shape in the clouds and then go off! If I was a betting man, I would say that this UFO was taking pictures of the area! Now is when things start gettting a little strange. The next time the UFO appears it is directly over our car. I distinctly remember looking up into this light. But, it was no longer blue but instead a very intense white light...I remember that it hurt my eyes! The next thnig I remember is sitting down in the back seat, looking out the front window of the car and hearing the driver say \"I'm gettin' the hell out of here!\" With this, the driver slammed his foot onto the gas pedal and left the area at a high rate of speed. I caught one last glimpse of the UFO going on again approximately 1,000 yards in the distance. Now, this might seem to be a normal reaction from the driver, but, I NEVER said a thing to anyone in the front seat about what I was observing out the back window. Yes, the driver could have become alarmed observing the UFO through his rear view mirror, but all the while I was watching this UFO, the driver and his front passanger were engaged in conversation. And, how did the UFO move that far away from my vantage point in such a short time? Well, when we arrived at the cottage, all the lights were out and everyone was asleep! By my watch it was past 1:00 a.m. WE WERE NOT THAT FAR FROM THE BROTHERS COTTAGE WHEN I OBSERVED THE UFO...WHY DID IT TAKE US ANOTHER HOUR-AND-A-HALF TO ARRIVE? Also, upon arrival, no one in the car mentioned the UFO. To this day, it has never been discussed among us. Not too long after this my headaches began! They have continued up until this day although they seem to be getting less severe as I age. What happened to me a few years later made me stay quiet regarding this UFO sighting. I was now a teacher at a local high school in Toledo. Although I lived only a couple of blocks from the school I still drove. One morning I was backing out of the drive-way when I noticed an old-style black Cadillac parked in front of my house. I pulled away from my house and this black Cadillac starts following me...right into the parking lot of the school where I taught! The Cadillac proceeds to pull-up in the parking space right next to mine. Needless to say I was very concerned about who this person was and why they were following me. When I looked over to see who it was, I was met by a pair of icy, glaring eyes. To this day, I will NEVER forget how these eyes starred right through me! He just kept staring at me! I say he because, I think it was a he! He wore a white overcoat with the collar turned up all the way around his neck and mouth with a white brimed hat turned down so all that I could see were his eyes and nose (which appeared to be very thin and narrow). The eyes reminded me of two black coals! The skin of this guy was \"whitish!\" I stared back at him for a few seconds but then quickly walked into the building where I taught hoping to catch a glimpse of his license number. Mind you, I am constantly keeping the Cadillac in my peripheral vision all the time I am walking to and entering the building. On entering the building there was a door immediately to my left that I entered where the room included windows all along the side facing the parking lot from which I had just exited. It took me less than 5 seconds to get to the window to observe this Cadillac...but it was gone! I do not know how he got out of the parking lot in such a short amount of time without me seeing him! Besides that, other cars were driving in...and this was only a \"single\" drive way. He would have had to wait for the other cars to pass before he could have driven out! As a side note here, you should know that I was getting ready to put together a complete report of my 1968 sighting prior to this visit from the black Cadillac! Also, so you know I am not some kind of nut, I hold three degrees including an Industrial Engineering Technology Degree . As a result of what happened that evening, I have been studying the phenomenon of UFO's for years. However, I have never come across a report similar to mine. If one exists out there, I would certainly be interested in reading it. Also, over the years, I have come to the realization that something happened to me that night in 1968. I do not know what. But I have to find out! Thank you. Dan Welch"],"Object Flight Path":"Undisclosed","Tags":"City"}