{"Date of the Event":"06/17/2007 11:30 UTC","Viewing Distance":"Unknown","Summary":"Watched a very small light traveling fast south to north extreme altitude no blinking discernible, suddenly brighten then fade.","Longitude":"-104.971924","Latitude":"39.868041","Tags":"City","files":["/var/www/straped/mufon/html2text/7245.html.txt","/var/www/straped/mufon/org/7245.html"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.868041,+-104.971924(7245)&iwloc=A&hl=en\"> mufon case (7245) map </A>","Date Submitted":"06/17/2007 11:30 UTC","Weather Factors":"None","Country":"United States","Object Features":"Unknown","Source":"MUFON","trends":["There have been 7 other sightings in Thornton","There were no other sightings in Thornton on or around June 17th 2007"],"Object Shape":"Flash, Star-like","City":"Thornton","Object Flight Path":"Straight-line path","Case Number":"7245","Region":"Colorado","Log Number":"US-06182007-0010","Disposition":"IFO","divs":["Sighting Details At the time reported was sitting in my hottub in backyard, very dark without outside light sources, as we like to gaze while soaking. I am very familiar with all the normal aircraft approach and departure of DIA aircraft and also the usuall fly over pattern so we see the jet and general aviation all the time. As I was simply looking straight up more in a northerly direction, (The big dipper was two the northwest as I was looking up) At the extreme of my vision being able to really discern a light, I saw a very small (or perhaps very extreme altitude distant) light traveling at least 3 times faster than the jet traffic I am accustomed to seeing traveling south to north in a straight line and constant velocity. The sky in that area was very clear, with no discernable cloud cover. My first inclination was that I was seeing a sattelite passing overhead. The movement caught my attention and I watched it for maybe two or three seconds duration when It seemed to stop, and then immediately the light intensified to at least the same size and brightness as Venus, which I could identify in the West sky. This really got my attention! This \"Pulse\" for lack of a better description, only lasted no more than 1 second, followed by it returning to the original observed size, continuing at more or less the same constant speed and tragectory but faded from view completely within another 1 or two seconds. Several minutes later, I saw another similar sized object more westerly, as it passed directly through the handle of the big dipper as it moved south to north, at the same apparent velocity as the first, but this object did not \"Pulse\". The distance between the paths were about a hand width when thumb extended up at my arms length, if that matters at all. I am 6' even. Is this a common sight? I would really like to know if anyone else has seen this occur. I will really be paying attention from now on! Hope this report helps. Thank You."]}