{"Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=42.332705,+-122.872925(7248)&iwloc=A&hl=en\"> mufon case (7248) map </A>","Country":"United States","Source":"MUFON","Sighting Duration":"Undisclosed","Date Submitted":"06/18/2007 10:24 UTC","Viewing Distance":"Over 1 Mile, Unknown","trends":["There have been 34 other sightings in Medford","There were no other sightings in Medford on or around June 18th 2007","This sighting has never been favorited.",""],"Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/7248.html.txt","/var/www/straped/mufon/more/7248_submitter_file1__DSCN0030.JPG","/var/www/straped/mufon/more/7248_submitter_file2__DSCN0032.JPG","/var/www/straped/mufon/more/7248_submitter_file3__DSCN0031.JPG","/var/www/straped/mufon/org/7248.html"],"Tags":"City","divs":["Sighting DetailsI was taking my dog out to do her business and looked up in the sky at the beautiful night when I saw a very pronounced extremely bright red sphere high in the sky. At first thought I believed it to be a satellite as many fly over the area. However, as I watched this sphere it zig zagged two distinct times in its flight path in a very pronounced way. It almost was as a blip on a heart beat monitor, but obviously not exactly. I called to my wife who also observed the red sphere and the zig zagging pattern in its flight path. This is the third sighting of an anomaly this year. As it went to the East-South-East it phased out like a satellite would if it lost reflection but since this thing zig zagged in its flight path I have no explanation. It flew in a linear path, zig zagged, then return to its flight path. It did this twice. I am attaching three pics I took of it. It was also brighter than Venus in the west (for reference)."],"Latitude":"42.332705","Date of the Event":"06/18/2007 10:24 UTC","Weather Factors":"None","Region":"Oregon","Object Shape":"Sphere","Log Number":"US-06192007-0002","Summary":"Red sphere in the sky from the NW to the ESE over my house.","Disposition":"Insufficient Data","Longitude":"-122.872925","City":"Medford","Case Number":"7248"}