{"Country":"United States","Latitude":"45.522943","Region":"Oregon","Tags":"City","Source":"MUFON","Longitude":"-122.989856","Log Number":"US-06192007-0003","Date of the Event":"06/18/2007 10:20 UTC","Object Flight Path":"Path then hovering","Date Submitted":"06/18/2007 10:20 UTC","Sighting Duration":"00:30:00","Case Number":"7249","Weather Factors":"Unknown","Object Shape":"Diamond","files":["/var/www/straped/mufon/html2text/7249.html.txt","/var/www/straped/mufon/more/7249_submitter_file1__061807.JPG","/var/www/straped/mufon/org/7249.html"],"Viewing Distance":"Over One Mile","Summary":"diamond shaped object, lots of lights, no noise at all, then dissappears","Object Features":"None","Disposition":"IFO","City":"Hillsboro","divs":["Sighting DetailsI was walking my dogs out, at around 10:10pm, this Monday, June 18th, 2007. I walked down towards the old folks retirement home, as there is a fence where I can let the dogs loose to run, and have some fun for a few minutes. While walking around with them, I noticed, the moon in crescent form, and the two thirds of it were a black disc, with the crescent moon lit up nicely. Now, positioned down from the moon, and out a few degrees, was another object, very bright in the evening sky, and I attribute this to being one of our local planets. It is as bright as a football stadium light, with all the other stars shining out more like a small flashlight. I turned to the dogs to pet them, then I looked up, and once again, thanked God for bringing any astro beings traveling who would like to say hello, to stop on by, or to make themselves known in their travels here to earth and on by. I looked up, as something caught my eye from by the crescent moon, and down at about the same position as the bright shining planet I just described, and noticed another light, moving across the sky, heading right for me directly. It seemed to sway to the left and then to the right on it's straight line, on an easterly journey. By now it is 10:10pm or 10:25pm. It was about on top if me. Now I was in a very quiet spot, and could hear nothing at all. Not a whisper of noise, no engine, no prop no small aircraft noise, no green and red navigational light. all I saw were a set of two or three bright lights in the middle, shining down, and the flicker of lights running around the rim, as if it were round. I stopped, waived at it, and tried to take a cell phone picture, but I could not find a way to capture it on my cell phone camera. I tried to find it several times, but I could not find a light in my camera lenses at all. Just black sky. It was at this time, I looked up at it, as it had move quite a distance by now, probably half way from here (Tanasbourne area, to downtown Portland), and it just went black, as it never existed before. I thought it might be the new space station, but no way, this was a lot lower than that. I would say maybe traveling around 30k feet or so. It flew right over me, stopped for a moment, then slowly proceeded on. When I looked at my watched, I noticed about 20 more minutes went by, and the dogs were much further apart than they should have been. I never let them out of my sight, I had to corral them back to me. They did not want to come near me for some reason. But they did. Then I kept trying to piece together the time. It wasn't a lot of time, but that much time had not gone by. I called my partner to tell him about it. Here we go again. Ok so that was cool. I would love to hear from you again if ok."],"map":"<A HREF = \"http://maps.google.com/maps?q=45.522943,+-122.989856(7249)&iwloc=A&hl=en\"> mufon case (7249) map </A>","trends":["There have been 8 other sightings in Hillsboro","There were no other sightings in Hillsboro on or around June 18th 2007","This sighting has never been favorited.",""]}