{"Source":"MUFON","Longitude":"-122.79929","Case Number":"7250","trends":["There have been 23 other sightings in Beaverton","There was one other sighting in Beaverton on or around June 18th 2007","This sighting has never been favorited.",""],"Log Number":"US-06192007-0004","Summary":"WAY Brighter and Bigger than Venus! Star-like, but way too big to be a satellite moving.","Date of the Event":"06/18/2007 10:22 UTC","Date Submitted":"06/18/2007 10:22 UTC","Object Flight Path":"Straight-line path,Path with directional change","Latitude":"45.493132","Sighting Duration":"Undisclosed","City":"Beaverton","map":"<A HREF = \"http://maps.google.com/maps?q=45.493132,+-122.79929(7250)&iwloc=A&hl=en\"> mufon case (7250) map </A>","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/7250.html.txt","/var/www/straped/mufon/more/7250_submitter_file1__IMGP1049.JPG","/var/www/straped/mufon/org/7250.html"],"Country":"United States","Viewing Distance":"Unknown","Weather Factors":"None","Region":"Oregon","Object Shape":"Star-like","Tags":"City","divs":["Sighting DetailsOkay, now this is almost embarrassing to tell. After reporting a UFO event a week ago, my boyfriend, his daughter, and I were out on my deck (3 12 ft stories high) looking in the sky talking about the degrees of the angle my BF's daughter saw the UFO, which was a blue bright light...along comes a new siting! We were pointing to Venus and talking about the area and angle the other UFO was seen when we looked away for a minute at airplanes in the distance flashing going into PDX in their normal flightpath, when we looked up overhead again. There in the sky was a huge bright light bigger and brighter than Venus by about double. It was 10:22pm, because we looked at the clock this time! My BF and I were alone watching this really bright light moving from the West heading Southeast high in the sky and we yelled to his daughter to come quickly and look! She was across the house and came running and it was still in the sky very bright and still moving. It was way to bright to be a satellite. No flashing lights, no colored lights and at 10:22pm it was good and dark outside and lots of stars and airplanes were out. This thing was huge, and it moved across the sky like a satellite, but it was brighter than anything in the sky and Venus was very visible. It just kept heading Southeasterly until it was completely out of sight. It seemed like it was high in the sky, because shortly after that a real satellite passed over and it was a speck in comparison and about a 32nd as bright as Venus. This thing all three of us saw had no tail, trail, smoke, sound, or colored lights. We weren't really sure if it's path was all that straight. It was just one big bright light like a double sized Venus or more, and it just kept a steady nice speed across the night sky, but we thought it wobbled a little bit at one point. We all 3 saw it. We are all disgusted at some of the ridiculous reports that are here on MUFON that make the rest of us look like crazy lunatics. What is with all the lame reports like coming out of bars seeing things, and things coming out of TV sets and killing kids? WHY PUBLISH THIS JUNK??? Come on people, if you want to report a UFO...make it worth all our time and tell the truth or get your head examined. The truth is out there...look up, not at your TV tube or while you're stumbling out of a bar! Oh, we tried to take a picture of this thing, but all we got was the movement of the light that made it look like a smoke or rocket explosion with a star in the background. The star was still, the thing that was moving blurred. I'll enclose it anyway."],"Disposition":"IFO"}