{"files":["/var/www/straped/mufon/html2text/7260.html.txt","/var/www/straped/mufon/org/7260.html"],"City":"Lincoln","Weather Factors":"Does Not Apply","Case Number":"7260","Object Shape":"Star-like","Object Features":"Unknown","Date Submitted":"06/18/2007 01:00 UTC","Object Flight Path":"Stationary","divs":["Sighting DetailsI was looking out of a kitchen window whilst making coffee, from the window i can see for miles around as there isnt much but feilds in the area untill it comes to a road which crosses the whole of the horizon right off in the distance (you can see the street lights illuminating the road) I noticed a reddish light way off in the distance, it was low on the horizon but definately in the sky and staying in the same position.I didnt think much of it other than the fact that i've never seen anything in that position before.I kept looking at it for a few minutes just to check if it was a plane or to try figure out what it was because it was unusually low on the horizon.The light started twinkling after about a minute and then after perhaps another minute all of a sudden the light faded out.It was like the light had just been \"turned off\".I thought this unusual as obviously a star can't do this and nor can planets. After about 5 minutes i went back to the window to see if the light had returned and off in the distance i saw what i assumed to be a helicopter taking off from an airbase which is visible to me from the same window.The helicopter proceeded to go in the direction where the light had vanished from. The helicopter went past where the light was and then went around it and returned to it's base. If the light had of still been there the helicopter would of come close to the light but the light had already gone by the time the helicopter took off. I didnt get a pic as it dissapeared quickly.It just looked like a reddish star off in the far distance which stayed in the same position in the sky but winked out after a short time. The helicopter is the most interesting part of the story i feel.The weather was calm and clear and there were no clouds in sight."],"Country":"United States","Log Number":"GB-06192007-0014","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.807862,+-96.674419(7260)&iwloc=A&hl=en\"> mufon case (7260) map </A>","Sighting Duration":"00:05:00","trends":["There have been 42 other sightings in Lincoln","There were no other sightings in Lincoln on or around June 18th 2007"],"Latitude":"40.807862","Disposition":"Unresolved","Viewing Distance":"Over One Mile","Date of the Event":"06/18/2007 01:00 UTC","Region":"Nebraska","Source":"MUFON","Summary":"Distant reddish light which hovered but \"winked out\", helicopters checked area afterwards","Longitude":"-96.674419"}