{"files":["/var/www/straped/mufon/html2text/7261.html.txt","/var/www/straped/mufon/org/7261.html"],"Latitude":"42.97046","Object Features":"Appendage(s), Unknown","Disposition":"Unresolved","Date of the Event":"06/19/2007 10:40 UTC","City":"Grand Rapids","Source":"MUFON","Log Number":"US-06192007-0015","Weather Factors":"Unknown","Case Number":"7261","Date Submitted":"06/19/2007 10:40 UTC","Summary":"I WAS OUTSIDE ON MY DECK AND SAW A STRANGE VERY LARGE OBJECT","divs":["sighting detailsthe object appeared very long, in fact incredibly long, one bright smaller white round or oval light on top, in between darkness, bottom of the object or staff\\pole shaped, a very large round light moving very fast, if they were not connected it was in unison. these lights were brighter than any star, the night was clear with very few clouds. the object(s) were silent and moving easterly, there were aircraft in the area to the right of the object(at a distance), the aircraft in question definitely saw the lights. it made the jet look like it was not moving and with the lights from the plane it was easy to distinguish the unidentified object. the pilot had to report this to gerald r ford airport without question. the object(s) moved in together then shot straight up through a cloud and the lights fainted. it was the most bizarre thing i have ever seen. 1) i was letting the dogs out on my back deck 2) the very bright lights and how the objects or object was traveling. very fast 3) no idea what the object was, the plane off in the distance made a great comparison or example to this \"thing\". 4) long small round or oval light on top, on bottom very large intese round light 5) uneasiness after watching the plane on my right and this object on left 6)the object shot up through the small cloud and then shot straight up and was gone."],"Region":"Michigan","Country":"United States","trends":["There have been 45 other sightings in Grand Rapids","There were no other sightings in Grand Rapids on or around June 19th 2007"],"Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Object Shape":"Cylinder, Sphere, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.97046,+-85.663926(7261)&iwloc=A&hl=en\"> mufon case (7261) map </A>","Tags":"City","Viewing Distance":"Unknown","Longitude":"-85.663926"}