{"City":"Boise","Source":"MUFON","Weather Factors":"None","Object Features":"Unknown","Sighting Duration":"00:03:00","Object Flight Path":"Path with directional change","Object Shape":"Star-like","Latitude":"43.620391","Disposition":"Unknown","divs":["Sighting DetailsThis afternoon I stopped by our store on Maple Grove Street 2 blocks North of Overland Rd. in Boise. I had pulled the truck around back to unload some stuff, went in the store, did my thing and then exited the rear of the building. My work buddy followed me out and I walked around back of the truck to check if the back was closed. As I looked up in the sky while talking with my friend I noticed the crescent Moon. I also noticed something that looked like a star about 2-3 degrees in the 4 o'clock position to the moon. I told my buddy about today's picture on Spaceweather.com that shows a daytime photo of the crescent Moon and Venus. I thought I was actually seeing Venus up there, but as I continued to look at it, the object started to move slowly to the South Southeast. It moved slower than a hight flying pasenger jet. I pointed it out to my buddy and he commented that he didn't know what it was. I didn't either. He went inside to get back to work and I stared at it a few more minutes. It seemed to pulsate or throb with light. I watched it pass in front of some cirrus clouds and it was still visible against the white background. I kept waithing for it to do something weird that would verify that it was not a terrestrial vehicle, but it just slowly moved in the same direction, but it did curve more Easterly after a minute or so. Since it didn't do anything crazy I figured that I needed to get back to work, so I hoped in my truck and pulled around the building and onto Maple Grove. By the time I pulled around the object was lost from my sight. It did not follow any of the typical flight patterns of the airport that I have witnessed, so I don't know exactly what it was other than a throbing light in the sky that didn't move at the same speed as a high flying passenger jet. I took three pictures of it with my cell phone, but I don't know how to get them off of it to see if the object is even visible."],"Date Submitted":"06/19/2007 04:00 UTC","Date of the Event":"06/19/2007 04:00 UTC","Case Number":"7263","Viewing Distance":"Over One Mile","Country":"United States","trends":["There have been 69 other sightings in Boise","There were no other sightings in Boise on or around June 19th 2007"],"Region":"Idaho","map":"<A HREF = \"http://maps.google.com/maps?q=43.620391,+-116.203036(7263)&iwloc=A&hl=en\"> mufon case (7263) map </A>","Log Number":"US-06192007-0017","Summary":"Star like object moved slowly in a South Southeasterly direction below cirrus clouds.","Tags":"City","files":["/var/www/straped/mufon/html2text/7263.html.txt","/var/www/straped/mufon/org/7263.html"],"Longitude":"-116.203036"}