{"trends":["There have been no other sightings in Holyoke","This sighting has never been favorited."],"City":"Holyoke","Summary":"Two bright lights moving slowly across the sky in perfect unison from Northesat to Southwest.","Tags":"City","Weather Factors":"None","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-102.30241","Object Flight Path":"Straight-line path","Log Number":"US-06202007-0001","Source":"MUFON","Date Submitted":"06/19/2007 10:08 UTC","Object Shape":"Cigar","divs":["Sighting DetailsI was standing on my front porch that faces the West getting a breath of fresh air and noticed two dim lights in the sky to the Northwest moving to the Southeast. At first I thought they were two stars that were very close together. I thought that strange because I never noticed stars in that position that close together before. I looked down for about ten seconds looked up again and noticed the lights were getting brighter and getting closer to my position. The lights were in perfect unison in both speed and relative position to each other. There was absolutly no sound and there were no blinking navigation lights as an aircraft would have. They appeared to be relativly low, perhaps 500-1000 feet in elevation and the lights themselves appeared elongated, not circular in shape. Their airspeed appeared to be approximately 75-100 mph if the elevation is correct. Within 20 seconds after they passed overhead, the lights faded out which I found odd since they were visible for so long earlier as they approached. The night was clear with no cloud cover. The sighting was observed by my wife and my eleven year old daughter."],"Date of the Event":"06/19/2007 10:08 UTC","Country":"United States","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=40.584437,+-102.30241(7265)&iwloc=A&hl=en\"> mufon case (7265) map </A>","Disposition":"IFO","Region":"Colorado","files":["/var/www/straped/mufon/html2text/7265.html.txt","/var/www/straped/mufon/org/7265.html"],"Latitude":"40.584437","Case Number":"7265"}