{"Case Number":"7266","Region":"Indiana","Object Shape":"Cigar","Object Features":"None","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/7266.html.txt","/var/www/straped/mufon/org/7266.html"],"Date Submitted":"06/20/2007 11:50 UTC","Log Number":"US-06202007-0002","Longitude":"-85.134791","Weather Factors":"Unknown","Summary":"Two light appeared to chase each other in a striaght line traveling at the same speed.","trends":["There have been 41 other sightings in Fort Wayne","There were no other sightings in Fort Wayne on or around June 20th 2007"],"Disposition":"Insufficient Data","divs":["Sighting DetailsMy duaghter and I where cooling off in the pool in the backyard before we where going to go to bed. From the West I noticed then asked her to look as well at two moving lights that where moving from West to East. The lights where to far from each other to be a single plane and it appeared to move to fast to be a blimp (the lights where to far apart even for a blimp.) As it moved closer I could just make out a outline of the front of the object. The front was about 20% longer than the distance between the set of two lights. I could not hear any sound from it over the highway in the distance. It continued to fly in a striaght path as it flew over Fort Wayne and the light became dimmer the just disappeared as it appeared to cross over 69. I asked my daughter and I tried as well to verify that stars disappeared as it came between them and our viewpoint. She and I both saw the stars disappear momentarly as it passed on one side of the object. So it appeared to be one solid object. If I was to guess it was flying at about 4000 ft high and appeared to be 500 feet long and maybe 60 feet wide. I wear glasses and my daughter dose not. It maybe was traveling 150 MPH. Pretty slow for two jets chasing each other. (seeing two or more millitary jets is a common sight around Fort Wayne)The lights did not flash and were a slight golden white the one closest to us as it traved from the west to east was brighter and more golden in color. This was true even as it passed us and continued to travel east. I asked my daughter not to mention this to her mother because I already know she thinks I am crazy. I was glad my daughter was able to see something herself she could not easily explain. She has been tring very hard to not believe the so called crazies of the world when they say they have seen something."],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.081353,+-85.134791(7266)&iwloc=A&hl=en\"> mufon case (7266) map </A>","Object Flight Path":"Straight-line path","Country":"United States","Tags":"City","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","City":"Fort Wayne","Date of the Event":"06/20/2007 11:50 UTC","Latitude":"41.081353"}