{"Case Number":"7267","Object Features":"None","divs":["sighting detailsabout 10:30-10:33 pm east daylight time: i do a lot of binocular astronomy from my backyard, and my wife and i had just looked at jupiter to the south. as we walked back toward our house i looked up and pointed out 2 \"star\"like objects noticeably moving east. cassiopeia, and ursa major were visible, but not as bright due to hazy, sporadic clouds; one white light was lower and right of the other (my crude description would be they were about 3 inches apart; they stayed in same position as they traveled in northern part of sky west to east. at a casual glance they would have looked like stars. through 12-50 binoculars they looked exactly the same; no strobes or color, and no sound. no details were visible even with binoculars; just 2 moderately bright white lights, moving steadily east. viewing lasted 4-5 minutes, and my wife was with me. i went in and checked the time after the sighting and it was 10:39 pm. i see many silent aircraft flights at night, and figure a lot is \"homeland security\" air patrols; this was nothing like high flying jets with their lights and strobes visible! camp atterbury army base, edinburgh, in is quite close, plus crane naval surface warfare center is in southern indiana, and wright-patterson is to the northeast. our thoughts were some type of military flight, but it did not look like the usual ones we see nightly. we watched this until the object\\objects went from view still heading due east. shelbyville, in is between indianapolis and cincinnati by i-74, ind st. rd 9, and ind. st. rd. 44. _____________________________________________________________________________ . . _____________________________________________________________________________ relative position of the 2 white light objects"],"Tags":"City","Country":"United States","files":["/var/www/straped/mufon/html2text/7267.html.txt","/var/www/straped/mufon/org/7267.html"],"Summary":"In hazy sky, 2 star like objects traveled west to east","Date of the Event":"06/19/2007 10:35 UTC","Region":"Indiana","Viewing Distance":"Unknown","Source":"MUFON","Log Number":"US-06202007-0003","Weather Factors":"None","Object Shape":"Star-like","trends":["There have been 3 other sightings in Shelbyville","There were no other sightings in Shelbyville on or around June 19th 2007"],"Longitude":"-85.776924","Date Submitted":"06/19/2007 10:35 UTC","Disposition":"IFO","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=39.521437,+-85.776924(7267)&iwloc=A&hl=en\"> mufon case (7267) map </A>","Latitude":"39.521437","City":"Shelbyville","Sighting Duration":"00:05:00"}