{"map":"<A HREF = \"http://maps.google.com/maps?q=40.234482,+-123.82435(7268)&iwloc=A&hl=en\"> mufon case (7268) map </A>","City":"miranda","divs":["Sighting DetailsI got a call from a friend and he said to go outside and look tword his house. I live on the mountain across from him and I am at an elevation of 900 and he is at 300 and on the other side of the river. When I looked out at first I saw nothing but then the two lights caught my eye higher than my friend was explaining. My wife was with me and I asked if she saw it and she said yes. They moved across the sky so silent I knew for sure they were not conventional aircraft. they were flying in perfect unison. They were about a dimes size in the sky. I have seen alot of satelites and planes and such at night and can tell you these were neither and they appeared to be lower than the traffic plane that flys by in the day, not much more than 1800 feet elevation. They flew from north to south when I saw them and they disappeared over my sycamore tree in the front yard. I thought if I ran around it I should be able to see them travel the sky south for another five seconds or so but they were gone as soon as I looked back up. The entire time my friend and I were on the phone together and he said they had disappeared from his view too."],"Date of the Event":"06/19/2007 10:50 UTC","files":["/var/www/straped/mufon/html2text/7268.html.txt","/var/www/straped/mufon/org/7268.html"],"Viewing Distance":"Unknown","Log Number":"US-06202007-0004","Sighting Duration":"Undisclosed","Object Shape":"Circle","Object Flight Path":"Undisclosed","Date Submitted":"06/19/2007 10:50 UTC","Case Number":"7268","Weather Factors":"Unknown","Summary":"Two silent dime sized balls of light moving rapid and silent across the sky,","Tags":"City","trends":["There have been no other sightings in miranda","This sighting has never been favorited."],"Disposition":"Insufficient Data","Object Features":"Undisclosed","Region":"California","Country":"United States","Source":"MUFON","Latitude":"40.234482","Longitude":"-123.82435"}