{"divs":["Sighting DetailsLast night at approximately 11:30pm I was next to the house talking to my son and daughter-in-law when I decided to go back in the house. I casually looked up at the stars while I was walking, and noticed 2 bright stars that seemed to be traveling slowly in tandem across the sky. I then noticed an almost invisible shape surrounding the lights in the form of a blimp shape, or fat cigar. The shape was hard to detect unless you were concentrating on the lights because it blended into the dark sky almost perfectly so as to almost appear invisible. The object was large-the size of 3 or 4 full moons side by side. The object was traveling in a south easterly direction, and had it been a plane or helicopter, the engine noise would have been easily discernable at the height this appeared to be at. This object was totally silent. I quickly told my son and daughter to look up and pointed to the object--they also saw it. They continued to watch as I ran into the house to get my binoculars so I could see it better. By the time I came out and put the binoculars top my face the object lights were already becoming quite dim in the distance-I put the binoculars down in time to see the lights disappear and the object was no longer visible, like it had completely disappeared. There were only 2 white lights at the bottom of the object - almost double the brightness of nearby background stars. No other lights were seen--no colors, not blinking. It was totally silent and large, easily the size of a passenger airliner or bigger."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.987255,+-85.071117(7271)&iwloc=A&hl=en\"> mufon case (7271) map </A>","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Source":"MUFON","Country":"United States","Log Number":"US-06202007-0007","Region":"Michigan","Case Number":"7271","Date Submitted":"06/19/2007 12:00 UTC","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/7271.html.txt","/var/www/straped/mufon/org/7271.html"],"Object Flight Path":"Path with directional change","Tags":"City","Summary":"At approximately 11:30pm a large blimp shaped object with 2 white lights on the bottom silently sailed overheadin a southeasterly direction","City":"Ionia","Weather Factors":"Unknown","Latitude":"42.987255","Date of the Event":"06/19/2007 12:00 UTC","Longitude":"-85.071117","Object Shape":"Blimp, Cigar","trends":["There have been 4 other sightings in Ionia","There were no other sightings in Ionia on or around June 19th 2007","This sighting has never been favorited.",""],"Viewing Distance":"501 Feet - 1 Mile"}