{"Object Shape":"Other","Source":"MUFON","Summary":"Two bright lights moving WNW to ESE across the sky","City":"Laramie","Tags":"City","Sighting Duration":"00:00:40","Date of the Event":"06/19/2007 09:30 UTC","Case Number":"7272","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.312877,+-105.588991(7272)&iwloc=A&hl=en\"> mufon case (7272) map </A>","divs":["Sighting DetailsIn my backyard last night, my wife, a friend, and I saw two bright lights moving across the night sky from WNW to ESE. One light followed directly behind the other. As they moved, the lights became increasingly dim until they faded away about 30 degrees (rough estimate) above the horizon. The distance between the lights also appeared to close as they moved, but this may have been an artifact of an ever acute viewing angle. The total duration of the sighting was approximately 40 seconds. My initial impression was that these were airplanes, but I think this can be ruled out for a few reasons: 1) There were no blinking navigation lights; 2) There was no engine sound; 3) They seemed moving at an incredible velocity [assuming they were very high in the sky]; 4) The lights faded away on a clear night. If they were airplanes, they should have been visible all the way to the horizon. 5) They were VERY bright, much brighter than typical aircraft lighting. My second thought was that they were satellites reflecting sunlight. The way they appeared to disappear in the night sky was certainly reminiscent of satellites moving into the Earth's shadow. I am not completely satisfied with this explanation either. First, the lights were larger an much brighter than any satellite I have seen before, and I have seen many. Also, I have never seen satellites that appear to move in tandem in a collinear fashion. Finally, I wondered if we had seen the space station and shuttle reflecting the sun's light as they orbited overhead. I just checked the NASA website which reports possible sighting times for both, and it appears that this is very likely what we saw. Both were supposed to pass overhead from NW to ESE last night at approximately the time I thought we saw them."],"trends":["There have been 5 other sightings in Laramie","There were no other sightings in Laramie on or around June 19th 2007"],"Date Submitted":"06/19/2007 09:30 UTC","files":["/var/www/straped/mufon/html2text/7272.html.txt","/var/www/straped/mufon/org/7272.html"],"Region":"Wyoming","Viewing Distance":"Unknown","Object Features":"Undisclosed","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Log Number":"US-06202007-0008","Latitude":"41.312877","Longitude":"-105.588991","Disposition":"Unresolved"}