{"Country":"United States","Case Number":"7273","Sighting Duration":"00:01:02","Date Submitted":"06/19/2007 10:27 UTC","City":"Beaverton","Region":"Oregon","Latitude":"45.491932","files":["/var/www/straped/mufon/html2text/7273.html.txt","/var/www/straped/mufon/more/7273_submitter_file2__SNISSConf.JPG","/var/www/straped/mufon/org/7273.html"],"Viewing Distance":"Unknown","Weather Factors":"None","Longitude":"-122.79471","trends":["There have been 23 other sightings in Beaverton","There was one other sighting in Beaverton on or around June 19th 2007","This sighting has never been favorited.",""],"Disposition":"IFO","Object Features":"None","Object Flight Path":"Straight-line path,Path with directional change","Date of the Event":"06/19/2007 10:27 UTC","divs":["Sighting DetailsSince every night this week, I have been seeing a lot of action in the sky, I went and bought a camcorder. 3 of us went out on my deck at our usual star-gazing time (around 10pm), and not long after we'd been out, here came two bright lights from the NW. We all saw them. It looked like two bright stars, about as bright as Venus traveling together at a sychronized distance apart. Flying in formation, I thought, but do planes fly in formation at 10:30 at night with no other lights or sound and then just disappear? We watched the two bright lights and were all saying..\"What is THAT?\" and luckily this time we had the camcorder and got them on tape. Not sure how good it turned out yet, but we got them! It almost looked like one huge object with lights on ends of it. We weren't sure, but the distance between them stayed very regular until it changed direction (gradually) and looked to be heading South and then just disappeared into the sky and it wasn't that far away. There was no sound, no other lights and it was a clear sky. Definitely not satellites. We stayed and watched for planes to compare the difference and every plane that came by, if it was a large plane or small private aircraft had blinking lights and we could very definitely hear engine noise from all the planes that passed unless they were very far away, but then their lights were a lot smaller and not as bright, but we could still tell they were planes and not what we had just witnessed. Planes stayed in vision forever until they turned into such tiny specs that they vanished from being out of sight range. Okay, this is the 2nd night this week I have seen UFO's in the sense that they are Unidentified Flying Objects. What the heck? I think the camcorder was a good investment. Now, I just gotta figure out how to get it on here."],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=45.491932,+-122.79471(7273)&iwloc=A&hl=en\"> mufon case (7273) map </A>","Object Shape":"Sphere, Star-like","Source":"MUFON","Log Number":"US-06202007-0009","Summary":"2 BRIGHT lights traveling together and disappeared -got it on video."}