{"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.552911,+-105.780777(7275)&iwloc=A&hl=en\"> mufon case (7275) map </A>","Object Flight Path":"Straight-line path","Longitude":"-105.780777","Date Submitted":"06/14/2007 11:00 UTC","trends":["There have been no other sightings in CHARMA","This sighting has never been favorited."],"City":"CHARMA","Weather Factors":"None","Source":"MUFON","Object Shape":"Unknown","Country":"United States","Case Number":"7275","files":["/var/www/straped/mufon/html2text/7275.html.txt","/var/www/straped/mufon/org/7275.html"],"Disposition":"Unknown","Summary":"Around 22:15, I heard a very loud mechanical sound, like an jumbo jet coming in for a landing. I was in an RV and looked out bot was only able to see lights moving low and east.","divs":["sighting detailsmy wife, her family and myself were staying overnight in cumbres pass. my wife's dad read how beautiful and isolated this area was, so we decided to drive the rv up to camp overnight. when we arrived there was only two other campers at this site, no one else was around. earlier that afternoon a truck drove up the rode and turned around and left. i mention that because i heard and got a visual on the truck and you can hear the tires driving on the dirt road, a very regonizable sound. anyway after a few hours of exploring we returned to thr rv for dinner and then bed. we (my family) slept in the back and her parents up front. my daughter wanted to play a game so we did and i remember looking out the window to check the sky. i saw so many stars and the mikly way i could hardly wait to go and check it out. earlier that day i did observe air traffic but at very high altitudes, nothing flying past 35,000 feet. everyone was sleeeping and i was getting ready to go out and that's when i heard a very loud sound, like an jumbo jet flying in for a landing. i live and used to work in the dallas\\fort worth area, so i jnow what planes sound like when flying over or approaching for landing. now the sound was low and mechanical and vibrated the rv when it passed by, i looked out the east window and was only able to see lights passing the tree line. because of the trees i wasn't able to get a very look. i ran out but what ever it was had passed on behind the next ridge. i looked up towards the sky looking for strobes(collision lights) but was unbale to locate. i know it wasn't the wind as there was a little breeze, and i know it wasn't a truck or car as i saw the lights in the sky pass overhead. i was spooked, being way out there in the forest and not having cell coverage and not able to see anything but stars. the next morining we were all awaken by a heliocopter circling the area. not sure what the heliocopter was looking for but it was flying around in the area the lights headed towards."],"Region":"Colorado","Sighting Duration":"Undisclosed","Latitude":"39.552911","Date of the Event":"06/14/2007 11:00 UTC","Viewing Distance":"Unknown","Log Number":"US-06202007-0011","Tags":"City"}