{"map":"<A HREF = \"http://maps.google.com/maps?q=40.015315,+-89.840175(7277)&iwloc=A&hl=en\"> mufon case (7277) map </A>","Longitude":"-89.840175","Object Shape":"Star-like","Date Submitted":"05/25/2007 10:15 UTC","Viewing Distance":"Over One Mile","trends":["There has been one other sighting in Petersburg","There were no other sightings in Petersburg on or around May 25th 2007","This sighting has never been favorited.",""],"Case Number":"7277","Tags":"City","Object Features":"Unknown","Object Flight Path":"Stationary,Straight-line path,Path with directional change,Path then hovering","Log Number":"US-06202007-0013","Region":"Illinois","Source":"MUFON","Weather Factors":"None","Date of the Event":"05/25/2007 10:15 UTC","Sighting Duration":"Undisclosed","divs":["Sighting DetailsIt was a evening in May. Clear sky out in the country and two and three star like objects where moving at a fast speed and doing circle loops and triangler loops in the air. They was all over the place. Then the came to a stopping hault in the sky and lights came on almost like lights of a cars head lights is what it looked like and it lasted three or four seconds and the just turned off and starting moving in a crazy pattern like they was lost. They would fly real fast to the south and then back real fast to the north then east and west. I cannot explain what it was, after this all took place about fifteen minutes after there was three jets like military loud jets flew over like they spotted something on the radar. It was really weird. Last night we say the same three stars again but without the flashing lights. They was coming from the west and just acted like they was playing around in the air again. It wasn't a plane. I am sure of that.Please help me figure out what I saw and my oldest son and husband saw.When all this happened we was sitting in the house and my son came down stairs and said he saw some lights outside his bedroom window, so we went outside and saw nothing at first but then when he saw it again he begged me to come out and look and thats when I saw them.They was like two stars then a third came about.I was stund, scared and freakedout alittle because I couldn't explain what they were. They finally just disappeared after a hour or so."],"Latitude":"40.015315","City":"Petersburg","Country":"United States","Summary":"two star like shapes moving at a fast speed in unstable dirrections and haulting and flashing light.","files":["/var/www/straped/mufon/html2text/7277.html.txt","/var/www/straped/mufon/org/7277.html"],"Disposition":"Unknown"}