{"Region":"Ohio","files":["/var/www/straped/mufon/html2text/7278.html.txt","/var/www/straped/mufon/org/7278.html"],"Country":"United States","Weather Factors":"Unknown","divs":["Sighting DetailsOn the night of May 19, 2007 at approx. 10:45pm I along with my son and my daughter observed an unidentified flying object.(unidentified to us) We had never seen anything like it. We were sitting on our back porch talking when my son says \"what the heck, is that two stars chasing each other\"?That description got my attention and I looked in the direction he was pointing which was tree top high and to the left of our view of the western horizon. My son's description was apt. The lights were some distance apart and they were rising up vertically. We yelled for my daughter to come outside to see because I knew as soon as I saw it that it was definitely not like anything I'd ever seen before. We walked from the porch to our yard to keep watching and it kept moving steadily with no sound at all and the lights were steady and bright. It looked to me to be only about 200 ft or so above us as it passed over although it seemed much farther away when we first spotted it. I am of course only geussing but it seemed to be at least as long as a football field but my son thinks it was much larger. The reason I decided it was two lights that were part of a vehicle of some kind is because as it moved the space between the two lights obliterated the stars from our view and also the two lights although far apart were moving in perfect sync. My son, whose vision is better than my own says that he could make out the shape of a long horizontal daimond with the lights positioned at each corner horizontally. I asked my daughter to run back inside to get the video camera from my bedroom .It was almost directly overhead when she brought the camera outside. While she was frantically trying to get the battery on the camera it continued to move in an easterly direction almost directly overhead . I asked my daughter to give me the camera so I could try to get the battery in place finally. I had to look down to do that but I didn't want take my eyes off of it for a second. I slammed the battery in and looked up to see it's position and it gradually faded away behind some thin misty clouds. I couldn't even tape it's disappearance because I slammed the battery in upside down!! My son said that he could still see it faintly behind the clouds still moving in the same direction and at the same speed but it was gone completely from my sight. I was a little embarrassed but I called the local sherrif's department to report it and also to find out if anyone else had reported anything. I can tell you one thing for sure it was a very exciting experience. My kids and I feel a little differently. They think it was an alien space ship and are a little scared because after all , why would the aliens fly over their house in particular? I am of the opinion that it was more likely some top secret millitary aircraft and it makes me angry that the millitary would try to scare their own citizens by performing an alien spaceship flyby. I hope I didn't leave anything out and sorry for the lack of paragrahs. Please let me know if anyone else reported a similar sighting or if you can explain to us what it actually was that we saw. Thanks in advance if you have any helpful info and also thank you for the opportunity to describe our experience without feeling embarrassed."],"Log Number":"US-06202007-0014","Date Submitted":"05/19/2007 11:45 UTC","Summary":"Two very bright lights not too far apart coming up vertically from the western horizon and travelling at a steady speed then turning horizontally while travelling east almost directly overhead when it gradually faded behind some clouds.","Object Flight Path":"Path with directional change","Longitude":"-82.033752","Source":"MUFON","City":"Pomeroy","Disposition":"IFO","Tags":"City","Date of the Event":"05/19/2007 11:45 UTC","Latitude":"39.027578","map":"<A HREF = \"http://maps.google.com/maps?q=39.027578,+-82.033752(7278)&iwloc=A&hl=en\"> mufon case (7278) map </A>","Viewing Distance":"101-500 Feet","Sighting Duration":"00:05:00","Object Shape":"Diamond, Star-like","trends":["There have been no other sightings in Pomeroy","This sighting has never been favorited."],"Case Number":"7278","Object Features":"Unknown"}