{"Log Number":"CA-06212007-0003","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-79.879865","Latitude":"43.250703","Summary":"Brilliant golden boulder shaped object","Date of the Event":"06/20/2007 07:02 UTC","Object Features":"None","Region":"Ontario","map":"<A HREF = \"http://maps.google.com/maps?q=43.250703,+-79.879865(7283)&iwloc=A&hl=en\"> mufon case (7283) map </A>","Disposition":"Unresolved","City":"Hamilton","trends":["There have been 15 other sightings in Hamilton","There were no other sightings in Hamilton on or around June 20th 2007"],"Case Number":"7283","Weather Factors":"Unknown","Sighting Duration":"00:00:06","Country":"Canada","files":["/var/www/straped/mufon/html2text/7283.html.txt","/var/www/straped/mufon/org/7283.html"],"Object Flight Path":"Straight-line path","Tags":"City","divs":["Sighting DetailsI was sitting on my front porch feeding the birds. A group of seagulls were circling overhead which caused me to look skyward. I observed a golden spherical object traveling WSW to ENE toward Lake Ontario.The sky was cloudless and the sun had started it's descent. The object can be best described as a large boulder and was of a brilliant golden color. The sun may have enhanced the color of the object but it had a clearly defined shape, not a blurry one that would be caused by light reflection. There was no sound or vapor trail. It was traveling much faster than an aircraft or a satellite but slower than a meteorite . It had a definite shape and was only observed for a matter of 5 to 6 seconds. It's speed was such that it disappeared from view in the sky well before it reached the horizon. It is impossible for me to estimate it's altitude but it appeared to be less than that of an overflying aircraft. This location is approx. 3 nautical miles from John C. Munroe International Airport and there is a fair amount of traffic at times.It was not traveling in the direction of the airport and would have been at an altitude that would have prevented it from making a landing approach either here or at Pearson International in Toronto. This is the first time in my 61 years that I have observed an object that I clearly cannot identify and, as a result, was quite excited about."],"Object Shape":"Sphere","Date Submitted":"06/20/2007 07:02 UTC","Source":"MUFON"}