{"Longitude":"-63.572912","Country":"Canada","City":"Halifax","map":"<A HREF = \"http://maps.google.com/maps?q=44.652521,+-63.572912(7284)&iwloc=A&hl=en\"> mufon case (7284) map </A>","Source":"MUFON","Region":"Nova Scotia","Object Features":"Unknown","Summary":"Two star-like objects moved from west-northwesterly direction to south southeasterly direction.","Case Number":"7284","files":["/var/www/straped/mufon/html2text/7284.html.txt","/var/www/straped/mufon/org/7284.html"],"Viewing Distance":"501 Feet - 1 Mile, Unknown","Object Flight Path":"Straight-line path","Tags":"City","trends":["There have been 22 other sightings in Halifax","There was one other sighting in Halifax on or around June 19th 2007"],"Log Number":"CA-06212007-0004","Sighting Duration":"Undisclosed","Weather Factors":"None","divs":["Sighting DetailsIt was approximately 10:00 PM on the night of June 19th, 2007, my wife and I were putting the recycleables out to the side of the road when I made a comment about Venus. I said to her jokingly, \"there's the mothership\", and we stopped what we were doing and watched the sky. Since my last experience in January, I always scan the sky in the evening when I'm out of doors. I noticed a few planes high overhead with flashing lights as usual and there were a few coming in to our airport as usual with their headlights on. I also noticed a commercial craft in the western sky bound for Europe I suppose. This plane was high, maybe 35,000 feet or so with it's lights flashing. The International airport is approximately twenty miles away in a north easterly direction and CFB Shearwater is most likely the same distance from us but in a south easterly direction. I became aware of a bright light in the west just above the tree line as though a plane was coming in to land at the airport, (this is a common occurance out here in Hammonds Plains to see a single bright light in the sky turn into two landing lights),and a short distance behind it I noticed a reddish point. I watched to see if the forward light would become two headlights as is usual for a plane coming in to land but the light remained singular as the light grew in brightness and the one following behind it quickly gave up it's reddish tint and grew bright and starlike also. These lights were almost as large and bright as the planet sitting in the western sky. My wife and I watched for some minutes as the two starlike objects moved across the sky maintaining the same speed and direction (WNW to SSE) and altitude until they passed beyond the treeline in the south southeast. There were no engine sounds or flashing lights associated with these objects. They were still very bright as the approached the southeastern sky. My first thought was that they might be military aircraft going to CFB Shearwater or overseas. I've seen military craft escorting other craft before in the daytime sky, maintaining the same distance from one another. My wife and I were puzzeled to say the least and were hopeful someone else would have seen this and that it could be explained. We were a little excited but not fearful in the least. If anyone can explain this \"happening\" please do."],"Latitude":"44.652521","Date of the Event":"06/19/2007 10:00 UTC","Date Submitted":"06/19/2007 10:00 UTC","Object Shape":"Star-like","Disposition":"Unresolved"}