{"Object Features":"Undisclosed","Country":"United States","City":"Undisclosed","files":["/var/www/straped/mufon/html2text/7285.html.txt","/var/www/straped/mufon/org/7285.html"],"Object Shape":"Star-like","Viewing Distance":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=44.321674,+-85.595764(7285)&iwloc=A&hl=en\"> mufon case (7285) map </A>","Disposition":"Unknown","Date of the Event":"06/19/2007 10:30 UTC","divs":["Sighting DetailsI was in the basement of my house trying to find my second garage door opener for my dad, who was working on his car. My mother was outside, sitting on a chair in the driveway. When I came outside, I see my neighbor at the fence with her boyfriend. She's telling me to look up at the sky, because there were some lights she didn't recognize as a plane. I look up and see two lights that look like stars about two inches apart moving in the sky. I turned to tell my mother to look up at it, when I looked back the lights where there for just a split second before they disappeared. It seemed like one light went out before the other, but it's hard to say. My neighbor and her boyfriend said they had been watching the lights for a while before coming over to the fence to look for me. Her boyfriend said that at one point he could see stars between the two lights, like seeing through something. I think that meant he figured each light was independant of the other. I think they were part of the same structure, personally. I only saw the lights move slightly in the sky by the time I looked up, and it appeared in unison, suggesting a craft of some sort. I first thought the two lights were stars when I looked up, but stars don't move or disappear, obviously. My father was in the garage the whole time, but there were four witnesses altogether. Me, my mother, my neighbor and her boyfriend. We all saw it. We have an airport not too far away from Dearborn in Romulus, that frequently attracts a lot of air traffic over our area. But this had no FAA red lights on it and made no noise. We are savvy enough to know what are planes, and what aren't. The whole experience for me lasted probably 10 seconds. For my neigbors it lasted longer, more like a couple minutes."],"Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","trends":[],"Latitude":"44.321674","Longitude":"-85.595764","Case Number":"7285","Date Submitted":"06/19/2007 10:30 UTC","Summary":"Two lights in the sky, star-like in their appearance moved across the sky and then disappeared. Multiple witnesses.","Region":"Michigan","Log Number":"US-06212007-0005","Source":"MUFON"}