{"Weather Factors":"Unknown","Log Number":"US-06212007-0007","Sighting Duration":"Undisclosed","Tags":"City","trends":["There has been one other sighting in Marine Corps Base Camp Pendleton","There were no other sightings in Marine Corps Base Camp Pendleton on or around June 21st 2007"],"Date of the Event":"06/21/2007 11:20 UTC","Latitude":"33.313998","Object Flight Path":"Undisclosed","Object Shape":"Cigar, Disc","City":"Marine Corps Base Camp Pendleton","Summary":"Shiny Object in the Sky","map":"<A HREF = \"http://maps.google.com/maps?q=33.313998,+-117.314552(7287)&iwloc=A&hl=en\"> mufon case (7287) map </A>","files":["/var/www/straped/mufon/html2text/7287.html.txt","/var/www/straped/mufon/org/7287.html"],"Disposition":"Unresolved","Region":"California","Case Number":"7287","divs":["Sighting DetailsI was driving back to work aboard Camp Pendleton, coming back from my lunch break. When I noticed something shiny up in the sky. Before I went to lunch I saw that there was a retirement ceremony across the street. It was filled with cars and people. When I came back everything was done. There was hardly anyone in the field and most of the cars in the parking lot were gone. Anyway, so I glanced up and saw this shiny object in the sky. It was kind of long, horizontally. Because I was driving I couldn't really see if it was moving or not...and I couldn't really keep staring at it because I didn't want to run into another car. When I finally pulled into my work parking lot I looked up into the sky and didn't see anything, just blue sky. I mentioned it to one of my co-workers and she said it was probably a balloon. I'm not really sure what it was...there's a possibility it was a balloon, because of the ceremony a few minutes before, but it could have also been an UFO. Not sure, but it was interesting. Hope I get to see more in the near future!!"],"Object Features":"Undisclosed","Viewing Distance":"Unknown","Longitude":"-117.314552","Source":"MUFON","Country":"United States","Date Submitted":"06/21/2007 11:20 UTC"}