{"map":"<A HREF = \"http://maps.google.com/maps?q=38.401803,+-85.430107(7290)&iwloc=A&hl=en\"> mufon case (7290) map </A>","Region":"Indiana","Latitude":"38.401803","Date of the Event":"Unknown","Disposition":"Unknown","Summary":"ufo?","Longitude":"-85.430107","Source":"MUFON","Object Flight Path":"Undisclosed","Log Number":"US-06222007-0001","files":["/var/www/straped/mufon/html2text/7290.html.txt","/var/www/straped/mufon/org/7290.html"],"Object Shape":"Undisclosed","Weather Factors":"Unknown","trends":["There have been 3 other sightings in Louisville","There were no other sightings in Louisville on or around"],"City":"Louisville","Tags":"City","Viewing Distance":"Unknown","Date Submitted":"06/22/2007 09:50 UTC","Country":"United States","Object Features":"Undisclosed","divs":["Sighting Details Sometime in the month of May, while me and my family were sleeping about 1:45am, the doorbell rang. Curious as to who would be at our door at that hour, I made my way towards the front door. On the way I noticed that the clock on the stove was flashing. Thats when I realized our electric had went out. Anytime our electric goes out and comes back on the doorbell always rings. About the same time I noticed the stove clock flashing, I also noticed this flashing white light coming through the kitchen window. This window sits directly across the room from the stove. The blind was closed and the flashing white light still came through and was flashing on the wall around the stove. After noticing this I made my way outside,through the side door,onto the porch. I was really in awe about how bright this white flashing light seemed. I think it was the brightest white light I've ever seen. Not really looking at it too long, because I just assumed it was a utility truck up on the hill fixing the electric someplace. I made my way back into the house to check on my family and went back to bed. [Keep in mind that I never even thought about looking for a ufo. I had just woke up, and thought I might have an intruder at my house, or a utility truck.] The next day while at work I kept thinking about how bright the light had been. So after dark I went back onto the same side porch to distinguish where the light was. It was then I realized the light could not have been up on the hill. It was either half way down the hill where there are not hardly any houses,or it was in the air. This light was a very bright white flashing light about a quarter of a mile away or less. It also made no noise. After some discussion with neighbors I found out the electric had went out over a several mile area that night. The next night the electric went out again, but I did not see any light. We have lived in our house over ten years and we have never had the electric go out 2 nights in a row. If I had stayed on the porch for just a minute longer I could have seen how the light had stopped or left the area."],"Case Number":"7290","Sighting Duration":"Undisclosed"}