{"Case Number":"7294","Country":"United States","Region":"Iowa","Summary":"I was sitting in my rocking chair on my front porch one summer night when a fireball type object appeared in the northern sky. The fireball was large and appeared to be focusing on my farm. After a few minutes the fireball released beams of light.","divs":["Sighting DetailsI was sitting on my porch about 10PM one summer night a couple of years ago. I had been sitting out there with my wife Kimmie for a couple of hours when a ball of light appeared far away in the northern sky. At first I thought the light was a shooting star but it continued to draw closer and closer until it was hovering what seemed to be a few miles to the north of my house. It continued to hover for what seemed to be forever, seemingly watching and waiting for us to make a move. The fireball was very bright and flashed colors of orange, yellow, and blue from its fiery depths. We were scared at first sighting but a calmness came over us and we were fascinated by the unidentified flying object. When the object disappeared into the starry night, we were in disbelief at what had just happened. We now know we are not alone. We know deep in our hearts that there are other lifeforms out there just watching and waiting to make their move on us."],"Sighting Duration":"Undisclosed","Longitude":"-93.918842","map":"<A HREF = \"http://maps.google.com/maps?q=43.483844,+-93.918842(7294)&iwloc=A&hl=en\"> mufon case (7294) map </A>","Object Features":"Undisclosed","Weather Factors":"Unknown","City":"Rake","Viewing Distance":"Unknown","trends":["There have been no other sightings in Rake","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/7294.html.txt","/var/www/straped/mufon/org/7294.html"],"Object Shape":"Fireball","Tags":"City","Date Submitted":"07/10/2005 10:00 UTC","Object Flight Path":"Undisclosed","Latitude":"43.483844","Disposition":"Hoax","Log Number":"US-06232007-0003","Source":"MUFON","Date of the Event":"07/10/2005 10:00 UTC"}