{"Disposition":"Unknown","trends":["there have been no other sightings in clarklake\\jackson","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/7295.html.txt","/var/www/straped/mufon/more/7295_submitter_file1__DSC00173.JPG","/var/www/straped/mufon/more/7295_submitter_file2__cigar_close.jpg","/var/www/straped/mufon/more/7295_submitter_file3__DSC00099.JPG","/var/www/straped/mufon/org/7295.html"],"Object Flight Path":"Straight-line path","Log Number":"US-06232007-0004","Viewing Distance":"501 Feet - 1 Mile, Unknown","Weather Factors":"None","Object Features":"None","Summary":"Repeatedly heard military helicopters and later photographed fast moving disc and cigar","divs":["Sighting DetailsAt approx. 7:55pm on Thursday, June 21st, I began to hear loud, military-sounding helicopters flying back and forth above my home. This occurred three times within ten minutes. I never did get up to look for them as I'm quite used to hearing helicopters flying between Jackson and the Michigan International Speedway in Brooklyn (I live between those two points, just beyond the nw edge of Clark Lake). Finally, after the third time I grabbed my Sony DSC-H5 Cybershot (7+ Megapixel digital SLR). Nothing occurred between 8:10 and 8:30pm. I went outdoors and set my camera on a flimsy tripod to photograph the moon. I snapped a few when I became acutely aware of a presence. I began to snap pix into the sky with the camera with manual settings. I zoomed optically approx. 5x and had a 2x telephoto lens attached. The zoom was not adjusted during the dozens of photographs I took into the sky...the FStop and 'shutter' speed were adjusted manually to shoot into the early evening blue sky. The image with the blurry spot was taken first...I visually saw a black object flying west to east and caught one photograph of it before it disappeared behind the numerous trees on my property. It moved very quickly and its general swaying from side to side while travelling made me think of a balloon blowing in the wind. This was way too fast for that... The image with the cigar shaped object was one of many taken in quick succession (generally one to five seconds apart) but the only one with this object. I also photographed a commercial jet with the same zoom setting if you would like for me to send that one as a comparison. I did not visually see the cigar shaped object."],"Longitude":"-84.345","Date of the Event":"06/21/2007 08:35 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.121389,+-84.345(7295)&iwloc=A&hl=en\"> mufon case (7295) map </A>","Case Number":"7295","Source":"MUFON","Tags":"City","City":"Clarklake/Jackson","Object Shape":"Cigar, Disc","Latitude":"42.121389","Country":"United States","Sighting Duration":"00:45:00","Date Submitted":"06/21/2007 08:35 UTC","Region":"Michigan"}