{"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Tags":"City","Weather Factors":"Unknown","divs":["Sighting DetailsMy partner & I were just falling off to sleep. In answer to the question: \"what made you first notice it?\", this is the odd part...I was turning over to go to sleep, but for some reason, I turned and looked out the window, instead, without thinking about doing so. My gaze was directly at an orange ball of light moving across the tree tops, coming towards us (and the highway). I said to my partner: \"Hey, look at that, do you see that?\" He was half asleep, and a little irritated, but I don't know if he really did look, as I was fixed on the 'object' although I hesitate to call it that, as it did not have any 'physical' appearance. His reply to me was: \"yah, it's probably the moom.\" He went back to sleep. 'It' suddenly stopped dead and hung in mid-air. When that happenned, I said again to him: \"Hey, it stopped!\" There was no reply from him, but as soon as I got the words out, it started to float upwards--straight up, but moving slow, like a balloon would, until it was out of sight. The appearance was of a round, orange light. I thought the object was: an orange ball of light, which was what it appeared to be, but then I started to think that maybe it was a satellite (although it was WAY bigger)or something else? My 1st reaction was to share the sighting, I was just a little uneasy. My 2nd reaction was: 'this is different from the MANY others I've seen' I was curious, and astounded, and bewildered all at the same time. Also a little frustrated, because I don't know WHAT these lights are. I've seen over 10 in the last 17 yrs--all different. It also made me feel a little 'eerie', as it moved as soon as I spoke...like I had the sense 'it' heard me. That's when I thought it might be a 'listening device' or something, being tested by who-knows-who, in this isolated, rural area. But that doesn't really 'fit', as it was not a solid object...just a globe of light. Because it was orange, it reminded me of two other sightings...an orange aura of light seemingly coming from the ground in the woods behind the house, and two foot-ball shaped lights, flying in tandam (like they were 'linked' invisibly overhead for 10 mins."],"Object Shape":"Other","Date Submitted":"06/19/2007 12:00 UTC","trends":["There have been 22 other sightings in Halifax","There was one other sighting in Halifax on or around June 19th 2007"],"Source":"MUFON","Country":"Canada","Date of the Event":"06/19/2007 12:00 UTC","Sighting Duration":"00:01:00","files":["/var/www/straped/mufon/html2text/7296.html.txt","/var/www/straped/mufon/org/7296.html"],"Object Features":"None","Latitude":"44.650871","City":"Halifax","Viewing Distance":"Unknown","Region":"Nova Scotia","Case Number":"7296","Longitude":"-63.570512","Log Number":"CA-06232007-0005","Disposition":"Unresolved","Summary":"A ball of orange light, but with no 'fireball' appearance, about 100X the size of a distant star.","map":"<A HREF = \"http://maps.google.com/maps?q=44.650871,+-63.570512(7296)&iwloc=A&hl=en\"> mufon case (7296) map </A>"}