{"Weather Factors":"Unknown","divs":["Sighting DetailsI was walking around the track at the local middle school. I looked over because there was someone firing a hand gun in the woods. I noticed the jet streams in the air. One jet had already passed. I looked at the jet that was passing. Directly underneath the jet (about an inch below looking at it) was a dark circle, aligned with the jet, flying the same speed as the jet & not leaving a jet stream. I stopped walking. I could not believe what I was seeing. I've seen things before but only for split moments. This was continuos and very clear. I stood and watched it for about 20-30 seconds. I then began to jog across the field to call my buddy. as I was jogging across the field the dark circle flew far out in front and above the plane, leaving no jet stream. It then suddenly became a silver cigar shaped object only for a second. It returned to the dark sphere shape and flew back behind and lower than the plane. once again it turned this silver cigar shape for a second and then back to the circle shape. I reached into my car, pulled out my cellphone & called my friend. When I looked up again it was gone. I continued to watch the jet until it was no longer in sight. 2 more jets passed within the next 20 minutes, but with no objects following them."],"Latitude":"35.487361","Date Submitted":"06/23/2007 08:15 UTC","Region":"North Carolina","Object Shape":"Cigar, Sphere","Case Number":"7299","Disposition":"Unknown","Sighting Duration":"Undisclosed","Log Number":"US-06232007-0008","Date of the Event":"06/23/2007 08:15 UTC","Country":"United States","trends":["There have been 3 other sightings in Kannapolis","There were no other sightings in Kannapolis on or around June 23rd 2007"],"Tags":"City","files":["/var/www/straped/mufon/html2text/7299.html.txt","/var/www/straped/mufon/org/7299.html"],"Object Flight Path":"Path with directional change","Viewing Distance":"Unknown","Longitude":"-80.621734","map":"<A HREF = \"http://maps.google.com/maps?q=35.487361,+-80.621734(7299)&iwloc=A&hl=en\"> mufon case (7299) map </A>","City":"Kannapolis","Object Features":"Undisclosed","Source":"MUFON","Summary":"UFO flying near a jet in Kannapolis"}