{"Case Number":"7300","Summary":"Hello again....this is Dr.Ibrahim again sendeng this short report from Cairo.Egypt....-As soon as I just finished updating my web site:www.ufo-egyptian-hunter.org-and added the fresh UFO footages in our area-And still having around ten cases not been yet","Disposition":"Unresolved","Source":"MUFON","Country":"Egypt","Viewing Distance":"Over 1 Mile, Unknown","trends":["There have been 45 other sightings in Cairo","There were 2 other sightings in Cairo on or around June 20th 2007","This sighting has never been favorited.",""],"Longitude":"31.238335","Object Flight Path":"Straight-line path","Region":"Al Qahirah","Tags":"City","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/7300.html.txt","/var/www/straped/mufon/more/7300_submitter_file1__Image073.jpg","/var/www/straped/mufon/more/7300_submitter_file2__Image066.jpg","/var/www/straped/mufon/more/7300_submitter_file3__Image062.jpg","/var/www/straped/mufon/org/7300.html"],"Sighting Duration":"Undisclosed","Date Submitted":"06/20/2007 11:14 UTC","Date of the Event":"06/20/2007 11:14 UTC","divs":["sighting detailsthis is the third report regarding the third ufo from the egyptian pharaohnic fleet of three flying saucers following each others but different for the final destinations as each one was heading for specific different pyramid.this one was started to appear by optical vision and then recorded on the same panasonic video camera on the same tape which was recorded the past two ufos.also from the same sighting and shooting position ,building roof. total recording time here was one complete hour ,started to record at 23.14 pm ,finish recording at 0.18.18 am june 20\\21 2007. total recordin time for the three ufos one tape 01 hour and 30 minutes. many airplanes were noticed and recorded also on the tape ,one exactelly when starting recording,second after 4 minutes ,third after 6 minutes from the last.but all were in lower altitude than the object.on the contracet of the first object the plane was at higher altitude than the ufo ??..on signle affect and every thing was normal regarding air traffic. this one was also in stable orbit but going lower and lower altitude when was heading towards dahshour incomplete pyramid. distance from the shooting location to cairo international airport around 35 km and to the pyramids area around 10-15 km. all this ufo footage will add with film evidence soon on my web site :- www.ufo-egyptian-hunter.org as last updating was june 1st and still holding many cases to be added. thank you dr.ibrahim ufo researcher\\investigator independent ufologist tha"],"City":"Cairo","Object Shape":"Cone, Circle, Disc, Star-like, Other, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.04664,+31.238335(7300)&iwloc=A&hl=en\"> mufon case (7300) map </A>","Object Features":"Unknown","Log Number":"EG-06232007-0009","Latitude":"30.04664"}