{"Date Submitted":"06/23/2007 09:45 UTC","Object Flight Path":"Path with directional change","Latitude":"38.982228","Log Number":"US-06232007-0010","Source":"MUFON","divs":["Sighting DetailsAt approximately 9:30 pm, I went out into my backyard like I always do with my binoculars to look at the cosmos. I had been out there for about 15 min. when all of a sudden, I happened upon these 4 star-like, spherical objects, probably at an altitude of about 100,000 ft., more or less, moving in erratic patterns, and at unbelievable speeds! When I first spotted the objects, they were grouped together, so perfectly that it's almost safe to say that the objects made a complete 360 degree square. All of a sudden, the objects just shot down, then to the left, and then up again. I stopped looking at the objects, thinking that it was just probably nothing, but I became curious, and happened to look up once more. And with luck, there were the objects, making the same maneuvers that they had the first time. I started to think, \"Wow! I think I'm really seeing an UFO phenomenon!\" So I put down my binoculars to put my glasses back on, looked up again, and the objects were gone! After the event, I ran inside and got online to report the UFO's. What really got me to notice the objects in the first place was the unbelievable speeds at which they moved. When I first saw the objects I thought that they were just a simple star cluster, but apparently I was wrong."],"Weather Factors":"None","Viewing Distance":"Unknown","Tags":"City","Longitude":"-94.670792","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.982228,+-94.670792(7301)&iwloc=A&hl=en\"> mufon case (7301) map </A>","Sighting Duration":"00:01:05","Date of the Event":"06/23/2007 09:45 UTC","Object Shape":"Sphere, Star-like, Unknown","Case Number":"7301","Country":"United States","City":"Overland Park","Region":"Kansas","Summary":"As I looked up into the southern hemisphere with my binoculars, I noticed 4 star-like, spherical objects moving in erratical patterns at unbelievable speeds.","trends":["There have been 34 other sightings in Overland Park","There were no other sightings in Overland Park on or around June 23rd 2007"],"files":["/var/www/straped/mufon/html2text/7301.html.txt","/var/www/straped/mufon/org/7301.html"],"Object Features":"Unknown"}