{"Object Flight Path":"Straight-line path","Case Number":"7307","Disposition":"IFO","Latitude":"39.091267","trends":["There have been 7 other sightings in Rockville","There were no other sightings in Rockville on or around January 16th 2007"],"Country":"United States","Date of the Event":"01/16/2007 12:00 UTC","Longitude":"-77.146518","Log Number":"US-06242007-0006","map":"<A HREF = \"http://maps.google.com/maps?q=39.091267,+-77.146518(7307)&iwloc=A&hl=en\"> mufon case (7307) map </A>","City":"Rockville","Summary":"circular metallic object","files":["/var/www/straped/mufon/html2text/7307.html.txt","/var/www/straped/mufon/org/7307.html"],"Sighting Duration":"00:01:25","Object Features":"None","Date Submitted":"01/16/2007 12:00 UTC","Source":"MUFON","Object Shape":"Circle","Weather Factors":"Unknown","Tags":"City","divs":["Sighting DetailsAt 11:00 a.m. on the south side of my office building (smoking a cigarette looking at the sky in all directions I could see because I always get to see something unusual and I watch the skies when I can. I noticed the reflection and the object almost immediately upon looking up. At first I thought it was a helium baloon but there was no string and it was not floating upwards and fliting about as if it were caught by the wind. The object moved against the wind) I watched a circular shaped object fly horizontally from the southwest towards the northeast in a tumbling motion. It tumbled end over end and would stabilize and to tumble again, then stabilize again. This movement continued until out of my view. I watched it as it flew over our parking garage at the height of the 5th floor. It was circular but domed on the bottom and the top. On one side it was reflective silver and on the other side it was reflective deep red. About twice the size of a basketball touching its sides. It kept moving until I lost sight of it. It flew across the metro rail tracks. As I viewed the object I tried to stay as still as possible and clear my mind and focus. I was afraid if I had bad thoughts about it it might come nearer to me and that's not what I wanted, I was afraid. I thought Oh my god it's really there. I went back into my office building and wrote down what I had just seen. I shared it with my daughter and my son."],"Viewing Distance":"101-500 Feet","Region":"Maryland"}