{"Disposition":"Insufficient Data","Object Flight Path":"Path with directional change","Object Features":"Unknown","Latitude":"41.515766","City":"Toledo, Ohio","Date Submitted":"06/24/2007 02:00 UTC","Log Number":"US-06242007-0007","divs":["sighting detailsat 2:00 am my boyfriend was dropping off a friend when he saw a large glowing green object in the sky. at first, he thought it was a new billboard advertisment because it was so bright and low in the atmosphere. when he got closer to it, he realized it wasn't a sign because it was flying. he followed it until he was as close as a half mile away from it. other people were driving down the road and my boyfriend reported noticing others pointing and looking out their car windows.he left it to come home to wake me up as a witness and to get a camera. at 2:45 we started driving toward toledo. it was so low in the sky that trees and buildings blocked our view. we finally got out to the country with no obstructions and i got my first look at it. it was by that time at least 15 miles away from us over the skyline of toledo. it was huge and glowing a pale green. it seemed to be spinning (slowly) becuase at times it looked like a disc (sideview)and at times it looked narrow light (front\\back view). there is no way this object could be mistaken for a plane, star, satellitte, etc. it was too low in the sky and too massive and glowing green! the only possible explanation we could think of to explain it away was that it was a blimp because of its size and position in the atmosphere. online, we looked up commercial blimps to see if any of them glowed green in the sky. we didn't find anything that looked like what we saw. also, why would a blimp be flying that late at night and why did it appear to spin? my understanding is that blimps don't move like that. this object was so large and noticeable, that others around the monroe and toledo area would have had to seen it. i'm searching for reports in the local news, but haven't found any reports. i began to feel scared as we were watching this thing. it was clearly moving too far away from our ability to catch up with it. my boyfriend tried to take a picture, only to find when we rushed to get the camera, there was no disc inside. (we have an old-school digital camera that holds images on discs). we drove back home quite shaken!"],"files":["/var/www/straped/mufon/html2text/7308.html.txt","/var/www/straped/mufon/org/7308.html"],"Summary":"Low flying huge glowing green object flew over Monroe Michigan towards Toledo Ohio","Weather Factors":"None","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Tags":"City","Longitude":"-83.669423","Source":"MUFON","Sighting Duration":"02:19:00","Object Shape":"Blimp, Cigar, Disc","trends":["There have been 3 other sightings in Toledo, Ohio","There were no other sightings in Toledo, Ohio on or around June 24th 2007"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.515766,+-83.669423(7308)&iwloc=A&hl=en\"> mufon case (7308) map </A>","Country":"United States","Case Number":"7308","Region":"Michigan","Date of the Event":"06/24/2007 02:00 UTC"}