{"Object Shape":"Egg, Other","Tags":"City","Latitude":"42.76461","files":["/var/www/straped/mufon/html2text/7310.html.txt","/var/www/straped/mufon/more/7310_submitter_file1__UFOMap.jpg","/var/www/straped/mufon/more/7310_submitter_file2__P6190018.JPG","/var/www/straped/mufon/org/7310.html"],"City":"Douglas","Log Number":"US-06242007-0009","Sighting Duration":"00:30:00","Weather Factors":"Unknown","Summary":"2 Bright orange barrel shaped lights hover just over horizon, descend and disappear then reappear.","map":"<A HREF = \"http://maps.google.com/maps?q=42.76461,+-105.376107(7310)&iwloc=A&hl=en\"> mufon case (7310) map </A>","Case Number":"7310","divs":["Sighting DetailsApproximately 12:30 AM, on a warm, clear June 24 night, I turned off the TV and stepped out onto the deck to gaze at the half moon and stars. The moon was fairly bright & somewhat low over the southwest horizon. It lit up the mountains to the south. The northern and eastern sky was much darker than the sky to the south and west. Many stars were easily observable to the east & north. In the Eastern sky, two bright orange-yellow lights appeared about 30 degrees over the horizon. I viewed them with binoculars and managed to get a photo of one of the lights. These lights hovered for approximately 10 minutes before slowly descending below the horizon. They were barrel shaped, bright orange, with a lava like red belt running across their middle. They emitted an orange glow. They appeared to move independent of each other. After they disappeared over the horizon, I could still see their glow, leading me to believe that they weren't that far away, 5 to 10 miles maybe was my guess. I waited about ten minutes longer hoping to see them again. Then, the lights slowly rose above the horizon again and hovered for about another ten minutes before they descended below the horizon again. I stayed up about another half hour but the lights did not reappear. This event took place out in the east central Wyoming countryside, 8 miles from town, in an area that is remote and sparsely populated. Since this is where I live, I am familiar with the terrain and whether seeing lights in this area would be a common occurrence or not. It is NOT a common occurrence to see ANY lights where these ones were observed. Since I viewed similar lights in this location several years ago at about the same time of year, I was not all that surprised to see them again. I've never seen anything like them and can offer no explanation as to what they were. Could this be an astral phenomenon?"],"Region":"Wyoming","Object Features":"Other","Object Flight Path":"Hovering then path,Path then hovering","Date of the Event":"06/24/2007 12:30 UTC","Source":"MUFON","Country":"United States","trends":["There have been 2 other sightings in Douglas","There were no other sightings in Douglas on or around June 24th 2007","This sighting has never been favorited.",""],"Viewing Distance":"Over 1 Mile, Unknown","Longitude":"-105.376107","Disposition":"Unresolved","Date Submitted":"06/24/2007 12:30 UTC"}