{"City":"Undisclosed","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Country":"United States","Latitude":"36.786661","Object Features":"Unknown","Region":"California","Summary":"star like object moving across sky, from west north west ,to east south east at what appered to be a high altitude,it made several changes of direction before dropping down on the horizon","map":"<A HREF = \"http://maps.google.com/maps?q=36.786661,+-119.415612(7312)&iwloc=A&hl=en\"> mufon case (7312) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/7312.html.txt","/var/www/straped/mufon/org/7312.html"],"Viewing Distance":"Unknown","Longitude":"-119.415612","Log Number":"US-06252007-0002","Object Shape":"Star-like","Case Number":"7312","Date of the Event":"06/23/2007 08:30 UTC","Date Submitted":"06/23/2007 08:30 UTC","Source":"MUFON","trends":[],"divs":["Sighting Detailsit was about 8.15 pm june 23 and i was sitting watching tv in my living room when my son came running to the front door saying dad hurry you have got to see this. i jumped up ran outside and he pointed to a star like figure in the sky. to my astonishment it was moving at what i would seem to think was a very high rate of speed being that it appeared to be at a high altitude, it also was making several directional changes which led me to belive it was of intelligent orgin.it also seemed to me to be pulsating or flickering like a sparkler slightly . this object appeared to be about the size of an eraser head on a pencil at arms length, it looked very similar to the star or planet in the sky at the same time that evening that was located in th south east sky from where i was standing,the time it took for this object to cross the sky to the eastern horizion from directly above when i first saw it was probably less than one minute and thirty seconds.the most interesting thing about this sighting was not the actual object to me but was that as we stood in my front yard and watched this object fly over head and pointed and commented about it several people walked by or jogged and never onnce looked up see what we were talking about ,see i just figure that it is some kind of new goverment technology but later thinking about it ,it just seemed strange how many times do things like this take place just above our heads an we dont even take the time to look up and notice it. also later thinking about it it went down right around seqouia national park where i had heard there had been recent sightings. My son saw the following prior to me going outside: I was lying on the grass in my front yard looking up at the moon when I heard a fire alarm blare a few blocks over. I glanced across the schoolyard that is adjacent to our house and then looked back up. The sun was just beginning to set and their were few stars out save the bright ones in the west. That was when I noticed that one of them was traveling at an unusual rate of speed. It was too fast to be a plane and there were no colored or flashing lights. It was out of place because it was so bright. There was no com trail or distinguishing features that would have led me to believe it was anything ordinary. As it got directly overhead, I noticed it began to drift rapidly from side to side. Not like a turn but more like a skiier drifting side to side. I was astonished at how it managed to maintain it's forward speed even while drifting. I'm not one to believe in aliens or anything of the sort but it was highly unusual. I then thought to tell somebody and quickly got my father. Everything I saw was listed above in my father's statement. The most interesting thing for me was that I had not noticed it sooner. It almost seemed to come from nowhere in the quick glance I had made. Thank you for your time."],"Sighting Duration":"00:02:30","Disposition":"Insufficient Data"}