{"Object Shape":"Disc","Viewing Distance":"Unknown","Latitude":"37.326511","Date Submitted":"06/23/2007 12:00 UTC","Object Features":"Undisclosed","divs":["Sighting DetailsI wanted to get more photos from different vantage points other than where I had been getting photo's for two weeks. I got in the van and travelled to the next town. All along the way I randomly snapped pictures. Upon arriving home I uploaded them to my computer and found almost one or more in every picture. I am not crazy and I can distinguish between a bird, a bug, and an airplane. In our area (really rural) we don't have many planes except for two military fighter planes that do maneuvers over our valley at varying intervals and occasionally a medivac hospital helicopter. I have caught everything from orbs, disks, rocket shaped, cloaked disks, and tube shaped ufo's over a 3 week period of time. It is strange though that after I posted on here last week and uploaded some videos and slide shows to you tube a white car (which I've never seen before ) with gov. tags that read DD or DOD-??? has driven by my house a few times. I am a father of five children and my wife and I work from home. I am pretty open minded but also analytical and logical about things. If it weren't for so many frequent incidents that seem too coinccidental I wouldn't be posting here. My wife thought I was going crazy at first until I showed her all of the sightings on file and she saw what I saw in them."],"Sighting Duration":"Undisclosed","Source":"MUFON","Object Flight Path":"Undisclosed","trends":["There have been 8 other sightings in Pearisburg","There were no other sightings in Pearisburg on or around June 23rd 2007","This sighting has never been favorited.",""],"Date of the Event":"06/23/2007 12:00 UTC","Case Number":"7313","Log Number":"US-06252007-0003","Tags":"City","Weather Factors":"Unknown","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/7313.html.txt","/var/www/straped/mufon/more/7313_submitter_file1__ufooutwindowofvan.JPG","/var/www/straped/mufon/more/7313_submitter_file2__ufocompilation3008.JPG","/var/www/straped/mufon/more/7313_submitter_file3__june23011.JPG","/var/www/straped/mufon/org/7313.html"],"Summary":"Snapping photos of sky from van while driving","Longitude":"-80.735071","Region":"Virginia","City":"Pearisburg","map":"<A HREF = \"http://maps.google.com/maps?q=37.326511,+-80.735071(7313)&iwloc=A&hl=en\"> mufon case (7313) map </A>","Country":"United States"}