{"City":"Calgary","Sighting Duration":"00:00:45","Object Shape":"Cylinder","Disposition":"Unresolved","Object Features":"None","Date Submitted":"09/20/2006 02:00 UTC","Object Flight Path":"Hovering then path,Path with directional change","Region":"Alberta","Latitude":"51.04996","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=51.04996,+-114.050382(7315)&iwloc=A&hl=en\"> mufon case (7315) map </A>","Log Number":"CA-06252007-0005","files":["/var/www/straped/mufon/html2text/7315.html.txt","/var/www/straped/mufon/org/7315.html"],"trends":["There have been 76 other sightings in Calgary","There were no other sightings in Calgary on or around September 20th 2006"],"Summary":"Mirror-metallic object hovered over outlying forest","divs":["Sighting DetailsI was driving home from university on a sunny weekday afternoon, turning off the boulevard onto my street when a glint of light caught my eye. Looking into the sky I saw an object and was immediately stricken with the fact that I could not identify what it was. Judging by its distance from me, it would likely have been 5-10 metres tall. It was cylindrical and tapered in shape, with a flat top and bottom, although the diameter was smaller at the top. It had a brilliant mirror shine to it which is what made it so striking. There are no aircraft in my area made with that kind of material, and few that fly in from or around that area (the far South West of the city.) It hovered directly south of me as I entered the intersection, and I jumped out of my vehicle once I was around the corner to continue watching it. A lady joined me. After hovering still for a moment, it began to glide silently to the west, at a relatively fast pace. Shortly after, it began a very gradual descent. We both lost sight of it behind some trees and were not able to spot it again. Niether one of us could think of a rational explanation for what we had seen. It could not have been a balloon based on the initial, perfectly stationary movement of the object, and it had a very distinct shape that I would attribute to a jujube candy or something of that nature."],"Case Number":"7315","Longitude":"-114.050382","Date of the Event":"09/20/2006 02:00 UTC","Country":"Canada","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown"}