{"files":["/var/www/straped/mufon/html2text/7322.html.txt","/var/www/straped/mufon/more/7322_submitter_file1__IMG_4997.JPG","/var/www/straped/mufon/more/7322_submitter_file2__IMG_5003.JPG","/var/www/straped/mufon/more/7322_submitter_file3__IMG_4970.JPG","/var/www/straped/mufon/org/7322.html"],"Longitude":"-77.477878","Weather Factors":"None","Sighting Duration":"Undisclosed","Summary":"same place as last sighting!! got more pics","divs":["Sighting DetailsI went out the house to walk to my car and i noticed the bright white sphere in the sky again, except this time it was about one block closer to the house. Last time it was down the street. There were five of us present this time. got pics on 2 different cameras. We were outside for about 30 mins. we were taking still pictures and the object was movig (slowly to the naked eye but seems fast in the pics). We enterd the house to (around right now) upload these pics..we went to check on it outside..and it had dissapeared, if it had stayed there for 30 min straight then why would it dissapear withn 10min. This was no star, no airplane....If you look on the pics on the lower right hand corner there is a still star throughout the whole time. Is it coincedense, that it was the same time and place (in the sky) from the last pictures.with these they don't have much of a green glow like last time, it's more of a redish glow this time."],"Country":"United States","Latitude":"39.044738","Viewing Distance":"Unknown","Object Shape":"Circle, Flash, Sphere, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=39.044738,+-77.477878(7322)&iwloc=A&hl=en\"> mufon case (7322) map </A>","Source":"MUFON","Date of the Event":"06/26/2007 09:30 UTC","Object Features":"Unknown","Object Flight Path":"Path with directional change,Path then hovering","Disposition":"Unknown","Tags":"City","Case Number":"7322","Region":"Virginia","City":"Ashburn","trends":["There have been 11 other sightings in Ashburn","There were no other sightings in Ashburn on or around June 26th 2007","This sighting has been favorited 1 time.",""],"Log Number":"US-06262007-0006","Date Submitted":"06/26/2007 09:30 UTC"}