{"Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.409999,+-121.363388(7323)&iwloc=A&hl=en\"> mufon case (7323) map </A>","Disposition":"Insufficient Data","trends":["There have been 19 other sightings in Elk Grove","There were no other sightings in Elk Grove on or around June 25th 2007"],"Log Number":"US-06272007-0001","divs":["sighting detailsi was walking and talking with two of my friends on a sidewalk next to a park on the 6900 block of seasons drive just east of laguna park dr. elk grove california. i looked up towards the sky because i noticed above a few trees, about 65 degrees above the horizon, something very bright, round, yellow\\orange, and much larger than the stars (about the size of a pecil eraser held a arms length). it started to move extremely fast in a straight line almost due east and in about two to three seconds was completely gone from sight, as i ran to the other side of the trees to get a better look toward the horizon it was already gone. it left no trail or tail. my friends with me did not see it. i was freaked out becuase i could not explain what i saw, especially the speed it moved. after a minute or so we continued to walk and after a few minutes we encountered on verdure way two adults with three children standing on the sidewalk outside their parked van. i overheard them talking about seeing an object in the sky and pointing and showing the motion, so i spoke to them about what i saw and we all agreed that we had never seen any thing like it and that becuase of its enormous speed it could not be a jet and because there was no trail it could not be a meteor or a firework. my mind is still boggled."],"Viewing Distance":"Unknown","Source":"MUFON","Date Submitted":"06/25/2007 10:22 UTC","Summary":"A bright yellowish-orangish round light moving very rapidly away ttoward the horizon","Object Shape":"Sphere","Region":"California","Tags":"City","Latitude":"38.409999","Case Number":"7323","files":["/var/www/straped/mufon/html2text/7323.html.txt","/var/www/straped/mufon/org/7323.html"],"Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Date of the Event":"06/25/2007 10:22 UTC","City":"Elk Grove","Country":"United States","Sighting Duration":"00:00:05","Longitude":"-121.363388"}