{"map":"<A HREF = \"http://maps.google.com/maps?q=21.402222,+-157.739444(7324)&iwloc=A&hl=en\"> mufon case (7324) map </A>","Date Submitted":"06/26/2007 08:20 UTC","Tags":"City","divs":["Sighting Details8:20pm HST I stepped outside to smoke. I have a habit of looking at the stars and noticed one large 'star' moving quite quickly north to south. The more I looked I noticed several smaller stars also moving from the North but on the opposite side of my house also toward the south. I called my 11 year old out and simply said, \"Look at that.\" and pointed up. He said \"WHAT THE HECK IS THAT?!?!?\" I replied, \"I don't know but go get my camera.\" Unfortunately my cheapo Fuji Fine Pix doesn't have a night vision capture for video but I did get a few snaps of the larger craft without flash, I zoomed in as close as I could with it. I'll post a link as soon as I get them loaded. All in all we counted about 20 moving craft but those were too small to be captured by my camera. Thankfully my husband just purchased a DSLR A100 (I believe). He returns on Friday so I'll quickly work to figure the thing out and hope that these craft reappear so I can get some quality pics. Adreneline is pumping, may not be much sleep tonight! 9pm HST my 14 year old came in the house, we told him what had transpired outside and showed him the pictures. He insisted on going back out at which time we spotted 12 more craft in appx. 20 minutes all moving north to south. Let me add that we live on the windward side of Oahu on MCBH (Marine Corps Base Hawaii). It now sounds as if every plane and chopper on the base has taken to the air. Let me add that it's now 9:40pm, the larger of the crafts is still visible and occassionally stops in the sky before resuming it's southward path. There are still many smaller craft across the sky and our neighbors have now also began to take notice."],"files":["/var/www/straped/mufon/html2text/7324.html.txt","/var/www/straped/mufon/org/7324.html"],"trends":["There have been 2 other sightings in Kailua","There were no other sightings in Kailua on or around June 26th 2007","This sighting has never been favorited.",""],"Longitude":"-157.739444","Weather Factors":"Unknown","City":"Kailua","Source":"MUFON","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Latitude":"21.402222","Disposition":"Unknown","Case Number":"7324","Date of the Event":"06/26/2007 08:20 UTC","Summary":"Larger craft noticed in the sky moving n. to s. many smaller craft moving in the same direction","Log Number":"US-06272007-0002","Region":"Hawaii","Object Features":"Unknown","Country":"United States","Object Shape":"Circle, Star-like"}