{"Disposition":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/7325.html.txt","/var/www/straped/mufon/org/7325.html"],"Sighting Duration":"Undisclosed","Latitude":"42.02702","Tags":"City","Country":"United States","Summary":"Two craft, one beneath the clouds, a much larget one above.","Object Features":"Unknown","Object Flight Path":"Hovering then path,Path with directional change","Object Shape":"Chevron, Diamond","divs":["Sighting DetailsWhile at Ada Hayden Lake, (northern most region of Ames, Iowa) on our small fishing boat, my brother and I spotted a red-orange object beneath dark, heavy clouds. It made it's way toward the lake from the south, having either come over the city heading north, or had dropped out of the clouds. It was a bright object and formless looking at the distance from which I spotted it. Being familiar with the area (ie, city lights, towers, etc) the light caught my attention immediately. Not to mention there was a dense, low cloud cover and it was approximately 11pm, so very dark. As it got nearer, through our mutual shock and original attempts to explain it as something else, we both noticed it was vaguely diamond shaped, & looked to wobble on an axis. Straining to hear a noise, we heard nothing coming from the craft, which was moving in a northerly direction at a fast pace. Being dark and uncertain on the height of the ceiling of clouds, I could only guess how large or fast it was. I grabbed a flashling and tried to signal it with timed pulses directed toward it. At it's closest point, it was close enough to one of the shores to see a reflection of it in the water. That specific shore was perhaps 350 meters to the west of us. Not long after I flashed my light at it, it seemed to speed up and bow to the east further over the lake, hover, then changed course heading west, southwest. As it hovered, a hole in the clouds opened two or three fist widths in diameter and I saw something very large, grey or black in color with multiple lights. Through the clouds around the hole, four or five yellow lights filtered in, these seemed to move with this second craft and I think were a part of it. Whatever it was, it filled the small hole in the clouds and then some, meaning it would have had to been enormous. This second craft was moving above the cloud cover in a southwesterly direction and was gone from sight through the hole in a matter of seconds and the yellowish hazey lights faded. Looking back to the red-orange object, we watched it hover for a moment, then take it's new course as above mentioned, to the west southwest and stayed on that course below the cloud cover before speeding over the horizon. It seemed to be moving much faster than before as it left the area. The whole affair couldn't have lasted more than three minutes."],"Date Submitted":"06/24/2007 11:00 UTC","Date of the Event":"06/24/2007 11:00 UTC","trends":["There have been 9 other sightings in Ames","There were no other sightings in Ames on or around June 24th 2007"],"Viewing Distance":"501 Feet - 1 Mile","Longitude":"-93.616102","Log Number":"US-06272007-0003","Region":"Iowa","Case Number":"7325","map":"<A HREF = \"http://maps.google.com/maps?q=42.02702,+-93.616102(7325)&iwloc=A&hl=en\"> mufon case (7325) map </A>","City":"Ames","Weather Factors":"Unknown"}