{"Country":"United States","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 18 other sightings in Dana Point","There were no other sightings in Dana Point on or around June 26th 2007"],"Date Submitted":"06/26/2007 12:00 UTC","Object Features":"Unknown","Log Number":"US-06272007-0008","divs":["sighting detailsi was driving southeast on pch 1 near del prado in dana point, ca at about 4pm. i looked up and straight ahead off in the distance, maybe about a mile or so away from me, i saw this small, bright white object moving incredibly fast from east to west and traveling low near the horizon. it was not shaped like a plane and had no visible wings, tail, or body shape which would have been consistent with a plane or helicopter. at first from the look and size of it, i thought it might be a white sea bird of some type, however the object's motion was far too constant and steady to be a bird, and it's speed was much more rapid than any bird could maintain while flying horizontally. as i was driving and in traffic, i lost sight of the object when it appeared to fly over\\behind some trees on the horizon toward my left (west), headed in the direction of the open ocean. it's shape was hard to determine, but my best guess is that it was oval or round or rectangular. the most striking features were the objects incredibly fast speed and bright\\shiny white appearance."],"Disposition":"IFO","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.466972,+-117.698108(7330)&iwloc=A&hl=en\"> mufon case (7330) map </A>","Summary":"Fast-moving bright white object heading toward ocean","Case Number":"7330","City":"Dana Point","Tags":"City","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/7330.html.txt","/var/www/straped/mufon/org/7330.html"],"Latitude":"33.466972","Date of the Event":"06/26/2007 12:00 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","Object Shape":"Oval, Square, Rectagular","Longitude":"-117.698108","Region":"California"}