{"Date of the Event":"10/11/2002 10:00 UTC","files":["/var/www/straped/mufon/html2text/7331.html.txt","/var/www/straped/mufon/more/7331_submitter_file1__Site01.jpg","/var/www/straped/mufon/more/7331_submitter_file2__Site02.jpg","/var/www/straped/mufon/more/7331_submitter_file3__Site03.jpg","/var/www/straped/mufon/org/7331.html"],"Case Number":"7331","City":"Georgetown","Disposition":"Unknown","Source":"MUFON","Object Shape":"Other","Date Submitted":"10/11/2002 10:00 UTC","Region":"Alabama","Summary":"Uncle called that something happened, showed burn marks in grass","Country":"United States","divs":["Sighting DetailsMy uncle did not want me to reveal this. This event happened two years ago. On October 11th, 2007 I recieved a phone call from my uncle. My uncle lives in a rural area. He stated that the night before, he was painting his bed room and super bright lights filled his house. He thought that someone was shining bright car headlights into his house. He went outside to see what was going on and a bright light just disappeared. He showed me where the object was. I noticed that there were four circles 'burned into grass\". The circles were aranged in a diamond shape. The two large circles(18 inches in diameter) were opposite each other with a distance of six feet. The smaller circles (8 inches in diameter) were opposite each other on the other apexes of the triangle. My uncle stated that the lights were a frequent visitor. He begged me not to tell anyone fearing that they would believe he was crazy. I was moving items and found my pictures and decided to post them."],"map":"<A HREF = \"http://maps.google.com/maps?q=31.29639,+-87.73556(7331)&iwloc=A&hl=en\"> mufon case (7331) map </A>","Latitude":"31.29639","trends":["There has been one other sighting in Georgetown","There were no other sightings in Georgetown on or around October 11th 2002","This sighting has never been favorited.",""],"Viewing Distance":"21-100 Feet","Weather Factors":"Unknown","Longitude":"-87.73556","Log Number":"US-06272007-0009","Sighting Duration":"02:00:00","Tags":"City","Object Features":"Unknown","Object Flight Path":"Undisclosed"}