{"Date Submitted":"06/28/2007 11:10 UTC","Tags":"City","Disposition":"Unknown","Longitude":"-80.254251","Object Flight Path":"Path with directional change","Log Number":"US-06292007-0001","divs":["sighting detailsmy nephew and i were cruising down, i believe 441 (i'm new in the area) going north when we saw odd-shaped lights up ahead in the distance. they were odd-looking enough to get joking comments from me about it being a ufo. as we got closed, we realized it was moving very slowly, practically hovering.. as we got even closer, it changed directions from traveling south west eventually east. as it got closer and closer, we were very surprised to see how slowly it was moving. it seemed like maybe 40-50 miles per hour. the \"wings\" were large - the size of 3 or 4 passenger plane wings. there were lights beneath these wings. as it traveled east directly above us, i opened my window to get a better look. i didn't hear anything. it was a few hundred feet above us. we should have heard something. i got the best look at it through my moonroof. it looked exactly like this: http:\\\\www.ufocasebook.com\\newstagvee.jpg if i would have drawn a picture of it, it would have come out a lot like that picture. it was absolutely not a plane (it had no body) or a helicopter. it was traveling extremely slow and silently. i have no idea why i didn't try to follow this thing and take pictures with my camera phone. they probably wouldn't have come out but i really don't know why i didn't decide to follow it more. i suppose i didn't really believe that i saw what i saw when i was seeing it... i could have turned right and followed it a little longer, but i didn't. we're both shocked that we didn't look further into whatever this was... p.s. it was flying beneath the clouds. the clouds were greyish white - making it very easy to see this object..."],"Source":"MUFON","Summary":"Saw slow-moving Boomerang shaped UFO in sky","Date of the Event":"06/28/2007 11:10 UTC","trends":["There have been 5 other sightings in Wellington","There were no other sightings in Wellington on or around June 28th 2007"],"Country":"United States","City":"Wellington","Region":"Florida","Object Shape":"Boomerang","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/7338.html.txt","/var/www/straped/mufon/org/7338.html"],"Latitude":"26.655231","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Case Number":"7338","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=26.655231,+-80.254251(7338)&iwloc=A&hl=en\"> mufon case (7338) map </A>"}