{"Date Submitted":"06/16/2007 02:07 UTC","Disposition":"Unknown","Region":"Ohio","City":"Westlake","Latitude":"41.455323","divs":["sighting detailsthe first ufo was seen at 2:07 am by my friend through his hardin dobsonian 8inch telescope at 150x magnification. he had yelled out and it could be seen with the naked eye and had the brightness of vega. he and i both tracked it with the telescope and with our eyes. it was travelling from south to north at a fairly good speed and it seemed to have reflected the sun (whitish yellow light as it flew over). as it went more north, the ufo reflected or gave off less light and eventually disappeared\\dimmed out. through the telescope my friend said it looked to be round and white to where i thought it looked more wedge\\half moon shaped and white. when it disappeared from view it was 2:09am. my friend is an amatuer astronomer and we did look online at \"heavens-above\" and a couple of other websites to see if anything matched what we saw. we couldn't find any matches. the object was not a meteor or meterorite, it was artificial given its appeareance and trajectory. it seemed to have kept a straight line and did nothing unusual other than get dimmer as it moved north. it seems to have kept the same altitude the whole time it flew over. at 2:20am, again with the same telescope, we spotted a white dot\\orb that was moving from south to east in the field of view through the telescope. it was travelling too slow to be a meteor or meteorite. my friend said that they (all the amatuer astronomers) often see these in his astronomy club and refer to them as \"satellites.\" i saw a similar object travelling the same direction 6 minutes later. it might have been the same object or a different one. neither of these objects could be seen with the naked eye, and the magnification was the same as stated above. 1. we were star gazing through my friends telescope. 2. he noticed object one and two through his telescope. object three i noticed through his telescope. 3. some kind of object in orbit. my friend said the space station which we found out would not be visible through the naked eye. the other two objects i took to his word that they were satellites. 4. described above. 5. it was exciting, not knowing what they were. especially the first object. 6. the first one faded going north. the other two objects were hard to track through the telescope."],"Log Number":"US-07022007-0001","files":["/var/www/straped/mufon/html2text/7350.html.txt","/var/www/straped/mufon/org/7350.html"],"Country":"United States","Tags":"City","Case Number":"7350","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=41.455323,+-81.917917(7350)&iwloc=A&hl=en\"> mufon case (7350) map </A>","Source":"MUFON","trends":["There have been 2 other sightings in Westlake","There were no other sightings in Westlake on or around June 16th 2007"],"Summary":"Three separate UFOs were seen twenty minutes apart","Object Shape":"Other","Object Features":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Longitude":"-81.917917","Date of the Event":"06/16/2007 02:07 UTC","Weather Factors":"None"}