{"Case Number":"7354","map":"<A HREF = \"http://maps.google.com/maps?q=31.094633,+-92.400412(7354)&iwloc=A&hl=en\"> mufon case (7354) map </A>","Disposition":"Insufficient Data","Country":"United States","Viewing Distance":"Unknown","Region":"Louisiana","Object Shape":"Star-like","Source":"MUFON","Latitude":"31.094633","City":"Lecompte","Tags":"City","files":["/var/www/straped/mufon/html2text/7354.html.txt","/var/www/straped/mufon/org/7354.html"],"Summary":"ufo sightin","Longitude":"-92.400412","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Date Submitted":"06/10/2007 12:00 UTC","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","trends":["There have been no other sightings in Lecompte","This sighting has never been favorited."],"divs":["Sighting Detailsok i have been rather weary on speaking about this subject for obvious reasons but seeing is beliving and i was ounce a non believer but now i know the truth. this is what happend the first time i seen this. i was on my back porch late one night smokin a cigarete,i often gaze at the beauty of the stars,but this paticular time was like no usual gazing. i looked up an was astonished at what i was seeing a fear like no other had befallen me. i said no no no noway,i went inside walked back out 3 times saw the same thing in the same place doing the same thing. zig zaging all over the place. i am convinced that no man made object can move so fast like this was doing, and if such a thing does exist than only few know of it. since then i have been constantly seeing the same shit almost every night since then the date being now july 2 07. ive been seeing this id say for the past 4 months roughly speaking. my redkneck butt wants to know what the hell is going and why does this BS goverment doing every thing in its power to hide this from the public. i mean ive been through some shit in my life but damn this takes the whole cake."],"Date of the Event":"06/10/2007 12:00 UTC","Log Number":"US-07032007-0001"}