{"Region":"Michigan","Date Submitted":"07/03/1960 11:37 UTC","trends":["There have been no other sightings in centerline","This sighting has never been favorited."],"Longitude":"-85.965555","files":["/var/www/straped/mufon/html2text/7356.html.txt","/var/www/straped/mufon/org/7356.html"],"Sighting Duration":"Undisclosed","Object Features":"None","Country":"United States","Case Number":"7356","Weather Factors":"Unknown","Date of the Event":"07/03/1960 11:37 UTC","City":"centerline","map":"<A HREF = \"http://maps.google.com/maps?q=44.000113,+-85.965555(7356)&iwloc=A&hl=en\"> mufon case (7356) map </A>","Object Flight Path":"Path with directional change","Tags":"City","divs":["Sighting DetailsMy husband and I had just come from Te Romas,we had just finished dinner and i began driving down Kaltz toward our home. Before reaching the stop sign I noticed in the sky a red glow thinking it was a firework, and I told my husband, who was next to me in the car, to look at it because it wasn't reacting like a firework that disappears after it burns out. I pulled up to the stop sign and got out as I did I called 911 and reported that the ball of fire was headed north toward Van Dyke the whole event lasted about 45 to 50 seconds. The 911 operator asked my location and discription of the object and I explained to her what I was viewing. Another couple, who had pulled up to go around us, had stopped as I pointed to the sky, and they also saw the object. The 911 operator asked me how big and how far away the object was and I told her it looked about the size of a small aircraft, though not an aircraft and was at a low altitude and just floated over me as I was speaking. She said she would dispatch some one and I told her all they have to do is look up in the sky and they would see it. I ended the call to 911 with the feeling that nothing was going to be done and that my call would be filed away as a prank. I got back in my vehicle and proceeded to go toward Van Dyke but the object had disappeared. I watch the sky all the time and I know an aircraft or a star or a fire work when I see one, and believe me , this was no fire work. I hope someone else besides the couple who was in the other vehicle, my husband and myself saw what we did las night. It was really spectacular. It floated, no sound, just floated across the sky and right over our vehicles it was like a red fireball, it moved slowly and It was very low altitude. Thank you for your time, I didn't know where else to put this report but here."],"Latitude":"44.000113","Object Shape":"Fireball, Sphere","Summary":"thought it was a firework but it didnt die out it floated across the sky at low altitiude and i called 911","Log Number":"US-07042007-0001","Source":"MUFON","Disposition":"Insufficient Data","Viewing Distance":"501 Feet - 1 Mile"}