{"divs":["Sighting DetailsOn 3-9-2005 at about 1:30 am I was watching tv in my home when I heard helicopters outside. I live close to WPAFB so its not unusual to hear different aircrafts flying at all hours, but I could tell there was at least 2 & they sounded like they were hoovering. Anyway, I went out my back door to see what I could see. when I walked out back I saw 2 helicopters hoovering close together just a short distance from my home, as I'm looking at them trying to figure out what they could be doing I happened to look straight up. To my astonishment there is a massive (probably 200 yards) triangular shaped object above MY house. It was totaly silent. I stood there,not believing what I'm seeing. From what I could see the object appeared totally black with 3 white lights, 1 on each corner. After a few minutes I ran inside to get my camera to photo what I could. Of course my battery was dead! I ran back inside to wake up my husband, but as I'm inside I hear the helicopters leaving. I went back outside & the helicopters & the object were gone. The object seemed to only be about 150 feet above my house, actually it was above numerous houses, I live in a subdivision. Sure would like to know what they were doing over my house, creepy!"],"trends":["There have been 7 other sightings in Huber Heights","There were no other sightings in Huber Heights on or around March 9th 2005"],"Tags":"City","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.846237,+-84.121161(7357)&iwloc=A&hl=en\"> mufon case (7357) map </A>","files":["/var/www/straped/mufon/html2text/7357.html.txt","/var/www/straped/mufon/org/7357.html"],"Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Log Number":"US-07042007-0002","Latitude":"39.846237","Object Shape":"Triangle","Source":"MUFON","Summary":"Triangle shape object hovering over house","Region":"Ohio","Longitude":"-84.121161","Weather Factors":"Unknown","Disposition":"Insufficient Data","Case Number":"7357","City":"Huber Heights","Object Flight Path":"Stationary","Date of the Event":"03/09/2005 01:30 UTC","Country":"United States","Date Submitted":"03/09/2005 01:30 UTC"}