{"Longitude":"-75.234077","divs":["Sighting DetailsI was in my observatory with the intention of photographing a certain nebulocity. Instead, I found that \"sky-glow\" this night would only make photography an effort in futility. I was staring at the eastern sky for a few minutes when, out of the corner of my eye, I spotted a very bright light shining behind a tree line in the distance. Since we live in the heart of farmland, I thought I might be looking at the light of farm equipment, until I realized that this light was far brighter than any farm equipment that I know of, plus the fact that this hour was not compatible with farmers. The light was stationary for a short time, and then began moving very slowly in a northerly direction. It appeared to be on the ground, and then it started to rise slowly, while moving forward. This light appeared to be three-quarters to one mile away. The light first appeared to me near the southeast corner, and was slowly moving toward the north. I was awed by the brightness of this light. Within thirty to forty seconds, this light slowly rose above the tree line and began to turn in my direction. At this time I could not distinguish any shape or design; just a powerful light that was illuminating the trees and turf as it approached. My wife and I moved to this location in 2003. I had had an observatory on our other property, which I disassembled and reassembled here. We live sixteen miles from a nuclear power plant, and while building my observatory, I seemed to have sparked an interest from the military, because military helicopters circled and observed my project on two occasions. Therefore, I began to think that the military might have a renewed interest in what I was doing. I decided that this object was probably a helicopter in search of something, or perhaps someone. I was waiting for the sound of an engine and rotor blades, but there was none. This object was moving in my direction, so low and so slowly that I was occasionally able to discern objects under its bright light. My neighbor has a maintenance shop and warehouse on his property, directly in front of where I was standing. As the object began to approach my neighbor's property, its light went out. Many seconds passed, and I thought the thing was gone. Then, suddenly, I was confronted with an enormous object clearly defined by ambient light just above the roof of the shop. It was so low, moving so slowly, and heading straight for me; and I actually thought it was crashing. As this thing began approaching me and my observatory, it began to rise a little. I was so stunned by what I was seeing that I was preparing to run. This thing was barely moving forward now, and could not be more than 200 feet above me, probably less. I could make out incredible detail. If there were rivets or bolts in its construction, I would have been able to count them. As the object's rounded nose began to approach me, I was really taken back by its brightly lit windows. There were none on or above its nose, but I was almost shocked to see a figure (humanoid form) moving as if it were pacing back and forth, in the large port window. I could see no other shapes or shadows in any of the other windows. Of the many ridiculous thoughts that were dashing through my nind, one in particular was, \"there's no one at the controls.\" As this larger window got closer, the figure moved away from the window toward the center of the craft, and disappeared from sight. I was actually startled by how slowly this thing was moving, because it appeared to be getting ready to hover as its OPEN hatch moved directly over me. I have to admit that I was entertaining some negative thoughts regarding my own safety at this time; but at the same time, I was so entranced by this object and this event, that I just kept staring. Details of this object are as follows: (1) At least two stories high (that which I could see) (2) Two larger windows, port and starboard (3) Several smaller windows (4) A rounded nose (5) A shadowy figure in the large port side window (6) Three opaque light type structures (there were no active lights) (7) Two large turbo type structures (somewhat larger in diameter and shorter in length than what I am used to seeing on commercial aircraft) (8) Eight flap or stabilizer type structures aft (9) A very large, square, black container type structure protruding off-center from its underbelly (10) An open hatch I know that there were other bulky geometric shapes that I saw on this object, but for some reason, I absolutely cannot remember what they looked like or where they were. I remember thinking of this thing as being huge, thick and bulky, with an incredible amount of drag, and that it could not be an aerodynamic possibility. Almost immediately I felt a surge of static electricity. The hair on my head and arms was moving, and I could feel a gentle tingle on my face. I did not take my eyes off this object at any time. As its tail section was about to pass over me, I quickly spun the dome. As I was spinning the dome, while continuing to stare at this thing, it was gone. No turbulence. No sound. Just gone. I continued to do a 360 degree search for a few minutes, but nothing was there. I must add that when the object was passing directly over me, it was making a sound. The sound was too faint to be heard in any enclosed structure such as a house, shed, car, etc.; but nevertheless, it was there. The best way I can describe ths sound would be a low-pitched roar or drone, similar to what you might hear a mile or so away from an airport, when a jet lands silently and its reverse thrusters are activated. Also, this sound was superimposed with another faint sound, much like the sound of bacon sizzling in a frying pan. When I spoke with a MUFON Representative over the phone, I mentioned that some of the equipment in my observatory had failed. Shortly after this event, I had major surgery, and it was about one and one-half months before I was able to re-enter my observatory. What I discovered was that the micro-processor in the telescope itself appeared to be \"fried,\" along with another piece of equipment. I replaced the panel board in the telescope, and all is well. I am well aware of what static electricity can do to a micro-processor. Is that what happened? So much time had elapsed from the time of the event until I went back to my observatory that I feel it would not be accurate for me to say for sure that this is what happened...just probably. My wife and I did tour the area, as well as the surrounding areas to where I believed this event took place, and we found nothing out of the ordinary."],"trends":["There has been one other sighting in Bridgeton","There were no other sightings in Bridgeton on or around October 12th 2006","This sighting has never been favorited.",""],"Object Shape":"Triangle","Latitude":"39.427337","map":"<A HREF = \"http://maps.google.com/maps?q=39.427337,+-75.234077(7359)&iwloc=A&hl=en\"> mufon case (7359) map </A>","Object Features":"Undisclosed","Tags":"City","Sighting Duration":"00:04:00","Summary":"While in my observatory, a very large, triangular-shaped object moved slowly toward me and passed directly overhead.","Weather Factors":"Unknown","Disposition":"Unknown","Date Submitted":"10/12/2006 12:45 UTC","Log Number":"US-07042007-0004","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/7359.html.txt","/var/www/straped/mufon/org/7359.html"],"Source":"MUFON","Date of the Event":"10/12/2006 12:45 UTC","Viewing Distance":"Unknown","Country":"United States","City":"Bridgeton","Region":"New Jersey","Case Number":"7359"}