{"City":"Birmingham","Source":"MUFON","Object Features":"Dome","Region":"Alabama","files":["/var/www/straped/mufon/html2text/7362.html.txt","/var/www/straped/mufon/more/7362_submitter_file1__Default_0001.jpg","/var/www/straped/mufon/more/7362_submitter_file2__Default_0002a.jpg","/var/www/straped/mufon/more/7362_submitter_file3__Default_0002.jpg","/var/www/straped/mufon/org/7362.html"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.522371,+-86.80001(7362)&iwloc=A&hl=en\"> mufon case (7362) map </A>","trends":["There have been 48 other sightings in Birmingham","There were no other sightings in Birmingham on or around June 16th 2007","This sighting has never been favorited.",""],"Disposition":"Unresolved","Country":"United States","Case Number":"7362","Weather Factors":"Unknown","divs":["Sighting Details16th June 2007 at 8.32pm I witnessed a strange object in the sky. This is my story... I live in Quinton which is approx 4 miles from Birmingham city centre. I have had an interest in military aircraft since the age of 14, I'm now 32. I know the signature patterns of aircraft and helicopter strobes and flight dynamics so the identification of an aircraft I can make instantly. I have been an amateur astronomer for over 10 years and own my own 10\" Newtonian telescope with observatory so even the faintest satelite or space anomaly I can identify. To put it short, my eyes are quite well trained and not as easily fooled as the untrained eye. I have had a keen interest for most of my life with Ufology and have read many if not most of the ufo literature available. I have read many case reports and sightings so I know what could be easily described as a ufo when a logical explanation is available. Heres my sighting, I was standing by my patio door having a cigarette and my wife had just gone in the bath, whilst smoking I noticed a black object in the sky approx 3 miles away from my home, at first it could be confused with a hawk hovering at close range, but over a heavy populated area at approx 3 miles, I think not. I continued to watch the object as my mind was trying to rationalise what I was seeing to an object I could relate to, i couldn't. The object was black, no lights no sound. It seemed to be oval shaped and on ocassions changed to a triangle shape. Visibility was very good, clear sky with a few rain clouds to the horizon and a few brillant white clouds which were being illuminated by the sun. I watched for an estimated 1 min 30 secs before accepting that this could be a ufo. I have a 9 month old daughter and when she was born we decided to purchase a digital hard drive camcorder to film her growing up. I decided to fetch this knowing more than likely that when i return the object will have disapeared. I returned with the camera and noticed the object was still there, only now it was on the move. I powered up my camera and started to film the object. The digital display on the camera is approx 3 inches in size so I couldn't tell if i had the object in view or even in focus, but i continued to film. The object moved over the trees and towards the horizon and finally disapeared behind a cloud. My ideal reactions would have been to notify the local police of a potential unidentified object within a flight path and even contact air traffic control. Reading as many ufo books as i have i know how important recordable data is, but strange enough i did what most general public do, i thought how strange and just sat down going over in my mind what i had just witnessed. The only plausable thing i did was to email Timothy Good straight away. Although the obect was quite far away, with a trained eye i could just about identify its shapes. We decided to watch the video to see if you could see the little dot in the sky and to our amazment we captued 2 mis 32 secs of the ordeal, and the footage is very clear"],"Summary":"ufo over birmingham caught on camera","Tags":"City","Object Shape":"Disc, Oval, Teardrop","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Latitude":"33.522371","Date of the Event":"06/16/2007 08:31 UTC","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"06/16/2007 08:31 UTC","Longitude":"-86.80001","Log Number":"GB-07042007-0007"}