{"Log Number":"US-07042007-0008","Object Shape":"Disc","Source":"MUFON","Case Number":"7363","Object Features":"Undisclosed","City":"Herrin","Country":"United States","Disposition":"Unknown","divs":["Sighting Details On July 3, 2007 my daughter and I decided to go out to a field near our house to look at the stars. We took some cushions from lawn chairs and lay down on them. At first we saw a few \"shooting stars\", airplanes, the usual things. Suddenly I noticed an object in the sky to the North of us. It had multiple lights on it but they were \"chasing\" lights, not blinking ones like airplanes have. This object was flying much faster than the planes we had seen earlier. It was a disc shape and was at an angle. You could tell that it was spinning and the lights were going around it. It probably was only there for about 30 seconds then was gone. The planes that usually fly over you can follow with your eyes for much longer than that. I feel that it was not an airplane, and it certainly was not a helicopter. It made no sound whatsoever. (a jet had flown over a few minutes before it did and you could hear the sound of it very clearly) There was no traffic noise or any other noise that would have drowned it out. I am curious to know if anyone else in this area happened to see something around that time?"],"Tags":"City","Date Submitted":"07/03/2007 10:45 UTC","Region":"Illinois","map":"<A HREF = \"http://maps.google.com/maps?q=37.803106,+-89.027574(7363)&iwloc=A&hl=en\"> mufon case (7363) map </A>","Object Flight Path":"Undisclosed","Summary":"UFO seen over small town in Southern Illinois","Longitude":"-89.027574","files":["/var/www/straped/mufon/html2text/7363.html.txt","/var/www/straped/mufon/org/7363.html"],"Date of the Event":"07/03/2007 10:45 UTC","Latitude":"37.803106","Weather Factors":"Unknown","Viewing Distance":"Unknown","trends":["There has been one other sighting in Herrin","There were no other sightings in Herrin on or around July 3rd 2007"],"Sighting Duration":"Undisclosed"}