{"Source":"MUFON","Case Number":"7365","files":["/var/www/straped/mufon/html2text/7365.html.txt","/var/www/straped/mufon/org/7365.html"],"Object Shape":"Diamond","map":"<A HREF = \"http://maps.google.com/maps?q=44.804242,+-68.771444(7365)&iwloc=A&hl=en\"> mufon case (7365) map </A>","City":"Bangor","Country":"United States","Disposition":"IFO","Longitude":"-68.771444","Date Submitted":"07/04/2007 12:00 UTC","Summary":"red diamond shaped object","Latitude":"44.804242","Sighting Duration":"Undisclosed","Log Number":"US-07042007-0010","Object Flight Path":"Stationary","divs":["Sighting DetailsMy wife and i were sitting down getting ready to watch the fireworks display in Bangor maine. probrably 15 or 20 min before they began, we saw a red object in the sky. i had my video camera and was able to take 19 seconds of footage with both distance and zoom footage. it was red and pulsating with concentric circles going from the center to the edges. it was silent and floated in the air. it was noticable for probrably 5 to 10 seconds before i got my video camera ready to film. at the end of the footage as i pan out there is a second object over the first object that i did not notice at first. they just seem to disapear, as if they take off at very high speed going directly away from our vantage point. i noticed the object because i thought it was the first firework. but it just continued hovering and did not burn out. it was visible for 25 to 30 seconds total. it stayed quite still throuout the sighting, not moving, just pulsating. i cannot explain what we saw. i will attach the video clip as soon as i get it downloaded to my computer. as i write this, i am only about 2 hours removed from the sighting."],"Tags":"City","Weather Factors":"Unknown","Date of the Event":"07/04/2007 12:00 UTC","Region":"Maine","trends":["There have been 18 other sightings in Bangor","There were no other sightings in Bangor on or around July 4th 2007"],"Viewing Distance":"Unknown","Object Features":"Patterned Surface"}