{"Object Flight Path":"Straight-line path","Weather Factors":"Unknown","divs":["sighting detailsone at a time would show up straight up in the sky just after dark. it was light gray and just barely stood out against the night sky. no lights, no sound. it was heading due south and we could see it almost until the horizon and then no more due to it being night and it would just fade out. then the same thing in about 2-3 minutes. then the 3rd one was a little to the east but still heading south-southeast. then 2 more and then nothing. i do not think they were alien craft but definitely ufos maybe from hafb or military bases to the west of slc and some advanced aircraft. my neighbor came over and asked if i wanted to see what he and his brother had seen 2 nights before on 7\\1\\07 at the same time of night. 3 of us came out of my house and all witnessed the same thing along with my neighbor. the area is about 5-10 miles east of slc international airport and directly over downtown slc ut. we lost sight due to the dark skies and no lights on the crafts. they appeared like a plane with no body, only wings, appeared very large and not extremly high altitude like a jet (much larger) but no noise or any kind or contrail that could be made out."],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/7367.html.txt","/var/www/straped/mufon/org/7367.html"],"Case Number":"7367","Region":"Utah","Longitude":"-111.881457","Viewing Distance":"501 Feet - 1 Mile, Unknown","Date of the Event":"07/03/2007 10:30 UTC","Object Shape":"Boomerang","Sighting Duration":"00:15:00","trends":["There have been 73 other sightings in Salt Lake City","There were no other sightings in Salt Lake City on or around July 3rd 2007"],"Summary":"4-5 UFOs seen one at a time from central sky to horizon heading south","map":"<A HREF = \"http://maps.google.com/maps?q=40.766229,+-111.881457(7367)&iwloc=A&hl=en\"> mufon case (7367) map </A>","Latitude":"40.766229","Log Number":"US-07052007-0002","Date Submitted":"07/03/2007 10:30 UTC","Tags":"City","Disposition":"Unknown","City":"Salt Lake City","Country":"United States","Object Features":"Wings"}