{"Sighting Duration":"00:03:00","Region":"England","Latitude":"53.007228","Case Number":"7369","Viewing Distance":"Unknown","Object Shape":"Other","Weather Factors":"Unknown","trends":["There have been 8 other sightings in Stoke-on-Trent","There were 2 other sightings in Stoke-on-Trent on or around July 3rd 2007","This sighting has never been favorited.",""],"Object Features":"Undisclosed","Longitude":"-2.174044","divs":["Sighting Detailsi was driving to hixon near stafford and had just passed colwich i think when i saw this really bright 'disc' with thousands of spikes lit in blinding white light shooting out the top of it (spread out like a flowers petals!) in a field a few miles ahead. stunned! by what it could be i really looked hard and it started to rise so that i couldn't see the spikes anymore and there was like a disc in the middle with a sort of upside down dome beneath. it seemed to have lights (like windows on a skyscraper but not sure) but what was obvious was this piercing light on the underneath in the shape of a huge '+' sign on the computer keyboard. it ran over the shape making it easy to figure out and you could see that the dome shape sort of dropped down into a spike (like those on top!) which was glowing like molten metal at a forge! anyhows i switched on the camera as the thing started to rise thinking i'd got to get a pic but int he seconds it took to get ready the damn flying thing had got raelly high and could hardly be seen no more but it did appear on the picture above the clouds in the middle. i drove on a bit scared like, but another (more earthly! lol)_ weird thing happened when i stopped at the petrol station for a can of pop because my throat was dry. on the way out these two blokes in pinstripes suits are like \"ay mate did you see that weird thing in the sky when you were driving up that road\" and i'm like taken aback because there were no cars behind me and i'm sure i'd hav enoticed the fancy Audi they'd got out of on the garage forecourt. so i'm like, \"yeah, lol, what do you think it was,\" and one of them grabs my arm, and jokes \"talk about thing out there and ppl will think you're crazy\" but it was real sinister cuz of how he gripped me arm and the other one stared at me. and i'm like \"no, lol i don't know what it was anyway\" and get out of there. when i gets home and tell my family they're like \"yeah right\" lol but then i show them the picture and they know i'm not being daft. my kid brother then says i should post the picture to here in case anything happens to the one i've got we can always say well it's still there and ppl would notice if it was suddenly gone one day!!"],"Disposition":"Unresolved","Tags":"City","Source":"MUFON","Object Flight Path":"Undisclosed","Log Number":"GB-07052007-0004","map":"<A HREF = \"http://maps.google.com/maps?q=53.007228,+-2.174044(7369)&iwloc=A&hl=en\"> mufon case (7369) map </A>","Date of the Event":"07/03/2007 08:00 UTC","Date Submitted":"07/03/2007 08:00 UTC","City":"Stoke-on-Trent","Summary":"weird flying thing with spikes near colwich","files":["/var/www/straped/mufon/html2text/7369.html.txt","/var/www/straped/mufon/more/7369_submitter_file1__DSCF0009.JPG","/var/www/straped/mufon/org/7369.html"],"Country":"United Kingdom"}