{"Sighting Duration":"Undisclosed","divs":["sighting detailsduring the perseid meteor shower of 1990 i was laying in the back of my old pickup watching for meteors. i had brought along my binoculars to scan the milky way during the dull points. i had watched a few satellites go overhead in the binoculars, all of them appeared as small spots of light. i noticed this one \"satellite\" come up from the south horizon and when i looked at it with the binoculars it looked like a large dark triangle with white lights on each point and a larger yellow\\golden light in the center. as this object reached straight overhead, a second object just like the first came up from the southern horizon on the same path as the first. as the first object reached the northern horizon, and the second object was straight overhead, a third object just like the first two came up from the southern horizon on the same path as the first two. as the second object reached the northern horizon, the third was straight overhead. finally the third oject dissapeared over the northern horizon and i didn't see them again. i didn't think much of it at the time, just that they must have been very large, but later while watching an episode of \"sightings\" on tv, they showed a picture of an obect seen in belgium that was very similar to what i saw, and called it a ufo. i haven't seen anything like them since."],"Summary":"Three large triangle shaped objects crossed the sky from horizon to horizon at the approximate altitude of a satellite.","Longitude":"-84.176636","Latitude":"42.997805","Viewing Distance":"Over One Mile","Disposition":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.997805,+-84.176636(7370)&iwloc=A&hl=en\"> mufon case (7370) map </A>","Country":"United States","files":["/var/www/straped/mufon/html2text/7370.html.txt","/var/www/straped/mufon/org/7370.html"],"Object Features":"Undisclosed","Case Number":"7370","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Date Submitted":"08/10/1990 12:00 UTC","Log Number":"US-07052007-0005","Date of the Event":"08/10/1990 12:00 UTC","Source":"MUFON","Object Shape":"Triangle","Region":"Michigan","trends":["There has been one other sighting in Owosso","There were no other sightings in Owosso on or around August 10th 1990","This sighting has never been favorited.",""],"City":"Owosso"}