{"Case Number":"7371","Weather Factors":"Unknown","Object Shape":"Star-like","Latitude":"41.576627","files":["/var/www/straped/mufon/html2text/7371.html.txt","/var/www/straped/mufon/org/7371.html"],"Disposition":"IFO","Sighting Duration":"Undisclosed","City":"Tinley Park","trends":["There have been 15 other sightings in Tinley Park","There were no other sightings in Tinley Park on or around July 4th 2007"],"Country":"United States","Tags":"City","Log Number":"US-07052007-0006","Longitude":"-87.780274","Date of the Event":"07/04/2007 09:43 UTC","Viewing Distance":"Over 1 Mile, Unknown","Date Submitted":"07/04/2007 09:43 UTC","Object Flight Path":"Hovering then path","Summary":"Bright pulsating star like object","map":"<A HREF = \"http://maps.google.com/maps?q=41.576627,+-87.780274(7371)&iwloc=A&hl=en\"> mufon case (7371) map </A>","Object Features":"Unknown","divs":["Sighting DetailsWe were watching the Tinley Park firework display on 7-4-07. My brother noticed a very bright object in the sky and informed my family. There are about 6 other witnesses to this event. The object would shine very bright, like a plane approaching the airport upon landing with its lights on, for 30 seconds to a few minutes. The object would then gradually fade out entirely. Minutes later it would gradually build in intensity until it was bright again. At one point in time there was an object to the right of it that was not quite as bright , but also faded in and out. It is hard to approximate the distance between these objects but when i held my thumb out in front of my face, my thumb fit perfectly in between. The points of light in question were about twice as bright as the brightest star in the sky. The visibility was cloudy in certain areas of the sky but this did not seem to affect the objects intensity. After about an hour and a half the object that was dimmer than the other vanished totally. The first object continued to shine and fade. I continud to watch as family began to freak out about what it was. The objects appeared to be about 40 degrees over the horizon. My compass was pointing west at the time. This was clearly not power transmission lines, safety lights or anything terrestrial and it most certainly was not a fireworks display or mirage of some kind. This really happened and I have multiple witnesses to backup my story. Side note: The object moved in a Northwest fashion after the first 30 minutes or so. We noticed this as the reappeared in the sky after fading out. Thank You"],"Source":"MUFON","Region":"Illinois"}