{"Summary":"Triangle in clear sky","Tags":"City","Date of the Event":"07/01/2007 11:00 UTC","Log Number":"US-07062007-0001","Longitude":"-78.387806","files":["/var/www/straped/mufon/html2text/7374.html.txt","/var/www/straped/mufon/org/7374.html"],"Object Shape":"Triangle","Sighting Duration":"00:10:00","divs":["Sighting Details I'm an avid UFO watcher so I usually have my eye to the sky at night, more so after my sighting in April. A group of friends and myself were at a cliff behind a few houses in the hour before midnight on the 1st of July. I located Venus in the sky and was looking across the horizon at a \"star\" that appeared to be slowly moving up in the sky. I originally thought it was just the night sky taking its place, but one of my friends confirmed with me that the light was moving up, and at a faster pace then a celestial body would be. After we got the attention of the rest of us (5 total) we watched as it started to move in our direction, by this time moving faster. The craft reached an distance at which it would have been ID'ed after a few minutes, a which point we could clearly see three lights on the bottom of the craft which was triangular and silent. The triangle moved past us, still without noise or lighting that would have tipped me off to believe it was a plane. This was like no other \"plane\" I have seen before in our area of central PA, we have no bases nearby which even an experimental craft would launch from. I was excited to see the light rising in the sky, but as it closed in and flew by I was very fearful of it, which is unusual because I'm usually very excited about events like this. No one else in the group reported the same response. The clock read 11:11 when the event was over. I have a video, but we were not set to record such an event and in the excitement this small cell phone video is all I could capture. The object in the left of the screen is what I believe is Venus, and at the very least a star, with the craft flying to its right."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.525281,+-78.387806(7374)&iwloc=A&hl=en\"> mufon case (7374) map </A>","Disposition":"Insufficient Data","Date Submitted":"07/01/2007 11:00 UTC","trends":["There have been 20 other sightings in Altoona","There were no other sightings in Altoona on or around July 1st 2007","This sighting has never been favorited.",""],"Object Flight Path":"Hovering then path","Country":"United States","Region":"Pennsylvania","City":"Altoona","Case Number":"7374","Weather Factors":"None","Source":"MUFON","Latitude":"40.525281","Viewing Distance":"501 Feet - 1 Mile","Object Features":"None"}