{"Object Flight Path":"Undisclosed","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/7375.html.txt","/var/www/straped/mufon/more/7375_submitter_file1__IMG_0249.JPG","/var/www/straped/mufon/org/7375.html"],"Date of the Event":"07/03/2007 07:45 UTC","Summary":"UFO? near Stone, Staffordshire","Sighting Duration":"00:01:00","Longitude":"-2.177764","Object Features":"Undisclosed","Latitude":"53.004638","Source":"MUFON","divs":["Sighting DetailsHello. I was driving South, heading for Stone on the A34, very nearly there in fact, when I saw a dark blue metallic disk in the sky a few miles ahead. It was shiny and curved underneath with a polished metal appearance and the bottom extended to a point with a stripe of white light going straight through it and a bigger, round light on the point itself. On the top were what I can only describe as silver metal rods, there must have been hundreds of them, each extending to a spiked point. They were pretty darn beautiful actually. I got a picture but annoyingly my camera's eye perceives nowhere near the same clarity and detail of my own eye and although the UFO was successfully captured, it's so unclear that you'd be unlikely to even notice it if I hadn't ringed it in a graphics application. I'm most surprised that my camera failed to capture the sheer amount of light this thing was emanating. Instead, the light appears more like a shadow Odd! The whole sighting was over in about thirty seconds. The UFO disappeared behind a hill to my left and once I'd passed I pulled over and looked for it but it was nowhere to be seen. :( If Mufon would like to contact me regarding this sighting, feel free. I've provided my mailing address also. I have no idea what it was but I feel pretty special having seen it, and it's changed my outlook on life, the universe and everything in the mere three days that have passed since!"],"Tags":"City","Viewing Distance":"Unknown","Date Submitted":"07/03/2007 07:45 UTC","Log Number":"GB-07062007-0002","Country":"United Kingdom","trends":["There have been 8 other sightings in Stoke-on-Trent","There were 2 other sightings in Stoke-on-Trent on or around July 3rd 2007","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Region":"England","City":"Stoke-on-Trent","map":"<A HREF = \"http://maps.google.com/maps?q=53.004638,+-2.177764(7375)&iwloc=A&hl=en\"> mufon case (7375) map </A>","Object Shape":"Disc, Other","Case Number":"7375"}