{"Log Number":"US-07062007-0005","City":"E. Liberty","Disposition":"Insufficient Data","Summary":"Watched an object go west to east the across sky, approx 2 to 3 miles up.","Object Shape":"Cigar","Case Number":"7378","Source":"MUFON","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=40.331088,+-83.581892(7378)&iwloc=A&hl=en\"> mufon case (7378) map </A>","Longitude":"-83.581892","Object Flight Path":"Straight-line path","Country":"United States","Object Features":"Unknown","divs":["Sighting DetailsIt was a sunday early afternoon and I was outside with my son. He was being redeployed to Germany and came over to say goodbye. We were standing in the doorway of my overhead barn door(it faces due north)talking about the wind and wondering if my barn was going to blow away. It had been windy for the last several days in the mid-west and parts of Europe with winds in the 80mph to 125mph range for no reason. It was a very clear day with white cotton ball shaped clouds spread out against a deep blue sky.I was talking and watching this silver plane at about a 45 degree angle from us,going west to east. It seemed to be going at a normal speed. But I wasn't paying much attention to it as I was talking to my son. After about a minute it dawned on me that something didn't seem right about the jet plane. It was way to shiney, sort of like what I remember B-17 bombers and other WWII planes looked like. I noticed that I couldn't see any wings but the only way that the wings wouldn't be visable would be if it was banking, but it wasn't. That's when I noticed the rest. It had no tail and the front was shaped like the rear.. cigar shaped. It had something black in the body of it but I couldn't make it out. I tried to point it out to my son but it went behind a small cloud. I told him that the plane didn't seem right because I couldn't see the wings and tail. We waited maybe a minute or so for the object to come out the other side but over that minute the cloud disappeared and there was nothing there. My son looked at me like I was nuts. At about that moment a redish-brown jet going east to west went through that general area. I didn't think about for a week or so,I put it out of my head. When I thought about it again, I realized that the object was larger than the jet plane that had went by later on at the same altitude."],"Region":"Ohio","Weather Factors":"Unknown","Date Submitted":"05/19/2002 12:00 UTC","Tags":"City","Date of the Event":"05/19/2002 12:00 UTC","files":["/var/www/straped/mufon/html2text/7378.html.txt","/var/www/straped/mufon/org/7378.html"],"Sighting Duration":"Undisclosed","Latitude":"40.331088","trends":["There have been no other sightings in E. Liberty","This sighting has never been favorited."]}