{"Date Submitted":"07/15/1963 12:00 UTC","Sighting Duration":"Undisclosed","trends":["There has been one other sighting in Hazelton","There were no other sightings in Hazelton on or around July 15th 1963"],"Latitude":"42.5963","Date of the Event":"07/15/1963 12:00 UTC","Tags":"City","Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=42.5963,+-114.13614(7380)&iwloc=A&hl=en\"> mufon case (7380) map </A>","Longitude":"-114.13614","divs":["Sighting DetailsWhile spending the night at my friends house , we set up our sleeping bags in the back yard,guess it was around 9:00 or so, just remember it was dark outside. I remember I was getting ready to go to sleep so I took my glasses off, and put them next to me by the sleeping bag. I remember that I was just looking up at the sky while laying in my bag and something started to come across the sky right over top of us,since I didnt have my glasses on I cant say how high it was , but I could see it very well so Im guessing it was rather close. The first thing it reminded me of was a skate or stingray the way it was shaped ,It was a brownish color with No lights and moving really slow, the thing that made it remind me that it looked like a skate was, the edeges of its wings seemed to be flaping but as I looked closer the edeges were fuzzy and out of focus, sort of like waves on the water. I asked my friend whats that right there pointing to the thing, as soon as he saw it he ran into his house, I was busy trying to find my glasses to get a better look , but in my haste couldnt find them, so I just watched it move out of site over top the hedge behind me. My buddy never did come back out of the house,the only thing I cant rember is if I sleept there or walked home , but I think I walked home.."],"Summary":"ufo flew over us ,moving very slow","Object Flight Path":"Straight-line path","Object Features":"None","files":["/var/www/straped/mufon/html2text/7380.html.txt","/var/www/straped/mufon/org/7380.html"],"Disposition":"Unknown","Log Number":"US-07062007-0007","Case Number":"7380","Country":"United States","Source":"MUFON","Weather Factors":"None","Object Shape":"Triangle","City":"Hazelton","Region":"Idaho"}