{"Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Disposition":"Insufficient Data","divs":["Sighting DetailsI awoke went into the bathroom noticed a bright light through the window some leaves were still on the trees and the light was behind some large trees. I initially thought it was a full moon but as I looked it moved slowly north to south at the same altitude but was smaller and brighter than the moon. It stopped and accelerated straight down at unbelievable speed coming to a dead stop then moving at a right angle a short distance another sudden stop and then moving up extremely fast to sudden stop at the same altitude were it started from initially. It then moved away steadily at the same height till it disappeared behind some trees on a ridge. The light was approximately 300 feet high when it started these movements. We lived near the airport and this definitely was not an conventional aircraft I assume it would have to be remotely operated as occupants would not be able to withstand the extreme speed or stops of the movements. I just decided it was time to let someone know after all these years I searched the files to see if anyone else saw anything near those dates in North Carolina. I've been in the military and work for an airline but I've never seen anything like this before or since."],"Region":"North Carolina","Case Number":"7383","Log Number":"US-07072007-0001","Source":"MUFON","Country":"United States","Longitude":"-80.839497","Latitude":"35.236177","trends":["There have been 68 other sightings in Charlotte","There were no other sightings in Charlotte on or around October 24th 1996"],"Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/7383.html.txt","/var/www/straped/mufon/org/7383.html"],"Summary":"Bright white light circular in shape made some exteme right angle movements involving impossible stops and starts at extreme speed.","Tags":"City","Date of the Event":"10/24/1996 04:30 UTC","Weather Factors":"Unknown","Date Submitted":"10/24/1996 04:30 UTC","City":"Charlotte","map":"<A HREF = \"http://maps.google.com/maps?q=35.236177,+-80.839497(7383)&iwloc=A&hl=en\"> mufon case (7383) map </A>","Object Shape":"Other"}