{"Date of the Event":"09/05/1997 01:00 UTC","Viewing Distance":"Unknown","Summary":"Spotted a stationary long silver cylndrical object.","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/7389.html.txt","/var/www/straped/mufon/org/7389.html"],"City":"Levittown","Sighting Duration":"Undisclosed","Case Number":"7389","map":"<A HREF = \"http://maps.google.com/maps?q=40.728934,+-73.511492(7389)&iwloc=A&hl=en\"> mufon case (7389) map </A>","Disposition":"Unresolved","divs":["Sighting DetailsThis was early fall 1997 appx., my family and I went over to my inlaws which also live in Levittown NY., for a barbecue appx. 12pm est., there were about 10 adults and 8 preteens gathered in the backyard just playing, talking and milling about. I was talking to my brother in-law and happen to look up behind him and noticed bright cylindrical object in the distance high in the sky, as I kept looking up I saw the object was in the southern sky and was in a tilted angle, using a clock as a reference of point, the object was at appx. 11 and 4 o'clock position and was stationary,I had pointed it out to everyone,and we all started looking at it. The object seems to have been stationary and as time passed, every hour it was moving away with the horizon, by about 6pm it was pretty much out of sight,I possibly thought it was the space station that I saw, but most articles said that the space staion was not visible to the naked eye, and that week I scoured the papers for any mention of it but saw none, all the people at the barbecue saw it so I assume other people had to have seen it.Only once did I find a small mention of it on the internet, but it didn't say much about it. As to how I felt, it was an exciting moment for me, I always wanted to know if that was the space staion that I saw and if not well then I can say It was a ufo. My daughter was seven years old at the time and now at 16 still remembers seeing it. I also thought it might have been the Hubble telescope, but from the distance that we were viewing it I don't think it would be big enough to see. The object I would guess was appx. 2 to 3 inches in length from where we viewed it."],"Object Shape":"Cylinder","Object Flight Path":"Stationary","Longitude":"-73.511492","Country":"United States","Log Number":"US-07072007-0007","Region":"New York","Tags":"City","Latitude":"40.728934","Source":"MUFON","trends":["There have been 3 other sightings in Levittown","There were no other sightings in Levittown on or around September 5th 1997"],"Date Submitted":"09/05/1997 01:00 UTC","Weather Factors":"None"}