{"trends":["There have been 19 other sightings in Garland","There was one other sighting in Garland on or around July 4th 2007","This sighting has never been favorited.",""],"Date Submitted":"07/04/2007 09:00 UTC","Viewing Distance":"Over One Mile","Source":"MUFON","Case Number":"7390","Log Number":"US-07072007-0008","Latitude":"32.915934","Region":"Texas","Object Shape":"Circle, Cross, Sphere, Star-like, Triangle, Other","Weather Factors":"Unknown","Object Flight Path":"Stationary","Date of the Event":"07/04/2007 09:00 UTC","Disposition":"Unknown","Object Features":"Dome, Window(s)","Country":"United States","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=32.915934,+-96.634833(7390)&iwloc=A&hl=en\"> mufon case (7390) map </A>","Tags":"City","divs":["Sighting DetailsI was in the parking lot of a mall in the bed of a pickup wating with my camera for a fireworks show that started at 9:30. Sometimes I see a light at night I think is a star or satellite, but it looks like it changes shape from my eyes view. I noticed somethiing similar and thought since I had my camera I would take pictures to see if anything happend when I was able to get a closer look. When I first noticed it I thought it could be a star, satellite, or spacestation. The object appeared as a bright light that grew and shortened. My feelings during seeing the object was curiosity and after was wondering what it could be and astounded when viewing the pictures. In the distance behind the object pictures after picture I noticed what could be a star or planet. I used the zoom on the camera and took picture after picture only for a few seconds, but I saw the light for about ten minutes. I lost sight of the object because I took my attention to away, but in a few pictures the object doesn't look bright anymore."],"Summary":"Strange light at 4th of July event.","Longitude":"-96.634833","files":["/var/www/straped/mufon/html2text/7390.html.txt","/var/www/straped/mufon/org/7390.html"],"City":"Garland"}