{"Object Shape":"Circle, Egg, Flash, Sphere","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Source":"MUFON","Sighting Duration":"Undisclosed","Log Number":"GB-07082007-0003","Date of the Event":"05/21/2007 12:00 UTC","Date Submitted":"05/21/2007 12:00 UTC","City":"Birmingham","divs":["sighting detailsi have recorded footage on various days of what i believe is a ufo, in my videos most of the footage has been taken from my bedroom accept for the last footage which was taken from my back garden using a tripod. also during the period of 19th-24th may 2007 i have experienced seeing flashing lights which have come out of this object in the sky, this was before i just went into my local pub with my mates on the 19th may and have also witnessed as a passenger in car some sort ufo triangle craft elevating in the sky above the 3 objects which were in a triangle formation this was when my mate was driving down the m6 on the motorway on the 24th may. i have compiled all my recordings into one video. this is not the complete recording, it has been shortened to 10 minutes. please click on the link below to see: http:\\\\video.google.co.uk\\videoplay?docid=2138839065324379175 i have also seen the objects in this video above the past 2 nights, in different positions and we are now in july. would be very interested for feedback please. looking forward to hearing from you soon yours faithfully roberto pall"],"Disposition":"Unresolved","Case Number":"7393","Object Features":"Undisclosed","Region":"Alabama","Latitude":"33.526071","files":["/var/www/straped/mufon/html2text/7393.html.txt","/var/www/straped/mufon/org/7393.html"],"Tags":"City","Country":"United States","Summary":"21-24th May 2007 UFO Compilation of footage on various nights","Viewing Distance":"Unknown","trends":["There have been 48 other sightings in Birmingham","There were no other sightings in Birmingham on or around May 21st 2007"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.526071,+-86.8014(7393)&iwloc=A&hl=en\"> mufon case (7393) map </A>","Longitude":"-86.8014"}