{"Summary":"Triangle and two lights trailing it at 7:30pm in Goshen, Indiana","trends":["There have been 6 other sightings in Goshen","There were no other sightings in Goshen on or around July 7th 2007","This sighting has never been favorited.",""],"divs":["sighting detailsmy father and i were in our swimming pool, when my dad noticed something flying in the sky. my dad thought it might have been a bird or a jet airliner. (he didn't have his glasses on) all he noticed was a circle of shaded light with some kind of square lines around it. once my dad pointed the object out to me, i saw beyond the trees, for about 15 seconds, a triangle about a centimeter long. my guess was that it was about 4,000 ft. high. trailing it were 2 black dots about 2x bigger than a period in this font. the triangle itself was glowing a dark yellow. the reason we lost sight of it was because it trailed above the trees, out of our sight. it was silent and moving maybe faster than a jet airliner. i didn`t care for it at the time, and i continued swimming with my dad. but later the next day (today) my mother convinced me to write this report. \\\\ \\ \\ \\____\\ . . this is how it looked, only the triangle was shorter and stretched out at the bottem 2 points."],"files":["/var/www/straped/mufon/html2text/7394.html.txt","/var/www/straped/mufon/more/7394_submitter_file1__Goshen.JPG","/var/www/straped/mufon/org/7394.html"],"Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Circle, Triangle","City":"Goshen","Case Number":"7394","Object Features":"None","Weather Factors":"Unknown","Disposition":"Unknown","Sighting Duration":"00:00:45","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.582272,+-85.834438(7394)&iwloc=A&hl=en\"> mufon case (7394) map </A>","Source":"MUFON","Country":"United States","Region":"Indiana","Latitude":"41.582272","Log Number":"US-07082007-0004","Longitude":"-85.834438","Date Submitted":"07/07/2007 07:30 UTC","Date of the Event":"07/07/2007 07:30 UTC","Object Flight Path":"Straight-line path"}