{"Source":"MUFON","Object Flight Path":"Undisclosed","Log Number":"ID-07092007-0002","files":["/var/www/straped/mufon/html2text/7400.html.txt","/var/www/straped/mufon/more/7400_submitter_file1__alor.jpg","/var/www/straped/mufon/org/7400.html"],"City":"Alor Island,East Nusa Ten","divs":["Sighting DetailsThe UFO incident with aliens reported in Alor Islands, in July 1959. Alor islands is located in northern of Nusa Tenggara Timur province in Indonesia. A retired policeman, Alwi Alnadad said that he handled a case of some strange beings that came there which shocked the inhabitants. In that time, Alwi Alnadad was head of police office of Alor Islands area (The Alor islands consist of two big islands, Alor and Pantar island. The incident was firstly reported in Alor Island). Firstly, he didn't believe for the incident reported by some inhabitants. He even thinked that the story was non sense. But, the incident then were blew up sensationally for weeks. It was reported that some strange beings appeared in the east side of Alor Island. Their height is about 1,80 metres and their skin are reddish. Their eyes looked like human eyes and their hair are white-wavy. They wore dark blue clothes and pants with long arm and high collar, belt with a grey cylinder stick, and black military boot. Their appearing were seem to be too strange for the inhabitants. The inhabitants said that the strangers were suspicious and looked like searched for something. The inhabitants then surrounded them and shooted with arrows. Strangely, the arrows couldn't injury them. The strangers then jumped high away out of the surrounding. They disappeared and could not be traced. Some days later, a report said that some strange beings with dark blue clothes appeared in a village in southern Alor Island. There were six people which had same characteristics with what reported days before. Some of them have beard. Another report were came from Pantar Island (west Alor Island). Some inhabitants said that the strange beings searched for something unclear. Next days later, a village in east of Kalabahi city was stired with story that a villager was kidnapped by some people with dark blue clothes. The villager just went down from a sugar palm (enau) tree and he saw some beings surrounded him. He tried to run, but these strange people then pointed frontward their cylindric stick to him. Soon he became paralyzed. He heard they spoke to each other that he could not understand the language. One of them showed him a circle thing like alarm clock. He was asked to watch the thing that he could see anything far away from it. He thinked it didn't make sense because there are jungle and high hills stretched in front of him. He then realized that the strangers want to made him as a guide. Not for so long he then be released. In the next day, a six-year-old kid was kidnapped by the strangers. Some inhabitants found him in the field frightened and confused. The location of the villages which the stories reported were distantly apart and the inhabitants didn't recognize each other. But the report seemed to be the same.The police then took the case seriously, even it was blew up by some people. The case is described as disturbed the people of the villages. Then, some policemen commanded by Alwi Alnadad were run and ready to arrest them dead or alive! The place where a kid was kidnapped were surrounded by the police in every angle. It because the reports said that the strangers appeared from there. In the midnight (around 00.00 am), some sound of fire explosion broke the silence. The strangers who were waited appeared. The strangers were in 13 metres away from the policemen. The policemen then shooted them unisonly. But strangely, no blood found in the place where the strangers stood, even dead body. The shoots were very close and came from every angle that somebody should injured or even dead. The police only found some trees fell down and footprints that only five metres in the distance and then ended. They have no idea how come the strangers disappear. After the incident, there are many inhabitants saw a white-glowing oval flying object flew above the sea with high speed. It flew over the beach from west to the east side. After that, the story was slowly forgotten and still not be exposed yet. Source book: Salatun, J. (1982). UFO: Salah Satu Masalah Dunia Masa Kini {UFO: One of World Problem in Present Day). Jakarta, Yayasan Idayu (Idayu Foundation), page 49-51."],"Date Submitted":"06/30/1959 12:00 UTC","Country":"Indonesia","Tags":"City","Viewing Distance":"Unknown","Object Shape":"Oval","Latitude":"-8.24815","Date of the Event":"06/30/1959 12:00 UTC","Summary":"UFO and six aliens appeared in Alor Island, Indonesia (1959)","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=-8.24815,+124.75475(7400)&iwloc=A&hl=en\"> mufon case (7400) map </A>","Region":"Nusa Tenggara Timur","Weather Factors":"Unknown","Longitude":"124.75475","Object Features":"Undisclosed","Case Number":"7400","trends":["There has been one other sighting in Alor Island,East Nusa Ten","There was one other sighting in Alor Island,East Nusa Ten on or around June 30th 1959","This sighting has been favorited 1 time.",""],"Sighting Duration":"Undisclosed"}