{"Source":"MUFON","City":"North Myrtle Beach","Object Flight Path":"Straight-line path","Latitude":"33.831839","Country":"United States","Longitude":"-78.633903","Tags":"City","Sighting Duration":"00:00:13","Viewing Distance":"Over One Mile","Summary":"Light silver object flew from south to north in clear eastern sky . Studied it for approximately 12 seconds. Beautiful silver seemed almost to shimmer.","Weather Factors":"Unknown","Date of the Event":"05/01/2007 01:40 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.831839,+-78.633903(7401)&iwloc=A&hl=en\"> mufon case (7401) map </A>","Case Number":"7401","Object Features":"None","Region":"South Carolina","Object Shape":"Cylinder","Date Submitted":"05/01/2007 01:40 UTC","files":["/var/www/straped/mufon/html2text/7401.html.txt","/var/www/straped/mufon/org/7401.html"],"Log Number":"US-07092007-0003","Disposition":"Unknown","trends":["There have been 24 other sightings in North Myrtle Beach","There were no other sightings in North Myrtle Beach on or around May 1st 2007"],"divs":["sighting detailsi was seated at a table outside a starbucks located on u.s. hwy 17 (kings hwy) in cherry grove,sc. this hwy runs north\\south along the south carolina coastline (myrtle beach areas, etc.). i was seated, facing east approximately 1 mile from the beach. the building was a few feet away on my right. as i drank my coffee, i glanced up (for no particular reason). the object caught my eye as it came into view from south of the building. i almost looked away (expecting it to be a jet aircraft) but instantly saw that it was different. first i will describe it. light silver in color. no wings. no tail section. no colors. no writing. shape of tube or cylinder. no lines (such as windows, doors). no contrails, no exhaust, no noise. no other objects were in the eastern sky. beautiful, light silver color. it had a slight shimmering appearance (similar to heat waves coming from a hot road). i studied it for approximately 12 seconds. during that time it never varied its speed, attitude, altitude or heading (that i could tell). it was about 55-60 degrees off eastern horizon, headed north, almost like following the coastline. i could not take my eyes off of the object. i stood up and moved around the table, blinked my eyes, removed and replaced my sunglasses. i was seeing the object clearly, as it was. there were others sitting outside starbucks, on the eastern (front) side of the building, just around the corner from me (perhaps 30 feet away). in a split second i realized that getting their attention so that i could have witnesses ( to what i was seeing ) really did not matter to me. i did not want to take my eyes off of it. it headed out of sight in a northern direction. i was amazed ...and glad i got to see this. i am hoping someone else on the eastern coast saw this object. i know what this wasn't. i just don't know what it was. i am thankful it appeared in a blue sky, and the middle of the afternoon."]}