{"Object Shape":"Sphere","Weather Factors":"Unknown","Source":"MUFON","Date of the Event":"07/08/2007 12:00 UTC","Date Submitted":"07/08/2007 12:00 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/7404.html.txt","/var/www/straped/mufon/org/7404.html"],"Longitude":"-1.474619","Log Number":"GB-07092007-0006","Viewing Distance":"Unknown","Object Features":"Undisclosed","trends":["There have been 4 other sightings in Derby","There were no other sightings in Derby on or around July 8th 2007"],"Object Flight Path":"Undisclosed","Summary":"Silver sphere.","City":"Derby","Country":"United Kingdom","map":"<A HREF = \"http://maps.google.com/maps?q=52.92253,+-1.474619(7404)&iwloc=A&hl=en\"> mufon case (7404) map </A>","Region":"England","Disposition":"Unresolved","divs":["Sighting DetailsWhile outside having my last cigarette and allowing the dog to go pee before bed, I watched a silver sphere silently float along from the hills in the distance toward my back yard at a height of about 100 m from the ground, the sphere moved level with me at a distance of about 100 yrds away and carried on in a straight line toward the other horison a distance of about 20 miles. I went to my upstairs room to continue watching the object, It was about the size of a compact car (bmw mini sized) and completely silver (possibly brushed steel appearance) it was un affected by wind (gentle breeze blowing) and made no noise. It moved in a staight line from when i started to observe it.And did not change hight from the ground or speed.(height and speed were constant) Although the dog did not see the object , he bayed to go into the house and scratched at the door i was standing by (which was closed) to go in the house. just prior to me loosing sight of the object and going into watch from an upstairs room. Something i find unusual as the dog usually gets pre occupied sniffing for cat evidence in the garden, he is usually keen to stay out as long as possible, not wanting to come in when called. I have seen the same object many years ago and recall seeing this or a similar object in the late 1980s while on holiday with my parents in southern england, while travelling on the highway (motorway).on this ocasion it passed over a service area in a similar quiet constant speed and height fashion, only being seen by my family, several hundred people at the area did not notice the object. And i do recall it passing over the motorway over a truck which must have created huge draft at high speed, but the object was un moved. I live in a densly populated area,in a row of old town, terraced houses.(the houses are around 200 yrs old an all occupied.) The incident happened aound 15 mins ago.I could hear neighbours talking at the time through an open window about 2 mtrs from where i was standing. We have had thunder storms today although there are none at present, the weather is breezy and cloudy.It is fairly dark and the moon is the other side of the house to where i saw the object. I noticed several high altitude plains travelling with landing lights flashing which were much much higher than this object. The onject did not appear to have any effect on local street lighting which it passed over, however i noticed at the time that several evening birds suddenly stopped tweeting as it passed by. I could also hear a police siren in the distance on the busy main road about 500 yeards away and heard the 11 oclock train pass by on the rail line about 200 yeard from my home. The time outside lasted around 45 seconds then i watched the object from upstairs for maybee another 20 seconds , before i lost sight of it. I have just noticed that all the digital clocks in the house, microwave , cooker,and the video have started flashing as though there has been a power outage although i didnt notice this at the time, and may be unconnected."],"Case Number":"7404","Tags":"City","Latitude":"52.92253"}