{"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.529992,+-122.671147(7408)&iwloc=A&hl=en\"> mufon case (7408) map </A>","City":"Portland","Viewing Distance":"Unknown","Region":"Oregon","Source":"MUFON","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Date Submitted":"07/09/1947 05:00 UTC","Longitude":"-122.671147","divs":["Sighting DetailsI was about six, and my father and I were going to the top of 49th st, which was the highest point in our neighborhood, and I got to sit on his shoulders. I don't know how everyone knew a flying saucer was going to be in the sky, but the dads were on the hill which was most unusual. We waited and the men were laughing standing thinking they were going to see a flying saucer, and then there it was, silver, and the dad's decided it must be the sun reflection on the object. We all watched this thing that went from east to west, higher than anything we had ever seen in the sky. No noise, not moving all that fast, but faster than a plane of the time, so we watched it move over the sky for about 4 to 5 minutes. We were in awe, no one spoke and when it was gone, the men said, wow, do you believe what we just saw, it wasn't a joke, but no one was afraid, and everyone was asking each other \"well, what the hell do you think that was?\" I am not sure what my dad thought, but I was sure I had seen flying saucer. Now, UFO had not been coined then and the old radio shows had flying saucer all the time, so I don't think anyone was that impressed. We went home and my mother said, well, fool did you see a flying saucer, and my dad said yes we had and then he laughed, and described it to her. so at 6yrs old, I can't tell you how it was received, we all clapped, and yelled at it, but I never knew if everyone wanted to admit that they thought it was a flying saucer. I do know that somehow my father knew it crashed. He was mostly an information gatherer. He told me the saucer we saw had crashed, and it was not mentioned again. I of course was crushed knowing that it would not be back. Jane Hart"],"files":["/var/www/straped/mufon/html2text/7408.html.txt","/var/www/straped/mufon/org/7408.html"],"Log Number":"US-07092007-0010","Case Number":"7408","Tags":"City","Sighting Duration":"00:05:00","Date of the Event":"07/09/1947 05:00 UTC","Object Shape":"Sphere","Country":"United States","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around July 9th 1947"],"Disposition":"Unresolved","Summary":"observation of flying saucer","Latitude":"45.529992"}