{"Object Shape":"Square, Rectagular","Latitude":"38.367817","Date of the Event":"03/01/1964 10:30 UTC","trends":["There have been 3 other sightings in Great Bend","There were no other sightings in Great Bend on or around March 1st 1964"],"Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Log Number":"US-07122007-0002","divs":["Sighting DetailsWhen we lived in Kansas in the early 1960s as small children. We used to live on the North end of Great Bend, Kansas on the North end of Morton St. One night in 1964 or 65, I looked out of the kitchen window and saw a White cube that glowed like a light bulb. It was a perfectly shaped cube and not at all blurry. It had a red light glowing on the inside of it and the outer surface seemed to glisten. There are or were quite a few radio towers there and one huge TV 2 tower farther to the North. The cube shaped thing flew around that radio tower like a moth flies around a light bulb of all things, only slower than a moth and it never hit the tower. I ran to get my dad but he said don't brother him right now. So I ran back to the kitchen yelling for my two brothers to come here. When I got back to the window it was still flying near the tower. Just before my brothers got to the window it came across the field then towards me and it started hovering around 75 feet above the ground maybe 200 yards away. That is when my two brothers made it to the window and started saying what is that, what is that? Also, I might add that the red light was fading on an off like the tower light was. I believe perhaps it was trying to communicate with it. Then it spun so fast that it turned into a ball and in a white streak it went almost straight up but at a little angle towards the North west and was gone. We saw what we saw so because of that I know we are not alone. Sure makes you wonder why that thing was flying around that radio tower? I can also tell you that well we did anyway, still had black and white TV as it was still the early years for TV. The large TV 2 tower first broadcast was Nov. 28, 1954. Just for the fact that signals can travel at the speed of light and maybe it too could travel at or near the speed of light too. Then maybe it could have came from a near by star system that would be within 5 or 6 light years from us? But if it was a craft or a type of probe that was just passing by then who knows where it could have came from? Another possibility is that, what if it was some type of life form itself? And it roams the cosmos like the buffalo roomed our prairies long ago? I have done my homework on about everything it could have been and my conclusion is that it was extraterrestrial, why? Because the thing I saw showed intelligence and there is no doubt about it. I know it was looking at things by the way it was behaving. At the North end of the street was a wheat field then to the North edge of that about 1 mile is the Dry Walnut Creek and on the North edge of that was the radio tower. The radio tower was around one and a quarter mile from the kitchen window where I first saw it. The houses including ours 15 houses or so lined up along the wheat field east and west. The houses that are there now in the field were not there back then. Here is the part that I did not include, when I got back to the window it just moved off the tower and was spinning (like a white glowing box spinning) it was spinning towards the South southeast towards town. Then it turned toward the West very quickly and staying over the field run along the row of houses staying out over the field around 200 yards or so and up in the air like I said around 75 feet. When it saw me looking out the window like I said, it stopped and that is when my 2 brothers made it to the window and started saying what is that, what is that? To me that shows a form of intelligence don't you think? It was about the size of a small box truck like but it might have been a little smaller? This is all a true story and I wanted to share it. We were young when we seen this but we knew it was very strange."],"files":["/var/www/straped/mufon/html2text/7417.html.txt","/var/www/straped/mufon/org/7417.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.367817,+-98.761667(7417)&iwloc=A&hl=en\"> mufon case (7417) map </A>","Case Number":"7417","Region":"Kansas","Disposition":"Unknown","City":"Great Bend","Tags":"City","Weather Factors":"None","Longitude":"-98.761667","Country":"United States","Viewing Distance":"101-500 Feet, Over 1 Mile","Object Features":"Unknown","Date Submitted":"03/01/1964 10:30 UTC","Summary":"Great Bend, Kansas UFO","Sighting Duration":"Undisclosed"}