{"Country":"United States","Region":"Oregon","Sighting Duration":"Undisclosed","Log Number":"US-07122007-0003","Case Number":"7418","Viewing Distance":"Unknown","Latitude":"42.331945","Object Features":"Other","Summary":"Disc-shaped UFO with 5 large windows that I saw appear then vanish in 2005.","Longitude":"-122.872985","Object Shape":"Disc","files":["/var/www/straped/mufon/html2text/7418.html.txt","/var/www/straped/mufon/org/7418.html"],"Source":"MUFON","trends":["There have been 34 other sightings in Medford","There were no other sightings in Medford on or around November 30th 2004"],"Date of the Event":"11/30/2004 12:00 UTC","Object Flight Path":"Other","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.331945,+-122.872985(7418)&iwloc=A&hl=en\"> mufon case (7418) map </A>","City":"Medford","divs":["sighting details in the summer of 2005, i was walking my two dogs, facing the southern sky. i was 13 years old and it happened in the late afternoon\\early evening. it was on a street in medford, oregon. i was almost at the end of the street. where i was walking i could see the natural geological formations, the table rocks. i was looking around, enjoying the day, when i saw the ufo. it was disc-shaped with 5 large windows going horizontally across it. it was just hovering in the sky. it was not close; however i'm not a good judge of distance so i can't really say how close it was to me. i wondered if it was indeed an ufo. perhaps it was a reflection off of a mirrored surface, i just don't know. i've come to believe it was an ufo but i understand completely that i could be wrong. i try to not let my x-files dvds bias me. the craft just hovered there. i thought it might be a helicopter but this thing wasn't moving at all. a car was turning onto the street i was on so i had to quickly grab my dogs' leashes. when i looked back, i swear that the craft had managed to move about 100 ft. in just a few seconds without making noise. the ufo hovered for about 3 minutes total then from the two most outer windows it slowly vanished. i've thought that maybe it was just a reflection of sunlight, vanishing because the sun was going down. but the sun was still quite above the horizon. during my viewing of this craft i felt excited and curious. i wasn't afraid. it seemed to pose no threat and, like i said, it simply disappeared. i've only told 3 or so people and now i'm 15. i still live in medford, or. this has been my only personal viewing of an ufo."],"Date Submitted":"11/30/2004 12:00 UTC","Tags":"City","Disposition":"Insufficient Data"}