{"Date of the Event":"06/24/2003 12:00 UTC","Country":"United States","Longitude":"-88.540607","Object Flight Path":"Undisclosed","Summary":"small UFO in the Shawnee National Forest","Region":"Illinois","Weather Factors":"Unknown","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/7420.html.txt","/var/www/straped/mufon/more/7420_submitter_file1__picture_a.jpg","/var/www/straped/mufon/more/7420_submitter_file2__picture_b.jpg","/var/www/straped/mufon/org/7420.html"],"trends":["There have been 13 other sightings in Harrisburg","There were no other sightings in Harrisburg on or around June 24th 2003","This sighting has never been favorited.",""],"Date Submitted":"06/24/2003 12:00 UTC","Tags":"City","Sighting Duration":"Undisclosed","Source":"MUFON","Viewing Distance":"Unknown","Object Shape":"Oval","Disposition":"Unknown","Case Number":"7420","City":"Harrisburg","map":"<A HREF = \"http://maps.google.com/maps?q=37.738381,+-88.540607(7420)&iwloc=A&hl=en\"> mufon case (7420) map </A>","divs":["Sighting DetailsOne night in June, a friend of mine and my nephew hiked into the Forest for a night of camping.We got to the backpackers parking lot around 10:00PM and hiked for about 1 hour into the forest. Nothing unusual was happening, we set up camp and ate our dinner. My friend was playing his guitar and my nephew had already went to sleep in his own tent. Around 11:30 I started saying to my friend \" I feel very strange, I feel as if something enormous is about to happen in the world\" These were my exact words and I felt very strange almost dizzy and light headed. We then hear coyotes yelping and getting very close to us, then silence and as I shined my flashlight into the woods I could see their eyes reflecting the light. This really spooked us since I had already felt strange prior to hearing the howling of the coyotes. They did not harm or get close to us but we were still spooked so we decided to get into the tent to go to sleep. We were sleeping top to tail, I was at the opposite end of the tent and after a few minutes my tent mate wakes me up saying that he saw lights (headlights) shining through the top of the tent and that my face and chest were specifically illuminated. We both get up and open the tent window to see a bright amber orange light shining directly at us about 20 feet away. I panic thinking someone is here to cause us harm and then I notice the light begins to slowly move upwards into the tree tops and I then noticed 2 more lights of the same color but were smaller. There was a large center light and 2 smaller lights on each side of the larger center light. I get out to take a closer look and I notice that as this thing comes down again it is actually small car tire sized little craft of some sort slowly moving up, down to the left, right and sometimes hovering in place for a few seconds and then moving again.It's movements were very slow and smooth as if gliding on ice. At first we were both almost frozen with fear but after a few minutes I got the feeling that everything was ok and that whatever this thing was it was not going to hurt us. We continued to watch if for about 1 hour and at then we became so tired we went right to sleep. The very next morning we wrote down and drew pictures of what we had seen. We both saw this thing and it was clearly a small little craft with 3 lights. I don't know what it was or where it came from but I saw it. I am not looking for any kind of attention I just want to report what I saw so that if anyone else has seen something like this maybe they will come forward and report it. This is for real and the leaders need to come clean!! Thanks"],"Latitude":"37.738381","Log Number":"US-07122007-0005"}