{"Latitude":"53.729198","Object Flight Path":"Undisclosed","Source":"MUFON","Date of the Event":"07/12/2007 05:06 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=53.729198,+-127.644251(7422)&iwloc=A&hl=en\"> mufon case (7422) map </A>","Longitude":"-127.644251","Object Shape":"Square, Rectagular, Star-like, Unknown","Country":"Canada","Date Submitted":"07/12/2007 05:06 UTC","Tags":"City","City":"Undisclosed","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/7422.html.txt","/var/www/straped/mufon/org/7422.html"],"trends":[],"Summary":"Sighting in Prince George, BC, Canada","Viewing Distance":"Unknown","Disposition":"Unresolved","Object Features":"Undisclosed","Log Number":"CA-07132007-0001","divs":["Sighting DetailsAt 5:06 Pacific Time, I saw was outside our house having a smoke and a bright object in the northeast caught my eye. I thought it was a glider or hot air balloon. When it moved to the south after 15 minutes of watching it, I thought it was a planet. I checked the 'day' sky charts and no planets were in that area. When I went outside 10 minutes later it was gone. I attributed it to high cloud cover. Then, I went outside again after 30 minutes and I saw it move from the area I last saw it and it streaked southwest within 5 seconds over the horizon. 5 minutes later it was where I last saw it. It moved 3 times to the south west from the original position. The fourth time it did this, it was approaching the horizon, then it moved upwards towards my zenith and disappeared. The next time I saw it, it was south of south west, then it did the same thing 3 times as before. It kept moving west. So, I asked my son to come out and look at this object at least 4 times during all of this. He saw it and asked, \"what is it?\" I couldn't give him an answer. We saw it move to the south west twice. I decided to look to the west and my son and I saw at least 12 different object flying around \"near\" the Sun. The brightness they gave off was unusual because most objects, like birds, planes, etc have shadows when you view them against the Sun. My son has better vision than I have (he has 20-10 vision from the last eye exam), and he saw 3 engines on each of them. We watched these objects dance around. Two objects were rectangular and rotated as they moved. The last time I saw one of the objects was around 8:11 PM Pacific Time. There were so many of them that we lost count. Based on the behaviour of these objects, I can only deduce that there was a conscious force involved because all the \"fluffies\" floating around near our house was not moving as the same as these objects. The wind speed was near nil. A lot of these objects moved and disappeared to the south. From the first one that I saw, almost all were located in the West. I kept checking all around the sky to see if there was any other activity going on. There was none. These objects congregated around the vicinity of the Sun in the sky. There have been reports of crop circles in our area over the years, especially around Vanderhoof, BC. If anyone has connections here in my area, please look into it. It was unreal that these objects were brighter than the Sun and any other objects I saw in the sky. One thing to note. A single propeller plane flew northwest over my house and one of these bright lights looked like it was intercepting the plane's course. The last time I encountered something like this was when I was 5 years old. The bright object flew over our truck as we were driving home, late at night. It didn't have a sound at all and it was moved very fast."],"Weather Factors":"Unknown","Region":"British Columbia","Case Number":"7422"}