{"trends":["There have been 45 other sightings in Long Beach","There were no other sightings in Long Beach on or around July 11th 2007"],"Date Submitted":"07/11/2007 04:45 UTC","Source":"MUFON","Date of the Event":"07/11/2007 04:45 UTC","Country":"United States","Log Number":"US-07132007-0004","Weather Factors":"None","Region":"California","Summary":"Flashing Flying Disc","divs":["Sighting DetailsOn July 11th 2007, at around 4:45pm, i was on my way to work in Long Beach California from my home in Cypress California. I was driving down Wardlow street just before you start to drive through El Dorado Park, when i was briefly blinded by an extremely bright, silver object in the sky in front of me. if i held my hand up toward the windshield, it would have been around the size of my thumb. After the bright flash stopped, i thought i was looking at a large metal blimp but then, as i was looking at it, it disappeared. a second or two later, the flash happened again, this time when the flash stopped, it looked like a disc shaped fling saucer or something. I became scared a bit, but put on the brakes anyway to watch it. it didn't seem to be moving during the whole encounter until now the front end (or the end on my left hand side) rose up a bit. it seemed to drop down a little. after that, it flashed again, disappeared, came back, flashed again, then disappeared for good. i sat there looking all over it and couldn't see it anywhere. I proceeded to head to work and called my wife. i was a little overwhelmed when i called her. after i told her i felt very stupid. i then told some others at my job and felt stupid then too. i know there is an airport in long beach. i tried to tell myself that that is what i saw, that i just saw a weird plane maybe. but i honestly cannot account for what i saw. i was never going to talk about it again until my wife place the laptop on my lap opened to this page. she really wanted me to share, i just don't know what i saw. it wasn't a blimp and it wasn't a plane. i do feel stupid still and now i know why people don't come forward when they see something."],"Longitude":"-118.155686","Object Shape":"Blimp, Disc, Flash","Disposition":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/7425.html.txt","/var/www/straped/mufon/org/7425.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.809457,+-118.155686(7425)&iwloc=A&hl=en\"> mufon case (7425) map </A>","Object Flight Path":"Stationary,Other","Latitude":"33.809457","Case Number":"7425","Viewing Distance":"Unknown","City":"Long Beach","Object Features":"Dome"}