{"divs":["Sighting DetailsFirst let me thank you for allowing me to express my self obout my sightings.I have a hobby I love to fly home made kites since my childhood so ever since I can remember I have been seeing this ufo's so I use my kite as reference to spot them more easily so my last sighting happened when I was cleaning the front porch after A while took a break with my binoculares began to just scan the sky within ten minutes I spotted them by theway it was quite windy so this objets were no ballons I know if you watch them long enough you can actually see them change shapes yes I said shapes even colors from bright red to orange from white to silver and some times something drops from them I dont know what it is but is sphere shaped but smaller. if anybody is curious about what I am seeing please contact me any time after 4pm I'll be glad to talk to you. as to what I was thinking all I could say as I was watching them was wish tracy could come and see this tracy is my girlfriend she has seen them quite often also she could tell you some stories about the same objets that I see when I first met her I told her obout this things that I have been seeing so one time me and her went to A nearby school to fly one my kites she stayed inside the van reading A book while I flew my kite obout ten minutes later I called her to come over to where I was laying on the ground I asked her to look with the binoculares at the kite then I told her to look just to right of the kite I asked her what do you see her jaw dropped then she asked me what the heck is that joking I answer her I dont see nothing then I said to her that is what I have been seeing all the time now you know thank you very much and we have see them all the time after that I am used to seeing them I would like very much to talk to mufon soon thank you ."],"Summary":"I saw three 3 silvery spheres just motionless then two more then they just vanished. to whom it may concern I see them all of the time if you are interested in seeing them let me know I will show you how thank you.","Object Features":"Undisclosed","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/7432.html.txt","/var/www/straped/mufon/org/7432.html"],"Weather Factors":"Unknown","Log Number":"US-07132007-0011","Object Shape":"Sphere","Sighting Duration":"01:50:09","Case Number":"7432","Longitude":"-117.075896","trends":["There have been 11 other sightings in Chula Vista","There were no other sightings in Chula Vista on or around May 20th 2007"],"Date Submitted":"05/20/2007 10:22 UTC","Latitude":"32.642594","Country":"United States","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=32.642594,+-117.075896(7432)&iwloc=A&hl=en\"> mufon case (7432) map </A>","Object Flight Path":"Undisclosed","Source":"MUFON","City":"Chula Vista","Disposition":"Unresolved","Tags":"City","Date of the Event":"05/20/2007 10:22 UTC"}