{"Object Flight Path":"Path with directional change","Disposition":"Unresolved","trends":["There have been 2 other sightings in Hope","There were no other sightings in Hope on or around July 15th 1998"],"Sighting Duration":"01:00:00","Latitude":"49.385063","Date Submitted":"07/15/1998 10:00 UTC","Summary":"Super Fast Star Like Object","map":"<A HREF = \"http://maps.google.com/maps?q=49.385063,+-121.441153(7433)&iwloc=A&hl=en\"> mufon case (7433) map </A>","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/7433.html.txt","/var/www/straped/mufon/org/7433.html"],"Date of the Event":"07/15/1998 10:00 UTC","Viewing Distance":"Unknown","Region":"British Columbia","Weather Factors":"Does Not Apply","Case Number":"7433","Longitude":"-121.441153","Log Number":"CA-07132007-0012","divs":["Sighting DetailsWhile on a road trip with my husband we decided to stop for the night near Hope B.C Canada and just take our sleeping bags into the forest next to the highway. It was a warm, nice night with a very clear sky. When we had found a comfortable spot on the forest floor we lay on our backs and looked at the stars through the open canopy in the trees. This is when we saw what looked like a star but moving very fast and changing directions instantly. It could cross the whole night sky in a blink and was very graceful. There is no way this was a satelite,plane or anything else of that sort as its speed was immense and its agility like nothing else. My husband had seen these earlier with a co-worker in Langley B.C Canada but I had missed that experience so it was a delight to finally see them for myself. I think we must have watched it dance in and out of our line of vision for a very long time as we fell asleep talking about it. Part of me didnt 100% conclude it was anything alien until a few years later when I read other peoples descriptions of what is sometimes referred to as fastwalkers. It was exactly like those. Since then I have noticed them at on at least two other occasions in BC Canada and have talked to people who have described the exact same thing to me without me communicating my story to them first,indicating a tantalizing truth!"],"Country":"Canada","City":"Hope","Tags":"City","Source":"MUFON","Object Features":"Unknown"}