{"map":"<A HREF = \"http://maps.google.com/maps?q=6.235925,+-75.575137(7442)&iwloc=A&hl=en\"> mufon case (7442) map </A>","Latitude":"6.235925","Viewing Distance":"Unknown","Weather Factors":"Unknown","Case Number":"7442","Date of the Event":"11/30/1989 12:00 UTC","Sighting Duration":"Undisclosed","Region":"Antioquia","Object Shape":"Other","City":"Medellin","Tags":"City","Country":"Colombia","trends":["There have been 13 other sightings in Medellin","There were no other sightings in Medellin on or around November 30th 1989"],"Log Number":"CO-07152007-0002","divs":["Sighting Detailswhen I was about 18 yrs old I was living in Colombia, some friends and I had always been very into metaphysics and all subjects related to the power of the mind. we, as probably every person in the world had wonder about life in other planets and the idea of contacting them and we wanted to get facts that might solve some questions. we ( 3 friends and I ) went on an a flat roof of a house laid down drawing a circle with our bodies and joining hands formed a complete circle. We began to meditate talking in our minds in a complete calm state to any being that might get our message, asking them to contact us or give us a signal. after about 15 minutes of doing this one of my friends said out loud \"we will open our eyes on the count of 3, Signal us, Signal us, Signal us\" we counted to 3 and then a second went by; I was thinking well that was a waste of time hehehhe and before that thought in my mind was finish we all saw in the sky \"3 shooting stars\" one after the other in the same spot on the sky. I am no specialist in stars or anything like that but that was what it look like to our eyes. I share this story with you hopping that my experience my inspire some one else to do the same and perhaps achieve more or something different."],"Object Flight Path":"Undisclosed","Source":"MUFON","Disposition":"Unresolved","Date Submitted":"11/30/1989 12:00 UTC","Summary":"Signaled when meditating","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/7442.html.txt","/var/www/straped/mufon/org/7442.html"],"Longitude":"-75.575137"}