{"map":"<A HREF = \"http://maps.google.com/maps?q=40.495397,+-86.125453(7447)&iwloc=A&hl=en\"> mufon case (7447) map </A>","Country":"United States","Region":"Indiana","trends":["There have been 61 other sightings in Kokomo","There were no other sightings in Kokomo on or around May 24th 2007","This sighting has never been favorited.",""],"Summary":"May 24th, 2007 in Kokomo at Meijers parking lot...6 bright lights in west sky by Venus","Object Shape":"Circle, Oval","Weather Factors":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Object Features":"None","divs":["Sighting DetailsI was sitting in the Meijers parking lot in Kokomo, on May 24th. I was talking on my cell phone, facing west. It was about 9:25pm. I was looking at Venus, and it wasn't quite dark yet, and a little cloud cover. All of a sudden a bright light appeared below Venus...then it shot straight above Venus. Then 5 bright light appeared in a diagnial line to the right of Venus and the first light. I just knew it couldn't be planes or helicoptors, balloons etc. I'm a photographer, and dropped the phone, and grabbed my camera. By the time I got out of the car, they had dissapeared. So I didn't get a picture at all. I had hung up on my girlfriend, and when I called her back, I had to leave her a message on what happened. She got a kick out of it, and I think she still has my message on her phone. Which also has the exact time. I just had another experience on July 10th, which I will submit next. I have a picture on that one that I took in Tipton Co."],"Object Flight Path":"Hovering then path","Viewing Distance":"Over 1 Mile, Unknown","Log Number":"US-07152007-0007","Date Submitted":"05/24/2007 09:25 UTC","Longitude":"-86.125453","Tags":"City","Case Number":"7447","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/7447.html.txt","/var/www/straped/mufon/more/7447_submitter_file1__Kokomo.jpg","/var/www/straped/mufon/org/7447.html"],"City":"Kokomo","Latitude":"40.495397","Date of the Event":"05/24/2007 09:25 UTC"}