{"divs":["Sighting DetailsI'm a photographer, and take quite alot of storm pictures, and sunset pictures etc. I've been doing this for the last 30 years. On July 10, 2007,about 9:25 pm, I was taking sunset pictures from my deck. I was facing west, and there was a cloud. The sun was down on the horizon behind the cloud. I took 10 to 15 shots. I came in and put the camera down. I was using my digital. I watched tv for about 2 hours, and decided to look at the pictures before I went to bed, to see if I got anything worth keeping. I wondered what in the world that big white spot was on one of the pictures. I loaded the pictures in my computer, so I could crop and zoom in on the subject. I also used a solarizing technique on it too. I'm going to try to send the picture on here so you can see it. I do not remember seeing the object as I was taking the picture. It must have went in and out real fast. I also have a picture (the one right before the white light) that shows a little faint spot that might be the same thing behind the cloud, but that is very questionable. It was midnight when I found the light on the picture, and didn't go to bed till 2am, and then couldn't sleep at all. I had a sighting on May 24th, which I posted on here, and this light, looked to be the same thing I saw before, but alot closer. The other sighting, was at Meijers in Kokomo. When I see the picture, I just can't believe I didn't see it through the viewfinder on the camera at the time I took it. It's so obvious. It's just weird, to see something two different times in like 6 weeks. Now it's kind of taking up alot of my time, because I keep looking west at the same time every night, and have a feeling of being watched. I spend alot of time now researching, that I didn't do before. Anyway I hope this picture goes through for you to see. If anyone has a good explaination, I'd love to hear it!"],"Disposition":"Unknown","Tags":"City","Object Shape":"Disc, Oval, Sphere","Date Submitted":"07/10/2007 09:27 UTC","Case Number":"7448","Latitude":"40.28226","Region":"Indiana","Date of the Event":"07/10/2007 09:27 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.28226,+-86.041098(7448)&iwloc=A&hl=en\"> mufon case (7448) map </A>","Object Features":"Undisclosed","Source":"MUFON","Country":"United States","files":["/var/www/straped/mufon/html2text/7448.html.txt","/var/www/straped/mufon/more/7448_submitter_file1__ufo-natural.jpg","/var/www/straped/mufon/more/7448_submitter_file2__enlargedanddarkenedalittle.jpg","/var/www/straped/mufon/more/7448_submitter_file3__ufo-enlargedsolarized.jpg","/var/www/straped/mufon/more/7448_submitter_file4__100_0594.JPG","/var/www/straped/mufon/org/7448.html"],"Sighting Duration":"Undisclosed","Summary":"I was taking sunset pictures, and got something else I hadn't planned on.","City":"Tipton","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Log Number":"US-07152007-0008","trends":["There have been 2 other sightings in Tipton","There were no other sightings in Tipton on or around July 10th 2007","This sighting has never been favorited.",""],"Longitude":"-86.041098"}