{"City":"Vaudreuil near Montreal","Region":"Quebec","Country":"Canada","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Object Shape":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Latitude":"45.51264","Tags":"City","Date Submitted":"06/30/2007 11:30 UTC","Date of the Event":"06/30/2007 11:30 UTC","Log Number":"CA-07152007-0011","Object Flight Path":"Hovering then path,Unknown","Source":"MUFON","Longitude":"-73.680245","Case Number":"7451","Summary":"Vaudreuil Quebec strange colored lights emenating from a low cloud","map":"<A HREF = \"http://maps.google.com/maps?q=45.51264,+-73.680245(7451)&iwloc=A&hl=en\"> mufon case (7451) map </A>","Weather Factors":"Does Not Apply","trends":["There have been no other sightings in Vaudreuil near Montreal","This sighting has never been favorited."],"Disposition":"Unresolved","divs":["Sighting DetailsI want to Report an unidentified aerial phenomenon. On June 30,07 I witnessed along with a friend a very strange light emanating from a cloud near my house in Vaudreuil,Quebec within a few kms from Montreal. First let me start by saying I am very experienced with auroras (been tracking them for years) I am also an amateur astronomer, I have experience with aircraft and flight and have a sound knowledge of weather. What I saw along with my friend that night I cannot explain.I ruled out lights from a plane,fireworks,auroras,lightning and static discharge. It was around 11:30 pm, we just finished looking at the moon through my telescope and I was looking out at the night sky when I saw this cloud southeast from my home,it looked close and had just been over the house so I know it was a low cloud by the speed it was travelling.I thought it was pretty against the light of the almost full moon. All of a sudden, the cloud turned red with a little orange tint then pulsed to blue and then changed to green. It lit up the whole cloud telling me that whatever was creating this light was big. The light lasted about 4 seconds and turned off. I then yelled to my friend to come see what I just saw and miraculously the light re-appeared just in time for her to see it. The second view also lasted about 4 seconds and pulsed from red with orange tint to blue to green almost mechanically. Having seen it twice and having the same light pattern rules out a natural phenomenon. I have been pondering coming forward for awhile now but decided it was the right thing to do."],"files":["/var/www/straped/mufon/html2text/7451.html.txt","/var/www/straped/mufon/org/7451.html"]}