{"Log Number":"US-07152007-0013","map":"<A HREF = \"http://maps.google.com/maps?q=39.639303,+-76.202916(7453)&iwloc=A&hl=en\"> mufon case (7453) map </A>","Country":"United States","Viewing Distance":"Unknown","City":"Darlington","Summary":"A large orange-red light that would dim and disappear, move, and \"hide\" behind trees","Disposition":"Unknown","trends":["There have been no other sightings in Darlington","This sighting has never been favorited."],"Date of the Event":"07/08/2007 09:30 UTC","Longitude":"-76.202916","Object Shape":"Sphere, Star-like","Object Features":"None","Case Number":"7453","Latitude":"39.639303","Region":"Maryland","files":["/var/www/straped/mufon/html2text/7453.html.txt","/var/www/straped/mufon/org/7453.html"],"Source":"MUFON","Object Flight Path":"Stationary","Tags":"City","Weather Factors":"Unknown","Date Submitted":"07/08/2007 09:30 UTC","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was at a church camp in Darlington, Maryland on Sunday nite, July 8th, and was watching some local residents shoot off fireworks. I noticed a large yellow-orange light in the sky, but passed it off as a star. I went to do some camp activities and return no more than an hour later to where I had watched the fireworks and noticed thaat the light had moved to a different region in the sky. I called a friend over to look and described to her what I have just written above. We watched the light and saw it getting dimmer and dimmer until it disappeared from sight. It was around some trees, but not behind any, as we could make out the outline of the treestops (the light did not seem to be close to the trees). It quickly reappeared in the same spot and again dimmed and faded. It then reappeared above another group of trees about a foot to the left (distance based on my reference, were I to point from one part of the sky to another; I do not know how large the object may have been and so cannot say how far to the left it actually moved). The light was now more of an orange-red colour and appeared to be spinning counter-clockwise and possibly changing its basic shape (it remained a sphere, but I could see the edges changing). We did not see the object move; it disappeared from one spot and reappeared in another. The object slowly started to sink below the tree line; at this point we called over another observer to view the object. Eventually the object was below the tree line; however, the foliage was sparce and we could still partially see the object. However, when I would change positions to get a better view, the object would move and \"hide.\" There was no wind to speak of that night, nor a breeze, and so the leaves were not swaying to cover the light. For several minutes the light would move itself when I would move to better view it until eventually it fell behind where we could see. Overall, the incident took 45 minutes at the most. Possibly unrelatedly, the next morning I had a nosebleed; they are rare for me, but I was feeling a cold coming on. It was most likely a coincidence. Unfortunately, the light did not return any subsequent night. The other witnesses and I were definately freaked out; not scared, but curious as to what we were watching before us. On a final note, I was told the morning after the sighting that the Harford County, Maryland newspaper, the Aegis, had been reporting on UFO sightings in the recent weeks up to my own sighting."]}