{"Summary":"A rectangular shape","Object Features":"Undisclosed","Region":"Wisconsin","Object Shape":"Square, Rectagular","Case Number":"7454","Date of the Event":"08/31/1965 12:00 UTC","Log Number":"US-07152007-0010","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=43.041902,+-87.898374(7454)&iwloc=A&hl=en\"> mufon case (7454) map </A>","Date Submitted":"08/31/1965 12:00 UTC","files":["/var/www/straped/mufon/html2text/7454.html.txt","/var/www/straped/mufon/org/7454.html"],"trends":["There have been 35 other sightings in Milwaukee","There were no other sightings in Milwaukee on or around August 31st 1965"],"Latitude":"43.041902","divs":["Sighting DetailsI was about 12 years old at the time. My friends and I were running across W. Beecher St. into Kosciuszko park to play tackle football. At the time my address was 2058 S. 8 St. Milwaukee, WI. There was a small open field just north of the entrance to the swimming pool where we played football. Kosciuszko park encompassed an area from 7th street on the east to 10th street on the west, and Beecher street on the north to Lincoln avenue on the south. There are tennis courts to the west of the area where we played football. One of my friends pointed up and said \"hey look at that!\" Moving from West to East was a rectangular object with rounded corners. It had the deep grey color that stealth aircraft have today. There was a low overcast cloudbase, probably 1000 Ft. I'd say it was half-way to it in altitude. It was maybe 5 degrees to the south of us from being directly overhead. It had no markings and went over in 5 to 10 seconds making no more sound than would come from a window fan. I have just recently gotten online and learned of your website from listening to coast to coast am, so I've had no way to report this until now. Please feel free to contact me at my e-mail or phone if you would like. Witt best regards."],"Object Flight Path":"Straight-line path","Source":"MUFON","City":"Milwaukee","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"None","Longitude":"-87.898374","Tags":"City"}