{"Summary":"Two Neon Blue Lights spotted above my neighborhood","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/7455.html.txt","/var/www/straped/mufon/org/7455.html"],"Weather Factors":"Unknown","Disposition":"Unknown","Log Number":"US-07162007-0001","Region":"Illinois","Object Features":"Unknown","Longitude":"-88.320072","trends":["There have been 7 other sightings in Aurora","There were no other sightings in Aurora on or around April 30th 2007"],"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.760585,+-88.320072(7455)&iwloc=A&hl=en\"> mufon case (7455) map </A>","Tags":"City","Object Flight Path":"Stationary,Hovering then path","City":"Aurora","Source":"MUFON","Date of the Event":"04/30/2007 03:40 UTC","Case Number":"7455","Date Submitted":"04/30/2007 03:40 UTC","divs":["Sighting DetailsI was outside in my garage playing acoustic guitar until around approximately 3:40 AM, and I decided to go inside because I'd finally wore myself out. I walked outside and happened to glance acorss the street above my neighbor's house. My eye caught upon something I thought was a very bright star... but there were two problems. One problem was that Sirius, which usually appears in that direction, was never ever as bright or large as this object had been,and two was that it was wobbling in a loopy sort of fashion. It was not staying still in the sky. I thought maybe I was swaying because I was tired, so I sat down and observed it for a little while, and it was still wobbling and swaying, like I was looking at a super bright star drunk out of my mind or something. I decided to walk out into the street to get a better ;ook at it, and as I passed the tree at the end of my driveway, I happened to glance up through the edge of the tree and I saw yet another very bringht neon blue star-like object. I rushed out into the middle of the street, and pretty much as soon as I got a good look at this thing, it did the most amazing arial maneuver I'd ever seen. I went from being pretty much stationary to doing a quick spiraling motion, and then shot straight up into space towards a very small orange lightvery very high up in the sky. At that point, the orange light twinkled and disappeared, also. The other light was still hovering over my neighbor's house. It could've been there for an hour, 15 minutes, a whole day, I can't be sure because I went inside shortly after the second \"craft\" shot away up into space. I've seen a few other strange vehicles in the sky, but this sighting stick out the most because I actually saw full propulsion capabilities being used, whereas most of the other times, it was just hovering stationary or floating away slowly and disappearing. There's a bit more to my story I wish not to discuss right now. Thanks, bye."],"Object Shape":"Star-like","Latitude":"41.760585","Country":"United States"}