{"trends":["There have been 3 other sightings in North Haven","There were no other sightings in North Haven on or around September 30th 1984"],"Case Number":"7457","Weather Factors":"Unknown","Date Submitted":"09/30/1984 12:00 UTC","Region":"Connecticut","map":"<A HREF = \"http://maps.google.com/maps?q=41.390914,+-72.859545(7457)&iwloc=A&hl=en\"> mufon case (7457) map </A>","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Latitude":"41.390914","Log Number":"US-07162007-0003","City":"North Haven","Summary":"Bigger than a baseball diamond or a football field. traveling slow at first with no noise","Disposition":"Hoax","Longitude":"-72.859545","Date of the Event":"09/30/1984 12:00 UTC","Source":"MUFON","Viewing Distance":"Unknown","Tags":"City","Object Features":"Undisclosed","divs":["sighting detailson the night of( cant remember possibly 1983,or 84? 11 pm or so oct. or nov.? )after picking up a fare i was traveling on i91 north toward the north haven\\new haven exit to go to (eastern circle; housing complex)to drop off my fare when i saw below my cab visor on the left side of the font windshield a reddish light in the sky an and strange outlined shape sort of a baseball diamond shape elongated. there was no moon out but just the light over the highway. i deceided to pull over before the exit and told the passenger to see this (***?)thing in the sky. we both exited the cab and looking up about 1,000 feet or so (hard to tell distance in the dark but using aprox. distance close as possibly could figure it at 800 to 1,200 ft. above the highway) the object was traveling slowly away over the highway at a slow rate of speed with no noise? i thought it was a blimp but when it crossed the highway it picked up speed and started to travel faster and then bolted so fast it left a white line in the sky (no noise again!!!) well i was scare! and confused!, as was my passenger! i,ve told twelve people i,ve trusted in the last 23 to 24 years and told them i was not happy with any of their responses. so i shut my mouth, but it still happened and i know they exist now. what ever made this craft is so advanced there will be no way that you or me or anyone will really prove their existance. enough said!"],"Country":"United States","Object Shape":"Square, Rectagular, Triangle","files":["/var/www/straped/mufon/html2text/7457.html.txt","/var/www/straped/mufon/org/7457.html"]}