{"Sighting Duration":"00:00:01","Weather Factors":"Unknown","Region":"Minnesota","Tags":"City","Disposition":"IFO","Date of the Event":"07/19/2007 03:28 UTC","Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=46.732273,+-94.67772(7478)&iwloc=A&hl=en\"> mufon case (7478) map </A>","trends":[],"Object Flight Path":"Undisclosed","Summary":"Driving back to the Twin Cities along highway 7, saw a strange green streak of light.","Longitude":"-94.67772","Date Submitted":"07/19/2007 03:28 UTC","Viewing Distance":"Unknown","City":"Undisclosed","Case Number":"7478","Log Number":"US-07202007-0002","divs":["Sighting DetailsWe started off the evening in search of some adventure and bummed around uptown and downtown for a while til we got bored and just started driving out into the country. I was driving, with 2 friends in the van with me. We headed west on Excelsior Blvd. until it met up with Highway 7 and continued west on that past St. Bonifacius til we started running a bit low on gas. It was probably around 3:15 or so when we started to head back. After driving for a few minutes, we saw a green flash of light streaking downwards out of the front windshield. My first though was that it was a firework of some type, since there was green light shooting out behind it, but it didn't explode, and whoever launched it would have to have been just about stright above us and up in a balloon or something. Anyways, the object didn't appear to touch down or anything, but disapeared about halfway down to the horizon. It all happened very quickely, under a second, and I probably would have dissmissed it as a shooting star if it hadn't been a vivid green color. We slowed down the van a bit hopeing to see more, but we didn't, so we continued on home. I had goosebumbs for a few minutes, and then we were just really excited. And that's pretty much the end of the tale!"],"files":["/var/www/straped/mufon/html2text/7478.html.txt","/var/www/straped/mufon/org/7478.html"],"Latitude":"46.732273","Source":"MUFON","Country":"United States","Object Features":"Undisclosed"}