{"Object Shape":"Chevron, Star-like, Unknown","Viewing Distance":"Over 1 Mile, Unknown","Object Flight Path":"Stationary","trends":["There has been one other sighting in Brookville","There were no other sightings in Brookville on or around July 20th 2007"],"Country":"United States","Case Number":"7485","City":"Brookville","Weather Factors":"Unknown","Longitude":"-85.012738","Latitude":"39.423106","Date Submitted":"07/20/2007 09:43 UTC","Source":"MUFON","Disposition":"Insufficient Data","Object Features":"Unknown","Region":"Indiana","Summary":"Light source, > chevron shape max of 6 lights. appeared stationary","Date of the Event":"07/20/2007 09:43 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.423106,+-85.012738(7485)&iwloc=A&hl=en\"> mufon case (7485) map </A>","Log Number":"US-07202007-0009","files":["/var/www/straped/mufon/html2text/7485.html.txt","/var/www/straped/mufon/org/7485.html"],"Sighting Duration":"00:03:00","divs":["Sighting Details My son noticed unusual lights in sky due east of my location. We observed them for app. 3 minutes total time. White lights, chevron shape, NO SOLID object seen...appeared to be rather distant. App. 10-15 degrees above horizon, (general direction of Wright Patterson AFB from here) flares ??? Lights appeared to be on and off at short durations. Not consistant flashes like strobes. Definately unlike the many aircraft I've seen going to and from CVG airport which is about 30 miles from here. I have never reported anything before, but this was definately out of the ordinary. I'm just saying that what I saw was very unusual, not extra-terrestrial. I sent my son for a video camera...have not yet reviewed tape...will forward copy if anything is visible. 1. We were sitting by a camp fire when first observed. 2. Son brought it to my attention. 3. Just unusual lights in a > shape. 4. Lights appeared stationary...didn't move across sky, but did seem to be off and on in no sequence. 5. No feelings, other than \" that's not common, let's watch \". We just commented that the pattern was unusual. Too far away to be \"scary\", just interesting. After sighting ended I just told my son that \"this may be worthy sending in a report.\" 6. Lights just went out."]}