{"Region":"Wisconsin","files":["/var/www/straped/mufon/html2text/7487.html.txt","/var/www/straped/mufon/org/7487.html"],"Object Shape":"Circle","Object Features":"Unknown","trends":["There have been 3 other sightings in West Bend","There were no other sightings in West Bend on or around July 21st 2007"],"Tags":"City","City":"West Bend","Object Flight Path":"Straight-line path","Latitude":"43.425278","divs":["Sighting DetailsI was walking my dog in the front yard. I had seen some meteor action as is usual almost any night when I saw a large bright light or silvery object in the sky approximately 15-20 degrees south and 3-5 degrees east as I stood in front of my house. I first thought the object was a airplane with full landing lights on but then it came down further twards the earth and moved more northward and grew to about two or three times it's original size. At this ime I was thinking satilite or space junk hit by the sun. I have seen satilite orbits from south to north from time to time and I know what they are. The object had grown to about 8-10 times it's original size and I could not see any visible landing lights nor hear any sound. It was still moving down and twards the north at a 30 degree angle getting larger and brighter and still more silvery. It was larger than any fixed wing air craft I have seen because the stealth bomber flew over during a fly-in event and also A-10 warthogs practiced in our rolling hills for the Gulf war years ago so I know the differences in size as to altitude. We also have the EAA fly in close by and I have seen large and crazy designs. The object then vanished completely as it appeared with no trace or trail or sound or anything. I'm not convinced that this is an ET UFO. This is the same area that, maybe 10-15 mi. north of here yet, that x-files considered a ufo hot spot along with a genuine ufo bar in Dundee. I have lived here most of my life and farmed a lot of this country and until now never seen anything I could not explain. I am an unbeliever but I thought you may have an explaination for this or may find this interesting. I am not prone to histereics nor am I shaken very easily. This was plain and simple an interesting happening."],"Date Submitted":"07/21/2007 02:45 UTC","Longitude":"-88.183428","Case Number":"7487","Weather Factors":"Unknown","Country":"United States","Summary":"Saw large shiny light in near southern sky and it got closer and brighter and larger and disappeared.","Date of the Event":"07/21/2007 02:45 UTC","Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-07212007-0002","map":"<A HREF = \"http://maps.google.com/maps?q=43.425278,+-88.183428(7487)&iwloc=A&hl=en\"> mufon case (7487) map </A>","Sighting Duration":"Undisclosed","Source":"MUFON"}