{"Date Submitted":"07/22/2007 02:34 UTC","Log Number":"US-07222007-0001","Date of the Event":"Unknown","files":["/var/www/straped/mufon/html2text/7488.html.txt","/var/www/straped/mufon/org/7488.html"],"Viewing Distance":"Unknown","trends":["There have been 9 other sightings in Washington","There were no other sightings in Washington on or around"],"Tags":"City","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","divs":["Sighting DetailsWOW!!!> i have an HP Pavillion a1610n computer at home.Within the computer there is a built in \" real player\" mode.Enter real player and there is a ( sample video) that they give you of cenic ROME. Within this video you can clearly see about 7 to 9 flying objects in the distance in several views in the video. Some streek across the sky in the backround (birds also, but clearly distinct)In a few views you will see some appear ,then disappear (look close!) . (notice the crowd of people in the video who never notice a thing!)(in one view u can see 2-3 following each other) Notice in the video , about the last 30 seconds, the u.f.o. that travels left to right & leaves a 'heat trail' behind (like from the ground or a car , when its a hot day out- that wavey look)>>>>> try the real player (sample) on your computer.(maybe there) If u have an HP pavillion , u definately can view this (comes with comp.)(not sure if same video is on real player on other brand computers- good luck![ FUNNY THING IS>>> BY THE LOOKS OF IT -THE PERSON TAKING THE VIDEO nor H.P. has a CLUE AS TO WHATS ON THE VIDEO- Rome is great!!. , but the U.F.O.s are AMAZING!!!!!!!!! let me know: battlecheck@aol"],"Longitude":"-77.043669","Summary":"media real player on your computer of Rome ( with gondellas) has 7-9 u.f.o.s that appear in the backround-LOOK!","Weather Factors":"Unknown","Latitude":"38.900408","Object Shape":"Circle, Sphere","Country":"United States","Case Number":"7488","Region":"Virginia","Source":"MUFON","City":"Washington","map":"<A HREF = \"http://maps.google.com/maps?q=38.900408,+-77.043669(7488)&iwloc=A&hl=en\"> mufon case (7488) map </A>","Object Flight Path":"Undisclosed","Disposition":"Hoax"}