{"Date Submitted":"07/21/2007 11:30 UTC","Object Flight Path":"Stationary,Other","map":"<A HREF = \"http://maps.google.com/maps?q=47.505955,+-111.296228(7489)&iwloc=A&hl=en\"> mufon case (7489) map </A>","Weather Factors":"None","Latitude":"47.505955","Tags":"City","City":"Great Falls","Disposition":"Unknown","Object Shape":"Circle, Cylinder, Egg, Oval, Unknown","Object Features":"Other","Sighting Duration":"00:06:00","Viewing Distance":"Over 1 Mile, Unknown","divs":["Sighting DetailsAt about 11:30 PM and went outside to give my dogs an outing. I looked up in the sky as I always do, because I like to look at the stars. I noticed a deep red light that was becoming brighter and then dimmer. I called my daughter to come and see. We both stood out on the porch and watched the object for around 6 minutes, trying to figure out what we were seeing. The object seemed to be changing shapes. It looked as if it were breathing and pulsating. It would expand from the shape of an egg shaped circle to a tall enlongated object, then it seemed to flatten out side ways into an enlongated sideways object. It changed into many different shapes as we watched. I told my daughter to keep an eye on it and ran into the house to get a digital camera and a video camera. In the minute I was gone my daughter said it just disapeared. She said it didn't move away, it just disapeared from the spot it was morphing in. When i came back outside and looked where the object had been a momnet ago, there was a whitish cloud kind of lit up where it had just been and then in a few seconds that disapated. The distance of the object I would estimate was at least 5 miles from us, although not being able to tell how large it was, that's a rough guess. It was south west of where we stood. We live about 5 miles west of Havre, so this thing was probably around ten miles south west of Havre Montana. I thought at first that I was seeeing the moon just rising through some light clouds, then I noticed that I could see stars behind the area we were watching. I went back out about every 10 minutes after the sighting to see if the moon was rising, but it never did. I was happy I guess to see yet another starnge anomily in our sky. I have been noticing other strange lights that don't move around like satellites. I always call someone else out to see and they are as stupped as I am about the speed and eratic movement of what looks like stars on many nights. I reported a very strange sighting my daughter had a few months ago to MUFON, in which she lost the electricity in the brand new truck she was driving as she was having another experience with a light that was dividing and traveling at great speeds, and then rejoining the bright red light it had split off of. This is getting pretty strange here. That sighting caused great fear in my daughter and when she finally got home she burst inot tears it scared her so bad. She was driving alone late at night for that sighting"],"Country":"United States","Summary":"My daughter and I saw a deep red object in the sky from our front porch. It morphed into many different shapes.","Source":"MUFON","trends":["There have been 5 other sightings in Great Falls","There were no other sightings in Great Falls on or around July 21st 2007"],"Longitude":"-111.296228","Date of the Event":"07/21/2007 11:30 UTC","Log Number":"US-07222007-0002","Case Number":"7489","files":["/var/www/straped/mufon/html2text/7489.html.txt","/var/www/straped/mufon/org/7489.html"],"Region":"Montana"}