{"Country":"Egypt","City":"Cairo","trends":["There have been 45 other sightings in Cairo","There were 14 other sightings in Cairo on or around July 20th 2007","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","Tags":"City","Date of the Event":"07/20/2007 08:06 UTC","Object Shape":"Cone, Circle, Disc, Fireball, Flash, Star-like, Other, Unknown","Longitude":"31.245065","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=30.04634,+31.245065(7501)&iwloc=A&hl=en\"> mufon case (7501) map </A>","Case Number":"7501","Object Flight Path":"Undisclosed","divs":["Sighting DetailsBooth were recorded same times with two commercial airliners hedded to Cairo International Airport for landing.Send here also the location of recording ,UFO's were invisabile at the beginning and became visible to the optical vision in no time ,then when I saw them like a very brighting stars I started recording.The first one started to appear at 20.06.27 pm. And disppeared behind the high building at 20.40 pm. Route and direction was from UP in the sky to DOWEN in the sky ,from south to north ,exactelly to the direction to Giza Pyramids. The second one appeared in no time ,as I was watching and covering all the sky over me ,started to be visable at 20.26 pm ,till 21.46 .I recorded both with my Panasonic video camera type ( NV-GS47 )which is very good as I recorded also the moon with very clear vision to its clear surface (I sent photo of the moon with the same camera).The route and direction of the second one from east to south west headed for the direction of Saqqara step pyramid ,but was goining from lower altetude to higher altitude. Due to the MUFON CMS accepting only three photoes as attachements I had to send you one report and three times 9 photoes. Thanks. Dr.Wahid Ibrahim www.ufo-egyptian-hunter.org --------------------------------------------- Your system did not accepted the attachment I will try to send it again."],"Disposition":"Unresolved","Date Submitted":"07/20/2007 08:06 UTC","Region":"Al Qahirah","Summary":"Hello,This is Dr.Ibrahim again...www.ufo-egyptian-hunter.org.....My latest sighting for 2 UFO's from the Egyptian Pharaohnic UFO fleet.Both were invisable at beginning and became visabile and recorded,one was green,the second was red,fwd 3reports see all.","Weather Factors":"Unknown","Object Features":"Undisclosed","Log Number":"EG-07232007-0012","files":["/var/www/straped/mufon/html2text/7501.html.txt","/var/www/straped/mufon/more/7501_submitter_file1__Image010.jpg","/var/www/straped/mufon/more/7501_submitter_file2__Image007.jpg","/var/www/straped/mufon/more/7501_submitter_file3__Image001.jpg","/var/www/straped/mufon/org/7501.html"],"Latitude":"30.04634","Source":"MUFON"}