{"Summary":"saw large cylinder cross river valley in Lakeside south to city El Cajon","City":"Lakeside","divs":["Sighting DetailsI always cleaned the dental office where my wife worked at 5:00 P.M. every Wednesdays in La Mesa Ca., about 13 miles from my house.It was about 4:30 P,M, in the summer,we think in 1973. My two daughters, about 9 and 12, were with me.We were traveling down Valle Vista Rd in Lakeside, about one half mile from the Riverside Dr.intersection, when I saw a movement out of corner of my left eye. I looked to the left and saw a long,large shiney cylinder, domed on both ends.I could see it above and beyond the trees that lined the roadway.It's hard to say but it was maybe fifteen hundred feet high ( it crossed Rattlesnake Mountain and El Cajon City engineers told me it one thousand,one hundred and ninety-eight feet high) and maybe one thousand to fifteen hundred feet away. With nothing in the air to gage the size and distance, this is a guess, but it was large and close to the ground.It kept pace with my car, no more than thirty-five mph.I parked at Riverside Dr and shut off the engine. There was no sound from the craft and it was eerie to me.I said,\"What's a military helecopter doing out here\"? My oldest daughter said,\"Dad that's no helicopter, it doesn't have a propeller\".That's when I got the shock of my life. It had no wings,motors,propellers,vertical nor horizonal stabilizers.I was in awe at this thing.It was traveling north to south from Lakeside to El Cajon Ca.The evening sun was shining on just the middle of the body where there was a narrow shiney band from the front dome to the back dome.We could not see windows nor anything but a shiney smooth surface from dome to dome.We watched for maybe fifteen to twenty minutes. It finally disappeared beyond Rattlesnake Mountain. We went on to the dental office and told my wife and the dentist what we had seen My wife belived us but the dentist scoffed at all three of us and said we were crazy or seeing things. No amount of talking would change his mind. I called a friend that worked at the Sheriff's office but no one had made a report.If anyone saw it they may have gotten the same flack I did.I saw you on Larry King Live and decided to make a report.Every word is true."],"Date Submitted":"11/30/1972 04:30 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=32.861272,+-116.915809(7508)&iwloc=A&hl=en\"> mufon case (7508) map </A>","Date of the Event":"11/30/1972 04:30 UTC","Region":"California","Log Number":"US-07232007-0019","Disposition":"Unresolved","Weather Factors":"Unknown","Latitude":"32.861272","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 5 other sightings in Lakeside","There were no other sightings in Lakeside on or around November 30th 1972"],"Object Flight Path":"Straight-line path","Object Features":"Dome","Country":"United States","Case Number":"7508","Tags":"City","Longitude":"-116.915809","Source":"MUFON","Object Shape":"Cylinder","files":["/var/www/straped/mufon/html2text/7508.html.txt","/var/www/straped/mufon/org/7508.html"]}