{"Latitude":"36.779331","Date Submitted":"07/22/2007 11:38 UTC","Region":"California","Date of the Event":"07/22/2007 11:38 UTC","trends":[],"divs":["Sighting DetailsAfter 11:30pm on Sunday 7-22-07 before mid-night we were driving west on Ball Rd and getting on the 57 freeway to go south then taking the Garden Grove Freeway going west to Long Beach me and my girlfriend saw a strange whitish light that looked kinda like a sphere. Later we could see different colored lights on it and on (2) occassions could see a small light come out of the craft and move under the craft. The lights off the craft would appear to go out once and awhile then within seconds laterthe lights would come back on and the sphere would be in a different position in the overcast sky. On one occassion the sphere was slowly descending straight down. The sphere or craft did not move in manner like a commercial jet or a helicopeter. It looked like it was floating then would disseappear and re-appear shortly later in a different position in the sky and not show how it got to the new position in the sky. The sphere with lights seem to be fairly large and seem to have also as much height as it had width and was at least a few miles away and may have been over the ocean when we saw it. At first I thought it might have been part of the moon shining thru the overcast clouds but my friend said definetly not. Then I thought it might be blimp but it moved too strangely with lights of different rows so it was not a blimp either. We could not believe what we were seeing and it seem to hide itself within the overcast clouds and somtimes we lost visibility for a short while then we would see this object again a few minutes later. Clearly it was not something you would think of as a normal type of craft. I am very interested in knowing if anyone else in Orange County saw this craft on the night of Sunday 7-22-07 between 11:30pm and midnight also?"],"Sighting Duration":"Undisclosed","Object Shape":"Sphere","Longitude":"-119.410112","files":["/var/www/straped/mufon/html2text/7509.html.txt","/var/www/straped/mufon/org/7509.html"],"Weather Factors":"Unknown","Viewing Distance":"Unknown","Summary":"Sphere with lights seen in overcast clouds","Case Number":"7509","Source":"MUFON","Country":"United States","Object Flight Path":"Undisclosed","City":"Undisclosed","Object Features":"Undisclosed","Tags":"City","Disposition":"IFO","Log Number":"US-07232007-0020","map":"<A HREF = \"http://maps.google.com/maps?q=36.779331,+-119.410112(7509)&iwloc=A&hl=en\"> mufon case (7509) map </A>"}