{"City":"Oakland","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/7511.html.txt","/var/www/straped/mufon/org/7511.html"],"Longitude":"-122.261184","Region":"California","Latitude":"37.811084","Case Number":"7511","Country":"United States","Object Flight Path":"Undisclosed","Disposition":"Insufficient Data","Object Features":"Undisclosed","trends":["There have been 24 other sightings in Oakland","There were no other sightings in Oakland on or around February 20th 1962"],"Sighting Duration":"Undisclosed","Summary":"starlight object approaching john glenn's space capsule","divs":["Sighting Detailsit was about seven thirty that night of feb 1962. my friend and i were watching the night sky for the space capsule,we spotted it? as the capsule was moving from the southwest to the southeast,my friends mother suddenly called him inside! naturally he was upset because of this event that was unfolding before our eyes. he said, he would be back and i would wait! what i'm going to say is the truth! as i was watching mr glenn's spacecapsule,i noticed a small star slowly moving towards the spacecapsule! i watched it for about ten seconds, it seemed to had docked with mr glenn's capsule!? i was 14 yrs old at the time,and asked myself could there be another capsule? about 5 seconds later the starlight object took off about at a 35 to a 40 degree angle, making a v-shape. the speed after the object left the capsule was so darn fast! that it appeared to be a meteor richocheting off the capsule! my friend came back to view spaceflight, i told him what i had just seen! basically he just said I'm seeing things. this took place in fremont,calif. through out the years ireally never mentioned it to much! not until i saw the movie the \"right stuff\" did i start to wonder,what was it? in the movie mr glenn reported strange lights appearing around his capsule!?i looked on the internet for further info. found out, there was some strange powdery ahes still on his spacecraft!?.it's ironic years later. that i would move to phx az, does the phx lights have a connection? wierd! p.s feel free to call me! there is something else."],"Source":"MUFON","Tags":"City","Object Shape":"Star-like","Log Number":"US-07242007-0002","Date of the Event":"02/20/1962 07:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.811084,+-122.261184(7511)&iwloc=A&hl=en\"> mufon case (7511) map </A>","Date Submitted":"02/20/1962 07:30 UTC","Viewing Distance":"Unknown"}