{"Case Number":"7512","Region":"Varna","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","trends":["There have been 4 other sightings in Varna","There were no other sightings in Varna on or around July 16th 2007"],"Log Number":"BG-07242007-0003","files":["/var/www/straped/mufon/html2text/7512.html.txt","/var/www/straped/mufon/org/7512.html"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=43.216645,+27.911806(7512)&iwloc=A&hl=en\"> mufon case (7512) map </A>","Date Submitted":"07/16/2007 01:00 UTC","Date of the Event":"07/16/2007 01:00 UTC","Viewing Distance":"Unknown","Longitude":"27.911806","Object Shape":"Star-like","Disposition":"Unresolved","Object Features":"Unknown","divs":["Sighting DetailsArrived on holiday in Varna Bulgaria late in the evening of the 16th July 2007. Unpacked and then sat on the hotel balcony having a (first ) glass of wine. Was amazed to see three star like objects travel swiftly low across the sky from South to North at very high speed. The objects seemed to be not in strict formation, but bobbing and weaving around. There were planes in sight at high altitude moving across the night sky with navigation lights flashing. These objects were certainly not comercial aircraft. The speed was very great as they moved from my right hand extreme view (south) to my extreme view to my left (North) they were in sight for between 10 and 15 seconds only so I had no time (or thought) to check my watch. My wife also observed these objects at the same time. Whilst not being a total sceptic I have never experienced an observation of this kind before but have living near to Farnborough where the famous air show takes place every second year, I have seen the performance of fast military aircraft at fairly close quarters. This certainly did not fit the bill as far as known military aircraft perform.They made no sound as they passed by which also seemed rather strange!"],"Latitude":"43.216645","City":"Varna","Country":"Bulgaria","Summary":"3 star like objects flashed low across the sky","Source":"MUFON"}