{"Viewing Distance":"Unknown","Summary":"Strange looking blue lights over a farm in Arkansas off HWY 67","files":["/var/www/straped/mufon/html2text/7514.html.txt","/var/www/straped/mufon/org/7514.html"],"Object Shape":"Triangle","Longitude":"-91.19846","Tags":"City","Region":"Arkansas","Object Features":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=35.730633,+-91.19846(7514)&iwloc=A&hl=en\"> mufon case (7514) map </A>","Date Submitted":"07/23/2007 04:30 UTC","trends":["There have been no other sightings in Tuckerman","This sighting has never been favorited."],"Source":"MUFON","Log Number":"US-07242007-0005","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Latitude":"35.730633","divs":["sighting detailsduring a recent trip through arkansas on 7\\23\\07 i was a passenger riding in the back seat of an suv with a trailor hitched on the back. we were driving on 67 heading northward around 4:30 am. i wasn't paying close attention but we must have been in or around the tuckerman area at this time. as a back seat passenger and a pulling a trailor, my view was somewhat restricted. what i did see out the side window, over a farm field to my right was a blueish white triangular shaped (edges somewhat rounded) object, with one round light on each side and three or four on the bottom. the lights were steady, didn't blink or pulsate and it was bright but had a muted softness to it (hard to explain). it didn't appear to be moving, or else it was moving very slow. i've never seen a ufo before so it kind of stunned me and creeped me out. i don't know if it was a ufo or just some kind of lamp type light i've never seen before but it certainly didn't look like it was attached to a post of any kind. i didn't want to mention it to the people i was with because they were busy talking and probably didn't see it, plus i was afraid they'd think i was nuts."],"Case Number":"7514","Weather Factors":"Unknown","Disposition":"Unknown","Date of the Event":"07/23/2007 04:30 UTC","City":"Tuckerman"}