{"Summary":"Noticed red ball of light moving through the tree line, snaped multiple photos included best shot with enhancment and original photo","Latitude":"42.446357","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/7517.html.txt","/var/www/straped/mufon/more/7517_submitter_file1__DSCN0827.JPG","/var/www/straped/mufon/more/7517_submitter_file2__DSCN0827_edited-1.jpg","/var/www/straped/mufon/more/7517_submitter_file3__the-UFO.jpg","/var/www/straped/mufon/org/7517.html"],"Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.446357,+-123.322182(7517)&iwloc=A&hl=en\"> mufon case (7517) map </A>","Weather Factors":"Unknown","Viewing Distance":"Unknown","Tags":"City","Country":"United States","Object Features":"Undisclosed","Log Number":"US-07252007-0002","Sighting Duration":"01:00:00","City":"Grants Pass","Source":"MUFON","Date of the Event":"08/24/2006 10:06 UTC","Case Number":"7517","Region":"Oregon","Date Submitted":"08/24/2006 10:06 UTC","divs":["Sighting DetailsOn the night of august 24th 2006, from my porch while smoking a cigarette i noticed a moving red ball of light aprox. 5 miles WNW of my location moving through the tree line in an elliptic pattern. unsure of what i was looking at, I ran in to grab my Nikon 7300 7 megapixel digital camera and shot a sequence of 4 pictures, i used the night landscape setting so the flash would not go off and placed it on my tripod. The first 3 photos taken i zoomed in at the 10x optical zoom and could not distinguish what i was seeing from the background photons collected, however when i used the 500x digital zoom i was able to snap a great shot of a disc shaped object with symmetrical designs on the exterior of the object. my wife and i observed the object for around an hour before calling it a night and going to bed. Then next day i used my photoshop elements 4.0 program to adjust the levels and attempt to brighten up the pictures a little to see if there was anything i missed, as the original seems to just be all black with only a small indication of anything in the lower left hand corner. to my astonishment when i used the autofix, feature on the photo the image enclosed is what was revealed, a very convincing UFO picture. I have enclosed the original and the adjusted levels picture for your to analyze to see that the original is actually the picture i took with my camera, and only after the adjustments were made was i able to make out any sort of shape of the object."],"trends":["There have been 35 other sightings in Grants Pass","There were no other sightings in Grants Pass on or around August 24th 2006","This sighting has never been favorited.",""],"Object Shape":"Disc, Unknown","Longitude":"-123.322182"}