{"divs":["Sighting DetailsI was going home from work and noticed three red lights coming towards me. I grew up near an airforce base, so I instantly knew that something wasn't right about the lights. They were kind of low for an airplane in this area and they weren't blinking. There were no other lights like the strobe lights that usually are on airplanes. I was in the left turning lane about to turn, so I wasn't moving at the moment. As I sat looking up the object passed me at the 10 oclock position. I rolled the window down and stuck my head out to get a better look. There was absolutely no sound at all coming from it. I was on the out skirts of town and there was no traffic in the area at all so it was quiet in the area. If there were any sound coming from it I would have heard it. It was very dark out, but the object was low enough for me to clearly see the silhoutte, a triangle. It was going rather slowly and appeared to be not very far above the tree line. If I were to guess I would say it was only a few hundred feet in the air. As I sat watching it, the object continued on towards the city and out of sight."],"Sighting Duration":"00:02:00","Object Flight Path":"Straight-line path","City":"Columbus","Longitude":"-84.983469","trends":["There have been 22 other sightings in Columbus","There were no other sightings in Columbus on or around May 10th 2007"],"Object Shape":"Triangle","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.464266,+-84.983469(7519)&iwloc=A&hl=en\"> mufon case (7519) map </A>","Viewing Distance":"101-500 Feet","Weather Factors":"None","Date Submitted":"05/10/2007 10:10 UTC","Summary":"triangular with one non blinking solid red light on each corner","Disposition":"Insufficient Data","Region":"Georgia","files":["/var/www/straped/mufon/html2text/7519.html.txt","/var/www/straped/mufon/org/7519.html"],"Tags":"City","Latitude":"32.464266","Country":"United States","Case Number":"7519","Object Features":"Undisclosed","Log Number":"US-07252007-0004","Date of the Event":"05/10/2007 10:10 UTC"}