{"map":"<A HREF = \"http://maps.google.com/maps?q=38.255995,+-85.754906(7520)&iwloc=A&hl=en\"> mufon case (7520) map </A>","Case Number":"7520","files":["/var/www/straped/mufon/html2text/7520.html.txt","/var/www/straped/mufon/org/7520.html"],"divs":["sighting detailsjogging last winter. cold with an inch of snow on the ground. very high\\far sky visibility. i had a slight back ache. at the time i was at the eastern portion of central louisville and would have been facing north-east. i arched my spine in an attempt to pop my back when something caught my eye. my field of vision was well above house top level when i noticed a very bright pair of shapes. i was reminded of high hat cymbals. the top was long slender and disk shaped, the bottom part was more of a line than a disk. they emanated a bright white light with a slight blue tinge. i was reminded of the light produced by an arc welder. there were no details i could discern on either form they also seemed flat. they were closing distance with each other but i'm not sure if they were coming together or one was meeting the other. the forms were very clearly well above air traffic level (which was also highly visible that night)and also very distant based on clouds as a reference. i would imagine these objects to be fairly large. the two forms combined and vanished, there was no flash, sound or movement. i noticed that when i blinked for a short time an after image of the objects would appear. i remember feeling excited and transfixed. i stood at that spot for another 30 minutes gawking in that direction and panning around but saw nothing else."],"Log Number":"US-07262007-0001","Date Submitted":"02/20/2007 11:00 UTC","Tags":"City","Viewing Distance":"Over 1 Mile, Unknown","Country":"United States","Summary":"High hat cymbal shape brightly lit, very distant but clearly large","Source":"MUFON","Object Features":"Undisclosed","City":"Louisville","trends":["There have been 67 other sightings in Louisville","There were no other sightings in Louisville on or around February 20th 2007"],"Region":"Kentucky","Weather Factors":"None","Date of the Event":"02/20/2007 11:00 UTC","Longitude":"-85.754906","Object Flight Path":"Stationary","Latitude":"38.255995","Sighting Duration":"00:00:05","Disposition":"Unknown","Object Shape":"Disc, Saturn-like"}