{"Longitude":"-87.888442","Date Submitted":"06/25/2002 07:00 UTC","Viewing Distance":"Unknown","Case Number":"7527","files":["/var/www/straped/mufon/html2text/7527.html.txt","/var/www/straped/mufon/more/7527_submitter_file1__mapoffeldmannlake.jpg","/var/www/straped/mufon/org/7527.html"],"Object Flight Path":"Undisclosed","Date of the Event":"06/25/2002 07:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=47.468794,+-87.888442(7527)&iwloc=A&hl=en\"> mufon case (7527) map </A>","Tags":"City","Weather Factors":"Unknown","Sighting Duration":"00:00:15","Latitude":"47.468794","divs":["Sighting DetailsAfter a long day of backpacking in Isle Royale National Park my group, which comprised of myself, my dad, and brother decided to sit by Feldmann lake and watch the spectacular northern lights. Immediately after the show had ended one of us noticed a very, very bright object high in the sky to the left. It got brighter, moved from right to left in an indirect motion, speeding up and slowing down, and then go dim until it completely faded. It looked as though it got near us and then left. We noticed the object because it was so intense compared to the stars and other objects in the background. When we noticed it, and it's erratic flight path, I didn't think it was a meteor, or other natural space object, and it did not behave like a plane. Afterwards we were all speechless. No one had any idea what it was, and we didn't talk much about it because of how strange it was. I attached a map of the area. We were on the west side of the lake I believe, looking North-East."],"trends":["There have been no other sightings in Calumet or Copper Harbor","This sighting has never been favorited."],"Object Shape":"Other, Unknown","Object Features":"Undisclosed","City":"Calumet or Copper Harbor","Log Number":"US-07272007-0001","Disposition":"Unresolved","Source":"MUFON","Summary":"After the northern lights, me and two other witnesses saw a light move around and vanish.","Region":"Michigan","Country":"United States"}