{"Date of the Event":"07/25/2007 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.323101,+-86.892698(7530)&iwloc=A&hl=en\"> mufon case (7530) map </A>","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Case Number":"7530","City":"Undisclosed","Source":"MUFON","Country":"United States","Region":"Alabama","divs":["Sighting DetailsWas driving home the other night. Heading south on a main road in the center of Mobile, Al. Sky was clear. I noticed 2 orange lights appear about 11 o'clock from my position. star-like, but orange. time was 10:30ish they appeared to be approx. 15 to 20 miles away and about half way up the horizon. There was a truck in front of me, and I said I know he is seeing this too. They just materialized out of nowhere. As I was having to concentrate on the road, I wasn't staring at the lights. I glanced back at them, and about that time, the light on the left formed 7 or 8 same size orange lights. The formation they were in kind of resembled geese in formation. you know how those certain kind of fireworks that they make to resemble a star or heart or shape form in the sky? that's what they looked like. When I say that'a what they looked like, I mean when they disappeared they resembled those certain kind of fireworks. they just seperated and disappeared. and that was it they were gone almost as quickly as they appeared. Whole thing lasted maybe 10 seconds. when i originally saw it I thought it was ahelicopter, but i don't think so. I will say this I have seen ufo's on 3 other occasions, and if they are from another galaxy, 1.at this time they don't want to be seen. 2. I have mixed feelings about why they are here and, what their intentions are. thank you for reading and have a good day."],"Viewing Distance":"Unknown","Object Shape":"Other","Weather Factors":"Unknown","Tags":"City","Summary":"orange lights in sky","Longitude":"-86.892698","Log Number":"US-07272007-0004","files":["/var/www/straped/mufon/html2text/7530.html.txt","/var/www/straped/mufon/org/7530.html"],"Latitude":"32.323101","Disposition":"Unknown","Date Submitted":"07/25/2007 12:00 UTC","trends":[],"Sighting Duration":"Undisclosed"}