{"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/7532.html.txt","/var/www/straped/mufon/org/7532.html"],"Sighting Duration":"Undisclosed","trends":["There have been 7 other sightings in Norwalk","There were no other sightings in Norwalk on or around"],"divs":["Sighting DetailsI believe my first UFO experience took place on August 9, 1988 when, in the depths of my alcoholism, an alien presence communicated with me in Ridgefield, Connecticut. I was visiting my ex-husband Edwin Fadiman when this presence telepathically told me to get out of bed and drive home. We argued about this for what seemed like thirty minutes, until I finally agreed. That night I was arrested for drunken driving. I have never had a drink or a drug since. Since that time, I have been receiving telepathic messages from, I sense, are the Pleiadians; albeit I have absolutely no scientific proof that these beings are from the Pleiades. Dr. Stuart Waltzman, a wonderful psychiatrist that I saw in Connecticut assured me that I was mentally sound as I was not hearing voices. These wonderful beings guided my magazine \"Conscious Living,\" which I founded in Westport, Connecticut in 1996. My tragedy began when I started to publish articles about UFOs in my magazine, and sponsor UFO workshops at The Center for Conscious Living, a healing and retreat center I cocreated near Sedona, Arizona. I was communicating with UFO researchers such as Dr. John Mack of Harvard University, Dr. Richard Boylan, John White and Dr. Speer. They told me that the reason I was having trouble producing issues of my magazine that pertained to UFOs was because the government did not want me to disclose this information. The difficulties mostly revolved around problems with electronic office equipment. Once I stopped my coverage of UFOs, life became very tranquil until I felt the presence of an alien being reaching for my hand in what metaphysicians claimed was a highly trafficked UFO area in and around our home. While this being caused me no harm, I panicked and moved my son and I to Hawaii. While I was accustomed to telepathic encounters, I had never seen an alien nor had I ever been touched by one. During our time in Arizona, my beloved son William channeled his higher self one Christmas Eve. He espoused highly complex metaphysical concepts for about three or four hours, as witnessed by my assistant Marla Gable. He drew a picture of his master which I still have, said that he had a mission to find a special key, and that he attended mystery schools in other dimensions. I am going to refer you to francinekelly.com for information about my tragedy. I do not believe I am dealing with humans in Connecticut who have kidnapped my son. I believe I am dealing with Reptilians and possibly Grays. In fact, I believe my former husband Bruce Kelly may be a reptilian, although I have absolutely no proof of this. I believe my son's abuse is related to Skull & Bones at Yale in New Haven. My hope is that you will investigate the phenomenon in Connecticut, and help free my son from his abductors."],"Tags":"City","Log Number":"US-07282007-0002","Object Shape":"Undisclosed","Country":"United States","City":"Norwalk","Disposition":"Hoax","Object Flight Path":"Undisclosed","Case Number":"7532","Summary":"A series of surreal events which have led me to believe that Reptilians and possibly Grays associated with Skull & Bones in Connecticut are my son's true abductors.","Latitude":"41.117597","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.117597,+-73.407897(7532)&iwloc=A&hl=en\"> mufon case (7532) map </A>","Date of the Event":"Unknown","Longitude":"-73.407897","Region":"Connecticut","Source":"MUFON","Date Submitted":"07/28/2007 02:25 UTC","Viewing Distance":"Unknown"}