{"Log Number":"GB-07282007-0004","Country":"United Kingdom","Weather Factors":"Windy, Light","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","Source":"MUFON","Date of the Event":"07/28/2007 01:30 UTC","files":["/var/www/straped/mufon/html2text/7534.html.txt","/var/www/straped/mufon/more/7534_submitter_file1__LOW1.jpg","/var/www/straped/mufon/more/7534_submitter_file2__LOW2.jpg","/var/www/straped/mufon/org/7534.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=52.481138,+1.753449(7534)&iwloc=A&hl=en\"> mufon case (7534) map </A>","Viewing Distance":"101-500 Feet","trends":["There have been 3 other sightings in Lowestoft","There were no other sightings in Lowestoft on or around July 28th 2007","This sighting has never been favorited.",""],"Date Submitted":"07/28/2007 01:30 UTC","Latitude":"52.481138","divs":["Sighting DetailsAlthough the skies cleared quite quickly, I first noticed something through the cloud cover. As an amateur astronomer, I'm quite used to looking up at the sky from my back garden in Carlton Colville (South Lowestoft- UK) and as a smoker, I generally spend a lot of time there these days. What struck me at first was that this was a very bright star NW of my house, due to it's brightness through the cloud cover whilst no other star was visible. A few months ago and a few hours earlier in the night, I would have taken it to be Venus; although in late July and at this time of night this seemed unlikely, so it piqued my interest. The cloud moved on revealing a clear sky and it still looked like a star, albeit a bright one and one that was moving. I immediately revised my opinion of it to be a satellite as it moved with the kind of speed and with the appearance of one, although I was surprised at how bright it was. Then it stopped... This seemed to blow my theory that it was a satellite and my thought then was that it was a helicopter. There seem to be a lot of helicopters around this area at night... the police have one to cover the area and there is a heliport about 10 miles away just outside of Beccles. I waited for it to reveal itself as such. After around five minutes had past however (the time it took me to smoke another cigarette) it didn't move at all and for all intensive purposes looked just like a star. When it began to move again, this time at a slower pace than before, I wondered what it could be. It stopped again, although it seemed to be moving ever so slightly every now and again in a subtle but somewhat erratic manner. If it were a person sitting on a seat, you would say that they were fidgeting. Every now and then it seemed to move very slowly in a NE direction and occasionally make adjustments. As I watched, I looked at the other stars around it to try and judge how quickly it was now moving. I noticed two stars above it that were quite dim in comparison and formed the shape of a triangle alongside the bright star. When it appeared to move again though, the two dim stars appeared to move with it. It was at this point that I realized that the triangle pattern was moving in formation in relation to the other stars. It continued to move about for a further 30 minutes, although by now I had begun to doubt what I was seeing. As my eyes adjusted to the light (I'd spent around 40 minutes in the darkness by now and my garden is quite sheltered) I thought I could make out edges that joined the three stars. It appeared to be a black triangle shape. As it continued to move erratically for the next hour or so, I could not take my eyes off it. It appeared to be about 500ft up and would have been directly over marshland and the broads. Although I am not accustomed to estimating altitude, I had a good reference fresh in my mind as I'd spent the day at the town's annual seafront air festival. Seeing a variety of planes flying over the sea gave me a good yard stick in this instance. Although I had appeared to witness definite movement, I began to wonder if I had indeed imagined it. After craning my neck for such a long time, I was keenly aware that my eyes may have been playing tricks on me at this point but every time I convinced myself that I wasn't seeing this at all and that I should go to bed, it made a larger movement again and hooked me in. It was almost like it was teasing me into staying to watch. Things started to get a little stranger after that. At one point, cats started to scream and dogs began to howl. I've never heard such a chorus before and I felt a bit scared at this point. This seemed to go on for a few minutes, throughout which my own cat peered out of the cat flap quite apprehensively. As suddenly as it had began, the chorus stopped and I was back to staring at this enigma again in complete silence. At one point a cloud passed over it again and there seemed to be a flash of light emanating from behind the cloud. By this time, I had been watching it for about 1hr and 45 minutes. Throughout this time I had continually doubted what I was seeing, but I was suddenly utterly convinced that what I was witnessing was something extraordinary. It was then that the ball of light appeared. It didn't seem to come out of the triangle, rather it appeared slightly below it and to my eyes was instantaneous in it's manifestation. This was a real 'bloody hell!' moment and I was utterly mesmerized by it's luminance and size. Bright like a flare, it seemed to be white in the middle but orange around the edges and it moved very steadily down from the triangle and began to move directly overhead. Although it at first seemed to be a ball, it was actually a little fatter in the middle-- a squashed ball if you will. At this point I freaked out and rushed into the living room to get my camera. Although fumbling through the drawer for the camera felt like a lifetime, it couldn't have been more than 20 seconds and by the time I got out of the house it was directly overhead, above the house. It now appeared like the shape of a jelly bean from my vantage point beneath it. Unfortunately, my digital camera's a relatively cheap model and by the time it had fired up to take a picture, the object had gotten a little more distance, although was still relatively close to the house. As I took a picture, the flash went off and I cursed as I quickly tried to change the picture setting to one without the flash. By the time I'd gotten the camera sorted, the object had moved quite a distance, faster it seemed after it had left the proximity of my house. By this point it was quite small and finally stopped somewhere in the distance. I really couldn't say how far away it was now, a few miles perhaps? Maybe less? There it seemed to stop. As I turned back to the triangle, it was no longer there. I watched the orange ball for a further twenty minutes during which it seemed to ascend very slowly. Finally, after about 30 minutes, a cloud obscured the ball of light which at this point was about the same size and coloration as Mars, which was shining to the SE of the object. I have included the picture I took with the flash on as I staggered out of the house. At first, this looks like a black and empty picture, but by turning up the brightness and the contrast of the image it appears to have a little more structure. I'm well aware that the picture is almost laughable as evidence and is a very poor representation of what I witnessed, but it's better than nothing... I've also included an enhancement in which I have increased the brightness and the contrast."],"City":"Lowestoft","Object Shape":"Fireball, Oval, Triangle","Region":"England","Object Features":"None","Case Number":"7534","Tags":"City","Summary":"Black triangle stationary, moving at a medium pace at first, then making slight slow movements... followed by a orange slightly elongated ball that appeared close by and flew overhead.","Longitude":"1.753449","Sighting Duration":"Undisclosed","Disposition":"Unresolved"}