{"Disposition":"IFO","Summary":"Slow moving misty firey-orange fireball with startling details when seen through binoculars","Country":"United States","Sighting Duration":"Undisclosed","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Case Number":"7535","map":"<A HREF = \"http://maps.google.com/maps?q=42.933692,+-72.278141(7535)&iwloc=A&hl=en\"> mufon case (7535) map </A>","Region":"New Hampshire","Longitude":"-72.278141","Date Submitted":"07/27/2007 10:15 UTC","Date of the Event":"07/27/2007 10:15 UTC","City":"Keene","Source":"MUFON","divs":["Sighting DetailsI had been doing my email, around 10 PM, and was quite centered on the computer at the time. I don't know why I looked up and turned around to face the window, but when I did I was stunned by the sight of a large fiery-looking object in the sky. It was about the size of a nickel held at arms length, and was approaching from the east. As I watched it it veered toward the north. The color was a striking flaming-orange and looked totally unusual and out of place, so I looked at it through my 7x35 binocular which was on the bookcase near the window. I was able to see that under magnification the object was a group of lights surrounded by a halo, or oval ring that had depth to it. To the naked eye the object appeared to be a rather fuzzy, flaming-orange-colored circular mass. It was traveling horizontally, just above a wispy cloud cover that was moving in. It was moving quite a bit faster than an airplane, but nowhere near fast enough to be considered a meteor of any sort. It did not appear to be falling. At one point I noticed a bright star-like object which was near the object but traveling in a direction away from it. It appeared to be at the same altitude. I think it may have been released out the back end of the fireball object, but I am not sure. The orange object faded from view as it entered a cloud bank which was moving into the northeast quadrant of the sky."],"Log Number":"US-07282007-0005","Latitude":"42.933692","Weather Factors":"None","Object Shape":"Fireball, Oval","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/7535.html.txt","/var/www/straped/mufon/org/7535.html"],"trends":["There have been 3 other sightings in Keene","There were no other sightings in Keene on or around July 27th 2007"],"Object Features":"Other"}