{"Latitude":"36.99693","map":"<A HREF = \"http://maps.google.com/maps?q=36.99693,+-86.437652(7537)&iwloc=A&hl=en\"> mufon case (7537) map </A>","Object Shape":"Teardrop","Date Submitted":"07/04/2007 12:00 UTC","Source":"MUFON","City":"Bowling Green","Longitude":"-86.437652","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/7537.html.txt","/var/www/straped/mufon/org/7537.html"],"divs":["Sighting DetailsDriving home from Ohio County Park in Hartford, we decided not to stay for the annual fireworks. It was almost dusk and the sun was setting. There are hills and trees here which make a nice back drop. I had been visited on several occasions before and had recently had an encounter up close while my husband was at work. I reported this incident to 911 emergency and the female dispatcher said it was just after midnight. I explained the bright white and red light hovering over the grass then. I was scared and said, \"Maybe it's deer hunters. The female dispatcher said, \"They wouldn't be hunting this late at night.\" I was scared but for reasons I can't explain I felt foolish and said well never mind. I just forgot about it an went to sleep. When it happened again this time I wanted my husband to acknowledge the sighting with me. I got a feeling and on Hwy. 269 I asked my husband if he could see this large ball of light. He said yes he could.First he said, it is probably just an airplane or helicopter from Fort Campbell. I watched it as we came down Patterson Rd. Then it was coming straight for us toward us! I told Tom then what is your helicopter or plane doing now? It was quite large and bright now and lower in the sky. Much lower over the tree line and a white luminous like a star and was hovering in place. Tom said, \"It's just one of those whisper jets that don't make any noise.\" I asked him to listen for a sound before. We came up to the circle at Carolyn Lane and went to the end where we live. It sat now in front of our home. I asked Tom if his helicopter that makes no sound but has a bright light follows him. He looked up at the light and said, \"OK, it's a UFO, let's go in.\" I was shook up and don't remember much after that but I know we both took a nap which is odd for us until late about 11 PM. I went to the large window near the fireplace and looked out right where I thought the UFO would be. It was there hovering. I told Tom to please come outside in the backyard now with me and to look. Tom came out and acknowledged that the UFO existed. Tom made me go back in and as we went back inside, I saw the white light jettison a red smaller light out and up which flew away and was followed by another. Then it was gone. Vanished in the night. You asked to answer the questions 1 thru 6.How do I feel afterward? Like I always do after an encounter, I know we are being visited by ascension beings from another galaxy. This time I told Tom I was going to record it with MUFON. Now, I know that somewhere in MUFON those that want to know can find this."],"Case Number":"7537","trends":["There have been 25 other sightings in Bowling Green","There were no other sightings in Bowling Green on or around July 4th 2007"],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Region":"Kentucky","Date of the Event":"07/04/2007 12:00 UTC","Log Number":"US-07292007-0001","Tags":"City","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Country":"United States","Summary":"Eye witness with husband Thomas R. Morris","Disposition":"Insufficient Data"}