{"Case Number":"7541","Longitude":"-121.281286","Tags":"City","Date Submitted":"07/28/2007 07:40 UTC","Date of the Event":"07/28/2007 07:40 UTC","Sighting Duration":"Undisclosed","Source":"MUFON","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=38.761864,+-121.281286(7541)&iwloc=A&hl=en\"> mufon case (7541) map </A>","Summary":"first object: hershey's kiss. second objects: cylindrical","Latitude":"38.761864","Object Flight Path":"Path with directional change","Log Number":"US-07292007-0005","files":["/var/www/straped/mufon/html2text/7541.html.txt","/var/www/straped/mufon/org/7541.html"],"divs":["Sighting DetailsHello again, What an unbelievable experience. I was in the backyard for my usual daily sky-watching, and I saw what appeared to be a half-deflated mylar balloon. This is a fairly windy area, and I have seen many things float by. Things such as balloons, both helium and mylar, newspapers, spider webs, plastic bags, and paper bags. Birds sometimes appear to be inanimate objects. In other words, I make an attempt to identify the objects as 'ordinary things' first. Therefore, I was fairly convinced that this was simply a mylar balloon which was losing its helium. I had my binoculars (16x50) but could not focus on the object. It was silver, and through my binoculars it looked to be somewhat shaped as a 'hershey's kiss' on its side. Or possibly an acorn. It was hard to focus on it, as it kept turning or reflecting light or giving off its own. I don't know. Anyway, I kept looking at the object. It was stationary at one point for about 3 minutes. Then it gradually came to be about directly overhead. Then it passed to my left, and I lost it. About 1 minute later, it appeared again, but this time on my right, and then gradually went again over to my left. Then it did something no mylar balloon of which I am aware can do: It started 'bouncing'. That's what it appeared to do; bounce up and down as if on a yo-yo string. That's when it disappeared. But then something happened which let me know for sure this was no mylar balloon. About 2 seconds after it disappeared, 4 lights immediately appeared. Then another. And another. Possibly another, it was hard to tell as they were then moving in a perfectly straight line and going awfully fast. It was hard to focus and keep count at the same time. But at least 6 cylindrical shaped objects moving at a high rate of speed in a southeasterly direction. I was able to keep then in view for about 15 seconds, after which time they disappeared. This was approximately 7:40 in the evening. No clouds in the sky. Still light. Some haze, but not much. This reminds me of the sighting earlier this week where someone reported two rows of 100 craft. This was one row, and only 6. But it was still something to see. I do have a queston: Is there someone who would know if the earlier 'hershey's kiss' was possibly a beacon or locator of some type? It's just kind of coincidental that it disappeared exactly when the other objects 'popped in'. As to more events, I'll keep you posted."],"Object Shape":"Cylinder, Star-like, Other","Object Features":"Unknown","Region":"California","Weather Factors":"Windy","trends":["There have been 31 other sightings in Roseville","There were no other sightings in Roseville on or around July 28th 2007"],"Viewing Distance":"Over One Mile","Disposition":"Insufficient Data","City":"Roseville"}