{"Object Shape":"Sphere","Weather Factors":"Unknown","Disposition":"Unresolved","Latitude":"50.842941","Date of the Event":"07/21/2007 11:45 UTC","Sighting Duration":"00:20:00","Object Features":"Undisclosed","trends":["There have been 4 other sightings in Brighton","There were no other sightings in Brighton on or around July 21st 2007"],"City":"Brighton","Date Submitted":"07/21/2007 11:45 UTC","Summary":"strange lights in the sky over polgate east sussex england","Source":"MUFON","divs":["Sighting DetailsAT AROUND 11.35PM ON THE 21.7.07 I WAS GOING TO MY BED, I WENT TO CLOSE MY BEDROOM CURTAINS WHEN I NOTICED STRANGE BRIGHT LIGHTS IN THE SKY. I WOKE MY WIFE UP AND TOLD HER TO BRING THE CAMERA. WE WENT OUTSIDE THE HOUSE AND LOOKED UP TO THE SKY , I COULD NOT BELIVE MY EYES RIGHT ABOVE ME WHERE ABOUT 12 TO 15 BRIGHT OBJECTS JUST STAYING THERE, I TOLD MY WIFE TO TAKE A PICTURE BERORE THE LIGHTS DISAPEARD. WE WATCHED THEM FOR ABOUT 15MIN IN THE DISTANCE I SAW ABOUT 4 MORE LIGHTS COMING OVER THE HORISON I TOLD MY WIFE TO TAKE PICTURES OF THEM TO. THE ONES IN THE SKY ABOVE US SEAMED TO BE WAITING ON THE OUTHER ONES I KNOW IT SOUNDS CRAZY BUT THATS WHAT IT LOOKED LIKE. WHEN THEY WHERE ALL TOGETHER THE MOVED AWAY TOWARDS THE EAST THEY WENT BEHIND THE CLOUDS AND WE NEVER SAW THEM AGAIN. I REPORTED WHAT WE SAW TO THE LOCAL PRESS THE RAN A SHORT STOEY ON THEM,OUTHER PEOPLE SAW THEM TO. I ALSO REPORTED IT TO THE M.O.D. HERE IN THE UK,THEY SAID THAT THEY HAD NOT HERD ANYTHING OR ANY REPORTS OF STRANGE OBJECTS IN THE SKY. I DONT KNOW WHAT IT WAS WE SAW BUT THEY MADE NO SOUND AND WHERE NOT AIRCRAFT LIGHTS,OR BALLONS,I JUST CANT SAY WHAT IT WAS BUT IAM GLAD I SAW THEM.I DONT KNOW HOW TO SEND PHOTOS BY COMPUTER, BUT IF YOU GO ON TO THE NEWS PAPERS WEB SITE IT IS WWW.EASTBOURNEHERALD.CO.UK YOU CAN VIEW THE STORY IT IS CALLED UFOS OR BALLONS.THEY ONLY SHOW ONE OF THE PICTURES WE TOOK THE TREE IN THE PICTURE IS 40 TO 60 FEET TALL I DONT KNOW HOW LARGE THE LIGHTS WHERE BUT THEY LOOKED LIKE BIG RED TRAFIC LIGHTS IN THE SKY."],"Tags":"City","Region":"England","Country":"United Kingdom","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Case Number":"7548","map":"<A HREF = \"http://maps.google.com/maps?q=50.842941,+-0.131312(7548)&iwloc=A&hl=en\"> mufon case (7548) map </A>","files":["/var/www/straped/mufon/html2text/7548.html.txt","/var/www/straped/mufon/org/7548.html"],"Log Number":"GB-07302007-0003","Longitude":"-0.131312"}