{"files":["/var/www/straped/mufon/html2text/7553.html.txt","/var/www/straped/mufon/more/7553_submitter_file1__StilleBigUFO071407003.jpg","/var/www/straped/mufon/more/7553_submitter_file2__StillfBigUFO071407003.jpg","/var/www/straped/mufon/more/7553_submitter_file3__StilldBigUFO071407003.jpg","/var/www/straped/mufon/org/7553.html"],"Latitude":"39.079553","Sighting Duration":"Undisclosed","Object Shape":"Disc","trends":["There have been 2 other sightings in Aspen Hill","There were no other sightings in Aspen Hill on or around July 14th 2007","This sighting has never been favorited.",""],"Log Number":"US-07302007-0008","Case Number":"7553","City":"Aspen Hill","Weather Factors":"Unknown","Summary":"From my 2nd floor balcony facing east (I think) and started filming video","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Disposition":"IFO","Object Features":"Undisclosed","Source":"MUFON","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.079553,+-77.073034(7553)&iwloc=A&hl=en\"> mufon case (7553) map </A>","Date of the Event":"07/14/2007 09:59 UTC","Date Submitted":"07/14/2007 09:59 UTC","divs":["Sighting DetailsBasically I went out on my 2nd floor balcony with my camera as I've gotten some interesting pics at dusk and at night; and watched the sky for a couple minutes before I saw a steady white light in the sky in the east. I first thought it was a plane, so I trained my camera on the light, viewed it and decided it didn't look like a plane. I decided I would film it and see what I had captured after uploading it to my computer. I pressed REC and started filming. I tried to keep the object which was blinking and moving about, centered in the viewfinder and followed it until it disappeared completely. The object looked like a circular light, then yellow and red in the viewfinder. After a few seconds, I pressed REC again to stop filming. I couldn't hear any plane sound and I have no idea how far away it was. It was a distance because I zoomed in to get the pictures I did. I captured these stills from the video I took. One shows an entity inside the disk. Now my feelings and reaction after viewing them on the computer as stills is total shock, fright and amazement."],"Tags":"City","Region":"Maryland","Longitude":"-77.073034"}