{"Viewing Distance":"Unknown","Disposition":"Unknown","trends":["There have been 27 other sightings in Providence","There were no other sightings in Providence on or around July 25th 2007"],"Region":"Rhode Island","Summary":"a star just like any other star in the night sky moving,then reversed direction same flight path at high rate of speed until it was gone.","divs":["Sighting Details I put some trash out in the back of my house at 9:54 pm. The sky line is open & that night it was clear with a full moon just days away. For me looking up into the night sky to see stars, planes etc. is a normal and almost daily routine. I noticed a small plane( not to high ) flying towards ,what I call the \" 3 point star triangle\". I looked away but knew that something caught my eye. When I looked back up at the plane,that's when I saw it. I was watching this star ( no other way to describe it )moving in almost the same direction of the plane,and for the life of me...,I could not take my eyes off of it. The first thing I was thinking, could it be a jet flying 35,000 ft,but that wasn't it. I looked away for 5 seconds after watching it for 2 minutes. When I looked back up,I was expecting to see it flying towards that 3 point star triangle but didn't see it. I then looked at the same path that it was traveling and went backwards. That's when I knew this wasn't a star. The object had reversed its direction on the same flight path but at an unbelievable speed. Within a matter of seconds it was gone into the clear open sky as if it just disappeared. To me,words cannot explain what I witnessed you just had to be there. Thank You & Keep Your Eyes On The Sky !!!"],"Date Submitted":"07/25/2007 09:54 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/7555.html.txt","/var/www/straped/mufon/org/7555.html"],"Object Features":"Undisclosed","Log Number":"US-07302007-0010","Date of the Event":"07/25/2007 09:54 UTC","Case Number":"7555","Latitude":"41.829579","Country":"United States","Longitude":"-71.407274","City":"Providence","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.829579,+-71.407274(7555)&iwloc=A&hl=en\"> mufon case (7555) map </A>","Weather Factors":"Unknown","Object Shape":"Star-like","Source":"MUFON"}