{"Disposition":"Unknown","Object Flight Path":"Hovering then path,Other","map":"<A HREF = \"http://maps.google.com/maps?q=38.755154,+-121.281696(7557)&iwloc=A&hl=en\"> mufon case (7557) map </A>","Country":"United States","Sighting Duration":"Undisclosed","Region":"California","City":"Roseville","Date Submitted":"07/30/2007 06:15 UTC","Case Number":"7557","Longitude":"-121.281696","files":["/var/www/straped/mufon/html2text/7557.html.txt","/var/www/straped/mufon/org/7557.html"],"Object Shape":"Flash, Sphere, Unknown","trends":["There have been 31 other sightings in Roseville","There was one other sighting in Roseville on or around July 30th 2007"],"Source":"MUFON","Viewing Distance":"Unknown","Object Features":"None","Summary":"Flash, white sphere, and two unusual-shaped objects","Date of the Event":"07/30/2007 06:15 UTC","divs":["Sighting DetailsWell, I would like some help here. This the second sighting I have had in three days. About 15 total in a year and a half. However, this is the most dramatic so far. I was in my backyard, doing some sky-watching. I notice many things in this windy area; earlier today I saw what appeared to be 3 kitchen-sized plastic trash bags, unopened, fall from the sky! However, that's obviously not what I am reporting. I saw a flash, and noticing the color of it, I figured it was time to look through my binoculars (16x60). Sure enough, as Soon as I had focused, I saw a white sphere just 'pop in'. That's the only way I know how to explain it. It started moving, slowly. Then, out of the haze we have around here, another shape emerged. Then another. Then all three stopped, basically hovering above the house. I don't know how high, but I could not see them without binoculars. They just hung there. After about 3 minutes, I decided to call my mom as a witness. However, in the brief time it took me to look at the phone to dial the number, the objects were gone. So my questions. Does anyone know what this means? Am I being prepared for contact? Am I the only one who is supposed to see these things? Should I even report what I am seeing? Can someone help? Thanks Jim"],"Latitude":"38.755154","Log Number":"US-07302007-0012","Weather Factors":"Windy","Tags":"City"}