{"Source":"MUFON","Log Number":"US-07302007-0015","Summary":"Observed 14-21 white flashing lights and 5 red lights making complex manuvers including altering the sequence of flashes and pairing of lights over a 30 minute time frame.","Object Shape":"Star-like","Latitude":"39.710482","Country":"United States","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Weather Factors":"Windy","divs":["Sighting DetailsWe had just left Rachel NV. and as we approached the crest of Coyote Summit I checked my watch. It was 10:05 pm. As we crested Coyote Summit we noticed a glow above the horizon to the Southwest (later identified as the glow of the lights of Las Vegas). While conjecturing about the source of this glow we noted a white flash of light about the size and brightness of a bright star approximately 3-5 degrees above the mountains about 10 degrees North of the glow on the horizon. Initially we thought it might be an airplane but quickly discarded the idea due to the lack of conventional lights and the time lapse between flashes which were about four seconds apart. After about 3 flashes a second source of light appeared about 10 degrees to the north of the first one. At this point we pulled to the side of the road and watched the lights. Over the next five minutes or so we watched as several others joined the first two flashing lights. As they grew in number the lights began moving west along the northern horizon just a few degrees above the mountains. The only change was in the frequency of their flashes, which began to speed up to about one to two seconds apart. Suddenly, a red ball of light about three times the size of the White Flashers and much brighter, flared into being just north of the glow on the horizon. The red ball was a steady glow that lasted about four seconds as it slowly descended toward the horizon but winked out just before dropping down behind the hills. The White Flashers continued to increase in number and at one point we counted seven observable at a time; there may have been as many as 14 - 21 in the sky at the peak of this phenomenon, but do to their blinking nature, we could only count seven at any given time. We also noticed that the White Flashers seemed to begin pairing off, with the flashing alternating within each pair. Also, the flashing of each pair changed speed so that each pair seemed to be on a different time frequency from its neighbors. About five minutes after seeing the red flair, we observed a second red light, identical to the first, which repeated the same maneuver a little farther to the north. To this point, we had been watching this aerial show for about ten minutes. During this time, the White Flashers had been moving north along the edge of the sky. We continued to observe these lights as they traveled across the northern skies to the west, then, about fifteen minutes into our observation, they reversed their direction and began moving back to the east. As the main body of these pairs of lights reached a point in the northern skies just to the east of us, we observed three more of the bright red lights, but this time the maneuver was different. The red lights all maintained a horizontal flight. The first red light flared on, then, about a second later, another appeared just to the east of, and in front of, the first. As the two traveled east, they were joined a second later by a third appearing just in front of the second. At the same instant that the third light was flaring on, the first was fading out, so that only for the briefest instant were all three visible. A second later the second faded out followed shortly by the third. The total observation time of these three red lights was about five seconds, and they appeared to be precisely spaced and timed in duration. The three red lights traveled at about the speed of a small plane. After the last of the red lights went out, the white flashers continued traveling east and, over the next 10 minutes or so, they too began winking out. As the last pair winked out, I checked my watch. It read 10:35, the total observation time was about 30 minutes. After about five minutes we became aware of a second glow, far down the valley; below the mountains and much smaller and fainter than the one on the southeastern horizon and much closer. An inverted cone of light shot up toward the sky from the glow. Finding my binoculars, I could see there were actually three distinct sets of lights, each one appeared similar to the other two. On the bottom was a band of white light topped by two pulsating balls of light, one red and one blue, side by side. Emanating upwards from this was the inverted cone of white light we had noted without our binoculars. All three sets of lights were the same, except that the cones of light seemed to be waving about the sky like searchlights, all sweeping in different directions. They slowly approached our position. As we watched, the white band of light on each object coalesced into a pair of lights. A few moments later, as they streaked by, we could see that they were three, white \"Jeep Cherokee\" type vehicles carrying light bars over the cabs with red and blue flashing lights and small spotlights, the latter aimed up at the sky. All in a moment they were there and gone, disappearing from sight behind us over Coyote Summit. We discussed the trucks with their searchlights and decided they must either have come from the air base or possibly a local law enforcement substation. Either way, we couldn't see how they could not be connected with the aerial display we had witnessed."],"Date Submitted":"04/18/1996 10:05 UTC","Object Flight Path":"Path with directional change","Disposition":"Unknown","Longitude":"-105.039119","Case Number":"7560","files":["/var/www/straped/mufon/html2text/7560.html.txt","/var/www/straped/mufon/org/7560.html"],"Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=39.710482,+-105.039119(7560)&iwloc=A&hl=en\"> mufon case (7560) map </A>","City":"Denver","Date of the Event":"04/18/1996 10:05 UTC","Tags":"City","Region":"Nevada","trends":["There have been no other sightings in Denver","This sighting has never been favorited."]}