{"Object Shape":"Flash","Tags":"City","Case Number":"7561","Summary":"bottom part of extremely bright vertical lightning shaped cloud came off and slowly fell until it went out or just disappeared. It look like a large object was on fire as it fell.","map":"<A HREF = \"http://maps.google.com/maps?q=47.194298,+-122.285677(7561)&iwloc=A&hl=en\"> mufon case (7561) map </A>","divs":["Sighting DetailsAt about 8:45 P.M. on July 30, 2007, I went out on my second story deck in Puyallup Washington and noticed a really bright odd shaped cloud in the western sky. I first thought it was so bright because of the setting sun reflecting on it but it was much brighter than any other clouds in the sky. The cloud was shaped kinda like a lightning bolt but wider. At one point I thought I saw two lights in the cloud but only saw them for a second. The bottom part of the cloud separated and started slowly falling. It was falling so slowly I had time to get my binoculars. It appeared to be a large object on fire falling. It reminded me of pictures of something going through space with fire coming out behind it. It fell past a line of clouds and kept falling until it suddenly disappeared. I thought something exploded in the sky.I must have watched for at least ten minutes.From my deck I can see part of Tacoma and also the Olympic mountains, I could not tell how far away the object was. After the object disappeared the cloud changed shape and became more horizontal and spread out. Sorry to say, I had to answer my door and when I looked again the cloud was gone. It was the strangest thing I have ever seen. It must have taken about five minutes for the object to fall because it seemed so slow."],"Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/7561.html.txt","/var/www/straped/mufon/org/7561.html"],"Log Number":"US-07312007-0001","Date of the Event":"07/30/2007 08:45 UTC","Weather Factors":"None","Date Submitted":"07/30/2007 08:45 UTC","Region":"Washington","Disposition":"Unknown","Country":"United States","Source":"MUFON","Sighting Duration":"Undisclosed","trends":["There have been 13 other sightings in Puyallup","There were no other sightings in Puyallup on or around July 30th 2007"],"Latitude":"47.194298","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Longitude":"-122.285677","City":"Puyallup"}