{"Object Flight Path":"Straight-line path","trends":["There have been 55 other sightings in Ottawa","There were no other sightings in Ottawa on or around July 31st 2007"],"Latitude":"45.43133","Region":"Ontario","divs":["Sighting DetailsWoke up with dog barking. Was going to shut him up and looked out window to see what he was barking at. Shocked to see a large well lit top-shaped object flying west to east over our farm and just south of our house heading over the rideau river. was too upset to wonder what it was. just stared. object was well lit in relief by the full moon behind it. originally thought dog must be barking at the moon but he never really barks and being a bulldog really can't that well ... its a lot of effort for him and he is always quiet which is why i even got up to see what he was on about. I would guess the object was quite large, quite high up - 2000 feet? - could not really tell - was large ... object was greyish where the moon was illuminating it - definitely darker than the surrounding sky, had many bright lights on bottom in rings - random big square yellowish lights - and had a few red lights and other smaller white lights sprinkled over the surface randomly. could not see the top of it from my angle. no lights blinked. object did not spin, windows were wide open last night and object made no noise. moved very slowly eastward. watched it for about 5 to 10 seconds but seemed longer. i was really upset at what i saw .. i remember saying WTF out loud and went to another window on the other side of the bedroom for a better look as tree blocking my view from first window i viewed it from but object did not reappear on other side ... i continued to look for a few more minutes but saw nothing ... my dog stopped barking after i lost sight of the object and i went back to bed. looked at the clock and time was exactly 12:54 am so i saw something at 12:52-53. really upset me to see this, have no idea what it was and i had a lot of trouble going back to sleep. really tired today. searched the internet today to see if anyone else saw something last night and found this site to leave this message. the object was not a plane - too low for that - shape was all wrong. shaped like a child's top but did not spin .. had a lot of lights on it. it was huge. i could see this really well last night because of the full moon. image is imprinted in my mind and i can't forget it. i am hoping someone on the other side of the river saw it too last night so i know i am not losing my mind! I can still see it"],"Summary":"Grey - shaped like a top","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"07/31/2007 12:00 UTC","Case Number":"7562","Country":"Canada","map":"<A HREF = \"http://maps.google.com/maps?q=45.43133,+-75.689113(7562)&iwloc=A&hl=en\"> mufon case (7562) map </A>","Log Number":"CA-07312007-0002","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/7562.html.txt","/var/www/straped/mufon/org/7562.html"],"Longitude":"-75.689113","Sighting Duration":"Undisclosed","Object Shape":"Other","Object Features":"Other","Weather Factors":"Unknown","City":"Ottawa","Date Submitted":"07/31/2007 12:00 UTC","Source":"MUFON"}