{"Longitude":"-134.419722","Sighting Duration":"Undisclosed","Log Number":"US-08012007-0001","Object Shape":"Cylinder, Disc","files":["/var/www/straped/mufon/html2text/7567.html.txt","/var/www/straped/mufon/org/7567.html"],"Country":"United States","divs":["Sighting DetailsIt was the day that Flying Tigers ended their pilot's strike. I was flying at 41,000', I saw something that appeared to be getting larger in my cockpit window. I asked ATC if there was an airplane at my altitude ahead. They said no. I watched it some more and asked a passenger to come up and tell me what they saw, they saw the same thing that I did. I then asked ATC if they had an aircraft at 39,000' and they said no. I told them that I would likely be departing my altitude and heading soon. They asked what I saw and I told them. They asked if it was showing lights and I told them that I didn't see lights. There was a Flying Tigers 747 and a Western DC-10 below me at 33,000' and 35,000'. I first saw it when I was East of Annette Island and watched it until we were West of Biorka, Island. The two airlines were on the same ATC frequency and they were asked by ATC if they saw anything and they said no. A Weans Airlines B-737 was Eastbound and we saw it and it was showing it's lights. The 2 airliners asked me several times if I could help them see it but it was difficult because there were no clouds or anything that I could use as a reference. plus the altitude difference made the task more difficult. Finally, after asking several times, the ATC asked them if they saw it and one of them was in the process of saying no when someone in their cockpit said, \"There it is, it is something solid\". Then they pointed it out to the other airliner. I can't remember which one saw it first. It looked somewhat like a straight line or cylinder that would tilt to the North but not move from it's course and then it would sometimes appear to be round. I'm only guessing here but if he had been disk shape and tilting away from our path of flight, it would appear to be a straight cylinder but if it tilted away or toward us, it would appear round. I simply do not know. ATC said that they would send someone from Elmandorf AFB to check. Awhile later the thing seemed to disolve. If it fled away, it did so at such a tremendous speed that it seemed to shrink to nothing. All three aircrews were on the radio squalking about it's apparent speed. It left us like we were tied to a post. We, a little later, saw the smoking exhaust of two F-4s looking around but if whatever we saw was a craft that flew away, it would have been on the backside of the moon or somewhere by then. There is more to this event but not enough room to write. I'd tell the whole story if anyone is interested."],"City":"Juneau","Object Features":"Undisclosed","Source":"MUFON","Disposition":"Unknown","Summary":"It or I was closing fast then formed up. Cilinder like, would tilt to the North but not travel in that direction. Then it would appear round.","Viewing Distance":"Unknown","Date of the Event":"07/31/1983 12:00 UTC","Case Number":"7567","Region":"Alaska","Date Submitted":"07/31/1983 12:00 UTC","Object Flight Path":"Undisclosed","trends":["There have been 2 other sightings in Juneau","There were no other sightings in Juneau on or around July 31st 1983","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=58.301944,+-134.419722(7567)&iwloc=A&hl=en\"> mufon case (7567) map </A>","Latitude":"58.301944","Tags":"City","Weather Factors":"Unknown"}