{"Case Number":"7568","Object Flight Path":"Path with directional change","Latitude":"39.034832","trends":["There has been one other sighting in Beltsville","There were no other sightings in Beltsville on or around July 29th 2007"],"Country":"United States","Disposition":"Insufficient Data","Object Shape":"Diamond, Star-like","files":["/var/www/straped/mufon/html2text/7568.html.txt","/var/www/straped/mufon/org/7568.html"],"Date of the Event":"07/29/2007 10:15 UTC","Log Number":"US-08012007-0002","divs":["Sighting DetailsI was in a parking lot, driving south, when I saw what appeared to be a very bright star to my south slight southeast. The weather was thick clouds with intervels of light rain, though it was not raining during the event. The \"star\" appeared to be going north slight northwest at a very slow pace. It almost looked like a helecopter with a searchlight, a very very bright searchlight. The objects light would rotate from the far side of the object to my nearest side, but would only rotate the 180 degreese on the west side of it. I would have then dismissed it as just a helecopter, maybe looking at an accident on the nearby highway, but what changed my mind is when I noticed the object was not producing any sound at all and it wiothout any delay or anything that would indicate it was turning, flew westward, possibly slight southwest, from my aroximate 11 o' clock to my aproximate 2 o' clock in no more than 3 seconds. I would say it was definentally going faster than even a jet. During the whole thing the object never apeared to gain any altitude. The most odd thing is that from the starting point of the object traveling from my 11 o' clock was that it was flickering very brightly and as it progressed it would flicker faster and the flicker would become more and more dim, untill at my aproximate 2 o' clock it dissapeared. I watched for a moment to see if it had just gone into a low lying cloud, but it never reappeared. This object is one of the many odd things I see around here, but this is the hardest for me to explain. My husband described a similar event to mine, but his object flew faster than mine. We saw these on different dates at different times than each other."],"Tags":"City","City":"Beltsville","Sighting Duration":"00:00:10","Viewing Distance":"Over One Mile","Summary":"Object that looked like a star, came tward me, then immedietly west, traveling accross the sky for 3 seconds then dissapears.","Source":"MUFON","Object Features":"Unknown","Region":"Maryland","map":"<A HREF = \"http://maps.google.com/maps?q=39.034832,+-76.907474(7568)&iwloc=A&hl=en\"> mufon case (7568) map </A>","Date Submitted":"07/29/2007 10:15 UTC","Weather Factors":"Rain, Light","Longitude":"-76.907474"}