{"Weather Factors":"None","Date of the Event":"09/11/2001 09:15 UTC","Object Shape":"Unknown","Source":"MUFON","divs":["sighting detailsafter the day's events on 9\\11\\2001, i had a quiet dinner with my wife and two young sons at our home in northern virginia. we recapped the day by watching one more cycle of news and then retired upstairs to read stories with the children at about 9:00 (i believe). at that time, we lived under a normal approach vector for iad (washington-dulles int'l airport); the silence without air traffic that evening was remarkable. we had been reading with our boys for 15 or 20 minutes when the sound of a high-performance jet engine could be clearly heard approaching from the east at very high speed; in a moment it roared over our neighborhood at about 2000 feet (i could see its nav lights and beacon through the top of our arched window). several seconds, perhaps as many as ten, went by and before the jet's engine faded away another could be heard approaching at the same pace. it too roared past on the same heading as the one before it. i excused myself from reading, picked up my vhf\\uhf scanner from my nightstand, and activated my preset bank of military frequencies. in the absence of other chatter, i picked up the two aircraft almost instantly. their identity was easy to determine because they were identifying nearby landmarks as they established a reconnaissance pattern. what was clear was that they were searching for an unauthorized aircraft that was eluding them, dulles approach, and the regional faa center. the pilots seemed to establish sporadic visual contact with the aircraft but -- within a minute of my listening -- lost track of it. listening to the scanner, i left the house and within two and a half minutes ascended a man-made hill that rises to tree top level and above the roof lines of the nearby houses. from there i listen for another seven to nine minutes to the ensuing radio traffic. as i recall, the military pilots briefly reacquired the aircraft on an eastward heading and then lost it again. during that time they discussed what type of aircraft it might be but were unable to draw any conclusion. two military helicopters dispatched from dca (washington national) joined the operation. they were identified as \"eagle 1\" and \"eagle 2\". i believe that the jet pilot in command radioed eagle 1 saying, \"we'll try to drive him to you.\" my recollection is that the choppers were between arlington and falls church, virginia when they spotted the unknown aircraft. they both commented on its speed and then eagle 1 asked eagle 2 if he could id (identify) the aircraft. eagle 2 replied that he could not and that he had \"never seen a light pattern like that before.\" at this time, an aircraft controller broadcasting from a frequency used by andrews air force base announced that an observation aircraft had just achieved operational altitude. from subsequent chatter it seemed to answer the description of an awacs platform. the awacs crew announced that it was fully operational and \"could see the heat plumes coming off the [generator] stacks on the choptank [river].\" very shortly after the lead jet pilot asked eagle 1 if he was still tracking the aircraft. eagle 1 replied that it was \"headed for the [potomac] river\". the jet aircraft had by then overtaken the choppers and the jet wingman asked his lead \"do you have it?\" there was a pause and then the tense reply \"it's directly over the capitol\" and then words to the effect of \"i'm on it.\" there was a pause and the wingman asked, \"you got it?\", the leader replied, \"no, i lost it -- i think it's headed south down the river.\" the leader asked the awacs if he was tracking any southbound aircraft. \"negative\" replied the awacs, then added something like \"it's clear from here to richmond [virginia].\" the controller on the tower frequency asked the lead jet pilot if he could identify the unauthorized aircraft. the pilot replied, \"negative.\" the controller paused and asked, \"are you declaring a ufo?\" there was no response. the controller asked again more clearly but the leader only replied with a quiet \"no.\" eagle 1 and 2 declared their return to dca. what was singular in this event was the very real frustration and anxiety of the pilots in dealing with an aircraft that was both unknown and operationally superior. i have never heard anything to substantiate or validate this experience. i can only assure you that my hearing is excellent and i am not given to exaggeration or falsehood -- indeed, it has taken me six self-conscious years to log a story that most people will likely regard as fiction."],"Date Submitted":"09/11/2001 09:15 UTC","files":["/var/www/straped/mufon/html2text/7572.html.txt","/var/www/straped/mufon/org/7572.html"],"Country":"United States","Region":"Virginia","Viewing Distance":"Over One Mile","City":"Sterling","Summary":"Military Aircraft Pursue UFO Over DC and Northern Virginia on 9/11/2001","Log Number":"US-08012007-0006","Case Number":"7572","Latitude":"39.001333","map":"<A HREF = \"http://maps.google.com/maps?q=39.001333,+-77.408297(7572)&iwloc=A&hl=en\"> mufon case (7572) map </A>","trends":["There have been 3 other sightings in Sterling","There were no other sightings in Sterling on or around September 11th 2001"],"Object Flight Path":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","Longitude":"-77.408297","Disposition":"Unknown","Object Features":"Undisclosed"}