{"Tags":"City","Region":"Illinois","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Date Submitted":"08/01/2007 11:00 UTC","Disposition":"Unknown","Country":"United States","Weather Factors":"None","Log Number":"US-08022007-0001","Summary":"Triangle 5 large lights white to yellow no noise slow cruse towards SE","divs":["sighting detailsmy neighborhood is loaded with very large trees, so our sky view is limited from our personal backyards. i used to work for an aviation company, therefore, i understand the blinking lights, etc. i've spent way too many hours at an airport strip for private owned aircraft. this aint right!!!! it was a tight narrow\\tall triangle it was just above the tree tops, maybe 1\\2 a tree higher. the lights were not the small lights of an aviation aircraft. they were much larger! i realize that when the aircraft is lower to the ground, the lights appear larger. this was larger than that!!! not a single sound to be heard. it was crusing slow, at it's own pace. it was 5 lights in a triangle. the lights were a \"continous\" on! reminded of headlights, but below the object, not in front of the object. then my neighbors 2 story house blocked my view. i called my son on his cell, cause he was in town. by the time i ran to the front yard, it didn't matter. too many large tall trees. my son jumped in his car and made a drive. he swears he never saw it! i know what i saw!!!! i've never made a report in my life before this!!! it was traveling sw. this happened at 11:00 pm, or at least close enough, within minutes. considering the time between tree blockage... i would have to say the sighting lasted maybe a minute, maybe less. i've been watching the night sky for 20 years. i raised my 4 sons to watch the night sky's. this is my 1st freak out!!! i need to get a tape measure out and try to figure out the size accordingly. i only saw light formation. i never saw an outline of the object. it is a full moon night. the full moon is in the sw region. but it did not illuminate the object."],"Longitude":"-89.644007","Source":"MUFON","files":["/var/www/straped/mufon/html2text/7576.html.txt","/var/www/straped/mufon/org/7576.html"],"Case Number":"7576","map":"<A HREF = \"http://maps.google.com/maps?q=42.468345,+-89.644007(7576)&iwloc=A&hl=en\"> mufon case (7576) map </A>","City":"Orangeville","Date of the Event":"08/01/2007 11:00 UTC","trends":["There has been one other sighting in Orangeville","There were no other sightings in Orangeville on or around August 1st 2007"],"Object Shape":"Triangle","Viewing Distance":"Unknown","Latitude":"42.468345","Object Features":"Unknown"}