{"Case Number":"7577","divs":["Sighting DetailsI was at my bedroom window looking out over Discovery Bay sometime in mid-August at about 11pm. As I was preparing for bed, I saw red, yellow, white, blue, etc. lights flashing quickly in a counterclockwise linear fashion around a sphere shaped object over the bay. The object was very still for a couple minutes, and I thought there must be a search and rescue helicopter down at the water. Then the object moved up in direct line, then hovered downwards in a direct line. Suddenly it moved to the left and once again began movements hovering directly up, then directly downwards, then back to the mid original position. The craft suddenly moved back to the right in the orbit that I originally seen it. Then it did a curious thing I've never seen before. Quite abruptly it flipped on its side, the lights going vertically now. In a blur of movement it ascended sky ward, but there was no sight of it in the air. I kept my sighting secret for years, fearing I would be told I was crazy. When I finally anounced what I had seen, my oldest son rewarded me with the insult. But the rest of my family has been very supportive, to my great surprise. I never wanted to see a UFO. I didn't care one way or another about their existence. But since that night in August of '02, I've felt very lonely and frightened. My life has been changed forever."],"Log Number":"US-08022007-0002","Date Submitted":"08/15/2002 11:00 UTC","trends":["There has been one other sighting in Port Townsend","There were no other sightings in Port Townsend on or around August 15th 2002"],"Longitude":"-122.750567","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Region":"Washington","Sighting Duration":"00:10:00","Object Shape":"Sphere","Object Features":"Dome","Date of the Event":"08/15/2002 11:00 UTC","files":["/var/www/straped/mufon/html2text/7577.html.txt","/var/www/straped/mufon/org/7577.html"],"Latitude":"48.121439","City":"Port Townsend","Weather Factors":"None","Source":"MUFON","Country":"United States","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=48.121439,+-122.750567(7577)&iwloc=A&hl=en\"> mufon case (7577) map </A>","Summary":"red yellow blue, etc blinking lights going counter clockwise on a sphere","Disposition":"Insufficient Data","Tags":"City"}