{"Object Features":"Unknown","Source":"MUFON","Object Flight Path":"Other","Viewing Distance":"Over One Mile","Date of the Event":"09/16/2006 10:10 UTC","Log Number":"US-08022007-0003","Sighting Duration":"Undisclosed","Country":"United States","City":"Surf City","files":["/var/www/straped/mufon/html2text/7578.html.txt","/var/www/straped/mufon/org/7578.html"],"trends":["There have been 2 other sightings in Surf City","There were no other sightings in Surf City on or around September 16th 2006"],"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.427112,+-77.54608(7578)&iwloc=A&hl=en\"> mufon case (7578) map </A>","Region":"North Carolina","Date Submitted":"09/16/2006 10:10 UTC","Weather Factors":"Unknown","divs":["Sighting DetailsI was sitting on the balcony of a seaside motel with my wife on a moonless night just star gazing and talking. My wife noticed a star that seemed to be moving in the low eastern sky. She pointed it out and I after a few seconds it started to move up and down. We both confimed with each other that it was moving. We watched it changed it's movement from up and down to left and right and reverse, diagonal and reverse, and a lateral zig-zag pattern from left to right and reverse. Each time confirming with each other that it had moved. I know that if the human eye stays fixed stars for over several seconds, they will start to oscilate, an optical illusion. But all the stars you stare at will move as a group due to this optical illusion. I came to the conclusion that this object was not a star based on that fact. This object moved independly within a small cluster of about seven stars that did not move when this object moved about. What was even more fasinating was that as this cluster of stars moved slowly across the night sky, this object remained in the proximity of the cluster and continued to move about. During the time period we observed the object it seemed to flash some soft light to the south; white, white, red, white, white, red, white, white in intervals of about five minutes apart. After observing the object for approximately ninety minutes, it stopped moving and seemed to take its fixed place among the small cluster of stars. We also came to the conclusion that this object had to be outside of Earth's atmosphere and the distances it must have been moving within its proximity had to have been hundreds of miles or more with each jump. It seemed as though this object was disguising it self as a star and it was having problems stablizing its position in the magnetic field around the earth. Of course,that's only speculation. But, it definatley was a UFO."],"Latitude":"34.427112","Tags":"City","Longitude":"-77.54608","Object Shape":"Star-like","Summary":"Star-like object moving irradically in fixed position within a small cluster of stars.","Case Number":"7578"}