{"Object Features":"Unknown","Tags":"City","Case Number":"7580","Country":"United States","Object Shape":"Sphere","trends":["There have been no other sightings in Spring Creek","This sighting has never been favorited."],"Weather Factors":"Unknown","Region":"Nevada","Object Flight Path":"Straight-line path","Longitude":"-115.585895","Date of the Event":"08/02/2007 10:05 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.726593,+-115.585895(7580)&iwloc=A&hl=en\"> mufon case (7580) map </A>","Source":"MUFON","City":"Spring Creek","Disposition":"Unknown","Date Submitted":"08/02/2007 10:05 UTC","Log Number":"US-08032007-0001","Latitude":"40.726593","divs":["Sighting DetailsWhile sitting on our deck, I noticed a rather bright light heading towards me coming from the West. It's elevation in the sky was slightly lower than the elevation I usually see Commercial Aircraft flying at. It was brighter than the brightest star in the sky by a magnitude of 2 or 3. At first I thought it was just an aircraft coming head on and the landing lights were on. Then as it came closer I noticed no navigation lights at all....no red or green flashes and no strobes. As the object passed in front of my view, I watched closely for any sign it was a conventional aircraft. There was no contrail, and absolutely no sound. As it moved away from me, the light was just as bright from the back as it was from the front of the object. I estimate the speed at about 450 to 600 MPH flying at about 15,000 to 20,000 feet. The object was about 2 miles out in front of me and traveling due East coming from the West. It traveled in a perfectly straight line. There were no elevation changes and no lateral changes. I watched the object until it went out of sight about 30 seconds after I first noticed it in the sky. I have over 30 years of being an aviation buff and can recognize many aircraft by their sound and shape alone. This was no aircraft I have ever seen. Since the night was very clear and temperatures at 5,000 feet are around 60F, there were no clouds or other visual obstructions. Shortly after seeing this object go out of sight, there were two separate commercial jets that flew over. Both of these jets made the usual rumble and I could see their navigation stobes easily. My wife was with me at the time and saw the object almost as long as I did. Although I have seen strange things in the sky before, and things like satellites reflecting the sun as they pass by, this is the first time I have felt confident enough to actually report a UFO sighting. I hope there are others who reported it."],"Summary":"Bright White Light moving towards the East at approximately 20,000 feet.","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/7580.html.txt","/var/www/straped/mufon/org/7580.html"]}