{"City":"Pewee Valley","Region":"Kentucky","Date of the Event":"08/01/2007 09:55 UTC","Object Features":"None, Other, Unknown","divs":["Sighting DetailsDisclaimer: First and foremost I should like to mention that this is not my first sighting by any means. If one pursues this case I shall speak all that I have experienced. Lastly I want to be put in contact with Stanton Friedman and Linda Moulton Howe. If anyone else poses as him or her chooses to investigate this besides Stanton and Linda there will be problems. I am a scientist will not trust none scientists or non professionals. This cannot be made public at this time please!!! The Description: I and my girlfriend had gone to my mother's house who lives in Oldham county. We live together in Jefferson county together. My mother, (Do not by any means contact here unless I otherwise say so! She is a witness to nothing.) needed help with work around the house and we also saw it as a good chance to get some laundry done. After all of these events had concluded I began carrying bags of laundry and else out to the car with my girlfriend. Then after having put the items in the car I noticed how clear the sky was. It seemed odd to me. Yet I live in Louisville and it is always poluted with things that blind the night sky from us usually, key word usually. My girlfriend asked me about the constellation peering through the trees directly toward the south. I told her that it appeared to me that we were looking at Sagittarius. We both commented on its brightness. We both stood facing the southern sky for about 4 to 10 minutes. She began to walk back toward the walkway leading to the front of the house. The street runs north to south upon where it ends abruptly. At this time I noticed that a star at about seventy degrees ascension to the the right of of said constellation was in fact moving from its position in the Northern direction. I asked loudly of my girlfriend if she can see what I am seeing. She confirmed that indeed she saw a star fly across the sky. It seemed to exit the atmosphere at about the same ascension on the opposite side of the sky in the Northern direction (North East). When we both began to focus on the sky more intently we then noticed three more objects in the sane area do the same exact thing. I noticed that the stars began to occasionally blink with unusually long intervals. During the third flying star another object seemed to move over us. Its lights strobed between three locations in the object. It also had a red light that danced about it as well. When it was directly over head its lights seemed to strobe most intensely. You cuold clearly see that the object was triangular and much darker than the sky itself. I will say it was blacker than black. It made no sound and seemed to be looking for something. We noth watched this happen four more times. We believed they were four objects like this at that moment. Yet it could have been less because not all four were in the sky all at once. I should like to note that planes were also flying in the sky as the do every night. These latter objects were sometimes higher than the planes but more frequently beneath the plane altitudes. What I had not fully noticed until this point was the hum coming from the woods. I have noticed this hum quite frequently as well. Yet it was coming from a feild that has only cattle. Like I said before I have had many experiences with this and have alot to say to Stanton Friedman if he contacts me. We walked down the street and determined that the hum was in the field even though at the prior position it seemed indeterminant. I saw that some light with no source seemed to illuminate the field behind the trees. At that momemt I did not want to put myself in danger and began to walk home with my girlfriend. I went in my mother's house and said goodbye to her. This is where I became certain that what we saw was not standard. We got in the car and headed out of the neighborhood. At that point I realized that one of these objects were right above us to our right soome hundred feet obave the distant trees. It slowly and silently moved and lowered in behind our car. I got out of the car and looked at it. It turned on all three white lights as it passed very close, almost tree level over the street heading North West. When we got to the neighborhood exit I saw it to our right and it flashed a light down below it that resembled lightening. In otherwords the light seemed to have a nervous sytem. And as usual ...this time we had no cameras. We were followed by a brand new suv with black tinted windows until we got on the expressway heading east. The vehicle then put on its breaks and pulled over after we were gone. There are many other details to this case that when I get either Stanton Friedman or Linda Moulton Howe I shall say. I have been silent about these mattersa for so long. I feel that its been long enough. PLease forward this to these investigators as soon as possible please. I want to help just as I need help. Lastly I need to be protected. I am employed by the University here. I hope to hear from you soon. Thank You."],"Source":"MUFON","Latitude":"38.310625","files":["/var/www/straped/mufon/html2text/7581.html.txt","/var/www/straped/mufon/org/7581.html"],"Longitude":"-85.48746","Log Number":"US-08032007-0002","map":"<A HREF = \"http://maps.google.com/maps?q=38.310625,+-85.48746(7581)&iwloc=A&hl=en\"> mufon case (7581) map </A>","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other,Unknown","Tags":"City","Summary":"I saw a total of nine unidentifiable objects. The two classes were that of flying stars and strobing blacker than black trinagular objects.","trends":["There have been no other sightings in Pewee Valley","This sighting has never been favorited."],"Weather Factors":"Unknown","Date Submitted":"08/01/2007 09:55 UTC","Viewing Distance":"20 Feet or Less","Country":"United States","Object Shape":"Sphere, Star-like, Triangle, Other","Case Number":"7581","Disposition":"Unknown","Sighting Duration":"Undisclosed"}