{"Date of the Event":"11/12/1961 12:00 UTC","Weather Factors":"Unknown","Latitude":"40.719883","Object Shape":"Sphere","Region":"New York","City":"New York","Source":"MUFON","Viewing Distance":"101-500 Feet","Summary":"spotted a ufo in BROOKLYN, OF ALL PLACES, A LONG TIME AGO","files":["/var/www/straped/mufon/html2text/7593.html.txt","/var/www/straped/mufon/org/7593.html"],"Country":"United States","Disposition":"Unresolved","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around November 12th 1961"],"Log Number":"US-08052007-0001","Date Submitted":"11/12/1961 12:00 UTC","Object Flight Path":"Hovering then path","Longitude":"-73.997633","Sighting Duration":"Undisclosed","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.719883,+-73.997633(7593)&iwloc=A&hl=en\"> mufon case (7593) map </A>","Case Number":"7593","divs":["sighting detailsi was on my way to pick up my date, after parking my car, and i looked up in the sky and that was a gigantic sphere, luminscent light, and rectangle windows. i ran up to a cabbie, who was waiting for a red light to change, and showed him the sky. he saw it and he took off. after about two or three minutes, the ufo took of both vertically and horizontally. there was no noise whatsoever. the ufo was large enough and close enough that one could not see the whole craft because of the 10 story apt buildings in the area. i ran to my date's house and found that her father, a dentist, was home and i persuaded them to go to the roof. he, and my date, went \\ up to the top of his building. we saw nothing. went downstairs and called the police. they said they had other reports of the spacecraft or whatever it was. next day, there was no mention of the incident in the newspapers. at the time, and even now, i thought andthink that it was a secret weapons that went astray and covered up by the us government. the main thing is that this craft was not just a light in the sky. it was very lowflying, or i should say, hovering without moving, until it took off. this is the first time i have ever related the story in writing. i stopped telling about the incident to my friends who find it very hard to believe especially since the venue was not arizona, etc. ufo's in brooklyn? well........yes. gerry studier"],"Object Features":"Window(s)"}