{"Country":"France","Tags":"City","Region":"Provence-Alpes-CÃƒÂ´te d'Azur","Object Shape":"Flash, Other","trends":["There have been no other sightings in Èze","This sighting has never been favorited."],"Longitude":"7.354725","Object Features":"Undisclosed","Viewing Distance":"Over One Mile","City":"ÃƒÂˆze","map":"<A HREF = \"http://maps.google.com/maps?q=43.723018,+7.354725(7595)&iwloc=A&hl=en\"> mufon case (7595) map </A>","Disposition":"Unresolved","Latitude":"43.723018","Case Number":"7595","Sighting Duration":"Undisclosed","Summary":"Flash on 01/0807 nad moving lights on 04/08/07","Weather Factors":"Unknown","Log Number":"FR-08052007-0003","divs":["Sighting DetailsOn the night of the 1st of August while looking at jupiter with a small telescope, i notoiced a bright light appearing from no where above the bay. The time it took me to stare at the stationary light, it flashed (very bright) about a couple of seconds after and disapeared. There was no sound. Actually the ther was no sound at all. I suddenly realised that all night wild life was dead silent and stayed for about a couple of mins after. I realised the silence when it started to make noise again. so i could not say if the silnce had started before the flash. On the night of the 4th. form the exact spot of the flash, suddenly appeared a bright light (brighter than jupiter ) and it moved very fast and completey silenty. Much faster than airline planes. it was very bright, and it had a half a circle shape. mouving very fast north east and was quiet highy since it passed the mountain range quiet easly. A couple of mints later from the exact same spot appeared a much les brighter point that travelled same direction and same speed. about 5 min later two planes seamed to be following in the same direction. they were much lower in alitude and slower. I had a chance to look a the bright lights briefly in the telescope. breifly becaused they moved so fast. The birightest one had a clearly a half circle or filled in horseshoe shape. the seconde one was much smaller and was a dot. the first one was bright white the sceond yellowish."],"Date of the Event":"08/04/2007 09:40 UTC","Date Submitted":"08/04/2007 09:40 UTC","Object Flight Path":"Stationary,Straight-line path","files":["/var/www/straped/mufon/html2text/7595.html.txt","/var/www/straped/mufon/org/7595.html"],"Source":"MUFON"}