{"Summary":"Spotted 2 objects over Reno","Latitude":"39.491616","Tags":"City","Region":"Nevada","Date of the Event":"08/05/2007 01:00 UTC","City":"Reno","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.491616,+-119.778265(7597)&iwloc=A&hl=en\"> mufon case (7597) map </A>","Weather Factors":"Unknown","Source":"MUFON","trends":["There have been 65 other sightings in Reno","There was one other sighting in Reno on or around August 5th 2007"],"Object Flight Path":"Path with directional change","Log Number":"US-08052007-0005","Disposition":"Unknown","divs":["sighting detailsmy husband and i were sitting on our deck in the backyard doing bird watching and lately been watching the skies. it's been active again. i was watching what few clouds that were forming when i caught out of the corner of my eyes two objects coming from behind a small sparce cloud. at first i thought it was two helicopters, side by side. they came from the north out of the cloud then turned to the east. they were very high in the sky, much higher than the normal airplanes we see. my guess is about 20,000ft or higher. they flew very prescision and the turn was not normal...too tight & smooth. no sounds or trails, silent. the color was gray\\white, no glare or reflection. we went to get a better view point, when we looked up and they were gone or out of sight. they were fast! this lasted approx. 10 seconds. when discussing this with my husband, who has better eyesight, said they were more of a cylinder shape, not at all like a helicopter. my background is that i have always watched the skies for many reasons. due to many personal sightings and living next to the north flight path of the airport and an aircraft enthusiast, i am comfortable in saying that this was not normal."],"Date Submitted":"08/05/2007 01:00 UTC","Viewing Distance":"Unknown","Case Number":"7597","files":["/var/www/straped/mufon/html2text/7597.html.txt","/var/www/straped/mufon/org/7597.html"],"Object Features":"Unknown","Object Shape":"Cylinder, Sphere, Unknown","Country":"United States","Longitude":"-119.778265"}