{"Date of the Event":"08/05/2007 12:00 UTC","Country":"United States","City":"Pearisburg","Summary":"UFO whizzes by throughout video.","Latitude":"37.333181","Case Number":"7598","Source":"MUFON","Date Submitted":"08/05/2007 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.333181,+-80.726021(7598)&iwloc=A&hl=en\"> mufon case (7598) map </A>","Object Flight Path":"Path with directional change","Region":"Virginia","Object Shape":"Disc","Viewing Distance":"Unknown","Object Features":"Undisclosed","Tags":"City","divs":["Sighting DetailsI am currently filming an area because I've photographed many strange things ...changing tree line, hovering objects, and flying disks there for a while. I found that my camera was only filming at 10 fps so I changed it to 20 frames per second and went back today and caught this on film. I didn't see it at all with my eyes. Lately though I am starting to see parts of them though. I can see just a glistening of them around tree's. When I photograph them they are only faintly visible. I read some articles on cloaking and that seems to be what they are doing...bending light so that they can be hidden right in front of a tree or other object. I contacted some of the companies working on cloaking technology as well as a professor at Duke University who hasn't written me back to tell them I have photo's of cloaked objects. Anyway the video shows an object at the 49 -50 second frame. I have now lost 17 pounds since I first posted here two months ago, only feel like eating 1 time a day and not that much, can't sleep."],"Sighting Duration":"Undisclosed","Disposition":"Unknown","Longitude":"-80.726021","files":["/var/www/straped/mufon/html2text/7598.html.txt","/var/www/straped/mufon/more/7598_submitter_file2__ufostillfrom20fpsvideo.jpg","/var/www/straped/mufon/org/7598.html"],"Weather Factors":"Unknown","trends":["There have been 8 other sightings in Pearisburg","There were no other sightings in Pearisburg on or around August 5th 2007","This sighting has never been favorited.",""],"Log Number":"US-08052007-0006"}