{"trends":["There have been 32 other sightings in Bakersfield","There was one other sighting in Bakersfield on or around August 5th 2007","This sighting has never been favorited.",""],"City":"Bakersfield","Sighting Duration":"00:10:00","Weather Factors":"Unknown","Date Submitted":"08/05/2007 12:00 UTC","Viewing Distance":"Unknown","Region":"California","Longitude":"-119.014932","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=35.382942,+-119.014932(7605)&iwloc=A&hl=en\"> mufon case (7605) map </A>","files":["/var/www/straped/mufon/html2text/7605.html.txt","/var/www/straped/mufon/more/7605_submitter_file1__ufo1.JPG","/var/www/straped/mufon/more/7605_submitter_file2__ufo2.JPG","/var/www/straped/mufon/more/7605_submitter_file3__P1010016.JPG","/var/www/straped/mufon/org/7605.html"],"Object Features":"Undisclosed","Country":"United States","Disposition":"IFO","Date of the Event":"08/05/2007 12:00 UTC","Source":"MUFON","Case Number":"7605","Log Number":"US-08062007-0007","Summary":"Multicolored lights hovering with no sound, changing shapes, smooth movement","Object Flight Path":"Undisclosed","Latitude":"35.382942","Object Shape":"Other","divs":["Sighting DetailsI was sitting at my PC when my dog, who was outside, started barking. I went to see what was causing him to bark, opened the kitchen door, and almost directly over my head were these red, green, orange, and blue lights, literally changing positions in the sky. I stood and stared at these lights for about two or three minutes, not comprehending what I was seeing. There was no sound. I had the impression the lights were were connected to something that was fluid like. I then ran into the house and grabbed my digital camera, and went back outside and took some pictures. The object seemed very low in the sky, and didn't seem that large, but in the pictures it seems alot farther away. I took about 15 pictures in total. I could hear other people in the neighborhood observing it. After what seemed like about ten minutes, all the lights suddenly \"snapped\" into a V shape, and the object just \"slid\" across the sky. I heard the neighbors also observe the transformation. The object then hovered briefly, and then moved off towards the southeast, in the direction of the city of Lancaster. To be honest, when I first saw it, I thought it was my eyes playing tricks on me. Then, I thought maybe a ballon with lights on it. Then I thought maybe a laser. Then I realised, this is like nothing that could ever be duplicated, with any technology that I know of, and I was scared. I am still shaking. As for how the object moved, initially, there didn't seem to be any pattern or design to the order in which the lights were configurd. It was just twisting around. But when it snapped into the V shape, it had a \"sringiness\" to it, kind of like if you unfolded a hand fan, but it kind of bounced back on itself. After the object moved off, people in cars stopped and asked me if I had seen it too, and which way it went. Apparently, lots of other, including my neighbors, witnessed this event. If this was some kind of hoax, it was the most amazing hoax I have ever witnessed."]}