{"Tags":"City","Viewing Distance":"101-500 Feet","Date of the Event":"07/29/2007 12:15 UTC","Country":"United States","Case Number":"7609","Object Features":"None","Object Shape":"Sphere, Other","City":"San Clemente","trends":["There have been 15 other sightings in San Clemente","There were no other sightings in San Clemente on or around July 29th 2007"],"Weather Factors":"None","Date Submitted":"07/29/2007 12:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.431183,+-117.603292(7609)&iwloc=A&hl=en\"> mufon case (7609) map </A>","Log Number":"US-08062007-0011","Longitude":"-117.603292","divs":["sighting detailsmy girlfriend and i were driving south on the 5 freeway coming home to san diego from l.a. when we were inbetween the 2 exits for san clemente park i saw a bright orb hovering above the trees and homes to the right of the freeway. it must have been 90 feet up. it was pulasating bright to dim. there was a truck that was pulled over on the side of the road and a man was looking at this thing. at first it looked like a light but as we passed it we could see it was not attached to a pole or anything, it was floating\\hovering. after we passed it i could see it in my review mirror and my girlfriend could see it cause she was not driving...it continued to pulse. i pulled of at the next exit and turned around and could see the orb still pulsating but now it was a lot dimmer. as i drove towards this thing it was getting dimmer and dimmer and then was it gone. we drove around and waited for like 5 minutes and then left. the neighborhood seemed completly oblivious. we were near camp pendlton (a marine base) and we talked that it could have been some sort of military thing but we were still pretty far from the base and this was not a flare. this thing was stationary."],"files":["/var/www/straped/mufon/html2text/7609.html.txt","/var/www/straped/mufon/org/7609.html"],"Summary":"Orange/red orb that was pulsating","Latitude":"33.431183","Disposition":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Region":"California"}