{"Log Number":"US-08062007-0013","Date of the Event":"06/30/1964 12:00 UTC","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.115706,+-115.171366(7611)&iwloc=A&hl=en\"> mufon case (7611) map </A>","Longitude":"-115.171366","Sighting Duration":"Undisclosed","City":"Las Vegas","divs":["Sighting DetailsLas Vegas, NV -- July of 1964 -- 7 months pregnant I'm in bed but can't get comfortable -- then I remember I've forgotten to take the water pill my doctor just prescribed. My grandmother had given me a lecture on how important it was to take the pills and I pull myself up reluctantly. I get up and go to the kitchen. I see it's bright outside, through the curtain, and I think there must be a full moon. I take my pill and just as I put my glass on the counter the room begins to shake. I've been in after shocks in California and I think it must be a quake. It lasts for just a short time and I'm excited. My husband has slept through the quake and I will have something to tell him the next morning. I start back to bed when I hear the noise. It's like humming telephone wires but different, more insistent. I check the oven, the refrigerator, the toaster. I listen to the telephone wires in my backyard, but it's not them. Then I realize the noise is coming from outside. I go to the front door and open it. My front door faces south onto a large vacant lot with more undeveloped acreage beyond that. My front door does not face the homes across the street which are east of me. My duplex is on a rise with homes (east) and one home above me on the hill to the west. It's quiet and a little isolated. When I open the door all these bright lights are in my face. I can't see so I keep covering my eyes with my hands and keep trying to peek out. I imagine there's been a car accident on the hill above me but there are no sounds. When the lights dim there, in front of me in the vacant lot, sits a flying saucer. I don't believe in flying saucers. I think I go into shock because the next thing I remember is standing in my living room with my hands to my sides clenched in fists. I have no words. I am fighting to get words. My mind is a blank slate and its been wiped clean. I am fighting so hard I can feel a fine sweat break out on my forehead. Finally I have words. Flying saucer and then flying saucer again. I have words. I go to the front door. It's just sitting there. Red, white and green lights form a halo near the top and they are flashing on and off in rhythm. It's humming. I watch it. I look at my new princess phone -- but don't use it. I think of waking my husband -- but don't. All that separates me from the saucer is a tall wooden fence. I go to the fence and peek over. I can see the rim around it but I can't see the bottom. I look at all the houses around me. No one is out but me. I am alone, intrigued but afraid. I go to the end of the fence but become afraid and go back. I look for windows or doors on the craft but don't see any. It glows from the inside. The lights keep going on and off and it keeps humming. I close the door, slap my face and open the door. It's still there and I keep watching. I find myself leaning relaxed and comfortable against the door frame. I am alarmed. Something is wrong. How could I be so relaxed! Then I go to bed. The next morning I think I tell my husband I saw some funny lights outside. I avoid walking in the vacant lot which I used to use as a shortcut to a small convenience store. Perhaps I avoid it because I'm so far along in my pregnancy and there's a hill. I have a beautiful baby boy in September. The next month I'm on my way to my surprise baby shower with my husband and another couple. The woman said she had just read a book about flying saucers. No sooner does she say the words \"flying saucer\" then I break out with my story. They all look at me like I'm nuts. This is the first time I remember seeing it. I try to find newspaper stories about the month of my sighting to see if anyone else saw it, but don't find anything. I am a busy young mother and now I read everything I find about saucers. Seven years later I decide to see a hypnotist. I tell him I saw a flying saucer and want to remember it. He tells me he doesn't believe in flying saucers but thinks there might be a problem, something traumatic I don't want to remember. I say fine, I think I saw a saucer but if you can show me differetly let's do it. Little happens the first two sessions. I am not a good subject and I get so nervous before the appointments that I'm almost bouncing off the walls. At the third session I really go under. He has me imagine I am walking down a corridor of offices. My name is on one of them and when I get to it I am to open it and see my problem. I see myself walking and I see my name on the door. I'm hesitant. He tells me to open the door. I put my hand out to open it but then a hand, just a hand, comes out from the right and slowly and methodically erases my name from the door in a slow circular motion. He keeps telling me to open the door and I begin laughing. I tell him I can't open it because a hand came out and erased my name. He tells me I have a \"mental block\" against remembering. I decide not to go again. First I'm too nervous. I become a nervous wreck before each session and I'm wasting money. Those are the reasons I use not to go again. As the years pass the feelings of nervousness subside, coming about once a year around July, the month of my sighting. I tell my family doctor and he says he knows me to be an honest, normal person and there are some things we may never get the anwer to in our lifetimes. I do not know about the concept of \"missing time\" until I read more books on the subject of flying saucers. I am not a flying saucer nut. I attend no conventions or tell everyone about it, but I know what I saw. I am divorced and working for the court system in Las Vegas. I run across a web page from someone called Bob Bigelow who is collecting information and I make contact. I end up telling my story to one of his people and he asks if I would consider further action like hypnotism. I say no. Now I'm 63 and watcing the Larry King Live show and they're talking about flying saucers. I decide to contact MUFON. I feel time is running out to get this resolved and I've come to believe it's possible that my incident had missing time. Perhaps, on the small chance my incident might reveal more information, I decide to call. I can't say that I believe I was abducted. I truly hope I wasn't, yet something is wrong. Why is this still affecting me so strongly and why did I go back to bed? Why was I leaning against the doorframe when I should have been on the alert? Even as I write this I vacillate. Part of me wants to find out and the other part is frightened."],"Date Submitted":"06/30/1964 12:00 UTC","Tags":"City","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/7611.html.txt","/var/www/straped/mufon/org/7611.html"],"Summary":"Saucer landed outside my duplex on a vacant lot. I was 7 months pregnant at the time and watched it for at least 20-30 minutes.","Weather Factors":"Unknown","Latitude":"36.115706","Region":"Nevada","Object Features":"Undisclosed","Object Shape":"Circle","Disposition":"Unknown","Case Number":"7611","Country":"United States","Source":"MUFON","trends":["There have been 229 other sightings in Las Vegas","There was one other sighting in Las Vegas on or around June 30th 1964"]}