{"Tags":"City","Viewing Distance":"101-500 Feet","Longitude":"-119.701419","Object Features":"Unknown","Log Number":"US-08062007-0014","Latitude":"36.826368","Region":"California","Object Shape":"Sphere, Star-like","files":["/var/www/straped/mufon/html2text/7612.html.txt","/var/www/straped/mufon/org/7612.html"],"City":"Clovis","Date Submitted":"08/03/2007 09:17 UTC","Summary":"Small white sphere traveling from south to north","Weather Factors":"None","Disposition":"Insufficient Data","Object Flight Path":"Straight-line path","divs":["Sighting DetailsI left my apartment at approximately 9:10pm, drove threw a nearby residental area here in Clovis Ca look up from my convertable car and noticed a small white ball of light traveling from south to north. The object appeared was traveling about the pace of a jet airplane, but noticed no blinking lights. So, I pulled over next to this house and turned my car off to listen for any sound. I could hear no sound even as I placed my hands by my ears to focus sound better. The object traveled in a relatively stright line but appeared to be shifting side to side very slightly. The oject appeared to be as bright as the planet Venus except it appeared to be traveling approximately 1500 feet in the air. The object continued to travel north until it disapeared into the night sky. It just seemed strange that the oject still appeared as a ball of light from its \"rear\" side as it went past. I read a simular description that appearently took place in Reno NV at 10:30pm on the same night with the object heading in the same direction. I wondered if this could be the same oject so I decided to share my experience."],"map":"<A HREF = \"http://maps.google.com/maps?q=36.826368,+-119.701419(7612)&iwloc=A&hl=en\"> mufon case (7612) map </A>","Case Number":"7612","Source":"MUFON","trends":["There have been 20 other sightings in Clovis","There were no other sightings in Clovis on or around August 3rd 2007"],"Sighting Duration":"Undisclosed","Date of the Event":"08/03/2007 09:17 UTC","Country":"United States"}