{"Disposition":"Unknown","Case Number":"7614","Log Number":"US-08072007-0001","Date of the Event":"06/30/1964 12:00 UTC","Region":"Texas","trends":["There have been 19 other sightings in Garland","There were no other sightings in Garland on or around June 30th 1964"],"Latitude":"32.917514","Source":"MUFON","Tags":"City","divs":["Sighting DetailsI was a child at the time of the event. There had been a lot of sightings the summer I saw the UFO so I spent manny evenings in the back yard to see if I would see one. This happened in Garland, Tx in the summer of either 1992 or 1993. As I remember, the luminous circular object came over the small, single-story house we lived in. The house initially obstructed it from view but as it slowly moved over the house the object was entirely visible. It didn't make any sound at all. It moved until it was directly overhead and then instantly was gone as if turning off a light. I ran into the house to tell my parents and there was a \"special report\" by one of the local tv stations asking anyone who had witnessed the UFO to call in. I believe the reporter was Bob Gooding. My parents didn't call it in. I don't have any way to estimate the size but it was a clear night and it had to be reasonably low in altitude since the house obstructed it initially. I would discount the sighting due to my age at the time but it made a big impression on me and it still seems like it happened yesterday. Also, the \"special report\" should be easy to verify as far as the date. I've done internet searches trying to get the date but I've never seen any other accounting of the sighting. I did hear many years later that it was a meteor that crashed, but I can tell you that doesn't fit the object I saw which would have caused substantial damage because it was the size of a 10\" saucer at about 8 feet. So if you extrapolate that it would have to be at least 50 to 100 feet across. There would have to be many people that saw it."],"Longitude":"-96.631543","files":["/var/www/straped/mufon/html2text/7614.html.txt","/var/www/straped/mufon/org/7614.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.917514,+-96.631543(7614)&iwloc=A&hl=en\"> mufon case (7614) map </A>","Country":"United States","Object Flight Path":"Path then hovering","Sighting Duration":"00:00:10","Summary":"Luminous UFO","Date Submitted":"06/30/1964 12:00 UTC","Weather Factors":"Unknown","Object Features":"None","City":"Garland","Viewing Distance":"101-500 Feet","Object Shape":"Circle, Oval, Sphere"}