{"divs":["sighting detailsi have no idea if what i saw was a craft, but i was startled at the sight of it. i was in my backyard in new jersey, stargazing as i normally do. i believe i was looking in the northwesterly direction though i could be wrong. the evening did have sporadic cloud cover, but my attention was focused on a clear area of the night sky. i realize that when your eyes are adjusting to changes in light levels or when you are scanning the sky, things tend to look like they are blinking or moving. this wasn't the case. i also have 20\\20 vision in case my eyesight comes into question. i am never under the influence of anything other than my lovely wife. i had been looking at an area of the sky between two dim stars for a few minutes (five perhaps). there was nothing close to the brightness of venus or the moon where i was looking. i was startled to see a light appear in the sky between the stars. as far as i could tell, there was nothing between them previously (not that i could perceive anyway). the brightness grew in intensity quickly, over a few seconds, slightly brighter than venus appears. it didn't flash like anything i've ever seen in the sky. it only blinked once and went out, but for some reason it seemed to do so with purpose as if someone were behind it, flicking a light switch on and off. it went dark quickly and there was nothing in the sky after the light was gone. no distant star, no plane or helicopter. just space. it made my heart race. i've been trying to find out what it might be in terms of rational science and the closest is venus. this wasn't anywhere near venus. or the moon. this may not classify as something you would note as a significant sighting, but in my 37 years on the planet (earth, by the way) i have never seen anything like it. thank you, jon"],"Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Disposition":"IFO","Summary":"Flash or pulse of distant, bright light","trends":["There have been 3 other sightings in Red Bank","There were no other sightings in Red Bank on or around August 6th 2007"],"Region":"New Jersey","Latitude":"40.347054","Country":"United States","City":"Red Bank","Log Number":"US-08072007-0003","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Date Submitted":"08/06/2007 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.347054,+-74.064306(7616)&iwloc=A&hl=en\"> mufon case (7616) map </A>","Object Shape":"Flash, Star-like","Date of the Event":"08/06/2007 12:00 UTC","files":["/var/www/straped/mufon/html2text/7616.html.txt","/var/www/straped/mufon/org/7616.html"],"Longitude":"-74.064306","Case Number":"7616","Tags":"City","Source":"MUFON","Object Features":"None"}