{"Log Number":"GB-08072007-0005","Sighting Duration":"12:04:00","Source":"MUFON","Country":"United Kingdom","map":"<A HREF = \"http://maps.google.com/maps?q=55.956942,+-3.178597(7618)&iwloc=A&hl=en\"> mufon case (7618) map </A>","Longitude":"-3.178597","Viewing Distance":"Unknown","Weather Factors":"Unknown","Region":"Scotland","Date of the Event":"08/08/2007 12:00 UTC","Summary":"Two objects, traversing at same speed for 15 seconds with second one accelerating ahead( playing)","Latitude":"55.956942","City":"Edinburgh","Object Features":"Undisclosed","Object Shape":"Blimp, Circle, Oval","Disposition":"Unresolved","divs":["Sighting DetailsWell i was taking the rubbish(garbage) out for my mother at approx midnight, with the dog also! Went in to the back garden to get the big green bin, it was a lovely night, warm, clear sky, stars were all out. I stood there i looked up at the sky, with tilted head back an perfect view of the stars, an first looked at what looks like a frying pan or what people an i describe as the pot, for 2 minutes, turned round to the left an looked up with my whole head back, the next part i could'nt believe. as clear as day i seen two objects that were roundish traveling very fast at the same speed they were illuminated with an reddish orange light going almost around the objects, they traveled at the same speed for about ten seconds then the other object accelerated slightly ahead then back a bit trying to curve around the other one, like the second one was playing with it in some way, at 12:04am i tell you right now, it wasnot a satalite, or a jetplane no noise, the way they moved especially the second one was smart as f**k, it was either two ufo's (alien's -ebe's) or some secret craft, i was stunned, an this is fresh as you can get it at 1:24am in the morning, on my computer, i know what i saw- just like when you see a tree, as simple as that, end"],"trends":["There have been 6 other sightings in Edinburgh","There were no other sightings in Edinburgh on or around August 8th 2007"],"Case Number":"7618","files":["/var/www/straped/mufon/html2text/7618.html.txt","/var/www/straped/mufon/org/7618.html"],"Tags":"City","Object Flight Path":"Undisclosed","Date Submitted":"08/08/2007 12:00 UTC"}