{"City":"Fort Lauderdale","Country":"United States","Object Shape":"Cone","Case Number":"7619","files":["/var/www/straped/mufon/html2text/7619.html.txt","/var/www/straped/mufon/more/7619_submitter_file1__DwigginsMap008.jpg","/var/www/straped/mufon/org/7619.html"],"Tags":"City","Longitude":"-80.134269","Date of the Event":"07/15/1980 07:45 UTC","Region":"Florida","Weather Factors":"None","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=26.130288,+-80.134269(7619)&iwloc=A&hl=en\"> mufon case (7619) map </A>","Log Number":"US-08072007-0006","divs":["Sighting Details MY PARENTS ARE DIVORCED AND I WAS SPENDING THE SUMMER WITH MY FATHER AND HIS NEW FAMILY.. WE WERE DRIVING HOME FROM DINNER ONE EVENING AND I WAS SITTING IN THE BACK SEAT OF MY FATHERS CAR. MY BROTHER WAS VERY YOUNG AND LOOKING AT DISTANT AIRPLANE RUNNING LIGHTS..HE ASKED ME \"WHAT IS THAT\". I LOOKED IN HIS DIRECTION AND EXPECTED TO SEE AN AIRPLANE.. INSTEAD SAW A LARGE, HOVERING SHINY BLACK OBJECT THAT WAS SHAPED LIKE TWO ICE CREAM CONES WITH POINTED ENDS FACING UP AND DOWN WITH A CIRCULAR RING AROUND THE CENTER AND A SMALL BALL SHAPED PART ON THE VERY TOP AND BOTTOM. I REMEMBER THAT IT SEEMED TO BE PERFECTLY STATIONARY AND MAYBE A QUARTER MILE FROM THE ROAD AND PROBABLY NEARLY 50 FEET IN HEIGHT AND 20 FEET WIDE AT ITS CENTER.....BECAUSE IT WAS ALMOST DARK AND THE TIME THAT HAS PASSED IM ONLY CERTAIN OF THE VISUAL DESCRIPTION AND NOT THE REAL SIZE. WE HAD STOPPED FOR A LONG STREET LIGHT AND I WAS YELLING FOR MY FATHER TO LOOK AT IT, BUT AFTER A FEW MOMENTS WE BEGAN TO DRIVE OFF AND AS WE DID, THE OBJECT WOBBLED AS IF IT WAS A PENDULUM, THAT IS, THE TOP STAYED STILL WHILE THE BOTTOM ROCKED BACK AND FORTH AND IN ROUGHLY THE SAME TIME IT SHOT UP AND TO THE LEFT QUICKLY AND OUT OF MY VEIW. I DO RECALL OTHER PEOPLE STANDING NEARBY... POSSIBLY FROM PARKED CARS THAT LOOKED TO BE WATCHING IT ALSO. THIS MEMORY IS ALSO NOT VERY CLEAR. MY FATHER AND I NEVER TALKED ABOUT IT AGAIN...........IN FACT, IVE TOLD VERY FEW PEOPLE ABOUT IT. BUT IVE NEVER STOPPED WANTING TO TELL ANYONE THAT MIGHT BE INTERESTED AND NOT THINK THAT IM NUTS OR LYING. MY VISUAL MEMORY IS STILL FRESH BECAUSE IVE DRAWN THE OBJECT MANY TIMES SINCE THEN AND TRIED TO UNDERSTAND JUST WHAT IT COULD HAVE BEEN... IT LOOKED ABSOLUTELY BIZARE. I RECALL THAT I WAS EXCITED AND PRETTY SCARED AT SEEING THIS THING..IVE SEEN THINGS IN MY LIFE THAT WERE ODD BUT THIS THING FRIGHTENED ME."],"Summary":"WAS GETTING DARK AT NIGHT OBJECT WAS HOVERING AND JET BLACK","Disposition":"Unknown","Sighting Duration":"Undisclosed","Latitude":"26.130288","Source":"MUFON","trends":["There have been 37 other sightings in Fort Lauderdale","There were no other sightings in Fort Lauderdale on or around July 15th 1980","This sighting has never been favorited.",""],"Object Flight Path":"Hovering then path","Date Submitted":"07/15/1980 07:45 UTC","Viewing Distance":"101-500 Feet"}