{"files":["/var/www/straped/mufon/html2text/7621.html.txt","/var/www/straped/mufon/org/7621.html"],"Tags":"City","Object Flight Path":"Stationary","Date of the Event":"07/06/2007 10:05 UTC","Disposition":"Unknown","trends":["There have been 3 other sightings in Trout Lake","There were no other sightings in Trout Lake on or around July 6th 2007","This sighting has never been favorited.",""],"Source":"MUFON","Log Number":"US-08072007-0008","City":"Trout Lake","Region":"Washington","Sighting Duration":"00:26:51","divs":["Sighting DetailsMy partner (Astoria) and I (Dolphyn) were attending the ECETI Conference at the Sattva Sanctuary near Mt. Adams, WA. We were skywatching around 9:30 pm and waiting for the lights to fire up on the mountain. We noticed a large bright, glowing, sphere-shaped object in the western sky and checked it out with our spotting scope. We saw clearly that this object was undulating, moving like an amoeba or jellyfish. It contained what appeared to be thousands of teeny brilliant lights inside. We got out the camcorder and started to tape what we saw, although the camcorder didn't record exactly what we saw in the scope, it was still brilliant in the camera viewfinder. Astoria kept the object in her sight with the scope and I ran the camera as best I could. Once I got the camera settled on the tripod, I did not move the telefoto in and out, but yet the object appeared to move in close and move out without the benefit of the telefoto. We asked other conference attendees who were camping by us to look at it. They saw the same thing we saw, a glowing object that was moving in and out, close to us then far away. It didn't look like a plane, or a star, or a satellite. There was a square shaped apperature in the middle that moved like an 'eye' up and down and all around. This 'eye' movement was clearly visible when the object moved in close to us. After about 30 mins, Astoria saw lights coming out of the top of it, then the larger object went out of view, appeared to drop out of site. We also saw a smaller 'ship' that was at 2:00 to the larger object, which when viewed in the spotting scope, appeared to be doing the same undulations and was filled with bright lights, as well, although it looked to be much further away than the larger object. Through the spotting scope the object appeared to divide into large brilliant lights, but in the camera viewfinder it wasn't as apparent, although the lights were still visible. This occurred between 9:30 p.m and 10:20 pm. After we lost sight of the object, we began to focus our attention on the lights on the mountain. While we were viewing the western sky object, other conference attendees were watching Mt. Adams (which was to our right, or north) and their whoops and hoots could be heard on the tape as lights fired up on the mountain. We did tape a few of the mountain lights but they flashed on and off so quickly that it was hard to tape them. Around 11:30 pm, We grew tired and went into the motor home to sleep. Around 2 or 3 am, I was awakened by a bright flash, like someone was outside the motor home and took my picture with a flash camera through the window. I raised my head up to look outside the window and neither saw nor heard anyone outside. I looked at the mountain and saw lights going off all over, left and right, above the tree line. I laid back down and then saw a tiny brilliant light near the ceiling of the motor home. I watched the light move three times before I called to Astoria to wake her up and ask her if she saw it, too. This was not a frightening experience for me. The light didnot emmanate fear. If anything, I felt a calming, loving presence, which is why I wanted Astoria to see it too. But, when I spoke .. called her, it just disappeared."],"Country":"United States","Object Features":"Patterned Surface","Case Number":"7621","Weather Factors":"None","Object Shape":"Circle, Sphere","Date Submitted":"07/06/2007 10:05 UTC","Longitude":"-121.520837","Summary":"Brilliant glowing object western sky - no sound","map":"<A HREF = \"http://maps.google.com/maps?q=46.000283,+-121.520837(7621)&iwloc=A&hl=en\"> mufon case (7621) map </A>","Viewing Distance":"Unknown","Latitude":"46.000283"}