{"Viewing Distance":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/7622.html.txt","/var/www/straped/mufon/org/7622.html"],"Date Submitted":"08/07/2007 10:20 UTC","Latitude":"38.257755","Object Shape":"Flash, Star-like, Unknown","Tags":"City","Disposition":"Unknown","Region":"Kentucky","map":"<A HREF = \"http://maps.google.com/maps?q=38.257755,+-85.755656(7622)&iwloc=A&hl=en\"> mufon case (7622) map </A>","Object Features":"Undisclosed","divs":["Sighting DetailsTHANK YOU FOR THIS RESOURCE. ABOUT 10:20 PM LAST EVENING ON MY TO WORK TO DO 3RD SHIFT i NOTCIED A REDISH FLASHING OBJECT TO PASS ABOVE ME AT SOME ALTITUDE. i COULD NOT GIVE EXACT. ON THE WAY TO MY JEEP I TYPICALLY LOOK UP TO SEE WHAT STARS ARE OUT SO IM ALWAYS LOOKING UP AROUND THAT TIME ON MY WAY TO WORK. AS I LOOKED UP IT TOOK ME BY SUPRISE TO SEE THIS OBJECT AS IT WAS VERY CLEAR AND VERY NOTICABLE . I WOULD SAY THE DIRECTION WAS SOUTHEAST MOVING SLIGHTLY TO THE NORTHEAST, I STOOD IN MY YARD, I LIVE IN A RESIDENTIAL NEIGHBORHOOD IN LOUISVILLE KY, AND JUST WATCHED ...IT MOVED NOT IN A LINE AS AIRPLANES DO BUT HAPHAZZARD LIKE AND THEN AT ONE P0INT WHILE FLASHING IT SEEMED TO SPLIT IN TO AND SYNCHRONISTICLY FLASH LIKE ONE WOULD FLASH AND THE OTHER PART WOULD FLASH THEN THEY CAME BACK TOGETHER AND CONTINUED THEIR DIRECTION FOR A SHORT BIT THEN DISSAPEARED. THE WHOLE INSTANCE WAS MAYBE TWO MINUTES SLIGHTLY OVER TWO MINUTES....I ASSURE YOU WHAT I SAW WAS NOT NORMAL BY AVAIATION STANDARDS AND I WOULD NOT WASTE YOUR TIME BY TYPING THIS .. FEEL FREE TO CONTACT ME ABOUT ANYTHING FURTHER ..I DONT WISH TO GIVE OUT MY LAST NAME OR EXACT ADDRESS AT THIS TIME ..TAKE CARE, TIM"],"Summary":"FLASHING OBJECT MOVED SLOWLY AND SEEMED TO SPLIT INTO TWO","Weather Factors":"Unknown","Date of the Event":"08/07/2007 10:20 UTC","Case Number":"7622","Object Flight Path":"Undisclosed","Sighting Duration":"00:03:00","Longitude":"-85.755656","City":"Louisville","Source":"MUFON","Log Number":"US-08082007-0001","trends":["There have been 67 other sightings in Louisville","There were no other sightings in Louisville on or around August 7th 2007"]}