{"trends":["There has been one other sighting in Lake Los Angeles","There were no other sightings in Lake Los Angeles on or around May 31st 2007"],"Summary":"Flying Armchair","files":["/var/www/straped/mufon/html2text/7623.html.txt","/var/www/straped/mufon/org/7623.html"],"Date of the Event":"05/31/2007 05:00 UTC","Region":"California","Source":"MUFON","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.61249,+-117.828119(7623)&iwloc=A&hl=en\"> mufon case (7623) map </A>","Object Shape":"Other","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","City":"Lake Los Angeles","divs":["Sighting DetailsI live in the Mojave desert about 20 miles east of Palmdale,CA. On a June 2007 evening I walked outside to take some trash out and something caught my eye. An object that looked like a black armchair was moving past my home about 1000 feet above vertically and about 2500 feet away horizontally. It moved about 200 kts silently past my home and across the small town heading directly East. After crossing the town it appeared to accelerate and veer to the SouthWest. It was a deep black color and was easy to follow visually for quite a long distance. I was dumbfounded and didn't do anything but stand there with mouth agape while it went past me. It looked like the black armchair in the old Maxell commercials. Basically a black cube with a bit removed from the upper front. It was about the size of a washing machine, smaller than any aircraft I have seen. I had time to look away and then look back and reacquire it several times. I tried mentioning it to a good friend and judged from his reaction that I should just keep it to myself. He is a high-hour commercial pilot and basically said that no good would come to any aviator or engineer that claimed to seen anything unusual. Though I live in some proximity to AF Plant 42 and regularly see traffic from that facility they are generally on approach heading West into the wind for landing and are much higher. This uh chair was low, close and heading East without a sound. I'm a pilot & engineer and have 20-10 vision. Last flight physical rated my hearing as \"acute\". Now a camera and binoculars are kept on a hook near the front door."],"Object Features":"None","Object Flight Path":"Path with directional change","Weather Factors":"Windy, Light","Date Submitted":"05/31/2007 05:00 UTC","Log Number":"US-08082007-0002","Case Number":"7623","Disposition":"Unknown","Country":"United States","Latitude":"34.61249","Longitude":"-117.828119"}