{"Weather Factors":"Unknown","Latitude":"32.163215","Region":"Georgia","Object Shape":"Other, Unknown","Log Number":"US-08082007-0005","Date of the Event":"05/12/2007 04:40 UTC","files":["/var/www/straped/mufon/html2text/7626.html.txt","/var/www/straped/mufon/org/7626.html"],"Sighting Duration":"00:02:00","Country":"United States","Longitude":"-82.897493","divs":["sighting detailsthe day before mothers day my fiance and myself took off from peachtree dekalb airport in our aircraft (2003 cessna 172sp) enroute to mount pleasant regional (charleston,sc area). near the georgia\\south carolina border we where in and out of the clouds\\smoke from south georgia fires and on the traffic information system (tis) showed an aircraft with no transponder active (primary only) at our 6olock, the range on the gps moving map\\multifunction display was 10 miles. the unid aircraft the next second appeared 2\\5's of the way over the screen in a direct line for our aircraft (#xxxxx). the next second i recieved a traffic alert on my screen which indicated that a possible collision was about to occur. i turned on all of my aircraft lights and stobes. at this time, we where still in the clouds\\smoke and i was looking furiously to try and locate the aircraft to no avail. the next second, the aircraft again in a direct line with us, was 5\\5's from the bottom up screen. then the next second, the primary return disappeared, then my fiance about a second to a second and half said \"look it's back!\" which it was back at around 4\\5'. our route of travel was direct from kpdk -> klro via gps\\autopilot navigation. at my estimation later after thinking about what was that, is that the speed of the aircraft was around 7000kts. [pid\\tg] relocated urls to the text box at the bottom of the witness info section"],"Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile, Unknown","City":"UNKNOWN AT THE TIME","Date Submitted":"05/12/2007 04:40 UTC","Case Number":"7626","trends":["There have been no other sightings in UNKNOWN AT THE TIME","This sighting has never been favorited."],"Tags":"City","Summary":"RADAR/TRAFFIC INFORMATION SYSTEM SHOWS AIRCRAFT @ 7000KTS","map":"<A HREF = \"http://maps.google.com/maps?q=32.163215,+-82.897493(7626)&iwloc=A&hl=en\"> mufon case (7626) map </A>","Object Flight Path":"Path with directional change","Disposition":"Insufficient Data","Object Features":"Unknown"}