{"Log Number":"US-08102007-0001","map":"<A HREF = \"http://maps.google.com/maps?q=43.219305,+-123.335838(7634)&iwloc=A&hl=en\"> mufon case (7634) map </A>","Object Shape":"Star-like","Latitude":"43.219305","Viewing Distance":"Unknown","Region":"Oregon","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Case Number":"7634","Source":"MUFON","Weather Factors":"Unknown","Longitude":"-123.335838","City":"Roseburg","trends":["There have been 8 other sightings in Roseburg","There were no other sightings in Roseburg on or around August 8th 2007"],"Date Submitted":"08/08/2007 02:19 UTC","divs":["sighting detailsi was sitting outside having a smoke early in the morning (2:19am) on 8\\8\\07 and watching the stars as i frequently do. just above the northern horizon (nne), about 20 degrees above the ground level and about 10 degrees above the mountain top, i saw an apparent meteor travel quickly straight down (or nearly so) and disappear behind the mountain top. within two seconds it was followed by another traveling at the same speed and along the same path. this struck me as odd, since the meteors i usually see in the northern sky are much higher than these. even more odd was that there were two in a row following the same path. i reasoned that this could be space debris falling to the ground which had broken up on re-entry and was therefore on the same trajectory. i decided to report this after reading a similar account reported the same evening in oregon. i am still not sure what these were, since they appeared to be meteors and made no erratic movement. it just seemed odd that they would follow the same path and appeared to be travelling straight down (but could have been moving indirectly downward and toward or away from me at the same time). they were the same brightness and slightly brighter than the brightest star in the sky."],"files":["/var/www/straped/mufon/html2text/7634.html.txt","/var/www/straped/mufon/org/7634.html"],"Summary":"two apparent meteors shot straight down, 2 seconds apart, on same path","Disposition":"Insufficient Data","Country":"United States","Date of the Event":"08/08/2007 02:19 UTC","Tags":"City"}