{"Object Shape":"Disc","Viewing Distance":"Unknown","Weather Factors":"Unknown","divs":["Sighting DetailsIt was the week before Good Friday or a week before that. I was tilling my garden, preparing for planting. About 4 O'clock in the afternoon I decided to take a break and layed back in my lawn chair, for it was hot and the sky was clear. My chair was facing east and I looked up about 90 degrees and saw a jet contrail. The jet itself was about the size of a pinhead and shiney. The contrail indicated that it was traveling almost due east. I looked to the right and saw another jet (same discreption as first jet) moving from southeast to northwest. It was just above my treeline. They were both very high and seemed to be at the same altitude (altho I know each direction has an altitude to fly at.). I wondered where in the sky their paths would cross. As I looked in front of the east bound plane I saw a very large round object, about as big as a dime at arms length, and it was barely visable as if it was camoflaged like the bottom of a B-52, and there seemed to be a thin layer of cirus clouds underneath it. This object was also traveling east (no contrail, nothing) infront of the first plane at about the same speed. It was approaching the intersect point of the two planes. I looked back at the east bound plane, then at the northwest bound plane, then at the round object. The object had changed course and was traveling north east. I ran to get my camera but by the time I got back they were gone. I first thought that this was an object in orbit and wondered what do we have that big up there? Til it changed course. I would like to know what it was and have spent alot of time looking up since, hoping for another glance of the thing."],"Sighting Duration":"Undisclosed","Latitude":"32.36431","Object Features":"Undisclosed","Region":"Mississippi","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.36431,+-88.703656(7638)&iwloc=A&hl=en\"> mufon case (7638) map </A>","Date of the Event":"03/28/2007 12:00 UTC","Log Number":"US-08102007-0005","trends":["There have been 3 other sightings in Meridian","There were no other sightings in Meridian on or around March 28th 2007"],"Longitude":"-88.703656","files":["/var/www/straped/mufon/html2text/7638.html.txt","/var/www/straped/mufon/org/7638.html"],"Date Submitted":"03/28/2007 12:00 UTC","Tags":"City","Country":"United States","Object Flight Path":"Undisclosed","Disposition":"Unknown","Summary":"A round object about the size of a dime at arms length and very high altitude maybe being investigated by two jets.","Case Number":"7638","City":"Meridian"}