{"map":"<A HREF = \"http://maps.google.com/maps?q=45.805119,+-92.288813(7639)&iwloc=A&hl=en\"> mufon case (7639) map </A>","trends":["There have been no other sightings in Burnette","This sighting has never been favorited."],"Object Features":"Unknown","Date Submitted":"07/22/2007 11:30 UTC","Viewing Distance":"501 Feet - 1 Mile","Region":"Wisconsin","Tags":"City","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-92.288813","City":"Burnette","divs":["Sighting DetailsWas driving north on Wisconsin State Highway 26, approaching Burnett, a tiny town of probably less than 500 people, on the way from Watertown, Wis., to Waupun, Wis. I was driving home from a visit to my parents in Watertown. The trip takes about an hour. I had stayed later than I intended, because the family had rented \"Pan's Labyrinth,\" directed by Guillermo Del Toro, and I stayed to watch the movie. As I approached Burnett from the south, I saw a white light resembling an asteroid or other falling cosmic debris, but lacking the characteristic tail which accompanies such events, travelling at an estimated altitude of 1,000 feet and decreasing. This happened during a period when Wisconsin skys are constantly lit up with air traffic: the EAA Fly-in in Oshkosh draws aviators from all over the country, and planes of various makes and models travel north along an air coridor over Dodge County to get to OshKosh. However, this light remained constant, and lacked the slow on-off cycle characteristic of planes, which is why it caught my attention. It also appeared to be falling rapidly to earth. I have seen meteors and other natural phenomena along the same road. I travelled 26 between Watertown and Waupun regularly when I lived with my parents and commuted to my job in Waupun. I have since relocated to Waupun, and so the commute is only occasional. I kept my eyes on the object as it continued to fall to earth, passing over my car and becoming obscured by trees as I entered Burnett. As I drove through downtown Burnett, a bright flash, like lighting, lit up the northern horizon. There was no accompanying sound of thunder. There was no sound of impact or explosion. There was no sound of a sonic boom. The event lasted in entirety perhaps 30 seconds to a minute. The evening was clear, without clouds or thunderstorms. Still, on that evening, during that time of year, I was worried it was an airplane crash. A crash of any kind in Dodge County would be news, and so, upon returning to Waupun approximately 12 a.m. Monday morning, I immediately went to the office and called local county sheriff's dispatch operaters to see if anyone was working a plane crash. Dispatchers in Dodge County, Fond du Lac County, Columbia County and Green Lake County all said no such crash had occurred. The dispatcher in Fond du Lac county referred me to the media line. An EAA Aireventure-bound T6 Trainer plane had made an emergency landing near Fond du Lac Regional Airport earlier in the day. The emergency landing happened at approximately 7:45 p.m., hours before my sighting. I called back to see if anything had occured more recently; nothing had. I am thus at a loss to explain exactly what I saw in the sky over Northern Dodge, Southern Fond du Lac Counties that night. I mulled it over for several weeks, and only recently discovered MUFON (I at first thought it was a construct of the writers of the X-Files, of which I'm a fan) until I was reading livescience.com and saw the organization actually existed."],"Log Number":"US-08102007-0006","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/7639.html.txt","/var/www/straped/mufon/org/7639.html"],"Object Flight Path":"Other","Latitude":"45.805119","Country":"United States","Object Shape":"Star-like","Case Number":"7639","Source":"MUFON","Date of the Event":"07/22/2007 11:30 UTC","Summary":"Resembled a crash of some kind"}