{"trends":["There has been one other sighting in Napoleon","There were no other sightings in Napoleon on or around August 11th 2007","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","Tags":"City","Longitude":"-84.241542","Log Number":"US-08112007-0003","Object Flight Path":"Undisclosed","Source":"MUFON","Object Shape":"Undisclosed","Weather Factors":"None","Sighting Duration":"Undisclosed","Region":"Michigan","divs":["Sighting Details At about 1:45 pm EST the power flickered in my Clarklake, MI (Jackson County) home. After a moment of thinking what possibly could've made my power momentary interruption, I instinctfully, without prior thought, grabbed my camera and went outdoors to photograph the daturas in my garden. I am a semi-professional designer and amateur photographer and have been recently posting photos in a Flickr.com account. As I began to set up my SLR-type Sony Cybershot DSC-H5, I saw a flash in the NW skies, toward Jackson, MI (it is now about five minutes after the power flicker). I set the camera to auto and 'burst' two series of five photographs. Immediately I viewed them through the camera's 3-inch lighted view screen and saw one image with a definite black dot infront of a small cloud. At that point I went indoors and downloaded the images onto my computer and found that there were at least two objects, one definitely metallic and disc-shaped, flitting about the skies. I seem to have been missing about an hour's time while outdoors between the power interruption and photos. I thought that the photos were taken around 2pm. I recall that when the power was interrupted, I looked at the battery-operated clock on the bathroom wall it was about 1:45pm or so. I went outdoor right afterward and began to photograph my garden's flowers. I dodn't feel that I was out more than ten or fifteen minutes. When I looked at the computer clock and saw that it was well past three. I became very confused and slightly agitated. I looked at the digital photos and they were all stamped with times after 3pm. There is no way that I was outdoors for an hour or so... The 'segueway' was seamless...I do not recall the 'jump cut'...like when a movie is edited back together after snapping. You're in one place or whatever and suddenly you're somewhere else or doing something or you're just standing or sitting and completely confused. I don't recall any of that happening. Maybe the flashes of light I saw in the sky were some sort of indication of the 'experience' being underway or ending??? Wow..."],"files":["/var/www/straped/mufon/html2text/7642.html.txt","/var/www/straped/mufon/more/7642_submitter_file1__DSC02919_clarklake-mi-03_11aug07.jpg","/var/www/straped/mufon/more/7642_submitter_file2__DSC02920_clarklake-mi-04_11aug07.jpg","/var/www/straped/mufon/more/7642_submitter_file3__DSC02921_clarklake-mi-05_11aug07-b.jpg","/var/www/straped/mufon/more/7642_submitter_file4__witness_reenactment.JPG","/var/www/straped/mufon/more/7642_submitter_file5__witness_size_comparison.JPG","/var/www/straped/mufon/org/7642.html"],"Date Submitted":"08/11/2007 03:05 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.166324,+-84.241542(7642)&iwloc=A&hl=en\"> mufon case (7642) map </A>","Date of the Event":"08/11/2007 03:05 UTC","Object Features":"Undisclosed","Disposition":"Unknown","Case Number":"7642","Summary":"Power interruption, flashing in the sky, missing time, UFO photos","City":"Napoleon","Country":"United States","Latitude":"42.166324"}