{"Region":"Colorado","Date of the Event":"08/11/2007 10:03 UTC","Object Shape":"Unknown","Latitude":"39.748894","Viewing Distance":"Unknown","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around August 11th 2007"],"files":["/var/www/straped/mufon/html2text/7646.html.txt","/var/www/straped/mufon/org/7646.html"],"Object Flight Path":"Undisclosed","Summary":"Erratic movement","Source":"MUFON","Tags":"City","Weather Factors":"Unknown","Disposition":"IFO","City":"Denver","Date Submitted":"08/11/2007 10:03 UTC","Object Features":"Undisclosed","Case Number":"7646","Log Number":"US-08122007-0002","Sighting Duration":"Undisclosed","Country":"United States","Longitude":"-104.981163","divs":["Sighting Details1. I was talking inside to my boyfriend, the door was open. 2. From the corner of my eye I saw something that grabbed my attention. It was moving in a strange motion and was a yellow light. 3. When I first noticed it I thought it was a roller coaster in the distance and a local amuzement park, paying attention, it was making a movement that seemed to be consistent. 4. I disregarded it thinking it was a park ride and then noticed it again from the corner of my eye and saw that it was making movements that were not consistent and thought it was not a ride at all. It was going in a fast and irratic pattern that was not a helicopter or any type of aircraft I have ever seen. (later, when I called the Denver police, they forwarded me to the Denver DIA dispatch who said that Denver police was reporting a possible helicopter) 5. Frustrated. After trying to talk to authorities such as the denver police and faa I was caught in a run around without verification of a possible issue and left to feel kinda cooky. 6. We left to get a closer look, with no luck due to the tree line as it was close to the ground (closer than the planes taking off that we could see in the distance.) When we got back, the cloud cover had moved down and the sky was no longer clear."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.748894,+-104.981163(7646)&iwloc=A&hl=en\"> mufon case (7646) map </A>"}