{"Date Submitted":"12/01/1996 04:28 UTC","Weather Factors":"Unknown","Viewing Distance":"Unknown","Case Number":"7647","Log Number":"US-08122007-0003","map":"<A HREF = \"http://maps.google.com/maps?q=48.23442,+-101.286313(7647)&iwloc=A&hl=en\"> mufon case (7647) map </A>","Source":"MUFON","files":["/var/www/straped/mufon/html2text/7647.html.txt","/var/www/straped/mufon/more/7647_submitter_file1__untitled.JPG","/var/www/straped/mufon/org/7647.html"],"Region":"North Dakota","divs":["Sighting DetailsI was sleeping in my tent while out camping with some high school buddies of mine you know partying...when all of a sudden one of the girls my buddy brought accidentally kicked me in the side while running away from a large egg shaped floating and glowing object in the sky,.I sat there staring at it in fear, for what felt like 30-4omin, but when i finally relized what it was i was so freaked out and waking everyone up i forgot that it might be dangerous. so i told everyone to run and hide but by that time it was slowly moving towards us, although none of us knew if it had caught site of us yet.we waited awhile hoping it would fly away .as soon as looked up there was a VERY bright light shining in my face...from then on i can not remember anything but sirens from an ambulance my buddy johnny called for me,but he refused to tell me what happened and thats when i passed out. I woke up the next morning with an acing arm and when i looked down to see what was wrong i had a strange injury on my arm.Thats as much as i remember that is of importance except that no body knew how the cut got there... maybe i fell while running away to hide and just no one noticed."],"Tags":"City","trends":["There have been 11 other sightings in Minot","There were no other sightings in Minot on or around December 1st 1996","This sighting has never been favorited.",""],"Object Features":"Undisclosed","Date of the Event":"12/01/1996 04:28 UTC","Disposition":"Hoax","Summary":"it was at least 30 feet in length and glowing green, it just sat there","Latitude":"48.23442","Longitude":"-101.286313","City":"Minot","Object Shape":"Egg, Square, Rectagular","Sighting Duration":"03:30:26","Country":"United States","Object Flight Path":"Undisclosed"}