{"divs":["Sighting DetailsI didn't knew anything about God or the Bible and I had a nice and comfort life when I become abductioned of a UFO in 1994. I was hanging out at my window,leaning on my arms and look out at our meadow and it was a clear blue and high air night. The stars was shining bright on the clear darkblue sky. I felt it was someone looking at me and as I lived far out from the city with no close neighbour was it a strnge feeling. I looked were I felt it come from and looked up on our roof and there it was , it was so black so it was a huge different from the darkblue sky and the black triangle spaceship. Then I fins myself laying with my back in the windows and my body half out in the window and my nose up to the sky. I was lifted up and I tried to look in the windos of the spaceship but it was only dark the windows and I try to find anumber or text on it. I was use with airplane because we had an military airport 7 km from where we lived. Then did I come back to stand in the window just before it happen but I felt it was a time-wall I had coming out from, the sound from my TV and my daughter and her father in the next room was the same. Next day did we wake up early of sounds like heavy traffic. Not of wheels but sound of wind when something is going very fast in the air. It took some minutes for me to get up as it was about 7 in the Saturday morning and we wanted to sleep longer. I looked in the same window like the last night and I told my husband it was much cars going up in the forest so he had to see it too. We started to watch TV but my husband was curious as he had lived in the village for 15 years so he said \" I can't understand who has so big 50ths birthday party. It's only 10 families in the village so he and our daughter drove up in the forest. They come back and said they didn't met or saw any cars and at the road the drove on ends in th forest and then do you need to turn back the same way. The cars was all metallic gray and it was at least 300 car driving up there. I know where the mothership was because after the abduction was I frigthen to go to a special area in the forest when I picked mushrooms. I wasn't interested of airplanes or Nasa but after did I joined the military and become a sergeant in the airforce. And I joined a club for HAM-radio amatours and learn me that they surfing on the stars and moon for to reach a longer distance. And what it was that evening when I become abducted it was a clear blue sky and full moon and full of stars. It was in October I breaked up 1997 with my husband and later that year did I met and married a man in Texas and I come to find out that my husbands parents had been working for NASA their whole life inside NASA in their office in Florida. My mother-in-law did the drawings on their space maps. My parents-in-law died the same year I become married in Texas but I was visiting NASA 1999 did we moved from Texas when my husband become fired from his job. But in August 2000 when my husband was in Texas did God come down to my daughter and me. He was talking from the air, we never saw a body. My daughter joined a church next day and have been working for God since then. God make me leaving my husband and go back to USA for 3 and half year. And after God come down have I seen some of the characters in the Bible and they have been talking to me. I find out that I had got a mark in my forhead of God because it a spot I never had before that you can't see but sometimes do it bleeding maybe twice a year and it amazing me that it's the same amount of blood all the time. People ask me why I am bleeding but I can't feel it and the blood never reach my nose or are dripping as it is very thick dark blood. I say it's thorn of Christ crown I am 100% sure that God and UFO are together but I don't know how."],"trends":["There have been 2 other sightings in Lessebo","There were no other sightings in Lessebo on or around October 24th 1994"],"Weather Factors":"Unknown","City":"Lessebo","Object Flight Path":"Stationary","Disposition":"Unresolved","Country":"Kingdom of Sweden","map":"<A HREF = \"http://maps.google.com/maps?q=56.751264,+15.270001(7648)&iwloc=A&hl=en\"> mufon case (7648) map </A>","Region":"Kronoberg County","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/7648.html.txt","/var/www/straped/mufon/org/7648.html"],"Object Features":"Window(s)","Log Number":"SE-08122007-0004","Sighting Duration":"Undisclosed","Viewing Distance":"20 Feet or Less","Date of the Event":"10/24/1994 12:00 UTC","Summary":"Black,no sound,standing still in the air,no light on,no number or text on the spaceship.","Case Number":"7648","Date Submitted":"10/24/1994 12:00 UTC","Longitude":"15.270001","Source":"MUFON","Tags":"City","Latitude":"56.751264"}