{"Source":"MUFON","files":["/var/www/straped/mufon/html2text/7651.html.txt","/var/www/straped/mufon/more/7651_submitter_file1__IMG_3618s.JPG","/var/www/straped/mufon/more/7651_submitter_file2__IMG_3626s.JPG","/var/www/straped/mufon/more/7651_submitter_file3__IMG_3653s.JPG","/var/www/straped/mufon/org/7651.html"],"Viewing Distance":"Unknown","Case Number":"7651","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.782881,+-119.416422(7651)&iwloc=A&hl=en\"> mufon case (7651) map </A>","Object Flight Path":"Undisclosed","divs":["Sighting DetailsIt all started back in April when i saw some strange balloons that would move in strange ways and sometimes disappear. I made a few reports about them here at mufon. I kept seeing them, sometimes as a balloon and sometimes as a light in the sky. I tried to talk to them in my mind and sometimes I thought I heard them answere me. Then in june I went on vacation to Marbella Spain. The night before I left I went out on my balcolny and looked up into the night sky and I saw small points of light move flash and disappear, I told them I was leaving to Spain and asked them to come with me. Then I went to bed and as I lay in bed I heard a voice say \"we will come\". Then while I was on vacation I would see the same points of light at night move and flash and disappear,and one night I heard a voice say \"you have to help us find more people like yourself, people who can help us\" and I asked, help you do what? and the voice said \"help us make this world a better place\" and I asked, how would you make this world a better place and the voice said \"make your people become more like us\" I asked for more clarfication but the voice just kept repeating the same thing. When I returned back to southern California I decided that I must have invented the voice in my mind and that it was all imaginary. Then one day about three weeks ago I was folding laundry and I heard a voice say \"you are very important to us\" and I said to the voice that I'm just talking to myself and the voice said \"no you are talking to us and if you come outside right now you will see us and know that you are talking to us\" so I went out and stood in front of my garage and looked up into the sky and saw nothing but I heard the voice saw \"wait and you will see us, you have to be calm to hear us and patient to see us\" and after a few minutes a small pink light appeared in the sky and I took some pictures (the first posted with this report) then another white and somewhat larger light appeared below the pink one (second photo posted) then I went back inside and sat in the bathroom where it's quiet and tried to listen to them and the voice said the same thing I had heard in Spain about finding more people like myself and I told them my wife would never believe this (I had told her about the balloons and she had not believed me)and the voice said to bring my wife outside when she got home and they would show themselves to her so that she would believe me. So when she got home I told her what had happened and took her outside to see them (along with a pair of bioculars) and we stood in the same spot I had before and I told them in my mind that we were ready and after a few minutes a small white light appeared above us and I gave the binoculars to my wife so she could see them better (third photo posted) and she agreed that it was quite amazing. So I told them in my mind that I would introduce them to my Father who used to work for the Government and that he would be a better person to help them. So the next day I flew to Washington DC but when I saw my father a voice said in my head not to tell him about them and that I was in danger and had better leave the capital right away because other bad aliens were trying to \"scan\" me. And then things started to get really strange (maybe I'll write a book about it if I live long enough) and I left my Dads house(leaving him with the impression I had totally lost mind)and spent three days running for my life trying to get back home to So Cal. And the voice started telling my to do things like \"Swallow your tongue\" and other things that would do serious injury to myself and to make very long story short my oddessy ended with me punching a cop at lax and being locked up on a 5150 at ucla medical center. I was diagnoised as haveing a \"psychotic episode\" anyway I just wanted to tell other people who might be seeing strange balloons that they probably are more than just balloons and if you want to talk to them you probably can, but I warn you that, Ignorance is bliss."],"Date of the Event":"07/15/2007 12:00 UTC","trends":[""],"Summary":"I heard a voice in my head.","City":"Undisclosed","Latitude":"36.782881","Country":"United States","Tags":"City","Log Number":"US-08122007-0007","Longitude":"-119.416422","Date Submitted":"07/15/2007 12:00 UTC","Region":"California","Object Shape":"Undisclosed","Weather Factors":"Unknown","Disposition":"IFO","Object Features":"Undisclosed"}