{"Disposition":"Unresolved","Tags":"City","Object Features":"Undisclosed","divs":["Sighting DetailsI have seen when I lived in the same house where the abdotion took place many aliens. Once when I watch TV come an alien flying between me and the TV. She had a baby body but an adult face even if it was kid like with red curly hair like they had in the 20' She had no wings and she was smiling at me as she was playing a game with me. Another night did I waked up that an alien of same size was sitting on my husband hip. I wasn't frighten as I have been visited since 1977 of aliens. I tried to see how she looked like but she reflected the light so I could only see the contour I was thinking if I looked her for a long time she should show up more clear as other things do in the dark but it was like a soup-bubble that split and she was gone. Another time did I waked up that 2 meter slim glowing white-yellow aliens had open my head and looked inside my brain. I couldn't move but as I was use with aliens since 1977 did I knew to talk to them inside my brain and I said I was awake and when I said it I was blocked out again. My ex-husband want me to visit him in that house but I am too scared to go there anymore. I had no visit first in that house but we built a new house on the same place 1986 and we find it ws very much stone in the ground and also was it a sea under it so we had to install drain-pumps in the basement for not taking in water. I know it was a good ground for aliens to hit and also was I frighten every time it was thunder because it was like the thunder wanted to hit our house and it did 3 times in a time of one year. And it seldom tornado in Sweden but the house was hit 1990 of one. The house is like a big receiver. My ex-husband called me in 2005 that he had a very strange experience and he do not believe in UFO but he said when he was almost home he looked at his clock in the car and then was it like a time wall for him because when he looked at the clock once again had the time change and it was 10 minutes more on the clock and he was in the same place with the car !"],"Log Number":"SE-08122007-0008","Sighting Duration":"Undisclosed","Region":"Kronoberg County","Date of the Event":"Unknown","Object Shape":"Undisclosed","Object Flight Path":"Stationary","Summary":"No UFO","trends":["There have been 2 other sightings in Lessebo","There were no other sightings in Lessebo on or around"],"Case Number":"7652","Country":"Kingdom of Sweden","Latitude":"56.755704","Weather Factors":"Unknown","City":"Lessebo","map":"<A HREF = \"http://maps.google.com/maps?q=56.755704,+15.279441(7652)&iwloc=A&hl=en\"> mufon case (7652) map </A>","Viewing Distance":"20 Feet or Less","Source":"MUFON","Date Submitted":"08/12/2007 01:40 UTC","files":["/var/www/straped/mufon/html2text/7652.html.txt","/var/www/straped/mufon/org/7652.html"],"Longitude":"15.279441"}