{"Weather Factors":"None, Does Not Apply","trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around May 31st 1977"],"divs":["Sighting DetailsIvywild area, colorado springs approx 3:00 p.m. 1976 or 77. I was playing outside with my friend james, he looked up and said, \"what's that?\" I looked where he was pointing, and I saw 5 white, round objects, they were flying in an irregular, wobbly manner. They flew into a cloud, and about 1 second later, three of them flew out the other side. They flew around the cloud in the same manner as the first 5, for about 3 seconds, then into the cloud. The cloud was n.e. of us, approx above cheyenne mountain. James said he thought they were u.f.o.s, I had never heard of u.f.o.s. We watched them for 7-10 min, they kept flying into and out of the cloud, we got bored and went back to playing. Later that night, it was dark outside, and my mom told me and james to take out the trash. The dumpster was about 25 yards away. About half way to dumpster, there was very bright flash of white light, it seemed to be focused on my yard. James and I stopped in our tracks, he said, \"what was that?\" I said, \"I do'nt know\". We were both pretty scared, we ran to dumpster, threw in the trash,and when we turned around to run back to the house, I saw the same 5 white lights we had seen earlier. We ran back to the house, my mom was sitting near the window, I asked her if she had seen the light,she said she did not. The next day, I asked our next door neighbors if they had seen the light, they did'nt see it either."],"Log Number":"US-08122007-0010","Summary":"white spheres flying into cloud, re-emerging","Date of the Event":"05/31/1977 03:00 UTC","Sighting Duration":"06:00:00","map":"<A HREF = \"http://maps.google.com/maps?q=38.839882,+-104.819293(7654)&iwloc=A&hl=en\"> mufon case (7654) map </A>","Country":"United States","Latitude":"38.839882","Disposition":"IFO","Tags":"City","Object Shape":"Sphere","Date Submitted":"05/31/1977 03:00 UTC","Object Features":"Unknown","Case Number":"7654","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","City":"Colorado Springs","Longitude":"-104.819293","files":["/var/www/straped/mufon/html2text/7654.html.txt","/var/www/straped/mufon/org/7654.html"],"Region":"Colorado","Object Flight Path":"Other"}