{"Sighting Duration":"Undisclosed","Country":"Canada","Date of the Event":"06/15/2002 12:00 UTC","Tags":"City","Viewing Distance":"Over 1 Mile, Unknown","trends":["There have been 9 other sightings in Kelowna","There were no other sightings in Kelowna on or around June 15th 2002"],"Object Shape":"Sphere","Disposition":"Unresolved","Object Features":"None","Object Flight Path":"Stationary","Weather Factors":"Unknown","divs":["Sighting DetailsI was driving home from Kelowna British Columbia Canada after picking up a load of newspapers. As i was driving along the road ,I noticed a peculiar light beside and above my vehicle. I couldn't register in my mind the distant of the object.My first impression was that it was an aircraft, but it just \"hung\" motionless above my vehicle.It was very strange. At one point i pulled over to the side of the road and got out.I even motioned to other motorists to look up,but no-one seemed too interested to stop. I continued on my way ,every so often to look up, and still the object stayed above my vehicle.I travelled about 220 km or approx 140 miles.I was probably 15kms from my stop when the object started moving. I was astonished at the rate it went,faster than a jet in the sky, and then suddenly it took off over the horizon at an alarming rate of speed.I told my publisher at the time, when i arrived. The next day I was reading a newspaper and was surprised to notice a Reuters short about a crowd of people in Tokyo who witnessed observing an objectin the sky and dropping over the horizon at a high rate of speed. I was indeed happy that somebody finally noticed."],"Longitude":"-119.494971","Source":"MUFON","Case Number":"7657","Date Submitted":"06/15/2002 12:00 UTC","City":"Kelowna","map":"<A HREF = \"http://maps.google.com/maps?q=49.892022,+-119.494971(7657)&iwloc=A&hl=en\"> mufon case (7657) map </A>","files":["/var/www/straped/mufon/html2text/7657.html.txt","/var/www/straped/mufon/org/7657.html"],"Log Number":"CA-08132007-0001","Summary":"noticed a very bright light above highway on my way home","Region":"British Columbia","Latitude":"49.892022"}