{"Log Number":"US-08132007-0004","Object Shape":"Sphere","Viewing Distance":"21-100 Feet, 101-500 Feet","Region":"California","City":"Pomona","Disposition":"IFO","Country":"United States","Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Path with directional change","divs":["Sighting Details Im a trucker who has believed in UFO's for a long time now, so whenever I'm driving I'm looking to spot something in the sky. I was racing to my girlfreinds fathers house after work trying to make it there before midnight on new years eve.It was just about 10-20 seconds into new years day when I spotted the three orbs, they did not seem to be moving. There were fireworks going off all around that area, but these glowing amber orbs were stationary. They were about as high as the fireworks if not higher directly above interstate 10 frwy just a couple miles east of the 57 frwy. I lost sight of them as I passed underneath them. I pulled into the slow lane and stuck my head out of the window and slowed down and looked directly up. It was as if they saw me, two of them stayed stationary the other started to descend towards my car. Eyes back on the road I had to decide between between pulling over and speeding away. I told myself I sped away because I was already late for the party, but the truth is I remember being afraid of what might happen if I pulled over."],"Longitude":"-117.745855","Date of the Event":"01/01/2007 12:00 UTC","Case Number":"7660","Object Features":"None","Latitude":"34.058827","Date Submitted":"01/01/2007 12:00 UTC","Tags":"City","Weather Factors":"Unknown","Sighting Duration":"00:01:15","map":"<A HREF = \"http://maps.google.com/maps?q=34.058827,+-117.745855(7660)&iwloc=A&hl=en\"> mufon case (7660) map </A>","trends":["There have been 16 other sightings in Pomona","There were no other sightings in Pomona on or around January 1st 2007"],"Summary":"3 glowing amber spheres","files":["/var/www/straped/mufon/html2text/7660.html.txt","/var/www/straped/mufon/org/7660.html"]}