{"Date of the Event":"08/12/2007 09:40 UTC","Object Shape":"Star-like","Disposition":"Unresolved","trends":["There have been 3 other sightings in Nipomo","There were no other sightings in Nipomo on or around August 12th 2007"],"files":["/var/www/straped/mufon/html2text/7664.html.txt","/var/www/straped/mufon/org/7664.html"],"Viewing Distance":"Unknown","Case Number":"7664","Longitude":"-120.475999","Source":"MUFON","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=35.042755,+-120.475999(7664)&iwloc=A&hl=en\"> mufon case (7664) map </A>","Summary":"During Perseid shower, we observed light travelling Southeast to Northwest across sky in erratic trajectory.","Weather Factors":"Unknown","Object Flight Path":"Other","Sighting Duration":"Undisclosed","Date Submitted":"08/12/2007 09:40 UTC","Log Number":"US-08132007-0008","divs":["Sighting DetailsMy friend and I live in Nipomo, California, a rural area south of Pismo Beach - about half way between Los Angeles and San Francisco. Shortly after 9 PM PDT last night (070812) we drove to a remote area free of city lights to look for meteors from the Perseid shower. It was early in the shower's duration but we saw a few. We also noticed some high altitude aircraft flying in various directions in the sky. That they were aircraft was evidenced by the wing lights and strobes. At about 9:40 AM as we stared up looking for more meteors we saw a round, star-like light begin to traverse the sky from the south southeast to the north northwest. It seemed to be much higher than the aircraft we observed and we saw no wing lights or strobes. It also appeared to be moving much faster than the aircraft we had already seen. At first I thought it might have been a satellite. But as we watched we both were aware of the fact that the trajectory of the object was not smooth (as satellites appear). Rather, it was jerky and zig-zagged along its path. We followed the light across the sky until it disappeared over the horizon. I wouldn't bother to report this sighting had it not been for the odd, herky-jerky character of its trajectory. My friend is very pragmatic and quite skeptical regarding extra terrestrial craft but she could find no other explanation for the sighting than to admit that she felt she had seen her first UFO."],"City":"Nipomo","Region":"California","Object Features":"Unknown","Latitude":"35.042755","Country":"United States"}