{"Longitude":"-112.067727","Disposition":"Unknown","Object Flight Path":"Straight-line path","Region":"Arizona","Summary":"Falling light blue sphere.","files":["/var/www/straped/mufon/html2text/7667.html.txt","/var/www/straped/mufon/org/7667.html"],"Date Submitted":"08/11/2007 10:20 UTC","Sighting Duration":"Undisclosed","Source":"MUFON","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around August 11th 2007"],"Latitude":"33.450817","divs":["Sighting DetailsMy wife and I were driving north on I-17 to return home to Flagstaff. We had dropped my father off at the Econo Lodge near the airport earlier that evening, as his flight left the next morning. We had dinner about an hour and a half before at the P.F. Chang's in Scottsdale. My father and I had water, my wife had literally two swallows of a gin and tonic (which I scolded her for, since she was wasting it by not drinking it). It was a fairly clear night, as we saw several meteors later in the evening while driving home. A mile or so before Cold Creek Canyon, my wife and I seemingly both looked to the east side of the highway, approximately 100 feet up, at the exact same moment. There was no reason for me to look in that direction, as I was driving. There was nothing for a second, but then, suddenly, a very bright light blue sphere of light, about dime sized, going straight down. The light only lasted for one second. My wife only saw one sphere of light. I saw two distinct spheres. Firstly, a smaller sphere appeared about of nowhere, then disappeared, then reappeared at a slightly lower altitude about four times as large as the original. The light was very bright, but not blinding. If we had been closer, however, it would have blinded us. The shade of blue was very light, not as bright a blue as xenon headlights. The center of the sphere was bright white, fading into the light blue. The light itself appeared very suddenly and disappeared suddenly, as if a light switch was flipped. Since the object was only visible for a second, we had no time to analyze it until after the fact. Car? No, much too large, going straight toward the ground. Too bright. Helicopter? No. Too steady, again going straight toward the ground. No other lights were visible. Fireworks? No. No flare effect, fading, arc, or sound. Again, it was like a switch was flipped. The light was there, then it wasn't. Meteor? No. Trajectory, lack of sound or crash, and sudden appearance and disappearance of the object argue against this. The sighting was over so quickly that our reaction was confusion, since it wasn't immediately identifiable as something \"normal.\" I was amazed at how large and bright it was, and my wife said \"What the hell was that?\" after it disappeared. A short while later I regretted not stopping the car and pulling over to see if we could see anything else."],"City":"Phoenix","Date of the Event":"08/11/2007 10:20 UTC","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.450817,+-112.067727(7667)&iwloc=A&hl=en\"> mufon case (7667) map </A>","Object Features":"None","Weather Factors":"None","Log Number":"US-08132007-0011","Object Shape":"Sphere","Case Number":"7667","Country":"United States"}