{"Date Submitted":"08/11/2007 10:30 UTC","files":["/var/www/straped/mufon/html2text/7674.html.txt","/var/www/straped/mufon/org/7674.html"],"trends":["There have been 9 other sightings in St Clair Shores","There were no other sightings in St Clair Shores on or around August 11th 2007"],"Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Latitude":"42.49672","Log Number":"US-08142007-0005","Sighting Duration":"Undisclosed","City":"St Clair Shores","Object Shape":"Bullet, Missile, Sphere","Summary":"Dim yellow object turning very bright white back to dim yellow","Region":"Michigan","Disposition":"Unknown","Case Number":"7674","Viewing Distance":"Unknown","Object Features":"Undisclosed","divs":["sighting detailsi was looking east from 10 mile and gratiot area looking for perseid shooting stars. i saw what looked like a satellite, it was small, i would guess 15+ miles away, appeared high in altitude at about 45 degrees elevation, though no trees or anything to compare size to. it looked to be moving at least as fast as a jet and perhaps as fast as a satellite but looked a little oblong or bullet shaped. i say satellite because i have seen satellites on several occasions and the color yellow relflected and size shape and movement were similar to a satellite in orbit. i started wondering if it was a ufo and suddenly the craft began to slow down to approx 1\\4 speed and it started increasing in intensity until it was by far the brightest thing in the sky and very white and looked round. the brightness would be equivalent to one of those whitish bright headlamps on brights setting at one block away. the color was the same color as a large meteor burning up through the atmosphere, a brilliant white, which i have seen on several occasions. then the craft turned down or off the bright white color and it was dim yellow again as it started gaining speed back to the original speed. i had binoculars with me and quickly looked at the ufo. it appeared slightly bullet shaped and by the time it had reached north northeast it was too far away to see with binoculars. if it was above 35,000 feet it was moving much faster than a passenger jet, at least 5 times as fast. i dont know what could be that small at a lower altitude, but it would have to be smaller than a passenger plane. there was no sound, very little wind. there were no clouds in the sky to the entire east during the sighting. the perseids were pretty disappointing since i only saw four decent meteors, but i did see a couple other small shooting stars as well as the moons of jupiter. it was not a meteor because it slowed down - got bright - sped up- all in a straight line tangent to the atmosphere"],"Longitude":"-82.887374","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.49672,+-82.887374(7674)&iwloc=A&hl=en\"> mufon case (7674) map </A>","Date of the Event":"08/11/2007 10:30 UTC","Country":"United States"}