{"Country":"United States","Summary":"I NOTICED A GLIMMERING OBJECT AT A HIGH ALTITUDE.","Region":"New Jersey","Object Shape":"Triangle","Log Number":"US-08142007-0007","divs":["Sighting DetailsAT 7 PM ON AUG 14 2007 I WAS LAYING ON MY BACK DECK AFTER GETTING OUT OF MY POOL AND WAS WATCHING THE AIR PLANES FLY OVER ON THERE WAY TO PHILA INTERNATIONAL ARIPORT. I THEN NOTICES A GLIMMERING OBJECT TO THE LEFT OF THE PLANES FLYING OVER BUT IT WAS AT A VERY HIGH ALTITUDE. THE VISIBLILTY WAS UNLIMITED BUT THERE WAS A HIGH CEILING ABOVE THE AIRPLANES . THE OBJECT WAS FLYING INTO THE HAZE AND OUT AGAIN. IT WAS TRAVELING SLOWLY IN A NORTH WEST DIRECTION. I YELLED TO MY WIFE TO BRING ME MY TELESCOPE AND SHE DID. KELLY ALSO SAW THE OBJECT AND I TOLD HER NOT TO LOOK AWAY BECAUSE WE MAY LOOSE IT. SHE KEPT HER EYES ON IT AND I SET UP MY SPOTTER SCOPE [MY SCOPE IS A BSA 20-60X60MM } IT IS GOOD FOR STAR GAZING . I LOOKED THROUGH THE SCOPE BEFORE I SET IT UP, FEARING THE OBJECT WOULD DISAPPEAR, AN I DID GET A VERY BRIEF LOOK AT THE OJBECT AND IT LOOKED LIKE A VERY SHINY TRIANGLE. THE SUN WAS BOUNCING OFF IT . I TRIED TO ACQUIRE IT AGAIN BUT COULD NOT THROUGH THE TELESCOPE. WE DID SPOT IT WITH OUR EYES AGAIN BUT IT DISAPPEARTED INTO THE OVERCAST. WE GOT INTO THE CAR AND DROVE INTO THE GENERAL DIRECTION FOR APROX 10 MILES BUT WE DID NOT SEE IT AGAIN. THE ACTUAL SIGHTING LASTED ABOUT 5 MINUTES. [ SINCE I AM A MUFON INVESTIGATOR I WILL BE SUPPLYING MORE INFO ABOUT THIS SIGHTING ]. I.D. 11124 KEN PFEIFER NEW JERSEY."],"Viewing Distance":"Over One Mile","Longitude":"-75.071031","Date Submitted":"08/14/2007 12:00 UTC","trends":["There have been 9 other sightings in Franklin","There were no other sightings in Franklin on or around August 14th 2007"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.622231,+-75.071031(7676)&iwloc=A&hl=en\"> mufon case (7676) map </A>","Tags":"City","Weather Factors":"None","Disposition":"Unknown","Date of the Event":"08/14/2007 12:00 UTC","Sighting Duration":"Undisclosed","Object Features":"None","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/7676.html.txt","/var/www/straped/mufon/org/7676.html"],"City":"Franklin","Source":"MUFON","Case Number":"7676","Latitude":"39.622231"}