{"Tags":"City","Disposition":"Unknown","Case Number":"7678","trends":["There have been no other sightings in fairfax station","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=38.800833,+-77.325833(7678)&iwloc=A&hl=en\"> mufon case (7678) map </A>","Object Shape":"Unknown","Region":"Virginia","files":["/var/www/straped/mufon/html2text/7678.html.txt","/var/www/straped/mufon/org/7678.html"],"Country":"United States","Date Submitted":"08/15/2007 02:16 UTC","Date of the Event":"Unknown","Log Number":"US-08152007-0001","Viewing Distance":"501 Feet - 1 Mile","Latitude":"38.800833","Object Flight Path":"Hovering then path","Source":"MUFON","divs":["Sighting DetailsI was in my bed on the second floor the house reading at the time. At 12:44 am on Wednesday, I head a loud noise that seemed to be overhead of my house. At first I thought nothing of this sound since I thought it might have been an airplane that low but that changed when I heard what appeared to be the engine sound vanished. I assumed that the plane had left but then I heard it the sound again so I rush to my bed to see what is going on. So I open the blind on my window to look outside to see what is going on. In the distance not that high up in the horizon slightly above the trees in my neighborhood were four flashing white lights that were stationary objects at the time. There are no towers in this area I was looking at so I assumed it was some type of aircraft in the air not moving. But then one of the flashing lights on the west side started to move alarming fast toward the west. Did a quick reverse like slamming on the brakes. Then shot out of my line of sight. The other objects remained still. Then the other three objects began moving. These three objects were in the formation of a triangle and by moving increased the size of the triangle but seemed to keep the same angel on the shape. Then the objects left the area, it appeared as though they had turned off the lights. With this all of a sudden the sound I had heard had vanished."],"Summary":"for flashing lights","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-77.325833","City":"fairfax station","Object Features":"Unknown"}