{"Source":"MUFON","files":["/var/www/straped/mufon/html2text/7680.html.txt","/var/www/straped/mufon/org/7680.html"],"Case Number":"7680","Date Submitted":"08/11/2007 08:13 UTC","Log Number":"US-08152007-0003","Viewing Distance":"20 Feet or Less","Country":"United States","Summary":"We saw a star like sphere move from west to east in the ski then take off into space","Longitude":"-117.641172","Object Flight Path":"Stationary,Straight-line path,Path with directional change","Object Shape":"Sphere, Star-like","Sighting Duration":"Undisclosed","Date of the Event":"08/11/2007 08:13 UTC","City":"Ladera Ranch","Latitude":"33.550735","Object Features":"Other","Disposition":"Unknown","Tags":"City","Weather Factors":"Unknown","trends":["There have been no other sightings in Ladera Ranch","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.550735,+-117.641172(7680)&iwloc=A&hl=en\"> mufon case (7680) map </A>","divs":["Sighting DetailsA friend and I were in the backyard sitting down looking at the stars. I noticed a star that was still all of a sudden start to move from west to east. I pointed in the direction of the star and asked my friend if he is seeing this star move. He acknowledges. I say to him this thing is really moving fast and he agrees. I call my wife who is inside watching TV. She does not hear me so I go around the side of the house where we are sitting and call her to come over because she needs to look at this. She comes out and sees the same thing. Then all of a sudden the star brightens up and takes off in a 45 degree angle into space as this happens my wife notices just west of where we are looking three more smaller star like spheres take off also in the same direction. We then sat for two more hours looking in the same general direction but we did not see anything else. 1. We were sitting down looking at the stars. 2. It started to move from west to east real fast. 3. At first I thought it was a meteor but it was pretty bright. It was as bright as the brightest stars. However not as bright as a planet. So I thought could this be a UFO ? 4. It was moving real fast since this object was in space and moving from west to east then when it got brighter it took off into space and got real dim as it left. 5. I felt this must be a UFO especially when my wife noticed the three other objects all do the same thing. 6. We lost sight of the object when it (They) took off in a 45 degree angle into space."],"Region":"California"}