{"Longitude":"-96.756108","Tags":"City","City":"Lancaster","files":["/var/www/straped/mufon/html2text/7682.html.txt","/var/www/straped/mufon/org/7682.html"],"Date Submitted":"08/11/2007 07:15 UTC","trends":["There have been no other sightings in Lancaster","This sighting has never been favorited."],"Object Features":"Undisclosed","Summary":"Lights, metal craft or creatures, camera got the shot, couldn't see with naked eye","Region":"Texas","Sighting Duration":"00:02:00","Source":"MUFON","Case Number":"7682","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.59208,+-96.756108(7682)&iwloc=A&hl=en\"> mufon case (7682) map </A>","Object Shape":"Other, Unknown","Latitude":"32.59208","Country":"United States","Weather Factors":"None","Date of the Event":"08/11/2007 07:15 UTC","Object Flight Path":"Undisclosed","divs":["Sighting DetailsI was sitting on my roof taking pictures of the last moments of sunset over the tree line. I saw NO lights against the blackened treeline. I had my Digital Canon Pwershot SD500 set to manual with \"no flash\". This allows me to pick up colors in the sky when there is very little light. When I downloaded the pictures I noticed a string like object that kept changing shapes traveling north just above the tree line. Then in the lower right hand corner of the picture on the ground was this silver looking object that appeared to have a head and large eyes with black dots in the center - no other lights were around it. In the next few pictures a little to the right of where this object was, red lights appeared and what seemed to be 2 small beings. In the next few pictures the lights covered more space and the beings moved. I have sinced taken pictures of this area with every setting and at every hour and can't see anything but a blackened area. My neighbor has no trouble lights, or barn lights in this area and said they hadn't been to this spot in the back of their property. I went to check it out for myself and took many pictures during the day. The tall weeds and grass appeared to basically be undisturbed except for a possible impression of something round with indentions in four quads within. This was very subtle and without being able to get high above the ground it wasn't definitive. What I did define was that no person had been tromping around or drving in this area. Very disturbing. I have 19 pictures in progression pointed in this direction. Again, the whole time I was taking these pictures from my roof, I never saw any lights. The distance from where I was shooting the pics and the location is about 700 feet. I have studied these pictures and tried everything I can think of to come up with a logical explanation but I am convinced of the ET nature of this event. I have protected my pictures on the camera's Lexas 2GB SD card to resolve any question of hoax. This is the most astonishing thing I have ever seen and would love for someone to tell me what it is."],"Disposition":"Unknown","Log Number":"US-08152007-0005"}