{"Object Features":"Other","Object Shape":"Cone, Square, Rectagular","map":"<A HREF = \"http://maps.google.com/maps?q=44.444706,+-88.57899(7687)&iwloc=A&hl=en\"> mufon case (7687) map </A>","Latitude":"44.444706","City":"Shiocton","Case Number":"7687","Viewing Distance":"21-100 Feet","files":["/var/www/straped/mufon/html2text/7687.html.txt","/var/www/straped/mufon/org/7687.html"],"Date of the Event":"04/12/2007 05:00 UTC","Log Number":"US-08162007-0001","Country":"United States","Disposition":"Insufficient Data","Weather Factors":"Unknown","Date Submitted":"04/12/2007 05:00 UTC","trends":["There have been no other sightings in Shiocton","This sighting has never been favorited."],"Region":"Wisconsin","divs":["Sighting DetailsMy 9 year old son whom My wife and I do not talk about ufo's around came to me with an incredible story. He has been born and raised a Christian. He has attended a private Christian school his whole life. No way do I even think he knows what a lie is let alone tell one. He told me this. Dad I was on my way down stairs to let the cats in, when I saw a funny kind of boxed shape thing sitting in our yard. It had numerous lights around the bottem of it and 3 or 4 lights in a row in the middle. It was sitting on the ground 20 feet from our sand box. We have just over 7 acres here and where he said this wa sitting. There is plenty of room to park a 747 there. Anyway I asked him if he saw it take off. He said when he moved to the sliding glass doors on the patio to get a better look it took off. It did not shoot up or go off in an up ward manner. He said it went straight out into the corn field and he watched it just disapear. The morning he told me about this. I went out and looked where he said he saw this object. A 20 foot round area exactly where he said it was sitting the grass was compacted down. Something had definatly been there. I dismissed this. Why would a ufo land on my property? So just for curiosity I spoke with him tonight. I asked him. Hey pal. Remember a couple months ago what ya told me you saw? He was not sure. I said you saw something in the yard in the early morning. He said yes I saw something I had never seen before. I asked him to tell me the story again and he did. Word for word. Then I asked him if he could draw mw a picture of what he saw. He did. I believe him enough after his drawing to report this incident here. I am installing motion dectors inside and outside our windows and doors now. We are very close to our children. The are very protected from things of this nature until at least there teen years. He has NEVER lied to us. Not even when he could have and gotten out of trouble. I am convinced he saw something that night."],"Source":"MUFON","Summary":"My 9 year old saw this craft land in our yard","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Longitude":"-88.57899","Tags":"City"}