{"Longitude":"-119.411712","Region":"California","Case Number":"7692","Viewing Distance":"21-100 Feet","Weather Factors":"None, Unknown","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=36.783061,+-119.411712(7692)&iwloc=A&hl=en\"> mufon case (7692) map </A>","files":["/var/www/straped/mufon/html2text/7692.html.txt","/var/www/straped/mufon/org/7692.html"],"trends":[],"Object Flight Path":"Hovering then path,Path with directional change","Source":"MUFON","Country":"United States","Latitude":"36.783061","Disposition":"Unknown","Tags":"City","Date of the Event":"05/10/1995 09:00 UTC","City":"Undisclosed","Object Features":"Other","divs":["Sighting Detailsit looked like a stealth bomber, but it was going really slow almost hovering, at treetop height, and made no noise. Remarks I made outloud to other people during the event that I remember are: \"If it's an airplane it's illegal for it to fly that low\" \"it's totally silent isn't making any noise at all\" \"an airplane would fall out of the sky going that slow\" \"it's too calm and peaceful to be a helicopter\" \"it looks like a stealth bomber\" it also had a spotlight and waved it around as if searching for something. At one time, it pinned the spotlight right on us and held it there for a few seconds, but then it moved off of us and kept looking around. I was with about 9 people at the time and there was alot of us... but it was a long time ago and i'm not in contact with all of them. I can think of 3 that I am in current contact with and have spoken to in the last week. It was a little party outside. People were drinking, but not me. I don't drink now and i didn't drink then. There were other sober people there as well. I first noticed the object by it's spotlight i at first thought it was a police or search and rescue helicopter. it was following the coastline of the lake where we were at. I lost sight of the object as it went far away. but it did keep following the lake which is a really big lake... It's clearlake which is the largest natural lake in California. I also remember thinking to myself, that there were military guys up there, laughing and cracking up, because they get to fly this thing over them and point the spotlight at them. Wether these things are military, private, or extraterrestrial... They exist! I saw one in plain sight. There were houses over the hill from me, and shun it's spotlight right on a crowd of people, so it struck me as strange that the military would fly such a strange unknown craft over in such an openly \"look-at-me everybody!\" sort of way."],"Sighting Duration":"00:10:00","Summary":"it looked like a steath bomber","Date Submitted":"05/10/1995 09:00 UTC","Log Number":"US-08172007-0001"}