{"Region":"California","Tags":"City","Longitude":"-117.346164","Country":"United States","Object Flight Path":"Stationary,Hovering then path","Date Submitted":"08/17/2007 03:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.161413,+-117.346164(7694)&iwloc=A&hl=en\"> mufon case (7694) map </A>","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Object Features":"Unknown","Summary":"Hovering luminous objects form astronomical shape of Orion and Taurus or perhaps the true nature of these constellations was revealed to anyone who was watching.","Case Number":"7694","Log Number":"US-08172007-0003","Source":"MUFON","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/7694.html.txt","/var/www/straped/mufon/org/7694.html"],"divs":["Sighting DetailsI will say this first, I don't have a camcorder and I have no picture proof, but someone else must. We need to find them because what I witnessed last night left me in awe. Someone please send a tape to Jaime Maussan. Just before midnight on Thursday August 16th 2007 I was walking alone after leaving work in Cardiff California headed north along the 101 coast highway towards my vehicle parked by the campgrounds. I first noticed an orange luminous object positioned to the west of me over the ocean. It was hovering and slowly moving north. A minute later I noticed there were two more orange luminous objects over the pacific. One seemed to just appear slightly north of the first object and the other appeared just over the horizon also just north from my perspective. I've seen many luminous phenomena in the three+ years I've lived in Southern California, as well as, throughout my life in Arizona and New York. I assumed these were most likely above top secret government craft or some experimental or new technology that is ours and that probably is the case. At this point It was really nothing spectacular. Just before I reached my vehicle I did notice some people in the campground leaning against the metal fence by their fire watching what I was seeing but I did not engage in any conversation. So I reached my car left and arrived home in Carlsbad a few minutes after midnight on Friday August 17th. My roomate Donna was home and she is also well aware of this presense and has witnessed some of these objects on multiple occasions. So it wasn't the first thing I said to her when I walked through the door, but we smoked a cigarette together and had a drink on our deck which faces north. We started talking and then I noticed to the East an object hovering and moving slowly in the sky. I do live close to Palomar Airport and yes there are always planes flying from all directions and yes I am fully aware of the meteor shower from the Pleiades and Cassiopeia that took place last weekend and these were not meteors. This was not a streak of light across the sky and this was no admitted conventional airplane. So over the next three hours we talked on our deck about life and the current state of affairs in the world and I noticed more and more of these luminous objects appear. Some were orange some were muticolored(red, blue, green, white light) some seemed a single color with a smaller white light underneath( blue with white, green with white). So at this point in the night I'm exhausted and I'm ready to go to sleep but something is telling me to go outside. Not a voice but something within me said you need to go outside. So I did and I saw even more objects to the south which were obstructed from view due to our north-faceing deck. So it's 3:25am and I'm ready for bed but I count at that moment about 14 different hovering objects in all directions. Whatever these luminous objects are they were very slowly moving but clearly moving. Some moved side to side, some moved up and down some even appeared to move and flash as planes but then would stop and move in the other dirrection only to dissapear. Then I count about 20 and then 25 and I'm thinking I'm either watching some elaborate US military training exercise or maybe a small scale alien reconnaissance mission. Who knows? So then I decided to go to the field as I call it. There is an empty property lot next to where we live and it's only a short walk. There are also no lights in the field so I knew visibility would improve. When I got there I was floored. I saw another grouping of objects that were obscured from my view by the trees around our house. The direction I was facing was about ESE East South East on a compass. This is what I saw. There were three blue luminous objects all hovering and moving stacked vertically. And the first thing I thought was wow that looks like Orion's belt. But wait it can't be because these things are moving around not in unison but keeping the general formation while clearly moving. I also noticed smaller white and blue luminous objects that appeared to be shooting out from these three blue luminous objects(the belt) or perhaps they were simply much further away and from my line of sight it just appeared that way. This was just over the horizon when I arrived and then I saw two more bright luminous objects that seemed to change color and even form constantly(one minute they were muticolored the next they were solid blue then white but every few seconds they were clearly shifhting position in the sky. I am fully aware of the two bright stars Betelgeuse and Rigel that make up Orion along with the belt of course but I kept saying to myself my God that can't be Orion. I started to think how incredible this was because there is some intelligence using this technology to communicate and form the worldwide known symbol we call Orion. Then I started to see more and more objects appearing. I am no all-knowing individual but it seemed pretty obvious observing dozens and dozens of these objects that there was somesort of visual communication going on between all of these things maybe they were organisms some even seemed at times to be like a deep water luminescent jellyfish. My heart rate is going up fast at this point. I'm exhausted yet my blood is racing through my body and I couldn't leave. So then I notice another orange luminous object in the sky then two then three and they are moving and signalling also. Then what I experienced next almost gave me heart attack. I realize the new orange lights seem to be in the shape of Taurus and who's arrow is pointing directly at these objects? Of course, the answer is ORION's arrow. But this is impossible right. I never use the word impossible but it seemed that way. I started questioning my own mind. What was happening here? Were these objects simply forming these constellations as a type of universal communication, is this a black op or some false-flag operation? Is this a day like in all ancient texts when the people the heavens come alive? Was the sky falling? I started to believe perhaps these were the constelations Orion and Taurus and I was witnessing a revelation. Perhaps these and other constallations we accept as a formation of stars are actually intergalactic starships or spacestations. I know I know we would be able to tell with the Hubble and there is no way a scientist wouldn't notice. I accept that. That is reasonable, that makes sense. What happened last night does not fit into any easily definable category. I know what I saw I just don't know what it means. I don't know when they disappeared from view because eventually at 5:30am or so I left the field and went to bed. The only reason I didn't drag my roomate out of bed to experience this is because she had some company. This either was the two known constallations of Orion and Taurus with all the major points of light moving independately while keeping the general formation or there was an intelligence replicating these universally known symbols. Either way the implications are awe inspiring. God, I hope someone in the States or in Mexico taped this and it makes it's way to Jaime Maussan. All in all I witnessed anywhere from 75 to 100 luminous phenomena in the early hours Friday, Aug 17th. If there are any explanations other than you're crazy I would love to hear them. I welcome any feedback or response. I've always been a sky gazer and I've seen things throughout my life but never anything like this with my own eyes and mind unless it was on a screen from a Jaime Maussan video. Sorry for the novel but I may never witness anything close to that in my life again so I had to share it with whoever would listen. Then again I just might see the same thing tonight and believe me I will be watching. I would love to get a phone call from someone at MUFON so that I can know if there were others who experienced the same thing. Mark"],"Date of the Event":"08/17/2007 03:45 UTC","Latitude":"33.161413","trends":["There have been 14 other sightings in Carlsbad","There were no other sightings in Carlsbad on or around August 17th 2007"],"Object Shape":"Flash, Oval, Star-like, Unknown","Sighting Duration":"Undisclosed","City":"Carlsbad"}