{"Longitude":"-85.595814","Object Shape":"Oval, Other","files":["/var/www/straped/mufon/html2text/7699.html.txt","/var/www/straped/mufon/org/7699.html"],"Date of the Event":"08/17/2006 10:30 UTC","Disposition":"Unknown","Case Number":"7699","City":"Undisclosed","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.319044,+-85.595814(7699)&iwloc=A&hl=en\"> mufon case (7699) map </A>","Viewing Distance":"Unknown","divs":["Sighting DetailsI saw another sighting tonight along with two passerby's at about 10:30, same as last time on the 14th. I was outside setting up my new telescope since it was a very clear night and my new telescope's laser sight was sighted in and ready for use. I first sat down for a smoke then I saw the ufo. It appears to be similar to the last high altitude one I saw and it was the same approximate time, except that this one circled counterclockwise at least three times over the course of the viewing. The circles were probably at least 5 - 10 miles round, probably more like 20-30 miles. I saw the object when it was at the high altitude to the east through a telescope for a second, it looked almost like two D's piggybacking and was slight bit greenish tint to the light. The D's were filled in, not a line of light in the form of a D. I saw stars go by right next to the light on all sides so the craft was only as big as the light from what I could tell. I was surprised to see it appeared as though there were no other dimension to the craft other than the light itself. When I view planes, they have a gray area where the lights arent and you can see stars get blocked by other parts of the craft not lit. This was not that way at all. Also airplane light light up part of the fuselage which was not evident on this ufo. I heard nothing in the way of aircraft, no jet engines if it were from Selfridge ANG. Two people came walking by, a man and a woman, and they were pointing at what I was looking at. We met up in my side yard and watched together for a couple of minutes. It was dim then got kind of bright white, then dimmed when I turned my back to get my telescope (wanted to see it bright) the passerbys said that the object slowly dimmed to red and then to off and disappeared to the East over Saint Claire Shores. The walkers both said there was no way that was a plane. The male walker said that he thought the craft looked to be almost in orbit, or much higher than commercial craft. The female walker was telling me that she saw the same kind of light show from craft prior to tonight and slugged her companion in the shoulder for telling her that sighting, which he did not see, was a sattelite. The couple explained the man had told her the change in brightness had to do with the sattelite going up high enough in orbit to have the sun gleam off of it. On this night, the man admitted that this couldnt be a sattelite or an aircraft. All three of us were mildly excited about the UFO, and the couple walked on after about 20 seconds of the craft not being visible. As the walkers left a couple of minutes later I saw the craft circle again from the north heading southbound then turned to the north again, this circle was the smallest and the craft the lowest so far. When it got to direct north of my position it disappeared behind trees. Then about 20 seconds after that I saw a white shape, very dimly lit that looked saucer shaped and it looked about the size of a private jet, maybe a little bigger. This was to the Northwest which I had not seen anything in this area before. This time it was much closer but much dimmer and the craft's surface was all the same dim lit greenish but mostly white color. The object was at about 10,000 feet altitude, looked like the letter D resting on its back and it shot east at incredible speed with non-linear accelleration. The acceleration kind of bounced (hard to describe) then disappeared behind some trees. The wind was from the West at gusts to 20mph, but this object went fast against the wind and the movement looked unreal. At very first glance it appeared almost to be a white balloon in the dark, but the movement was so unorthodox and against the wind and the speed at the end of the acceleration was too high for anything manmade I am aware of. I am guessing that the craft was the same craft in both instances, one higher than the other, but I do not know for sure. For one thing it appeared to go from a double D to a single D (no pun intended)shape, but in the last closer sighting the color was similar just far less intense. Anyone living in south Macomb area should check the skies about 10:30pm on clear nights. I wish I knew who to ask for radar data to try to verify this sighting's altitude and speed."],"Object Flight Path":"Undisclosed","Latitude":"44.319044","Country":"United States","Object Features":"Undisclosed","Date Submitted":"08/17/2006 10:30 UTC","trends":[],"Tags":"City","Summary":"Same as 8-14 but this one did circles with passerbys seeing the same thing","Sighting Duration":"Undisclosed","Log Number":"US-08182007-0003","Source":"MUFON","Region":"Michigan"}