{"files":["/var/www/straped/mufon/html2text/7700.html.txt","/var/www/straped/mufon/org/7700.html"],"Region":"Texas","Disposition":"Unknown","Viewing Distance":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=32.804935,+-96.767213(7700)&iwloc=A&hl=en\"> mufon case (7700) map </A>","Object Features":"Dome","Case Number":"7700","Log Number":"US-08182007-0004","Weather Factors":"Unknown","Latitude":"32.804935","divs":["Sighting DetailsI was about 5 years old, my mom was afraid of storms so we went to my grandmothers house my mom and my step dad and me.We returned to the house after the bad part of the storm calmed down but it was still raining lightly.As soon as I got out of the car my mom picked me up and carried me as soon as she lifted me up I seen right over our small house huvering about six foot are so from the roof of the houseI was the only one who saw it as we were walking up the steps to our front door.I told my mom the next day when we woke up , my step dad was at work he left at four in the morning so when he left she slept in my room.And I told her I seen space men thats what I called it at five years old from that first time I seen it several times as a child and tell my mother I seen space ship,my mom told when I was older I brought up the subject about UFOs she told me she would her ringing noises and other sounds in that house we used to live. I have never talked about it outside of my family.I have a few diffrent expierences that happend it is all ways on my mind."],"Source":"MUFON","Summary":"A dule metal with a clear dome on top and alot of symbols on the bottom.","Longitude":"-96.767213","Sighting Duration":"00:02:23","Date of the Event":"04/18/1978 09:10 UTC","City":"Dallas","Tags":"City","Date Submitted":"04/18/1978 09:10 UTC","Object Flight Path":"Stationary,Path then hovering","Object Shape":"Flash, Saturn-like","trends":["There have been 116 other sightings in Dallas","There were no other sightings in Dallas on or around April 18th 1978"]}