{"Summary":"Red glowing lights where there should have been none.","Disposition":"Insufficient Data","Date of the Event":"03/31/1990 09:30 UTC","Date Submitted":"03/31/1990 09:30 UTC","files":["/var/www/straped/mufon/html2text/7701.html.txt","/var/www/straped/mufon/org/7701.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.334861,+-78.92015(7701)&iwloc=A&hl=en\"> mufon case (7701) map </A>","Object Flight Path":"Stationary","Object Features":"Unknown","Object Shape":"Unknown","Sighting Duration":"Undisclosed","Latitude":"40.334861","Source":"MUFON","Log Number":"US-08182007-0005","divs":["Sighting DetailsI apologize for the approximate nature of the date, but it's been a while. I was just little when this happened, but I've never forgotten it. I was just about to get into bed one night and I looked out my bedroom window like I did every night. I liked to look out over Johnstown's West End and see the street lights (I don't know why, but I always thought it was pretty). Anyways, I was just about to turn away and I saw, off toward the left, these two red lights where there had never been anything before. They would slowly glow on, then fade out and repeat, I'd guess taking maybe four or five seconds to cycle. These light were behind a group of trees, perhaps 50-100 yards from where I stood. I have no idea how far apart the lights were, nor could I guess how big any sort of thing attached to them could have been, but I definitely know they weren't car brake lights or tail lights, etc. I watched for about five minutes, then I got scared and jumped into bed. I never saw the lights after that. I wish I had more information to share, but I don't. There isn't a road right there (there is one a ways behind from there, but this absolutely was not a car). This was off of Stackhouse Street, looking out towards D Street, to the left of Birch Avenue."],"Weather Factors":"Unknown","Case Number":"7701","City":"Johnstown","Viewing Distance":"101-500 Feet","trends":["There have been 7 other sightings in Johnstown","There were no other sightings in Johnstown on or around March 31st 1990"],"Longitude":"-78.92015","Region":"Pennsylvania","Tags":"City","Country":"United States"}