{"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Longitude":"-81.649671","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Date Submitted":"08/15/1978 12:00 UTC","Case Number":"7703","files":["/var/www/straped/mufon/html2text/7703.html.txt","/var/www/straped/mufon/org/7703.html"],"City":"Jacksonville","Object Features":"Undisclosed","Log Number":"US-08182007-0007","Source":"MUFON","Summary":"I was on the beach and saw the disc sailing under the clouds in the moonlight","Tags":"City","divs":["Sighting DetailsI was walking at night on the beach near my family vacation home on Amelia Island. I was looking up at the moon and sighted a disc shaped object moving through the sky. I continued to watch the disc which appeared to be at a very high altitude until it disappeared into the clouds. It did not behave like a weather balloon but moved in a smooth, direct flight from east to west over the island. I felt it was a legitimate UFO and was excited. Most people laughed at me when I told them this so I kept it to myself. Recent programming on the History Channel has encouraged me to come out with the story, even though it is not very dramatic as some. I also sighted a USO about a year later off the coast of the eastern U.S. while flying overhead in a military hop. I had caught a free flight with the military to go from where I was stationed in Jacksonville, FL to my family in the Washington DC area. The flight was onboard one of LBJ's formerly owned private jets while he was the president. As we flew along the coast the eastern shore was in view and I was studying the landscape (presumably over Georgia). I saw a crescent shaped object beneath the water. As the shadow of the jet reached where the object seemed to be parked (or moving very slow) the object took off and moved faster than the shadow across the water. It moved at such a high speed I lost it and did not see it again."],"Country":"United States","trends":["There have been 66 other sightings in Jacksonville","There were no other sightings in Jacksonville on or around August 15th 1978"],"Latitude":"30.341134","Region":"Florida","Disposition":"Unknown","Object Shape":"Disc, Sphere","Date of the Event":"08/15/1978 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=30.341134,+-81.649671(7703)&iwloc=A&hl=en\"> mufon case (7703) map </A>"}