{"Disposition":"Unresolved","Date of the Event":"03/10/2006 12:00 UTC","City":"New York","Weather Factors":"Unknown","Log Number":"US-08182007-0008","Country":"United States","Tags":"City","Object Features":"Undisclosed","Latitude":"40.716583","Region":"New York","divs":["sighting details3 of my friends went on the observation deck of the empire state building at around 9:00p.m. at night on or about september 21, 2006. we took digital photo's together on the observation deck! as we decided to take photo's of the city lights below, 3 light orange\\ red glowing u.f.o's were flying across and above the citicorp building on 51st. street lexington avenue, manhattan ny. the u.f.o's were flying in formation! two appears in the first photo, in the second 3 appear........... the photo's are clear and sharp and we also have 2 other photo's of the 3 u.f.o's coming from uptown area and then moving at at higher attitude display their backwards thrust\\ engine flying downtown and then went up into the night sky.... the u.f.o's looked like upside down w or 2 upside down v's connected in the center...... the u.f.o's glided across the city about 20 stories upbove the citicorp building then went downtown then glided up into the night sky! my friend who was waiting down on the street level took the camera home and looked at all the photo's and pointed out the u.f.o's flying across the city......."],"trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around March 10th 2006","This sighting has never been favorited.",""],"Date Submitted":"03/10/2006 12:00 UTC","Case Number":"7704","files":["/var/www/straped/mufon/html2text/7704.html.txt","/var/www/straped/mufon/more/7704_submitter_file3__springbreak06068.jpg","/var/www/straped/mufon/org/7704.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.716583,+-74.001123(7704)&iwloc=A&hl=en\"> mufon case (7704) map </A>","Sighting Duration":"Undisclosed","Object Shape":"Boomerang","Object Flight Path":"Undisclosed","Source":"MUFON","Longitude":"-74.001123","Viewing Distance":"Unknown","Summary":"Upside down w."}