{"Longitude":"-86.459697","Case Number":"7705","divs":["Sighting DetailsI was at my house in Millbrook, Alabama. I had just gotten on the phone with my then-boyfriend as I was standing outside to look at the stars. Its something I normally do, it fascinates me. As I looked over to the roof of the house across the street, a line of white lights appeared in the sky. There was no sound made and no prior warning of them, they seemed to appear out of thin air. As the ordeal was occuring, I spoke to my boyfriend over the phone telling him what was going on as I watched it. There were three bright white lights, not appearing to be bound by anything, though they were in the distinct shape of a disc (they were sitting along a curved line in the sky). I watched them as they drifted by and over the roof of the house and then disappear just as they had come, into darkness as if they were never there. Needless to say, I became very flustered and ran back into my house for safety. I sat inside for about four minutes constantly discussing what had happened, wondering if I had really seen a UFO, or if I had simply lost my mind. I mustered up the courage and went back outside to search for any sign that the object was still there, but seeing nothing. Then, as I was about to give up and go outside, I happened to look out over the field near my house and I saw the craft again. This time, instead of drifting away, it seemed to drift downward, almost like it was going to land. I watched until it disappeared behind some trees and was gone. I looked the rest of the night as well, but never saw the object again. I have been skeptical of saying a word about what I saw because I knew that I could provide no evidence, save my own vision. This isnt the only time I have witnessed such an event, however.. Around April of 2007 at my same location in Alabama, I was outside alone cleaning out my parent's car. I had the radio on low, listening to the music and singing along as I cleaned. Then, from behind my house, far in the distance, I caught sight of a intensely bright light. It seemed to be moving towards the airport, also nearby, and so I tried to ignore it. But upon looking back at it as it slowed, it seemed to turn and head in my direction. I curiously opened the car door and stood on the seat, looking on in awe as it slowly flew by behind the trees. It made no noise at all, telling me that it definitely wasnt any aircraft made here. Even a stealth, which I had seen before at Maxwell AFB in Montgomery, AL, made noise when going at such a sluggish pace. I was frozen in fear as it slowed to a near stop and dissapeared from my sight for good, behind a tree. I seem to be cursed with 'seeing things' and it apparently runs in my family. I, even when I was young, would see things that could have easily gotten me thrown into the psych ward. I always thought that people would never believe me if I shared my sightings, so I have remained quiet. I am willing to share another story with anyone who is curious, I am just worried that I will be called crazy. Please, if anyone has seen things such as this or have similar problems with 'an enhanced power of sight,' then do not hesitate to contact me."],"City":"Prattville","Country":"United States","Summary":"a line of lights in the sky, as the body of the craft wasnt visible","Source":"MUFON","files":["/var/www/straped/mufon/html2text/7705.html.txt","/var/www/straped/mufon/org/7705.html"],"Viewing Distance":"101-500 Feet","Region":"Alabama","Log Number":"US-08182007-0009","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.464024,+-86.459697(7705)&iwloc=A&hl=en\"> mufon case (7705) map </A>","Disposition":"Unknown","Weather Factors":"None","Sighting Duration":"Undisclosed","Object Shape":"Other, Unknown","Object Features":"Unknown","Date Submitted":"09/30/2006 09:37 UTC","Date of the Event":"09/30/2006 09:37 UTC","Latitude":"32.464024","Object Flight Path":"Straight-line path,Path with directional change","trends":["There have been 3 other sightings in Prattville","There were no other sightings in Prattville on or around September 30th 2006"]}