{"Date Submitted":"08/17/2007 10:15 UTC","Viewing Distance":"Unknown","Date of the Event":"08/17/2007 10:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=47.025871,+-91.666252(7706)&iwloc=A&hl=en\"> mufon case (7706) map </A>","Object Flight Path":"Undisclosed","Case Number":"7706","Country":"United States","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/7706.html.txt","/var/www/straped/mufon/org/7706.html"],"Longitude":"-91.666252","City":"Two Harbors","Summary":"Unusual activity in Northern Minnesota night sky 8/15/07","Latitude":"47.025871","Object Shape":"Fireball, Star-like","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Source":"MUFON","trends":["There have been 2 other sightings in Two Harbors","There were no other sightings in Two Harbors on or around August 17th 2007"],"Region":"Minnesota","divs":["Sighting DetailsMy neighbor was over last night and got a call from his wife about 9:30. She was driving south on I-35 about 100 miles north of St Paul. She said that she had just seen a green fireball fly across the sky. We thought that was cool since my wife and I had seen the same kind of thing a few years ago in Iowa City. A few minutes later we get another call from her. She says that she was looking at what she thought was the red light on top of a cell phone tower but way too high. Then three fighter jets flying in formation flew over them. She says at that point the red light flew off to the east and the fighter jets follwed. When he got off the phone with her we decided to go outside and have a look. It was clear last night and the stars were out in full force. Right away we saw a satellite traveling from south to north we see those a lot up here. I was remarking on how most satellites travel west to east when two bright reddish orange lights come steaking across the path of the satellite. These two lights looked like they were going to collide. One came out of the east and the other out of the north east. When they got close to each other they both veered away from one another doing this zig zag pattern arcoss the sky. The entire sighting lasted about three seconds, these things were bookin'. What a weird night, I would love to know if any one else saw anything."],"Log Number":"US-08182007-0010","Tags":"City","Disposition":"Unknown"}