{"Summary":"Irregular formation of faint star-like objects; high-altitude/rate of speed","Object Flight Path":"Straight-line path","Source":"MUFON","City":"Santa Clara","Date of the Event":"08/18/2007 09:56 UTC","Object Features":"Undisclosed","Log Number":"US-08192007-0005","Region":"California","trends":["There have been 12 other sightings in Santa Clara","There were no other sightings in Santa Clara on or around August 18th 2007"],"Disposition":"Unknown","Date Submitted":"08/18/2007 09:56 UTC","Tags":"City","Viewing Distance":"Over One Mile","Longitude":"-121.947496","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=37.362488,+-121.947496(7711)&iwloc=A&hl=en\"> mufon case (7711) map </A>","files":["/var/www/straped/mufon/html2text/7711.html.txt","/var/www/straped/mufon/org/7711.html"],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Shape":"Star-like","divs":["Sighting DetailsI was sitting on my porch -- I've been watching evening ISS passings all month...I just happened to look up, and I saw approximately a dozen, very faint, but visible nonetheless, star-like objects -- all exactly identical in size, speed and brightness -- moving in a very tight formation, at what appeared to be a very high altitude and a very high rate of speed. They travelled from north to south. I observed for at least 6 seconds, maybe 7, before they faded-out (the same way satellites do). No power plant noise. No red or green lights. Racing faster than I had ever seen any other satellite. Very bizarre. Formation was irregularly shaped: Shaped like a triangle, but with more \"stars\" on the right side of the formation, with several trailing. No streaks, sparks, or other detritus. I called all major (and minor) news stations in the area, along with police and sheriff's departments (I even woke up a public affairs guy from NORAD in Colorado -- I somehow got the guy's home number -- he was in bed when I called him) -- but nobody had heard of any UFO reports. I am prior military (intelligence) and I know my aircraft IDs. Never seen anything like this. Absolutely amazing. Even if I had had a video camera, the formation (like a shotgun pattern) was too faint and too fast to have been able to pick up. Whatever it was, NORAD MUST HAVE PICKED IT UP (somebody out there knows what it was)..."],"Latitude":"37.362488","Case Number":"7711"}