{"Object Flight Path":"Other","Source":"MUFON","Date Submitted":"08/19/2007 11:20 UTC","Region":"England","divs":["Sighting DetailsMy youth theatre supervisor,Katie, was giving me a lift back from the hall where we do drama, as we'd just got back from edinburgh. We were in Huyton by St Georges Playing Fields, at the traffic lights on Longview Road. Katie looked out of the left window and seen 2 long lights and a round blue light spinning with a round red light. She told me, and i seen it, but the weird thing was, it wasnt going across or anything, it was just dropping from the sky. It was really quickly just falling. As we got to the traffic lights by Huyton Lane, it had just disappeared. We carried on driving, and we were looking for it. We got onto Hurst Park Drive, and i looked out of the right window and seen it slowly rising. I told her, but as she looked, it zoomed very quickly to the left, then zoomed just as quick to the right, but slightly diagonal. then just shot down, behind houses. It was in the distance, so I don't think it would have been that low, it just disappeared behind the houses because it was far away and dropping. Me and Katie just looked at each other, and we went out of our way and searched for it. We couldn't find it again, but we were searching for about 20 minutes. We just wanted to know what it was, we were so confused and freaked out, it was scary."],"Country":"United Kingdom","Latitude":"53.41696","Longitude":"-2.985316","Log Number":"GB-08192007-0006","Summary":"\"UFO\" dropped from sky","City":"Liverpool","trends":["There have been 17 other sightings in Liverpool","There were no other sightings in Liverpool on or around August 19th 2007"],"Sighting Duration":"00:10:00","Object Features":"Unknown","Case Number":"7712","Disposition":"Unresolved","Date of the Event":"08/19/2007 11:20 UTC","files":["/var/www/straped/mufon/html2text/7712.html.txt","/var/www/straped/mufon/org/7712.html"],"Object Shape":"Circle","Weather Factors":"Windy, Medium","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=53.41696,+-2.985316(7712)&iwloc=A&hl=en\"> mufon case (7712) map </A>","Tags":"City"}