{"Case Number":"7713","Date of the Event":"11/30/2002 12:00 UTC","files":["/var/www/straped/mufon/html2text/7713.html.txt","/var/www/straped/mufon/org/7713.html"],"Sighting Duration":"Undisclosed","Latitude":"37.906313","Disposition":"Unknown","Country":"United States","Weather Factors":"Unknown","Viewing Distance":"Unknown","Longitude":"-122.064963","Object Shape":"Disc","Summary":"Three different objects along 680 corridor between 242 and 580","Object Features":"Undisclosed","divs":["Sighting Details While going to work in late October, just before going back to standard time, I was going over the Walnut Creek split with a clear over view of the San Ramon Valley and the North and West facing of Mt. Diablo when I viewed a large spotlite coming down the West face of the mountain. With the angle of decent it was taking I new right of this was no helicopter; and its lack of speed meant no plane. So as I head South bound on 680 I keep my eye on it. As it got to the valley it turned North bound, coming my way. I was driving a mid 70's chevy with a moon roof. Not a sun roof of glass, but a solid movable steel moon roof. I hit the button and opened the roof up.A 3ft.x3ft. opening. As it went directly over me I couldn't help but notice first, the tube light outline of a airline jet underneath a larger round disc that blocked out the stars. No way was this a f---'n jet. As it went over me it turned 45 degrees and headed towards the Golden Gate. Still south bound 680 just before the town of Alamo I notice second object over San Ramon Valley road over the town of Danville. On each side of the round center unit were largescreens the size of billboards with lights of red and blue on top. It headed down the valley until I lost sight of it around the Sunol grade. When I took the Crow Canyon turn off, I came to red lights at Crow Canyon road. I looked East when I noticed moving lights above San Ramon hospital making the international pattern for nuclear power. As you can well imagine, thats a lot to take in before my morning coffee. All I could do was shake my head and figure, who's gonna believe it. Light was just breaking over the Vasco area when the light turned green, and I went for that coffee. Thanks for your ear."],"Object Flight Path":"Undisclosed","City":"Walnut Creek","Region":"California","Tags":"City","Date Submitted":"11/30/0002 05:50 UTC","trends":["There have been 9 other sightings in Walnut Creek","There were no other sightings in Walnut Creek on or around November 30th 2002","This sighting has never been favorited.",""],"Log Number":"US-08192007-0007","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=37.906313,+-122.064963(7713)&iwloc=A&hl=en\"> mufon case (7713) map </A>"}