{"Viewing Distance":"Unknown","trends":["There have been 53 other sightings in Rochester","There were no other sightings in Rochester on or around August 19th 2007"],"Weather Factors":"Unknown","Longitude":"-77.604022","Source":"MUFON","Object Flight Path":"Straight-line path","Summary":"Saw 2 lights, first thought 2 planes one following exactly behind, instead 1 LARGE object!","Date of the Event":"08/19/2007 09:16 UTC","Case Number":"7715","Latitude":"43.16633","Sighting Duration":"Undisclosed","Log Number":"US-08192007-0009","Disposition":"Insufficient Data","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.16633,+-77.604022(7715)&iwloc=A&hl=en\"> mufon case (7715) map </A>","Region":"New York","divs":["Sighting DetailsI was on my patio (garden apartment-middle level) around 9:10 PM checking on my cat. Saw what was definitely a plane to the north - heard the plane but it had a larger light than I'm used to seeing. Looked straight out and up into the sky (this would be to the northwest) just looking for the Big Dipper. High up, where a large plane might pass over the city rather than land, I watched as two lights came from the northwest. Initially assumed it was two planes but thought it odd that one was following the other so exactly and closely even being so high up. The two lights moved steadily toward me. At some point I realized it was not two planes but one, large object. I can't tell you how high up it was but would now guess it was considerably lower than a commercial plane but higher than most small planes. The distance between the two lights, to me, seemed to be several football fields - at least more than two. There was a white light at the front and a white light at the end. When I first noticed them I actually thought they were stars until it was very clear that they were moving, and in exact unison. The light was very bright but not at all large. It didn't blink as a plane's light might or flicker or twinkle as a star might. There was no mechanical sound heard. It maintained a steady speed but not at all fast. It just seemed to move along at a speed I might drive on a city street. By the time I realized what I was seeing it was too late to grab my camera. No other neighbors were around. I would have tried to call to someone if I had realized sooner that this wasn't a normal object. I was surprised with myself as I wasn't scared or nervous but curious as I watched. I think I wanted to prove that it was just a plane or blimp or something I knew. After the object went over my building I realized how significant the experience was and wondered who to share it with. While I'm somewhat a skeptic when it comes to UFOs, I just know, for sure, what I \"saw\" tonight was not a plane."],"Date Submitted":"08/19/2007 09:16 UTC","Tags":"City","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/7715.html.txt","/var/www/straped/mufon/org/7715.html"],"City":"Rochester","Country":"United States"}