{"Summary":"appeared over us out of nowhere while crossing a cattle guard","trends":["There have been no other sightings in Turkey","This sighting has never been favorited."],"Date of the Event":"07/23/2002 12:00 UTC","Tags":"City","divs":["Sighting Detailsit was dark Charlie got out of the truck to open the gate. it appeared over head he drew his gun.and was scared stiff.like the gun would have helped.Trent never got out of the truck.the triangle lights went out one buy one and then it vanished. the guys were so scared they didnt speak all the way home..they didnt want to tell anyone either for fear of being ridiculed or called crazy. these guys grew up together. one works for hastings in the buisness building in amarillo and well Charlie had a home health care buisness but started doin drugs heavily and is now serving a small stent in prison.Charlie was never the same after the incident. he had rented that lease for years hunting and fishing and never returned after that. the lease was out in the middle of nowhere miles from civilization. you could easily get lost on it with out a map from the owner. i seen several silver ships so many i couldnt count they went on further than my eyes could see i also had binoculars. i pointed them out on a visit earlier but no-one really cared ..until they were on top of them. i still want to go back but you have to pay a year in advance to get on the lease. im sure you could still go on. the worst that could happen is youd be asked to leave. and im sure the cowboy livin on it would escort you to the pond area if you are not fishing or hunting. you will need an escort cause you will and can get lost. im really interested in knowing if they are still in the area. i wanted to drive till i got closer to them , i was pissed they disappeared so fast. my chance to see them better vanished. one sec they are there the next there gone!!! i really want to go back. they peaked my intrest, you dont believe until you see one for yourself, i always liked the thought of there being other people from other planets. i know there are people from other planets now. why is the government hiding them. and what are they doin. in the middle of nowhere. hunting and fishing? (: Tammy T"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.392564,+-100.897641(7719)&iwloc=A&hl=en\"> mufon case (7719) map </A>","Latitude":"34.392564","Longitude":"-100.897641","Case Number":"7719","Source":"MUFON","Object Flight Path":"Undisclosed","City":"Turkey","Weather Factors":"Unknown","Viewing Distance":"Unknown","Country":"United States","Object Shape":"Triangle","Date Submitted":"07/23/2002 12:00 UTC","Region":"Texas","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/7719.html.txt","/var/www/straped/mufon/org/7719.html"],"Log Number":"US-08202007-0004","Disposition":"Unknown"}