{"Tags":"City","Latitude":"30.051","map":"<A HREF = \"http://maps.google.com/maps?q=30.051,+31.244385(7721)&iwloc=A&hl=en\"> mufon case (7721) map </A>","Object Shape":"Cone, Circle, Disc, Fireball, Flash, Star-like, Other, Unknown","Disposition":"Unresolved","Case Number":"7721","Object Features":"Undisclosed","divs":["Sighting DetailsThis one seen very clear by optical vision and then started recording by the video camera Panasonic type NV-VS 5.The total recording time was one hour and half on one tape.The opject was in very high altitude in the sky and the weather was very very fair.Noticed also,and recorded on the tape one airliner minutes before recording the object and the second airliner was during recording time ,both airplanes were headed to Cairo International Airport and were preparing for landing.It was no single affect to the airplanes.That is not the first time UFO's were headed in its route to Saqqara steps Pyramid ,as recorded before in many cases. The route and direction of the UFO was from East to West , but from higher altitude to lower altitude. Due to CMS acceptance only three photos I have to send my report three times in order to send 9 important photoes of the different shapes of the object.Thanks with by best wishes from Egypt. Dr.Ibrahim Egyptian Ufologist"],"Country":"Egypt","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/7721.html.txt","/var/www/straped/mufon/more/7721_submitter_file1__Image037.jpg","/var/www/straped/mufon/more/7721_submitter_file2__Image036.jpg","/var/www/straped/mufon/more/7721_submitter_file3__Image030.jpg","/var/www/straped/mufon/org/7721.html"],"trends":["There have been 45 other sightings in Cairo","There were 2 other sightings in Cairo on or around August 10th 2007","This sighting has never been favorited.",""],"Longitude":"31.244385","Summary":"This is Dr.Ibrahim again-------www.ufo-egyptian-hunter.org-------This is the latest sighting of one UFO from the Pharaonic Egyptian Fleet.This one was heading to Saqqara steps Pyramid located south of Giza Pyramids area and southwest Cairo central town .","Weather Factors":"Unknown","Date Submitted":"08/10/2007 08:18 UTC","Log Number":"EG-08202007-0006","Sighting Duration":"Undisclosed","Source":"MUFON","Region":"Al Qahirah","City":"Cairo","Viewing Distance":"Unknown","Date of the Event":"08/10/2007 08:18 UTC"}