{"Summary":"Multiple fast moving circle objects with a one second per flash strobe","map":"<A HREF = \"http://maps.google.com/maps?q=40.252277,+-83.755766(7726)&iwloc=A&hl=en\"> mufon case (7726) map </A>","Latitude":"40.252277","Date of the Event":"07/31/2007 02:50 UTC","Country":"United States","Date Submitted":"07/31/2007 02:50 UTC","Source":"MUFON","Log Number":"US-08212007-0001","Object Flight Path":"Undisclosed","Tags":"City","Disposition":"Insufficient Data","Object Features":"Undisclosed","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/7726.html.txt","/var/www/straped/mufon/org/7726.html"],"Weather Factors":"Medium","Longitude":"-83.755766","Sighting Duration":"Undisclosed","Region":"Ohio","divs":["Sighting DetailsWas in our front yard when one small flashing object, smaller than an aspirin tablet, moved across the sky at a high rate of speed with no sound of an engine, mechanical etc. This object seem to by extremely high into the sky and had a bright single stobelike flash every one second. Object flew around in a (large) circular pattern across the sky and within 30 seconds it had returned to the same location in the SW sky where it was originally spotted....and did this two other times. Soon multiple (up to 8) of the same type of objects were spotted across various distances in the SW sky and seems to be in unison with the original; each taking their own second turn to flash a strobe like light. My initial reaction to seeing the object was a thought of unknown; never seeing an aircraft move so fast and with no sound to it. I started thinking about what would be in the SW sky, geographically that could be the answer. Dayton is appox. 45 miles miles southwest of where I was, and Wright Patterson AFB is in the suburban NE of Dayton-Greene County. This lead to my assumption that it was some type of craft being tested in rural sky, away from 'the lights' of Dayton."],"Object Shape":"Circle, Flash","trends":["There have been no other sightings in West Liberty","This sighting has never been favorited."],"City":"West Liberty","Case Number":"7726"}