{"map":"<A HREF = \"http://maps.google.com/maps?q=36.781861,+-119.415192(7727)&iwloc=A&hl=en\"> mufon case (7727) map </A>","divs":["Sighting Details I was driving on the 101 freeway going north,to the left of me was downtown L.A.to the right I believe would be the echo park area,with me in the car,front passenger,my mother and the rear seat behind my mom is my son. The traffic begin to come to a slow crawl as the sun now started to set,my mom to get my attention said' look\" then she dipped her head down and covered her face with her right hand, now peeping to the left in my direction and when she said look! I did immediately look in the dirrection of which she had pointed in question.I now saw what appeared to be the eight wonder of the world, approximately five to seven hundred feet around, my first thought was wow! what a ferris wheel!and so beautiful'then I realized that this would be impossible for a ferris wheel to be so big and the whole world not know about it beeing here.I now was ever so amazed with great curiosity, I immediately started examining every detail in complete' aaaww! of this monstrossity' I am wittnessing,as it now begain turning slowly into horrizontal position, while coming even closer into my view, now I could see this is a space craft suspended in mid air at approximately three to four hundred feet in height, with windows all around it of every color and lots of people looking out the windows at me, with some in uniform of basic military type and color. The craft had a glair that surrounded it and exeded out to the whole perrimeter' to another one hundred feet or more,now looking at the top dome, bottom right corner there was writing in what looked like ancient Hebrew or Egyptian Hyroglyphics, it was pure metal with the seems in tigth detail the color of golden bronze, wonderfully crafted with a great, great power coming from it that nothing could pennatrate. I also felt an extreme connection with the craft and its occupants as if somehow it was summonsed to find and awaken me to an unknown reality, as again I made eye contact with the craft and its occupants. The royal charriot then rose up into the heavens as Quickly as it had appeared it now faded out of sight and disappeard. I have not been the same since my encounter,I will search until all is revealed to all. There is nothing hidden that should not be revealed. The truth is in me and I am in the world"],"Date Submitted":"06/07/1993 06:30 UTC","Longitude":"-119.415192","Sighting Duration":"00:05:04","Date of the Event":"06/07/1993 06:30 UTC","trends":[],"Object Shape":"Circle, Disc, Saturn-like","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/7727.html.txt","/var/www/straped/mufon/org/7727.html"],"Object Features":"Dome, Window(s), Patterned Surface","Summary":"five hundred ft. around exact to a ferris wheel and three hundred ft. heigth","Latitude":"36.781861","City":"Undisclosed","Object Flight Path":"Hovering then path","Disposition":"Hoax","Country":"United States","Viewing Distance":"101-500 Feet","Log Number":"US-08212007-0002","Source":"MUFON","Case Number":"7727","Tags":"City","Region":"California"}