{"Object Features":"Window(s)","Case Number":"7729","Weather Factors":"None","Tags":"City","City":"Mobile","Object Shape":"Diamond, Star-like, Other","Log Number":"US-08212007-0004","Sighting Duration":"Undisclosed","Disposition":"Unknown","Date of the Event":"05/08/2007 10:30 UTC","Country":"United States","trends":["There have been 19 other sightings in Mobile","There were no other sightings in Mobile on or around May 8th 2007","This sighting has never been favorited.",""],"Latitude":"30.704147","Date Submitted":"05/08/2007 10:30 UTC","divs":["Sighting Details I went outside that evening to get pictures of stars, planets. maybe a galaxy, by holding my digital camera to the lens of the telescope. I went into my backyard, Into a dark spot, away from all lights. I wanted to get pictures of stars! I would point the telescope at an object, hold the camera up to the lens and shoot. There was no un-natural movement, Not even a plane went overhead that night. After about 20 pictures, I came into the house to download the photos. When I ran a slideshow, there were only two photos that were not black or blured. I went to the first one, It looked like a planet with and explosion off of the side... That left me scratching my head, I do not know what that was! The second picture , when I zoomed in on it, it took my breath away! I am sure that it is not nature made... It is not shaped like the ISS. I do not think that it looks like a sattelite. None that I have ever seen! I have sent the pictures to a few people that I believed would give be an idea of what I have, No Response! I guess that I should have not expected one from NASA, Space weather! Could you please take a look and give me your opinion? Thank You, Patty Smith"],"files":["/var/www/straped/mufon/html2text/7729.html.txt","/var/www/straped/mufon/more/7729_submitter_file1__IM005064.jpg","/var/www/straped/mufon/more/7729_submitter_file2__IM005069.jpg","/var/www/straped/mufon/org/7729.html"],"Viewing Distance":"Unknown","Region":"Alabama","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=30.704147,+-88.041764(7729)&iwloc=A&hl=en\"> mufon case (7729) map </A>","Summary":"I was just taking pictures of stars","Source":"MUFON","Longitude":"-88.041764"}