{"Longitude":"-122.025693","Region":"California","Tags":"City","divs":["Sighting DetailsI was driving to work via westbound Highway 4. As I approached the merging traffic from the Willow Pass onramp (Concord) - a bright light caught my attention off to the west near the Concord airport. Typically, I see strobes from helicopters or departing aircraft from that area, but like I said, those lights strobe and you can track them as they move in the direction of flight. I thought it was an aircraft at first, but when it didn't strobe and didn't move, I did a double take. The light was a whitish yellow and shaped like cat's eye (only instead of the points being vertical, they were horizontal). It was stationary and it did not strobe. It was higher in the sky than the usual departing aircraft. The center of the light was brighter than the outer edges. I did not see how it got there, it simply caught my attention by being a foreign object in my peripheral line of vision. I've made this commute every day of every week for the last 10 years. It took about 5 seconds for me to realize that this was not an aircraft from the airport. The aircraft that fly in there are usually very small 4-6 passenger Pipers and the occaisional private jet. Once I realized what it WASN'T, I started wondering what it WAS and about 10 seconds later, it faded from the sky. It didn't just blink off. It faded to darkness like a heating element on the stove as it cools. It never moved. I wasn't scared. Part of me was thinking, it's nothing ... then the other part of me was thinking - \"no way, that was just WAY too weird\". I want to tell someone what I saw, but I'm afraid they'll make fun of me. So I guess that's why I'm here. To answer the above re: the weather conditions: It was dark outside, but I couldn't see the stars. Considering my location and recent weather patterns, I'd say there was probably a high thin layer of fog."],"Object Flight Path":"Stationary","Source":"MUFON","trends":["There have been 20 other sightings in Concord","There were no other sightings in Concord on or around August 22nd 2007"],"City":"Concord","Summary":"Cat's Eye shaped bright light in the dark sky. It appeared quickly and brightly then slowly dimmed.","Log Number":"US-08222007-0001","Disposition":"Unknown","Date of the Event":"08/22/2007 05:20 UTC","Sighting Duration":"Undisclosed","Country":"United States","Object Features":"Unknown","Case Number":"7730","Weather Factors":"None","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Latitude":"37.982378","Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=37.982378,+-122.025693(7730)&iwloc=A&hl=en\"> mufon case (7730) map </A>","files":["/var/www/straped/mufon/html2text/7730.html.txt","/var/www/straped/mufon/org/7730.html"],"Date Submitted":"08/22/2007 05:20 UTC"}