{"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/7733.html.txt","/var/www/straped/mufon/org/7733.html"],"Log Number":"US-08232007-0003","map":"<A HREF = \"http://maps.google.com/maps?q=30.444336,+-84.274593(7733)&iwloc=A&hl=en\"> mufon case (7733) map </A>","Case Number":"7733","Date of the Event":"04/30/2007 12:00 UTC","Disposition":"Unknown","Object Shape":"Circle","divs":["sighting detailsi was taking my mother home between 9 and 10 pm. i was driving down a winding road, cleared a curve, and ahead about 1\\4 mile above and behind a stand of pine trees (edge of maclay gardens) was what looked exactly like the headlights of a jeep. i mean the lights were as big as jeep headlights coming at you 20 feet away. the lights were wobbling a bit and i thought it was moving forward, towards me. my thought was \"that plane is about to hit those trees.\" i made a bend in the road and the lights were obscured for 1-2 second by trees. when i had a clear shot again, the lights were dipping down behind the trees. my car windows were closed, and when i saw the lights dipping i opened my window, but heard no sound. at that point i mentioned the lights to my mother, but she didn't see them. i came to the end of the road, turned left and kept looking in my mirrors to see them again, but did not. i have seen a few things that i wonder about, but this was was different, in that it was close and the lights were not small. had it been a helicoptor or plane, i would have heard it and\\or it would have crashed into the trees."],"Latitude":"30.444336","Source":"MUFON","Region":"Florida","Object Features":"Undisclosed","Summary":"Saw 2 bright headlight looking lights above and behind stand of trees","Tags":"City","Sighting Duration":"Undisclosed","Country":"United States","trends":["There have been 26 other sightings in Tallahassee","There was one other sighting in Tallahassee on or around April 30th 2007"],"Object Flight Path":"Undisclosed","Date Submitted":"04/30/2007 12:00 UTC","City":"Tallahassee","Longitude":"-84.274593","Viewing Distance":"Unknown"}