{"Summary":"My friend and I witnessed a pulsating ring of light","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.403742,+-87.260745(7734)&iwloc=A&hl=en\"> mufon case (7734) map </A>","City":"Pensacola","Case Number":"7734","Tags":"City","Date Submitted":"05/30/1986 04:00 UTC","Date of the Event":"05/30/1986 04:00 UTC","Latitude":"30.403742","Object Flight Path":"Stationary","Weather Factors":"None","Object Shape":"Circle","Source":"MUFON","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/7734.html.txt","/var/www/straped/mufon/org/7734.html"],"Viewing Distance":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","Region":"Florida","Log Number":"US-08232007-0004","Longitude":"-87.260745","trends":["There have been 68 other sightings in Pensacola","There were no other sightings in Pensacola on or around May 30th 1986"],"divs":["Sighting DetailsThough I'm not exactly sure of our age, I estimate my friend and I were between 7 and 9 years old. We were playing in the street infront of his house. He brought my attention to something he saw in the sky. I looked were he was pointing. Directly above us and what appeared to be very high in the sky was a ring of light. My not sure of the size of the ring, therefore I really can't tell how high it was; however, if you were to point to the sky, look to the end of your finger, and imagine a 5 to 3 centimeter ring of light in the sky, you can start to picture it. I don't know what it was, but at the time I was going to a Catholic school and this thing reminded me of a halo. What made it really weird was that this ring was pulsating. This ring was expanding and contracting at a constant rate. We weren't scared, we weren't excited, we were just confused. Why was there a pulsating halo in the sky? After a few moments of bewilderment, we ran into the house to tell his older sister. After a minute of trying to convince her to come outside, she reluctantly obliged. Of course when we got back outside this thing was gone. I don't know what it was, but I KNOW what I saw. Thanks."]}