{"Weather Factors":"Unknown","Date Submitted":"06/20/2007 02:47 UTC","Region":"New Hampshire","Country":"United States","Viewing Distance":"Over One Mile","Object Flight Path":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=43.195452,+-71.565395(7740)&iwloc=A&hl=en\"> mufon case (7740) map </A>","City":"Sargents Purchase (Twp)","divs":["sighting detailsthis is a photo of a ufo i took at mt. washington in june while standing at the western edge of the parking lot at the visitor's center where the \"mt. washington auto road\" to the top of the mountain begins. i was taking pictures of the mountains to the west of where i was standing when i noticed this distant object flying around erratically and i attempted to get a couple of shots of it. after i took the photos i completely forgot about them because at the time i didn't have any thought of a ufo on my mind. it was too distant and it appeared to be something like a bouquet of mylar balloons getting blown in the wind in a sort of counter-clockwise rolling motion. i didn't load or look at any of my vacation photos in my notebook pc until returned to maine again in early august. when i got to look at the one that contains the object, i suddenly remembered why i took the shot and zoomed in on it to see if i could make out what it was i had seen. imagine my surprise. when i looked at the second photo, which was taken 3 seconds later, there was no object that appears anywhere in the frame. i was using a canon powershot a540, without the zoom on, and was holding it at about a foot in front of my face. i have no idea where the object went after the first shot was taken. i would say that the ridge in the foreground, just below the object, was about 2\\5 of a mile away from where i was standing and that the object was much further away than i had intitially thought when i took the photo, possibly a mile from where i was. i would put it's size at about 35-50 feet in diameter. i also noticed when i zoom in on the object in the photo, there appears to be some sort of vertical rod on the top of it. others i've shown the photo to, have said the same thing. the whole time frame of my sighting lasted about ten seconds from when i first spotted it, took the two photos, and was no longer able to see it. my son and his girlfriend where in the same parking lot, but where about 100 feet from where i was. the sighting didn't excite me and i didn't even mention it to them. as i said, it was distant and it never struck me at the time as possibly being a ufo. who would have thought they'd ever be presented with the opportunity to get a shot of one in their lifetime? i took the photos as a curiosity."],"Date of the Event":"06/20/2007 02:47 UTC","Sighting Duration":"Undisclosed","Object Features":"Appendage(s)","files":["/var/www/straped/mufon/html2text/7740.html.txt","/var/www/straped/mufon/more/7740_submitter_file1__IMG_0165.JPG","/var/www/straped/mufon/more/7740_submitter_file2__IMG_0166.JPG","/var/www/straped/mufon/org/7740.html"],"Summary":"UFO near entrance of Mt. Washington auto road in New Hampshire","Object Shape":"Disc, Oval","Source":"MUFON","Tags":"City","Longitude":"-71.565395","Case Number":"7740","trends":["There have been no other sightings in Sargents Purchase (Twp)","This sighting has never been favorited."],"Log Number":"US-08242007-0001","Disposition":"IFO","Latitude":"43.195452"}