{"trends":["There have been 11 other sightings in Sydney","There were no other sightings in Sydney on or around May 31st 1947"],"Disposition":"Unresolved","Latitude":"46.1401","Object Flight Path":"Undisclosed","Log Number":"CA-08242007-0003","Source":"MUFON","divs":["Sighting DetailsThis is an old report that occurred months before UFOs were even talked about, during the spring of, I think, 1947. I was a young boy walking home from school with four young friends, along a lonely street on the edge of Sydney, Nova Scotia. Suddenly one of my friends pointed to the sky directly overhead, to a very bright dot. We all marveled at how bright it was, and reasoned that it must have been a balloon with the sun shining on it. This was about 4:00 in the afternoon and the sky was partially cloudy. Since my friends thought they had it figured out they did not give it much further attention and walked off, but to me it was too bright to be a balloon and I kept staring at it, alone. Then I noticed that this bright dot was sitting in the middle of a very large, circular hole in the clouds. Moving clouds would approach the perimeter of this circle and drift around it. The inside of the circle was not at all ragged, as one would expect with clouds. My neck was getting kinked, as the bright dot was directly overhead, and I reasoned there was nothing I could do about it, so I walked a few steps forward with my attention on where I was going but could not resist a look up again. The bright dot was then gone, and the circle of clouds was just beginning to close in. Months later reports of UFOs appeared, and I put the two together but mentioned my thoughts to no one. Mine is the only case I know of where a UFO was seen influencing a second object, the clouds. No conventional phenomena can explain that in a form so perfect."],"Object Shape":"Star-like","Weather Factors":"Unknown","City":"Sydney","map":"<A HREF = \"http://maps.google.com/maps?q=46.1401,+-60.189984(7742)&iwloc=A&hl=en\"> mufon case (7742) map </A>","Viewing Distance":"Unknown","Object Features":"Undisclosed","Country":"Canada","files":["/var/www/straped/mufon/html2text/7742.html.txt","/var/www/straped/mufon/org/7742.html"],"Longitude":"-60.189984","Date Submitted":"05/31/1947 12:00 UTC","Case Number":"7742","Date of the Event":"05/31/1947 12:00 UTC","Tags":"City","Region":"Nova Scotia","Sighting Duration":"Undisclosed","Summary":"Bright dot"}