{"Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/7743.html.txt","/var/www/straped/mufon/org/7743.html"],"Country":"United States","Date of the Event":"05/31/1964 12:00 UTC","Latitude":"39.06536","Case Number":"7743","Longitude":"-94.562443","Weather Factors":"Unknown","trends":["There have been no other sightings in Kansas City Mo.","This sighting has never been favorited."],"Tags":"City","Sighting Duration":"Undisclosed","Region":"Kansas","City":"Kansas City Mo.","divs":["Sighting DetailsI was living on a farm in Kansas, with my parents,brothers and sisters and was around 14 or 15. I am 57 now. I got angry at my parents because they would not let me go to town. I walked back about 300 yards into the pasture and sat down next to a little pot hole where they dug a whole for coal testing. It was just now getting dark and I could see the stars. I was sitting north and looking at the North Star when suddenly I noticed it moving and coming tuwards me and getting closer. I remember thinking that it wasn't the North Star, it was something else, and it was getting closer to me by the minute. I watched it for about 10 minutes and it was about a quarter of a mile from me and about a thousand feet above the ground. Then instead of seeing one lighted object, three lights came on. Two, as if they were on the end of wings and one as if at the end of a tail of a plane. and it even sounded like an airplane. I thought then that it was just an airplane, but it kept getting closer. The next thing I know it was hovering over my head about 10 ft above me. The plane looking lights went off and then there were differant colored lights blinking off and on in a circuler manner. It was saucer shaped. I got up and started to run and run right into a patch of sticker bushes. So I stoped and looked up and it was still above me. Then a white light shined on me starting from a small hole and growing bigger. I was now standing in a really bright light about 10 ft in diameter. The next thing I remember the light closed up and the craft started to rise higher until it was about a thousand feet off the ground. I noticed I was not standing where I was when the light started to shine on me. The crafts plane light came back on and it sounded like and airplane again. It went due south for about a quarter of a mile and turned 90 degrees towards the east, then went about 300 yards and turned north at a 90. I was then trying to hide behind a tree and shaking like a scared rabbit. When it got back to where it was almost even with me it took offfaster than anything I have ever seen and left a pure white trail clear up to the end of the atmospher. The people that I have told besides my family, you can count on one hand and they told me after I told my story that they new it was true just by how excited I got when I told it. I didn't tell anyone for about ten years after because I thought they would come back and get me. I'm at the age now that I would almost invite them to come and get me and take me for a ride in space. Well, not almost, if they were friendly I would go in a heart beat. I have always wanted to get hypnotized to see what happened from the time the light shined around me and the time it closed up. I am not possitive but I think there was a couple of hours missing in there too. I would also like to see if there was anything planted in me. That is my story and I swear to God it is the truth....Doug..."],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.06536,+-94.562443(7743)&iwloc=A&hl=en\"> mufon case (7743) map </A>","Object Shape":"Disc","Summary":"A saucer shaped object came down out of the sky and hovered above me","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Log Number":"US-08242007-0004","Disposition":"Unknown","Date Submitted":"05/31/1964 12:00 UTC","Viewing Distance":"Unknown"}