{"Summary":"Aliens are lliving among us","Date of the Event":"08/23/2007 12:00 UTC","Region":"Massachusetts","Weather Factors":"Unknown","Source":"MUFON","divs":["Sighting DetailsI am a homeless laborer who found work on a Boston construction site, but had no place to stay. One of my coworkers, Frank, took me to spend the night at a local shantytown. While being shown around that night, I noticed some odd behavior at a small church across the street. Investigating the next day, I discovered that the soup kitchen they were operating was a sham. The choir practice was a recording, scientific apparatus and stacks of cardboard boxes were scattered around the rear areas of the building, and I accidentally stumbled on several more boxes hidden in a secret compartment in a wall. That night the police surrounded the church, forcing the inhabitants to flee. The police then turned on the shantytown, destroying it with bulldozers and beating the blind minister of the church. I returned to the site the next day and decided to investigate the church again, which had been emptied. I took one of the boxes from the secret compartment and opened it in an alleyway, finding it full of sunglasses. I decided to keep one pair and leave the rest in a garbage can. When I later donned the glasses for the first time, I noticed that a billboard now simply displayed the word \"OBEY,\" while another billboard urged the viewer to \"MARRY AND REPRODUCE.\" I also saw that paper money bears the words \"THIS IS YOUR GOD.\" All printed matter around me contained subliminal advertising. Additionally I soon discovered that many people are actually aliens. When they realized that I can see them for what they are, the police suddenly arrived. I escaped and stole their shotgun, and went on a shooting spree at a local bank, which was filled with the aliens. One saw me and disappeared after twisting a dial on his wristwatch. Escaping the bank, I returned to the construction site to talk over what I had discovered with Frank. Viewing me as a wanted man for the shooting spree, he was initially uninterested in my story. We had a fight as I attempted to convince him and then force him to put on the sunglasses. When he did, he joined me and we got in contact with the group from the church. We heard that a meeting was being held at a local community center later that day. At the meeting we learned that the alien's primary method of control is a signal being sent out on television, which is why the general public cannot see the aliens for what they are. The glasses, now available in contact lens form, interfere with the signal. The meeting was raided by the police, who this time shoot to kill. Escaping the battle with the help of one of the wrist devices, we found ourselves in an unknown building where the aliens were throwing a party for their human collaborators. The building turned out to be the basement of a local TV station and the source of the alien's signal. I am going to attempt to destroy the broadcasting antenna, and hopefully not get killed in the process."],"Log Number":"US-08242007-0008","Longitude":"-71.054573","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Latitude":"42.361901","map":"<A HREF = \"http://maps.google.com/maps?q=42.361901,+-71.054573(7747)&iwloc=A&hl=en\"> mufon case (7747) map </A>","Object Shape":"Other","Sighting Duration":"Undisclosed","Case Number":"7747","Tags":"City","files":["/var/www/straped/mufon/html2text/7747.html.txt","/var/www/straped/mufon/org/7747.html"],"trends":["There have been 54 other sightings in Boston","There were no other sightings in Boston on or around August 23rd 2007"],"Disposition":"Hoax","Country":"United States","City":"Boston","Viewing Distance":"Unknown","Date Submitted":"08/23/2007 12:00 UTC"}