{"Date of the Event":"05/07/2005 11:00 UTC","Weather Factors":"Unknown","Summary":"Rectangular shaped object caught on a digital camera.","Disposition":"Unknown","Object Flight Path":"Undisclosed","divs":["Sighting DetailsLocation: Sandia Mountains, Begenning of May 2005, approximate hour: between 11:00 am and 1:00 pm. Returning from a climb in the Sandia Mountains, Albuquerque. We were returning from a climb in the Sandia Mountain and when arriving in the foothills of the mountaina I decided to take a panoramic picture of the Sandias. At that time I was not looking at the sky. I took a first picture of the mountains to the north west then, 9s later I took another picture of the mountains toward a summit called south-peak. I did not notice anything because I was looking at the mountain and not at the sky. I didn't look at my picture before I was back in France were I was living at that time. Since 2002, I use to spend vacation in Albuquerque were I have friends who are mountains lovers and hikers and good climbers. When I looked at the Sandia mountains pictures, I noticed on one of them a small spot. I magnified the picture (1600x1200pixels)and realized that there was some kind of blue-grey rectangle centered in the upper part of the picture. My first reaction was to consider it as a speckle, this kind of electronic parasites you got sometimes on digital picture. However when magnifying the picture, it seemed that the rectangle had some kind of thickness. Then as the Sandia Laboratories are very close from the sandia Mountains, in fact they are located just behind the airport, south of the Sandias and close to the Manzano Mountains, I came to the point that it might be the result of a laser projection test. Knowing that the Laboratories might be working on high power laser (some of the seniors hikers of the Mountain Club were former scientists at the Laboratory)I thought it could be a reasonnable answer. But another option came to my mind regarding the inversion of temperature well known in this part of Albuquerque and that could lead to some weather phenomena... So far I don't have a real idea of what this blue-grey rectangle could have been. But I remember another rectangle seen high in the sky of Paris in winter time and that was following a straight path over the house,until I lost it. the celling was cloudy and high and the rectangle was under it. This was at my sister's home and my brother in law concluded that it was probably a sheet of metal or other material flying in the air carried away by the wind; the weather was actually a stormy weather but it was not raining. I had another sighting experience in the sixtees, I was I think in my fifties: spheric and metallic object, no noise, low altitude, took elevation. no wind. Other witnesses considered the object being a balloon. Attached are the picture of the sighting (029), and the picture (028) took 9 seconds before. No picture of the mountains was taken after that."],"files":["/var/www/straped/mufon/html2text/7752.html.txt","/var/www/straped/mufon/more/7752_submitter_file1__PICT0288.JPG","/var/www/straped/mufon/more/7752_submitter_file2__PICT0289.JPG","/var/www/straped/mufon/org/7752.html"],"Log Number":"US-08262007-0003","Case Number":"7752","Latitude":"35.090121","map":"<A HREF = \"http://maps.google.com/maps?q=35.090121,+-106.646537(7752)&iwloc=A&hl=en\"> mufon case (7752) map </A>","Source":"MUFON","Longitude":"-106.646537","Viewing Distance":"Unknown","Date Submitted":"05/07/2005 11:00 UTC","Object Features":"Undisclosed","Tags":"City","Country":"United States","Object Shape":"Square, Rectagular","trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around May 7th 2005","This sighting has never been favorited.",""],"Region":"New Mexico","City":"Albuquerque","Sighting Duration":"Undisclosed"}