{"Disposition":"Unresolved","Summary":"2 No. UFO's observed, 1 star like, other appeared star like, then appeared to change shape to what looked like a hot air baloon.","Log Number":"GB-08262007-0004","City":"Dunoon","files":["/var/www/straped/mufon/html2text/7753.html.txt","/var/www/straped/mufon/org/7753.html"],"Sighting Duration":"Undisclosed","Tags":"City","Weather Factors":"Unknown","Source":"MUFON","Latitude":"55.950973","Case Number":"7753","divs":["Sighting DetailsWhen leaving friends house, we observed 2 No. lights in the sky, over the river clyde at approx. 200 - 400 feet in the air. At this time it was nearing dark, and conditions were good. The first star like object was observed first and appeared to be closer than the other one. At first i assumed it was a helecopter or small plane, however as the object got nearer there was no sound of an engine or distunguishing of any aircraft tail lights etc. The objects appeared to move unlike any conventional aircraft, at a slow - medium speed- then stationary as if observing. The first object moved into the distance then remained stationary as if a star in the sky. The second object which was closer than the first appeared to take the form of a hot air baloon on closer inspection, however this object was no longer visible in the sky when when distracted for a small period of time, approx. 5mins. The first of the two objects that was originally observed was still in the sky but now at a greater distance away, the second 'air baloon' object was no where to be seen. Note these objects were observed in the sky above the river clyde. I was drinking that night with friends (But not intoxicated) as it was the 'highland games' so there were many people, who would also have witnessed these lights. Friends with me at the time also witnessed these lights and also found then to be very peculiar."],"trends":["There has been one other sighting in Dunoon","There were no other sightings in Dunoon on or around August 26th 2007"],"Date of the Event":"08/26/2007 12:00 UTC","Object Features":"Undisclosed","Country":"United Kingdom","Viewing Distance":"Unknown","Longitude":"-4.926214","Region":"Scotland","map":"<A HREF = \"http://maps.google.com/maps?q=55.950973,+-4.926214(7753)&iwloc=A&hl=en\"> mufon case (7753) map </A>","Object Shape":"Star-like","Object Flight Path":"Undisclosed","Date Submitted":"08/26/2007 12:00 UTC"}