{"Summary":"3 OBJECTS COMING IN AT DIFF. ANGLES CONTROLLED SPEED LOOKING LIKE METORITES WITH TAILS, DROPPING SPARK,ELECTRICAL DISCHARGE","Object Shape":"Fireball, Teardrop","Log Number":"US-08262007-0005","divs":["Sighting DetailsI WAS WAITING ON A METRO BUS AROUND 9PM SATURDAY,I LOOKED TO THE SOUTH WERE THE BUS WOULD BE APPROACHING FROM AND I SAW A STATIONARY OBJECT THAT WAS VERY BRIGHT AND LOOKED LIKE A METEORITE DUE TO SOME SORT OF DISCHARGE COMING FROM THE BACK. TO THE RIGHT OF THE OBJECT APPEARED 2 LIGHTS THAT AT THAT TIME LOOKED LIKE STARS, THIS PORTION LASTING MAYBE 10 SECONDS BEFORE THE OTHER TWO STAR LIKE LIGHTS BLOSSOMED INSTANTLY INTO THE SAME TYPE OF LOOKING METEORITE AS THE FIRST. THEN THEY STARTED (SWIMMING) AROUND AT VERY LOW SPEEDS EMITTING OR DROPPING LIGHTING OR SPARKS, NOT AT A CONSTANT JUST HERE AND THERE. THE WOULD FLY AROUND AT ONE POINT WHAT REALLY GOT ME WAS 2 WERE APPROACHING FROM THE EAST AT DIFFERENT ANGLES THE FIRST ONE II SAW WAS COMING FROM ATOP OF THE OTHERS ON A COLLISION COURSE WITH ON OF THE ONES COMING FROM THE EAST AND WHEN THE ONE FROM THE EAST GOING WEST PAST UNDERNEATH THE ONE COMING FROM ABOVE THE ONE FROM ABOVE DID A LOOP TO REPOSOTION ITSELF ENDING BEHIND.AT ALL TIMES THE LOOKED LIKE FALLING METEORITES BUT DESCENDING AT CONTROLLED SPEEDS, BUT DOING ZIGZAG AND LOOP MANUVERS. WHAT I THOUFGT WAS COOL WAS THE SPARKS OR WHATEVER THAT WOULD SOMETIMES BE DISCHARGED. WELL AFTER A COUPLE OF MINUTES 2 OF THEM FADED TO LIGHTS AND WERE GONE THE 3 ORIGINAL STAYED ABOUT ANOTHER MINUTE JUST FLYING SLOWLY AROUND AND IT TO TURNED TO JUST A LIGHT AND IT WAS GONE. I WOULD SAYED AT ARMS LENGTH, THEY WERE DEFFINITELY AT LEAST THE SIZE OF A GREEN PEA. APPROX. AT MY BEST GUESS 3-5 MILES AWAY. I HAVE ALWAYS BELEIVED IN UFOS AND DID SEE A DAYLIGHT SIGHTING IN HOUSTON ABOUT 10 YRS AGO THAT I REPORTED TO YOU AT MUFON. THOSE THINGS THAT I WATCHED HAD MY JAW DROPPED, AND MY JAW STAYED DROPPED FOR SEVERAL MINUTES AFTER THE SIGHTING WAS GONE JUST PUZZLED, AMAZED, AND EXCITED. I AM NOW GOING TO LOOK IN TODAYS SUNDAY PAPER AND SEE IF THERE IS ANYTHING IN THERE ABOUT STRANGE LIGHTS IN THE SKY REPORTED BY OTHERS. THANKS"],"map":"<A HREF = \"http://maps.google.com/maps?q=30.269963,+-97.740361(7754)&iwloc=A&hl=en\"> mufon case (7754) map </A>","Source":"MUFON","Country":"United States","Object Features":"None","Latitude":"30.269963","Sighting Duration":"Undisclosed","Longitude":"-97.740361","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around August 25th 2007"],"Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/7754.html.txt","/var/www/straped/mufon/org/7754.html"],"Weather Factors":"None","Region":"Texas","Date of the Event":"08/25/2007 12:00 UTC","Case Number":"7754","Disposition":"Unknown","Date Submitted":"08/25/2007 12:00 UTC","City":"Austin","Tags":"City","Object Flight Path":"Stationary,Straight-line path,Path with directional change"}