{"Object Features":"Patterned Surface, Appendage(s)","map":"<A HREF = \"http://maps.google.com/maps?q=35.232754,+-106.663044(7758)&iwloc=A&hl=en\"> mufon case (7758) map </A>","Longitude":"-106.663044","Tags":"City","Date Submitted":"06/14/2003 12:00 UTC","Object Flight Path":"Hovering then path","City":"Rio Rancho","Weather Factors":"Unknown","Region":"New Mexico","divs":["sighting detailsi returned home from work in june of 2003, i always got home at approximately the same time (6 pm to 6:10 pm). eric, our gray cat, was at the back door wanting to go outside. my next recollection was standing at the back door holding the door open and looking up. the first thing that caught my attention was what appeared to be some sort of pipes connected to a large metal craft hoovering above my head, it was approximately 10 feet above a mermosia tree (approximately 20 feet tall), part of the craft was hoovering over the house and about 2\\3rds was over the back yard, with the nose (the skinnist part of the triangle was over sons room facing west). i heard no noise for what seemed like 3 minutes, however, was probably seconds. the craft then emited a very low hum, almost inaudible, and slowly moved away to the west. as the craft drew away from me i saw a grid like structure along the entire back (the flat part of the triangle if you had it pointed away from you) which glowed, but i felt no heat. it got approximately three houses away, accellerated and was gone. i glanced around and that is when i noticed that it was dusk. dusk in june in new mexico is close to 9 pm."],"Date of the Event":"06/14/2003 12:00 UTC","Summary":"Approx 50 ft long, 40 ft wide at widest point. Low low hum when in motion, Subdued glow from rear of craft, hovered, moved at great speed","Object Shape":"Triangle","Source":"MUFON","files":["/var/www/straped/mufon/html2text/7758.html.txt","/var/www/straped/mufon/org/7758.html"],"Viewing Distance":"21-100 Feet","Latitude":"35.232754","Log Number":"US-08262007-0009","Disposition":"Unknown","Sighting Duration":"Undisclosed","Country":"United States","Case Number":"7758","trends":["There have been 8 other sightings in Rio Rancho","There were no other sightings in Rio Rancho on or around June 14th 2003"]}