{"Log Number":"US-08272007-0001","City":"Kempner","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/7759.html.txt","/var/www/straped/mufon/org/7759.html"],"Case Number":"7759","Weather Factors":"Does Not Apply","Object Features":"Unknown","Summary":"Star Like Objects in Formation","Region":"Texas","Date of the Event":"08/22/2007 09:45 UTC","trends":["There has been one other sighting in Kempner","There were no other sightings in Kempner on or around August 22nd 2007"],"Viewing Distance":"Unknown","divs":["Sighting DetailsThis event was actually noticed first on the evening of August 22, 2007. While examining the sky at aroun 9:30 PM, I noticed a star like object moving from the north west location to the north east location. This start like object was low in the skyline, above the horizon. While I visually tracked this light, which became very bright, was moving very fast and seemed to come from nowhere, another identiacl light appeared behind the initial sighting. Both of these objects became very bright then the first object started dimming then eventually dissapeared. The second object that was directly behind it, also began to dim then eventually dissapeared. On August 27th at around 9:45 in the evening. I noticed a star like object coming from the north west moving to the south. This object became very bright, was moving very fast and soon after it became very bright, a second object, identical in path and speed, appeared as well. Both of these objects were visible for approzimately five minutes before the first object began dimming then completely dissapeared. The second object then dimmed and dissapeared as well. I do not believe these were satellites or space debris as I have noticed these many times in the night sky. These two sightings on two separate occasions moved with purpose, were in a \"follow the leader\" formation and were very close in proximity to each other."],"Object Flight Path":"Straight-line path,Path with directional change","Object Shape":"Star-like","Date Submitted":"08/22/2007 09:45 UTC","Sighting Duration":"00:05:00","Source":"MUFON","Country":"United States","Latitude":"31.081007","map":"<A HREF = \"http://maps.google.com/maps?q=31.081007,+-98.002525(7759)&iwloc=A&hl=en\"> mufon case (7759) map </A>","Longitude":"-98.002525","Tags":"City"}