{"Date Submitted":"07/15/2005 03:00 UTC","Disposition":"Unresolved","Viewing Distance":"101-500 Feet","Weather Factors":"Windy","Log Number":"US-08282007-0005","Object Features":"Unknown","Object Shape":"Sphere","Sighting Duration":"03:00:00","Region":"Colorado","Latitude":"39.970036","trends":["There have been 2 other sightings in Nederland","There were no other sightings in Nederland on or around July 15th 2005"],"Date of the Event":"07/15/2005 03:00 UTC","divs":["Sighting DetailsThis event happened two years ago, but I will render it to the best of my Memory's ability. It was July 2005, 2 days before my 21st birthday. I was staying at a friends trailer off baseline rd. in Boulder, CO We (My friend, I, and another acquaintance) were all drinking that night. we were bored and decided to go camping. My buddy had everything we needed already so we loaded up his pickup and headed out to Nederland, CO via hwy 119. My friend said he knew a good spot, that's why we went to Nederland, but when we got there, he couldn't find it. We ended up taking a road into the mountains, looking for a suitable camping spot. about 2-4 miles outside of Nederland we found a spot, it was dark but we set up the tent (took about an hour to do) And started a small campfire. We talked and cooked something on the fire (hot dogs, brats, something of that nature) for a few hours. I remember my buddy telling me something about satanic cults in this part of Colorado that have shrines or whatever in the woods. Then the other guy with us said something like \"Holy Shit!, look! look at that!\" he pointed to a bright sphere in the sky. It was about 3:00AM when I saw it, it was very bright and seemed to have 2 colors present, white light, and a red or purple. The next thing I knew We were all sitting around the campfire as before. I felt very tired all of the sudden, I looked at my watch and it was 6 something AM. I felt dumbfounded, It seemed like I JUST checked my watch and it was ~2:50AM. I went to bed. The next morning we discussed it, none knew what really happened, none could explain the missing 3-something hours. We all knew we had witnessed something out of this world. In the weeks after the event I must have gone over it in my mind a million times. I couldn't find any answers, and I put it out of my mind. It's only recently that I've been researching what happened that night to a large extent. I believe my companions and I were abducted by aliens. I am considering undergoing hypnosis to retrieve the memories, but I'm not sure I want them. I have since lost touch with the other two men there tonight and have tried in vain to contact them."],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.970036,+-105.504421(7768)&iwloc=A&hl=en\"> mufon case (7768) map </A>","Object Flight Path":"Path then hovering","Country":"United States","Summary":"UFO Encounter While camping, missing time","Longitude":"-105.504421","files":["/var/www/straped/mufon/html2text/7768.html.txt","/var/www/straped/mufon/org/7768.html"],"Case Number":"7768","City":"Nederland","Tags":"City"}