{"map":"<A HREF = \"http://maps.google.com/maps?q=30.501822,+-86.130702(7771)&iwloc=A&hl=en\"> mufon case (7771) map </A>","files":["/var/www/straped/mufon/html2text/7771.html.txt","/var/www/straped/mufon/org/7771.html"],"Date Submitted":"08/28/2007 03:00 UTC","Viewing Distance":"Unknown","Latitude":"30.501822","Date of the Event":"08/28/2007 03:00 UTC","Longitude":"-86.130702","Region":"Florida","Object Features":"Undisclosed","trends":["There have been 3 other sightings in Freeport","There were no other sightings in Freeport on or around August 28th 2007"],"Summary":"we saw at least 12 different ufo's all very far out in space each flying at different speeds in different directions.","Tags":"City","City":"Freeport","Object Shape":"Star-like","Source":"MUFON","Sighting Duration":"03:30:00","Case Number":"7771","Weather Factors":"Unknown","divs":["Sighting Detailsme and two other friends were all watching the full moon cycle which was remarkable in itself, at roughly about three thrity am, the stars were fully out and we were in an area where there were no nearby lights, so there was a very clear view of the sky and the first ufo we saw was very far out and was traveling extreamly fast it was glowing all kinds of colors as it passed quickly through. we saw at least 10 different ufo's during this particular phase of the moon when it became fully darkened by some sort of lunar eclipse and the sky was extreamly clear to see all the stars.each ufo we saw was star like, some traveling fast all were headed in a single straight line, never making any manuvers, some dissappeared as we watched others continued on their own little routes to wherever. the one that really caught everyons attention was just like the others, but seemed to be traveling toward our direction, it was coming along and just flared up firey orangish reddish color very bright, enough to make all of us go \"whoah\" then quickly switched directions, and go back the way it came, glittering as it went. we kept seeing these little stars, some closer than others, all traveling on a single line course, we werent sure if these could be satallites or not, we saw ten or more of these. none close enough to get a good description of the shape of the ufo, but all equally spectacular in itself. the spectical continued until the sun began to rise and the stars faded, and we all felt extreamy lucky to have witnessed all this activity that went on during this three hour period of time.."],"Log Number":"US-08282007-0007","Disposition":"Insufficient Data","Country":"United States","Object Flight Path":"Straight-line path"}