{"Date of the Event":"08/26/2007 05:55 UTC","Summary":"5 objects in formation flying due east at 90 degrees, the rear object then accelerated to take the lead of the formation","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Case Number":"7772","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Object Features":"None","Latitude":"37.382024","map":"<A HREF = \"http://maps.google.com/maps?q=37.382024,+-77.500986(7772)&iwloc=A&hl=en\"> mufon case (7772) map </A>","Date Submitted":"08/26/2007 05:55 UTC","Region":"Virginia","files":["/var/www/straped/mufon/html2text/7772.html.txt","/var/www/straped/mufon/org/7772.html"],"Log Number":"GB-08282007-0008","Tags":"City","divs":["Sighting Detailssunday afternoon 26th August 2007 family gathering in the garden, when suddenly both my daughter and niece shouted\" There`s something moving in the sky, at that time we were in the conservatory and came running out to see what was happening as the children pointed up at the sky we then saw 5 perfectly shaped spheres solid looking and shining a distinct silver, there were 2 in front with 3 close behind. Suddenly the one from the rear accelerated to the front of the formation to take point, this was sighted for a good few minutes before the formation disappeared into the distance,at the time very little high altitude cloud cover, blue sky. This was my first ever daylight sighting all my other observations of unexplained phenomena have been at dusk and night time. These objects left no vapour trail what so ever and no apparent sound unlike what you would hear from an high level bomber or other aircraft, just total silence.My borther in law thought they were ballons but ballons do not travel in that manner or indeed that quickly plus for one to out accelerate the others to take the lead of formation, what they were who knows but if I had to make a guess they were either highly classified military craft or indeed of another world of which the latter would probably fit the criteria. At exactly 7.00pm that evening on arriving back home we had a text from my niece saying that she had just witnessed a single object the same as the others on the same flight path moving very quickly in an easterly direction before going out of sight.We do not have any photos or such like as it was all to quick really but I hope someone else in Great Britain also witnessed this extraordinary event.I would be pleased to hear of this eye witness account."],"Longitude":"-77.500986","trends":["There have been 7 other sightings in Chesterfield","There were no other sightings in Chesterfield on or around August 26th 2007"],"Object Shape":"Sphere","Weather Factors":"None","City":"Chesterfield","Country":"United States"}