{"Country":"United States","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/7779.html.txt","/var/www/straped/mufon/org/7779.html"],"Object Shape":"Circle","Sighting Duration":"Undisclosed","Latitude":"44.046125","divs":["Sighting DetailsFirst off, I'm really not sure of the exact date as it was a long time ago. I was about 10 or 11 years old so it must have been 91 or 92. I believe it was fall because of the darkness and temperature. I was riding my bike during the night, my parents have left to go to town for a late dinner together. As I was riding, I saw a light off the road about a hundred yards away in a clearing of the woods. At first, I thought it was just leftover light in my eye from starring at the street lamp (you know, when you look at something bright then look away you can still see the shape of the light even though its gone). But as I moved my eyes around and blinked, i noticed the light stayed in one spot. As my eyes adjusted, i notices that the object was almost pulsing a bit and i began to see shadows that it was casting from all the trees. I curiously gazed at it for a few minutes. I decided to get a bit closer and the second i put my right foot on the pedal of my bike to move forward, the light immediately turned dark red. I was terrified. I remember thinking \"my whole life I've wanted to see a ufo, now that I'm here seeing a ufo, I'd rather be anywhere else in the world but here\". The worst part was, in order to get home, I had to ride closer to the ufo to get away from it. My options were miles and miles of crops, or ride past it on the road to get back home. I remember seeing through the trees as i rode past it. I have never ridden my bike this fast before. My adrenaline was pumping and I could hear nothing other than my own heartbeat. I stopped at the first house I saw with a light on and waited out front to see if I was being followed, a few minutes later I finished the final leg and made it home safely to lock all the windows and doors. As far as i know the object never moved. The next day I went back tot he location and I did see three circles about 6\" in diameter in a perfect triangle on the exact location that the object was. But since I was just a kid and not many people in my family had experiences like this, my words and opinions were dismissed as a dream or over action."],"Region":"Michigan","Date Submitted":"10/15/1992 09:16 UTC","Object Features":"None","Source":"MUFON","Tags":"City","Case Number":"7779","Object Flight Path":"Stationary","Viewing Distance":"101-500 Feet","Summary":"A circular shaped object hovering a few feet off the ground- whiteish green light. When alerted to my presence, it change color to dark red, and I ran.","Longitude":"-82.994114","map":"<A HREF = \"http://maps.google.com/maps?q=44.046125,+-82.994114(7779)&iwloc=A&hl=en\"> mufon case (7779) map </A>","Disposition":"Insufficient Data","trends":["There has been one other sighting in Port Austin","There were no other sightings in Port Austin on or around October 15th 1992"],"City":"Port Austin","Date of the Event":"10/15/1992 09:16 UTC","Log Number":"US-08282007-0015"}