{"divs":["Sighting DetailsThireteen year old Ryan Abney was walking early the morning of July 26, 2007 in nearby Perkins park at about 7:20 a.m. and noticed a bright light in sky. He descibed the object that appeared as pinkish-yellow which he compared to the \"bug lights on the bridge.\" The object was round with a symbol that looked like a \"W\" on the bottom that blinked when the outter ring of object spun around. He descibed it as about 10' thick by 40' wide and just hovering about 100' to 200' above some trees. after hovering for app. 40 mins \"it reared up and took off like a jet or rocket\" he said. Ryan did take a few pictures of the object on his cell phone which he showed to investigators. Ryan also took us (this field investigator, State Dir. and Asst. State Dir. his grandfater and sister) to the sight where the object appeared to him and while there he was asked how the object made him feel he said \"a little scared.\" Later Ryan and his sister sat in their family van while the rest of us talked about the different sightings his grandfater has had in the past. While in the van with his sister Ryan discovered he had also recorded the sound the objcet made when it took off that morning. He let us liste to it and and it was noticed that it sounded just like the sound your computer makes when a cetain function is performed. Ryan also provided and a very detailed drawing of the object."],"Log Number":"US-08292007-0004","Viewing Distance":"101-500 Feet","Region":"Iowa","Longitude":"-91.111023","Case Number":"7784","Date Submitted":"07/26/2007 07:20 UTC","Country":"United States","Source":"MUFON","City":"Burlington","Date of the Event":"07/26/2007 07:20 UTC","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.816046,+-91.111023(7784)&iwloc=A&hl=en\"> mufon case (7784) map </A>","Latitude":"40.816046","Weather Factors":"None","Object Features":"Insignia","Summary":"Ryan Abney was taking and early morning walk in nearby park when he noticed and bright light in the sky","Tags":"City","Sighting Duration":"00:40:00","Object Shape":"Circle, Disc","trends":["There have been 3 other sightings in Burlington","There were no other sightings in Burlington on or around July 26th 2007"],"files":["/var/www/straped/mufon/html2text/7784.html.txt","/var/www/straped/mufon/org/7784.html"],"Object Flight Path":"Hovering then path"}