{"Viewing Distance":"Unknown","Date of the Event":"01/15/2004 10:00 UTC","Weather Factors":"Unknown","Tags":"City","Object Shape":"Sphere","Summary":"Observation of multiple luminous objects in secured area.","Date Submitted":"01/15/2004 10:00 UTC","Latitude":"33.33958","Country":"Iraq","map":"<A HREF = \"http://maps.google.com/maps?q=33.33958,+44.421169(7785)&iwloc=A&hl=en\"> mufon case (7785) map </A>","Region":"Baghdād","Object Flight Path":"Undisclosed","Case Number":"7785","files":["/var/www/straped/mufon/html2text/7785.html.txt","/var/www/straped/mufon/org/7785.html"],"Sighting Duration":"02:00:00","trends":["There have been 6 other sightings in Baghdad","There were no other sightings in Baghdad on or around January 15th 2004"],"Disposition":"Unresolved","Longitude":"44.421169","Log Number":"IQ-08292007-0005","City":"Baghdad","Source":"MUFON","Object Features":"Undisclosed","divs":["Sighting Details While on guard at an entry control point in Baghdad, some lights where noticed doing unusual things over the Greenzone. Myself and a number of other soldiers witnessed the event from our post on the 14th July Bridge. The bridge is a checkpoint which screens traffic and personnel comming into the greenzone from the southern bank of of the Tigris. Air traffic is constantly present in the area of the sighting. At any given time one can expect to see various types of helicopters, flares, even rockets and mortars, along with the usual tracer fire. I am well familiar with all aspects of these occurances and there appearance. As the pace of work on a checkpoint is quit busy, when I first noticed the object I dismissed it instantly. Due to the set up of the control point we were facing south into the city for security purposes, having the allready secure greenzone on our back to the north. It looked alot like a flare at first. A flare can come in many types, the type that this craft most resembled was a parachute illumination flare. This type of flare is quite brite and can hang in the air for up to a couple minutes. Typically such devices are luanched via artillary. Norally the flare will appear simingly from now where and then gently desend under the drag of its parachute, finnaly dimming out into nothing. Close up a parachute can be seen as well as smoke and the noticable downward and side to side movement. Farther away these effects are less and less noticable. When I first saw it I was simply turning around to do something and noticed it at about 800 meters out and 200 feet up, directly over a traffic circle in the greenzone. I turned back around and went back to searching vehicles. About a half hour later I was relieved so that I could eat. I walked back away from the search area to a bunker which was a little removed from the action but still on the bridge. As I dug in to eat I looked up to see the same type of light hovering over the greenzone. It appeared to be in more or less the same position as earlier. This is when I began to think it strange. A flare would have distinguished its flame long ago. Besides at this distance now that I was paying attention I could see it was definately not a flare, or a rocket, or a helicopter, or an airplane. It sat there fixed totally still and silent. I noticed that if I moved from one side of the bridge to the other my perspective changed. It definately had a fixed point in the sky, not to far away. It was at first a pinkish orange in appearance and looked from what I could tell to be the size of a 5o gal. drum. It was completely spherical and seemed to have a sort of illuminated gas collecting around it. As I watched the thing it slowly started to transform. I got the attention of my NCO and asked him what he thought of it. He stated matter of factly that he didn't know. We had all seen some crazy shit thus far and evidently he wasn't all that impressed by this either. He dismissed it much as I had when I first saw it. As he went about his business I continued to watch the thing. The pinkish haze that enveloped the orange ball of light started slowly to take on a brighter hugh. It was as if it was condensing. The center of it seemed to get brighter as well. Now I could see clearly the thing was changing. As the hazy shroud began to disapear completely the ball went from orange to a deep and ominous tone of red, all the while it seemed to shrink in size. Ultimately having about the size and shape of a basketball. This was something I had never seen before. Something very strange happened as it was doing this too. Just as it was about to turn completely from a gasy orange pinkish color into a deep red, it started to woble slightly. It was completely motionless up until this point, as if it were set in stone. But now as it began to wobble the city lights in the area flickered, this of course is totally normal for Baghdads broken electrical infrasructure. However the wierd part is our gas generated flood light we use to light up the search area flickered too. Again I called my Squad leader. \"hey, now look at it, its moving!\" As it floated to the west the lights of the buildings beneath it actually got slightly brighter. My squad leader walked over to a HUM-V and got out the hand mic. He was calling up the activity to or command. His exact words were, \"theres a UFO in the Greenzone\" He was asked if he had enough sleep and if aside from the UFO was everything under control. It was so that was the last we talked to higher about it. The light began to climb strait up, very slowly in a strait line, strait up. As it ascended I saw what looked like a couple of smaller white orb type things, which were brighter and higher up. They moved like a house fly would, in eratic and jerky movements, back and forth. Then as the the red ball got to a hight of about 600 feet it just blinked out. This finally got a little reaction out of my squad leader.Thinking the show was over I went back to my position to relieve the next guy to eat. After the shift we all went back to our compound. While getting ready to rack out at almost three in the morning we gathered a few of us around a table to smoke ciggarettes and burn of the days anxiety. Not everyone saw the thing, some of the newer guys thought we had made it up to fuck with them. All together only 5 people I know of saw it, myself included. Each of us saw pretty much the same thing. Some saw similar activity at differnt times of the night, but we all agreed it was the same thing. The soldier who sat down to eat after me said he saw it cruise up and down the river only feet of the surface of the water. He said after a few minutes of bobbing around on near the water it stopped a minute and then just shot up like it was fired from a cannon only without any sound or arc to its trajectory. All the people who saw these things are experienced judges of distances and reliable witnesses, who have far better things to do than look for UFO's especially while in Iraq. All of us are also very familliar with all known types of aircraft and pyrotechnics that one might mistake for a ufo. I believe what we saw that night was something not of this world checking up on the war in Iraq. Who knows mabey bush makes headlines on planet x as well as here on earth."]}