{"Country":"United States","Log Number":"US-08292007-0005","Latitude":"37.77813","Date of the Event":"08/29/2007 03:06 UTC","Weather Factors":"None","divs":["sighting detailsa friend of mine lives in the san francisco bay area. while she slept, i knew she would miss the opportunity to see the eclipse of the moon. i live in las vegas and already saw it early yesterday morning. i connect to many bay area and other webcams, so i thought i would check some to see if any had a picture of the bay area skyline with perhaps the eclipsed moon. what i saw was no moon. it was cigar shaped, and very bright. it moved in each frame snap from right to left, then back to center, close to the camera. the webcam refreshes every 2 minutes (the date\\time is super imposed on the screen at the cam source http:\\\\www.rntl.net\\images\\sausalitocam.jpg ) difficult to see in the dark water, but shows the event from 3:06 am pdt to 3:15 am then the final frame shows nothing again. in daytime views of this cam, you can see no physical structure reach that height. i've enclosed a stiched together copy of each of the snaps in sequence. i have done no other alteration to the images. fortunately they are of high resolution amongst webcams. i wrote cbs5 immediately in the bay area on a form simular to this, with no way to send the pictures. i thought if they had reports, they might be able to use them. i have gotten no reply. i also wrote with the pictures, local klas-tv news investigator and part time host to coast to coast am, george knapp, and he urged i write you with the photos. we're both curious. also, i hope that above i set it to the right time zone. sometimes phoenix is the same time as vegas, and other times they are not as the don't switch to daylight savings time, i believe. it may be nothing important, but it is definitely unusual. the pictures say more and they are enclosed. thank-you."],"Object Shape":"Cigar","Date Submitted":"08/29/2007 03:06 UTC","Viewing Distance":"Over One Mile","Longitude":"-122.412816","Disposition":"IFO","Object Features":"None","Source":"MUFON","Summary":"screencaps enclosed","Object Flight Path":"Path with directional change","City":"San Francisco","Tags":"City","Region":"California","Case Number":"7786","map":"<A HREF = \"http://maps.google.com/maps?q=37.77813,+-122.412816(7786)&iwloc=A&hl=en\"> mufon case (7786) map </A>","trends":["There have been 127 other sightings in San Francisco","There were no other sightings in San Francisco on or around August 29th 2007","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/7786.html.txt","/var/www/straped/mufon/more/7786_submitter_file1__sausalito.jpg","/var/www/straped/mufon/org/7786.html"]}