{"map":"<A HREF = \"http://maps.google.com/maps?q=47.647222,+-90.674722(7791)&iwloc=A&hl=en\"> mufon case (7791) map </A>","Longitude":"-90.674722","Object Shape":"Circle","Region":"Minnesota","Latitude":"47.647222","Summary":"we were making snow on lutsen mntns ski runs when we noticed a large really large object hovering above moose valley it was ringed by lights and several people including myself watched in amazment","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","City":"Lutsen","Tags":"City","Object Features":"Undisclosed","divs":["Sighting Detailswe were making sno on the ski runs when one of the guys noticed the object hovering above the valley it was very large ..maybe 200 or 300 ft or more across. it was about 500 ft or so above the valley ...but almost sraight out from our crew as we were close to the top of the mountain at the time. it seemed like it was watching us make snow maybe..it was huge.. it looked like a stadium or sumthing floating there unbelievable in size. it had pulsating lights all around the outer edge and they lit up one at a time all the way around the thing ...but the srangest thing was every once in a while the lights would go out and then you could see the stars where it had been...like it had just disapered .then poof the lights would come back on and it was there again ..you could clearly see it...we were all grown men not afraid of much ...used to working somtimes alone at night but once we started watching this thing all work stopped leaving the snow guns running we all watched it in amazment for about two hours.as tom drove me back to our cars i made him stop yelling look look it was slowly tilting until it was sidways in the air.when our shift ended the next crew came on and they said they watched it for several more hours. i was with the crew boss at the time. tom...tom was a very large man and not afraid of anything and tough as nails who was not afraid to speak his mind but also a very nice fellow who would give you the shirt off his back if you needed it. he still lives there with his family and i see him somtimes.after that night we rarely spoke of it it had shaken all of us and as for myself it took all these years to finaly tell my story.all of us are still within 100 miles or so of the sighting. i will never forget that night and am a firm believer that we are not alone.i chose to keep this story short and just tell the basic facts.but to this day when im out at night its scary for me and i am allways on my guard."],"trends":["There has been one other sighting in Lutsen","There were no other sightings in Lutsen on or around December 1st 1983"],"Weather Factors":"Unknown","Date of the Event":"12/01/1983 10:04 UTC","Country":"United States","Source":"MUFON","Log Number":"US-08302007-0004","Disposition":"Insufficient Data","Case Number":"7791","files":["/var/www/straped/mufon/html2text/7791.html.txt","/var/www/straped/mufon/org/7791.html"],"Date Submitted":"12/01/1983 10:04 UTC"}