{"files":["/var/www/straped/mufon/html2text/7792.html.txt","/var/www/straped/mufon/org/7792.html"],"Tags":"City","Source":"MUFON","Date Submitted":"08/30/2007 11:10 UTC","City":"Glen Carbon","map":"<A HREF = \"http://maps.google.com/maps?q=38.748381,+-89.983158(7792)&iwloc=A&hl=en\"> mufon case (7792) map </A>","Latitude":"38.748381","Viewing Distance":"Over One Mile","Country":"United States","Object Shape":"Triangle","Date of the Event":"08/30/2007 11:10 UTC","Case Number":"7792","Region":"Illinois","Disposition":"Unknown","Log Number":"US-08312007-0001","divs":["sighting detailsi was using my night vision, looking up into the sky at 11:10 pm, on 8\\30\\07, when from the north-west traveling to the south-east, for a duration of about 6 seconds, i saw either 5 ufos flying in a triangular attack formation or one large triangular craft traveling at an amazing speed overhead. these were 5 distinct lights only seen through my night vision monocular. there was a lead light and the lights along the right side were perfectly symetrical with the two other lights along the right side; however, the two lights on the left side were not as symetrical, with one being seperated by an uneven distance between the lead light and the trailing left hand 3rd light on the left side. light #2 on the left hand side was uneven with the rest, but over all......these 5 lights were traveling in a perfect open triangular formation before dissapearing out of sight. the speed must have been in excess of 6000 to 10,000 miles per hour, very very fast, and the altitude must have been much greater than 50,000 feet. as they traveled past background stars, the stars did not become obstructed as if it was one single craft, which convinced me that they were 5 distinct individul crafts flying in attack formation, your standard triangular formation. will be watching the skys more often now with night vision."],"trends":["There has been one other sighting in Glen Carbon","There were no other sightings in Glen Carbon on or around August 30th 2007"],"Summary":"Private Detective Saw 1 high flying triangle or 5 seperate UFOs flying in triangle formation","Sighting Duration":"Undisclosed","Longitude":"-89.983158","Weather Factors":"None","Object Features":"None","Object Flight Path":"Straight-line path"}