{"Source":"MUFON","Viewing Distance":"Unknown","Summary":"Beams of Light","trends":[],"Sighting Duration":"Undisclosed","Case Number":"7796","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.559596,+-85.600514(7796)&iwloc=A&hl=en\"> mufon case (7796) map </A>","files":["/var/www/straped/mufon/html2text/7796.html.txt","/var/www/straped/mufon/org/7796.html"],"Object Features":"Undisclosed","Weather Factors":"Unknown","Country":"United States","Latitude":"40.559596","Date Submitted":"08/27/2007 12:00 UTC","Object Flight Path":"Undisclosed","Object Shape":"Other","Tags":"City","Longitude":"-85.600514","City":"Undisclosed","Log Number":"US-08312007-0005","Region":"Indiana","Date of the Event":"08/27/2007 12:00 UTC","divs":["Sighting DetailsAt 11:oo p.m. on Monday, August 27,2007, I stepped outside to take a look at the full moon. I was surprised to see so many white fluffy clouds still floating around, the moon was behind one of these clouds so I stood waiting. The moon was full and giving off a lot of light even though it was behind a cloud. I could see the white and blue lights of at least six airplanes at different heights. Three going in a north direction and two going south. One a south west direction. Then a beam of light shot through the sky from a very huge cloud,I couldn't see a structure just the beam and then a second one.The first beam lit on one of the planes going north then went directly to a second plane going north. The plane turned toward the west and the light beam went back to the other plane,which was pretty far away and had climbed very high, at this point it was hard to make out his lights. The beam of light then immediatly pulled off of that plane and went to a plane that was just barely south of Winamac but climbing very high. The beam of light stayed on this plane untill a cloud passed over it, the plane now behind the cloud. I could no longer hear the plane as it had climbed too high, because of the cloud I couldn't see the plane. But the beam of light seemed to stay fixed behind the cloud. The light from this beam seemed to go out but left a trail of mist or vapor or something because after several minutes it began to break up and the light was gone. The thing that got me was the beam of light, when on the airplanes, wasn't shining past the planes.The second beam of light was coming from the same cloud but was shining toward the south and upward on another airplane that was out of my sight in just a couple of minutes because it seemed to be going straight up. The second beam stayed on that one airplane untill it to went out and left a trail of something misty like the first beam. These light beams came on at the same time and went out at the same time coming from the same cloud. I heard no sound from that cloud, it was huge."]}