{"Region":"Colorado","Object Features":"Window(s), Appendage(s), Other","Longitude":"-104.861083","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Summary":"UFO Witnessed Near Old Colorado City 7pm 8 31 07 Many Witnesses, Pictures, Drawings","map":"<A HREF = \"http://maps.google.com/maps?q=38.845694,+-104.861083(7798)&iwloc=A&hl=en\"> mufon case (7798) map </A>","files":["/var/www/straped/mufon/html2text/7798.html.txt","/var/www/straped/mufon/more/7798_submitter_file1__100_1151.JPG","/var/www/straped/mufon/more/7798_submitter_file2__100_1152.JPG","/var/www/straped/mufon/more/7798_submitter_file3__ufo1.jpg","/var/www/straped/mufon/more/7798_submitter_file4__ufo2.jpg","/var/www/straped/mufon/more/7798_submitter_file5__ufo3.jpg","/var/www/straped/mufon/org/7798.html"],"Log Number":"US-09012007-0001","Case Number":"7798","Date of the Event":"08/31/2007 06:55 UTC","Latitude":"38.845694","Weather Factors":"Unknown","City":"Colorado Springs","Object Flight Path":"Straight-line path","trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around August 31st 2007","This sighting has never been favorited.",""],"Source":"MUFON","divs":["Sighting DetailsMy neighbors and I witnessed a UFO tonight. 3 people watched as a medium sized metalic blue and silver object floated silently past our apartment. I did not see the beginning of the sighting, but was drawn outside by their excitement and watched as the strangest thing I'd ever seen floated past. Two neighbors drew sketches of what they ...and I got pictures of the object. There was no sound. The sighting lasted 15 minutes. I only saw the last 5 minutes. By the time I came outside the object had passed...but I got a quick look at it before I ran inside and got my camera. I have a 12 power optical zoom on my digital camera and I was able to zoom in and get several pictures. I wish I'd been there and saw what they saw from the beginning. It had shining lights. The kids were outside playing and it came out of nowhere. Tony looked up and saw something very strange and asked Debbie what it was. Debbie had no idea. Her husband Leonard, who is a retired Air Force jet mechanic also had no idea what the object might be. There was no noise, no smoke, no chemical trails, no vibration of any kind coming from the object. It was very peaceful. There was a clear window on the object but no beings were seen. Lights shined brightly and evenly and changed colors from white to red to blue to green to pink to red...and the last color was a big bright orange. At first they thought it might be a helicopter or a remote control plane or a glider because there was no motor. The object was shaped like half of the Yellow Submarine from the Beatles...with a window on the front and a metal rod coming out of the bottom. It was silver and metalic bright blue. My neighbor Debbie had been talking about UFOs just before the sighting occured. It floated evenly with a constant speed in a straight line. We all felt very peaceful during the sighting, and were all shocked and in utter awe, We'd never seen anything like it in our lives. The object floated way off into the distance until it was just a spot of flashing orange light and then it disappeared."],"Tags":"City","Disposition":"Hoax","Date Submitted":"08/31/2007 06:55 UTC","Object Shape":"Other, Unknown","Country":"United States"}