{"Viewing Distance":"Over One Mile","Country":"United States","Sighting Duration":"Undisclosed","Date Submitted":"08/31/2007 08:30 UTC","trends":["There have been 4 other sightings in Dublin","There were no other sightings in Dublin on or around August 31st 2007","This sighting has never been favorited.",""],"Case Number":"7800","Region":"California","Disposition":"Unknown","Latitude":"37.707142","map":"<A HREF = \"http://maps.google.com/maps?q=37.707142,+-121.933112(7800)&iwloc=A&hl=en\"> mufon case (7800) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/7800.html.txt","/var/www/straped/mufon/more/7800_submitter_file1__001.JPG","/var/www/straped/mufon/more/7800_submitter_file2__UFO-1b.JPG","/var/www/straped/mufon/more/7800_submitter_file3__UFO-2b.JPG","/var/www/straped/mufon/more/7800_submitter_file4__ufo3b.JPG","/var/www/straped/mufon/more/7800_submitter_file5__August31DublinMap.JPG","/var/www/straped/mufon/org/7800.html"],"Date of the Event":"08/31/2007 08:30 UTC","Summary":"Disc like object hovering with lights rotating along bottom","Object Flight Path":"Hovering then path,Path with directional change","divs":["Sighting DetailsWe left Milpitas around 7:40pm on our way to Sacramento. We were driving on interstate 680 north. As we were passing Dublin we noticed a strange object in the sky that had multiple lights rotating around on what seems to be a disc. What caught my attention were these lights. It was evident that we were not the only ones that noticed it because drivers were swirving and pressing thier brakes to witness the object. There were a number of cars that pulled over and some were even taking pictures. When I first seen the object I thought it was a blimp because it was hovering and moving slowly. But i have never seen a blimp with lights around it in that fashion. The rotations of the lights were irratic and did not have a pattern. They were yellow and bright. Directly above the rotating lights was a single white light situated in the middle. After about 20 minutes of hovering the object began to move away in a quick manner. I noticed that the object then made an abrupt move downward in an angle as if it was going to land. The object did not land but was relatively lower in altitude than when first seen. After a couple minutes the object shot across the sky in a zip zag manner at the speed of a shooting star till it can not be seen. After this event my girlfriend an I were amazed at what we had just witnessed. We are now firm believers of UFOs."],"Log Number":"US-09012007-0003","Longitude":"-121.933112","Object Features":"Unknown","Object Shape":"Disc","Source":"MUFON","City":"Dublin","Weather Factors":"Unknown"}