{"Longitude":"-70.487346","map":"<A HREF = \"http://maps.google.com/maps?q=44.138906,+-70.487346(7804)&iwloc=A&hl=en\"> mufon case (7804) map </A>","City":"Oxford","files":["/var/www/straped/mufon/html2text/7804.html.txt","/var/www/straped/mufon/org/7804.html"],"Country":"United States","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI had just came back from the store with my daughter,when my son came racing out of the house with a baseball bat,stating he had seen something strange come out of one of our sheds . he described the thing as 3ft tall and appeared grey in color.He was helping his sister take in her bags when he looked up in the sky for a moment then shouted at me to look up,there were 2 rectangular shaped \"things\" in the sky. One of them \"flew\" n.east inthe sky and the other \"flew\" s.east in the sky why the \" is i have never seen anything of this known earth fly as fast. We were'nt certain of what we saw so we searched the sky to see if it was still somewhere up there.That's when we discovered the star like light under either the spacestation or a sattellite. The star shaped light stay stationary for about 2 minutes then shot off towards the western sky.The rectagular shaped \"thing\" looked black with white,red,yellow,and blue lights running along the sides of it,the star shaped \"thing had red,yellow,and white lights that ran through it.All of us were curios to see what they are.We all are pretty nerved up about what we saw."],"Tags":"City","Object Features":"Patterned Surface","Summary":"saw 2 sq/rec shaped objects qne going s.east and one going no.eastand 1 star-like object stationary for maybe 2 minutes in the s.western sky,posibly under the spacestation or a sattellite.","Weather Factors":"Unknown","Source":"MUFON","Object Flight Path":"Stationary,Hovering then path","Date of the Event":"09/01/2007 09:17 UTC","Object Shape":"Square, Rectagular","Latitude":"44.138906","Log Number":"US-09012007-0007","Case Number":"7804","trends":["There have been 3 other sightings in Oxford","There were no other sightings in Oxford on or around September 1st 2007"],"Viewing Distance":"101-500 Feet","Disposition":"Unknown","Date Submitted":"09/01/2007 09:17 UTC","Region":"Maine"}