{"Longitude":"-106.646667","City":"Albuquerque","Case Number":"7805","Source":"MUFON","files":["/var/www/straped/mufon/html2text/7805.html.txt","/var/www/straped/mufon/org/7805.html"],"Log Number":"US-09022007-0001","Object Shape":"Circle, Star-like","divs":["Sighting DetailsI was at a friends house and went to the back door to lock up. The back yard faces west, the sky was cloudless and clear. I looked up at the sky and noticed a group of 10 objects flying in a linear formation towards the south at about 30 degrees west of zenith. They were as bright as the brightest star in the western sky which remained stationary relative to the space crafts. They did not appear to be in orbit like a typical satellite but rather were moving at a quarter of the speed of a typical satellite in polar orbit. I observed them for about 10-15 minutes when they vanished. They must have flown into the shadow cast by the Earth thus were no longer reflecting sunlight. This with the relatively slow movement leads me to believe that they were not in orbit and at a significant distance from Earth. I do not believe that that the USAF could fly 10 spacecraft in formation at about the distance of the moon from Earth. I knew that they were not from Earth and was elated that I had witnessed such a spectacular and rare event."],"Weather Factors":"Unknown","trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around July 3rd 2007"],"Summary":"Formation of 10 start like objects flying in formation in deep space","map":"<A HREF = \"http://maps.google.com/maps?q=35.087421,+-106.646667(7805)&iwloc=A&hl=en\"> mufon case (7805) map </A>","Country":"United States","Date Submitted":"07/03/2007 03:30 UTC","Object Features":"Unknown","Sighting Duration":"00:10:00","Tags":"City","Region":"New Mexico","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Latitude":"35.087421","Viewing Distance":"Over One Mile","Date of the Event":"07/03/2007 03:30 UTC"}