{"Latitude":"39.622331","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Region":"New Jersey","Date Submitted":"08/31/2007 07:10 UTC","Object Shape":"Cigar","map":"<A HREF = \"http://maps.google.com/maps?q=39.622331,+-75.068791(7806)&iwloc=A&hl=en\"> mufon case (7806) map </A>","Case Number":"7806","Source":"MUFON","Weather Factors":"None","City":"Franklin","Date of the Event":"08/31/2007 07:10 UTC","Country":"United States","Viewing Distance":"Over One Mile","Summary":"we saw a shiny cigar shaped object at a very high altitude change directions","Object Features":"None","divs":["Sighting DetailsWHILE STANDING IN MY BACK YARD I WAS LOOKING AT THE CLOUDS AND THE AIRPLANES FLYING OVER , PROBABLY GOING TO PHILA INTERNATIONAL ,WHEN I SAW A VERY SHINY CIGAR SHAPED OBJECT IN THE SOUTHERLY SKY. IT WAS AT A VERY HIGH ALTITUDE AND THE SUN WAS BOUNCING OFF THIS OBJECT. THE SUN WAS GOING DOWN IN THE WESTERLY SKY. I YELLED TO MY SON TO GET THE BINOCULARS AND I HAD MY SPOTTING SCOPE WITH ME BUT IT WAS NOT SET UP. I MANAGED TO GET THE OBJECT IN MY SCOPE BUT I COULD NOT GET A CLEAR IMAGE BECAUSE I WOULD HAVE TO ADJUST THE FOCUS AND KEEP THE OBJECT IN THE SCOPE WHICH IS VERY HARD TO DO IF THE SCOPE IS NOT SET UP ON THE LARGE TRIPOD I HAVE FOR LONG DISTANCE VIEWING. MY SON VAUGHN DID GET A CLEAR SIGHTING WITH THE BINOCULARS WE HAVE. [ AUTO FOCUS BUSHNELL ZOOM BINOCULARS ]. THE OBJECT WAS TRAVELING IN A NE DIRECTION THEN STOPPED AND TRAVELED IN THE OPPOSITE DIRECTION. AT THAT MOMENT I KNEW IT WAS NOT AN AIRPLANE. THE OBJECT WAS TRAVELING AROUND THE SAME SPEED OF OTHER AIRPLANES FLYING ALONG THE SAME PATH OF THE OBJECT. WE WATCHED IT FLY SW . THEN IT STOPPED AND CHANGED DIRECTIONS AGAIN FLYING NE. IT FLEW ACROSS THE SKY AND CHANGED DIRECTIONS AGAIN FLYING TO THE SW. WE WATCHED THE SHINY CIGAR SHAPED OBJECT UNTIL WE LOST IT BEHIND THE TREE LINE. MY SON IS A AIR FORCE COMBAT VETERAN AND I AM AN INVESTIGATOR FOR MUFON. KEN PFEIFER FIELD INVESTIGATOR."],"Disposition":"Unknown","Log Number":"US-09022007-0002","Longitude":"-75.068791","Tags":"City","files":["/var/www/straped/mufon/html2text/7806.html.txt","/var/www/straped/mufon/org/7806.html"],"trends":["There have been 9 other sightings in Franklin","There were no other sightings in Franklin on or around August 31st 2007"]}