{"Weather Factors":"Unknown","Date Submitted":"09/01/2007 10:40 UTC","Object Flight Path":"Path with directional change","divs":["Sighting Details22.40 on 1st September 2007. Stood on my doorstep having a cigarette when I noticed 2 red lights off to my right. (North of me and North of Banbury) These 2 red lights were moving from South West to North East just North of Banbury. The speed wasn't exactly fast more like helicopter type speed. I walked up the steps top get a better view when I noticed that there was 4 of them all moving in the same direction and in a loose spread formation. The light 2nd from the right was vertically higher in the formation. I watched these lights until 2 of them had disappeared behind the trees and out of my view. At that point another red light appeared into my view from the left hand side heading the same direction. These lights certainly appeared to me to be moving far to slowly to be military aircraft (Jets with afterburners). Quite possibly they could have been military helicopters but I heard no engine or rotor sound. What strikes me about this is the lack of any flashing formation lights or nav lights etc. Just a continuous consistent red light. This is the first time I have ever seen anything like this. In the first formation of lights the light on the farthest left of the formation had a slight erratic vertical movement moving erratically but smoothly. This was definitely UFO and more than likely out of RAF Fairford. I would just like to know what aircraft these are?"],"Case Number":"7811","Longitude":"-1.251875","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=51.759424,+-1.251875(7811)&iwloc=A&hl=en\"> mufon case (7811) map </A>","Object Features":"Unknown","Date of the Event":"09/01/2007 10:40 UTC","Tags":"City","Region":"England","Country":"United Kingdom","Object Shape":"Sphere","Log Number":"GB-09022007-0007","Source":"MUFON","trends":["There have been 4 other sightings in Oxford","There were no other sightings in Oxford on or around September 1st 2007"],"Sighting Duration":"Undisclosed","Summary":"5 red lights, no flashing lights just consistent red","files":["/var/www/straped/mufon/html2text/7811.html.txt","/var/www/straped/mufon/org/7811.html"],"City":"Oxford","Viewing Distance":"Over One Mile","Latitude":"51.759424"}