{"Object Shape":"Sphere, Star-like","Date Submitted":"08/31/2007 08:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.663659,+-87.30946(7814)&iwloc=A&hl=en\"> mufon case (7814) map </A>","Viewing Distance":"Unknown","Summary":"Noticed very bright star object in western sky, jumped and reappeared, followed by orange ball like sightings","divs":["Sighting DetailsWhile sitting at the local high school football game in Washington I noticed a very bright star that seemed to just appear in the western sky. Less than five seconds after viewing this object a smaller object appeared close to the bottom left of this object and then both objects disappeared. During this time a few people sitting close by also witnessed this event. Probably fifteen seconds later the object reappeared only slightly lower in altitude and to the left, again very bright, and then disappeared. Five minutes later my wife and I decided to leave and investigate as I along with a friend witnessed an orange ball experience near Lucky Point in Knox County earlier this year. We took off driving in the direction of the light which was north of the Lucky Point area and sure enough we spotted an orange ball appear in the sky and stay luminated for several secconds and then disappear. We continued to drive west towards the light on country roads. The moon had not risen yet and the stars were very bright and the milky way was present. We witnessed at least five to ten re-appearances of the orange ball lights in the general vicinity of our original sighting of the star like object. I decided to call the county sheriffs department to see if they had anyone in the area who could confirm these sightings. The dispatacher seemed to think this was some sort of joke and said I was probably viewing a tower light. This was certainly not a tower light as the objects appeared in different locations and would luminate in different sizes and brightness. I called my friend who witnessed the earlier event and he said he was leaving his house and would be driving towards the area. When he arrived he said he had seen one incident of the orange balls of light similar to our earlier sighting. I also made a call to Jerry Sievers of Indiana Mufon and spoke with him about the incident. During this time there were no sightings of the orange balls of light. I believe the orange balls of light were associated with the very bright star like object as they were all viewed in the same area. The whole event lasted around twenty minutes. We drove through the country side and over to the Lucky Point area but did not see anymore lights or orange balls in the sky."],"Date of the Event":"08/31/2007 08:15 UTC","Source":"MUFON","Latitude":"38.663659","files":["/var/www/straped/mufon/html2text/7814.html.txt","/var/www/straped/mufon/org/7814.html"],"Object Features":"Undisclosed","Country":"United States","Region":"Indiana","Sighting Duration":"00:20:00","Weather Factors":"Unknown","Log Number":"US-09022007-0010","Tags":"City","Object Flight Path":"Undisclosed","Disposition":"Unknown","Case Number":"7814","Longitude":"-87.30946","trends":["There have been no other sightings in Wheatland","This sighting has never been favorited."],"City":"Wheatland"}