{"Sighting Duration":"01:30:00","Object Features":"Undisclosed","trends":["There have been 4 other sightings in New Harmony","There were no other sightings in New Harmony on or around August 31st 2007","This sighting has never been favorited.",""],"Summary":"Mutliple star-like objects that lit up in fireball fashion. Some moved slowly. Turned out like switched off.","Weather Factors":"Unknown","Viewing Distance":"Unknown","Object Shape":"Fireball, Flash, Sphere, Star-like","divs":["sighting detailsi was watching the northern sky for unusual activity. i had two cameras ready to tape. at about 9 pm i saw a fireball burst due north of my position. it's duration was about 2 seconds. the light went off rather quickly, as if switched off. this was followed by 4-5 more similar sightings, all in the same general direction (though this was the only direction i was looking). they differed only around 20 degrees e or w from north. two or so of the objects were about 10 degrees or less from the horizon. others were aprox. 45 degrees up and appeared to be quite close to my position. one *seemed* to be extremely close, possibley within 1 mile. their color was a light orange\\amber. the light was a combination of a pulse and a flicker, similar to the look of an arc welder. the size, when lit, is comprable to a high pressure sodium bulb(orange dusk-til-dawn) light viewed from a quarter mile alway-very noticable. the lights exibit different qualitites. some apear as very bright stars, and never do anything other than move slowly and dissapear in either a slow fade or abrupt extinguishing. some of these \"bright stars\" will move to a position and then \"light\" themeselves. this is the most amazing aspect of these objects. if you were to be looking in any direction in a darkened sky, this light is so brilliant that it would be immediatly obvious to the very periphery of your vision. i have seen these lights on about 9 occasions since the winter of 2005. every single sighting has been in the same location, some in almost the exact part of the sky. the earliest was about 5:15 pm about a week after the initial sighting, also in the north. the latest i've noticed them is 11 pm, but i've not spent many late nights watching. there was once a large triangle formation and another time, a long string of seven lights in a perfect line, far in the distance-so far they appeared as one light to the naked eye. if anyone has seen these in the southern in\\il\\ky area, and i know you have, please email me at myeyeshaveseen@hotmail.com. i would like to set up a telephone\\email notification system between skywatchers to alert one another."],"Country":"United States","Longitude":"-87.93056","Disposition":"Unknown","Tags":"City","Date of the Event":"08/31/2007 08:30 UTC","Region":"Indiana","City":"New Harmony","Source":"MUFON","Log Number":"US-09022007-0014","Date Submitted":"08/31/2007 08:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.138648,+-87.93056(7818)&iwloc=A&hl=en\"> mufon case (7818) map </A>","Case Number":"7818","Latitude":"38.138648","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/7818.html.txt","/var/www/straped/mufon/org/7818.html"]}