{"divs":["Sighting DetailsI was standing in my back yard in the shade of a tree. I was looking thru my 7x50 binocs for a jet that just passed over. In the glare field North of the Sun, a star-like object was moving rapidly North to South. The tree blocked the view as it moved South. I continued looking in the Sun's glare field. This is difficult because you need to block the Sun and not get it in the binoc field of view. Another star-like object passed near the Sun on the same North-South path. Because of the difficult viewing angle and proximity of the Sun, I decided to lay on my back resting on a pillow. I positioned myself just inside the tree's shadeline to block the Sun. This allowed me to carefully view in the Sun's glare field. For approximately 70 minutes, numerous star-like objects passed from North to South. They passed thru the Sun's glare field at about one per minute. They were usually single objects, occasionally two at a time, and three one time. Occasionally one of the objects would deviate from the North South track and go South East. On two occasions, a short vapor trail (contrail) appeared and quickly dissipated. The objects were not visible to the naked eye, only with the 7x50 binocs. I got my digital camera and took pictures of the viewing area. A few of the pictures show small white spheres at max zoom setting. There's no detail. The viewing conditions were excellent.....clear blue sky, no clouds or haze, very transparent atmosphere. I have spent many hours viewing the sky because of my interest in astronomy and aircraft. I have never seen anything like this. I would characterize this as a true UFO event with no logical explanation."],"Weather Factors":"Unknown","Object Features":"Undisclosed","Longitude":"-84.822456","Summary":"Numerous star-like objects moving North to South in the glare field of the Sun","Country":"United States","Tags":"City","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Object Shape":"Sphere, Star-like, Unknown","trends":["There have been no other sightings in York Town","This sighting has never been favorited."],"Log Number":"US-09022007-0015","Disposition":"Unknown","Case Number":"7819","Date Submitted":"09/02/2007 01:50 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.686134,+-84.822456(7819)&iwloc=A&hl=en\"> mufon case (7819) map </A>","Latitude":"41.686134","Date of the Event":"09/02/2007 01:50 UTC","Region":"Indiana","City":"York Town","files":["/var/www/straped/mufon/html2text/7819.html.txt","/var/www/straped/mufon/more/7819_submitter_file1__ufopic2007(2).jpg","/var/www/straped/mufon/org/7819.html"],"Source":"MUFON","Object Flight Path":"Undisclosed"}