{"Weather Factors":"Unknown","Date Submitted":"09/02/2007 09:10 UTC","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/7822.html.txt","/var/www/straped/mufon/org/7822.html"],"Date of the Event":"09/02/2007 09:10 UTC","Sighting Duration":"Undisclosed","Disposition":"Unresolved","trends":["There have been 7 other sightings in Charter Township of Clinton","There were no other sightings in Charter Township of Clinton on or around September 2nd 2007"],"Summary":"High Altitude Object > 80ft diam stationary moving around a bit","Latitude":"42.586888","Country":"United States","Region":"Michigan","divs":["Sighting DetailsIt was about 9pm and all passenger jets were no longer reflecting the suns light as the sun had sunk far enough that jets at 30K ft + did not reflect the sun even planes almost to the western horizon. This is the second time I saw this object in a couple of weeks. This time there were myself and three other adults and two children that saw this bright yellow, appeared as the first star, that looked brighter on the edges than the center. It was slightly larger than jupiter as far as arc seconds wide. It became dull orange as it became later and then very dull white after the orange was done. This time the object moved around quite a bit. Gradually other stars became visible next to this object and this object could be seen sometimes moving very slow, other times quite fast but generally in the same area. A couple of times the object moved 1.5 fields of view and I had to chase the sucker down. After about 10 minutes or more I moved the telescope to Jupiter to prove to the skeptics there that it was not my telescope moving. The man who saw this with me first tried to tell me it was a planet, but I knew it wasnt. The only planet that bright would hve been Jupiter but this object was directly west at 75 degrees elevation. Jupiter appeared later to the south and about 30 degrees elevation. Then as the olbject grew dimmer and the rest of the stars grew brighter the skeptic kept trying to tell me my telescope was moving even though the object was moving relative to the stars so that proved the object was moving and not the telescope. The two women there did see and admit that clearly the object was moving around. I saw a passenger jet that was either an A380 or 747 earlier that day and this object was wider than the fuselage of one of those planes at 30000 + feet and clearly much higher, so this object has to be at least 100 across maybe more. When the object was dim white the outer rim looked flourescent white and the center was more dull, kind of like a ring. It almost appeared to be self illuminated but I couldnt tell for sure. It was in the same area of the sky as the last time, west and about 75 degrees elevation, but I saw it this time about 6 miles north of the last sighting. There was no wind at ground level. If anyone knows what this object is, ie manmade, PLEASE LET ME KNOW on the MUFON boards. This time I was in the Clinton Township Mt Clemens area of Metro Detroit. This was clearly not a satellite. I guess it could have been a big white balloon at 50,000 ft or maybe even more. At times it moved kind of fast, about 3-4 object widths per second and moved in every direction. The most it moved was about 1.5-2 field of view widths on my telescope. My telescope is a 4.5\" reflector with a 25mm lens. This object was also clearly visible with binoculars. I was there showing my new telescope to my aunt and uncle at thier house and told them about the last sighting of this object although it appeared stationary but appeared to drift along right ascension. This time I could not tell if there was drift because the object moved around too much. Do they still use weather balloons and how large do they get? And since there were aircraft flying in the same area, within one field of view of the telescope, it would have been in air corridors, which I figure would be a huge no no."],"Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.586888,+-82.919551(7822)&iwloc=A&hl=en\"> mufon case (7822) map </A>","Source":"MUFON","Log Number":"US-09032007-0001","City":"Charter Township of Clinton","Tags":"City","Viewing Distance":"Unknown","Longitude":"-82.919551","Case Number":"7822","Object Shape":"Sphere"}