{"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/7824.html.txt","/var/www/straped/mufon/org/7824.html"],"divs":["Sighting DetailsAt first the c130's came in about 100 ft. above our camp. Every Tues. at ten thirty a.m. and one other no set day.This goes on for about 6 wks. Then one evening right at dusk i said look at that. It was a giant black triangle about 1,000 ft. across and 60 ft. thick. It was traveling about 50 mph. and it turned and came right over us. You could see pipes, hatches and other objects all underneath. We watched it for a couple of minutes and then taked about the space ship. The ship was only 100 ft. above us. I was bumed that I didn't have my light to signal with. It was about 8:45 p.m. The next night at the same time a smaller ship with a super bright strobe light came on the same course as the night before went down the mountain. We turned around , Wait, the strobe was timed so that as soon as you started to focus it would strobe super bright so that you could not see it. Well, we turned around and there was the big black ship again. Both times this ship came in it was only 300 ft. above us. I start to signal with my flash light with 4 dits and a dit over and over. My friend is screaming at me to stop. Well a light from it's right point swung through camp and my friend is going nuts.I signal some more and the light swings through camp again. Now my friend is laying on the ground totally out of it. Well I just started more dits with the light and then a light about a quarter acre in size turns on just off of center. My friend can't handle any more so I stop. There is more from before and after this writing. Like a humanoid with a dozen rivets down both sides of his body. I also took a book writer out there 4 years later and after a five day hike opened a folding chair and pointed to a hill about 250 ft. away and said, The space ship will come over that hill and fly right in front of the mountain I camped on. On the second day six hours in to looking the Boomarang one came right by. I have taken more trips and the last one was 8 months ago. I know about thetall grays with the big noses. The triangle ships are their's. I am getting ready to go on another trip. In physical realities they are a million years ahead of us but in spritual realities just an inch."],"Latitude":"33.050897","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.050897,+-109.296183(7824)&iwloc=A&hl=en\"> mufon case (7824) map </A>","Region":"Arizona","Date Submitted":"05/31/1990 12:00 UTC","Viewing Distance":"Unknown","Date of the Event":"05/31/1990 12:00 UTC","Object Flight Path":"Undisclosed","Disposition":"Unknown","Source":"MUFON","Log Number":"US-09032007-0003","Summary":"12 acre black triangle 300 ft. above us,moving 50 mph. I have seen three types many times over many years.","Longitude":"-109.296183","Case Number":"7824","Object Features":"Undisclosed","Object Shape":"Boomerang, Triangle","Country":"United States","City":"Clifton","Tags":"City","trends":["There have been no other sightings in Clifton","This sighting has never been favorited."]}