{"Weather Factors":"Unknown","Tags":"City","divs":["Sighting DetailsHello: This sighting took place during the Perseid meteor shower Sunday, August 12, 2007 between 10:40 pm MT and 11:55 pm MT. Several people saw what I did. To view the meteors, I drove to CO 128 located in Broomfield County (please update your drop-down list to include this newly created county). You can see the location online at www.maps.google.com, when you enter 'mccaslin boulevard and co 128' in the search maps field. On the north side of CO 128, between McCaslin Boulevard and Indiana Street is a wide area where you can park your vehicle. The only light sources are traffic lights at McCaslin and at Indiana. The only nearby buildings are south of the ridge, and east of Indiana Street; they include an apartment complex and office buildings. These cannot be seen from the parking area. I was the fourth vehicle to arrive, and one of the last to leave. At most, a dozen vehicles were parked there. Most folks, like me, stood outside their vehicles to view the meteors; it was a great show. While scanning the skies, I saw what appeared to be a square or rectangluar shaped configuration of blue lights that flashed. Near the bottom, right was a solid red light. The object's movements caught my eye: they were jerky and bouncy. At one point, it was directly overhead approximately 20 feet; the object was silent. Four young men in the car about five feet discussed the object's lights and movement. While I could not see it's body, the object blocked my view of the stars. Therefore, it had physical mass. On three occasions, I noticed the lights of jetliners in the distant sky, while the object was in my line of sight. On each of those three occasions, said object's lights went dark for several minutes. When it reappeared, it was in a different spot. I was surprised at how calm I felt while watching this object. I tried to logically assess what it might be, and nothing made sense. I felt (and still feel) very curious about it. No one could have projected the lights, because a projection would not have blocked my view of the stars. I've returned to the area twice at night, waited and watched. It was not there. Whatever could this have been?"],"Object Flight Path":"Path then hovering","City":"Superior","Object Features":"Unknown","Sighting Duration":"Undisclosed","Case Number":"7827","Latitude":"39.952763","Longitude":"-105.168598","Country":"United States","files":["/var/www/straped/mufon/html2text/7827.html.txt","/var/www/straped/mufon/org/7827.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.952763,+-105.168598(7827)&iwloc=A&hl=en\"> mufon case (7827) map </A>","Date of the Event":"08/12/2007 11:00 UTC","Viewing Distance":"21-100 Feet","trends":["There have been 3 other sightings in Superior","There were no other sightings in Superior on or around August 12th 2007"],"Object Shape":"Square, Rectagular","Log Number":"US-09032007-0006","Source":"MUFON","Disposition":"Unknown","Region":"Colorado","Date Submitted":"08/12/2007 11:00 UTC","Summary":"Unidentifiable Object Seen During Perseid Meteor Shower in Superior, CO"}