{"City":"Dallas","files":["/var/www/straped/mufon/html2text/7828.html.txt","/var/www/straped/mufon/org/7828.html"],"Longitude":"-96.764843","Viewing Distance":"Unknown","Log Number":"US-09032007-0007","Latitude":"32.805955","map":"<A HREF = \"http://maps.google.com/maps?q=32.805955,+-96.764843(7828)&iwloc=A&hl=en\"> mufon case (7828) map </A>","Summary":"Witnessed a very bright ball of light at approximately 150 feet above ground fly across neighborhood and vanish mid-flight - Very fast, and no noise.","Date Submitted":"08/08/2007 08:30 UTC","trends":["There have been 116 other sightings in Dallas","There were no other sightings in Dallas on or around August 8th 2007"],"Date of the Event":"08/08/2007 08:30 UTC","Object Flight Path":"Undisclosed","Country":"United States","Disposition":"Unknown","Region":"Texas","Case Number":"7828","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Weather Factors":"Unknown","Source":"MUFON","Tags":"City","divs":["sighting detailson the evening of august 8th, i was meeting two friends for dinner at 8:30 pm. i parked my car in the parking lot of the restaurant and got out to walk in. it was a beautiful evening, still light out. i looked up in the sky to appreciate the evening and my eye caught site of a very bright object, or ball of light about a block or two away and approx. 150 feet in the air. it was silent and moving at incredible speed toward where i stood. my first thought was that i was witnessing a shooting star or some sort of fireworks (only there was no noise). the object\\light continued past my location and within seconds vanished into thin air. it never lost altitude, and there was never any noise. the whole experience lasted probably 10 - 15 seconds. that's when i felt i had seen something incredible. i looked around to see if anyone else seemed to notice this site. no other witnesses were noted. i went into the restaurant and told my friends about this encounter. also spoke with my family about it later that evening, but didn't want to appear to be a ufo fanatic. i did contact the news stations to see if others had reported anything similar (nothing noted). i also spoke with the electric company to see if there had been any transformer problems in the area that night. none were reported. i still believe i witnessed something very special that evening, but have no explanation for what it might have been."],"Object Shape":"Fireball, Star-like"}