{"files":["/var/www/straped/mufon/html2text/7834.html.txt","/var/www/straped/mufon/org/7834.html"],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","Date of the Event":"07/31/1968 09:30 UTC","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=42.069751,+-87.787841(7834)&iwloc=A&hl=en\"> mufon case (7834) map </A>","Latitude":"42.069751","City":"Glenview","divs":["Sighting DetailsMy fiance and I were driving both of our cars south on Waukegan Road in Glenview, Illinois and saw a bright, round light up ahead. It was stationary. It was smaller than the moon, but larger than a planet, and appeared to be fairly close, not a distant sky object. Although we were in separate cars, and had no cell phones at that time, we both thought it was a UFO. We drove about a half a mile, then pulled into the McDonalds parking lot to drop off my car. When we got back out onto the street and drove a very short distance, people were out of their cars, no traffic was moving. The police were among the onlookers and they were staring at the light also. Someone said it might be a flare but it was much too large, and never descended. We finally had to leave, but I told my finace that we could read about it in the paper in the morning. We were certain it would be big news because the police were there and Waukegan Road was basically, unofficially shut down, with all the people watching the incident. The police were making no effort to get the traffic flowing, as they were staring at the object, along with everyone else. Although we looked for several days, and watched the news every night, nothing was in the paper, the TV news, or on radio. When I learned about J. Alan Hynek, I wanted to contact him, but never did. It is so much easier in the day of the internet. I am hoping someone else knows of this incident and can give me an explaination."],"Log Number":"US-09032007-0013","Object Features":"None","Source":"MUFON","Longitude":"-87.787841","Date Submitted":"07/31/1968 09:30 UTC","Tags":"City","trends":["There have been 2 other sightings in Glenview","There were no other sightings in Glenview on or around July 31st 1968"],"Summary":"Bright light, not the moon,too large for a planet, in sky for many minutes","Object Flight Path":"Stationary","Case Number":"7834","Country":"United States","Object Shape":"Circle","Region":"Illinois"}