{"trends":["There have been 41 other sightings in Fort Myers","There were no other sightings in Fort Myers on or around August 24th 2007"],"divs":["Sighting DetailsWhile lying in bed half asleep, I was looking out my bedroom window which faces the East, over the adjacent golfcourse noticing an approaching object in the Southeastern sky. It first appeared to be an approaching plane but as it came closer, I could see it was more in the shape of a man's wide-brimmed hat with orange lights at the top, and around the brim there were multi-colored lights rotating in a clockwise direction and pulsating at the same time. It appeared to be a huge object based upon my estimate of its location in the sky, and the distance from which my Wife and I were viewing it. As it hovered, and we watched (for apx 5-10 minutes) I grabbed the phone and called the local newspaper. Since it was so early in the morning, I got their message service and left a detailed message of what I was witnessing. As we continued to watch, I ran back into the house and searched for the telephone number of the Sheriff's office to report what I saw, and in my haste to get back to the sigting, I was unable to find the telephone number. As I ran back out to see the object, it had moved higher in the sky and to the South. As we continued watching, and as the Sunlight began to appear, the object disappeared. If I had to estimate its size, I would say it looked to be 300-500 ft. wide, and was apx. 1,000 ft from the ground while it was hovering. It seemed to be positioned about a mile from where we live. Subsequent telephone calls to the local airports have determined there was nothing unusual in the sky that morning that was noticed by any airport authorities, or there were no reports made. This incident was not corroborated by the News Press, or any TV, or Radio shows that I have been able to determine, and evidently witnessed only by my Wife and I. I would like to hear from anyone else that may have seen this very credible event."],"Summary":"Large craft hovering over treetops","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","City":"Fort Myers","Object Flight Path":"Hovering then path,Path then hovering","Log Number":"US-09042007-0002","Disposition":"Unknown","Date of the Event":"08/24/2007 05:45 UTC","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/7838.html.txt","/var/www/straped/mufon/org/7838.html"],"Latitude":"26.649598","Object Features":"Dome","map":"<A HREF = \"http://maps.google.com/maps?q=26.649598,+-81.869348(7838)&iwloc=A&hl=en\"> mufon case (7838) map </A>","Region":"Florida","Longitude":"-81.869348","Tags":"City","Object Shape":"Oval, Sphere","Date Submitted":"08/24/2007 05:45 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","Case Number":"7838"}