{"trends":["There have been 6 other sightings in San Rafael","There were no other sightings in San Rafael on or around November 30th 1968"],"Tags":"City","Log Number":"US-09042007-0003","Object Shape":"Star-like","Summary":"Like an airplane sighting during the afternoon, only it never moved, for minutes, then in one second, it was gone.","Date of the Event":"11/30/1968 03:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.011667,+-122.541667(7839)&iwloc=A&hl=en\"> mufon case (7839) map </A>","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/7839.html.txt","/var/www/straped/mufon/org/7839.html"],"Viewing Distance":"Unknown","Disposition":"Insufficient Data","divs":["sighting detailsit was mid afternoon, on a hot, sunny, summer day. i was a young teenager, riding my bicycle in my own very quiet neighborhood, going to visit a friend, something i did often. out of habit, i stopped to look up at yet another airplane; airplanes have always facinated me. we lived in terra linda california, very close to hamilton air force base in novato california, and only a short distance north of the sfo and san jose airports while having several smaller airports in our area so i had been used to seeing lots of different aircraft for years. however, on this wonderful day, my airplane wasn't moving and it made no sound while not leaving any con trail. it's bright flash had just caught my eye so i looked skyward, this time in the direction of the bay, as i always did and still do. i had stopped riding by now and was standing out in the middle of my quiet street, just staring at this very bright, probably reflective object that was not an airplane. it's size and\\or shape never changed; it was just a shiny object, like a light reflection off of a car windshield, a very bight spot backed by blue, cloudless sky. i stood there for a couple of minutes which at that time seemed like all afternoon. the object was not close so i could not make out any detail. without warning and very suddenly, my object streeked off across the sky and out of sight. there was no feeling of acceleration, it just moved off. the rate of speed at which it departed was extreme, unlike any of the countless airplanes that i had ever watched. in one or two seconds it went totally across the sky and out of sight, without a sound. i attempted to tell my parents and everyone i could find. i even asked them to call the police as i felt what i had seen was not routine or normal. no one listened to me, everyone just laughed it off. yet, to this day, i know what i saw and it was no airplane. today, i am almost 50, yet i remember my sighting like it was yesterday. at the time of my sighting, i was not scared. i was just so curious about what sort of airplane could just sit in the afternoon sky like it had and then jet off so quickly. after it left my sight, i became a little unsettled as i realized that no other aircraft that i had ever seen or heard of could fly that fast and not that far from me."],"Date Submitted":"11/30/1968 03:00 UTC","Object Features":"None","Latitude":"38.011667","Source":"MUFON","Case Number":"7839","Sighting Duration":"Undisclosed","Region":"California","Object Flight Path":"Hovering then path","Country":"United States","Longitude":"-122.541667","City":"San Rafael"}