{"Object Features":"Undisclosed","Latitude":"44.316264","Log Number":"US-09042007-0004","Region":"Michigan","City":"Undisclosed","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","divs":["Sighting DetailsI was wondering why I had seen this object twice already and googled weather balloons. I had no idea they got that big, 30ft plus, and so high, 100,000ft and that NOAA releases one almost every day from White Lake Twp MI. I even saw one tonight, same thing but earlier because the balloon was further east. I saw a picture of a balloon from the bottom and it looked quite like the object I saw. I did not see a tether however, but I think it was likely a weather balloon. I would say I am 95% confident I have it right this time. Just tonight I looked straight up and right next to Vega was the orange object but it was too dull to find with my telescope. I saw it once but it was moving to fast and I coulndt see it for very long and then it became too dim and I lost it. Sorry for the last report but I feel that I owe it to all you folks to report what I am nearly certain is the truth. I now understand why UFO experts say that most ufo sightings are balloons. Not only does NOAA launch quite a few but there are also a number of balloon enthusiasts who do the same and take high altitude pictures of the atmosphere and the ground. The truth is far more important that being right. Truth supercedes ego, at least for me. I will be more cautious in the future."],"Sighting Duration":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/7840.html.txt","/var/www/straped/mufon/org/7840.html"],"Date of the Event":"09/01/2007 12:00 UTC","Source":"MUFON","Summary":"Last sightin almost assuredly a weather balloon","Longitude":"-85.597974","trends":[],"Country":"United States","Date Submitted":"09/01/2007 12:00 UTC","Viewing Distance":"Unknown","Object Shape":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=44.316264,+-85.597974(7840)&iwloc=A&hl=en\"> mufon case (7840) map </A>","Disposition":"Unresolved","Case Number":"7840"}