{"Object Shape":"Disc","Object Flight Path":"Undisclosed","trends":["There have been 6 other sightings in Lake George","There were no other sightings in Lake George on or around August 4th 2007"],"Country":"United States","Object Features":"Undisclosed","Summary":"Object appeared starlike. Kept moving and growing larger . Using binocculars it was definitely seen tobe disk shaped .","Source":"MUFON","Case Number":"7841","Longitude":"-73.712341","Date of the Event":"08/04/2007 04:30 UTC","divs":["sighting details i have a summer home in the adirondacks on sherman lake. this morning - tues, 9\\4\\07 at about 4:30 am, i walked out to the shore of the lake to try some night fishing. a light above the trees on other side of lake looked like a star but seemed to be moving upward and getting larger. it frightened me because i felt that it was moving closer and that somehow it knew that i was observing it. i then ran into my house to get my son and three of his friends who were staying over for the weekend. they are each 16 years old and excellernt students. they all witnessed the light. i then sent my son back to the house to find and bring my binocculars out to me. he left and when he returned i looked at the object through the binocculars and was shocked to discover that the object appeared to be disk shaped and wobbling in such a way that it alternated between being a circle that was white but contained dark spots on its surface in a definite pattern, to one that revealed it to be a difinite disk shape when seen from a side view. also, to the naked eye it appeared to be a star that grew to the size of an \"orange.\" it was very bright and kept moving upward and to my right. i was facing east, and that is where the object was. what floored me even further was that to the naked eye it had a bright glow, but when observed through simple binocculars, that glow disappeared and the object could be seen rather clearly. all four boys saw what i saw through the binocculars. the object kept rising slowly and diminishing in size. it was still visible after daybreak when all the stars were gone; finally receeding into the distance and disappearing."],"Date Submitted":"08/04/2007 04:30 UTC","Latitude":"43.426181","Log Number":"US-09042007-0005","Weather Factors":"Unknown","City":"Lake George","Region":"New York","Viewing Distance":"Unknown","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/7841.html.txt","/var/www/straped/mufon/org/7841.html"],"Tags":"City","Sighting Duration":"01:30:00","map":"<A HREF = \"http://maps.google.com/maps?q=43.426181,+-73.712341(7841)&iwloc=A&hl=en\"> mufon case (7841) map </A>"}