{"files":["/var/www/straped/mufon/html2text/7842.html.txt","/var/www/straped/mufon/org/7842.html"],"Region":"New York","Log Number":"US-09042007-0006","map":"<A HREF = \"http://maps.google.com/maps?q=40.65264,+-73.94511(7842)&iwloc=A&hl=en\"> mufon case (7842) map </A>","Sighting Duration":"00:20:00","divs":["Sighting DetailsI was at my apartment complex at Starrett City, located in Brooklyn, New York, on my way home to my apartment. The date was approximately summer 1998. The time was approximately 2pm. As I was walking to my building I glanced up at the sky for no particular reason other then to view the sky. That is when I saw the UFO. What I saw was what looked like A torroidial (Donut) shaped glowing plasma. The color of which I would closest describe as molten gold, but not exactly. The object was not a continuous torroidial shape but was instead waning and waxing in the following manner. The object would start out as a vague dim section of a torroidial shaped object and slowly morph into a complete torroidial shaped brightly glowing object. It would then revert from its torroidial shaped glowing golden like brilliance to a vague dim section of a torroidial shaped object, again. It continued doing this continuously during the entire time I witnessed this object. I would estimate this object to be approximately 100 yards in diameter and 1 mile directly away from me. The direction of the object from me was approximately dead east. The object was traveling at a relatively slow but steady southern direction, AGAINST THE DIRECTION OF THE CLOUDS. I would guess I witnessed the object for a total of 20 minutes. After looking at it for 5 minutes I decided to run up to my apartment to get my binoculars to see it closer. By the time I got the binoculars and made it back downstairs, approximately 10 minutes had passed. The object had traveled so far south by that time that by looking in my binoculars the object looked the same size as when I had first saw it. I witnessed the object through binoculars for an additional 5 minutes and then I simply left off looking at it. I would like to express my feelings as to what I feel I was seeing. Although I can not say for a certainty what this anomalous object was, what I can say, and I feel very strongly about this, is the following. This object gave me a very strong impression that there was an engine of sorts powering it and that it was either malfunctioning or was experimental in nature and not functioning within expected parameters. Try and try as \"They\" might they could not get this \"Thing\" to stabilize at full power. Not unlike a cars engine that simply will not an maintain idle speed. Start it up, runs rough but idles for a while, and then stalls. I want to tell you that when this object was fully aglow as a complete torroidial shaped object its beauty was aw inspiring!!!"],"Country":"United States","Latitude":"40.65264","Disposition":"Unresolved","Summary":"A torroidial (Donut) shaped glowing plasma. The color of which I would closest describe as molten gold, but not exactly.","Source":"MUFON","Date Submitted":"07/15/1998 02:00 UTC","Weather Factors":"None","Case Number":"7842","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around July 15th 1998"],"Tags":"City","Longitude":"-73.94511","Object Shape":"Other","Viewing Distance":"501 Feet - 1 Mile","Object Features":"None","Date of the Event":"07/15/1998 02:00 UTC","City":"New York","Object Flight Path":"Straight-line path"}