{"Log Number":"US-09052007-0001","map":"<A HREF = \"http://maps.google.com/maps?q=35.24682,+-91.733685(7843)&iwloc=A&hl=en\"> mufon case (7843) map </A>","Latitude":"35.24682","divs":["sighting detailsi have also seen these erratic flashing star lights as previously reported being seen (7\\30\\07). i moved here to white county the 1st week of august. since i arrived, every single night i go outside to the patio to smoke. i have seen these fast erratic flashing lights many, many times in the short amount of time i've lived here, but i usually see them sometime between 9 - 10:30 pm. when i do see them they are out there for a good amount of time, at least 20 minutes or longer. my thought is there are more than one or two crafts in order to appear to be making such quick sharp movements. maybe they are ufo's, that was my first thought, but the air base is not far from here either. during the day it is normal to see several military planes flying overhead practicing exercises. maybe they have night time exercises too. i started keeping my eyes on the sky about two years ago looking for possible ufo's because i believe they do exist, but in this case i tend to think it's the military, then again i may be wrong and they really are ufo's."],"Country":"United States","Date of the Event":"08/07/2007 10:00 UTC","Sighting Duration":"00:20:00","Summary":"Star - like bright and erratic flashing lights","Object Shape":"Flash, Star-like","Tags":"City","Case Number":"7843","files":["/var/www/straped/mufon/html2text/7843.html.txt","/var/www/straped/mufon/org/7843.html"],"Disposition":"Unknown","Object Features":"Unknown","City":"Searcy","Object Flight Path":"Path with directional change,Other","Region":"Arkansas","trends":["There has been one other sighting in Searcy","There were no other sightings in Searcy on or around August 7th 2007"],"Viewing Distance":"Over 1 Mile, Unknown","Source":"MUFON","Longitude":"-91.733685","Date Submitted":"08/07/2007 10:00 UTC","Weather Factors":"None"}