{"Latitude":"38.073323","Disposition":"Unknown","Region":"California","Object Shape":"Oval, Other","map":"<A HREF = \"http://maps.google.com/maps?q=38.073323,+-120.53657(7844)&iwloc=A&hl=en\"> mufon case (7844) map </A>","City":"Angels Camp","trends":["There has been one other sighting in Angels Camp","There were no other sightings in Angels Camp on or around August 30th 2007","This sighting has never been favorited.",""],"Source":"MUFON","Object Features":"None","Summary":"Between two jets","Viewing Distance":"Over 1 Mile, Unknown","divs":["Sighting DetailsI was watering my garden in the front yard as my daughter played with her kitten. My daughter pointed up towards the sky and mentioned \"ship\". I could hear airplanes (or rather jets) and decided to correct her. I watched two jets - one moving about south east and the other further up in flight pattern going towards the north, but right between the flight pattern of these jets was indeed a craft of sorts. It was pilled shaped and as big in comparision to the jets moving away from it. A white craft that hardly moved and when it did - it was either back and forth or up and down. When I seen this I hurried into the house with my daughter and grabbed my digital camera. I was frightened but since it was so far away and the neighbors were outside I felt a bit safe. When I got back outside, daughter still indoors, I took a picture and rushed myself back indoors in sheer fear. The two of us decided we'd watch it from the front window. When we plopped ourselves down onto the window seat to watch, one other neighbor witnessed it and then the craft twinkled and disappeared, it vanished."],"Longitude":"-120.53657","Case Number":"7844","Tags":"City","Country":"United States","Weather Factors":"None, Rain, Light","Sighting Duration":"00:05:00","Date of the Event":"08/30/2007 08:24 UTC","Object Flight Path":"Stationary,Other","Date Submitted":"08/30/2007 08:24 UTC","files":["/var/www/straped/mufon/html2text/7844.html.txt","/var/www/straped/mufon/more/7844_submitter_file1__ufo.jpg","/var/www/straped/mufon/more/7844_submitter_file2__ufo_circled1.JPG","/var/www/straped/mufon/more/7844_submitter_file3__ufo_hugetxt.JPG","/var/www/straped/mufon/org/7844.html"],"Log Number":"US-09052007-0002"}