{"divs":["sighting detailsi was gazing up into the evening sky in 180 degree reclined position in my back yeard and saw travelling from west to east over the city of calabasas, ca 91302 at aprox.8:45 pm wed. 9\\05\\07 four seemingly conneced oval shaped cigars as follows () () () () at first i thought it was four birds flying in formation. if you complete the oval shape which these parentheses can't quite do and imagine these four ovals travelling in tandem in the direction of the line of type you get an idea of what i saw. i often star-gaze around 9-9:30 pm each evening and came out a bit earlier this evening and saw the usual satellites and the occasional small meteor, but this was a much duller fast-moving group of four lens-like figures whose brightness was quite faint but noticiable the naked eye.i quickly raised my 10x60 wide-field wwii german binoculars and saw it quite clearly travelling across the sky about twice the speed of a sattelite, dull yellow-orangish in color, and definitely not birds. i had not special feeling or reaction except, \"ah finally, after all these years i'm seeing not one but four tandem unidentified objects travelling at constant speed high in the sky. i lost sight of the objects when they passed through the open sky area above my viewing position and got lost in the rooftops of a neighborhing home. and that's it."],"City":"Calabasas","Log Number":"US-09062007-0001","Object Features":"None","Latitude":"34.138333","Case Number":"7851","Sighting Duration":"00:00:18","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/7851.html.txt","/var/www/straped/mufon/org/7851.html"],"Object Shape":"Oval","Date Submitted":"09/05/2007 08:45 UTC","Region":"California","Object Flight Path":"Straight-line path","Longitude":"-118.660833","Viewing Distance":"Unknown","Date of the Event":"09/05/2007 08:45 UTC","Weather Factors":"None","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.138333,+-118.660833(7851)&iwloc=A&hl=en\"> mufon case (7851) map </A>","Country":"United States","Source":"MUFON","Summary":"3 elongated dull orange discs travelling in tandem sideways in a straight line","trends":["There have been 4 other sightings in Calabasas","There were no other sightings in Calabasas on or around September 5th 2007"]}