{"Country":"United States","divs":["Sighting DetailsI have been a police officer for 30 years. i work in the hills of Kentucky so i have no nonsense in my life and work. I saw this object.and it was moving ay about 30 knots. I live 100 yards from where i had the sighting. MY wife was in the bathtub and the water was disturbed and ripples were in the water. I was not the only observer. I received a number of calls. one caller stated it came over his home and the lights were searching. His home is on top of one of the mountains here in Estill county. I did not report it for the same reasons pilots don't report a ufo. I am not a NUT. hopefully you can shed some light on what i saw. There is a U.S.ARMY base to the southwest. Nerve gas in kept there. I worked there in the 1960s in Inventory so i know what was there. also the U.S airforce used the radar there for their practice bombing runs. thank you for taking the time to read this report. as i stated before i am not a NUT. Moreover I am a person who believes nothing i hear and half of what i see. I saw this thing coming for some distance, it was moving very slow. not a blimp, not a helo. I am uneasy with things i don't understand."],"Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/7855.html.txt","/var/www/straped/mufon/org/7855.html"],"Object Features":"Undisclosed","City":"Irvine","trends":["There have been no other sightings in Irvine","This sighting has never been favorited."],"Disposition":"Unknown","Longitude":"-83.973813","Sighting Duration":"00:12:00","map":"<A HREF = \"http://maps.google.com/maps?q=37.700638,+-83.973813(7855)&iwloc=A&hl=en\"> mufon case (7855) map </A>","Date Submitted":"08/24/1988 10:19 UTC","Object Flight Path":"Undisclosed","Date of the Event":"08/24/1988 10:19 UTC","Log Number":"US-09062007-0005","Latitude":"37.700638","Region":"Kentucky","Weather Factors":"Unknown","Summary":"I am a police officer, i was watching traffic when this delta shapped object came from the south west heading northeast. 200 feet altitiudeno sound except for a vibration.collision lights on all 3 corners. it was seen by a number of people.","Source":"MUFON","Case Number":"7855","Viewing Distance":"Unknown","Tags":"City"}