{"Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Latitude":"33.451278","City":"Andrews","Summary":"Four, Football Field Bright, Lights in a kite shape aiming towards ground.","files":["/var/www/straped/mufon/html2text/7857.html.txt","/var/www/straped/mufon/org/7857.html"],"Source":"MUFON","Disposition":"Unknown","Sighting Duration":"Undisclosed","Log Number":"US-09072007-0001","Longitude":"-79.560897","Tags":"City","Weather Factors":"None","trends":["There have been no other sightings in Andrews","This sighting has never been favorited."],"divs":["Sighting DetailsA co-worker and myself were sitting outside on our stage at work, when I noticed four, very white lights in a kite shape in the sky. I tapped him on the shoulder and asked him what that was. He looked and said that he didn't know. We both seen these lights. I then smacked his shoulder again and asked him what the f*** that was. We were looking over our left shoulders, over the highway. It was approx. 20 to 30 feet above the tree line. We stood up and the lights started to dim away. They didn't switch off like a light switch but dimmed away like on a dimmer switch. There are no light towers in the vacinity of where we saw these lights. We stood there scratching our heads for a few minutes. After which I noticed approx. 12 twinkling lights going in a northerly direction. Approx. 15 minutes after the sighting, a small prop plane flew by. This was the first airplane that we heard since being outside. He flew over in the direction of the sighting. Then continued to circle Andrews then come back. He flew over the spot again then banked hard back towards Andrews. Once he did this 6 of those twinkling lights came back towards us heading south. All but one dissappeared. We will be sitting outside for the next few nights to see if we can get anything on camera. It was truly an experience that I will never forget. *The lights were as bright as a football fields lights. Only four of them. But they were in a shape that resembled a kite. One in the front, one tight to the left of it but a little behind the front one, one tight to the right of it but a little behind the front one, and one light in the back with more of a space between that and the front, than the space between the two side ones. And it was black in between the lights. If there were a light tower close, close by then that would explain everything. But there is nothing but trees and houses over there. It wasn't fireworks. It wasn't cars or traffic. Unknown to us and it will kill us if we never get a chance to see this again. I promise we are not crazy."],"Object Shape":"Cross","Country":"United States","Region":"South Carolina","Date of the Event":"09/06/2007 08:30 UTC","Case Number":"7857","Object Flight Path":"Stationary,Unknown","Date Submitted":"09/06/2007 08:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.451278,+-79.560897(7857)&iwloc=A&hl=en\"> mufon case (7857) map </A>"}