{"Weather Factors":"None","Date of the Event":"08/03/2007 12:00 UTC","City":"Valley Springs","Longitude":"-120.829103","Latitude":"38.191586","map":"<A HREF = \"http://maps.google.com/maps?q=38.191586,+-120.829103(7862)&iwloc=A&hl=en\"> mufon case (7862) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/7862.html.txt","/var/www/straped/mufon/more/7862_submitter_file1__100_7181.jpg","/var/www/straped/mufon/org/7862.html"],"Object Features":"Appendage(s)","Source":"MUFON","Object Flight Path":"Path with directional change","Region":"California","Viewing Distance":"Unknown","Country":"United States","Sighting Duration":"00:05:00","Date Submitted":"08/03/2007 12:00 UTC","Case Number":"7862","Disposition":"IFO","trends":["There have been 3 other sightings in Valley Springs","There were no other sightings in Valley Springs on or around August 3rd 2007","This sighting has never been favorited.",""],"Object Shape":"Triangle","divs":["Sighting DetailsI was recently on vacation at U.S. Army Corps of Engineers New Hogan Lake. One August afternoon I was floating in my boat just enjoying the afternoon sky when something caught my eye. It was some type of aircraft, most likely military. It was wedge-shaped in appearance from what I saw. I was unable to tell its size or altitude. I am 60% deaf so I did not hear any sound, but when a commercial jet does over fly that lake, if I am floating with engine off and no boats are making noise, I can just barely hear the engines. The picture was taken with a digital Kodak Easy Share camera. The aircraft slowed to a stand still, made a few barrel rolls, accelerated to a speed about the same as when you see an airliner overhead. I was unable to guess its altitude, but I think it was greater than 10,000 feet. It was not an F-117 or B-2. No exhaust was visible. I only took one photo, I only observed it for about 5 minutes, to me it was un remarkable, I have seen many military craft like the Boeing Bird of Prey. I only now decided to report it because I was flicking through my vacation pictures and remembered about the day I saw the UFO. Now I use the term UFO, as it should be, this aircraft to me was Unidentifed, UFO to me does not mean alien spaceship. I am sure this was a U.S. military craft. -"],"Summary":"Wedged shaped aircraft.","Log Number":"US-09082007-0001"}