{"Source":"MUFON","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.730379,+-73.239845(7866)&iwloc=A&hl=en\"> mufon case (7866) map </A>","files":["/var/www/straped/mufon/html2text/7866.html.txt","/var/www/straped/mufon/more/7866_submitter_file1__Sun4.JPG","/var/www/straped/mufon/more/7866_submitter_file2__Sun3.JPG","/var/www/straped/mufon/more/7866_submitter_file3__Sun2.JPG","/var/www/straped/mufon/org/7866.html"],"City":"Bay Shore","Longitude":"-73.239845","Tags":"City","Country":"United States","Latitude":"40.730379","Log Number":"US-09082007-0005","trends":["There have been 16 other sightings in Bay Shore","There were no other sightings in Bay Shore on or around June 12th 2007","This sighting has never been favorited.",""],"Object Flight Path":"Path then hovering","Disposition":"Unresolved","Region":"New York","Weather Factors":"None","Date Submitted":"06/12/2007 12:00 UTC","Case Number":"7866","Summary":"I was sitting outside on my porch and I went to look in the direction of the sun when I noticed the object","Date of the Event":"06/12/2007 12:00 UTC","Object Features":"Unknown","Viewing Distance":"Unknown","Object Shape":"Bullet, Missile, Cigar","divs":["Sighting DetailsI was sitting outside on my porch and I went to look in the direction of the sun when I noticed a black object fluttering around the sky. Since it was close to the sun it was a little hard to focus but I did see something. The object moved up and down then in a right to left motion, not in a straight line, but what appeared to be a little wavy. It definetly was not an aircraft because it did not go in any flight pattern. I went inside to get my digital camera and took several pics of the object. I could not see the object because of the glare from the sun, but I took pics anyway. I looked at the pics and could not see anything, I thought maybe whatever it was left by the time I was finished taking pics. I was about to delete them when I noticed in pic called \"SUN#4\" a black object in the lower left corner of the pic.I will send all four pics, but definetly in #4 you can see something."]}