{"Region":"New Brunswick","map":"<A HREF = \"http://maps.google.com/maps?q=45.96742,+-66.636505(7869)&iwloc=A&hl=en\"> mufon case (7869) map </A>","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/7869.html.txt","/var/www/straped/mufon/org/7869.html"],"Log Number":"CA-09092007-0001","Object Shape":"Egg, Other","Sighting Duration":"Undisclosed","Longitude":"-66.636505","Viewing Distance":"Unknown","Date Submitted":"09/08/2007 11:30 UTC","City":"Fredericton","divs":["Sighting DetailsMy son and I were standing outside at night. It was dark and clear. We were closing the garden gate. A movement in the sky came into view, just over the tress and houses across the street. I saw a v-formation of moving objects. My initial thought was it was a flock of geese. I alerted my son to look up. He immediately saw the formation as well. We both observed approximately five illuminated orbs in the sky approximately sixty feet over head. They were arranged in a v-formation. They flew above the trees lining the street. They flew in formation in a sweeping forward motion moving up, down and at an angle, but always moving forward and maintaining the \"v\" formation. There was no sound. The objects were illuminated. My initial thought was how odd it was for geese to be so brightly lit at night by the street lights below. Almost immediately after I thought this, I realized that the light was wrong and these objects were not being lit from below. I also realized that geese don't usually fly in the dark nor in the undulating pattern that we observed. Also the silence was unusual. The light was constant and consistent. Each object appeared to be one large, soft light in a white or light yellow hue. The light did not give off rays or illuminate the street or houses below. The formation moved quickly up the street and over the trees at the end of the street. My view of the end of the street was obscured by trees, and thus the formation fell out of my view. This happened quickly, with a duration of approximately five to ten seconds. The formation moved from east to west."],"Country":"Canada","Summary":"V formation 5 orb like lights moving and swooping very fast ,silent and absolutely sychronized","Date of the Event":"09/08/2007 11:30 UTC","Tags":"City","Object Features":"Unknown","Case Number":"7869","Object Flight Path":"Path with directional change","Disposition":"Unresolved","trends":["There have been 8 other sightings in Fredericton","There were no other sightings in Fredericton on or around September 8th 2007"],"Source":"MUFON","Latitude":"45.96742"}