{"Case Number":"787","map":"<A HREF = \"http://maps.google.com/maps?q=34.371389,+-119.305556(787)&iwloc=A&hl=en\"> mufon case (787) map </A>","Region":"California","divs":["Sighting DetailsMy husband and I were traveling in our car on highway 33 north towards CasitasSprings between 103A30 p.m. and 113A00 p.m. on Thursday night. Looking north towards the mountains we both becameaware of a bright shiny green light that was falling at rapid speed. At first Ithought we were seeing a falling star, because thats exacly what it lookedlike, but in an instant I realized something was wrong because it was green. Iasked my husband if he was seeing what I was seeing and he said, yes. I askedhim,22is that a falling star?22 and he said22I dont know.22 I said22its green isnt it?22, and he confirmed it. We were both very calm, but curious. As it camecloser to the earth it seemed to fade, just as a falling star would have. Itdisappeared as it reached the mountain, and I couldnt tell if it22landed22 behind or in front of it. It was a very remote area, and very dark. Therewould have been no way we could have reached the area it seemed to disappear in. I asked my husband if we had just seen a UFO, but he didnt want to committ tothat. Later we convinced ourselves that it was probably a natural occurrence. I looked in the paper the next day for some explanation thinking that surelysomeone else had seen it, but there wasnt anything in the paper. When Icouldnt find anything, my husband suggested that maybe I should report it afterall. I still think that this was something natural that Im just not aware of,but I cant think of who to ask except my husbands colleagues and the college Im afraid of sounding kind of silly to tell you the truth. Im very sorry tobother you with this, because I dont think it will be of any use to you, butIm terribly curious. Thanks for you time."],"Tags":"City","Date of the Event":"08/24/2000 11:00 UTC","Source":"MUFON","Summary":"Green light that looked like a falling star","Longitude":"-119.305556","files":["/var/www/straped/mufon/html2text/787.html.txt","/var/www/straped/mufon/org/787.html"],"Weather Factors":"Unknown","Country":"United States","Object Shape":"Undisclosed","Latitude":"34.371389","Sighting Duration":"00:00:59","City":"Casitas Springs","Log Number":"","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been no other sightings in Casitas Springs","This sighting has never been favorited."],"Object Features":"Undisclosed","Date Submitted":"08/24/2000 11:00 UTC"}