{"Longitude":"-90.424292","Object Shape":"Circle, Star-like","Object Features":"Undisclosed","trends":["There have been no other sightings in Beardstown","This sighting has never been favorited."],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.017548,+-90.424292(7873)&iwloc=A&hl=en\"> mufon case (7873) map </A>","Source":"MUFON","Date of the Event":"09/15/2001 09:00 UTC","Latitude":"40.017548","divs":["Sighting DetailsIt was on a summer evening when i was talking to my cousin while sitting on my enclosed front porch. I was relaxing in a rocking chair talking to her while looking out my many windows. I looked to my left towards the river (north) when i noticed a few stars, i saw this white light which looked like a star moving, then it stopped and went out, then all of a sudden it turned into the \"brightest orange solid ball shape\" all the while staying in that same spot. I screamed to my cousin on the phone what i was seeing. Then it went out like you turn off a light switch and when it came back on there wewre three of the orange ball shapes.They would do the same go out and come back on. They really put on a show !! All three were in the form of a triangle.Sometimes, the two at the bottom would go up and combine with the one on the top. I have seen ufos before, so i was not really like \"what is that\"? When it finally decided to move on after staying in this same spot for at least 10 minutes, the two at the bottom went up into the top orange ball like and then went back into a whit light like a star and slowly headed to the southeast. I lived two and a half blocks from the river, and it looked to be right over it.I mentioned this to a few people and found out later i wasn't the only one to witness this sighting.I did leave the phone and go outside to watch this and i heard no noise. Nothing we have can do what this ufo did that night that is for sure. One of the other ones i seen was in the early evening coming up through a neighbors field. It was early evening and i had went out to check on my young dog and was looking down the gravel road and saw this \"big saucer shape ufo with a dome and windows all around it\", it was moving very slowly,no sound. I thought at first \"what kind of farm machinery is that\", it was so low to the ground. Then the closer it got i knew it wasn't anything from out planet !! I ran to the front door and told my then husband \"come fast a ufo\" !!!! We stood there and watched it still coming up the field (and this field was right across our little gravel road). It started to pick up speed as it neared us while lifting up higher and went past us maybe 15 ft off the ground. Then we watched it till it got out of sight. I looked at my husband and said \"now don't ever tell me there are no ufos\". It was the year 1976, and i was 27 years old and i am now 59. I have seen other ufos but not at the closeness as these two were. I know there are so many who don't beleive in them, but if they would ever see one they would. I know what i seen was nothing form this earth. What i seen these ufos do, we could not. There is a place they are coming from , but where?"],"Summary":"Looked like a star at first, but noticed it moving, then stopped and turned into a big orange solid circle, then divided into 3.","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/7873.html.txt","/var/www/straped/mufon/org/7873.html"],"City":"Beardstown","Region":"Illinois","Tags":"City","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Date Submitted":"09/15/2001 09:00 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Case Number":"7873","Log Number":"US-09092007-0005"}