{"Object Features":"Other","Latitude":"33.645032","Sighting Duration":"00:00:21","Disposition":"IFO","Date of the Event":"09/09/1998 05:57 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.645032,+-117.912009(7874)&iwloc=A&hl=en\"> mufon case (7874) map </A>","Tags":"City","Object Shape":"Other","Country":"United States","divs":["Sighting DetailsI was walking to work in the early morning. It was still night time and not a cloud in the sky. You could see a lot of stars, the sliver of the moon, and Venus very well. I was heading north bound on superior, just before 17th in Costa Mesa ca, when a brightly colored object flew across my vision from right to left. It looked like a giant light colored donut flying through the sky. It took about 3 seconds for it to cross over. I looked at my cell phone; it was 5:58 AM. I knew that if it was a meteor shower there would be more. Seconds later, a bright light shot across the sky heading north. It was just a streak of light. The funny thing is that the first object was heading east or south east, and seemed to zig zag when it was farther away; the second was heading north. The first object was very strange. I couldn't tell if it as glowing or just brightly colored, like a very light orange. At first it looked like a donut, and then it looked like an acorn, then like a donut again. It was very large and at a much lower altitude than the second one. The second seemed to be far up above me moving fast, like a comet; when the first seemed lower and in front of me, and moving much slower than the second. The whole thing happened so fast. It was freaky, and kind of cool."],"Region":"California","Object Flight Path":"Path with directional change","Case Number":"7874","Weather Factors":"Unknown","City":"Costa Mesa","Date Submitted":"09/09/1998 05:57 UTC","trends":["There have been 17 other sightings in Costa Mesa","There were no other sightings in Costa Mesa on or around September 9th 1998"],"files":["/var/www/straped/mufon/html2text/7874.html.txt","/var/www/straped/mufon/org/7874.html"],"Source":"MUFON","Summary":"two ufo's in costa mesa ca at 6 am on a clear night","Log Number":"US-09092007-0006","Viewing Distance":"Unknown","Longitude":"-117.912009"}