{"Weather Factors":"Unknown","Latitude":"35.026837","Sighting Duration":"00:10:00","Case Number":"7875","Longitude":"-110.690437","City":"Winslow","Date Submitted":"09/02/2007 07:35 UTC","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=35.026837,+-110.690437(7875)&iwloc=A&hl=en\"> mufon case (7875) map </A>","Disposition":"Unknown","Source":"MUFON","Summary":"Bright light in the sky.","Country":"United States","Viewing Distance":"Unknown","Object Features":"None","Date of the Event":"09/02/2007 07:35 UTC","Region":"Arizona","trends":["There have been 5 other sightings in Winslow","There were no other sightings in Winslow on or around September 2nd 2007","This sighting has never been favorited.",""],"Object Shape":"Circle, Disc, Star-like","Tags":"City","files":["/var/www/straped/mufon/html2text/7875.html.txt","/var/www/straped/mufon/more/7875_submitter_file1__1.jpg","/var/www/straped/mufon/more/7875_submitter_file2__2.jpg","/var/www/straped/mufon/more/7875_submitter_file3__2.jpg","/var/www/straped/mufon/org/7875.html"],"Log Number":"US-09102007-0001","divs":["sighting detailsmy wife and i were driving east(just east of winslow, az) on i40 and she spotted an extremely bright light in the sky. it was in southern sky and was kinda white\\yellow against only the blue sky. i watched as i drove. it stayed in the same spot the whole time. i told her to try to take some pictures of it and she was not able to take them fast enough. the light had some clouds move closer to it. this is when we took our pictures. the clouds moved in front of and behind it with it staying still the whole time. the about 10 minutes after first spotting it a cloud moved in front of it and after the cloud went by it was gone and blue on the other side again. i do not know what exactly we saw but i have never seen anything like it. it was much brighter than a star. it was an amazing experience for both of us. one strange thing is that when i looked at the picture later there is an odd disc shaped object to the right of the light. we did not see that at the time but we were focused on the light. the disc shaped object is almost exactly parallel with the light too. also, if possible, i would like to have someone else's opinion on this."]}