{"Viewing Distance":"Over One Mile","Weather Factors":"Unknown","trends":["There have been 47 other sightings in Montreal","There were no other sightings in Montreal on or around September 9th 2007"],"Sighting Duration":"Undisclosed","Date of the Event":"09/09/2007 09:43 UTC","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Latitude":"45.51687","Summary":"strange lights observed in lower suburban sky","Object Features":"None, Unknown","Object Shape":"Star-like","Log Number":"CA-09102007-0007","City":"Montreal","divs":["Sighting Detailsin the evening of the date mentioned at 9:40 PM I sat outside of my basement appartment to smoke a cigarette when all of a sudden I noticed a small white light similar to that of a low flying aircraft moving in the lower sky, normaly I would not pay attention to this because I'm quite familiar with what I see in the sky in this region whether it be stars ( not many here for that matter because of light pollution) or the many lighted aircraft from the local airport, but what caught my attention is that it wasn't moving in a normal way of any kind, it was moving very erratically, constantly changing direction while always staying in the general vacinity, kind of like the way an insect would move when it hovers around, and while this small white light would move around a small blue light would momentarily flash for a fraction of a second right next to it, nothing like any of the night flying aircraft I have observed all my life. After a short minute of observing this object all of a sudden appeared a second similar object, and then a third! all moving in the same fashion as the first object and all moving independently of each other. After 4 or 5 minutes of observation I grabbed my camera bag, got in my car and headed in the general vacinity of where these objects were. Having stopped at an overpass I got out my car to see where these objects would be and after carefully combing the sky with my eyes there was nothing left to be seen except for a dozen stars, that did not move! From my perspective I am not easily fooled by any kind of explainable event that would fool most people with untrained eyes, I have perfect vision, I have been an aviation enthusiast all my life and have been to many airshows, I even work in the aerospace industry, I build highly precise scale models and I'm also a semi professional photographer, so what I'm saying is that I have a very developed sense of vision and observation and I could not explain what I saw no matter how hard I tried, I do sincerely think I may have observed something unusual. Steve H."],"map":"<A HREF = \"http://maps.google.com/maps?q=45.51687,+-73.548592(7881)&iwloc=A&hl=en\"> mufon case (7881) map </A>","Tags":"City","Disposition":"Unresolved","Source":"MUFON","Longitude":"-73.548592","Case Number":"7881","Country":"Canada","Date Submitted":"09/09/2007 09:43 UTC","files":["/var/www/straped/mufon/html2text/7881.html.txt","/var/www/straped/mufon/org/7881.html"],"Region":"Quebec"}