{"Log Number":"US-09112007-0003","Weather Factors":"Windy, Light","Date Submitted":"09/11/2007 04:50 UTC","Latitude":"45.02691","Region":"Minnesota","Country":"United States","divs":["Sighting Details I was walking to work, along Centerville road. One truck passed me and I was watching the truck as it was going down the road. Then, I noticed in front of it(the truck), an object rise out from some trees about a quarter mile or so up the road. My first thought was a helicopter, but, there are a few things wrong with that. It made no sound as it rose and took off, it had a light pattern that wouldn't make sense for a helicopter, and most obvious, what the heck would a helicopter be doing in the middle of a town. Plus, there are several airfields nearby, so it's highly doubtful a pilot would choose the middle of town to touchdown instead of a few miles away. When it rose up, it was a quick, very straight climb to about 150 feet. Then it hovered stationary for about 5 to 10 seconds. As it was turning to climb higher, I noticed that it started to wobble in a strange way. That is when it started to become clear that this was not a helicopter. As it turned I saw the arrangement of the flashing lights, then I was certain that this was something else. Also, the truck was just kind of sitting at a stop sign as this was going on. So I knew that he or she was taking notice of what was going on in the sky. Unfortunately, after the initial rise and turn to take off, the object was obscured by some trees I was walking by. So I could not make out a definate shape of the object. I saw it again as I came out of the canopy of trees about twenty seconds later, but by this time it was already a small ball of light cruising in the night sky. It was going very fast. A very interesting thing happened while I was walking under the trees, I noticed a sound that I knew well. It was the sound of a jet. Sure enough too, the jet was on the trail of the UFO. Well, not very hot on the trail of it. When I saw the jet following it, that is when I realized how fast it was actually going. Watching the jet behind it made you almost want to laugh at how slow the jet was compared to the UFO. Then I realized that the jet was aware and in pursuit (kind of). That may have been the reason for the hasty departure of the craft. So I am willing to bet that the craft was detected as an unidentified, so they sent a jet to check it out. So, I am sure that there is record of this happening, since it was only about 6 hours ago. I did say my sighting lasted at least 10 minutes. While the jet was trailing the craft it seemed to stop at a very high altitude and then it luminated almost as a star. As I'm watching this in the sky, I have now walked fairly close to the area which the craft first rose, and I noticed trucks and jeeps driving around the general vacinity where it rose from. There are not many vehicles at all driving around at this time in this area usually. Seemed even that they were almost looking for something. Back in the sky, the last strange thing happened. It looked, I won't say 100%, but it looked like the jet actually got close to the object as it was stationary and glowing bright. Then it seemed as it got close, it turned away very suddenly and went in the other direction. Almost like it was leaving it alone, or maybe the state the UFO was in, was causing problems with his jet. Well, by this time I had managed to finish my walk to work, but then as I was walking in the building I took one last look at the sky and then saw that there were alot more jets, and helicopters, and the like. It seemed that the sky was just crawling with activity. Anyway, I wanted to get this information to you before too long so maybe you will be able to find something out. I thought the whole event seemed very exciting, but I kept feeling a little concerned, because I kept thinking that someone, a fellow person, could have been taken. Hope this helps, and it wasn't swamp gas (no swamps in the area). I also made damn sure I saw and knew where Venus was too. Which it was risen, and a good 90 degrees away from the craft at all times. Good luck."],"Viewing Distance":"101-500 Feet","Date of the Event":"09/11/2007 04:50 UTC","Longitude":"-93.08772","map":"<A HREF = \"http://maps.google.com/maps?q=45.02691,+-93.08772(7884)&iwloc=A&hl=en\"> mufon case (7884) map </A>","Sighting Duration":"Undisclosed","Summary":"Object moved straight up as a helicopter would, hovered, displayed numerous flashing lights. Object then kind of wobbled, then went up very fast and shot off very fast.","Object Features":"Unknown","Source":"MUFON","Case Number":"7884","Tags":"City","Object Flight Path":"Stationary,Hovering then path","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/7884.html.txt","/var/www/straped/mufon/org/7884.html"],"City":"Little Canada","trends":["There have been no other sightings in Little Canada","This sighting has never been favorited."],"Object Shape":"Unknown"}