{"map":"<A HREF = \"http://maps.google.com/maps?q=39.890612,+-84.198831(7885)&iwloc=A&hl=en\"> mufon case (7885) map </A>","City":"Vandalia","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/7885.html.txt","/var/www/straped/mufon/org/7885.html"],"Region":"Ohio","trends":["There have been 6 other sightings in Vandalia","There were no other sightings in Vandalia on or around September 11th 2007"],"Log Number":"US-09112007-0004","Date Submitted":"09/11/2007 06:45 UTC","Tags":"City","Source":"MUFON","Summary":"Passed @ high alt. slowly S.E . to N. N.W. silent no vapor trail.","Latitude":"39.890612","Object Shape":"Cigar","Country":"United States","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Features":"Unknown","divs":["Sighting DetailsOur apt. is on the second floor with the living room window facing due north. I am constantly looking out at aircraft and the sky as a matter of habit as I am a flying buff and student pilot. There is nothing but open field between my residense and the Dayton Int'l. Airport which makes aircraft viewing a daily delight. The sky was virtually cloudless as a cold front had moved through earlier this morning.The sun was still up and giving off a bright reflection which caught my attention.The craft had already passed over the apartment coming from the South East when I first noticed it. As I looked at it I was checking for wings , tail, power plant and or vapor trail but was unable to detect any. I began trying to determine size and altitude. I would have to say it had to be twice as large as a 747 body and an estimated altitude of 15 to 20 thousand feet. Its airspeed was compareable to that of a Piper Cub. After assuring myself I wasn't watching just another aircraft flying over I called in my 10 year old son to ask him \"whats that look like to you?\" He caught sight of what I was looking at and after a moment or two he just simply said \"a UFO\". We watched it for a couple more minutes as it progressed on off to the North West with light being reflected off of it all the while.Eventually it was at too great of a distance to see it any longer.The entire sighting lasted about 4-5 minutes. Whether it was one of ours or \"theirs\" it WAS without a doubt. This by the way is not my first sighting by any means. Jeff Lyons"],"Longitude":"-84.198831","Object Flight Path":"Straight-line path","Date of the Event":"09/11/2007 06:45 UTC","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Case Number":"7885"}