{"Weather Factors":"None","Summary":"This is Dr.Ibrahim-----www.ufo-egyptian-hunter.org-----This tape was miss placed since 2001,I failed to send the original tape,I have to send maximum differend fotos as takes many shapes which can't ever explain need your scientists to analysis,thanks .","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=30.04598,+31.244875(7894)&iwloc=A&hl=en\"> mufon case (7894) map </A>","Date Submitted":"02/25/2001 06:17 UTC","divs":["Sighting DetailsDear Sirs,as I failed to send you copy of the original tape,here I sent you many different shapes which that UFO was transfering,the UFO original tape was miss placed with the large numbers of the UFO tapes which I am the one who was shooting and recording sience 1999 till date. For your information I still holding more than 15 UFO cases did't added yet to my web site (www.ufo-egyptian-hunter.org). Regarding this UFO case , it was shooting from the first floor's balcony and ufo was behind the front buildings and it was in the direction of the River Nile in the direction of Giza Pyramids at the west,UFO was appeared just once in the sky commining from upper altitude to lower altitude. No available information about any attempt for landing.But normally all UFO cases were headed to the different Pyramids of Egypt ( Giza or Steps-Pyramid of Saqqara or In-complete Pyramid of Dahsure ). Hopping your scientists will find the answer which I am looking for. Thank you in advance for your efforts you done and you will do. Dr.Ibrahim Egyptian Ufologist www.ufo-egyptian-hunter.org"],"Region":"Al Qahirah","Object Flight Path":"Stationary,Unknown","Viewing Distance":"Over 1 Mile, Unknown","Case Number":"7894","Object Shape":"Blimp, Boomerang, Bullet, Missile, Cigar, Cone, Chevron, Circle, Cross, Cylinder, Diamond, Disc, Egg, Fireball, Flash, Oval, Saturn-like, Sphere, Square, Rectagular, Star-like, Teardrop, Triangle, Other, Unknown","Latitude":"30.04598","City":"Cairo","Sighting Duration":"Undisclosed","trends":["There have been 45 other sightings in Cairo","There were 7 other sightings in Cairo on or around February 25th 2001","This sighting has never been favorited.",""],"Disposition":"Unresolved","Object Features":"Unknown","Longitude":"31.244875","files":["/var/www/straped/mufon/html2text/7894.html.txt","/var/www/straped/mufon/more/7894_submitter_file1__Image023.jpg","/var/www/straped/mufon/more/7894_submitter_file2__Image006x.jpg","/var/www/straped/mufon/more/7894_submitter_file3__Image003.jpg","/var/www/straped/mufon/org/7894.html"],"Log Number":"EG-09112007-0013","Country":"Egypt","Source":"MUFON","Date of the Event":"02/25/2001 06:17 UTC"}