{"Longitude":"-78.642792","Object Shape":"Diamond, Fireball, Star-like","trends":["There have been 24 other sightings in North Myrtle Beach","There were no other sightings in North Myrtle Beach on or around June 27th 2007","This sighting has never been favorited.",""],"Summary":"Small white light in sky, odd manuvers/speed","Sighting Duration":"Undisclosed","Case Number":"7903","Viewing Distance":"Unknown","Latitude":"33.827395","files":["/var/www/straped/mufon/html2text/7903.html.txt","/var/www/straped/mufon/more/7903_submitter_file1__untitled.JPG","/var/www/straped/mufon/org/7903.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.827395,+-78.642792(7903)&iwloc=A&hl=en\"> mufon case (7903) map </A>","Source":"MUFON","Weather Factors":"Windy","Log Number":"US-09122007-0009","divs":["sighting detailswe were sitting on the 7th floor of our balcony looking out into the ocean enjoying the summer breeze. it was a clear night with only a few whispy clouds. we saw a bright white light appear in the sky and it seemed not to move. we at first thought it might be a helicopter or airplane headed straight for us, explaining the lack of perceived movement. it was very bright white, like a star. then, suddenly, it headed to the south for a short distance, at a high rate of speed, and the light remained visible at its fullest brightness, and it disappeared. then, about 2 minutes later, another light, about the same elevation, appeared a short distance to the north of the previous sighting. it wasn't as bright, but, then it just went away as quickly as it appeared. it did not give us the impression of 'movement'. we thought we might should call the coast guard, but, felt silly and did not do so. we knew that if it was a flare it would orginate from the water, head up, and arch over at a slow speed. this didn't match what we thought would be a flare. i'm also aware of a story from woods hole institue back in early 2000 regarding the continental shelf slipping off the coast of nc\\sc. i'm wondering if that is releasing sediment gas and it is somehow igniting. seems that since the airforce base is so close, they would either have their own reports from their control towers or pilots, or, maybe they are just testing a new aircraft. we were stunned at what we had just witnessed, and still today, gives us both a chill. i am an educated it professional, and my sister is an speech language professional. we went inside to get our spouses, and we sat on the balcony with the video camera turned on for another hour but didn't see anything further. we had let this slip our mind until we heard of other sightings that folks were having there and thought we should add our story."],"Country":"United States","Tags":"City","Object Features":"Unknown","Date of the Event":"06/27/2007 11:30 UTC","City":"North Myrtle Beach","Disposition":"Unknown","Date Submitted":"06/27/2007 11:30 UTC","Object Flight Path":"Hovering then path","Region":"South Carolina"}