{"map":"<A HREF = \"http://maps.google.com/maps?q=39.252399,+-114.88216(7904)&iwloc=A&hl=en\"> mufon case (7904) map </A>","Source":"MUFON","Country":"United States","Case Number":"7904","Viewing Distance":"Unknown","City":"Ely","Latitude":"39.252399","Region":"Nevada","files":["/var/www/straped/mufon/html2text/7904.html.txt","/var/www/straped/mufon/more/7904_submitter_file1__4-13-064-10-31-a.jpg","/var/www/straped/mufon/more/7904_submitter_file2__4-13-064-10-31-b.jpg","/var/www/straped/mufon/more/7904_submitter_file3__4-13-064-10-31-c.jpg","/var/www/straped/mufon/org/7904.html"],"Date Submitted":"04/13/2006 04:10 UTC","Disposition":"Unknown","divs":["Sighting DetailsOn April 13, 2006, I was walking around Ely, Nevada, filming with a sony camcorder, some old houses from gold-rush (and copper and silver)days. It was 4:10:31 in the afternoon. Now, September, 2007, I just recently had my computer repaired and so had begun to go through my tapes, looking at them for the first time. I thought that I saw something move above one of the houses so I saved it to pictures and titled it \"look for ufo\". When I enlarged it, I clearly saw one of the discs, so I went back to that tape and downloaded frame-by-frame six photos in sequence. They are all from the same second in time. The camera temporarily malfunctioned after the last photo but then abruptly started filming again at another location. Several years prior, in 1993, while my Husband, Dog and I were exploring the Lucky Boy Pass area near Hawthorne, Nevada, we saw an object that looked \"just like\" one of these. We were trying to find an elusive whirring sound, when SUDDENLY directly above us was a stainless steel looking object. It didn't seem to come, it was just THERE. Looking straight up at it, approximately 30 feet, There didn't appear to be any nuts, bolts, seams or any marks whatsoever. I could clearly see the small trees that surrounded us reflected on the shiny bottom side. Next we knew, it was gone. It didn't seem to leave, but it was gone. I asked my Husband, \"WHAT WAS THAT??!!\" and he replied,like a zombie, in a monotone \"it's just an airplane\". Our beautiful female German Shepherd would go hide afterwards, whenever we pointed up at the sky. The disc appeared to be about 3 feet across."],"Tags":"City","Longitude":"-114.88216","Object Features":"Undisclosed","Weather Factors":"Unknown","Log Number":"US-09132007-0001","trends":["There have been 9 other sightings in Ely","There were no other sightings in Ely on or around April 13th 2006","This sighting has never been favorited.",""],"Object Flight Path":"Undisclosed","Summary":"two fast moving silver fliers over downtown Ely, Nv","Date of the Event":"04/13/2006 04:10 UTC","Sighting Duration":"Undisclosed","Object Shape":"Disc"}