{"Date Submitted":"09/12/2007 07:25 UTC","Tags":"City","Disposition":"Insufficient Data","Object Flight Path":"Path with directional change","Source":"MUFON","Summary":"Was Driving home on Arroyo Parkway, turning R on Fillmore I looked up and saw the craft","trends":["There have been 26 other sightings in Pasadena","There were no other sightings in Pasadena on or around September 12th 2007"],"Longitude":"-118.140506","City":"Pasadena","Object Shape":"Circle","Country":"United States","Log Number":"US-09132007-0002","Case Number":"7905","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/7905.html.txt","/var/www/straped/mufon/org/7905.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.151785,+-118.140506(7905)&iwloc=A&hl=en\"> mufon case (7905) map </A>","Latitude":"34.151785","Viewing Distance":"Over One Mile","Object Features":"Dome","Region":"California","Date of the Event":"09/12/2007 07:25 UTC","Sighting Duration":"00:01:30","divs":["Sighting DetailsI was driving home from work in Los Angeles (West)and leaving the 110 to drive home to East Pasadena. Driving along Arroyo Parkway I made a right turn on Fillmore Ave, close to California Avenue that I normally take to go home to Del Mar Avenue. As I waited for traffic to allow me to prceed leaving Fillmore Ave onto Marengo Ave, I suddenly felt like \"looking up\" and could hardly contain myself what was to come next. There it was. Right away I realized as I noticed it's spinning action, that it CANNOT have been anything else but a circular UFO. It was a silver circular craft having many lights around the largest diameter point and had a small little dome point in it's roof center - different from a bell shaped craft. The distance between myself and the craft was approximately the same as a helicopter flies doing police type surveillance as it spot lights down. The craft was at least 1 football field large, if not 2 fields. It was it's size that I was impressed with.It was spinning itself as it flew off in normal aircraft type of speed, it was as if it and it's crew WANTED to be seen since they didn't just \"WHIZZ OFF\". They were in almost direct distance overhead to Cal Tech, as if they had stopped by there for geological data collection. My cellphone has no camera and traffic was far too busy still to step outside of my car and point up. I would gladly had done so if traffic flow would have allowed for that. I am truly sorry that I could not do so."]}