{"Weather Factors":"None","Country":"Canada","Longitude":"-66.641725","map":"<A HREF = \"http://maps.google.com/maps?q=45.96464,+-66.641725(7909)&iwloc=A&hl=en\"> mufon case (7909) map </A>","Region":"New Brunswick","Case Number":"7909","files":["/var/www/straped/mufon/html2text/7909.html.txt","/var/www/straped/mufon/org/7909.html"],"Source":"MUFON","Date of the Event":"08/16/2007 11:00 UTC","Log Number":"CA-09142007-0002","Latitude":"45.96464","Viewing Distance":"Over 1 Mile, Unknown","Object Features":"None","Tags":"City","City":"Fredericton","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Object Shape":"Star-like","trends":["There have been 8 other sightings in Fredericton","There were no other sightings in Fredericton on or around August 16th 2007"],"divs":["sighting detailson the evening of august 16th, 2007, while staying at our camp in priceville, new brunswick, canada, myself and three (3) other individuals witnessed a very unusual sight in the north-west star-filled sky. our camp has no electricity, the closest home with electricity is approximately 1\\4 -1\\2 mile away. we at first thought the object was a very bright star, until the object began to move, in both vertical and horizontal movements. our next thought was that the object may be part of the spacestation, or the orbit of the flight visiting the station at that time. the area of the sighting is in the direct flight route of all aircraft using canadian air-space enroute to europe and other locations. we have seen many such aircraft and satellites over the years we have visited our camp (over 40 years), and we recognize the difference between a star, satellite, or airplane. this, most definately, was something different. when approaching aircraft came into sight, the object would dim and disappear, only to reappear, following the disappearance of the aircraft. it continued to \"bob\" up and down, and with short quick movements to the left and right. otherwise, it stayed in relatively the same spot. we were fascinated with the object, and marveled at its movements. we were not afraid or aprehensive. we have seen many signts in the skies above and around our camp. we continued to observe for about 15 minutes, then went into our camp for the night. we did not lose signt of the object. there was nothing more to do so we went into our camp.we watched for the object each night thereafter and did not witness it again until the night of september 5th, 2007, located in the same space, but seen approximately around 10:00 p.m. would there possibly be some answer to this viewing other than a ufo? i would like to hear from anyone who can respond to such a request. my husband, who was also a witness to this, and i will be returning to our camp in new brunswick next week again (we reside in lewiston, maine, usa on a permanent basis). thank you, marina f. fossett"],"Date Submitted":"08/16/2007 11:00 UTC","Summary":"Bright moving object in the North-West sky","Object Flight Path":"Path with directional change"}