{"Country":"United States","Object Flight Path":"Stationary","Weather Factors":"Unknown","Source":"MUFON","Disposition":"Unknown","Log Number":"US-09142007-0003","Tags":"City","divs":["Sighting DetailsI was driving to go out to eat on September 12, 2007. I was headed West on Illinois 13 when I noticed an object in the sky. It was still daylight but the object was shining very brightly, almost like a really bright star. I thought at first it must be a plane headed straight towards my direction and I was seeing it's headlight. Then I thought maybe the sun was reflecting off of a plane and thats why it was so bright. But then to the North were two jets and even though they were silver they did not reflect like this object did. I kept watching and drove about 3 miles directly towards the object. It did not move, it didn't get closer farther away, it just stayed in the same spot. I noticed the two jets had already traveled a great distance from where I had first seen them and thought it strange that this object was still in the same place as when I first noticed it. Suddenly the object became even brighter and the only way I can describe it is it was \"glowing\" Then it became dimmer and dimmer till it vanished from sight. It still hadn't moved at all. It just got dimmer till I couldn't see it anymore. I then noticed that another one appeared right when the first one vanished (same one maybe??) it was much farther away and lower in the sky. I don't know what happened with that one because by this time I had came to my turn and lost sight of it. The first one seemed to be about the size of a nickel from arms length. The second one was smaller when it appeared but was just as bright. Both objects appeared to be perfect circles."],"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.76005,+-89.077299(7910)&iwloc=A&hl=en\"> mufon case (7910) map </A>","Region":"Illinois","Date of the Event":"09/12/2007 07:20 UTC","Date Submitted":"09/12/2007 07:20 UTC","City":"Carterville","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/7910.html.txt","/var/www/straped/mufon/org/7910.html"],"Viewing Distance":"Unknown","Summary":"Very bright white object in western sky","Object Shape":"Circle","Longitude":"-89.077299","trends":["There has been one other sighting in Carterville","There were no other sightings in Carterville on or around September 12th 2007"],"Latitude":"37.76005","Case Number":"7910"}