{"Tags":"City","Country":"United States","Object Shape":"Triangle","Object Features":"Undisclosed","Log Number":"US-09152007-0001","Date Submitted":"08/12/2007 10:15 UTC","divs":["Sighting DetailsTwo friends and I were camping along the coast just south of shelter cove. we stayed at the sinkyou state park, a place called bear harbor. Around 10pm one of my friends went to sleep and my buddy jeff and I started lookin at the stars. Theres almost no out side light up there along the lost coast. I remeber checking my watch around 10:00 -10:15 or so and not long after that we saw a satelite go over. we were scanning the sky for shooting stars when we noticed a wierd strobe light type of flash, it was way off the coast headed right for our campsite. As it got to the coast it turned right along the coast and I was able to see the three tringle lights along the bottom. It did seem to move much quicker through the sky then a plane flying that far away. earlier in the day a plane and a jet flew over a good ways away and the sound was so out of place in that natural enviroment. The craft that flew over that night was totally silent. As it continued down the coast it apeared another one joined it in formation and they headed down the coast. it was only about 1 min to 1.5 minutes long and she was way down the coast, no sound whats so ever....totally silent. The only thing that grabbed my attention was the strobe. I've lived around a couple major airforce bases for many years and have never seen a military running light like that. there was no red or white solid lights, just three yellowish triangles and the wierd strobe lights in a sorta w with wings patern. it happened so fast, I kept saying jeff whats that, what the h#ll is that. I tryed to wake my friend steve but he did not respond. A very interesting night...."],"Longitude":"-124.06958","map":"<A HREF = \"http://maps.google.com/maps?q=40.023243,+-124.06958(7914)&iwloc=A&hl=en\"> mufon case (7914) map </A>","City":"Shelter Cove","trends":["There have been 3 other sightings in Shelter Cove","There were no other sightings in Shelter Cove on or around August 12th 2007"],"Summary":"tringle shape three lights and wierd strobe light ,","Source":"MUFON","Sighting Duration":"Undisclosed","Viewing Distance":"20 Feet or Less","Weather Factors":"None","Latitude":"40.023243","Case Number":"7914","Object Flight Path":"Path with directional change","Region":"California","files":["/var/www/straped/mufon/html2text/7914.html.txt","/var/www/straped/mufon/org/7914.html"],"Date of the Event":"08/12/2007 10:15 UTC","Disposition":"Unknown"}