{"Object Features":"Undisclosed","Case Number":"7924","Tags":"City","Latitude":"38.401578","map":"<A HREF = \"http://maps.google.com/maps?q=38.401578,+-122.36081(7924)&iwloc=A&hl=en\"> mufon case (7924) map </A>","Date Submitted":"09/14/2007 11:21 UTC","Region":"California","Sighting Duration":"00:01:17","Summary":"2 flickering lights that move right to left/then stop/then vanish","Weather Factors":"Unknown","Source":"MUFON","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Disposition":"Insufficient Data","Longitude":"-122.36081","Object Shape":"Star-like","Log Number":"US-09162007-0002","files":["/var/www/straped/mufon/html2text/7924.html.txt","/var/www/straped/mufon/org/7924.html"],"Date of the Event":"09/14/2007 11:21 UTC","trends":["There has been one other sighting in Yountville","There were no other sightings in Yountville on or around September 14th 2007"],"divs":["sighting detailsi walk my dogs every night and look for, what i think, are falling stars...which i see and recognize\\ i.e. faint light, speed, angle etc\\ ....what i saw two nights ago was not falling stars, airplanes, or meteors. it was two starlike lights...moving simultaniously. it was south east to west. i would not have thought ufo, but adding up the specifics left it an obvious possibility. specifics are: the fast flickering speed, the traveling speed, the time and duration of this event and then the abrupt disappearance. what do you think? by the way aug. 11 2007 i also saw something....i thought it was a comet, but now am not sure. i was not like any of the comet photos on the hubblesite or in other similar gallerys. this huge ball in the sky came down towards this area with a fat short blue firey tail....i say short because the comet pictures i've seen have really long tails. i thought it hit the earth..seemingly close to me...driving distance even....about 45 minutes. ....i thought my life had changed, having witnessed this event. i expected news of a fire and that night looked for signs of a fire...but nothing... so, what was that? the tail was really bright blue...? is that recognizable ? in a hurry. .. sorry about spelling and grammatically errors. thank you."],"Country":"United States","City":"Yountville"}