{"Summary":"Extremely slow & low-flying object over Salem, OR.","Viewing Distance":"21-100 Feet","Source":"MUFON","Latitude":"44.947698","files":["/var/www/straped/mufon/html2text/7927.html.txt","/var/www/straped/mufon/org/7927.html"],"Date of the Event":"01/01/2007 07:15 UTC","Object Features":"Unknown","divs":["Sighting DetailsI'll begin by stating that the time being in the evening, the sun was down and the moonlight was negligible. I had a minor amount of white noise inside of my house at the time of the sighting, other light sources being an incandescent light behind me and the monitor on my desk. At the time of the sighting, I was working at my computer, situated in the corner of a room with a very large window to my right side, giving me full view of the sky. There are trees around my house, some fairly tall in the 50-75 foot range; this being in January, there were no leaves on any of the trees and the branches were small enough to not obscure my vision. Out of the corner of my right eye, I saw some lights heading directly toward my house, flying somewhere in the range of 30-50 feet off of the ground. The lights being so low was the first thing to catch my attention, and immediately after that the realization that I did not, hear any sound being emitted from this object, regardless of its extremely low altitude. There is a decent amount of air traffic around this area, usually National Guard helicopters and some small to mid-sized airplanes, all of which I can clearly hear from 800+ meters away. The object maintained a constant speed of approximately 25-30 miles per hour and did not change course for as long as I watched. The lack of light worked against me as I was unable to make out any outline on the object; there were four circular lights that I saw; two spaced in the front and two more off to a 45-degree angle behind the first two. The object did not rotate at all, moving much like a fixed-wing craft. I consider myself a fairly smart person, but this absolutely boggled my mind; the rate of speed, the lack of noise and the low altitude all kind of hit me at once. I was, for a lack of a better term, stunned; in my right mind, I would have either told my father, who was in the other room, to look out the window or ran out my front door to see where it went next. Regrettably, though, I sat in a state that I can only describe as stunned, processing what I had just seen."],"Object Shape":"Unknown","Object Flight Path":"Straight-line path","Disposition":"Insufficient Data","Log Number":"US-09162007-0005","Sighting Duration":"00:00:10","Longitude":"-123.030786","Region":"Oregon","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=44.947698,+-123.030786(7927)&iwloc=A&hl=en\"> mufon case (7927) map </A>","City":"Salem","Weather Factors":"Unknown","trends":["There have been 40 other sightings in Salem","There were no other sightings in Salem on or around January 1st 2007"],"Country":"United States","Case Number":"7927","Date Submitted":"01/01/2007 07:15 UTC"}