{"Region":"Colorado","Log Number":"US-09172007-0002","Object Features":"Other","Sighting Duration":"Undisclosed","Tags":"City","Disposition":"IFO","Longitude":"-104.976753","files":["/var/www/straped/mufon/html2text/7930.html.txt","/var/www/straped/mufon/org/7930.html"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.740824,+-104.976753(7930)&iwloc=A&hl=en\"> mufon case (7930) map </A>","Object Shape":"Sphere","Date of the Event":"09/15/2007 04:30 UTC","Summary":"2 volkswagen-sized colored spheres flying around and inside contrail altitude about 3500 feet","City":"Denver","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"09/15/2007 04:30 UTC","Case Number":"7930","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around September 15th 2007"],"Object Flight Path":"Hovering then path,Path with directional change","divs":["Sighting DetailsMy husband and I were out in our backyard placing flagstones for a patio. I felt a few drops of rain and looked up to find the cloud it came from. There were no clouds and sky was completely clear except for a large white contrail directly over head. I thought it was curious we were getting rain without an obvious source, (it was also completely windless, so no odd sprinkles from a nearby water sprinkler seemed likely.) The contrail was interesting,though, so I went inside to get our big field glasses to take a better look. When I focused the binocs I found the contrail immediately and was surprised at how different it looked from naked-eye viewing--very iridescent and pinkish. It was startling so I put down the glasses to check if I was looking at the same contrail. I was, of course, and when I put the glasses back up to my eyes, I saw a (non luminous) bright red sphere floating just above the edge of the contrail. Compared to the contrail, it must have been about volkswagen sized. I REALLY was not expecting that, and quickly put the glasses down to check the sky for a balloon, since that was the thing it most closely resembled, although I've never seen such a perfectly round ballooon before. However, I couldn't see anything like that near the contrail. I put the glasses back up and saw that the red sphere had been joined by a yellow sphere. When I looked closely I saw they had dark areas at the bottom of each sphere where some appendages or pipes or something were silhouetted, too dark to make out clearly. The two spheres flew in and out of the contrail vapors for a moment as I tried to steady the glasses and called out for my husband to come look. By the time my husband came over the contrail and everything else was gone. I searched the sky with the field glasses and naked eye, but there was no more spheres or vapor. I looked and looked for a red and yellow balloon afterwards, hoping that prove the sighting was nothing anomalous. I certainly wanted it to be just something ordinary like a balloon. But there was nothing. The sighting lasted only a few seconds, unfortunately. I don't think I've ever seen a contrail disappear that quickly before. And I wonder if it had anything to do with the \"raindrops\" I felt and saw land on the flagstones just before the sighting. It was unnerving. I was in Civil Air Patrol as a teenager, and those spheres didn't look like any standard aircraft type I know. It was pretty disturbing--"],"Country":"United States","Source":"MUFON","Latitude":"39.740824"}