{"Sighting Duration":"Undisclosed","Weather Factors":"None","Object Features":"Unknown","Longitude":"-72.449529","Latitude":"41.866764","files":["/var/www/straped/mufon/html2text/7931.html.txt","/var/www/straped/mufon/org/7931.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.866764,+-72.449529(7931)&iwloc=A&hl=en\"> mufon case (7931) map </A>","Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Country":"United States","divs":["Sighting DetailsI have noticed a couple of \"stars\" that I had never seen in the night sky before for the past couple of months. Two nights ago I went out to this lake with my friend and we we're sitting watching these two \"stars\" moving back and forth, zigging and zagging every which way, when all of a sudden another bright light that I had never seen before made its way up and left in the most irregular flight path I had ever seen. As it seemed to be getting closer, I turned to my friend and said \"if at any time you want to leave, we can leave.\" As it moved closer towards us the lights just blinked out and for only a second the craft was lost. We picked it pack up because it had 3 flashing red lights on the front and a cluster in the back. It moved effortlessly and without sound across the night sky and out of view behind the trees. The minute we lost sight of the craft, I freaked out and rushed the both of us to the car and left. This silent craft was the first time I had seen anything like it and that night was the first night I had ever seen it. The two other stars have been in a general location for a couple months now. If you are interested in the things I have seen, please feel free to contact me via e-mail."],"Date of the Event":"09/15/2007 09:00 UTC","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","trends":["There have been no other sightings in Vernon","This sighting has never been favorited."],"Region":"Connecticut","Tags":"City","Disposition":"IFO","Log Number":"US-09172007-0003","Summary":"I left where I was because I freaked out.","City":"Vernon","Object Shape":"Sphere, Star-like","Date Submitted":"09/15/2007 09:00 UTC","Case Number":"7931"}