{"Case Number":"7932","Weather Factors":"Unknown","Date of the Event":"03/20/2005 12:00 UTC","Object Shape":"Flash, Star-like","Date Submitted":"03/20/2005 12:00 UTC","Object Features":"None","City":"Melbourne","Country":"Australia","Disposition":"Unresolved","divs":["Sighting DetailsThis sighting happened in Melbourne, Australia... There are a few funny things about this experience that I marvel about. It was not so much visually stunning as it was amazing and 'cute'. It was getting late in the night sometime before midnight, around 10pm and my sister's birthday party had just wound down and the last few people had left. I was sitting in the living room thinking about closing the balcony door. I got up and leaned over to release the door stopper when out the corner of my eye I saw a streak of light fly through the night sky. It was quite a distance away and I thought it was a shooting star. Quickly I turned my head to make sure I didn't miss it as I love seeing heavenly bodies fly through the sky, when suddenly this light had come to an instantaneous halt! Then before I could get my wits about me this light started moving backward and forwards at an amazing speed. Judging by the distance (the light seemed to be out of earth's atmosphere) this light would of probably been covering a phenomonal area in no time as it danced back and forth. I stood there not knowing what to make of it. It's brightness was more intense than any other visible star in the sky and it was back dropped by the moon. I live in the city and the stars are not very bright where I am so this light stood out. It was only about 5 seconds or so of this light dancing backwards and forwards almost as if it was waving, then suddenly it zooms off at ligthning speed and vanished right before my eyes. I stood there for a while in denial of what just happened, not able to make sense of it. My mind was trying to be logical but my memory and emotions were telling a very different story. It occurred to me in the following days that this had happened on the night of my sister's 16th birthday. To me I will never forget that date further more. I thought that it was uncanny that I happened to see it just as I stepped out onto the balcony. What was the chances of that? If this craft did not want to be seen by me then why did it dance before zooming off? Why did it wait for me to go out on the balcony? Was the date significant? Or just a way for me to remember when it happened? I don't know the answers to this but it does feel good to think that there was no accident that this event took place."],"Log Number":"AU-09182007-0001","Region":"Victoria","Longitude":"144.9659","map":"<A HREF = \"http://maps.google.com/maps?q=-37.804617,+144.9659(7932)&iwloc=A&hl=en\"> mufon case (7932) map </A>","files":["/var/www/straped/mufon/html2text/7932.html.txt","/var/www/straped/mufon/org/7932.html"],"Object Flight Path":"Path with directional change","trends":["There have been 40 other sightings in Melbourne","There were no other sightings in Melbourne on or around March 20th 2005"],"Tags":"City","Latitude":"-37.804617","Viewing Distance":"Over 1 Mile, Unknown","Summary":"Dancing light in night sky then suddenly vanish...","Source":"MUFON","Sighting Duration":"00:00:10"}