{"map":"<A HREF = \"http://maps.google.com/maps?q=34.214145,+-118.601805(7937)&iwloc=A&hl=en\"> mufon case (7937) map </A>","Log Number":"US-09182007-0006","Tags":"City","Viewing Distance":"Unknown","City":"Los Angeles","Country":"United States","Summary":"3 Starlike objects seen in Canoga Park","Object Shape":"Circle, Sphere, Star-like","Sighting Duration":"Undisclosed","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around September 15th 2007"],"Date of the Event":"09/15/2007 03:30 UTC","Source":"MUFON","Object Flight Path":"Stationary,Straight-line path","Longitude":"-118.601805","Object Features":"Undisclosed","Latitude":"34.214145","Disposition":"Unknown","Case Number":"7937","Date Submitted":"09/15/2007 03:30 UTC","divs":["Sighting DetailsMe and my husband first saw a star-like object appear high in the sky as we floated on an air mattress in our pool two weeks prior to my sighting on Saturday Sept. 15th. This first object seen by my husband and I appeared to remain stationary for about 15mins before moving to the right and disappearing. Then it re-appeared in the same spot we saw it initially, with then three more star-like objects appearing to the right. We watch for about an hour and then they disappeared. On Sept. 15th, I went out to the pool again around 3-3:30. Knowing that we had seen something weeks before, I just laid back to watch the sky and again a star-like object appeared. It again moved to the right and was met by another one, which appeared to come extremely close to the other. They were very close for a couple of minutes, and then seemed to spaced out a bit and remained this distance from one another as they both moved to the right and disappeared. The object re-appeared in the initial place where I first saw it, and moved to the right once again, and stayed there. Then out of no where, another star-like object shooted right passed it and out of sight, as another one appeared close to it. In total, I saw 3- and I watched this for about an hour and a half until they disappeared. I also called my mom and told her what I was seeing as I laid in the pool. I thought it was strange and interesting and now I'm in my pool everyday trying to see more."],"Weather Factors":"None","files":["/var/www/straped/mufon/html2text/7937.html.txt","/var/www/straped/mufon/org/7937.html"],"Region":"California"}