{"Log Number":"US-09192007-0001","Source":"MUFON","Weather Factors":"Unknown","Country":"United States","Summary":"Appeared to be the north star but had a bright reflection on the beach. When it began to move i was interested in the flight pattern.","Date Submitted":"09/15/2007 05:00 UTC","divs":["Sighting DetailsWE had just gotten home from a trip to gainesville. When we arrived at the condo it was about 4:45 am. Around 5:00 i went for a ciggarette with two friends on the porch. I noticed how clear the sky was for the storm we were supposed to be expecting. I also noticed how bright the north star appeared to be and questioned its placement, then thought maybe it was a planet. Iasked my friends what they thought and then i noticed it had a huge bright reflection in the water similair to the way the moon would, but the moon was not out at the moment. About as soon as we began to question the star we saw it move, just a little at first but in an akward way. It began to dance in exactly the ways i had seen before on tv of recordings others had made. It was a brighyt white light that gave the illusiion at first it was a star but then when it moved closer to us it was very apperent it wasnt. It moved so fast and appeared as though in just one second it could have been where we were. Igrabbed a light toy and began to make a circular shape with my arm. When i would do this it would always move and then a strange lighting would strike, but only when i used the light. At times it appeared there were others but much farther away. It also looked as though it was sucking stars right out of the sky but we could not be for sure. For certain moments when i would stare to hard in awe it felt as though i had been temporarily hjypnotized in an intriguing but somewhat parylizing light. This game of light tag went on for about two hours and as the sun began to rise a strangely shaped set of very low and close to shore clouds rolled in out of nowhere. They almost appeared as a giant mass of land coming to shore. This part was actually a bit frighting. The water was completely still, and the air grew very still as well and humid and hot. As the sun began to show we watched it continually move out ward away from us but still darting around until it looked like a star. During the daylight it was still very visible and still moving enough to the point where other early risers on th beach saw it when i asked them. Beforew it faded out of sight we saw one more much closer and more definable come into our vision and out very quickly and quietly across the sky. It appeared tyo be a metalic texture and oval sheped. We watched for another hour and didnt see anything else. Thank you for hearing my story...Please write or contact and help me understand this. My other friend eric fisher has also contacted you with this story as he was the one with me. Thank you."],"map":"<A HREF = \"http://maps.google.com/maps?q=29.76886,+-81.253679(7938)&iwloc=A&hl=en\"> mufon case (7938) map </A>","Object Features":"Appendage(s)","Region":"Florida","Date of the Event":"09/15/2007 05:00 UTC","City":"Crescent Beach","Case Number":"7938","Disposition":"IFO","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Tags":"City","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","trends":["There have been no other sightings in Crescent Beach","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Object Shape":"Egg, Sphere, Star-like, Teardrop","Longitude":"-81.253679","files":["/var/www/straped/mufon/html2text/7938.html.txt","/var/www/straped/mufon/org/7938.html"],"Latitude":"29.76886"}