{"Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"09/18/2007 10:45 UTC","Weather Factors":"None","City":"Bridgeport","Sighting Duration":"01:00:00","Tags":"City","Object Features":"Unknown","Object Flight Path":"Stationary","Date of the Event":"09/18/2007 10:45 UTC","Latitude":"41.190118","Source":"MUFON","divs":["Sighting DetailsI was watching \"The Office\" at 10:45 and decided to go out for a smoke on the deck during the commercial. After sitting down I noticed through the trees what looked like a very large star, much larger than the North star, shimmering in the sky. The color was predominatly white, but there were distinct flashes of red and a turquise green every few seconds. Since i do live close to both an aircraft plant and private airport I assumed it was a helicopter in the distance, that was traveling towards or away from me at an angle that made it appear to be still. I kept my eye on it and upon finishing the cigarette a few minutes later, it was the same size, distance, and there was still no noise that would make me think it was an approaching copter. I called out my Mother to ask her opinion, and she agreed it didn't resemble aircraft or a star. We then summoned my sister, who also confirmed it was odd. My Mother suggested we try another point of view, so we headed to the driveway, where we had a much clearer shot. We stood there for a few moments and my Mom suggested we turn around and look at a star for a few seconds then turn around to compare it. Upon turning around, it was clear this didn't resemble a star in the slightest. Then a plane went by passing it closely, as the plane passed, our 'object' dimmed almost dissappearing. Then upon the plane gettting further away, it brightened to it's original state. Then only watching it for a short time we saw at least 4 planes come withing close distance, but it only dimmed a couple of those times. One advantage of the planes going by was that it made it clear this was not a recognizable aircraft. We did notice minor movements, slowly up a bit, or to the left. About a half hour later, everyone else elected to go inside, but I stayed for a while. I sat back down in the original chair I had spotted it in to light another cigarette and it was no longer visible from that spot, so it must have moved more significantly than we had suspected. After a while I did decide to opt for bed as well, but did check to see if it was still there, over 75 minutes after the original sighting, and it seemed to be the same strength light and position. This morning, it was as clear a morning as it was last night, and there was nothing there that would explain it. I will have my eyes peeled this evening to see if I can find a logical explaination or chalk it up to \"unknown\"."],"Disposition":"IFO","Summary":"Large Flashing Star","Region":"Connecticut","map":"<A HREF = \"http://maps.google.com/maps?q=41.190118,+-73.192467(7940)&iwloc=A&hl=en\"> mufon case (7940) map </A>","Object Shape":"Star-like","trends":["There have been 11 other sightings in Bridgeport","There were no other sightings in Bridgeport on or around September 18th 2007"],"Case Number":"7940","Country":"United States","files":["/var/www/straped/mufon/html2text/7940.html.txt","/var/www/straped/mufon/org/7940.html"],"Longitude":"-73.192467","Log Number":"US-09192007-0003"}