{"Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/7943.html.txt","/var/www/straped/mufon/org/7943.html"],"trends":["There have been no other sightings in Khania","This sighting has never been favorited."],"Log Number":"GR-09192007-0006","Region":"Kriti","Weather Factors":"Unknown","Latitude":"35.516236","Summary":"Walking late after fist with friend (7) flash from above upon the 2. Witnessed by me and 4 others.","Date Submitted":"08/15/1985 04:00 UTC","City":"Khania","map":"<A HREF = \"http://maps.google.com/maps?q=35.516236,+24.018807(7943)&iwloc=A&hl=en\"> mufon case (7943) map </A>","Date of the Event":"08/15/1985 04:00 UTC","Disposition":"Unresolved","Country":"Greece","Longitude":"24.018807","Source":"MUFON","Case Number":"7943","Viewing Distance":"Unknown","Object Shape":"Flash","Object Flight Path":"Undisclosed","Tags":"City","divs":["Sighting DetailsAfter some report of UFO sightings by military aircrafts in Greece in that week's newspaper none in Crete paid attention. Me and my friend were drinking at a tavern. We were seven(7) at the age of 25 more or less. We decided to walk home. Two ahaid, three in the middle(including me) and two at the back we were walking home. At some point the two ahaid were upon a small bridge and me and the two others a couple hundred meters behind at the top of a hill with the two in front in sight and the two behind very far back. While the two in front were crossing the bridge a flash of light like led white light came from nowhere and pointed at them for some seconds and then it vanished. Me and the two others run to the bridge to look up our friends when they popped up from some bushes shouting and very very frightened. They told us that they were very scared with the light and hided preparing to defend for their lives with the unknown. The story is true and more or less as it happened. I am sorry that i cannot give a name but i am very sceptical about reporting this. It has been too long since this happened to remember details."],"Sighting Duration":"Undisclosed"}