{"Weather Factors":"Unknown","Summary":"I didn't realize I seen anything until I looked at the photos I took on my Minolta.","Log Number":"US-09192007-0007","Viewing Distance":"Unknown","Latitude":"48.27659","Object Features":"Undisclosed","Case Number":"7944","Date of the Event":"09/18/2007 05:30 UTC","Tags":"City","Object Flight Path":"Undisclosed","Source":"MUFON","Object Shape":"Cigar","City":"Sandpoint","Longitude":"-116.553248","divs":["sighting detailsaround 5:30 pm, i was at the samuels service center which is a gas station\\resteraunt. i parked to the right of it (facing west) because i saw some interesting cloud formations i wanted to take photos of. i was alone and started to snap photos on my minolta digital dimage. it was set on continous shooting, (approx) 1\\10 second, on the largest file size - 2274 x 1704. i wasn't aware of anything unusual until i got home around 7pm and started loaded the photos onto my hp printer. i use a sandisk 1.0 gb card to store photos and then transfer to my laptop. when i looked at photos, series 97-100, on 98 i noticed an object on the very right hand side. after having my husband look it over today, he advised me to write and ask if you'd like me to forward the photos. i do have before and after shots, however, the one exactly before the possible ufo, i had the camera a bit more to the left. then on frame 98, i moved to the right and caught the image. on frame 99, the object is gone. since i use the highest image size, the camera shoots the image at approx. 1 image per 1\\10 sec (properly a bit more). please advise if you'd like me to send the image as large as it's original size. i did make copies and resize the image so they would transfer quite a bit faster. they are quite large, as i wrote prior. also, please note, i resaved the copy as a jpeg while i originally opened them in paint shop pro. finally, i do have more photos of the area taken at the same time from different angles and also the exact same angels but at different times. sincerely"],"Disposition":"IFO","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/7944.html.txt","/var/www/straped/mufon/more/7944_submitter_file1__PICT0097a.jpg","/var/www/straped/mufon/more/7944_submitter_file2__PICT0098a.jpg","/var/www/straped/mufon/more/7944_submitter_file3__PICT0099a.jpg","/var/www/straped/mufon/org/7944.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=48.27659,+-116.553248(7944)&iwloc=A&hl=en\"> mufon case (7944) map </A>","Date Submitted":"09/18/2007 05:30 UTC","Region":"Idaho","trends":["There have been 5 other sightings in Sandpoint","There was one other sighting in Sandpoint on or around September 18th 2007","This sighting has never been favorited.",""],"Country":"United States"}