{"Object Shape":"Circle","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/7947.html.txt","/var/www/straped/mufon/org/7947.html"],"Sighting Duration":"00:10:00","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=34.275367,+-118.777302(7947)&iwloc=A&hl=en\"> mufon case (7947) map </A>","Date of the Event":"03/10/1979 07:10 UTC","Summary":"A massive circular craft comprised of several rings that had many colored lights of several colors with a huge light or beam in the center","Viewing Distance":"101-500 Feet","divs":["Sighting Details While taking a walk thru a vacant field with my friend (and neighbor), we heard a loud propulsion type sound from above. When we looked up to see what is was, we noticed a huge craft in the sky. It was massive, probably the size of a football field, and was comprised of rings that broke it up into several sections. Each ring featured different colored lights than the other ones. It also had one huge light in its center, that we thought might be some sort of tractor beam. We were young boys, approximately 7-9 years of age, but we knew it was a UFO immediately. It was moving very slowly, and heading west toward the city of Moorpark, CA. We were nearly breathless, and stood still because we thought we might get beamed up by that huge light in the center (of the craft). Once it passed over us, we relaxed a little, and then got exited about telling our parents what we had just witnessed. We could see it for about 10 minutes until it got too far away. The craft never changed speed or direction and continued heading west. Then, we went home to tell our parents. My dad said that we were full of it, but the next day the sighting was featured in an article in the Enterprise, the local Simi Valley newspaper. We showed him the newspaper, but he still insisted that we, and the other eye-witnesses, were all crazy. According to the article, most of the other witnesses saw it in Moorpark about 15 minutes after we did. This made perfect sense, as it was headed in that direction very slowly. Not too long ago, I noticed a sighting posted on MUFON, that seemed earily similar to ours. Not only was the description of the craft almost identical, but the location was as well (Simi Valley). And, as if that wasn't enough, there were even more bizarre similarities! The man was also about the same age as us at the time of his sighting as well (perhaps a year or two older). His description of the UFO gave me goose bumps too. He described it as a huge craft with many different colored lights, with colors reminding him of a Christmas tree. This is what really made me want report this encounter. When I have the chance, I am going to the Simi library to see if that article from the newspaper is in their archives. This way I can find out the exact date and a more exact time."],"trends":["There have been 20 other sightings in Simi Valley","There were no other sightings in Simi Valley on or around March 10th 1979"],"Object Flight Path":"Straight-line path","Log Number":"US-09202007-0002","Latitude":"34.275367","City":"Simi Valley","Tags":"City","Longitude":"-118.777302","Case Number":"7947","Weather Factors":"Unknown","Country":"United States","Date Submitted":"03/10/1979 07:10 UTC","Object Features":"Patterned Surface","Source":"MUFON"}