{"trends":["There have been no other sightings in Hajipur","This sighting has never been favorited."],"Tags":"City","Summary":"IT LOOKED LIKE A STAR","divs":["Sighting DetailsIwas standing at the roof top of my house ,I just had sex with my newly wedded wife.I lite a cigarette and was re living the momemts I spended just now.I was exhsling the smoke towerds the sky that wsa the exact momemnt I saw a star like object which was bright enough and was moving towerds north-east,then suddenly for a secound the light became brighter than erlier, then it just switched off just like we switch off the bulbs of our houses.I did not understood what it was and how it did like that.I have seen aircrafts in flight their lights blink.Because my house is not far away from the nearest airport which is the Jai Prakash Narayan airport of PATNA-BIHAR,{ INDIA }.I do watch lots of aircraft so I know It was not an aircraft for sure. I want you to tell me what i saw.I had this sighting on april 13 year 2003. Time slowly pessed by and i was involved in my daily life,then on september 19 year2007 THE HISTORY CHANNEL,was showing a programm on UFO they were showing about the WRIGHT PETTERSON USAF AIR FORCE BASE.That day I thought that I should visit the website of MUFON,because I came to know about the organisation through THE HISTORY CHANNEL. Please contact me at my E-mail address which is as follwos :- ashmri@rediffmail.com or gulluji13@yahoo.co.in THANKING YOU IN ANTICIPATION BRAJESH KUMAR"],"Sighting Duration":"00:02:30","files":["/var/www/straped/mufon/html2text/7951.html.txt","/var/www/straped/mufon/org/7951.html"],"Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","Source":"MUFON","Date of the Event":"04/13/2003 08:23 UTC","Object Shape":"Star-like","Disposition":"Unresolved","Latitude":"25.68","Weather Factors":"None","City":"Hajipur","Country":"India","Log Number":"IN-09202007-0006","map":"<A HREF = \"http://maps.google.com/maps?q=25.68,+85.22(7951)&iwloc=A&hl=en\"> mufon case (7951) map </A>","Case Number":"7951","Date Submitted":"04/13/2003 08:23 UTC","Region":"Bihar","Longitude":"85.22"}