{"Country":"United States","Object Flight Path":"Hovering then path","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=39.224712,+-106.001962(7953)&iwloc=A&hl=en\"> mufon case (7953) map </A>","Source":"MUFON","Log Number":"US-09202007-0008","Date Submitted":"06/30/1998 12:00 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/7953.html.txt","/var/www/straped/mufon/org/7953.html"],"Date of the Event":"06/30/1998 12:00 UTC","Viewing Distance":"Unknown","City":"Fairplay","Object Features":"None","Disposition":"Unknown","trends":["There has been one other sighting in Fairplay","There were no other sightings in Fairplay on or around June 30th 1998"],"Weather Factors":"Unknown","Region":"Colorado","Sighting Duration":"Undisclosed","Longitude":"-106.001962","divs":["sighting detailsi was on some property walking around with my dog. this is about a 1\\2 mile down on hwy 9 from hwy 287. as i was looking towards alma(fairplay is also in that direction)i saw what appeared to be a triangle shaped bright light in the sky. there were no clouds in the sky. the shape appeared to be motionless as i continued to look at it for about 2 minutes. then it shot off in the direction of buena vista and disappeared from my view, not due to moving behind anything, it just vanished from my sight. i didn't have any idea what it might be when i first saw it. the only thing we ever saw in the sky normally were planes(always with chem trails). i mentioned the sighting to my parents, but never to anyone else. i'm not an expert on things that fly in the sky, but i certainly have never seen anything to explain the objects i've seen in the sky there.i grew up in leadville, and then fairplay. i've seen things i can't explain in the skies in park county 5 times over the course of the time i lived there. this time was a bit distinct because i could clearly make out the shape of what i saw. it seemed fairly close and low. i also saw something in the sky in leadville with my dad, but only once."],"Summary":"I was standing outside on my parents property looking towards alma and saw this triangle shaped light hanging in the sky.","Case Number":"7953","Latitude":"39.224712"}