{"Sighting Duration":"Undisclosed","Country":"United States","Disposition":"Unresolved","City":"Sterling","Summary":"I saw a strange white ball of light fade in and out in a different spot each time.","map":"<A HREF = \"http://maps.google.com/maps?q=40.625542,+-103.207709(7959)&iwloc=A&hl=en\"> mufon case (7959) map </A>","Region":"Colorado","Tags":"City","Object Flight Path":"Other","Date of the Event":"08/17/2006 11:40 UTC","Longitude":"-103.207709","Source":"MUFON","files":["/var/www/straped/mufon/html2text/7959.html.txt","/var/www/straped/mufon/org/7959.html"],"divs":["Sighting Details I went outside in my back yard around 11:00pm to sit in my fully reclyning patio chair and do some star gazing with my binoculars as I had started doing in the middle of the month every night around 10or11:00pm. Sometimes I would sit and look at the stars for two or three hours at a time. Whether I saw alot or only a couple UFOs. Even the very first night I decided to go out and look at the stars was the night I saw the most number of UFOs. The UFOs I saw were always very high in the sky, most alot higher than commercial planes fly some were a little closer but I still could not see any detail of the UFO. Some look like they're moving very fast and others alot slower. I would usually see them one at a time as I paned across the sky until I saw what looked like a moving star and I'd follow it all the way across the sky until it was out of sight. Some look like white light and others a yellowish or gold color light but never flashing or blinking. Some nights I would see ten or more of them. One time I saw one following right behind another. Usually they travel just in a streight line but once one was traveling in a streight line until it crossed in front of a bright star then cut at an angle in a different direction. Never any sound and they look soo odd the way they move its like nothing I've seen. On this paticular night in August I saw the strangest ball of light I've ever seen. It was a closer looking white light I happend to pan across when it faded out. So I kept my binocs on that same spot until it appeared again in what looked like a slightly different spot and again slowly faded out so I counted the seconds in between this time, about every five seconds it would reappear in a different spot about the same space from the last, it went up,down, and across at different angles. Each time I counted the seconds in between and it was always five seconds, I saw the light reappear around twenty times then it stopped. I was excited, amazed, and puzzled about it as I am every time I see these things."],"Viewing Distance":"Over One Mile","Case Number":"7959","Object Shape":"Unknown","Date Submitted":"08/17/2006 11:40 UTC","Object Features":"Unknown","Latitude":"40.625542","Weather Factors":"Unknown","trends":["There have been 2 other sightings in Sterling","There were no other sightings in Sterling on or around August 17th 2006"],"Log Number":"US-09212007-0003"}