{"Viewing Distance":"101-500 Feet","Log Number":"US-09212007-0004","Tags":"City","Country":"United States","divs":["Sighting DetailsHi, I have told what I saw to a few people and they said I should contact you. I was walking my dogs with my wife and 1 year old son around 7-8 p.m. on Wednesday September 19th 2007 and noticed a large very bright object in the sky. It seemed to have blue and yellow streams of light flying around it. At first I thought it might be a planet such as Venus so I just mentioned it to my wife and said let's see if it moves. So during our walk with our dogs we kept an eye on it. Then when we reached our house I could see it clear as day right from my front door step. It was far away but it looked unusual enough that I figured I would take a photo of it. As soon as I took the photo is start to move upwards at that is when I knew this was no star but could not figure out what else would glow so intensly and stay in one position for more than 10 minutes not to mention the strange strands of blue and yellow it had moving around it. After it moved upwards it slowing started to move towards us, but then it suddenly sounded like a small plane, we were in a bit of shock so I forgot to take another photo, and when I heard the plane engines I also thought it might just be an aircraft of some sought but still could not understand how it glowed so bright. Anyway, it flew right over our heads and I looked straight up underneath it. It was about the size of a large fighter jet but looked very different from anything I had seen before. It was a trianular shape on on each front side of the triangle were 3 massice lights. It didn't fly fast as it past over our heads. After this all happend I took my IPhone in to my computer to get the photo off it. Unfortunatly it does not have a zoom. But I am a web designer and have software so I put it into Photoshop and then changed the DPI to 300 so I could get a clear view. I enlarged it and what I saw was even stanger than the first part. It may have been an accident or something wrong with the camera but the zoomed in version looked like an aliens head, with a large bright square box in the middle, no joke, The box has a missing right corner and this is why I contact you. After this I looked on YouTube and did a search under Gulf Breeze UFO and came across a video of the well known Ed Walters who also lives here in Gulf Breeze. He has one part of his video that shows a craft that is exactly the same as what I saw flying out of the light. It has 3 massive lights on each site, but his photo is shot from the side. At that point I really regreted not shooting the photo of the craft as it passed over but as it sounded like a plane, I just thougt it must be. But when I think back the engine sounded much too small for that size of plane and those lights on the front seemed way too big for it to carry or need. Any way, as you might think this has really freaked me and my wife out and I just wanted to mention it to someone. I also wanted to know if you know how I can reach Ed Walters as I would like to ask him about what he saw. I would also like to add that the photo was taken by an IPhone, so I have no access to the film to edit it. The first one attached is the far away version, the second is the zoomed version. Again this is only the photo of the light, the thing that flew out may have been it, or something coming from it, I'm not sure but I have attached a screen shot from the Ed Walters Video so you can see what I saw. Thanks"],"files":["/var/www/straped/mufon/html2text/7960.html.txt","/var/www/straped/mufon/more/7960_submitter_file1__Aliens-003.jpg","/var/www/straped/mufon/more/7960_submitter_file1__Aliens-003.jpg.1","/var/www/straped/mufon/more/7960_submitter_file3__jet.jpg","/var/www/straped/mufon/org/7960.html"],"Case Number":"7960","Sighting Duration":"Undisclosed","Object Features":"Other","Region":"Florida","Object Shape":"Flash, Sphere, Star-like, Triangle","Disposition":"Unresolved","Latitude":"30.364424","Weather Factors":"None","Longitude":"-87.161657","Date of the Event":"09/19/2007 07:00 UTC","Source":"MUFON","Summary":"Bright glowing object with blue and gold strangs of light","trends":["There have been 55 other sightings in Gulf Breeze","There were no other sightings in Gulf Breeze on or around September 19th 2007","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=30.364424,+-87.161657(7960)&iwloc=A&hl=en\"> mufon case (7960) map </A>","Object Flight Path":"Hovering then path","Date Submitted":"09/19/2007 07:00 UTC","City":"Gulf Breeze"}