{"City":"Weber City","Sighting Duration":"Undisclosed","Tags":"City","trends":["There have been no other sightings in Weber City","This sighting has never been favorited."],"Latitude":"36.622878","Country":"United States","Source":"MUFON","Object Shape":"Circle, Sphere","Date Submitted":"09/17/2007 11:15 UTC","divs":["Sighting DetailsOn Monday, 17 Sept, 2007, myself, my husband, and two of our out of state {W. VA} friends were at our pond on our property in Southwest Virginia. We had fished for a couple of hours, then built a fire, had some supper, and eventually gathered the lawn chairs around the fire and played music. The other three were all picking various acoustic instruments, while I sat back listening, watching the sky occasionally, and enjoying the music for an hour or so. I stretched out, and just looked over my left shoulder while flexing my neck muscles. A bright yellow orange light caught my eye, coming from the north over Clinch Mt., and moving in an easterly direction. I immediately sat up, turning toward it. It was stationary at first, then moved forward slowly, hovered, and then moved back again to its original position. I knew then it was not a plane. I grabbed my husbands knee, as he was picking a banjo, and pointed to the object. He looked and stopped playing immediately after watching for just a couple of seconds. He then told our friends, who were sitting with their backs to the object, to \"stop now, and get a look at this\". It was that quickly apparent that this was out of the ordinary. The time was approximately 23:15, on a clear night, no clouds, and no background lights, as we live in the country. We watched this light go in a controlled yet occasionally erratic pattern for about three minutes. At one point, it went from a 1 or 2 o'clock position, to a 7 o'clock position, then back. It would hover, then go forward slowly, deliberately, and had occasional almost jerking movements back to its previous hovering point, then jumping ahead slightly, and moving smoothly. I had a Nikon D50 with me, and a Hitachi digital dvd camera. Neither of them would work. They both had fully charged Li ion batteries. [I had both of these present, and fully charged, to record some of our annual get-together music]. I was very surprised about my digital SLR, as I quickly changed settings, wondering why it would not work, as I had taken several shots previous to this sighting. I tried to just fire the flash of the camera, to see if there would be a reaction of some sort from the object. The flash would not fire. I was torn between trying to figure this out, knowing I'd be missing part of what this object was doing. I tried the the video cam...nothing. It would not record. I put them both down, deciding to just watch, while mentally cursing the manufacturers of what I thought was fairly good digital equipment. By this time, the object was halfway between Clinch Mt. and Pine Ridge. We continued watching its movement, fairly slow, deliberate, with occasional moments of hovering, until it could no longer be seen over Pine Ridge. No blinking lights were seen by three witnesses. The fourth thought he might have seen a blinking red light, but not at all times. There was absolutely no sound. The estimated time of sighting is three minutes. I knew something extraordinary had been seen, and we were all fascinated, not really knowing what to think, except that it was definitely not a plane or helicopter. While the event occurred, it seemed to me personally that I was seeing it, yet at the same time not really believing that this was something I could not explain. Just remarkable; I really can not find the perfect word. Totally amazing falls a bit short. For informational purposes, about 5 minutes later, I picked up the Nikon to see if I could take a shot; it worked perfectly, still showing a full battery charge."],"Longitude":"-82.562098","Log Number":"US-09212007-0005","Case Number":"7961","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.622878,+-82.562098(7961)&iwloc=A&hl=en\"> mufon case (7961) map </A>","Region":"Virginia","files":["/var/www/straped/mufon/html2text/7961.html.txt","/var/www/straped/mufon/org/7961.html"],"Viewing Distance":"Unknown","Weather Factors":"None","Summary":"controlled flight with erratic movement seen for approx. 3 minutes from yellow-orange globe by 4 witnesses in SW VA","Disposition":"Unknown","Date of the Event":"09/17/2007 11:15 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering"}