{"Object Features":"None","Latitude":"41.901981","Object Shape":"Sphere, Star-like","Disposition":"Unknown","Date of the Event":"09/15/2007 10:30 UTC","files":["/var/www/straped/mufon/html2text/7962.html.txt","/var/www/straped/mufon/org/7962.html"],"Country":"United States","Viewing Distance":"501 Feet - 1 Mile","City":"Taunton","trends":["There have been 8 other sightings in Taunton","There were no other sightings in Taunton on or around September 15th 2007"],"Date Submitted":"09/15/2007 10:30 UTC","divs":["Sighting DetailsI was leaving my girl friends house around 10pm i usally take my boat out because i live on a lake and our houses are close by. about 10 min boat ride. As i was leaving i started the boat and was heading east to my house. something caught my eye to the southeast of my heading. My first intinct it was a planet in view maybe venus or mars because it was glowing. but i took astronomy in high school and it was to low and to bright. i am a man of reason, and to me everything has to have an explanation. i stopped the boat and looked closer, then when i did stop it was changing colors to green,red, and white. at this point i thought it was a plane, because there is a local airport nearby about 1 mile from my location over the trees. at the time the object was about 3 football fields away and 4,000 feet up. i started the boat again and was moving east at about 10 mph. i kept watching it, at the time i called my gf telling her what i saw, she thought i was crazy, i told her to come out and look at it, but she hated the dark and said it was too cold, so i hung up. i am a emergency medical techinian at a local hospital and people take me very seriously, so when i tell somebody what happen this night they belive me. i stopped the boat again, and the object got closer and dropped alttitude to about 1,000 to 2,000 feet, and 200 yards or so. i was about 5 minutes from my house. i was getting scared by this time, as i stopped again the object was now closer about 500 feet up and 100 yards away. it seemed when i stopped and started, it got closer and lower, i knew now this was not a aircraft or star or planet, it was deffiniatly a UFO. this time i could see it very clear, no sound, medium sized object sphere star like shape, changing colors every 4 seconds, to red white and green. after the 3rd time i had enough, and floored my boat back to my house and ran inside. before i went inside i looked back and the object was gone. i never belived in UFO's or aliens but after this september night. u can bet i do now. i never do drugs drink or nething to conflit with my well being and this is the first time i told ne body about it. i used to go on the lake at night, now i dont go out at all unless im with somebody. i am 21 years old, and i have never been so scared in my life."],"Source":"MUFON","Object Flight Path":"Path then hovering","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.901981,+-71.087467(7962)&iwloc=A&hl=en\"> mufon case (7962) map </A>","Longitude":"-71.087467","Weather Factors":"Unknown","Summary":"strangest night i ever had","Sighting Duration":"Undisclosed","Log Number":"US-09212007-0006","Region":"Massachusetts","Case Number":"7962"}