{"Date Submitted":"09/22/2007 01:30 UTC","Tags":"City","Longitude":"-83.804417","Country":"United States","Date of the Event":"09/22/2007 01:30 UTC","Region":"Ohio","map":"<A HREF = \"http://maps.google.com/maps?q=39.929967,+-83.804417(7975)&iwloc=A&hl=en\"> mufon case (7975) map </A>","files":["/var/www/straped/mufon/html2text/7975.html.txt","/var/www/straped/mufon/org/7975.html"],"divs":["Sighting DetailsWhile on break from our job,about 1:30am eastern time. I and co-worker john hayes, watched as two saucer shaped disks sprang up a wooded area about two miles south of the plant, about along st rt. 334 and st rt 72 heading north along st.rt.72 over the top of the plant at about 10,000 ft and about 4,000 mph. they were really moving,with aplasma sheild around the lead craft. they flew over the international harvester plant also along st. rt. 72. i first noticed what looked like a fireworks mortor going off, then it started to advance towards us at extreme rate of speed, i said to john look at that pointing towards the area that it come from. he stated wtf! is that a meteor? and i replied i don't think so meteor's don't climb in altitude,or start from the ground up. and it sure wasn't swamp gas traveling at 5,000 mph looking at each other and saying awesome. all night long we keep shaking our heads and saying that was wild. we lost site of the objects as they passed over the building heading north, because of the extreme speed they were moving."],"Object Features":"None, Unknown","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","Weather Factors":"None","Case Number":"7975","trends":["There have been 5 other sightings in Springfield","There were no other sightings in Springfield on or around September 22nd 2007"],"Viewing Distance":"Over One Mile","City":"Springfield","Summary":"up out of wooded area along state route 334 flying over st rt 72 north","Object Flight Path":"Hovering then path,Straight-line path","Log Number":"US-09232007-0001","Latitude":"39.929967","Object Shape":"Circle, Disc","Source":"MUFON"}