{"Disposition":"Unknown","Object Flight Path":"Stationary,Hovering then path","Summary":"A wide extremely bright white light object with extremely fast periodic strobing lights","Date Submitted":"09/18/2007 11:04 UTC","Latitude":"42.658366","divs":["sighting detailsit was a warm clear night on the evening of 09\\18\\07 so i left the bedroom window open as i went to bed. the blinds were raised halfway. after a few minutes, i noticed very fast flashing colored lights against my bedroom wall. these were round lights, which flashed extremely fast, then stopped. i watched the wall for a short time and saw nothing more so i tried to go back to sleep. after a minute or so, i looked at the wall again and saw nothing for a moment, then i saw the flashing lights flash again against the wall, then stop again. i continued to watch the wall and after a few moments, the lights flashed again. there were several colors: blue, yellow, red. i thought that car headlights do not do this so i decided to get up and look out the window to try and see what was causing it. i got up, looked out the window, and just to the southwest, there was an extremely bright light. it was more wide than high and it looked like a row of extremely bright white lights. i did not see any strobing lights at this point. i watched it for several seconds. it seemed motionless and i could hear no noise -- the only noise i could hear was the water fountain in our pond in the back yard. at first, i thought of a plane traveling straight towards me since i could see no motion. it was low in the sky and it was above the tree line. there was a pond, some houses and trees between the object and myself. as i continued to observe the object, the strobing lights activated again. these were extremely fast, bright lights that seemed to travel across the object. i couldn't see any regular faa-regulated lights like the ones you see on the tips of wings or on the body of an aircraft. i also have never heard of aircraft lights that were strong enough to display on the interior walls of homes. after a few moments, the object moved to my right, which was towards the north, and the object moved behind some trees and out of my view. i would estimate the entire visual sighting lasted about 20 to 30 seconds. the entire episode was about 10 minutes from when i first noticed the strobing lights on the wall to the end of the visual sighting. i have enclosed an artist rendering to communicate the location of the object from my position from the bedroom window."],"Country":"United States","Log Number":"US-09232007-0004","map":"<A HREF = \"http://maps.google.com/maps?q=42.658366,+-83.149932(7978)&iwloc=A&hl=en\"> mufon case (7978) map </A>","Weather Factors":"Unknown","Object Features":"Unknown","Date of the Event":"09/18/2007 11:04 UTC","Tags":"City","Source":"MUFON","Sighting Duration":"00:10:00","files":["/var/www/straped/mufon/html2text/7978.html.txt","/var/www/straped/mufon/more/7978_submitter_file1__Artist_rendering_sighting.JPG","/var/www/straped/mufon/org/7978.html"],"Longitude":"-83.149932","Region":"Michigan","trends":["There have been 10 other sightings in Rochester Hills","There were no other sightings in Rochester Hills on or around September 18th 2007","This sighting has never been favorited.",""],"Object Shape":"Cigar, Flash","Viewing Distance":"Unknown","City":"Rochester Hills","Case Number":"7978"}