{"Log Number":"US-09232007-0005","Sighting Duration":"Undisclosed","Object Shape":"Square, Rectagular, Triangle, Other","Date of the Event":"06/30/2007 10:30 UTC","files":["/var/www/straped/mufon/html2text/7979.html.txt","/var/www/straped/mufon/org/7979.html"],"Source":"MUFON","Longitude":"-93.107049","Case Number":"7979","Tags":"City","Latitude":"44.956267","Summary":"In a blink, it changed formation from line to triangle to square.","City":"St Paul","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Region":"Minnesota","map":"<A HREF = \"http://maps.google.com/maps?q=44.956267,+-93.107049(7979)&iwloc=A&hl=en\"> mufon case (7979) map </A>","Date Submitted":"06/30/2007 10:30 UTC","divs":["Sighting DetailsI was at work, and wanted to rest my eyes, after staring at the computer all morning. (For some years now, I've been resting my eyes by staring out at the horizon, as suggested by a nurse at work.) As usual, I went into a corner conference room. (I believe it was between 10 and 11 am.) From there, I can watch people outside on the streets, birds flying overhead, airplanes heading to or leaving from MSP international airport, and check on the weather. Around the end of June, or beginning of July, 2007, I went into the corner conference room and began watching the people on the streets below. It was a nice sunny morning, with big fluffy clouds floating by. I stared towards the river and began watching planes fly overhead. They must have redirected the planes, and I thought of our 911 disaster, as one plane headed in my direction (though clearly, it was high enough in the sky to not be a threat). As I watched the approaching plane, it was very high in the sky, and above some clouds, but I realized it was definitely a NWA plane, since it had a red tail. As I lowered my eyes, I saw a bird flying. I glanced up again to see how close the plane was, when I saw it. It was between the plane and the bird. It was a solid black line. In a blink, the figure went from a solid black line, to a solid black triangle, to a solid black square. It was as though I was looking at the bottom of this object. I think it changed form again, but I don't recall exactly what the form was. In a blink, it kept repeating the formations. It moved as though it was hiding at the bottom of the clouds. The bird flew on. The plane flew on. The object moved slowly towards our building. I wanted to find someone to see it with me, but I was instantly fearful of two things. 1. What would someone at work think of my asking them to come see this. 2. What would I miss if I left to go get someone. I stared in amazement. It went right over our building. I thought to myself, if it is real, it will cross over to the other side of the building. I ran to the other side of the building to look. I stood anxiously waiting. It appeared, and continued on, slowly, towards the Capitol. It was still continuously changing shapes. I watched until it was gone from sight. Can anyone explain what it was that I saw? The few family members I have told, don't believe me. I don't dare tell anyone at work, or they'll judge me, too. I'm wondering if anyone else out there saw what I saw."],"Disposition":"Insufficient Data","Weather Factors":"Unknown","trends":["There have been 22 other sightings in St Paul","There were no other sightings in St Paul on or around June 30th 2007"],"Viewing Distance":"Unknown","Country":"United States"}