{"Latitude":"41.759528","Date Submitted":"09/20/2007 05:00 UTC","trends":["There have been 11 other sightings in Crescent City","There were no other sightings in Crescent City on or around September 20th 2007","This sighting has never been favorited.",""],"Longitude":"-124.193847","Date of the Event":"09/20/2007 05:00 UTC","Disposition":"Unknown","Source":"MUFON","Object Flight Path":"Path then hovering","Weather Factors":"Unknown","Object Shape":"Chevron, Cylinder","divs":["Sighting DetailsOk it was morning i woke up at about 5:00 am just before light heard over the scanner that someone called and said there was a ufo over his house so then the cops went to check it out then i looked outside and was amazed at what i saw it was quite large all i saw was a bright light in the sky over to the east it looked like aboyt 30 stars all bunched up so close you could not see any seperation just bright light not to far off. did not know what to think then heard the scanner say head back to the station and get the cameras that this guy dose see something. so we took a picture of it, it turned ot looking neat but round. i grabbed my binoclars and was able to see without the glare and saw that it was long round with a purple round light in the middle of one half of it, dont know if it was front or back or what. i was feeling scared at first thought it might be something comeing towrds us from far off so we called my step sister she was on the other side of town so asked if she could see the other side of it and she said yes also saw a blue light in it and a red glow she was closer to the other side of it so i knew it was not moving just staying suspended. called the radio station and found out i was not the only one who called then heard it on radio that lots of people had called it in.when the daylight came out it was still there bright for a bit then the lighter it got outside it started to fade not move though and we waited to see if it was there the next morning but it was not. well ty. and if anyone hears anything about this one that we saw let us know please We are in crescent city, california, ty. the picture sendng does need to be zoomed..I have saved it zoomed out but will not stay zoomed when go to send it."],"Case Number":"7980","Tags":"City","Country":"United States","Object Features":"Patterned Surface","Sighting Duration":"01:30:00","map":"<A HREF = \"http://maps.google.com/maps?q=41.759528,+-124.193847(7980)&iwloc=A&hl=en\"> mufon case (7980) map </A>","files":["/var/www/straped/mufon/html2text/7980.html.txt","/var/www/straped/mufon/more/7980_submitter_file1__ObjectInSky20th0fSept.JPG","/var/www/straped/mufon/org/7980.html"],"Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-09232007-0006","Summary":"it was all white except for purple light in middle of the back or the front dont know","Region":"California","City":"Crescent City"}