{"divs":["Sighting DetailsOn September 12th, 2007 I was flying from DIA, Denver, Colorado to Dallas Fort Worth. Approximately at 9:30- am about 5 min into the flight we passed over a populated area that I think was Colorado Springs. I caught a flash of light and looked towards the East. What I saw was a very large round light extremely bright with smaller lights randomly moving around the larger light. The larger light flashed on and off. I watched this for several minutes. I took two digital pictures, which I am including. The camera did not pick up the very bright light but does show some interesting things. When I zoomed in on the picture I could see some very distinct white dots and some other images I could not identify. Not sure if the picture will help but will enclose it for your examination. At the time, I could see the ground and the objects were well above the ground and the plane I was in was much higher. Of course the time and location are just estimates. It definitely was before Pueblo Colorado. The pilot announced passing over Pueblo some time later. Thanks. I was in the window seat and either I was looking out towards the east or the flash caught my eye. The light seemed so bright that it was hard to look at. I was stunned to see it and I watched it til the plane moved forward and it was no longer in sight."],"Log Number":"US-09232007-0007","Tags":"City","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/7981.html.txt","/var/www/straped/mufon/more/7981_submitter_file1__9715-1.jpg","/var/www/straped/mufon/more/7981_submitter_file2__100_1965.jpg","/var/www/straped/mufon/more/7981_submitter_file4__Image0002.png","/var/www/straped/mufon/org/7981.html"],"Disposition":"IFO","Object Features":"Undisclosed","Viewing Distance":"Unknown","Longitude":"-104.814833","map":"<A HREF = \"http://maps.google.com/maps?q=38.835022,+-104.814833(7981)&iwloc=A&hl=en\"> mufon case (7981) map </A>","Region":"Colorado","Country":"United States","Weather Factors":"Unknown","Case Number":"7981","Summary":"Extremely bright light with lesser lights surrounding","Date of the Event":"09/12/2007 09:35 UTC","Date Submitted":"09/12/2007 09:35 UTC","Latitude":"38.835022","City":"Colorado Springs","Sighting Duration":"Undisclosed","Source":"MUFON","Object Shape":"Flash","trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around September 12th 2007","This sighting has never been favorited.",""]}