{"City":"Normal","Source":"MUFON","Latitude":"40.514203","Object Features":"Appendage(s), Other","Object Flight Path":"Hovering then path","Country":"United States","divs":["sighting detailsi just finished watching a baseball game on television on saturday 9\\22\\07 (go cubs!). immediately after the post game show, i went out to my deck, which is on the west side of my house, in my backyard. i was sitting in a chair facing east (towards my house) when i saw a jet traveling north from the south. there was nothing else to look at so i was following the jet with my eyes when an object caught my eyes when i was looking directly east. this object was all white and was completely standing still when i first saw it. at first, i thought it was a star or mercury\\venus, but it was too early in the day to be able to see a star or planet. i kept my eyes on it and suddenly, it shot off from the ne to the sw. there was a very slight breeze from the ssw at the time, so i do not believe this was something carried by the wind, as it would have been going against the wind at a pretty good speed. as the object moved to the sw i was able to get a closer look at it. it was a very odd shape. almost like a balloon with a huge streamer, but the streamer did not flutter around as you would expect from a balloon being carried by the wind. from the time the first object i saw began moving to the time it was out of sight was about 10 seconds. i did not get a chance to take a picture of that object. i was actually thinking about going inside and grabbing my camera when i notice a second object. this object was already moving when i noticed it. trying to think quick, i ran inside and grabbed my camera, turning it on when i was running back through the house to the deck (this took about 30 seconds as i had to go to the lower level of my house). when i got back outside, the object was just disappearing behind some trees and i could not get a picture. but, i immediately looked up to where the other objects appeared from and there was another object. i tried taking several pictures and am attaching the one of the best quality (object is in lower left corner). i can not tell what it is, even after zooming in on it. the sky was very bright and it is very difficult to zoom in on a small object very far away with those tiny view finders. i do know that whatever these thing were had to be moving with their own power and not carried by the wind. as i said, there was a very slight breeze from the ssw and these things were moving to the sw from ne."],"Summary":"Objects popping up out of nowhere traveling NE to SW","Weather Factors":"Unknown","Disposition":"IFO","Tags":"City","Region":"Illinois","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/7984.html.txt","/var/www/straped/mufon/more/7984_submitter_file1__100_0596.jpg","/var/www/straped/mufon/org/7984.html"],"Date of the Event":"09/22/2007 12:00 UTC","Viewing Distance":"Unknown","Object Shape":"Other","Case Number":"7984","Date Submitted":"09/22/2007 12:00 UTC","trends":["There have been 4 other sightings in Normal","There were no other sightings in Normal on or around September 22nd 2007","This sighting has never been favorited.",""],"Longitude":"-88.990631","Log Number":"US-09242007-0001","map":"<A HREF = \"http://maps.google.com/maps?q=40.514203,+-88.990631(7984)&iwloc=A&hl=en\"> mufon case (7984) map </A>"}