{"Object Features":"Wings","divs":["sighting detailsvery early last sunday morning in fort erie, ontario across the river from buffalo ny(sept 23\\07 ~1:00 am or so). i was outside around a fire with my niece and nephew. the sky was clear, weather nice. i looked to the sky and seen a triangular shaped ufo\\aircraft at about 2500-3000 feet up flying low speed. it's belly was lit up with approx 7 white lights (in a v shape) and it was virtually silent (it was very silent). it's direction was north i believe, following the niagara river towards niagara falls (30 km away). our sighting was with 3 people and i would say it was 2-3 minutes duration as it disappeared into the night and tree line. this is the 3rd time in 1 month i have seen it. i visit my friend regularily who lives in ft erie, he has seen it with me a few weeks back. it was an awsome sight to see and next time i will have my camera on hand to video it. it is as if i can set my watch to this 'thing'. i also know it can be seen from buffalo, but do believe it was in canadian airspace the three times i seen it. my take on this mystery aircraft\\ufo is this. i believe it to be a b2 spirit bomber patroling the border, i may be wrong though. i am a true believer in ufo's and an aircraft buff, but to the untrained eye... this is one very freaky sight and confuse\\scare someone by it's appearance. it is ghostly in nature and it blends into the night sky perfectly. added all that with it's silence and i am sure it is a b2 stealth. anyone reading this who is in either buffalo ny or fort erie ontario areas, i urge to set out with your video camera at about 10 at night to be sure you catch it. the wait is worth your time. i only assume this aircraft is flying easterly over lake erie then onto lake ontario. our area here is big time internation border with numerous bridges crossing into the usa and i am certain it is a secret border patrol tool. very intimidating!!! comments and questions can be sent to bertgjohnson@gmail.com thanks! b johnson ps: please contact me with other area sightings. i have not seen it from niagara falls btw."],"Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-78.972174","Region":"Ontario","Country":"Canada","Object Flight Path":"Straight-line path","Sighting Duration":"00:03:00","Object Shape":"Chevron, Triangle","Case Number":"7988","Source":"MUFON","City":"Fort Erie","trends":["There have been 5 other sightings in Fort Erie","There were no other sightings in Fort Erie on or around September 23rd 2007"],"Summary":"Triangle UFO, low height, low speed with white lights on the belly","Disposition":"Unresolved","Date Submitted":"09/23/2007 12:00 UTC","Latitude":"42.901776","map":"<A HREF = \"http://maps.google.com/maps?q=42.901776,+-78.972174(7988)&iwloc=A&hl=en\"> mufon case (7988) map </A>","Date of the Event":"09/23/2007 12:00 UTC","files":["/var/www/straped/mufon/html2text/7988.html.txt","/var/www/straped/mufon/org/7988.html"],"Weather Factors":"None","Log Number":"CA-09242007-0005"}