{"Country":"United States","Sighting Duration":"Undisclosed","trends":["There have been 10 other sightings in Winter Park","There were no other sightings in Winter Park on or around September 24th 2006"],"Disposition":"Unresolved","Date Submitted":"09/24/2006 12:00 UTC","Summary":"huge \"star\" motionless, extreme brightness and size","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=28.60238,+-81.330025(7989)&iwloc=A&hl=en\"> mufon case (7989) map </A>","files":["/var/www/straped/mufon/html2text/7989.html.txt","/var/www/straped/mufon/org/7989.html"],"Tags":"City","Case Number":"7989","Longitude":"-81.330025","Object Features":"Undisclosed","Date of the Event":"09/24/2006 12:00 UTC","Region":"Florida","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","divs":["Sighting DetailsI awoke unusually early, approx. 5:00 AM (I usually wake up around 9AM since i work late at night i sleep long). I had a strange urge to step outside on the porch. After fighting the urge, I still went outside. I lit a cigaret. It was dark outside. Then I looked up in the sky. I couldn't believe what I saw. There was an absolutely disproportionately humangous \"star\" in the blackness of the sky. At first I thought it was an airoplane flying low. But it had no landing lights flashing. Then I realized it wasn't moving. I also heard no noise. It was just hovering stationary and silent. I thought to myself, I must be dreaming. Then I tried to discern a shape. But the thing was so imensely bright that I could not see into its center, so as to find a shape. It was an abnormally intense bright white, visibly radiating rays of extreme bright light outward. Activity-wise it was almost as if it was \"very twinkling\", but when i looked at the other stars for comparison, it out-twinkled them all. There was an energy movement about it, radiating this brightness outward. And for a moment I could feel a neuronic response in my fingertips, shooting down to my toes, as if a lot of sharp needles had penetrated me all at once. At this, I went to stay close to my door, ready to run back inside, as I became afraid. There I stood, trying to draw reference points in the landscape, in order to remember the position of this \"star\". I noticed clouds in the wind, as they moved in the sky, and as they passed, they momentarily blocked out the regular stars, yet the big \"star\" was not at all affected by it, as it would not disappear \"behind\" the clouds, like the rest of the stars. Instead, the clouds passed behind it and its light outshone the clouds. Then I tried to discern a reference size between the normal stars and this one in question. The normal ones were so tiny in comparison, like the point of a pencil-tip, compared to a 25 cent American quarter. _Go figure... I called my daughet to see what I was seeing. (To make sure I wasn't dreaming\".) I had an uneasy feeling the whole time. -As if any moment it would drop low and come toward me. For this reason I went inside the house. I wanted to report this to authorities but then stopped short at the thought of having to wrestle with their disbelief and ridicule. -Forget it! PS.: I observed two helicopters, flying toward the direction of the \"star\", minutes apart one from the other. There was also an airplane, small, like a private plane, flying toward small executive airport in orlando -away from star, as if for landing). I do not recall the color of the choppers.)"],"Viewing Distance":"Unknown","Log Number":"US-09242007-0006","City":"Winter Park","Source":"MUFON","Latitude":"28.60238"}