{"City":"Guthriesville","Object Features":"Unknown","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=40.03316,+-75.763553(7996)&iwloc=A&hl=en\"> mufon case (7996) map </A>","Tags":"City","Summary":"Orange rotating rectangle stopped, changed course","trends":["There have been no other sightings in Guthriesville","This sighting has been favorited 1 time."],"files":["/var/www/straped/mufon/html2text/7996.html.txt","/var/www/straped/mufon/org/7996.html"],"Weather Factors":"None","Log Number":"US-09242007-0013","Case Number":"7996","Object Flight Path":"Path with directional change","Disposition":"Unknown","Latitude":"40.03316","divs":["Sighting DetailsSighted an orange rectangle (beam? bow-tie) shaped object. Rotating clockwise at 40-50 RPM or about 1 time per second. Traveling west to east. In 5 seconds it traveled about the same distance a commercial airliner would travel in 10-15 seconds. Not as fast as a fly-over of the ISS but somewhere in between. Orange beam had no additional lights and I could not ascertain structure (whether disk shaped or just an actual rectangle). After 5-seconds of straight line flight (while rotating) - it stopped for under one second and then proceeded to \"dodge\" or reverse direction nearly 180* while changing from a rectangle to more of a single point of orange light. It moved \"upward\" and to the west for under 1 second then back to the east again for under 1 second and again one or two more times. At this point, I was thinking \"I believe this is out of the orindary\". I then saw an approaching commercial airliner traveling west-bound from the east, presumably from PHL. It still had its take-off light on (bright light you see upon takeoff and landing). I would say that the best way to describe the object's actions was that it was nearly on a direct course toward that airliner and then proceeded to stop and get out of the way and disappear upwards and away."],"Longitude":"-75.763553","Date of the Event":"09/24/2007 08:13 UTC","Country":"United States","Sighting Duration":"00:00:15","Date Submitted":"09/24/2007 08:13 UTC","Region":"Pennsylvania","Source":"MUFON","Object Shape":"Disc, Square, Rectagular"}