{"Disposition":"Insufficient Data","Weather Factors":"Unknown","Latitude":"37.67467","Case Number":"7997","City":"Hayward","trends":["There have been 13 other sightings in Hayward","There were no other sightings in Hayward on or around September 24th 2007","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Date Submitted":"09/24/2007 12:00 UTC","Source":"MUFON","Summary":"Wierd lights viewed on the peninsula side of the Bay Area.","files":["/var/www/straped/mufon/html2text/7997.html.txt","/var/www/straped/mufon/more/7997_submitter_file1__UFO.jpg","/var/www/straped/mufon/org/7997.html"],"Viewing Distance":"Over One Mile","Date of the Event":"09/24/2007 12:00 UTC","Object Shape":"Star-like","Object Features":"Unknown","Tags":"City","Country":"United States","divs":["sighting detailsstanding outside on my balcony smoking a cig, i usually count all of the airplanes that are in the air every time i am out there. today, i looked west from my apartment which is nestled in the hills so i have a good view all the way to the hills in the peninsula. today i noticed a bright orange\\red light that was sitting still. airplanes always move, they do not sit in one place for a long time, this one did not move at all. so i paid it little attention, and then looked back at it after counting all of the other airplanes. it still had not moved. now i am paying more attention to it, i see that another orange\\red light has appeared near it. they sat in the sky for about 5 minutes before one of the lights moved south while the main one sat still in the same position. right now as i checked outside the largest of the lights has disappeared. as it is twilight, most of the airplanes in the area get a orange red glow when they turn. but it does not take an airplane 10-15 minutes to turn."],"Object Flight Path":"Stationary","Log Number":"US-09242007-0014","Longitude":"-122.071096","map":"<A HREF = \"http://maps.google.com/maps?q=37.67467,+-122.071096(7997)&iwloc=A&hl=en\"> mufon case (7997) map </A>","Region":"California"}