{"Latitude":"42.108428","Date of the Event":"08/12/1978 12:00 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.108428,+-72.078687(8001)&iwloc=A&hl=en\"> mufon case (8001) map </A>","Tags":"City","trends":["There has been one other sighting in Sturbridge","There were no other sightings in Sturbridge on or around August 12th 1978"],"files":["/var/www/straped/mufon/html2text/8001.html.txt","/var/www/straped/mufon/org/8001.html"],"Viewing Distance":"101-500 Feet","Summary":"quiet nite fishing when this huge Disk showed up instantly.","Country":"United States","Disposition":"Unknown","Longitude":"-72.078687","Object Shape":"Circle, Disc","Log Number":"US-09262007-0001","Object Features":"Unknown","Source":"MUFON","Case Number":"8001","City":"Sturbridge","divs":["Sighting DetailsMy friend and I were doing some nite fishing on a pond near in sturbridge Mass.The nite sky was very clear, I noticed some strange lights over the mt range, It was about 12AM and the fish were not biting so I was relaxing and watching the sky.The moon was low in the sky and didn't give us much light. All of a sudden this pond which was 2 miles across turned as bright as day. We looked up and there was a huge over us,maybe 2-300ft above us and made no noise at all.This disk coverd the space from the waters to the road where the car was,this would have made the spear at least 500 feet across My friend got very nervous along with me and we decided to get the to shore ,put the canoe on the car and leave. The light stayed with us all the way to the boat ramp. As we were putting the canoe on the car the light came closer. We were scared by now and just wanted to get out of there. We thru the gear and the canoe on the top of the car and tied it down with only one rope. The trip to the highway takes about 1 half hour and the next thing I recall is us parked on the side of the highway with all the poles and gear neatly stowed neatly in the back of the car. It took two and half hours to get where we stopped, It usually took 1 half hour to get this far. We arrived home about three and a half hours late. No reccolection where all this time went. Also the canoe was tied down the way it should and not the way we thru it on the car. My friend would never talk about what happened and his wife told me he later had a nervous brakedown because of what happened that nite He never told her what happened and asked that I didn't either."],"Region":"Massachusetts","Date Submitted":"08/12/1978 12:00 UTC","Object Flight Path":"Stationary,Straight-line path,Path then hovering","Weather Factors":"Unknown"}