{"City":"Northport","Latitude":"40.900931","Date Submitted":"09/25/2006 12:00 UTC","Sighting Duration":"Undisclosed","Summary":"Ambiguous in shape - different colors of light. It's movement was jellyfish like, with short bursts in random directions","Disposition":"Unresolved","Longitude":"-73.343173","Date of the Event":"09/25/2006 12:00 UTC","trends":["There has been one other sighting in Northport","There were no other sightings in Northport on or around September 25th 2006"],"Object Shape":"Other, Unknown","Case Number":"8002","Country":"United States","divs":["Sighting DetailsI was lying on the beach with my girlfriend looking at the starry sky above the Long Island Sound. I saw a bright object moving very slowly, assumed it was a satellite, and debated even mentioning it. I finally decided to point it out, and as soon as I did we both saw it start to move very unnaturally. It changed direction and changed colors. It looked as if it were swimming rather than flying. It was jellyfish-like in the way it was almost always moving very slowly then would shoot in one direction quickly and kind of drift in that direction. At one point I observed a commercial airplane fly near it and underneath it, and at that point the object became still and gave out a white starlight. I watched it for about 45 minutes on the beach. I finally went home and stood in my front yard and immedietly found it. I called my mom and brother outside who both looked with toy binoculars and observed it was infact moving. They observed the colors as well, but I let them know that it was not making any bursts of speed like I saw over the sound. It appeared more west at this point, no longer over the sound but over the island. I videotaped some of it, although I couldn't zoom in enough. The object does infact move on tape, but the video does it no justice. If ANYONE in the Long Island - Conneticut area witnessed this, I'd like them to contact me immediately."],"Viewing Distance":"Unknown","Log Number":"US-09262007-0002","Object Features":"Unknown","Source":"MUFON","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.900931,+-73.343173(8002)&iwloc=A&hl=en\"> mufon case (8002) map </A>","Object Flight Path":"Path with directional change,Path then hovering,Other","files":["/var/www/straped/mufon/html2text/8002.html.txt","/var/www/straped/mufon/org/8002.html"],"Weather Factors":"Unknown","Region":"New York"}