{"Source":"MUFON","Date Submitted":"09/25/2007 07:30 UTC","Region":"Texas","Latitude":"29.374096","Case Number":"8003","Viewing Distance":"Unknown","Object Shape":"Sphere, Star-like","Country":"United States","Object Flight Path":"Undisclosed","divs":["Sighting DetailsIts was September 25, 2007 at 730PM. I had just gotten a cup of lemonaide that my mom had just made cuz she had finished making dinner. I step outside and sat down outside to get a some air. Then i saw this airplane flying towards san antonio. I just looked at it as it flew over my house. But then my eyes cought something really bright high in the sky. It was moving very slow into town. I thought it was a star at first but then it stopped. Then it made a move like a shape of a 7. and it stopped again. So i went in my house told my family \"LOOK THERE IS SOMETHING IN THE SKY!\" and my mom ran outside to look at it. My little cousin nacho and my big brother came out along too. They saw it.I told them what it did. My mom believed me my big bro didnt believe me they both went back inside. my little cousin stayed outside with me for a while. then we saw it become brighter then it disappeared into nothing my little cousin was shocked after he saw that happen. i tryed to call carmen. i was looking for a Computer to logg in and report this last night. but i couldnt. well that all that happend."],"map":"<A HREF = \"http://maps.google.com/maps?q=29.374096,+-100.894187(8003)&iwloc=A&hl=en\"> mufon case (8003) map </A>","Log Number":"US-09262007-0003","Object Features":"Undisclosed","City":"Del Rio","Sighting Duration":"00:30:40","Weather Factors":"Unknown","Summary":"bright light over my house","Longitude":"-100.894187","files":["/var/www/straped/mufon/html2text/8003.html.txt","/var/www/straped/mufon/org/8003.html"],"Disposition":"Unknown","trends":["There have been 12 other sightings in Del Rio","There were no other sightings in Del Rio on or around September 25th 2007"],"Tags":"City","Date of the Event":"09/25/2007 07:30 UTC"}