{"divs":["sighting detailsit seems to be another \"smudged\" out photo that was updated by nasa on google earth. the good thing is that i am a member of the military and have access to a better version of google. i have looked at the photo a hundred different ways. maybe a professional opinion would shed some more light on it. but i have been told by a few high ranking officials that nasa has been known to smudge\\airbrush pictures before putting them out in the public eye. i for one am a strong believer that the shadow government needs to come clean with the rest of the world before it is too late. in the photo you will notice that road and the building have something circular over them. you can follow the black marks in the road and see that they are broken up by something, also on the corner of the building. the further you look under the \"disk\" the shadow gets darker. i think nasa has slipped up on this one. if anyone has any further info, please feel free to email me. snails180@hotmail.com one last thing, i was at work doing a google earth search of area 51 and this was the first time i have seen that image."],"map":"<A HREF = \"http://maps.google.com/maps?q=36.117746,+-115.171626(8005)&iwloc=A&hl=en\"> mufon case (8005) map </A>","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/8005.html.txt","/var/www/straped/mufon/more/8005_submitter_file1__possibledisk.JPG","/var/www/straped/mufon/org/8005.html"],"Case Number":"8005","Disposition":"IFO","Longitude":"-115.171626","Summary":"I saw it at Area 51 on google earth","Date of the Event":"09/27/2007 12:00 UTC","Object Shape":"Disc","Object Flight Path":"Undisclosed","Region":"Nevada","Country":"United States","Viewing Distance":"Unknown","City":"Las Vegas","Tags":"City","Source":"MUFON","Log Number":"US-09262007-0005","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around September 27th 2007","This sighting has never been favorited.",""],"Latitude":"36.117746","Weather Factors":"Unknown","Date Submitted":"09/27/2007 12:00 UTC","Object Features":"Undisclosed"}