{"Viewing Distance":"Over One Mile","Summary":"Two large bright lights appeared out of nowhere and began moving around in the sky in very strange patterns while randomly changing colors","Log Number":"US-09272007-0001","Sighting Duration":"Undisclosed","Case Number":"8007","Tags":"City","files":["/var/www/straped/mufon/html2text/8007.html.txt","/var/www/straped/mufon/org/8007.html"],"Weather Factors":"None","Date of the Event":"03/02/1995 01:00 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Longitude":"-112.86071","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.371725,+-112.86071(8007)&iwloc=A&hl=en\"> mufon case (8007) map </A>","Object Shape":"Circle, Sphere, Star-like","divs":["Sighting DetailsMe, My Father, my Brother, My Dad's friend Jeff were taking a trip to mexico. The exact date I can't recall but I'm sure one of the others does. Anyways we were driving for hours through the desert there was nothing around and it was around midnight when suddenly two lights appeared in the sky to our right. They were round, and almost star like bright but bigger than a star (it looked about the size of a golfball at arms lenght), at first they kinda just hovered around not moving much at all then they started getting a little erratic but flying around in an almost specific spot, and they started changing color(green to blue is all I remember, but there must've been more. Towards the end the objects I was wacthing out the side window I was now watching from the back window. While I was watching one of them suddenly dissappeared, the other lingered for some time till it was gone too. They never re-appeared after the last one left (I kept looking out the back winow for around an hour afterwards)"],"Date Submitted":"03/02/1995 01:00 UTC","Region":"Arizona","Object Features":"None","trends":["There have been no other sightings in Ajo","This sighting has never been favorited."],"Source":"MUFON","City":"Ajo","Country":"United States","Latitude":"32.371725"}