{"Country":"United States","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around September 23rd 2007"],"Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Region":"New York","Longitude":"-74.001853","Source":"MUFON","Log Number":"US-09272007-0003","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/8009.html.txt","/var/www/straped/mufon/org/8009.html"],"Date Submitted":"09/23/2007 12:00 UTC","Object Shape":"Sphere","Summary":"11-12 \"sphere\" ships day trip in ny","Tags":"City","Date of the Event":"09/23/2007 12:00 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.719493,+-74.001853(8009)&iwloc=A&hl=en\"> mufon case (8009) map </A>","Case Number":"8009","Latitude":"40.719493","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","divs":["sighting detailsaround 6pm after having dinner outside with my family (also witnesses to event)....i was staring at a plane as it went across the sky, i noticed some silver \"dots\" that were flying away from the plane.. soon after i noticed about 6 others, and pointed them out to my family... we tried going through what they possibly could be, but being as they seemed to me to be behind\\above the plane i was watching (which was itself very high above us) ruled out balloons, and then parachutes due to their shape, ..it was suggested they were planes as well (being we live close to lga airport), but they were perfect spheres, non-jet or plane shaped.....after a few seconds my sister-in-law pointed out even more, and in square patterns of 4, and every few seconds one would move towards another one and move back into pattern. they were slowly moving in a s\\se direction towards long island\\queens, weren't in much of a hurry, but you could easily lose track of them if you looked away long enough, they seemed to blend into the clouds if you werent focused on them. after about 9-10 minutes we had all lost track of them behind my neighbors trees and houses. after a few suggestions to check online later that evening for any other 'sky watchers' in the area, we the went back to continuing our previous conversation like nothing out of the ordinary had happened."],"City":"New York"}