{"Latitude":"30.238529","files":["/var/www/straped/mufon/html2text/8010.html.txt","/var/www/straped/mufon/org/8010.html"],"Tags":"City","Case Number":"8010","City":"Gonzales","divs":["sighting detailsok, i've seen ufo's since a child, hovering over me in the sky. had dreams and drew pov's of my house from hundreds of feet off the ground. i also kind of sense when they will show and often go outside to witness them passover. this is not the first close concious sighting of a triangle ship. i felt that they were gonna show again last nite and a week earlier i borrowed a 10 year old jvc video camera which i took out with me last night. i was sitting in my chair observing the skies and after about 15 minutes i saw a non-flashing light thousands of feet up. the camera basically is junk and i couldn't get any shots of it. (which is gonna change because by the weekend i'm gonna get a nice night illumination camera to be able to film them. it basically starts out looking like a slow moving light the size of a star. it (de-cloaked) out of nowhere and flew just a little ways with me trying to get it on film and then recloaked. i said within myself that \"you have to come closer because the camera can't pick you up.\" i then decided to climb the roof. i gave my wife a cobra walkie-talkie so i could call her out to witness it also when it showed again. after about 10 minutes of being on the roof it passed again only this time pulsating and flying closer and a little faster. still the camera wouldn't pick it up. so i said again only outloud this time that i still can't get (you) on film and they would have to come closer. 5 minutes later it showed again pulsating faster and maintaining the same approximate speed. still again to no avail with the camera. i asked again for them to come closer. after about 20 minutes of waiting and the fourth passover it was a lot closer. being stunned because they obviously were somehow hearing me; i called my wife on the radio and said hurry. being so distracted with calling my wife and staring at it as it passed over, i never even bothered to try and film it. (duh!) how dumb... right... anyway... it was an elongated triangle with a white light on each corner and a red pulsating light in the middle. it flew north to south and then began banking to the east,south direction as if it was gonna pass back by. only this time as it was banking the red light shut off and the entire craft lit up bright white and then disappeared. no sooner than 2 minutes later two aircraft (regular planes) took off from a private airport in the south,western area of our town. the craft obviously knew that they were fixing to take off because the planes headed in its general direction though i fully believe that the planes were oblivious to the craft from the start. back in oct. 1998 a similiar (i don't think it was the same craft) flew over my house as a friend of mine and i were outside smoking a cigarette around 10pm. i was looking towards the street light and also noticed the stars but it was when the stars were disappearing that i noticed at least a 300ft long triangular craft passing over. this one was different though. no white lights on the corners just a pattern of 5 lights in the middle in a half circle pattern (the lights being the size of stars if you were looking at the craft) flying over at no more than 15-25 mph about 300ft or so off the ground. silent, except for a high pitched tone (like when you turn on the tv). we ran inside to get my dad outside (me being about 20 or 21 yrs old at the time). he wouldn't come outside nor did he believe us. so we ran back outside and climbed an old tv antenna connected to the trailer and got on the roof and watched it as it passed over airline hwy. the back of the craft seemed to be squared off with light blue sparks shooting out the back of it and disappearing only after a few feet. i've seen 3 orange orbs on different occasions and when i had the thought to tell the people what was in the sky behind them they disappeared\\cloaked. when i was younger and at a crawfish boil there was a white egg shaped craft in the cloudy skies above me, and when it left the clouds literally moved out of the way before it and closed again behind it. that's it.... so far... many more sightings with them passing over and doing different things ( sometimes more than one ) but the journey and truth discovery still continues. i'm sure with a good camera i'll finally have good evidence of what is going on. thanks"],"trends":["There have been 7 other sightings in Gonzales","There were no other sightings in Gonzales on or around September 26th 2007"],"Longitude":"-90.920099","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=30.238529,+-90.920099(8010)&iwloc=A&hl=en\"> mufon case (8010) map </A>","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","Object Features":"Unknown","Summary":"Passover","Date Submitted":"09/26/2007 12:00 UTC","Source":"MUFON","Weather Factors":"None","Region":"Louisiana","Log Number":"US-09272007-0004","Disposition":"Hoax","Viewing Distance":"101-500 Feet","Date of the Event":"09/26/2007 12:00 UTC","Object Shape":"Cigar, Circle, Cylinder, Disc, Egg, Fireball, Flash, Oval, Sphere, Square, Rectagular, Star-like, Teardrop, Triangle"}