{"City":"New York","Latitude":"40.723833","Date Submitted":"09/25/2007 10:15 UTC","Summary":"Two of them.First star shaped light then red light followed","Object Features":"Undisclosed","Date of the Event":"09/25/2007 10:15 UTC","Country":"United States","Log Number":"US-09272007-0008","Object Shape":"Circle, Star-like, Triangle","Source":"MUFON","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=40.723833,+-73.999943(8014)&iwloc=A&hl=en\"> mufon case (8014) map </A>","Longitude":"-73.999943","trends":["There have been 579 other sightings in New York","There were 2 other sightings in New York on or around September 25th 2007"],"Tags":"City","Case Number":"8014","Object Flight Path":"Undisclosed","Region":"New York","files":["/var/www/straped/mufon/html2text/8014.html.txt","/var/www/straped/mufon/org/8014.html"],"Weather Factors":"Unknown","divs":["Sighting DetailsAt about ten 15 pm I had just parked my car and was going to go inside my house. I always seem to look up at the sky day or night and I do live near an airport. Ive seen many planes jets helicopters coming in for a landing. The reason I am saying this is because I live near an airport. A passenger jet was above me to the left at about 11:oclock,I was looking toward the east when I saw the passenger jet going by over head heading east. Then I noticed a very bright light arcing in from the east heading west and it looked strange as it was getting closer to me. It was not traveling as fast as a passenger jet would coming in for a landing. In fact it was moving quite slow and when it got closer and passed overhead I could see three lights that were not very bright on what I assume would be the bottom of it. Two in the front and one in the back. There were no blinking lights like on any passenger jet or private plane or helicopter nor was there any noise. It was higher up than the passenger jet that had just went by. I was watching the object as it headed west then from the same arcing motion from straight up came a dark red round object. It was completly round and the way it moved was pretty scary. It was like it swooped down and headed straight for the first object and caught up to it quite rapidly. It was moving at least ten times as fast as first object. NO NOISE. NO FREAKIN NOISE!!!!! Not a whir a hum or anything from either object. When I first notced the Bright white object it looked like a star until I saw it moving and like I said there were no blinking lights. When I saw the three lights on the belly of the object It looked like a triangle and I immediatley thought of the craft that has been spotted around the world that has a shape just like a triangle. When I saw the red light behind it thats what convinced me it was not a normal thing to see. I just stood there staring up at this occurence in disbelief and felt very lucky to have seen this. I saw the red object catch up to the first object and they seemed to either be very close or maybe red object went inside white object. I lost sight of them due to tree line and I stood out there for awhile thinking about what I had just witnessed. Its not the first time I saw something but it was clearly the best detailed and visually close enough to know what I think I was looking at. While the passenger jet that I first saw was passing east the first object headin west was coming down so I saw the jet and the object at the same time. I hope I get to see this again."]}